{"summary":"Paradigm&#x27;s expansion could open up Wall Street to decentralized options and futures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126894\/crypto-derivatives-paradigm-valuation-funding-round","publishDate":"2021-12-09T08:00:17","id":1549,"type":null,"title":"Crypto derivatives platform Paradigm nabs $400 million valuation in funding round","category":["CAPITAL MARKETS"],"content":["Paradigm — a player in the crypto derivatives market — is the latest digital asset trading firm to tap into the wave of capital pouring into the market.","On Thursday, the firm announced the close of a funding round that values it at $400 million.","Launched in 2019, <a href=\"https:\/\/www.paradigm.co\" data-v-f87c67ca=\"\">Paradigm<\/a> provides a platform for dealers and market makers to execute large trades in options and futures to settle across a wide-range of venues. As per Thursday's announcement, the firm has raised $35 million in a funding round led by crypto trading giants Jump Capital and Alameda Research.","In total, 25 investors participated in the Series A, including clients such as GSR Markets, Genesis Trading and QCP Capital. A number of Wall Street firms also joined Paradigm's cap table, including Fidelity Digital Assets, IMC, and Optiver.&nbsp;","Paradigm isn't alone. Financial services firms and exchanges like FalconX and Gemini have nabbed hefty valuations in recent fundraises. NFT firm RECUR clinched a $333 million valuation in its Series A.","The company, which facilitates $10 billion in volume traded per month, captures 30% of the crypto options market, according to chief executive officer Anand Gomes.&nbsp;Paradigm isn't an exchange like a Deribit where buyers and sellers are centrally matched. Rather, trading firms leverage Paradigm to structure complex derivatives trades and then execute them bilaterally with other traders in the network. Their RFQ product has evolved to be more of an order book.","The former gas and oil credit strategist Gomes told The Block that the company's growth has been buoyed by broader growth in crypto derivatives.&nbsp;","Aggregate open interest in bitcoin options has surged from just over $1 billion in July 2020 — when Paradigm announced its last round — to $10.88 billion as of December 6.&nbsp;","\"Fundamentally we have undergone a massive transformation over the last 12 months,\" Gomes said. \"Our primary role is to serve as a liquidity access point for crypto derivatives. We solved this problem for options first but our ambition has always been to scale this solution to other assets and venues.\"","Indeed, Paradigm now has its sights set on the decentralized finance world. Traders who want to make a complex derivatives trade will soon be able to have such a trade settle across centralized venues like CME Group and decentralized venues. Paradigm is still in the process of integrating DeFi options protocols. The could open up its institutional users to the fast-growing yet nascent market.&nbsp;","\"We want to say traders, tell us what you want to trade, how you want to trade it, who you want to trade it with and where you want to settle,\" Gomes added.","As for the fresh capital injection, it will allow the firm to keep the lights on while Paradigm allows users to use the platform for free.&nbsp;","\"We are focused on establishing a robust network before monetizing,\" Gomes said. \"This funding round allows us to continue building out our network of institutional traders, CeFi exchanges, and DeFi protocols, while also enhancing our 24\/7 customer support, and expanding upon our current product offerings to better accommodate the needs of our clients.\"","Other investors in the round include Goldentree Asset Management, Amber Group, and Akuna Capital.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"Goldentree Asset Management","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gomes","content":"PERSON"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Optiver","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Akuna Capital","content":"ORGANIZATION"},{"type":"$333 million","content":"MONEY"},{"type":"July 2020","content":"DATE"},{"type":"December 6","content":"DATE"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Anand Gomes","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$10.88 billion","content":"MONEY"}],"hashtag":["DERIVATIVES","PARADIGM"],"authors":["Frank Chaparro","The Block"]}