{"summary":"The investment firm has sold the crypto exchange's stock on all but two trading days this month.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/12\/13\/ark-invest-sells-coinbase-shares-for-third-straight-day\/","publishDate":"2023-12-13T10:13:00","id":15493,"type":null,"title":"ARK Invest Sells Coinbase Shares for Third Straight Day","category":["Finance"],"content":["Cathie Wood’s investment management firm, ARK Invest, sold Coinbase (COIN) stock for a third straight day as the shares held steady within 5% of the year’s high.","The firm offloaded a total of 82,255 shares worth about $11.5 million at Tuesday’s closing price from the ARK Innovation (ARKK), ARK Next Generation Internet (ARKW) and ARK Fintech Innovation (ARKF) exchange-traded funds (ETF). It has reduced its stake in the crypto exchange on all but two trading days this month.","Coinbase stock has been surging as bitcoin (BTC) climbs. The largest cryptocurrency by market cap has added about 150% this year, while Coinbase has almost quadrupled.","St. Petersburg, FL-based ARK Invest’s policy is to keep the maximum weight of any given company in its holding to 10%. The recent rally in COIN stock, which last month touched highs not seen since April 2022, means its weighting in the three ETFs remains in excess of that level even after recent divestments that include Friday’s $49 million sale, the largest since July.","This month, ARK Invest has sold more than $120 million of Coinbase shares, based on closing prices.","Edited by Parikshit Mishra.","\n","\n","\n"],"entity":[{"type":"$49 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"April 2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$11.5 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"FL","content":"LOCATION"},{"type":"St. Petersburg","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"150%","content":"PERCENT"},{"type":"$120 million","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":["Cathie Wood","ARK Invest","Coinbase"],"authors":["Sheldon Reback"]}