{"summary":"Prime Minister Fumio Kishida’s government has been considering submissions on how best to encourage the industry's development, which it sees as a pillar of economic reform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/25\/japans-cabinet-proposes-scrapping-corporate-tax-on-unrealized-crypto-gains\/","publishDate":"2023-12-25T11:01:57","id":15490,"type":null,"title":"Japan's Cabinet Proposes Scrapping Corporate Tax on Unrealized Crypto Gains","category":["Policy"],"content":["The Japanese cabinet approved a proposal by the ruling Liberal Democratic party to end taxation of unrealized cryptocurrency gains in a move that is likely to boost the development of the country’s Web3 industry, CoinDesk Japan reported.","The proposal, which needs to be debated in the Diet, Japan’s parliament, will end corporate taxation on the difference between the market and book values of crypto assets issued by other companies. It it became law, the Dec. 22 approval would end a discrepancy in the treatment of third-party issued assets and those issued by holders, who are not taxed on mark-to-market values. The tax has hindered Web3 businesses in the country, CoinDesk Japan said.","Prime Minister Fumio Kishida’s government has been considering submissions from industry associations such as the Japan Crypto Asset Business Association (JCBA) and Japan Blockchain Association on how best to encourage the industry's development, which it sees as a pillar of economic reform. Having politicians drive policy development is a departure from traditional practice in a country where that role is usually taken by the bureaucracy.","Web3 companies have been moving overseas because they became liable for tax even before making profits from their activities, Gaku Saito, chairman of the JCBA's tax review committee, told CoinDesk Japan in an interview. Companies were having to pay tax on unrealized gains, forcing them to sell their assets and stifling business development.","Read more: Japan Signals More Web3 Promotion Policies Are Coming","\n"],"entity":[{"type":"Dec. 22","content":"DATE"},{"type":"Japan Crypto Asset Business Association (JCBA) and Japan Blockchain Association","content":"ORGANIZATION"},{"type":"CoinDesk Japan","content":"LOCATION"},{"type":"Fumio Kishida","content":"PERSON"},{"type":"CoinDesk Japan","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Gaku Saito","content":"PERSON"},{"type":"JCBA","content":"ORGANIZATION"}],"hashtag":["Japan","taxation","Policy","Regulation","Web3"],"authors":["Sheldon Reback"]}