{"summary":"The cryptocurrency underperformed this week as an economic safe haven. But bitcoiners are taking a longer term view.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/17\/what-is-bitcoin-meant-to-hedge\/","publishDate":"2024-04-17T18:36:53","id":15498,"type":null,"title":"What Is Bitcoin Meant to Hedge?","category":["Consensus Magazine"],"content":["Uh oh, it’s starting again: People are again debating whether bitcoin (BTC) is actually a hedge.","The conversations began on Saturday, after the cryptocurrency tanked nearly 10% — from around $70,000 to below $62,000 — following Iran’s failed missile attack on Gaza. The move inspired a few columns on Monday, including insightful ones from Fortune’s Jeff John Roberts, which put it in context of gold’s 17% rally, and Blockwork’s Casey Wagner, who looked at how gas prices tend to move during crises in the Middle East.","Read more from CoinDesk’s “Future of Bitcoin” package. This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Yes, it’s true that there were more buyers than sellers of oil and gold following the attack and more sellers than buyers of bitcoin — thus the former rose in value while the later dropped. But I’ve always been of the view that intraday price movements for an asset as volatile as bitcoin say very little. The bad news is: gold is continuing to rise (like it did after the collapse of Lehman Brothers), while after a little pop on Sunday, bitcoin has been sagging lower and lower this week into the low $60K range.","While the looming threat of WWIII may be putting a damper on bitcoin, it’s likely inklings emanating out from the Federal Reserve that it may hold interest rates higher for longer than anticipated because the economy is doing well that the market is responding to. Still, to raise the question of whether bitcoin is really a hedge — when in recent years it has clearly been behaving more and more like a tech stock — seems like the wrong thing to ask.","Bitcoin was largely uncorrelated with the S&P 500 before the pandemic, so clearly it can act as a countercyclical asset. The question is: What changed from then to now? Also, what exactly is bitcoin meant to hedge? Stocks? Inflation? U.S. Treasuries? Political turmoil? Is bitcoin meant to be an economic safe haven for all occasions?","There are likely a number of factors at play, including the increasing amount of bitcoin in circulation, number of holders and whales. But in some sense, the answer is clear enough, bitcoin is institutionalized. As Barron’s reported around the time of the launch of spot bitcoin ETFs in January:","“Bitcoin’s volatility has still steadily declined since its launch more than a decade ago. Volatility — as measured by the 100-day average of daily price swings in percentage points — hasn’t exceeded 4.5% since the introduction of bitcoin futures, which track the price of the spot token, according to Bauer. Since the 2021 launch of the ProShares Bitcoin Strategy ETF — a bitcoin futures fund — that metric hasn’t exceeded 3.5%. Over the past year, volatility has stayed below 2.6%.”","Now, volatility isn’t everything (and bitcoin remains quite a bit more volatile than traditional equities), but it is a defining feature of the asset — at least as it was known to be. Did people think bitcoin would remain volatile forever? Austin Campbell, assistant professor at Columbia Business School, told CoinDesk recently, “Any market growing from new to mainstream sees volatility due to small idiosyncratic events decrease as liquidity and scale increase.”","See also: What Bitcoiners Are Saying About the Upcoming Bitcoin Halving","The release of spot bitcoin ETFs, some of which have been the fastest growing financial products this year, may accelerate this trend. As the barriers to entry drop, and bitcoin becomes more mainstream, bitcoin’s correlation with stocks could tighten. The same people and fund managers now buying bitcoin, buy the S&P — the investor psychologies are merging.","In fact, the whole theory of “hyperbitcoinization” rests on the idea that as bitcoin adoption increases, its price volatility would dissipate so it could actually be a viable means of exchange. The trouble is this idea was predicated on the idea that as a widespread, circular bitcoin economy grew, the fiat system would plummet. Said differently, bitcoin was supposed to become less volatile and more uncorrelated. That was bitcoin’s hedge.","This may stem from one of the foundational myths of bitcoin, that it is “digital gold.” It’s a flawed metaphor though; good in the sense that an association with gold signaled that BTC could have value but bad in setting up the wrong expectations at a time before anyone really knew how bitcoin would behave.","That digital gold became the go-to description is likely why we have a mishmash of ideas about bitcoin today; it’s a hedge, a store-of-value, a means of payment, a beta trade, a bet against fiat and, increasingly, a development platform. Everyone wants bitcoin to be everything all at once when in reality, over the past decade and half, it’s basically done just one thing really well: sopping up excess liquidity.","To a large degree, we have no idea how bitcoin will perform if things hit the fan. As S&P analysts wrote in a 2023 report about macroeconomic impacts on crypto: “Unprecedented levels of monetary easing by central banks across the world since 2008\/09 have increased money supply to record levels,” suggesting bitcoin grew because the money supply did.","So maybe bitcoin will follow the pack for now, growing when the overall economy does, dropping when it drops. But the hedge bitcoiners are actually waiting for is more like a pop.","Edited by Bradley Keoun."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Austin Campbell","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"4.5%","content":"PERCENT"},{"type":"Bauer","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Casey Wagner","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Gaza","content":"LOCATION"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"Jeff John Roberts","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"Middle East","content":"LOCATION"},{"type":"Sunday","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"3.5%","content":"PERCENT"},{"type":"2.6%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"Lehman Brothers)","content":"ORGANIZATION"},{"type":"$60K","content":"MONEY"},{"type":"$62,000","content":"MONEY"},{"type":"Iran","content":"LOCATION"},{"type":"2008\/09","content":"DATE"}],"hashtag":["Opinion","The Node","Newsletters","Bitcoin Halving","Inflation","inflation hedge"],"authors":["Daniel Kuhn"]}