{"summary":"MicroStrategy is in the early stages of developing what could become commercial bitcoin data products.\nExecs from the firm described the process — for which it is currently hiring — during an investor day call this week.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85310\/microstrategy-bitcoin-data-products","publishDate":"2020-11-20T12:34:34","id":1549,"type":null,"title":"MicroStrategy execs say the publicly traded firm is exploring new bitcoin data products","category":["Bitcoin"],"content":["MicroStrategy is assembling a team to explore data and analytics products for bitcoin.","The disclosure was made during a virtual investor day event hosted by the publicly traded firm, which has become something of a darling within the cryptocurrency space for its embrace of bitcoin. MicroStrategy <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74534\/microstrategy-becomes-first-listed-company-to-buy-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">drove headlines<\/a> this summer when it became the first publicly-traded company to buy bitcoin as part of its capital allocation strategy.","<a href=\"https:\/\/microstrategy.zoom.us\/rec\/play\/BjLVTVJb9q2u6LpCGgvNCorxhTAuAMOXJi4EkOe3ReM8AIHl1j95ZZQLPqGTcua5RYw5HEf6tGbLUu5L.PL_RyR4rr0b-UGut\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">During his November 16 remarks<\/a>, CEO Michael Saylor — who previously spoke with The Block about his and his firm’s perspective on bitcoin as a capital asset — spoke about the potential of building bitcoin-focused offerings into MicroStrategy’s core intelligence product suite.","“We’re gonna take Hyper.Now and Intel.Now and that entire out-of-the-box, multi-tenet SaaS offering and think about ways to deliver business intelligence that’s of interest to the bitcoin community and maybe to the greater crypto community as this business evolves,” he said.","To be sure, Saylor made it clear that MicroStrategy doesn’t have a bitcoin-focused product waiting in the wings to be rolled out. But he made it clear that the firm sees a future in this area.","“We don’t have any one thing that we’re sure makes sense to commercialize yet,” Saylor remarked. “But we think there’s an entire exploding universe of intelligence opportunities all wrapped around this unique bitcoin intelligence coming off the blockchain. And we’ll explore it all and look for efficient, artful ways to integrate it into our existing business and deploy it.”","Later on the call, MicroStrategy chief technology officer Tim Lang said that the company is assembling a “scrum team” it has committed to look at potential offerings. “It’s a nearly-formed team that we’re putting in place for this,” he explained.","He went on to explain that this exploratory process isn’t limited to potential products — rather, it will also include experimentation with the integration of the tech into MicroStrategy’s platform itself.","“The ability to kind of leverage some of the techniques that bitcoin has as well as itself could actually be key to some of the future modernizations of our platform,” said Lang. “So, there’s the immediate pieces we see, in terms of analytics on bitcoin. But there’s also how we could potentially leverage the chain at the core of the platform, and we’re evaluating those pieces.”"],"hashtag":["BITCOIN","MICROSTRATEGY"]}