{"summary":"This week, Coinbase launched its new Base blockchain while DeGods NFTs are way up after the project announced its upcoming Season III series. Plus, Microsoft and Aptos are teaming up to launch new blockchain AI tools.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/08\/12\/base-is-here-but-some-of-its-projects-raise-red-flags\/","publishDate":"2023-08-12T13:05:00","id":15495,"type":null,"title":"Base Is Here, But Some of Its Projects Raise Red Flags","category":["Web3"],"content":["You’re reading The Airdrop, our weekly newsletter where we discuss the biggest stories across Web3. Sign up here to get it in your inbox every Friday.","On God: Popular NFT collection DeGods saw its sales soar after sharing plans and teasing artwork for its 20,000-edition Season III collection. Within 24 hours of the announcement, trading volume increased nearly 200% while its floor price decreased. Notably, female-presenting NFTs will be added to the collection, which are swappable for male-presenting ones. To avoid dilution, each individual DeGod NFT will have four pieces of generative art associated with it.","Hot chain Summer: Coinbase, the largest crypto exchange in the U.S., officially launched its Base blockchain after weeks of teasing the initiative. The new blockchain is a layer 2 built on top of Ethereum using stack software from another popular layer 2 network, Optimism, and already boasts over 100 compatible decentralized apps (dapps) within its ecosystem.","Aptitude test: Layer 1 blockchain Aptos, started by former Facebook employees to revive the scrapped Diem project, announced a partnership with Microsoft to expand its tools using Microsoft’s artificial intelligence technology. The tools combining blockchain technology and AI will be used to test and develop new offerings, including a new Aptos Assistant AI chatbot powered by OpenAI. In addition, the two companies have agreed to explore blockchain-based financial-service products, including asset tokenization, payment options and central bank digital currencies.","\"Kingdom of the Laughing Man” by Yue Minjun","Who: Contemporary artist Yue Minjun","What: Renowned Chinese artist Yue Minjun, a pioneer of the art style called “Cynical Realism,” has released his first NFT collection. The first installment, “Boundless,” is comprised of a series of 999 generative artworks inspired by his iconic wide smile self-portraits. According to a press release, “each piece of art in ‘Boundless’ sees the artist reinterpreting his signature self-portrait work through the prism of trends within technology, appropriating the crypto-centric PFP [profile picture] to create a unique Web3-based series for digital art collectors.” Upcoming drops will feature 3D animated art and an immersive metaverse experience.","Where: The series was listed for sale on LiveArt, in partnership with iv gallery, on Tuesday, and sold out within two hours, generating $1 million in primary sales. The NFTs are now available on secondary marketplaces like OpenSea.","Sign of the Grimes: Musician Grimes said she made more money from selling her NFTs than she has from making music.","‘Apprentice’ for crypto: A new competition reality TV show called “The Next Crypto Gem” will pit 16 crypto enthusiasts against one another for a chance to win a six-figure prize package.","Let’s ride: Holoride, an Audi-backed VR startup for in-vehicle entertainment, is launching an NFT staking program in partnership with XOXNO, the leading marketplace on MultiversX.","Virtual blue suede shoes: Elvis Presley avatars have come to metaverse platform The Sandbox.","4 Actual, Practical Use Cases for Blockchain and AI","There has been so much froth around artificial intelligence (AI) this year, it’s hard to ascertain what’s hype and what’s real. It feels similar to the early days of blockchain, when people would just declare “blockchain could solve this!” without any actual details on how.","But there are actual use cases for both technologies, too. We spoke to data experts and Web3 insiders and landed on four real ways AI and crypto could successfully converge to create consumer-friendly solutions for verification, ownership and creativity.","Edited by Toby Leah Bochan."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Toby Leah Bochan","content":"PERSON"},{"type":"200%","content":"PERCENT"},{"type":"Aptos","content":"LOCATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Audi","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Grimes","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Yue Minjun","content":"PERSON"},{"type":"Yue Minjun","content":"LOCATION"}],"hashtag":["The Airdrop","Newsletters","NFTs","Web3","Polygon","Ethereum","Degods","y00ts","Coinbase","Base","Microsoft","Aptos","Aptos Labs","AI","Art"],"authors":["Rosie Perper"]}