{"summary":"A new metric co-developed by the payments giant says only 10% of stablecoin transactions in April were “real” or “organic.” But the methodology appears to leave out some key use cases.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/07\/what-visas-organic-stablecoin-report-misses\/","publishDate":"2024-05-07T17:14:35","id":15496,"type":null,"title":"What Visa’s ‘Organic’ Stablecoin Report Misses","category":["Consensus Magazine"],"content":["What do we talk about when we talk about bots in crypto? Although crypto advocates often think about the suite of these peer-to-peer blockchain-based tools and currencies as advancing human freedom and financial liberty, for years it’s been known that only a small percentage of crypto transactions actually happen between everyday people.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","This was backed up by a recent report co-authored by Visa and data firm Allium Labs into stablecoin use, which found that less than 10% of stablecoin transactions – or just $149 billion the $2.2 trillion total trading volume — in April were “made by real people.” The firms created a new metric measuring “organic payments activity” by filtering out bots and large-scale traders (likely meaning entities like exchanges).","The news certainly seems to poke a hole in the idea that stablecoins are on a rollicking adoption curve, with uptake happening across the globe — particularly in developing economies where users are turning to dollar-backed assets like Tether’s USDT and Circle’s USDC to protect themselves from inflation and onerous capital controls.","Indeed, stablecoins have emerged as one of the clear areas of crypto that seem to have both a clear product-market fit and real-life users. Tether, the largest stablecoin issuer, brought in an enviable $4.5 billion in profit in the first financial quarter of the year. This is just part of the reason why everyone and their mother seems to want in the game, from established financial institutions (including Visa!) to blockchain upstarts.","So what’s the story here? Are stablecoins another example of crypto overselling itself — overpromising on the idea of financial revolution and under-delivering — like the many so-called “Zombie Projects” that have recently come into view?","To some extent, even if bots are driving more than 90% of stablecoin volumes, the numbers representing “organic use” remain impressive: around 25 million unique monthly users exchanging almost $150 billion in value in April alone. That may pale in comparison to capital sloshing around on other fintech platforms, but ain’t nothing to sneeze at.","But more importantly, it’s worth asking why exactly Visa is so concerned with bot trading — and what it even considers to be a valid use. According to the report’s methodology, the “inorganic user filter” counted only “transactions that have been sent by an account that has initiated less than 1000 stablecoin transactions and $10m in transfer volume.”","See also: S&P's Stablecoin Report Is a Vote of Confidence for Crypto | Opinion","“Long story short, I think there's significant problems with what Visa is trying to do,” Austin Campbell, adjunct professor at Columbia Business School and former fund manager for Paxos’ BUSD, told CoinDesk in an interview. “Visa is a payments company. They're probably trying to get a measure of crypto that to them looks like peer-to-peer or small merchant payments.”","“This means trying to exclude all of trading, so not just automated trading,” he said. Trading, it shouldn’t have to be said, is a pretty big part of why people use crypto. Additionally, as far as Campbell can tell, Visa’s report cut out wallet addresses for centralized exchanges like Binance and Coinbase, which both hold stablecoins used in services like prepaid cards, “some of which are literally Visas.”","None of this is to suggest that Visa is misrepresenting the data, because, say, as a payments company, Visa’s main business line could be disrupted by stablecoin adoption. Nor is it to say that having an accurate read of actual peer-to-peer stablecoin use isn’t valuable info.","But to a large degree, “the narrowness of Visa's view is more reflective of Visa than stablecoins,” Campbell said.","Edited by Benjamin Schiller."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Austin Campbell","content":"PERSON"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Campbell","content":"ORGANIZATION"},{"type":"$2.2 trillion","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$150 billion","content":"MONEY"},{"type":"$4.5 billion","content":"MONEY"},{"type":"$149 billion","content":"MONEY"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$10m","content":"MONEY"}],"hashtag":["Opinion","The Node","Newsletters","Stablecoin","Tether","Visa","Bots"],"authors":["Daniel Kuhn"]}