{"summary":"Investment platform Republic is using “Security NFTs” to represent the investments fans make in artists’ songs and albums.\nRepublic is using the decentralized peer-to-peer loan platform Opulous in its ecosystem.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119748\/republic-is-offering-security-nfts","publishDate":"2021-10-08T16:24:08","id":155,"type":null,"title":"Republic unveils &#x27;security NFTs&#x27; for investing in music","category":["NFTs"],"content":["<span data-v-f87c67ca=\"\">Investment platform <\/span><a href=\"https:\/\/republic.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Republic<\/span><\/a><span data-v-f87c67ca=\"\"> is now offering what it calls “Security NFTs,” aimed at giving music fans the opportunity to share the rights to artists’ royalties.<\/span>","<span data-v-f87c67ca=\"\">These so-called “S-NFTs” represent fans’ investments in artists’ songs and albums, and the subsequent returns those music assets generate through plays, streams and licensing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of Republic’s main aims is to give artists back control of their music while also involving fans. This kind of investment generally involves buying music rights through “membership units” of the LLC that owns a song or album, the company explains on its website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The same membership units that may typically be represented by an LLC Membership Certificate will novelly be represented by the S-NFT instead,” Republic’s Chief Strategy Officer Pialy Aditya told The Block.<\/span>","<span data-v-f87c67ca=\"\">Initially, fans will be able to invest in a new song called <em data-v-f87c67ca=\"\">Mona Lisa<\/em> by rapper Lil Pump featuring Soulja Boy, as well as an unspecified track from electronic artist KSHMR. Artists could eventually offer tickets, merchandise and “non-security” NFT drops to investors as well via Republic.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Republic is using the decentralized peer-to-peer loan platform <\/span><a href=\"https:\/\/opulous.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Opulous<\/span><\/a><span data-v-f87c67ca=\"\"> for its music-related investments. Built on the Algorand blockchain, Opulous focuses on DeFi loans for musicians and NFTs that allow music fans to have a share in artists’ music copyright.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Republic is offering S-NFTs under the U.S. <\/span><a href=\"https:\/\/www.sec.gov\/smallbusiness\/exemptofferings\/regcrowdfunding\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Regulation Crowdfunding<\/span><\/a><span data-v-f87c67ca=\"\"> (CF).&nbsp;<\/span><span data-v-f87c67ca=\"\">“Republic is a registered crowdfunding portal which allows it to facilitate offerings under Reg CF,” Aditya said. “Like all Reg CF security offerings, these offerings are not approved nor qualified by the SEC.”<\/span>"],"hashtag":[]}