{"summary":"Yield Guild Games invested in competitor Merit Circle last year, but a DAO proposal is seeking to remove it and refund its $175,000 seed investment.\nMembers are angry about the “lack of value” YGG has brought to the DAO.\nThe incident shines a light on the intricacies of investing in a DAO.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148428\/merit-circle-yield-guild-games-dao-dispute","publishDate":"2022-05-24T12:43:49","id":1550,"type":null,"title":"Merit Circle DAO proposal seeks to ‘trim the fat’ by booting early-stage investor","category":["Gaming and Metaverse"],"content":["<span data-v-f87c67ca=\"\">Two big names in the play-to-earn gaming scene are scrambling to come to a compromise after a member of Merit Circle’s decentralized autonomous organization (DAO) proposed ousting Yield Guild Games (YGG) as an investor last week.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/gov.meritcircle.io\/t\/merit-circle-a-new-era\/469\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposal<\/span><\/a><span data-v-f87c67ca=\"\"> came following a lackluster response to a request for investors to outline their intentions “past and future” towards the DAO.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Arguably competitors in the space, both Merit Circle (MC) and YGG are play-to-earn-focused DAOs that provide scholarship opportunities for players, as well as making investments in online play-to-earn games.<\/span>","<span data-v-f87c67ca=\"\">The spat hints at a growing number of potentially tricky issues investors need to take into account when getting involved with a DAO, as participants seek to find backers that can prove their value beyond merely putting up cash.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This month marks the start of a 36-month vesting period for seed tokens given to angel investors and venture capital funds in MC’s DAO, representing 14.06% of the total token supply.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Philippines-based YGG and its co-founder Gabby Dizon invested a total of 175,000 USDC in MC in late September 2021, in what portfolio operations manager Kazuo described as “a high risk, early-stage commitment.” This gave them just under 5.5 million MC tokens overall, which were priced at $0.032 each.<\/span>","The proposal seeks to reclaim those tokens and refund YGG its initial investment.","<span data-v-f87c67ca=\"\">While outlining its contributions to the DAO – the post that sparked this debate – YGG said that it had introduced MC to other early-stage investors, co-invested in projects such as Big Time, Cyball and Fancy Birds, had offered to lend out its own assets if needed and orchestrated a media push.<\/span>","<span data-v-f87c67ca=\"\">However, these claims were attacked by DAO member HoneyBarrel. Unlike other investors, who were able to point to specific examples of connections they had facilitated, YGG didn’t make any mention of which new investors it had brought in.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">HoneyBarrel claimed YGG’s outreach consisted of just two articles in Coindesk and Yahoo Finance, one mention on its discord server and five tweets, four of which were posted on the same day from YGG and Dizon’s social media accounts. And despite offers to lend out assets, this never actually happened.&nbsp;<\/span>","A spokesperson for YGG didn't immediately respond to a request for comment.&nbsp;","<span data-v-f87c67ca=\"\">The proposal to expel YGG appears to have support; DAO members are largely disappointed with YGG's contributions. But even some of those that agree with the sentiment behind the proposal are urging caution on the grounds that ousting YGG could have profound implications for the reputation of the DAO, as well as venture capital attitudes towards investing in DAOs in the future.<\/span>","<span data-v-f87c67ca=\"\">“Setting a precedent like that for other DAOs can come back to hurt MC with its own investments in the future,” said BambinoValue in response to the proposal. “This is a dangerous precedent full stop.”<\/span>","<span data-v-f87c67ca=\"\">In a post on MC's governance forum, MC's core team said it was in touch with YGG, and had been discussing options internally, but the ultimate decision on its fate would lie with a vote within the DAO – a measure it said it didn’t want to rush. It aims to<\/span><span data-v-f87c67ca=\"\"> proceed to the voting stage “in the near future.” A spokesperson for MC declined to comment further when contacted by The Block.<\/span>","<span data-v-f87c67ca=\"\">The affair may prove a test case for the power of DAOs and whether there are limits to their ability to enact major decisions. At this stage, the terms of <\/span><span data-v-f87c67ca=\"\">YGG’s agreement with MC – and whether it would have legal recourse – isn’t clear.<\/span>","<span data-v-f87c67ca=\"\">Ioana Surpateanu, an advisor for Swash, Poolz Finance and Cryptowalkers, as well as an executive board member at the Multichain Asset Managers Association, told The Block however that removing YGG as an investor may not be as damaging to its reputation as some DAO members fear. <\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">I think this is somewhat targeted at YGG because there were other seed investors mentioned and their contribution was considered to be better,” she said. <\/span><span data-v-f87c67ca=\"\">“I guess the test will be the vote. <\/span><span data-v-f87c67ca=\"\">Things are in motion in the interim and there is this quest for a compromise, but we don't know for sure what the community wants until it actually goes through a vote.”<\/span>"],"hashtag":[]}