{"summary":"The term “wallet” is used to describe hardware or software that holds cryptocurrencies.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/custodial-wallets-vs-non-custodial-crypto-wallets\/","publishDate":"2022-03-09T15:50:39","id":15509,"type":null,"title":"Custodial Wallets vs. Non-Custodial Crypto Wallets","category":["Learn"],"content":["Custodial and non-custodial crypto wallets allow you to hold and transfer digital assets by connecting to and interacting with a particular blockchain network. For instance, a software wallet like MetaMask can be used to connect and interface with the Ethereum blockchain, whereas Solflare is specifically designed to connect to Solana’s blockchain.","There are two different types of crypto wallets:","It’s also important to note all crypto wallets consist of two important components:","A public key is effectively the address of your crypto wallet. This is a public-facing data point like your home address and is used to receive inbound cryptocurrencies and encrypt outbound transaction data. When depositing crypto into a wallet, you simply input the public key as the deposit address. This is similar to using your handle in a service such as Venmo or CashApp.","A private key is like the key to your front door and is used to facilitate the transfer of cryptocurrencies out of a wallet and prove ownership over any funds held inside. Just like you wouldn’t want a stranger having your front door key, you don’t want anyone to possess your private key. This is because any outside person who gains access to a wallet’s private key can effectively take control of the assets inside the wallet and move the funds elsewhere. And unlike traditional finance, there’s no way of reversing the transaction without rolling back the blockchain – something that very rarely happens in the industry.","Read more: Your First Crypto Wallet: How to Use It and Why You Need One","The two keys are used together in order to send cryptocurrency from one wallet to another. In order to send coins through the blockchain network, a user must first enter the public key and then confirm the transaction by entering the private key. Upon correctly entering both the public and private key, the wallet then broadcasts the transaction to the network and the recipient’s public address is attached to the coins, completing the transfer.","Cryptocurrency is essentially a bearer asset, as the person who holds the private keys to a wallet effectively controls (owns) the coins inside.","So why is all this important? Well, understanding the difference between custodial wallets and non-custodial wallets means understanding who controls the private keys.","Custodial wallets are wallet services offered by a centralized business such as a cryptocurrency exchange. Custodial wallets have certain benefits, such as less user responsibility regarding private key management. When a user outsources wallet custody to a business, they are essentially outsourcing their private keys to that institution. The individual user is not responsible for protecting the private key to the wallet and therefore places trust in the business keeping the private key safe.","When a user wishes to send coins out of a custodial wallet, they simply log in to the platform with a username and password, input the public key of the location to where they wish to send coins, and the business is responsible for inputting the private key to complete the transaction.","This creates an extremely simple solution for the user but also creates an additional layer of risk. There have been many exchanges that have been hacked, including Mt. Gox, QuadrigaCX, BTC-e and Bitstamp.","In recent days, with the development of the conflict in Ukraine, certain governments have prevented custodial wallets from completing transactions for citizens in certain areas. The Canadian government even recently attempted to freeze the assets of a group of supporters funding the Canadian trucker protest.","Non-custodial wallets do not have this problem. Non-custodial wallets do not require the outsourcing of trust to an institution, so no institution can refuse to complete transactions.","These transactions are essentially censorship-resistant, as the user controls the private key. However, non-custodial wallets are not as easy to use as custodial wallets. When using a non-custodial wallet, users must remember that if they lose the private key, the coins in the wallet are essentially lost forever. Misplacing private keys can be a costly mistake. Users must develop a set of practices to maximize security and protect private keys in order to enjoy the full benefits of a non-custodial wallet.","Read more: 4 Ways to Stay Safe in Crypto","Non-custodial wallets are a great way to ensure user assets are not subject to censorship or confiscation, however, in exchange for this freedom, a tremendous amount of responsibility is placed on the holder of the private keys.","Ultimately, there is no right or wrong way to store your assets. In crypto, there’s a popular saying, “not your keys, not your crypto.” This is true, as the holder of private keys essentially controls the coins in a wallet, but not all people are afraid of trusting an institution with private key management, nor do they fear censorship.","A beautiful feature of cryptocurrency is that each user is free to decide how to hold crypto for themselves."],"entity":[{"type":"BTC","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Technology","Beginner","Learn"],"authors":["Jackson Wood"]}