{"summary":"Wrapped assets introduced a wave of DeFi innovation that cross-chain protocols are looking to take forward.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/06\/native-token-transfers-are-the-next-evolution-of-interoperability\/","publishDate":"2024-03-06T21:06:06","id":15501,"type":null,"title":"Native Token Transfers Are the Next Evolution of Interoperability","category":["Consensus Magazine"],"content":["Interoperability has long been one of the biggest challenges within the crypto space.","Nikhil Suri is the product lead at the Wormhole Foundation, which acts as a steward of the cross-chain messaging platform Wormhole. Prior to that, Nikhil was a software engineer at Jump Crypto, Uber and PayPal.","The ability to perform cross-chain transfers is critical to building a multi-chain future. To this end, “wrapped assets” emerged as a way to facilitate transfers between blockchains and have since been the state-of-the-art solution for users and developers.","However, wrapping assets has serious limitations. Interoperability protocols have been hard at work iterating on newer methods to “natively” transfer assets between blockchains to address user and developer concerns. New approaches not only simplify development but also enhance usability, which ultimately creates a more user-friendly DeFi environment.","Creating wrapped assets has historically been developers’ method of choice for bringing assets to new blockchains, growing their user base, and benefiting from unique functionality on different chains. Wrapped assets are tokens that represent another token on a different blockchain, with their value pegged 1:1 to the asset they represent.","Wrapped assets created an entirely new paradigm in decentralized finance (DeFi) by allowing assets to be used on networks where they otherwise would not exist. For example, bitcoin (BTC) can be brought to the Ethereum blockchain by \"wrapping\" it as an ERC-20 token, which enables bitcoin holders to utilize their tokens within Ethereum's DeFi ecosystem.","See also: Uniswap Approves Axelar for Cross-Chain Interoperability | Video","Wrapped assets also enabled protocols to expand to new blockchains with extremely low friction. A project with a token deployed on a single chain could, with the click of a button, expand to any new chain by deploying a standard “wrapped” representation of a token via an interoperability protocol.","However, this low friction is a double-edged sword. Since interoperability protocols deploy wrapped assets on behalf of a project, those assets are non-fungible between different interoperability protocols.","For example, users can transfer ether (ETH) from Ethereum to Arbitrum via the Wormhole Token Bridge, Axelar Token Bridging or the Arbitrum Native Bridge — but each route results in a different, non-fungible asset. This leads to liquidity fragmentation, worse UX and sub-optimal markets.","Another drawback is that tokens do not always behave consistently across chains or retain their advanced functionality, because wrapped assets are owned by the smart contracts that create them. This also interferes with important administrative functions such as upgrades or ownership transfers.","Wrapped assets were a catalyst for the initial expansion of DeFi into a multichain ecosystem and will always have their place. However, as protocols mature and become more complex, there is a pressing need for alternative solutions that harmonize disparate token deployments.","One new idea gaining traction is native token transfers. This involves protocols natively deploying their canonical token to multiple blockchains and using interoperability layers to facilitate on-chain transfers. In comparison to wrapped assets, native token transfers ensure that projects maintain ownership, upgradeability and customizability over their tokens on various blockchains. This prevents liquidity fragmentation and means that tokens can maintain their unique characteristics no matter which chain they are transferred to.","Perhaps the best new approach is native burn-and-mint, which involves burning the native token on the source chain and minting the equivalent native token on the destination chain.","Take the burn-and-mint model is Circle’s Cross-Chain Transfer Protocol (CCTP), which securely facilitates USDC transfers between blockchains via native burning and minting. CCTP has enabled Circle to enhance user-friendliness and reduce the fragmentation of USDC across the crypto ecosystem by migrating away from relying on wrapped USDC representations.","Cross-chain liquidity networks offer another approach to native token transfers. These involve a network of market makers or an exchange protocol that will accept the native token on a source chain and release the native token on the destination chain. For example, a user who wants to transfer ether from Abitrum to Optimism can send it to the liquidity network on Arbitrum, which will route to a market maker that completes the cross-chain transfer to that user’s wallet on Optimism.","A popular example of the liquidity networks model is Wombat exchange, which uses a novel protocol to facilitate cross-chain stablecoin swaps. This model is especially useful for tokens that cannot be minted and burned on demand, such as ether or BTC. At the same time, liquidity networks often have higher fees since a third party is involved, and some routing mechanisms can suffer from MEV.","See also: Is Blockchain's Age of Interoperability Finally on the Horizon?","The native token transfer model decouples the token transfer process from the underlying interoperability protocol, and therefore provides projects with greater flexibility. This enables builders to configure advanced verification and setting threshold requirements and choose between different interoperability protocols.","Native token transfer frameworks are more than a technical evolution; they’re a step toward realizing the full potential of blockchain technology. They can serve as long-term solutions that are able to evolve alongside the protocols that leverage them. With wrapped assets, DeFi protocols were able to quickly expand to new blockchains, but had to worry about lock-in, liquidity fragmentation and ownership and upgradeability for their token contracts.","With native token transfer frameworks, protocols can still benefit from rapid expansion while focusing on what’s important: configurable security and providing themselves with the ability to change over time. As we move forward, interoperability will continue to play an important role in shaping a robust and user-centric DeFi space and provide projects with the sovereignty to define what works best for them."],"entity":[{"type":"Abitrum","content":"LOCATION"},{"type":"Wormhole Foundation","content":"ORGANIZATION"},{"type":"Nikhil","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Blockchain","content":"ORGANIZATION"},{"type":"Uniswap Approves Axelar","content":"ORGANIZATION"},{"type":"Nikhil Suri","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"MEV","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Interoperability","Wrapped Ether (WETH)","Wormhole foundation","Settlement"],"authors":["Nikhil Suri"]}