{"summary":"Whale Shark has bought 210,000 NFTs, including some well-known ones. Here's how he thinks about the market.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/03\/26\/whale-sharks-nft-collectors-playbook\/","publishDate":"2021-03-26T12:03:21","id":15515,"type":null,"title":"Whale Shark's NFT Collectors Playbook","category":["Finance"],"content":["","Thinking about buying some non-fungibles? Maybe you’re even thinking about investing? Maybe you still can’t wrap your brain around the idea of digital art being sold for $69 million, but you’re open-minded, you’ve done your homework and you think the rewards outweigh the risks. And maybe this is money you can afford to lose, so what the hell?","","","[Obligatory disclaimer: Nothing that follows is financial advice. Investing in NFTs – or anything in crypto – is packed with risk and you can lose everything. Proceed with caution.]","","","But if you’re trying to get your bearings in this strange new world of NFTs, you could use a guide. ","","","Enter Whale Shark.","","","“The Whale” – who prefers pseudo-anonymity – is 38, originally from the U.K., lives in Hong Kong and, more importantly, he owns a whopping 210,000 NFTs. It’s possible he owns the most valuable trove of NFTs on the planet, or maybe it’s number two or three. (He’s confident it’s in the top five and happily agrees to independent audits from Nonfungible.com.) ","","","The Whale likes helping newcomers understand NFTs. Sometimes that means working with Paris Hilton, whom he spoke with a day before our call. “I'm just helping onboard them [Paris and her fiancé, Carter Reum] into the deeper areas of NFTs,” says Shark. “She's very excited and very enthusiastic as well as already very knowledgeable about NFTs.” (She had just announced on Twitter she’s “getting ready to go big in NFTs.”) ","","","If you’re not a wealthy celebrity? No problem, The Whale has you covered. He launched an NFT-focused community called, well, “WHALE,” which has a Discord group of 10,000 members, as well as a $WHALE social token with a $265 million diluted market cap. The token is backed by the value of Whale’s vault, and is framed as a way for anyone to invest in NFTs without spending millions. (In a Medium post, Whale outlines how he will donate a chunk of the $Whale holdings to charity.)","","","“I always wanted to be an art collector because I love art,” he says. “I just didn't dare to enter the traditional space because of the barriers to entry.” He found the traditional art world to be intimidating, opaque and a bit snobbish. But crypto art? This, he could understand and master.","","","I first spoke to The Whale a few weeks ago, to get his perspective on the overall NFT space. (This was part of “How NFTs Became Art, and Everything Became an NFT.”) Now I had a more specific agenda. There are tons of “NFT-curious” potential investors, eager for guidance. What advice would he give them? ","","","The Whale shares some good news and bad news for would-be NFT collectors. The bad news: He thinks that “99.99%” of the current NFT projects are going to fail. So maybe don’t take out a line of credit to spend $73,000 on a pixelated photo of your nose. ","","","The good news? “I definitely don't think it's too late,” he says, believing there are still investment opportunities aplenty – even for complete newbs. The Whale gives some ruthlessly pragmatic advice – including detailed Twitter lists – on how aspiring NFT moguls can quickly get up to speed, frame their investing decisions and secure their digital treasures without getting fleeced.","","","CoinDesk: Let’s say someone wants to start investing in NFTs. How should one start?","","","Whale Shark: So the first thing is people really need to understand what NFTs are, and how they change the digital asset ownership and management game. You can get your toe in the water on YouTube. There are so many videos on what NFTs are, how to use MetaMask, how to mint, how to purchase. [See also: CoinDesk’s How to Create, Buy and Sell NFTs and the Whale Community’s video tutorials.]","","","Let’s say the person has the basics covered. What's next?","","","The second thing is to make sure [he or she is] on Twitter. The social network for crypto and DeFi might be Telegram, but the communication of NFTs lives on Twitter, for some reason. Just get on Twitter and follow the largest collectors, the largest creators and the largest projects.  ","","","Which accounts would you highlight?","","","There are several categories. The first is really information-based: nonfungible.com, L'Atelier, DCL Blogger and Andrew Steinwold. Project-wise, that really depends on what you’re interested in, but follow the major projects like Gods Unchained, MakersPlace, Known Origin, Super Rare, Nifty Gateway, Sandbox, Crypto Voxels, Decentraland. ","","","And then there are the major artists. So make sure to follow people like Trevor Jones, Pak, Xcopy. I mean, these guys, they don't only tweet about their own artwork. They also tweet about the health of the space because they're integrated into this ecosystem. And then, collector-wise, definitely be following people like MoCa, Pranksy, myself... Gary Vee, Jamie Burke. ","","","If you follow all those accounts and are actually looking at them on a daily basis, you will get your feet wet very, very quickly.","","","See also: Jeff Wilser: How NFTs Became Art, and Everything Became an NFT","","","After NFT Twitter, what’s next? ","","","I think people should be listening to NFT podcasts, because it’s easy to be working and then listen to podcasts on the side. I would strongly recommend \"Zima Red\" by Andersen Steinwold, \"NonFunGerbils\" by the NonFunGerbils and \"The Matthew and Rizzle Show.\" ","","","DCL Blogger also has a podcast as well as a YouTube channel. Let me think here. \"The First Mint\" is an amazing podcast about NBA Top Shot. Very informative, to the point, and very objective. And Jamie Burke on \"Outlier Ventures.\"","","","How about Discord groups?","","","So, basically joining the two largest general NFT Discords in the space will help people out quite a bit. The largest one is Whale. [Note: This is the community that Whale Shark founded.] That has over 10,700 members as we speak. And the other is TokenSmart. ","","","Let’s say someone says, “OK, I now 100% understand NFTs. I’m sold. But I want to collect and I want to invest. How do I do it without losing my shirt? How do I do it with intelligence?” I’m guessing it’s not as simple as, “Just buy what you think is cool,” right?","","","WS: I’ve probably already said this on Twitter, but one thing to keep in mind is that 99.99% of the projects that exist today are not going to be commercially viable when the mainstream comes. So, to your point, people do need to be very cautious, and people do need to take an analytical eye to how they enter the space and what they want to collect. ","","","Now, given that, I think one can wear two hats. One are true collectors who really just collect what they love, and the second hat is the one of investors, who might collect what they love but also collect for the long term and collect for long-term profitability. But I think the general rule for me is, “If I don't love it, I'm not going to collect it.” ","","","Fair enough. Let’s take off the Collector Hat for the moment and just think as an Investor. What are the strategies you recommend – or frameworks – of how to think about the projects?","","","The first thing I look at in a project is whether or not I can draw a parallel from the traditional collectible to the digital collectible. I want to make sure the digital collectible has a historic proof that the physical collectible also escalated in value. ","","","Interesting. What’s an example?","","","Sneakers, right? Sneakers have accelerated into astronomical values over the last couple of years. That makes me very bullish on digital sneakers that can be worn in the metaverse, like by RTFKT. And when I look at digital sport card collecting, that area – in the traditional world – has continued to escalate. And I could hold those for 10 years, 20 years, 50 years or even 100 years, and those sport card collectibles are just going to continue to escalate in value. Therefore, the traditional-to-digital thesis for NBA Top Shot is very, very clear for me. ","","","Got it. What’s the second thing you look for? ","","","The second thing is the team. The very best ideas can be grounded to mush by a bad team, and some of the worst ideas can be brought to life by the best teams. Whenever I invest in a project, I really take a look at the founders and the teams to understand – do they have the expertise, do they have the professionalism and do they have the track record to be able to take this project to where it wants to be? ","","","And the third?","","","Really, the nature and the quality of the NFTs. I'm now seeing shortcut work, where people are just taking something, putting it up there and it's 2D, and there's nothing special about it. The only special thing is that they tokenized it. Most likely I'm not going to invest in it. ","","","You really want to see projects of a very high quality, that also have fully leveraged the potential capabilities of that digital canvas to bring the collectible into the digital age. Again, we are going to see a lot of mainstream projects enter the space, and it’s really only those high-quality projects that are going to succeed. ","","","What’s an example of a project that, in your eyes, has fully leveraged the capability of the digital canvas? ","","","So I guess the mainstream example would be NBA Top Shot. [The company behind it] didn’t just take a basketball card, scan it in 2D and then post it. Instead, they created this 3D cube. And that has all the information of that moment, and rather than just using a static image they actually tokenized the video moment of the play. ","","","See also: What Are NFTs and How Do They Work?","","","Anything else you look for?","","","The last thing that I look at before I purchase any NFT project is the funding. And this is not what a lot of people look at. Essentially, I like to invest in projects that have a strong backing of investors and a strong line of capital. ","","","Things can go south very quickly in NFTs. It’s really the projects that have the funding to be able to stay alive during a bear market that can thrive in a bull market, right? Once a company goes bankrupt, it's game over. ","","","But I found that projects that have a strong amount of funding and that can be resilient throughout bear markets are most likely to not only survive the bear market, but also to establish a huge fan base as things ramp up. ","","","Which categories of NFTs are you particularly bullish on? ","","","I’ve always believed that crypto art would be the first to blow up. And I’ve been very vocal about that on Twitter over the last two years. So once people have crypto art or digital art, the next thing, I believe, is that people are going to look for places to display that digital art. ","","","Now, everyone can display it on their screens, and everybody has three to seven screens on a daily basis, but you’re still limited, right? ","","","Staring at art on your phone does seem … not ideal. ","","","You're still limited by those screens. People who are collecting 10 pieces of artwork, 20 pieces of artwork, 100 pieces of artwork – they’re going to want to have a place to display their entire collection. The only place that I know where that can be done today is the metaverse. So I think we are revving up for a boom in the metaverse sector very, very shortly. And my major bet is on Cryptovoxels. Given that so many artists have naturally gravitated to that platform due to its simplicity, I do think that metaverse is up next. ","","","What else do you think is headed for a breakout?","","","Music NFTs. It took crypto art two to three years to create this highway, to create this road to tokenization and to commercialization. All music NFTs have to do now is jump on that same highway that has already been built and zoom to the endpoint. This is why I bid $3.5 million on Justin Blau's first drop, because it was historic. It was the very first album that was tokenized as an NFT. So I do think music is up next. ","","","When you’re buying an NFT as an investment, what’s your time horizon? One year? Five years? Twenty years? ","","","WS: I'm looking to invest in things that I never have to sell, ever. I'm looking for assets that I can hold well past my lifetime, and will still continue to accrue in value. So if my grandfather had been buying sports cards back in the 1920s or the 1900s, I'd have a collection worth millions if not hundreds of millions [of dollars] today. That's really what I'm looking for. ","","","Let’s talk a bit about security. Given the size of your collection, what strategies do you use to ensure you don’t lose sleep over getting hacked?","","","I think security is of utmost, utmost importance. If anyone is looking to be a serious collector in the place, there has to be a security process and protocol that makes sense. ","","","The very first step is to make sure your NFTs are stored in a cold wallet. It's very easy to leave NFTs in your MetaMask, or it's very easy to leave your NFTs on hot wallets or custodial wallets provided by platforms. I take everything off and put it into a cold wallet. ","","","How do you secure the cold wallet?","","","Make sure that you have the cold wallet stored in a very secure place. I have multiple backups of the cold wallet stored in multiple places throughout the world in safe deposit boxes. And make sure the private keys never touch anything digital or even touch the internet – that’s very important. ","","","And then cutting in half that private key sheet that you've written with pen and paper, and spreading that across multiple locations in safe deposit boxes. I could be paranoid, but when you have a collection that's potentially worth upwards of $100 million, $200 million, $300 million, I don't think there is a safer way to do things.","","","Not your keys, not your NFTs.","","","I feel like by the time I’ve heard of an investment opportunity, it’s already too late. (Not necessarily for NFTs, but just finance in general.) In other words, if even a yokel like me knows about it, then the real bull run is over. I’m guessing a lot of other people are in the same position – the “smart money” has already pounced, and now they’re the dumb money. How do you think about this? ","","","That's a great question. So, the first thing I would say is that I don't think anybody is late. And let me give two reasons. The first is what I mentioned early on, that 99.99% of current projects are going to go bust, and that means there will be new projects that enter the space that become mainstream, right? It’s just keeping the ear to the ground, keeping the eyes locked on Twitter and I think people will be able to decipher which of these new projects will thrive in the mainstream.","","","The second reason pertains to digital art. Sotheby's and Christie's have already said that digital art is here to stay; they see a long-term vision for NFTs. Now, the golden question is, which of these visual artists are going to be announced at the auction houses next? Because when you look in the space, there are only a handful of artists that really sell at the premiums that we've been seeing. So if one is able to determine which of these current artists in the digital art space will be going up next on these two auction houses, essentially they'll make bank within a couple of months.","","","I definitely don't think it's too late, but it will require a significant amount of research and analysis to understand which of these artists will be moving forward into the mainstream. ","","","Okay, last question, and I’m sure this is one you hear all the time. But I’m curious. You’ve said that 99.99% of NFT projects are likely to fail, and yet you also own 210,000 NFTs. How do you square this?","","","[Laughs.] That’s an amazing question, and you’re actually the first person to ask me that. ","","","I mean, I know you’ve got an answer!","","","I go deep, Jeff. When I see a project that I know after analyzing is part of that 0.1%, or 0.01%, I go deep.","","","What do you mean exactly?","","","I go really, really deep. So far – touch wood – I've been very fortunate to be investing in the right projects at the right time. Those 210,000 NFTs are probably only spread across [fewer] than 20 projects. ","","","Wow.","","","I would say the majority holdings are probably in about 15. So when I do find a project, dude, I try to buy everything of value within that project. And I’ve found that to be the best approach. Granted, it is not a very risk-averse approach. But when I see a great project, when I see a great team, when I see a great idea – with awesome funding – I go all in. Not literally, but I go very, very deep in the investment.","","","Thanks for your time, Whale. This was fun.","","","Thank you so much, my friend. As always, I really do enjoy talking with you.",""],"entity":[{"type":"Andersen Steinwold","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Matthew","content":"PERSON"},{"type":"CoinDesk’s How to Create","content":"ORGANIZATION"},{"type":"Andrew Steinwold","content":"PERSON"},{"type":"$265 million","content":"MONEY"},{"type":"$Whale","content":"MONEY"},{"type":"$3.5 million","content":"MONEY"},{"type":"1920s","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"0.1%","content":"PERCENT"},{"type":"Known Origin","content":"ORGANIZATION"},{"type":"Pranksy","content":"LOCATION"},{"type":"$69 million","content":"MONEY"},{"type":"millions [of dollars","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"99.99%","content":"PERCENT"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"The Whale","content":"ORGANIZATION"},{"type":"Carter Reum","content":"PERSON"},{"type":"Whale Community","content":"ORGANIZATION"},{"type":"Whale Shark","content":"ORGANIZATION"},{"type":"Jeff","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"Pak","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Crypto Voxels","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"$73,000","content":"MONEY"},{"type":"Jamie Burke","content":"PERSON"},{"type":"0.01%","content":"PERCENT"},{"type":"Whale","content":"ORGANIZATION"},{"type":"Shark","content":"ORGANIZATION"},{"type":"Justin Blau","content":"PERSON"},{"type":"Gary Vee","content":"PERSON"},{"type":"Jeff Wilser","content":"PERSON"},{"type":"1900s","content":"DATE"},{"type":"Christie","content":"ORGANIZATION"},{"type":"DCL Blogger","content":"ORGANIZATION"},{"type":"Sandbox","content":"LOCATION"},{"type":"Trevor Jones","content":"PERSON"},{"type":"Paris Hilton","content":"LOCATION"},{"type":"$300 million","content":"MONEY"},{"type":"$WHALE","content":"MONEY"},{"type":"Decentraland","content":"LOCATION"},{"type":"Twitter over the last two years","content":"DATE"}],"hashtag":["NFTs","Whale Shark","Collecting"],"authors":["Jeff Wilser"]}