{"summary":"The project allows users to report cryptocurrency wallets related to scams, sanctions violations, terrorism financing and other crimes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/21\/ukraine-crypto-hapi\/","publishDate":"2023-03-21T18:41:49","id":15517,"type":null,"title":"This Ukrainian Startup Is Looking to Automate Crypto Crime Reporting Using Smart Contracts, AI","category":["Consensus Magazine"],"content":["HAPI Labs has launched a platform for reporting scam- and crime-related addresses, in partnership with Ukraine’s cyber police.","Scamfari OSINT, currently in beta mode, allows users to report cryptocurrency wallets related to scams, sanctions violations, terrorism financing and other crimes. The project is supported by Ukraine’s cyber police, which will work on freezing such wallets, the agency announced on Monday.","HAPI, a crypto startup working on cybersecurity tools for decentralized finance (DeFi) platforms, previously ran two-week-long contests asking people to find and report crypto wallets related to fraud and other crimes, with a special focus on the money pro-Russian volunteers raise to help Russian troops invading Ukraine. Users who report the most wallets get rewards in HAPI’s own token, but only if the reports are approved by the firm’s team and are really linked to some kind of crime.","Read more: Coins of War: How Crypto Keeps Feeding Russia's War Despite Sanctions","This week, another week-long contest went live. Even after this “season” is over, the hunting for criminal crypto will not stop but continue on a new website.","It works like this: A user signs up via a Telegram bot, fills out a form and submits a blockchain address and a screenshot proof that the address is being used for criminal purposes.","Then, two HAPI staffers manually check whether reports contain truthful and relevant data, then either approve or reject them. After a report is approved the reporter is assigned a reward in HAPI’s own tokens, which are now trading around $13 each: $1 for a new address in the database, 10 cents for an address previously reported and $5 for an address related to a sanctioned person or entity, HAPI head of research Mark Letsyuk told CoinDesk.","For now, rewards are being distributed manually every two weeks, but in future HAPI wants to automate the reward distribution using smart contracts. The community might also have a vote soon as to whether to replace the HAPI token with a stablecoin as a reward, Letsyuk said.","“Many people in Ukraine lost their jobs [because of the war] and some made several hundred dollars during the past season,” he said. “In these times, it’s good money. Now, people want to try and do it on a regular basis.”","He added that since Scamfari OSINT launched in beta last week, over 15,000 addresses have been submitted, including the wallets raising funds for Russian mercenaries fighting in Ukraine.","In the future, HAPI is considering using AI to automate report approval, too, Letsyuk said: “We’re now feeding the reports we get to the [latest AI product by OpenAI] GPT-4 – it looks very raw at this point, but promising. Not trying to catch some hype here, but we believe that it can be helpful in the near future.”","The Ukrainian cyber police, in it announcement, underscored it will be looking particularly for wallets linked to financing Russian troops invading Ukraine. According to CoinDesk’s own investigation, such accounts have raised at least $1.8 million for ammunition, vehicles and other supplies for the troops since the beginning of the war. The Binance crypto exchange has said the number could be as high as $7.2 million."],"entity":[{"type":"Mark Letsyuk","content":"PERSON"},{"type":"$13","content":"MONEY"},{"type":"Letsyuk","content":"PERSON"},{"type":"CoinDesk’s","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"$7.2 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Binance crypto exchange","content":"ORGANIZATION"},{"type":"10 cents","content":"MONEY"},{"type":"GPT","content":"ORGANIZATION"},{"type":"$5","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"several hundred dollars","content":"MONEY"},{"type":"Telegram bot","content":"ORGANIZATION"},{"type":"Scamfari OSINT","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Ukraine","Scams","Russia","AI"],"authors":["Anna Baydakova"]}