{"summary":"The trial verdict is an indictment of regulators and the VC industry. But the U.S. justice system and, yes, journalists, proved their worth more than ever.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/03\/winners-and-losers-of-sam-bankman-frieds-trial\/","publishDate":"2023-11-03T18:26:13","id":15512,"type":null,"title":"Who Won and Lost Most in Sam Bankman-Fried's Criminal Scheme?","category":["Consensus Magazine"],"content":["Well, it’s over. Sam Bankman-Fried has been convicted on all seven counts, with another trial on the docket for this spring to gauge SBF’s guilt and responsibility in a multi-year scheme to buy political favor for the FTX crypto exchange. At this point, Bankman-Fried faces up to 110 years in prison, though sentencing won’t happen for months.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","For many crypto fans, SBF’s conviction is the first of many that need to happen to rid the industry of bad actors, scammers and thieves that captured the public imagination and defined what this technology fundamentally is during the 2020-21 bull run. Over the long term, it’s entirely possible crypto polishes out the tarnish.","See also: Could Sam Bankman-Fried's Saga Happen Without Crypto?","Of course, SBF can appeal the decision and angle for a mistrial, arguing he didn't have adequate access to ADHD medication, his legal team (after being remanded into jail for repeatedly violating the terms of his bail) and, maybe, that District Judge Lewis Kaplan was heavy-handed in his oversight of the trial.","But legal experts largely agree those claims are groundless, and that the former Boy Wonder is likely to spend the next few decades in prison. As is his wont, Bankman-Fried took a gamble that he could use customer and investor funds for essentially anything he wanted at the moment, illegally, and get away with it.","The jury's complete, quick and decisive ruling is clear: Bankman-Fried lost that wager. But who or what, if anyone or anything, will come out ahead at the end of this trial? While prison time is a type of retribution for tens of thousands of victims of SBF, it will not exactly make anyone whole or eliminate the stink of the biggest public spectacle that has haunted crypto for the past year.","Sam Bankman-Fried: SBF was convicted on all counts of wire fraud as well as conspiracy charges to commit wire fraud, securities fraud, commodities fraud and money laundering. During the trial it came to light he had essentially founded FTX as a new source of capital for his hedge fund, Alameda Research, which was a money-losing operation while SBF was the helm and while he pretended he wasn’t. SBF’s scheme to pilfer money from FTX users and his Wall Street and venture capitalist backers to buy luxury property, political favor and FTX equity from rival Binance as well as finance venture investments unraveled, taking the MIT graduate down with it. Worse, Bankman-Fried, while at times admitting he “messed up,” was never exactly contrite and fought the damning accusations until the end, perhaps thinking he could get away with it all, one last time.","The Bankman, Fried Family: SBF’s father, Joseph Bankman, a Stanford law professor and tax expert, was involved in FTX from the early days. He helped SBF spin up shell companies, advised on tax decisions and angled for a raise for his efforts. In trial testimony from SBF’s inner circle (i.e. Caroline Ellison, Gary Wang and Nishad Singh) as well as court documents, Bankman’s name came up time and again. He was present in recovered Signal chat groups, including some of the most pivotal communications between FTX operators as the exchange was failing and SBF’s meeting with Bahamian regulators — moments when SBF could have come clean. Bankman recommended they hire Dan Friedberg, FTX’s “fixer,” who SBF later tried to blame for his own failings in a terminal “advice-of-counsel” defense.","See also: Bankman-Fried's Stanford-Connected Backers and the Decline of Tech Prestige | Opinion","SBF’s parents are thought to have partially financed their son’s criminal defense, and put their family home up as bail collateral. While it’s not yet clear whether they are fully implicated in this multi-million dollar fraud, they are being sued by the FTX bankruptcy estate. Barbara Fried, the founder of a political action committee that Sam funded, in part using customer funds, was previously best known for her offbeat views on justice and blame, which seem to have influenced Sam’s own skewed sense of morality. It’s likely both of their distinguished careers are over. Finally, Gabe Bankman-Fried, the younger son, will likely be overshadowed by his brother’s crimes. While not an FTX employee, Gabe ran a pandemic-prevention nonprofit financed by Sam’s “charitable giving” and apparently harbored equally grandiose ideas about spending other peoples’ money better than they could — at one time entertaining the thought of buying a private island.","Effective Altruism: Although the U.S. Department of Justice lobbied successfully to keep the idea that SBF had “good intentions” out of court, arguing his charitable donations and image as a selfless billionaire would confuse the jury (and were, SBF disclosed, essentially lies), SBF has become synonymous with the effective altruism cause. The EA movement was both SBF’s ethical framework and recruiting ground. Coalescing during the latter half of the 2000s as a branch of utilitarianism, EA can be summed up as “earn to give.” It advocates for high-achieving individuals to pursue careers that enable them to “maximize their impact,” and could be interpreted as condoning crime if it ultimately leads to a better outcome. Adherents also tend to be “rationalists,” believing that outcomes can be weighed in advance by calculating the “expected value” of particular decisions. SBF, for instance, refused haircuts because his nonchalant brand supposedly helped him raise funds. Whether SBF is representative of EA, his conviction will indefinitely tarnish the movement, which is now known more for the fringe beliefs it incubated (like trying to prevent an AI apocalypse) than, say, delivering mosquito nets around the world. Author Zeke Faux referred to it as a philosophy where believers pretend they are superheroes.","Sequoia, VCs and \"Pattern Recognition\": Yesterday, hours after SBF was convicted, Alfred Lin, a partner at VC firm Sequoia Capital and former chief operating officer of Zappos, posted that the company which had invested nearly a quarter billion dollars into FTX, was “deliberately misled and lied to.” He came to this conclusion after an “extensive review” of Sequioa’s due diligence processes over the course of its 18-month relationship with Sam Bankman-Fried, apparently without understanding that, ironically, “due diligence” is supposed to find fraud. Sequoia published an infamous hagiography of SBF at his peak – including details that the FTX CEO was playing “League of Legends” during his pitch meeting and had plans for FTX to become an “everything app” where users could buy anything from stocks to a banana – based on the idea of that he could have become the world’s first “trillionaire.” The VC firm has since written down its investment to $0. While Sequoia has come out looking more foolish than most, the company also stands as an indictment of venture capitalism and the prevalent practice of “pattern matching.” Often when investing in upstarts, there is little information to go on — and so VCs, whether they admit this to themselves or not, go by gut. This is how the world ended up with Adam Neumann, Elizabeth Holmes and Sam Bankman-Fried.","See also: 6 Kinds of Crypto Scams and How to Avoid Them","U.S. Regulators: Although FTX was technically an overseas exchange, SBF made no bones that he ultimately wanted to capture the U.S. market. He helped craft regulation known as the “Digital Commodities Consumer Protection Act,” and presented it before Congress and regulators like the Commodity Futures Trading Commission. CFTC Commissioner Christy Goldsmith Romero, who reportedly met SBF three times, has since said this “bespoke regulation” was an attempt to plead “for special treatment” for his “fundamentally predatory model.” U.S. Securities and Exchange Commission Chair Gary Gensler, who knew Alameda CEO Caroline Ellison’s father, is also reported to have had a working relationship with FTX. These agencies are known as “disclosures regulators” in that they attempt to ensure companies are following the law, rather than proactively hunting down crime. Though FTX had grown so large, and had so many connections to the U.S. (including U.S. bank accounts, investments in U.S. firms and U.S. advertising campaigns), without these agencies looking in is a blackmark. It’s telling also, that one of the few FTX units to survive nearly unscathed was FTX Japan, which operated under that country’s stringent financial regulations.","FTX’s Inner Circle: Caroline Ellison, Gary Wang and Nishad Singh all pleaded guilty to fraud charges and cooperated with federal prosecutors. It’s unlikely this conviction could have happened as quickly (or at all) without their testimony. However, they also participated in and facilitated one of the largest financial crimes in history, and it is a mistake to believe SBF acted alone. They waited until the fraud unraveled to speak up, and each ignored numerous opportunities to do the right thing and contact authorities while the looting was taking place. Ellison misled lenders, wrote fraudulent reports and then lied to the public. Wang and Singh made the code changes that enabled the theft. I do not believe prison time will necessarily help any of FTX’s victims, but the value of their testimony will forever be undercut by their earlier silence.","See also: Who's Who in the FTX Inner Circle","TradFi: Centralized crypto exchanges are essentially TradFi companies, and it turns out that hardwon business practices exist for a reason. Crypto exchanges must separate corporate funds from customer deposits. They nneed to separate their crypto custody and trading divisions. They must provide appropriate disclosures (and no, proof-of-reserves is not enough). Companies need active director’s boards, compliance teams and chief risk officers. It turns out the applecart crypto wants to upset moves slowly for a reason.","Lawyers: FTX is being advised by 150 lawyers from Sullivan & Cromwell, who each reportedly stand to earn as much as $2,165\/hour for their work. The bankruptcy estate already has spent more than $110 million in legal fees and recorded over $500,000 in expenses, according to the New York Times. While this seems like money well spent, considering John J. Ray’s aggressive clawback strategy and decision to hold onto lucrative investments like equity in AI startup Anthropic, it is still a massive expense for creditors.","Ian Allison: CoinDesk’s star reporter broke the story that PayPal was getting involved in crypto at the beginning of the bull run and wrote the measured piece about Alameda’s FTT holdings that decidedly ended it. His work has won top financial reporting prizes, including a Polk Award and Loeb Award. But perhaps the most rewarding experience of all was seeing SBF convicted exactly one year to the date after Allison published his story about Alameda’s balance sheet, a seismic impact with little precedent in the history of journalism. Kudos also to former CoinDesker Tracy Wang, who blew the door open on the oddities happening at Sam Bankman-Fried's luxury penthouse at The Albany, which won a Polk Award (without mentioning the word \"polycule\") as well as CoinDesk's \"Trial Team\" who reported the ins and outs of SBF's five-week trial. The Verge's Liz Lopatto; the Ringer's Katie Baker; Protos' Cas Piancey, Bennett Tomlin and David Z. Morris; Wikipedia editor Molly White; Unchained founder Laura Shin and court reporter Matthew Russell Lee of Inner City Press, among others, also provided invaluable insight and commentary from the courthouse.","U.S. Justice System: Several reporters who have spent the past five weeks at the Daniel Patrick Moynihan Federal Court in New York have said they are leaving the experience with a newfound respect for the U.S. legal system. U.S. Attorney Damian Williams announced the DOJ’s charges against SBF on Dec. 13, 2022, and less than a year later the trial has concluded and one of the biggest fraudsters in history is behind bars. Judge Lewis Kaplan ran the courtroom as a well-oiled machine, and U.S. prosecutors Danielle Sassoon and Nicolas Roos have emerged as cult heroes for their ability to craft a story and present evidence. Everyone has a right to a fair and speedy trial, and this one — which unfolded in the public eye — was no exception.","Solana: (SOL) was one of many so-called \"Sam Coins,\" or tokens that the FTX founder had a massive stake in. Pitched as a super-fast, app-friendly blockchain, Solana's reputation has long been tarnished by its early token sales to venture capitalists and insiders. SBF, for instance, reportedly had an opportunity to buy SOL for around $0.20. He also financed or backed many of the supposedly commercial applications on built on Solana, including the decentralized exchange Serum (another Sam Coin) and the fitness app STEPN. The Solana protocol is still a work in progress, and occasionally goes down, though it boasts one of the most vocal and committed developer communities in crypto. This dev ecosystem got a tepid vote of confidence from Ethereum create Vitalik Buterin, not long after SBF was arrested, and has seemingly been able to shake off the association with FTX. Recently, SOL has been ripping up, though in the longterm there are concerns that the 55.8 million SOL tokens held by the FTX estate will put downward price pressure on the coin for years, as that massive stockpile is liquidated.","See also: Solana (SOL) Price Rallies to 14-Month High as FTX Unstakes Tokens","CoinDesk, the Cadmean Victor: Sorry to get meta again, but what can I say, CoinDesk broke the news about SBF's crooked accounting and brought the multi-billion dollar fraud to light — the type of achievement few media organizations can boast about. Allison's story kickstarted a contagion event that brought down or damaged a number of individuals and firms intertwined with SBF's crypto empire, including CoinDesk's parent company Digital Currency Group (DCG) and sister firm Genesis Capital. Suffice it to say that DCG, a crypto conglomerate that was once compared to Standard Oil, is now strapped for cash, and CoinDesk is for sale.","Sam Trabucco: What's up with this guy?"],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Albany","content":"LOCATION"},{"type":"Gabe Bankman","content":"PERSON"},{"type":"quarter billion dollars","content":"MONEY"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"David Z. Morris","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Katie Baker","content":"PERSON"},{"type":"Yesterday","content":"DATE"},{"type":"Saga Happen Without Crypto","content":"ORGANIZATION"},{"type":"$2,165","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Tracy Wang","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Sam’s","content":"PERSON"},{"type":"Alfred Lin","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"EA","content":"ORGANIZATION"},{"type":"Dec. 13, 2022","content":"DATE"},{"type":"Cas Piancey","content":"PERSON"},{"type":"Allison","content":"PERSON"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Sullivan & Cromwell","content":"ORGANIZATION"},{"type":"Sam Coins","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Zappos","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Gabe","content":"PERSON"},{"type":"Stanford","content":"ORGANIZATION"},{"type":"Liz Lopatto","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Singh","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Laura Shin","content":"PERSON"},{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"SOL","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Elizabeth Holmes","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Damian Williams","content":"PERSON"},{"type":"Solana (SOL) Price Rallies","content":"ORGANIZATION"},{"type":"21","content":"DATE"},{"type":"$0","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"FTX Japan","content":"ORGANIZATION"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"a year later","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"$110 million","content":"MONEY"},{"type":"Sam Coin)","content":"PERSON"},{"type":"Adam Neumann","content":"PERSON"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"John J. Ray’s","content":"PERSON"},{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"Nicolas Roos","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Nishad Singh","content":"PERSON"},{"type":"6 Kinds of Crypto Scams","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Matthew Russell Lee","content":"PERSON"},{"type":"Daniel Patrick Moynihan Federal Court","content":"ORGANIZATION"},{"type":"Dan Friedberg","content":"PERSON"},{"type":"FTX Inner Circle","content":"ORGANIZATION"},{"type":"Protos","content":"PERSON"},{"type":"Molly White","content":"PERSON"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Bennett Tomlin","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$0.20","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"Ian Allison","content":"PERSON"},{"type":"Loeb Award","content":"ORGANIZATION"},{"type":"2000s","content":"DATE"},{"type":"Sam Trabucco","content":"PERSON"}],"hashtag":["Opinion","The Node","Newsletters","SBF Trial","SBF","FTX","Barbara fried","Joseph bankman","Alameda Research","Caroline ellison"],"authors":["Daniel Kuhn"]}