{"summary":"Stablecoins are not currencies, but rather, assets, ECB President Christine Lagarde said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2021\/09\/02\/stablecoins-are-pretending-to-be-currencies-ecbs-lagarde\/","publishDate":"2021-09-02T16:30:14","id":15518,"type":null,"title":"Stablecoins Are ‘Pretending’ to Be Currencies: ECB’s Lagarde","category":["Policy"],"content":["Cryptocurrencies backed by fiat money are assets and should not be mistaken for currencies, said Christine Lagarde, president of the European Central Bank (ECB).","“Stablecoins are pretending to be a coin but, in fact, it’s completely associated with an actual currency. For instance, some of them are saying that they can be used for transactions, but the value will be exactly aligned to the dollar,” Lagarde said, referring to stablecoin issuers.","Lagarde made the remarks during a 30-minute interview on Tuesday while discussing the “World’s Greatest Challenges” as part of the Time 100 Talks series with the world’s most influential people. World Economic Forum (WEF) founder Klaus Schwab hosted the discussion.","“I want to focus on one aspect of this revolution, which is digital currencies – or should I say, decentralized digital currencies like bitcoin,” Schwab said.","Schwab asked Lagarde if decentralized currencies can contribute to financial stability, or if she believes them to be a threat.","Lagarde took the opportunity to clarify her view that, first, it is important to properly define and categorize crypto assets for what they are.","“They present themselves as currencies, which they are not. So I think that we should all in the finance sector and at the regulatory level call a spade a spade,” Lagarde said.","She went on to suggest that stablecoins, or cryptocurrencies that are pegged to fiat currencies like the U.S. dollar, fit this description.","“I think very recent history has [shown] that those reserve currencies were not always available and as liquid as they were intended to be,” Lagarde said.","Lagarde may have been referring to the recent revelation that 49% of the “U.S. dollar reserves” backing the Tether-issued USDT stablecoin were actually made up of unspecified commercial paper. Since then, U.S. Federal Reserve official Eric Rosengren called Tether a “challenge to financial stability.”","USDC, the stablecoin issued by Circle and Coinbase, similarly revealed that 9% of its reserves are made up of commercial paper.","Stablecoin issuers have to guarantee that users can exchange their coins for dollars at any time, Lagarde said, adding that issuers have to back up their coins with as many dollars as they have coins.","“That needs to be checked, supervised and regulated so that consumers and users of those devices can actually be guaranteed against potential misrepresentation,” Lagarde said.","Shwab also asked Lagarde about the ECB’s plan to launch a digital euro in the next four years.","“What would be the benefits of such a move, and what might the pitfalls be? Would it strengthen or weaken the position of the euro on a global level?” Schwab asked.","Lagarde responded the ECB will be kicking off a two-year experiment so the institution will be ready to meet the demand for a digital euro, should it exist.","“At the European Central Bank, we believe that we should be ready and have the technology available in order to respond to customer demands. If customers prefer to use digital currency rather than have bank notes and cash available, it should be available,” Lagarde said.","The two-year investigation was announced in July and it’s set to kick off in October.","Lagarde also said the experiment will focus on a number of things including the availability of a digital euro (in the same way that cash is available), safety and security, along with user friendliness, affordability and ensuring the digital euro is accepted not only in the euro area but around the world."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Lagarde","content":"PERSON"},{"type":"Time","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Eric Rosengren","content":"PERSON"},{"type":"Schwab","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"49%","content":"PERCENT"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"WEF","content":"ORGANIZATION"},{"type":"Klaus Schwab","content":"PERSON"}],"hashtag":["Christine Lagarde","ECB","WEF","Stablecoin","Tether","USDT"],"authors":["Sandali Handagama"]}