{"summary":"Fully diluted value of STRK reached as high as $50 billion with an initial market cap of $3.64 billion.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/20\/starknet-token-strk-begins-trading-at-5-after-mammoth-airdrop\/","publishDate":"2024-02-20T12:10:51","id":15520,"type":null,"title":"Starknet Token STRK Begins Trading at $5 After Mammoth Airdrop","category":["Finance"],"content":["Ethereum rollup Starknet has initiated the distribution of 728 million tokens to around 1.3 million addresses in what is being dubbed the largest airdrop of the year.","Starknet token’s STRK pre-launch perpetual futures were trading at $1.80 on decentralized futures platform Aevo. The token traded as high as $5 on Kucoin minutes after it was released and has since slumped back to $3.50 in a volatile opening.","With an initial total supply of 10 billion tokens, the fully diluted value (FDV), the theoretical market capitalization if the entirety of its supply were in circulation, of STRK stands at $35 billion. However, the actual market cap, which is the current circulating supply multiplied by the current price, is at $2.32 billion.","50.1% of STRK’s supply has been allocated to the Starknet Foundation for community airdrops, grants and donations. 24.68% of STRK’s total supply will be distributed to early contributors and investors, while 32% has been assigned to StarkWare employees, consultants and developer partners.","The tokens will be unlocked every month for 31 months, starting from April.","Starknet is a layer-2 network that makes use of zero-knowledge cryptography, allowing decentralized applications operating on top of it to scale the Ethereum blockchain. It does this by bundling transactions off-chain into a proof that is submitted to Ethereum, which in turn is supposed to process the transaction faster and lower fees for computing them.","Layer 2s are networks built on top of a base blockchain, layer 1, to reduce bottlenecks.","Starknet first went live in November 2021. Since then, Starknet has amassed nearly $55 million in total value locked (TVL), according to DefiLlama.","Edited by Parikshit Mishra."],"entity":[{"type":"50.1%","content":"PERCENT"},{"type":"32%","content":"PERCENT"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$3.50","content":"MONEY"},{"type":"$1.80","content":"MONEY"},{"type":"$5","content":"MONEY"},{"type":"$2.32 billion","content":"MONEY"},{"type":"$55 million","content":"MONEY"},{"type":"$35 billion","content":"MONEY"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"24.68%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["starknet","Starkware","airdrop","Ethereum"],"authors":["Oliver Knight","Margaux Nijkerk"]}