{"summary":"Traders almost expect it at this point — when cryptocurrency prices gyrate, exchanges buckle as users flood their systems.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117104\/how-the-latest-bout-of-crypto-exchange-problems-could-draw-the-ire-of-us-regulators","publishDate":"2021-09-10T14:09:40","id":1552,"type":null,"title":"How the latest bout of crypto exchange problems could draw the ire of US regulators","category":["INFRASTRUCTURE"],"content":["Traders almost expect it at this point — when cryptocurrency prices gyrate, exchanges buckle as users flood their systems.","It's not a new issue; rather, it's one that has plagued exchange venues from <a href=\"https:\/\/www.yahoo.com\/now\/perpetual-overload-problem-bitmex-taking-155321913.html\" data-v-f87c67ca=\"\">BitMEX<\/a> to <a href=\"https:\/\/fortune.com\/2017\/12\/22\/coinbase-bitcoin-crash\/\" data-v-f87c67ca=\"\">Coinbase<\/a> for years.&nbsp;","IamNomad, an outspoken voice on Crypto Twitter and former market maker, <a href=\"https:\/\/twitter.com\/IamNomad\/status\/1435277229865508864?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">outlined<\/a> some of the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116819\/major-us-crypto-exchanges-buckled-as-bitcoins-price-fell-on-tuesday\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">specific issues<\/a> that kept traders from accessing crypto exchanges during Tuesday's rocky session, which included laggy market data to orders being rejected. Some platforms, such as <a href=\"https:\/\/twitter.com\/IamNomad\/status\/1435339125964648451?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">BlockFi<\/a>, were down completely.&nbsp;","","","In fact, these outages ultimately play a role in bringing the market down further, according to Aya Kantorovich, an executive at FalconX, who said that traders can't access their spot accounts to top-up on their positions on derivatives exchanges to avoid being liquidation.&nbsp;","\"That aggravates the liquidation cascade,\" according to Kantorovich.&nbsp;","To be sure, crypto is not unique in experience downtime when markets see significant fluctuations. Brokers ranging from Robinhood to TDAmeritrade have experienced issues keep their platforms up and running during bouts of volatility in the pandemic era.","Still, it is rare for venues like New York Stock Exchange or Nasdaq to experience such issues.&nbsp;","A source at Coinbase, who spoke on the condition of anonymity, told The Block that the exchange has expanded its capacity by more than 10x and is able to handle volumes in the tens of billions per day versus volumes in the billions. Over the next few months, the exchange will continue to make improvements. The source said that the model of exchanges in crypto is also part of the problem.","\"I think the move to the brokerage model that's client-focused and liquidity-agnostic moves us away from the problem,\" the person said.&nbsp;","That opens up firms like Coinbase to more sources of liquidity. Aggregators such as CoinRoutes and FalconX, which relay external sources of liquidity, reported no down time.&nbsp;","\"CoinRoutes had no outages today and our clients were able to trade by virtue of having multiple venues available,\" CEO Dave Weisberger told The Block.","Coinbase is not the only venue that's been making improvements. BitMEX, formerly the largest futures platform in the crypto market that has seen its market share shrink since the beginning of the year, told The Block that it experienced \"zero overloads\" on Tuesday. A spokesman said that the exchange has increased throughput and made improvements to the system that distributes market data.&nbsp;","\"Clients receive market data updates as quickly as possible without it lagging behind the increased order processing rate upstream,\" the spokesman said. \"In the next few weeks, we will be delivering further performance improvements to this part of the stack, giving clients even lower latency market data updates.\"","It's worth noting that the 24-hour nature of crypto makes it more difficult to address technology problems versus equities where brokers and exchanges can address such issues during off-market hours, FTX.US CEO Brett Harrison told The Block.","\"Between 4 p.m. and 930 a.m., you can roll out new changes,\" he said, referring to the equity world.","Despite the efforts to improve, recent issues could be a reason for regulators to further scrutinize crypto platforms, according to Hunter Merghart, a former exec at exchanges Bitstamp and Coinbase.&nbsp;","\"This is a very easy avenue for regulators to go after all day long and now that eyes are even more on the space this is a bad look for the industry,\" he told The Block.&nbsp;","Tyler Gellasch, a former lawyer at the Securities and Exchange Commission, agrees. Gellasch now is Executive Director of the Healthy Markets Association, an investor group. Gellasch told The Block in a phone interview that there is \"no question federal regulators are going to be concerned about financial harm.\"","An examination into crypto exchange infrastructure has historical parallels, Gellash said. In the mid-2000s, following a series of exchange and trading firm glitches, the SEC implemented Regulation SCI, aimed at beefing up trading infrastructure through regulatory mandate.&nbsp;","\"The SEC took the approach of 'we can't have technology glitches bringing down our markets, we need our markets to have integrity and stability,\" he said. “Investors need to be able to trade, especially in times of volatility. Ensuring the market infrastructure doesn’t buckle and hurt investors is a regulatory top priority in securities and derivatives markets.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dave Weisberger","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"4 p.m.","content":"TIME"},{"type":"Aya Kantorovich","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Gellash","content":"PERSON"},{"type":"Executive Director of the Healthy Markets Association","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"Kantorovich","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Hunter Merghart","content":"PERSON"},{"type":"Tyler Gellasch","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}