{"summary":"The messaging app's switch to TON from Euro creates a circular economy for the closely-linked crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/02\/telegrams-pivot-to-ton-payments-for-ads-boosts-toncoin\/","publishDate":"2024-04-02T14:21:32","id":15538,"type":null,"title":"Telegram's Pivot to TON Payments for Ads Boosts Toncoin","category":["Finance"],"content":["Telegram's embrace of crypto technology – namely, the closely-linked TON blockchain – accelerated Sunday with the roll-out of toncoin (TON) payments for advertisers and crypto payouts for content creators on the messaging app.","The release has triggered an explosion of activity on The Open Network (better known as the TON Blockchain), which has now become Telegram's exclusive home for facilitating an entire social media advertising economy.","A record 156,000 TON wallets were activated on Sunday, when Telegram officially began accepting toncoins as payments for advertisements, according to TONstat.com. That figure more than doubles the network's previous onboarding record, set only one day before.","Though early, the figures suggest Telegram's experimental embrace of crypto is so far succeeding and, in doing so, has created a circular economy for TON. Advertisers must pay for their marketing campaigns in the cryptocurrency. That revenue then is split evenly between content creators (who can cash it out or reinvest it in their own ads) and Telegram itself (which has said it plans to hoard as much TON as it can and sell the rest to \"long-term investors\").","\"Telegram building its ad platform natively on TON, fueled by Toncoins, will drive adoption and add a strong utility to the ecosystem,\" said Alex Cassasovici, CEO of crypto-streaming project Azarus.","Anticipation of the ad program has already helped boost TON's value tremendously. It's climbed 150% in the month since Telegram CEO Pavel Durov announced the messaging app's plans to run its ad and revenue-sharing program using TON.","Telegram, too, stands to benefit from the program. Though Telegram has never before been profitable, it could now generate revenue from hosting tailored ads. With 700 million monthly active users and 1 trillion channel views per month it has a large base of eyeballs to draw from.","In March, the company raised $330 million in a bond sale that Durov said would accelerate Telegram's growth. \"The increased demand for our bonds shows that global financial institutions value Telegram’s growth in audience and monetization,\" he said in his own Telegram channel.","A CoinDesk review of Telegram's TON-based ad platform revealed it is far more accessible and cheaper than Telegram's previous foray into hosted marketing. Advertisers need only 20 TON (~$105) to seed their campaigns through Telegram's crypto platform, Fragment. Previously, advertisers needed at least €2 million to run an official campaign through Telegram.","That lofty minimum was meant to \"ensure and maintain a high quality\" of advertisements, Telegram previously told its advertisers. Instead, it had the unintended consequence of pushing small-time advertisers toward agencies who had already spent €2 million, according to Van Morozov, a Serbia-based Telegram marketer at the consulting firm Bespalov Finance. Those agencies would then run marketing campaigns on behalf of many clients, he said.","Telegram is now positioned to reclaim the small-timers' business in a completely different payment medium than EURO, which it appears to have abandoned entirely. Instead, it chose TON, a cryptocurrency that can be transacted almost instantaneously, globally, outside the banking networks, and for little commission.","Telegram channel operators can expect to get a payday under the new ad program. According to Durov, administrators will be able to collect 50% of the revenue generated by ads run on their channels, with Telegram itself collecting the other half.","The plan vaults Telegram into the conversation surrounding social media companies' responsibilities toward their content creators. Many companies have taken to rewarding their power users with a slice of the revenue their posts create. However, few companies have publicly shared the breakdown, let alone committed to going half on the winnings.","While ad buying can start immediately, content creators and channel operators will not be able to withdraw any TON payments they receive until late May, according to a web page on Fragment.","Telegram's embrace of TON payments brings the network close to realizing part of a crypto vision that U.S. regulators have already tried to squash. From 2018 through 2020, it tried to raise cash by selling its own TON token to ICO investors, though it abandoned that plan in a settlement with the Securities and Exchange Commission (SEC).","The new TON token and blockchain isn't actually issued by Telegram. Instead, it's a recreation of the network that Telegram abandoned, which has been put together by a separate group called the TON Foundation.","While technically an arms-length affair, the ad payments setup could result in Telegram \"holding an unhealthy share of Toncoin, which will be too concentrated for a decentralized ecosystem,\" Durov said in a post to his own channel.","\"To limit Telegram’s share of TON at ≈10% of the supply, we’ll be selling the upcoming surplus of our TON holdings to long-term investors — under 1-4 years lockup and vesting plan, but at a discount to the market price. This way free-floating TON will get locked up, stabilizing the ecosystem and reducing volatility,\" he said in his post.","Morozov, the Telegram marketer, said the TON ecosystem has gone parabolic from late 2023 through today. New wallets are coming online daily as more people plug into a growing ecosystem of services, games and advertising platforms.","“The TON community is bigger than ever now,\" he said in a message on Telegram.","Edited by Aoyon Ashraf."],"entity":[{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Durov","content":"PERSON"},{"type":"Van Morozov","content":"PERSON"},{"type":"Serbia","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"$105","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Alex Cassasovici","content":"PERSON"},{"type":"150%","content":"PERCENT"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Pavel Durov","content":"PERSON"},{"type":"TON Blockchain)","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Sunday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"EURO","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Bespalov Finance","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$330 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Durov","content":"ORGANIZATION"}],"hashtag":["Analysis","TON","TON Coin","Telegram"],"authors":["Danny Nelson"]}