{"summary":"The Fahey\/Klein Gallery in Los Angeles will preview a collection of poems generated by an AI trained using Ginsberg’s literary body of work, supported by his estate.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/08\/01\/this-art-exhibit-is-bringing-new-life-to-allen-ginsbergs-poetry-using-ai\/","publishDate":"2023-08-01T21:59:31","id":15532,"type":null,"title":"This Art Exhibit Is Bringing New Life to Allen Ginsberg’s Poetry Using AI","category":["Web3"],"content":["The estate of acclaimed American poet and countercultural icon Allen Ginsberg is bringing new life to his art by using artificial intelligence (AI) to create new works based on his expansive literary archive.","Ginsberg, best known for his 1955 poem “Howl,” which celebrates the subversion of societal norms, died in 1997. His evocative work is widely credited for inspiring the literary subculture movement known as the Beat Generation.","Beginning on Aug. 10, the Fahey\/Klein Gallery in Los Angeles will unveil a new exhibition titled “Muses & Self: Photographs by Allen Ginsberg,” featuring photographs from Ginsberg’s collection. In addition, the gallery will host a preview of “A Picture of My Mind: Poems Written by Allen Ginsberg’s Photographs,” a collection of poems generated by an AI trained using Ginsberg’s literary body of work.","Read more: How Artists Can Create AI Data Sets","The exhibition runs through September and was developed in collaboration with non-fungible token (NFT) poetry gallery and digital community TheVERSEverse with support from the Tezos Foundation. The collection utilizes an AI-powered camera that turns visual imagery into text.","“In celebration of Ginsberg’s avowedly experimental impulses, this collaboration utilizes an AI-powered camera to ‘read’ a selection of Ginsberg photographs on view during the exhibition, translating his iconic vision of American counterculture into poetic responses influenced simultaneously by Ginsberg’s canon, his undeniable presence woven inextricably into the written record of the internet, and parsed by AI,” the gallery writes in its description of the exhibition.","“Just as Ginsberg innovated with automated writing techniques and popular technologies, this collection of AI-generated poems taps the contemporary linguistic avant-garde to engage ritualistically, intuitively and meaningfully with Ginsberg’s visual and poetic vernacular,” it adds.","The development of AI has accelerated in recent months following the mainstream proliferation of popular tools like Midjourney and ChatGPT. AI tools have been created to help artists across genres and disciplines, from music to art to text-based designs. AI tools have also been used to replicate the styles of particular artists, both living and post-mortem, though there have been allegations of misappropriation of these tools to steal artists’ work without credit.","Edited by Nick Baker.","\n","\n"],"entity":[{"type":"Tezos Foundation","content":"ORGANIZATION"},{"type":"Los Angeles","content":"LOCATION"},{"type":"“Muses & Self","content":"ORGANIZATION"},{"type":"Fahey\/Klein Gallery","content":"ORGANIZATION"},{"type":"1997","content":"DATE"},{"type":"Aug. 10","content":"DATE"},{"type":"1955","content":"DATE"},{"type":"Nick Baker","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Midjourney","content":"DATE"},{"type":"Allen Ginsberg","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Ginsberg","content":"ORGANIZATION"},{"type":"Ginsberg","content":"PERSON"}],"hashtag":["AI","Web3","DAO","theVERSEverse","Art"],"authors":["Rosie Perper"]}