{"summary":"A new digital wallet, launched by well-known asset manager WisdomTree, will bring tokenized assets and funds to the advisory and institutional spaces. Is the blockchain disruption to finance not as far off as we think?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/02\/03\/an-incumbent-enters-the-disruption-game\/","publishDate":"2022-02-03T13:50:00","id":15530,"type":null,"title":"An Incumbent Enters the Disruption Game","category":["Finance"],"content":["Beyond the popularity of investing in digital assets, futurists envision blockchain technology as a disrupter poised to reshape the entire finance and investment industry from top to bottom – and this future might not be as far off as we once thought.","“If you want to know what’s coming down the pike, it’s a tremendous amount of institutional and high-net-worth capital,” said Alex Lemberg, CEO of the Nimbus Platform, a decentralized finance (DeFi) investment service offering a series of income-generating strategies. “That’s not necessarily innovation, but that’s saying the market is growing from a liquidity perspective.”","This article originally appeared in Crypto for Advisors, CoinDesk’s weekly newsletter defining crypto, digital assets and the future of finance. Sign up here to receive it every Thursday.","Yet the growing market is itself pushing innovation, said Lemberg, who named the non-fungible token (NFT) space as one area that he’s watching closely.","“We can now fractionalize anything with an NFT, and that allows us to take any physical asset we’re very confident in the pricing trajectory for over the next 50-100 years and fractionalize the risk of ownership and make it liquid so people can trade it whenever they want to,” said Lemberg. “That’s a huge innovation because that is how the stock, bond and commodities markets work – now you’ll see cars, watches, art and physical assets creep in and gradually start to trade in the same way.”","Lemberg’s vision is another step closer to reality. Last week, traditional asset manager WisdomTree announced that it is launching WisdomTree Prime, a digital wallet that will be made available to investors via a mobile app.","Like any digital wallet, WisdomTree Prime allows investors to buy, hold, save and spend digital assets, said Will Peck, head of digital assets for WisdomTree.","“For us, that could mean bitcoin, that’s certainly the case for many investors, but it will also mean other tokenized versions of mainstream assets, like blockchain-enabled funds that can invest in securities,” said Peck, who added that WisdomTree is in the process of launching a line of such products. The company is also pursuing tokenized gold, real property and cash. “We think about it as offering a neobank-like experience in a digitally native wallet.”","The result is an offering unlike any currently available to investors, said Peck, where they can see their cryptocurrency, other digital assets, stocks, bonds, real property and banking assets within the same architecture and the same user experience.","WisdomTree is perhaps best known as an exchange-traded fund (ETF) sponsor, said Peck.","“We were asking if we could do to the ETF what the ETF did to the mutual fund,” he said. “We asked ourselves if there was some sort of superior technology that could act as a wrapper for products and types of exposures, and we pretty quickly came to crypto and blockchains for that.”","Peck and WisdomTree came to the conclusion that issuing and owning assets on the blockchain would ultimately improve the user experience because they reduce costs and increase the options available to investors.","In the traditional world, for example, payments, banking and investment technology stacks are kept separate, but cryptocurrencies have shown that people like having all three concepts built into a unified architecture –tokens like bitcoin and ether are capable of serving all three purposes.","Similarly, when securities are traded, there are usually an “immense” number of counterparties and intermediaries involved, said Peck, but over time blockchain is going to remove or consolidate those entities and offer users more transparency on costs.","“We believe there are a lot of efficiencies and consumer benefits to be gained from the unified user experience,” he said. “In the future we will offer new services and types of assets that will help remove intermediaries and lower the cost for people.”","As opposed to the wallets offered by cryptocurrency exchanges like Coinbase, Gemini and Crypto.com that give investors access to large lists of crypto assets, WisdomTree is going to offer a curated experience.","Peck believes that blockchain technology will continue the process started by investment technologists like Charles Schwab in making investing cheaper, easier and more widely available.","Eventually, WisdomTree will bring this technology to financial advisors.","“We’re starting at retail because that is the path we think makes the most sense to start our journey, but we’re not stopping there,” said Peck. “We will have an institutional user portal over time and serve institutional clients as well as advisory firms. We’re going to be expanding out in 2022 and 2023 to tailor this offering to financial advisors.”","WisdomTree is simultaneously continuing its pursuit of a spot bitcoin ETF, Peck said.","But DeFi thinkers like Lemberg believe the greatest potential lies in tokenizing any investable asset.","“There isn’t a single instrument that has been invented in the past 100 years that can’t be tokenized,” he said.","Lemberg added that though tokenization can present a better way of doing things, it likely won’t replace the incumbent financial industry.","For one thing, much of the investment and innovation to come in blockchain will be from institutions like banks and traditional asset managers like WisdomTree, said Lemberg.","“Because they already have some of the best technological resources out there, they will still be the biggest players, even in blockchain,” he said. “There is absolutely no worry that blockchain will compete with every bank, asset manager and hedge fund on the planet, their ability to deploy technology and research is a heck of a lot more mature than anything we see in the DeFi space.”","Instead, the big disruption will come from blockchain enabling more participants in the financial system.","“As someone who has been through a few decentralization events in finance over the last 30-plus years, I will tell you that initially it will be tough,” said Lemberg. “When I started you couldn’t trade an equity or an option on your own, you had to call me first. If you wanted to know what a quote was, you had to call me. Most of your ability to see a quote came out every day in the Investor's Business Daily or The Wall Street Journal.”","“When the ability to see markets trade in real time on your computer, when you got the ability to bypass brokerage services and trade on your own, both those things were mass decentralizations to the tune of trillions of dollars,” he continued.","“Now think about what we’re watching today. Did any of that really disrupt investment banking? No, it ended up being a huge positive for them. But for individual investors, there’s going to be a huge learning curve.”"],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"Lemberg","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Peck","content":"PERSON"},{"type":"Alex Lemberg","content":"PERSON"},{"type":"Charles Schwab","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last 30","content":"DATE"},{"type":"WisdomTree Prime","content":"ORGANIZATION"},{"type":"Will Peck","content":"PERSON"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Newsletters","Crypto for Advisors","Financial Advisors","WisdomTree","Digital Wallets","Finance"],"authors":["Christopher Robbins"]}