{"summary":"Interest rates and the dollar have both risen strongly in 2024 as expectations of a slowing in the economy and inflation have failed to pan out, but today's report suggests a possible change in trend.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/03\/us-april-job-additions-of-175k-miss-forecasts-for-243k\/","publishDate":"2024-05-03T12:36:07","id":15534,"type":null,"title":"U.S. April Job Additions of 175K Miss Forecasts for 243K, BTC Rises Above $60K","category":["Finance"],"content":["The U.S. economy added 175,000 jobs in April, according to the government's Nonfarm Payrolls report released Friday morning. That number stands against economist forecasts for 243,000 jobs and March's 315,000 (which was revised from a previously reported 303,000).","The unemployment rate for April was 3.9% versus forecasts for 3.8% and March's 3.8%.","The price of bitcoin (BTC) jumped more than 1% to $60,100 in the minutes following the news.","Interest rates and the U.S. dollar have both risen strongly in 2024, particularly over the past few weeks, as market expectations of a slowing in economic growth and inflation have failed to pan out. Four months ago, a series of five or six 2024 interest rate cuts by the U.S. Federal Reserve had been priced into forward markets, but, prior today, that was whittled down to one or two, according to the CME FedWatch Tool.","In fact, interest rate hikes have begun to enter the chat. At his post-FOMC press conference Wednesday afternoon, Fed Chair Jerome Powell was asked more than once if the central bank was mulling the idea that rates needed to be ratcheted higher. Powell poured cold water over the idea, but continued strong job growth and perky inflation might force the Fed's hand at some point.","That tighter than anticipated monetary policy is surely among the array of factors have led bitcoin to tumble roughly 20% from its all-time high reached in mid-March, but this morning's report suggests a change a possible change in trend and prices are bouncing.","Traditional markets are also taking the news well. U.S. stock index futures are now all higher by more than 1% and the 10-year Treasury yield has tumbled 11 basis points to 4.47%. The dollar index has fallen 0.8% and the price of gold has risen 0.8% to $2,329 per ounce.","A check of other report details shows some weakness as well, with average hourly earnings in April up 0.2% against forecasts for 0.3% and March's 0.3%. On a year-over-year basis, average hourly earnings rose 3.9% versus forecasts for 4% and March's 4.1%."],"entity":[{"type":"this morning","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"3.8%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CME FedWatch Tool","content":"ORGANIZATION"},{"type":"4.1%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"0.3%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"4.47%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"$2,329","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"afternoon","content":"TIME"},{"type":"3.9%","content":"PERCENT"},{"type":"$60,100","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"0.8%","content":"PERCENT"},{"type":"0.2%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"}],"hashtag":["Employment","Payroll","Interest Rates","Bitcoin"],"authors":["Stephen Alpher"]}