{"summary":"Jatinder Singh and his partner bought four houses, cars, artwork and other luxurious items with money they received due to an accounting error by Crypto.com, according to the Guardian.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/09\/25\/australian-man-who-spent-67m-erroneous-cryptocom-refund-faces-theft-charges-guardian-reports\/","publishDate":"2023-09-25T16:09:03","id":15549,"type":null,"title":"Australian Man Who Spent $6.7M Erroneous Crypto.com Refund Faces Theft Charges, Guardian Reports","category":["Finance"],"content":["Lucky or unlucky? A man in Australia who mistakenly received nearly 10.5 million Australian dollars (AUSD) from Crypto.com will appear in court next month on theft charges, the Guardian reported.","Jatinder Singh will attend a plea hearing on Oct. 23 at the County Court of Victoria in Australia for failing to report that he received AUSD 10.47 million (roughly $6.7 million) from Crypto.com in 2021. Singh used the money –sent to him because of an accounting error – to buy four houses, cars, art, furniture and other things, The Guardian reported.","A lawyer for Singh wasn’t immediately available to respond to CoinDesk’s request for comment.","The accounting error occurred when a Crypto.com worker accidentally entered Singh's account number into a company spreadsheet tracking customer refunds, according to the publication. The company discovered the massive overpayment seven months later, in December 2021.","Singh attempted to transfer funds into a Crypto.com account in 2020, using the bank account of his partner, Thevamanogari Manivel. However, the company rejected the payment and attempted to refund Singh roughly AUSD 64 because the name on the bank account did not match the name on the Crypto.com account.","Singh discovered he had been overpaid the day after receiving the millions of dollars from Crypto.com. After becoming aware of the error, he instructed his partner to transfer much of the funds to a joint Westpac account, and transferred AUSD 4 million to a bank account in Malaysia, The Guardian reported.","Manivel received an 18-month sentence after pleading guilty to theft. It remains unclear whether or not Singh intends to plead guilty.","Edited by Bradley Keoun."],"entity":[{"type":"2021","content":"DATE"},{"type":"$6.7 million","content":"MONEY"},{"type":"Westpac","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Thevamanogari Manivel","content":"PERSON"},{"type":"December 2021","content":"DATE"},{"type":"Australia","content":"LOCATION"},{"type":"Oct. 23","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Jatinder Singh","content":"PERSON"},{"type":"Singh","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"the County Court of Victoria","content":"ORGANIZATION"},{"type":"10.5 million Australian dollars","content":"MONEY"}],"hashtag":["Crypto.com","Cronos","Australia","Crime"],"authors":["Elizabeth Napolitano"]}