{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 21-26.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/20\/protocol-village\/","publishDate":"2024-03-27T17:28:49","id":15540,"type":null,"title":"Protocol Village: Algorand Claims First L1 Using Python as Programming Language","category":["Technology"],"content":["March 27: Algorand Foundation launched AlgoKit 2.0, claiming that it makes Algorand the first layer-1 blockchain to use Python as a native programming language. According to the team: \"Popular apps like Instagram, Spotify and Uber are written in Python, used by more than 10 million software developers worldwide. AlgoKit 2.0 is an upgrade to the AlgoKit command line interface (CLI) – a simple, one-stop toolset for building on Algorand. It empowers developers to write Web3 apps in regular Python. The toolkit has been internally re-architected with an improved templating system for an overall more streamlined developer experience.\" (ALGO)","March 27: Elixir Games, a leading Web3 gaming distribution platform backed by Square Enix, announced the close of its seed funding round, raising $14 million to spearhead development of a comprehensive global gaming ecosystem that will launch later this year. According to the team: \"The additional funding will also support the launch of the ELIX token, which will power Elixir Games products, as well as the Launchpad & Incubation Program, also arriving in 2024. Investors in the Seed round include Square Enix, the Solana Foundation and Shima Capital, among other private entities.\"","March 27: Portal, a fintech infrastructure provider building a Bitcoin-based DEX, unveiled RAFA, its AI-powered investing copilot engineered to provide financial intelligence for traditional and crypto markets. According to the team: \"RAFA is capable of providing generative AI-powered financial intelligence across traditional assets, such as stocks, ETFs, mutual funds and bonds, and digital assets, including cryptocurrencies and non-fungible tokens (NFTs). RAFA uses a team of AI Agents to analyze millions of data points which are sued to inform models for users' portfolios.\"","March 27: Layer-1 blockchain Peaq said it raised $15 million in funding to expand its ecosystem of decentralized physical infrastructure (DePIN) networks. The funding round, led by Generative Ventures and Borderless Capital and featuring participation from Spartan Group, CMCC Global and Animoca Brands, comes ahead of the blockchain's mainnet launch and listing of the PEAQ token.","March 27: BOB, a hybrid layer-2 network – connected to the Bitcoin blockchain, but with Ethereum compatibility – has raised $10 million in seed funding. The round was led by Castle Island Ventures and included participation from Mechanism Ventures, Bankless Ventures, CMS Ventures, UTXO Management, along with angel investors Dan Held and Domo, creator of the BRC-20 token standard.","March 27: Fetch.ai, SingularityNET and Ocean Protocol agreed to merge tokens and create an alliance for decentralized artificial intelligence (AI). The three are seeking to create an AI collective, providing a decentralized alternative to existing projects that are controlled by large technology companies, according to an emailed announcement on Wednesday.","March 27: MyShell, a Tokyo-based decentralized AI platform used to create \"AI girlfriends,\" has raised $11 million in pre-series A funding for its AI app-building ecosystem. The investment, which brings MyShell's total funding to $16.6 million, was led by Dragonfly, with additional participation from Delphi Ventures, Bankless Ventures, Maven11 Capital, Nascent, Nomad Capital and OKX Ventures. The round also attracted support from individual investors such as crypto investor and thought leader Balaji Srinivasan, NEAR's Illia Polosukhin and Paradigm's Casey K. Caruso.","March 27: NEAR Foundation, the non-profit behind the layer-1 NEAR Protocol, announced that the protocol now supports chain signatures, offering users multichain access from their NEAR account. The chain signatures network is secured in part by EigenLayer, which joins NEAR as a launch partner, according to a press release. EigenLayer is a restaking project built on Ethereum.","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","March 26: Illuvium, describing itself as \"a decentralized studio building the world's first interoperable blockchain game universe,\" has raised $12 million in a Series A round, from investors including King River Capital, Arrington and Animoca. The funding will be allocated to developing new gaming titles within the Illuvium ecosystem, according to a press release, and brings the cumulative total to $60 million. \"The concept of redirecting 100% of all in-game revenues to staked investors is a major draw for ILV, resonating strongly with our community,\" Kieran Warwick, co-founder and CEO, said in a press release. (ILV)","March 26: Ankr, a blockchain node provider, introduced \"Neura\" protocol – a blockchain blending AI, cloud and Web3 on Cosmos SDK architecture, \"for better scalability and interoperability,\" according to the team: \"Features include a decentralized GPU marketplace, ANKR token economy, novel token standards, and off-chain storage with Celestia and IPFS, aiming for improved AI model deployment and data security. Chandler Song, Ankr’s CEO, highlights its potential to transform AI and blockchain integration.\"","March 26: Moondance Labs, the creators behind Tanssi Network, an appchain infrastructure protocol, has successfully raised $6 million in a strategic funding round to bolster Tanssi's ongoing development and enable team expansion. According to the team, an incentivized TestNet campaign is also being pre-announced.","March 26: Babylon and B² Network announced that B² will integrate Babylon's BTC Staking protocol \"to enhance the security of B² Network's Data Availability Layer and the B² Hub.\" According to the team: \"The partnership will utilize Babylon's BTC timestamping protocol to guard against long-range attacks on the B² Hub helping safeguard the PoS mechanism. Additionally, through the collaboration, the B² Network will join Babylon's BTC Staking protocol to help foster liquidity through BTC Staking and Restaking while empowering BTC DeFi.\"","March 26: A16z, the venture capital firm, publicized that its \"Crypto Startup Accelerator (CSX) Spring 2024 program kicks off this week, with the founders of 25 early-stage startups gathered in London.\" According to the team: \"Over 10 weeks, they’ll learn from each other and receive guidance\/resources from the a16z crypto team, speeding up their path to product-market fit and setting them up for long-term success. The founders of these 25 companies look to advance core sectors of the crypto ecosystems, including infrastructure, consumer apps, DeFi, payments, games, dev tools and DePIN.\"","March 26: Borderless Capital has acquired CTF Capital, a quantitative trading and asset management firm, expands its global presence in Latin America. According to the team: \"The integration strengthens Borderless's funds now exceeding $500 million in assets under management with performant products and strategies for capital deployment. The acquisition expands Borderless's footprint in LatAm, with plans to open a new office in Argentina as its regional HQ, furthering its commitment to Web3 growth and innovation.","March 26: Civic, provider of a multi-chain, wallet-agnostic identity solution, has announced its physical ID card as part of the Civic ID System, \"marking a step forward in private, compliant, and user-focused identity solutions.\" According to the team: \"The physical ID card, when layered with the Civic Pass, akin to a soul-bound identity token, will help to combat AI-driven fraud, airdrop farming, face-farming and other fraudulent activities that take place digitally. By bridging digital and physical worlds through a globally accepted physical ID card, the new Civic ID System will ensure comprehensive human identity verification. The ID card is usable and receivable across 190 countries.\"","March 26: The Graph, the indexing and query layer of Web3, and the Google of Web3, is proud to announce the completion of the Sunray phase. According to a blog post, Sunray brings several new features, \"each significantly enhancing the developer experience.\" They include a simplified upgrade interface, 100,000 free queries per month and easy billing with credit and debit card payments.","March 26: SKALE, the gasless blockchain, just announced $2 million in grants for GDC attendees. GDC stands for \"Game Developer Conference,\" in San Francisco. According to the team: \"You'll receive funds, tech support, and marketing and join a strong SKALE gaming community with over 23 Million users. Indie game devs, gaming studios, Web2 and Web3 games are all encouraged to apply. Applications are due April 5.\"","March 26: Radicle, an open-source, peer-to-peer code collaboration stack, announced the launch of Radicle 1.0. According to the team: \"The release marks a significant milestone in the protocol’s journey. Unveiled today, Radicle 1.0 is set to transform the way developers publish and distribute open-source code, AI models and research. Conceived as a decentralized alternative to centralized forges like GitHub and GitLab, Radicle extends the capabilities of these systems with a decentralized identity system, gossip protocol, and integrated social artifacts which together form a self-hosted network for code collaboration.","March 26: MyPrize, founded by Zach Bruch and describing itself as an \"online crypto casino enabling immersive multiplayer experiences,\" emerged from stealth and disclosed having raised $13 million over two rounds of financing, backed by Dragonfly and Boxcar Ventures. According to the team: \"Users can gamble directly alongside their favorite creators and friends, introducing deep social media integration into an online casino for the first time and introducing entirely new ways for players to interact with their favorite streamers.\"","March 26: Bella Protocol, for helping liquidity providers optimize yields and returns, announced in a blog post that it's \"partnering with AlphaNet, a cutting-edge AI platform for crypto trading powered by Phoenix.\" According to the team: \"Through AlphaNet’s diverse technology stack, Bella Protocol’s users will be able to access advanced trading experiences and superior risk-adjusted returns secured by AI signals and strategies. Bella will be one of the first partners to have access to AlphaNet Hypermatrix, a state-of-the-art custom AI trading strategy computing platform.\"","March 26: OrdinalsBot, the team behind the API-first company in the Ordinals ecosystem, raised more than $3 million in new seed funding round led by DACM with participation from Eden Block, Nural Capital, WWVentures, Lightning Ventures, Oak Grove Ventures, UTXO Management (a fund manager of Bitcoin Magazine), Kenetic Capital, CMS Holdings, Kestrel0x1, Sora Ventures, London Real Ventures, Crypto Zombie, MDX Crypto and other industry leaders and crypto influencers across the ecosystem.","March 26: Tether, the issuer of the world's largest stablecoin, is establishing a unit focused on artificial intelligence (AI) and has started a recruitment drive to help fill it. The unit will focus on the development of open-source AI models and collaborate with other firms to integrate them into products that could address real-world challenges, the company announced on Tuesday.","March 26: Spectral Labs, a crypto development firm focused on artificial intelligence, wants to make it easier for non-programmers to build on blockchains. On Tuesday the company will launch Syntax, an AI app that can help anyone – coders and non-coders alike – spin up smart contracts for Ethereum and dozens of other blockchains.","March 26: Bitcoin finance layer ALEX raised $10 million in a round led by Spartan Capital. Other investors include CMS Holdings, DACM, DWF Labs, Foresight Ventures, G-20 Group, Ouroboros Capital, Summer Capital, Cultur3 Capital, EVG. According to the team: \"ALEX leverages layer 2s, bridges, oracles and other infrastructure to create a Bitcoin-specific decentralized finance layer, using leading Bitcoin layer-2 Stacks as the chassis.\"","March 25: Allen Day, head of Web3 developer relations at Google Cloud, is joining Dovey Wan's Primitive Ventures as a venture partner. According to a message from Wan: \"He will focus on key areas such as the intersection of AI and crypto, decentralized data and compute stacks, and next-generation cryptographic schemes and validation mechanisms.\"","March 25: The Worldcoin Foundation open-sourced core components of the orb’s software, now publicly available on GitHub under an MIT\/Apache 2.0 dual license, according to a blog post dated March 22: \"These new open components complement the previously-released hardware and iris recognition repositories, and their public availability marks significant progress in making the Orb’s image processing transparent and its privacy claims verifiable.\" (WLD)","March 25: Dominic Williams, chief scientist at Dfinity Foundation, posted a video on X of what he claimed was the world's first \"demonstration of AI running *on* blockchain as a smart contract.\" According to Williams: \"Code will follow shortly. This is running on Dfinity's Internet Computer testnet, but you'll be able to take the code and run it on the public network as the NNS is expected to up the per-transaction instruction limit in the coming days.\" (ICP)","March 25: OKX and Immutable have entered a strategic partnership, \"which includes the introduction of a GameFi NFT launchpad and integration of Immutable's gaming-focused zkEVM chain into OKX Marketplace and OKX Wallet,\" according to the team: \"This partnership will benefit game studios, players, and gaming ecosystem participants with:","March 25: StaFi, describing itself as the \"first liquid staking protocol for multiple PoS chains,\" launched its \"Liquid Staking as a Service\" (LSAAS) testnet for StaFi 2.0, rebranded as an \"LSD Infra Layer,\" according to the team: \"Featuring liquid staking derivatives (LSD) for Ethereum, EVM layer 2s and Cosmos, alongside a CosmWasm LSD framework, StaFi 2.0 seeks to unify the fragmented liquid staking landscape.\" According to the project documentation, \"StaFi aims to solve the contradiction between mainnet security and token liquidity in PoS consensus.\"","March 25: Binance Academy and BNB Chain, the largest layer-1 blockchain by user count, have partnered to launch a new online course, \"BNB Chain Developer Specialization,\" which aims to equip future Web3 software developers with the skills needed to encourage more building in the Web3, crypto and technology industry, according to the team: \"Each course features between two to six videos, exploring topics like Blockchain Basics, BNB Chain, Smart Contracts, Solidity, Web3, Decentralized Applications (DApps), Oracles and DeFi. It requires no prior knowledge of blockchain fundamentals and is free of charge.\"","March 22: Web3 infrastructure provider Entangle, powered by underlying primitive \"liquid vaults,\" announced that it has received strategic investment from Consensys, the Ethereum-focused developer. According to the team: \"The funding provided by the blockchain incubator takes the total funding received by Entangle to $4M. The Entangle mainnet is on course to launch in April. A large and engaged community has coalesced around the infrastructure project, resulting in the Entangle testnet attracting 250,000 users. The community has completed 1.5M testnet transactions, allowing developers to assess the network’s performance ahead of mainnet deployment.\"","March 22: Rollie Finance, describing itself as \"the first one-swipe AI trading perpetual exchange on Scroll,\" announced that it has raised a seed round of funding from Animoca Ventures; M77 Ventures; Sandy Peng, co-founder of Scroll; Alex Lee, founder of Wombat Exchange; and Kate Wong, COO of RSS3. According to the team: \"Inside the simple one-swipe-trading interface, numerous trading algorithms, years of trading experience, real-time on-chain data, AI analysis and more are simultaneously implemented in the background to ensure the trade is both simple and sophisticated.\"","March 22: Succinct, developer of a zero-knowledge virtual machine and a decentralized prover network, announced a fundraise of $55M led by Paradigm. According to the team: \"The total raised comes across a Seed and Series A round, with participation from Robot Ventures, Bankless Ventures, Geometry, ZK Validator and angels including Sreeram Kannan from Eigenlayer, Sandeep Nailwal and Daniel Lubarov from Polygon and Elad Gil.\"","March 22: GAM3S.GG, a Web3 gaming platform with a \"superapp,\" raised $2 million and is preparing to launch its $G3 token, according to the team: \"The round featured a host of leading VCs iincluding Merit Circle, WWVentures, Cogitent Ventures, P2 Ventures, Cypher Capital, Acheron, Basics Capital, OIG Capital, BreederDAO, Hercules Ventures and angels like Polygon co-founder Sandeep Nailwal, YGG co-founder Gabby Dizon, Sky Mavis & Ronin co-founder Jiho Zirlin.\"","March 21 (PROTOCOL VILLAGE EXCLUSIVE): The team behind Fluence network, which describes itself as \"a decentralized serverless platform and computing marketplace powered by blockchain economics,\" announced that the Fluence Cloudless Platform is now live, \"offering a cloudless and decentralized alternative to enterprise cloud computing providers such as AWS and Google Cloud,\" according to the team: \"The platform leverages a decentralized serverless compute network to provide a solution that is resilient and auditable while offering flexibility and cost-efficiency to providers and users.\"","March 21: Movement, a network of Move-based blockchains, announced that it's planning to expand the Move DeFi ecosystem through a collaboration with Thala, a leading Move DeFi platform, according to the team. \"Movement will bring Thala's DeFi suite, including its DEX, stablecoin and launchpad, to the Ethereum ecosystem via M2. This will allow Thala to tap into the vast EVM user base and liquidity pool, while still leveraging the security and speed of the Move language.","March 21: Morph, a fully permissionless Ethereum Virtual Machine (EVM) layer 2 for value-driven dApps, announced the close of a $19 million seed round, led by DragonFly Capital with additional participation from Pantera Capital, Foresight Ventures, The Spartan Group, MEXC Ventures, Symbolic Capital, Public Works, MH Ventures, Everyrealm, with an additional $1MM raised in an angel round. According to the press release: \"The innovative technology is built within three key pillars – decentralized sequencer, optimistic zkEVM integration and modular design.\"","March 21: Elastos, a blockchain project, announced BTC Oracle, \"a radical new solution that will enable every EVM-compatible blockchain to be a Bitcoin L2, the most comprehensive solution for cross-chain operability involving Bitcoin and EVM blockchains yet.\" According to the team: \"The BTC Oracle is part of Elastos’s BTC L2, 'BeL2,' the first BTC L2 to enable the direct development and management of Bitcoin-native smart contracts. Elastos’ BTC Oracle acts as a zero-knowledge proof data feed that provides real-time Bitcoin information to EVM smart contracts. A prototype is now available to illustrate how you can stake ELA in return for Bitcoin rewards.\"","March 21: Espresso, a leading specialist in the emerging blockchain field of \"shared sequencing,\" has raised $28 million in a series B round led by venture capital firm Andreessen Horowitz's a16z Crypto, according to a press release. The investment round closed in February, and the funding will be used to continue to build out Espresso’s products, invest in the broader rollup ecosystem, and hire additional people for Espresso.","March 21: Babylon and Nubit announced a collaboration to integrate Babylon's Bitcoin staking and timestamping protocols, to enhance Nubit's Bitcoin-native data availability layer. According to the team: \"Through this collaboration, Bitcoin L2s, DeFi, indexers and other systems that want to use Bitcoin for security and data availability will find a native and efficient solution. The partnership will leverage tech advancements to improve Bitcoin’s utility and accessibility, aiming to inherit Bitcoin’s complete censorship resistance and economic security to ensure a robust and resilient infrastructure for Bitcoin’s future growth.\" Nubit claims on its website to be the \"first Bitcoin-native data availability layer.\"","March 21: Core Foundation has unveiled Core Venture Network (CVN), \"comprising a community of 50 venture capitalists and other investors dedicated to offering resources, funding and strategic counsel for dApp development on Core Chain, the blockchain secured by Bitcoin and EVM-compatible (Ethereum Virtual Machine). Alongside its launch, the Core Venture Network announces $15M in regional ecosystem funds. Notable members of the Core Venture Network include Foresight Ventures, Marin Digital Ventures, Brinc VC, Mexc Ventures, CoinSwitch and others.\"","March 21: XPLA, a gaming-focused blockchain based on the Tendermint consensus engine, and Matter Labs, a software development, engineering, and cryptography company developing software for zkSync, announced a collaboration designed to advance the development and deployment of Web3 games through the newly created zkXPLA ecosystem. According to a press release: \"The zkXPLA mainnet is designed to support Web3 games and projects expanding to the Ethereum ecosystem while offering interchain integration, as well as facilitating the onboarding of new gaming titles, entertainment experiences, as well as public projects with financial companies and government agencies. The hyperchain infrastructure on zkSync will further optimize the deployment of games by publishers and developers via zkXPLA and offer a seamless end-to-end gaming environment with enhanced security, transparency, and lower transaction fees.","March 21: Bitcoin L2 Mintlayer is announcing an upgrade to its staking program UI to make it easier to use and more accessible, according to the team: \"Its simplified staking program is integrated into a combination of its block explorer and Mojito wallet browser extension, which enables Mintlayer users to stake their ML tokens and earn rewards. Aside from being used to secure the Mintlayer network through staking, the ML token is used to pay transaction fees on the Bitcoin sidechain.\"","March 21: VeChain announced the winners of its most recent hackathon hosted at the University of Cambridge in partnership with EasyA and with participation from BCG. According to the team: \"The hackathon encouraged the development of the VeBetterDAO platform, a sustainable ecosystem designed to incentivize enterprise and individual positive impact and resulted in 50+ X-2-Earn projects. VeChain track winner: Meatless, an app that incentivizes buying sustainable food products BCG track winner: EcoNex, an app promoting eco-friendly travel Pitch-a-thon track winner: LogiQ, an app designed to streamline trucks freight-sharing.\"","Edited by Bradley Keoun.","\n"],"entity":[{"type":"Allen Day","content":"PERSON"},{"type":"CTF Capital","content":"ORGANIZATION"},{"type":"Rollie Finance","content":"ORGANIZATION"},{"type":"Animoca Ventures","content":"LOCATION"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"BCG","content":"ORGANIZATION"},{"type":"AlphaNet","content":"ORGANIZATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$28 million","content":"MONEY"},{"type":"Bitcoin L2s","content":"PERSON"},{"type":"Babylon","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"20 Group","content":"ORGANIZATION"},{"type":"Kieran Warwick","content":"PERSON"},{"type":"Tanssi Network","content":"ORGANIZATION"},{"type":"April 5","content":"DATE"},{"type":"AlphaNet Hypermatrix","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Zach Bruch","content":"PERSON"},{"type":"BTC Oracle","content":"ORGANIZATION"},{"type":"Sunray","content":"LOCATION"},{"type":"Jiho Zirlin","content":"PERSON"},{"type":"Nubit","content":"ORGANIZATION"},{"type":"Tanssi","content":"ORGANIZATION"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Eden Block","content":"ORGANIZATION"},{"type":"Dfinity Foundation","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Dominic Williams","content":"PERSON"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"Crypto Zombie","content":"PERSON"},{"type":"BNB Chain Developer Specialization","content":"ORGANIZATION"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"$4M","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Everyrealm","content":"LOCATION"},{"type":"Daniel Lubarov","content":"PERSON"},{"type":"Generative Ventures","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Mechanism Ventures","content":"ORGANIZATION"},{"type":"Marin Digital Ventures","content":"ORGANIZATION"},{"type":"Domo","content":"ORGANIZATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Arrington","content":"PERSON"},{"type":"Moondance Labs","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"GitLab","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Ocean Protocol","content":"ORGANIZATION"},{"type":"Elad Gil","content":"ORGANIZATION"},{"type":"Tokyo","content":"LOCATION"},{"type":"UTXO Management","content":"ORGANIZATION"},{"type":"Phoenix","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Borderless","content":"ORGANIZATION"},{"type":"$19 million","content":"MONEY"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"MDX Crypto","content":"ORGANIZATION"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine)","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Radicle","content":"ORGANIZATION"},{"type":"Geometry","content":"ORGANIZATION"},{"type":"Babylon","content":"LOCATION"},{"type":"Hercules Ventures","content":"ORGANIZATION"},{"type":"\"Game Developer Conference","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"DragonFly Capital","content":"ORGANIZATION"},{"type":"OIG","content":"ORGANIZATION"},{"type":"Kate Wong","content":"PERSON"},{"type":"Algorand Foundation","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"$13 million","content":"MONEY"},{"type":"Bankless Ventures","content":"ORGANIZATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Peaq","content":"PERSON"},{"type":"$16.6 million","content":"MONEY"},{"type":"Enix","content":"ORGANIZATION"},{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"CoinSwitch","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"NNS","content":"ORGANIZATION"},{"type":"Casey K. Caruso","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"ICP","content":"LOCATION"},{"type":"Spartan Capital","content":"ORGANIZATION"},{"type":"Thala","content":"LOCATION"},{"type":"Nomad Capital","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"Binance Academy","content":"ORGANIZATION"},{"type":"Sandy Peng","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"Mexc Ventures","content":"ORGANIZATION"},{"type":"Square Enix","content":"ORGANIZATION"},{"type":"Launchpad & Incubation Program","content":"ORGANIZATION"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Dan Held","content":"PERSON"},{"type":"Lightning Ventures","content":"ORGANIZATION"},{"type":"Delphi Ventures","content":"ORGANIZATION"},{"type":"Python","content":"PERSON"},{"type":"Python","content":"LOCATION"},{"type":"Dovey Wan's Primitive Ventures","content":"ORGANIZATION"},{"type":"Sora Ventures","content":"ORGANIZATION"},{"type":"Alex Lee","content":"PERSON"},{"type":"the University of Cambridge","content":"ORGANIZATION"},{"type":"Dfinity","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Core Foundation","content":"ORGANIZATION"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"CSX","content":"ORGANIZATION"},{"type":"Sky Mavis & Ronin","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"March 27","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"March 26","content":"DATE"},{"type":"Cogitent Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"March 25","content":"DATE"},{"type":"March 22","content":"DATE"},{"type":"Blockchain Basics","content":"PERSON"},{"type":"Nascent","content":"ORGANIZATION"},{"type":"March 21","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"$15M","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Oak Grove Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"AWS","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"$55M","content":"MONEY"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Spring","content":"DATE"},{"type":"CMS Ventures","content":"ORGANIZATION"},{"type":"Gabby Dizon","content":"PERSON"},{"type":"GDC","content":"ORGANIZATION"},{"type":"Boxcar Ventures","content":"ORGANIZATION"},{"type":"Williams","content":"ORGANIZATION"},{"type":"Ethereum compatibility –","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Nural Capital","content":"ORGANIZATION"},{"type":"Core Venture Network","content":"ORGANIZATION"},{"type":"MH Ventures","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Bitcoin L2 Mintlayer","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$G3","content":"MONEY"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"The Worldcoin Foundation","content":"ORGANIZATION"},{"type":"$1MM","content":"MONEY"},{"type":"NEAR Foundation","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}