{"summary":"The platform’s v2 allows sub-second trades and trading without a crypto wallet, the company said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/10\/03\/decentralized-exchange-bluefins-new-version-goes-live-on-sui-network\/","publishDate":"2023-10-03T14:53:47","id":15545,"type":null,"title":"Decentralized Exchange Bluefin’s New Version Goes Live on Sui Network","category":["Markets"],"content":["Decentralized orderbook exchange Bluefin’s upgraded version called “v2” went live on the Sui network, the company Tuesday said in a press release.","The platform’s new iteration adds features such as sub-second, optimistic trades, spot and cross-margin capabilities and a privacy function to trade without a crypto wallet.","The first version of the platform – Bluefin v1, which lets users trade perpetual swaps on Ethereum scaling network Arbitrum – will remain active, the company said.","“Over the course of this year, we’ve rewritten our codebase and rebuilt the exchange on a new underlying technology,” Bluefin said in the press release. “With the next version of the exchange, we want to build a decentralized platform that can match the features and trading experience of centralized exchanges.”","Bluefin’s development comes at a time when crypto trading volumes have dropped significantly as the grueling bear market drags on. DEX volumes averaged at around $10 billion per week recently compared to topping over $60 billion last November, according to DefiLlama data.","Decentralized exchanges (DEXs) came to the forefront last year after a handful of centralized platforms including Sam Bankman-Fried’s FTX blew up in a spectacular fashion. Still, most of the trading volume is still concentrated on centralized platforms due to usually cheaper transactions and speedier execution.","Bluefin’s v2 claims to improve the speed with so-called “optimistic trade confirmations,” settling the trade on the platform’s user interface in advance before finalizing it on the blockchain The platform’s redesigned off-chain orderbook layer can start sending optimistic confirmations of trades in around 30 milliseconds back to users, then ensuring the trade with the on-chain smart contracts in around 480 milliseconds, the press release explained.","“With Sui’s parallel execution, the availability of the network is not constrained by other applications and users. As a result, the success rate of transactions submitted on-chain is extremely high,” the press release said.","Bluefin raised funds from investors such as Polychain Capital and large trading firms like Susquehanna, Wintermute, GSR and Wintermute, according to the platform’s website.","Edited by Stephen Alpher."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Wintermute","content":"PERSON"},{"type":"Susquehanna","content":"LOCATION"},{"type":"$10 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"” Bluefin","content":"ORGANIZATION"},{"type":"$60 billion","content":"MONEY"}],"hashtag":["Decentralized exchange","DEX","Derivatives","Susquehanna international group","Polychain Capital"],"authors":["Krisztian Sandor"]}