{"summary":"A survey of swing-state voters shows that as many as 21% of them are serious about crypto policies, though more than two thirds of people distrust the digital-assets movement.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/07\/poll-most-people-cringe-about-crypto-but-enough-care-to-warrant-politicians-attention\/","publishDate":"2024-05-07T12:00:00","id":15542,"type":null,"title":"Poll: Most People Cringe About Crypto, But Enough Care to Warrant Politicians' Attention","category":["Policy"],"content":["As U.S. politicians continue to wrestle with how to approach crypto issues, about 21% of voters in vital swing states consider cryptocurrency policies as a topic important enough to sway their support, according to a Harris Poll survey commissioned by the industry, though it leaves some uncertainty about what the voters may end up clamoring for.","While millions of crypto industry dollars are pouring into campaigns and top candidates try out stances on digital assets, the voters who care the most may not be on the same side of the issue. The challenge for the industry could be in figuring out whether the high level of interest is going to help its cause.","“This data shows crypto is top of mind for voters in swing Senate states and that a pro-crypto position is a net positive for policymakers and candidates,” concluded Julie Stitzel, senior vice president of policy at Digital Currency Group, which commissioned the polling and sees its results as positive.","About 14% of people in the online survey of registered voters own crypto right now, they said, and many more have a high awareness of the emerging financial technology. But fewer than one in three voters surveyed – 31% – said they have positive views on digital assets, according to the snapshot of responses from people in Michigan, Ohio, Montana, Pennsylvania and Arizona.","Those in the crypto-positive group who say they'll weigh crypto positions in their voting decisions represent about 13% of respondents. That leaves 8% who may not be as enthusiastic about policies friendly to digital assets – a split that may leave this year's candidates uncertain about which way to lean, despite industry hopes.","Though most of the swing-state voters — on whose shoulders the presidential selection and the congressional majorities could rest – may distrust crypto, even more of them think the current financial system is outdated (70%) and needs to be overhauled (74%). A significant 41% of them also granted that crypto may represent a path to financial security (41%).","More than two thirds of the respondents don't think federal officials – including the president and Congress – are up to the task of making good policy decisions on crypto.","Whatever side the voters land on, Kristin Smith, CEO of the Blockchain Association, noted in a statement that the poll demonstrates \"digital assets have emerged as a significant issue in the upcoming election.\"","The data suggests that as many as 47 million people may be holding digital assets, if 14% of the wider U.S. population also own crypto, which is a lot of voters to contend with. The survey indicates they represent a fairly close balance between the two political parties, favoring the conservative side a bit. The survey, though, suggested that pro-crypto voters may be slightly less inclined than others to show up to vote.","In another noteworthy finding, the survey results may also hint that the industry shouldn't count on a massive segment of the public waiting on the sidelines to invest in cryptocurrencies, with only 7% of those who don't own any saying they still intend to jump in. However, about half of the people said they'd be more interested if established, big-name financial firms were involved and also if the government puts protections in place.","Read More: Trump is Clear Favorite Among Crypto-Owning Voters in U.S. Presidential Race: Poll","Edited by Nikhilesh De."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Michigan","content":"LOCATION"},{"type":"Kristin Smith","content":"PERSON"},{"type":"21%","content":"PERCENT"},{"type":"31%","content":"PERCENT"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"74%","content":"PERCENT"},{"type":"41%","content":"PERCENT"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Montana","content":"LOCATION"},{"type":"14%","content":"PERCENT"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"13%","content":"PERCENT"},{"type":"Arizona","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Julie Stitzel","content":"PERSON"}],"hashtag":["Regulations","Politics","poll","Election 2024","US Elections"],"authors":["Jesse Hamilton"]}