{"summary":"Ophelia Snyder says it is impossible to conceptualize the changes in bitcoin trading volumes likely through ETF inflows.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/01\/10\/bitcoin-etf-listings-will-be-quick-but-money-flows-could-take-months-21shares-co-founder\/","publishDate":"2024-01-10T21:46:27","id":15546,"type":null,"title":"Bitcoin ETF Listings Will Be Quick but Money Flows Could Take Months: 21Shares Co-Founder","category":["Finance"],"content":["With the first spot bitcoin exchange-traded funds (ETFs) finally approved in the U.S., listings on exchanges could occur within days, said Ophelia Snyder, co-founder of crypto custodian 21Shares. Gauging their effect on the market is likely to take months.","Wealth-management firms must adhere to various processes before they can add the ETFs to their list of approved allocations, said Snyder, whose Zug, Switzerland-based firm teamed up with Cathie Wood's ARK Invest to propose an ETF that was among those winning approval from the Securities and Exchange Commission (SEC) on Wednesday.","Read more: Bitcoin ETFs Win SEC Approval, Bringing Easier Access to Biggest Cryptocurrency","\"That typically takes 90 days, so we're not even going to begin to see what this actually looks like for at least a quarter,\" Snyder said in an interview. \"Just because a product's available to trade on does not actually mean that every adviser in America can buy it ... it requires a lot of compliance for them to add the tickers – they don't get added by default.\"","For full coverage of bitcoin ETFs, click here.","Snyder said she expects the first funds to list on exchanges within two days, the same as it took the ProShares Bitcoin Strategy (BITO) ETF after its approval in October 2021.","\"Standard ETF process is usually a week or two. BITO was particularly fast, and I think this will be fast,\" she said.","Snyder says it's impossible to conceptualize the potential changes in trading volumes that could result from ETF inflows. Bitcoin (BTC), the largest cryptocurrency, has rallied 50% in the past six months in anticipation of approval, with traders betting the introduction of ETFs would draw huge demand from institutional investors.","Analysts at Standard Chartered forecast $1 billion of inflows in the three months after approval and potentially more than $100 billion by the end of the year. According to Snyder, there were some $1.2 trillion of net inflows into ETFs as a whole in the past 24 months. The total market cap for all cryptocurrencies is around $1.8 trillion.","\"That's not capital appreciation of the share base – that's net inflows,\" she said. \"These numbers just do not coexist in the crypto space. They look very different when we play with, for lack of a better description, the big boys.\"","Snyder says there are other uncertainties about the crypto industry that will now be exposed to greater scrutiny: Approval does not offset the SEC's doubts about cryptocurrency in general.","\"What the SEC is going to do about bitcoin still matters, and that's something that people just don't totally get,\" she said. \"Managers at financial firms are staking their reputations and their careers on the investments that they make. If they make a bitcoin investment and then the SEC decides it's illegal, that's going to be a problem.\"","SEC Chair Gary Gensler has on several occasions indicated concerns about the crypto industry, noting the number of frauds and bankruptcies and, at one point, referring to parts of it as the \"Wild West.\"","With the approval, providers are attempting to differentiate themselves from their peers. That's particularly the case for fees. Initial charges mainly ranged between 0.24% of net assets and 0.90%, and the first announcement sparked a race toward the low end, with a slew of reductions on Tuesday and again on Wednesday.","The standout is Grayscale, which is turning its Bitcoin Trust (GBTC) into an ETF and plans to charge 1.5%. The investment firm may be relying on its size advantages over the others, offsetting the higher fee. Grayscale already has more than $27 billion of assets under management even before approval, thus being able to offer greater volume and liquidity than its competitors, who are essentially starting at zero.","\"I don't think they're going to see a lot of inflows with the way they're priced, but presumably their pricing strategy would suggest that's not what they're chasing,\" Snyder said, adding that Grayscale may be relying on largely retaining GBTC's existing investor pool.","Whether Grayscale sees significant outflows to cheaper funds may depend on their investors' motivations: whether they bought their shares for the long-term, whether they're now holding them at a gain or a loss, and so on.","\"I don't think there's going to be immediate massive outflows, but I think that's the kind of thing you might see over time,\" Snyder said. \"Like everything, it's going to be a process and it'll take time to see how these things shake out.\"","Read More: Bitcoin ETFs Could See Up to $100B in Inflows If SEC Approves: Standard Chartered","Edited by Sheldon Reback.","\n","\n","\n","\n","\n","\n","\n"],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$100B","content":"MONEY"},{"type":"Switzerland","content":"LOCATION"},{"type":"0.24%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"0.90%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Ophelia Snyder","content":"PERSON"},{"type":"Bringing Easier Access to Biggest Cryptocurrency","content":"ORGANIZATION"},{"type":"October 2021","content":"DATE"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$1.8 trillion","content":"MONEY"},{"type":"$1.2 trillion","content":"MONEY"},{"type":"Grayscale","content":"LOCATION"},{"type":"Zug","content":"LOCATION"},{"type":"1.5%","content":"PERCENT"},{"type":"ProShares Bitcoin Strategy (BITO) ETF","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"$27 billion","content":"MONEY"},{"type":"Snyder","content":"PERSON"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["Ark 21shares","ARK Invest","21Shares","Bitcoin ETF","Interview","Trading Volume"],"authors":["Jamie Crawley"]}