{"summary":"The agency is right to go after fraudsters seeking to take advantage of investor enthusiasm in novel tech like machine learning and crypto, CryptoWhistleBlower founder Daren Firestone writes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/02\/the-secs-shot-across-the-bow-on-ai-washing\/","publishDate":"2024-04-02T21:25:26","id":15544,"type":null,"title":"The SEC’s Shot Across the Bow on 'AI Washing'","category":["Consensus Magazine"],"content":["The U.S. Securities and Exchange Commission (SEC) has trained its sights on “AI washing:” when companies lie about using artificial intelligence.","Last week, SEC Chair Gary Gensler posted a video to X warning that investment advisors might falsely claim to use AI models to get their clients a better return, and that public companies might falsely tout their AI technology to boost stock prices.","Daren Firestone is a lawyer who helps whistleblowers earn rewards for exposing fraud. He is a partner at Levy Firestone Muse and created cryptowhistleblower.com.","“Well, here at the SEC,” Gensler warned, “we want to make sure that these folks are telling the truth.”","The same day, the SEC announced it had settled charges with two investment advisors: Delphia and Global Predictions. The SEC’s order sanctioned the “robo advisor business” Delphia, which held $187 million in assets under management, for allegedly making claims it used “machine learning to analyze the collective data shared by its members to make intelligent investment decisions.”","That wasn’t true when Delphia first made those claims in a December 2019 press release, and it wouldn’t become true as it continued to make similar claims well into 2023, according to the SEC.","The second company settling with the SEC, Global Predictions, claimed to use “[e]xpert AI driven forecasts,” when, according to the agency's blunt assessment, “in fact it did not.” Asked by the SEC to substantiate its claim to be the “first regulated AI financial advisor,” Global Predictions “could not produce documents” to do so.","Collectively, the two companies paid fines totaling $400,000, not a lot by SEC standards, but this is a shot across the bow, a warning that the SEC won’t tolerate AI washing.","The SEC is right to be aggressive. As of Jan. 18, there were 353,928 .ai domain names registered. How many of those 353,928 domains belong to a company that actually uses AI?","Admittedly, AI is a broad category. IBM, for example, defines AI as “technology that enables computers and machines to simulate human intelligence and problem-solving capabilities.” When, as one commentator has asked, “does something go from being a Fax machine to being Samantha from Her or HAL from 2001: A Space Odyssey? Where do we draw the line?”","See also: Daren Firestone — AI+Crypto: Trouble | Opinion","The SEC will aim to avoid such esoterica by targeting lies that it can prove in court. Another example: in February, the SEC filed a complaint against Brian Sewell and his company Rockwell Capital Management LLC. Sewell allegedly raised $1.2 million for a fund to invest in cryptocurrency trading that he claimed would employ “machine algorithms,” “artificial intelligence” and a “machine learning model.”","“In reality,” the SEC alleged, “Sewell and the Fund had none of these things.”","AI is the next big thing. Investors know that. So do fraudsters seeking to take advantage of investor enthusiasm. The SEC is right to send a warning to those fraudsters."],"entity":[{"type":"Delphia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"2001","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sewell","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$1.2 million","content":"MONEY"},{"type":"December 2019","content":"DATE"},{"type":"Jan. 18","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Daren Firestone","content":"PERSON"},{"type":"Levy Firestone Muse","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Brian Sewell","content":"PERSON"},{"type":"Rockwell Capital Management LLC","content":"ORGANIZATION"},{"type":"$187 million","content":"MONEY"}],"hashtag":["Opinion","AI","Law","SEC","Regulation"],"authors":["Daren Firestone"]}