{"summary":"The latest innovations in blockchain technology are enabling creators to earn more from their work and achieve an unprecedented level of autonomy.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/05\/17\/breaking-barriers-to-the-web-3-creator-economy\/","publishDate":"2022-05-17T01:43:48","id":15548,"type":null,"title":"Breaking Barriers to the Web 3 Creator Economy","category":["Consensus Magazine"],"content":["With blockchain technology, sports stars, celebrities and creators have found unprecedented, more powerful ways to monetize their work, create stronger bonds with the communities that admire them and become completely autonomous.","However, in \"New Money With Spencer and Solo,\" Spencer Dinwiddie and I quickly learned that existing Web 2 structures no longer easily support creators in their career goals. Our guests described feeling a significant imbalance in the amount of content they created and its respective value, versus the amount they were earning. They spent significant time and money delivering material that satisfies both audiences and algorithms.","Solo Ceesay is chief operating officer and co-founder at Calaxy.","As the fickle features of Web 2 algorithms have not been publicly accessible, creators have had to gamble for a prominent spot at the top of social feeds. Understanding how to maximize monetary value from content creation has therefore been impossible, meaning creators’ revenue streams have been unreliable. How does someone run a successful business under these conditions?","For all its good, Web 2 has empowered the small groups that create social media algorithms and advertising functionality to monopolize these protocols and determine which creators make money, by what means and by how much.","In turn, how these brands interact with a platform magnifies this tyrannical power dynamic. Social media companies rely on brands for advertising revenue. Meanwhile, brands rely on social platforms for exposure, capitalizing on the following of social influencers. Digital creators become pawns that social platforms and brands exchange. It’s a win-win situation for the major corporations involved, but the value received by creators falls short.","Read More: After DeFi, DeSoc: Finding Web 3’s Soul","Web 3’s open access eliminates the power hierarchy, enabling creators to take control of their businesses. Spencer noted that “our 'New Money' conversations taught us about the pressing urgency for creators to be able to monetize directly, without the interference of a third-party,” and that newly developed, decentralized platforms provide more efficient avenues for transactions between creators and fans.","Content creation on Web 3 looks very different with creators able to determine how much they charge and under what conditions. This model turns social media into a stable career choice, eliminating the unpredictability that inflames anxiety and discourages participation. Creators have greater equity than in existing payment models, and fans may treat paywalls with scorn.","But most fans and creators have yet to understand how Web 3 enables easier access to content and creates more sustainable business models than other approaches. Now, developers have a golden opportunity to address this gap quickly and permanently shift power from giant corporations.","Web 3 enables us to correct some of the most egregious wrongs of current social platforms. Unfortunately, we have witnessed numerous incidents in which Web 2 algorithms discriminate against marginalized communities.","Indigenous American activists found their Instagram posts were being censored and Black creators have sued YouTube for automatically removing their content under alleged racial prejudice. TikTok critics have targeted its \"filter bubble\"-style algorithm, which allegedly pushes videos from the same demographic of people and has prompted many Black creators to abandon the app.","The direct engagement central to Web 3 platforms is allowing creators and fans to bypass the possibility of algorithmic discrimination and ensure that minorities have equal opportunities to define their careers.","\"New Money\" taught us that creators still have fundamental questions about accessing and using Web 3. They are used to the closed-source, centralized monopoly of our current web infrastructure.","For example, creators need practical guidance on how to download a crypto wallet and use it to buy and store digital assets. Even some of the largest tech giants and international brands have yet to fully embrace these tools, therefore such information is hard to attain.","Read More: Terra, Web 3 and Acceptable Risk in Innovation","There’s no step-by-step guidebook for social media influencers. Our \"New Money\" guests the Victor Twins felt they were underpaid, and bemoaned the lack of resources from which they could learn to correct this issue.","Many of our guests didn’t know the variety of ways that Web 3 could further their careers, even in the use of something as increasingly important as non-fungible tokens (NFT). Influencers, artists and others are dropping NFT collections seemingly daily. A number of pro athletes and politicians have converted their salaries into crypto.","How can people incorporate such technologies into their businesses? How can they adopt something without the correct tools or the knowledge to use them?","The most important lesson we learned across 12 episodes is that Web 3 projects must launch comprehensive, educational initiatives that reach diverse communities everywhere. “There is a need for education on current modes of monetization and the advantages of content creation in Web 3,” Spencer said.","Spencer and I see \"New Money\" as a starting point. We will continue to learn eagerly from future conversations and seek ways to incorporate true Web 3, decentralized philosophy into our work. We are cognizant of the ongoing gaps in knowledge that could change business in creative fields and perhaps every other aspect of daily life.","Our show also offered a rare opportunity to observe the wider crypto landscape. What we found was encouraging, a world with enormous potential if developers and others involved in its innovation take the right steps forward- steps that will ultimately lead to a digital economy with more just revenue streams and a world of new money.","Read More: What Is Web 3 and Why Is Everyone Talking About It?"],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Spencer","content":"PERSON"},{"type":"Victor Twins","content":"PERSON"},{"type":"Calaxy","content":"ORGANIZATION"},{"type":"Ceesay","content":"PERSON"},{"type":"Web 3","content":"DATE"},{"type":"Spencer Dinwiddie","content":"PERSON"}],"hashtag":["NFTs","Web 3.0","Spencer Dinwiddie","Opinion"],"authors":["Solo Ceesay"]}