{"summary":"Large bitcoin investors haven't started to buy the dip yet, suggesting that the correction may continue for a while, an LMAX Group strategist noted.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/17\/bitcoin-tumbles-to-60k-ether-under-3k-correction-not-over-says-strategist\/","publishDate":"2024-04-17T15:42:58","id":15565,"type":null,"title":"Bitcoin Tumbles Below $60K, Ether Under $3K; Correction Not Over, Says Strategist","category":["Markets"],"content":["Bitcoin (BTC) has given up the entirety of its bounce from Saturday's panicky selloff, plunging to under the $60,000 level in the morning hours of the U.S. trading session Wednesday.","After earlier Wednesday recovering above $64,000, bitcoin slipped to as low as $59,900, down more than 3% over the past 24 hours and its weakest price since early March. At press time, it was trading at $60,200.","Ether (ETH), the second-largest crypto asset by market capitalization, tumbled below $3,000 declining 2.5% over the same period.","The weakness echoed through most crypto markets, with all CoinDesk Market Index (CMI) sectors being in the red, while the broad-market CoinDesk 20 Index lost 1.8%.","The spot market order book for BTC-USDT on crypto exchange Binance, the most liquid trading pair, shows bids clustered below $60,000, outweighing sale orders. This indicates strong demand below that level that could halt further price decline at least in the short term.","Today's decline affirmed that cryptocurrencies are going through a cool-off phase after a multi-month rally that peaked last month. Bitcoin since has lost more than 15% from its latest all-time high, while some altcoins pulled back 40%-50% from their recent tops, which isn't out of ordinary of previous crypto bull market pullbacks, Glassnode data showed.","Read more: Is the Bitcoin Rally Over? Reasons to Stay Bullish on BTC Despite Correction","Bitcoin investor behavior suggests that the market weakness could continue for a while as large investors haven't started to buy the dip yet at current prices, Joel Kruger, market strategist at LMAX Group, said in a Wednesday market update.","\"The latest blockchain data shows large holders of bitcoin holding off on increasing exposure into the current dip, which suggests we could still see some more weakness or consolidation before bitcoin is ready to turn back up,\" Kruger said.","The crucial technical level to watch for BTC is $59,000, referring to a significant support zone where prices rebounded twice through March, he added.","\"If bitcoin can hold above this level, it keeps the direct focus on that next push to a fresh record high and towards $100,000,\" Kruger said. \"If on the other hand we see more downside pressure that translates to a breakdown below $59,000, this will delay the short-term bullish outlook and open the door for a more meaningful correction into the $45,0000-50,000 area.\"","UPDATE (April 17, 16:11 UTC): Adds order book data.","Edited by Stephen Alpher."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"$59,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitcoin Rally Over","content":"ORGANIZATION"},{"type":"Kruger","content":"PERSON"},{"type":"1.8%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$45,0000","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"$59,900","content":"MONEY"},{"type":"CMI","content":"ORGANIZATION"},{"type":"$64,000","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"LMAX Group","content":"ORGANIZATION"},{"type":"$60,200","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Joel Kruger","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"April 17","content":"DATE"}],"hashtag":["Market Wrap","Bitcoin","Correction","Markets","Ether"],"authors":["Krisztian Sandor"]}