{"summary":"Six projects building on five blockchain protocols will take home over $200,000 in grants to help fund development.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/28\/consensus-web3athon-2023-reveals-its-winners\/","publishDate":"2023-06-28T14:00:46","id":15566,"type":null,"title":"Consensus Web3athon 2023 Reveals Its Winners","category":["Consensus Magazine"],"content":["Web3athon, an annual hackathon event hosted by CoinDesk with partners Alchemy University and HackerEarth, has announced its latest cohort of winners. Six teams building in five blockchain ecosystems will take home over $200,000 in grants to help fund further protocol development.","The six-week virtual event, which ran April to June this year, is focused on bringing more developers into Web3 through partner grant programs. The Web3athon grants were funded by organizations representing the Solana, Polkadot, XDC, OKT Chain and Coreum blockchains.","“[T]he industry needs more developers learning and building in Web3,” Garrett Skrovina, audience partnerships senior manager for CoinDesk’s Consensus event, said in an announcement. “Each protocol approaches ecosystem development differently, so Web3athon provided a platform to showcase the various developer relations initiatives of our partner protocols and foundations.”","“We love Web3athon because it is multichain in nature, connected to Consensus, and attracts top talent across the ecosystem,” a representative for Web3 identity project Civic told CoinDesk. Civic was one of several secondary sponsors, as well as wallet giant Ledger, gender-equality-focused community H.E.R. DAO and Hexens, a Web3 and novel cryptography auditor.","With over 6,400 participants, the winners were selected from over 160 final submissions. The winning projects addressed a wide range of needs around protocol infrastructure and applications, including network privacy, zero-code development and e-commerce. Nearly half of applicants were building on Solana and XDC, with the next most popular networks being Polkadot and the Ethereum and Cosmos-compatible OKT Chain (OKTC).","While not every project takes home funding, previous Web3athons have seen several participants continue to build their applications after the event.","Mike Hale, who was building the first version of Vanward – a tool that helps manage and verify professional certifications – on Solana, plans to continue the work through the ongoing Encode x Solana Summer hackathon.","“I didn't go into Web3athon expecting to win a prize. Instead, I used it as a deadline and motivation to get the first version developed,” Hale said.","While hackathons are only one step in creating a diverse and sustainable software industry, they are designed to get people into the ring, and to start building. They play a critical role in incubating innovation, spurring open-source development and building communities.","Here are this year’s winners:","Obsidian, a protocol that enables “stealth” payments on Ethereum, was reportedly inspired by a tweet from Ethereum co-creator Vitalik Buterin, who was wishing for a way to “send coins to an [Ethereum Name Service address] without publishing to the world that they got coins.”","Built on Cosmos-based OKT Chain, Obsidian uses elliptic-curve cryptography and other cryptographic techniques that will enable users to send ERC20 tokens, perhaps the most popular token-type on Ethereum, with discretion.","In short, the tool helps users spin up a fresh blockchain address to send coins to – which remains pseudo-anonymous to the wider world, but is accessible by the transaction’s recipient. Vitalik would be proud.","The project is currently live on an Evmos testnet (a testing ground for the network that is building connections between Ethereum and Cosmos), with plans to launch onto the mainnet, according to the project’s GitHub.","During hackathons, it’s not uncommon for participants to build apps that would impress developers but perhaps be arcane to regular crypto users. Risc-Roll is arguably one of those projects. For instance, the tagline for the application is: “ZK-protocols for any Substrate chain, in plain Rust.”","In plain English, the team essentially wanted to show that it’s possible to bring zero-knowledge (ZK) proofs onto Polkadot – one of the largest multi-chain networks – in Rust, a programming language used widely outside the world of crypto. ZK proofs are a type of privacy-preserving cryptography that crypto developers push to theoretical limits for use in blockchain scaling and security.","ZK proofs are “severely underutilized” on Polkadot, the Risc-Roll team wrote. By building an example of how the technology can be deployed using a popular programming language, the team said “we can turn any of the 100s of existing Substrate devs into zk-capable devs.”","Synap’s mission statement begins with something of a truism: crypto users exist, but decentralized app (dapp) developers or companies with products to sell are not always able to reach them. To some extent, it’s a problem of crypto’s own making by trying to subvert the privacy-invasive data economy of Web2.","One of Web3’s answers to this issue of “user acquisition” is something called a “social passport.” Social passports solve for user acquisition without sacrificing on user autonomy by building data profiles that are controlled ultimately by users.","Synap’s blockchain-based data economy takes information from social media, on-chain transactions and a person’s “awareness and involvement in the ecosystem” to assign what they call a “degen score.” Users receive a dynamic non-fungible token (NFT) that represents their “social and financial” histories, which is theirs and theirs alone.","In theory, projects looking to onboard new users can turn to Synap to offer people discounts, airdrops and personalized dapp experiences. And considering the roster of backers which includes the Solana Foundation, Underdog Protocol and Superteam (all Solana heavy-weights), wider adoption seems likely.","See also: Solana Foundation: SOL Is 'Not a Security'","You may not have heard of the XinFin protocol, or XDC for short. But using it may feel familiar. XDC is an enterprise-grade, open-source fork of Ethereum that provides the same smart contract capabilities but shrinks transaction times to two seconds and gas fees to almost nothing. (And like other enterprise blockchain solutions, it achieves scalability by sacrificing on decentralization through a delegated proof-of-stake mechanism).","FuelStack, a crypto-based e-commerce platform, is built on the XinFin protocol, but will actually remain blockchain-agnostic, the founding team said. The platform is powering xSPECTAR, an immersive metaverse with a built-in marketplace and NFT functionality.","“We intend to focus on people who desire to move or trade within hyper-realistic upscale environments and have a desire to meet like-minded people. We make our network available to our community through our xSPECTAR tokens and NFTs,” the project’s white paper reads.","Even during the bear market, a number of legacy brands are continuing to build out metaverse and Web3 strategies. Conceivably, a few of them would be attracted by an enterprise-grade solution.","Coreum, the compliance-focused layer 1 blockchain that’s part of the wider Inter‑Blockchain Communication Protocol (IBC), chose two grant recipients this year. They must still deliver their code to win the grant.","Blocklog, which focuses on “observability and monitoring,” is building a data intelligence developer tool for tracking and analyzing blockchains, smart contracts and decentralized apps to enhance a project’s performance and reliability.","See also: What Is an Enterprise Blockchain?","Birdhouse, meanwhile, is developing the Coreum Processing Service, a setup tool to help businesses integrate with Coreum and create Coreum-based infrastructure and projects. The project, which is still working on its final submission, is developing a service that allows merchants and other businesses to accept crypto.","In particular, the team wants the service to simplify integration to simple REST requests (short for representational state transfers, a core building block of the Web), making transaction authentication and access easier."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Coreum","content":"PERSON"},{"type":"Hale","content":"PERSON"},{"type":"Hexens","content":"PERSON"},{"type":"HackerEarth","content":"PERSON"},{"type":"June this year","content":"DATE"},{"type":"Garrett Skrovina","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Mike Hale","content":"PERSON"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Alchemy University","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Inter‑Blockchain Communication Protocol (IBC","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Cosmos","content":"LOCATION"},{"type":"Polkadot","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Coreum Processing Service","content":"ORGANIZATION"},{"type":"Encode x Solana Summer","content":"ORGANIZATION"}],"hashtag":["Consensus","Consensus 2023","Web3athon","Solana","Polkadot","Hackathon","Web3"],"authors":["Daniel Kuhn"]}