{"summary":"Ethereum's Dencun upgrade enabled a new way of storing data that was forecast to dramatically cut costs for interacting with layer-2 networks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/13\/arbitrums-arb-polygons-matic-lead-gains-as-ethereums-dencun-upgrade-goes-live\/","publishDate":"2024-03-13T15:40:26","id":15569,"type":null,"title":"Arbitrum's ARB, Polygon's MATIC Lead Gains as Ethereum's Dencun Upgrade Goes Live","category":["Markets"],"content":["Cryptocurrencies adjacent to the Ethereum network offered a mixed performance on Wednesday as the blockchain's much-anticipated Dencun upgrade went live, enabling cheaper transactions on layer-2 (L2) protocols.","Read more: Ethereum Finalizes 'Dencun' Upgrade, in Landmark Move to Reduce Data Fees","Native tokens of Polygon (MATIC) and Arbitrum (ARB) added 8%-10% before the upgrade, retracing some of the advance by the time the upgrade kicked in at 13:55 UTC. The two are still up 6%-7% over the past 24 hours, while METIS' 2% gain outperformed the broad-market CoinDesk 20 Index's (CD20) 1.5% advance.","Starknet (STRK) had been falling until the upgrade activated, then shot up almost 10%, erasing earlier losses. It was recently 6% higher over 24 hours. Starknet posted on X that it already submitted its first batch of data in a \"blob\" that benefits from the reduced fees Dencun makes possible. The Starknet Foundation, an organization behind the network's development, also laid out plans on Tuesday for further cost reductions for users.","Optimism (OP) also rallied nearly 10%, but dropped more than its rivals ahead of Dencun and was up less than 2% on the day. Gaming-focused L2 Immutable X (IMX) ended a short-lived advance to decline 6%. Celo (CELO) slid 7% while the Ethereum blockchain's native token, ether (ETH), was little changed just below $4,000.","Dencun, considered the biggest milestone for the ecosystem in almost a year, introduced a new way of storing data on the notoriously congested blockchain. The change was forecast to cut transaction costs on L2 networks to a few cents, and expected to spur activity and attract more applications.","While ETH and layer-2 tokens performed well over the weeks leading up to Dencun, QCP Capital noted that ether could see a correction as anticipation for the upgrade passes and diminishing probability of a spot ether ETF being approved in the U.S. in the near future. A correction in crypto markets is often seen as a decline of at least 10%.","UPDATE (March 13, 16:31 UTC): Adds Starknet's STRK price action. Updates METIS, CD20 prices.","Edited by Sheldon Reback."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"few cents","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"Reduce Data Fees","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"Dencun","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$4,000","content":"MONEY"},{"type":"Dencun","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Ethereum","Dencun","Layer 2s","Polygon","Arbitrum","Markets"],"authors":["Krisztian Sandor"]}