{"summary":"Not all cryptocurrencies are the same; how they react to a world with inflation and higher interest rates greatly depends on what sector they are in.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/09\/25\/how-crypto-sectors-are-trading-through-the-dollar-strength-tsunami\/","publishDate":"2022-09-25T14:50:00","id":15574,"type":null,"title":"How Crypto Sectors Are Trading Through the Dollar Strength 'Tsunami'","category":["Finance"],"content":["Conventional wisdom holds that if the dollar is stronger, assets such as cryptocurrencies get cheaper. Yet is that really the case?","This past week, the Federal Reserve did exactly what most people predicted: It raised the fed funds rate by 75 basis points – for the third time in a row. For months now, consumer prices have surged at a rate not seen since the fourth season of \"Diff’rent Strokes\" – so raising borrowing costs, it’s hoped, will make money a little more expensive and thus cool the hot economy.","Higher interest rates fuel demand for dollars (to put it in terms crypto folks can understand, remember how everyone was buying UST because of the near 20% APYs the Anchor protocol was paying back in April?). The U.S. Dollar Index, which measures the greenback against a basket of six foreign currencies, is now trading at a 20-year high after surging about 20% in the last year. In that time, bitcoin (BTC) has dropped a whopping 58%.","“Dollar strength is a unilateral and powerful force,” said Mark Conners, head of research at 3IQ, on CoinDesk TV’s “First Mover” program Friday. “The term ‘tsunami’ is thrown out a lot, but it really, accurately represents what happens in a period of dollar strength. It just pulls other assets away from currencies.”","Nonetheless, it’s worth cautioning that one shouldn’t read too much into this. After all, crypto is still in its nascent stages compared to other asset classes. It has its own idiosyncrasies and prices move for reasons other than, say, dollar strength.","For example, bitcoin hit an all-time high in November 2021, trading at close to $69,000, more than quadruple where it was the year before. During that time frame, the dollar index went from roughly 92.7 to 95.","Furthermore, prices often appear to move in relation to the market’s attitude toward risk. Cryptocurrencies are still very much “risk on.”","With that said, crypto has been behaving like some conventional assets, especially in recent weeks.","When the Bureau of Labor Statistics released August’s consumer price index (CPI) on Sept. 13 showing an 8.3% increase year-over-year (30 basis points higher than expected), equity markets took a hit. The S&P 500, for example, dropped 6.2% in the week following the announcement.","Drill down into sectors, though, and we find that some didn’t do as badly as others. Financials, for instance, lost 5% (banks like higher interest rates in the long term because they ultimately benefit their balance sheets). Real estate stocks, on the other hand, suffered a 9.8% drop; higher rates make it harder to leverage with mortgages and drive up cap rates for commercial buildings.","As a whole, crypto fared far worse than equities in the week following the CPI data release. The CoinDesk Market Index (CMI), a cap-weighted index of 148 of the largest cryptocurrencies, slid 13.5% during those seven days. Here, too, we find variances based on sector. The CoinDesk Smart Contract Platform Index (SMT) – which includes the likes of ether (ETH), Cardano’s ADA, and Solana’s SOL – tumbled 19.8%. To be sure, a sizable portion was due to ether’s post-Merge drop and not just because of general market conditions, though other assets in the index fell due to the sell-off as well.","Meanwhile, the CoinDesk Culture and Entertainment Index (CNE) – chock full of non-fungible token(NFT)-related and metaverse coins like ApeCoin’s APE, Decentraland’s MANA and The Sandbox’s SAND – slipped by “only” 6.9%, better than four equity sectors.","“High inflation, rising rates [and] a strong dollar, yes, it puts downward pressure on all of the digital assets but it's not equal,” said Jodie Gunzberg, CoinDesk Indices’ managing director, on Thursday’s “First Mover” episode. Cryptocurrencies in the CoinDesk Culture and Entertainment Index didn’t suffer as much as others because “those are not as economically sensitive as something like DeFi or the currencies or the smart contract platforms that are just much more closely tied to the financial markets.”","This move strikes a familiar pattern found in equities, according to Gunzberg. “That's not dissimilar to the defensive sectors that we see again in the S&P 500,” she said. “When we look at things like leisure, entertainment [and] gaming, there are more defensive characteristics there. Then there are in some of the more economically sensitive sectors like real estate.”","For traders, thinking about crypto in terms of segments means, among other things, coming up with more sophisticated ways to trade in a rising rate environment.","“You can create long\/short strategies, or you can create strategies that are overweighting the sectors like culture and entertainment or even the digitization market,” Gunzberg said. “And then you can underweight the smart contract platforms … which are really getting hammered in this economic environment.”","In the meantime, the market is bracing for yet another 75-basis point rate hike in November. According to the CME’s FedWatch Tool, as of Friday afternoon traders are giving a 71.7% probability that the U.S. central bank will raise rates by three-quarters of a percent to a range of 3.75% to 4%. It’s data dependent, as they say, and a lot can happen in the next month or so."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"8.3%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"6.9%","content":"PERCENT"},{"type":"3.75%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"71.7%","content":"PERCENT"},{"type":"Sept. 13","content":"DATE"},{"type":"19.8%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"CMI","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"afternoon","content":"TIME"},{"type":"August","content":"DATE"},{"type":"Mark Conners","content":"PERSON"},{"type":"CoinDesk Culture","content":"ORGANIZATION"},{"type":"6.2%","content":"PERCENT"},{"type":"Jodie Gunzberg","content":"PERSON"},{"type":"Cardano’s ADA","content":"ORGANIZATION"},{"type":"CME’s FedWatch Tool","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"First Mover”","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"Bureau of Labor Statistics","content":"ORGANIZATION"},{"type":"13.5%","content":"PERCENT"},{"type":"S&P","content":"ORGANIZATION"},{"type":"58%","content":"PERCENT"},{"type":"9.8%","content":"PERCENT"},{"type":"UST","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Gunzberg","content":"PERSON"},{"type":"CPI","content":"ORGANIZATION"},{"type":"Gunzberg","content":"LOCATION"},{"type":"CNE","content":"ORGANIZATION"}],"hashtag":["Indices","Crypto Long & Short","Inflation"],"authors":["Lawrence Lewitinn"]}