{"summary":"Berenberg Capital Markets’ Mark Palmer said reports that Hamas used crypto for fundraising ahead of attacks in Israel may make Coinbase’s quest for crypto-friendly legislation in the U.S. more difficult.   ","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257914\/reports-of-hamas-crypto-use-could-blunt-impact-of-coinbase-lobbying-efforts-berenberg","publishDate":"2023-10-17T11:44:30","id":1557,"type":null,"title":"Reports of Hamas&#x27; crypto use could blunt impact of Coinbase lobbying efforts: Berenberg","category":["Regulation"],"content":["Coinbase continues to face threats on the regulatory front in the U.S., despite its lobbying campaign to push Congress for increased clarity, Berenberg Capital Markets said in a research note, reiterating its \"hold\" recommendation on the stock and price target of $39.","\"The primary driver of our cautious stance toward Coinbase Global is not our concern about the company's operating performance during the next couple of quarters, but rather on the threats to its business from the various regulatory actions and litigation that it faces in the U.S.,\" said Mark Palmer, an analyst at Berenberg.","Reports that Hamas used cryptocurrency for fundraising ahead of attacks in Israel earlier this month may complicate Coinbase's efforts to push for friendlier legislation from Congress, he added.","Last week, Israeli authorities <a href=\"https:\/\/www.theblock.co\/post\/255679\/israeli-authorities-have-frozen-hamas-linked-crypto-accounts-report\" data-v-f87c67ca=\"\">froze<\/a> cryptocurrency accounts used by Hamas for its fundraising efforts, according to a local report. Israeli authorities had seized, as of an <a href=\"https:\/\/www.reuters.com\/world\/middle-east\/israel-seized-binance-crypto-accounts-thwart-islamic-state-document-shows-2023-05-04\/\" data-v-f87c67ca=\"\">April report<\/a>, 190&nbsp;Binance accounts linked to Hamas and Isis since 2021.","\"While Hamas announced last April that it would no longer use crypto for fundraising due to the ability of authorities to track its movement on blockchain ledgers, we believe the recent headlines are likely to make clarity around the question of crypto's legal status even more elusive,\" Palmer said.","Coinbase shares rose 4.3% on Tuesday to $78.26 at 11:26 a.m. ET, according to TradingView. While shares have declined 5.4% over the past month, they're up 115% over the past year.&nbsp;","The company has been lobbying lawmakers to create a legal framework that would make operating in the world's largest market for crypto easier. Meanwhile, Coinbase continues to face a legal fight with the Securities and Exchange Commission.","\"The company’s defense against the lawsuit that the SEC filed against it appears likely to be an overhang on its share price for some time to come,\" Palmer said. He noted that Berenberg had raised its estimate of the company's consumer transaction revenue to $240.8 million from $210 million to reflect &nbsp;\"our expectation that its consumer take rate will contract at a slower pace than we had been anticipating.\"","\"At the same time, we continue to view COIN’s consumer take rate as being at risk of compression due to competition for market share within a lower-volume crypto space,\" he added.&nbsp;","&nbsp;"],"hashtag":["COINBASE"]}