{"summary":"Jan Van Eck told CoinDesk TV's Jen Sanasie that not hearing back from the SEC is a sign that ETH exchange-traded funds likely wont make the May deadline.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/09\/vaneck-ceo-says-transaction-fee-is-bigger-story-than-bitcoin-or-ethereum-etfs\/","publishDate":"2024-04-09T21:52:18","id":15581,"type":null,"title":"VanEck CEO Says Transaction Fee Is Bigger Story Than Bitcoin or Ethereum ETFs","category":["Finance"],"content":["The CEO of VanEck – the global investment firm whose Bitcoin Trust (HODL) is among the almost dozen spot bitcoin ETFs – thinks the cryptocurrency industry should focus more on transaction fees and not so much on Bitcoin (BTC) and Ethereum (ETH) or their related exchange-traded funds.","Jan van Eck said on CoinDesk's \"Markets Daily\" that the transaction fees on the Bitcoin and Ethereum blockchains are unpredictable, making it harder to build applications in those ecosystems. \"The most important story of 2023, which people know, but I don't think they focus on enough, which is simply that transaction costs are now available at affordable rates through Solana or the so-called layer 2s,\" van Eck told CoinDesk TV's Jen Sanasie in an interview.","\"Because you see the transaction fees for Bitcoin and Ethereum, no one would ever use that database to build anything on, right? My analogy for non-crypto people is, would you want to fill your car at $50, you know, week after week, and then one week at $600? And that's effectively what high gas fees are on Ethereum,\" he said.","Solana (SOL), often referred to as an Ethereum killer, is a layer 1 protocol with cheaper costs and faster transaction speeds than Ethereum. Layer 2s are separate blockchains that are built on top of layer 1 chains, such as Ethereum, to reduce bottlenecks with scaling and data that layer 1s face. Ethereum rollups and the Lightning network on Bitcoin are examples of layer 2s.","With new solutions for lower and much more predictable transaction fees, developers can now build applications that are much more useful, which Jan Van Eck predicts will be more prominent going forward. \"The most interesting thing happening in crypto to me right now is that you have databases that can scale, that can take a lot of users of high uptime and now have predictable costs. And so real stuff can be built on these databases now,\" he said. \"We're going to see that in the next couple of years.\"","He also said that its unlikely that ether ETFs will be approved by their May deadline, as unlike the bitcoin ETF approval process, the U.S. Securities and Exchange Commission has been not responsive to filings by the prospective issuers.","\"We've filed our S1 and we haven't heard anything. So that's kind of a sign. It won't happen without getting the disclosure documents in order,\" Jan Van Eck said.","Edited by Nick Baker."],"entity":[{"type":"$50","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$600","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jen Sanasie","content":"PERSON"},{"type":"Eck","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"S1","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"\" Jan Van Eck","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Bitcoin","Solana","gas fees"],"authors":["Aoyon Ashraf"]}