{"summary":"The New York Attorney General’s office said it reached an agreement for the trading platform to return fees to investors it overcharged and misled.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/05\/18\/coin-cafe-ordered-by-new-york-ag-to-pay-back-43m-in-fraudulent-fees\/","publishDate":"2023-05-18T20:02:06","id":15595,"type":null,"title":"Coin Cafe Ordered By New York AG to Pay Back $4.3M in Fraudulent Fees","category":["Policy"],"content":["Brooklyn-based crypto trading platform Coin Cafe is paying back $4.3 million to defrauded investors, according to a Thursday statement from the New York Attorney General’s office, which accused the company of misleading customers about “exorbitant and undisclosed” fees.","The company, granted a New York BitLicense in January 2023, had advertised free wallet storage on its website, but it charged fees that sometimes entirely emptied investors’ accounts, the investigation concluded. In an agreement with the state, Coin Cafe is paying back those harmed, including 340 investors in New York.","“Coin Cafe defrauded hundreds of New Yorkers out of thousands of dollars with its deceptive marketing and due to a lack of effective regulation,” said New York Attorney General Letitia James, in a statement. “This is yet another example of why the cryptocurrency industry needs to be better regulated, just like any other financial institution where New York investors put their hard-earned money.”","James’ office has been pushing state legislation seeking much more authority in the digital assets industry, which is currently handled primarily by the New York Department of Financial Services. Crypto insiders fear the new measures will make it much more difficult to do business in the state.","Coin Cafe customers who want the refunds must request them in the next 12 months.","The platform also illegally failed to register with the attorney general as a commodity broker-dealer, according to the agreement dated Thursday. The attorney general has recently been cracking down on crypto registration violations.","Coin Cafe did not immediately return requests for comment sent to company email addresses.","Read More: New York Attorney General Seeks New Crypto Powers for State Regulators","Edited by Nikhilesh De."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"New York Attorney General Seeks New Crypto Powers for State Regulators","content":"ORGANIZATION"},{"type":"New Yorkers","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$4.3 million","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"}],"hashtag":["Regulations","New York","New York Attorney General"],"authors":["Jesse Hamilton"]}