{"summary":"The fundamental value proposition of the Solana protocol persists from a technical perspective, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/02\/23\/solana-blockchain-well-positioned-to-reassert-itself-as-a-genuine-layer-1-competitor-coinbase\/","publishDate":"2023-02-23T11:17:10","id":15594,"type":null,"title":"Solana Blockchain Well Positioned to Reassert Itself as a Genuine Layer 1 Competitor: Coinbase","category":["Markets"],"content":["Solana was not immune to the fallout in crypto markets in 2022 and the collapse of FTX had an inordinate impact on the blockchain’s ecosystem in terms of market sentiment given the network’s historical relationship with the now-defunct exchange, Coinbase (COIN) said in a research report Wednesday.","The Solana community was as stunned by the collapse of the FTX crypto exchange as the broader market, the report said, noting that founder Anatoly Yakovenko believed that the blockchain’s “perceived linkages” with FTX have historically been overstated.","“Nevertheless, the fundamental value proposition of the Solana protocol persists from a technical perspective,” wrote analyst Brian Cubellis. As a “blockchain optimized for high throughput, de minimis costs and native scalability,” it represents a “legitimately differentiated approach within the layer 1 landscape,” he added.","Coinbase says given the ecosystem’s relative strength in terms of network activity with regards to transactions, users and development, Solana is well positioned to reassert itself as a genuine layer 1 competitor. A layer 1 network is the base layer, or the underlying infrastructure, of a blockchain.","Activity on Solana compares favorably to that on Ethereum at present, suggesting the solana (SOL) token may be undervalued relative to ether (ETH), the note said.","Furthermore, solana’s market capitalization is only about 4.3% of ether’s, while the amount of daily active users on the blockchain represents around 43.7% of Ethereum’s daily active user base. It also processes around 17 times the amount of daily transactions processed by Ethereum, the note added.","Read more: Citi Says Solana Blockchain Activity Remains High"],"entity":[{"type":"2022","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"43.7%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"4.3%","content":"PERCENT"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Brian Cubellis","content":"PERSON"},{"type":"Citi Says Solana Blockchain Activity Remains High","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Solana","Blockchains","layer 1"],"authors":["Will Canny"]}