{"summary":"The settlement with FTX and Alameda Research is a key part of BlockFi's bankruptcy and reorganization plan.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/06\/blockfi-settles-with-ftx-alameda-estates-for-8745m\/","publishDate":"2024-03-06T23:26:57","id":15614,"type":null,"title":"BlockFi Settles With FTX, Alameda Estates for $874.5M","category":["Policy"],"content":["Bankrupt crypto lender BlockFi, which was caught in the contagion of FTX and declared bankruptcy days after the exchange's collapse, has reached an \"in principle\" agreement with the estates of FTX and Alameda Research for nearly $1 billion, according to a recent court filing, which could lead to full value recovery for BlockFi's customers.","Under the settlement, BlockFi will receive a total of $874.5 million in claims against FTX and Alameda Research. $250 million will be treated as a secured claim, which will prioritize payment to BlockFi after FTX plan to end bankruptcy, which was filed in December, is approved by its creditors.","In turn, FTX will drop its claims against BlockFi, allowing BlockFi's remaining claims to be paid out like other similar claims under FTX's plan according to the settlement. A judge still needs to sign off on the agreement.","\"We’re pleased to have been able to reach a result, with the assistance of Judge Goldblatt, that allows BlockFi’s claims against FTX for the full value of loans to Alameda and assets on the FTX exchange, waives “clawback” claims by FTX that could diminish those claims, and provides BlockFi with a partially secured claim,\" Kenneth Aulet, partner at Brown Rudnick, which represented the Committee of Unsecured Creditors, said in an emailed statement. \"[It is] an excellent outcome for BlockFi’s customers and creditors.\"","FTX, Alameda, and BlockFi had a complicated and intertwined relationship. BlockFi received a $400 million line of credit from FTX, and FTX, under its legal name West Realm Shires, was one of BlockFi's largest creditors with a $275 million claim.","\"This negotiated agreement represents an excellent outcome for BlockFi and its customers – one better than could have been anticipated even on the effective date of the Plan,\" BlockFi's bankruptcy administrators wrote in the filing. \"[This Plan] ensures that money reserved for litigation with FTX is directed instead to customer distributions.\"","Edited by Nikhilesh De."],"entity":[{"type":"$275 million","content":"MONEY"},{"type":"Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"West Realm Shires","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Kenneth Aulet","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"$874.5 million","content":"MONEY"},{"type":"Brown Rudnick","content":"PERSON"},{"type":"Goldblatt","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["BlockFi","FTX","FTX Collapse","Alameda Research","Zac Prince"],"authors":["Sam Reynolds"]}