{"summary":"Sector tokens jumped 7.7% on average in the past 24 hours, CoinGecko data shows, with Ocean Protocol’s OCEAN and Fetch.AI’s FET rising more than 10%.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/19\/ai-tokens-rally-as-openais-sora-brings-renewed-hope-to-the-sector\/","publishDate":"2024-02-19T08:05:20","id":15612,"type":null,"title":"AI Tokens Rally as OpenAI’s Sora Brings Renewed Hope to the Sector","category":["Markets"],"content":["Tokens related to artificial intelligence (AI) or claiming to be utilizing AI rallied over the weekend as OpenAI unveiled its text-to-video generator Sora – boosting hopes among those who view the sector as a key driver of profits this year.","Sector tokens jumped 7.7% on average in the past 24 hours, CoinGecko data shows, with Ocean Protocol’s OCEAN and Fetch.AI’s FET rising more than 10%. Meanwhile, the CoinDesk 20 Index (CD20), a benchmark for the biggest and the most liquid cryptocurrencies, rose 2.68% in the past 24 hours.","Worldcoin’s WLD zoomed 30%, the highest among all AI tokens, setting a new lifetime peak at $7. Worldcoin’s parent company was founded by OpenAI CEO Sam Altman, causing some traders to consider WLD as a bet on the growth of the latter company.","Ethereum co-founder Vitalik Buterin tweeted that AI could find a place for auditing smart contracts – sending lesser-known tokens 0x0 and TokenFi’s TOKEN up as much as 15% for being related to the topic.","Interest in AI-related tokens first started to spike in early 2023 as ChatGPT and image generation software first started to gain popularity. It waned in the past few months as the hype slowed down, but Sora’s Friday launch has seemingly bumped interest again.","\"AI is proving to be the most disruptive technological invention of our age, with data from PwC predicting that AI could contribute up to $15.7 trillion to the global economy in 2030, more than the current output of China and India combined,\" TokenFi developer B told CoinDesk in a Telegram message, explaining the hype.","Commercial usage of AI, so far, is limited to virtual tools and chat software. As such, some developers have previously voiced concerns about the apparent usage of tokens in AI systems.","“Current AI tokens and Web3 projects may not yet know what these decentralized AI tools look like. There’s a lot of unanswered challenges and lots to be figured out,” Aditya Khanduri, head of marketing at Biconomy, told CoinDesk in an earlier interview.","“Say an AI tool gets to 250 million users. Then what will its infra look like? How will people use it? How will the data be trained? Where does the token fit in? Can you even have a way to reward people for their data if you used it to train your models?” he added.","Edited by Parikshit Mishra."],"entity":[{"type":"7.7%","content":"PERCENT"},{"type":"2.68%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Aditya Khanduri","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"$15.7 trillion","content":"MONEY"},{"type":"PwC","content":"ORGANIZATION"},{"type":"$7","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"2030","content":"DATE"},{"type":"Biconomy","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["AI","Trading","Markets","worldcoin","Openai"],"authors":["Shaurya Malwa"]}