{"summary":"Sneaker studio RTFKT combined physical and digital collectibles in an NFT auction that drew $13,331 for a pair of shoes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/12\/22\/why-nft-collector-whaleshark-spent-22-eth-on-these-sneakers\/","publishDate":"2020-12-22T11:30:00","id":15618,"type":null,"title":"Why NFT Collector 'WhaleShark' Spent 22 ETH on These Sneakers","category":["Finance"],"content":["The hype around sneakers has turned collectibles into investibles – fueled by a healthy appetite from “sneakerheads” and a lean supply of inventory from popular brands.","So when a startup put a one-of-a-kind high-top up for bid on the blockchain – both in digital and actual form – one whale took a bite and dropped 22 ETH (worth around $13,331 at time of sale) on a pair of AI-designed sneakers. And this was all streamed live on Twitch.","The pseudonymous buyer, who goes by the handle WhaleShark, is one of the largest collectors of art and digital-gaming non-fungible tokens (NFTs) in the industry. When he jumped into the bidding pool, it scared smaller fish out of the water.","Although he denied being a sneakerhead himself, WhaleShark told CoinDesk on a call that when he researched the world’s 17 most expensive pairs of sneakers, he found these shoes can be priced up to $50,000, primarily due to scarcity.","“So when I noticed there was going to be an NFT edition, they were pulling at my heartstrings,” he said. “I would love to hang that up on a mural or digital screen in my office.”","Not only will the $13,000 artwork hang on the wall of his office, WhaleShark will receive an exact copy of the shoe delivered to his door early next year.","The shoe in question is named “The X Evolutions,” known by most as simply The X. The kicks – clearly inspired by the iconic Nike Dunk High – were created by Instagram-popular sneaker studio RTFKT (pronounced like “artifact”).","The X auction opened on Nov. 19 and lasted for 10 days on a new platform that RTFKT built. However, the shoe that bidders saw on the 19th was just a plain white high-top. As bids topped a certain amount of ETH, the design would change – a splash of paint at a time.","“The reason I was bidding was because I wanted to see how the design evolved,” WhaleShark said.","No one knew what the shoe would look like at its 10th and final “evolution,” and that remains a mystery: The winning 22 ETH was only good enough for the sixth evolution. The final evolution was set at a threshold of 58 ETH.","“For us, it really wasn’t the best timing,” RTFKT co-founder and CEO Steven Vasilev told CoinDesk. “We saw with the recent bitcoin boom and ETH climbing on all the platforms that bidding has really slowed down.”","More recently, however, things have picked back up. Flashy NFT auctions are everywhere. Canadian DJ Deadmau5 sold a piece of his NFT collection, RAREZ, for 78 ETH (roughly $50,000) on SuperRare last week. Famous rappers are getting in on the NFT act.","This was not the first digital sneaker project by RTFKT. Earlier this year, the team sold its first piece on NFT marketplace SuperRare designed after the Tesla Cybertruck for 30 ETH. The bidding went up to 65 ETH until the bidder realized the photo he saw of Elon Musk wearing the “Cybersneaker” was photoshopped.","Investor Richard Kim, a partner at Galaxy Digital, told CoinDesk that this type of “oh s**t” moment “was a great example of a metaverse where things become so blurred you have to ask which reality was real.”","The market for real sneakers has become a real force in recent years. The global resale market is projected to reach $30 billion by 2030, according to Cowen Equity Research, which classified sneakers as an alternative asset class.","What was different about RTFKT's latest shoe was that it seemed perfect for enticing both NFT early-adopters and IRL sneakerheads. Having a physical pair involved in the deal made the “virtual flex” of winning even better, WhaleShark said.","“I kept bidding until I saw it reach a point where I thought I could definitely rock them on foot, although I was disappointed it didn’t reach level 10,” he said.","“We want to be the segue to NFTs by having a mix of physicals and digital items to get people’s feet wet a little bit,” said RTFKT co-founder Chris Le. “Down the road, we can turn off sending physicals and go completely digital maybe when AR or VR is mainstream.”","RTFKT’s co-founders told CoinDesk they believe the future of ownership is going to be mainly focused around unique virtual items, and the physical utility of them.","A digital sneaker can be used as a filter to create content, that only the person who bought it can access, Vasilev said. “On top of that, the ability to redeem a physical item also keeps the old sneakerheads happy. It’s the best of both worlds.”","Sam Englebardt, partner at Galaxy Digital, told CoinDesk in an interview that his investment firm’s thesis for NFTs is that digital objects can enhance the experience of physically-worn luxury items. Galaxy’s $1 million investment in RTFKT in December 2019 was the perfect opportunity to test the hypothesis.","“They’re innovative around the design and release of the sneaker as a physical product,” Englebardt said. “You are acquiring all the status that comes with that purchase.”"],"entity":[{"type":"Nov. 19","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"WhaleShark","content":"PERSON"},{"type":"Sam Englebardt","content":"PERSON"},{"type":"$13,331","content":"MONEY"},{"type":"$50,000","content":"MONEY"},{"type":"Tesla Cybertruck","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Englebardt","content":"PERSON"},{"type":"Steven Vasilev","content":"PERSON"},{"type":"December 2019","content":"DATE"},{"type":"$13,000","content":"MONEY"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Richard Kim","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"Vasilev","content":"PERSON"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Chris Le","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"Cowen Equity Research","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Auctions","Fashion","Galaxy Digital","NFTs","Sneakers"],"authors":["Doreen Wang"]}