{"summary":"Of those 39%, three quarters owned crypto currencies directly.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/24\/kpmg-survey-finds-75-of-canadas-institutions-owned-crypto-assets-in-2023\/","publishDate":"2024-04-24T17:12:42","id":15611,"type":null,"title":"KPMG Survey Finds 39% of Canada’s Institutional Investors Had Exposure To Crypto Assets in 2023","category":["Finance"],"content":["Institutional investors located in Canada significantly increased their holdings of cryptocurrencies in 2023, a survey by KPMG found.","The consulting group recently conducted its bi-annual Institutional Adoption of Cryptoassets survey, finding that Canada’s investment sector has re-embraced crypto after a tumultuous year for the industry in 2022. Respondents include hedge funds, family offices, pension funds, private equity and venture capital firms, among others.","“Rising U.S. debt combined with increasing inflation likely provided a catalyst for the crypto rally of 2023, and it appears investors are looking for alternative asset classes that act as a debasement hedge and a reliable store of value,” said Kunal Bhasin, partner and co-leader of KPMG in Canada’s Digital Assets practice. “Our survey findings suggest crypto assets are increasingly seen as an investable alternative asset class among such institutional investors and financial services organizations in Canada.”","The most notable increase could be seen in institutional investor holdings of cryptocurrencies, which jumped to 39% in 2023 from 29% two years earlier.","Roughly two-thirds of those with exposure had were involved in the crypto-related public equity space, up from 36% in 2021.","There also seemed to have been increased interest in crypto derivatives products, which 42% of those firms reported being exposed to versus just 14% previously.","An area that saw a significant pullback was wealth management, with only 14% of firms with crypto asset services offering financial advice for crypto to their clients, down from 42% in 2021.","Many crypto companies moved a big chunk of their business to Canada last year as U.S. regulators cracked down heavily on the industry. Crypto exchange Coinbase, for example, expanded its footprint to the Canadian West Coast, praising the country’s “regulation by engagement” rather than enforcement approach.","“Canada has played a leading role in creating a regulatory environment that supports innovation in crypto assets,” said Kareem Sadek, emerging technology risk leader and co-leader of KPMG’s Digital Assets practice. “Those actions, along with rising prices for crypto assets are likely reasons why institutional investors have been increasingly attracted to the crypto space.”","CORRECTION (April 24, 2024, 19:01 UTC): An earlier version stated that 75% of the respondent held cryptocurrencies, which was incorrect.","Edited by Stephen Alpher."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"April 24, 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Kareem Sadek","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Kunal Bhasin","content":"PERSON"},{"type":"29%","content":"PERCENT"},{"type":"39%","content":"PERCENT"},{"type":"36%","content":"PERCENT"},{"type":"14%","content":"PERCENT"},{"type":"Canadian West Coast","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"}],"hashtag":["KPMG Canada","Canada","Institutional Adoption"],"authors":["Helene Braun"]}