{"summary":"Around $100 million was sent to token pre-sales over the course of a weekend last month.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/10\/half-of-solana-pre-sales-are-scams-blockaid-says\/","publishDate":"2024-04-10T15:42:10","id":15613,"type":null,"title":"Half of Solana Pre-Sales Are Scams, Blockaid Says","category":["Finance"],"content":["Blockchain security firm Blockaid said 50% of recent pre-sale token launches on Solana have been malicious.","Bad actors have used social-engineering techniques on channels including Telegram, Twitter and Discord to trick users into interacting with malicious smart contracts or websites.","\"They are focused both on memecoins as well as existing projects, for example just in the coming days we’ve seen some of the most popular projects being targeted by some of these groups,\" Blockaid CEO Ben Natan told CoinDesk.","Last month it was reported that investors sent around $100 million worth of crypto tokens to various pre-sales, mainly on Solana, over the course of a weekend. The trend was sparked by the rapid gain of several meme coins, like book of meme (BOME).","Conducting a pre-sale is simple: A token issuer posts a smart contract address and tells investors to deposit crypto tokens on the promise that, when the pre-sale ends, the newly issued tokens will be distributed to users based on the relative sizes of their deposits.","But the ease at which someone can start a token pre-sale, coupled with investors' fear of missing out, has led to a significant increase in scams.","\"It’s just the excitement around memecoins has become ever more tempting for users to try and look for new opportunities, this excitement can tempt users into interacting with malicious actors,\" Natan said.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Blockaid","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Ben Natan","content":"PERSON"},{"type":"Natan","content":"PERSON"}],"hashtag":["Solana","meme coin","Scams","Presales"],"authors":["Oliver Knight"]}