{"summary":"Vetle Lunde, who last week predicted bitcoin would reach $45,000 in May, said markets seem to have stabilized as “rotten fruits” have been washed out of the industry.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/04\/18\/bitcoin-surge-parallels-price-movement-in-2019-analyst\/","publishDate":"2023-04-18T00:50:28","id":15617,"type":null,"title":"Bitcoin Surge Parallels Price Movement in 2019: Analyst","category":["Markets"],"content":["Vetle Lunde, a crypto markets analyst at K33 Research, sees parallels between bitcoin’s (BTC) recent surge from the doldrums of 2022 and its price pattern from 2018 into 2019.","In an interview on CoinDesk TV’s “First Mover” program on Monday, Lunde said that \"the current drawdown and recovery stage is remarkably similar to that in 2019, both in duration and price movement.”","In a research note to clients last week, Lunde wrote that bitcoin could reach $45,000. BTC was currently trading at about $29,440, down 2%, although it is up about 80% in 2023. The rebound follows a year of distress, in which multiple major firms declared bankruptcy, sending risk-shy investors fleeing from crypto markets.","Read More: Bitcoin Could Peak at $45K in May, Analyst Says","“We saw throughout the latter part of 2022 a lot of forced selling, and also selling from investors who grew cautious,” Lunde said. “This has led people to be underexposed. And has also enticed a lot of people to short (crypto) being conservative with adding exposure. This creates this dynamic where bitcoin feeds on your short squeezes and moves higher.”","He added that negative to neutral sales of derivatives, despite recent price gains, were further signs of investor caution. That sentiment could change, although the market’s relatively low liquidity remained a potential weight on future pricing.","Lunde believes that faint signs last week that the U.S. Federal Reserve would scale back its hawkish monetary policy amid mildly encouraging inflation data could boost market sentiment.","He blamed crypto prices’ swoon last year partly on firms overexposing themselves when interest rates were zero.","“It was a lot of spending, a lot of focus on growth,” Lunde said. “So you had this environment where miners took a lot of fiat that held a lot of bitcoin and then were exposed to falling prices, in addition to all the crypto banks starting to neglect due diligence.”","But the industry-wide crisis of 2022, which included multiple, major firms declaring bankruptcy, including crypto hedge fund Three Arrows Capital, has already been benefiting markets by weeding out bad actors, Lunde suggested. “A lot of these rotten fruits have been washed out of the market,” he said. “So the entire market is in a more robust stage right now where it can handle higher interest rates for longer.”","He added: “The industry has learned. I'm pretty sure that we will experience similar kinds of crisis in the future, unfortunately. But for now, those kinds of risks feel washed out of the market. So the market feels a lot more safe at the moment.","Edited by James Rubin."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"Bitcoin Could Peak","content":"ORGANIZATION"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"James Rubin","content":"PERSON"},{"type":"Lunde","content":"PERSON"},{"type":"$45K","content":"MONEY"},{"type":"$45,000","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$29,440","content":"MONEY"}],"hashtag":["Bitcoin","crypto markets","crypto industry","CoinDesk TV","First Mover"],"authors":["Fran Velasquez"]}