{"summary":"The CoinDesk Market Index fell 11% overall as we saw increased bifurcation between established majors (Bitcoin and Ether) and all other digital asset protocols and projects, writes Todd Groth, head of research at CoinDesk Indices.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/09\/digital-asset-recap-q3-2023-bitcoin-and-ether-outperform-wider-market-amid-regulatory-pressure-and-the-promise-of-etfs\/","publishDate":"2023-10-09T19:20:08","id":15628,"type":null,"title":"Digital Asset Recap Q3 2023: Bitcoin and Ether Outperform Wider Market Amid Regulatory Pressure and the Promise of ETFs","category":["Consensus Magazine"],"content":["Over the past quarter, the CoinDesk Market Index (CMI), which spans over 90% of the crypto market capitalization, declined -11%. Bitcoin (BTC) outperformed the broad benchmark by declining -10.9% while ether (ETH) underperformed, posting a loss of -12.5% for the last 3 months.","It's helpful to view these numbers in the context of their year-to-date performance, where Bitcoin has gained an impressive 64%, and Ether has risen by 41%. This underscores the resilience of these cryptocurrencies as some of the top-performing assets in 2023. This quarterly outperformance of BTC versus ETH and the broader CMI is a continuation of a trend we’ve seen throughout the year. Institutional demand for Bitcoin ETFs continues to support BTC, while the continued regulatory pressure on alternative tokens drives the bifurcation in the crypto market between the established majors (Bitcoin and Ether) and other digital asset protocols and projects.","Looking within sector quarterly performance with the CoinDesk DACS framework, the trends and preferences towards larger capitalization tokens are less clear. Over Q3 of 2023, Computing (CPU, +3%) and DeFi sectors (DCF, -8%) were relative out-performers, while Smart Contract Platform (SMT, -13%), which contains Ether, and Culture and Entertainment (CNE, -22%) were relative under-performers. See the chart below for a full sector performance breakdown for Q3 of 2023.","News related to U.S. regulation was a key driver of price movements this quarter, with SEC actions featuring prominently in this. This followed regulatory enforcement action against Coinbase and Binance earlier in June. Meanwhile, regulatory filings for spot ETFs by some of the world's largest asset managers introduced a lot of price action ahead of potential approval dates.","While July and August were relatively muted months for the market, September saw the outperformance of DeFi, Digitization and the Computing sector off the back of the partial Ripple court case win earlier in the month, and investor enthusiasm for AI, which propelled Chainlink (LINK), an on-chain data provider and the largest token of the Computing sector, to rise 24% for the month.","September also marked the one-year anniversary of Ethereum’s successful transition to a “Proof-of-Stake” consensus mechanism. This reduces the amount of computational work needed to verify blocks and transactions, effectively eliminating its carbon footprint. So far, the network has been operating as intended with staking assets becoming a popular way for crypto investors to enhance returns. CoinDesk Indices Composite Ether Staking Rate (CESR), a metric used to proxy the expected income from Ethereum staking activities, averaged 4% (annualized) over the quarterly period, trending lower to end September at 3.6%.","One significant shift in the cryptocurrency landscape in this quarter is the reduced level of risk, as defined by standard risk measures. We are now seeing lower levels of volatility, decreased correlation with traditional equities, and slightly reduced correlation among the top-30 tokens, as shown below.","\n","This shift could be an indication of a maturation of the market, as investors are becoming more discerning across token sectors, or it could be an artifact of market illiquidity, as trading volumes continue to decrease across large cryptocurrency exchanges.","Bond yields are rising sharply off of a relatively hawkish September FOMC, where the summary of economic projections (i.e. “the dot plot”) eliminated the expectation for interest rate cuts in the near term. This dot plot guidance allowed the Federal Reserve to be clearer and more concise in indicating to the market that interest rates would have to be held higher for longer. While rising interest rates haven’t immediately impacted the price of digital assets, the tightening of financial conditions and strengthening of the U.S. dollar should be expected to add further headwinds to the price appreciation for crypto currencies. Coincidentally, the CoinDesk Bitcoin and Ether Trend Indicators have registered neutral to slightly negative trend signals over the first few days of Q4.","A catalyst to break through the macroeconomic headwinds of tightening financial conditions could come in the approval of a Bitcoin spot ETF.","Why?","Firstly, it would greatly enhance accessibility, allowing a broader range of investors to easily gain exposure to Bitcoin without the complexities of direct purchase and storage, like how gold ETFs, starting in the early-2000s, simplified the process of gaining exposure to physical gold. This in turn could shift and diversify the investor base in cryptocurrencies, from tech-savvy enthusiasts to more mainstream, longer-term investors seeking diversification, which could result in a reduction in volatility across the digital asset market.","Additionally, the ETF structure would facilitate easier institutional adoption, delegating asset acquisition and storage to qualified custodians, making it more familiar and regulated for institutional investors like hedge funds and pension funds.","Finally, a Bitcoin ETF will allow investors to allocate a portion of their assets to Bitcoin as a store of value or an uncorrelated asset class. This could result in a significant influx of capital into the cryptocurrency market, marking the maturation of Bitcoin from a niche asset class to a regulated and accepted part of the traditional financial system.","Edited by Ben Schiller."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"DCF","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"past quarter","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"3.6%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"64%","content":"PERCENT"},{"type":"-11%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"-13%","content":"PERCENT"},{"type":"-12.5%","content":"PERCENT"},{"type":"+3%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"-10.9%","content":"PERCENT"},{"type":"CMI","content":"ORGANIZATION"},{"type":"CoinDesk Bitcoin","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"this quarter","content":"DATE"},{"type":"-22%","content":"PERCENT"},{"type":"30","content":"DATE"},{"type":"41%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"24%","content":"PERCENT"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"-8%","content":"PERCENT"},{"type":"2000s","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"CoinDesk DACS","content":"ORGANIZATION"},{"type":"CNE","content":"ORGANIZATION"}],"hashtag":["Features","Indices"],"authors":["Todd Groth, CFA"]}