{"summary":"CryptoQuant also said that Ethena's keep rate should remain above 32% in the event of a bear market.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/18\/usde-holders-should-monitor-ethenas-reserve-fund-to-avoid-risk-cryptoquant-warns\/","publishDate":"2024-04-18T08:10:43","id":15629,"type":null,"title":"USDe Holders Should Monitor Ethena's Reserve Fund to Avoid Risk, CryptoQuant Warns","category":["Finance"],"content":["USDe holders should monitor the project’s reserve fund to avoid risks related to the potential of a negative funding rate, according to data provider CryptoQuant.","Ethena Labs, the firm behind the USDe stablecoin, currently offers an annual yield of 17.2%, a rolling average over the past seven days, to investors that stake USDe or other stablecoins on the platform. The yield is created from a tokenized “cash and carry” trade that involves purchasing an asset whilst simultaneously shorting that asset to rake in funding payments.","Funding is a way of keeping the asset prices on derivatives exchanges close to the underlying assets. In a bullish market, holders of long positions pay short positions and vice versa in a bearish market.","CryptoQuant warns that when funding rates become negative for a prolonged period of time, Ethena’s short positions will be required to make substantial payments to those holding longs.","Ethena has allocated capital to a reserve fund for this purpose, but that fund will have to grow significantly if the market cap of USDe continues to increase.","Using examples of ether (ETH) funding rates following the Merge upgrade and the FTX collapse, a CryptoQuant report suggests that the current reserve fund of $32.7 million would only be able to sustain funding payments if USDe’s market cap were below $4 billion and $3 billion respectively. The market cap of USDe has risen to $2.3 billion two months after being issued.","The report adds that Ethena’s keep rate, which is the portion of revenue that gets allocated to the reserve fund, would need to remain above a certain level depending on funding rates in order to be sustainable.","“In order for Ethena to withstand a bear market period,” the report said. “It would need to sustain a keep rate above 32%. This would allow the reserve fund to be large enough to resist a period of extremely negative funding rates during a bear market,” the report added.","Edited by Parikshit Mishra."],"entity":[{"type":"17.2%","content":"PERCENT"},{"type":"$2.3 billion","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"$32.7 million","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Ethena","Stablecoin","Derivatives"],"authors":["Oliver Knight"]}