{"summary":"Zhao wants his crypto exchange to become a bridge between traditional finance and crypto, according to a Bloomberg report.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/11\/02\/binance-ceo-zhao-considering-buying-banks-report\/","publishDate":"2022-11-02T18:27:40","id":15622,"type":null,"title":"Binance CEO Zhao Considering Buying Banks: Report","category":["Finance"],"content":["Binance founder and CEO Changpeng Zhao is looking into potentially buying banks as a way of bridging the gap between the worlds of traditional finance and crypto, according to an interview Zhao did with Bloomberg at the Web Summit conference in Lisbon.","Zhao did not name any specific targets, and also said he's open to either minority investments or a full acquisition.","“There are people who hold certain types of local licenses, traditional banking, payment-service providers, even banks. We’re looking at those things,” Bloomberg quoted Zhao as saying.","Zhao also noted that investing in banks is a smart strategy for Binance because when the crypto exchange works with a bank, Binance often winds up driving many new users to it, increasing the bank’s valuation.","Zhao has said in the past Binance has over $1 billion to spend on acquisitions, and he recently committed $500 million to help fund Elon Musk’s $44 billion takeover of Twitter. So far this year, Zhao's acquisition strategy has focused on expanding into publishing, decentralized finance (DeFi) and non-fungible token (NFT) projects.","UPDATE (Nov. 2, 18:48 UTC): Added detail to Zhao's comments in first paragraph."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$44 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Nov. 2","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Lisbon","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["Binance","Changpeng \"CZ\" Zhao","Acquisitions","banks"],"authors":["Nelson Wang"]}