{"summary":"The sandbox will let regulators and companies test solutions, including distributed ledger technology, to tokenize securities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/18\/uk-publishes-regulations-for-a-digital-securities-sandbox\/","publishDate":"2023-12-18T17:51:52","id":15638,"type":null,"title":"UK Publishes Regulations for a Digital Securities Sandbox","category":["Policy"],"content":["The U.K. has introduced a new regulation that will allow the country’s financial watchdogs to run a sandbox for tokenized securities, according to a Monday publication.","Sandboxes let companies test new solutions and products under regulatory supervision. With the new regulation – which will take effect on Jan. 8 – the Financial Conduct Authority (FCA) and the Bank of England will be able to operate the Digital Securities Sandbox (DSS), announced earlier this year.","Businesses will also get to test distributed ledger technology that powers crypto to digitize or tokenize traditional securities.","Tokenization of real assets is all the rage among financial institutions worldwide, and U.K. regulators are trying to figure out how best to regulate them. Participating in the DSS will subject companies to modified rules in case current ones act as barriers, a document explaining the law said. The regulators themselves will be able to test out things and make rule changes to accommodate developing technologies.","The U.K. is not wasting time using its new powers under the recently passed Financial Services and Markets Act 2023 to establish how it wants to regulate the crypto sector. The DSS regulation is a by-product of the Act.","Edited by Sandali Handagama."],"entity":[{"type":"Digital Securities Sandbox (DSS","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"DSS","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Sandali Handagama","content":"ORGANIZATION"},{"type":"Jan. 8","content":"DATE"}],"hashtag":["Regulations","Crypto","Law","Digital Securities","Tokenized Assets"],"authors":["Camomile Shumba"]}