{"summary":"Worldcoin’s “minimalist” wallet, World App, wants to help you prove you’re human in the age of AI.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/05\/08\/sam-altmans-crypto-project-worldcoin-releases-first-major-consumer-product\/","publishDate":"2023-05-08T13:00:00","id":15634,"type":null,"title":"Sam Altman’s Crypto Project, Worldcoin, Releases First Major Consumer Product","category":["Technology"],"content":["In the age of large language models (LLMs) and ChatGPT, AI is poised to make a weird internet even weirder – turning the content-driven social media apps, news sites and media platforms of today into future uncanny valleys that blur the line between man and machine.","As advances in AI make it more difficult to discern bots from humans, Sam Altman, the co-founder of Open AI – the company behind ChatGPT – thinks blockchains can help.","Altman’s crypto project, Worldcoin, rose to prominence last year with a controversial, Silicon Valley vision for a universal basic income (UBI): a crypto token that can be distributed in equal quantity to everyone in the world.","Worldcoin is back again this week with a new launch – this one poised to be its biggest yet. World App, Worldcoin’s crypto wallet, built on the Ethereum sidechain Polygon, is the first product from the elusive identity upstart that anyone, anywhere will be able to download.","The new app is one part minimalist crypto wallet, and one part passport for the AI era. It’s Worldcoin’s biggest swing yet to redefine itself in the eyes of consumers.","Worldcoin’s initial rollout was rocky. The retina-scanning metal “orb” that the project used to authenticate new users was criticized as dystopian, and a damning exposé from the MIT Technology Review forced Tools for Humanity – the company behind Worldcoin – to confront allegations of exploitation and deceptive recruiting practices.","Weathered by negative press coverage and a tumultuous year for the wider crypto industry – and amid an AI boom kicked off, in large part, by Altman’s Open AI – Worldcoin reasserted itself in March with a repackaged vision focused on “proof of personhood.” Announced in March, Worldcoin’s World ID protocol will allow app developers to leverage its network of biometrically-authenticated humans.","“Everything that has happened with AI in the last six months has made people understand the project a lot better,” said Tiago Sada, the head of product at Tools for Humanity.","For those without a World ID, who’ve yet to peer into one of Worldcoin’s retina-scanning orbs, World App will function as a stripped-down crypto wallet – not too dissimilar from Coinbase Wallet, Metamask, or any number of other apps that allow people to buy, sell, and store cryptocurrency.","“You would probably find even fewer features on World App, actually, than on some of those wallets – and that's deliberate,” explained Sada.","Tools for Humanity has global ambitions, and it says it designed its wallet app to be more accessible than other wallet services. To avoid overwhelming new crypto users, the app opts for a sleek, “minimalist” design, boasts a relatively bare-bones feature set, and is somewhat restricted in the number of crypto tokens that it supports.","Built on Polygon – a blockchain that can send and receive assets from Ethereum but offers cheaper fees to users – World App currently offers access to “wrapped,” Polygon-based versions of Bitcoin, Ethereum and stablecoins like the U.S. dollar-pegged DAI token (Worldcoin says more tokens are coming soon).","“I think this really meets that need of keeping all of the really important guarantees of privacy and self custody of crypto, but in a way that's just super friendly – as friendly as custodial services” that store crypto on a customer’s behalf, explained Sada.","All of the aforementioned features will be available to anyone who downloads World App. For those in possession of a verified World ID, World App will serve as a kind of digital passport – granting retina-scanned humans access to apps and services gated to World ID holders.","There aren’t many applications that leverage Wolrdcoin’s identity protocol yet, but if you squint, you might be able to imagine the future envisioned by Sada – where World ID is weaved into the very fabric of blockchain and the broader web.","As for where World ID could be useful one day, “a big pocket is financial services,” says Sada. “For example, there are things like undercollateralized lending in DeFi that really haven’t been possible because there is no sense of identity.”","Sada is also excited about applications around voting and social media account authentication. “Whether you're talking about voting on a poll on something really dumb on Twitter, or voting for something much more serious, there's a lot of really interesting voting applications there,” he said.","World App will provide a gateway for World ID users to claim their allotment of Worldcoins, though the token remains unavailable to claim in the United States for regulatory reasons and the mechanics of the claim process elsewhere remain somewhat vague. “We are generally not able to talk a lot about the Worldcoin token right now,” Sada said.","Although the perks of having a World ID remain mostly theoretical in May, 2023, Tools for Humanity is offering World ID early adopters at least one benefit: World ID holders will be allowed to transact on World App without fees.","A Beta version of the World App has already been available to World ID holders for several months. “Since its initial debut, 1.5 million people have joined the beta, more than 500,000 of which use it every month,” Tools for Humanity said in a statement. “On a typical day, it sees around 60,000 transactions and 25,000 World ID checks from over 100,000 people around the world.” According to Tools for Humanity, its new wallet app is “already one of the most popular ways to access crypto today.”"],"entity":[{"type":"Humanity","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"MIT Technology Review","content":"ORGANIZATION"},{"type":"Worldcoins","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"May, 2023","content":"DATE"},{"type":"Tiago Sada","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Tools for Humanity","content":"ORGANIZATION"},{"type":"Altman","content":"PERSON"},{"type":"Sada","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["worldcoin","AI","Identity"],"authors":["Sam Kessler"]}