{"summary":"Last week's Bitcoin halving came and went – just as Satoshi Nakamoto programmed it. But the big surprise was the fast uptake of Casey Rodarmor's new Runes protocol, his second big hit on the original blockchain in two years.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/24\/the-protocol-analyzing-runes-impact-as-bitcoin-fee-bonanza-fades\/","publishDate":"2024-04-24T17:45:03","id":15633,"type":null,"title":"The Protocol: Analyzing Runes Impact as Bitcoin Fee Bonanza Fades","category":["Technology"],"content":["Last week's once-every-four-years Bitcoin halving came and went – just as Satoshi Nakamoto programmed it 15 years ago. But the big surprise was the fast uptake of Casey Rodarmor's new Runes protocol, his second big hit on the original blockchain in two years. Now, it looks like the initial fee bonanza might be fading, and the question is whether Runes transactions will provide a sustainable source of ongoing revenue for miners, especially now that the block rewards have been cut in half. We've got the recap.","ALSO:","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","Chart shows Bitcoin fees spiking dramatically post-Runes-launch, then subsiding somewhat. (BitDigest)","RUNING THE PARTY? Bitcoin's once-every-four-years \"halving\" was supposed to bring a steep cut in revenue for crypto miners, since their rewards for new data blocks would drop by 50%. Instead, the simultaneous launch of Casey Rodarmor's new Runes protocol – for minting digital tokens on top of the oldest and largest blockchain – proved so popular that it caused massive network congestion, sending transaction fees to record levels and showering Bitcoin miners with a windfall like never before. On a halving watch party hosted by Tone Vays, longtime Bitcoin experts expressed astonishment at transaction fees surpassing $2 million in certain blocks, versus a more typical level of less than $100,000. The main questions now are whether the Runes fever will last, and if so how Bitcoin will adapt. BitDigest newsletter circulated a chart (above) showing a steep drop-off in the fees as the initial post-Runes launch subsided. But the community discussion immediately turned to whether the extra traffic might prompt developers to accelerate their quest to build out and improve Bitcoin layer-2 networks. On Monday, one of the more prominent projects, Stacks, rolled out its much-anticipated \"Nakamoto\" upgrade, tipped to dramatically increase the speed. \"Anything that causes fee rates to spike will probably drive people to seek out other solutions,\" Bitcoin Core developer Ava Chow said in an interview with CoinDesk's Daniel Kuhn. Rodarmor, who created the Ordinals protocol for \"Bitcoin NFTs\" last year, shaking up the blockchain's conservative culture, has famously said that the Runes protocol was nothing more than a way of launching \"sh!tcoins\" on Bitcoin – a dicey proposition given how anti-altcoin longtime bitcoiners tend to be. There's now speculation that top Ordinals collections might move to airdrop runes, another practice imported from other blockchains. The Bitcoin NFT project Runestones, led by the pseudonymous developer Leonidas, is reportedly airdropping DOG coins to holders of its inscriptions. In the meantime some of the newly minted runes are drawing jaw-dislodging valuations as they get listed on various crypto exchanges. Bitcoin.com estimated that a rune called \"Z•Z•Z•Z•Z•FEHU•Z•Z•Z•Z•Z,\" or \"Z•FEHU\" for short, already has a fully diluted valuation over $2 billion. (By the way, to type that dot in the middle of the trading ticker, a Runes convention, type option-8 on a Mac keyboard. I had to ask our markets editor how to do it. At this rate, it might be something we all need to learn.)","CELO'S CHOICE. The main developer behind layer-1 blockchain Celo, after a months-long search for a technology provider for its migration to become a layer-2 network atop Ethereum, chose to recommend Optimism's OP Stack. Teams representing rival layer-2 networks Arbitrum, Polygon and zkSync had vied for Celo's business, with the selection process starting to look like TV's \"The Bachelorette.\"","COSMOS 🐞– Asymmetric Research, a security firm that contributes to the Wormhole interoperability protocol, disclosed details of a vulnerability impacting the Cosmos blockchain ecosystem that it says could have put more than $150 million at risk.","BIPSTERS: Bitcoin Core developer Ava Chow led the nomination process to name five new editors for BIPs, or Bitcoin Improvement Proposals – the standard for proposing nonbinding software updates that will somehow change the Bitcoin protocol, our Daniel Kuhn reported. The months-long search effort was finalized on Monday, after Jonatack made modifications to the BIP GitHub. A lingering question is whether the addition of editors will make it easier to push through proposals like the pending OP_CAT, which has not been given a BIP number through the formal process, despite reports that originally suggested otherwise.","ALSO:","Top picks of the past week from our Protocol Village column, highlighting key blockchain tech upgrades and news.","1. Metis unveiled phase 2 of its decentralized sequencer, adding new technical features and introducing \"Sequencer Mining\" for users, according to the team.","Screenshot from Metis video showing how its decentralized sequencer architecture works (Metis)","2. Neura, the EVM-compatible layer-1 blockchain for AI from the team at Ankr, built on Cosmos SDK, just released its public testnet, now available for developers looking to build dApps that fuse AI and Web3, according to the team.","High-level architecture of Neura. (Neura)","3. (PROTOCOL VILLAGE EXCLUSIVE) Omni Foundation, supporting Omni Network, which is a layer-1 chain and Ethereum-focused interoperability protocol powered by EigenLayer restaking, announced the launch of Omni Network’s mainnet on the Ethereum layer-2 networks Arbitrum and Optimism.","4. (PROTOCOL VILLAGE EXCLUSIVE) The DODO team, which previously developed the \"Proactive Market Maker\" algorithm and features including a cross-chain swap aggregator, announced the launch DODOchain, an Omni Trading Layer3, powered by Arbitrum Orbit, EigenLayer and AltLayer, according to the team.","5. (PROTOCOL VILLAGE EXCLUSIVE): Alchemy, a blockchain development firm, launched \"Pipelines,\" a new tool that allows engineers to build and maintain a data pipeline with just a few clicks, according to the team.","Fundraisings","Turnkey co-founders Jack Kearney and Bryce Ferguson (Turnkey)","Turnkey, a company that builds wallet infrastructure for blockchain developers, has raised $15 million in a Series A funding round led by Lightspeed Faction and Galaxy Ventures.","Runes DEX, an automated market maker (AMM) platform for runes on Bitcoin, announced the successful closure of its $2 million seed investment round, according to a press release.","Deals and grants","Gavin Wood made a presentation on JAM at Token 2049 in Dubai last week. (@mattunchi via Polkadot)","Web3 Foundation (W3F), the foundation behind the Polkadot ecosystem, has announced a 10 million DOT ($74.5 million) prize pool, \"to foster diversity within the development of JAM, a protocol combining elements of both Polkadot and Ethereum,\" according to the team.","Safe, a provider of blockchain smart accounts, has \"welcomed the senior leadership team of Multis to the Safe Ecosystem Foundation and completed the strategic acquisition of the Multis source code,\" according to the team.","Chia Network Makes Progress Toward an IPO, CEO Says","Data and Tokens","Renzo Restaked ETH Suffers a Brief Crash on Uniswap","Avail Confirms Token Airdrop Plans, a Week After Leaked Screenshots","Shiba Inu Fetches $12M Investment in Token Sale to Build Privacy-Focused Blockchain","Tether Reorganizes Into 4 Divisions as It Expands Beyond Stablecoins","Akash Network, Decentralized Cloud Computing Platform on Cosmos, Sees Token Surge","Bitcoin's 200-Day Price Average Approaches Record, Historically Kicking Off Most Powerful Phase of Bull Market","Regulatory, Policy and Legal","Mango Markets Exploiter Avi Eisenberg Found Guilty of Fraud and Manipulation","Ripple Says $10M Penalty Enough, Rejects SEC’s Ask of $1.95B Fine in Final Judgment","Tether Will Freeze Wallets Evading Venezuelan Sanctions","Nigeria Directs Entities to Identify Those Dealing Crypto With Bybit, KuCoin, OKX and Binance","Talk to a few venture capitalists about the Bitcoin ecosystem, and you'll hear a variety of explanations as to why there isn't more top-down investment into startups focused on the blockchain. One is that the biggest Bitcoin investors tend to be HODLers, and they see no reason to part with their BTC in order to put money into a startup. Another is that many crypto VC firms, in return for their dollars, expect an allocation of digital tokens that would eventually zoom in price, and that's not really an option in for Bitcoin startups, since the community in general is (or was, until recently) averse to anything non-BTC. A final reason is that the Bitcoin developer culture (again, until recently) was so conservative that it didn't really attract the sort of experimentation and entrepreneurship witnessed on other chains.","But there's now a growing cottage industry of venture capitalists and investment firms willing to put money into Bitcoin-focused startups, such as Trammell Venture Partners (TVP) and Ten31. In February, Dan Held, a former Kraken marketing executive who recently served as fractional CMO for Taproot Wizards and Trust Machines, announced he was joining Joe McCann's crypto fund, Asymmetric Financial, as a general partner, with plans to spearhead a new Bitcoin DeFi Venture Fund I, targeting a raise of $21 million.","TVP earlier this month released a research brief titled, \"The Emerging Bitcoin-Native Venture Capital Landscape,\" to illustrate the opportunity. The chart below shows that BTC represents more than half of the market capitalization of all cryptocurrencies, but comprises just a small fraction of the venture dollars and deal count:","(Trammell Venture Partners)","May 9-10: Bitcoin Asia, Hong Kong.","May 29-31: Consensus, Austin Texas.","May 29-31: Bitcoin Seoul.","June 11-13: Apex, the XRP Ledger Developer Summit, Amsterdam.","July 8-11: EthCC, Brussels.","July 25-27: Bitcoin 2024, Nashville.","Aug. 19-21: Web3 Summit, Berlin.","Sept. 19-21: Solana Breakpoint, Singapore.","Sept. 1-7: Korea Blockchain Week, Seoul.","Sept. 30-Oct. 2: Messari Mainnet, New York.","Oct. 9-11: Permissionless, Salt Lake City.","Oct. 21-22: Cosmoverse, Dubai.","Oct. 23-24: Cardano Summit, Dubai.","Oct. 30-31: Chainlink SmartCon, Hong Kong","Nov 12-14: Devcon 7, Bangkok.","Nov. 20-21: North American Blockchain Summit, Dallas.","Feb. 19-20, 2025: ConsensusHK, Hong Kong","Edited by Bradley Keoun."],"entity":[{"type":"CMO","content":"ORGANIZATION"},{"type":"May 29","content":"DATE"},{"type":"Chia Network Makes Progress Toward","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bangkok","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bitcoin NFT","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Asymmetric Financial","content":"ORGANIZATION"},{"type":"Austin Texas","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Asymmetric Research","content":"ORGANIZATION"},{"type":"Sept. 30","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Oct. 21","content":"DATE"},{"type":"Bryce Ferguson","content":"PERSON"},{"type":"Oct. 23","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"Taproot Wizards and Trust Machines","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"13","content":"DATE"},{"type":"Arbitrum Orbit","content":"PERSON"},{"type":"$21 million","content":"MONEY"},{"type":"11","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Oct. 30","content":"DATE"},{"type":"Dallas","content":"LOCATION"},{"type":"BIP GitHub","content":"ORGANIZATION"},{"type":"June 11","content":"DATE"},{"type":"Ava Chow","content":"PERSON"},{"type":"Omni Network","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$74.5 million","content":"MONEY"},{"type":"Shiba Inu Fetches $12M Investment","content":"ORGANIZATION"},{"type":"Trammell Venture Partners (TVP","content":"ORGANIZATION"},{"type":"Cardano Summit","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Safe Ecosystem Foundation","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Metis","content":"ORGANIZATION"},{"type":"Stacks","content":"LOCATION"},{"type":"Penalty Enough","content":"ORGANIZATION"},{"type":"Jack Kearney","content":"PERSON"},{"type":"Leonidas","content":"PERSON"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Sept. 19","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"Nov. 20","content":"DATE"},{"type":"$150 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"$10M","content":"MONEY"},{"type":"Trammell Venture Partners)","content":"ORGANIZATION"},{"type":"Devcon 7","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Brussels","content":"LOCATION"},{"type":"Dan Held","content":"PERSON"},{"type":"Feb. 19","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"May 9","content":"DATE"},{"type":"Mango Markets Exploiter Avi Eisenberg Found Guilty of Fraud and Manipulation","content":"ORGANIZATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"Bitcoin Asia","content":"LOCATION"},{"type":"July 25","content":"DATE"},{"type":"North American Blockchain Summit","content":"ORGANIZATION"},{"type":"27","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"Korea Blockchain Week","content":"LOCATION"},{"type":"Oct. 2","content":"DATE"},{"type":"24","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"$1.95","content":"MONEY"},{"type":"Omni Foundation","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Oct. 9","content":"DATE"},{"type":"22","content":"DATE"},{"type":"21","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"8","content":"DATE"},{"type":"Joe McCann","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"2049","content":"DATE"},{"type":"TVP","content":"ORGANIZATION"},{"type":"July 8","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"Nashville","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Galaxy Ventures","content":"ORGANIZATION"},{"type":"31","content":"DATE"},{"type":"Jonatack","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"20, 2025","content":"DATE"},{"type":"Native Venture Capital Landscape","content":"ORGANIZATION"},{"type":"XRP Ledger Developer Summit","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"Aug. 19","content":"DATE"},{"type":"Salt Lake City","content":"LOCATION"},{"type":"Avail Confirms Token Airdrop Plans","content":"ORGANIZATION"}],"hashtag":["The Protocol","Runes","Runes protocol","Fees","Celo","Optimism"],"authors":["Bradley Keoun"]}