{"summary":"Legendary art book publisher TASCHEN is putting out the first major survey of NFT art, while Christie's launches his new art project tonight.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/08\/robert-alice-made-nft-history-now-hes-writing-about-it\/","publishDate":"2024-03-08T18:11:55","id":15631,"type":null,"title":"Robert Alice Made NFT History, Now He’s Writing About It","category":["Consensus Magazine"],"content":["Robert Alice is an alias, if you don’t already know. A character created for an established U.K.-based artist after he was captivated by the emerging world of NFT art and wanted to jump into the fray. And in just a few years, Alice has done just that — he has produced a number of hugely admired conceptual art installations — on the micronation of Sealand, at the Monnaie de Paris, through generative AI that chomped through centuries of literary history.","Of course, NFTs have taken a hit financially speaking. Even while the rest of the crypto industry is rallying to new highs, even the so-called “blue chip” NFT collections are still seeing bear market valuations. Although draped in the language of community and brand building, most NFTs served one purpose: tricking the greater fool. Alice, of course, sees more in NFTs than mere speculation, and counts them as part of a wider crypto-anarchic movement.","“As someone deeply interested in art and value systems, there’s parallels in that people say art has no intrinsic value and that bitcoin is fake money,” he told CoinDesk in an interview. But there’s real value in what NFTs represent and what they empower — a shakeup to the legacy art industry where he made his bones and a canvas for anyone with an idea to create. While there are certainly roadblocks, NFTs are an equalizer because no one is born crypto-native, it’s something you become.","For the past two years, Alice has been working on a survey of NFT art history — from the ur-projects like EtherRocks and Bitchcoin to artists who only recently exploded on the scene. Notably, “On NFTs” will be the first such effort published by premier art book publisher TASCHEN. Alice himself has a claim to be included as the first to sell a work at auction at Christie's (predating Beeple’s much discussed $69 million “Everydays” sale by nearly a year).","Today, Alice is heading back to Christie’s for the first time in four years for the launch of a new series, called “SOURCE [ON NFTs],” created by a generative machine learning model he hardcoded. CoinDesk caught up with Alice ahead of the launch to talk about NFT history, how blockchain is changing the legacy art market and his discovery of crypto’s anarchy.","Was Robert Rauschenberg right to punch Scull?","It’s an iconic moment in the history of the art market. It was 1973 - the first major black-tie evening auction for contemporary art, and Scull made millions off work he’d bought very recently. I don't actually know if it ever really happened. It's kind of a myth.","I swear I’ve seen a video.","It's more of a push. But it was a punch before the video surfaced. So I quite like to keep it like that. To some extent it underscores this new world we live in, with crypto, NFTs and the liquidity that it brings — it works to expose the economics of the art market in a much more transparent way than it was before. The traditional art market likes to say, oh, no, we don't speculate or trade but they do. They just haven't had to register everything on the blockchain. So I think that Rauschenberg moment really underscores, right at the infancy of the contemporary art market, this tension or past imbalance between the artist and the value capture they receive versus the value capture that a collector receives.","See also: How to Make Money Buying Art: Advice From Art Market Expert Magnus Resch | Opinion","It’s interesting that crypto’s first killer app was art — the first time a mass of people went onto blockchains to do a secondary transaction shows a lot about the importance of art in contemporary society. These are the kind of topics explored in \"On NFTs,\" the book I edited for TASCHEN, which is the largest art historical study on NFTs to date.","You’re referring to CryptoKitties?","It was the first time the Ethereum network got so congested it blew up.","I remember.","It was a really interesting moment - it underscored the basis of NFTs is this idea of collectability. In the introduction to \"On NFTs\" I write about this famous Hal Finney post from 1993, which was sort of a premonition of NFTs, which focuses on rarity and collectibility, 15 to 20 years before they were even a thing.","You've just released TASCHEN’s “ON NFTs,” the largest art historical study of NFTs. Tell us about the making of the book?","This kind of ties into the making of the book, the beauty of working with TASCHEN, which really is the bluechip publisher of art books has been the level of artistic craft that went into the creation of it. As an artist, you're never happy with what you made, but I was absolutely overwhelmed. The blockchain will always be a primary source for NFTs, but TASCHEN has created the greatest physical portal into that digital realm.","How did you get access to France’s national mint for your exhibition “BABEL?”","Through a curatorial platform called LaCollection. I like the French, they are provocateurs at heart. They like scandal.","The Monnaie de Paris is the oldest continually running institution in Europe — older than the Università di Bologna. It now does contemporary art shows. It's kind of interesting because if you think about it from the point of view of what bitcoin is trying to reengineer, you start to get an understanding for how closely bound together the idea of the state and money is. It's no surprise the oldest institution in Europe is the institution that makes the money — it's the only thing that has survived since 864 AD. Religions have come and gone in that time, whole belief systems have come and gone in that time. People will say oh, bitcoin is volatile. Well, we're not just reinventing food delivery services here. We're up against a 2,000-year-old architecture. And that's why it'll take a long time. Same for NFTs, remember people were making cave paintings.","Just because you said something nice about the French, which is unusual from what I understand about Brits. There's a ton of micronations in and around the U.K. — Sealand — where you recently held a show, the Pirate Radio phenomenon, that breakaway state in a London building.","Well. We're an island nation, right? We're a proud eccentric seafaring nation, historically, you know, it hasn't really been invaded since 1,066 — it's one of the few countries that has existed in peacetime for a long time. And a lot of it has this anarchist flavor — when Satoshi published Bitcoin, Sealand was being used as a crypto anarchist data center. We flew an exhibition there via helicopter as the specific work related to this history. 14km out in the North Sea, nothing but horizon — It was a surreal exhibition.","How do you personally display your NFT collections at home?","So I started in the NFT space as a collector, and have a collection I'm very proud of. And to display it, I use custom screens to fit the size of the work and treat it like a normal work of art. Not in a sideshow. I'll change it every six months. There's always been this tension between the physical display of NFTs because ultimately they are digital artworks that function best in a digital native exhibition context. The idea of scale is tricky to create, especially when you're looking at an OpenSea thumbnail. And there's a limit to how many screens you can have in your home before it looks like a TV store. When we have proper AR and VR enabled experiences where you can experience digital artwork in digital environments, that will be really powerful. You can imagine a three-dimensional algorithmic painting, where you pay a couple of sats [satoshis, the smallest unit of account of bitcoin] or ETH to go and get a completely unique experience.","It's actually been interesting to see during the bear market how many collectors are now asking me for physical prints. With the TASCHEN release — you now have this large format coffee table book with absolutely beautiful illustrations even if you don’t own the NFTs.","Do you think Dutch auctions will take off in the traditional manner?","I’m talking to Christie’s about this for the auction happening Friday. I think it's an experiment. I did the first NFT auction at Christie's [Alice’s “Portraits of a Mind”] and now I’m going to come back to Christie's nearly four years later. Seeing how it's changed and how the infrastructure is built. That first sale and auction very much brough the crypto and NFT space into the traditional art market on their terms. Now years later there are market mechanics that have come fundamentally out of crypto and are being adopted by traditional auction houses that have been around for 400 years. The point of the Dutch auction is to re-engineer the idea of what constitutes value and fairness. That says a lot about crypto's continued impact.","Any thoughts on the Google Gemini mishap — the AI generated, politically correct Nazis situation?","We live in this world now where truth has become political. Google created these guardrails for Gemini that show their biases. Their original mission was to index the world's knowledge, to be a platform for the finding of truth. As soon as you add these political guardrails, whether it's from the left or the right, you start to lose sight of that original mission.","A part of the project \"SOURCE [On NFTs]\" is about looking at ideas of truth through history, specifically in terms of the NFT space. It really is a project that was influenced by the making of this book. We trained an algorithm on a tower of key texts, historical texts — everything from fourth century philosophy, cryptographic white papers, works of science fiction and politics using a form of machine learning. It found a kind of soul in each text, all these keywords. By using machine learning in a completely free associative way, radically open in its architecture, it has generated provocative things that aren't necessarily what I believe as the artist that has written the algorithm. You've got all these different factors. You've got the archiving of truth, AIs hallucinating, blockchains immutably recording things coming up against post truth politics. And the point is to show people that words can be combined together to create any meaning and any outcome and that you don't necessarily have to stand behind those words. You know, they just promote the fact that language is another power","Decentraland: overrated, underrated?","Already overrated. But points to an interesting future as most crypto projects do.","This one is kind of mean, but Sotheby's.","Neither, but I would definitely say that they are underrated in terms of the long term support and impact on the space. The NFT department is one small fraction of the entire art institution. But if you want to onboard more people, then it's really important to have that at Sotheby's. More importantly, they actually pick quality works and bring artists from the traditional space into the NFT space. The service they provide is really important.","Inscriptions?","Underrated and I'm really excited about them.","Are you planning on producing anything?","I will.","Excellent. OpenSea?","Oh, good question. It's easy to say overrated. I think the whole NFT space went up in arms over OpenSea removing royalties as a market response to what Blur was doing. Somehow Devin {Finzerr], and the rest of the team took a huge amount of flak for that. But what that revealed is that you can write royalties into the metadata of your smart contract, but it doesn't mean anything on an executionable level. It still requires trust. That was one of the central narratives of the first NFT bull run, that artists’ royalties were indelible but that just wasn't the case. OpenSea isn’t to blame for that, theNFT space is to blame for that. You cannot at one point celebrate open market dynamics and decentralization and then ask players in the space to abide by social principles that are not input into the smart contract or blockchains. That's the whole point in the first place, to take trust out of the equation.","See also: Why NFT Artists Shouldn't Expect 'Royalties' | Opinion","Would you personally consider yourself to be a crypto anarchists or are you just interested in aesthetics and history?","Yeah, I wouldn't consider myself a crypto-anarchist. I feel taken by the story of bitcoin. And as someone deeply interested in art and value systems, there’s parallels in that people say art has no intrinsic value and that bitcoin is fake money. The methods of validation and value appreciation are much the same. Politically I'm very moderate, but I do believe in the mission of bitcoin. I am a bitcoiner, I believe fundamentally in crypto. But I'm also pragmatic and flexible. And I also don't necessarily believe that if there was only crypto in the world it would necessarily be a good thing.","Is there anything that you wanted to put in the book but couldn’t?","History is very fragile, especially today, it's very chaotic. That email that gets missed means they don't get into that history, for example. Or a project gets released two days after your production date and you can't put it in. No book is ever going to tell the entire story. It is just a simple representation of it. The main thing, since we've been doing this has been AI and generative art — there’s a lot of that in the book. But I would have broken out those two sections to account for the importance they’re taking on. The way we produced it was supposed to be decentralized. We used a consensus voting models when we selected the artists because it's not my opinion that matters, it’s the opinion of a wider ecosystem.","The most important thing to take from the book is that it is a provocation to say if you don't like it or if you disagree with something or if you think something is more important then go out and create your own (not rage at me on Twitter, because I’m not going to respond). Take a slow look at a fast art, do the proof-of-work, commit a year or more of your life and produce your version of art history — something that showcases the importance of history as you see it, because that’s how a canon is built with multiple perspectives. If you want to have a space that's taken seriously, then you need to have these major cornerstones produced."],"entity":[{"type":"Magnus Resch","content":"PERSON"},{"type":"France","content":"LOCATION"},{"type":"Christie’s","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"Scull","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"Alice","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"$69 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Robert Rauschenberg","content":"PERSON"},{"type":"Rauschenberg","content":"PERSON"},{"type":"Sealand","content":"ORGANIZATION"},{"type":"Hal Finney","content":"PERSON"},{"type":"Pirate Radio","content":"ORGANIZATION"},{"type":"Sotheby's","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"OpenSea thumbnail","content":"ORGANIZATION"},{"type":"North Sea","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Devin {Finzerr]","content":"PERSON"},{"type":"1993","content":"DATE"},{"type":"TASCHEN","content":"PERSON"},{"type":"1973","content":"DATE"},{"type":"TASCHEN","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Robert Alice","content":"PERSON"},{"type":"Università di Bologna","content":"ORGANIZATION"},{"type":"four years later","content":"DATE"},{"type":"Alice’s","content":"PERSON"},{"type":"Christie","content":"ORGANIZATION"},{"type":"Google Gemini","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Opinion","NFTs","Books","Art","Culture","The Node","Newsletters","generative art","AI"],"authors":["Daniel Kuhn"]}