{"summary":"Discord is a great tool to connect with like-minded individuals and engage with their favorite projects. But it's also a lightning rod for scammers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/crypto-discord-where-to-go-what-to-know\/","publishDate":"2022-01-14T19:48:51","id":15635,"type":null,"title":"Crypto Discord: Where to Go, What to Know","category":["Learn"],"content":["For anyone interested in cryptocurrencies, Discord can be a good place to acquire information, ask questions and exchange ideas. In addition, channels dedicated to individual projects and coins can be a valuable way to educate yourself about a protocol before investing any money into it.","First off, let’s unpack the language of Discord.","Finding the right Discord channels can seem daunting because there can be what seems like an overwhelming number of choices and the volume of chatter within some servers is astronomical. It’s also important to be mindful that a lot of the messages you’ll receive on Discord will likely be from scammers attempting to access your funds by convincing you to visit fake websites, disclose your private keys\/ seed recovery phrase or download malware.","Remember, anyone can start a server so the existence of one should not be relied upon as a sign of trustworthiness or legitimacy","The primary draw of a Discord server is being part of a large group of people who share similar interests. It can be a great way to gauge social interest in a project as well as receive updates. Moreover, it can help keep you focused on topics that most interest you.","Similar to joining a regular chat room, a Discord server can simply be a place to have a good time and engage with other enthusiasts around the world. However, you should be careful about exchanging sensitive information or clicking links your new “friend” sends your way in a private conversation. Just because you might’ve shared an interesting conversation about a cryptocurrency you’re both keen to invest in doesn't mean you should abandon basic security procedures. These include:","Read More: How to Stay Safe and Avoid Common Bitcoin Scams","One appealing aspect of Discord is that you can access the application through a PC application, mobile application or web browser. Moreover, it lets you join as many servers as you like without having to own multiple instances of the app. The look and feel of Discord may remind you of AOL or MSN Messenger – in this case, though, every circular icon on the far left-hand side is a server instead of an individual person.","Finding Discord servers to join will depend on which projects you are interested in. The Discord channel for bitcoin - or, more specifically, the Bitcoin subreddit - can be found on the Reddit page. Similarly, other prominent cryptocurrency projects with a subreddit will have the official link to a dedicated Discord server in their \"Resources\" section on Reddit.","Reddit is a \"message board\" where you can engage with a global audience interested in specific cryptocurrencies or projects. It is somewhat similar to Discord, although it lacks the real-time chatting function that Discord provides.","As you can see, by hovering over the \/r\/Bitcoin Discord link, joining the server happens by clicking the URL. Every URL is an invite code – similar to a free attendance ticket – that anyone can use. Clicking the link will take you to the Discord interface and allow you to access the server via the web browser or through the desktop\/mobile client.","If you can’t find a subreddit on your topic of interest, you can often find out who the moderator is for a server by searching for the name of the server\/channel + Discord + Mod. Once you’ve found the right person, you can message the moderator of the server directly to get an invite link.","When joining a Discord server, or multiple servers, you may find yourself overwhelmed with notifications rather quickly. Bot accounts often greet newcomers – these are AI chatbots that perform certain commands or tasks such as issuing a greeting when a new member joins via a channel or direct message – and can be a nuisance when getting started.","One good option for beginners is to go into the server settings and turn off private messages. If you want to engage in a private conversation, you will have to take the initiative to reach out first, but it will prevent spammers and potential scammers from talking to you.","To turn off this option, take the following steps:","You will still receive regular server notifications if you are tagged in a message or if there are important announcements, giveaways, etc.","While turning off DMs can reduce the number of notifications on Discord, it serves another purpose. Just like a traditional chat room, every Discord server can contain members with nefarious goals. More specifically, they may target server newcomers with a message or clickable link that will put you in harm's way.","Never trust links sent by strangers on the internet, just as you wouldn't accept candy from a random person in the street.","The same principle applies even if you start to trust a stranger on Discord. While some people may be genuine, others may try to obtain sensitive information from you or even steal your cryptocurrency. Instead, focus your conversations on:","You should never disclose your personal wealth on Discord – or any public forum for that matter. This includes telling someone which cryptocurrencies you own or how much you own. It can put a target on your back and encourage scammers to focus their attention on you.","A growing Discord trend is restricting server access depending on ownership of certain tokens, NFTs or other specific qualifications.","If we take the non-fungible token industry as an example, users are free to join the Discord channel of any NFT project out there. However, they may not be able to see all of the accessible channels unless they can verifiably prove they own at least one from the collection.","Channel access can be tied to Discord user roles, with NFT holders receiving special roles, and thus access to channels hidden from regular users.","For example, NFT holders may have unique roles that grant access to :","Discord is also a crucial platform to foster discussion among members of Decentralized Autonomous Organizations (DAO). One example is the FWB (Friends With Benefits) Discord, which is used to host events, publish newsletters and facilitate group chatting. However, one can only join the chat room if you own 75 FWB tokens or more, making it an “exclusive” club. The members of this and other DAOs use these channels to discuss matters regarding the governance, mission and other matters of importance to the community."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bitcoin Discord","content":"ORGANIZATION"},{"type":"Avoid Common Bitcoin Scams","content":"ORGANIZATION"},{"type":"FWB","content":"ORGANIZATION"},{"type":"AOL","content":"ORGANIZATION"},{"type":"Discord","content":"LOCATION"},{"type":"MSN","content":"ORGANIZATION"}],"hashtag":["Technology","Beginner"],"authors":["Andrey Sergeenkov"]}