{"summary":"The asset manager has been helping educate pension funds, endowments and sovereign wealth funds about the new spot bitcoin ETF products, BlackRock’s head of digital assets said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/02\/blackrock-sees-sovereign-wealth-funds-pensions-coming-to-bitcoin-etfs\/","publishDate":"2024-05-02T11:02:21","id":15648,"type":null,"title":"BlackRock Sees Sovereign Wealth Funds, Pensions Coming to Bitcoin ETFs","category":["Finance"],"content":["Don't be fooled by the first break in inflows into spot bitcoin exchange-traded funds (ETFs) after 71 straight days. The current lull is likely to be followed by a new wave from a different type of investor, said Robert Mitchnick, head of digital assets for BlackRock, the world's largest asset-management company.","The coming months could see financial institutions such as sovereign wealth funds, pension funds and endowments start to trade in the spot ETFs, Mitchnick said in an interview. The firm is seeing “a re-initiation of the discussion around bitcoin,” which turns on the topic of allocating to bitcoin (BTC) and how to think about it from a portfolio construction perspective.","Read More: BlackRock's Bitcoin ETF Posts First Day of Outflows, Leading Record $563M Exit From U.S. Spot Products","“Many of these interested firms – whether we're talking about pensions, endowments, sovereign wealth funds, insurers, other asset managers, family offices – are having ongoing diligence and research conversations, and we're playing a role from an education perspective,” Mitchnick said. And the interest is not new: BlackRock has been talking about bitcoin to these sorts of institutions for several years, he said.","Pent-up demand for the much-anticipated ETFs has seen more than $76 billion accumulated across these products since their approval in January. So far, some registered investment advisors (RIAs), a decent-sized subset of wealth advisory, are already offering BlackRock’s IBIT ETF, but only on an unsolicited basis. The next step is expected to be the unrestricted offering of bitcoin ETFs to clients of large wealth advisory players like Morgan Stanley.","A lot of social media focus has been on the ETF assets under management (AUM) horse race, and in particular the comparison between IBIT and Grayscale’s GBTC, which can be considered an incumbent because the existing BTC trust uplisted to an ETF. At last count IBIT stood at $17.2 billion and GBTC at about $24.3 billion.","A chunk of the current IBIT assets comes from Grayscale substitutions. Other sources could be outflows from higher priced international products in Canada or Europe, and some of it comes from bitcoin futures ETFs being recycled into spot products.","There are also existing bitcoin holders who would rather own the cryptocurrency in a brokerage account and not have to worry about custody, tax reporting complexities and other challenges associated with holding bitcoin on an exchange, Mitchnick said. And while becoming the biggest spot bitcoin ETF would be an impressive milestone, BlackRock isn’t really focused on that competition, but rather on educating its clients, he said.","BlackRock filed for an ether (ETH) ETF back in November of last year, followed by CEO Larry Fink talking up the potential of tokenization, the representation of traditional assets on blockchains.","But an ether ETF raises the question of how BlackRock would go about educating clients, given the complexity of the Ethereum blockchain ecosystem. Moreover, why would investors want exposure to another crypto ETF if the Sharpe ratios of their portfolios had already been boosted by a spot bitcoin ETF? The ratio measures the return from an investment adjusted for its risk.","“When we think about this space, we see the potential for digital assets to benefit our clients and capital markets, with a focus in three areas: cryptoassets, stablecoins and tokenization,” Mitchnick said. “And these pillars, they're all interrelated. That's a really important thing for people to understand. And the work that we do across each informs our strategy and our insights for the others.”","UPDATE (May 2, 12:45 UTC): Changes \"will probably see\" to \"could see\" in second paragraph.","Edited by Sheldon Reback."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"May 2","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sharpe","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$24.3 billion","content":"MONEY"},{"type":"Larry Fink","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$17.2 billion","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Grayscale’s GBTC","content":"ORGANIZATION"},{"type":"Robert Mitchnick","content":"PERSON"},{"type":"Mitchnick","content":"PERSON"},{"type":"$563M","content":"MONEY"},{"type":"$76 billion","content":"MONEY"},{"type":"Morgan Stanley","content":"ORGANIZATION"}],"hashtag":["BlackRock","Bitcoin ETF","ether ETF","investment","Pension Funds"],"authors":["Ian Allison"]}