{"summary":"In this week's issue of The Protocol newsletter, we're covering Worldcoin's latest update, airdrop season, the new Bitcoin wallet from Jack Dorsey's company and the \"data availability\" network Celestia's market-moving plan to plug into Polygon's blockchain development kit.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/12\/13\/the-protocol-crypto-spring-is-airdrop-season-with-tokens-from-starknet-layerzero\/","publishDate":"2023-12-13T19:39:44","id":15640,"type":null,"title":"The Protocol: Crypto Spring Is Airdrop Season With Tokens From Starknet, LayerZero","category":["Technology"],"content":["Sam Altman, the OpenAI executive who was out, then back in, is known in crypto circles for his other major project: Worldcoin, with its Black Mirror-esque iris-scanning orb. The project just released a major update, detailed in this week's feature by CoinDesk's Sam Kessler; he also managed to extract from the project's tech guru, Tiago Sada, a few nuggets on the project's pipeline of potential corporate users.","We're also covering a spate of token airdrops (free money!), the new Bitcoin wallet from Jack Dorsey's Block and Celestia's market-moving plan to plug into Polygon's blockchain development kit.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","AIRDROP ROUNDUP: It might be the rally in crypto markets, or maybe just long-simmering efforts coming to fruition, but suddenly there's a flurry of blockchain projects confirming plans for new token releases – fueling even further enthusiasm among digital-asset traders over the prospect for the free-money giveaways known as \"airdrops.\" The list includes blue-chip names like the Ethereum layer-2 project Starknet, whose foundation disclosed plans to allocate 1.8 billion STRK tokens \"soon.\" LayerZero, the interoperability protocol, which makes it easier for different blockchains to connect, said last week they planned to issue a token sometime in the first half of 2024. The Solana-based crypto staking project Jito released its JTO token, and according to CoinDesk's Danny Nelson, even small-time users were getting thousands of dollars worth. Kamino Finance, a decentralized-finance or DeFi protocol on Solana, is planning to launch a \"points program,\" which could set the stage for a future token airdrop. Seamless Protocol, a lending and borrowing protocol built atop Coinbase's layer-2 blockchain, Base, issued SEAM governance tokens, airdropped to users. As the Bankless newsletter put it, \"airdrop season is underway.\"","ALSO:","Bitkey includes a mobile app, hardware device, and a set of recovery tools, according to the company. (Block\/Business Wire)","Highlighting blockchain tech upgrades and developments.","1. Celestia, a so-called data availability (DA) solution designed to provide a cheaper alternative for verifying data generated from blockchain transactions, announced Tuesday that it will become an option for blockchain builders using Polygon's software tools to spin up new layer-2 networks atop Ethereum. The announcement generated ample chatter on the social-media site X, as well as speculation in digital-asset markets, over the prospects for \"modular\" blockchain setups.","2. Nil Foundation announced the features of its new Type-1 zkEVM powered by zkLLVM, \"making it the first zkEVM with core components built automatically, preventing insecurities that result from manual circuit definition,\" according to the team: \"Nil’s zkEVM is designed to have security as a fundamental feature enabled by its proprietary zkLLVM compiler. The zkLLVM quickly and automatically compiles high-level code (C++ or Rust) into efficient zk-SNARK circuits.\"","3. Beam, an open-source blockchain specialized for gaming and run by Merit Circle DAO, will now launch on Immutable zkEVM, a groundbreaking scaling solution powered by Polygon, according to the team: \"Beam is an ecosystem and a blockchain. We want to remain chain-agnostic. Where we started as a subnet on Avalanche, we don’t want to limit ourselves to the Avalanche ecosystem.","4. Decentralized exchange Uniswap, the fifth-biggest DeFi protocol, has expanded to the Bitcoin sidechain Rootstock, in a boost to the world's largest blockchain's decentralized finance (DeFi) landscape. Uniswap version 3 (v3) has been deployed on Rootstock by GFX Labs, the team behind trading terminal Oku, according to an emailed announcement shared with CoinDesk on Monday. Uniswap, originally designed for Ethereum, has also been deployed on the Ethereum layer-2 networks Arbitrum, Optimism and Polygon.","5. FIRST ON COINDESK: Blocknative, a blockchain infrastructure company that cut staff in October after suspending work on a major business project, released a new tool to examine the \"mempool\" of pending transactions awaiting processing on Ethereum, an effort that could ultimately help to reduce instances of block-level manipulation and protect users from front-running bots.","See the entire Protocol Village list from this past week here.","Funraisings","Deals and grants","Data and tokens","Regulatory and Policy","Loyal readers of The Protocol will recall our riff in last week's issue, headlined \"Bitcoin Censorship, or Just 'Spam Filtering?'\" The gist of the story is that some Bitcoin purists are trying to keep the oldest and largest blockchain free from non-financial transactions – such as the text snippets and images that some people are \"inscribing\" onto the blockchain via the Ordinals protocol, launched late last year. The drama ratched up recently when Ocean, a new bitcoin mining pool backed by Jack Dorsey and co-led by a longtime Bitcoin developer, the pseudonymous (and feisty) Luke Dashjr, set up software that would \"filter\" out the Ordinals inscriptions. A lot of users of the blockchain, however, say a few people shouldn't be deciding how the Bitcoin blockchain gets used; let the market decide, the thinking goes. That really amounts to a bet that Bitcoin miners, who ultimately decide which transactions to include in new data blocks and which ones to leave out, will choose to maximize self-interest, er, profits. And that makes them more likely to keep including these Bitcoin \"inscriptions\" because, you know, why leave money on the table? The chart below, courtesy of Dune Analytics, shows just how much in fees have been generated to date by inscriptions-related transactions on the Bitcoin blockchain – $147.7 million.","Fees (in dollars) paid to Bitcoin miners for Ordinals inscriptions. The green vertical lines (legend on left) show fees paid on a daily basis, while the black line (legend on right) shows cumulative fees since December 2022. (Dune Analytics)","Edited by Bradley Keoun."],"entity":[{"type":"$147.7 million","content":"MONEY"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Ocean","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Danny Nelson","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"Sam Kessler","content":"PERSON"},{"type":"Nil Foundation","content":"ORGANIZATION"},{"type":"Merit Circle DAO","content":"ORGANIZATION"},{"type":"the first half of 2024","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Dune Analytics)","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Block\/Business Wire)","content":"ORGANIZATION"},{"type":"GFX Labs","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Kamino Finance","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["The Protocol","Newsletter","Ethereum","Protocols","worldcoin","Airdrops","airdrop","data availability","bitcoin wallet"],"authors":["Bradley Keoun"]}