{"summary":"The company recommends its customers limit their crypto exposure to no more than 5% of their investable assets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/10\/12\/robo-adviser-betterment-launches-cryptocurrency-offering\/","publishDate":"2022-10-12T12:37:53","id":15645,"type":null,"title":"Robo-Adviser Betterment Launches Cryptocurrency Offering","category":["Finance"],"content":["The largest independent robo-adviser, Betterment, is letting its clients invest in a handful of crypto portfolios for the first time but with a caveat: Best not to go above 5% exposure.","Robo-advisers are digital platforms that provide automated, algorithm-driven financial planning services with little to no human supervision. A typical robo-adviser asks questions about your financial situation and future goals through an online survey; it then uses the data to offer advice and automatically invest for you, according to the website Investopedia.","Over 730,000 retail customers can now invest in four curated portfolios of crypto assets covering everything from broad market themes to decentralized finance (DeFi) tokens, with metaverse plays and sustainability in between. They’re constructed for ease of access, Jesse Proudman, vice-president of crypto investing at Betterment, told CoinDesk.","“The objective with this crypto product is to really simplify the entire investing experience here, particularly into a diversified portfolio versus requiring clients to sort of pick individual coins or assets to go buy on their own,” Proudman said.","Last month, Betterment partnered with crypto exchange Gemini to launch crypto investing portfolio service for its customers. The latest Betterment crypto product is constructed from digital assets listed on Gemini, with Gemini as the custodian.","The company also guides its customers to limit their crypto exposure to not more than 5% of their investable assets.","“Investing team did a bunch of analysis on sort of portfolio design, and ultimately sort of settled on that 5% target as sort of an optimal risk-reward allocation,” Proudman added."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"Proudman","content":"PERSON"},{"type":"Gemini","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"Jesse Proudman","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":["Betterment","Robo-advisor","crypto investing"],"authors":["Xinyi Luo"]}