{"summary":"It would not be a surprise if the fragmentation of layer 2 rollups led to the downfall of the network's application dominance, =nil; Foundation Chief Product Officer Avi Zurlo argues.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/11\/where-did-we-go-wrong-with-ethereum-scaling\/","publishDate":"2024-03-11T21:32:28","id":15659,"type":null,"title":"Where Did We Go Wrong With Ethereum Scaling?","category":["Consensus Magazine"],"content":["Coming off the heels of ETH Denver, the rollup ecosystem is buzzing over the several new and exciting ideas discussed in the Mile High City to address the growing state fragmentation issue in the rollup space.","Avi Zurlo is the chief product officer of =nil; Foundation.","At the event, leaders, builders and visionaries revisited Ethereum’s rollup-centric roadmap from 2020; where we’ve come as an industry since then; and how the new roadmap has led to an explosive growth for the L2 ecosystem. Indeed, the total value locked in layer 2s is up by over 230% in the past year alone.","With this growth came the natural next step in evolution: modular scaling designs. While modular blockchains (i.e. networks that specialize in performing specific functions) are serving near-term demand for cheaper transactions and providing entirely new application designs, thought leaders in Denver unanimously agreed that there are still outstanding challenges presented by modular scaling. These issues are particularly apparent when new rollups are introduced to the Ethereum ecosystem, which compound the problems of splitting up functionality.","Addressing the current technical issues of Ethereum’s rollup architecture, Ethereum Foundation developer Justin Drake said it best: We have a fragmentation problem.","In a perfect world, Ethereum scaling solutions would maintain Universal Synchronous composability enabling a seamless exchange and real-time settlement of transactions on the network. In reality, however, each rollup exists within a siloed environment that has neither notion of other rollups state nor Ethereum.","See also: Ethereum's Vitalik Buterin Writes on 'Enshrinement' of L2 Functions on Mainnet","This state fragmentation fundamentally compromises the principle network effects of the Ethereum ecosystem, introduces compounding complexity (and risk) of interoperability protocols and results in an objectively worsened developer and user experience. Making matters worse, price-sensitive applications are forced to run app-specific infrastructure to avoid congestion fees on general-purpose rollups, exacerbating the state fragmentation problem further.","So how did we get here?","Compromising on the principle network effects of global state (i.e. the idea that Ethereum is the \"world computer\") is perhaps one of the more obvious reasons why modular blockchains fail to deliver on their promise of being the holy grail of scaling solutions.","First, the lack of unified liquidity across the L2 ecosystem creates a barrier to entry for users looking to tap into a singular network whether it be for trading, swapping or staking needs.","Another barrier to entry for app founders and developers is the user distribution across all chains. This means app founders and developers are required to ask themselves whether a specific chain has the appropriate kind of users their particular app needs. For instance, what if a Web3 app founder wants to deploy on chain X for its low transaction fees and reputable “scalability,” but the network has, over time, catered to a DeFi user base?","Prior to L2 inception, app founders could simply deploy on the Ethereum mainnet without needing to question the user base since users lived universally in one, singular blockchain world. Now, however, modular blockchains have introduced over time a world of unlimited architecture possibilities leading to chains becoming tailored to niche vertical interests within a single, independent state or app-specific chain.","This calls into question, are the customizations of an app-specific chain worth it?","Bridge hacks account for more than $2.8 billion funds lost within the larger crypto industry. Today, users have grown desensitized to bridge hacks. Unfortunately, the number of hacks will only rise as we continue to ignore and fail to come to consensus for a solution on the current state of L2 state fragmentation.","See also: What Are Rollups? ZK Rollups and Optimistic Rollups Explained","It’s important to note that interoperability has always been extremely difficult to solve and there is no “one-size fits all” silver bullet solution, but at the rate in which the L2 ecosystem is growing and the plethora of app-specific blockchains arising, the interoperability and state fragmentation issue will only escalate and become even more complex.","Building on my above point, interoperability complexity only creates additional frustration and fragmentation for the developer building on any given network. Developers shouldn’t have to worry about whether their deployed application will successfully scale, maintain low transaction costs and ultimately meet the needs of their users.","See also: Understanding the Economics of Ethereum Layer 2s","Simply put, developer mindshare should be focused solely on building an application set to move the needle in onboarding the next billion users into Web3. Right now, however, developers are working around convoluted network abstractions to offer a seamless user experience which ultimately serves as a distraction and unnecessary workload for the developer.","Similarly, users are forced to manage the complexity of interaction cross-chain, including asset bridging, wallet network management and juggling endless amounts of gas tokens just to adapt to this fragmented state. Builders need to focus on introducing scaling solutions for not just the crypto power-users, but also the crypto-curious newcomers who will immediately feel intimidated by the endless steps needed to communicate cross-chain and turn their head on the Ethereum ecosystem all together.","The onus is on the L2s themselves who have failed to mitigate congestion fees and have left price-sensitive applications with no choice but to migrate to app-specific infrastructure. As the next cycle approaches, a vicious snowball effect is set to take place; as L2 congestion fees increase, more developers are forced to opt for app-specific infrastructure, exacerbating the (already) pervasive problems associated with state fragmentation.","In a few years, it would not be a surprise if the inability of L2s to solve for state fragmentation led to the downfall of the Ethereum ecosystem's application dominance.","To all my rollup friends, comrades and peers building in the Ethereum ecosystem:","We need to do better.","Edited by Daniel Kuhn."],"entity":[{"type":"Avi Zurlo","content":"PERSON"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"=nil; Foundation","content":"ORGANIZATION"},{"type":"Denver","content":"LOCATION"},{"type":"Mile High City","content":"LOCATION"},{"type":"the Economics of Ethereum Layer","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"230%","content":"PERCENT"},{"type":"Optimistic Rollups Explained","content":"ORGANIZATION"},{"type":"$2.8 billion","content":"MONEY"},{"type":"Justin Drake","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Layer 2s","Ethereum","Scaling","Rollups"],"authors":["Avi Zurlo"]}