{"summary":"The rule was first proposed by a U.S. money-laundering watchdog FinCEN in late 2020.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/01\/29\/the-unhosted-crypto-wallet-rule-is-back\/","publishDate":"2022-01-29T23:13:29","id":15655,"type":null,"title":"The Unhosted Crypto Wallet Rule Is Back","category":["Policy"],"content":["A controversial proposed rule that would enforce know-your-customer rules on unhosted or self-hosted crypto wallets may again be under consideration by the U.S. federal government.","The rule was first proposed at the end of 2020 by the Financial Crimes Enforcement Network (FinCEN), the U.S. money laundering watchdog. If enacted, crypto exchanges would be required to collect names and home addresses, among other personal details, from anyone hoping to transfer cryptocurrencies to their own private wallets.","Industry advocates said they were concerned the rules might be impossible for certain wallets to comply with because they are not controlled by people and therefore are not tied to this personal information. Others were also concerned the compliance requirement might be overly burdensome for individuals.","The rule was driven by then-Treasury Secretary Steven Mnuchin rather than FinCEN itself. The original proposal was published on the Treasury Department's website, not FinCEN's. The watchdog only posted the proposed rule when the comment period was extended.","The Treasury Department, which is now overseen by Secretary Janet Yellen, revealed the rule might be considered in this semiannual agenda of regulations, set to be formally published in the Federal Register on Jan. 31. The agenda outlines priorities for the Treasury Department, but it does not indicate that the rules will actually be implemented, or that they will be implemented as-is. Rather, the agenda is a tool that signals things Treasury will work on over the next six months.","\"FinCEN is proposing to amend the regulations implementing the Bank Secrecy Act (BSA) to require banks and money service businesses (MSB) to submit reports, keep records and verify the identity of customers in relation to transactions involving convertible virtual currency (CVC) or digital assets with legal tender status ('legal tender digital assets' or 'LTDA') held in unhosted wallets, or held in wallets hosted in a jurisdiction identified by FinCEN,\" the document said.","A timetable in the section suggests FinCEN aims to finalize the rule by the end of August, if it chooses to finalize it.","Read more: The Mnuchin Files: New Documents Shed Light on Trump-Era Crypto Policy","The proposed rule originally had an unusually short 15-day comment period, further stirring controversy among industry advocates. Typically comment periods are between 30 and 90 days, though some rules may have 120-day comment periods.","In public notices, FinCEN twice extended the comment period, first for another 15 days and later for a further 60 days.","In that first extension, FinCEN treated the rule's provisions as two separate issues. One of these provisions sought to impose currency transaction report (CTR) rules on crypto transactions to unhosted wallets. Financial institutions currently file CTRs for customers who transact with over $10,000 in a single day.","The personal data rule, referred to as the \"counterparty data collection rule,\" would apply to customers transferring over $3,000 in crypto per day to private wallets.","It is this second rule that led to industry backlash, including several thousand comments filed as a response. FinCEN may need to issue a new comment period to address these responses before implementing the counterparty data collection rule.","A FinCEN spokesperson did not immediately return a request for comment on whether the agency is considering the overall rule or the provisions individually. However, a link on the Federal Register page leads to the original proposed rule from Dec. 23, 2020.","The Federal Reserve and FinCEN also plan to \"clarify the meaning of 'money'\" under the Bank Secrecy Act as it pertains to digital assets, ensuring that digital asset transactions are subject to the same BSA rules their fiat counterparts might be.","\"The Agencies intend that the revised proposal will ensure that the rules apply to domestic and cross-border transactions involving convertible virtual currency, which is a medium of exchange (such as cryptocurrency) that either has an equivalent value as currency, or acts as a substitute for currency, but lacks legal tender status,\" the document said.","Further, the BSA rules will also apply to any digital asset transactions that \"have legal tender status,\" the document said.","UPDATE: (Jan. 29, 2022, 23:55 UTC): Updated to note former Treasury Secretary Mnuchin's role in sponsoring this rule."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Dec. 23, 2020","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Mnuchin","content":"PERSON"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Jan. 31","content":"DATE"},{"type":"BSA","content":"ORGANIZATION"},{"type":"CVC","content":"ORGANIZATION"},{"type":"LTDA","content":"ORGANIZATION"},{"type":"Jan. 29, 2022","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"MSB","content":"ORGANIZATION"},{"type":"Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Trump","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Steven Mnuchin","content":"PERSON"},{"type":"Era Crypto Policy","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["Regulations","FinCEN","Unhosted Wallets","Treasury Department"],"authors":["Nikhilesh De"]}