{"summary":"The state’s securities regulator contends BlockFi is selling an “unregistered security” to its customers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/07\/21\/nj-regulators-give-blockfi-1-week-before-blocking-new-interest-accounts\/","publishDate":"2021-07-21T19:31:20","id":15653,"type":null,"title":"NJ Regulators Give BlockFi 1 Week Before Blocking New Interest Accounts","category":["Finance"],"content":["","New Jersey regulators are giving crypto lender BlockFi an extra week before its ban on the creation of new interest-bearing accounts will take effect, CEO Zac Prince tweeted Wednesday.","","","Prince said New Jersey’s Bureau of Securities (NJ BOS) “has postponed the effective date” of Tuesday’s surprise order to stop the sale of BlockFi interest accounts until July 29. Originally, the order was set to hit on July 22.","","","NJ BOS contends that BlockFi Interest Accounts amount to unregistered securities; BlockFi claims they are not.","","","The extra week buys BlockFi some time to navigate the ramifications of the regulator’s order. That said, it could be a body-blow to the crypto lender. NJ BOS has said BlockFi holds $14.7 billion in assets through its BIA product. (How much of that is held by New Jersey consumers is unclear.)","","","BlockFi’s Prince has repeatedly said the cease-and-desist will not impact existing BlockFi customers, a claim the NJ BOS order appears to echo.","","","Less clear, however, is the extent to which this could impact new BlockFi customers, and whether its impact could spread beyond New Jersey.","","","BlockFi declined to comment further. NJ BOS did not immediately comment.",""],"entity":[{"type":"July 22","content":"DATE"},{"type":"NJ BOS","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$14.7 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"July 29","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"New Jersey’s Bureau of Securities (NJ BOS","content":"ORGANIZATION"},{"type":"BIA","content":"ORGANIZATION"}],"hashtag":["New Jersey","Regulations","BlockFi","Crypto Lending"],"authors":["Danny Nelson"]}