{"summary":"Bitcoin offers pseudonymity to users by design. But in order to be completely anonymous, you’ll need to use tools like bitcoin mixers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/bitcoin-mixers-how-do-they-work-and-why-are-they-used\/","publishDate":"2022-03-08T15:36:02","id":15657,"type":null,"title":"Bitcoin Mixers: How Do They Work and Why Are They Used?","category":["Learn"],"content":["The Bitcoin blockchain is entirely public. Head to a blockchain explorer and you can find a watertight record of all the bitcoin transactions ever processed since the cryptocurrency's launch in early 2009.","For some, that is a core feature, not a problem. But for those who need a little more anonymity, the public nature of the Bitcoin blockchain is a huge privacy flaw.","There are ways of keeping bitcoin transactions entirely private – to obscure who sends what to whom. One of the most popular methods is to use a bitcoin mixer, also known as a tumbler. These are tools that jumble up an amount of bitcoin in private pools before spitting them out to their intended recipients.","The idea is that, by shuffling bitcoin through a black box, it’s difficult to work out that person A sent 10 bitcoins to person B. All a public explorer will show is that person A sent some bitcoin to a mixer, as did a dozen other people, and that person B received some bitcoin from a mixer, as did a dozen other people.","There are two main types of bitcoin mixers:","Centralized mixers are companies that will accept your bitcoin and send back different bitcoins for a fee. While they offer an easy solution for tumbling bitcoin, they also still present a privacy challenge, as while the links between “incoming” and “outgoing” bitcoin will not be public, the mixer itself will still have a record that connects the transactions. Meaning that in the future the company could give up those records and reveal a users' connection to the coins.","Decentralized mixers employ protocols such as CoinJoin to fully obscure transactions via either a coordinated or peer-to-peer method. Basically, the protocol allows a large group of users to join together an amount of bitcoin (i.e. 100 people want to mix 1 bitcoin each) and then redistribute it so everyone gets 1 bitcoin back, but no one can tell who got what or where it came from.","Mixers are not without their flaws. It’s unlikely that someone else in the mixer sent the exact amount of bitcoin as you, minus the tumbler’s fee. If a law enforcement agency knows the address used by its first suspect, and if the second suspect is the only one to have received a little less of a specific amount, it’s not going to be too hard to reconnect the flow of money. This problem becomes harder to solve the more people use the mixer.","Some exchanges don’t allow mixed bitcoin to enter or leave exchanges. Since exchanges can identify mixers, they label mixed bitcoin ‘tainted.\" Binance, for instance, has blocked withdrawals to Wasabi, a privacy-preserving bitcoin wallet that integrates a popular mixing service called CoinJoin. Other popular bitcoin mixers include Samourai and JoinMarket.","It’s important to note that not all mixing services are legitimate, and some are far less effective at obscuring financial transactions than others. Be sure to do your research before using a mixer.","The ability to obfuscate bitcoin transactions makes mixers an obvious hotbed for money laundering, attracting the likes of tax dodgers and criminals interested in hiding the proceeds of illegal activity.","The question of whether using these services is illegal depends on which jurisdiction you are based in. In February 2021, then-U.S. Deputy Assistant Attorney General Brian Benczkowski said that using mixers to hide crypto transactions “is a crime.”","Two months later, U.S. authorities arrested Roman Sterlingov, aka the Russian-Swedish founder of bitcoin tumbling service “Bitcoin Fog,” for helping people launder $335 million. In August 2021, Larry Harmon, the owner of a bitcoin mixer called Helix, pleaded guilty to helping darknet market criminals launder around $300 million.","New anti-money laundering rules, like the Financial Action Task Force’s “travel rule” and the European Union’s AMLD-5 directive, will make laundering money tougher, and could make bitcoin tumblers less viable for people who want to join in the wider crypto economy – the sort that relies on popular exchanges accepting your coins.","Read More: What are privacy coins and are they legal?","A bitcoin mixer isn’t the only way to hide the flow of bitcoin transactions.","After hacks, criminals often siphon funds through lots of exchanges using accounts created with cheaply bought or stolen identities. This method, known as chain-hopping, relies on the fact it takes law enforcement a long time to force exchanges to shut down accounts; plus, it’s tricky for exchanges to spot dodgy accounts in the first place if they have already passed through know-your-customer (KYC) procedures.","Privacy advocates maintain that methods like privacy coins are a powerful way to prevent the government from snooping on your financial transactions, asserting they are not just for criminals. To obscure the flow of funds, Monero uses one-time use \"stealth\" addresses and mixes genuine transaction signatures with decoys. While one of the first major dark web marketplaces, the Silk Road, had a bitcoin tumbler baked into its infrastructure, former darknet market White House Market, known for its security, only accepted Monero.","Alternatively, Zcash offers optional private transactions that rely on zero-knowledge proofs, which don’t share transaction information. Dash’s options of private transactions function a little like CoinJoin."],"entity":[{"type":"Brian Benczkowski","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$335 million","content":"MONEY"},{"type":"August 2021","content":"DATE"},{"type":"Samourai","content":"PERSON"},{"type":"White House Market","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"Monero","content":"PERSON"},{"type":"Wasabi","content":"LOCATION"},{"type":"February 2021","content":"DATE"},{"type":"Roman Sterlingov","content":"PERSON"},{"type":"Larry Harmon","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Financial Action Task Force","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Expert","Explainer","Bitcoin Mixers","Dash","Zcash","CoinJoin","Samourai Wallet","Anti-Money Laundering","KYC"],"authors":["Robert Stevens"]}