{"summary":"The securities regulator, Treasury Department and U.S. derivatives watchdog are all hoping to get more funding to deal with new duties policing the digital assets sector.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/22\/us-sec-asking-for-more-millions-dozens-of-lawyers-to-beef-up-crypto-oversight\/","publishDate":"2024-03-22T14:41:43","id":15651,"type":null,"title":"U.S. SEC Asking for More Millions, Dozens of Lawyers to Beef Up Crypto Oversight","category":["Policy"],"content":["Gary Gensler wants 33 more people in the enforcement division of the U.S. Securities and Exchange Commission (SEC) to deal with \"new and emerging issues,\" according to the regulator's annual budget pitch. Much of that office's recent, emerging workload has come from the agency's pursuit of cryptocurrency businesses, such as Coinbase Inc., Kraken and Binance.","A number of U.S. financial regulators noted the rise of crypto as a justification for their latest budget requests – an annual exercise that tends to say more about agencies' priorities than the actual funding they necessarily end up with. The SEC, for instance, has to justify its programs to Congress – including to highly critical Republican lawmakers – in the appropriations process.","Spending plans at the Department of the Treasury and the Commodity Futures Trading Commission also highlight the extent to which they think cryptocurrencies need better monitoring, with both entities asking for more resources to address the digital asset market and other areas.","Gensler's executive summary of the budget request opened with a dig noting the difficulty of policing the digital assets sector.","\"We’ve seen the Wild West of the crypto markets, rife with noncompliance, where investors have put hard-earned assets at risk in a highly speculative asset class,\" he wrote.","The SEC, which has often been accused of regulating the crypto sector through legal actions, had already ramped up its headcount for enforcement lawyers to dig into digital assets, and an influx of cash would allow that trend to continue. The agency is also asking for another 23 people in its examinations division, in part to address \"evolving risks\" that include crypto activity, according to the $2.6 billion overall spending plan.","Read More: Coinbase Accuses U.S. SEC of Breaking the Law in Rejecting Crypto Rulemaking","And the securities watchdog -- concerned about what decentralized finance (DeFi) might bring to the financial sector -- also wants to add a data scientist in its innovation hub.","\"New products and services, such as decentralized finance in the blockchain space and computer-assisted financial activities in the AI space, are being introduced on a compressed timeframe and have an immediate impact on the financial industry.\"","The CFTC mainly mentioned digital assets in the context of its enforcement division, noting it brought nearly 50 cases against crypto companies over the past year and highlighting its recent settlement with Binance, the world's largest crypto exchange as an example of a successful action.","\"The CFTC has risen to the challenges brought by the burgeoning digital asset market by ensuring that the markets and market participants acting within its jurisdiction comply with their statutory and regulatory requirements,\" the request said. \"The CFTC also uses its anti-fraud, false reporting, and anti-manipulation enforcement authority over commodity cash markets in interstate commerce to investigate and address misconduct in the digital asset space.\"","However, the CFTC request also noted that more companies are seeking derivatives clearing organization licenses for crypto products, which is bringing a fresh set of risks. The agency wants additional resources to better monitor and address these risks.","In the coming year, the CFTC intends to take on a rulemaking effort to include cryptocurrencies in data reporting efforts for futures and options markets.","And yet another section hints at the CFTC's repeated requests for Congress to grant it more spot market oversight, noting an office that provides \"technical advice to Congress with respect to draft legislation, including with respect to digital assets.\"","The CFTC also wants to hire an external ad agency to create public service announcements warning the general public about various frauds – including crypto frauds.","The Treasury Department's 2025 budget request details various actions it's taken in the cryptocurrency sector over the past year, requesting an overall $17 billion, with $12.3 billion going toward the Internal Revenue Service, $2 billion for various other Treasury Department offices and around $2.5 billion for international programs.","Various divisions within the broader Treasury Department structure are requesting budget increases to better engage with the cryptocurrency sector, including the Financial Stability Oversight Council, Office of Financial Research, Office of Terrorism and Financial Intelligence, Office of Foreign Assets Control and Financial Crimes Enforcement Network. The 2025 budget did not include many line items specific to the cryptocurrency sector, instead mentioning digital assets within its broader office subsections.","For example, Treasury's Office of Financial Research is looking to hire five new employees, three of whom would be tasked with researching and analyzing cryptocurrencies, among other issues like cybersecurity and hedge fund monitoring.","The terror financing wing, including OFAC and FinCEN, is looking to better monitor and understand the role crypto might be playing in illicit finance, the request said.","\"Over the past year, this work has focused on better understanding and combating digital asset gaps in the U.S. and global financial system, as well as ransomware financing, Russia illicit financing, and money laundering from fentanyl and synthetic opioids among other important issues,\" the section said, pointing to Treasury's recent decentralized finance (DeFi) report.","Another passage referenced Deputy Treasury Secretary Wally Adeyemo's recent letter detailing FinCEN's work analyzing to what extent cryptocurrencies might be used by the Hamas terror group.","Executive branch budget proposals are gathered into a single push from the White House for its spending priorities, with more detail about how exactly the agencies want to spend the funds they're requesting. Then Congress gets its turn, sometimes embracing some of the president's wishes, and sometimes ignoring them. But even when lawmakers put together a plan for final consideration, the process can get derailed by politics, as the U.S. has seen in the current federal budget effort, which has flirted repeatedly with failure and government shutdowns. Congress is currently evaluating a budget for 2024, after several false starts and continuing resolutions."],"entity":[{"type":"Coinbase Accuses U.S. SEC","content":"ORGANIZATION"},{"type":"Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$17 billion","content":"MONEY"},{"type":"$12.3 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase Inc.","content":"ORGANIZATION"},{"type":"Office of Terrorism and Financial Intelligence, Office of Foreign Assets Control and Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"Wally Adeyemo","content":"PERSON"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Rejecting Crypto Rulemaking","content":"ORGANIZATION"},{"type":"Office of Financial Research","content":"ORGANIZATION"},{"type":"Treasury's Office of Financial Research","content":"ORGANIZATION"},{"type":"$2.6 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Regulations","Securities and Exchange Commission","Treasury Department","Commodity Futures Trading Commission","Budget Proposal","U.S. Government","Enforcement"],"authors":["Jesse Hamilton","Nikhilesh De"]}