{"summary":"Consensus 2023 guests shared their concerns over 'decentralization theater' in DeFi projects, emphasizing the importance of genuine decentralization in the development of the Web3 ecosystem","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/08\/are-daos-doomed-to-decentralization-theater\/","publishDate":"2023-06-08T13:44:56","id":15660,"type":null,"title":"Are DAOs Doomed to ‘Decentralization Theater’?","category":["Consensus Magazine"],"content":["Decentralization theater is a term that emerged in the early days of decentralized finance (DeFi) that suggests a project is pretending to be more decentralized than it actually is. One example is a DeFi protocol establishing a non-profit foundation to hold its native tokens, write governance proposals and advise the project – often confusing users and regulators alike.","The term became relevant in April when the community behind the Ethereum layer 2 network Arbitrum accused the Arbitrum Foundation of fudging its very first governance vote with $1 billion worth of ARB tokens on the line. The foundation had already moved the tokens into its coffers, making an upcoming vote to “ratify” the move really just retroactive permission.","The vote was ultimately scrapped, and the foundation vowed to change its ways.","This article is excerpted from CoinDesk’s inaugural Consensus @ Consensus Report, the product of intimate, curated group discussions that took place at Consensus 2023. Click here to download the full report.","During a Consensus 2023 brainstorming session, it became clear that in situations where decentralization is bent in order to satisfy particular interests can compromise Web3’s ethos and objective.","Several speakers emphasized the importance of building truly decentralized protocols and projects, and what it means for the development of Web3 ecosystems down the line. This is all the more important as more centralized firms enter Web3.","See also: Web3 Represents a Strong Alternative to Today's Internet | Opinion","“What people can do is not just talk about this space, but actually participate in it,” Kyle Rojas, global business development and partnerships lead at Edge & Node, the company behind The Graph protocol, said. “In Web2, there's a client-server relationship where whoever owns the server owns the data, everything, and controls everything.”","The only way to disrupt that model is to actually use Web3 technology in building Web3 products…","Click here to download the full Consensus @ Consensus report.","Complete the form below to access the latest trends, analysis and insights gathered from the intimate group discussions that took place at Consensus 2023.","*Required information","By clicking \"Sign Up\", you agree to receive newsletter from CoinDesk as well as other partner offers and accept our terms of services and privacy policy."],"entity":[{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Kyle Rojas","content":"PERSON"},{"type":"Edge & Node","content":"ORGANIZATION"}],"hashtag":["Features","Consensus at C23","DAOs","DeFi","Consensus 2023","Consensus @ Consensus 2023 Report"],"authors":["Cam Thompson"]}