{"summary":"A bankruptcy judge rebuffed Three Arrows Capital’s request to lift a stay on its claim against BlockFi, setting a January mediation he hopes negates the need for a February hearing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/10\/10\/blockfi-bankruptcy-judge-says-he-wants-3acs-284m-claim-resolved-in-mediation\/","publishDate":"2023-10-10T19:23:24","id":15664,"type":null,"title":"BlockFi Bankruptcy Judge Says He Wants 3AC’s $284M Claim Resolved in Mediation","category":["Policy"],"content":["Failed crypto hedge fund Three Arrows Capital’s (3AC) attempt to pursue a $284 million claim against crypto lender BlockFi was put into mediation by the U.S. bankruptcy judge overseeing BlockFi’s case.","Chief Judge Michael Kaplan of the U.S. Bankruptcy Court in the District of New Jersey set up a mediation window for the two companies’ lawyers to work out a settlement in January, mostly over 3AC’s “preferential payments” to BlockFi.","If the sides can’t work out how much of the amount should be returned to the defunct hedge fund’s own liquidation, Kaplan scheduled a two-day hearing starting on Feb. 5 to allow for arguments over how much money should change hands.","“At issue here are large sums, by all means,” Kaplan said at a hearing Tuesday. “We’re talking about hundreds of millions of dollars.”","He expressed concern that the dispute is already pushing the calendar out further than he’d like for desperate creditors and that he is committed to getting it done quickly.","“This is the best I can do,” Kaplan said, saying 3AC’s motion to lift the stay will be postponed until the February hearing.","Preferential payments in a bankruptcy are transactions made just before the bankruptcy filing that potentially gave the recipient a better payout as a creditor than they may have received in court. In this case, 3AC lawyers said Tuesday that the company made as much as $270 million in such payments to BlockFi – more than was previously disclosed.","The dispute over the money is expected to turn upon an answer to a key legal question: When was 3AC actually insolvent, and how does that date relate to when the hedge fund’s payments were made?","Tensions were apparent between the sides in court, as a lawyer for BlockFi said 3AC has a “runaway” legal counsel who is dragging things out and piling up more than $16 million in legal bills. A lawyer for the hedge fund, Adam Goldberg from the firm Latham & Watkins, said those comments were “completely inappropriate and reckless.” He reminded the court that at 3AC “the founders fled and completely ignored any attempt to engage with them,” and those taking down the firm had to rebuild its records, find its assets and secure them for creditors.","Sandali Handagama contributed reporting.","Read More: Bankrupt Crypto Lender BlockFi Inches Closer to Refunding Clients","\n","Edited by Nick Baker."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"$284 million","content":"MONEY"},{"type":"Kaplan","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Michael Kaplan","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"Latham & Watkins","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Adam Goldberg","content":"PERSON"},{"type":"District of New Jersey","content":"LOCATION"},{"type":"$270 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"$16 million","content":"MONEY"},{"type":"Feb. 5","content":"DATE"}],"hashtag":["Regulations","Three Arrows Capital","3AC","Bankruptcy","litigation","BlockFi"],"authors":["Jesse Hamilton"]}