{"summary":"Regulators view Bitcoin and other proof-of-work cryptocurrencies as commodities. But mining firms can still trip over securities regulations if they’re not careful. This story is part of CoinDesk's Mining Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/07\/25\/how-bitcoin-miners-can-stay-clear-of-sec-scrutiny-and-fall-foul-of-it\/","publishDate":"2023-07-25T15:38:13","id":15663,"type":null,"title":"How Bitcoin Miners Can Stay Clear of SEC Scrutiny (and Fall Foul of It)","category":["Consensus Magazine"],"content":["You may be surprised to learn that the SEC’s ongoing efforts to rein in the crypto industry have been greeted warmly by at least some Bitcoiners. Because Bitcoin is firmly classed as a commodity rather than a security, those of a “Bitcoin maximalist” mindset have sometimes seen the crackdown as both a tactical and moral win. The laser-eyed set isn’t shy about sharing Gary Gensler’s skepticism of more centralized tokens like Solana, Cardano and even good old Ethereum.","This story is part of CoinDesk's 2023 Mining Week, sponsored by Foundry.","In broad strokes, Bitcoin and similarly structured proof-of-work tokens are commodities rather than securities because there is no central entity that collects capital in exchange for a promise of future returns. A proof-of-work chain like Bitcoin is purely a protocol, rather than a platform, product, or ecosystem – it’s a common enterprise, but you participate by following the rules, not by handing someone a sack of money behind the dumpster on Colesville Road.","So if you want to be in crypto but not at risk of catching an SEC stray, you probably want to hold Bitcoin. This has manifested as a fairly steady rise in “Bitcoin dominance,” or Bitcoin’s share of total crypto market value, over the course of the SEC’s 2023 legal adventures.","But that doesn’t mean bitcoin miners are completely free from SEC risk: in fact, it’s very easy to wrap commodity bitcoin in arrangements that are quite clearly securities contracts. In the wake of the recent split ruling in the SEC’s case against Ripple, this nuance may provide some timely insight into the relationship between a token in itself, and the agreements, transactions, and contracts surrounding it.","Recent crypto entrants may be surprised to learn that some of the earliest SEC actions on crypto, dating back at least as far as 2015, targeted Bitcoin miners – specifically, so-called “cloud miners.” The nominal goal of cloud miners was to offer colocation and management services to make mining easy, paralleling more general cloud providers like Amazon Web Services’ remote hosting.","Read more: Anthony Power - How Miners Are Preparing for the Next Bitcoin Halving","Unfortunately, many early cloud miners pursued flawed business models. Though they varied, a typical cloud mining contract would offer customers a particular amount of computing power (specifically, hashrate) for a set periodic cost. This appeared to amount to a security, since it implied a performance standard for the management of a pooled resource. But the model also invited fraud, which wound up being the more acute problem.","“The reputational shadow [of cloud mining] has been a stain on our entire industry,” says Kent Halliburton, President and COO of Sazmining, a hosted miner (for an explanation of the difference between hosted and cloud mining, see below). “Because so many people have gotten hurt and hosed. We said, if you’re selling hashrate, how are you not selling a security? We wanted to stay totally clear from it.”","The flaw of the cloud mining model, both from regulatory and trust standpoints, is that selling hashrate amounts to a guarantee of a specific output over time, reliant on the seller’s management expertise. There are also ample chances for deception and mismanagement: many cloud miners, maliciously or through incompetence, sold more hashrate than their machines could actually generate, and wound up effectively running ponzi schemes as they used new buyer funds to keep up.","Probably the most notorious cloud mining fraud was Josh Garza’s GAW mining, which was charged by the SEC in 2015. But cloud miners are still out there: an entity called Mining Capital Cloud Corp was hit with fraud charges in 2022.","This legacy doesn’t imply all remote mining services are inherently securities.","“I think the structuring matters a lot there,” says Matt Walsh, partner at the Bitcoin-centric VC firm Castle Island. “What are you getting exposure to? A passthrough, or a direct physical machine?”","Castle Island is an investor in River Financial, one of the firms offering what’s known as “hosted mining” or “mining as a service” as an improvement on the flawed cloud mining model. Instead of selling hashrate, these firms sell specific, individual machines and charge monthly service fees for remote management. Sazmining and Compass also offer hosted mining services.","Among other features, hosted mining firms let customers monitor their individual machines in real time, seemingly leaving less room for either overcommitment or deception. Halliburton also says Sazmining sends block rewards directly to owners’ wallets, seemingly eliminating custody risk. Though they provide output estimates, returns vary according to network conditions.","These contrasts transfer to some other aspects of crypto and securities law. The distinction between cloud mining and hosted mining, for instance, is roughly parallel to the distinction between different models for offering third-party staking services for proof-of-stake systems. In February, Kraken paid a small SEC fine and agreed to shutter its staking service, but Coinbase has instead pledged to fight classification of its staking service as a securities offering.","Read more: Jeff Wilser - Crypto Miners Are Pivoting to AI (Like Everyone Else)","The difference, at least according to some analysts, is that Kraken engaged in more intermediary management in pursuit of better returns for customers, making its staking service effectively a risk-bearing yield product. Coinbase instead acted as a more direct conduit to on-chain staking systems, rather than engaging in any active management or strategy on behalf of customers.","The most extreme illustrative example of how to turn boring Bitcoin mining into the regulatory equivalent of radioactive waste may be Celsius, the fraudulent crypto “bank.” While positioning itself as safe, Celsius was actually engaged in highly risky speculation on a chaotic mishmash of assets and ideas. One of those, it turns out, was a small mining operation in Texas that was sold off after Celsius’ bankruptcy.","While it was just one small part of Celsius’ business model (wildly reckless and utterly disorganized speculation), the mining operation was implicated in SEC claims that Celsius violated securities law. Leaving aside Celsius’ fraudulent nature, a depositor in a crypto fund that received returns driven by a mining operation they don’t manage is clearly handing over money in expectation of a return created by the efforts of a third party.","To paraphrase the seemingly immortal Howey Test, that’s how you turn an orange into a contract to produce an orange – and something innocuous into a fraught securities contract.","Edited by Ben Schiller."],"entity":[{"type":"2015","content":"DATE"},{"type":"Crypto Miners","content":"ORGANIZATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Sazmining","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Anthony Power","content":"PERSON"},{"type":"Kent Halliburton","content":"PERSON"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Compass","content":"ORGANIZATION"},{"type":"Bitcoiners","content":"ORGANIZATION"},{"type":"Colesville Road","content":"ORGANIZATION"},{"type":"Castle Island","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"Jeff Wilser","content":"PERSON"},{"type":"Halliburton","content":"ORGANIZATION"},{"type":"Matt Walsh","content":"PERSON"},{"type":"River Financial","content":"ORGANIZATION"},{"type":"Mining Capital Cloud Corp","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Josh Garza’s GAW","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Features","Mining Week 2023","Opinion"],"authors":["David Z. Morris"]}