{"summary":"This article examines the advantages of Ethereum as a protocol economy and how one could gain exposure to this breakthrough technology asset.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/21\/crypto-for-advisors-understanding-the-ethereum-economy\/","publishDate":"2024-03-21T15:45:00","id":15679,"type":null,"title":"Crypto for Advisors: Understanding The Ethereum Economy","category":["Finance"],"content":["Numerous other applications, known as layer-2 or L2 protocols, are being built in addition to Ethereum's functionality. Research analysts Christopher Jensen and David Alderman from Franklin Templeton Digital Assets discuss how Ethereum underlays the Platform economy.","In Ask an Expert, David Lawant from FalconX answers questions about staking and other applications built on Ethereum.","Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Most investors are familiar with the business model of the entrenched platform economy, in which a set of powerful tech companies rely on the network effects that they generate to obtain proprietary data, goods or content from users. These tech giants dictate terms favorable to their own businesses yet often limiting for users’ interests. One of the most exciting and perhaps underappreciated aspects of blockchain technology is that it has enabled a new business model – what we call the protocol economy. A blockchain, in its simplest form, is a secure digital ledger that, without the use or need of intermediaries, records new activity to its ledger in exchange for a fee while adhering to its protocol (rules for how the process works). Why does this matter? Blockchains enable digital property rights. Digital scarcity and ownership can now, for the first time, be enforced through software and code rather than organizations and people.","However, not all blockchains function the same way. The Bitcoin network is an application-specific blockchain. It essentially does one thing – records wallet addresses and BTC amounts – but does this very well. It’s secure, transparent and permissionless. Ethereum, on the other hand, is a general-purpose blockchain. Its programming language, along with the introduction of self-executing smart contracts, allows for more complex “if-then” activities. This innovation transforms blockchains from mere distributed ledgers into powerful, global virtual computers. These virtual machines enable developers to create comprehensive applications across various domains securely and autonomously, from marketplaces and financial tools to social networks and even other blockchains.","Ethereum's robust security layer and broader functionality paved the way for new digitally native economies to be built on top of its infrastructure layer. Tokens in such ecosystems are not just currencies but also integral to the network's incentive structure, encouraging coordination and integrity within the decentralized system. Holding Ethereum’s ether token (ETH) signifies more than transactional utility; it represents an ownership stake in Ethereum's network, offering both participatory and economic benefits aligned with the ecosystem's growth. Moreover, the fundamentals of Ethereum’s network can be analyzed in a similar fashion to non-digital companies, which may help inform what ETH is worth (similar to a stock, albeit with some different metrics and nuances).","The protocol economy of Ethereum currently has over 115 million token holders, which has grown at double-digit annual rates over the past four years. Monthly active users grew 25% year-over-year last month and now stands at 6.1 million. If users on Ethereum layer 2s (blockchains built on top of Ethereum to help scale the ecosystem) are included, that user base is over 10 million. Total value locked, the amount of capital stored in Ethereum’s DeFi smart contracts, rose to greater than $50 billion. However, this figure still massively understates the total economic value that the chain secures, which is estimated at $740 billion. And, while Ethereum’s developer count is down year over year, most of that attrition is due to new, part-time developers while the ecosystem’s established developer base continues to rise.","Ethereum’s financial state is likewise robust, with year-to-date total fees and gross profits both up triple digits year-over-year, and revenue for the last 12 months (LTM) revenues stands at $2.7 billion. Furthermore, the network has an ~85% gross margin and is profitable (25% net profit margin) even when accounting for the non-cash token incentives.","So how does one get exposure to this breakthrough technology asset and, just as importantly, the $740 billion value built on top of the chain? Assuming a protocol’s tokenomic design has a value accrual mechanism that allows the value of the network to be captured, then there’s a case to be made for holding the token. When any kind of economic activity happens anywhere in the Ethereum ecosystem, fees (revenues) are generated. Some of those fees fund the network’s security costs (COGS), while the remainder supports token value through strategic buy-and-burn mechanisms (akin to share repurchases). This approach highlights the advantages of protocol economies over traditional platform economies. Rather than buying stock in a company that built a platform that attracted a network, investors and users alike can now own a direct stake in their network’s success.","- Christopher Jensen, director of research, Franklin Templeton Digital Assets","Q. What types of applications are already available on platforms like Ethereum?","A: Ethereum's programming language is designed for high expressiveness, enabling the creation of various applications. While we are still in the nascent stages and innovative entrepreneurs are likely to build groundbreaking applications that we can’t imagine today, the potential impact of crypto on numerous major industries is already evident.","Take decentralized finance (DeFi) as an example; it offers a novel approach to developing and utilizing financial services with minimal dependence on central intermediaries. DeFi platforms can perform extensive services, including trading, lending, borrowing, and even rudimentary asset management functions. Moreover, the evolution of digital property rights has given rise to a vibrant non-fungible token (NFT) ecosystem over recent years. This ecosystem allows tokens representing ownership – from art pieces to concert tickets – to be more fluidly incorporated into our digital existence.","Other significant sectors gaining momentum include decentralized social networks, where users can exert greater influence than conventional models, and gaming, which can significantly expand its design possibilities by incorporating crypto elements. Additionally, artificial intelligence may soon necessitate the secure and verifiable logging of human-generated content within a transparent and immutable ledger, a function uniquely suited to blockchain technology.","Q. What is staking, and how does it work?","A: Staking is an integral process in networks like Ethereum, which rely on proof-of-stake (PoS) to support network operation. It involves participants locking up a certain amount of their cryptocurrency holdings to support the network's operations, including transaction validation and security. This contrasts with networks like Bitcoin, which operate under a proof-of-work (PoW) system and utilize energy-intensive computations to secure the network.","Ethereum switched from proof-of-work to proof-of-stake in September 2022 and, as a result, allowed ETH holders who want to contribute to the network security to derive a native yield in exchange for this extra work. This process is called staking.","The interest rate ETH holders can provide is called the staking rate, and it depends on various factors like the number of validators participating in staking and network transaction fees. Over the past six months, this rate has mostly hovered between 3% and 4%, according to the CESR, a standardized benchmark Ethereum staking rate.","- David Lawant, head of research, FalconX","JP Morgan analyst said that bitcoin has now overtaken gold in investor portfolio allocation when adjusted for volatility.","Fidelity amended their spot ETH ETF application to include provisions for staking the cryptocurrency.","The London Stock Exchange has announced plans to accept applications for bitcoin and ether crypto exchange-traded notes.","Edited by Bradley Keoun."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"David Alderman","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"David Lawant","content":"PERSON"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"$740 billion","content":"MONEY"},{"type":"Franklin Templeton Digital Assets","content":"ORGANIZATION"},{"type":"$50 billion","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$2.7 billion","content":"MONEY"},{"type":"London Stock Exchange","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Franklin Templeton Digital","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Christopher Jensen","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Financial Advisers","Ethereum","Protocols"],"authors":["Sarah Morton","Christopher Jensen"]}