{"summary":"Aglaé Ventures — backer of tech giants like Airbnb, Netflix and Slack — is set to launch a €100 million fund dedicated to investing in crypto startups.\nAglaé is backed by the investment vehicle of Bernard Arnault, the controlling shareholder of luxury goods conglomerate LVMH. ","author":["Tom Matsuda","Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161177\/aglae-ventures-web3-fund","publishDate":"2022-08-03T09:48:58","id":1567,"type":null,"title":"Arnault-backed VC firm Aglaé Ventures to launch €100 million web3 fund","category":["Venture Capital"],"content":["Aglaé Ventures, the venture capital firm backed by LVMH chairman and CEO Bernard Arnault, is set to launch a dedicated crypto fund.&nbsp;","Three people familiar with the matter confirmed Aglaé’s plan. The exact timing of its launch isn't clear, but two of those people said the fund will be between €100 million ($102 million) and €110 million in size.&nbsp;","The news comes during a testing period for crypto founders seeking venture backing. Globally, venture capital investment in crypto startups fell 22% in the second quarter from the prior three months, according to <a href=\"https:\/\/www.theblock.co\/post\/160243\/europe-dominates-blockchain-venture-deals-in-q2-as-growth-drops-in-asia-and-the-us\" data-v-f87c67ca=\"\">a report<\/a> from The Block Research. Europe bucked that trend, however, with fundraising by crypto startups in the region up 25% for the same period.","Paris-based Aglaé has previously backed tech heavyweights such as Airbnb, Netflix, Slack and Spotify. It made its first foray into crypto recently, co-leading <a href=\"https:\/\/www.businesswire.com\/news\/home\/20220626005039\/en\/Flowdesk-the-French-Digital-Asset-Financial-Technology-Provider-Raises-30-Million-to-Expand-Its-Infrastructure-and-Trading-Platform\" data-v-f87c67ca=\"\">a $30 million round<\/a> for crypto market maker Flowdesk. But this investment was not made through the upcoming crypto fund, which is yet to make an investment public, according to a person familiar with the matter. &nbsp;","The new web3 fund follows on from Aglaé’s appointment of former CoinFund exec Vanessa Grellet and ex-Aave chief operating officer Jordan Lazaro Gustave to <a href=\"https:\/\/blockworks.co\/vanessa-grellet-jordan-lazaro-gustave-join-aglae-ventures\/\" data-v-f87c67ca=\"\">lead its crypto investments<\/a>. It will target startups both centralized and decentralized, web3 infrastructure, Layer 1 and Layer 2 scalability specialists, and the creator economy.&nbsp;","“It’s been a very successful VC in web2, but they were seeing a lot of things coming in web3 and wanted to hire someone who is a specialist to manage that portion of their investments,” Grellet said to Blockworks in May.&nbsp;","Grellet and Aglaé Ventures declined to comment when reached by The Block.","The launch of a dedicated crypto fund follows similar moves by European venture capital rivals over the last year. In January, London’s Blossom Capital dedicated <a href=\"https:\/\/www.theblock.co\/post\/130454\/blossom-capital-third-fund-crypto\" data-v-f87c67ca=\"\">a third of its $432 million fund<\/a> to crypto firms with a focus on token-based investments. In February, Berlin-based Cherry Ventures launched <a href=\"https:\/\/www.theblock.co\/post\/134525\/cherry-crypto\" data-v-f87c67ca=\"\">a $34 million fund<\/a> to target crypto startups.","Venture investors in the US are putting significantly larger amounts of capital to work through dedicated crypto funds. Earlier this year, Sequoia Capital <a href=\"https:\/\/www.theblock.co\/post\/134578\/sequoia-capital-new-crypto-fund-tokens\" data-v-f87c67ca=\"\">launched its first crypto fund<\/a> to target tokens with $500 million of firepower. In the midst of the current market downturn, in May, Andreessen Horowitz (a16z) <a href=\"https:\/\/www.theblock.co\/post\/148685\/a16z-announces-4-5-billion-fund-for-crypto-and-blockchain-startups\" data-v-f87c67ca=\"\">announced a massive $4.5 billion fund<\/a> for blockchain startups.&nbsp;"],"hashtag":["CRYPTO"]}