{"summary":"Market odds of approval in May are dwindling, but David Lawant and Purvi Maniar of FalconX say we’ll likely see an ETH ETF approval over the next 12-18 months.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/11\/crypto-for-advisors-are-eth-etfs-coming\/","publishDate":"2024-04-11T15:45:00","id":15673,"type":null,"title":"Crypto for Advisors: Are ETH ETFs Coming?","category":["Markets"],"content":["After the successful launches of the spot bitcoin ETFs in the US, the next question is whether ether ETFs will be approved, with a May SEC decision looming. David Lawant, head of research at FalconX, and Purvi Maniar, the company's general counsel, discuss the considerations of such an approval and present the case that it’s likely when not if.","I provide insights into how crypto ETF approvals have driven regulatory certainty in other regions in Ask an Expert.","–S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","A notable theme in the ongoing bull market is Ethereum's (ETH) underperformance, which has deepened over the past few weeks due to increasing skepticism about the odds of the spot ETF decision being approved by the SEC on May 23.","The ETH\/BTC price ratio just dipped below 0.05, marking its lowest point since Ethereum began gaining traction as an institutional-grade asset in May 2021.","As late as February of 2024, the market was anticipating a green light from the SEC on May 23 following the spot BTC ETF approvals in January 2024. This view has been turning sour over the past few weeks, to the point that the current prevailing view is a denial by the SEC. The discount to NAV on the closed-ended Ethereum trust ETHE, a proxy for the market-implied likelihood of denial, increased from 8% to over 25% in the past month.","Spot ETH ETFs will remain a topic of conversation for the markets as we approach May 23 and the next few quarters if they are not approved by then. Let’s explore what the main arguments for and against approval are.","Point (the Consensus View): The Case for Denial","Over the past few weeks, the market has been trending toward expecting the SEC not to approve a spot ETH ETF at the end of May. This line of argument hinges on a few points.","First, there has been virtually no engagement between the SEC and issuers less than two months from the deadline. This contrasts sharply with the spot BTC approval process, where a back-and-forth was publicly visible through a flurry of amendment filings in the months leading to the approval. Contrary to what some have argued, the recent public call for comments is standard and should not be construed as engagement from the regulator.","Another critical factor is the view that the SEC approved the spot BTC ETF approval only begrudgingly. The use cases that ETH currently enables, such as decentralized finance, may make the review process for the SEC more fraught with complexities.","One such nuance is the continued lack of confirmation by the SEC on whether ETH is or is not a security despite its sister agency CFTC claiming it is a commodity.","Counterpoint: The Case for Approval","Some investors and analysts are making persuasive arguments against the mainstream narrative of denial, even if they are not necessarily calling for a May approval.","As Grayscale’s chief legal officer suggested, the absence of engagement does not necessarily predict the outcome. Contrary to the BTC spot ETF approval process, there isn’t much to discuss now. Most of the back-and-forth between the BTC ETF issuers and the SEC was around the redemption mechanism (cash versus in-kind), which is already a settled issue.","The one area where there may be room for discussion would be whether the SEC would allow native staking of ETH. Despite the push by some issuers, the broad view is that staking is unlikely to be allowed initially. That’s a straightforward issue the SEC can resolve at a potential rule-change approval or later when it reviews the S1 (or S3) forms required before launch.","In addition, a denial would likely be met with litigation from the applicants, and there is strong evidence that the issuers would have a strong case. The spot BTC ETF approval hinged on the high correlation between the spot BTC and CME BTC futures markets According to analyses by Fidelity, Bitwise and Coinbase, the same level correlations also exist for ETH, making it an unlikely issue for the SEC to raise again.","Looking Ahead","The spot BTC ETF approval in January did not come by a wide margin. Two of the five SEC commissioners voted in favor, two against, and Chair Garry Gensler tipped the scale. Gensler’s may be the casting vote again for the spot ETH ETF decision.","Out of the over 575 ETFs BlackRock has filed as an issuer, only one was denied by the SEC. Will the spot ETH ETF be the second? The market is attributing relatively high odds of denial, but if there’s one thing crypto investors have learned over the years, it's that last-minute surprises should never be ruled out.","Going beyond this approval cycle ending on May 23, it seems only a matter of “when” and not “if” for spot ETH ETFs to launch in the U.S. market. The arguments for approval will likely outweigh the ones for denial over time. As a result, even if approval does not come by May 23, the chances of a greenlight over the next 12-18 months seem high.","- David Lawant, Head of Research, FalconX","Question: What do the U.S. spot bitcoin ETF approvals in the U.S. mean?","The approvals provide regulated access to bitcoin, and the inflows highlight the tremendous demand for investing in digital assets. ETFs are a simple way for advisors to include crypto in their client portfolios. It’s hard to ignore the record inflows and AUM.","Question: Does this mean more approvals will be coming?","While I can’t speak to what any regulator will approve, I think it’s important to look at other regions and how regulatory approvals of ETFs transpired. For example, the first spot bitcoin ETF was approved in Canada in early 2021. A few months later, ether ETFs gained approval and began trading. Now, there are over 11 ETFs, including a mixed cryptocurrency ETF and an ether-staking ETF. If the same pattern follows, an ether ETF approval can be near.","Europe, Singapore, Australia and Dubai also have approved bitcoin ETFs available in their respective regions.","The other noteworthy item is the upcoming U.S. elections in November. The Republican party seems more eager for crypto legislation and adoption. A change in party incumbency may impact the broader digital asset landscape in the U.S.","Question: What comes next?","After the ETF approvals in Canada, the securities regulators created a registration framework and started defining structures for exchanges and crypto trading platforms requiring registration. Will the US follow suit now that ETFs are here?","A number of companies have now submitted spot bitcoin ETF applications to the Hong Kong Stock Exchange. The UK announced that crypto-traded notes can be traded on the London Stock Exchange starting in May. It will be interesting to see how global approvals impact the U.S. and other regions.","- Sarah Morton, chief strategy officer, MeetAmi Innovations Inc.","Some bitcoin ETF issuers don’t expect the SEC to approve ether ETFs anytime soon.","Deutsche Bank said of the more than 3,600 consumers surveyed recently, less than 1% see bitcoin as a passing fad, and 52% see bitcoin as an important asset class and payment system.","PWC recently released their 2024 global report that provides a breakdown of crypto regulations.","Edited by Bradley Keoun."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"CME BTC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"February of 2024","content":"DATE"},{"type":"S.M.","content":"LOCATION"},{"type":"52%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"AUM","content":"ORGANIZATION"},{"type":"May SEC","content":"ORGANIZATION"},{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"PWC","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Purvi Maniar","content":"PERSON"},{"type":"May 23","content":"DATE"},{"type":"Bitwise","content":"PERSON"},{"type":"Hong Kong Stock Exchange","content":"ORGANIZATION"},{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"Garry Gensler","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"MeetAmi Innovations Inc","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"David Lawant","content":"PERSON"},{"type":"18","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"NAV","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Sarah Morton","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"next 12","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","Ethereum ETF","Ethereum Markets"],"authors":["Sarah Morton","David Lawant"]}