{"summary":"Anchorage Digital stands alone as the only OCC-chartered crypto bank after other efforts have fizzled out or been withdrawn.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/08\/03\/figure-abandons-quest-to-be-us-chartered-crypto-bank-after-three-year-fight\/","publishDate":"2023-08-03T20:50:43","id":15674,"type":null,"title":"Figure Abandons Quest to be U.S. Chartered Crypto Bank After Three-Year Fight","category":["Policy"],"content":["Figure Technologies, Inc., has pulled its application to become a federally chartered bank in the U.S.","The decision ends a three-year rollercoaster ride as regulators clamped down on crypto activity and digital assets banking suffered a black eye when regional lenders associated with the tech world cratered earlier this year.","The Figure application in 2020 drew tremendous scrutiny from Wall Street lobbyists and state banking regulators even before it was seriously considered at the Office of the Comptroller of the Currency (OCC), where banks seek nationwide charters. Traditional bankers had been concerned that Figure might be the first of a new category of competitors who didn’t have to check as many of the burdensome compliance boxes as existing lenders.","The bank pursued the charter as a means to streamline about 200 state licenses it was maintaining for financial activity across the U.S., it said when it announced the effort.","Last year, the acting chief of the OCC, Michael Hsu, praised Figure’s willingness to rework its banking plan by agreeing to seek federal deposit insurance, and Hsu welcomed the chance to consider Figure without a legal fight from state regulators raising objections. But the charter was formally withdrawn on July 31, according to OCC records.","\"Figure has made the decision to withdraw our banking charter application as we focus the organization on other areas of growth with a broad set of established bank partners,\" the company said in a statement sent Thursday.","Others were happy at the news that the company had given up on the charter.","“Had Figure not withdrawn its application, both law and common sense would have dictated that regulators reject it,” said Jesse Van Tol, president and CEO of the National Community Reinvestment Coalition, in a statement that accused the company of making insufficient plans to meet a bank’s customary obligations under the Community Reinvestment Act. “This is good news for anyone who thinks we should have a stable, safe and appropriately supervised financial system.”","Anchorage Digital won its charter from the OCC in 2021, and two other companies that had sought to immediately follow suit – Paxos and Protego – didn’t manage to sway the crypto-skeptical regulator before their conditional approvals expired earlier this year.","Following a brief period during the previous administration in which the OCC welcomed crypto businesses and sought to make a place for them in the banking sector, the agency – along with the Federal Reserve and Federal Deposit Insurance Corp. – has since warned about the serious risk of the crypto industry and cautioned existing banks that they must limit their exposure to the volatile sector.","Edited by James Rubin.","UPDATE (August 3, 2023, 20:54 UTC): Adds a comment from Figure."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"July 31","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"OCC","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Jesse Van Tol","content":"PERSON"},{"type":"National Community Reinvestment Coalition","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Figure Technologies, Inc.","content":"ORGANIZATION"},{"type":"Michael Hsu","content":"PERSON"},{"type":"Federal Reserve and Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"James Rubin","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"August 3, 2023","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Regulations","Bank","Banking Regulation","Licensing","OCC","Office of the Comptroller of the Currency","Figure Technologies","Anchorage Digital"],"authors":["Jesse Hamilton"]}