{"summary":"In retrospect, it's nuts that anyone thought the FTX founder was smart.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/07\/sam-bankman-frieds-wildest-craziest-dumbest-trades\/","publishDate":"2023-11-07T19:48:10","id":15671,"type":null,"title":"Sam Bankman-Fried's Wildest, Craziest, Dumbest Trades","category":["Consensus Magazine"],"content":["The massive fraud perpetrated by Sam Bankman-Fried and his posse of insiders has cost the crypto industry an incalculable loss. There’s a numerical figure to attach here — $8 billion worth of customer funds was spent greasing the political wheel and on trifles like luxury real estate and Tom Brady’s endorsement. While the industry may very well move on from the embarrassment of SBF’s “old-fashioned” embezzlement scheme someday, there is a certain, unalterable harm done from learning the supposed smart money in crypto was incredibly dumb.","This post is part of Consensus Magazine’s Trading Week, sponsored by CME. A version of this article was published in The Node newsletter, which you can subscribe to here.","Billions were misappropriated to prop up SBF’s money-losing hedge fund, Alameda Research. This went towards venture capital bets, which catalyzed the liquidity mismatch that ultimately brought SBF down, as well as plugging holes in Alameda’s finances. If at one time befuddled outsiders thought SBF must be making money hand-over-fist, all the evidence now shows Alameda Research was a money sink. Founded as a “market neutral” market maker, Alameda eventually developed into a pump-and-dump firm that inexplicably lost money during the largest bull market to date.","This is a roundup of some of the worst gambles we know Sam Bankman-Fried took during his five years as a crypto-trading behemoth, gleaned from the fallout of FTX, his ex-girlfriend Caroline Ellison’s courtroom testimony and on-chain sleuths. For a man obsessed with calculating the “expected value” of his actions, SBF was remarkably bad at gauging reality — in hindsight that may be expected, considering he thought taking the stand at his own criminal trial and likely perjuring himself was a risk worth taking.","See also: Sam Bankman-Fried Lost Half a Million Dollars Everyday After Alameda Launched","On May 8, 2019, shortly after the founding of FTX, Sam Bankman-Fried launched his own exchange token called FTT. The idea was to give the young platform an “equity cushion,” apparently at a time when getting loans was difficult for the upstart traders. From the outset, the Department of Justice’s cooperating witness Caroline Ellison said SBF had directed Alameda to protect the price of FTT — at first buying the token to prevent it from ever dipping below what SBF saw as a key psychological price level of $1.","Alameda Research had received between 60%-70% of the initial token distribution, and in early 2020, SBF told his technical co-founder Gary Wang to include Alameda's FTT stockpile in calculating its balances. In many ways, this was the original sin of FTX long before SBF directed head coder Nishad Singh to program the “Allow Negative” functionality used as a backdoor to drain customer funds from FTX.","The largely illiquid token, which would have cratered had Alameda been required to sell it, was used as collateral in billions of dollars worth of investments and loans, and created a false impression of Alameda\/FTX’s conjoined “net asset value” (NAV), which convinced SBF it was okay to borrow billions worth of customer funds, Ellison and Wang both suggested on the stand. Without FTT, many of Sam Bankman-Fried’s errancies wouldn’t have been contemplated.","Although FTT was often treated as a bet on SBF’s potential success, the token did not actually represent equity in the exchange. Yet, SBF often treated it as such. As part of Binance’s investment in FTX and SBF’s later buyout of Changpeng Zhao, Bankman-Fried had given his would-be competitor a total 23 million FTT tokens. Worth ~$529 million at the time CZ threatened to liquidate his FTT holdings, that was leverage that eventually enabled CZ to deal the fatal blow to his rival at a time when the world was increasingly worried about Alameda’s solvency.","Two months before FTX went bankrupt, SBF reportedly circulated plans to wind down Alameda. That never came to fruition, of course, because Alameda had by that point an unpayable $14 billion debt to FTX. Still, some of SBF’s deliberations from the time were entered into evidence, including a Twitter thread he had planned to send had Alameda been dissolved. In the draft, he described Alameda Research as \"one of my largest successes–and then, briefly, largest failures–and then again successes.\"","While there are many “failures” worth mentioning, SBF noted one of his largest was when “the company” lost track of “millions of dollars worth of XRP tokens.” He explained: \"In February 2018, we got lazy–and our accounting was lazy–and we lost most of what we'd made.” In typical verbose SBF style, he continued: \"Employees were sad and angry and frustrated, and I had no idea what to do about that.\"","See also: The Other FTX Case | Opinion","Although he blamed the company, this loss corresponds with a known attempt by early Alameda employees to toss SBF out of his own company after a string of compulsive and risky trades that lost almost all the trading firm’s profits.","The XRP gambit wasn’t the only accounting flub at Alameda. In a series of recent X\/Twitter threads, former Alameda Research engineer Aditya Baradwaj disclosed the trading shop had lost $190 million from security incidents. This was apparently a direct result of SBF’s management, and his Ensam-fueled desire to move at breakneck speed.","\"Safety checks for trading would only be added on an as-needed basis, blockchain private keys and exchange API keys were stored in plaintext in a file that several employees could access,” Baradwaj alleged, adding that \"meant virtually no code testing and incomplete balance accounting.” At one point, for instance, an attacker gained access to Alameda’s private keys that were held in a “plaintext file,” enabling him to transfer $50 million \"out of some exchanges.”","On another occasion, an Alameda trader lost $40 million in a yield farm on a new blockchain. The largest loss Baradwaj mentioned happened after an Alameda trader, who was unnamed in Baradwaj's account, lost $100 million after clicking on a DeFi phishing link that was promoted in a Google ad. Woof.","At various times, the Jane Street veteran SBF described Alameda as a market neutral market maker, a critical piece of crypto infrastructure and a “quant” trading firm. Market makers make money by supplying liquidity and filling both buy\/sell sides of trade, slowly accruing profits from the tight “spreads” between what people are willing to pay for an asset and the price at which it can be sold. To some extent, Alameda was no different — apart from all the frontrunning.","But even though Alameda knew what trades occurred before other FTX customers, giving it an advantage, it still sometimes lost money performing basic functions. The so-called MobileCoin (MOB) incident, for instance, cost Alameda as much as $1 billion, according to the Financial Times.","The trade is actually so stupid, it’s almost difficult to explain. But, in short, in 2021 a trader began buying so much of the thinly-traded MOB token (which at the time was only listed on FTX and Binance), he began to push the price from below $10 to above $60. He then took out loans using FTX’s “unique” margin and liquidation engine, pledging the overly-inflated MOB as collateral. When the price of MOB inevitably collapsed, he defaulted on the loan but kept the capital and Alameda apparently stepped in to eat the loss to prevent FTX from going bankrupt.","Ellison reportedly sent SBF a document titled \"Notable Idiosyncratic P&L Stuff” breaking down the trade, which described a “malfunction” in FTX’s margin system. However, during his testimony, SBF said he had actually manually overridden FTX’s risk engine while it was happening, in part because he wasn’t sure if the trade was legitimate. Further, he also directed Alameda to take on the loss because he didn’t want it on FTX’s books, because investors would likely ask questions about it.","In 2021, Alameda had reportedly made over $1 billion in profits which it began to reinvest. Some of Alameda’s largest investments were in the mining sector, which in retrospect happened at the absolute height of the market. The trading firm had invested more than $100 million in a Kazakhstan-based mining facility, just months before the country effectively banned bitcoin mining, as well as another $1 billion into Genesis Digital Assets. The profitability of Genesis then tanked alongside the collapsing price of bitcoin.","Alameda sank $1.4 billion into startups in 2021, according to the Wall Street Journal, up from just $10.5 million the year before. In total, SBF borrowed $2 billion to start a venture fund that invested in more than 500 startups and seed rounds. While not all of those bets have turned south — in particular a $500 million investment in AI startup Anthropic, which is being courted by Google and Amazon, as well as “VC coins” like Aptos and Sui — there were also a few oddities including a fertility clinic, a military drone maker and something called Wordcel.","Of course, SBF wasn’t a complete fool. A market entrant of “the class of 2017,” Bankman-Fried saw the rise and fall (and legal headaches) of ICOs (or initial coin offerings) and innovated on the design. As opposed to launching tokens and raising capital from retail buyers, who undoubtedly would be annoyed and possibly threaten legal action once the token’s price inevitably catered or the promised innovation failed to materialize, SBF developed a different scheme.","See also: Divisions in Sam Bankman-Fried's Crypto Empire Blur...","Instead of selling people tokens for vaporware, SBF used his trading firm to be a net buyer of his own sh*tcoins. He then used those holdings to leverage up, and take out cash loans. This was a repeat strategy for SBF, which he seemingly did multiple times with tokens like Serum (SRM), Maps (MAPS), Oxy (OXY) and FTT — tokens now known as “Sam Coins” because of his sizable ownership and direct control over the supply. At one point, afraid his own employees had grown too rich, he reportedly changed the vesting schedule of SRM to keep them working.","Alameda was also a net buyer in coins before they listed on FTX, according to research outfit ChainArgos. Between the start of 2021 and March 2022, Alameda reportedly bought 18 different tokens before public listing on FTX, and sold them at a profit.","In a way, this was SBF’s chief innovation in the world of crypto — it was a strategy that ensured tokens associated with his personal brand held their price, and helped him finance a fraudulent empire. But this token-buying scheme was also his chief undoing. Curiously, the Alameda balance sheet that CoinDesk’s Ian Allison reported on was created by Caroline Ellison to try to hide the hedge fund’s level of risk, leverage and indebtedness to FTX. Yet, despite the misrepresentations, Alameda’s massive holdings of FTT, MAPS and OXY were enough to cast doubt on its solvency and ultimately bring down SBF’s entire operation.","The nail in the coffin was when SBF directed Caroline to tweet out FTT’s liquidation price. It’s incredible that anyone ever thought SBF was smart."],"entity":[{"type":"$190 million","content":"MONEY"},{"type":"Genesis Digital Assets","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Amazon","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"$10","content":"MONEY"},{"type":"Tom Brady","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"$60","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"FTT","content":"ORGANIZATION"},{"type":"“millions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"SRM","content":"ORGANIZATION"},{"type":"February 2018","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Sam Coins","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"$10.5 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"Ellison","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"$40 million","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"May 8, 2019","content":"DATE"},{"type":"$529 million","content":"MONEY"},{"type":"Aptos","content":"LOCATION"},{"type":"Baradwaj","content":"ORGANIZATION"},{"type":"Ensam","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Baradwaj","content":"PERSON"},{"type":"$1.4 billion","content":"MONEY"},{"type":"Oxy","content":"ORGANIZATION"},{"type":"OXY","content":"ORGANIZATION"},{"type":"Caroline","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Alameda\/FTX","content":"ORGANIZATION"},{"type":"Million Dollars Everyday After Alameda Launched","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"$14 billion","content":"MONEY"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Ian Allison","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["Opinion","The Node","Newsletters","Trading Week 2023","Sam Bankman-Fried","FTX","Alameda Research"],"authors":["Daniel Kuhn"]}