{"summary":"With a roster of bitcoin ETFs already trading, companies will need to figure out how to differentiate their products.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/08\/welcome-to-the-bitcoin-era-on-wall-street\/","publishDate":"2024-02-08T22:10:05","id":15683,"type":null,"title":"Welcome to the ‘Bitcoin Era’ on Wall Street","category":["Consensus Magazine"],"content":["After much delay, spot bitcoin exchange-traded funds (ETFs) have burst on the scene. BlackRock’s IBIT is now the fifth largest ETF (of all) by inflows this year, with rival funds not far behind. It’s not yet clear whether this rate of growth can keep pace and match the bullish predictions set by firms like Standard Chartered Bank and Fidelity for meteoric end-of-year ETF valuations, but it is obvious that bitcoin ETFs are here to stay.","The question is how will Wall Street approach this newfound way to gain bitcoin exposure, and will regular investors want a piece of the action?","“We think bitcoin could be one of the most talked about brands on Wall Street in the next decade,” Mike Willis, CEO and founder of ONEFUND, said. “You're at the beginning of the ‘bitcoin era’ on Wall Street.” Although remiss to offer a price prediction, Willis said he thinks bitcoin could easily catch up to gold's market cap.","It’s an interesting prediction given ONEFUND’s strategy in launching its own bundle of bitcoin ETFs. The independent index fund operation, most known for its $106 million INDEX ETF that tracks the S&P 500, plans to launch a number of “Cyber Hornet” funds that hold both bitcoin and traditional equities in a bid to appeal to risk averse retail investors.","Most wealth managers will not advise their clients to take more than a 1%-3% allocation in crypto, Willis said. But even that small recommendation could open up financial advisers to legal risks. “Hardcore bitcoiners might be used to it, but 90% of Wall Street and just traditional investors are not used to being down 40% in a given month.”","“If I'm down 40% for clients they’re burnin up my phone, if I'm down 50% they're out, if I'm down 60% or 70% it's a potential fiduciary liability — a potential lawsuit. Advisers are aware of that,” Willis, who co-founded ONEFUND in 2015 after stints at UBS, Paine Webber and Smith Barney, said.","The ETF closest to launch, which has received approval by the SEC under the ticker ZZZ, will allocate 75% of its capital to the S&P and 25% to bitcoin futures (with an option also to hold spot bitcoin, Willis said). The idea is to help mitigate bitcoin’s potential downside risk and notable volatility by investing in “the most widely held index strategy on Wall Street.”","Willis said he predicts a number of hybrid funds to launch with strategies that protect the downside “vol,” or volatility, of bitcoin, perhaps using U.S. Treasuries and\/or other less risky asset classes. This will also be a way for funds to differentiate themselves, given the crowded competition after 11 spot bitcoin ETFs were approved on the same day.","Like many, Willis sees a race to the bottom in terms of management fees — given that it's one of the few ways firms can undercut their competition. Others are offering promotions, like Bitwise slashing fees to zero for the first six months or until the fund reaches a certain asset threshold. But these marketing efforts can work only for a limited time.","The other way for firms to compete is how they treat the underlying bitcoin they buy with investors’ money — either leveraging it to earn yield for the company or holding it in cold storage. Some funds, Willis said, may rehypothecate (or loan out) the bitcoins in order to earn a return, which can earn “hundreds of basis points.”","See also: A Bitcoin ETF Will Never Be Your Bitcoin | Opinion","For its part, ONEFUND has no intention of competing on fees, and thinks it will be able to charge higher rates because it’ll guarantee in its prospectus that the bitcoins won’t move from cold storage (the firm is talking with Caitlin Long’s Custodia Bank for custody services). But there are other, somewhat intangible ways that firms can diversify away from the pack.","For instance, the one firm holding firm to high fees is Grayscale, which is charging 1.5% on its popular GBTC product. GBTC has a lot of brand equity built up as the first traditional on-ramp into bitcoin, launching initially as a close-ended trust in 2013. The fund has seen notable withdrawals since it transitioned to an ETF this year, though Willis said he’s surprised the fund hasn’t lost more.","“It's loyalty. It's laziness. And the other side is bitcoiners don't want to go to BlackRock or Fidelity — they want to keep it in the community,” he said. ONEFUND is hoping to tap into that same sense of bitcoiner camaraderie, a sort of non-institutional institution. That’s part of the reason why it chose the Cyber Hornet branding, a phrase most closely associated with uber-bitcoiner Michael Saylor, who is not affiliated with the product.","The firm, which made news when it allowed its INDEX fund shareholders to vote by proxy, has also secured a number of “kickass” tickers for its ETFs, which will all have different allocations between bitcoin and the S&P500. Triple-letter tickers, like “the Qs,” standing for Nasdaq’s QQQ, are valuable real-estate, Willis said, mentioning the “triple Z” ticker on his firm’s flagship bitcoin ETF.","Indeed, a number of recently launched ETFs carry meme-worthy names, including Valkyrie's BRRR (referring to the pandemic era “money printer go BRR” meme) and VanEck’s HODL (referencing how bitcoiners buy, hold and rarely sell).","See also: The Rise and Fall of Bitcoin Culture | Opinion","\"We think the branding is going to stand for doing things the ‘right way,’ the non-institutional choice that represents the community,” Willis said. “We're not owned by BlackRock, we're not owned by the big institutions.\"","Still, in some sense, Willis' game plan revolves around Wall Street entering the picture. Although it may not be the most \"orthodox\" way to get people using bitcoin, it is the easiest and safest route to mass onboarding into bitcoin economy via ETFs, perhaps fulfilling Cory Klippsten's dream of creating \"10 million bitcoiners,\" Willis said.","The first turn of the supposed flywheel came last year, when BlackRock announced its plan to launch a bitcoin ETF, which in a way gave other Wall Street firms cover to also get involved. Now that ETFs are actually live, over the next decade more and more capital will flow into bitcoin — beginning with model portfolios, retirement accounts, pension plans and ultimately culminating in it becoming a \"mainstream asset class,\" Willis said.","\"Bitcoin has been alive and well for 15 years, but on Wall Street it's been non-existent,\" he said. \"This changes everything.\""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2015","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Cory Klippsten","content":"PERSON"},{"type":"Smith Barney","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"UBS","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"25%","content":"PERCENT"},{"type":"Caitlin Long’s Custodia Bank","content":"ORGANIZATION"},{"type":"$106 million","content":"MONEY"},{"type":"BlackRock’s IBIT","content":"ORGANIZATION"},{"type":"Mike Willis","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Willis","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"Grayscale","content":"LOCATION"},{"type":"Paine Webber","content":"PERSON"},{"type":"1.5%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"VanEck","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"” Willis","content":"PERSON"},{"type":"Standard Chartered Bank","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Opinion","Wall Street","ETFs","Bitcoin ETF","S&P 500"],"authors":["Daniel Kuhn"]}