{"summary":"The NFT market continues to grow as one of the industry’s most prominent sectors. Here’s how to make, buy and sell these digital assets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/how-to-create-buy-and-sell-nfts\/","publishDate":"2022-01-05T13:27:47","id":15686,"type":null,"title":"How to Make, Buy and Sell NFTs","category":["Learn"],"content":["Non-fungible tokens (NFTs) are unique collectible crypto assets that have been around as early as 2012 when the concept of Bitcoin Colored Coins first emerged. These coins were simply satoshis – small fractions of a bitcoin – marked, or “colored in,” with distinct information that could link the coins to real-world assets. An example of this could be “this satoshi represents $500 worth of John Doe’s New York office building.” For the most part, however, Colored Coins were used to create and trade artwork like “Rare Pepe” digital cards on Counterparty, a peer-to-peer trading platform built on top of Bitcoin’s blockchain.","These cartoon frog images adapted from a viral internet meme were some of the earliest examples of unique digital artwork tied to crypto tokens. This paved the way for the ideation and creation of new non-fungible token standards – a set of blockchain building blocks that allow developers to create their own NFTs.","NFTs can be used to represent virtually any type of real or intangible item, including:","Making your own NFT, whether it be a GIF or an image, is a relatively straightforward process and doesn’t require extensive knowledge of the crypto industry. NFT artwork can also be used to create collectibles like sets of digital trading cards.","Each blockchain has its own separate NFT token standard, compatible wallet services and marketplaces. For instance, if you make NFTs on top of the Binance Smart Chain, you will only be able to sell them on platforms that support Binance Smart Chain assets. This means you wouldn’t be able to sell them on something like VIV3 – a Flow blockchain-based marketplace – or OpenSea which is an Ethereum-based NFT marketplace.","Since Ethereum has the largest NFT ecosystem, here’s what you’ll need to make your own NFT artwork, music or video on the Ethereum blockchain:","Once you have these, there are a number of NFT-centric platforms that allow you to connect your wallet and upload your chosen image or file that you want to turn into an NFT.","The main Ethereum NFT marketplaces include:","Makersplace also allows you to make your own NFTs but you have to register to become a listed artist on the platform beforehand.","OpenSea, Rarible and Mintable all have a “create” button in the top right corner.","Here’s how the process works on OpenSea, currently the largest Ethereum-based NFT marketplace.","Clicking the \"create\" button (blue) will take you to a screen that asks you to connect your Ethereum-based wallet. Once you’ve entered your wallet password when requested it will automatically connect your wallet with the marketplace. You may have to digitally sign a message in your Ethereum wallet to prove you own the wallet address, but it’s just a case of clicking through to proceed.","Digitally signing a message does not incur a fee, it’s just to show that you have ownership over the wallet.","The next step on OpenSea is to hover over “create” in the top right corner and select “my collections.” From there, click the blue “create” button as shown below.","A window will appear that allows you to upload your artwork, add a name and include a description.","This part is essentially just you creating a folder for your newly created NFTs to go in.","Once you’ve assigned an image for your collection, it will appear as shown below (blue). You’ll then need to add a banner image to the page by clicking on the pencil icon in the top right corner (red).","Your page should end up looking something like the image below.","Now, you’re ready to make your first NFT. Click on the “Add New Item” button (blue) and sign another message using your wallet.","You’ll arrive at a new window where you can upload your NFT image, audio, GIF or 3D model.","On OpenSea and many other marketplaces, you also have the option to include special traits and attributes to increase the scarcity and uniqueness of your NFT. Creators even have the opportunity to include unlockable content that can only be viewed by the purchaser. This can be anything from passwords to access certain services to discount codes and contact information.","Once you’re finished, click “create” at the bottom and sign another message in your wallet to confirm the creation of the NFT. The artwork should then appear in your collection.","While it costs nothing to make NFTs on OpenSea, some platforms charge a fee. With Ethereum-based platforms, this fee is known as “gas.” Ethereum gas is simply an amount of ether required to perform a certain function on the blockchain – in this instance, it would be adding a new NFT to the marketplace. The cost of gas varies depending on network congestion. The higher the number of people transacting value over the network at a given time, the higher the price of gas fees and vice versa.","Top tip: Ethereum gas fees are significantly cheaper on average during the weekend when fewer people are transacting value over the network. This can help keep costs down if you’re listing multiple NFTs for sale.","Read More: What Are Gas Fees?","Before you rush to buy NFTs, there are four things you need to consider first:","As you can probably guess by now, certain NFTs are only available on specific platforms. For example, if you want to purchase NBA Top Shot packs you will need to open an account with NBA Top Shot, create a Dapper wallet and fund it with either the USDC stablecoin or supported fiat currency options. You will also have to wait for one of the card pack drops to be announced and try your luck in trying to buy them before they sell out.","Pack and art drops are becoming increasingly common as a method for selling scarce NFTs to an audience of hungry buyers. These drops normally require users to sign up and fund their accounts beforehand so that they don’t miss out on the opportunity to purchase NFTs when they drop. Pack and art drops can be over in seconds, so you need to have everything ready ahead of time.","To sell your NFTs on a marketplace, you’ll need to locate them in your collection, click on them and find the “sell” button. Clicking this will take you to a pricing page where you can define the conditions of the sale including whether to run an auction or sell at a fixed price.","Ether and other ERC-20 tokens are the most common cryptocurrencies you can sell your NFTs for, however, some platforms only support the native token of the blockchain they were built upon. VIV3, for example, is a Flow blockchain marketplace and only accepts FLOW tokens.","By clicking on the “edit” button next to the collection image on OpenSea, signing the message using your wallet and scrolling down, you have the option to program in royalties and select which ERC-20 token you’d like to receive for selling the NFT. Royalties allow NFT creators to earn a commission every time the asset is sold to a new person. This has the potential to create lifelong passive income streams for artists and other content creators automatically thanks to smart contracts.","Listing NFTs on a marketplace sometimes requires a fee in order to complete the process. While it’s not the case with every platform, it’s something to be mindful of when creating NFTs.","For crypto traders who are primarily interested in buying NFTs, here is a list of the most popular NFT marketplaces in 2021:","The NFT craze is far from being over. Major brands and celebrities such as the UFC and Shawn Mendez have released or signed deals to release their own non-fungible assets, and even Elon Musk’s girlfriend Grimes has jumped on the bandwagon selling almost $6 million worth of digital artwork in minutes.","Interest in NFTs continues to remain strong, with NFT sales during the first 5 days of 2022 breaking $700 million on OpenSea – driven largely by the Bored Ape Yacht Club (BAYC) and Mutant Ape Yacht Club (MAYC) collections. With more blockchains competing to produce better NFT services too and a growing range of platforms to choose from, now is a great time to take part in the space.","It took 12 hours and three different Apple devices, but this 30-something poet successfully minted her first NFT – and so can you. Here's a step-by-step guide to creating an NFT.","Forget selling your NFTs. Now, you can make your unique digital items work for you.","Art and collectibles were just the start."],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"$500","content":"MONEY"},{"type":"NBA Top Shot","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"John Doe","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Rarible","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Grimes","content":"PERSON"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Bitcoin Colored Coins","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"UFC","content":"ORGANIZATION"},{"type":"$700 million","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"Shawn Mendez","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["NFTs","Explainers","Learn","Evergreen","Beginner"],"authors":["Ollie Leech"]}