{"summary":"The idea of a yield-paying layer-2 blockchain atop Ethereum has clearly demonstrated market allure. But even the project's biggest investor has taken issue with the execution and marketing surrounding the initial rollout.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/11\/29\/blasts-one-week-600m-haul-shows-promise-of-yield-pitfalls-of-hype\/","publishDate":"2023-11-29T12:00:00","id":15687,"type":null,"title":"Blast's One-Week, $600M Haul Shows Promise of Yield, Pitfalls of Hype","category":["Technology"],"content":["On its face, the idea behind Blast doesn't seem so objectionable: a layer-2 blockchain atop Ethereum that pays interest to depositors – a differentiator that might help a new player stand out versus the current market leaders, Arbitrum, Optimism and Base, or against dozens of other competing networks.","Clearly there's something attractive about the proposition, because in just a week since the project was unveiled, some $603 million has flooded into Blast, an amount that would immediately rank the project as the third-biggest Ethereum layer-2 network. By comparison, Base, backed by the prominent U.S. crypto exchange Coinbase, has amassed just $582 million since its launch a few months ago, a much slower rate of deposits that was nonetheless considered a coup when the chain launched.","But Blast's marketing pitch has attracted critics alongside the crypto dollars, including a public scolding from a key financial backer, the venture-capital firm Paradigm, over how the project went about its splashy introduction.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday.","Blast's actual network isn't expected to launch until next year, but its leaders have begun accepting deposits anyway – promising \"native yields\" and dangling the prospect of an eventual token airdrop to early birds. People can earn \"blast points\" by depositing funds into an Ethereum wallet associated with the yet-to-launch Blast chain, or by inviting others to do the same. It's all neatly packaged on Blast's cyberpunk-themed website, which displays a videogame-like leaderboard showing who has earned the most points – with the highest-ranked among them entitled to a larger share of soon-to-be airdropped tokens.","Aside from the garishness of it all, there's been criticism of what some commentators describe as a potentially risky setup, where depositors are essentially relying on faith in an undisclosed group of \"engineers\" – as opposed to more robust security measures – to safeguard their cryptocurrency ahead of Blast's real launch. For now, user deposits into Blast's crypto wallet can't be withdrawn. And at least initially, the juicy yields won't come from any internal workings of Blast, but from routing deposits to other yield-paying projects, primarily the liquid-staking protocol Lido, adding yet another layer of risk.","Without any detailed technical specs, it's unclear so far what Blast's yet-to-exist network will even be; the primary disclosure is that it will be an optimistic rollup that pays interest.","In an earlier era, such as in the halcyon days of degenerate decentralized finance (DeFi) in 2020, when crypto traders drunk on sky-high-returns happily overlooked project technicals in favor of vague promises, Blast's approach might have seemed par for the course. But the recent blowback speaks to how cautious some corners of the industry have become in recent months. Industry figures are afraid of getting swept up in the same empty excitement that fueled – and crashed – the last DeFi market, when crypto's reputation was tarnished by a downward spiral of token collapses, exchange failures and criminal charges.","\"Much of the marketing cheapens the work of a serious team,\" Dan Robinson, a researcher at Paradigm, which was one of Blast's lead investors, wrote on X. Robinson's thread marked a rare instance in which a major venture firm publicly rebuked one of its own portfolio companies.","Robinson expressed strong disagreement with Blast's approach of accepting deposits into a token bridge – currently just a glorified Ethereum multisig wallet – before launching a real network, and without allowing withdrawals.","The marketing strategy \"crossed lines in both messaging and execution,\" according to Robinson.","Neither Robinson nor Blast founder Tieshun Roquerre responded to requests for comment for this story.","Paradigm, whose partners include a Coinbase co-founder, Fred Ehrsam, is looked to as a beacon of crypto investing – known for its widely-read research reports and think pieces on the state of the space.","For startups in Paradigm's orbit, the \"Backed by Paradigm\" badge serves as a stamp of credibility, the idea being that the firm ostensibly does extensive due diligence on portfolio companies – to reduce the chance that a project might be one of myriad Ponzi-like schemes, rugpulls or other scams that are so prevalent in crypto.","It's possible that Paradigm's participation provided an extra dose of confidence to traders as they have poured money into Blast in recent days.","Many investors are still jaded by their scorchings from Terra (LUNA), Olympus (OHM), and other buzzy projects from DeFi's 2019-2021 heyday – hype-driven cryptocurrency experiments that ballooned into billion-dollar behemoths before crashing to pennies.","Afraid of falling prey to empty buzz yet again, some traders and investors have tried pushing the industry into a new era – to clean up its act, at least as far as most marketing is concerned.","A more sober set of norms has come to typify the crypto startup landscape. A focus on \"zero-knowledge proofs\" and other technical nomenclature has supplanted percentage-point-yield figures in ad copy and pitch decks. \"Layer 2\" infrastructure extending Ethereum has replaced \"yield farming\" as the product category du jour favored by investors.","Blast's product pitch, which earned it $20 million in funding from Paradigm and other backers, wasn't completely out of step with the times.","Similar at a high level to layer-2 networks like Arbitrum, Optimism and Coinbase's Base chain, Blast would \"settle\" user transactions on the \"Layer 1\" Ethereum network, but function separately as a way to ramp up bandwidth.","Without much differentiating it mechanically from other layer 2 up-and-comers, however, Blast's marketing highlighted its plan to pay \"yields\" to users, in addition to an invitation-based reward system.","Blast made big promises that evoked crypto of old – instructing users to \"lock up\" their funds in a \"bridge\" for a period of three months in exchange for \"risk-free\" yields. The platform itself won't launch until February. Until then, users will be unable to withdraw their funds.","Paradigm's Robinson took issue with this lock-up mechanic, saying \"we don’t agree with the decision to launch the bridge before the L2, or not to allow withdrawals for three months, since we think it sets a bad precedent.\"","Crypto history is filled with \"rug pulls\" – where someone creates a project and then runs off with the funds. There's no evidence that Blast is a scam, but similar setups have been employed by fraudsters in the past, where user funds were \"locked\" for some period, and then the whole pot was stolen. Notoriously, crypto bridges – used to transfer tokens between blockchains – have also been frequent targets for crypto-savvy hackers.","Blast's bridge, where the half-billion-plus dollars of locked user funds now sit, is controlled by a \"multisig\" wallet – a set-up that, in Blast's case, requires three of five individual \"signers\" to approve transactions. Blast defended the system in a thread on X, positing that \"Multisigs can be highly effective if used properly. This is why L2s like Arbitrum, Optimism, Polygon and now Blast use a multisig model.\"","Blast has said nothing about who is behind its multisig, meaning users who deposit their money into the Blast bridge are entrusting their money to an unknown set of entities. This isn't completely out of the norm; Optimism keeps its multisig signers anonymous as a security measure, as do some other projects. But the fact that Blast is so far just a multisig wallet – rather than a bona fide bridge or blockchain – has fueled skeptics.","Blast's FOMO-inducing \"native yield\" and \"blast point\" mechanics, center-stage in its marketing, were also key focal points for critics.","Yield is a genuinely useful tactic for attracting users, and Blast's promised yields – in the 4-5% range, plus extra \"blast points\" – pale in comparison to the obviously-too-good-to-be-true 1000%+ yields promised in the days of \"yield farming,\" when projects would just mint tokens willy-nilly in an unsustainable short-term bid to prop up yields.","Blast's use of the phrase \"risk-free\" interest – possible due to money re-invested behind the scenes into interest-bearing assets like staked Ether – raised red flags. Countless projects have appealed to users with promises of high yields, only to collapse entirely once returns decrease.","Blast also introduced a gamified invite system that rewards users for sharing the project – teasing the prospect of airdropped tokens to users who issue the most invites. Incentivized invites aren't new. Friend.tech, a popular social app on Coinbase's Base chain, recently employed a similar model, to much success.","But such systems can bear a striking resemblance to multi-level marketing, and crypto-veterans have a particular allergy to the tactics given the industry's sordid history with pyramid-shaped business models.","Blast was founded by Roquerre, who typically operates under the pseudonym \"Pacman\" and initially came to prominence as the founder of the NFT marketplace Blur. In a thread on X last week, Roquerre attributed some of the Blast blowback to \"misunderstandings.\"","\"There's a meme going around that Blast is a Ponzi,\" Roquerre wrote. \"The yield that Blast provides users can feel too good to be true, so this meme is understandable. But to put it simply, the yield Blast provides comes (initially) from Lido and MakerDAO,\" another crypto protocol.","That the lion's share of Blast's half-a-billion dollars in deposits has been poured directly into Lido, a liquid Ethereum staking protocol with deep Paradigm ties, only added to the scrutiny.","Paradigm has been in the crosshairs of Blast's critics since the project was first announced, with some arguing that an influential firm like Paradigm – which backs Lido, Flashbots and a number of other industry cornerstones – shouldn't have its fingerprints on a project with such controversial tactics, particularly given the potential for conflicts of interest.","\"Paradigm had zero involvement in Blast's [go-to-market],\" Roquerre wrote, adding that \"they probably would have asked me to change a lot about Blast's launch if they had been involved,\" and in fact did request changes to Blast's strategy post-launch.","While Paradigm did not pull its funding from Blast, and Robinson's statement did not address the Lido ties, his comments did appear to put some onlookers at ease.","\"Many of the tactics displayed with Blast go fully against the entire ethos of crypto, in exchange for some guerrilla marketing benefits,\" wrote Jordi Alexander, a blockchain investor who was one of the most vocal critics of Terra ahead of its spectacular 2022 collapse. \"I am completely in favor of a seminal fund in our industry, that is playing a longer-term game, clarifying publicly when their fund's reputation is attached to an approach that has made many of us in the space uncomfortable.\"","As the columnist David Z. Morris wrote on his Substack, \"Paradigm probably can’t just take the money back, and this is only a minor blow to their reputation, as long as Blast’s creators actually don’t rug.\"","It's unclear whether Blast's approach was really all that much of a miscalculation in pure business terms. Even if a vocal contingent of the crypto Twitterati finds Blast's methods distasteful, the project has attracted eye-watering demand in dollar terms – this while the rest of DeFi is in a market slump.","The money that's flooded into Blast may have come predominantly from a few big backers, or from mercenary yield farmers who will leave as soon as they snag their Blast airdrop.","But if the funds in Blast do remain safe, and if the chain opens in a few months as promised, the project's big initial splash could prove a winning gambit – helping Blast to elbow its way into the competitive turf war between similar layer 2s.","By then, the original marketing sins might be long forgotten.","Edited by Bradley Keoun."],"entity":[{"type":"Olympus","content":"ORGANIZATION"},{"type":"$603 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Base","content":"LOCATION"},{"type":"Jordi Alexander","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"David Z. Morris","content":"PERSON"},{"type":"Robinson","content":"PERSON"},{"type":"1000%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Dan Robinson","content":"PERSON"},{"type":"OHM","content":"ORGANIZATION"},{"type":"$582 million","content":"MONEY"},{"type":"Ponzi","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Roquerre","content":"PERSON"},{"type":"a-billion dollars","content":"MONEY"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Paradigm","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Fred Ehrsam","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"X. Robinson","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Analysis","Paradigm","Yield Farming","Yield","Ponzi","Ponzi scheme","Pacman","Pyramid Scheme"],"authors":["Sam Kessler"]}