{"summary":"Litecoin's creator Charles Lee has left Google to go and work on Coinbase full time.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2013\/08\/02\/litecoin-creator-charles-lee-has-left-google-to-work-at-coinbase\/","publishDate":"2013-08-02T16:36:11","id":15680,"type":null,"title":"Litecoin creator Charles Lee has left Google to work at Coinbase","category":["Markets"],"content":["Charles Lee, the founder of Litecoin, has left his job at Google after being signed full-time by Coinbase. He started this week.","The California-based coder and MIT graduate decided to work for the digital wallet company after six years at Google, where he worked on projects including YouTube, ChromeOS, and Google Play Games.","Coinbase isn’t the first bitcoin company to employ someone from a cryptocurrency’s core development team. BitPay hired Bitcoin core developerJeff Garzik in May. That hire, however, was designed to get the former Red Hat engineer working full-time on bitcoin, which had been a side project for him before. This won’t be the case with Coinbase and Lee.","“I will be working on Coinbase code. Basically, whatever's necessary to help Coinbase succeed,” he told CoinDesk, which conducted an in-depth interview with him earlier this year. “Litecoin will still be a side project, but Coinbase is fully aware of this and support it. And Litecoin is not going anywhere. We have a dedicated team working on it and we are actively working on releasing the latest 0.8 client.”","Lee was secretive about his Google job when he worked there. Now, he’s opening up. “The main reason why I didn't publicize that I worked for Google previously is because I didn't want to make it seem like Google endorsed Litecoin or Bitcoin in anyway,” he said. “Litecoin was just an open source project I worked on in my free time. Now that I'm no longer at Google, I'm ok with it being more public.”","Google has a wallet product for mobile payments, and people in the cryptocurrency space have speculated that it might make sense for the company to launch its own virtual currency in the future.","Lee confirmed that there would be a virtual wall between his job at Coinbase and his Litecoin activities. “One of Litecoin Project's core principles is to remain vender neutral and that won't change with me working at Coinbase,” he said. “Plus, it's no longer just me running the show. We have quite a few talented people on our team now and we do things in a democratic way.”","Image Credit: Flickr"],"entity":[{"type":"Litecoin Project","content":"ORGANIZATION"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Charles Lee","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Lee","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"}],"hashtag":["Coinbase","Exchanges","Litecoin","startups","Hires","Charlie Lee","Wallets","Bitcoin","News","Companies","other-public-protocols"],"authors":["Danny Bradbury"]}