{"summary":"Developers gathered in Denver to discuss all things Ethereum: staking, DAOs and decentralized finance (DeFi).","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/02\/23\/tackling-ethereum-problems-at-ethdenver\/","publishDate":"2022-02-23T12:30:00","id":15695,"type":null,"title":"Tackling Ethereum Problems at ETHDenver","category":["Consensus Magazine (layer2)"],"content":["Attending ETHDenver this past weekend allowed me to gain insight into the frontline of DeFi, NFTs, DAOs and all the exciting parts of Ethereum that the industry loves. And it was also amazing to get a chance to see how developers were tackling problems at the core infrastructure level of Ethereum and its transition to proof-of-stake.","This article originally appeared in Valid Points, CoinDesk’s weekly newsletter breaking down Ethereum 2.0 and its sweeping impact on crypto markets. Subscribe to Valid Points here.","Running an Ethereum validator is not a household activity for most. The upfront cost of 32 ETH is now about $85,000, and it peaked at over $150,000 at the top of last year’s cycle. Furthermore, validators have to lock their ether for an unknown amount of time, adding further uncertainty to a rather large investment. This is not to say that nobody is interested in staking ether, as there are almost 300,000 active validators locking 8% of the ether supply.","In order to further the efforts in decentralization and security, Carl Beekhuizen, a member of the Ethereum Foundation’s research and development team, hosted a chat at ETHDenver to talk about the current landscape of Ethereum staking.","A significant chunk of validators are run by staking services that are hosted by crypto exchanges Coinbase and Kraken and by staking service provider Lido. While it's a rough estimate, 29.7% of validators were controlled or outsourced by Kraken and Lido alone. That statistic may not be overly concerning at the moment, but it would be largely positive for individual stakers to grow in size and take a larger market share. The shift to individual staking would benefit Ethereum by strengthening the network against regulatory pressures, improving client diversity and ensuring no large actors can collude to attack the network.","It’s tough to blame those using a staking service or even staking services themselves. Users get most of the incentives of staking (ETH rewards and securing the network) without the upfront expense of 32 ether. Meanwhile, staking services provide the technical knowledge needed for active validator management, and sometimes they even provide liquid staking through tokenized deposits. So how does the network encourage staking on the individual front?","Continued innovation around the Ethereum ecosystem has improved the staking experience, minimizing the drawbacks of self-staking without sacrificing decentralization. This is a different approach than the built-in disincentives that try to make outsized, large-scale staking not worth the underlying risk.","Beekhuizen took the stage this past weekend to dive into distributed validators and the potential for solutions like Secret Shared Validator Network and Obol. Distributed pools can break a validation key across several participants, and so each member in a group of four, for example, could hold a piece of the key that is useless without the rest of the group. Using this model, the group can create parameters for how many of the four stakeholders it would take to agree on attestations and block proposals, all while running the validator locally on different client software.","Running a distributed validator with multiple clients hedges against downtime and client bug risk, making the experience not only more accessible but also safer. The combination of harsher punishment for large staking providers and increasing accessibility for individual stakers could reverse current validation trends, but the user experience must continue to improve until Ethereum staking makes sense for everyone in the ecosystem.","The following is an overview of network activity on the Ethereum Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Valid Points incorporates information and data about CoinDesk’s own Eth 2.0 validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post.","You can verify the activity of the CoinDesk Eth 2.0 validator in real time through our public validator key, which is:","0xad7fef3b2350d220de3ae360c70d7f488926b6117e5f785a8995487c46d323ddad0f574fdcc50eeefec34ed9d2039ecb.","Search for it on any Eth 2.0 block explorer site."],"entity":[{"type":"Ethereum Beacon Chain","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"$150,000","content":"MONEY"},{"type":"Carl Beekhuizen","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"past weekend","content":"DATE"},{"type":"Secret Shared Validator Network","content":"ORGANIZATION"},{"type":"Valid Points","content":"ORGANIZATION"},{"type":"$85,000","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"29.7%","content":"PERCENT"},{"type":"Valid Points","content":"LOCATION"}],"hashtag":["Ethereum","Staking","Tech","Valid Points","The Protocol"],"authors":["Edward Oosterbaan"]}