{"summary":"The payments giant’s new stablecoin will compete with Tether's and Circle's coins, but it’s not breaking any new ground.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/07\/i-have-1m-questions-about-the-paypal-stablecoin-here-are-5\/","publishDate":"2023-08-07T17:06:02","id":15690,"type":null,"title":"I Have 1M Questions About the PayPal Stablecoin. Here Are 5","category":["Consensus Magazine"],"content":["So much for pausing development. On Monday morning, it was announced that global payments giant PayPal (PYPL) is launching PayPal USD (PYUSD), a U.S. dollar stablecoin fully backed by U.S. dollar deposits, short-term U.S. Treasuries and similar cash equivalents.","There are so many theories and ideas flying around about this, and so, naturally, I have one million questions about PayPal’s U.S. stablecoin. Here are five.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","There’s certainly regulatory uncertainty in the U.S., but PayPal is big enough to actually influence regulators. Take a moment to reflect on the companies, stakeholders and individuals who are complaining about onerous crypto regulation stateside. It’s crypto natives and companies like Coinbase (COIN) and Circle, which set up Centre Consortium to issue the second-largest stablecoin USDC.","Meanwhile, the entrenched powers, like BlackRock (BLK), laugh in the face of regulatory uncertainty. The message from the big players is, “Thanks for trailblazing, y’all, but this is how you apply the pressure back.”","Realistically, the most cynical and simplistic view of American enterprise applies here: PayPal, a for-profit institution that tries to make money, is issuing a stablecoin because it thinks it can make money issuing a stablecoin. It is not exactly a small undertaking — likely involving its risk, compliance, legal, partnership and communications teams — but it’s not altruistic.","This is a bit unclear at the moment. The potential uses and benefits for the average consumer for a truly decentralized U.S. dollar stablecoin are pretty supportable. With those, you have a borderless, (theoretically) uncensorable version of the world’s reserve currency that people excluded from traditional U.S. payment rails can use (like in, say, Argentina or Russia).","Fabulous. Cool.","But PayPal is rolling PYUSD out in the United States through Venmo. Venmo works only in the United States and requires a bank account to use. PYUSD use in Venmo is basically just another new way for banked Americans to transact with some digital representation of the U.S. dollar, which is basically how all PayPal products have operated since the company's founding.","See also: Matt Taibbi, PayPal's Deplatforming and the Case for Crypto | Opinion (2022)","That said, PYUSD will purportedly be able to be sent outside of PayPal’s walled garden over the Ethereum network. So perhaps individuals who are banned from using Venmo or PayPal in the United States could get their money off of PayPal via an Ethereum-based withdrawal of PYUSD.","In reality, PayPal would probably just not allow that (since, let’s face it, this stablecoin is not even pretending to be decentralized), but if getting frozen funds out of PayPal develops as a genuine use case for PYUSD, then the benefit of the virtuous cycle of an oppressive banking system will accrue to PayPal (and the consumer with the frozen funds).","Realistically, the use cases and benefits of PYUSD won’t apply to the consumer at all and will instead become some sort of wonky bank-end thing for financial institutions to exploit and use.","PayPal and Venmo make money as payment processors, but PYUSD lives in stablecoin land and we know stablecoin issuers make money differently. Stablecoin issuers hold interest-bearing instruments with customer funds and give none of the yield to their customers. The issuer takes the spread. Thanks to rising interest rates, PYUSD has become a viable product for PayPal to pursue.","And with PayPal explicitly saying it will hold T-bills, the PYUSD move is in the end unsurprising with our 20\/20 hindsight. Here’s a way to make money, so let’s make some money.","Here’s the big open question that I don’t have an answer for. Assuming PYUSD will be as popular as the hype around it suggests, Circle and Tether are in for some healthy competition.","From Circle’s perspective, a bigger company is coming for its crown as the “regulated” stablecoin and from Tether’s perspective a bigger company is coming for its crown as “the” stablecoin. Of course, the hype around PYUSD needs to be met with actual demand for this to change anything. That remains to be seen.","See also: Is PayPal Going to Fine You for Your Opinions? (2022)","As for a “digital dollar,” a hypothetical (and almost universally hated) Federal Reserve-issued central bank digital currency, or CBDC, here comes yet another dent against the retail version of the CBDC. Why would the U.S. government bother with a digital dollar when it could get a private enterprise to handle the logistics of payment flow and surveillance?","It wouldn’t.","Still, with all the fresh hype, some people maintain that this isn’t really much of anything. A tweet from Coin Center’s Neeraj Agrawal gets at this viewpoint indirectly:","Ask yourself: What is it that PayPal does now?","That’s right. PayPal lets people pay each other with a digital representation of a reserve of money held by the company. PYUSD isn’t new. This is just a new wrapper on the same old thing. Just another example of a big company latching onto a trend to make some more revenue to satisfy its fiduciary duty to shareholders.","Edited by Daniel Kuhn."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Centre Consortium","content":"ORGANIZATION"},{"type":"Venmo","content":"LOCATION"},{"type":"Neeraj Agrawal","content":"PERSON"},{"type":"Matt Taibbi","content":"PERSON"},{"type":"Argentina","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","PayPal","Stablecoin","The Node","Newsletters","top news"],"authors":["George Kaloudis"]}