{"summary":"Brian Beute is running for office under the pro-tech political party founded by Andrew Yang. While not a supporter of crypto, his story shows crypto — now a widespread phenomenon — might be on the ballot in even the smallest elections.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/18\/how-a-crypto-fraud-gave-florida-its-first-forward-party-candidate\/","publishDate":"2023-10-18T21:40:43","id":15696,"type":null,"title":"How a Crypto Fraud Gave Florida Its First Forward Party Candidate","category":["Consensus Magazine"],"content":["Brian Beute had never personally encountered the world of politics, scandal and corruption before he decided to run for local office in 2019. He was even less familiar with cryptocurrency and blockchain.","This article is part of State of Crypto Week.","And who could blame him? Under normal circumstances, a race for county tax collector does not make headlines of any kind. It rarely involves presidential advisors, national representatives or prolific criminals with illicit bitcoin mining equipment.","But this was not a normal race.","While Beute worked as a music teacher at a local school, his future opponent flew to Miami with influential Republicans, used public money to build a crypto mine on government property and helped traffic minors for sex work.","A conservative from Michigan, Beute moved to Florida and noticed how systems of legacy finance were manipulated for the profit of powerful land developers and politicians.","As controversy about the incumbent tax collector trickled out to the public, Beute declared himself for the election. The consequences of that decision are still reverberating through Beute’s life today.","He was a Republican before vowing earlier this month to help clean up corruption as election supervisor and the first candidate for the Florida Forward Party, a centrist organization founded by former presidential candidate and pro-crypto booster Andrew Yang.","See also: A Tech-Bro Like Us","This is the story of how that local Republican primary challenger became the first candidate for an emerging third party; a story that shows how disruptive technology can have unexpected effects on existing systems and how growing discontent among moderates could change the trajectory of American politics.","In his first campaign, Beute challenged now-convicted cryptocurrency fraudster Joel Greenberg in the 2019 Republican primary election for tax collector in Seminole County, Florida. Beute was motivated to run by the rumors about Greenberg’s illicit crypto mining and other abuses of power (which embroiled U.S. House Rep. Matt Gaetz [R.-Fl] in a scandal).","Greenberg began acquiring cryptocurrency in 2017, later borrowing money from family members to replace public funds that he commingled with his own. He requested more and more public funds for the purchase of crypto and $90,000 in mining equipment, which was eventually lost in a fire.","He also created a mysterious corporate entity called “Government Blockchain Systems LLC,” which had only the tax collector’s office as a client, and hired a convicted real-estate scam artist named Keith Ingersoll to acquire property for the office. This employee, Ingersoll had connections to a fraudulent $15 million initial coin offering scheme called Organic Fresh Coin, which never publicly distributed a digital asset.","With these connections in mind, perhaps it would come as no surprise that within the first week of Beute’s candidacy, Greenberg launched a retaliatory campaign designed to smear his opponent's reputation. Greenberg and associates sent emails and letters to the school falsely accusing the music teacher Beute of sexual misconduct with students.","Just as rumors of Greenberg's malfeasance convinced Beute to run to replace the tax collector, it was Greenberg's false rumors about his opponent that kickstarted the process that landed him behind bars. The county sheriff found Greenberg’s fingerprints on letters sent to Beute's employer, which helped set off the cascade of charges and litigation that eventually fell around the tax collector.","Beute stayed in the primary race, hamstrung by accusations at first and then unable to participate fully in local media around the primary because of ongoing investigations. He eventually lost to J.R. Kroll, who went on to replace Greenberg as tax collector in the general election.","In time, Greenberg pleaded guilty to six counts related to his crimes while in office, one of which convicted him for making false accusations against Beute. In 2022, Greenberg was sentenced to 11 years in prison. The scale of the operation was so vast that Greenberg’s sentencing was delayed repeatedly while investigators pursued his connections to other crimes.","Though three years have passed since Greenberg resigned, those who held significant positions in his tax office are still active in Florida politics, including Beute’s Republican opponent Chris Anderson, the incumbent supervisor of elections for Seminole County.","Last month the Forward Party announced a 12-state battleground map that included Florida. Forward Party managing director Joel Searby told me they are looking for more party switchers like Beute.","“The Forward Party is an incubator for independents and moderates who genuinely care about discussing, designing and delivering consensus solutions outside of the current political structure,” Beute said, adding that his decision was not just about breaking with Republicans but a rational response to polling.","A 2022 Gallup poll showed that 60% of voters believe that a new party is necessary. In Seminole County, third-party registration is up compared to the two major parties. As Republicans’ grasp on Florida politics has tightened, more moderate voters may have felt stranded in the center by shifts in the political landscape.","Whether or not an organization like the Forward Party can represent a meaningful pole of political power in the U.S., voters are sympathetic to voices beyond the traditional two-party system.","And while Joel Greenberg’s cryptocurrency fraud helped motivate the Florida Forward Party’s first candidate to get involved in politics, leadership has been friendly with the industry in the past.","See also: Andrew Yang Is Raising $1.5M for a Company That Plans to Reward People With Crypto","Andrew Yang said in 2021 that the Forward Party would be the “crypto party.” The former presidential candidate released a non-fungible token (NFT) to help launch the Forward Party, saying that digital assets and crypto were strongly aligned with the organization's goals. Yang was involved with a crypto venture as recently as last September.","Searby said, “While we don’t take official positions for or against cryptocurrency or any particular type of crypto, we support and cheer innovators.”","Yang’s political messaging has always emphasized the integration of innovative technologies that change the way people work and live. Beute’s story shows that for better or for worse that change is already happening.","Rest assured the Joel Greenbergs of the world are still out there, mixing traditional political power with the promise of innovative new technology, concocting a fraudulent brew to further enrich themselves.","“As it stands, I view cryptocurrencies with a great deal of skepticism as do most people that I know,” Beute said. “Fortunately, the Forward Party is a place where differences of opinion are observed and embraced.”","The inertia of the two-party system is built into American politics. And while parties came and went in the early republic, the modern cartel has prevailed since before the Civil War.","Forward Party members and supporters will hope there is a critical mass of people who, like Brian Beute, no longer believe that a better world can be made this way."],"entity":[{"type":"$1.5","content":"MONEY"},{"type":"Beute","content":"PERSON"},{"type":"State of Crypto Week","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Forward Party","content":"ORGANIZATION"},{"type":"Miami","content":"LOCATION"},{"type":"Greenberg","content":"ORGANIZATION"},{"type":"Company That Plans to Reward People With Crypto","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"Government Blockchain Systems LLC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Tech","content":"ORGANIZATION"},{"type":"Chris Anderson","content":"PERSON"},{"type":"Joel Greenberg","content":"PERSON"},{"type":"Greenberg","content":"PERSON"},{"type":"$90,000","content":"MONEY"},{"type":"Joel Greenbergs","content":"PERSON"},{"type":"The Forward Party","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"Florida Forward Party","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Seminole County","content":"LOCATION"},{"type":"J.R. Kroll","content":"PERSON"},{"type":"Michigan","content":"LOCATION"},{"type":"Ingersoll","content":"ORGANIZATION"},{"type":"Keith Ingersoll","content":"PERSON"},{"type":"Joel Searby","content":"PERSON"},{"type":"Andrew Yang","content":"PERSON"},{"type":"Brian Beute","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"Beute","content":"ORGANIZATION"},{"type":"Searby","content":"PERSON"},{"type":"Matt Gaetz","content":"PERSON"}],"hashtag":["Opinion","Fraud","Florida","Politics","State of Crypto Week 2023"],"authors":["Michael Spencer"]}