{"summary":"The CMI brings a clarity of vision that was previously lacking from the sprawling, opaque, poorly categorized crypto economy.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/09\/13\/ordered-chaos-why-the-coindesk-market-index-matters-for-the-new-economy\/","publishDate":"2022-09-13T21:18:36","id":15698,"type":null,"title":"Ordered Chaos: Why the CoinDesk Market Index Matters for the New Economy","category":["Finance"],"content":["For a viable capital market to form around a nascent industry, investors need a standardized, broad-based benchmark against which to measure and assess performance. Without it, they are flying blind.","With the newly launched CoinDesk Market Index (CMI), CoinDesk Indices (CDI) is seeking to resolve that challenge for investors in digital assets. The CMI brings a clarity of vision that was previously lacking from the sprawling, opaque, poorly categorized crypto economy.","There’s a reason a trusted index had not yet arisen for crypto. A technology with huge potential to disrupt multiple sectors and a dizzying array of projects (of sometimes dubious quality) requires detailed, rigorous analysis to define and weight the various constituents of an appropriate index.","For one, because the services and use cases of the decentralized crypto economy don’t easily match the framework of the old, centralized one, there are significant challenges simply to categorize the many digital assets in the market. Identifying the different digital asset sectors and determining which assets belong to each one requires clear-headed analysis and consistently applied rules.","Secondly, the market data needed to compile the index constituents is not always reliable. Rogue actors – who may be incentivized to distort prices and volumes – are uniquely empowered via pseudonymity to use strategies such as wash trading to do so. There’s also a lot of inconsistency across the many exchanges around the world that list the same assets but under very different regulatory and operational frameworks.","With the CMI, the CDI team has tackled both challenges head on.","The first has been addressed by CoinDesk’s groundbreaking Digital Assets Classification Standard (DACS), the first of its kind, launched back in December. Under the DACS, more than 500 of the largest digital assets have each been assigned to an industry defined by its technology and use case. Currently, each digital asset is assigned to one of 36 industries, and each industry is assigned to one of 23 industry groups. Finally, each industry group is placed within one of six distinct sectors: currency, smart contract platforms, decentralized finance (DeFi), culture & entertainment, computing, and digitization.","This consistently applied framework is the foundation for the CoinDesk family of market benchmarks. There, the broad CMI is accompanied by six subindices representing the six DACS sectors, along with an ex-stablecoins market index and an ex-stablecoins currency index, both of which limit the influence of market movements to tokens that are intended to rise or fall versus the U.S. dollar.","The CMI family can be used in a variety of ways. The broad market index can be a single proxy for the entire investable crypto asset class, helping traditional investors decide how much of their portfolio to allocate to digital assets. It can also allow observers to assess active fund managers’ performance relative to that benchmark.","Drilling down, investors can use the subindices to rank different sector-focused funds – funds purely focused on bitcoin, for example, or on smart contract platforms such as Ethereum and Solana. Or those same subindices can be used as part of a sector rotation strategy or to help determine the nuanced sector-by-sector allocations of an effective, diversified, cross-crypto investment strategy.","As for the challenge of data integrity, CoinDesk is uniquely positioned as the market leader with the most experience working with the challenging crypto data set. In November 2014, the CoinDesk Bitcoin Price Index (XBX) was launched as the first-ever crypto index. Since then it has been reliably calculating every second of bitcoin’s pricing through pitfalls of variable data.","Given the number of exchanges supplying bitcoin prices, a methodology and tech stack designed to expel unreliable variant data was designed to provide a trustworthy price.","CDI’s Single Digital Asset Price Index Methodology (PDF) has proven through time to withstand the volatility and anomalies enough to support approximately 75% of the assets under management across all crypto tracking products","When it comes to the CMI, the knowledge gained from evaluating exchanges and data helps maintain the integrity to create a broad-based index that makes sense for the market. The index’s methodology narrows the DACS digital asset universe – down from more than 500 to currently 148 – by imposing the following criteria on tokens’ eligibility: First, they must be classified in the latest DACS report; second, they must be listed on at least two of CoinDesk’s carefully vetted list of eligible exchanges for a minimum of 30 days; and third, they must be available for CoinDesk Indices to apply its reference price calculation, which occurs approximately every five seconds and uses a volume-weighted average price (VWAP) from at least two contributing exchanges over the prior 60 minutes.","The constituents that meet these requirements are then weighted by market capitalization. The CMI index family is calculated in real-time using reference rates for each asset. The index is reconstituted and rebalanced monthly.","As asset managers and other service providers license these indices to offer specialized investment vehicles designed to mimic or contrast with the indices’ performance, we foresee an interconnected environment in which different providers of liquidity arise on both sides of each trade.","The DACS-powered CMI is more than a much-needed tool for digital asset investors, however. It is a critical lens through which to observe the larger crypto economy.","The CMI brings structure to the process by which investors define and value the myriad digital assets in existence, bringing order to the otherwise chaotic world of crypto. As such, we see the CMI as a narrative device, a means by which to describe a more cohesive picture of the crypto economy, a framework with which to talk about, assess, and compare the many tokens, protocols, and dApps that comprise it.","Just as the Dow Jones Industrial Average helped define American capitalism within the centralized paradigms of the 20th century, the CMI can help frame the 21st century’s emerging decentralized digital economy in which people exchange currency, property, services and data peer to peer, without the intervention of middlemen.","That’s why it’s especially appropriate that CoinDesk, the leading media organization for the crypto and blockchain community, is driving this effort to advance the CMI. As a trusted chronicler of that economy’s evolution, CoinDesk Media is not only best placed to objectively determine the elements of this new narrative device, it can use this storytelling tool to bring clarity to the evolution of crypto technology in the public interest."],"entity":[{"type":"November 2014","content":"DATE"},{"type":"CDI","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"CoinDesk Media","content":"ORGANIZATION"},{"type":"21st century","content":"DATE"},{"type":"20th century","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"CMI","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"DACS","content":"ORGANIZATION"}],"hashtag":["Indices","Data"],"authors":["Jodie Gunzberg","Michael J. Casey"]}