{"summary":"Jodie Gunzberg, managing director of CoinDesk Indices, and Neudata's Nicholas Neary discuss the emerging crypto data sector.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/09\/20\/neudata-and-coindesk-indices-discuss-crypto-data-and-digital-assets\/","publishDate":"2022-09-20T17:24:14","id":15709,"type":null,"title":"Neudata and CoinDesk Indices Discuss Crypto Data and Digital Assets","category":["Markets"],"content":["Though a relatively new asset class, interest in crypto data has ramped up significantly over the past few years, with many new crypto data vendors entering the alternative data space. Neudata sat down with Jodie Gunzberg (JG), managing director of CoinDesk Indices, and Nicholas Neary (NN), research analyst at Neudata, to discuss the past and future of the emerging sector.","When did you begin to see more interest from institutional investors in crypto data?","JG: We began to see interest in as early as 2014 for bitcoin price data, then we saw growing interest in data on ether and for a few other of the largest tokens at the time. However, the significant institutional growth in interest and demand for crypto data happened in 2020 during the [coronavirus] pandemic crash when most assets were falling together with a global, massive economic stimulus in response. This is when many of the characteristics like volatility, liquidity, volume, valuation techniques, use cases, and increased regulatory interest indicated the emergence of digital assets as a new asset class.","NN: Neudata began to see an influx in interest for crypto data among its institutional investor clients in late 2020 and early 2021. Drawing parallels, this spike in attention coincided with bitcoin attempting\/breaching its all-time high of 2017 (roughly $20K).","How have investor preferences for crypto data changed over time?","JG: In the beginning, bitcoin price data was most highly demanded. Then, as investors were looking to explore deeper, other data related to transactions (value, count, size, speed), blocks (size and fees), mining difficulty and hash rates became more interesting. As the technology evolved beyond bitcoin and its use case, investors demanded more information about the digital assets available including price but also more information about liquidity and size generally represented by volume and market capitalization.","NN: On-chain data (from the blockchain networks themselves, including details of the blocks and details of transactions) is in the spotlight a little more now. In comparison, market\/exchange data (tick-by-tick trade data, order book data, liquidity measures, exchange rate, etc.) and other approaches based on technical analysis or sentiment were previously more popular.","Which types of crypto data have become more popular in recent months?","JG: As the use cases of digital assets have grown so that various industries, industry groups and sectors can be defined, data pertaining to the categorizations have been popular. The index-level data, constituents and weights are increasingly requested. Single-asset price index data is valuable for its history and algorithm to reduce the impact of outliers. As the market matures there has been less concern about large outliers so single-asset pricing requirements are diminishing.","NN: We have seen continued interest in all areas of crypto. However, in recent months we have identified an increase in the number of on-chain analytics providers. We believe we are seeing this trend due to the crypto winter, where indicators of network growth among crypto projects are important to track.","What does the future of crypto data look like?","JG: In the future, I expect more demand for on-chain data as analyzing, finding and constructing index strategies with fundamental factors become more popular. With that, a greater discovery may take place in identifying specific factors for certain digital asset sectors, industry group and industries. Though the demand for technical data will likely remain strong, the fundamental, on-chain data should grow in popularity.","NN: It's a hard question to answer. We think the right approach is to consider what the future of crypto itself will look like:","Legal and regulatory-risk data could become more prominent as regulators take a closer look at stablecoins and cryptocurrencies. We may also see new datasets that track payment flows from users’ wallets to corporations’ wallets to shine a light on consumer spending.","To hear more from Jodie and the Neudata team on these topics and more, join Neudata’s Data Summit in San Francisco on September 28th. CoinDesk readers can register here and enjoy £150 off the listed ticket price when using the promo code: NEUDATACOIN22","Disclaimer:","CoinDesk Indices, Inc. (“CDI”) does not sponsor, endorse, sell, promote or manage any investment offered by any third party that seeks to provide an investment return based on the performance of any index.","CDI is neither an investment adviser nor a commodity trading adviser and makes no representation regarding the advisability of making an investment linked to any CDI index. CDI does not act as a fiduciary. A decision to invest in any asset linked to a CDI index should not be made in reliance on any of the statements set forth in this document or elsewhere by CDI.","All content contained or used in any CDI index (the “Content”) is owned by CDI and\/or its third-party data providers and licensors, unless stated otherwise by CDI. CDI does not guarantee the accuracy, completeness, timeliness, adequacy, validity or availability of any of the Content. CDI is not responsible for any errors or omissions, regardless of the cause, in the results obtained from the use of any of the Content. CDI does not assume any obligation to update the Content following publication in any form or format."],"entity":[{"type":"2014","content":"DATE"},{"type":"Neudata","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"CDI","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"September 28th","content":"DATE"},{"type":"Jodie","content":"PERSON"},{"type":"Neudata","content":"LOCATION"},{"type":"winter","content":"DATE"},{"type":"Neudata’s Data Summit","content":"ORGANIZATION"},{"type":"Jodie Gunzberg (JG)","content":"PERSON"},{"type":"CoinDesk Indices, Inc.","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"$20K","content":"MONEY"},{"type":"Nicholas Neary","content":"PERSON"}],"hashtag":["Ether","no-livewire","Indices"],"authors":["CoinDesk Indices"]}