{"summary":"Scott Sunshine discusses how advisors can leverage blockchain-based governance to enhance trust, improve accountability, streamline operations and unlock new investment opportunities for their clients.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/04\/crypto-for-advisors-governance-in-a-blockchain-world\/","publishDate":"2024-04-04T15:45:00","id":15704,"type":null,"title":"Crypto for Advisors: Governance in a Blockchain World","category":["Finance"],"content":["Transparency is considered one of the key value propositions public blockchains can offer in financial services. In today's main article, Scott Sunshine of Blue Dot Advisors shares his thoughts on financial governance in a blockchain world.","In Ask an Expert, Cato Fel치n III from La Hoja Capital Partners explains how bitcoin is used as collateral in structured credit portfolios.","Happy reading.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","In today's rapidly evolving financial landscape, the adoption of blockchain technology is revolutionizing traditional corporate governance practices. This innovative technology offers a transparent, immutable and decentralized platform that can significantly benefit financial advisors’ clients. By leveraging blockchain-based governance, financial advisors can enhance trust, improve accountability, streamline operations and unlock new investment opportunities for their clients. Here's how:","Transparency as the New Gold Standard","One of the most compelling advantages of blockchain technology is its ability to provide unparalleled transparency. Blockchain creates an interference-proof ledger that records all corporate actions and transactions, making it easier for financial advisors to verify information and trust the companies they invest in. This increased transparency can lead to greater confidence in investment decisions, reduce the risk of fraud or mismanagement and ultimately strengthen the relationship between financial advisors and their clients.","Corporate Accountability and Performance in a New Digital Era","Blockchain's immutable nature ensures that once a transaction is recorded, it cannot be altered or deleted without consensus from the network. This feature promotes accountability among executives and board members, as all actions and decisions are permanently recorded and traceable. Companies that prioritize good governance practices, facilitated by blockchain technology, are more likely to perform well over the long term. This performance can translate into higher returns and reduced investment risk for clients, making it a win-win situation for both financial advisors and their clients.","Democratized Decision-Making and Shareholder Engagement","Blockchain platforms can facilitate direct participation in voting and governance activities, allowing clients to have a more active role in the companies they invest in. This democratization of decision-making can lead to better-aligned corporate strategies, more responsive management practices, and ultimately, a more robust and resilient investment portfolio for clients leading to better investment outcomes.","Streamlined Operations and Cost Efficiency","Blockchain technology can automate and streamline various governance processes, reducing administrative costs and improving operational efficiency. Smart contracts, which are self-executing contracts with terms directly written into code, can automate routine tasks such as compliance monitoring, dividend distribution, and proxy voting. By eliminating manual intervention and reducing administrative overhead, financial advisors can pass on these cost savings to their clients through lower fees, better investment opportunities or higher returns on investment.","Enhanced Security and Data Protection","Security is a top priority in the financial industry, and blockchain technology offers robust solutions to protect sensitive client data and investment information. Blockchain's cryptographic algorithms and decentralized architecture make it highly secure against tampering and unauthorized access. By storing data on a blockchain, financial advisors can enhance data protection, reduce the risk of data breaches and identity theft, and comply with stringent data privacy regulations, providing clients with peace of mind.","Regulatory Compliance and Risk Mitigation","Navigating complex regulatory landscapes can be challenging for financial advisors. Blockchain technology can help by providing real-time transparency, traceability, and auditability, making it easier to demonstrate compliance with laws and regulations. This enhanced compliance monitoring can mitigate regulatory risks, facilitate smoother interactions with regulatory authorities, and ensure that clients' investments comply with legal requirements, protecting both financial advisors and their clients from potential legal pitfalls.","In conclusion, corporate governance practices in a blockchain world offer significant benefits to financial advisors’ clients. From enhanced transparency and trust to improved accountability, streamlined operations, enhanced security, and regulatory compliance, blockchain technology is revolutionizing the way financial advisors and their clients interact and collaborate. By embracing blockchain-based governance solutions, financial advisors can better serve their clients' interests, help them achieve their financial goals, and build stronger, more resilient investment portfolios for a prosperous and sustainable future.","- Scott Sunshine, managing partner, Blue Dot Advisors","Question: How do managers use bitcoin collateral in their real estate lending portfolios?","Bitcoin is used in a hybrid collateral model where loans are underwritten based on the value of the real estate asset and a portion of bitcoin to be purchased with loan proceeds, thus creating two collateralized assets to secure the loan.","Question: Why would a borrower want to do that?","These hybrid loans are designed for borrowers who already participate in bitcoin and are comfortable with the asset. The bitcoin is held in a joint partnership between lender and borrower, with both parties benefiting from the asset’s long-term appreciation.","Question: How does this affect portfolio risk?","This is a new model, the risk of which is still being assessed. Managers who engage this strategy rely on the macro trend of bitcoin price appreciation despite historical periods of short-term volatility. Managers analyze bitcoin’s cyclical price performance to guide portfolio management and increase returns as bitcoin price reaches certain thresholds. There is some decrease in traditional credit risk as bitcoin’s growth potential allows managers to abstain from using traditional levers to increase return, mainly the use of leverage and adding riskier, higher-interest loans to the portfolio.","- Cato Fel치n III, managing partner, La Hoja Capital Partners","BlackRock’s tokenized USD Institutional fund (BUIDL) has registered over $240 million in deposits since its recent debut.","CryptoQuant CEO says bitcoin miners are selling before the halving to acquire more equipment.","FTX ex-CEO Sam Bankman-Fried was handed a 25-year sentence in US Federal Court last week.","\n"],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Risk Mitigation","content":"ORGANIZATION"},{"type":"Blue Dot Advisors","content":"ORGANIZATION"},{"type":"La Hoja Capital Partners","content":"ORGANIZATION"},{"type":"Cato Fel치n III","content":"PERSON"},{"type":"Scott Sunshine","content":"PERSON"},{"type":"Data Protection","content":"ORGANIZATION"},{"type":"$240 million","content":"MONEY"},{"type":"US Federal Court","content":"ORGANIZATION"},{"type":"Scott Sunshine of Blue Dot Advisors","content":"ORGANIZATION"},{"type":"Cato Fel치n III","content":"ORGANIZATION"},{"type":"Cost Efficiency","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","Governance"],"authors":["Sarah Morton","Scott Sunshine"]}