{"summary":"Creditors with $2.4 billion in claims against the bankrupt crypto lender could scupper an agreement made after months of wrangling.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/08\/30\/genesis-lender-group-opposes-wholly-insufficient-dcg-deal\/","publishDate":"2023-08-30T09:43:36","id":15707,"type":null,"title":"Genesis Lender Group Opposes ‘Wholly Insufficient’ DCG Deal","category":["Finance"],"content":["A tentative deal struck between defunct lender Genesis Global Capital (GGC) and parent company Digital Currency Group (DCG) faces opposition from a group of creditors who described in a Tuesday filing the treatment of over a billion dollars in outstanding loans as “wholly insufficient.”","Genesis' lending arm GGC filed for bankruptcy in January after a double whammy from the collapse of hedge fund Three Arrows Capital and crypto exchange FTX. The wind-up has been delayed for months by talks over the contribution that DCG should make.","An in-principle deal announced by Genesis on Tuesday saw DCG – which is also CoinDesk’s parent company – agreeing to a series of partial repayments to satisfy liabilities of $630 million in unsecured loans due in May 2023 and $1.1 billion due in 2032.","That hasn’t pleased everyone.","“DCG’s contribution to the estate in satisfaction of creditor claims is wholly insufficient to satisfy even the uncontested loan amounts due, let alone, the valuable estate claims assertable by creditors against DCG and its directors and officers, including Barry Silbert,” a group of Genesis lenders said in a filing to the Bankruptcy Court in the Southern District of New York.","The lenders took exception to DCG and CEO Silbert being released from future legal claims, and threatened to block any final bankruptcy deal that incorporated the plans.","The filing accused Genesis and a formal committee that represents creditors of neglecting their fiduciary duty to maximize recoveries by agreeing to the DCG deal. Membership of the ad hoc lenders’ grouping has not been made public, but the filing says they have a combined $2.4 billion in claims against GGC, including a majority of each class of claims asserted against it.","In the Tuesday filing that announced the deal, Genesis said it could result in recoveries of 70%-90% for unsecured creditors, and said that “constructive discussions” were ongoing with the lenders’ grouping.","Neither Genesis nor DCG had responded to a CoinDesk request for comment by publication time.","Edited by Sheldon Reback."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"90%","content":"PERCENT"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Bankruptcy Court","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"2032","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"GGC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"$630 million","content":"MONEY"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Genesis","content":"PERSON"},{"type":"$1.1 billion","content":"MONEY"}],"hashtag":["Regulations","Genesis","Digital Currency Group","Bankruptcy","Genesis global capital"],"authors":["Jack Schickler"]}