{"summary":"The zkEVM test network will be the first of its kind and could change the Ethereum scaling landscape in the near future.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/02\/24\/ethereum-gets-an-upgraded-scaling-testnet-and-its-actually-years-ahead-of-schedule\/","publishDate":"2022-02-24T23:07:37","id":15706,"type":null,"title":"Ethereum Gets an Upgraded Scaling Testnet – And It's Actually Years Ahead of Schedule","category":["Technology"],"content":["zkSync, a protocol responsible for implementing Ethereum scaling platforms, accomplished the unexpected yesterday, announcing the test network release of an Ethereum Virtual Machine compatible Zero-Knowledge rollup (zkEVM) years ahead of schedule.","The EVM is the environment in which all Ethereum wallets and contracts live and is responsible for defining the rules of the chain from block to block. The new test network is the first implementation of a ZK rollup capable of running the full Ethereum environment and will provide great insight into how capable zero-knowledge technology is at scaling blockchains.","Over the past couple of years, Ethereum rollups have taken two different directions in scaling the base layer, categorized as Optimistic and Zero-Knowledge. Both technologies have seen some level of adoption, with Arbitrum being the most notable Optimistic chain and DyDx taking advantage of ZK technology for its leveraged trading application. Like DyDx, ZK rollups have historically focused on offering a single type of application per chain, because the full Ethereum environment that offers customizable smart contracts would be too computationally extensive.","Read more: Ethereum Rollups Aren't All Built the Same","Until now, trade-offs tended to favor Arbitrum and Optimism; now zkSync has the opportunity to level the playing field. Optimistic Rollups are currently able to offer a single, composable environment in which users can use applications ranging from NFT marketplaces like OpenSea to lending protocols like Aave on mainnet. zkEVM would create a similar end experience for users, with cheaper transaction fees and nearly immediate finality, removing the need for the two-week withdrawal periods associated with Optimistic rollups.","ZK rollups are more computationally extensive and put a burden on nodes looking to solve zero-knowledge validity proofs, but they are able to post network state to Ethereum for a fraction of the cost of even Optimistic Rollups. zkSync and Loopring currently offer transaction fees 1\/200th of the price on mainnet, according to L2Fees.Info. At the time of writing, a trade on a decentralized exchange would cost users on Ethereum’s base layer just over $90, while Loopring and zkSync users would pay between $0.45-$0.68.","If zkEVM is capable of offering fees similar to other ZK rollups, Ethereum’s scaling issues may be mitigated earlier than expected. Ethereum native applications will be able to manageably port over Solidity-based contracts and offer a full range of products in a cheap fee environment backed by Ethereum’s security. While lower transaction fees are an essential piece of scaling blockchains, it only matters if the chain can play host to applications that drive user demand. zkEVM will theoretically be able to host the industry's favorite applications without sacrificing liquidity, decentralization or product offering."],"entity":[{"type":"$0.45","content":"MONEY"},{"type":"$0.68","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Solidity","content":"LOCATION"},{"type":"$90","content":"MONEY"}],"hashtag":["Ethereum","Scalability","layer 2","ZK rollups"],"authors":["Edward Oosterbaan"]}