{"summary":"Kentucky is the fifth state to allege BlockFi Interest Accounts are securities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/07\/30\/kentucky-orders-blockfi-to-stop-signing-up-new-interest-accounts\/","publishDate":"2021-07-30T23:06:53","id":15702,"type":null,"title":"Kentucky Orders BlockFi to Stop Signing Up New Interest Accounts","category":["Markets"],"content":["","The Kentucky Department of Financial Institutions has become the fifth state regulator to claim that BlockFi's interest service violates state securities laws.","","","Kentucky's Division of Securities ordered the crypto lender to stop opening new accounts in the Bluegrass State. Kentucky joins Alabama, New Jersey, Texas and Vermont in alleging that BlockFi Interest Accounts (BIAs) violate state securities laws.","","","\"'BlockFi’s website offers cryptocurrency lending and borrowing services through ‘BlockFi Interest Accounts’ (BIAs) advertised on its website. Through these accounts, investors may deposit certain cryptocurrencies with the company in exchange for a specified interest rate.' The company has accepted nearly $15 billion in these accounts from investors,\" the regulator said in a press release.","","","In response, BlockFi announced it would \"immediately\" stop signing up new customers in Kentucky.","","","Existing customers remain unaffected. Kentucky joins Texas in filing for a cease-and-desist order, while Alabama, New Jersey and Vermont have filed \"show-cause\" orders.","","","The company has come under fire on allegations that BIAs violate securities laws because customers pool their funds with the company, which then lends them to generate profit.","","","BlockFi has maintained that in its view, BIAs don't violate securities laws in any of the states it operates in.","","","Many of the state regulators pursuing allegations against BlockFi have given the company an opportunity to provide evidence in support of its claim. New Jersey has given BlockFi until the beginning of September to respond, while Texas securities regulators have a hearing scheduled for early October.","","","Despite its regulatory woes, the company is still pursuing a $500 million Series E funding round ahead of a possible initial public offering, according to documents reviewed by CoinDesk. While the round was expected to close earlier this week, it's unclear whether it has done so.","","","UPDATE (July 30, 2021, 23:40 UTC): Clarifies that while Kentucky is only the second state to file a cease-and-desist against BlockFi, while three other states filed show-cause orders.",""],"entity":[{"type":"Kentucky Department of Financial Institutions","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"Kentucky's Division of Securities","content":"ORGANIZATION"},{"type":"July 30, 2021","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Vermont","content":"LOCATION"},{"type":"Kentucky","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"Alabama","content":"LOCATION"},{"type":"Bluegrass State","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["BlockFi","Crypto Lending","Kentucky","State Regulators"],"authors":["Nikhilesh De"]}