{"summary":"MoonPay has been brokering big ticket NFT purchases for celebrity clients since November.\nNow, its CEO is planning to give away a personal collection worth more than $1 million to charitable causes.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138205\/moonpays-ceo-has-a-new-plan-for-drumming-up-nft-hype-donating-them","publishDate":"2022-03-17T10:01:24","id":1571,"type":null,"title":"MoonPay&#x27;s CEO has a new plan for generating NFT hype: donating them","category":["NFTs"],"content":["MoonPay’s CEO Ivan Soto-Wright is a man of many theses.","One, he explains over a video call, is that all value will eventually move via blockchains. Another is that every artist, musician, and athlete will adopt non-fungible tokens (NFTs).","Through a recently launched <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjHufaz7sz2AhW1xzgGHd-MABoQFnoECAMQAQ&amp;url=https%3A%2F%2Fwww.theblockcrypto.com%2Fpost%2F125483%2Fmoonpay-concierge-celebrities-nft&amp;usg=AOvVaw0i7uAAgbHl7hao5cAvnldJ\" data-v-f87c67ca=\"\">concierge service<\/a> that helps celebrities and the super-rich buy NFTs, Soto-Wright has tried to position MoonPay as a catalyst for those trends.","The service — which counts Snoop Dogg, Diplo and Jimmy Fallon among glitzy group of clients — is part one of a plan to force NFTs into what Soto-Wright calls “the cultural consciousness.”","Now, Soto-Wright is kicking off phase two of that plan: charity.","Through <a href=\"https:\/\/opensea.io\/ivanhodl?embed%5b0%5d=%22acxzzzzzzzzbbbccccdddeeexca%22.replace%28%22z%22%2C%22o%22%29&amp;embed%5b1%5d=stryking\" data-v-f87c67ca=\"\">a personal account<\/a> on NFT platform OpenSea named ivanhodl, Soto-Wright has amassed upwards of $1 million in digital art and collectibles — including pieces from coveted collections like CryptoPunks, Bored Ape Yacht Club, World of Women and Clone X.","“I have decided to dedicate all my NFTs and any profits from sales of my NFTs from ivanhodl to charitable causes,” he says. “The idea is to broaden and diversify access to web3. It’s about giving back, it’s about focusing on efforts that do good in the world.”","Soto-Wright appears to have amassed his personal collection in less than a year, having set up the ivanhodl wallet on OpenSea in June 2021. He has MoonPay — which at its core helps other companies’ customers to buy and sell crypto — to thank for it. &nbsp;&nbsp;","“I did have my own proceeds from MoonPay being profitable,” he says. “I was running the business and so I used that profitability to then invest in NFTs through ivanhodl.”","It is not yet clear which causes Soto-Wright plans to donate his stash to. He says a range of causes will be selected, and listed museums, non-profits and charities as examples of potential partners.","The hope seems to be that through auctions and other such theater, the donation program will help to drum up wider interest in the NFT market. There is no specific timeframe in place. Instead, Soto-Wright described the initiative as “continuous.”","“I’ve never really sold an NFT. I’ve transferred or given away NFTs, but I’ve never sold an NFT in my history. That’s why I’m ivanhodl — I’m holding on for dear life,” he adds. “But now we’re holding on for dear life until we benefit non-profit causes.”","MoonPay’s concierge service has certainly helped bring considerable star power — and with it hype — to the NFT space. But some <a href=\"https:\/\/www.theverge.com\/2022\/2\/10\/22926057\/celebrity-nft-disclosure-marketing-reese-witherspoon-gwyneth-paltrow\" data-v-f87c67ca=\"\">have questioned<\/a> whether celebrities are in fact paying full whack for their digital goods, or simply promoting collections in exchange for a novel kind of payment. &nbsp;&nbsp;&nbsp;","For his part, Soto-Wright has always maintained that clients of his concierge are invoiced for the full amount of any purchases — and that they pay up.","“There’s no interrelationship with the collection. These people are coming to us independently and saying they want to buy something, and the concierge facilitates that,” he says.","Either way, Soto-Wright's NFT dealing has seen him caught on camera schmoozing such music industry moguls as <a href=\"applewebdata:\/\/956A1B9F-5EFD-485A-A693-54FDA1310D38\/%E2%80%9CIt%20really%20has%20happened%20organically.%20One%20person%20finds%20out%20and%20basically%20they%20tell%20other%20people,%20and%20all%20of%20these%20people%20are%20friends,%20right?%20And%20that%E2%80%99s%20kind%20of%20what%E2%80%99s%20happened.%E2%80%9D%20%20%20%20%20And%20they%20all%20want%20to%20get%20up%20to%20speed%20on%20crypto%20and%20NFTs.%20And%20says%20MoonPay%20has%20become%20the%20go-to%20source%20for%20this.%20%20%20%20%20%E2%80%9CIt%E2%80%99s%20been%20very%20much%20organic.%20A%20lot%20of%20these%20guys%20have%20become%20my%20friends.%E2%80%9D\" data-v-f87c67ca=\"\">DJ Khaled<\/a>, <a href=\"https:\/\/twitter.com\/moonpay\/status\/1456671863640309760?s=20\" data-v-f87c67ca=\"\">Lil Baby<\/a>, and <a href=\"https:\/\/twitter.com\/kygo_charts\/status\/1452601823492288512?s=20\" data-v-f87c67ca=\"\">Kygo<\/a>. He has even been pictured <a href=\"https:\/\/twitter.com\/WillyTheDegen\/status\/1496550578092224512\" data-v-f87c67ca=\"\">with Tesla boss Elon Musk<\/a>, but ivanhodls his tongue about whether that encounter led to any NFTs changing hands.","“It’s been very much organic. A lot of these guys have become my friends,” he says.","Soto-Wright concedes that some celebrities have managers or trustees who look after their crypto wallets and private keys for them. But the crucial thing, in his view, is that the NFTs they buy hold value linked to a blockchain.","“That wallet is the foundational infrastructure and building block for all value to eventually move over blockchains,” says Soto-Wright."],"hashtag":[]}