{"summary":"“We've only seen the tip of the iceberg with bitcoin DeFi today,” said Interlay CEO and Co-founder Alexei Zamyatin in an exclusive interview with CoinDesk.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/07\/05\/blockchain-project-interlay-wants-its-new-platform-to-become-a-one-stop-shop-for-bitcoin-defi\/","publishDate":"2023-07-05T14:00:00","id":15714,"type":null,"title":"Blockchain Project Interlay Wants its New Platform to Become a ‘One-Stop-Shop for Bitcoin DeFi’","category":["Technology"],"content":["Interlay, a decentralized blockchain network, rolled out a new platform on Wednesday that it describes as a “one-stop-shop” for Bitcoin decentralized finance (DeFi).","The platform features a decentralized exchange (DEX) and a lending protocol, both integrated with Interlay’s existing DeFi bridge – a system connecting multiple blockchains – that was launched last year and is powered by the wrapped token InterBTC (iBTC). Wrapped tokens are synthetic (or tokenized) versions of crypto assets that are not native to the blockchains on which they exist.","Read more: Polkadot Now Has a Decentralized Version of 'Wrapped' Bitcoin","Interlay says its new bitcoin DeFi hub plans to fill the void left by the closure of peer-to-peer bitcoin exchanges like LocalBitcoins and Paxful earlier in the year and the multi-billion dollar flight from two of the world’s largest crypto exchanges – Binance and Coinbase – precipitated by the current U.S. Securities and Exchange Commission (SEC) lawsuits targeting the two centralized platforms.","“LocalBitcoins closed, Paxful had issues,” said Interlay CEO and Co-founder Alexei Zamyatin in an interview with CoinDesk. “We focus on trying to unlock additional functionality for bitcoin and we try to be an alternative to centralized exchanges.”","The 30-year-old computer science PhD graduate describes the new platform as a combination of Uniswap, a popular DEX and Aave and Compound, open-source protocols for liquidity and lending, respectively.","The hub reportedly features not only bitcoin (BTC), but also tether (USDT), polkadot (DOT), and Interlay’s governance token INTR. Liquid staking tokens, or portable tokens that represent staked cryptocurrencies “are expected in Q3” while assets from Ethereum and Cosmos may become available by year’s end, according to the project.","This cornucopia of tokens may irk some Bitcoin purists, but Zamyatin says it’s a necessary step in bringing “Bitcoin to one billion people.”","“Financial freedom means different things to different people,” Zamyatin explained. “For some, it means that they can hedge against fiat by buying bitcoin and just holding it, but not everybody earns and has enough capital to be able to just put something aside and use it as an investment. There's a lot of people globally who see bitcoin as access to a financial system,” he added."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Alexei Zamyatin","content":"PERSON"},{"type":"Paxful","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Zamyatin","content":"PERSON"}],"hashtag":["Bitcoin","DeFi","Wrapped Bitcoin","Polkadot","Exclusive"],"authors":["Frederick Munawa"]}