{"summary":"Kelp DAO's newly announced kelp earned points (KEP) token brings liquidity to EigenLayer Points.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/21\/restaking-protocol-kelp-dao-brings-liquidity-to-eigenlayer-points\/","publishDate":"2024-02-21T12:21:56","id":15719,"type":null,"title":"Restaking Protocol Kelp DAO Brings Liquidity to EigenLayer Points","category":["Markets"],"content":["The ether (ETH) liquid restaking landscape is getting bigger and bigger every day.","On Tuesday, Kelp DAO, the third-largest liquid restaking protocol, introduced the KEP or “kelp earned points” token, allowing users to trade the otherwise illiquid EigenLayer points\/rewards.","EigenLayer, launched last year, allows ether stakers to restake their coins. Staking is a method to secure a blockchain by locking coins on the network in return for rewards. For instance, when ether holders deposit their ETH on the network, they boost the network’s security and earn rewards.","Kelp DAO, Ether.fi, and others act as middlemen between users and EigenLayer, accepting deposits and retaking them with EigenLayer. Depositors earn liquid restaking tokens, which can be traded elsewhere. Kelp DAO depositors get rsETH.","While EigenLayer has yet to issue its native token, it provides points for those who restake ETH. It is speculated that these points could eventually become an eligibility criterion for future airdrops.","However, these points are not liquid and cannot be used elsewhere to generate an additional yield. Kelp DAO’s new offering addresses this issue.","“$KEP is designed to bring liquidity to EigenLayer Points. Restakers will now be able to transfer and trade their earned points and also participate in DeFi. It can be freely transferred and traded, making EigenLayer Points and other potential restaking rewards highly liquid,” Kelp DAO said on X.","All EigenLayer points earned by Kelp DAO will be distributed proportionally to rsETH holders in the form of $KEP tokens, Kelp DAO added.","Messari analyst Kunal Goel described Kelp DAO’s move as an “absolutely wild one,” calling KEP the closest representation of a potential EigenLayer token.","Edited by Parikshit Mishra."],"entity":[{"type":"Kelp DAO","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$KEP","content":"MONEY"},{"type":"Kelp DAO","content":"ORGANIZATION"},{"type":"Kunal Goel","content":"PERSON"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"EigenLayer Points","content":"ORGANIZATION"}],"hashtag":["Restaking","EigenLayer","Ethereum","Staking"],"authors":["Omkar Godbole"]}