{"summary":"Qoin is unsure why its membership in Austalia's leading blockchain industry group was terminated.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/02\/25\/mystery-over-why-blockchain-australia-revoked-membership-of-crypto-project-qoin\/","publishDate":"2021-02-25T09:53:51","id":15729,"type":null,"title":"Mystery Over Why Blockchain Australia Revoked Membership of Crypto Project Qoin","category":["Finance"],"content":["","The leading blockchain industry body in Australia has ejected retail-focused cryptocurrency project Qoin from its membership list, but it's not clear why.","","","According to a Feb. 19 notice from Blockchain Australia (BCA), it issued a summons to Qoin on Jan. 29, asking Qoin to respond.","","","BCA said that, after reviewing Qoin's response and the \"circumstances of the matter,\" it terminated the project's membership, meaning that Qoin must cease using of the Blockchain Australia logo and name in connection with its business or promotional activities.","","","BCA aims to \"advance the adoption of blockchain technology throughout Australia,\" according to its website. It also provides members operating in the local industry an air of legitimacy.","","","When asked for specific reasons behind BCA's decision to remove its membership, Qoin chief marketing officer Andrew Barker told CoinDesk the firm had not received \"any extra documentation pinpointing any example.\"","","","A \"formal\" public response to the notice posted Wednesday by Qoin, though, alleges the notice from BCA included \"false allegations\" around \"communication and disclosures\" on the project's website.","","","\"The timing ... aligns with the emergence of false and misleading comments ... made by certain antagonists on social media platforms including a previous board member,\" Qoin said in the post.","","","Some reports have suggested that the former BCA board member is Nuggets News CEO Alex Saunders, who alleged in a tweet that Qoin is the \"biggest crypto scam\" in Australia two days before BCA's notice was served.","","","Barker said that, while \"some have drawn that conclusion,\" because of the timing of the notice and because of Saunders' prior role, Qoin did not know that \"as a fact.\"","","","\"We considered this notice a premeditated attack against Qoin,\" the project alleged in its post. It also claimed that during the period of its response and the final notice \"no questions were raised\" nor \"updates given\" by BCA.","","","Barker further alleged BCA had chosen to edit out three lines of the document that was forwarded to Qoin in the notice that was made public. He would not disclose the lines, saying the BCA should provide them.","","","See also: Australia’s Blockchain Ecosystem Needs More Support From Regulators, Says Industry Body","","","Qoin said it will \"vigorously\" defend any statements and actions made by outside parties that it considers \"factually incorrect, slanderous and defamatory\" to its brand. Barker said Qoin is currently talking to a \"number of advisories.\"","","","CoinDesk attempted to contact both the BCA and Saunders for further comment, but did not receive a reply by press time.",""],"entity":[{"type":"Jan. 29","content":"DATE"},{"type":"Says Industry Body","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Feb. 19","content":"DATE"},{"type":"Blockchain Australia","content":"LOCATION"},{"type":"Barker","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Saunders","content":"PERSON"},{"type":"BCA","content":"ORGANIZATION"},{"type":"Andrew Barker","content":"PERSON"},{"type":"Qoin","content":"PERSON"},{"type":"Alex Saunders","content":"PERSON"}],"hashtag":["Australia","Blockchain","Blockchain Australia"],"authors":["Sebastian Sinclair"]}