{"summary":"Cryptocurrency exchange Binance released details of how its native token BNB will soon be moved from ethereum to its native public blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/04\/18\/binance-reveals-timeline-for-bnb-cryptocurrencys-move-off-ethereum\/","publishDate":"2019-04-18T13:01:15","id":15728,"type":null,"title":"Binance Reveals Timeline for BNB Cryptocurrency's Move Off Ethereum","category":["Markets"],"content":["Cryptocurrency exchange Binance has launched its new custom blockchain, Binance Chain, which will support its $3 billion BNB cryptocurrency that currently runs on ethereum.","Announced Thursday, the exchange said it will activate BNB on the new network on April 23, after which holders of the token are encouraged to migrate their balances to the new network. Old ethereum-based tokens will be destroyed as new BNB tokens are created on Binance Chain, the company said, in order to maintain a constant supply across both networks.","The initial total supply for BNB tokens will be 200 million, 48 million of which will be frozen and 11,654,398 of which will be burned on Binance Chain.","On April 23, Binance Chain Explorer and Web Wallet will be open to the public and Binance.com will be able to help users with the mainnet swap. Users will be able to provide a Binance Chain address for BNB withdrawal requests, with the withdrawal then acting \"as a mechanism to convert ERC-20 BNB tokens into BEP2 BNB tokens.”","The firm said if users want to keep the ERC-20 version of BNB tokens, they would need to withdraw it into an ethereum wallet before April 23. After that, Binance.com will no longer support the withdrawal of ERC-20 BNB tokens. \"Please note that withdrawn ERC20 BNB tokens will only have temporary usage, as all BNB tokens will be migrated to Binance Chain,\" Binance said.","Binance noted that the timeline of the above events is subject to change.","Binance first revealed the development of Binance Chain in March 2018. At the time, the exchange also said that it would essentially shift its BNB token to its own native blockchain.","In a recent live ask-me-anything (AMA) chat on Twitter, however, Binance CEO Changpeng Zhao explained:","Edit: This article has been updated to reflect changes to Binance's announcement made since publication of the article.","Binance image via Shutterstock "],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Binance Chain","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"April 23","content":"DATE"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Binance Chain Explorer","content":"ORGANIZATION"},{"type":"AMA","content":"ORGANIZATION"},{"type":"March 2018","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["News","Public Blockchains","Binance","BNB"],"authors":["Yogita Khatri"]}