{"summary":"UNICEF, an agency of the United Nations that provides relief to humanitarian aid to children, is testing concepts for a DAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223306\/unicef-hatches-plan-for-a-prototype-dao-following-its-crypto-fund","publishDate":"2023-03-30T09:00:09","id":1572,"type":null,"title":"UNICEF hatches plan for a prototype DAO, following its crypto fund","category":["ORGANIZATIONS"],"content":["UNICEF, an agency of the United Nations that provides relief and humanitarian aid to children, is testing concepts for a decentralized autonomous organization (DAO).&nbsp;","\"Right now, we're building a DAO prototype to fairly distribute power and communication for a globally distributed digital public good,\" said UNICEF blockchain lead Arun Maharajan in an interview last week at Paris Blockchain Week.&nbsp;","Digital public goods (DPGs) are types of open-source software, models and standards that can be used by can countries to build digital infrastructure as an alternative to private proprietary solutions.&nbsp;","The early stage pilot, which is being built on top of the Layer 2 solution Polygon, hopes to enable easier communication between stakeholders of a DPG when discussing possible new features to the project.","“In a sense, it’s a closed DAO for each DPG to get all the stakeholders on board” he said. “Right now we are looking at team members but I think it’s percievable that it could even include end users or other stakeholders so that really the community around that DPG gets together and decides together what needs to happen.”","Still, UNICEF has trialed the open-source voting tool Snapshot for potential governance proposals, he added. This is one way it would function much like your run-of-the-mill decentralized organization.","The ultimate goal would be that such projects could use the DAO to fund any new features voted on by the community.&nbsp;","The DAO concept is part of a larger endeavor in crypto for the organization, which set up the UNICEF CryptoFund to receive donations in bitcoin and ether in October 2019.&nbsp;","Functioning as part of a wider venture program, the crypto fund enables startups that UNICEF deems to be providing technologies that innovate for children to receive funding in either bitcoin or ether. In particular, it looks to help the startups it backs to become certified as a DPG via the Digital Public Goods Alliance.&nbsp;","Four donors have contributed so far, including <a href=\"https:\/\/www.theblock.co\/linked\/53793\/etc-labs-commits-1-million-to-blockchain-focused-startups-and-solutions-in-unicef-innovation-partnership\" data-v-f87c67ca=\"\">ETC Labs<\/a>, Animoca Brands and <a href=\"https:\/\/www.theblock.co\/linked\/100684\/unicef-bitcoin-btc-donation-huobi-charity\" data-v-f87c67ca=\"\">Huobi Charity<\/a>.&nbsp;","\"As we have for our private donors, we have the exact same due diligence process for our crypto donors, so you cannot have anonymous donor donations in crypto\", said Sanna Bedi, who manages the UNICEF CryptoFund.&nbsp;","\"If we do get<b data-v-f87c67ca=\"\">&nbsp;<\/b>unsolicited funds, we actually burn them,\" she continued.&nbsp;","While the organization doesn't take any equity in the firms it backs, it's so far had seven exits and its portfolio companies have raised about $17 million in follow-on funding.&nbsp;","So far it's invested in 41 startups with cryptocurrency in registered UNICEF program countries. Maharajan cited a Nepali startup named Rumsan, a blockchain-based cash and voucher assistance platform, as an example.","Rumsan connects aid agencies with distribution entities to provide cash and vouchers for beneficiaries. The flow of the aid given can be easily traced via blockchain technology, said Maharajan.&nbsp;","\"Right now they are working with UNICEF Nepal in a field pilot that's being wrapped up now,\" he said. \"They're using the system to bring cash assistance to a couple of rural districts in Nepal, which are flood-prone.\"&nbsp;","Bedi admits that running a crypto fund comes with its fair share of questions internally at the United Nations humanitarian agency. Still, she ultimately describes UNICEF as \"flexible\" and \"willing to learn\" in regard to blockchain technologies.&nbsp;","\"It's really important for us to share what we're learning and be very open about it, she said. \"We don't claim to have it all figured out, we haven't — we've hit roadblocks many times and I think we're very open about that.\"&nbsp;","Nevertheless, she stresses they're not taking a move-fast and break-things approach to the technology. While she said she couldn't share details of UNICEF's custody arrangement, it wasn't impacted by the recent crypto banking crisis like Circle's USDC was for instance.&nbsp;","When asked if the fund would ever include USDC as a donation option, Bedi was ambivalent, saying that they would be interested but it would have to \"make sense from a market point of view.\"&nbsp;","\"They are among the coins which have a larger market share,\" she said. \"Being one of the major players [in crypto] and depegging doesn't give a lot of confidence in which coins are stable in the end.\"&nbsp;","<em data-v-f87c67ca=\"\">Update: Clarified that UNICEF invested in 41 startups with cryptocurrency.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arun Maharajan","content":"PERSON"},{"type":"Digital Public Goods Alliance","content":"ORGANIZATION"},{"type":"Bedi","content":"ORGANIZATION"},{"type":"Maharajan","content":"PERSON"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nepal","content":"LOCATION"},{"type":"Huobi Charity","content":"ORGANIZATION"},{"type":"UNICEF Nepal","content":"ORGANIZATION"},{"type":"Sanna Bedi","content":"PERSON"},{"type":"UNICEF","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"DPG","content":"ORGANIZATION"},{"type":"Paris Blockchain Week","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","DAOS","DECENTRALIZED INFRASTRUCTURE"],"authors":["Tom Matsuda","The Block"]}