{"summary":"The upgrade seeks to solve congestion issues, and will officially launch in May.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/22\/stacks-begins-2-step-rollout-of-major-nakamoto-overhaul\/","publishDate":"2024-04-22T20:18:05","id":15722,"type":null,"title":"Stacks Begins 2-Step Rollout of Major ‘Nakamoto’ Overhaul","category":["Technology"],"content":["After years of R&D, the Stacks blockchain is getting an overhaul. The rollout of the popular Bitcoin scaling layer’s largest upgrade to date began at Bitcoin block height 840,360 (around 14:30 UTC), beginning a two-step process that will end sometime in late May.","Called Nakamoto, honoring Bitcoin’s pseudonymous creator, the upgrade will decouple the Stacks block production schedule from Bitcoin's. Although the layer-2 network has a higher transaction throughput than Bitcoin (which processes about 7 transactions per second), as initially designed, Stacks produced blocks at the same rate as Bitcoin, leading to congestion issues, network creator Muneeb Ali told CoinDesk.","Nakamoto will introduce a new way of producing Stacks blocks, updating its bespoke proof-of-transfer consensus algorithm. Starting today, new block “signers” will start coming online to validate “tenures” of transactions. At first, until the upgrade is fully activated in May, this will all be for “'practice,” Stacks developers said on X. (If you want to learn more about what’s changing on a technical level, read here.)","For casual users of Stacks, the developers recommend checking you’re using an updated wallet, which in many cases should happen automatically. For those who stake their STX tokens, the instantiation on Monday automatically unlocked those tokens, which can then be restaked when Nakamoto-compliant pools come online, likely sometime next week.","There is currently about $1.3 billion worth of STX staked on-chain, representing about one-third of the total $4.2 billion circulating supply, making it one the largest interest-earning pools of capital related to bitcoin. The token has rallied more than 16% to about $2.90 over the past 24 hours, pushing it for the first time into the top 25 tokens by market capitalization.","See also: Bitcoin L2s Are Poised to Break Out, Stacks Creator Says"],"entity":[{"type":"Muneeb Ali","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$4.2 billion","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$2.90","content":"MONEY"},{"type":"Bitcoin's","content":"ORGANIZATION"}],"hashtag":["Stacks","Layer 2s","Bitcoin"],"authors":["Daniel Kuhn"]}