{"summary":"The “only U.S.-registered crypto securities platform\" is listing ETH in a bold test of the U.S. Securities and Exchange Commission's thesis that most cryptocurrencies are securities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/08\/ethers-prometheum-test\/","publishDate":"2024-02-08T22:17:43","id":15734,"type":null,"title":"Ether’s Prometheum Test","category":["Consensus Magazine"],"content":["As crypto regulators have, for years, hemmed and hawed over essential legal questions like “is ether a security?,” the industry has often complained about a lack of legal clarity.","It has been impossible, many have said, to comply with the law because it’s not clear exactly what the law says, or rather how regulators will interpret that law related to something as novel as an internet-era digital asset.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","\n","We still don’t know, for instance, whether ether is a security or a commodity, though the SEC has breadcrumbed that it’s probably the latter and that the leading securities regulator is not, therefore, responsible for regulating the second most important crypto asset after bitcoin.","But is it?\n\nThis week, Prometheum, a weird anomaly in being the “only U.S.-registered crypto securities platform,” announced that it would begin to custody ETH as its first digital asset.\n\nThe news is important because it tests two key open questions in crypto — one, whether it’s possible to comply with the SEC when transacting leading cryptocurrencies, and two, who, if anyone, is finally going to adjudicate on ETH classification so we can all go about building the next generation crypto industry.\n\nMy colleague, regulation deputy managing editor Jesse Hamilton, summed up the stakes in a masterful dissection of the (very complicated) matter yesterday:\n\n“At that point, [Prometheum] will either be proving the claims of its executives that crypto can be handled in the U.S. in a way that appeases the securities watchdog, or proving the naysayers who argue that it's impossible to meet the SEC's expectations,” Hamilton writes.","See also: DeFi Shouldn't Have to Worry About the SEC's Expanded Broker Rule | Opinion\n\n“The stakes aren't just high for Prometheum and the rest of the industry, but also for the government agency that has claimed for years that there's a proper way for crypto firms to ‘come in and register’ to do business in the U.S.; Prometheum came in and registered but what happens next is unclear. And while it tests these murky waters, it may also help establish whether the SEC intends to view ETH as a security.”\n\nPrometheum is able to offer both custody and trading in those digital assets because, unusually, it has licenses to do both. That means it can “legally sling Ethereum as a security,” in the words of Fortune’s Jeff John Roberts and hope that “regulators have no choice but to recognize the designation.” In this scenario, Prometheum would then be the only platform for legally trading ether, the security — a pretty nice natural monopoly if you can get it.\n\nThe question, then, is whether the SEC, witnessing this anomaly, would step in to finally designate ether a security, or not. Mike Selig, a fintech lawyer at Willkie Farr & Gallagher, says that’s unlikely, given the SEC’s preference the last few years for not saying anything very definite when it comes to crypto. “The SEC is likely to remain neutral on Ethereum,” he says. They have done no favors for ether. I wouldn’t expect it makes one now.” Under the terms of the SEC’s special-purpose broker-dealer, Prometheum has broad latitude to designate assets as securities to list on its platform (for instance, by showing that an asset meets the all-important Howey Test).","See also: Coinbase vs. the SEC Debates the Difference Between Securities and Beanie Babies | Opinion\n\nHow this plays out is anyone’s guess. Jeff John Roberts thinks Prometheum will struggle for clients and that Coinbase and others will fight SEC chair on this as it’s fighting on a host of related issues. But the Prometheum Test shows one thing very clearly once again: the SEC has failed to provide any legal certainty for the crypto industry and as a result has enabled a backdoor actor to come within spitting distance of a legal monopoly. Nature abhors a vacuum, and the crypto industry abhors Gary Gensler’s SEC.","Edited by Daniel Kuhn and Jesse Hamilton."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Mike Selig","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Prometheum","content":"PERSON"},{"type":"Hamilton","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"SEC Debates the Difference Between Securities","content":"ORGANIZATION"},{"type":"John Roberts","content":"PERSON"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Jeff John Roberts","content":"PERSON"},{"type":"Willkie Farr & Gallagher","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Ether","Prometheum","SEC","Securities"],"authors":["Ben Schiller"]}