{"summary":"A growing number of people are making money playing games in the world of GameFi, but it's important to be ready and do your research.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/how-to-pick-the-right-play-to-earn-game-for-you\/","publishDate":"2022-01-28T19:58:41","id":15738,"type":null,"title":"How to Pick the Right Play-to-Earn Game for You","category":["Learn"],"content":["It's no secret that gaming has turned from a passive hobby to a multibillion-dollar industry. According to Accenture, the global business is currently valued at over $300 billion, driven by an influx of new gamers looking for social interaction.","With the rise of the blockchain, the industry paradigm has changed. Instead of money going only to game developers and distributors, players can now generate an income from cryptocurrencies or non-fungible tokens (NFTs) using their computer or smartphone in play-to-earn games. The trend has even reached the major game distributors, with Ubisoft announcing plans to launch NFTs into the next Ghost Recon game.","Before getting started with these types of games, it’s critical to understand how they work and how you can actualize a return for your gaming hours.","In many games – especially Massive Multiplayer Online (MMO) games – players collect digital items to further their progress. These can include in-game objects like weapons, property or wearables. They’re usually earned as rewards for completing quests and challenges, or acquired from loot boxes bought with real currency. From various skins to in-game currency, items let gamers customize their characters with new outfits and better equipment, but none of these can be sold to other players for cash.","This is where play-to-earn games – or GameFi – come into play. Leveraging the immutability of blockchain technology, game designers can create in-game items and rewards that are provably unique and transferable. Rewards can range from earning native digital currencies to collecting NFTs or be earned from staking. In turn, coins can be exported to crypto wallets to be converted to fiat currency like U.S. dollars, while NFTs can be sold to other players via in-house trading platforms or secondary marketplaces.","The popular play-to-earn game Axie Infinity, for example, allows players to purchase, battle and breed virtual creatures (called “Axies”) minted exclusively on the Ethereum blockchain. Because each Axie is represented by an NFT, they can be bought and sold peer-to-peer using cryptocurrency.","Once you understand how play-to-earn games work, you can start looking for one (or several) that works best for you. With hundreds of play-to-earn games already out there (and hundreds more in development), the question is, how do you find the best one for you?","The key to this is all about the fine print. Before you jump in, you need to understand how rewards are paid out, how you can convert in-game coins to other cryptocurrencies and what you actually want to gain from your experience.","Each play-to-earn game offers players rewards in different forms. Most games will payout rewards in a combination of NFTs and in-game cryptocurrency, which can be traded and sold to other players or external traders. In some rare cases, players can earn popular currencies for their play. In the game Coin Hunt World, players can explore their neighborhoods for keys that unlock quizzes. Answer correctly, and you are rewarded with bitcoin and ether – the native cryptocurrency of Ethereum.","When getting started, it’s important to understand how you will earn rewards for gameplay, and how much time it will take to earn them. While some require simple tasks to earn NFTs, others need a bigger investment to get rewarded.","Although many play-to-earn games are built on popular blockchains (like Ethereum and Polygon), converting them to another coin may not be an easy process. NFTs can take time to sell, while in-game coin values can fluctuate quickly.","Before investing your time in a game, do your research to understand how you can utilize your coins for real-world earnings. Knowing how to convert your digital items can help you decide if the game is the right one for your goals.","Like other video games, getting started in a play-to-earn game often requires you to buy a starter pack with cryptocurrency. Depending on which game you decide to start in, your entry cost may vary.","For the incredibly popular Axie Infinity, you will need to purchase at least three Axies to get started. On the Axie Infinity Marketplace, Common Axies sell for anywhere between $35 and $70, while rarer Axies can go for hundreds of dollars.","With other games, you won’t need to make a purchase to start, but will ultimately need to spend cash to access premium features or play-to-earn aspects. In the virtual world game Decentraland, you can start with little more than a MetaMask wallet. If you enjoy it enough to claim a username, you will need to purchase 100 MANA (around $216 currently) to “build” it.","Cryptocurrency earned from play-to-earn games comes with inherent risk and no guarantee of return. Only invest what you can afford, on the understanding that it may take a while to get a return (and you may never profit at all).","Once you have decided to dive into play-to-earn games, your next step is to find one that aligns with your interests and price point. With over 400 active blockchain games online today, finding the best one for you is all about research.","Two key places to watch for new play-to-earn game options are data tracking websites DappRadar and CoinMarketCap. While DappRadar offers insight on the GameFi marketplace based on users and volume, CoinMarketCap gives insight into a game’s token price trends, helping you determine the right time to get involved in a game.","Play-to-earn games combine the fun of video games with the opportunity to earn real rewards for your time. But as with any financial product, there is no such thing as a “typical” earnings, and your returns may vary.","In Axie Infinity, research published in July 2021 by the Cryptoday newsletter on Substack showed the average player could earn around 1,125 Smooth Love Potion tokens per week. At the then-high of $0.3462 per token, a gamer could earn an estimated $389.48 per week. Since then, the price of the tokens has dropped significantly, leading British investing firm Three Body Capital Management to revise the average earnings in November 2021 to around $100 per week.","Actual gameplay is only one way to gain returns in the metaverse. A 2021 report by investment firm Grayscale shows all-time secondary market NFT sales in Decentraland have grown by around 2.5-times in between September 2020 and 2021, going past the $100 million mark. The positive growth led the company to launch a single-asset trust for the MANA coin in early 2021. (Grayscale is owned by Digital Currency Group, the parent company of CoinDesk.)","While play-to-earn crypto games can be profitable, they often come with both an initial monetary investment and a time cost to learn the game and grow your investment. By doing your due diligence and preparing to go long in your GameFi experience, it’s possible to have fun and earn valuable cryptocurrency rewards for your time.","Read More: How to Earn Crypto Playing Games Online"],"entity":[{"type":"$216","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$35","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"September 2020","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Infinity Marketplace","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"$0.3462","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"$300 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Three Body Capital Management","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$389.48","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"Decentraland","content":"LOCATION"},{"type":"$70","content":"MONEY"},{"type":"Accenture","content":"ORGANIZATION"}],"hashtag":["Beginner","Learn","DeFi"],"authors":["Joe Cortez"]}