{"summary":"The spike triggered a series of liquidations on the exchange.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/02\/bitcoin-flash-rally-briefly-pushed-btc-derivatives-above-56k-on-bitfinex\/","publishDate":"2023-05-02T15:36:08","id":15739,"type":null,"title":"Bitcoin 'Flash Rally' Briefly Pushed BTC Derivatives Above $56K on Bitfinex","category":["Finance"],"content":["Bitcoin's (BTC) price on Bitfinex's perpetual swap market momentarily topped $56,000 on Tuesday – well above prevailing levels elsewhere and prices on Bitfinex's exchange right before or after – amid a flurry of volume amid an absence of liquidity.","Trading volume on Bitfinex's BTC-PERP market spiked to 322 BTC ($9.1 million) between 14:24 and 14:26 UTC, equating to around a quarter of daily volume on the trading pair.","Some traders' positions were liquidated amid the flash rally, according to data on Bitfinex's trading platform.","The move occurred at the same time as bitcoin surged 2.5% on spot markets elsewhere as investors reacted to the stock prices of two banks, Pacwest (PACW) and Western Alliance (WAL), plunging by more than 30% as concerns about the U.S. banking system resumed.","At press time, the BTC-PERP pair has 10% market depth of 110 BTC, meaning that an order to buy 110 BTC would move the price on that specific market by 10% – evidence liquidity remains low on Bitfinex.","Paolo Ardoino, Bitfinex's chief technology officer, tweeted: \"Low liquidity at that moment in time. But system worked as expected. Matching engine handled all orders correctly.\"","UPDATE (May 2, 2023, 14:40 UTC): Adds a tweet from Bitfinex's CTO.","Edited by Nick Baker."],"entity":[{"type":"May 2, 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$56,000","content":"MONEY"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Nick Baker","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$9.1 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["Bitfinex","On-chain Data","Bitcoin"],"authors":["Oliver Knight"]}