{"summary":"Crypto.com operates internal trading operations, according to a report by the Financial Times.\nCiting sources, the FT said that employees were directed to keep the operations secret. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235347\/crypto-com-operates-internal-proprietary-trading-desks-financial-times","publishDate":"2023-06-19T04:45:17","id":1573,"type":null,"title":"Crypto.com operates internal proprietary trading desks: Financial Times","category":["The Block"],"content":["Crypto exchange Crypto.com has been operating internal proprietary trading teams, according to a report by the <a href=\"https:\/\/www.ft.com\/content\/b5d2bf4b-225c-4f30-9f1c-cbe8dc762fa8\" data-v-f87c67ca=\"\">Financial Times<\/a>.&nbsp;","Citing five anonymous sources, the business publication reported Monday that the Singapore-based exchange has attempted to obfuscate the trading operations, with one source telling the FT that employees were requested by management to \"say there is no internal market maker type operation.\"","Crypto.com denied any improper relationship between the internal trading operation, which it described as an internal market maker, and its exchange. People familiar with the operations told the FT the desks trade on Crypto.com's exchange as well as other venues with the goal of making money \"and not facilitating an exchange.\"","\"We have an internal market maker that operates on the Crypto.com exchange and that internal market maker is treated exactly the same as third-party market makers that identically facilitate tight spreads and efficient markets on our platform,\" a Crypto.com spokesperson told the FT.&nbsp;","Internal trading operations have long been a controversial, yet common occurrence in crypto, with firms like BitMEX and Binance historically operating desks to maintain liquid markets. Still, opponents of the business model say it could open the door to conflicts of interest and the potential for front-running of customer trades.&nbsp;","In its suit against Coinbase and Binance, the U.S. Securities and Exchange Commission called out the integrated model of both venues.&nbsp;","\"The Coinbase Platform merges three functions that are typically separated in traditional securities markets—those of brokers, exchanges, and clearing agencies,\" the SEC said in its complaint.&nbsp;"],"hashtag":[]}