{"summary":"The government will sell the remaining 41,490 BTC in four tranches this year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/31\/us-government-sold-216m-of-seized-silk-road-bitcoin-this-month\/","publishDate":"2023-03-31T15:53:38","id":15731,"type":null,"title":"U.S. Government Sold $216M of Seized Silk Road Bitcoin This Month","category":["Finance"],"content":["The U.S. government sold 9,861.17 bitcoin (BTC) for almost $216 million on March 14, a court filing shows.","The bitcoin sold is part of the 50,000 BTC seized in November following the arrest of James Zhong, who pleaded guilty to wire fraud after the government alleged he manipulated the transaction system on darknet market Silk Road in 2012. At the time, the government hailed it as the largest cryptocurrency seizure.","The government intends to liquidate the remaining 41,490 bitcoins in four tranches over the course of this calendar year, the filing said.","Crypto traders were spooked after seeing U.S. authorities transfer over $200 million worth of bitcoin to Coinbase (COIN) on March 9. Bitcoin's price was volatile as a result, rising as much as 9.7% in a 24-hour period before returning to where it was before.","Now, however, bitcoin traders remain unperturbed by renewed concerns of selling pressure from the U.S. government, as the cryptocurrency continues to trade around $28,000.","Edited by Sheldon Reback."],"entity":[{"type":"$28,000","content":"MONEY"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$216 million","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 9","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"James Zhong","content":"PERSON"},{"type":"9.7%","content":"PERCENT"},{"type":"March 14","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":["Silk Road","Bitcoin","Coinbase","U.S. Government"],"authors":["Oliver Knight"]}