{"summary":"“The future of labor needs to be able to break out of the top-down rigid, hierarchical structures we’re familiar with from the corporate world,” says Coordinape co-founder Tracheopteryx.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/07\/05\/coordinape-is-decentralizing-compensation-decision-making\/","publishDate":"2022-07-05T16:17:12","id":15736,"type":null,"title":"Coordinape Is Decentralizing Compensation Decision-Making","category":["Consensus Magazine (layer2)"],"content":["When traditional companies decide on compensation levels, the discussion typically occurs between an employee and manager. Even within decentralized autonomous organizations (DAO), the circle of decision-makers for compensation can be quite small.","This article is part of \"Future of Work Week.\"","But what if there was a way of having a whole community of working contributors decide compensation in an open way?","Initially emerging from Yearn Finance’s grant process, Coordinape’s flagship product is the Gift Circle. “It’s a way to do decentralized retroactive compensation and, importantly, it’s about deciding on compensation,” said Coordinape co-founder and former Yearn contributor Tracheopteryx said in an interview.","“The future of labor needs to be able to break out of the top-down rigid, hierarchical structures we’re familiar with from the corporate world…” Tracheopteryx said. “We need to create better ways for human minds to come together and think. And that’s what Coordinape is trying to do. And one of the ways in particular that Coordinape is taking on is compensation.”","First, a user defines a group to establish membership of a Gift Circle for a given project with an income budget that is dedicated to a project’s contributors. During the working period and within their circle, contributors decide how many GIVE tokens to gift to their teammates.","Each GIVE represents a portion of the total compensation budget that is going to be distributed. For example, if a contributor receives 10% of all GIVE tokens from teammates within the circle, that contributor would receive 10% of total compensation.","According to Zack Anderson, co-founder at Coordinape, GIVE is a powerful reputation marker because of the money attached to it. The GIVE token says a contributor should get some of this funding because of his or her contribution to the project.","When a contributor is sending GIVE around, the individual worker is deciding on whom to compensate and not to compensate, said Zemm, co-founder of Coordinape. The contributor’s job, in addition to working on the project, is deciding who, from their experience, deserves to get those gifts.","The idea underpinning Coordinape’s Gift Circle is that a group of contributors doing the work is going to know compensation better than one individual at the top. And while the gift giving ceremony may reward those who are most visible or outspoken with their work efforts, the Gift Circle prompts conversations about who deserves what, which “is a lot more valuable than the allocation,” said Anderson.","Questions of “what is valuable?” and “how are you performing, according to my expectations?” naturally arise when contributors are strategizing about their GIVE allocation in a gift circle.","Coordinape is attempting to create more clear pathways for conversations centered around compensation to play out. By having these conversations, a contributor can discuss internally and with peers what significant contribution looks like and whether someone’s work is “actual output or emotion without progress,” according to Anderson.","“How can we make sure that what we say is important and what we say we want to focus on is actually getting focused on?” Anderson said. Coordinape’s answer is the Gift Circle, which “pushes out the decision-making of who should receive what funding down to the edges,” said David Hoffman, co-founder of Bankless Nation.","Coodinape is currently used by roughly 300 DAOs including Bankless, PoolTogether and DAOhaus. BanklessDAO uses Coordinape to distribute 4.5 million BANK, 15% of its total seasonal budget, for contributor rewards.","After contributors have sent GIVE to their peers, an interactive map is generated that shows all interactions between members.","Each line in the circle map represents an interaction of GIVE between two contributors. Any member of a circle can see how a given teammate allocated their GIVE to others and see how many GIVE tokens another contributor received, providing a visual representation of how compensation is distributed.","Ultimately, the circle map promotes transparency insofar as it shows how members of a circle perceive where value is created for the community and for each other.","As a result, it becomes easier for contributing workers to understand when their work is going in a direction that’s extremely exciting for their colleagues and when it’s not.","Many projects, teams, companies and DAOs make compensation decisions in a top-down way, creating an adversarial environment between leaders and workers.","A small group of people at the top controlling a large group of people out in the world is a limited way to work, both structurally and cognitively, because when the decision-making power is confined to a small group, there’s only so much that they can do, said Tracheopteryx in a interview with CoinDesk. He stated that this corporate fiction, the dominant scaling technology for human effort in the world today, significantly impairs collective intelligence and obstructs effective human coordination, especially for compensation.","Even if the most benevolent and generous leader is in charge and making decisions, he\/she can only be so good at deciding compensation, because deciding “good” compensation requires the consideration of many factors that are beyond the scope of a single individual and a small group of people.","“Good” compensation includes understanding more than just people wanting to be paid a fair amount relative to their peers’ income, feeling seen within the community and experiencing psychological safety.","“There’s a lot of stuff woven into good compensation beyond just the number,” said Tracheopteryx.","The important question for Coordinape is, “Who has the capability to decide who gets what?” Currently, only a small group of people possess this capability and so Coordinape is trying to increase the number of people that possess this capability to decide who gets what.","If decisions around compensation occurred in a fairer and more just way, then “you’ve taken a big chunk out of the problems we have as a culture,” according to Tracheopteryx.","Currently, the extent of Coordinape’s tools is deciding the compensation of the contributors within a circle. The execution of the actual compensation happens off-chain.","Specifically, Coordinape converts the results at the end of the epoch into a Comma Separated Values (CSV) file which lists what percentage of GIVE tokens each contributor in the circle received. Users can then export the CSV and use it to process compensation payments off-chain.","However, later this summer Coordinape expects to launch its first smart contract product called CoVaults, which, according to Zemm, is a “custom-built escrow contract that we’ve been developing over the last year that allows people to deposit funds into a vault and manage how those funds get distributed out to a collection of circles.”","If people want to escrow ERC-20 tokens into a vault and have on-chain distribution execute automatically, they can do that now with CoVaults, factory-type contracts that are minted and managed by the owners.","By virtue of distributing on-chain, Coordinape allows contributors to know that resources for a project’s compensation have been placed in the vault and trust that funds will be distributed seamlessly when the epoch is over. Additionally, users of CoVaults have the option to earn yield on deposited funds for payroll through their integration with Yearn Finance.","Emphasizing simplicity, Anderson adds, “With CoVaults, people have a one stop shop because it’s a much more complete user experience where you can come deposit funds, start a circle, run the epoch and disperse the funds seamlessly all in one place.”","According to Tracheopteryx, CoVaults is one important Lego block in the future roadmap to create infrastructure that allows for truly self-sovereign labor.","“We’re in a critical time on planet Earth right now,” Anderson says. “We are facing a lot of really wicked challenges that require collaboration at a global scale.” Despite being in the clumsy toddler stage where awkwardness persists, DAOs, according to Coordinape, might be one of the solutions that can help. If DAOs are to be successful, a lot of things are needed, and one of them is for people to be rewarded fairly for contributing in them.","Coordinape, in pursuit of making a natural free flow reward system, is trying to create new ways for human beings (or silly apes) to coordinate. Quoting writer William Gibson, Tracheopteryx said, “The future is already here. It’s just not evenly distributed.”","'We're Freaking DAOing It': The People Who Think DAOs Are the Future of Work","Meet the pioneers who work at decentralized autonomous organizations.","Chase Chapman on DAOs and Professional Polyamory","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","What It Takes to Get a Job in Crypto","CoinDesk asked a variety of crypto professionals how they got their foot in the door in the industry."],"entity":[{"type":"Coordinape","content":"LOCATION"},{"type":"Tracheopteryx","content":"PERSON"},{"type":"CSV","content":"ORGANIZATION"},{"type":"William Gibson","content":"PERSON"},{"type":"Zack Anderson","content":"PERSON"},{"type":"Anderson","content":"PERSON"},{"type":"Coordinape’s Gift Circle","content":"ORGANIZATION"},{"type":"Gift Circle","content":"ORGANIZATION"},{"type":"Bankless Nation","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"David Hoffman","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Coordinape","content":"ORGANIZATION"},{"type":"Zemm","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"Chapman","content":"PERSON"},{"type":"Tracheopteryx, CoVaults","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Tracheopteryx","content":"ORGANIZATION"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Comma Separated Values (CSV","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Future of Work Week","Compensation"],"authors":["Sage D. Young"]}