{"summary":"Bonk's proponents hope to increase the meme coin's user base by 500,000.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/14\/revolut-to-list-bonk-distribute-12m-of-meme-coin-in-learn-campaign\/","publishDate":"2024-02-14T19:16:55","id":15747,"type":null,"title":"Revolut to List Bonk, Distribute $1.2M of Meme Coin in 'Learn' Campaign","category":["Finance"],"content":["European banking fintech Revolut plans to list Solana's biggest meme coin Bonk and run a $1.2 million campaign to incentivize its users to learn about the cryptocurrency, according to a person familiar with the matter.","The \"learn\" campaign plan still requires approval from BONK's governing council, which oversees the project's $100 million+ treasury of BONK tokens. At press time the approval vote had almost reached quorum with six of the council's 12 members voting in favor and none against. Participants expect it to pass.","Revolut declined to comment.","The listing is set to continue BONK's march into mainstream crypto trading venues after a searing end to 2023 that saw it increase 19,000% in price since Nov. 1, per CoinMarketCap. Coinbase, Binance and other top exchanges listed it during that time.","BONK is a token launched by Solana blockchain enthusiasts in the aftermath of FTX's November 2022 implosion as a way to bring some cheer to the hurting ecosystem. It has since emerged as Solana's biggest meme coin that many applications built on Solana use as an incentive mechanism.","Revolut, too, plans to distribute BONK to some of its users as a reward for their learning about BONK through the app.","The proposal being voted on by BONK's council will automatically earmark 93 billion BONK tokens (worth $1.2 million) for the learn campaign, a person familiar with the plans said. The campaign aims to increase BONK's user base by 500,000, the proposal said.","A contributor to BONK said the token's proponents have \"lots in the works\" to further spread the meme coin's adoption in the coming months.","Edited by Nikhilesh De.","\n"],"entity":[{"type":"93 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1.2 million","content":"MONEY"},{"type":"Bonk","content":"PERSON"},{"type":"BONK","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nov. 1","content":"DATE"},{"type":"19,000%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"November 2022","content":"DATE"}],"hashtag":["Bonk","Revolut","Exchange","meme coin"],"authors":["Danny Nelson"]}