{"summary":"Rising demand for APIs helped Prime Trust grow its footprint across crypto, said CFO Rodrigo Vicuna.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/12\/22\/this-behind-the-scenes-crypto-firm-saw-2000-account-growth-in-2021\/","publishDate":"2021-12-22T15:15:05","id":15745,"type":null,"title":"This Behind-the-Scenes Crypto Firm Saw 2,000% Account Growth in 2021","category":["Finance"],"content":["Prime Trust, one of the crypto industry’s behind-the-scenes operators, saw its fintech rails surge in popularity this year as new business clients piled in, Chief Financial Officer Rodrigo Vicuna told CoinDesk.","The Las Vegas-based infrastructure company is now “in the millions of users,” Vicuna said, after accounts ballooned 2,000% year over year. Its business-facing network of application programming interfaces (APIs) for know-your-customer (KYC) checks, trading, debit card issuance, retail settlement and crypto on- and off-ramps gets pinged 300 million times a month, he said.","With clients including FTX, Binance.US, Securitize, Dapper and Kraken, Prime Trust gets exposure to some of crypto’s hottest corners, everything from derivatives trading to non-fungible tokens (NFTs).","Businesses can pick and choose which APIs to plug into depending on their needs. Vicuna said it saves them time while increasing Prime Trust’s footprint in the fast-growing ecosystem.","“You can think of us as the best indicator of adoption within the market,” Vicuna said, “because we are so widely spread out across different segments via crypto exchanges-on ramps, wealth apps, lending platforms and more.”","Much of the action flows through in fiat. PrimeX, the company’s cash settlement layer, processed an average of $3.5 billion a month by the end of 2021. That’s up 40% from Prime Trust’s last reported totals.","The booming figures follow Prime Trust’s $64 million Series A in July. It’s since doubled headcount to “the couple hundreds” – Vicuna declined to provide specifics – and doubled-down on marketing after realizing “word of mouth” alone was not aggressive enough.","Read more: Prime Trust Raises $64M to Scale Fintech Infrastructure Biz","Compliance has been a key growth area, Vicuna said. Nearly half the company is dedicated to policing its business endeavors. They also “sell compliance as a service” to market players, alongside their other offerings.","As for the company’s own growth, Vicuna predicted a busy 2022. He cast doubt that this year’s massive influx of venture capital across the space could continue its breakneck pace through another 12 months and predicted the market “will return a little bit to fundamentals.”"],"entity":[{"type":"$64 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Chief Financial Officer Rodrigo Vicuna","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Scale Fintech Infrastructure Biz","content":"ORGANIZATION"},{"type":"2,000%","content":"PERCENT"},{"type":"Vicuna","content":"PERSON"},{"type":"$64M","content":"MONEY"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Prime Trust","content":"ORGANIZATION"}],"hashtag":["Prime Trust","APIs"],"authors":["Danny Nelson"]}