{"summary":"The U.S. factory activity unexpectedly expanded in March, data released Monday showed, sending the dollar index higher.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/02\/bitcoin-drops-over-5-as-upbeat-us-factory-data-powers-dollar-index-to-nearly-5-month-high\/","publishDate":"2024-04-02T05:33:48","id":15740,"type":null,"title":"Bitcoin Drops Over 5% as Upbeat U.S. Factory Data Powers Dollar Index to Nearly 5-Month High","category":["Markets"],"content":["Bitcoin (BTC) faced selling pressure during Asian trading hours on Tuesday as upbeat U.S. factory data lifted the dollar index (DXY) to the highest since mid-November.","The leading cryptocurrency by market value fell 4% to $66,342 in a bearish resolution of the recent week-long consolidation between $68,000 and $72,000, CoinDesk data show. The broader crypto market nursed losses, with ether (ETH), Solana's SOL and Dogecoin (DOGE) registering more significant losses. Meanwhile, the broader CoinDesk 20 index fell nearly 8%.","The dollar index, which tracks the greenback’s value against major fiat currencies, topped the 105 mark for the first time over four months, taking the four-week gain to 2.58%. A stronger dollar makes dollar-denominated assets like bitcoin and gold expensive, potentially leading to lower demand. Besides, sustained dollar strength is known to cause financial tightening worldwide, denting investors’ willingness to take risks.","The Institute for Supply Management’s (ISM) manufacturing purchasing manager’s index (PMI) released Monday showed that factory activity unexpectedly expanded in March, the first growth since September 2022.","The PMI rose 2.5 points to 50.3 last month following February’s 47.8 reading. The headline figure crossed into expansion territory above 50, halting 16 straight months of contraction and weakening the case for Fed rate cuts. The new orders index also moved back into expansion territory and the prices index jumped to 55.8%, up 3.3 percentage points compared to the reading of 52.5% in February.","According to Bloomberg, the amount of Fed rate cuts priced into swap contracts for this year has declined to less than 65 basis points following the manufacturing report. In other words, the market now expects the Fed to walk back on its forecast of three 25-basis point rate cuts for 2024. The probability the Fed will deliver the first rate cut in June has dropped below 50%.","“Markets are focused on the ISM report, though, with 10Y Treasury yields up 10bp on the back of the return of manufacturing growth and higher inflation readings from the sector. There are 20 or so individual Federal Reserve speeches this week, and the market is likely thinking that today’s outcome will make officials wary of committing to significant policy easing,” analysts at ING said in a note to clients on Monday.","Some analysts, however, believe the ballooning fiscal debt will eventually force the Fed to cut rates rapidly, offering a major bullish tailwind to crypto prices. The Fed raised rates from zero to 5.5% in 16 months to July 2023 to tame inflation. The so-called tightening was partly responsible for bitcoin’s 80% price crash in 2022.","Looking ahead, bitcoin may remain volatile for some time as several job reports are lined up this week, including Friday’s nonfarm payrolls figure and the unemployment rate. Besides, Bitcoin blockchain’s quadrennial mining reward halving is due later this month.","Edited by Parikshit Mishra."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"52.5%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$72,000","content":"MONEY"},{"type":"mid-November","content":"DATE"},{"type":"$68,000","content":"MONEY"},{"type":"55.8%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"2.58%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"ING","content":"ORGANIZATION"},{"type":"5.5%","content":"PERCENT"},{"type":"Institute for Supply Management","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"$66,342","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"July 2023","content":"DATE"}],"hashtag":["Bitcoin","Markets","Federal Reserve","Dollar index"],"authors":["Omkar Godbole"]}