{"summary":"A Thai lawmaker is seeking a court order to shut down Facebook in the country by the end of the month, accusing the platform of supporting fraudulent investment schemes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/08\/22\/thailand-warn-meta-to-rein-in-crypto-scams-or-face-expulsion\/","publishDate":"2023-08-22T07:46:38","id":15756,"type":null,"title":"Thailand Warns Meta to Rein In Crypto Scams or Face Expulsion","category":["Policy"],"content":["Thailand’s Ministry of Digital Economy and Society (DES) has told Meta's (META) Facebook to curb the number of fraudulent crypto investment scams being advertised on the site, or risk being expelled from the country.","These fraudulent ads have affected more than 200,000 people, according to a statement published on the Ministry’s website. Chaiwut Thanakmanusorn, the Minister in charge of DES has asked a Thai court to prepare an order that would shut down Facebook by the end of the month if the platform doesn’t comply.","Over the course of three years, Facebook (now known as Meta) has gradually eased its restrictions on cryptocurrency and blockchain-related advertisements, CoinDesk has previously reported, broadening the criteria and accepted regulatory licenses for running such ads.","In March 2022, the company was sued by the Australian Competition and Consumer Commission for allegedly engaging in false, misleading, or deceptive conduct by publishing scam crypto ads linked to prominent Australian celebrities.","Edited by Parikshit Mishra."],"entity":[{"type":"Meta)","content":"ORGANIZATION"},{"type":"Consumer Commission","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Thailand’s Ministry of Digital Economy and Society","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"}],"hashtag":["Facebook","Meta","Thailand"],"authors":["Sam Reynolds"]}