{"summary":"Hopes for a spot bitcoin ETF and the latest regulatory actions could prove to be further catalysts.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/09\/18\/bitcoins-crypto-market-dominance-rises-to-50-and-it-could-go-higher-say-analysts\/","publishDate":"2023-09-18T21:32:33","id":15755,"type":null,"title":"Bitcoin’s Crypto Market Dominance Rises to 50% and It Could Go Higher, Say Analysts","category":["Markets"],"content":["Bitcoin (BTC) has been running in place for the last month – its current price of $26,700 essentially flat from 30 days ago – but its market dominance has been on the rise as risks rise for the rest of the cryptocurrency sector.","The Bitcoin market dominance rate, which tracks the largest cryptocurrency's share of the total digital asset market, rose to 50.2% earlier on Monday, its strongest level in a month and near a 26-month high of 52% reached at the end of June.","Taking a broader view, bitcoin’s market dominance was in a range between 39% and 49% for more than two years before it broke out to that 52% level in June after asset manager BlackRock’s filing for a spot BTC exchange-traded fund spurred hopes about unleashing massive inflows into the asset.","Markus Thielen, research head at crypto services provider Matrixport, explained in an interview Monday with CoinDeskTV that BTC enjoys more “potential buying pressure” from the ETF listings, while alternative cryptocurrencies – also known as altcoins – may be on the brink of breaking lower. He noted bankrupt exchange FTX’s token sales, declining Ethereum protocol revenues and upcoming token unlocks – which allow venture capital investors to sell tokens – among risks on the altcoin market.","“BTC peaked so far this year in July, while ETH peaked in April,” Thielen said. “All these [ETF] announcements haven’t really benefitted altcoins, not even ether.”","Macro analyst Noelle Acheson noted that bitcoin would likely benefit from the latest regulatory changes proposed by the New York Department of Financial Services (NYFDS) Monday, including stricter rules to list cryptocurrencies on exchanges while simultaneously green-listing BTC as a digital asset that license holders can list or custody without further regulatory hurdles.","“The immediate impact on crypto markets could be further rotation into BTC, as it consolidates its status as the ‘safe’ crypto asset,” Acheson wrote in a newsletter.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Matrixport","content":"PERSON"},{"type":"Thielen","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"50.2%","content":"PERCENT"},{"type":"Markus Thielen","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"52%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"39%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"49%","content":"PERCENT"},{"type":"$26,700","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Noelle Acheson","content":"PERSON"}],"hashtag":["Bitcoin","Dominance rate","Bitcoin Dominance Rate","Markets","Matrixport"],"authors":["Krisztian Sandor"]}