{"summary":"An order by the New Jersey Bureau of Securities had already been delayed once.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/07\/28\/blockfi-gets-more-time-from-nj-regulators-before-new-interest-accounts-are-banned\/","publishDate":"2021-07-28T21:58:13","id":15753,"type":null,"title":"BlockFi Gets More Time From NJ Regulators Before New Interest Accounts Are Banned","category":["Markets"],"content":["","Crypto lender BlockFi has been given at least another month before the New Jersey Bureau of Securities (NJ BOS) will enforce a ban on the creation of new BlockFi Interest Accounts (BIAs).  ","","","BlockFi tweeted on Wednesday that the postponement followed ongoing talks between BlockFi and NJ BOS “to provide more details about the BIA.”  ","","","NJ BOS’s order was originally set to go into effect on July 22, and then was delayed until Thursday. ","","","BlockFi is facing similar scrutiny of its interest-bearing crypto accounts from Texas and Alabama. In its tweet, BlockFi said it is in \"active dialogue with multiple regulators\" regarding its BIAs.","","","NJ BOS has argued that the BlockFi Interest Accounts amount to unregistered securities, while BlockFi has said that they are not.","","","“We firmly believe that the BIA is lawful and appropriate for crypto market participants, and we remain steadfast in our commitment to fight for consumers rights to earn interest on their crypto assets,” BlockFi wrote in its tweet on Wednesday.","","","BlockFi had no additional comment on the matter, while the NJ BOS could not be immediately reached.","","","BlockFi has maintained that the New Jersey order does not affect existing BlockFi customers or any of its other products, a claim the NJ BOS order appears to support. ","","","Less clear, though, is the extent to which this could affect new BlockFi customers and whether the order’s impact could spread beyond New Jersey.","","","NJ BOS has said BlockFi holds $14.7 billion in assets through its BIA product, although how much of that is held by New Jersey consumers is unclear. ","","","The New Jersey-based company has indicated it plans to go public in the next 12 to 18 months.","","","Danny Nelson contributed reporting.",""],"entity":[{"type":"July 22","content":"DATE"},{"type":"NJ BOS","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"BlockFi","content":"PERSON"},{"type":"Alabama","content":"LOCATION"},{"type":"next 12","content":"DATE"},{"type":"$14.7 billion","content":"MONEY"},{"type":"Danny Nelson","content":"PERSON"},{"type":"New Jersey Bureau of Securities (NJ BOS","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"BIA","content":"ORGANIZATION"}],"hashtag":["New Jersey","Cryptocurrency Regulations","BlockFi"],"authors":["Nelson Wang"]}