{"summary":"Crypto exchange Bitfinex holds bitcoin on its balance sheet.\nBitfinex has historically kept part of its trading fee earnings in bitcoin, a source said.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248984\/bitfinex-bitcoin-balance-sheet","publishDate":"2023-09-04T09:59:27","id":1575,"type":null,"title":"Crypto exchange Bitfinex holds bitcoin on its balance sheet","category":["Exchanges"],"content":["Crypto exchange Bitfinex holds bitcoin on its balance sheet, a source with direct knowledge of the matter told The Block.","Bitfinex has historically kept part of its trading fee earnings in bitcoin as a long-term commitment to the world's first and largest cryptocurrency, the source said, declining to comment on absolute figures.","Bitfinex CTO Paolo Ardoino <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1698346253396881518\" data-v-f87c67ca=\"\">tweeted<\/a><span data-v-f87c67ca=\"\"> Sunday that crypto exchanges that have \"hugely benefitted\" from bitcoin should have a policy to reinvest part of the profits into bitcoin. That's what Bitfinex does, by supporting <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.33%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 networks — the Lightning Network and the Liquid Network — and by developing on the RGB protocol that allows for cheaper and more private transactions, making it easier to issue tokens on Bitcoin, Ardoino posted.<\/span>","\"Bitfinex reinvests in Bitcoin technology,\" Ardoino told The Block while commenting on the tweet. \"It's much more than simply buying bitcoin.\"","The news that Bitfinex holds bitcoin on its balance sheet hasn't been previously reported. Meanwhile, Bitfinex's sister firm and stablecoin issuer <a href=\"https:\/\/www.theblock.co\/post\/243310\/tether-bitcoin-11th-largest-holder\" data-v-f87c67ca=\"\">Tether is the 11th largest bitcoin holder<\/a> in the world, The Block reported last month.","<a href=\"https:\/\/www.theblock.co\/post\/230241\/tether-attestation-report-q1-2023\" data-v-f87c67ca=\"\">Tether first revealed<\/a>&nbsp;its bitcoin holdings in the first quarter of this year, when it said it will invest up to 15% of its profits in bitcoin on a regular basis as it shifts its reserves toward crypto and away from U.S. government debt. The stablecoin issuer currently holds about $1.6 billion worth of bitcoin.","Bitfinex and Tether are among a few firms that hold bitcoin on their balance sheets. Other such firms include MicroStrategy, Tesla and Square.","Bitcoin is currently trading at around $25,900, according to CoinGecko data."],"hashtag":["BITCOIN","TETHER"]}