{"summary":"Gemini announced that its Earn program will be unable to meet customer redemptions in the service-level agreement&#x27;s time frame of 5 days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187534\/gemini-earn-unable-to-meet-customer-redemptions-as-genesis-unit-pauses-withdrawals","publishDate":"2022-11-16T08:35:15","id":1575,"type":null,"title":"Gemini Earn unable to meet customer redemptions as Genesis unit pauses withdrawals","category":["COMPANIES"],"content":["Crypto exchange Gemini said its Earn program \"will not be able to meet customer redemptions within the service-level agreement of five business days\" following the announcement that lending partner Genesis Global Capital has paused withdrawals.","\"The past week has been an incredibly challenging and stressful time for our industry,\" Gemini <a href=\"https:\/\/www.gemini.com\/blog\/an-important-message-regarding-gemini-earn\" data-v-f87c67ca=\"\">wrote<\/a> in an official blog post, continuing:","\"We are disappointed that the Earn program SLA will not be met, but we are encouraged by Genesis’ and its parent company Digital Currency Group’s commitment to doing everything in their power to fulfill their obligations to customers under the Earn program. We will continue to work with them on behalf of all Earn customers. This is our highest priority. We greatly appreciate your patience.\"","Gemini stressed that its other products and services are unaffected and that it is a full-reserve exchange and custodian.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"PERSON"},{"type":"Genesis’","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"SLA","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}