{"summary":"DeFi (decentralized finance) has expanded its frontiers beyond the imagination of users. From a TVL of just over USD 1 billion in June 2020, to the current staggering USD 80 billion, its exponential growth is becoming a focal point to measure the massive activity in the world of finance, not just the token economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114182\/mdex-an-overlooked-decentralized-exchange","publishDate":"2021-08-11T08:50:28","id":1576,"type":null,"title":"MDEX: An Overlooked Decentralized Exchange?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">DeFi (decentralized finance) has expanded its frontiers beyond the imagination of users. From a <\/span><a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TVL<\/span><\/a><span data-v-f87c67ca=\"\"> of just over USD 1 billion in June 2020, to the current staggering USD 80 billion, its exponential growth is becoming a focal point to measure the massive activity in the world of finance, not just the token economy. The genesis of the various chains and DeFi platforms fuels positive growth the industry has been embarking on as a whole. <\/span>","<span data-v-f87c67ca=\"\">Decentralized exchanges have been one of the DeFi platforms <\/span><span data-v-f87c67ca=\"\">incurring massive gains and driving greater financial revolution, especially automated market making (AMM) DEXes that trade automatically using liquidity pools replacing buyers and sellers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to <\/span><a href=\"https:\/\/debank.com\/projects\/heco_mdex?chart_date=1Y&amp;mode=stats\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statistics<\/span><\/a><span data-v-f87c67ca=\"\"> from DeBank, one of the AMM-based DEXes, <\/span><a href=\"https:\/\/mdex.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MDEX.COM<\/span><\/a><span data-v-f87c67ca=\"\"> created an uproar in the market back in late February by recording the highest 24-hour trading volume historically, surpassing USD 4.64 billion. The cumulative number of wallet addresses for MDEX on both the HECO and BSC chains, stands at 1,007,884. In terms of users, it ranks amongst the top 3 DEXes, after Pancakeswap and Uniswap and ahead of Sushiswap.<\/span>","<b data-v-f87c67ca=\"\">Low Fees or Zero Fees<\/b>","<span data-v-f87c67ca=\"\">A main reason for the popularity of the platform is directly linked to the low or zero fees on MDEX, which touts a dual mechanism of liquidity and transaction mining, the latter of which allows users’ BTC transactions to cost almost nothing in terms of handling fees. The fee model adopted by MDEX can drive massive activity, especially for traders who execute numerous trades daily.<\/span>","<span data-v-f87c67ca=\"\">Leveraging HECO (Huobi Eco-chain) and BSC (Binance Smart Chain), the platform has been able to offer low fees and a high level of efficiency enabling fast transactions of approximately only 3 seconds each. As the first DEX app on HECO, MDEX is the biggest AMM in the HECO ecosystem, accounting for about 80% of the entire HECO&nbsp;<\/span><span data-v-f87c67ca=\"\">TVL.<\/span>","<b data-v-f87c67ca=\"\">An Intuitive User Experience<\/b>","<span data-v-f87c67ca=\"\">The platform has also been upgrading consistently to improve user experience for its traders. It recently launched a new version of the ‘quotation’ function which allows users to fetch price quotes in real-time, certainly a welcome utility for traders.<\/span>","<span data-v-f87c67ca=\"\">The aim is to be a simple and user-friendly interface, a move to cater to more users, especially those who are more familiar with trading in a centralized exchange (CEX) environment. These users can retain their old trading habits while transitioning over to DEX trading to enjoy a more decentralized and secure environment.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Room for Growth<\/b>","<span data-v-f87c67ca=\"\">Comparing statistics across the top DEXes in the space, <\/span><a href=\"https:\/\/mdex.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MDEX.COM<\/span><\/a><span data-v-f87c67ca=\"\"> seems to have been overlooked.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The platform is a relatively young DEX, compared to its peers Uniswap, Sushiswap and Pancakeswap. Its initial explosive growth in terms of trading volumes, combined with its expansion over to the BSC networks from HECO-chain, not to mention the continuing development of the platform to be a multi-chain ecosystem encompassing DEX, DAO and IDO\/IMO capabilities, are definitely strong indicators of the looming potential of the project.&nbsp;<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pancakeswap","content":"ORGANIZATION"},{"type":"June 2020","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"USD 1 billion","content":"MONEY"},{"type":"DeBank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"IMO","content":"ORGANIZATION"},{"type":"Pancakeswap","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"USD 80 billion","content":"MONEY"},{"type":"4.64 billion","content":"MONEY"},{"type":"BSC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}