{"summary":"Se sei ONE dei milioni di persone che hanno acquistato Cripto per la prima volta nel 2021, potresti avere una sorpresa quando pagherai le tasse.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/you-may-owe-crypto-taxes-on-these-surprising-things-in-2022\/","publishDate":"2022-02-17T18:13:45","id":15768,"type":null,"title":"Potresti dover pagare tasse Cripto per queste cose sorprendenti nel 2022","category":["Learn"],"content":["Le Cripto potrebbero essere nate come un’economia discreta e decentralizzata, ma ora che il settore da quasi 2 trilioni di dollari è diventato abbastanza mainstream da occupare l’ ambito spazio pubblicitario del Super Bowl , l’Internal Revenue Service (IRS) ne è ben informato.","L'IRS classifica la Criptovaluta come proprietà immateriale a fini fiscali, il che significa che i profitti ottenuti dalla vendita di valuta virtuale sono soggetti alle imposte sulle plusvalenze. Ciò vale sia che tu abbia acquistato Bitcoin o altcoin su uno scambio Cripto come Coinbase, sia che tu abbia semplicemente utilizzato un'app come Venmo o PayPal per acquistare e utilizzare Criptovaluta.","Quest'anno è in prima linea nelle menti dei professionisti fiscali: TurboTax ora chiede in anticipo quando inizi la dichiarazione dei redditi 2021 se hai scambiato o meno Cripto l'anno scorso. E se registri le tasse su carta con l'aiuto di un commercialista certificato (CPA), dovresti almeno essere pronto a comunicare loro i tuoi guadagni in Cripto del 2021. (Questo è più semplice quando colleghi il tuo portafoglio a un'app di monitoraggio del portafoglio Cripto in grado di calcolare le plusvalenze e le perdite in conto capitale in pochi minuti.)","Questo pezzo fa parte della Tax Week di CoinDesk .","Ma cosa considera esattamente l’IRS come “guadagno” quando si tratta di Cripto – e cosa innesca un evento imponibile? Diamo un'occhiata a come l'IRS classifica i seguenti scenari.","Ti è stato regalato un NFT , hai acquistato beni di uso quotidiano con Cripto o hai guadagnato abbastanza Cripto per spingerti in una nuova fascia fiscale? Ecco alcune comuni tasse Cripto “a sorpresa” e come gli esperti suggeriscono di rimanere preparati.","Le Cripto sono state un regalo popolare l'anno scorso. Secondo un sondaggio BlockFi , ONE persona su 10 ha regalato Cripto come regalo di Natale.","Per quanto entusiasmante possa essere la Cripto , se l'hai regalata, dovresti essere a conoscenza delle regole dell'IRS sui regali. Esiste una soglia di regalo di $ 15.000 per il 2021, il che significa che il donatore T deve pagare le tasse sul regalo purché valga $ 14.999 o meno. Se il valore della donazione supera i 15.000 dollari, l'onere fiscale ricade sul generoso donatore, che deve compilare il modulo IRS 709 .","\"Se i miei genitori mi danno 10.000 dollari in Bitcoin , per me non è un reddito imponibile\", ha affermato David Kemmerer , CEO e co-fondatore di CoinLedger, un software di reporting fiscale Cripto .","Ma ci sono alcune sfumature. Se ti vengono regalate Cripto e queste acquistano valore e realizzi una plusvalenza quando le vendi (per dollari USA o per un'altra Criptovaluta), ti verrà richiesto di pagare le imposte sulle plusvalenze sull'importo che hai guadagnato, non sull'intero importo l'hai venduto per.","Anche le imposte sulle plusvalenze vengono calcolate in base al reddito e al tempo in cui hai detenuto il bene prima di venderlo. (Ulteriori Imparare su come l'IRS calcola le imposte sulle plusvalenze .)","Chiunque sui social media avrà ormai probabilmente sentito parlare di token non fungibili (NFT) , ma pochi sanno come vengono tassati.","Continua a leggere: 5 cose da ricordare quando si pagano le tasse NFT","L'IRS deve ancora rilasciare indicazioni definitive sugli NFT, ma vale la pena notare che le autorità fiscali britanniche hanno recentemente effettuato il primo sequestro di NFT nel paese durante un'indagine per frode e un giro di vite fiscale. Naturalmente, i cittadini statunitensi T possono rivolgersi ad altri paesi per avere indicazioni fiscali precise, ma diventa ogni giorno più chiaro che i consumatori T dovrebbero cercare di nascondere gli acquisti e le operazioni NFT sotto il tappeto.","Fino a quando l’IRS non pubblicherà linee guida più sfumate, i professionisti fiscali consigliano di trattare gli NFT come asset virtuali proprio come qualsiasi altra Cripto. Ci sono tre cose a cui prestare attenzione qui:","ONE possibilità è che l’IRS possa classificare gli NFT come oggetti da collezione, simili a francobolli, oggetti d’antiquariato o carte collezionabili. Se lo facessero, le tasse sulle plusvalenze sarebbero leggermente più alte del normale, con un’aliquota del 28%. Per ora, la maggior parte dei commercialisti suggerisce di attenersi alle normali leggi sulle plusvalenze, anche se ciò potrebbe sempre cambiare.","Un numero crescente di persone in tutto il mondo sta guadagnando un reddito aggiuntivo tramite videogiochi play-to-earn che premiano i giocatori con token Finanza decentralizzata ( DeFi ) che possono avere un valore reale e possono essere scambiati con valute Cripto o fiat (governative).","Continua a leggere: Evita i grattacapi legati alle tasse Cripto : cosa devi sapere se hai acquistato o venduto Cripto nel 2021","Sebbene questa nuova fonte di denaro abbia avvantaggiato molti, le Cripto guadagnate con questi giochi online non sono esenti da tasse.","\"I token premio rientreranno in una fascia imponibile simile a quella dei premi in staking\", ha affermato Kate Waltman , una commercialista che si concentra su Criptovaluta e risorse digitali. Lo “ staking ” è un processo DeFi avanzato che consente ai trader di guadagnare un reddito passivo sulle loro Cripto in cambio del blocco della blockchain per un periodo di tempo (di solito mesi). T tutti i giocatori sono necessariamente esperti in DeFi, quindi è importante che siano consapevoli di come l'IRS tasserà i loro guadagni in Cripto .","\"Questi premi saranno tassabili, rispetto ai videogiochi tradizionali in cui potresti guadagnare premi nel gioco, ma sono utilizzabili solo all'interno del gioco\", ha detto Waltman. \"La parte difficile qui T è tanto sapere che è tassabile, ma piuttosto sapere come valutiamo quei gettoni?\"","Secondo Waltman, l'IRS T ha ancora offerto una regolamentazione concreta rispetto a questi dettagli. \"Penso che molte persone abbiano giocato ai videogiochi e guadagnato gettoni di ricompensa Cripto e potrebbero non rendersi conto che in realtà hanno un valore\", ha detto.","Secondo Waltman, molte persone hanno guadagnato soldi con le Cripto lo scorso anno. Alcuni, quindi, hanno superato per la prima volta la soglia di reddito lordo rettificato (AGI) di 200.000 dollari e potrebbero avere tasse più alte del normale.","In questo caso, i nuovi percettori di reddito elevato dovranno pagare la Net Investment Income Tax (NIIT), un'imposta del 3,8% che viene aggiunta alle plusvalenze, ai dividendi e ai redditi da royalty.","\"Se sei un individuo e il tuo reddito lordo rettificato supera i $ 200.000, allora attivi questa imposta sul reddito netto da investimenti in aggiunta alla normale imposta sulle plusvalenze che stai già pagando\", ha affermato Waltman.","La soglia di reddito sale a 250.000 dollari per le persone sposate che presentano la dichiarazione congiunta, e scende a 125.000 dollari per quelle sposate che presentano la dichiarazione separatamente.","Imparare di più sul NIIT sul sito web dell'IRS .","L'acquisto di beni e servizi con Cripto , anche piccoli acquisti come l'acquisto di un caffè, potrebbe innescare un evento imponibile agli occhi dell'IRS.","Ecco perché: il pagamento degli oggetti di uso quotidiano implica lo scambio di una valuta digitale (ad esempio Bitcoin, Ethereum, Dogecoin, ETC.) con valuta fiat (ad esempio il dollaro USA). Le carte di debito Cripto prepagate e le carte di credito Cripto rendono questo processo così semplice che potrebbe non sembrare che valga la pena dirlo all'IRS. Tuttavia, piccole transazioni durante tutto l’anno possono equivalere a una somma significativa. Coloro che acquistano beni e servizi di uso quotidiano con le Cripto dovrebbero quindi KEEP un buon registro.","Questo ci porta al punto successivo…","\"Quindi questi sono davvero interessanti\", ha detto Waltman. \"Dal punto di vista fiscale, è piuttosto complesso.\"","Le popolari carte di debito e credito Cripto come Gemini Mastercard e la carta premio Bitcoin BlockFi hanno reso semplice l'acquisto di articoli nel negozio utilizzando Cripto. Inoltre, gli utenti possono guadagnare premi in Cripto , come il 3% in Bitcoin sulla spesa.","Queste carte possono semplificare la rendicontazione Cripto dell'IRS o, in altri casi, aprirle a Eventi ancora più tassabili con le loro Cripto.","Continua a leggere: I 7 tipi di incubi fiscali Cripto","I premi generalmente T sono tassabili, ha osservato Waltman, e sono trattati proprio come i punti della carta di credito e le miglia aeree guadagnate dopo aver soddisfatto determinate condizioni di spesa. I consumatori che utilizzano carte di debito che consentono loro di spendere in dollari statunitensi ma guadagnare in Cripto T devono segnalare i loro premi finché non li scambiano con fiat o un'altra Criptovaluta tramite un acquisto o su uno scambio.","\"È un modo davvero interessante per iniziare ad accumulare e acquisire Cripto senza che diventino immediatamente un reddito imponibile\", ha affermato Waltman.","Tuttavia, se la tua carta fedeltà in Cripto è una carta prepagata e stai effettivamente pagando con un saldo in Cripto ogni volta che fai scorrere la carta, dietro le quinte si verifica uno scambio che richiede la segnalazione dell'IRS.","\"Bitpay, ad esempio, ti consente di pagare con le tue Cripto\", ha detto Waltman. “Quando fai scorrere la carta, questa effettua una conversione molto rapida e contemporanea Per te da Bitcoin a fiat. Questo scambio porterà plusvalenze”.","Continua a leggere: Una guida completa alle tasse Cripto statunitensi nel 2022","CORREZIONE (17 febbraio, 17:05 UTC): l'articolo originariamente affermava che il destinatario di un dono superiore a $ 15.000 potrebbe dover dichiararlo come reddito, ma è stato corretto per dire che l'unico donatore di un dono è responsabile delle spese associate rendicontazione fiscale.","Le Cripto T ti salveranno dalle tasse, ma alla fine potrebbero renderle più facili da pagare, afferma il futurista Dan Jeffries.","La guida fiscale è in ritardo rispetto all’innovazione. Lo stesso vale per il software fiscale. Nel frattempo abbondano le idee sbagliate. Se non fanno attenzione, gli investitori possono finire per dover pagare più tasse del previsto e dover scaricare Cripto per pagare il conto","Gli investitori in MicroStrategy, Tesla, Block e Coinbase devono considerare in che modo le oscillazioni selvagge dei prezzi influenzeranno i risultati, non solo direttamente ma indirettamente a causa delle complesse regole di contabilità fiscale."],"entity":[{"type":"3,8%","content":"PERCENT"},{"type":"Dan Jeffries","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"l’Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Secondo Waltman","content":"PERSON"},{"type":"$ 14.999","content":"MONEY"},{"type":"dalle tasse","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Cripto","content":"LOCATION"},{"type":"Cripto dell","content":"ORGANIZATION"},{"type":"David Kemmerer","content":"PERSON"},{"type":"Natale","content":"ORGANIZATION"},{"type":"Gemini Mastercard","content":"ORGANIZATION"},{"type":"$ 200.000","content":"MONEY"},{"type":"Kate Waltman","content":"PERSON"},{"type":"Una guida completa alle tasse Cripto","content":"ORGANIZATION"},{"type":"sia","content":"ORGANIZATION"},{"type":"fa parte della Tax Week di CoinDesk","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"dell","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"NIIT","content":"ORGANIZATION"},{"type":"$ 15.000","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"Waltman","content":"PERSON"},{"type":"quelle","content":"ORGANIZATION"},{"type":"ETC.","content":"LOCATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["industry","Beginner","Learn","tax week","Italian"],"authors":["Megan DeMatteo"]}