{"summary":"With U.S. regulations coming soon, the frauds, schemes and irresponsible investment management practices that led to the current market downturn will be things of the past, reasons Paul Brody of EY.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/04\/26\/us-crypto-regulations-end-crypto-winter-opinion\/","publishDate":"2023-04-26T14:26:14","id":15761,"type":null,"title":"Please Enjoy the Final Crypto Winter","category":["Consensus Magazine"],"content":["Got your skis on? If not, clip in and try to have some fun because this is going to be our very last crypto winter. We’ve had two or three, depending on how you count and this one has certainly been the worst and the most frustrating, but fortunately, it’s going to be the final one and let me explain why: Crypto and blockchain are on the cusp of becoming ordinary, regulated businesses. While it’s always extremely difficult to separate signals from noise, I see three big positive signs for the future.","Paul Brody is EY's global blockchain leader and a CoinDesk columnist.","The world of crypto and blockchain has always had an uncomfortable relationship between starry-eyed do-gooders (count me among that crowd) and ruthless opportunists trying to hijack that message to sell whatever they’ve come up with. One of things that has been immensely frustrating over the years is seeing the warnings we and others have made about the dangerous, speculative and downright absurd nature of some crypto and blockchain investments go unheeded. We (EY) warned about the abysmal track record of initial coin offerings (ICO) in 2018 and again in 2019 and we were hardly alone in expressing our concerns. Enforcement actions are much more effective than warnings and social-media flame-wars.","Many countries, the U.S. first and foremost, have complex and decentralized regulatory systems. If we can’t get everyone in the world of blockchain to agree upon what policies should be, we should not be surprised that regulators are not fully and immediately in agreement either. What is useful is that the legal system must try to make some consistent sense of how the law is applied. In those cases, regulators must present a clear and consistent opinion of what the law means. This clarity will take some time to emerge, but it is coming.","The boom-and-bust cycle of the tech industry tends to happen when expectations and excitement far outstrip the capacity of companies to actually deliver products and earn revenues. This happened in tech in the early 1980s, when video game consoles and PCs arrived on the scene but before the world had found the right applications to drive enterprise adoption. A second, much larger, boom cycle emerged in the late 1990s as network technologies and the internet generated tremendous excitement but not much in the way of revenue or profits. Not dissimilar to many blockchain and crypto business models in 2018-2022, the dot-com bubble saw companies go public or raise hundreds of millions of dollars without meaningful revenue streams, or occasionally without even well-structured business plans.","The parallels with the dot-com boom and related bust are worth remembering. Both industries saw huge growth in investment and valuations based on seemingly impossible promises of future capability. Back in 1999, about $350 billion in digital online transactions occurred and most of that was using legacy B2B systems such as Electronic Data Interchange (EDI), not consumer e-commerce from a web browser. Bold predictions made at the peak of the dot-com boom by major investment banks, academics and forecasting firms said that between $4 trillion and $6 trillion in online commerce would take place annually by 2005. This proved to be laughable. In fact, total e-commerce (of the consumer web-browser kind) reached $105 billion in 2005. No surprise that market valuations plunged and many of the generously funded companies involved went bust. In the year 2000 alone, nearly $1.75 trillion in technology market capitalization evaporated. For those of you keeping score at home, that is about $3 trillion in 2023 dollars and more than the entire market cap of the blockchain ecosystem.","And this is where the story gets interesting: Today, e-commerce and online business is everything we were promised in 1999. Total global e-commerce spending is estimated to be nearing $5 trillion in 2022. It topped $1 trillion in the U.S. alone in 2022. The market capitalization of the world’s top 10 technology companies is about $7 trillion. Technology stocks represent more of the U.S. stock market than the financial sector and the energy sector combined. And while there have been ups and downs, there hasn’t been a single technology bust since 2000. The reason for that is simple: Technology has become a regular industry where valuations are driven by revenue and profit growth, not starry-eyed predictions of the future.","The signs of maturing blockchain and crypto products and businesses are starting to emerge as well. While it’s early days yet overall, non-fungible tokens (NFT) seem to have found a permanent place in the user and business ecosystem both as collectibles and as digital trophies, tickets and proof of engagement or attendance. NFTs have become so simple and easy to make, anyone can offer them. Would you like my personal NFT for the month? Claim it here. At EY, “boring” businesses like supply chain management, product traceability and emissions tracking are all growing as industrial companies put blockchain to work for use cases that have nothing to do with financial engineering. Privacy technology (not to be confused with anonymity) has proven key to unlocking practical use cases among companies that want to leverage shared, public technology infrastructure without sharing their sensitive business information.","As we clear a path through the wreckage of the crypto winter, the same bright future is coming for the blockchain industry. Bad actors are going to jail. Rules are getting clearer. And, most importantly, the companies involved in this ecosystem are starting to build real products and have valuations based on revenue and profits. The result is that blockchain and crypto can become regular industries with regulated products and outputs that are widely accessible. As a regular industry we will still have ups and downs, but we’ll no longer have ridiculous booms and busts. So please enjoy this crypto winter. It’s the last one you’re getting.","Edited by Jeanhee Kim."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Today","content":"DATE"},{"type":"$7 trillion","content":"MONEY"},{"type":"$4 trillion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"1980s","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Paul Brody","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$3 trillion","content":"MONEY"},{"type":"$1 trillion","content":"MONEY"},{"type":"$105 billion","content":"MONEY"},{"type":"$6 trillion","content":"MONEY"},{"type":"$350 billion","content":"MONEY"},{"type":"late 1990s","content":"DATE"},{"type":"2005","content":"DATE"},{"type":"Electronic Data Interchange","content":"ORGANIZATION"},{"type":"$5 trillion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jeanhee Kim","content":"ORGANIZATION"},{"type":"$1.75 trillion","content":"MONEY"},{"type":"1999","content":"DATE"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"winter","content":"DATE"}],"hashtag":["Opinion","Crypto Winter","regulatory ambiguity","Regulations"],"authors":["Paul Brody"]}