{"summary":"Lost keys, stolen coins, failing chains – and now regulation – could affect CEL, a Celsius Network disclosure form said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/04\/22\/crypto-lender-celsius-says-its-cel-token-faces-regulatory-risks\/","publishDate":"2022-04-22T17:22:57","id":15764,"type":null,"title":"Crypto Lender Celsius Says Its CEL Token Faces ‘Regulatory Risks’","category":["Finance"],"content":["Crypto rewards token CEL “is susceptible” to “regulatory risks,” issuer Celsius Network, LLC warned customers for the first time this month.","The crypto lending company sharpened its “Risk Disclosures” messaging in recent days, carving out a section for the high-yield Celsius Earn Program, saying that it “may be considered a risky investment” and highlighting “regulatory” among the risks to CEL.","“As with other digital assets, CEL is susceptible to a wide variety of risks,” including coin thieves, lost keys, irreversible transactions and failing chains, the clause has read (with minor verbiage shifts) since October. The update places “regulatory risks” up there, too.","The company last week restricted new “Earn” program sign-ups in the U.S. to accredited investors.","“We have been in ongoing discussions with United States regulators regarding our Earn product,” the company said in an April 11 blog post. “As a result, there will be changes to the way our Earn product will work for users based in the United States.”","Last September, state securities regulators ordered Celsius to prove Earn wasn’t an unregistered security. Federal regulators are also said to be looking into Celsius. Neither effort has resulted in a settlement or fine, as is the case for crypto lending competitor BlockFi.","Read more: BlockFi Will Pay $100M in Settlement With SEC, State Regulators Over High-Yield Accounts: Report","Crypto lenders across the U.S. have faced a new wave of regulatory scrutiny in the past year.","They woo customers who lend them crypto with bank-beating returns; Celsius offered 18% annual percentage yield payouts at press time. Regulators say those products need more oversight into how companies generate such returns.","Celsius didn't immediately respond to a request for comment."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$100M","content":"MONEY"},{"type":"LLC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"April 11","content":"DATE"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"CEL","content":"ORGANIZATION"}],"hashtag":["Celsius","Crypto Lending"],"authors":["Danny Nelson"]}