{"summary":"The Financial Stability Board will recommend ways to oversee stablecoins and other digital assets to the G-20.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/07\/11\/global-financial-watchdog-fsb-to-propose-crypto-regulations-in-october\/","publishDate":"2022-07-11T10:39:30","id":15766,"type":null,"title":"Global Financial Watchdog FSB to Propose Crypto Regulations in October","category":["Policy"],"content":["The Financial Stability Board (FSB), an international body that monitors financial systems and proposes rules with the goal of preventing financial crises, plans to present recommendations for regulating crypto in October, according to a statement on Monday.","The Basel, Switzerland-based organization reports to the Group of 20 of the world's largest economies. The recommendations will cover stablecoins and other crypto assets, the board said.","\"The FSB is working to ensure that crypto assets are subject to robust regulation and supervision,\" the statement said, adding the recent \"turmoil\" in crypto markets highlights the intrinsic volatility and structural vulnerabilities as well as the increasing interconnectedness between crypto markets and the traditional financial system.","The crypto market downturn and collapse of the terraUSD (UST) stablecoin is accelerating regulatory action. In June, European Union policymakers agreed on a landmark bill to govern crypto issuers and service providers, with a heavy emphasis on rules for stablecoins, which are cryptocurrencies pegged to the value of other assets like sovereign currencies.","In February, the FSB published a report warning the unregulated crypto sector could derail global financial stability, not least because of its rapid growth. FSB Chairman Klaas Knot said in May that the watchdog is \"well placed\" to take the lead in setting up a \"coherent global regulatory framework for crypto assets.\"","The FSB plans to submit a report to the G-20 in October on \"high-level recommendations for the regulation, supervision and oversight of stablecoins.\" The proposed rules may include ways to extend existing frameworks to \"close gaps\" and implement recommended regulations.","The FSB also plans to submit a report with recommendations for \"promoting international consistency of regulatory and supervisory approaches to other crypto assets.\""],"entity":[{"type":"Switzerland","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Basel","content":"LOCATION"},{"type":"20","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Klaas Knot","content":"PERSON"},{"type":"FSB","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Financial Stability Board (FSB","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["Financial Stability Board","Stablecoins","Policy","Regulation","Crypto Assets"],"authors":["Sandali Handagama"]}