{"summary":"After the publication of this article, Fortune reported the SEC seeks to classify ETH as a security.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/20\/ethereum-foundation-under-investigation-by-state-authority\/","publishDate":"2024-03-20T15:15:40","id":15776,"type":null,"title":"Ethereum Foundation Faces Inquiry From a Government; Fortune Says SEC Investigating ETH","category":["Finance"],"content":["The Ethereum Foundation – the Swiss non-profit organization at the heart of the Ethereum ecosystem – is facing questions from an unnamed \"state authority,\" according to the group's website's GitHub repository.","The confidential inquiry comes during a time of change for Ethereum's technology and at a possible inflection point for its native asset, ETH, which many American investment companies are seeking to offer as an exchange-traded fund. The Securities and Exchange Commission (SEC) has slow-walked their efforts despite recently approving a series of Bitcoin ETFs.","After the publication of this article, Fortune reported the SEC is seeking to classify ETH as a security, a move that would have major implications for Ethereum, an ETH ETF and crypto as a whole. The financial regulator has sent investigative subpoenas to U.S. companies in the past several weeks, according to Fortune's reporting.","The scope of the investigation and its focus was unknown at press time. According to the GitHub commit dated Feb. 26, 2024, \"we have received a voluntary enquiry from a state authority that included a requirement for confidentiality.\"","The Ethereum Foundation did not return a request for comment.","Previously, the Ethereum Foundation's website contained the following disclosure:","\"The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed. Stiftung Ethereum will publicly disclose any sort of inquiry from government agencies that falls outside the scope of regular business operations.\"","That footer was removed in the Feb 26, GitHub commit along with the website's warrant canary, according to the changelog.","A warrant canary is usually some form of text or visual warning (like a colorful bird, in the case of the Ethereum Foundation), which some companies include on their websites to indicate they've never been served with a secret government subpoena or document request.","If a government agency does request information, the company may remove the text, suggesting they received the request without explicitly saying so.","The Ethereum Foundation's warrant canary was previously removed in 2019 in error and was quickly added back to the website.","An attorney familiar with the situation said a Swiss regulator may have served a document request to the Ethereum Foundation and may be working with the U.S. Securities and Exchange Commission (SEC).","\"I also think it's fair to say the Ethereum Foundation is not the only entity that they are seeking information from,\" the attorney told CoinDesk, saying other overseas entities are receiving scrutiny.","The SEC is evaluating multiple applications for an Ether ETF, but analysts following the process are becoming less optimistic that any such applications will be approved by the federal regulator, citing a lack of engagement between applicants and SEC officials.","\"Any rumors of any activity\" that the SEC and its overseas counterparts are engaging in may be correlated with the May 23 deadline the SEC faces, the attorney said.","UPDATE (March 20, 2024, 16:40 UTC): Updates with details from Fortune article.","Edited by Aoyon Ashraf."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Feb. 26, 2024","content":"DATE"},{"type":"The Ethereum Foundation (Stiftung Ethereum)","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Feb 26","content":"DATE"},{"type":"March 20, 2024","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"May 23","content":"DATE"}],"hashtag":["Ethereum Foundation","Investigation","ETH"],"authors":["Danny Nelson","Nikhilesh De","Sam Kessler"]}