{"summary":"The protocol aims to eliminate the need for token bridges, wraps and swaps to make moving crypto tokens between blockchains safer.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/09\/defi-broker-prime-protocol-introduces-bridgeless-cross-chain-token-transfers\/","publishDate":"2023-05-09T15:00:00","id":15771,"type":null,"title":"DeFi Broker Prime Protocol Introduces Bridgeless Cross-Chain Token Transfers","category":["Finance"],"content":["Prime Protocol, a decentralized finance-based (DeFi) prime brokerage, has released an asset-based lending services that aims to eliminate the need for inter-blockchain token transfers, according to a Tuesday press release.","The protocol will let users borrow against the value of their entire asset portfolio across several supported blockchains, including Moonbeam, Ethereum, Arbitrum and Avalanche, without the need for token bridges","Token bridges, which move cryptocurrency tokens from one blockchain network to another, can suffer exploits, potentially causing users to lose their crypto to hackers. Blockchain security firm Chainalysis estimated that over $2 billion had been lost in cross-chain bridge hacks last year.","“This is a significant security enhancement for the entire DeFi industry because it eliminates manual bridging as a point of vulnerability that is often exploited,” Derek Yoo, CEO of PureStake, a development team for Moonbeam, said in the release.","Existing DeFi protocol infrastructures typically support the movement of assets, backed by a single form of collateral, on just one blockchain, Yoo added.","Prime Protocol began operating on testnet in September. The protocol has more than 51,000 unique users.","Read More: What Are Blockchain Bridges and How Do They Work?"],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"Moonbeam","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"Derek Yoo","content":"PERSON"}],"hashtag":["Bridge","cross-chain bridge","cross-blockchain bridge","DeFi","On-chain Data"],"authors":["Elizabeth Napolitano"]}