{"summary":"The activist's new book \"Governable Spaces\" explores ways blockchains can help people experiment with self-governance online.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/26\/weve-seen-breakdowns-of-trust-nathan-schneider-on-how-to-democratize-the-web\/","publishDate":"2024-03-26T18:59:04","id":15772,"type":null,"title":"'We've Seen Breakdowns of Trust': Nathan Schneider on How to Democratize the Web","category":["Consensus Magazine"],"content":["To a large degree, crypto’s primary value proposition is that it gives users more control over their lives. Over their money, data and social connections. This is because crypto is a fundamental rewrite of how internet services are built: Instead of the client\/server relationship that defined the pre-blockchain era, there is now a way for individuals and collectives to “own” their side of the equation.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","The idea of “community ownership” is something that Nathan Schneider has been taken seriously for a long time. A media studies professor at the University of Colorado Boulder, he was an active participant in the Occupy Wall Street protests that sprang up around the time the general public was first getting introduced to Bitcoin (2011).","Over the course of his career, Schneider has developed a theory that many of the internet’s most intractable problems arise from the choices society has made. The thing is, we can often make better choices — whether that means running a company like Twitter\/X collectively or experimenting more as entrepreneurs.","The same core idea is at play in Schneider’s latest and fourth book, “Governable Spaces: Democratic Design for Online Life.” While all of his books have to some extent been about political theory, “Governable Spaces” is arguably Schneider’s most focused meditation yet on how to bring the ideals and practices of self-governance online. There isn’t any one answer, but blockchain can help.","“In other areas of our lives, we solve the vast majority of problems through local self-governance: school boards, city councils, local clubs, etc. We know that one-size-fits-all solutions don't work, and top-down solutions will always make at least half of the world really mad,” Schneider told CoinDesk in an interview.","CoinDesk caught up with Schneider to talk about how blockchain can help expand democratic control online, where DAOs are falling short and what he means by the “implicit feudalism” of today’s internet.","Why do you think the early web fostered top-down models of governance?","Well, it starts with this pattern that I call implicit feudalism that goes back to the earliest social spaces online. When people started designing systems for communities, they used the same logic, the logic where whoever controls the computer or server has essentially total control over the community. This extended from those early online spaces even before the internet was widespread in the 80s and 90s, and became the kind of dominant paradigm for how we design social spaces today in global platforms.","In many ways, it’s a kind of unquestioned logic that the admin or moderators — whoever controls the system, whether it's a company or at the level of a Facebook group chat — that there's this absolute power. We’re starting to see a way out of that with blockchains; they're a kind of network design that doesn't rely on that single server. Because of that, governance has become a space of exploration in ways that we've never seen before on the internet.","Just because you brought it around to blockchain, do you think DAOs today are properly governed?","If I ask people building DAOs today, the answer I get is usually “no.” We're still figuring it out. In some respects, this reveals just how new this challenge is. We've always relied on the power of the admin and moderator to govern for us, and I think we're having to learn the hard way how challenging any act of self-governance is. We're kind of reinventing the wheel in the context of DAOs. People started out with the “one token, one vote” model, where every single decision is a proposal for all token holders. We don't run any other kind of organization that way, because it's really inefficient. But DAOs are learning, and more appropriate models are becoming the norm, from “soulbound” tokens to vote delegation to reputation systems based more on contributions than wealth.","But in other respects, DAOs are having to co-govern online spaces under contexts that previous human institutions have not had to worry about, like anonymity and speculation — it's a more challenging environment. We can't simply import old habits of self governance. Nevertheless, what has excited me about DAO-world is that, at least in this context, there is a kind of creativity and experimentation with different voting mechanisms and ways of representing identity that I think the rest of the world needs to know about and see.","There isn’t a one size fits all solution to this, but how do you think we could import some of the lessons from real life democratic situations to online spaces?","The first step is creating the groundwork for it and in many respects that is taking place. A few years ago, my collaborators and I proposed a concept called modular politics, which is a framework for how to design online spaces. In the same way that we expect different kinds of features of our computer to be modularly composed, we can put together different apps — you know, plugins for a WordPress website or bots on Discord — to govern online spaces. If you look at tools like Aragon, you start to see how that modular logic is already taking hold.","The other thing that is critical outside of technical infrastructure is the financial side. A lot of DAOs, as soon as they start doing something interesting, get an offer they can't refuse from venture capital firms. Often that financial capture ends up re-centralizing these allegedly decentralized DAOs. A real priority if we want to protect collective governance is to make sure we have tools for financing promising projects that are compatible with collective ownership and that protect that collective ownership as a value. Variant, for instance, is an investment firm that has really tried to walk that line.","Given the priority that the crypto industry places on market solutions and finding efficiencies, will it always conflict with democratic governance?","The question is: Efficient for what purpose? We have to recognize that there are certain ways in which market solutions are actually not efficient for the kinds of things that we need in the world. For instance, token based voting is very efficient for somebody who has a lot of tokens and wants to control a project unilaterally. But if the goal of the project is to draw collective intelligence for many people, that's actually a very inefficient system.","See also: Code Is Not (Always) Law","A couple of years ago I was working on a book and having an ongoing conversation with Vitalik Buterin where I raised questions about the limitations of relying entirely on financial mechanisms for governance and whether this could actually end up backfiring in some important ways. I've been gratified to see over the years how Vitalik and many other people in this industry have recognized the limits of financial mechanisms alone, particularly. Like soulbound tokens and things like that are not financial.","I'm also really interested in projects like Decidim, which is a platform developed through the city of Barcelona to enable citizens to have more forms of input and co-governance in their city. Financialization is not at all involved. And still, there's a lot of creativity. The fun thing for me is to see the different directions people are experimenting with digital governance. That said, the creativity of economic incentives that have emerged in the context of crypto is a valuable contribution to solving certain problems.","Do you think we need persistent digital identity to solve the problems of co-governing online?","Identity of some sort is important, but we don't necessarily need to rest on one identity. You know, we've tended to for the last few 100 years rely heavily on a universe in which you have one national identity in which every piece of land on Earth belongs to some country (or no country). Networks invite us into a different kind of citizenship—what the indigenous scholar Glen Coulthard calls nonexclusive sovereignties. I think this is a very powerful idea for how to think about digital citizenship in different kinds of spaces. We might become part of DAOs or use social media apps. In some cases, it might make sense to have a very visible identity attached to other contexts. Or it might make sense to be more anonymous. The real adventure here is to be able to try and carry different forms of self presentation in our online spaces. Proof of personhood is going to be important and something we should expect. Relying exclusively on the nation state for one's identity is a profoundly limiting tool.","Do you think online governance adds too much friction, limiting what makes the internet valuable: being able to jump around websites without switching costs?","Great question, I think about it a lot. It's actually the topic of the first research paper I did after finishing this book with some collaborators in Metagov. We've been imagining what would it look like if we won — if democratic governance were available all over the internet and across our lives? How would we possibly have time to participate in all this stuff? Wouldn't that actually be a drag?","It’s about balance. There are some spaces where I love participating in governance for — like I'm part of a small Mastodon server of a few hundred people. I really like the people in that community, and I like participating in governance with them. On the other hand, I rely on a credit union for financial services. That is fairly large and complex. I am allergic to spreadsheets. I am so glad I don't have to participate in the governance of that. But there are still mechanisms in the background of that system of that credit union that help make sure it's accountable to me.","We can develop forms of governance that are actually appropriate to the degree of connection we have with our various communities and tools and networks. In Europe there are citizens assemblies, where you grab a random group of citizens — 50 or 100 people out of millions — and pay them to spend two weeks really studying an issue and helping to develop a proposal for how best to move through that issue. This has been really successful for cutting through legislative log jams. It could be really relevant to addressing governance in an online context that requires very few people to be involved at any given time while still opening the door for essentially anyone to participate.","I've heard leaders of DAOs complain that people are not voting on their proposals very much, they're getting very small levels of voting. And, you know, I think they should listen to that and recognize, hey, wait, there seems to be something off about the way this system is set up. How could this system be designed better to make sure the goal is not just more tokens voting, but getting better information. Every participant should feel that there is some accountability to them, while at the same time ensuring the obligations being asked of them are reasonable.","What's your most and least favorite things about running a Mastodon server?","It has made me love social media again. I'm logging into a real community, not to a company that is trying to take something from me. The downsides, you know, have to do with the fact that decentralized social media, particularly Mastodon, has rejected venture capital — it's just so under invested in. We still have such a long way to go to bring a truly kind of public goods approach to social media","This might tie into one of your earlier ideas that you wrote about: cooperative economics.","It really is. But it's easier said than done. I know it's possible because I've studied the history of cooperative business and financing. Here in Colorado, where I live, there's a $130 billion cooperative bank that lends to agricultural cooperatives. The rural electrification system in the United States enables essentially limitless capital to cooperatives in rural areas to deliver power and now broadband to communities. So we have done cooperative capital and financing at scale. The problem is, we haven't updated those legacies for the online economy.","See also: Consensus Rewind: DAOs for Humanity","One thing I'm really focused on now is trying to build alliances between this cooperative legacy and people in crypto who are committed to decentralization to try to make this case that it's not enough to just decentralize the technology, we also have to build the tools for decentralized and democratic finance.","Anything else you wanted to mention about the book?","As I've argued in CoinDesk before, I think it’s really important for people in the crypto ecosystem to recognize that every time you write code, you're engaged in regulation — a type of governance. The other day I was talking with an Ethereum protocol engineer, and he was telling me about the latest proposals they're making for changing the protocol. And I said, “That’s a nice piece of financial regulation you're doing.” He was kind of taken aback and denied a financial regulator. But every time we write something into a protocol, we’re creating governance. We're creating a kind of law. It's just a question of whose priorities are involved and who is accountable to whom. In particular, I would love to see this sector take on more responsibility for users.","We've seen all these breakdowns of trust — disasters like FTX and all the rest. It's been shocking to me how few resources this ecosystem has for addressing problems and how little people have stood up to demand the tools to prevent abuses. Some people are investing their savings in these systems; there needs to be some attention on economic justice, some sense of labor rights.","There are all kinds of things that humans need to have a healthy economy that we haven't even begun talking about in the context of crypto. We've remained parasitic on the rest of the world to take care of those problems. Instead, for this industry to really grow up we need to take those questions much more seriously. What should a better kind of fiscal policy look like? What would it look like to have basic protections, so that people who are participating in this economy are not at a dire risk of losing their livelihoods?","This begins with recognizing that we're doing governance already."],"entity":[{"type":"Earth","content":"LOCATION"},{"type":"University of Colorado Boulder","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Glen Coulthard","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Colorado","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Metagov","content":"LOCATION"},{"type":"Mastodon","content":"ORGANIZATION"},{"type":"Aragon","content":"PERSON"},{"type":"$130 billion","content":"MONEY"},{"type":"Nathan Schneider","content":"PERSON"},{"type":"Barcelona","content":"LOCATION"},{"type":"Schneider","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Schneider","content":"PERSON"}],"hashtag":["Opinion","The Node","Newsletters","DAOs","Governance","Democracy","Philosophy","Books","Interviews"],"authors":["Daniel Kuhn"]}