{"summary":"Known for popularizing the term “singularity,” the cypherpunk writer, who died this week, was prophetic about the age of artificial intelligence and cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/22\/remembering-true-names-author-vernor-vinge\/","publishDate":"2024-03-22T17:43:46","id":15774,"type":null,"title":"Remembering ‘True Names’ Author Vernor Vinge","category":["Consensus Magazine"],"content":["Science fiction pioneer and inspiration to many a cypherpunk, Vernor Steffen Vinge, passed away Wednesday at the age of 79 in La Jolla, California. The five-time winner of the prestigious Hugo Award is perhaps best known for popularizing the term “singularity.”","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Vinge, born Oct. 2, 1944 in Wisconsin, was also a beloved professor of mathematics and computer science at San Diego State University, where he received a PhD in math in 1971. In 2000, he retired from academia to write hard science fiction full time.","“A titan in the literary genre that explores a limitless range of potential destinies, Vernor enthralled millions with tales of plausible tomorrows, made all the more vivid by his polymath masteries of language, drama, characters and the implications of science,” American author David Brin said in a farewell message on Facebook.","Vinge (pronounced VIN-jee) received Hugo Awards for his novels A Fire Upon the Deep (1993), A Deepness in the Sky (2000), and Rainbows End (2007) as well as novellas Fast Times at Fairmont High (2002) and The Cookie Monster (2004). Perhaps his most well-known work, the 30,000-word novella “True Names” (1981) was an early exploration of cyberspace, transhumanism and hacker culture.","As weird as Thomas Pynchon and as prophetic as Nostradomus, Vinge’s writing has major implications for the age of artificial intelligence and cryptocurrency. The technological singularity, a term now in vogue to describe the theoretical moment when AI surpasses human intelligence, is an idea Vinge returned to over and over throughout his career.","He explored the concept in the seminal cyberpunk tome, “True Names,” which follows a group of hackers who plug into a virtual reality system called the \"Other Plane\" to explore a network of computers. In true cypherpunkian style, the hackers (called warlocks), try to keep their “true names” secret.","Unfortunately for the protagonist, “Mr. Slippery\" (a.k.a. Roger Pollack), the \"Great Enemy\" (a.k.a. the U.S. government) discovers his real identity and uses that knowledge as leverage to get him to investigate a newly arrived hacker accused of treason known as Mailman. Thus begins a romp that involves a rogue AI “personality simulator” (SPOILER: created by the National Security Agency) that replicates itself, eats all the information stored in databases around the world and causes chaos on- and offline.","Written eight years before the launch of the World Wide Web, and inspired by Vinge’s experiences using an early messaging platform Talk, “True Names” anticipated a number of the internet’s runaway effects on society and essentially the entire field of artificial intelligence.","''The import of 'True Names’ is that it is about how we cope with things we don't understand.,” AI pioneer Marvin Minsky wrote in a (since revised) afterword. Nowhere is this more evident than in today’s large language models, which are black boxes to even the researchers who build them.","See also: The Metaverse: From Science Fiction to Virtual Reality","Although he was convinced that technology will eventually outcompete and outperform humanity as a whole (actually saying the singularity would arrive between 2020 and 2040), Vinge was an eternal optimist. And his techno-optimism was infectious. As Minsky wrote:","“I too am convinced that the days of programming as we know it are numbered, and that eventually we will construct large computer systems not by anything resembling today's meticulous but conceptually impoverished procedural specifications … Once we learn better ways to tell computers what we want them to accomplish, we will be more able to return to our actual goals–of expressing our own wants and needs.”","It’s a point of view that many manifesto writers nowadays may agree with — from the Effective Altruists looking for ways to “align” AI with humanity to the Effective Accelerationists wanting to speed up the rate of technological innovation.","We may not know the impact of introducing a new technology, but, as Vinge argued in his 1993 essay titled “The Coming Technological Singularity: How to Survive in the Post-Human Era,” “we have the freedom to establish initial conditions.”","Technology is a tool. It is often also frightening. But it is a means to an end, not an end in itself, Vinge may argue. That’s why it matters how technologists and the computer cognoscenti go about building, and why Satoshi Nakamoto, who may have been alarmed by what he\/she\/it built, should be praised for starting the crypto industry off on the right foot.","See also: Cory Doctorow on Privacy, Web3, and Fighting the Surveillance Cartel","What comes next is not answerable in this lifetime, but, if you read Vinge, you might want to see it come to pass.","\"Accused by some of a grievous sin — that of 'optimism' — Vernor gave us peerless legends that often depicted human success at overcoming problems... those right in front of us... while posing new ones! New dilemmas that may lie just ahead of our myopic gaze,” Brin wrote. “He would often ask: 'What if we succeed? Do you think that will be the end of it?'\""],"entity":[{"type":"Vernor","content":"ORGANIZATION"},{"type":"1981","content":"DATE"},{"type":"Minsky","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Vinge","content":"ORGANIZATION"},{"type":"Wisconsin","content":"LOCATION"},{"type":"La Jolla","content":"LOCATION"},{"type":"Oct. 2, 1944","content":"DATE"},{"type":"Cory Doctorow","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Thomas Pynchon","content":"PERSON"},{"type":"Brin","content":"PERSON"},{"type":"Vernor Steffen Vinge","content":"PERSON"},{"type":"Roger Pollack)","content":"PERSON"},{"type":"Marvin Minsky","content":"PERSON"},{"type":"1971","content":"DATE"},{"type":"1993","content":"DATE"},{"type":"2004","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"San Diego State University","content":"ORGANIZATION"},{"type":"David Brin","content":"PERSON"},{"type":"2002","content":"DATE"},{"type":"2007","content":"DATE"},{"type":"Vinge","content":"PERSON"},{"type":"From Science Fiction to Virtual Reality","content":"ORGANIZATION"},{"type":"Nostradomus","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"National Security Agency","content":"ORGANIZATION"},{"type":"2040","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Fighting the Surveillance Cartel","content":"ORGANIZATION"}],"hashtag":["Opinion","The Node","Newsletters","Books","Science","Culture"],"authors":["Daniel Kuhn"]}