{"summary":"The Avalanche core team has made a proposal on the ApeCoin DAO forum that the Otherside metaverse should move to Avalanche.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148591\/avalanche-proposes-to-apecoin-dao-about-creating-an-otherside-subnet","publishDate":"2022-05-25T05:04:59","id":1577,"type":null,"title":"Avalanche proposes the Otherside metaverse should build its own subnet","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">The Avalanche core team has submitted a proposal idea to the ApeCoin DAO, suggesting that the Otherside metaverse should migrate to the Avalanche blockchain. The proposal is still in an early discussion phase and is not clear if it will go through a formal governance vote — let alone whether the DAO has control over the metaverse. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The ApeCoin DAO is the governance body of ApeCoin, an Ethereum token used within Yuga Labs’ forthcoming Otherside metaverse and the Bored Ape Yacht Club NFT collection. Yuga Labs is yet to make a statement on the proposal.<\/span>","<span data-v-f87c67ca=\"\">Last month, Yuga Labs, a key contributor of ApeCoin DAO, <a href=\"https:\/\/twitter.com\/yugalabs\/status\/1520612362986078208\" data-v-f87c67ca=\"\">complained<\/a> about Ethereum’s network congestion and rocketing gas fees during the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/144549\/otherside-land-nfts-sell-out-in-hours-as-yuga-labs-rakes-in-317-million\" data-v-f87c67ca=\"\">mint sale<\/a> of its Otherside metaverse land NFTs. It expressed interest in having its own blockchain to meet scalability demands. <\/span>With Yuga Labs looking to develop its own blockchain, Avalanche has formally pitched to the ApeCoin DAO about a possible migration.","<span data-v-f87c67ca=\"\">\"We propose that ApeCoin DAO launches Otherside on an Avalanche subnet to support Otherside’s future community growth through rapid transaction processing, higher throughput, greater ability to scale and lower gas fees,\" Avalanche said in its pitch.<\/span>","Emin Gün Sirer, CEO of Ava Labs, which is the core development firm behind Avalanche, confirmed his team’s interest in the proposal in trying to persuade ApeCoin DAO. Sharing the link to the proposal on Twitter, Sirer <a href=\"https:\/\/twitter.com\/el33th4xor\/status\/1529235127892582401\" data-v-f87c67ca=\"\">stated<\/a> that “ApeCoin would be fantastic as an Avalanche subnet, and benefit from the superior performance of its dedicated chain on the fastest consensus protocol.”&nbsp;","<span data-v-f87c67ca=\"\">Avalanche is a Layer 1 blockchain that presents itself as a faster and cheaper Ethereum alternative. It is compatible with the Ethereum Virtual Machine, a computing environment used by Ethereum apps. Another feature of Avalanche allows individual applications to spin up their own blockchains called <a href=\"https:\/\/www.theblockresearch.com\/a-look-at-avalanche-subnets-139204\" data-v-f87c67ca=\"\">subnets<\/a> sitting on top of the main network. These subnets can have different levels of security and blockchains are able to use their own native tokens for transaction fees.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This subnet component is an important part of today's pitch. The Avalanche team recommended that ApeCoin DAO should consider deploying as a metaverse and NFT-centric Avalanche subnet. If this happened, it would follow another large community, the DeFi Kingdoms play-to-earn game, in doing so.<br data-v-f87c67ca=\"\">\n<\/span>","But the proposal may not even get off the ground.","In the governance forum discussion on the proposal, community members and Bored Ape holders expressed a range of views against the idea. Many members argued that the ApeCoin DAO should remain part of the Ethereum blockchain and focus on achieving scalability with the available Layer 2 scaling solutions, rather than moving to a separate network. There is even another <a href=\"https:\/\/forum.apecoin.com\/t\/aip-41-not-to-migrate-from-ethereum-process\/5664\" data-v-f87c67ca=\"\">proposal<\/a> from one member asking the ApeCoin DAO to remain on Ethereum.","\"Honestly think we have more to lose leaving [Ethereum] than we have to gain exploring options off of it and it’s [Layer 2s]. Rather, for all value that apecoin and the ecosystem around can give, I don't see remotely an appropriate value that avalanche can give back to make it worth the sacrifice,\" <a href=\"https:\/\/forum.apecoin.com\/t\/aip-idea-otherside-as-an-avalanche-subnet\/6369\/12\" data-v-f87c67ca=\"\">said<\/a> one commentator.","Another pointed out that the ApeCoin DAO may not even have control over the Otherside metaverse.&nbsp; \"First, the DAO has nothing to do with the Otherside. That’s a Yuga project and it’s not within the purview of this DAO to decide what technology they do or do not use for that,\" they <a href=\"https:\/\/forum.apecoin.com\/t\/aip-idea-otherside-as-an-avalanche-subnet\/6369\/14\" data-v-f87c67ca=\"\">said<\/a>, before adding that they too, prefer the layer 2 route.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ApeCoin DAO","content":"ORGANIZATION"},{"type":"Emin Gün Sirer","content":"PERSON"},{"type":"Yuga Labs","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"}],"hashtag":["AVALANCHE"],"authors":["Vishal Chawla","The Block"]}