{"summary":"Asset values for creditor claims will be calculated at prices on the day FTX filed for bankruptcy in November 2022, the plan says.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/12\/18\/ftx-files-reorganization-plan-to-end-bankruptcy\/","publishDate":"2023-12-18T09:36:52","id":15786,"type":null,"title":"FTX Files Reorganization Plan to End Bankruptcy, Repay Creditors","category":["Finance"],"content":["The estate of the collapsed crypto enterprise FTX submitted a proposal to end bankruptcy with a Delaware court, a filing from Saturday shows.","The exchange founded by Sam Bankman-Fried imploded in November 2022 shortly after CoinDesk reported on the shaky balance sheet of the firm's trading unit, Alameda. The bankruptcy plan was expected by Dec. 16 following earlier informal proposals, which included plans to return up to 90% of creditors' recovered funds.","In the new proposal, creditor and customer claims are classed according to the priority the estate plans to give them, and the value of claims will be calculated based on asset prices as of the date the company filed for bankruptcy. In a separate statement, the estate said the plan was designed to \"maximize and efficiently distribute value to all creditors.\"","As in other high-profile crypto bankruptcy cases, the plan is likely to face opposition from various creditor groups until it's approved by the court. A hearing date will be set in 2024.","Read more: FTX Plans to Return 90% of Customer Funds, but There's a Catch","Edited by Sheldon Reback.","\n"],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Dec. 16","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["Regulations","FTX","FTX Collapse","Bankruptcy","Delaware","Court Filings"],"authors":["Sandali Handagama"]}