{"summary":"Arbitrum is decentralizing by launching its governance token ARB.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/03\/23\/arbitrum-daily-transaction-count-hits-record-high-ahead-of-token-airdrop\/","publishDate":"2023-03-23T08:10:31","id":15788,"type":null,"title":"Arbitrum Daily Transaction Count Hits Record High Ahead of Token Airdrop","category":["Markets"],"content":["Activity on Arbitrum, an Ethereum layer 2 scaling system that uses Optimistic rollups technology to provide faster and cheaper transactions, has picked up the pace ahead of the planned airdrop of its native token ARB on Thursday.","The number of daily transactions on Arbitrum rose to a new record high of 1,312,052 on Wednesday, surpassing the previous peak of 1,103,398 reached on Feb. 21, according to data source Arbiscan. The Ethereum mainnet processed around 1.08 million transactions.","Arbitrum's tally has increased by over 50% since it announced the token airdrop a week ago. The leading scaling project has found more than 400,000 new users in two weeks, taking the cumulative user base to over 3 million, according to data sourced from @Henrystats' Dune Analytics-based Arbitrum dashboard.","About 625,000 wallets are eligible for the airdrop or free distribution of just over 1 billion ARB tokens later Thursday.","\"Arbitrum is decentralizing by launching its governance token ARB to transition towards self-executing [decentralized autonomous organization] governance,\" Delphi Digital said in a tweet thread. \"12.75% of its supply or 1.275 billion tokens will be distributed to Arbitrum community members and DAOs in the Arbitrum ecosystem.\"","Airdrops involving the distribution of free tokens to the community are a common way of boosting adoption. ARB's total supply will be fixed at 10 billion.","At press time, betting in the IOU (I owe you) markets tied to ARB suggested the token would trade at around $6 after the airdrop. IOUs are tokens representing a debt between two parties."],"entity":[{"type":"10 billion","content":"MONEY"},{"type":"Feb. 21","content":"DATE"},{"type":"3 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"ARB","content":"ORGANIZATION"},{"type":"12.75%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"1.275 billion","content":"MONEY"},{"type":"$6","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Delphi Digital","content":"ORGANIZATION"}],"hashtag":["Arbitrum","token","Airdrops","Governance"],"authors":["Omkar Godbole"]}