{"summary":"With a Wednesday deadline looming, the regulator sent comments just hours after would-be issuers filed documents detailing their fees.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/09\/sec-hustles-to-answer-latest-bitcoin-etf-filings-source\/","publishDate":"2024-01-09T03:49:01","id":15789,"type":null,"title":"SEC Hustles to Answer Latest Bitcoin ETF Filings: Source","category":["Policy"],"content":["U.S. Securities and Exchange Commission officials sent comments to a set of prospective issuers of bitcoin exchange-traded funds (ETFs) just hours after the companies filed documents detailing fees for their proposed products, an individual familiar with the comments said.","The issuers should file updated documents on Tuesday, the individual said. The comments addressed minor details in the amended S-1 forms rather than significant changes, and should not affect the timeline for a potential approval by the regulator. Issuers hoping to launch spot bitcoin ETFs in the U.S., including BlackRock, Grayscale and Fidelity, announced their expected fees in filings earlier Monday.","For full coverage of bitcoin ETFs, click here.","Bloomberg Intelligence analyst James Seyffart, who's been closely tracking the bitcoin ETF applications, tweeted that it was \"borderline unheard of\" for applicants to hear back from the SEC within the same day for amended filings.","Monday's comments show SEC officials are still engaged in dialogues with the would-be ETF issuers, most of whom proposed creating spot bitcoin ETFs last summer. The agency faces a Jan. 10, 2024 deadline – i.e. this Wednesday – for one of the applications, by Ark and 21 Shares. A flurry of amended filings by issuers reflecting their conversations with SEC officials has raised hopes in recent weeks that the agency will approve spot bitcoin ETFs to trade in the U.S. These hopes were bolstered when exchanges including Nasdaq, NYSE Arca and Cboe BZX filed amended 19b-4 documents on Friday, which another individual told CoinDesk last week were intended to match the S-1 filings.","Both 19b-4 and S-1 filings need to be deemed effective by the SEC before an ETF can begin trading.","Bitcoin ETF advocates hope a regulated financial product will let traditional financial institutions and everyday retail investors gain exposure to the world's oldest cryptocurrency's price without having to set up wallets or otherwise deal with new financial structures. The SEC has so far rejected every application for a spot bitcoin ETF, dating back to 2013.","While the agency has not yet signaled publicly how it might rule on the latest slate of applications, the amount of feedback it's provided and the amended filings – not to mention the speed with which it's responding – suggest the nearly-a-dozen applications will be cleared for takeoff.","Edited by Marc Hochstein."],"entity":[{"type":"James Seyffart","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Jan. 10, 2024","content":"DATE"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"1","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"4","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Regulations","Bitcoin ETF","SEC"],"authors":["Nikhilesh De"]}