{"summary":"Its mainnet stopped producing blocks around the time of the Ethereum overhaul.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/13\/blast-blockchain-locks-up-amid-ethereums-dencan-upgrade\/","publishDate":"2024-03-13T14:59:45","id":15796,"type":null,"title":"Blast Blockchain Locks Up Amid Ethereum's Dencun Upgrade","category":["Technology"],"content":["Blast, the recently launched layer-2 blockchain, froze up for about an hour Wednesday amid Ethereum's major Dencun upgrade.","Blast, which is built atop Ethereum and therefore intrinsically linked to it, posted on X that its mainnet \"has stopped producing blocks due to issues related to Ethereum’s Dencun upgrade.\"","Blocks stopped being produced at 14:05 UTC, correlating with the time the Dencun upgrade took place, according to the Blast block explorer. At 15:09 UTC, Blast announced that the mainnet was back online.","Amid the snafu, Blast competitor Arbitrum announced that it will take 24 hours to integrate elements of the Dencun upgrade, which will ultimately prompt a reduction in Ethereum fees.","The Blast mainnet went live on Feb. 29 after attracting $2.3 billion worth of deposits following its announcement in November.","The network's largest protocol, Orbit Finance, experienced a 32% rise in total value locked (TVL) to $431 million over the past 24 hours. The rise couldn't deter a plunge in the value of Orbit's native token, which is down by more than 20% today after being issued on March 8.","CORRECTION (March 13, 2024, 15:01 UTC): Fixes the spelling of Dencun in the headline.","UPDATE (March 13, 2024, 15:14 UTC): Adds context throughout.","UPDATE (March 13, 2024, 15:32 UTC): Adds that Blast is back online.","Edited by Nikhilesh De."],"entity":[{"type":"Orbit Finance","content":"ORGANIZATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"March 13, 2024","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Feb. 29","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$431 million","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum’s Dencun","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"March 8","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Blast","Dencun","Outage"],"authors":["Nick Baker","Oliver Knight"]}