{"summary":"Недавний хаос вокруг централизованной биржи FTX вызвал вопросы о плюсах и минусах хранения ваших монет на централизованных и децентрализованных биржах. Мы сломаем это.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/ru\/learn\/centralized-exchange-cex-vs-decentralized-exchange-dex-whats-the-difference\/","publishDate":"2022-11-15T16:12:18","id":15791,"type":null,"title":"Централизованная биржа (CEX) и децентрализованная биржа (DEX): в чем разница?","category":["Learn"],"content":["Если вы подумываете о покупке или продаже Крипта, вашим первым пунктом захода, вероятно, будет биржа. Чаще всего первой точкой входа в торговлю Криптовалюта является централизованная биржа (CEX), цифровой рынок, на котором происходит торговля Крипта . Вы, наверное, слышали о некоторых: Binance, Kraken, Coinbase и так далее. В ноябре 2022 года сенсация CoinDesk привела к ошеломляющему повороту Мероприятия , который привел к краху ранее популярной биржи FTX и объявлению о банкротстве .","Это побудило многих Крипта искать альтернативы централизованным биржам. Очевидная альтернатива — новый тип децентрализованной биржи, такой как Uniswap и PancakeSwap . Эти децентрализованные биржи радикально переосмысливают то, как могут работать биржи.","См. также: Что такое токен Exchange?","Децентрализованные биржи (DEX) появились в течение последних пяти лет, чтобы бросить вызов существующим CEX . Короче говоря, цель DEX — предложить более низкие комиссии за транзакции, позволить пользователям напрямую владеть собственными активами и избежать некоторого нормативного бремени. С другой стороны, им приходится компенсировать своим поставщикам ликвидности особый вид риска, называемый «непостоянные потери».","CEX также предлагают свои преимущества. Большинство централизованных бирж используют бизнес-модель, аналогичную традиционным организациям, таким как Нью-Йоркская фондовая биржа, которая представляет собой структуру, которую традиционные инвесторы понимают и с которой могут чувствовать себя более комфортно. Их интерфейсы и приложения, как правило, более удобны для новичков и обычно предлагают больше ликвидности и более строгие нормативные гарантии, что может быть особенно важно для институциональных клиентов. Но это также означает, что центральная компания, управляющая биржей, имеет много полномочий и ответственности за финансовую стабильность и работоспособность биржи.","См. также: Как получить свое богатство с биржи","Если недавняя драма вокруг FTX заставила вас задуматься о переходе на DEX, вот что вам нужно знать.","DEX стремятся совершать транзакции быстрее и дешевле, чем их централизованные аналоги. Они делают это, исключив посредников, которые берут часть комиссий за транзакции на CEX. В официальном документе крупнейшей в мире DEX Uniswap за 2018 год провозглашается «нулевая рента». Он направлен на защиту своих пользователей от дополнительных затрат, связанных с получением прибыли посредниками, управляющими CEX. Bancor , запущенный в 2017 году и позиционирующий себя как первая DEX, выступает за такой децентрализованный подход:","«Ликвидность на традиционных биржах активов исторически обеспечивалась небольшой горсткой профессиональных торговых фирм с разрешенным доступом и специализированными инструментами. Это концентрирует ликвидность в руках нескольких участников, которые могут вывести свои активы в периоды волатильности и ограничить торговлю активами, когда пользователи в них больше всего нуждаются».","В конце 2021 года ведущая DEX Uniswap взимала комиссию за транзакцию в размере 0,05% от сделки на сумму 100 000 долларов , выбранной глобальной бухгалтерской компанией KPMG . CEX Binance, Coinbase и Kraken взимали 0,1%, 0,2% и 0,2% соответственно.","DEX используют протоколы «автоматического маркет- Maker» для определения цен на активы без централизованного органа, организующего сделки. Распространенным подходом является механизм «постоянного продукта», который определяет предлагаемые цены как функцию соотношения общих резервов DEX каждого из задействованных активов. Это имеет то преимущество, что позволяет KEEP относительный баланс резервов: если какой-либо актив станет дефицитным, он станет чрезвычайно дорогим.","Тем не менее, DEX по-прежнему предлагают примерно те же цены на активы, что и CEX. Это связано с тем, что внимательные трейдеры или боты могут быстро получить прибыль от любого несоответствия цен посредством арбитража . Если бы определенный пул содержал очень мало ETH, трейдерам пришлось бы позволить продавать ETH в пул по более высокой цене, чем указал более широкий рынок. Трейдеры могли бы легко получить прибыль, купив их на более широком рынке и продав в пул. При этом объем пула будет расти, снижая предлагаемую цену до тех пор, пока она не станет соответствовать более широкому рынку.","Читать дальше: Понимание Технологии, лежащей в основе децентрализованных бирж","Какой бы аккуратной ни была эта система, она все же создает риск для поставщиков ликвидности, стоящих за пулом. Риск называется непостоянной потерей. Поставщики ликвидности имеют право вывести часть стоимости пула, который они внесли, а не точное количество токенов, которые они вложили. Он не может обещать всем поставщикам их точные токены, поскольку соотношение различных токенов, хранящихся в пуле, меняется по мере сделок. происходить. Но по мере того, как соотношение корректируется в соответствии с текущими более широкими рыночными ценами, пул будет постепенно содержать все больше токенов, которые теряют ценность, и наоборот.","Это означает, что поставщик ликвидности, как правило, в конечном итоге выводит больше токенов, которые потеряли стоимость, и меньшую часть ONE , которые приобрели стоимость, по сравнению со своими стартовыми активами. Следовательно, они в конечном итоге окажутся беднее, чем если бы они просто держали свои активы в частном порядке. На практике DEX обычно компенсируют поставщикам ликвидности комиссию за транзакции. Но это означает взимание более высоких комиссий, чем им в противном случае потребовалось бы.","Другая часть компромисса между DEX и CEX сводится к тому, предпочитают ли пользователи хранить свою собственную Крипта напрямую или доверить ее бирже. Биржи CEX обычно требуют, чтобы пользователи помещали активы на хранение перед торговлей.","Самостоятельное хранение своих активов соответствует идеалу самостоятельности, который пронизывает Крипта . Вы имеете полный и исключительный контроль над ними. Но с другой стороны, без должной осторожности приватные ключи могут быть потеряны или уничтожены, в результате чего связанные с ними активы станут невозвратными. Валлиец Джеймс Хауэллс по ошибке выбросил жесткий диск в 2013 году и потерял доступ к 7500 биткойнам, стоимость которых по состоянию на ноябрь 2022 года составляла более 100 миллионов долларов. Он неоднократно и безуспешно обращался к местному совету с просьбой разрешить ему раскопать свалку.","Растущая популярность DEX может частично отражать их успехи в обходе некоторых нормативных препятствий. Компания, создающая DEX, избегает выступать в качестве финансового посредника или контрагента и не обязана соответствовать стандартам «знай своего клиента» (KYC) или стандартам борьбы с отмыванием денег (AML), поскольку она работает автономно. Раньше ShapeShift была CEX, пока ее генеральный директор не заявил, что компания потеряла 95% своих пользователей в результате мер KYC, которые она была вынуждена реализовать в 2018 году. В 2021 году Shapeshift решительно изменился и стал DEX, чтобы избавиться от этой проблемы.","DEX могут испытывать большие трудности, чем CEX, при работе с более крупными инвесторами. В настоящее время они еще не могут конкурировать с крупнейшими CEX по размеру, поэтому они не могут предложить столько ликвидности. Когда крупные заказы сталкиваются с недостаточной ликвидностью, они могут столкнуться с незапланированными дополнительными расходами, называемыми «проскальзыванием». Кроме того, институциональные инвесторы сами сталкиваются с препятствиями в сфере ПОД и другими нормативными препятствиями и могут с трудом иметь дело с биржами, которые не подчиняются аналогичным требованиям.","Сергей Кунц, соучредитель агрегатора ликвидности DEX 1inch Network, отметил в прошлом году , что банки и хедж-фонды медленно внедряют децентрализованное Финансы ( DeFi ) из-за собственных нормативных препятствий. Несмотря на то, что это DEX, его компания теперь планирует запустить совместимый продукт под названием 1INCH Pro специально для обслуживания этих клиентов.","Новые протоколы агрегаторов, такие как 1INCH, появились специально для того, чтобы помочь крупным инвесторам избежать проблем с ликвидностью при использовании DEX. В 2020 году 1INCH привлекла 12 миллионов долларов в рамках раунда финансирования под руководством Pantera Capital.","Рост числа агрегаторов на самом деле означает, что пользователи могут получить доступ к ликвидности на DEX и CEX одновременно. Протокол DiversiFi, который сам по себе является DEX, объединяет ликвидность обоих типов бирж, чтобы помочь пользователям более эффективно заключать более крупные сделки. Это помогает инвесторам избежать затрат, связанных с тем, что ликвидность биржи оказывается слишком маленькой для их ордера.","Когда дело доходит до решения, какой тип биржи использовать, все сводится к двум вещам: если вас в первую очередь интересует простота использования и вам неудобно полностью контролировать свой собственный кошелек, то CEX, вероятно, является лучшим вариантом Для вас. Если для вас наиболее важны более низкие комиссии и больший контроль над собственными средствами, то DEX – это то, что вам нужно. Какой бы путь вы ни выбрали, убедитесь, что вы знаете, как вывести свою Крипта с биржи в холодное хранилище , чтобы KEEP свое богатство в безопасности в долгосрочной перспективе.","См. Также: Почему децентрализованные биржи важны в Крипта"],"entity":[{"type":"Uniswap и PancakeSwap","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"0,05%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"0,2%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"0,1%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"DEX Uniswap","content":"ORGANIZATION"},{"type":"2020","content":"DATE"}],"hashtag":["industry","Beginner","Learn","Russian"],"authors":["Benedict George","Toby Bochan"]}