{"summary":"Academic philosophers covered for Sam Bankman-Fried’s moral failings as long ago as 2018 – and reaped the rewards.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/17\/how-effective-altruism-power-brokers-helped-make-sam-bankman-fried\/","publishDate":"2023-03-17T17:00:50","id":15799,"type":null,"title":"How Effective Altruism Power Brokers Helped Make Sam Bankman-Fried","category":["Consensus Magazine"],"content":["The leading so-called philosophers of the Effective Altruism movement were warned as early as 2018 that Sam Bankman-Fried was a liar who slept with multiple subordinates, according to new reporting from Time. They reportedly responded in part by threatening those warning the golden boy wasn’t all he seemed.","Despite formal attempts by Alameda Research staff to push Bankman-Fried out at the time, figures including Oxford professor William MacAskill continued publicly burnishing the FTX founder’s image as he built one of the largest financial frauds of all time. MacAskill and others were ultimately rewarded for their defense of Bankman-Fried’s behavior in the form of funding and prestige as FTX appeared to succeed in later years.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","\n","This was not a matter of dismissed rumors and personal grudges, but of well-documented corporate processes derailed, in part, by people whose entire careers are premised on cultivating moral action. In April 2018, four top Alameda managers called a meeting to offer Bankman-Fried a buyout to leave the hedge fund, based on already-extensive concerns about his disdain for basic corporate processes and accounting.","Documents for the meeting described Bankman-Fried as indulging in “gross negligence,” being “unethical” and “misreporting numbers.” Among other actions leading to the intervention, Time reports Bankman-Fried reneged on a deal to share ownership of Alameda, and illicitly registered himself as the sole owner.","According to Time, MacAskill was warned about Bankman-Fried’s behavior and the plan to oust him. So were Nick Beckstead, an EA-aligned moral philosopher, and Holden Karnofsky, co-CEO of EA-centric funding platform OpenPhilanthropy.","MacAskill didn’t just dismiss the allegations against Bankman-Fried but “basically threatened” those raising the concerns, according to Naia Bouscal, a former software engineer at Alameda.","Because MacAskill was so powerful within the Effective Altruism movement, and so many early Alameda staffers were also part of the movement, his opposition discouraged and blocked those at Alameda who tried to hold Bankman-Fried accountable early on. MacAskill, according to one involved person, had the power to influence employment options across the constellation of EA-linked nonprofits.","Bankman-Fried reportedly wielded his connection to MacAskill as a cudgel within Alameda. “[Bankman-Fried] was like, ‘I could destroy you,’” one person characterized the then-Alameda CEO’s behavior to Time. “’Will [MacAskill] and Holden [Karnofsy] would believe me over you. No one is going to believe you.’”","Seemingly, in part, thanks to MacAskill’s defense, Bankman-Fried was not forced to resign after the April 2018 meeting. Instead, the four executives who initially raised the concerns left, along with about half of Alameda’s employees at the time.","MacAskill, Karnofsky and Beckstead, then, seem to have played a direct and key role in enabling the FTX fraud – and they were richly rewarded by their pet con man. After FTX’s explosive growth starting in 2020, MacAskill enjoyed a wave of interest generated by the supposed Effective Altruist billionaire he had spent years cultivating. Beckstead would be named head of the FTX Future Fund, a Potemkin nonprofit that helped build Bankman-Fried’s fluffy image – and attract more victims.","The revelations are damning for the individuals involved, and the Effective Altruism movement as a whole. While they may not have been aware of the details of Bankman-Fried’s misdeeds, they seem to have been well aware that his supposed moral stance was a fraud. Their alleged refusal to reckon with allegations of what amounts to workplace sexual abuse is particularly vile.","See also: FTX Paid Around $2.2B to Sam Bankman-Fried","The ideas advanced by MacAskill and his cohort have long been lambasted as a convenient fig leaf helping rapacious capitalists distract others, and themselves, from their exploitative greed. FTX became the literal instantiation of that theoretical critique, demonstrating a profound rot at the heart of the Effective Altruism movement – or perhaps more accurately, a palsy-inducing tumor in its head.","Like all tumors, this one should be excised: MacAskill’s continued presence at Oxford, in particular, is a nasty, dripping blemish on the face of the entire field of academic philosophy. Unfortunately, the FTX story has become an object lesson in how rarely such ailments are actually addressed at the very top of our society – how freely the cancer of greed and self-dealing has been allowed to spread its tendrils from Oxford to Stanford to MIT to the U.S. Congress, destroying the lives of normal people at every step of the way.","CORRECTION (March 17, 2023 18:30 UTC): Fixes the spelling of William MacAskill's name."],"entity":[{"type":"Stanford","content":"LOCATION"},{"type":"Nick Beckstead","content":"PERSON"},{"type":"Karnofsky","content":"PERSON"},{"type":"$2.2","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Holden","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"MacAskill","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"EA","content":"ORGANIZATION"},{"type":"Holden Karnofsky","content":"PERSON"},{"type":"Naia Bouscal","content":"ORGANIZATION"},{"type":"March 17, 2023","content":"DATE"},{"type":"Time","content":"ORGANIZATION"},{"type":"Oxford","content":"LOCATION"},{"type":"William MacAskill","content":"PERSON"},{"type":"Beckstead","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"MacAskill]","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"April 2018","content":"DATE"}],"hashtag":["Opinion","Sam Bankman-Fried","FTX","Philosophy"],"authors":["David Z. Morris"]}