{"summary":"Crypto exchange Binance is launching its own marketplace for creating and trading non-fungible tokens (NFTs).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102959\/binance-is-launching-its-own-nft-marketplace-in-june","publishDate":"2021-04-27T07:00:20","id":1579,"type":null,"title":"Binance is launching its own NFT marketplace in June","category":["NFTS"],"content":["Crypto exchange Binance is launching its own marketplace for creating and trading non-fungible tokens (NFTs).","The launch is scheduled for June, Binance announced Tuesday. It added that the platform offer users low fees, high liquidity, and a better user experience.","The news comes at a time when the NFT activity is on the decline. Weekly NFT trading volumes have dropped significantly since their peak in February, <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/nft-overview\" data-v-f87c67ca=\"\">according to data compiled by The Block<\/a>. Weekly users and transactions of NFT platforms have also declined.","When asked why launching <a href=\"https:\/\/nft.binance.com\/\" data-v-f87c67ca=\"\">the NFT platform<\/a> now, a Binance spokesperson told The Block that it is a \"strategic move\" by the exchange as it believes in the \"fundamental value and potential of NFT application in the long run.\"","\"We aim to build the largest NFT trading platform in the world by leveraging the fastest, cheapest, and most secure NFT solutions powered by Binance blockchain infrastructure and community,\" said the spokesperson.","The spokesperson went on to say that the NFT platform could attract \"millions of potential NFT collectors in the world\" since Binance has users in over 180 countries and regions.","The Binance NFT platform will offer two main features: \"Premium events\" and trading. Premium events will allow creators to exhibit and auction off their work on the platform.","Binance said it would charge 10% fees for these events, and 90% of the proceeds will go to the creators as profit.","As for the trading feature, the platform will allow creators to mint their NFTs, as well as enable users to deposit their existing NFTs on the platform for sale or auction. When asked which blockchain-based NFTs will the platform support, the spokesperson told The Block that Binance Smart Chain \"mainly\" and Ethereum.","That means users will be able to deposit popular Ethereum-based NFTs such as CryptoPunks and Hashmaks on the platform and sell it.","\"Through our development, we might also support blockchain networks such as Tron, Flow, Wax, etc.,\" said the spokesperson.","Binance said it would charge 1% as the processing fee for the trading feature, and creators or depositors will \"continuously receive 1% royalty.\"","When asked until when they will receive the royalty, the Binance spokesperson told The Block: \"As long as an NFT is traded in our platform, the creators or depositors of this NFT will continuously receive 1% royalty fee for every trade.\"","The NFT platform is now inviting artists and creators for collaborations through its website. Mobile versions of the platform, both iOS and Android, will be available at a later date, said Binance.","Earlier this month, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101589\/binance-vogue-singapore-publisher-nft-platform\" data-v-f87c67ca=\"\">Binance also partnered with Media Publishares<\/a>, the publisher of Vogue Singapore, to help them build an NFT platform, which will be focused on fashion, arts, and music industries.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Binance NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Media Publishares","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Vogue Singapore","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}