{"summary":"The European Banking Authority wants to extend money laundering guidance to crypto firms and banks that trade with them","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/05\/31\/eus-banking-regulator-highlights-aml-risks-in-privacy-coins-self-hosted-wallets\/","publishDate":"2023-05-31T14:18:58","id":15792,"type":null,"title":"EU’s Banking Regulator Highlights AML Risks in Privacy Coins, Self-Hosted Wallets","category":["Policy"],"content":["Crypto companies should watch out for customers using privacy coins or self-hosted wallets as they try to spot potential money laundering activity, the European Banking Authority said in draft guidance published Wednesday.","The plans, open for comment until August 31, follow a series of crackdowns on crypto tools which can enhance online privacy, but which lawmakers worry can be used to hide criminal or terrorist money.","Providers of crypto asset services such as exchanges and wallets, known as CASPs, can see heightened money laundering risks due to the innovative technology that enables instant transfers across the world, the EBA said in a statement.","“The EBA is proposing to amend its [money laundering and terrorist financing] risk factors guidelines to set common, regulatory expectations of the steps CASPs should take to identify and mitigate these risks effectively,” and to help them vet potential and existing customers, the EBA said.","Using mixers and tumblers, zero-knowledge proofs and privacy coins indicates higher risk, the guidance said. So do customers with multiple accounts who make transactions to self-hosted wallets that aren’t operated by a regulated CASP, or are located in supposedly under-regulated overseas jurisdictions.","Banks looking to take on crypto clients will also need to check their regulatory license and ownership, the guidance said.","In recent months and years, the European Union has sought to tackle money laundering risks from secretive crypto transactions. New money laundering rules could curb trades with self-hosted wallets where the owner can’t be identified, and may even ban anonymous coins such as zcash, monero and dash outright. In a March proposal, the EBA also highlighted extra risks for businesses that use crypto-style distributed ledger technology.","Meanwhile, U.S. authorities have sanctioned Tornado Cash, a privacy tool on the Ethereum blockchain that they say has been used to discreetly raise funds for North Korean regime. Some lawmakers and former regulators have suggested U.S. regulators’ actions amount to a deliberate attempt to isolate crypto from the traditional banking system, mirroring a previous “Choke Point” crackdown on gun businesses.","Read more: European Banking Regulator Calls Attention to Digital Ledger Technology","Edited by Nikhilesh De."],"entity":[{"type":"March","content":"DATE"},{"type":"European Union","content":"LOCATION"},{"type":"European Banking Authority","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"EBA","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"August 31","content":"DATE"},{"type":"European Banking Regulator Calls Attention to Digital Ledger Technology","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"}],"hashtag":["Regulations","Money Laundering","EU Commission","European Banking Authority"],"authors":["Jack Schickler"]}