{"summary":"Generative AI has huge economic potential and could boost global labor productivity, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/08\/03\/ai-investment-could-reach-200b-globally-by-2025-goldman-sachs\/","publishDate":"2023-08-03T10:06:59","id":15809,"type":null,"title":"AI Investment Could Reach $200B Globally by 2025: Goldman Sachs","category":["Finance"],"content":["Investment in artificial intelligence is growing quickly and could have a bigger impact on U.S. gross domestic product (GDP) than the discovery of electricity or the advent of personal computers, Goldman Sachs (GS) said in a report Tuesday.","“Generative AI has enormous economic potential and could boost global labor productivity by more than 1 percentage point a year in the decade following widespread usage,” wrote economists Joseph Briggs and Devesh Kodnani.","For such a large-scale transformation to occur, businesses will need to make “significant upfront investment in physical, digital and human capital to acquire and implement new technologies and reshape business processes,” the report said.","Those investments could reach around $200 billion globally by 2025, and will likely happen before “adoption and efficiency gains start driving major gains in productivity,” the bank said.","Over the longer-term, AI investment could peak at 2.5% to 4% of U.S. GDP, and 1.5% to 2.5% of other AI leaders, the note said.","“Despite this extremely fast growth, the near-term GDP impact is likely to be fairly modest given that AI-related investment currently accounts for a very low share of U.S. and global GDP,” the analysts wrote, adding that while investment so far has been focused on model development, a “substantially larger hardware and software push will be required for generative AI to scale.”","AI adoption will likely start to have a meaningful impact on the U.S. economy sometime between 2025 and 2030, the report added.","Read more: Blockchain May Offer Answers for AI Challenges","Edited by Sheldon Reback."],"entity":[{"type":"2025","content":"DATE"},{"type":"Blockchain May Offer Answers","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"4%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"Goldman Sachs (GS)","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Devesh Kodnani","content":"PERSON"},{"type":"$200 billion","content":"MONEY"},{"type":"1 percentage point","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Joseph Briggs","content":"PERSON"},{"type":"2030","content":"DATE"}],"hashtag":["AI","Economy","global economy"],"authors":["Will Canny"]}