{"summary":"A long-time crypto skeptic, who once called for a ban, explains why he's organizing a high-level crypto conference at Duke.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/01\/10\/now-i-know-the-cryptocurrency-industry-is-here-to-stay\/","publishDate":"2023-01-10T15:43:55","id":15819,"type":null,"title":"Now I Know the Cryptocurrency Industry Is Here to Stay","category":["Consensus Magazine"],"content":["As a long-time crypto skeptic, it may seem odd that I am helping organize a digital assets conference at Duke University on Jan. 20-21. After all, I once wrote a Wall Street Journal op-ed calling for a cryptocurrency ban. While I continue to believe that unbacked cryptocurrencies, like bitcoin, provide no economic utility and impose societal costs that vastly outweigh the benefits, I also recognize that the broader digital asset industry is not going away.","Lee Reiners is policy director at the Duke Financial Economics Center and a lecturing fellow at Duke Law. At Duke, he teaches cryptocurrency law and policy and is a frequent media commentator on cryptocurrency regulation. To learn more about Digital Assets at Duke and to register, see here.","How do I know this? Well, for starters I have been teaching and writing about cryptocurrency and digital assets at Duke for over six years. During this time, the sector continuously evolved and defied all predictions, including mine. This history suggests that those arguing the ongoing crypto winter signals the death knell of crypto will similarly be proven wrong.","I have also spoken with countless Duke students from across campus, including students in our groundbreaking Master of Engineering in Financial Technology program, who are passionate about digital assets and blockchain technology and want to make a career out of it. These students are not motivated by a desire to make a quick buck or buy a Lambo; rather, they find the subject matter intellectually engaging and see an opportunity to get in on the ground floor of a still nascent industry with great potential.","Finally, I know digital assets are here to stay because leading figures and firms from the traditional financial system say so.","Writing in the Wall Street Journal last month, Goldman Sachs CEO David Solomon said that he sees “blockchain as a promising technology” that is already changing how corporations raise money and how investors trade stocks. As evidence, he cites Goldman’s use of blockchain in client-to-client trading platforms and its underwriting of a two-year, 100 million euro digital bond for the European Investment Bank with two other banks, all based on a private blockchain.","Read more: BlackRock CEO’s Crypto About-Face","Also last month, BlackRock CEO Larry Fink said that “the next generation for markets, the next generation for securities, will be tokenization of securities.” We have already seen several high-profile examples of tokenization. Last summer, JPMorgan’s Onyx Digital Assets blockchain-based network transferred tokenized shares in a BlackRock money market fund; in September, private equity giant KKR tokenized shares of a feeder fund for the main KKR health-care fund.","These developments may be a far cry from the “purely peer-to-peer version of electronic cash” envisioned by Satoshi Nakamoto, but they are not nothing. Technology and industries evolve as consumers begin to use the product and express their preferences, and as policymakers adjust the regulatory framework to account for new risks. Despite the strident belief among many that crypto represents a new monetary system untethered from central banks and legacy financial institutions, crypto was destined to evolve, with its underlying technology adopted by the same institutions it was supposed to render obsolete.","As we stand in the ashes of the FTX implosion, now is the perfect time to take stock of crypto’s ongoing evolution and look over the horizon to the potential digital asset use cases that will provide genuine economic utility for the long term. This is why my colleagues and I are hosting Digital Assets at Duke this month.","Digital Assets at Duke is not your typical crypto conference. There will be no sports cars parked out front, no nightclub afterparties and no vendor halls with free swag. Instead, we will harness Duke’s strength in interdisciplinary research and industry collaboration to convene key players in the digital assets industry, regulatory experts, and select researchers for two days of rigorous debate and discussion.","Perhaps no issue is more critical to the future path of digital assets than regulation, and we’ll be hearing from representatives of the two federal agencies at the forefront of this debate. Securities and Exchange Commission Commissioner Hester Peirce has consistently criticized what she considers the agency’s “regulation by enforcement” approach to digital assets and has proposed an innovative safe harbor proposal that would provide developers of decentralized networks with a three-year grace period from the registration provisions of the federal securities laws. Commodity Futures Trading Commission Commissioner Kristin Johnson was a distinguished securities and derivatives law scholar prior to joining the CFTC in 2022. While there, Johnson has repeatedly called for “a whole-of-government or comprehensive regulatory regime to ensure effective customer protections in digital asset markets.”","Stablecoins are one digital asset use case that may potentially reduce current frictions in our payments system and facilitate new transaction models like programmable money and micropayments. Our conference will feature speakers from two leading stablecoin issuers that utilize different business and regulatory models. Circle, issuer of the USDC stablecoin, has a money transmitter license in most U.S. states and the company’s leadership has expressed a desire to become a commercial bank. Circle also recently announced a partnership with BlackRock to move 80% of USDC reserves to a government-only money market mutual fund created by BlackRock, a proposal that has drawn the ire of banking groups. The USDF Consortium is taking a different approach to its yet-to-be issued USDF stablecoin by restricting consortium membership to FDIC-insured banks and working with Figure to issue tokenized deposits on the Provenance blockchain.","The collapse of FTX and other centralized crypto firms over the past year has led to renewed calls by crypto supporters for a return to crypto’s decentralized roots and an embrace of decentralized finance (DeFi). As noted in a recent Federal Reserve Bank of New York blog post, “DeFi protocols appear to have continued to function as intended in 2022 and no protocols have been closed down.” Our conference will dissect DeFi’s performance over the past year and DeFi’s future growth potential in panels on decentralized exchanges and DeFi applications beyond exchanges.","Digital Assets at Duke also features panels on tokenization, central bank digital currency, security and institutional adoption. In sum, the conference will bring together the people and companies that are focused on the development, delivery and regulation of the next-generation digital asset environment.","\n"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Federal Reserve Bank of New York","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"European Investment Bank","content":"ORGANIZATION"},{"type":"Duke Law","content":"ORGANIZATION"},{"type":"Duke","content":"ORGANIZATION"},{"type":"21","content":"DATE"},{"type":"Duke Financial Economics Center","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Duke University","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Kristin Johnson","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"USDF Consortium","content":"ORGANIZATION"},{"type":"Jan. 20","content":"DATE"},{"type":"Goldman’s","content":"ORGANIZATION"},{"type":"Onyx Digital","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Exchange Commission Commissioner Hester Peirce","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Lee Reiners","content":"PERSON"},{"type":"David Solomon","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"KKR","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["Opinion","Education","Stablecoins","Crypto"],"authors":["Lee Reniers"]}