{"summary":"Chinese tech giant Tencent is said to be forming a team to research digital currencies\nThe move is aimed at further developing the company’s payment business\nTencent’s WeChat Pay is already one of the largest payment processors in the world, having over 900 million monthly active users","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51475\/tencent-to-set-up-digital-currency-research-unit-aiming-to-further-expand-its-payment-business","publishDate":"2019-12-26T01:43:26","id":1582,"type":null,"title":"Tencent to set up digital currency research unit, aiming to further expand its payment business","category":["China"],"content":["Chinese conglomerate Tencent, with a market capitalization of <a href=\"https:\/\/ycharts.com\/companies\/TCEHY\/market_cap\" data-v-f87c67ca=\"\">over $460 billion<\/a>, is said to be forming a team to research digital currencies.","According to Chinese media <a href=\"https:\/\/finance.sina.com.cn\/blockchain\/coin\/2019-12-26\/doc-iihnzhfz8406808.shtml\" data-v-f87c67ca=\"\">reports<\/a>, Tencent has issued an internal notice to employees, saying that it is looking for someone to head the digital currency research team. The team will be part of Tencent’s payments arm and focus on further developing the company’s payment business.","The team will help “advance the company's payment strategy layout and ensure the long-term healthy development of payment business,\" per the notice.","Tencent, who is also the owner of the Chinese mobile messaging giant WeChat, will reportedly support the central government's pilot digital currency plan in Shenzhen city. China’s central bank has already <a href=\"https:\/\/www.forbes.com\/sites\/michaeldelcastillo\/2019\/08\/27\/alibaba-tencent-five-others-to-recieve-first-chinese-government-cryptocurrency\/\" data-v-f87c67ca=\"\">said<\/a> that Tencent will be one of a few companies to receive upcoming digital yuan.","Tencent neither denied nor provided further information about setting up the digital currency research unit, per the Chinese media reports. It is also not clear how specifically the company plans to further grow its payment business through the initiative.&nbsp;","Tencent’s WeChat Pay is already one of the largest payment processors in the world, <a href=\"https:\/\/www.mobilepaymentstoday.com\/news\/allied-wallet-adds-wechat-pay-with-900-million-active-users\/\" data-v-f87c67ca=\"\">having<\/a> over 900 million active users every month. Rival Alibaba’s AliPay has 500 million active users, while Apple Pay has over 125 million users globally.","Tencent has been an active player in cryptocurrencies and blockchain technology. It has issued three blockchain whitepapers since 2017. Its most <a href=\"https:\/\/www.coindesk.com\/tencent-says-libra-would-pose-serious-threat-to-alipay-wechat-pay\" data-v-f87c67ca=\"\">recent whitepaper<\/a> described how the proposed launch of Facebook-led Libra stablecoin would pose serious risks to existing digital payment systems. “The launch of Libra would significantly affect the course of global expansion for digital payment companies, especially for those who are not in the Libra consortium,” the whitepaper read.","Last month, Tencent also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46462\/chinese-tech-giant-tencent-granted-hong-kong-license-to-open-virtual-bank\" data-v-f87c67ca=\"\">received<\/a> a license from the Hong Kong authority to open a virtual bank to provide financial services using blockchain technology. Earlier this month, the company’s virtual bank, WeBank, <a href=\"http:\/\/www.financialnews.com.cn\/kj\/qkl\/201912\/t20191209_173048.html\" data-v-f87c67ca=\"\">became<\/a> the first technical infrastructure provider for China's national blockchain network to serve a range of state-controlled public services across the country."],"hashtag":[]}