{"summary":"Bitcoin and crypto aren't unraveling the banks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/20\/bitcoin-laughs-as-credit-suisse-implodes\/","publishDate":"2023-03-20T15:44:09","id":15824,"type":null,"title":"Credit Suisse’s Buyout Shows Banks Still Have a Banking Problem","category":["Consensus Magazine"],"content":["Time to add Credit Suisse (CS) to the list of bank failures we’ve seen so far in 2023.","Over the weekend UBS agreed to buy Credit Suisse for what equates to about $3.25 billion of UBS stock complete with the Swiss government helping absorb some of the coming writedowns of CS’s loan book. UBS had to step in to save CS after last Wednesday's 50 billion Swiss franc liquidity injection from the Swiss National Bank proved insufficient to buoy the bank’s operations once the Saudi National Bank (CS’s largest shareholder) said it wouldn’t provide any more assistance.","We’ve come full circle: During the last financial crisis in 2008 it was UBS that was saved by the long arm of the Swiss government. This time the government needed UBS to lend a helping hand.","There are many financial system and banking system takes to be had here, but here’s a crypto-focused one.","Despite its lofty side quest to disrupt finance, it wasn’t crypto that upended these banks and it certainly didn’t upend Credit Suisse. Bankers were so busy laughing at crypto's unraveling they didn't realize their banks were also unraveling.","Instead of failing because Bitcoin made banking services obsolete, Credit Suisse failed because it wasn’t good at being a bank. Remember in 2021 when Credit Suisse took $5.5 billion of losses on loans in connection to Archegos? And remember how it was embroiled in enough fraud in 2014 that it had to pay $2.6 billion to the United States Department of Justice?","Some other stuff happened and then Credit Suisse was forced to sell itself to a competitor at a steep discount.","All the while, bitcoin’s price is trending up as banks fail simply because they are being banks. This is really the first time the narrative of bitcoin as a way to opt out of unadvisable banking practices is playing out as we would have expected.","Banks are failing because they are bad at being banks and the Bitcoin blockchain is completely separate from those failures. Bitcoin is on the outside looking in on the mess and offers itself as a genuine means to opt out.","Banks don’t have a crypto problem, banks have a banking problem."],"entity":[{"type":"2014","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"CS","content":"ORGANIZATION"},{"type":"Swiss National Bank","content":"ORGANIZATION"},{"type":"Credit Suisse (CS","content":"ORGANIZATION"},{"type":"UBS","content":"ORGANIZATION"},{"type":"$3.25 billion","content":"MONEY"},{"type":"upend Credit Suisse","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"last Wednesday","content":"DATE"},{"type":"Saudi National Bank (CS","content":"ORGANIZATION"},{"type":"$5.5 billion","content":"MONEY"},{"type":"United States Department of Justice","content":"ORGANIZATION"},{"type":"50 billion","content":"MONEY"},{"type":"$2.6 billion","content":"MONEY"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Newsletters","The Node","Credit Suisse","UBS","Swiss National Bank","Saudi Arabia","DOJ","Bitcoin","Banking","Bailouts","Crypto"],"authors":["George Kaloudis"]}