{"summary":"With upgrades to the Aave lending\/borrowing protocol and Lens, an open-source social media protocol, the Estonian native kept BUIDLing in a down-market.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/04\/stani-kulechov-defied-crypto-winter\/","publishDate":"2023-12-04T14:12:06","id":15825,"type":null,"title":"Stani Kulechov Defied Crypto Winter","category":["Consensus Magazine"],"content":["Stani Kulechov is the founder and CEO of Avara, the software development company behind decentralized finance (DeFi) protocol Aave; the stablecoin GHO, which launched this year; and the upstart Web3 social protocol, Lens Protocol, which recently arrived on the Polygon layer 2. The main Aave protocol upgraded to V3 this year, improving user accessibility and introducing security features.","Aave, a DeFi lending platform primarily based on the Ethereum blockchain, lets users take out instant loans denominated in cryptocurrency using other cryptocurrencies they own as collateral. It also allows users to lend out their crypto to earn returns. The smart contract-based system sets rules for how funds, collateral and fees are distributed and assessed, effectively creating a self-executing model of finance with few or no intermediaries.","This profile is part of CoinDesk's Most Influential 2023. For the full list, click here.","This isn't an easy time for DeFi players. The total value locked in DeFi protocols is about a quarter ($40 billion) of what it was at the height of the market in November 2021. Kulechov says the last year has been dedicated to building better infrastructure for DeFi, including improved accessibility and user interfaces to increase participation. \"The amount of value, like, it really depends obviously on what's the need, for example, for liquidity,\" Kulechov told CoinDesk. \"It depends on the opportunities in finance and how much there's actually access to participate as well.\" In other words, the amount of deposits or \"total value locked\" (TVL) on Aave is a function of the market as much as the performance of the technology itself.","Kulechov was born in 1991 in the former Soviet Republic of Estonia, before his family emigrated to Finland and settled in Helsinki amid the economic crisis that followed the Soviet Union's collapse. In 2015, while at Helsinki University School of Law, he came across Ethereum and started learning about smart contracts. Kulechov built \"ETHLend,\" the precursor to the Aave Protocol, while in his dorm room at the same university. Kulechov now lives in London, where Avara is based.","In 2024, Kulechov expects to see further expansion of staking (which had a breakout year in 2023) and further integration of \"real-world assets\" including tokenized Treasuries and securities. He's also excited about Lens and decentralized social media, which he expects to build slowly but surely as more people turn away from centralized services like Twitter and start to control their own online data. \"There's a lot of social capital that we create in our internet and in real life and Lens helps to preserve that capital in ownership directly for the users,\" he said. \"It's still in the very early stages, but we already have that infrastructure of decentralized social media that is quite significant for our space.\"","Finally, Kulechov expects to see more talk of blockchain technology offering verifiability and tracking for artificial intelligence development. \"I think we'll start to see how to govern AI from the perspective of using blockchain as well. I think that's another interesting area that gets less attention from our industry, and could be an interesting tool,\" he said."],"entity":[{"type":"Avara","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"Helsinki","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"GHO","content":"LOCATION"},{"type":"$40 billion","content":"MONEY"},{"type":"1991","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Aave","content":"ORGANIZATION"},{"type":"Helsinki University School of Law","content":"ORGANIZATION"},{"type":"Avara","content":"ORGANIZATION"},{"type":"Soviet Union","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Kulechov","content":"ORGANIZATION"},{"type":"Estonia","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"November 2021","content":"DATE"},{"type":"Finland","content":"LOCATION"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["Features","Most Influential 2023","no-livewire","Aave","Lens Protocol","Stani Kulechov"],"authors":["Ben Schiller"]}