{"summary":"Most risk assets are in a holding pattern ahead of the Federal Reserve Economic Symposium, where Jerome Powell will speak later this week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/08\/22\/market-wrap-bitcoin-price-falls-as-markets-await-fed-chair-powells-comments\/","publishDate":"2022-08-22T20:31:26","id":15829,"type":null,"title":"Market Wrap: Bitcoin Price Falls as Markets Await Fed Chair Powell’s Comments","category":["Markets"],"content":["BTC Trims Price Ahead of Economic Summit; Macroeconomic Uncertainty","Bitcoin (BTC) sold off mildly in Monday trading, declining 1.8% on average trading volume. The largest cryptocurrency by market capitalization rose 3% over the weekend, and has settled in near the $21,000 mark after plunging Friday.","Ether (ETH), the second-largest cryptocurrency by market capitalization, was recently down 2% on Monday, following an increase of 0.58% over the weekend.","This article originally appeared in Market Wrap, CoinDesk’s daily newsletter diving into what happened in today's crypto markets. Subscribe to get it in your inbox every day.","All eyes appear focused on global, macroeconomic developments and the impact that both growth and inflation will have on crypto assets. Investors will be listening to comments by Fed Chair Jerome Powell during the Federal Reserve Bank of Kansas City's Economic Policy Symposium in Jackson Hole, Wyoming, later this week for hints of what the central bank will do at its September meeting.","The symposium, which begins Friday, is expected to provide insight into the pace at which Powell expects the Federal Open Market Committee (FOMC) to increase rates for the remainder of the year.","According to the CME FedWatch tool, the probability of a 75 basis point interest rate increase has risen to 54.5% from 47% one day prior.","In global economic news, Hong Kong’s annual inflation rate for July increased to 1.9%, from 1.8% the previous month, but below consensus estimates of 2%.","Traditional markets sold off as well, with the Dow Jones Industrial Average (DJIA), S&P 500 and tech heavy Nasdaq composite falling 1.9%, 2.1% and 2.6%, respectively.","Energy markets saw crude oil increase .3%. Natural gas was 4% higher, with the increase likely driven by supply shortage concerns. Traditional safe haven asset gold recently dropped 0.78%, while copper futures declined 0.3%.","●Bitcoin (BTC): $21,094 −2.0%","","●Ether (ETH): $1,579 −2.9%","","●S&P 500 daily close: 4,137.99 −2.1%","","●Gold: $1,748 per troy ounce +0.0%","","●Ten-year Treasury yield daily close: 3.04% +0.05","","Bitcoin, ether and gold prices are taken at approximately 4pm New York time. Bitcoin is the CoinDesk Bitcoin Price Index (XBX); Ether is the CoinDesk Ether Price Index (ETX); Gold is the COMEX spot price. Information about CoinDesk Indices can be found at coindesk.com\/indices.","BTC moves into oversold territory","Monday’s chart shows BTC’s decline into “oversold territory” on multiple indicators. Bitcoin’s RSI fell below 30 during Friday’s 10% price drop, recovering since then to 34.","RSI (relative strength index), is a technical indicator that measures price momentum. Readings above 70 traditionally indicate that an asset is overbought (i.e., overvalued), while readings at 30 or below imply that an asset is oversold (i.e., undervalued).","Bitcoin’s current reading, while slightly above 30, indicates that BTC is undervalued, although the recent price moves have come on lower-than-average, trading volume.. Lower-than-average trading volume can imply a lack of conviction in a trade both now and in the near future. As markets await Fed Chair Powell’s symposium comments on Friday, BTC will likely trade relatively flat on lower volume in the coming days.","BTC’s so-called Bollinger bands also imply that bitcoin is currently undervalued. Bollinger bands measure the moving average for an asset (typically 20 days) and calculate values that are two standard deviations above and below the moving average. A standard deviation is a measurement of the distance from the average. Traditionally, 95% of values fall within two standard deviations of the average.","Traders often view movements outside of two standard deviations as a sign that prices have risen abnormally high or low, and identify this signal when BTC prices move outside their Bollinger Bands. BTC’s current chart indicates that prices have breached the lower range of their Bollinger Bands, implying that price is oversold.","ETH loses ground to BTC","Ether’s increase relative to BTC has slowed recently. ETH had been surging compared to BTC since July 13 but has declined 9% since a near-term peak over $2,000 on Aug. 13.","As they consider wider macroeconomic uncertainty, traders may also be weighing whether ether’s price has already baked in the full impact of the upcoming Ethereum Merge, which is scheduled for September.","Most investors appear to be expecting Powell to signal continued monetary hawkishness. Traditional equity markets sank even more substantially than most cryptos on Monday. In bond markets, the 10-year Treasury bond yield increased beyond 3% for the first time since July. The increase in rates implies that bond buyers require a higher rate of return to lend, and that the FOMC will increase rates 75 basis points to match the past two rate hikes.","Target rate probabilities for the FOMC’s September meeting are now implying a 54.5% chance that rates will increase 75 basis points. A week ago, the probability for a 75 basis point hike was just 39%.","If Powell signals that the FOMC is likely to increase rates by only 50 basis points, both traditional and digital asset prices will likely push higher. The central bank chair commands the stage.","Sector classifications are provided via the Digital Asset Classification Standard (DACS), developed by CoinDesk Indices to provide a reliable, comprehensive and standardized classification system for digital assets. The CoinDesk 20 is a ranking of the largest digital assets by volume on trusted exchanges."],"entity":[{"type":"Aug. 13","content":"DATE"},{"type":"0.58%","content":"PERCENT"},{"type":"0.78%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Jackson Hole","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"39%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"47%","content":"PERCENT"},{"type":"$2,000","content":"MONEY"},{"type":".3%","content":"PERCENT"},{"type":"Digital Asset Classification Standard (DACS","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"CME","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"BTC Trims Price Ahead of Economic Summit; Macroeconomic Uncertainty","content":"ORGANIZATION"},{"type":"2.0%","content":"PERCENT"},{"type":"3.04%","content":"PERCENT"},{"type":"Fed Chair Powell","content":"ORGANIZATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Bollinger Bands","content":"ORGANIZATION"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Federal Reserve Bank of Kansas City's Economic Policy Symposium","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"$1,579","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"+0.0%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"2.9%","content":"PERCENT"},{"type":"1.8%","content":"PERCENT"},{"type":"weekend","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"0.3%","content":"PERCENT"},{"type":"2.1%","content":"PERCENT"},{"type":"Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"$21,000","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"54.5%","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"1.9%","content":"PERCENT"},{"type":"$1,748","content":"MONEY"},{"type":"2.6%","content":"PERCENT"},{"type":"July 13","content":"DATE"},{"type":"Wyoming","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"Ethereum Merge","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$21,094","content":"MONEY"}],"hashtag":["Market Wrap","Markets","Bitcoin","Ether","Altcoins"],"authors":["Glenn Williams","Jimmy He"]}