{"summary":"Hong Kong has said it wants to be a crypto hub but its banks are rejecting account opening applications.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/05\/17\/even-licensed-firms-say-opening-bank-accounts-is-hard-in-hong-kong\/","publishDate":"2023-05-17T07:16:34","id":15826,"type":null,"title":"Even Licensed Firms Say Opening Bank Accounts Is Hard in Hong Kong","category":["Policy"],"content":["Crypto companies' applications to operate in Hong Kong following its push to reinstate itself as a crypto hub have been piling up, but these companies are finding it difficult to do something as basic as open a bank account.","Applicants told CoinDesk that just eight officers at the Securities and Futures Commission (SFC) are handling around 80 applications, and even licensed firms are running into difficulties when it comes to bank accounts.","“This probably would have been a different story six or nine months ago,” Amy Yu, APAC CEO for crypto bank SEBA, told CoinDesk.","Hong Kong has become a jurisdiction that companies are considering, after regulators relaxed their opposition to the sector, even as other countries look more critically at crypto. Singapore’s financial regulator has made it clear to the market that it will be less supportive of what it considers to be speculative, and the U.S. looks less than friendly to crypto.","Hong Kong's de facto central bank knows that banking access is an issue for crypto companies. The Hong Kong Monetary Authority (HKMA) has reminded banks that there’s no ban on offering crypto firms accounts, but a roundtable it organized last month, attended by banks and crypto firms, focused only on easing access for firms that already held or which were applying for licenses, an attendee told CoinDesk.","“It was more like a wish list from the regulator,” he said. “Whether the banks fully embrace it is another matter.”","CoinDesk spoke to a C-suite executive at a crypto firm based in Hong Kong that holds a Type 9 license, which allows the company to carry out asset management activities. The company was still unable to open a Hong Kong bank account and relied on overseas banking partners. This executive said that this made on- and off-ramping difficult for potential investors.","“It’s not clear to us what extra information the banks need,” she told CoinDesk. “Internally, they don’t seem sure about what they want from us.”","Venture capital firm Braeside founder Tak Lo told CoinDesk that “many crypto companies present themselves as other firms other than asset management firms in order to facilitate bank account opening.”","When companies are upfront about what they do, that can mean their applications are rejected.","Prosynergy managing director Louie Lee told CoinDesk that opening bank accounts is an “acute issue” at the moment, and that banks can be \"sensitive and restrictive in their approach.”","Amid all the talk of licensing and regulations in Hong Kong, “not all crypto-related activities require a license,” Lee continued. “You may be operating in an unregulated space, but this does not mean it's illegal,” he said.","“The process is you apply and you get rejected,” Jehan Chu, founder of crypto venture capital firm Kenetic, told CoinDesk.","Even if firms manage to get accounts, Chu added, “six months later you get it shut down for no reason.” He said that firms try to stay low-profile.","Sometimes firms opt to buy an expensive insurance or investment product so that their relationship is more valuable for the bank.","It’s considered the cost of doing business since banks are for-profit entities after all. But that kind of decision doesn’t make sense for many startups.","Even players who have successfully opened bank accounts “have a lot of uncertainty on whether or not they can continue having that account going forward,” corporate credit card issuer Reap co-founder Kevin Kang told CoinDesk.","This uncertainty means they’re constantly on the look out for new options and opportunities to set up bank accounts.","“They don't have visibility on when they're going to be checked,” Kang said, referring to banks examining transactions.","When transactions are targeted by a compliance team within banks, it can mean the company is unable to use that account. Unless they provide a certain amount of documentation within a period of time on those transactions, their transactions may be stopped and sent back.","Firms are subject to the whims of the bank account providers and end up dedicating resources to opening bank accounts.","It’s not the first time an industry in Hong Kong has encountered issues with bank account opening.","Kang points to money-service operators who held licenses from the Customs and Excise Department that enabled them to exchange funds. Banks were reluctant to serve them due to perceived anti-money laundering and counter-terrorist financing risk.","Policies or actions from the regulator may give the banks more confidence such as having deposit requirements, Kang said.","Lee added that it doesn’t help that another Asian financial hub, Singapore, has had trouble with the collapses of crypto companies which did hold licenses, like Three Arrows Capital.","Some local players have stepped into the space, with virtual bank ZA Bank presenting itself as the go-to bank for Web3 businesses.","Following the collapse of crypto-friendly bank Silvergate, “inquiries have increased enormously,” ZA co-head of retail banking Devon Sin told CoinDesk.","Most players who CoinDesk spoke to were optimistic about future discussions on banking between the industry and the regulators.","Of the roundtable last month, Lee told CoinDesk, “It's a step in the right direction whereby people can have a constructive discussion with the regulators on their challenges and the regulators are proactively seeking solutions.”","Read more: Hong Kong Proposes Rules for Trading Platforms","Edited by Nikhilesh De."],"entity":[{"type":"Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"SEBA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"Lee","content":"PERSON"},{"type":"Kang","content":"PERSON"},{"type":"Amy Yu","content":"PERSON"},{"type":"Kevin Kang","content":"PERSON"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Tak Lo","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Kenetic","content":"LOCATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Braeside","content":"ORGANIZATION"},{"type":"Excise Department","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Jehan Chu","content":"PERSON"},{"type":"Louie Lee","content":"PERSON"},{"type":"ZA Bank","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Devon Sin","content":"PERSON"}],"hashtag":["Analysis","Policy","Hong Kong","Hong Kong Monetary Authority","Banking","Banking Regulation"],"authors":["Lavender Au"]}