{"summary":"Commissioners took a step toward requiring derivatives clearing organizations, a key type of middleman in the industry, to keep their customers' money segregated from their own funds.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/13\/cftc-pushes-ftx-inspired-rule-to-protect-customers-money\/","publishDate":"2023-12-13T22:33:34","id":15821,"type":null,"title":"CFTC Pushes FTX-Inspired Rule to Protect Customers' Money","category":["Policy"],"content":["The U.S. Commodity Futures Trading Commission took a step toward requiring derivatives clearing organizations, a key type of intermediary in the industry, to keep their customers' money segregated from their own funds.","The CFTC's move is at least partially inspired by FTX's collapse last year, designed to prevent derivatives firms from meddling with money belonging to their clients. In FTX's case, billions of dollars of customer money was stolen.","In a vote Wednesday, CFTC commissioners voted to publish the proposal for public feedback, a key step in the process to enact a rule that would apply to any companies under the commodities regulator's umbrella. If a DCO faces a liquidity crunch, such as a crypto exchange facing high number of withdrawal requests, customer funds would be protected, according to the proposed rule's goals.","\"It's an important proposal because I think there are a lot of outstanding questions about policy risk and the law,\" said Chairman Rostin Behnam, who voted for the proposal. \"In the past two or three years, we've seen an advent of new market participants with new ideas about how markets function and what they view as the most efficient sort of execution models for for their business, whether it's in traditional finance or obviously we're seeing this in a lot of the crypto space.\"","The proposal would allow DCOs to commingle \"proprietary funds\" from different clearing members, referring to any funds or property held by a DCO on behalf of a clearing member, but the regulator would not let any commingling of proprietary funds, customer funds or the DCO's funds.","The collapse of FTX – the company whose one-time LedgerX affiliate tried to blaze a trail at the CFTC in clearing customer transactions without middlemen – was a \"significant motivation\" for this proposal, said Commissioner Kristin Johnson, who offered \"a full-throated\" vote in favor of the proposal.","Johnson said FTX illustrates \"the magnitude of losses that customers may experience in the absence of regulation that prohibits commingling of customer funds or member property.\"","Commissioner Summer Mersinger, who cast one of the two \"no\" votes, said during her round of questioning that she would have liked more time to review some of the issues in the proposal and expressed concern that some issues hadn't been addressed. She would have liked to have seen a discussion comparing the proposal's requirements with existing DCOs, as well as a cost-benefit analysis for the proposal.","\"Customer protection is foundational to the work we do here at the CFTC, but that does not absolve us of our responsibility to perform a cost-benefit analysis,\" Mersinger said.","Read more: Ex-FTX Unit LedgerX in Gray Area Beyond CFTC Proposal on Customer Funds: Commissioner","Commissioner Caroline Pham, who voted to concur (essentially an abstention that supports the majority of the votes cast), opened her statement by saying the agency \"already has extensive rules in place\" for protecting customer customer funds at futures commission merchants – essentially, a broker in the derivatives industry – and warning that the regulator must be careful in how it changes existing regulatory frameworks.","\"If the commission anticipates this type of DCO clearing model to proliferate, we should step back and consider all issues these direct clearing DCOs raise,\" she said.","Commissioner Christy Goldsmith Romero, who also voted against the proposal, commented on how the actual crypto investors using a platform would be the members of a clearing organization that did not have FCMs as intermediaries, rather than customers as they would typically be defined in CFTC regulations.","\"We're basically sort of putting these regular people – in, like, retail – in the role of an FCM,\" she said, referring to the disintermediated companies seeking to cut futures commission merchants out of the process. \"Do you think that the regular people, the individuals who are involved in these matters, understand that they're not a customer, they don't have this access to to all the customer protections?\"","Edited by Nick Baker.","\n"],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"DCO","content":"ORGANIZATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"FCM","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"Caroline Pham","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Gray Area Beyond CFTC","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Kristin Johnson","content":"PERSON"}],"hashtag":["Regulations","CFTC","Rulemaking","Derivatives","FTX Collapse"],"authors":["Nikhilesh De","Jesse Hamilton"]}