{"summary":"Experimentation with tokenization is leading to growing confusion about terminology, and that is getting in the way of a deeper understanding of its potential, says Noelle Acheson.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/02\/15\/we-need-clearer-terminology-for-crypto-tokenization-coindesk\/","publishDate":"2023-02-15T15:28:06","id":15823,"type":null,"title":"Security Tokens and Tokenized Securities Are Not the Same Thing","category":["Consensus Magazine"],"content":["Tokenization is back. Some of you may remember the heyday of 2017-18, when everything was going to be tokenized and put on the blockchain. Banks were lining up to launch proofs of concept but clients were thin on the ground. Now, experimentation has spread well beyond the initial cohort, and even regulators are turning their attention to the topic.","Along with greater interest comes greater confusion. You’ve probably noticed that sometimes the assets in question are called “security tokens” and sometimes they’re “tokenized securities.” Now, most people won’t care what they’re called – it’s the idea that matters, right? We’ll sort out the terminology later. Pedants like me, however, exist to point out that ‘nope, terminology does matter,’ even from the beginning. Here’s why.","First, the two terms do not refer to the same thing:","Noelle Acheson is the former head of research at CoinDesk and Genesis Trading. This article is excerpted from her Crypto Is Macro Now newsletter, which focuses on the overlap between the shifting crypto and macro landscapes. These opinions are hers, and nothing she writes should be taken as investment advice.","All tokenized securities could be classified as security tokens, but not all security tokens are tokenized securities. By lumping the terms together we are blurring the distinction, and this hurts the broader understanding of the underlying potential and hinders classification attempts, which in turn impacts both regulation and investment.","Security tokens are a new concept. They are created on-chain, for on-chain purposes, and do things that haven’t been done before on rails that didn’t exist until a few years ago. They enable new forms of financing, user engagement, investor reward, project governance and much more. We haven’t even begun to scratch the surface of how the concept can influence the evolution and implementation of ideas.","Tokenized securities are an old concept in a new wrapper. They take existing formats and add additional conveniences such as improved settlement, greater transparency, more flexibility and a broader reach. They are also undergoing a dizzying burst of experimentation: Over the past couple of months, we’ve seen financial institutions and official organizations not just trialing but actually issuing shares, credit notes, municipal bonds, development bonds, funds, commercial paper and gold on blockchains.","Read more: Noelle Acheson - Bitcoin, Markets and the Symmetry of Information","Security tokens, however, are struggling amid a lack of regulatory clarity, and the all-too-familiar regulation-by-enforcement approach of the U.S. Securities and Exchange Commission (SEC). To pick an example, starting in 2016 LBRY – a decentralized storage protocol and media service – financed its development through the issue of LBC tokens, which would enable access and engagement once the platform was up and running. For many, these were obviously utility tokens since they enabled use of the service. For the SEC, they were security tokens since their issue financed the project. In 2021 the regulator brought an enforcement action against LBRY. The issuer pushed back, but in November a judge ruled in the SEC’s favor.","The two concepts on the surface may appear similar but lift the lid and you can see that the difference is stark: It’s about clarity and establishment support versus the lack thereof. It’s also about development. With security tokens, the fear of SEC reprisals is holding back many worthwhile projects from testing out ideas in the market, while tokenized securities are getting busy.","This brings us to one of the main reasons the distinction is important: the divergent regulatory approaches. Tokenized securities are unlikely to attract much attention other than classification tweaks and requirements that custody practices check the right boxes. International regulators are working on explicit rules to deal with the adaptation of securities to blockchains, and along with official support will come even more establishment experimentation and eventually client demand.","Security tokens are somewhat contentious, however. The process initiated against LBRY, mentioned above, took almost two years to work through the courts; the SEC’s case against Ripple for allegedly issuing unregistered securities is now in its third year. In the U.S. judicial system precedents matter, but imagine the sheer consumption of legal resources should more SEC targets decide to push back. This is unsustainable, but until the U.S. regulators understand this, progress is hindered.","Read more: Noelle Acheson - Why Crypto Is Not an 'Industry'","The distinction also matters from an investment point of view. Conflating the terms implies an establishment acceptance of security tokens that is not yet there. It also underplays the innovative potential of security tokens by suggesting they are merely securities on a blockchain.","Don’t get me wrong: Tokenization of securities is exciting, and the recent activity around the concept is the welcome result of years of solid behind-the-scenes work by developers, market infrastructure firms, banks and financial overseers. The tokenization of securities is one of the main vectors through which crypto markets will transform traditional markets.","Security tokens, however, have an even loftier goal. Once the legal parameters are worked out they could end up impacting much more than markets: They could end up transforming conventional concepts of investment and engagement, possibly unleashing not only new business models but also new sources of value.","In sum, tokenized securities and security tokens are similar on the surface. But looking deeper, they have significant differences that are worth acknowledging. Both concepts are important enough to warrant better care as to their labels."],"entity":[{"type":"almost two years","content":"DATE"},{"type":"Symmetry of Information","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"18","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Security Tokens","Tokenization"],"authors":["Noelle Acheson"]}