{"summary":"The commentariat said decentralized finance is in danger amid the crypto winter and recent spate of hacks. They're dead wrong.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/05\/defi-definitely-isnt-dead\/","publishDate":"2023-08-05T11:00:00","id":15837,"type":null,"title":"DeFi Definitely Isn't Dead","category":["Consensus Magazine"],"content":["I’ve seen a couple articles in the past few days about the death and decay of decentralized finance (DeFi).","The impetus has been the recent issues in DeFi caused by an exploit and crypto founder who is a horrible risk manager. In short: The founder of a prominent automated market maker (AMM) Curve Finance loaned out nearly half of the protocol’s CRV tokens on a few DeFi lenders, and was almost liquidated after an unexpected but somewhat predictable DeFi exploit depreciated the price of CRV.","Adam Blumberg is a certified financial planner as well as the co-founder and chief educator for Interaxis, a company trying to bridge the education gap between digital assets and traditional finance. He is a contributing writer for CoinDesk’s \"Crypto for Advisors\" newsletter.","The first article was a great op-ed in CoinDesk, written by Daniel Kuhn, who said DeFi is “dead inside.” The second was a report from JPMorgan, which argued the overall sector is in “shrinking or stalling mode.” These commentators couldn't be further from the truth, however.","I don’t think DeFi is dead, nor is it shrinking.","The idea of what DeFi was during the summer of 2020 is certainly, and thankfully dead. It was a time of too much bribery, liquidity and talk of yield. “Yield farming,” the fuel to DeFi Summer’s fire, eventually calmed down and a few decentralized platforms emerged as market leaders – many of which took professional “white glove” services in aim for expansion.","But the sector is not perfect. As Daniel noted, we also have far too much power in the hands of too few people. Sounds too familiar.","The difference with this technology versus tech of the past, is that DeFi has been financialized to an extreme. It's not ideal when a bunch of programmers start playing financiers.","But we need to remember, we’re still experimenting with the technology. We’re not sure how to use it. Mistakes will be made.","What we’ve accomplished in the last few years is to build robust systems that don’t operate within the confines of traditional corporations, banking rails or even geographical borders. The system has been secure enough that the financial and corporate heavyweights like Mastercard, Visa, Coca Cola, Anheuser Busch, Nike, Starbucks, BNY Mellon, BlackRock and Fidelity are devoting money and internal resources to utilizing the technology for greater efficiency.","These early experiments and corporate explorations show that DeFi can professionalize, and that its market growth does not always need to be driven by FOMO.","Still, while the dream of many is for complete decentralization of all the financial systems, the reality will never match up…at least not in our lifetime. What has been hardest to figure out is the balance of power between self-executing code and the humans that build it.","Curve is just an example: You can’t take the human out of humans. But that’s OK.","We went even further down the road of decentralization with DAO Summer of 2021. It became a given that everyone could join a decentralized autonomous organization through a Discord link, start working for recently minted tokens and get a say in the organization. Until, of course, the founders and investors decide to vote. Then we’re back to corporate hierarchy.","This isn’t meant to be negative but to say that it’s working, even if it doesn’t always seem to. The thing is, DeFi will continue to be challenging. It will get even harder as DeFi continues to grow and butt up against the real world and people who weren’t self-motivated enough to go down the crypto rabbit hole.","On one side of the crypto divide, we have those who want to keep the traditional economic, financial and corporate system where the Federal Reserve decides on the money supply, the banks control the money and the government tells us what we can and can’t invest in. In that system, the major, publicly held companies get to control our data, and there isn’t much we can do about it.","On the other extreme, we have The Degens, or traders, builders and protocol creators who want to vote on everything based on token count and run the world on money made via computer code.","In reality we'll likely end up somewhere in between.","There are still trillions of dollars in real estate, private and public companies and debt instruments that all need to be accounted for, traded and borrowed against. Those are not going on-chain overnight. But the world is heading there.","See also: Tokenize Everything: Institutions Bet on Crypto's Future","And when we do see more assets denoted on-chain, DeFi will be waiting to provide loans, liquidity and transparency. It’s worth saying that Curve CEO Michael Egorov took out loans in accordance with the system, and the world was able to learn about his potentially toxic debt because it was all on-chain. Many people even called him out. Where else in finance would such dangers be public knowledge?","The successful growth of the DeFi ecosystem and technology has swung the pendulum and shifted the center. It’s possible that because DeFi offers transparency, efficiency, disintermediation and self-custody this will become the norm across the entire financial system. Otherwise banks will get outcompeted by the innovation happening in lending, borrowing and insurance, which offers more people more chances to participate.","The experiments aren’t perfect, but that’s why they’re experiments. While the Curve situation is unsettling, the move toward decentralization means we just have to let the market work. Let the protocols, teams and systems make the necessary changes.","DeFi isn’t dead or dying at all. In fact it’s really just coming to light.","Edited by Daniel Kuhn."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"trillions of dollars","content":"MONEY"},{"type":"CRV","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Daniel","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"FOMO","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Michael Egorov","content":"PERSON"},{"type":"Adam Blumberg","content":"PERSON"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Coca Cola","content":"LOCATION"},{"type":"DAO Summer of 2021","content":"ORGANIZATION"},{"type":"Anheuser Busch","content":"PERSON"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"summer of 2020","content":"DATE"}],"hashtag":["Opinion","Advisers","Tokenization","DeFi","Hacks"],"authors":["Adam Blumberg"]}