{"summary":"The new composition report is part of Tether’s efforts to stay in compliance with a settlement with the New York Attorney General.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/05\/13\/tethers-first-reserve-breakdown-shows-token-49-backed-by-unspecified-commercial-paper\/","publishDate":"2021-05-13T12:00:00","id":15836,"type":null,"title":"Tether's First Reserve Breakdown Shows Token 49% Backed by Unspecified Commercial Paper","category":["Markets"],"content":["","Tether revealed the breakdown of its reserves for the first time, casting another sliver of light on the backing of USDT, the largest cryptocurrency pegged to the U.S. dollar.","","","Much remains murky, however, in part because the pie charts provided by Tether on Thursday make no mention of any independent review by an accounting firm. Moore Cayman, an audit firm in the Caribbean with five employees, has published two reports this year attesting that USDT is fully backed. But the auditor (part of the Moore Global confederation of accounting and consulting firms) did not detail what exactly is backing the token.  ","","","To be fair, other stablecoin issuers like Circle and Gemini don't typically produce breakdowns of their reserve compositions at all. Gemini’s accountant, for example, states in its attestations that the client’s reserves are held in either FDIC-insured accounts at State Street Bank or a Goldman Sachs Asset Management money market fund that invests solely in U.S. Treasury securities. The percentage of each is not provided — but then again, both are considered highly liquid and creditworthy assets (“money-good,” in Wall Street parlance). The same cannot be said of all the assets on Tether’s balance sheet.","","","The new composition report is part of Tether’s efforts to stay in compliance with a settlement agreed to with the New York Attorney General’s office (NYAG) after the prosecutor investigated it and its sister crypto exchange Bitfinex over the cover-up of some $800 million in losses. ","","","Bitfinex and Tether paid an $18.5 million dollar fine and agreed to provide quarterly breakdowns of its reserves as part of the settlement. ","","","“Tether proposed ongoing publication of the reserve breakdown as part of our settlement agreement with the New York Attorney General’s Office, and we committed to make that information available to both the Attorney General’s office and the public,” Tether General Counsel Stuart Hoegner said in a statement. “Today’s publication reflects our ongoing dedication to transparency.”","","","The breakdown states that the bulk of Tether’s reserves are in cash, equivalents or other short-term deposits, with the remainder in secured loans, corporate bonds and other investments. However, the first category is mostly made up of commercial paper, a form of corporate debt that can be easily converted to cash – or not, depending on the issuer and market conditions.","","","According to the breakdown, Tether’s reserves as of March 31, 2021 were composed of 75.85% cash and equivalents, 12.55% secured loans, 9.96% in corporate bonds and precious metals and 1.64% in other investments, including digital currencies. This is consistent with the company’s past statements but more precise.","","","The cash section was further broken out into different components: 65.39% commercial paper, 24.2% fiduciary deposits, 3.87% cash, 3.6% reverse repo notes and 2.94% Treasury bills.","","","It is unclear what the ratings are on the commercial paper or the corporate bonds, which agencies rated them or which companies issued them. Likewise, Tether declined to identify the borrowers of the loans or the collateral backing them.","","","\"That's a little iffy,\" said Francine McKenna, an adjunct professor at American University's Kogod School of Business, former auditor and writer of The Dig, a newsletter about accounting and corporate governance. \"All commercial paper is not created equal, because of the credit ratings of various companies. Even some of the multinationals that used to be pristine are not so anymore.\"","","","Do the math, and the unspecified commercial paper comes to just under half – 49% – of USDT's collateral.","","","Tether’s reserves are partly invested in bitcoin, which makes up less than 1.64% of its overall backing (in the “other investments” category) and gold, which makes up less than 9.96% of its backing (in the “precious metals” category). ","","","While Thursday’s publication isn’t attested to, the reserves would be the same that Moore Cayman would have examined in publishing assurance reports for the company. The firm published its first report at the end of March, addressing the USDT stablecoin’s backing as of Feb. 28, 2021. Another report was published last month, attesting to the backing as of March 31.","","","USDT is a key piece of plumbing for the roughly $2 trillion global crypto market. Traders use it to quickly transfer dollar value between exchanges to capture arbitrage opportunities when a bank wire is unavailable or too slow.","","","The opacity of Tether’s operations, however, has fanned the flames of speculation by critics who question USDT’s backing and conjecture that the company props up the market by printing tokens.  ","","","Tether has a long history of attempting to verify its reserves, but without providing much in the way of documentation. The company first hired audit firm Friedman LLP, which produced a preliminary report that stated the amount of USDT Tether had issued was backed by its cash reserves, though with several caveats.","","","Read more: A Bridge Called Tether","","","The firm then tapped law firm Freeh Sporkin & Sullivan LLP to publish a report on its backing, but this too was hedged.","","","In late 2018 Tether’s bank, Bahamas-based Deltec Bank & Trust, published a letter with an illegible signature stating the company had $1.8 billion in reserves, matching the amount of USDT in circulation.","","","During the NYAG’s investigation, Hoegner revealed that at one point, Tether was only about 74% backed by reserves.","","","Despite all this, USDT has traded at or near $1 for nearly all of its history.","","","This year, Tether has committed to publishing regular attestations through Moore Cayman.","","","Lawrence Lewitinn contributed analysis.",""],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Feb. 28, 2021","content":"DATE"},{"type":"3.6%","content":"PERCENT"},{"type":"3.87%","content":"PERCENT"},{"type":"State Street Bank","content":"ORGANIZATION"},{"type":"Moore Cayman","content":"PERSON"},{"type":"9.96%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"74%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Caribbean","content":"LOCATION"},{"type":"1.64%","content":"PERCENT"},{"type":"49%","content":"PERCENT"},{"type":"24.2%","content":"PERCENT"},{"type":"Freeh Sporkin & Sullivan LLP","content":"ORGANIZATION"},{"type":"65.39%","content":"PERCENT"},{"type":"Moore Global","content":"ORGANIZATION"},{"type":"Friedman LLP","content":"ORGANIZATION"},{"type":"Goldman Sachs Asset Management","content":"ORGANIZATION"},{"type":"Kogod School of Business","content":"ORGANIZATION"},{"type":"Deltec Bank & Trust","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"$2 trillion","content":"MONEY"},{"type":"American University","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"12.55%","content":"PERCENT"},{"type":"2.94%","content":"PERCENT"},{"type":"Stuart Hoegner","content":"PERSON"},{"type":"$18.5 million dollar","content":"MONEY"},{"type":"Francine McKenna","content":"PERSON"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"75.85%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"New York Attorney General’s Office","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"March 31, 2021","content":"DATE"},{"type":"Hoegner","content":"PERSON"},{"type":"$800 million","content":"MONEY"},{"type":"Lawrence Lewitinn","content":"PERSON"}],"hashtag":["Bitfinex","Tether","Stablecoins","USDT","NYAG"],"authors":["Nikhilesh De","Marc Hochstein"]}