{"summary":"Shares of Kevin O'Leary-backed WonderFi have surged nearly 50% following the announcement.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/04\/03\/trio-of-canadian-crypto-exchanges-confirms-plans-to-merge\/","publishDate":"2023-04-03T14:22:38","id":15835,"type":null,"title":"Trio of Canadian Crypto Exchanges Confirms Plans to Merge","category":["Finance"],"content":["Canadian crypto exchanges WonderFi (WNDR), Coinsquare and CoinSmart have revealed plans to merge, creating what would be one of the world's largest crypto trading platforms.","Between them, the three firms have 1.65 million users and more than $600 million in assets under custody, according to an announcement on Monday.","WNDR shares have surged following the announcement, currently up 43.75% at 23 Canadian cents in early trading. Kevin O'Leary is a strategic investor in WonderFi.","The merger would be the affirmation of separate plans among the three firms in recent months. In January, it was reported that WonderFi and Coinsquare were in advanced talks to combine. This came only days after Coinsquare terminated a previous agreement to acquire CoinSmart.","As one combined company, the exchanges believe they \"have the scale to be the market leader in Canada, a strong balance sheet that will allow for expansion, and a clear path to profitability,\" WonderFi President Dean Skurka said.","Read more: Canada Close to Tightening Rules for Crypto Exchanges: Sources","Edited by Stephen Alpher.","CORRECTION (April 03, 15:25 UTC): Changes combined assets under custody from $600 billion to $600 million","\n","\n"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"Kevin O'Leary","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"Skurka","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"April 03","content":"DATE"},{"type":"23 Canadian cents","content":"MONEY"},{"type":"$600 billion","content":"MONEY"},{"type":"43.75%","content":"PERCENT"},{"type":"Canada Close to Tightening Rules","content":"ORGANIZATION"}],"hashtag":["Canada","WonderFi","Coinsquare","Mergers"],"authors":["Jamie Crawley"]}