{"summary":"The test simulated “proto-danksharding,” a technical feature aimed at reducing the cost of transactions for rollups as well as making data availability cheaper.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/07\/ethereums-dencun-upgrade-reaches-final-holesky-testnet-starting-countdown-to-data-blobs\/","publishDate":"2024-02-07T12:12:00","id":15830,"type":null,"title":"Ethereum's Dencun Upgrade Reaches Final ‘Holesky’ Testnet, Starting Countdown to Data 'Blobs'","category":["Technology"],"content":["The final dress rehearsal for Ethereum’s upcoming Dencun upgrade occurred Wednesday, as the blockchain's biggest changes in almost a year took place on the Holesky test network.","The test simulated “proto-danksharding,” a technical feature aimed at reducing the cost of transactions for rollups as well as making data availability cheaper, through the introduction of “blobs,” a new compartmentalized space for storing data.","The successful upgrade on the Holesky test brings the highly anticipated Dencun closer to its final step: activating live on the mainnet blockchain sometime in the next few weeks.","The upgrade was triggered at 11:34 UTC and finalized shortly thereafter.","Testnets mimic a main blockchain, and are used by developers to run through upgrades, giving them opportunities to patch out any bugs before they reach mainnet.","Holesky was the last of three testnets to run through a simulation of Dencun, and was the most anticipated, since Holesky is the newest of all three testnets, with a validator set larger than Ethereum’s own network.","So in theory, if upgrades run smoothly on the Holesky blockchain, the process should go without any hiccups on mainnet.","Ethereum developers will meet on Thursday for their biweekly consensus layer call to ink a date for the mainnet Dencun upgrade, projected to happen sometime in late February or early March.","Read more: Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining","Edited by Bradley Keoun."],"entity":[{"type":"March","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"February","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Holesky","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"}],"hashtag":["Ethereum","Sharding","Dencun","Upgrade","Testnet","testnets","rollup","Rollups"],"authors":["Margaux Nijkerk"]}