{"summary":"Keeping in the cypherpunk spirit, Square Crypto has issued a grant to pseudonymous developer ZmnSCPxj for Lightning and bitcoin research.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/12\/11\/square-crypto-bankrolls-star-lightning-developer-known-as-zmnscpxj\/","publishDate":"2019-12-11T19:15:00","id":15834,"type":null,"title":"Square Crypto Bankrolls Star Lightning Developer Known as 'ZmnSCPxj'","category":["Markets"],"content":["","Square Crypto, the payment startup’s bitcoin development group, has funded a pseudonymous researcher to let him work on the space full-time.","","","Announced Wednesday via Square Crypto’s Twitter account, freelance Lightning and bitcoin contributor ZmnSCPxj received a grant from the company to further development of the bitcoin network. The grant’s total was not disclosed.","","","The pseudonymous developer is known for his work throughout the Lightning developer community, working on both the Lightning Labs and c-Lightning implementations over the past two years, another tweet said.","","","With the grant, Square Crypto said the developer is able to “leave behind his day job of 14 years” to work full time on Lightning and bitcoin.","","","Lightning Labs infrastructure lead Alex Bosworth said in an email the funding looked like a one-time grant and is not part of the Square Crypto developer team’s general mandate.","","","“I think the focus is broadly on bitcoin and they are still figuring out a good intersection of helping bitcoin and pursuing their development interests. They have a great team and a lot of freedom to pursue different directions,” Bosworth said.","","","Despite claims that ZmnSCPxj is an anonymous individual, Lightning developers likely know his identity. The individual attended October’s Lightning Conference in Berlin, giving a presentation during the conference's second day. The developer also appears to have spoken to others, such as c-Lightning’s Rusty Russel, under Chatham House rules.","","","ZmnSCPxj has seemingly accepted cost-of-living donations on website through his bitcoin wallet address since 2018, when his domain was copyrighted. His work on bitcoin sidechains, off-chain transactions such as Lightning and bitcoin projects such as CoinJoins can be found on the domain. ","","","ZmnSCPxj and Square Crypto did not return questions for comment by press time.",""],"entity":[{"type":"Alex Bosworth","content":"PERSON"},{"type":"Bosworth","content":"ORGANIZATION"},{"type":"Square Crypto","content":"ORGANIZATION"},{"type":"Square Crypto","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Lightning Labs","content":"ORGANIZATION"},{"type":"ZmnSCPxj","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Lightning’s Rusty Russel","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Chatham House","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"}],"hashtag":["Bitcoin","Lightning Network","Square Crypto"],"authors":["William Foxley"]}