{"summary":"The Federal Reserve released a new research report on stablecoins.\nResearchers examine the current ecosystem, and how expansion could affect the stability of US monetary policy.\nTo preserve stability, the report advocates for a two-tiered approach, which would have issuers rely on commercial banks for reserves rather than banking their tokens solely with Fed deposits.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132542\/fed-releases-new-research-on-risk-and-promise-of-stablecoins","publishDate":"2022-01-31T21:36:04","id":1583,"type":null,"title":"Fed releases new research on risk and promise of stablecoins","category":["Stablecoins"],"content":["The Federal Reserve released a new <a href=\"https:\/\/www.federalreserve.gov\/econres\/ifdp\/files\/ifdp1334.pdf\" data-v-f87c67ca=\"\">research<\/a> report on stablecoins today, noting the risks and potential of the emerging digital assets.","In the report, researchers Gordon Liao and John Caramichael examine the current stablecoin ecosystem and the impact of stablecoins on credit intermediation and the central bank balance sheet. The paper identifies potential threats to the stability of US Federal Reserve monetary policy and examine ways they could be mitigated.&nbsp;","The report found that dollar-pegged stablecoins have exhibited \"safe asset qualities,\" compared to other crypto assets. Their price occasionally rises above their peg during market distress events, which leads to more issuance, compared to other digital assets that plummet. Essentially, when prices of cryptos like bitcoin decline, traders seek safety in stablecoins.","\"These episodes demonstrate the potential for stablecoins to serve as a digital safe haven during market distress,\" said the report.","But, a run, or mass redemption of safe haven assets could severely disrupt markets. The authors recommend audits and liquidity requirements to mitigate the fallout of potential runs. Tether, the largest stablecoin, has historically avoided offering a full audit, according to <a href=\"https:\/\/fortune.com\/2021\/10\/15\/tether-crypto-stablecoin-fined-reserves\/\" data-v-f87c67ca=\"\">regulators<\/a>.&nbsp;","\"We think this type of instability is addressable with proper institutional and\/or regulatory guardrails such as transparent financial audits and adequate requirements on the liquidity and quality of stablecoin reserves,\" they said.","The Fed research dives deeper on credit intermediation, essentially how broad adoption of stablecoins could impact balance sheets of financial institutions and how that would affect the interactions between consumers and banks. It compares stablecoin narrow banking, in which physical cash is tokenized and backed by full reserves at the central bank, to two-tiered intermediation, in which stablecoins are backed by deposits issuers hold at commercial banks.","\"Among the various scenarios, a two-tiered banking system can support both stablecoin issuance and maintain traditional forms of credit creation,\" said the report. \"In contrast, a narrow-bank stablecoin framework can bring the most stability but at the potential cost of credit disintermediation.\"","Researchers found a two-tiered system creates less risk to US financial stability. A narrow bank approach guarantees the stablecoin peg remains unmoved, but financial distress could create a situation in which large swaths of people move their money from commercial bank deposits to safe haven stablecoins, which puts the system at risk.&nbsp;","\"Though this credit disruption effect could be mitigated by limits on stablecoin holdings and differential reserve interest rates, the overall&nbsp;structure of the narrow bank approach to stablecoin reserves is potentially destabilizing for the banking system,\" said the report. \"Additionally, the narrow bank approach could lead to an expansion of the central bank’s balance sheet in order to accommodate the demand for reserve&nbsp;balances from stablecoin issuers.\"","As for the future, the Fed paper noted that stablecoins could see further use cases outside of trading.&nbsp;","\"In conclusion, the current usage of stablecoins is primarily driven by cryptocurrency trading, limited peer-to-peer payments, and DeFi,\" the paper noted. \"Looking forward, stablecoins may see further growth through their facilitation of more inclusive payments and financial systems.\"","Stablecoins have been on the mind of regulators in recent weeks. Both chambers of Congress have <a href=\"https:\/\/www.theblockcrypto.com\/linked\/132540\/us-senate-slates-hearing-on-stablecoins-for-february-15\" data-v-f87c67ca=\"\">hearings<\/a> scheduled for February to discuss the President’s Working Group on Financial Markets Report on Stablecoins. That report came out in November and urged Congress to limit stablecoin issuance to insured depository institutions.","During last year's House hearing on stablecoins, lawmakers heard from a number of crypto CEOs, including stablecoin issuer Circle's Jeremy Allaire and Bitfury CEO Brian Brooks, who <a href=\"https:\/\/www.theblockcrypto.com\/post\/78426\/us-banks-stablecoins-reserves\" data-v-f87c67ca=\"\">allowed<\/a> banks to hold stablecoin reserves during his time as Acting Comptroller of the Currency.&nbsp;","<em data-v-f87c67ca=\"\">Correction: A previous version of this article attributed the witness list to the Feb. 8 hearing. No witness list has yet been posted. We regret the error.<\/em>"],"hashtag":["OCC"]}