{"summary":"Financial planning firm Mint has added bitcoin support to its mobile app following a deal with wallet service Coinbase.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2014\/01\/30\/mint-teams-up-with-coinbase-to-add-bitcoin-support\/","publishDate":"2014-01-30T10:01:49","id":15838,"type":null,"title":"Mint Teams up With Coinbase to Add Bitcoin Support","category":["Markets"],"content":["Financial planning firm Mint has added bitcoin support to its service, following a deal with wallet provider Coinbase.","Following the move, Mint's popular finance app will allow US users to keep track of their bitcoin investments, alongside more traditional investments.","Mint product manager Vince Maniago told Venture Beat that there are already 12 million bitcoins in circulation, adding that 60,000 merchants are already accepting the digital currency via Coinbase. He said:","Coinbase","now has more than 870,000 users, and Maniago was eager to point out that the company has a bigger user base than many official banks. Mint itself has more than 10 million users. It also tracks more than 16,000 financial institutions in North America and supports more than 17 million individual financial accounts.","Although the size of the bitcoin economy is dwarfed by the traditional financial institutions covered by Mint, it is expanding rapidly and beginning to attract more mainstream attention.","However, Mint is treating bitcoin as an asset – not a currency. This is hardly surprising, as many national regulators and financial institutions view bitcoin as a commodity. Maniago said:","Maniago believes bitcoin and Wall Street are coming together. He argues bitcoin will exist alongside traditional finances despite its somewhat controversial reputation in certain circles.","For the time being, the two will coexist in the Mint app, allowing users to keep track of their bitcoin investments alongside their existing investments.","Mint Image via Shutterstock"],"entity":[{"type":"Vince Maniago","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Maniago","content":"PERSON"},{"type":"Shutterstock","content":"ORGANIZATION"}],"hashtag":["Coinbase","Exchanges","startups","Wall Street","Mint","News","Companies"],"authors":["Nermin Hajdarbegovic"]}