{"summary":"Bitcoin and ether are also among this week's leaders, while Uniswap lags.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/12\/dogecoin-climbs-54-tops-coindesk-20-this-week-coindesk-indices-market-update\/","publishDate":"2024-04-12T18:05:05","id":15847,"type":null,"title":"Dogecoin Climbs 5.4%, Tops CoinDesk 20 This Week: CoinDesk Indices Market Update","category":["Markets"],"content":["CoinDesk Indices (CDI) presents its bi-weekly market update, highlighting the performance of leaders and laggards in the benchmark CoinDesk 20 Index (CD20) and the broad CoinDesk Market Index (CMI).","Dogecoin (DOGE) led the CoinDesk 20 this week, climbing 5.4% and topping $0.20 at one point before pulling back. This is still far below the meme coin’s all-time high of $0.58 in May of 2021.","Only five assets in the index closed yesterday above their levels of one week ago. Despite sizable losses on Friday, bitcoin (BTC) and ether (ETH) were among them.","Uniswap (UNI) noticeably lagged this week, falling 19% as the DeFi exchange received an enforcement notice from the SEC. Layer 1s Aptos (APT) and Internet Computer (ICP) were among the worst performers as well.","CoinDesk 20 tracks top digital assets and is investible on multiple platforms. The broader CMI comprises approximately 180 tokens and seven crypto sectors: currency, smart contract platforms, DeFi, culture & entertainment, computing, and digitization.","Edited by Stephen Alpher."],"entity":[{"type":"CDI","content":"ORGANIZATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"$0.58","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"5.4%","content":"PERCENT"},{"type":"$0.20","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CMI","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"May of 2021","content":"DATE"},{"type":"ICP","content":"LOCATION"}],"hashtag":["CoinDesk 20"],"authors":["Tracy Stephens"]}