{"summary":"Token unlocks are widely seen as bearish catalysts. However, the latest price drop probably stems from a wider market swoon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/04\/21\/axs-nurses-losses-as-axie-infinitys-156m-token-unlock-looms\/","publishDate":"2023-04-21T08:31:12","id":15845,"type":null,"title":"AXS Nurses Losses as Axie Infinity's $156M Token Unlock Looms","category":["Markets"],"content":["Axie Infinity's AXS cryptocurrency is nursing losses ahead of Sunday's planned unlocking of millions of dollars worth of the blockchain-based, play-to-earn project's tokens.","At press time, the AXS price was $8.22, down 12% for the week, CoinDesk data shows. The cryptocurrency had a total valuation of $941.7 million, the third largest in the play-to-earn and gaming sector, behind market leader Decentraland's MANA and The Sandbox's SAND.","Data from TokenUnlocks show on April 23 Axie will unlock 18.89 million tokens, worth $155.27 million at the current rate, amounting to 7% of the cryptocurrency's total supply of 270 million.","Axie kicked off a staggered 65-month token unlock in 2020, and so far 176.55 million tokens have been made available. The remaining 77.76 million will be unlocked by the end of 2025.","Unlocks are widely considered bearish catalysts. That's because holders benefiting from the unlock have the new ability to sell their coins, potentially adding to the supply in the market. It's common for early-stage projects to lock tokens to prevent big holders, typically early investors or project team members, from selling their coins all at once and causing a price slide.","Still, unlocks don't always lead to lower prices, and in the past AXS has rallied in the leadup to the unlocking event. Besides, the broader crypto market has faced selling pressure this week, with top cryptocurrencies bitcoin (BTC) and ether (ETH) losing 8% and 10%, respectively. Most play-to-earn and gaming tokens are down between 5% and 10%.","In other words, AXS' decline, at least partly, seems to be driven by broader risk aversion.","Amid AXS' price drop, the dollar value locked in futures tied to the token has declined by nearly 20% to $44 million this week, according to data tracked by Coinglass.","A decline in both price and open interest suggests the fall has been caused mainly due to closures of bullish positions rather than outright shorts or bearish bets.","Edited by Sheldon Reback."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"2025","content":"DATE"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"$8.22","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"$941.7 million","content":"MONEY"},{"type":"$155.27 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$44 million","content":"MONEY"},{"type":"April 23","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Coinglass","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"AXS","content":"ORGANIZATION"},{"type":"Decentraland","content":"PERSON"}],"hashtag":["AXS","Markets","Cryptocurrency","unlocked","Axie Infinity"],"authors":["Omkar Godbole"]}