{"summary":"An overview of the high-end NFT art market built on the Ethereum blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/superrare-nft-market-a-beginners-guide\/","publishDate":"2022-07-27T21:05:22","id":15841,"type":null,"title":"SuperRare NFT Market: A Beginner’s Guide","category":["Learn"],"content":["SuperRare launched in 2018 as a non-fungible token (NFT) market for aspiring digital artists and fine-art collectors. But unlike such competitors as Rarible and OpenSea, SuperRare prides itself on being super-selective about who gets to mint NFTs on its site and ensuring each NFT is truly one of a kind. While this means there aren’t as many NFTs on SuperRare, it guarantees the NFTs you see here are screened for quality.","Due to SuperRare’s high standards, it has gained a reputation as one of Ethereum’s most elite NFT art markets.","SuperRare is a curated NFT art market built on the Ethereum blockchain and co-founded by John Crain, a former product engineer at prominent Web3 company ConsenSys who now serves as CEO of SuperRare Labs.","To distinguish itself from other NFT marketplaces, SuperRare emphasizes the exclusivity of its digital artworks. Any artist who wants to mint NFTs on SuperRare must apply and gain approval from SuperRare Labs. SuperRare also requires artists to submit only one-of-one art NFTs to ensure their pieces are, well, “super rare.”","Since SuperRare focuses on fine art NFTs, it tends to generate higher sales per token. For instance, artists Kevin McCoy, Don Diablo and XCOPY have sold NFTs on SuperRare for more than $1 million each. Time sold an “Is Fiat Dead?” NFT magazine cover in 2021, and the fashion brand Gucci has launched exclusive NFTs on SuperRare.","In 2021, SuperRare introduced its native cryptocurrency, RARE, to help the platform become more decentralized. Today, anyone who holds RARE tokens can vote on the future direction of SuperRare and admit new artists to mini-marketplaces called SuperRare Spaces. Currently, the SuperRare community approves 10 new “Spaces” per month.","Purchasing NFTs on SuperRare is similar to buying them on other Ethereum-based NFT markets.","First, customers must link their Ethereum wallet by clicking the Sign In button on the top right of the homepage. Most people who shop on SuperRare use a MetaMask wallet, but SuperRare accepts many other Ethereum wallets via WalletConnect. According to SuperRare’s help portal, you can safely use popular options such as Trust Wallet, imToken and Rainbow Wallet.","Once you’ve linked your wallet, you can start exploring current NFT listings by clicking the Market button under the Art tab. Here, you can browse the latest NFT drops on SuperRare and narrow your search with the Artist and Artwork filters.","You can select any NFT that strikes your eye to learn more about the artwork and its transaction history. If there’s a Place Bid button by the NFT, you can click on it and make an offer.","It’s important to note that SuperRare only accepts Ethereum’s native cryptocurrency, ether (ETH), for transactions. You must have enough ETH in your wallet before placing a bid. Also, you have to factor in SuperRare’s flat 3% commission fee and gas fees on the Ethereum blockchain.","If your bid is successful, you should see your new NFT appear in your SuperRare account. You can resell your NFT at any time, but you will only receive 90 percent of the secondary sale. The remaining 10 percent goes to the original artist as a royalty fee.","Minting NFTs on SuperRare isn’t as easy as clicking Create, selecting a JPEG and paying a gas fee. If you want to sell your art on SuperRare’s platform, you must submit a formal application and conform to the site’s criteria for quality and scarcity.","SuperRare has an official Google Form that any users can fill out if they feel their art meets SuperRare’s standards. Those who apply must include a roughly one-minute video introduction plus at least three of their best artworks in a Google Drive folder. SuperRare only accepts artists who submit original digital artworks that haven’t already been minted on other NFT markets.","Since SuperRare is super popular, it won’t respond to people who don’t pass this application process. If you don’t hear back within about one month, however, you can submit a new Google Form to SuperRare for review.","The benefit of this rigorous screening process is that SuperRare can control the quality of NFTs allowed on its platform. From an artist’s perspective, a SuperRare listing gives a creator extra cachet in the crypto art community. SuperRare rewards its artists by baking in a 10 percent royalty fee for every secondary NFT sale as part of each NFT’s smart contract. Artists also get 85 percent of their primary NFT sale.","More recently, SuperRare has opened the door to more aspiring NFT artists and curators through its SuperRare Spaces program. According to SuperRare, these spaces function as “sovereign crypto-art galleries” where the operators control promotional activities, NFT drop schedules and fees. Because these Spaces are within the SuperRare ecosystem, however, they still have to conform to SuperRare’s standards.","People interested in operating a SuperRare Space must answer the 17 questions in the Space Proposal Template and submit their proposals on SuperRare’s official forum. SuperRare strongly recommends posting this proposal on its Discord server so community members can review it before voting.","Currently, SuperRare admits 10 new Spaces in two voting sessions each month. To participate in Space Race votes, people need to hold RARE tokens and take part in the 48-hour voting window.","Even if you don’t want to create or manage NFT art on SuperRare, you can participate in the SuperRare community by holding RARE tokens and voting on proposals. Currently, you can find these Ethereum-based tokens on many prominent centralized and decentralized crypto exchanges.","Along with Gemini’s Nifty Gateway, SuperRare is one of Web3’s most fashionable NFT markets for fine art. Instead of branching out into other industries – NFT gaming or profile pic collections, for example – SuperRare focuses on offering high-quality and scarce NFT artworks only.","Shoppers keen on digital art, photography and videos will enjoy exploring all of the professional-grade NFTs in the SuperRare market and SuperRare Spaces. For NFT creators, SuperRare is one of the most highly selective sites, so it might not be the best option for beginners. But if you’re an established artist with a professional portfolio, SuperRare offers access to the most passionate NFT art enthusiasts.","See Also: Minting Your First NFT: A Beginner’s Guide to Creating an NFT"],"entity":[{"type":"Gemini’s Nifty Gateway","content":"ORGANIZATION"},{"type":"Don Diablo","content":"PERSON"},{"type":"John Crain","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"First NFT","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kevin McCoy","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"85 percent","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Rainbow Wallet","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Google Drive","content":"ORGANIZATION"},{"type":"CEO of SuperRare Labs","content":"ORGANIZATION"},{"type":"Space Proposal Template","content":"ORGANIZATION"},{"type":"SuperRare Labs","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Gucci","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"90 percent","content":"PERCENT"}],"hashtag":["NFTs","Learn","Beginner"],"authors":["Eric Esposito"]}