{"summary":"The Hyperledger Project and the Enterprise Ethereum Alliance (EEA) have agreed to collaborate on bringing common standards to the blockchain space.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/10\/01\/two-of-blockchains-biggest-consortiums-just-joined-forces\/","publishDate":"2018-10-01T17:00:14","id":15848,"type":null,"title":"Two of Blockchain's Biggest Consortiums Just Joined Forces","category":["Markets"],"content":["Seismic shifts are happening in the world of enterprise blockchain.","Announced Monday, the Hyperledger Project and the Enterprise Ethereum Alliance (EEA) have agreed to collaborate on bringing common standards to the blockchain space and cross-pollinate a wider open-source community.","This joining of forces is notable as EEA and Hyperledger represent two of the three largest and arguably most influential enterprise blockchain communities, the third being the R3 Corda ecosystem.","If the team-up succeeds in creating common standards between the two platforms, it could sway enterprises previously on the fence to build their blockchains on one or the other, since the risk of creating new silos that don't talk to other systems is being addressed.","As EEA executive director Ron Resnick told CoinDesk:","Further, for Hyperledger's 270 member organizations, there is now the promise of interacting with tokens and smart contracts on the ethereum public chain.","Stepping back, Hyperledger was founded as an umbrella organization – cast in the image of the Linux Foundation – for open source blockchain development, comprising a number of protocols designed specifically for enterprises. Meanwhile, the 500-member EEA is a standards organization looking to build private or permissioned businesses applications on the foundations of the public ethereum blockchain.","But over time, there has been growing support for ethereum within Hyperledger. Formalizing that convergence, the new alliance \"will enable Hyperledger developers to write code that conforms to the EEA specification and certify them through EEA certification testing programs expected to launch in the second half of 2019,\" the organizations said in a blog post published Monday.","Brian Behlendorf, Hyperledger's executive director, told CoinDesk that the EEA's work on standards and attempt to align a whole universe of different vendors into a common enterprise picture is very complementary to Hyperledger.","\"It's a two-way street. There's not a lot of groups effectively doing standards in the blockchain space today and EEA has a head start there. What can we contribute to that momentum?\" said Behlendorf.","He said both groups can now work on a reference implementation (a software standard from which all other implementations and corresponding customizations are derived). \"We think that doing that as a project or a lab at Hyperledger would be interesting,\" he said.","Illustrating how the Hyperledger community had already been moving in an ethereum-friendly direction: earlier this year Sawtooth (a codebase contributed to Hyperledger by Intel) added support for the ethereum virtual machine (EVM) as a transaction processor. This made it possible to bring smart contracts developed for the public ethereum blockchain over to Sawtooth-based networks.","That effort, dubbed \"Seth,\" is now in active use, and gathering some momentum. Sawtooth proponent Dan Middleton was recently elected chairman of Hyperledger's technical steering committee and Seth awaits \"conformance testing to the EEA specification as soon as possible,\" according to the joint statement by Hyperledger and EEA.","Meanwhile, EVM work is also now underway with Fabric, arguably Hyperledger's flagship protocol.","This work, which will start to really come to the fore in Fabric 1.3, aims to allow users to run ethereum smart contracts and also be able to have ERC-20 and ERC-721 (the standards that gave rise to ICOs and CryptoKitties, respectively) as the token model on Fabric, as currently is the case on Sawtooth.","Behlendorf said he keeps an open mind about how these architectures might evolve. \"I think in the long term the benefits of one accrue to the other,\" he said in reference to Sawtooth and Fabric. \"Whether that means they and other frameworks will merge together or specialize, it's still an open book.\"","Working on common standards and building bridges between communities would seem to pave the way to some future state of interoperability – an often talked-of ideal in the blockchain world.","\"I do think that interoperability between ledgers will happen at a much higher level in the stack than most people expect,\" explained Behlendorf. In other words, building common standards and data formats, rather than monkeying with complex consensus protocols, will link use cases in a multi-chain universe.","As well as the working with the EVM, Hyperledger developers also want to keep a close eye on decisions being taken within the ethereum community around using WebAssembly, a coding standard for web pages, to potentially make the next generation of the public blockchain protocol more JavaScript-orientated.","\"We are tracking this very closely in Burrow [a third Hyperledger implementation] and in Sawtooth and would like to be there as soon as they make that call,\" said Behlendorf.","All this talk of collaboration and mutual benefit might have you imagining the whole enterprise blockchain community gathered around a campfire singing \"Kumbaya,\" but make no mistake: this is still a fiercely competitive field. And R3, which boasts more than 200 members and partners across multiple industries, clearly views EEA and Hyperledger as its competitors.","In a recent interview,","R3 lead platform engineer Mike Hearn seemed to anticipate the announcement of an alliance between the EEA and Hyperledger, which he dismissed as more of \"a marketing event rather than a major change to the way the platforms work.\"","Behlendorf agreed that this joining of forces is, to an extent, about marketing, but not just to end-user organizations and the vendor community – marketing to developers.","\"This is about letting developers know where our organizations are,\" he explained. \"It's about where the industry is going and where you may want to contribute to that momentum, to benefit from it; if you want to be tribal and fight against it, that's your choice as well.\"","Whatever you want to call it, in terms of strategy, a strong alliance between the EEA and Hyperledger would seem to put them on one side and R3 on the other.","Even so, R3 is definitely invited to the party, said Resnick. \"I already asked them to join us. Will they agree? That might be a different story.\"","However, Resnick said R3 is different from Hyperedger or EEA in that \"they are not really open source,\" making the distinction between open source and \"open-core,\" where open source software is centered around a single vendor.","\"With a proprietary solution such as R3's, you've got to buy stuff from them. That's not what we are about and it's not what Hyperledger is about,\" said Resnick, concluding:","Brian Behlendorf image via CoinDesk archives "],"entity":[{"type":"Brian Behlendorf","content":"PERSON"},{"type":"Ron Resnick","content":"PERSON"},{"type":"second half of 2019","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Behlendorf","content":"PERSON"},{"type":"Hyperledger Project","content":"ORGANIZATION"},{"type":"Enterprise Ethereum Alliance (EEA","content":"ORGANIZATION"},{"type":"Sawtooth","content":"LOCATION"},{"type":"Dan Middleton","content":"PERSON"},{"type":"Intel","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Seth","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Resnick","content":"PERSON"},{"type":"Hyperledger","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"EEA","content":"ORGANIZATION"},{"type":"Hyperledger","content":"PERSON"},{"type":"Mike Hearn","content":"PERSON"},{"type":"Fabric","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["Insurance","Ethereum","Banking","R3","Distributed Ledger Technology","Supply Chain","Enterprise Ethereum Alliance","EVM","Hyperledger Sawtooth","Sawtooth","Ethereum Virtual Machine","R3 Corda","hyperleder","other-public-protocols","business news"],"authors":["Ian Allison"]}