{"summary":"The past weekend saw the lowest number of bitcoin transfers from exchanges in 2021.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/06\/01\/market-wrap-oversold-bitcoin-down-to-35k-eth-drops-to-25k\/","publishDate":"2021-06-01T20:31:02","id":15849,"type":null,"title":"Market Wrap: ‘Oversold’ Bitcoin Down to $35K, ETH Drops to $2.5K","category":["Markets"],"content":["","Investors have been selling bitcoin for the past week, according to on-chain data. Meanwhile, ether’s daily trading volumes have consistently outpaced BTC's.","","","Bitcoin, the world’s largest cryptocurrency by market capitalization, was below the 10-hour moving average and the 50-hour as the two indicators are closing in on each other, a bearish signal for market technicians. ","","","BTC’s price slid from $37,833 at 01:00 UTC (9 p.m. ET Monday) to as low as $35,816 by 17:15 UTC (1:15 p.m. ET) Tuesday, a 5.3% tumble based on CoinDesk 20 data, before rising to $35,987 as of press time.","","","“Bitcoin is newly oversold from an intermediate-term perspective,” said technical analyst Katie Stockton in her weekly Fairlead Strategies investor note.","","","The past weekend saw the lowest number of bitcoin transfers from exchanges in 2021. On Sunday, May 30, the flow bottomed out at 33,393 daily transfers, according to data aggregator Glassnode. It’s the first time this year fewer than 35,000 transfers were made from exchanges in a day.","","","In contrast is the high transfer volume to exchanges in the past month, particularly on May 19, when each transaction that day averaged 2 BTC. That’s triple the daily average per transaction of 0.67 BTC so far in 2021.","","","This Glassnode on-chain information supports Stockton’s oversold theory in the bitcoin market because it appears holders moved BTC to exchanges and sold it, leading to a record-low outflow Sunday.","",""," “Intermediate-term momentum is to the downside, giving way to another lower high within the corrective phase,” added Stockton. “Support is initially near $34,000.”","","","Read More: Bitcoin’s Long-Term Put Options See Sustained Demand","","","The second-largest cryptocurrency by market capitalization, ether, was trading around $2,549 as of 21:00 UTC (4:00 p.m. ET), slipping 3.2% over the prior 24 hours. The asset is below the 10-hour moving average but above the 50-hour, a flat or sideways signal for market technicians. ","","","Ether dipped from $2,734 at 22:00 UTC 01:00 UTC (9 p.m. ET Monday) to $2,532 by 17:15 UTC (1:15 p.m. ET) Tuesday, a 7.3% fall based on CoinDesk 20 data. ETH has since gone up slightly, at $2,549 as of press time.  ","","","“Ether has seen a sharp correction like bitcoin,” said Fairlead’s Stockton. “Intermediate-term momentum has deteriorated. Support is intact near $2,038 on a consecutive closing basis.”","","","While bitcoin’s 90-day volatility has been, well, volatile over the past three months, ether’s has been even more so. According to data from CoinDesk Research, both assets’ volatility bottomed out in mid-April but ETH’s gyrations are now over 170% while BTC still sits below 100%. ","","","“Yeah, really choppy days,” said Chris Thomas, head of digital assets at Swissquote Bank. “Ether is naturally a more volatile asset than bitcoin as it is less institutionalized and has a smaller market cap. It therefore acts much like a stock with a higher beta than the market index.”","","","One of the reasons for ETH’s price resiliency might be because its trading volume is starting to go higher than BTC on most days, giving it increased liquidity. ","","","“In the last couple of days ETH and BTC have both been declining at similar percentage rates,” said John Willock, CEO of crypto custody provider Tritum. “But ETH overall has fared and recovered most of its lost value much better after the last couple of weekends of market volatility.”","","","Based on the latest available data from CoinGecko, ETH volumes were at $43 million on Monday while $37 million BTC changed hands on major spot trading venues.","","","Over the past month, ether trading volumes have been higher than bitcoin's for 12 total days. Over the past week, ETH volumes have been higher than BTC for four days. This is a trend analysts will be watching closely because higher volumes can affect prices when they skew towards either buys or sells. ","","","“ETH is quickly becoming recognized as an exciting asset as a standalone,” Willock said. ","","","Read More: Lithium Raises $5M for Decentralized Oracle Tracking Private Assets","","","Fairlead’s Stockton thinks the weeks ahead for crypto may be a time for traders to “risk-on.” This is a term for bullish market positioning, anticipating the next short-term upward cycle. ","","","“The takeaway is for a shift toward risk-on positioning for the next week or two,” Stockton said. ","","","Digital assets on the CoinDesk 20 are mixed Tuesday. Notable winners as of 21:00 UTC (4:00 p.m. ET):","","","Notable losers:","","","Equities:","","","Commodities:","","","Read More: Disruption in Tether Could Be Crypto Equivalent of ‘Breaking the Buck’","","","Treasurys:",""],"entity":[{"type":"Chris Thomas","content":"PERSON"},{"type":"Decentralized Oracle Tracking Private Assets","content":"ORGANIZATION"},{"type":"9 p.m.","content":"TIME"},{"type":"$43 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"3.2%","content":"PERCENT"},{"type":"Swissquote Bank","content":"ORGANIZATION"},{"type":"$34,000","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$35,816","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Stockton","content":"PERSON"},{"type":"170%","content":"PERCENT"},{"type":"Willock","content":"PERSON"},{"type":"$2,549","content":"MONEY"},{"type":"Fairlead’s Stockton","content":"ORGANIZATION"},{"type":"Katie Stockton","content":"PERSON"},{"type":"$5M","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"5.3%","content":"PERCENT"},{"type":"May 19","content":"DATE"},{"type":"7.3%","content":"PERCENT"},{"type":"mid-April","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$37 million","content":"MONEY"},{"type":"John Willock","content":"PERSON"},{"type":"$2,532","content":"MONEY"},{"type":"$37,833","content":"MONEY"},{"type":"$35,987","content":"MONEY"},{"type":"CoinDesk Research","content":"ORGANIZATION"},{"type":"4:00 p.m.","content":"TIME"},{"type":"May 30","content":"DATE"},{"type":"$2,734","content":"MONEY"},{"type":"1:15 p.m.","content":"TIME"},{"type":"$2,038","content":"MONEY"}],"hashtag":["Commodities","Stellar","Bitcoin","Ether","Algorand","Tezos","Cardano","The Graph","Equities","Bitcoin Volatility","Yearn Finance","Ether Volatility","Market Wrap","Ether Volume","bitcoin volume"],"authors":["Daniel Cawrey"]}