{"summary":"The crypto-backed social club is looking to remain accessible to the creators it wants to attract.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/16\/whats-next-for-friends-with-benefits\/","publishDate":"2021-12-16T20:40:36","id":15851,"type":null,"title":"What’s Next for Friends With Benefits?","category":["Consensus Magazine (layer2)"],"content":["Crypto has always had an accessibility problem.","It goes without saying that this stuff is difficult to use. It’s one thing to buy some Ethereum on Coinbase –it’s another to actually step beyond that walled garden into the world of decentralized applications, where you won’t find any guardrails to help you along the way. You’ll need an unhosted wallet (which you control rather than a third party), for starters, along with an intimate knowledge of token swaps (what’s “slippage” all about?) and plenty of cash on hand for the network’s exorbitant fees.","This feature is part of Crypto 2022: Culture Week.","But the challenge of actually navigating these systems is almost secondary to the issue of cultural accessibility.","The dominant culture of crypto in 2021 is, to quote the writer Max Read, “unbelievably alienating” to a large subsection of the population. Today, the conversation has more to do with NFTs and Ethereum than the Bitcoin- and privacy-centric values of the Silk Road era. And the constant evangelizing that’s become par for the course in this emergent space – those utopian promises of a more democratic internet – can feel grating to the uninitiated. It doesn’t help that the oh-so-lovable Mark Zuckerberg is now closely linked to the idea of the “metaverse,” or that the dominant aesthetic around non-fungible tokens (think: the cartoonish grotesquerie of Bored Ape Yacht Club and its derivatives) has become something of a joke outside of crypto.","This has made it increasingly difficult to bridge the gap between crypto people and non-crypto people (you might hear them referred to as “normies,” in a nod to the 4chan lexicon). Mainstream adoption is happening, little by little, but “getting into crypto” can still feel like learning a second language. Communities of rabid, like-minded early adopters are everywhere. What sort of people might be drawn to a more sober approach?","This is one of the animating questions behind Friends With Benefits, a kind of crypto-backed social club and decentralized autonomous organization (DAO). Over the past year, the community has evolved from a small group chat into a burgeoning media empire, with around 2,000 members and eight full-time staffers.","It’s still also a group chat, but its ambit is much broader: FWB is a music discovery platform, an online publication, a startup incubator and a kind of Bloomberg terminal for crypto investors. It’s setting up community hubs in major cities across the globe; it throws parties with Yves Tumor and Erykah Badu. And maybe most crucially, it raised $10 million in financing from the powerhouse venture capital firm Andreessen Horowitz, cementing its position as one of today’s most powerful online crypto communities.","Also, it’ll cost you anywhere between $5,000 and $10,000 to join.","Seventy-five of the group’s home-brewed crypto tokens ($FWB) gets you access to the main attraction: the group’s sprawling, multifarious Discord server, with dedicated chat rooms for everything from memes and new music to the intricacies of crypto trading. One $FWB token currently costs about $77, but the price is constantly fluctuating. It was $95 earlier this week and around $150 in late October.","There’s also a formal application process for membership. Before you buy the tokens, you’ll need to be approved by a committee of current members. Hundreds of these applications come in every day.","Read more: Matt Leising - From DOH! to DAO: The Rise of Decentralized Organizations","“Core in our principles and our values is that crypto should be the least interesting thing about you,” said Alex Zhang, who quit his day job this summer to become the official “Mayor” of Friends With Benefits (he manages the day-to-day operations of the community).","That’s reflected in the diversity of channels in the Discord. There’s one called “selfies-n-fits,” where members strategize about how to snag designer clothing online, and another called “parenting,” where people just chat about their kids. In the city-specific channels, people organize community events and share intel on their favorite local spots. A “learning” section hosts channels dedicated to crypto taxes, the metaverse and more general Web 3 tutorials for an audience with a range of crypto and non-crypto backgrounds. (FWB gave me access through a tokenless “press pass” role on Discord – I’m not a stakeholder.)","But FWB isn’t “$5,000+ or bust.” The group’s token-gating system works in tiers. One $FWB gets you access to the group’s newsletter but nothing else. Five $FWB gets you access to a global network of token-gated parties, which have quickly developed their own cachet in the NFT space.","For its party timed to the NFT.NYC conference in early November, the group brought out Caroline Polachek, the Russian art collective Pussy Riot (with whom they’ve collaborated on NFT drops) and the electronic producer Doss. Yves Tumor performed at FWB’s Miami event in June, and Erykah Badu and Azealia Banks did sets at FWB’s next big Miami party, during the week of Art Basel.","These are the kinds of artists you’re more likely to find on critics’ year-end roundups – adventurous, well-regarded musicians with roots outside of tech – than in crypto Discord channels. According to Zhang, that’s by design.","“We’re conscious about booking Azealia Banks and Erykah Badu in terms of what that signals versus, like, ‘insert white DJ’ that might be more crypto savvy,” he said. “But we’re teaching Badu about tokens and onboarding her, and she’s setting her MetaMask wallet. That’s what interests us.”","Zhang wasn’t too invested in crypto before encountering FWB. He’d bought a little bitcoin and ether on the advice of friends, but it was the advent of DAOs that really piqued his curiosity.","In decentralized autonomous organizations, every member is also a stakeholder. It’s a way of organizing economic activity around tokens rather than shares. Each member holds a certain number of tokens (in this case $FWB), which work like voting stock in a corporation.","Get the whole of Crypto 2022: Culture Week.","Proposals for how to run the DAO (what to do with the group treasury, how stringent to be about membership guidelines, and so on) are put to a vote. DAOs are also typically unincorporated, so it seems possible that entities issuing these stock-like tokens might attract regulators’ attention in the near future.","And while many DAOs are essentially just token-gated Discord servers, others have built software, mobilized millions of dollars for fundraisers and launched crypto-powered residency programs for artists and developers.","DAOs package financial commitments with online sociality. The idea is that the more good work you produce and the more sophisticated a community you cultivate, the more outsiders want in, and the more your token prices rise. $FWB didn’t start at $77 per token. It got there through a combination of reputation building, savvy marketing and returns for investors. The $10 million from Andreessen Horowitz probably didn’t hurt, either.","It’s been a huge win for FWB’s early entrants (mostly just friends of McFedries and a handful of curious crypto investors), but it’s made the tokens prohibitively expensive for precisely the kinds of people the group is looking to attract. Limiting FWB applicants to risk-tolerant speculators – those traders willing to invest in the 75 tokens – inevitably homogenizes the vibe.","It’s become “a victim of its own success” in that respect, according to one writer and early FWB member who wished to remain anonymous.","There’s now an official Friends With Benefits fellowship program geared toward inducting new members from underrepresented communities. If you’re accepted, you’ll get a chance to earn a grant of 75 tokens.","Said Zhang: “We’ve set aside 18,000 tokens in perpetuity, every season [FWB rolls out new programming over time, in phases called “seasons”] admitting roughly 20 to 30 artists – different folks, who are underrepresented – to join and participate in the community. They get to learn about the power of owning tokens, owning equities, owning the upside of the value that they create.”","The group is constantly wrestling with that financial component. There are channels in the FWB Discord server dedicated entirely to “alpha,” finance slang for early access to information about good investments. Buzz about new startups and upcoming NFT projects often circulates here before it reaches the rest of the industry, which means FWB members can get the jump on news before it drops.","When the designer Eric Hu launched a series of artworks-as-NFTs earlier this year, he gave early access to FWB members as a “thank you” to the community. (Hu is a longtime member and active contributor.) In crypto, this sort of access and timing can lead to direct financial gain.","“You’re part of a community and you feel like everyone’s getting wealthy together. It feels good, in a way,” said another member, an artist, who declined to use his name for this story.","You can see this reflected in the logic of “WAGMI,” a common mantra in the crypto space – “we’re all gonna make it.”","Dexter Tortoriello, another FWB co-founder, said that while channels with names like “trading-stonks” have always been core to the group dynamic, they’ve never completely defined it.","“It’s not like the GameStop Reddit crew by any means in the stocks channel,” he explained, referencing the wave of “tendies”-consuming, Elon Musk-worshipping, diamond-handed traders who pumped the price of GameStop stock in late January.","As it has grown, Friends With Benefits has also become an incubator for new crypto projects. David Greenstein, a longtime FWB member, co-founded a company with a musician and coder he met in the Discord server earlier this year; yesterday, their company announced a $5 million seed round led by Andreessen Horowitz.","Greenstein said that part of what excited him about the space was its connections outside of crypto, specifically in the music world. Trevor McFedries kick-started his career as an early employee at Spotify; Alex Zhang was a band manager and show promoter; and Dexter Tortoriello makes music under the name Houses.","“Seeing David staff up his company and really workshop ideas inside of FWB is exciting,” said Tortoriello. “The fact that that can happen, and he can take very talented people and give them a seat at the table with potentially what could be the next SoundCloud or Spotify – that’s really cool.”","As always with Web 3, the financial is bound up in the cultural. Despite the price of admission, the technical barriers to entry and the lack of diversity baked into crypto, FWB has managed to build something that’s genuinely opposed to the broader identity of Web 3. There’s a reason the group encourages its members to use their real names as opposed to their online pseudonyms.","FWB is still subject to the whims of the market – the token could tank tomorrow, leaving new investors holding the bag – but the idea is to attract members who are after more than just money. Friends With Benefits isn’t about socializing just to get paid, it’s about socializing and getting paid.","“From a community standpoint,” said Tortoriello, “there’s kind of nothing better than that.”"],"entity":[{"type":"Zhang","content":"ORGANIZATION"},{"type":"$95","content":"MONEY"},{"type":"Miami","content":"LOCATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Azealia Banks","content":"LOCATION"},{"type":"Tortoriello","content":"PERSON"},{"type":"Matt Leising","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Alex Zhang","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Caroline Polachek","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"Max Read","content":"PERSON"},{"type":"Azealia Banks","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Doss","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"GameStop Reddit","content":"ORGANIZATION"},{"type":"Friends With Benefits","content":"ORGANIZATION"},{"type":"Eric Hu","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"earlier this week","content":"DATE"},{"type":"$77","content":"MONEY"},{"type":"McFedries","content":"ORGANIZATION"},{"type":"Basel","content":"LOCATION"},{"type":"Greenstein","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Erykah Badu","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Elon Musk","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"The Rise of Decentralized Organizations","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"FWB","content":"ORGANIZATION"},{"type":"David Greenstein","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"crypto Discord channels","content":"ORGANIZATION"},{"type":"$FWB","content":"MONEY"},{"type":"Dexter Tortoriello","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$150","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Trevor McFedries","content":"PERSON"}],"hashtag":["Crypto 2022","Culture Week"],"authors":["Will Gottsegen"]}