{"summary":"Now that the likes of Etsy are jumping on the crypto train, decentralized marketplace OpenBazaar is gearing up for its biggest overhaul since launch.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/05\/02\/not-just-bitcoin-openbazaar-is-gearing-up-for-a-radical-redesign\/","publishDate":"2018-05-02T04:00:03","id":15853,"type":null,"title":"Not Just Bitcoin: OpenBazaar Is Gearing Up for a Radical Redesign","category":["Markets"],"content":["OpenBazaar is gearing up for an overhaul.","Since startup OB1 launched in 2014 to develop a \"bitcoin-powered\" online market, the founders have focused almost exclusively on the world's largest cryptocurrency. But with the scaling debate still raging in some ways, OB1 co-founder Washington Sanchez took to Twitter recently to vent his frustrations about that course of action.","\"I personally wasted so much time in the bitcoin scaling civil war that I could have used designing [and] building dapps (decentralized applications) and opening up OpenBazaar to multiple currencies,\" Sanchez wrote. \"Instead, we had to wait for fees in bitcoin to cripple any consumer usage before we woke up.\"","Strong words – especially in light of a number of developers working diligently on layer-two technologies, such as lightning network, which push transactions off-chain in an effort to scale for an ever-growing user base.","Still, it's also become clear to OB1 that its user base not only wants to be able to use bitcoin, it wants to use other crypto assets on OpenBazaar's peer-to-peer (P2P) network.","While bitcoin remains the most widely used – with 11,000 listings of items to purchase with the cryptocurrency – other coins are making a mark for OpenBazaar's 5,000 weekly users. There are around 1,122 listings for items to buy with bitcoin cash, the cryptocurrency that forked off bitcoin in August 2017, plus a few dozen products being sold for privacy-oriented cryptocurrency zcash.","And it seems today, the founders of OB1 are ready to open their minds and platform to a whole new world of cryptocurrencies.","Speaking to that new outlook, OB1 co-founder Brian Hoffman told CoinDesk the vision for OpenBazaar is to be \"the easiest and fastest way to start a business that accepts cryptocurrency and to buy or sell anything you want with cryptocurrency.\"","And on Twitter, Sanchez seconded that sentiment, saying, \"OpenBazaar is supposed to be a free and open protocol for trade using cryptocurrency, a way for currencies and tokens to gain meaningful economic utility to acquire goods and service, and an entry point for people to earn and onboard.\"","He added:","But that shouldn't exactly come as a surprise. The ambitious redesign and the move to a multi-cryptocurrency mission was at least hinted at previously.","For one, Hoffman announced plans to launch OpenBazaar Token (OBT) during crypto conference Token Summit in December, and the team laid out some of its other plans in January after raising $5 million (bringing its total to $10.5 million) from investors like China-based crypto mining hardware giant Bitmain.","During that time, OB1 mentioned a web and mobile app and a service to allow users to trade cryptocurrencies with each other.","But that goal isn't just about making a pretty penny monetizing its services (currently it only makes money off affiliate links), but about facilitating broader engagement to encourage the types of communities seen on social media.","“We’re trying to drive more adoption as a network, as a protocol,” Hoffman said. “It’s kind of a longer-term play.”","And the start of that play, according to Hoffman, will happen later this month with the debut of a new section for swapping several types of cryptocurrencies, including litecoin and zcash.","“Ultimately, the platform can be used with any cryptocurrency that supports a few key things like multi-signature [wallets] and if it can be used as a transactional currency,\" Hoffman told CoinDesk.","Albeit, OpenBazaar won't be able to support every coin right away. Currently, its aim is to facilitate P2P transactions (without trading fees) among the top-ranking cryptocurrencies.","On top of that, once OpenBazaar'a native crypto token OBT launches, users will be able to earn and use those.","The launch of that isn't slated till after Q4 2018, though, since the company must build the features necessary for earning. Those features take from several social media giants' playbooks, allowing users to set up and post statuses to feeds similar to Twitter and Facebook and create curation boards a la Pinterest.","Creating sought-out curation boards or having popular posts will earn you OBT. In this way, OpenBazaar is \"using the token to incentivize activity on the platform,” Hoffman said, adding:","After OBT launches, OpenBazaar plans on taking its multi-currency outlook one step further next year, offering support for ethereum and ethereum tokens, even crypto-collectibles such as CryptoKitties and other digital pets.","\"One of my biggest regrets is not realising the awesomeness of ethereum and other projects and dapps, because I was blinded by my bitcoin maximalism,\" Sanchez tweeted.","And with this, the team hopes to attract more people across a variety of cryptocurrency communities.","“There’s no reason to block those people out,” Hoffman said.","Yet, what remains one of the startup's highest barriers to mass adoption is the complexity of accessing the market.","Currently, it requires users run a full node and interact only through a clunky desktop app.","As such, OpenBazaar is looking to revamp its desktop website and launch mobile apps (one from iOS and one for Android), which will start being beta-tested in June.","At first, these interfaces will feature read-only versions of the desktop app where newbies can merely browse through listings and profiles, but later, OpenBazaar will create a browser-ready site like any other site (no full node needed). And then by the end of 2018, those interfaces will allow for purchases too.","And on top of putting a significant amount of its developer power towards making the marketplace more accessible and open, OpenBazaar also plans to make ideation and development more accessible to those outside its ranks.","To that end, OB1 co-founder Sam Patterson will soon split off to launch a separate non-profit, The OpenBazaar Foundation, which will focus on giving the community a conduit for influencing what features make it into OpenBazaar’s open-source protocol.","And that should give the hundreds of people interested in attending the company's developer meetings (500 people RSVP'ed for the next one so far) a better way to connect.","Hoffman concluded:","Marketplace at dark image via Shutterstock"],"entity":[{"type":"2014","content":"DATE"},{"type":"Brian Hoffman","content":"PERSON"},{"type":"Sanchez","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"OpenBazaar","content":"ORGANIZATION"},{"type":"OpenBazaar Foundation","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Hoffman","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Sam Patterson","content":"PERSON"},{"type":"Washington Sanchez","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"OBT","content":"ORGANIZATION"},{"type":"$10.5 million","content":"MONEY"},{"type":"August 2017","content":"DATE"},{"type":"$5 million","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["payments","startups","OpenBazaar","Merchants","Bitcoin","Tokens","Features","business news"],"authors":["Leigh Cuen"]}