{"summary":"With April’s “halving” set to cut mining rewards by half, Bitcoin miners are upgrading to more efficient mining machines, cutting costs, finding cheaper sources of power and exploring mergers and acquisition opportunities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/19\/bitcoin-halving-is-a-show-me-the-money-moment-for-miners\/","publishDate":"2024-03-19T16:53:26","id":15860,"type":null,"title":"Bitcoin Halving Is a ‘Show Me the Money’ Moment for Miners","category":["Consensus Magazine"],"content":["“Show me the money.”","The notorious phrase from 1996’s “Jerry Maguire” movie is on the lips of investors watching the state of the Bitcoin mining market as it faces its next crunch point: April's Bitcoin Halving.","Mining, an integral part of securing the bitcoin network, requires a lot of capital to operate profitably. And now, after a brutal crypto winter and with the upcoming halving next month, many investors have turned sour on what once was an outrageously profitable business, drying up capital for the miners.","This feature is part of CoinDesk’s “Future of Bitcoin” package published to coincide with the fourth Bitcoin “halving” in April 2024.","To bring investors back and keep them on-board, miners will need to upgrade to more efficient mining machines, cut costs, have a prudent risk management strategy and participate in deal-making that will enhance shareholder value, industry observers say.","“I think the next evolution [for mining investors] is there'll be a lot more scrutiny on how you're deploying capital and what the return on that investment is for these companies,” said Asher Genoot, the new CEO of bitcoin mining firm Hut 8.","He added that any company “that is not able to execute on that [return on investment] will suffer because shareholders won't trust them with money and you'll have capital flowing to others, that people really trust and are willing to support.”","Read more: Bitcoin Halving, Explained","Gaining investors' trust could be tough, but not impossible if a company knows which options to utilize correctly, Genoot said.","In the last bull market of 2021, investors poured money into miners who were able to show that they had invested money to grow their business — regardless of the capital cost. This led to miners buying assets at high prices and borrowing more debt than was serviceable.","When the bear market hit in the second half of 2022, shares of publicly-traded miners imploded, leading investors to drop the stocks altogether. Even now, as the digital assets market starts another bull run, investors are still shying away from the miners, starving the industry of capital it needs to stay profitable and grow their businesses.","The main concern among the investors is the risk the miners will face heading into April’s halving event: competing for the block reward that will be slashed in half. Many investors now hope to gain their bitcoin exposure through spot bitcoin exchange-traded funds (ETFs), which are less uncertain than bitcoin mining stocks.","One of the first options miners can use to stay profitable when the halving cuts reward by half is to have mining machines that can consume less power but have higher computing ability i.e. more efficient rigs. Buying new generations of miners ahead of a potential post-halving bull market is crucial for miners to stay profitable, bitcoin mining equipment and hosting provider Blockware Solutions said in a research report.","“Miners who embrace the halving and capitalize on bear market prices for hardware stand to reap substantial rewards, with shorter ROI [return on investment] periods and enhanced profitability throughout the halving epoch,” the report said.","The miners have already started to deploy capital to upgrade their mining fleet, heading into the halving. Most recently, Riot Platforms (RIOT) said it spent nearly $100 million to buy new generations of MicroBT’s mining rigs to increase computing power while raising efficiency.","But just buying more efficient machines may not be enough for miners. A machine can be more efficient, but if it costs more, miners will need to evaluate if it is worth maintaining and running the older machines or buying new ones, Hut 8’s Genoot said, noting that miners need to consider “how quickly can you get your dollars deployed” when thinking about investing in new mining rigs.","Amanda Fabiano, founder of Fabiano Consulting and former head of mining at Galaxy, agrees with Genoot. It may make sense for some miners to continue to upgrade to newer model mining rigs, but a deeper dive into the cost of mining is needed to make that decision.","“If someone is on the mid-curve of the cost curve, they likely will continue to upgrade their fleet. If a miner has a low cost of electricity and can have some energy arbitrage, older gen machines aren’t a terrible idea,” she said.","The cost of powering mining rigs is another key consideration. “By positioning ourselves on that lower end of the operating cost curve, we basically make ourselves in a position where, irregardless of what happens with mining revenues or transaction fees, we're going to be in a position that's going to be profitable for modeling purposes,” Ben Gagnon, chief mining officer of Bitfarms (BITF), said during fourth quarter earnings call.","A miner can buy cheap mining rigs that are new and more efficient, but if they aren’t plugged in with a cheap source of power, miners won’t be profitable, failing to gain investors' confidence.","“Miners [mining machines] aren’t scarce today. You can buy new ones, buy used ones or take someone else’s order over, but there isn’t a lot of scarcity value. What is scarce is the access to power,” said Greg Beard, Stronghold Digital Mining’s (SDIG) CEO.","Stronghold’s solution is its own power plant that turns “coal refuse,” a material left over from coal mining, into power at its wholly-owned Scrubgrass and Panther Creek power plants in Pennsylvania.","Power management is one of the key battlegrounds for running a profitable mining company. “It's your ability to manage energy in real-time,” Genoot said.","Aside from managing the cost of power, miners can also deploy other creative solutions to hedge their revenue post-halving. One is “production hedging” — something traditional commodity firms have done to eliminate pricing volatility.","Just like an oil and gas producer or a corn farmer, digital asset miners can use derivatives to lock in the price of their mined bitcoin to hedge against any potential downside. Some options are already out there, including Luxor Technologies’ derivatives products that aim to aid miners use hashrate derivatives — a type of financial product tied to the mining of bitcoin — to help with hedging activities.","Read more: Crypto Miners Are Pivoting to AI (Like Everyone Else)","However, these hedges are complex and may pose some challenges for miners, because of their lack of liquidity.","“While there are several positive aspects associated with using such derivative products, they also pose a multitude of challenging problems, potentially contributing to the scarcity of sell-side offerings and a simultaneous lack in buy-side activity,” Galaxy's mining analysts, led by Brandon Bailey, wrote in a research note.","Miners can mitigate such liquidity concerns by using other risk management strategies such as “options, costless collars, and forwards,” Galaxy said, noting that “these straightforward structures are highly liquid and boast quick execution times.”","Additionally, miners can opt-in to diversify their revenue stream by using their data centers to host other customers, including artificial intelligence and cloud computing. During the trenches of crypto winter, some miners have already started to do so to mitigate revenue risks.","One theme that comes up repeatedly when talking about halving and survival of miners is the prospect of more mergers and acquisitions (M&A). As CoinDesk has reported, the halving will lead strong miners to devour smaller, less efficient miners, unleashing a survival of the fittest dynamic.","Read more: Bitcoin Halving Is Poised to Unleash Darwinism on Miners","Industry observers and participants agree, calling the strategy one of the crucial levers that miners can pull to stay profitable post-halving. “Operational excellence and SG&A cost will become more important for all miners, but especially the public [listed] mines. I personally think M&A season will continue — consolidation and shifts in strategies leading up to and post the halving,” said Fabiano.","Hut 8’s Genoot echoed this. “I think opportunities will come up, smaller operators will realize that they can't get the count forward, they can't compete as much at scale, and larger companies will continue to consolidate,” he said.","Miners, including Hut 8, CleanSpark (CLSK), Marathon (MARA), have all started to buy up assets from other miners to stay ahead of the competition.","However, given increased investor scrutiny, miners will likely seek buying opportunities that can provide a good return on investment. “I think you will see consolidation this year related to how do you make more money and acquire someone that has the power limit on the overhead [cost]” to create a deal that will add value for the shareholders, said Stronghold’s Beard.","Bitfarm’s Gagnon cautioned that consolidation has to make sense for the shareholders. “It needs to be at the right cost and it needs to add strategic value,” he said.","“We believe that finding surplus, low-cost electricity, preferably renewable, is the long-term benefit to the company. So if somebody else has developed something that makes sense to us and we can get it at the right price strategically, then we're happy to layer it in,” Gagnon added.","Read more: Bitcoin Soared to an All-Time High. So Why Aren't Miners Blasting Off, Too?","Edited by Benjamin Schiller."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"Stronghold Digital Mining","content":"ORGANIZATION"},{"type":"Crypto Miners","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Gagnon","content":"PERSON"},{"type":"Panther Creek","content":"ORGANIZATION"},{"type":"Riot Platforms (RIOT","content":"ORGANIZATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"fourth quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"second half of 2022","content":"DATE"},{"type":"Brandon Bailey","content":"PERSON"},{"type":"Ben Gagnon","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Fabiano Consulting","content":"ORGANIZATION"},{"type":"Jerry Maguire","content":"PERSON"},{"type":"Fabiano","content":"PERSON"},{"type":"1996","content":"DATE"},{"type":"Asher Genoot","content":"PERSON"},{"type":"Time High","content":"ORGANIZATION"},{"type":"Galaxy","content":"PERSON"},{"type":"Galaxy","content":"LOCATION"},{"type":"Greg Beard","content":"PERSON"},{"type":"Genoot","content":"PERSON"},{"type":"Blockware Solutions","content":"ORGANIZATION"},{"type":"Stronghold’s Beard","content":"ORGANIZATION"},{"type":"Amanda Fabiano","content":"PERSON"}],"hashtag":["Features","Bitcoin Halving"],"authors":["Aoyon Ashraf"]}