{"summary":"The police have managed to seize and store up hundreds of millions of pounds worth of cryptocurrency, but welcomes planned laws to ease seizures of crypto linked to crime and terrorism.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/10\/26\/uk-police-has-crypto-experts-stationed-nationwide\/","publishDate":"2022-10-26T10:38:13","id":15861,"type":null,"title":"UK Police Have Crypto Experts Stationed Nationwide","category":["Policy"],"content":["The U.K. National Police Chiefs' Council (NPCC) has stationed crypto tactical advisers in police departments nationwide to help investigate and seize digital assets tied to crime, an official said.","“There are officers now in every force in every regional organized crime unit, trained and equipped to do that,” Andrew Gould, staff officer for NPCC’s cryptocurrency portfolio, said while speaking at a hearing for the new Economic Crime and Corporate Transparency bill on Tuesday.","With the bill, the U.K. government is looking to give law enforcement the power to easily freeze crypto assets with links to criminal activities. But the country’s police agencies have already been boosting their efforts to target criminals that use crypto for money laundering or funding terrorism.","The NPCC has been able to strengthen its crypto capabilities thanks to the extra 100 million pounds sterling it received from the government, Gould said. U.K. police chiefs were lobbying the government for funding to equip and train 250 crypto tactical advisors in 2018, Bloomberg reported.","“So we're in a position where we've actually seized hundreds of millions of pounds worth of cryptocurrency assets within the last year or so,” Gould said.","He added that the police force has procured investigative tools and the ability to store seized crypto at the national level. The NPCC tapped digital asset custodian Komainu in January to provide the police a more \"robust\" means to store cryptocurrencies seized during investigations.","However, Gould still believes that the NPCC cannot keep up with crypto because it is costly.","“The assets themselves are becoming more diverse, more technical, complex, so our officers are kind of in an arms race trying to keep up,” Gould said, adding that the tools they do use can’t accommodate every crypto asset.","“So we need more than one investigative tool to better investigate effectively. That's very expensive,” Gould said.","It’s also difficult for the police to retain staff while having to compete with the glossy pay cheques offered by the private sector, Gould explained.","“One of my sergeants has just been offered 200,000 [pounds] to go to the private sector. We can't compete with that. That's probably the biggest risk we face within this area at the moment,” Gould said. Some police officers in the U.K are paid an annual salary between 28,000 and 100,000 pounds.","The NPCC did not respond to a request for comment by press time.","Read more: UK Wants to Make It Easier to Seize Crypto in Terrorism Cases"],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"U.K. National Police Chiefs' Council (NPCC","content":"ORGANIZATION"},{"type":"Andrew Gould","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Gould","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"NPCC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["Regulations","Crypto","Police","UK"],"authors":["Camomile Shumba"]}