{"summary":"Copying and pasting the Bee Movie script is a niche internet meme that originated on Tumblr and quickly spread to Reddit, YouTube, Facebook, and other social media platforms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/14\/developers-upload-script-of-jerry-seinfelds-bee-movie-on-ethereum-as-gas-fees-plunge-after-dencun\/","publishDate":"2024-03-14T07:18:23","id":15863,"type":null,"title":"Developers Upload Script of Jerry Seinfeld’s ‘Bee Movie’ on Ethereum as Gas Fees Plunge After Dencun","category":["Technology"],"content":["Ethereum developers are having some fun on the blockchain as a drop in data fees on the Ethereum network after the Dencun upgrade.","Developers are posting the entire script of the Bee Movie, an animated comedy by legendary comedian Jerry Seinfeld about a bee who sues humans, on the Ethereum blockchain for cheap following the Dencun upgrade.","“I didn’t get the first blob, but as far as I can tell, I DID get the first BEE MOVIE on mainnet,” posted Paradigm developer Dan Cline on Wednesday, shortly after the new blobs feature went live. The transaction cost only about $14.","Shortly afterward, another developer posted the script for just $5 as fees fell further. Copying and pasting the Bee Movie script is a niche internet meme that originated on Tumblr and quickly spread to Reddit, YouTube, Facebook, and other social media platforms.","In March 2023, a developer posted the script on the Bitcoin blockchain for the first time after Ordinals technology, a way to post text data on Bitcoin, went live.","Blobs are a cheap way to temporarily carry data about transactions that are now possible after Wednesday’s upgrade. Uploaded data exists on the network for about eighteen days, after which it is permanently removed.","These blobs are designed primarily for layer 2 networks that run atop Ethereum as an alternative to data storage within Ethereum blocks.","And it’s working well so far. Data from L2Fees shows that fees on layer 2 network Optimism were less than a cent as of Thursday morning, much lower than their usual levels. Elsewhere, Base blockchain developers are reporting a 99.8% drop—with fees at $0.0005 instead of $0.31.","Edited by Parikshit Mishra."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"$0.0005","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Facebook","content":"LOCATION"},{"type":"$14","content":"MONEY"},{"type":"March 2023","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$5","content":"MONEY"},{"type":"99.8%","content":"PERCENT"},{"type":"Dan Cline","content":"PERSON"},{"type":"a cent","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"$0.31","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Jerry Seinfeld","content":"PERSON"}],"hashtag":["Ethereum","DeFi","gas fees"],"authors":["Shaurya Malwa"]}