{"summary":"Ethereum is on the verge of enormous growth, aided by the L2 blockchains that complement it.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/09\/20\/understanding-the-economics-of-ethereum-layer-2s\/","publishDate":"2023-09-20T15:45:00","id":15867,"type":null,"title":"Understanding the Economics of Ethereum Layer 2s","category":["Technology"],"content":["Crypto is on the verge of spawning a new investable asset class globally. And then it will slowly change how just about everything on the internet works.","With the birth of a new asset class will come new business model analysis. New KPIs, metrics, and benchmarks as valuation criteria. New reporting and audit structures. New data providers. And new buy- and sell-side research structures.","Adding to the complexity, crypto investors need to understand concepts such as Metcalf’s Law, Moore’s Law, Lindy effects, the power of open-source technologies and composability. “Good enough technology” and “The 10-year window.”","You’re reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","Furthermore, investors need a framework for how value flows throughout the tech stack to effectively analyze crypto networks, protocols and applications.","This is especially important today. Ethereum is nearing its “broadband moment” – where throughput constraints are solved via a layer-2 blockchain, unleashing scalable infrastructure to support new applications and the onboarding of the next billion users.","In less than two years, we’ve seen transactions on Ethereum’s largest L2 scaling solutions (Arbitrum, Optimism and now Base) grow by 3,438%.","But what does this mean for the Ethereum layer 1?","L2s provide execution services to the application layer of the tech stack by batching transactions, compressing the data and ultimately anchoring proofs of the data to Ethereum as L1 transactions (final settlement).","Therefore, investors need to know the economic relationship between an L2 and L1 to properly assess and forecast value accrual within the tech stack.","Let’s take a look at the margins of L2s to date.","In aggregate, L2s are keeping an average of 23.5% of all transaction fees running through applications that leverage their execution engines.","Ethereum validators are receiving the remaining 76.5% of user transaction fees paid on L2.","Therefore, L2s are complementary to Ethereum and to holders of ETH, its related asset.","Every product in a marketplace has substitutes and complements. A substitute is another product you might buy if the first product is too expensive. For example, chicken is a substitute for beef. A complement is a product that you usually buy together with another product. Think gas and cars. Or hot dog buns and hot dogs.","All else being equal, demand for a product increases when the price of its complements decreases. For example, hotels in Miami will go up in price if flights to Miami drop significantly.","If L2s are complements and continuously drive down costs that enable superior user experiences, this should ultimately drive more usage of the Ethereum L1.","Complements tend to get commoditized. Therefore, we expect to see L2 margins compress over time as competitors enter the market and Moore’s Law continues to play out.","Of course, this process is still very nascent. And there are additional layers of the tech stack to monitor as well – such as the application layer, Eigen Layer (restaking and “security as a service”), data availability (Celestia), data oracles, etc.","Crypto is on the verge of spawning a new investable asset class globally.","If you’re advising clients or investing within the crypto tech stack, you need to understand how value is created and captured at each layer.","Edited by Nick Baker."],"entity":[{"type":"Moore","content":"PERSON"},{"type":"Eigen","content":"PERSON"},{"type":"76.5%","content":"PERCENT"},{"type":"3,438%","content":"PERCENT"},{"type":"Metcalf","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Lindy","content":"PERSON"},{"type":"23.5%","content":"PERCENT"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Opinion","Crypto Long & Short","layer 2","DeFi","Metrics","Data","Ethereum","Arbitrum","Optimism"],"authors":["Michael Nadeau"]}