{"summary":"Refereum says a partnership with Fortnite competitor PlayerUnknown's Battlegrounds will reward players with the startup's RFR tokens.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/07\/24\/pubg-players-can-get-crypto-rewards-for-winning-games-this-summer\/","publishDate":"2019-07-24T12:50:05","id":15868,"type":null,"title":"PUBG Players Can Get Crypto Rewards for Winning Games This Summer","category":["Markets"],"content":["Crypto game marketing startup Refereum says it has secured a partnership with major Fortnite competitor, PlayerUnknown's Battlegrounds (PUBG).","The partnership will reward PUBG players with RFR tokens. The startup tells CoinDesk it is supplying the RFR tokens for the initial campaign.","\"PUBG has granted Refereum special access to the PUBG login system, and we've tightly integrated our quest technology into the game through access to their production API,\" Dylan Jones, Refereum CEO, told CoinDesk.","The initial campaign will last till Aug. 20. During that time, PUBG players will able to earn rewards on PUBG by logging directly into the game and accomplishing achievements, such as winning matches. The firm says it has previously offered its rewards on games such as State of Decay 2, Fortnite, Apex Legends, and the Battlefield series.","The firm, which says it raised $32 million in a private token sale in early 2018, created its RFR token to better align game makers, streamers and players in the promotion and viewing of compelling new games.","Game companies want influential people to play their games on streaming platforms like Twitch, and they also want players to watch those streams. Refereum argues that rewards can help, and that logging these rewards on the blockchain makes them more transparent and fair.","PUBG is one of the arena-style games competing with Fortnite. It has roughly 350,000 players per day on Steam, according to Steam Charts.","Jones said:","So what can players do when they've earned RFRs? Refereum says the token can be used for purchases of games, or in-game items such as weapons or skins, as well as to tip their favorite streamers.","Refereum is not the only company to enter the game promotion space. Russia-based, ICO-funded startup The Abyss has a deal with Epic Games (the maker of Fortnite) to use its promotion technology to foster more development on Epic's Unreal Engine.","PUBG image via Shutterstock"],"entity":[{"type":"Apex Legends","content":"PERSON"},{"type":"Fortnite","content":"LOCATION"},{"type":"Battlefield","content":"LOCATION"},{"type":"Dylan Jones","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"$32 million","content":"MONEY"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Refereum","content":"PERSON"},{"type":"Fortnite","content":"ORGANIZATION"},{"type":"Aug. 20","content":"DATE"}],"hashtag":["Gaming","startups","News","Tokens","Fortnite","business news"],"authors":["Brady Dale"]}