{"summary":"As the spot ETF narrative hogs the limelight, the U.S. Treasury's recent decision to slow the pace of bond sales and worsening economic and geopolitical issues silently support the bullish case in bitcoin.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/11\/09\/exploring-the-two-overlooked-bullish-tailwinds-for-bitcoin\/","publishDate":"2023-11-09T11:07:49","id":15875,"type":null,"title":"Exploring The Two 'Overlooked' Bullish Tailwinds for Bitcoin","category":["Markets"],"content":["Unless you have been underwater for the past week, you have probably heard about bitcoin (BTC) rising to 18-month highs above $36,000, mainly on hopes of one or more exchange-traded funds (ETF) getting approved.","The so-called spot ETF narrative is hogging the limelight, perhaps rightfully so, as the eventual launch is expected to bring billions of dollars in investor money into the market.","That said, there are at least two other bullish, underappreciated tailwinds supporting upside in the cryptocurrency. Let’s discuss those in detail.","The U.S. Treasury has long been releasing a “quarterly refunding announcement,” publishing its plans for bond issuance\/sales over three months. Markets rarely noticed the announcement in recent years.","But the latest Nov. 1 release was closely watched as markets feared the Treasury would step up the issuance of longer-dated bonds to handle the burgeoning debt load.","Such an outcome could have seen the yield on the U.S. 10-year note, the so-called risk-free rate of return, establish a foothold above the much-feared 5% mark, disincentivizing investments in stocks, cryptocurrencies, and other assets. All else equal, less bond supply means upward pressure on prices and downward pressure on yields.","However, the Treasury said it plans to borrow less than anticipated in Q4, announcing a slower-than-expected pace of 10-year and 30-year bond sales.","Since then, the yield on the 10-year note has declined from 4.93% to 4.52%. It could drop further in the coming weeks, thanks to Treasury’s slower debt sales and hopes the Fed’s tightening cycle has ended. On Friday, the U.S. nonfarm payrolls data missed estimates, weakening the case for continued rate hikes by the Federal Reserve.","Bitcoin has more than doubled this year, in line with its record of beginning new bull trends in 12 or more months leading up to the reward halving. The fourth halving is due in March\/April 2024. The latest cycle, however, looks different than previous ones, thanks to bitcoin’s strengthening safe-haven appeal, according to Noelle Acheson, author of the widely-followed Crypto is Macro Now newsletter told CoinDesk.","In other words, considering the economic and geopolitical risks, the path of least resistance for BTC is higher. A safe haven asset appreciates or retains its value in terms of economic or geopolitical crisis.","While the U.S. economy still appears resilient, a slowdown is increasingly likely. The International Monetary Fund recently cut its 2024 global growth forecast to 2.9% from its July forecast of 3.0% while expressing concerns over geopolitical tensions, China’s property market issues, and commodity volatility.","The recent conflict in the Middle East suggests the cold war between the U.S., China, and Russia is escalating, according to geopolitical strategist Velina Tchakarova.","That could worsen economic issues, boosting demand for censorship and seizure-resistant assets like bitcoin.","“One of the big differences between this cycle and the previous one is the strength of the “safe haven” narrative. Back in 2021, the tailwinds were mainly liquidity and speculation on the ETF impact - this time, they are ETF speculation and a deepening understanding of the safe haven narrative, at a time one, is regretfully needed,” Acheson told CoinDesk.","“Safe haven has several meanings: for many who need to ensure their assets are seizure-resistant, a digital bearer asset is ‘safer’ than fiat in a bank account or even gold, which is hard to transport. For others, “safe” means a provably hard supply limit at a time when governments are going to have no choice but to dilute [fiat] currencies,” Acheson added.","Central banks worldwide have begun cutting rates, a development that could dilute their respective national fiat currencies and boost demand for alternative assets like BTC.","Edited by Parikshit Mishra."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2.9%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"3.0%","content":"PERCENT"},{"type":"Velina Tchakarova","content":"PERSON"},{"type":"4.93%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"March\/April 2024","content":"DATE"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"Middle East","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$36,000","content":"MONEY"},{"type":"Nov. 1","content":"DATE"},{"type":"4.52%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","ETF","Markets"],"authors":["Omkar Godbole"]}