{"summary":"Crypto markets slid as much as 10% in the past 24 hours, but have quickly been bought up by bulls.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/06\/bitcoin-rebounds-as-150k-target-for-2024-comes-in-view\/","publishDate":"2024-03-06T07:24:51","id":15882,"type":null,"title":"Bitcoin Rebounds as $150K Target for 2024 Comes in View","category":["Markets"],"content":["Buying demand and a reset in funding rates for perpetuals has buoyed bitcoin (BTC) prices early Wednesday, fueling a broader-market recovery.","The world’s largest cryptocurrency tumbled over 7% on Tuesday after briefly touching all-time highs, causing a market-wide sell-off and more than $1 billion in liquidations amid the volatility. It dropped to as low as $60,800 but neared $67,000 in Asian morning hours – indicating resilience.","Some observers said the selling pressure was likely driven by profit-taking at historical highs and miners offloading some of their bitcoin holdings. Data shows that inflows in spot bitcoin exchange-traded funds (ETFs) remained strong, with BlackRock amassing over $760 million on Tuesday.","Meanwhile, some market analysts said lofty price targets for bitcoin remained in view as April’s anticipated halving event, which reduces mining rewards in half, approaches.","“As demand from bitcoin ETFs, with $500 million in daily average inflows, continues to outstrip new production, we may see bitcoin’s ongoing surge continue,” Alex Adelman, CEO of bitcoin rewards application Lolli, shared in an email.","“Following the Halving, increased scarcity and strong demand from retail and institutional investors will likely push bitcoin’s price even higher. Based on historical trends following the Halving, bitcoin’s price could top $150,000 in the next year.”","Some developers say Bitcoin fundamentals are stronger this cycle compared to the previous ones, pointing to the introduction of Ordinals technology and their adoption.","\"New innovations such as Ordinals, digital collectibles (NFTs) that are inscribed in the Bitcoin blockchain have driven $3.6 billion in BTC payments over the last 6 months alone,\" shared Stijn Paumen, founder of crypto payments firm Helio, in a message to CoinDesk. \"If this trajectory continues we'll see global adoption of crypto as a mainstream method of a payment in the coming 4-year BTC cycle.\"","Major tokens, such as Solana’s SOL, Cardano’s ADA, ether (ETH) and meme coins, started to reverse Tuesday’s losses, rising as much as 5% in the past hour on bitcoin’s strength.","Dog-themed tokens dogecoin (DOGE) and shiba inu (SHIB) saw sell-offs of more than 15% on Tuesday but did not rebound alongside the other major tokens.","Edited by Parikshit Mishra."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Helio","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"Cardano’s ADA","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$60,800","content":"MONEY"},{"type":"$760 million","content":"MONEY"},{"type":"Lolli","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$67,000","content":"MONEY"},{"type":"$3.6 billion","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Stijn Paumen","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Alex Adelman","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Solana","content":"PERSON"}],"hashtag":["Trading","Investing","Bitcoin"],"authors":["Shaurya Malwa"]}