{"summary":"Despite years-long scrutiny over Tether's stability, USDT saw a rapid resurgence in 2023 benefiting from its close competitors' troubles.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/04\/tethers-usdt-stablecoin-touches-100b-market-cap-benefiting-from-crypto-trading-frenzy\/","publishDate":"2024-03-04T17:13:39","id":15884,"type":null,"title":"Tether's USDT Stablecoin Touches $100B Market Cap, Benefiting From Crypto Trading Frenzy","category":["Markets"],"content":["USDT, a stablecoin issued by Tether, briefly hit $100 billion in market capitalization for the first time in its history, according to CoinGecko data, as the rally on crypto markets expanded.","While the number of USDT tokens stood at around 99.5 billion, according to Tether's website, a slight price premium over the token's $1 price peg on some exchanges was enough to push the market cap above that level for a short while.","USDT is on track to decisively surpass the threshold again soon if it continues its current growth trajectory, having added $2 billion to its supply over the past week, as it benefits from the crypto trading frenzy that's driving bitcoin (BTC) nearer to a record high.","USDT is the most popular stablecoin, or crypto token whose value is pegged to another asset, and a key piece of plumbing in the digital asset market. It serves as a bridge between traditional (fiat) money and blockchain-based markets providing market participants with liquidity for trading and lending. It is also increasingly used for transfers and savings in developing regions to access dollars outside of the traditional banking system.","Read more: Stablecoin Market Cap Hits $140B, Highest Since 2022 Amid USDC Resurgence, Tether Growth","Tether’s history dates back to 2014, when it first issued a dollar-backed digital currency called \"realcoin\" on the Bitcoin network to help transfer fiat currencies on the blockchain. Later that year, realcoin was rebranded to tether (USDT). Since then, USDT has expanded to numerous blockchains and Tether has launched stablecoins pegged to gold and other currencies.","USDT's market value skyrocketed during the 2020-2021 crypto bull market, growing to $83 billion from $4 billion by mid-2022, and has become the go-to trading pairing for cryptocurrency prices on centralized exchanges.","The company has, however, received a fair amount of scrutiny over the years for its opaque reserve management, having at one point risky backing assets like Chinese commercial paper and credit to now-bankrupt crypto lender Celsius, and a lack of independent audits – a deeper financial analysis than attestations. It now says it is backed mainly by more secure investments such as U.S. Treasury bills, repurchase agreements and deposits in money market funds.","Despite mounting concerns about Tether's stability during the brutal 2022 bear market in crypto, USDT saw a rapid resurgence last year grabbing market share from close competitors after a regulatory crackdown on crypto exchange Binance-branded BUSD and the regional U.S. banking crisis in March, which heavily affected Circle-issued USDC.","USDT's share of the $140 billion stablecoin pie is now more than 70%. The company has also become very profitable by benefitting from rising U.S. interest rates, reporting $2.85 billion in profit in the last quarter predominantly from yields on its massive U.S. Treasuries holdings.","Edited by Sheldon Reback."],"entity":[{"type":"2014","content":"DATE"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"USDC Resurgence","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"$140B","content":"MONEY"},{"type":"$2.85 billion","content":"MONEY"},{"type":"Tether Growth","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$140 billion","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"$83 billion","content":"MONEY"},{"type":"99.5 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Tether","USDT","Stablecoin"],"authors":["Krisztian Sandor"]}