{"summary":"Many investors find the underlying cryptocurrency more attractive than ETFs given the ability to hedge and to generate yield on HODLs, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/16\/bitcoin-etfs-are-driving-a-spot-multiplier-effect-canaccord-says\/","publishDate":"2024-04-16T09:53:25","id":15885,"type":null,"title":"Bitcoin ETFs Are Driving a Spot Multiplier Effect, Canaccord Says","category":["Finance"],"content":["While there has been a lot of noise about how much assets under management (AUM) bitcoin (BTC) exchange-traded funds (ETFs) are attracting, it is now becoming obvious that these ETFs are driving additional demand for the underlying cryptocurrency itself, broker Canaccord Genuity said in a research report on Monday.","The broker held its 2024 Digital Assets Symposium last Thursday and hosted leaders from 29 crypto-related companies.","“It is becoming clear now that there is a material multiplier effect also underway from the ETFs in driving additional demand for the underlying BTC spot itself,” analysts led by Joseph Vafi wrote.","The broker noted comments from Swan Bitcoin, a bitcoin-only investment advisor, which said it is “seeing a multiple-fold increase in demand for an underlying spot as the ETFs drive the BTC demand curve to the right, while the BTC supply curve can’t respond in kind.”","Canaccord said that many investors, both retail and institutional, \"Find the underlying BTC spot more attractive than ETFs given potentially more ways to hedge and generate yield on HODLs over time as the asset class matures.”","In the coming months, spot bitcoin ETFs will be added to multiple registered investment advisor (RIA) platforms and large broker\/dealer wirehouses, and with this added distribution, “investment advisors that could more or less ignore bitcoin will now be forced to at least have an opinion” on the cryptocurrency, the report said.","Some institutions, in particular sovereign wealth funds, are likely already invested in bitcoin, and Canaccord expects to see announcements from these types of investors in the next few months.","New FASB accounting standards, when combined with continued inflationary concerns, “could drive more enterprises to follow MicroStrategy (MSTR), at least modestly to look at BTC as an asset to hold on the corporate balance sheet,” the report added.","Read more: Spot Bitcoin ETFs Are Just the Beginning for Wall Street","Edited by Parikshit Mishra."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Swan Bitcoin","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Canaccord","content":"ORGANIZATION"},{"type":"Joseph Vafi","content":"PERSON"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Canaccord Genuity","content":"ORGANIZATION"},{"type":"FASB","content":"ORGANIZATION"}],"hashtag":["Bitcoin","ETF","Bitcoin ETF","Canaccord Genuity"],"authors":["Will Canny"]}