{"summary":"Bitcoin's fourth mining reward halving is just two days away.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/17\/goldman-cautions-against-extrapolating-previous-bitcoin-halving-cycles-for-price-predictions\/","publishDate":"2024-04-17T08:36:02","id":15888,"type":null,"title":"Goldman Cautions Against Extrapolating Previous Bitcoin Halving Cycles for Price Predictions","category":["Markets"],"content":["Bitcoin's fourth mining-reward halving is just two days away. The quadrennial event will reduce BTC's per block emission to 3.125 BTC from 6.25 BTC, halving the pace of new supply. Previous halvings preceded massive multimonth rallies in BTC, and the crypto community is confident that history will repeat itself.","Investment banking giant Goldman Sachs, however, cautioned its clients from reading too much into the past halving cycles.","\"Historically, the previous three halvings have been accompanied by BTC price appreciation after the halving, although the time it took to reach the all-time highs differs significantly. Caution should be taken against extrapolating the past cycles and the impact of halving, given the respective prevailing macro conditions,\" Goldman's Fixed Income, Currencies and Commodities (FICC) and Equities team said in a note to clients on April 12.","The chart shows bitcoin's performance after previous halvings on Nov. 28, 2012, July 9, 2016, and May 11, 2020.","Though bulls were in the driver's seat following each of the three halvings, the magnitude and the time taken to reach the eventual peak differed.","More importantly, the macroeconomic environment on those occasions differed from today's high inflation, high-interest rate climate. Back then, M2 money supply of major central banks – U.S. Federal Reserve, European Central Bank, Bank of Japan and People's Bank of China – grew rapidly, as CoinDesk reported last year. Interest rates were stuck at or below zero in the advanced world, which catalyzed risk-taking across the financial market, including cryptocurrencies.","Read more: What Bitcoiners Are Saying About the Upcoming Bitcoin Halving","In other words, for history to repeat itself, macro conditions need to be supportive of risk-taking.","That's not the case today: Interest rates in the U.S., the world's largest economy, stand above 5% and markets have recently priced out hopes of cuts this year in the light of sticky inflation and a resilient economy.","The bitcoin price has rallied 50% this year, reaching record highs well ahead of the halving, thanks to inflows into the U.S.-based spot exchange-traded funds (ETFs) and has risen over 130% in six months. According to Bloomberg, the 11 spot-based ETFs, which went live three months ago, have amassed $59.2 billion in assets under management, creating a demand-supply imbalance.","As such, some analysts believe the major portion of the usual post-halving surge has been brought forward, leaving the door open for a sell-the-fact pullback after the April 20 halving.","According to Goldman, BTC's halving is a \"psychological reminder to investors of BTC's capped supply,\" and the medium-term outlook depends on the uptake of the ETFs.","\"Whether BTC halving will next week turn out to be a “buy the rumour, sell the news event” is arguably less impactful on BTC’s medium term outlook, as BTC price performance will likely continue to be driven by the said supply-demand dynamic and continued demand for BTC ETFs, which combined with the self-reflexive nature of crypto markets is the primary determinant for spot price action,\" the team wrote.","Edited by Sheldon Reback.","\n","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$59.2 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 12","content":"DATE"},{"type":"May 11, 2020","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Nov. 28, 2012","content":"DATE"},{"type":"July 9, 2016","content":"DATE"},{"type":"130%","content":"PERCENT"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"European Central Bank, Bank of Japan and People's Bank of China –","content":"ORGANIZATION"},{"type":"Goldman, BTC","content":"ORGANIZATION"},{"type":"Goldman's Fixed Income","content":"ORGANIZATION"},{"type":"Equities","content":"ORGANIZATION"}],"hashtag":["Goldman Sachs","Bitcoin","Halving","Bitcoin Halving"],"authors":["Omkar Godbole"]}