{"summary":"Miners who remain operational are likely to become even more profitable over the coming weeks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/07\/03\/bitcoin-mining-difficulty-records-largest-drop-in-history-price-jumps\/","publishDate":"2021-07-03T06:42:47","id":15883,"type":null,"title":"Bitcoin Mining Difficulty Records Largest Drop in History, Price Jumps","category":["Markets"],"content":["","The Bitcoin blockchain has undergone its biggest-ever drop in mining difficulty, as the network's automatic stabilizing mechanism kicked in following a strict crackdown by China on the country's cryptocurrency industry.","","","At 6:25 UTC Saturday, mining difficulty plunged by nearly 28% at block 689,471.","","","The steep decline in difficulty led to corresponding plunge in transaction fees, which in turn may have contributed to a $1,000 surge in the price of the leading cryptocurrency on anticipation of a spurt in transactions, according to one observer. In recent trading, the price of BTC was at $34,738, up 3.6% in the last 24 hours. Before the reduction in mining difficulty, BTC was about $33,700.","","","Charlie Morris, founder and chief investment officer of ByteTree Asset Management, tweeted hours after the cut in difficulty that fees had dropped to $6 from $10 yesterday.","","","The adjustment marks the third straight decline in mining difficulty, the first time such a trend has happened since December 2018. On May 29, the mining difficulty dropped by 16%, and June 13, it fell by 5%, according to mining service provider BTC.com.  ","","","Bitcoin’s difficulty is measured using an internal score that began at 1, when Satoshi Nakamoto (the name used for the anonymous person or people who wrote first white paper about Bitcoin) started mining at the easiest level. It is programmed to increase or decrease incrementally depending on how many miners are competing on the network. It is currently scored at 14,363,025,673,659, down from 19,932,791,027,262.","","","Blocks are added to the Bitcoin blockchain at a regular and predictable rate: one block every 10 minutes or so. Block time measures how long it takes to create a new block, but that pace can vary, depending on the number of miners on the network and the speed of their computers. When there are more miners competing to \"find\" the next block and earn the 6.125 BTC reward, then those blocks tend to be solved more quickly. But when miners drop off the network, leaving fewer miners to compete, block times can slow down.","","","That's what happened as Chinese authorities pushed to tamp down cryptocurrency trading and mining, because the country has historically hosted such a large portion of the Bitcoin network's hash power. Local authorities in China’s Xinjiang Uygur Autonomous Region, the Inner Mongolia Autonomous Region, Qinghai province and Sichuan province followed the top-down initiative by announcing plans to shut down some or all bitcoin mines.","","","During this most recent difficulty period, the mean hashrate, a measure of total computational power contributed to the blockchain through mining, stood at 87.7 exahashes per second, the lowest since December 2019. That's down from about a peak of about 180 exahashes per second in mid-May.","","","As a result, Bitcoin’s mean block time slowed significantly, with some blocks taking as long as 23 minutes on June 27, though the network appears to have sped up slightly since then.","","","The Bitcoin algorithm is programmed to self-adjust the difficulty level every 2,016 blocks, or roughly every two weeks, in order to maintain a target block time of 10 minutes.","","","So that's what happened overnight, as the blockchain's automatic stabilizer mechanism kicked in to incentivize more miners to join the network.","","","Today's difficulty drop will make it easier for the remaining miners to find blocks at a rate closer to the 10-minute target.","","","Though a decline in Bitcoin's hashrate means it is slightly less resilient against attacks, the news bodes well for active miners.","","","\"Difficulty adjustment has a few interesting properties in the real world too, particularly for miners,\" said Will Foxley of Compass Mining. \"When difficulty adjusts downwards, you make more bitcoin if you can stay online. When it goes up, you make less as more miners are participating.\"","","","“Miners who remain operational are likely to become even more profitable over the coming weeks, unless price corrects further or migrating hashpower comes back online,” Glassnode wrote in a report. ","","","UPDATED (July 3, 14:44 UTC): Adds price reaction, Morris comment on fees.",""],"entity":[{"type":"May 29","content":"DATE"},{"type":"3.6%","content":"PERCENT"},{"type":"$10","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"ByteTree Asset Management","content":"ORGANIZATION"},{"type":"December 2018","content":"DATE"},{"type":"Xinjiang Uygur Autonomous Region","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"},{"type":"$6","content":"MONEY"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Morris","content":"ORGANIZATION"},{"type":"July 3","content":"DATE"},{"type":"June 27","content":"DATE"},{"type":"$33,700","content":"MONEY"},{"type":"Will Foxley of Compass Mining","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"Sichuan","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"$34,738","content":"MONEY"},{"type":"Qinghai","content":"LOCATION"},{"type":"Charlie Morris","content":"PERSON"},{"type":"Inner Mongolia Autonomous Region","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"mid-May","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"China","content":"LOCATION"},{"type":"June 13","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Mining","Bitcoin","Hashrate","Mining Difficulty"],"authors":["Frances Yue","Omkar Godbole"]}