{"summary":"Quantstamp has rolled out its “Economic Exploit Analysis” tool to help identify potential flash loan attack vectors in smart contracts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246956\/quantstamp-tool-to-thwart-defi-flash-loan-attacks","publishDate":"2023-08-23T09:01:02","id":1588,"type":null,"title":"Quantstamp unveils tool to detect DeFi flash loan vulnerabilities","category":["SECURITY"],"content":["Blockchain security and auditing firm Quantstamp has rolled out what it calls the Economic Exploit Analysis <a href=\"http:\/\/www.quantstamp.com\/economic-exploits\" data-v-f87c67ca=\"\">tool<\/a>, aiming to help identify potential flash loan attack vectors in smart contracts before any hacks occur.","The tool automatically scans for vulnerabilities in the software code of a protocol that could be exploited through flash loan attacks, according to a statement. Quantstamp said it collaborated with the University of Toronto in developing the service, converting its initial academic research into a production-level tool.","The tool is not limited to analyzing only one specific contract or those belonging to a single client. Auditors (those checking the code for security flaws) can use this tool to analyze across various contracts from integrated DeFi protocols, Quantstamp added. However, while the tool’s search process is automated, it does require some manual intervention for protocol-specific adaptations, and it doesn’t guarantee the detection of all vulnerabilities.","Flash loan-based attacks are a significant concern in the DeFi space, <a href=\"https:\/\/www.theblock.co\/post\/219196\/euler-finance-flash-loan-attacked-for-an-estimated-197-million\" data-v-f87c67ca=\"\">siphoning off<\/a> around $200 million alone from the Euler Finance exploit in March.","Flash loans attract attackers aiming to exploit DeFi protocol vulnerabilities as they grant borrowers access to uncollateralized funds that can be leveraged to manipulate the protocols. However, they also carry substantial risk due to the borrower’s obligation to repay within the same transaction. The complexity of these attacks often allows them to bypass standard code audits, potentially allowing hackers to carry out exploits.","“DeFi has the potential to change the global financial infrastructure for the better, but its success requires preempting threats like flash loan attacks. We developed this tool to provide DeFi protocols an extra layer of security on top of audits,” Quantstamp Head of New Initiatives Martin Derka said. “As DeFi evolves, security measures need to evolve with it. Services like Economic Exploit Analysis give us an edge against hackers.”","Quantstamp’s Economic Exploit Analysis service is currently available across all Ethereum-compatible chains, with the potential to be adapted for other blockchains in the future, the team said.","Flash loan attacks are responsible for an increasing proportion of stolen funds from DeFi projects, according to&nbsp;The Block’s <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/exploits\/stolen-funds-by-using-flash-loans\" data-v-f87c67ca=\"\">dashboard<\/a>. In July, <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/exploits\/stolen-funds-by-using-flash-loans\" data-v-f87c67ca=\"\">90%<\/a> of the funds stolen were through flash loan-based attacks.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/stolen-funds-by-using-flash-loans\/embed\" title=\"Stolen Funds by using Flash Loans\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Last month, the Securities and Exchange Commission (SEC) <a href=\"https:\/\/www.theblock.co\/post\/241493\/sec-charges-quantstamp-over-28-million-ico\" data-v-f87c67ca=\"\">charged<\/a> Quantstamp over its $28 million initial coin offering (ICO) in 2019. Quantstamp paid $3.4 million to settle the charges without admitting or denying them. The SEC has established a \"<a href=\"https:\/\/www.sec.gov\/enforce\/33-11215-s\" data-v-f87c67ca=\"\">fair fund<\/a>\" to return the money paid by Quantstamp to the investors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"University of Toronto","content":"ORGANIZATION"},{"type":"$3.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Quantstamp Head of New Initiatives Martin Derka","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$28 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Quantstamp","content":"PERSON"},{"type":"Euler Finance","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS","SMART CONTRACTS"],"authors":["James Hunt","The Block"]}