{"summary":"The coordination between the European Union’s financial supervisors will increase “tremendously” in the wake of new digital policies like MiCA, chairperson of the European banking Authority said to members of the European Parliament. \nMiCA calls for supervisory authorities to oversee the implementation of the new crypto regulations due to roll out starting 2024.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179417\/eu-financial-authorities-increase-coordination-in-light-of-mica-says-eba-chair","publishDate":"2022-10-24T12:00:29","id":1588,"type":null,"title":"EU financial authorities increase coordination in light of MiCA, says EBA chair","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">The coordination between the European Union's financial supervisors has \"increased tremendously\" and will continue to do so thanks to new crypto regulatory framework, said European Banking Authority’s Chair Jose Manuel Campa.<\/span>","<span data-v-f87c67ca=\"\">Campa made the remarks while addressing the European Parliament’s Committee on Economic and Monetary Affairs. The EBA chair referred to legislation before the Parliament, including the Markets in Crypto-Assets framework expected to pass in November. After the anticipated passage of MiCA, Europe’s financial watchdogs will have a key role in finalizing new crypto rules will be implemented across EU member states in the coming months.&nbsp;<\/span>","The proposed regulatory framework for digital assets, as well as cybersecurity legislation before the Parliament, will be a \"qualitative change\" for the EU, said Campa. \"<span data-v-f87c67ca=\"\">This is not only for the financial sector - that qualitative change is broader in society.”<\/span>","<span data-v-f87c67ca=\"\">Campa's remarks came as part of a regular appearance by the three heads of EU financial authorities before the European Parliament. The heads of the European Securities and Markets Authority and the European Supervisory Authorities representatives also testified.<\/span>","<span data-v-f87c67ca=\"\">MiCA receives its expected final parliamentary vote in November, regulators will grapple with multiple questions around how to apply the new law to digital assets, though MiCA is not expected to be enforced until 2024 at the earliest.<\/span>"],"hashtag":["EUROPEAN PARLIAMENT"]}