{"summary":"Here are five of the top changes to expect with Ethereum’s impending transition to proof-of-stake.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/29\/how-ethereum-will-be-transformed-in-2022\/","publishDate":"2021-12-29T12:30:00","id":15895,"type":null,"title":"How Ethereum Will Be Transformed in 2022","category":["Consensus Magazine"],"content":["With 2021 winding down and 2022 hopefully being the year of the Merge, I wanted to do a deeper dive into five of the top things to expect with Ethereum’s impending transition to proof-of-stake. The Merge itself will not be as initially glamorous as many market participants and outsiders may believe. However, the underlying improvements and the foundation it sets will allow Ethereum to onboard millions of users without sacrificing decentralization.","The following is an overview of network activity on the Ethereum 2.0 Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Valid Points incorporates information and data about CoinDesk’s own Eth 2.0 validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post.","You can verify the activity of the CoinDesk Eth 2.0 validator in real time through our public validator key, which is: 0xad7fef3b2350d220de3ae360c70d7f488926b6117e5f785a8995487c46d323ddad0f574fdcc50eeefec34ed9d2039ecb.","Search for it on any Eth 2.0 block explorer site."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"}],"hashtag":["Ethereum","Eth2.0","Valid Points","Validators","DeFi","The Protocol"],"authors":["Edward Oosterbaan"]}