{"summary":"The company will begin its AI initiative in the next 3-6 months according to a document reviewed by CoinDesk.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/10\/near-to-hire-artificial-intelligence-engineers-as-part-of-ai-roadmap\/","publishDate":"2024-04-10T18:50:11","id":15899,"type":null,"title":"NEAR to Hire Artificial-Intelligence Engineers as Part of AI Roadmap","category":["Finance"],"content":["Layer-1, NEAR, will hire artificial-intelligence (AI) engineers as part of its 3-6 month roadmap to building user-owned AI.","According to a deck reviewed by CoinDesk, the company is planning to hire AI engineers “soon,” and its product team is working to plan AI workstreams over a 3-6 month transition phase. The deck was presented earlier today via a virtual town hall meeting by NEAR co-founder Illia Polosukhin with NEAR core employees.","This comes as the intersection between AI and blockchain continues to be a hot topic, with NEAR attempting to position itself at the forefront. Polosukhin was on a panel at Nivida’s conference titled \"Transforming AI\" last month, and saw its token NEAR double in price in anticipation of the event.","The company is well seasoned in terms of AI expertise, Polosukhin is an artificial intelligence researcher and software engineer that co-built the ‘Transformer’ architecture. The architecture powers generative AI systems like ChatGPT.","NEAR will use near.ai for surfacing AI information and will make an external announcement in May, according to the slide show.","The layer-1 says it believes it is uniquely positioned to make AI open source, given its not-for-profit and decentralized nature. The company also said the growth of revenue incentives will always take over at for-profit companies, whereas at NEAR, its token economy will create value in an open, permissionless ecosystem.","NEAR has been pushing its “chain abstraction,” narrative over the past few months, which aims to tackle the user experience in crypto by simplifying the hurdles that exist in a multichain environment. AI will help deliver NEAR’s core vision by accelerating development & ease of use, according to the deck viewed by CoinDesk.","Edited by Kevin Reynolds."],"entity":[{"type":"6","content":"DATE"},{"type":"Nivida","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"1","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"Kevin Reynolds","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Polosukhin","content":"PERSON"}],"hashtag":["Near","Artificial Intelligence","AI"],"authors":["Lyllah Ledesma"]}