{"summary":"Crypto startup trueDigital has rebranded itself to Tassat\nIt is preparing to launch a derivatives exchange and physically-settled bitcoin margin swaps\nTassat CEO, Thomas Kim, told The Block that the launch will take place “very shortly” ","author":["Yogita Khatri","Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38265\/crypto-startup-truedigital-rechristened-launching-derivatives-exchange-and-physically-settled-bitcoin-margin-swaps","publishDate":"2019-09-03T13:08:30","id":1590,"type":null,"title":"trueDigital rechristened; eyeing launch of derivatives exchange and more","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">Institutional-focused cryptocurrency startup trueDigital has rebranded itself to Tassat (pronounced TAA-sett), as a “strategic” decision to pivot into the derivatives trading and institutional payments markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the rebranding, the firm will soon launch a derivatives exchange that trades physically-settled bitcoin margin swaps. <\/span><span data-v-f87c67ca=\"\">The product will be listed on a swap execution facility (SEF), registered by the U.S. Commodity Futures Trading Commission (CFTC), according to Tassat CEO Thomas Kim.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm initially<\/span><a href=\"https:\/\/tassat.com\/press-releases\/truedigital-expects-to-acquire-dcm-and-sef-registrations-from-trueex-executing-on-plans-to-launch-its-cryptocurrency-derivatives-exchange\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> its plans to offer bitcoin derivatives in July, saying it has reached an “agreement in principle” to acquire designated contract market (DCM) and SEF registrations with the CFTC from a firm called <a href=\"http:\/\/theblockcrypto.com\/2019\/07\/17\/how-pivoting-into-digital-assets-is-offering-a-lifeline-to-the-firms-that-birthed-them\/\" data-v-f87c67ca=\"\">trueEX<\/a>, which <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/17\/how-pivoting-into-digital-assets-is-offering-a-lifeline-to-the-firms-that-birthed-them\/\" data-v-f87c67ca=\"\">helped kickstart<\/a> trueDigital.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We will be launching our derivatives exchange very shortly, on the heels of some activities around acquiring a DCM that is still currently undergoing CFTC review and approval,” said Kim.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last month, in a similar development, crypto exchange Seed CX also<\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/13\/seed-cx-begins-testing-physically-settled-bitcoin-margined-swaps-expects-to-go-live-within-the-next-three-months\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> that its subsidiary, Seed SEF, has started UAT of its physically-settled bitcoin margin swaps, meaning it will allow traders to enter into a leveraged position to buy or sell bitcoin for physical delivery at a later date.<\/span>","<span data-v-f87c67ca=\"\">Kim joined trueDigital in February after a seven year stint at the world’s largest hedge fund Bridgewater Associates. He <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/06\/on-the-block-why-true-digitals-new-ceo-left-the-hedge-fund-world-for-crypto\/\" data-v-f87c67ca=\"\">told<\/a> The Block that he was attracted to trueDigital after chatting with its co-founder Sunil Hirani, a serial entrepreneur and Wall Street hotshot.&nbsp; At the time, he also revealed that trueDigital was also looking to help banks issue digital tokens to accelerate payments between banks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Feburary, trueDigital<\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/18\/wall-street-analysts-throw-cold-water-on-jpmorgans-cryptocurrency\/\" data-v-f87c67ca=\"\">&nbsp;<span data-v-f87c67ca=\"\">helped<\/span><\/a><span data-v-f87c67ca=\"\"> Signature Bank to build a blockchain payments system Signet, which has on-boarded more than 100 clients who are using it to send millions of dollars a day.<\/span>","<span data-v-f87c67ca=\"\">Now, Kim told The Block that the firm is providing its technology to more banks to issue digital tokens that enable \"instantaneous\" payments between corporate clients. \"We are creating new rails for banks that allow them to not just do it in the facet but do it literally instantaneously from front end all the way to the back end,” he said, adding:<\/span>","<span data-v-f87c67ca=\"\">\"We are having conversations with not only banks but also with central banks of countries that are interested in issuing digital currencies.\"<\/span>","<span data-v-f87c67ca=\"\">Kim said that the rebranding aligns with a shift in the payments space that he has observed. According to Kim, the traditional way of processing payments between banks in batches is rendered obsolete in the face of the real-time 24\/7 processing capability powered by blockchains. Meanwhile, more banks are willing to embrace this new technology to improve their legacy systems, said Kim.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There has been an evolution of what payment actually means, and trueDigital was always trying to create new rails associated with payments through tokenization,” said Kim.&nbsp;<\/span>"],"hashtag":["DERIVATIVES"]}