{"summary":"State Street and Copper have mutually decided to end their licensing agreement, a spokesman for the bank said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/16\/banking-giant-state-street-cuts-ties-with-crypto-custody-firm-copper\/","publishDate":"2023-03-16T18:46:23","id":15906,"type":null,"title":"Banking Giant State Street Cuts Ties With Crypto Custody Firm Copper","category":["Finance"],"content":["Global custody bank State Street said it has ended its working relationship with Copper, the cryptocurrency custody firm which announced earlier Thursday that it was closing its enterprise infrastructure division.","“State Street and Copper have mutually decided to end their licensing agreement and both companies will continue to build on their digital strategies within their own respective product development approaches,” a State Street spokesman said via email.","State Street will continue to work on “a multi-faceted solution for both tokenized securities as well as native tokens,” the bank said, adding that the “regulatory environment for digital assets has continued to evolve, as has the requirements for servicing this asset class.”","The latest wave of uncertainty to grip the crypto industry has seen several of its dedicated banking partners collapse or step back from crypto firms. Adding to this trend, Copper announced somewhat out of the blue Thursday that it was closing down its enterprise infrastructure business to connect banks and hedge funds with digital assets. It will instead focus on its Clear Loop custody and settlement business.","Copper’s association with State Street, one of the largest custody banks in the world, was seen as a major coup for the London-based crypto firm, whose chairman is former U.K. Chancellor of the Exchequer Philip Hammond.","Copper did not immediately respond to a request for comment.","Read more: Crypto Custody Firm Copper Shelves Enterprise Business: Source"],"entity":[{"type":"Thursday","content":"DATE"},{"type":"Philip Hammond","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"State Street","content":"ORGANIZATION"}],"hashtag":["State Street","Copper","Exclusive"],"authors":["Ian Allison"]}