{"summary":"Coinbase is investing in Brazil where regulators are inviting innovation, while the U.S. cracks down on the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222412\/coinbase-regulation-brazil-us","publishDate":"2023-03-24T06:34:16","id":1590,"type":null,"title":"Coinbase tapping into innovation-friendly Brazil amid US regulatory crackdown","category":["COMPANIES"],"content":["Coinbase may be caught in the crypto regulatory crackdown in the U.S., but the company is finding plenty of friendly faces in Brazil.","On Tuesday, Coinbase introduced an app geared solely toward the Brazilian market, with customer support available in Portuguese 24\/7, and integrating the revolutionary Pix digital payment system created by the government and launched in 2020. The next day, in the U.S., the company said it was <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">served with a Wells notice<\/a> from the Securities and Exchange Commission notifying the company of investigations into several offerings and continuing a string of regulatory warning shots fired at crypto firms in the U.S.","And while the U.S. is still debating policy around the industry, late last year Brazil's president <a href=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblock.co\/post\/197036\/brazils-cryptocurrency-regulation-set-to-become-law-at-midnight&amp;sa=D&amp;source=docs&amp;ust=1679603690646604&amp;usg=AOvVaw3oqFsLrW04oIuG0B6Lk44k\" data-v-f87c67ca=\"\">signed<\/a> a bill into law establishing regulatory framework for the trading and use of bitcoin.","The industry sees differences between the regulatory approaches as stark. Where the U.S. is cracking down on a seemingly weekly, if not almost daily, basis on crypto-related companies, in Brazil they are welcoming them with open arms.","\"Brazil is a great example of a country in which regulators have understood the value of crypto and they are creating a very healthy debate around the topic to keep innovation and growth going,\" said Fabio Plein, country director for Brazil and newly-named regional managing director at Coinbase in Brazil, in an interview. \"Brazil is advancing in the creation of regulatory framework that protects users and the U.S. government right now is lagging behind in how to regulate this universe.\"","The focus on Brazil is part of the company's drive to go deep into markets with the most potential. Adding Pix payments was key since it's the principal payment method in the country. The instant payment platform created by the central bank went live in late 2020. In February, the number of transactions via Pix <a href=\"https:\/\/www.bcb.gov.br\/estabilidadefinanceira\/estatisticaspix\" data-v-f87c67ca=\"\">surged<\/a> to more than 2.5 billion.","Coinbase isn't alone in its drive to focus on Brazil. Last year, digital bank Nubank said a month after providing crypto trading to customers, it had reached one million crypto users. And earlier this month, the bank launched its token, Nucoin, that rewards users’ engagement through a loyalty program, which it said would be available to Nubank’s more than 70 million customers in Brazil through an initial airdrop.","Mercado Pago, owned by the giant Amazon-like Mercado Libre, started offering crypto trading in 2021.","The government's not just supporting the industry. It's actively seeking to <a href=\"https:\/\/valor.globo.com\/financas\/criptomoedas\/noticia\/2023\/02\/24\/blockchain-publica-passa-em-teste-do-real-digital.ghtml\" data-v-f87c67ca=\"\">launch<\/a> a central bank digital currency next year and is testing the use of a blockchain platform for the tokenized version of its legal tender, known as the real.","Coinbase also created a tech hub located in Brazil to produce products and services for other countries.","\"We wanted to bring the same app, the same experience that made us the exchange leader in the U.S.,\" Plein said. The company has 100 million users now, and is aiming to get to 1 billion. While Brazil has a young population that is tech-savvy and interested in alternative assets, the market is <a href=\"https:\/\/www.google.com\/url?q=https:\/\/www.worldometers.info\/world-population\/brazil-population\/&amp;sa=D&amp;source=docs&amp;ust=1679601166317457&amp;usg=AOvVaw2KJgzcFFVnKZ9p6RfiMzIZ\" data-v-f87c67ca=\"\">limited<\/a> to the population of about 216 million.","Brazil's also got a GDP per capita of just $7,500 <a href=\"https:\/\/data.worldbank.org\/indicator\/NY.GDP.PCAP.CD?locations=US&amp;most_recent_value_desc=false\" data-v-f87c67ca=\"\">compared<\/a> to the U.S.'s more than $70,000, according to the World Bank.&nbsp;&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nStill, \"where in the U.S., the regulatory approach is more about enforcement, in Brazil it's more about understanding that crypto is part of an agenda of innovation,\" Plein said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\" Plein","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Fabio Plein","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Plein","content":"PERSON"},{"type":"$7,500","content":"MONEY"},{"type":"Nucoin","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Nubank","content":"ORGANIZATION"},{"type":"World Bank","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}