{"summary":"China's Central Bank today banned the country's third-party payment companies from doing business with bitcoin exchanges, sources have claimed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2013\/12\/16\/china-bans-payment-companies-from-working-with-bitcoin-exchanges-sources-claim\/","publishDate":"2013-12-16T18:00:43","id":15913,"type":null,"title":"China Bans Payment Companies from Working With Bitcoin Exchanges, Sources Claim","category":["Markets"],"content":["UPDATE: CoinDesk can confirm that the source mentioned in this piece is Bobby Lee, CEO of bitcoin exchange BTC China. Lee said he is now happy to go on the record.","-----------------------------------------","Sources close to China's Central Bank today reported that the institution has banned third-party payment companies from doing business with bitcoin exchanges.","A reputable source told CoinDesk that the People's Bank of China (PBOC) met with most of the top third-party payment companies this morning.","The source said the meeting topic was unrelated to bitcoin, but digital currency became an important part of the discussion.","\"PBOC, in no uncertain terms, directed third-party payment companies not to do business with bitcoin exchanges in China,\" they explained.","At the moment, these claims are still rumours, as neither the PBOC nor any payment company has issued a statement to confirm what was discussed and what the outcome was. However, our source revealed they got their information from various channels, including those people who were at the meeting.","\"The writing's on the wall,\" said our source, adding:","They went on to say that if and when this happens, people will still be able to withdraw their money from Chinese exchanges, they just won't be able to deposit new funds.","\"There's no need to panic and do a run on the bank. People will still be able to sell their bitcoins for local currency and then withdraw that currency,\" they concluded.","Back on 5th December, the PBOC issued a statement saying that bitcoin was not a currency and, therefore, banks and other financial institutions were not allowed to deal with the digital currency.","The PBOC also said that merchants could no longer price their goods and services in bitcoin and couldn't exchange their wares for bitcoin.","The statement did, however, leave a few doors open for bitcoin. It essentially said bitcoin exchanges are legal, people have the right to buy and sell bitcoins, and bitcoin companies should register with the ministry of information and industrial technology.","This was good news for bitcoin exchanges in China as they were not only given some degree of legitimacy, but they were exclusively allowed to deal with digital currency while banks and financial institutions weren't allowed to touch them.","Unfortunately, this didn't last long.","On a potentially related note, several Chinese bitcoin exchanges, including BTC China, have just reintroduced trading commissions. A statement on BTC China's site reads:","CoinDesk has contacted PBOC and Chinese payment service provider Tenpay for comment, but no responses had been received at the time of publication.","Check back for updates to this story.","Dragon image via Shutterstock"],"entity":[{"type":"People's Bank of China (PBOC","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Bobby Lee","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"BTC China","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["China","Exchanges","BTC China","Banking","Regulation","News"],"authors":["Emily Spaven"]}