{"summary":"What started off as a parody project is still shocking the crypto world with wild price gains and celebrity endorsements.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/01\/29\/top-5-dogecoin-pumps-through-the-ages\/","publishDate":"2021-01-29T19:54:49","id":15917,"type":null,"title":"Top 5 Dogecoin Pumps Through the Ages","category":["Markets"],"content":["","Dogecoin, the popular meme cryptocurrency, hit a new all-time high on Jan. 28 following a meteoric 1,100% gain. Here’s a breakdown of every time dogecoin has shot for the moon. ","","","Dogecoin is a cryptocurrency that was created by Australian entrepreneur Jackson Palmer and software engineer Billy Markus back in 2013. It was meant to be a mockery of the new alternative coins, or “altcoins,” that were flooding the space at the time. The infamous Shibu Inu “doge” the project is centered around was taken from a viral internet meme that was particularly popular with early crypto adopters.","","","Dogecoin has a history of experiencing wild price movements that are mainly driven by its popularity as a funny dog-themed cryptocurrency. In the past, TikTok challenges and major celebrity endorsements have contributed to its rise in price, and other times the cryptocurrency surges for no reason at all.","","","Dogecoin’s first major pump started around March 10, 2017, as a significant rise in retail investment started to pour into the crypto market for the first time, lifting all alternative coins, or altcoins. Over 70 days, the “joke” cryptocurrency rose by more than 1,890% from $0.00021 to a peak of $0.0042 on May 21. This shattered the previous all-time high of $0.0021 and sent the market cap soaring over $423 million. Shortly after, dogecoin slumped 75% during a two-week market pullback that affected all cryptocurrencies. ","","","By November of 2017, significant buying momentum had returned to the crypto market, with huge trading volumes driving bitcoin to a height of $19,783. The global crypto market capitalization reached a staggering $830 billion and sent smaller-cap projects like dogecoin parabolic. ","","","On Jan. 7, 2018, dogecoin broke over $0.02 – 380% higher than its previous high. Its market capitalization at this stage was $1.6 billion. However, this was very short-lived and within eight days the price unraveled over 70% back down to $0.0047. ","","","\nOn April 14, 2018, just before the entire market entered “crypto winter” and crashed to former lows, a vast majority of crypto projects staged a brief recovery. In three days, dogecoin rose 103% from $0.0020 to $0.0041. For comparison, bitcoin only managed to secure a 40% rise within the same month.","","","By this time, dogecoin’s market capitalization had been cut by more than half from its all-time high down to $573 million.","","","The first major dogecoin rally that was largely uncorrelated to the rest of the crypto market was in September 2018 when a system test of the Dogecoin\/Ethereum bridge was completed. ","","","The bridge was supposed to be a new update that would allow interoperability between the two blockchains. The announcement reignited community support for the project and dogecoin’s price rose 173% in 48 hours.","","","It later transpired, however, that due to a crash in the price of ether – the main cryptocurrency of the Ethereum project – there was insufficient funding to continue developing the bridge and the update was put on hold. Since then, there has been no mention of whether this bridge between Dogecoin and Ethereum will ever be continued. ","","","\nOn Jan. 11, 2021, the traditional financial markets were heavily disrupted by a subreddit group called the WallStreetBets (aka WSB). These amateur stock traders decided to unite against traditional financial institutions and pump a number of stocks that major hedge funds were betting on falling in value, such as GameStop, BlackBerry, AMC, Nokia and Bed Bath & Beyond.","","","On Jan. 28, the WSB stock market mania spilled across to dogecoin and catalyzed the biggest crypto rally of the year so far. In less than two days, dogecoin skyrocketed to a new all-time high of $0.087 on the Binance exchange – representing a 1,100% gain. The rally was fueled in part by a number of tweets, including one from Elon Musk, the world’s richest man and avid dogecoin fan.","","","Netflix’s \"Tiger King\" celebrity, Carole Baskin, also tweeted a video voicing her support for the dog-themed cryptocurrency. ",""],"entity":[{"type":"1,890%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"$573 million","content":"MONEY"},{"type":"Dogecoin\/Ethereum","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"$0.0021","content":"MONEY"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"$0.0041","content":"MONEY"},{"type":"$0.0042","content":"MONEY"},{"type":"$0.0020","content":"MONEY"},{"type":"$0.0047","content":"MONEY"},{"type":"WSB","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Bed Bath & Beyond","content":"ORGANIZATION"},{"type":"Jan. 28","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"AMC","content":"ORGANIZATION"},{"type":"380%","content":"PERCENT"},{"type":"Carole Baskin","content":"PERSON"},{"type":"Elon Musk","content":"LOCATION"},{"type":"$0.00021","content":"MONEY"},{"type":"May 21","content":"DATE"},{"type":"Jan. 7, 2018","content":"DATE"},{"type":"September 2018","content":"DATE"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"1,100%","content":"PERCENT"},{"type":"Jan. 11, 2021","content":"DATE"},{"type":"$0.087","content":"MONEY"},{"type":"$830 billion","content":"MONEY"},{"type":"Nokia","content":"ORGANIZATION"},{"type":"$1.6 billion","content":"MONEY"},{"type":"75%","content":"PERCENT"},{"type":"$19,783","content":"MONEY"},{"type":"103%","content":"PERCENT"},{"type":"Shibu Inu","content":"ORGANIZATION"},{"type":"November of 2017","content":"DATE"},{"type":"$0.02","content":"MONEY"},{"type":"Billy Markus","content":"PERSON"},{"type":"$423 million","content":"MONEY"},{"type":"173%","content":"PERCENT"},{"type":"April 14, 2018","content":"DATE"},{"type":"March 10, 2017","content":"DATE"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Dogecoin","Elon Musk","Explainers","Learn","Evergreen"],"authors":["Ollie Leech"]}