{"summary":"The company last year made a similar pledge to Ethereum developers with respect to its ether futures ETF.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/01\/05\/vaneck-to-donate-5-of-profits-from-btc-etf-to-bitcoin-core-developers\/","publishDate":"2024-01-05T17:12:57","id":15918,"type":null,"title":"VanEck to Donate 5% of BTC ETF Profits to Bitcoin Core Developers","category":["Finance"],"content":["Asset management firm and prospective BTC exchange-traded fund (ETF) provider VanEck will donate 5% of the profits from its fund (if approved) to Bitcoin developers Brink.","VanEck's application to list a spot bitcoin ETF in the U.S. is one of more than a dozen currently awaiting a decision from the U.S. Securities and Exchange Commission (SEC). The markets regular is expected to finally approve such the listing of such a fund in the coming days.","The arrival of spot bitcoin ETFs is expected to grow the amount of investment into cryptocurrency from the TradFi world to levels never seen before.","While this is largely welcomed from the incumbent crypto community, there will also be friction in some quarters. Therefore providers like VanEck will be keen to demonstrate some commitment to the core Bitcoin industry by giving back to developers and others.","\"We’re not Bitcoin tourists at VanEck. We’re in it for the long haul,\" VanEck posted on X on Friday. \"[Brink's] tireless dedication to decentralization and innovation is the cornerstone of the Bitcoin ecosystem, and we're here to support it.\"","The move is reminiscent of a similar pledge by VanEck to donate 10% of profits from its ether futures ETF to Ethereum developers in October last year.","Read More: If a Bitcoin ETF Is Approved, Here’s What May Happen","Edited by Stephen Alpher.","\n"],"entity":[{"type":"VanEck","content":"PERSON"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"October last year","content":"DATE"}],"hashtag":["VanEck","Bitcoin ETF","Bitcoin Core"],"authors":["Jamie Crawley"]}