{"summary":"BlockFi recently announced it would make changes to the interest they pay for bitcoin and ether deposits.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/01\/24\/blockfi-adjusts-interest-rates-to-lure-larger-crypto-deposits\/","publishDate":"2020-01-24T03:46:37","id":15915,"type":null,"title":"BlockFi Adjusts Interest Rates to Lure Larger Crypto Deposits","category":["Markets"],"content":["","BlockFi, one of the first lending startups in the cryptocurrency markets, announced Thursday it would make changes to the interest paid based on the yield it generates from lending bitcoin (BTC) and ether (ETH). The changes begin Feb. 1.","","","Rates for litecoin (LTC) and Gemini dollar (GUSD) will remain unchanged, according to BlockFi.","","","In an email to CoinDesk, Blockfi CEO Zac Prince said the crypto market is starting to “position more bullish”, which brings yields for lending bitcoin (and ether) down.","","","“As market conditions change, particularly price sentiment, this has an effect on the prices in the crypto borrowing market which is a big driver of rates that BlockFi can offer to our clients,” Prince said.","","","BlockFi's new yields for those lending up to 10 BTC (its \"Tier 1\" customers) will be 5.1 percent. Right now, customers loaning up to 5 BTC see a yield of 6.2 percent. Likewise, their Tier 1 ETH lenders will also see a rate cut to 3.6 percent on loans of up to 500 ETH from 4.2 percent for lending 1,000 ETH.","","","On the other hand, yields will increase by a modest margin for users holding balances above 5 or more BTC (\"Tier 2\") to 3.2 percent from 2.2 percent. (Tier 2) while ETH lenders will see a yield increase to 2 percent, up from 0.5 percent for more than 500 individual ETH (Tier 2).","","","“Our rates are still way ahead of alternative options and we remain the only retail-focused interest-earning platform that is US-domiciled\/regulated, institutionally backed and doesn't have a utility token,” Prince said.",""],"entity":[{"type":"Feb. 1","content":"DATE"},{"type":"2.2 percent","content":"PERCENT"},{"type":"5.1 percent","content":"PERCENT"},{"type":"4.2 percent","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2 percent","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"0.5 percent","content":"PERCENT"},{"type":"3.2 percent","content":"PERCENT"},{"type":"3.6 percent","content":"PERCENT"},{"type":"Blockfi","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"6.2 percent","content":"PERCENT"}],"hashtag":["Lending","Bitcoin","Ether","BlockFi","DeFi"],"authors":["Sebastian Sinclair"]}