{"summary":"Mining rig makers like Bitmain and MicroBT are expanding to Russia as the U.S. market becomes saturated, sources said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/07\/28\/amid-sanctions-bitcoin-mining-machines-are-flowing-into-russia-as-industry-thrives\/","publishDate":"2023-07-28T13:58:54","id":15910,"type":null,"title":"Amid Sanctions, Bitcoin Mining Machines Are ‘Flowing’ Into Russia, as Industry Thrives","category":["Consensus Magazine"],"content":["The bitcoin mining industry in Russia is booming, and hardware manufacturers Bitmain and MicroBT are positioning themselves to reap the benefits.","More machines are flowing into Russia than anywhere else in the world, Ethan Vera, chief operating officer at global mining services firm Luxor Technologies, said at CoinDesk’s Consensus 2023 festival held last month in Austin, Texas.","Russia has always been a powerhouse in terms of Bitcoin hash rate – a measure of computational power being contributed to the blockchain – thanks to the availability of cheap energy and its cold climate. Russia’s share of world mining gained as China banned the industry in 2021, making it the second- or third-largest in the world, according to one of its biggest mining firms.","This story is part of CoinDesk's 2023 Mining Week, sponsored by Foundry.","All of this stands out as Russia’s economy has suffered amid the international sanctions imposed following Russia’s 2022 invasion of Ukraine and continued attack on the country.","None of the “sanctions targeting Russia completely prohibit involvement in the mining sector,” said David Carlisle, vice president of policy and regulation at Elliptic, a blockchain analytics firm. Still, there are “significant risks” for firms operating in Russia’s mining sector: they can’t do business with sanctioned entities including mining hosting firm BitRiver, or make payments to state banks and companies, Carlisle added.","Carlisle is a former staffer at the U.S. Department of the Treasury, including in the Office of Foreign Assets Control (OFAC), which develops financial and economic sanctions.","Read more: Bitcoin Miners Are Starting to Emerge From Brutal Crypto Winter","Moreover, foreign firms setting up in Russia given the current geopolitical backdrop might be facing reputational risks.","In recent months, improved mining economics, thanks to this year’s rising price of bitcoin (BTC) and the Ordinals project that drove up activity on the Bitcoin blockchain, have created good conditions for mining in Russia, explained Sergey Arestov, CEO of miner BitCluster.","On top of that, increased regulatory scrutiny and taxation in the U.S. and elsewhere have made Russia even more competitive. Given these factors, it will be the only country able to substantially accelerate hashrate growth, mining firm Cryptocurrency Mining Group (CMG) wrote in a report.","Regulatory changes in neighboring Kazakhstan – which cap the electricity available for bitcoin mining – might have also contributed to Russia’s surge in computing power as miners moved away from Kazakhstan a while ago. Russia might be one of the destinations, said Didar Bekbau, a founder of Kazakhstan-based mining firm xive.io.","Read more: Kazakhstan's President Signs Legislation to Limit Energy Usage of Crypto Mining","Cheap energy costs, one of the largest contributors to mining profitability, have also incentivized miners in Russia to ramp up their operations. Currently miners are able to install their machines at other firms’ facilities at a cost of $0.05-$0.055 per kilowatt hour (kWh) of energy all-in, thanks to the abundance of cheap energy, so the region will likely continue developing. Prices in the U.S. are around $0.08 per kWh.","Hosting is a service that data centers provide to crypto miners in which customers can store their crypto mining rigs and mine their preferred digital assets for a fee, without having to build the accompanying infrastructure themselves.","Such lucrative economics have incentivized manufacturers of the mining computers to cash in on the opportunity in the country.","Although the details of how rig manufacturers operate in the country are murky, industry sources that CoinDesk spoke to agree that they do have a vivid presence. These people requested anonymity because they were speaking on a sensitive topic.","Both Bitmain and MicroBT declined multiple requests for comment on this story.","MicroBT is already entrenched in the market, whereas Bitmain is trying to find intermediaries so that it can better serve the market, an industry source in the region said.","Another person said that Bitmain, the world’s largest machine maker, still sells into the Russian market, just through different company names.","Bitmain lists a Moscow office on its website. The firm advertised a meet-up in Russia (CoinDesk was not able to determine which city) on April 28 and was present at a Crypto Summit in Moscow organized in the same month, said another source in the mining industry. Bitmain took down the webpage advertising the meet-up on April 28, but CoinDesk was able to screenshot a message from an admin account in its official Telegram group chat about the event.","A reseller of mining machines contacted by CoinDesk said that both firms offer after-sales services for maintenance and repairs to Russian miners, indicating that they have a presence in the country.","Meanwhile, on MicroBT’s official Telegram group chat, several miners asked about after-sales service in Russia and the admin responded by asking questions, later inviting the miners to message them directly. CoinDesk couldn’t find similar messages on Bitmain group chats.","The fact that the rig makers are still active in Russia, while not illegal under Ukraine-related sanctions, might invite unwelcome scrutiny from authorities in the U.S., where both firms have ramped up operations in recent years as the industry has grown in North America. MicroBT opened a factory in Bellefonte, Pennsylvania U.S., the firm told CoinDesk in a previous interview, and started a pilot project with a local firm for heat reuse systems.","Geopolitical tensions haven’t deterred Russian miners, nor their overseas clients.","Russian entities and individuals have been heavily sanctioned following President Vladimir Putin’s attack on Ukraine. China, where both MicroBT and Bitmain are headquartered, hasn’t followed the U.S. and European Union sanctions.","BitRiver, a Russian entity and the largest hosting provider in Russia, became the first mining entity to be sanctioned by the U.S. government shortly after the invasion, leaving companies like retail-focused Compass Mining scrambling to figure out what to do with their machines. Doing business with the sanctioned entity would be a big risk to any company.","Read more: Sanctioned Bitcoin Mining Firm BitRiver Loses Another Client as SBI Leaves: Sources","European and U.S. companies were largely unphased by the sanctions and continued operating in Russia, CoinDesk has previously reported.","Despite pressure on banking, sanctions may have in fact boosted the Russian mining industry in two ways, wrote CMG in its report.","Firstly, mining offers an alternative revenue stream for power producers who have been hit by the economic downturn. Secondly, it facilitates the conversion of Russian rubles to bitcoin, which can be exchanged globally, unlike Russia’s fiat currency.","Read more: Russia Plans to Mine Crypto for Cross-Border Deals, Says Central Bank","BitCluster’s Arestov said European and U.S. miners might be put off by international sanctions, but miners from China – which has close relations with Russia – “are happy to take their place,” BitCluster’s Arestov said.","Edited by Ben Schiller, Marc Hochstein and Nick Baker.","\n"],"entity":[{"type":"Sanctioned Bitcoin Mining Firm BitRiver","content":"ORGANIZATION"},{"type":"U.S. Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ethan Vera","content":"PERSON"},{"type":"$0.055","content":"MONEY"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"Bitcoin Miners Are Starting to Emerge From Brutal Crypto Winter","content":"ORGANIZATION"},{"type":"Sergey Arestov","content":"PERSON"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"Luxor Technologies","content":"ORGANIZATION"},{"type":"Carlisle","content":"PERSON"},{"type":"Moscow","content":"LOCATION"},{"type":"April 28","content":"DATE"},{"type":"Arestov","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"CoinDesk’s Consensus 2023","content":"ORGANIZATION"},{"type":"Elliptic","content":"LOCATION"},{"type":"David Carlisle","content":"PERSON"},{"type":"CMG","content":"ORGANIZATION"},{"type":"Pennsylvania U.S.","content":"LOCATION"},{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Vladimir Putin","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Says Central Bank","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Didar Bekbau","content":"PERSON"},{"type":"President Signs Legislation to Limit Energy Usage of Crypto Mining","content":"ORGANIZATION"},{"type":"Crypto Summit","content":"ORGANIZATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Bellefonte","content":"LOCATION"},{"type":"Cryptocurrency Mining Group (CMG","content":"ORGANIZATION"},{"type":"$0.05","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"},{"type":"$0.08","content":"MONEY"}],"hashtag":["Russia","Mining Week","Mining Week 2023","Bitmain","MicroBT"],"authors":["Eliza Gkritsi"]}