{"summary":"NFT platform Recur has decided to close less than two years after raising $50 million in a Series A funding round.\nThe shutdown will occur in phases, beginning with the disabling of sales on Aug. 18, followed by the cessation of all site functions by Nov. 16.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246477\/recur-to-shut-down-less-than-two-years-after-raising-50-million-in-series-a","publishDate":"2023-08-21T05:35:07","id":1592,"type":null,"title":"Recur to shut down less than two years after raising $50 million in Series A","category":["Metaverse &amp; NFT"],"content":["Recur, the non-fungible token platform, has <a href=\"https:\/\/twitter.com\/RecurForever\/status\/1692633345753002406\" data-v-f87c67ca=\"\">announced<\/a> its decision to shut down less than two years after raising $50 million in a series A funding round.","The announcement details a phased closure of the platform’s functionality, beginning with the disabling of primary and secondary sales from Aug. 18, 2023. New user account creation has been stopped, and all remaining site functions will cease by Nov. 16, 2023.","Recur has provided instructions for users regarding users' withdrawal of NFTs and the cashing out of redeemable balances. A notable aspect of the shutdown process is the migration of metadata of NFTs minted directly on Recur to the InterPlanetary File System — a decentralized storage protocol that enables data to be retrievable.","This migration is expected to ensure that the information related to users’ NFTs will remain accessible even after the platform’s closure.","The decision to close comes after previous fundraising success, including a $5 million seed round and the <a href=\"https:\/\/www.prnewswire.com\/news-releases\/recur-announces-50m-series-a-raise-at-333m-valuation-301375145.html\" data-v-f87c67ca=\"\">$50 million Series A<\/a> funding at a valuation of $333 million. While the specific reasons for the shutdown have not been publicly disclosed, the team <a href=\"https:\/\/twitter.com\/RecurForever\/status\/1692633347145818295\" data-v-f87c67ca=\"\">cited<\/a> “unforeseen challenges and shifts in the business landscape.\"","The NFT market has experienced a downtrend over the last year. The total value of NFT sales on Ethereum has declined from a peak of over $4.9 billion in January 2022 to around <a href=\"https:\/\/www.cryptoslam.io\/blockchains\/ethereum\" data-v-f87c67ca=\"\">$272 million<\/a> in July 2023, according to CryptoSlam."],"hashtag":[]}