{"summary":"At a recent gathering of investors in Miami, skepticism remained high even after finance titan BlackRock's shift toward touting the original cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/15\/there-are-many-bitcoin-critics-left-in-finance-despite-blackrocks-newfound-love\/","publishDate":"2024-04-15T19:40:45","id":15926,"type":null,"title":"There Are Many Bitcoin Critics Left in Finance, Despite BlackRock's Newfound Love","category":["Finance"],"content":["Around the time it turned 15 and following years of scoffing by others on Wall Street, Bitcoin in 2023 won acceptance from one of the most powerful investors in the world, BlackRock. Other traditional finance firms had endorsed the original cryptocurrency, to be sure, but BlackRock's blessing – in the form of filing to create a spot bitcoin ETF and vocal praise from CEO Larry Fink – was widely viewed as a surprising and significant turn of events.","The tone around bitcoin (BTC) seemed to shift among finance professionals – at least some of them – in the aftermath, with more players voicing support.","And, yet, earlier this month at an event in Miami for investment pros, it was clear that a significant swath of the industry continues to have serious doubts about bitcoin.","\"Bitcoin is just an extractive bubble,\" Mike Green, portfolio manager at Simplify Asset Management, said at the recent Miami Investment Masters Symposium. \"It's effectively a mechanism to transfer wealth from one group of individuals to another.\"","That skepticism doesn't translate into Simplify completely ignoring bitcoin, however. It offers customers two funds that are exposed to BTC: the Simplify Bitcoin Strategy PLUS Income ETF and the Simplify US Equity PLUS GBTC ETF, which invests 10% of its assets in the Grayscale Bitcoin Trust (GBTC).","There is demand for bitcoin, so Simplify is meeting that desire, Green said. But this doesn't change his overall view that bitcoin is simply a mechanism to transfer wealth. \"No value has been created and nothing has been done per se.\"","There are signs of broader reluctance. For spot bitcoin ETFs, even though they have seen unprecedented demand for a newly released product, they are not being offered to clients of some wealth management firms, including Vanguard and State Street. Only about half a dozen prominent firms have disclosed that they let their customers invest in the funds and experts believe that most of the volume for the bitcoin ETFs comes from retail investors.","Banking giant Goldman Sachs, though it plays a key role for BlackRock's iShares Bitcoin Trust (IBIT) as a so-called authorized participant, earlier this month reiterated that it doesn’t believe bitcoin belongs in investment portfolios and that its clients are not interested in the cryptocurrency.","Stone X Group's chief strategist, Kathryn Vera, gave a presentation at the Miami conference, stating that bitcoin won't be a reserve currency – economics jargon for a currency like the dollar, euro or yuan held by central banks to support global trade and finance – \"in her lifetime.\" A key reason why the largest conventional currencies are cornerstones of finance is this reserve currency status.","Gold fan and economist Peter Schiff called bitcoin gambling money that has no use in the present or the future. \"This whole thing is a big bubble,\" he said at the event, as bitcoin was trading around a new record high above $73,000. \"It's going to collapse.\"","While some asset managers have picked their side and stand firm on their opinions, others simply aren't at the point yet where they are forced to consider the asset class as an investment – despite the recent creation in the U.S. of 11 bitcoin ETFs from BlackRock, Fidelity, Grayscale and others designed to make it easier for investors to buy bitcoin.","Green said his firm isn't seeing much interest in bitcoin from its clients – though he concedes that might partly be the firm's fault as it doesn’t actively market the cryptocurrency or advise clients to invest in it.","Another asset manager, who asked not to be named, said that the firm is making its clients so much money that it simply doesn't need bitcoin, especially because the crypto asset requires a level of forecasting that all of the other trades that the firm makes don't. \"Business is booming with the focus we have,\" the manager said.","According to Green, a lot of his peers aren't willing to put in the work to really understand the technologies behind bitcoin and other crypto assets, especially when there is no pressure from clients to do so and because speaking negatively about the cryptocurrency or expressing skepticism or speculation in the space doesn't seem to have any negative impact, he said.","As a result, there is a tremendous amount of disinformation circulating in the industry.","\"There is a lack of interest in really understanding it because it's really hard to pursue something like bitcoin whole-cloth,\" he said.","Edited by Nick Baker."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$73,000","content":"MONEY"},{"type":"Green","content":"ORGANIZATION"},{"type":"Peter Schiff","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"Simplify US Equity","content":"ORGANIZATION"},{"type":"Miami Investment Masters Symposium","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Simplify Asset Management","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Mike Green","content":"PERSON"},{"type":"Kathryn Vera","content":"PERSON"},{"type":"Group","content":"ORGANIZATION"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":["BlackRock","Asset Management","Bitcoin","Bitcoin ETF"],"authors":["Helene Braun"]}