{"summary":"As President Xi called on China to seize blockchain opportunities, industry heavyweights are already leading hundreds of enterprise projects.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/10\/28\/from-banking-giants-to-tech-darlings-china-reveals-over-500-enterprise-blockchain-projects\/","publishDate":"2019-10-28T02:30:01","id":15936,"type":null,"title":"From Banking Giants to Tech Darlings, China Reveals Over 500 Enterprise Blockchain Projects","category":["Markets"],"content":["The Takeaway:","","","As President Xi Jinping called on his countrymen to seize opportunities in distributed ledger technology, China’s industry heavyweights were already leading hundreds of enterprise blockchain projects.","In total, the identities of 506 such projects have been published by the Cyberspace Administration of China, which, since January, has required every entity developing blockchain technologies to register their projects for further supervision.","The information released so far is from two lists - 197 projects named in March and 309 in October - and offers a trove of insight into hundreds of enterprise blockchain projects under development in China.","More lists could be published, but these large tranches already include some of the largest Chinese state-owned banks and commercial tech conglomerates, as well as the many government and public sector projects that define China’s economy today.","Many other potentially important developments were partially disguised by listing the projects under the names of related subsidiaries. In addition, there are many known blockchain projects absent from the two lists, but could likely be published in another installment.","In total, CoinDesk is able to reveal thumbnail sketches of several enterprise blockchain projects that could change the landscape of the Chinese technology industry.","Trade finance, asset management, cross-border payments and supply chain financing were the four most common use cases in the financial service industry projects included in the two lists.","Six banks, including two major state-owned national banks and four local banks, have filed for 14 blockchain projects.","Industrial and Commercial Bank of China (ICBC), the world’s largest bank by assets, and Ping An Bank, the banking arm of Ping An Insurance, have registered two blockchain projects each.","Ping An Bank disclosed a data analytics SAS plat­form and a blockchain-dri­ven vot­ing and decision-making sys­tem. The bank became the first Chinese financial institution in the R3 enterprise blockchain alliance in 2016, and has adopted a blockchain network called FiMax to improve data-sharing and privacy processes. Its goal was to increase efficiencies in asset-backed securities transactions, and tackle challenges in supply chain financing.","Union Pay, the Chinese counterpart of Visa or Mastercard, filed two blockchain services, including a digital certificate application and a blockchain-based tracking platform for cross-border capital transfers.","ICBC Xi Blockchain Ser­vice and ICBC Fi­nan­cial Ser­vices are blockchain projects to facilitate transactions for the bank's clients. ICBC partnered with China’s central bank, the People's Bank of China, in 2017 to conduct research on blockchain technology, and launched its blockchain-based financing platform for small and medium-sized companies.","While not on the list, two major banks had recently published much more detail on their blockchain projects, as reported earlier by CoinDesk.","China Construction Bank (CCB), one of the four major Chinese commercial banks, is revamping its trade finance blockchain-based platform, as trading volume on the platform reached $53 billion. CCB’s projects included facilitating financial transactions such as factoring and forfaiting, providing immediate cash for exporters in exchange for short-term receivables.","Also, the Bank of China completed its first international money transfer to South Korea in dollars via its patented blockchain payment system last year.","On the list is Baidu, the Chinese search engine giant, which released its blockchain white paper, detailing its patented Xuper Chain that aims to provide foundational infrastructure for blockchain services.","The company had also launched a decentralized application, or dapp, game called Letsdog last August, similar to the internet sensation CryptoKitties. The project is registered through Baidu’s blockchain subsidiary Duxiaoman on the October list.","Another two Baidu projects were included in the March list, including Baidu Blockchain Engine providing cloud services and Token that leverages blockchain to protect digital content intellectual property rights.","Alibaba Group is in a perpetual race for No. 1 against Baidu, Tencent and internet conglomerate Huawei for which of the four will develop the most advanced blockchain cloud services in China.","Each company filed information about its blockchain cloud services, according to the registration data. All four of their blockchain white papers stressed the importance of developing blockchain-based cloud services as infrastructure providers for third-parties.","Alibaba has been especially active, topping another list - the most patent applications focused on blockchain-related technologies - with a total of 90 projects, surpassing IBM and Bank of America.","Tencent, parent of messaging app WeChat, has been building a suite of blockchain services since their first white paper was released in 2017. On the list, the internet giant filed its registration for Tencent Blockchain and Tencent Cloud TBaaS Blockchain.","The company’s TrustSQL platform is designed as a three-part system with the core chain layer, a product and service layer, and an application layer to provide digital asset management and authentication.","The company partnered with Intel to develop a blockchain for Internet of Things applications, while starting to test blockchain financial applications with the Bank of China in 2017.","The Chinese government, itself, was heavily involved in many of the large-scale projects registered on the lists, from communication backbones to innovations in legal and land development use cases.","Union Pay, China’s answer to VISA-Mastercard, was mentioned on the list, with a cross border payment project.","This month, Chinese media reported the start of a test phase of a Union Pay project, partnered with five other institutions, including China Mobile and the State Information Center, to launch the Blockchain Services Network (BSN), a nationwide blockchain infrastructure project envisioned to be the “Android or Apple’s IOS system” for the blockchain.","Yifan He, the CEO of Beijing Red Date Tech, one of the six institutions, said at the announcement that BSN is already being tested at 55 cities in China, plus Singapore.","The network claims to be more cost-effective than cloud services currently provided by Tencent, Huawei or Alibaba.","There were also many examples that the government is directly using blockchain to provide services, from legal arbitration, tax collection to daily management of a compensation tracking platform for relocated farmers.","The Beijing and Guangzhou Internet Court each registered their blockchain-based platform. The first Internet court in China, and the world, opened in Hangzhou, in southern China, in 2017.","These Internet courts are already authorized to process certain Internet-related cases such as online financing, online IP disputes and small loan contract disputes. The courts migrate every step of the legal process online, including prosecution, settlement, evidence presentation and verdict delivery.","legalXchain","registered three blockchain services that are based on legalXchain, LegalFabric and the Hyperledger. The firm claimed to be a blockchain technology company designing projects specifically for the legal sector in China, according to its website.","Another unique project is for a “new city” being built over swampland, 60 miles southwest of Beijing. As that city surpasses 21 million inhabitants, a decision was taken to build Xiong’an, meaning “brave and peace,” by purchasing land from local farmers. Those transactions will now all be made via blockchain to keep the transparent and organized. .A recent Brookings Institute report said that $380 billion is going into the new city. .","One of the three projects on the list for the new city is called the Xiong’an Blockchain Land Compensation Distribution Platform, which would be responsible for distributing financial subsidies for relocated residents in the area.","More blockchain services used for the government included Blockchain Electronic Invoice, for the State Administration of Taxation Shenzhen branch, and Cross-Border Transactions Platform, for the State Administration of Foreign Exchange.","Many more names and projects were identified on the list, although it was hard to completely identify all of them.","Two more from well-known companies include one from video streaming company iQIYI - China’s answer to Netflix - which filed that it is using Baidu Xuper Chain Supernode to improve its streaming services. Another was from BGI, one of the largest life science and genomics companies in China, which registered BGI Blockchain BaaS Platform to conduct genetic analysis.","A third company, with a very interesting use case was from Jingde Porcelain, with a smart blockchain project to authenticate its porcelain products; the company is famous for their blue and white plates and vases.","A fourth project was registered by the Shenzhen Charity Lottery Distribution Center, to verify winning tickets. And a fifth is an invoice processing platform on the blockchain for Midea, a large consumer appliances manufacturer.","Image via Shutterstock"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"$380 billion","content":"MONEY"},{"type":"Blockchain Land Compensation Distribution Platform","content":"ORGANIZATION"},{"type":"BGI","content":"ORGANIZATION"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Xi Jinping","content":"PERSON"},{"type":"State Administration of Taxation Shenzhen","content":"ORGANIZATION"},{"type":"$53 billion","content":"MONEY"},{"type":"ICBC Xi Blockchain Ser­vice","content":"ORGANIZATION"},{"type":"Cyberspace Administration of China","content":"ORGANIZATION"},{"type":"China Construction Bank (CCB","content":"ORGANIZATION"},{"type":"BSN","content":"ORGANIZATION"},{"type":"Ping An Bank","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Beijing","content":"LOCATION"},{"type":"Jingde Porcelain","content":"PERSON"},{"type":"Alibaba Group","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Guangzhou Internet Court","content":"ORGANIZATION"},{"type":"Tencent Blockchain","content":"ORGANIZATION"},{"type":"SAS","content":"ORGANIZATION"},{"type":"Baidu","content":"LOCATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"ICBC Fi­nan­cial Ser­vices","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Blockchain Electronic Invoice","content":"ORGANIZATION"},{"type":"Baidu Blockchain Engine","content":"ORGANIZATION"},{"type":"Hangzhou","content":"LOCATION"},{"type":"Shenzhen Charity Lottery Distribution Center","content":"ORGANIZATION"},{"type":"BGI Blockchain BaaS Platform","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Brookings Institute","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Baidu Xuper Chain Supernode","content":"LOCATION"},{"type":"Midea","content":"LOCATION"},{"type":"Blockchain Services Network (BSN","content":"ORGANIZATION"},{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Commercial Bank of China (ICBC","content":"ORGANIZATION"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"Huawei","content":"ORGANIZATION"},{"type":"Beijing Red Date Tech","content":"ORGANIZATION"},{"type":"Intel","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"State Information Center","content":"ORGANIZATION"},{"type":"China Mobile","content":"ORGANIZATION"},{"type":"State Administration of Foreign Exchange","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Tencent Cloud TBaaS Blockchain","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Security","Identity","Technology","Insurance","Internet of Things","News","Supply Chain","Asia Pacific","Energy","Technology News"],"authors":["David Pan"]}