{"summary":"Bitcoin is on the rebound entering Wednesday, and three trading indicators suggest the charts are changing in the crypto asset's favor.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/07\/18\/3-signs-bitcoins-move-above-7k-might-just-hold\/","publishDate":"2018-07-18T02:56:00","id":15932,"type":null,"title":"3 Signs Bitcoin's Move Above $7K Might Just Hold","category":["Markets"],"content":["The world's largest cryptocurrency by market capitalization exploded in price Tuesday, jumping $600 in 30 minutes to break away from what had been suppressive bear market conditions.","But entering Wednesday, bitcoin is changing hands at $7,370 and showing signs it might continue its ascent. In fact, when viewed on longer timeframes, it appears that the trend is changing, this time in favor of the always-optimistic bulls.","But just how reliable is this move?","So far, there are three general tools traders are using to analyze the markets in a quest to confirm that the change in trend will have staying power.","Exponential Moving Averages (EMA) act like signals that provide crucial insights into the asking bid as well as the momentum behind each major move.","As such, they can be used to confirm or deny a trend change by analyzing the position of the EMA in relation to the current price. The longer the EMA, the more significant the move is as it has more data points to collect from and a greater range of price history.","Stepping back, the number 55 is a Fibonacci number that technical traders use in relation to other Fibonacci sequences including 8,11 and 21 (usually skipping 34). It can provide crucial information about the current health of a particular stock or asset, and works best when viewed from longer time-frames.","For example, from May 11 to July 16, the 55 EMA for bitcoin was above the price acting as a barrier or resistance to any major moves past $6,860 (see positioning of red EMA).","Until yesterday, the position of the exponential moving average remained unchallenged, solidifying the bearish perspective over a two-month period.","However, the recent bitcoin surge forced the EMA below the current price, confirming that the breakout is both significant and bullish in the mid-term.","Extensions and retracements are used to predict the levels of resistance and support for an underlying stock or asset. (You can use the Fibonacci tool to identify where the most likely region of major resistance or support lies).","To draw an extension for bitcoin, take the cursor to the bottom of the previous significant low (June 26) and draw it up toward the significant two month high seen May 5th.","Above is an example of specific resistances\/supports where historically, they have held and broken through. Any major moves above the neutral Fibonacci extension at 0.5 would add confirmation to the bullish bias for the short term.","If however, bitcoin is unable to break that key resistance, a retracement would be more likely whereby the price would need to come down as conditions become overbought.","Prices generally retract or extend between the 38.2 percent, 50 percent and 61.8 percent Fibonacci retracement levels and are best used in conjunction with other technical indicators such as the exponential moving averages previously mentioned or trading volume.","Another telling sign for traders is the total volume for an underlying stock or asset, so the amount of bitcoin that changed hands in a 24-hour period can be a crucial tell into whether or not the move above $7,000 is meant to last.","Above, we see how volume for bitcoin reached a 3-month high yesterday, almost doubling the day prior.","As volume increases over a general period, the price action becomes stronger as there is more liquidity and greater buy\/sell opportunities to be had than in a low liquidity market.","Keep a keen eye on the volume as it is one of the greatest indicators in determining the strength of a particular move in relation to the amount traded.","Disclosure: The author holds USDT at time of writing.","Suspension bridge via Shutterstock"],"entity":[{"type":"Fibonacci","content":"LOCATION"},{"type":"$6,860","content":"MONEY"},{"type":"$600","content":"MONEY"},{"type":"61.8 percent","content":"PERCENT"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"EMA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$7,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"June 26","content":"DATE"},{"type":"$7,370","content":"MONEY"},{"type":"38.2 percent","content":"PERCENT"},{"type":"July 16","content":"DATE"},{"type":"May 5th","content":"DATE"},{"type":"50 percent","content":"PERCENT"},{"type":"May 11","content":"DATE"}],"hashtag":["price-news","Bitcoin","Markets","Features","Markets News"],"authors":["Sebastian Sinclair"]}