{"summary":"The Federal Reserve's inspector general studied the bank’s collapse and concluded the Fed’s examiners failed to quickly flag its problems and managers were “ineffective.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/10\/02\/fed-report-silvergate-bank-got-fatally-ensnared-in-crypto-while-examiners-shrugged\/","publishDate":"2023-10-02T18:40:08","id":15931,"type":null,"title":"Fed Report: Silvergate Bank Got Fatally Ensnared in Crypto While Examiners Shrugged","category":["Policy"],"content":["Silvergate Bank transformed from a community lender to a high-flying crypto bank without its Federal Reserve examiners raising an alarm, according to a report from the Federal Reserve’s Office of Inspector General (OIG), allowing the bank to take risks that would turn fatal.","Arising from obscurity, Silvergate was a go-to bank for the digital assets sector that was treated with suspicion by larger, more traditional institutions. For a decade, the bank largely operated as a single-industry lender, and the OIG concluded that this change in course should have required a different type of registration that its government supervisors failed to demand. And there were several problems that Fed examiners were too slow to deal with as the bank headed toward its voluntary wind-down in March after last year’s crypto mayhem shattered its customers.","“Examiners should have taken more aggressive and decisive supervisory action to escalate several issues in light of the bank’s unchecked growth; its volatile funding and deposit concentrations; and its significant, pervasive, and persistent weaknesses in key control functions,” the report found.","Under the banking regulations, Silvergate should have filed an application with the Fed when it pivoted into full-time crypto, the OIG concluded. But the California bank’s examiners had decided that because it was still taking in deposits and making loans to its customers, Silvergate remained a standard commercial bank and was never pushed to set up new risk protections to match its overhauled strategy.","Silvergate’s problems also extended to its “ineffective” senior management that was beset by nepotism, according to the OIG, which issued its findings last week. The report didn’t detail the nepotism allegations, but former CEO Alan Lane had taken heavy criticism for employing multiple members of his family in senior roles.","“The bank’s corporate governance and risk management capabilities did not keep pace with the bank’s rapid growth, increasing complexity, and evolving risk profile,” the report concluded.","Its move to voluntarily liquidate means Silvergate didn’t technically fail, and no government intervention was required to pay back depositors.","The OIG made several internal recommendations for how Fed examiners should handle similar situations in the future, though, and the Federal Reserve Board of Governors has agreed to develop new and expanded guidance on rapidly growing banks that change their focus.","Read More: How Silvergate’s Crypto Collapse Differed From Silicon Valley Bank’s: No Bailout"],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Alan Lane","content":"PERSON"},{"type":"OIG","content":"ORGANIZATION"},{"type":"Federal Reserve’s Office of Inspector General (OIG","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"March after last year","content":"DATE"},{"type":"How Silvergate’s Crypto Collapse Differed From Silicon Valley Bank","content":"ORGANIZATION"},{"type":"Federal Reserve Board of Governors","content":"ORGANIZATION"},{"type":"Silvergate","content":"PERSON"}],"hashtag":["Regulations","Silvergate Bank","Banking","Federal Reserve","California"],"authors":["Jesse Hamilton"]}