{"summary":"With TradFi moving in, the crypto industry is finally taking its place as the future of finance, says Kelly Ye, at Decentral Park Capital.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/12\/20\/tis-the-season-to-be-jolly-about-the-crypto-market-in-2024\/","publishDate":"2023-12-20T16:45:00","id":15930,"type":null,"title":"Tis the Season To Be Jolly About the Crypto Market in 2024","category":["Finance"],"content":["As 2023 concludes, the crypto market emerges from failed ventures and outright fraud, embracing real progress toward mainstream adoption. As global tensions rise and regional banks falter, bitcoin reclaims its status as a reliable store of value.","Meanwhile, TradFi giants filing for Bitcoin spot ETFs and tokenizing real world assets (RWAs) signify the convergence of the two worlds. With crypto now 15 years old, the year 2024 holds the promise of being a defining moment in its evolution.","The recent surge in Bitcoin prices serves as a prelude to an anticipated bull market of 2024. And several other factors align to set the stage for a crypto resurgence.","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","Macro Factors: Global liquidity conditions have been on the upswing since October 2023. The Fed’s change in tone during the December FOMC confirmed market expectation of potential rate cuts in early 2024, creating more favorable conditions for risky assets.","Mainstream Adoption: The advent of spot ETFs (expected to be approved as early as January) and tokenization represents a pivotal moment in crypto's integration into the broader financial landscape. Allocating a small percentage of US wealth management assets to Bitcoin ETFs could yield significant ETF sizes. Simultaneously, DeFi protocols are diversifying their yield sources into RWAs like U.S. Treasuries, attracting more crypto-native capital.","Technological Advancements: Major upgrades in blockchain scalability and UI\/UX development are breaking barriers in the transition from Web2 to Web3. If Web3-based apps offer the ease of use found in Web2, coupled with the advantages of self-sovereignty, user migration is inevitable.","Is crypto heading towards mass adoption, or experiencing irrational exuberance? Three plausible scenarios for 2024 emerge:","Cambrian Explosion: BTC could surpass its all-time high (above $69,000) in January 2024, with selected sectors witnessing price actions reminiscent of the DeFi summer of 2021.","Steady Growth: BTC might follow similar pattern as 2023, with 20-50% rallies driven by positive news and intermittent sideways movement, culminating a 50-100% return.","Reset and Rebuild: Major market corrections could occur, pushing BTC prices below $30,000.","The first two scenarios appear more likely, supported by macro tailwinds, mainstream adoption and technology advancements. Moreover, long-term BTC holders continue to accumulate, and stablecoin supply has rebounded, indicating potential external capital to flow into crypto.","Looking forward, past cycle winners might not lead the charge this time. Successful projects often boast a robust community of developers and users, such as the exciting themes below:","Solana Renaissance: Solana, riding high behind the FTX shadow, has established a flying wheel effect, attracting developers and users with its high-performance blockchain. A mini-DeFi summer in Solana is evident as its Dex monthly trading volume surges almost 10-fold this year.","DeFi 2.0: Despite being a mature sector in crypto, DeFi remains ripe for innovation. Derivative DEXs, with enhanced settlement times and lower costs, could challenge CEX dominance in that field. Tokenized assets and re-staking could make DeFi yield attractive again compared to US Treasuries.","Web3 Gaming: Past VC investments in Web3 gaming are poised to bear fruit. Platforms like IMX are gaining a network effect, providing the technology and resources for a thriving Web3 gaming community.","2024 is destined to be an exciting time for crypto investors and builders!","Edited by Benjamin Schiller."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"October 2023","content":"DATE"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"US Treasuries","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$69,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"summer of 2021","content":"DATE"},{"type":"Dex","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Opinion","Crypto Long & Short","TradFi","Spot etf","Real World Assets","Bitcoin Price","Adoption","DeFi"],"authors":["Kelly Ye"]}