{"summary":"Dogecoin has set all-time high after a long period of stagnation. Yet the joke currency's founder worries the rally is a sign of market excess.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/01\/04\/dogecoin-market-cap-hits-1-billion-to-its-creators-dismay\/","publishDate":"2018-01-04T23:37:52","id":15933,"type":null,"title":"Dogecoin Market Cap Hits $1 Billion, to Its Creator's Dismay","category":["Markets"],"content":["Dogecoin, the parody coin named for an internet meme featuring a Shiba Inu dog, has broken off the leash.","Nearly forgotten since its heyday in 2014, over the past month the cryptocurrency's price has increased more than 400 percent, setting a new all-time high Thursday above $0.01.","This price surge pushed dogecoin's market capitalization above $1 billion, data from CoinMarketCap shows.","Yet while more than $101 million in trading volume was seen in dogecoin over the past 24 hours, the creator of the project is worried this is a sign of broader market excess.","\"The fact that most conversations happening in the media and between peers focus on the investment potential is worrying, as it draws attention away from the underlying technology and goals this movement was based [on],\" said Jackson Palmer, the founder of the cryptocurrency who left the team in 2015.","He continued:","But while current dogecoin developers seemed equally surprised by the momentum, they showed more enthusiasm.","\"To me, this proves that we don't need shiny features or a ton of innovation and even with a conservative – and in my own case completely distracted – development team for a boom,\" said developer Patrick Lodder.","Max Keller, another dogecoin developer, echoed that sentiment, saying, \"It's a little scary when you work on software that powers a billion dollar network. This is quite the responsibility. And also one of the main reasons why we are so reluctant to just slap any 'innovative' tech into the reference client. Still, I am proud of what we achieved and thankful to be part of such a great community.\"","According to data from CoinMarketCap, the price of dogecoin started to climb around May 2017 after years of stagnation. Technology development on the tongue-in-cheek token has proceeded in fits and starts, namely because its developers are all volunteers, contributing to it in their spare time.","Bailey Reutzel contributed reporting.","Dog image via CoinDesk's archive."],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Patrick Lodder","content":"PERSON"},{"type":"Bailey Reutzel","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$0.01","content":"MONEY"},{"type":"400 percent","content":"PERCENT"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$101 million","content":"MONEY"},{"type":"May 2017","content":"DATE"},{"type":"Max Keller","content":"PERSON"},{"type":"Jackson Palmer","content":"PERSON"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["Dogecoin","News","Markets","All-Time High","Markets News"],"authors":["Wolfie Zhao"]}