{"summary":"The former CoinDesker has written an account of Sam Bankman-Fried's downfall, and longevity of decentralized finance.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/04\/27\/veteran-crypto-reporter-brady-dale-discusses-new-ftx-book\/","publishDate":"2023-04-27T13:41:53","id":15944,"type":null,"title":"Veteran Crypto Reporter Brady Dale Discusses New FTX Book","category":["Consensus Magazine"],"content":["Brady Dale is a crypto journalist and a former CoinDesker (now with Axios) with a book coming out about Sam Bankman-Fried and the fall of FTX. He said the book, “SBF: How the FTX Bankruptcy Unwound Crypto's Very Bad Good Guy,” published by Wiley, is as much a success story about decentralized finance, or DeFi – the corner of the crypto economy that continued to lend, issue stablecoins and enable users to swap tokens even after their centralized counterparts choked.","This article is excerpted from The Node newsletter, which will send two editions daily during the Consensus 2023 conference running down the biggest news from the event. You can subscribe to get the full newsletter here or register to attend or livestream Consensus 2023 here.","CoinDesk caught up with Dale during Consensus 2023 in Austin, Texas, to discuss unknown details about the FTX story, his thoughts on crypto “Shelling points” and why he thinks Dogecoin should rank alongside Bitcoin and Ethereum as crypto’s canonical chains.","What is one thing you could say about Sam Bankman-Fried or FTX that people cannot easily Google?","It is very much my opinion that SBF is not nearly so geeky or awkward as he's made out to be. I described him as a geek with swagger in my book. It sounds like he had enough charisma that his whole company was driven largely by his vision and that was true from the very start, well before he commanded hundreds of millions of dollars. That's not something a person without the self-confidence to look people in the eyes can pull off.","You've said in many ways your SBF book is as much about DeFi. Is it premature to say that DeFi has won, even after decentralized exchanges and decentralized lenders fared much better than centralized alternatives?","DeFi hasn't won, for sure, but it is fine and it remains fine. That's not to say it's solving all the problems the world needs it to solve yet, but very nearly all the centralized crypto lenders went under, and none of the blue-chip DeFi lenders went under. \"DeFi Summer\" was crucial to the FTX story because the wild returns of that year brought Sam out into the public and led him to taking a broader leadership role in the crypto world. The first time many of us really experienced him as a character in the space came when he saved SushiSwap in August 2020.","Bloomberg's Matt Levine said that crypto will always be a place for people with confidence games to play. Is the industry due for another Sam Bankman-Fried?","There will be a lot more con men, but there have always been con men. You can argue that crypto put steroids into the illusory side of capitalism, but you could also say that crypto is a microscope that exposes how illusory capitalism has always been. When I say \"brands,\" many people might think of Coke and Pepsi: two famous opposed brands that are basically the same product. And yet somehow those two separate words are worth piles of money. That kind of thing is everywhere. One could argue that crypto is less a new illusion and more a way to dispel illusions.","You've covered blockchain tech quite extensively. What do you think of the multi-chain model? Are there meaningful differences between consensus algorithms, and do you think we've seen the last of the different types of blockchain architectures we can expect?","You'd be crazy to ever bet that innovation will stop.","Say more.","A big idea underlying my reporting and this book is that crypto technology is really more of a Schelling point. It's not the thing. The thing is people unifying around a shared set of ideas that are instantiated by a coin. That's why Ethereum can change from proof-of-work to proof-of-stake and still be Ethereum. It doesn't matter what the security model is. What matters is which coins Ethereum's users agree are actually ETH.","See also: Ethereum's Political Philosophy Explained | Opinion","Last year, I used to say that the only two blockchains we really knew mattered were Bitcoin and Ethereum. Now, though, I put Dogecoin on that list, too. To me, Dogecoin is the chain that said: A story, a character, a concept can have a value, and if a community buys into that character and collaborates in a distributed way to make the idea bigger, the value of the concept will grow and so its coin will grow. Dogecoin really brought that home. It's not just about DOGE, it's about that whole notion of collaborating around a concept, and that's why my bet is Dogecoin will be the comeback kid of blockchains again and again, for some time to come.","In three words or less, what is your outlook on the U.S. crypto industry?","It's not over.","Edited by Mark Nacinovich."],"entity":[{"type":"Coke","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"Dogecoin","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Wiley","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Pepsi","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Dale","content":"PERSON"},{"type":"Matt Levine","content":"PERSON"},{"type":"Ethereum's Political Philosophy Explained | Opinion","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Mark Nacinovich","content":"PERSON"},{"type":"Brady Dale","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Opinion","Brady-Dale","Interview","Sam Bankman-Fried","Consensus 2023"],"authors":["Daniel Kuhn"]}