{"summary":"Он-чейн-резюме предоставляет потенциальным работодателям Web3 доказательство вашего опыта в Крипта, показывая ваше реальное участие и активность в этом секторе.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/ru\/learn\/what-is-an-on-chain-resume\/","publishDate":"2022-06-28T15:11:51","id":15942,"type":null,"title":"Что такое онлайн-резюме?","category":["Learn"],"content":["Если вы хотите работать в Крипта, вам может понадобиться нечто большее, чем просто традиционное резюме, чтобы получить работу. Многие вакансии потребуют, чтобы вы продемонстрировали свой опыт и навыки работы с Криптовалюта , невзаимозаменяемыми токенами ( NFT ) и другими цифровыми активами, в зависимости от должности. Вот тут-то и приходит на помощь онлайн-резюме.","Хотя есть сходство с традиционным резюме, онлайн-резюме по-другому отражает ваш профессиональный опыт.","Эта статья является частью серии CoinDesk «Будущее работы».","Традиционное резюме — это документ, в котором представлен обзор вашего профессионального опыта, например, истории работы, образования и специальных навыков.","Но если вы хотите получить работу в Крипта, резюме в сети может оказаться более важным. Особенность Крипта в том, что ее действия видны в блокчейнах , в которых вы участвуете, и поэтому, если вы хотите работать в секторе NFT, вы можете указать NFT, которые вы отчеканили на торговой площадке NFT OpenSea, ваш PFP (изображение профиля) в Твиттере или адрес земли, которую вы купили в метавселенной, например, The Sandbox .","Он-чейн-резюме — это журнал вашей исторической деятельности, хранящийся в сети блокчейнов , такой как Ethereum ( ETH ), который подчеркивает ваш опыт, транзакции и навыки. Это считается контентом Web3 .","Ваше онлайн-резюме может быть таким же простым, как кошелек или кошельки, содержащие транзакции для проверки вашей активности в блокчейне. Эти действия демонстрируют, что вы «занимаетесь Крипта», а также ваш опыт работы с различными токенами и проектами, который можно рассматривать как более ценный, чем традиционное резюме, в котором указана ваша квалификация.","Читать дальше: Что нужно знать и делать, чтобы получить работу в Крипта","Создание онлайн-резюме должно быть адаптировано к работе, которую вы хотите получить. Ваше онлайн-резюме на работу в качестве разработчика на платформе ставок децентрализованных Финансы ( DeFi ) будет сильно отличаться от ONE , которое сосредоточено на получении работы в разработчике игр для зарабатывания денег .","Подумайте о нише в Технологии блокчейна, в которой вы хотите работать. Составьте список потенциальных видов деятельности, связанных с блокчейном, которые могут поддержать ваш авторитет в этой нише. Например, если вы решите стать аналитиком рынка Bitcoin ( BTC ), вы можете сосредоточиться на покупке и продаже Bitcoin в своем кошельке.","Две вещи, с которых большинству людей следует начать при создании онлайн-резюме, включают в себя:","Существует множество вариантов создания своего онлайн-резюме, и транзакции основаны T только на Ethereum. Вот несколько идей, которые помогут вам начать свой путь к развитию навыков для конкретных ролей в Крипта .","Если вы хотите проконсультировать по вопросам инвестирования в Крипта , торговля на децентрализованной бирже (DEX) — отличное занятие. Вы можете обменять Solana ( SOL ) на Binance Coin ( BNB ), которая T является собственным активом Ethereum.","Популярные DEX включают Sushiswap, PancakeSwap и Uniswap . Торгуя на DEX, вы можете продемонстрировать свое активное участие в DeFi.","Вы можете создавать цифровые носители, такие как изображения, музыка и другие цифровые форматы, для конвертации в NFT. Аналогичным образом вы также можете начать сбор NFT в своем кошельке.","Вы можете легко отчеканить ONE из своих работ на OpenSea , крупнейшей торговой площадке NFT в сети Ethereum . Еще один хороший вариант — Solanart , еще одна крупная торговая площадка NFT в сети Solana .","Глубокие знания о продукте или услуге необходимы для того, чтобы стать разработчиком в этой отрасли. Ставки или получение вознаграждений за хранение определенных криптовалют могут помочь вам завоевать доверие как разработчика программного обеспечения для блокчейнов. Вы можете делать ставки на популярные криптовалюты на таких платформах, как Binance, Крипта.com и Kraken.","Понимание математических формул вознаграждений и процентов демонстрирует ваши знания в области ставок.","Криптовалюты считаются активами с высоким риском и высокой прибылью. Помещение вашей криптовалюты в хранилище Maker покажет потенциальным работодателям ваш опыт работы с рисками. Пользователи могут внести ONE тип Криптовалюта в качестве залога в хранилище Maker , чтобы получить кредит, выплачиваемый в Dai. Эти транзакции помогают продемонстрировать ваш опыт банковского обслуживания DeFi.","Предоставляя кредиты в криптовалюте на таких платформах, как AAVE и Compound , вы предоставляете доказательство другой формы торговли для своего онлайн-резюме. Если вам интересно, вы можете поэкспериментировать с кредитованием, чтобы заработать проценты.","Эти типы транзакций также демонстрируют знакомство с DeFi.","Кроме того, вы можете воспользоваться услугами, которые помогут вам создать онлайн-резюме и сэкономить время, например:","Технологии блокчейна постоянно развивается, и изучение новых видов деятельности, которые можно включить в свое онлайн-резюме, показывает, что вы учитесь и растете, поскольку мир Крипта продолжает расширяться.","Читать дальше:Учитесь, чтобы зарабатывать, двигайтесь, чтобы зарабатывать: как зарабатывать Крипта новыми способами","Поскольку онлайн-резюме является общедоступным и неизменяемым, было бы разумно отделить ваше онлайн-резюме от кошелька портфолио. Вы же T захотите заманивать киберпреступников и ставить под угрозу безопасность своих труднозаработанных активов.","Наконец, онлайн-резюме T следует рассматривать как единственный формат, который следует отправлять при подаче заявления на работу в индустрии блокчейнов. Фактически, его можно (и, вероятно, следует) использовать в сочетании с традиционным резюме, профилем LinkedIn и портфолио, чтобы укрепить ваш профиль.","Возможно, это медвежий рынок, но в Крипта все еще есть много вакансий.","Крипта может ускорить и удешевить оплату труда работников. Эта статья входит в серию «Будущее сферы труда».","Приняв более открытую и гибкую модель, традиционным фирмам будет легче привлекать таланты и в конечном итоге получить более увлеченную и заинтересованную рабочую силу."],"entity":[{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"PancakeSwap и Uniswap","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["Learn","industry","Beginner","Future of Work Week","Russian"],"authors":["Mike Antolin"]}