{"summary":"Lawyers for Nathaniel Chastain, the former OpenSea head of product, filed a motion to dismiss an indictment against him.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164825\/former-opensea-employee-accused-of-insider-trading-files-motion-to-dismiss-indictment","publishDate":"2022-08-22T11:20:50","id":1594,"type":null,"title":"Former OpenSea employee accused of insider trading files motion to dismiss indictment","category":["LEGAL"],"content":["Lawyers for former OpenSea head of product Nathaniel Chastain filed a motion to dismiss an indictment against him, <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.580756\/gov.uscourts.nysd.580756.19.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">according to court documents<\/span><\/a>.","Chastain was <a href=\"https:\/\/www.theblock.co\/linked\/149685\/former-head-of-product-for-opensea-indicted-after-insider-trading-scandal\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">indicted<\/span><\/a>&nbsp;by a grand jury on wire fraud and money laundering charges in June, after an insider trading scandal.","Chastain is accused of using confidential OpenSea business information to secretly purchase NFTs shortly before they were featured on the company’s homepage. After he bought the NFTs, Chastain allegedly sold them for a profit. He is also accused of conducting purchases using anonymous digital currency wallets and anonymous OpenSea accounts. The company acknowledged the incident in a <a href=\"https:\/\/opensea.io\/blog\/announcements\/employee-information-use-at-opensea\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">blog post<\/span><\/a>.","The defendant’s lawyers argue in the motion that NFTs are neither securities nor commodities, and wire fraud cases require trading in securities or commodities. The lawyers also claim that the government cannot prove whether the specific crypto transactions it cites qualify as financial transactions under money laundering rules.&nbsp;","“The government has brought the instant prosecution using ill-founded applications of criminal law to set precedent in the digital asset space,” Chastain’s lawyers wrote in the motion to dismiss the indictment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June","content":"DATE"},{"type":"Chastain","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nathaniel Chastain","content":"PERSON"}],"hashtag":["OPENSEA"],"authors":["Stephanie Murray","The Block"]}