{"summary":"The U.S. crypto exchange's trading volume declined 44% from the fourth quarter.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/05\/10\/coinbase-q1-revenue-misses-estimate-trading-volumes-fall-from-previous-quarter\/","publishDate":"2022-05-10T20:21:58","id":15946,"type":null,"title":"Coinbase's Q1 Revenue Misses Estimate as Trading Volume Drops, Shares Fall Almost 16%","category":["Finance"],"content":["Coinbase Global (COIN) reported first-quarter revenue that missed analyst estimates, while its overall trading volumes fell 44% from the fourth quarter. Shares fell 15.67% in post-market trading.","Revenue for the first quarter was $1.17 billion, compared with analysts' average estimate of $1.5 billion, according to FactSet. Coinbase also reported a quarterly net loss of $430 million, compared with a profit of $840 million in the fourth quarter.","Trading volume was $309 billion in the first quarter, missing estimates for $331.2 billion and down from $547 billion in the fourth quarter. Monthly transacting users (MTUs) were 9.2 million, compared with 11.4 million in the fourth quarter and analyst estimates of 9.9 million.","For the second quarter, Coinbase said it expects lower MTUs and total trading volume than the figures from the first quarter. The exchange also sees subscription and services revenue to be “similar to modestly lower” in the second quarter compared with the first quarter.","Separately, Coinbase also filed a shelf registration with the SEC, saying in a blog post that “while we have no immediate plans to offer securities at this time, by filing the shelf registration statement now, we will be able to offer and sell securities in the future should we choose to do so.”","Coinbase added the shelf filing gives the company a chance to issue securities in a faster timeframe, potentially a matter of days, giving it the ability to capitalize on volatility or “short windows of favorable market conditions should we choose to do so.”","In a statement accompanying its earnings, Coinbase said that its outlook for 2022 remains largely unchanged and that it will continue to invest significantly in \"building the future of crypto.\"","\"While we are navigating uncertain and volatile markets, we have a decade of experience to draw from and will continue to invest wisely to drive long-term growth,” the company said. “We continue to expect that during a prolonged and stressful scenario for our business, we will aim to manage our 2022 potential Adjusted EBITDA (earnings before interest, taxes, depreciation and amortization) losses to approximately $500 million on a full-year basis.”","Wall Street had been lowering its expectations for Coinbase heading into the earnings release as the exchange previously said it was expecting lower trading volumes in the first quarter because of a drop in crypto asset volatility and macroeconomic factors.","On its earnings call, Coinbase said it is working on connecting its NFT product to its retail app and Coinbase wallet. Additionally, Coinbase said it wants to eventually allow for users to complete NFT drops, mint their own tokens and decentralize the overall NFT experience.","Coinbase shares have fallen 71% year to date and dropped more than 50% in the last month alone as the prices of cryptocurrencies have tumbled.","Read more: Coinbase, MicroStrategy Lead Crypto Stocks Lower in Market Rout","UPDATE (May 10, 20:36 UTC): Updated with additional figures and statements from Coinbase.","UPDATE (May 10, 20:48 UTC): Updated with Q2 guidance from Coinbase.","UPDATE (May 10, 21:25 UTC): Added information about Coinbase's shelf offering registration.","UPDATE (May 10, 22:19 UTC): Added commentary from conference call."],"entity":[{"type":"the second quarter","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"44%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$1.17 billion","content":"MONEY"},{"type":"$331.2 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"$547 billion","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"$430 million","content":"MONEY"},{"type":"FactSet","content":"ORGANIZATION"},{"type":"$840 million","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"71%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$309 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"},{"type":"15.67%","content":"PERCENT"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["Earnings Reports","Coinbase","Coinbase Pro","Trading Volume"],"authors":["Michael Bellusci"]}