{"summary":"TradeLens has attracted a wide variety of entities ranging from port operators and customs authorities to logistics companies and even rival carriers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/08\/09\/94-companies-join-ibm-and-maersks-blockchain-supply-chain\/","publishDate":"2018-08-09T11:00:03","id":15940,"type":null,"title":"94 Companies Join IBM and Maersk's Blockchain Supply Chain","category":["Markets"],"content":["IBM and shipping giant Maersk have recruited a sturdy crew for their global trade blockchain platform.","Revealed Wednesday, the companies have already signed up 94 firms for the platform since it was spun off from Maersk in January. They have also finally given it a name: TradeLens.","Leveraging Maersk's leviathan-like scale, TradeLens has attracted a wide variety of entities, ranging from dozens of port operators and customs authorities to logistics companies and even rival ocean-going carriers, such as Pacific International Lines, all of whom have been testing the platform.","The pilot stage now complete, TradeLens is available for participation through an early adopter program and is expected to be fully commercially available by the end of this year. ","And to drive home the message that TradeLens is an open and neutral platform, IBM and Maersk have updated their marketing strategy, now describing the project as \"joint collaboration\" rather than a joint venture.","\"At the time of the launch, we wanted to be clear that we were not offering a bespoke Maersk- or IBM-only solution,\" Michael White, head of global trade digitization at Maersk, told CoinDesk ","While Maersk and IBM remain the only two shareholders, and both invested in the technology and jointly own the IP, White emphasized it is completely open to ecosystem participants.","\"It was never about a joint venture,\" he said, although the Maersk press release for the launch described it as such.","But an IBM spokesperson said the original 49\/51 percent ownership split will no longer apply under the collaboration model the two are now going to market with, in response to feedback from the industry.","Both IBM and Maersk will sell access to the TradeLens platform. The selling party will contract with the customer and receive all the fees and revenue rather than sharing it with the other partner, the IBM representative added.","This new model allows them to bring the solution to market faster, and be more flexible than the previously planned joint venture model, the spokesperson said.","TradeLens is built on the IBM Blockchain platform, which uses the open source relative of Linux, Hyperledger Fabric, and this presents a possible interplay with other IBM and Hyperledger projects.","\"We have architected all of these solutions so that it's very easy for data to be exchanged between the two different blockchains – take TradeLens and IBM Food Trust for example – if clients were to be inclined,\" said Todd Scott, the vice president of global trade at IBM Blockchain.","To help foster this open supply chain ecosystem, TradeLens is pushing its open APIs for shipping as well as work being done with shipping standards bodies such as CEFACT and industry groups such as OpenShipping.org.","\"On top of the bedrock of blockchain technology we are working with standards, and also have 125 or so APIs, and we are going to give all that access to the developer community so they can even create additional technologies of their own on top of it, \" said Scott.","However, not everyone will see this as such a great and gregarious invitation to the industry.","\"It's fine for them [IBM and Maersk] to say 'we are open for everyone to join,' but all they are really saying is 'come and use our system,'\" said Sean Edwards, chairman of the International Trade and Forfaiting Association.","Edwards, who is also head of legal at Sumitomo Mitsui Banking Corporation Europe, said getting everybody to speak together is not a new problem and the answer, he said, has been to try and create ecosystems like Universal Trade Network (UTN), only they haven't really got off the ground yet.","Referring to other blockchain solutions aimed specifically at banks to optimize trade finance (which is related to but different than the supply chain processes TradeLens is digitizing), Edwards said the situation may become one where, just as consumers have a multiplicity of passwords and systems that we use, banks and other entities may have to be present on a number of different platforms.","\"Either there are common enough standards that all the different underlying technologies can actually speak to each other, or you have initiatives that are so big everybody uses it,\" said Edwards, adding:","And notably, TradeLens is not the only boat in this race.","In addition to the well-established supply chain payments platform TradeShift, which connects over 1.5 million companies across 190 countries, banking giant Citigroup is in stealth with a combined trade finance and supply chain platform which will leverage not only distributed ledger technology (DLT) but also the internet of things (IoT) and artificial intelligence.","Hence, TradeLens is at pains to come across as neutral and therefore appeal to the widest possible audience.","Speaking to potential data privacy concerns for companies that compete with Maersk's subsidiaries, White said the Maersk side of the collaboration team is a distinct and separate entity with no involvement with the commercial activities of either Maersk Line (the shipping container business) or Damco (the logistics provider).","On top of these Chinese walls, the platform itself features privacy protections, White said. \"Sensitive information from other carriers are kept on separate nodes, so Carrier A cannot see Carrier B 's information or carrier C's information,\" he said.","Looking ahead, another possible blockchain interoperability play for TradeLens would be some of the trade finance blockchain platforms built on IBM Blockchain and Hyperledger, such as we.trade and Batavia.","Although it's probably still rather far off in the future, you could imagine an all-encompassing platform, so that if radio frequency identification (RFID) trackers indicate physical proximity to something, a payment can be released or a document signed, or similar.","On the subject of trade finance, IBM said banks were present among the 92 TradeLens pilot partners, but these were not being named. However, CoinDesk learned from a source in the trade finance arena that HSBC has \"met with TradeLens a couple of times and agreed to reconnect post-launch.\"","And both IBM and Maersk agreed a world of opportunity awaits with regard to bringing trade finance banks, marine insurers and the like on to TradeLens as the platform takes to the waves.","Maersk's White concluded,","Shipping container image via Shutterstock"],"entity":[{"type":"Batavia","content":"LOCATION"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"Pacific International Lines","content":"ORGANIZATION"},{"type":"Maersk","content":"ORGANIZATION"},{"type":"Todd Scott","content":"PERSON"},{"type":"White","content":"ORGANIZATION"},{"type":"International Trade and Forfaiting Association","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"49\/51 percent","content":"PERCENT"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Edwards","content":"PERSON"},{"type":"Hyperledger Fabric","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Scott","content":"PERSON"},{"type":"Sumitomo Mitsui Banking Corporation Europe","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"TradeLens","content":"ORGANIZATION"},{"type":"IBM Food Trust","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"IBM Blockchain","content":"ORGANIZATION"},{"type":"Sean Edwards","content":"PERSON"},{"type":"Michael White","content":"PERSON"}],"hashtag":["IBM","Hyperledger","Banking","HSBC","Distributed Ledger Technology","Supply Chain","Maersk","Hyperledger Fabric","TradeLens","Batavia","Features","business news"],"authors":["Ian Allison"]}