{"summary":"Crypto watchers say a nominal charge for using the service is unlikely to combat the bot problem.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/10\/19\/elon-musks-plan-to-charge-new-x-users-1-may-not-deter-crypto-bots\/","publishDate":"2023-10-19T06:57:25","id":15951,"type":null,"title":"Elon Musk’s Plan to Charge New X Users $1 May Not Deter Crypto Bots","category":["Technology"],"content":["A plan to charge $1 to new users of social app X, formerly Twitter, may do little to deter the bot endemic on the popular platform used by crypto projects and users.","X began rolling out the annual charge to new users in New Zealand and the Philippines on Wednesday. The company said the test could help “reduce spam, manipulation of our platform and bot activity,” as any new user will be charged to use critical functions including posting, replying and liking.","However, previous efforts to charge users have seemingly failed to entirely prevent phishing scams by verified accounts on the platform. X’s premium service – which costs $8 a month and rewards a blue tick to users – is seemingly extensively used by crypto-focused bot armies and scammers.","Such phishing bots are ever-present on posts made by verified accounts. Replies to several different CoinDesk posts show the blue-tick verified bots ploy their trade – hoping to capture the attention of an unsuspecting user, who clicks on the link only to discover their wallet has been fully drained a few minutes later.","Market observers working in crypto security services believe that while the charge may help dissuade some bots, other measures are far more likely to create an impact.","\"While this new program is well-intentioned, it may be more effective to enhance reporting measures to resolve existing issues,” explained Veronica Wong, CEO of crypto wallet SafePal. “Despite having dedicated team members reporting bot and scam accounts to safeguard our users, it is a never-ending battle as the process takes time and new X accounts are always popping up.”","“Users may still be vulnerable to bot accounts with blue and gold checkmarks since those are unaffected, and stringent vetting to deny scam ads will be more crucial to mitigate this,” Wong added.","Wong, however, noted that X’s premium service for businesses, which rewards a gold checkmark to accounts made it “noticeably harder for bots and impersonators to execute malicious attacks.”","Meanwhile, some crypto funds say using blockchain could quell the extensive bots menace.","“The pervasive issue of botting stands as a formidable challenge, casting a long shadow of doubt upon the industry's reputation,” shared DFG Founder and CEO James Wo. “The ill-gotten gains from perpetrating these scams substantially outweigh any associated expenses.”","“Attempts to quell this issue with a mere $1 annual fee appear insufficient in the face of determined groups. As a solution, we think that Web2 platforms will need to consider implementing Proof of Personhood and Decentralized Identity (DID) methods to deal with bot problem effectively,” Wo added.","A decentralized identifier (DID) identifies a user without relying on a centralized company or organization.","Edited by Parikshit Mishra."],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"DFG","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$8","content":"MONEY"},{"type":"Wong","content":"PERSON"},{"type":"Veronica Wong","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"}],"hashtag":["scam","Elon Musk"],"authors":["Shaurya Malwa"]}