{"summary":"An OKEx spokesperson told The Block that withdrawal issues are &quot;temporary&quot; and that the exchange cannot disclose &quot;the nature of an ongoing investigation.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81406\/crypto-exchange-okex-withdrawal-issues-investigation","publishDate":"2020-10-16T05:45:29","id":1595,"type":null,"title":"OKEx says withdrawal issues are &#x27;temporary,&#x27; can&#x27;t disclose &#x27;the nature of an ongoing investigation&#x27;","category":["EXCHANGES"],"content":["Crypto exchange OKEx has halted withdrawals indefinitely as one of its private key holders “is currently cooperating with a public security bureau in investigations.”","An OKEx spokesperson told The Block that the withdrawal issues are “temporary” and that the exchange cannot disclose “the nature of an ongoing investigation.”","Earlier today, cryptocurrency exchange OKEx halted withdrawals indefinitely as one of its private key holders \"is currently cooperating with a public security bureau in investigations.\"","OKEx <a href=\"https:\/\/www.okex.com\/support\/hc\/en-us\/articles\/360051090391-Suspension-of-Digital-assets-Cryptocurrencies-Withdrawals\" data-v-f87c67ca=\"\">said<\/a> it has been \"out of touch\" with the concerned private key holder, without disclosing since when and by when it could resume withdrawals.","When reached for comments, an OKEx spokesperson told The Block that the withdrawal issues are \"temporary\" and that the exchange cannot disclose \"the nature of an ongoing investigation.\"","\"We are unable to disclose the nature of an ongoing investigation but would like to assure all OKEx users that their funds are safe and that all other functions on OKEx are unaffected,\" the spokesperson said. \"We understand that the temporary suspension of withdrawals will cause inconveniences, and we sincerely apologize. However, we feel that it is necessary in order to maintain our high standard of security for users' funds on OKEx.\"","OKEx CEO Jay Hao told The Block that the decision to \"temporarily pause withdrawals was taken with user security in mind.\" <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">According to&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/twitter.com\/glassnode\/status\/1317048711055331329?s=20\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">tracker Glassnode<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">, around 200,000 bitcoins, or 1.1% of the total circulating bitcoin supply (worth about $2.3 billion), are currently stuck in OKEx wallets.<\/span>","\"We will do everything in our power to reinstate this service promptly and will provide updates on the matter as soon as possible,\" said Hao, adding that \"all other activities — including deposits, spot trading, derivatives, staking, etc. — remain unaffected.\"","Hao <a href=\"https:\/\/twitter.com\/JayHao8\/status\/1316973040882823169?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> that the investigation concerns the private key holder’s \"personal issue only,\" without revealing any details.&nbsp;","Chinese media group Caixin, citing \"two sources close to OKEx,\" <a href=\"http:\/\/finance.caixin.com\/2020-10-16\/101615507.html\" data-v-f87c67ca=\"\">reported<\/a> that OKEx founder Star Xu is the one who \"cooperated with public security investigations.\"","One of the two sources told Caixin that Xu was detained by police \"at least a week ago and had not appeared in the workgroup for many days.\"","Xu is \"more careful about the company’s financial expenditure management. If he can’t authorize it, it will affect various fees and the authorization of withdrawals,\" the source claimed.&nbsp;","The OKEx spokesperson told The Block that the exchange is \"not connected with Star Xu in any ways.\"","\"OKEx is a separate entity from OK Group and, as such, we are not in a position to comment on any actions or activities related to Star Xu,\" the spokesperson added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nXu's Weibo (a Chinese microblogging website) account also <a href=\"https:\/\/twitter.com\/BoxminingNews\/status\/1317022633762852864?s=20\" data-v-f87c67ca=\"\">appears to have been taken down<\/a>.&nbsp;","Another Chinese news outlet BlockBeats <a href=\"https:\/\/twitter.com\/BlockBeatsChina\/status\/1317046525252390913?s=20\" data-v-f87c67ca=\"\">reported<\/a> that Xu \"might [have] move[d] some money to HK [Hong Kong] through illegal private bank... when he purchased the listed company personally.\"","Last year, Xu <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/sehk\/2019\/0123\/ltn20190123686.pdf\" data-v-f87c67ca=\"\">bought<\/a> a controlling stake in LEAP Holdings — a construction engineering firm listed on the Hong Kong Stock Exchange — for around $60 million. When asked if the investigation is related to this matter, the OKEx spokesperson told The Block: \"This is completely unrelated to OKEx and its exchange business.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hong Kong Stock Exchange","content":"ORGANIZATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"Jay Hao","content":"PERSON"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"OK Group","content":"ORGANIZATION"},{"type":"1.1%","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Hao","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}