{"summary":"A judge heard arguments on Thursday from lawyers for the U.S. Securities and Exchange Commission and tech company Kik over a long-running legal dispute centered around a $100 million initial coin offering\nDuring Thursday’s hearing, each side argued that the other hadn’t offered sufficient evidence to support their arguments\nSignificant time was spent on the question of “common enterprise” in the context of Kik’s token, Kin, which the SEC contends is a security","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71025\/in-virtual-hearing-sec-and-kik-lawyers-trade-arguments-on-summary-judgment-motions","publishDate":"2020-07-09T14:02:13","id":1595,"type":null,"title":"SEC and Kik lawyers trade arguments on summary judgment motions","category":["Legal"],"content":["A judge heard arguments on Thursday from lawyers for the U.S. Securities and Exchange Commission and tech company Kik over a long-running legal dispute centered around a $100 million initial coin offering (ICO).","Thursday's hearing, overseen via conference call by U.S. Judge Alvin Hellerstein, came months after both the U.S. securities regulator and Kik filed motions for summary judgment in March, as The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/linked\/59595\/kik-seeks-pre-trial-judgment-to-end-prolonged-ico-battle-with-the-sec\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reported<\/a>. Both submissions represented efforts to prevent the long-running legal dispute from going to trial. However, Kik previously said it was willing to do so.","The SEC <a href=\"https:\/\/www.theblockcrypto.com\/daily\/25798\/hail-mary-pass-sec-sues-kik-for-non-compliant-security-sale-in-its-100-million-ico\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">sued<\/a> Kik in June 2019 over its $100 million ICO, during which it sold a token called Kin. At the time, the SEC <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2019-87\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">alleged<\/a> that Kik \"sold the tokens to U.S. investors without registering their offer and sale as required by the U.S. securities laws.\"","In the wake of the lawsuit's filing, Kik <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41135\/kik-ceo-vows-to-fight-sec-over-kin-crypto-until-we-dont-have-a-dollar-left\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">struck a defiant tone<\/a>, with its CEO Ted Livingston pledging that \"[w]e will keep going no matter how hard it is.\"","During Thursday's hearing, each side argued that the other hadn't offered sufficient evidence to support their arguments. In court filings, the SEC argued that Kik's actions represented an unregistered securities offering, while Kik argued that the SEC hadn't proved its case.","Significant time was spent on the question of \"common enterprise\" in the context of Kin, which the SEC contends is indeed a security. \"[T]his is a quintessential common enterprise,\" the SEC's Stephan Schlegelmilch said. Attorney Patrick Gibbs of Cooley LLP argued in response that profits or losses are experienced individually by holders of Kin. Thus there's no \"common enterprise\" involved, he contended.","\"Courts have held there is no common enterprise because buyers can profit and lose independent of one another,\" Gibbs said, adding later in the back-and-forth with Judge Hellerstein: \"A business enterprise is one where the profits and losses are shared.\"","Thursday's hearing didn't end with a definitive ruling on the competing motions, and it remains to be seen whether the case ultimately goes to trial. Near the end of the discussion, Gibbs criticized the SEC's guidance around token sales as insufficiently clear. For its part, the SEC's Laura D'Allaired argued that Kik \"received fair notice that it's offering could constitute an investment contract\" in light of decades of case law."],"hashtag":["SEC"]}