{"summary":"Bitcoin is outperforming on hopes of a U.S. ETF approval.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/10\/06\/market-wrap-bitcoin-dominance-rises-as-altcoins-underperform\/","publishDate":"2021-10-06T21:31:35","id":15952,"type":null,"title":"Market Wrap: Bitcoin Dominance Rises as Altcoins Underperform","category":["Markets"],"content":["Bitcoin surged toward $54,000 on Wednesday, the highest level in almost five months. The cryptocurrency is up about 8% over the past 24 hours, compared with a 3% rise in ether over the same period.","Analysts pointed to renewed bullish sentiment ahead of the U.S. Securities and Exchange Commission’s (SEC) decision on a bitcoin ETF, which could occur in the coming weeks.","In the bitcoin futures market, front-month contracts based on the Chicago Mercantile Exchange (CME) were trading at an annualized premium of 12.8% to the spot price, which is the highest level since mid-April. A futures-based ETF, if approved, could bring more buying pressure for the CME futures, CoinDesk’s Omkar Godbole reported.","For now, some analysts see room for continued upside for BTC as momentum improves.","“I have to say, looking at the daily chart, the rise looks healthier this time as momentum has built steadily from the $40,000 area without facing rejection before crossing $50,000, as it has done many times before,” Daniela Hathorn, an analyst at DailyFX, wrote in an email to CoinDesk.","Latest Prices","The bitcoin dominance ratio, which measures BTC’s market capitalization relative to the total crypto market capitalization, increased to about 44%, from a low of about 40% last month. The rise in the dominance ratio reflects bitcoin’s recent outperformance versus alternative cryptocurrencies (altcoins) – a trend that some analysts expect will continue this quarter.","“There has been fresh spot buying activity in BTC, and looking at the price action we expect to see a fresh all-time high in the coming weeks,” Pankaj Balani, CEO of Delta Exchange, wrote in an email to CoinDesk. “We also expect BTC to outperform altcoins and the money to rotate into BTC from alts going forward.”","The bitcoin dominance ratio had declined in recent months as altcoins outperformed. During the sell-off last month, investors may have rotated out of altcoins and into bitcoin.","Ether, the world’s second-largest cryptocurrency by market capitalization, is underperforming bitcoin. The ETH\/BTC price ratio is attempting to break below 0.065, which provided support for ether relative to bitcoin in August. Failure to hold current support could trigger further downside toward 0.057, although oversold signals are starting to appear on the charts.","Outside of bitcoin, ether’s market capitalization continues to dominate other altcoins. The adoption of non-fungible tokens (NFTs), decentralized finance (DeFi) and other blockchain applications have helped push the narrative that ETH’s market capitalization could continue to grow, according to a report by CoinDesk Research.","Most digital assets in the CoinDesk 20 ended the day higher.","Notable winners as of 21:00 UTC (4:00 p.m. ET):","Notable losers:"],"entity":[{"type":"12.8%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"Delta Exchange","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"mid-April","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"Pankaj Balani","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$54,000","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Daniela Hathorn","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"CoinDesk’s Omkar Godbole","content":"ORGANIZATION"},{"type":"CoinDesk Research","content":"ORGANIZATION"},{"type":"4:00 p.m.","content":"TIME"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["Market Wrap","Bitcoin","Bitcoin Dominance Rate","Ether","Bitcoin Futures","Altcoins","Technical Analysis"],"authors":["Damanick Dantes","Tracy Wang"]}