{"summary":"Called \"The Value Prop,\" the database hosts as many as 39 use cases and over 300 applications, with numbers expected to increase.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/06\/15\/polygon-labs-rolls-out-open-database-for-blockchain-use-cases\/","publishDate":"2023-06-15T13:00:00","id":15957,"type":null,"title":"Polygon Labs Rolls Out Open Database for Blockchain Use Cases","category":["Policy"],"content":["Polygon Labs, the Ethereum scaling platform, has released an open database that shows positive use cases of blockchain on any application from across the world, it announced on Thursday.","Called \"The Value Prop,\" the database hosts as many as 39 use cases and over 300 applications, with numbers expected to increase. Polygon Labs conceived the project as a “Wikipedia for use cases.”","\"This is just the beginning. It's not like this is going to be a stagnant website,\" said Rebecca Rettig, Chief Policy Officer at Polygon Labs in a pre-launch interview with CoinDesk. \"It's going to grow as people see it and say, 'Oh, we want more applications that are on Solana to be listed on here. Please put them up on the website.'\"","The clamor for use cases has been growing among regulators as jurisdictions grapple with the challenge of framing legislation that not only supports innovation but also protects citizens.","\"We need to see a body of use cases of blockchain that reflect the power of the technology without the vulnerabilities of crypto to tilt the discussion in favor of positive regulation intended for mass adoption,\" one policymaker from the Group of 20 (G20) told CoinDesk. Earlier this year, Singapore's central bank started a pilot program to explore use cases of digital assets in tokenization and decentralized finance (DeFi).","Rettig said this could shift the narrative from how regulators can't potentially see beyond the \"sort of crypto casinos\" at a time when the U.S. Securities and Exchange Commission has sued the world's largest exchanges Binance and Coinbase.","\"It'll be very useful for policymakers but there's also this general feeling, what's blockchain good for and what problems does it solve, and this is hopefully an answer to that in a general way.\"","Regulators have asked for the industry to decouple blockchain and its use cases from crypto but Rettig said that \"when there is a fundamental value, you don't have to decouple yourself,\" citing the example of the UNICEF CryptoFund which shares donations with those in need through crypto, allowing the funds to be tracked publicly.","The use cases are categorized under seven different verticals – education, security & risk management, social impact & sustainability, finance, business & marketing, governance and information technology.","The platform will also hold a testimonials page showcasing written and video messages from people on how blockchain impacted their life positively.","Read More: Immutable and Polygon Labs Team Up to Expand the Web3 Gaming Ecosystem","Edited by Oliver Knight."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"UNICEF","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Rettig","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Oliver Knight","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"the Group of 20 (G20","content":"ORGANIZATION"},{"type":"Rebecca Rettig","content":"PERSON"}],"hashtag":["Regulations","Polygon labs","Use Cases","Databases","open-source","Rebecca Rettig"],"authors":["Amitoj Singh"]}