{"summary":"The former CEO should repay money he transferred in the run-up to the lender’s July bankruptcy, the document said","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/02\/15\/celsius-seeks-to-recovery-millions-from-mashinsky-other-former-executives\/","publishDate":"2023-02-15T07:35:23","id":15955,"type":null,"title":"Celsius Seeks to Recover Millions From Mashinsky, Other Former Executives","category":["Policy"],"content":["Celsius Network and its creditors have begun court action to recover millions they say was fraudulently transferred from founder and former CEO Alex Mashinsky, his wife and other former senior executives.","Court documents published on Tuesday allege Mashinsky, co-founder S. Daniel Leon and others mismanaged the crypto lender, inflated the price of CEL tokens for their own benefit, and made “negligent, reckless and sometimes self-interested investments” in the run-up to bankruptcy in July.","“The Complaint would bring claims and causes of action against the Prospective Defendants to return millions of dollars removed from the Celsius platform” in the months before it froze withdrawals, the filing said, adding that it seeks to \"recover damages from billions of dollars that were lost by the Prospective Defendants’ negligent, reckless, and self-interested conduct.”","The 150-page legal document they filed requests recovery, costs and punitive damages based on 33 counts. They include the transfer of billions to decentralized finance platform KeyFi, which Mashinsky partly owned, to engage in speculative investment, a move which the filing said lost Celsius approximately $200 million.","The document cites $2.8 million transferred to Mashinsky’s own wallet in May 2022 as allegedly fraudulent transfers under the U.S. bankruptcy code, which regards as suspect payments made up to two years before a company goes under. It also refers to $12 million the company transferred to AM Ventures and $5 million to Koala LLP, both owned and controlled by Mashinsky.","Mashinsky did not immediately respond to CoinDesk's request for comment sent via LinkedIn.","Read more: Celsius Used New Customer Funds to Pay for Withdrawals: Independent Examiner"],"entity":[{"type":"S. Daniel Leon","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"Koala LLP","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"AM Ventures","content":"ORGANIZATION"},{"type":"$2.8 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"Mashinsky","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"Mashinsky","content":"ORGANIZATION"}],"hashtag":["Regulations","Celsius","Alex Mashinsky","Bankruptcy","KeyFi"],"authors":["Jack Schickler"]}