{"summary":"The increased network activity is benefitting ether investors by burning the token's supply at a faster pace, but it has also made Ethereum \"unusable\" for many due to sky-high transaction costs, IntoTheBlock analysts noted.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/08\/meme-coin-frenzy-drives-ethereum-network-fees-to-nearly-2-year-high-intotheblock\/","publishDate":"2024-03-08T21:09:03","id":15950,"type":null,"title":"Meme Coin Frenzy Drives Ethereum Network Fees to Nearly 2-Year High: IntoTheBlock","category":["Markets"],"content":["The Ethereum network's revenue surged to nearly two year highs this week as the speculative frenzy with meme coins boosted blockchain activity, IntoTheBlock noted in a Friday market report.","IntoTheBlock data shows that Ethereum mainnet's revenue from network fees reached $193 million this week, the highest figure since May 2022 and a 78% increase from last week.","The on-chain activity was largely driven by increased speculation with meme tokens, IntoTheBlock analysts said. Ethereum-based meme tokens such as pepe (PEPE), shiba inu (SHIB) and floki (FLOKI) more than doubled in price over the past week as retail","Meanwhile, trading volumes on decentralized exchanges (DEX) built on top of Ethereum jumped 40% to $20 billion this week, DefiLlama data shows.","Read more: SHIB's 106% Move Higher Led CoinDesk 20 Gainers Last Week: CoinDesk Indices Market Update","The frenzy is benefitting investors who hold ether (ETH), the network's native token, because of its token burning scheme. After Ethereum's transition to a proof-of-stake blockchain – commonly referred to as the Merge –, the network destroys a part of the transaction fees paid by users, decreasing the token's supply.","Over the past week, ETH's supply shrunk by some 33,400 tokens (worth roughly $130 million at current prices), and is deflationary at a 1.45% annualized rate, according to Ultrasound.money data.","On the other hand, the heightened activity has made the blockchain very pricey for users. Average transaction costs (gas fees) on Ethereum rose to as high as $28 this week, making it \"unusable\" for many users, IntoTheBlock noted.","Fees on layer 2s, designed to scale the Ethereum network, also surged, with transactions costing as much as $1 on Arbitrum, the highest since 2022, the report said. This issue has a quick fix though with the Dencun upgrade coming up next week, which is expected to lower transaction costs on layer 2s to cents.","Ether briefly topped $4,000 on Friday for the first time since late 2021, but tumbled over 4% along with bitcoin (BTC). Recently, ETH changed hands at around $3,900, up 15% this week, in line with the broad-market CoinDesk 20 Index's (CD20) advance.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$28","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$3,900","content":"MONEY"},{"type":"$193 million","content":"MONEY"},{"type":"78%","content":"PERCENT"},{"type":"106%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"$130 million","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"1.45%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"$4,000","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"CoinDesk Indices Market Update","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"late 2021","content":"DATE"}],"hashtag":["Ethereum","meme coins","Pepe","Shiba Inu","Floki","gas fees","Ether"],"authors":["Krisztian Sandor"]}