{"summary":"Despite crypto-friendly laws in Wyoming, most DAOs are choosing to incorporate overseas.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/18\/dao-incorporation-us-tax-code\/","publishDate":"2022-11-18T16:50:02","id":15956,"type":null,"title":"How Bad Tax Policy Drives DAOs Out of the US","category":["Layer 2"],"content":["It has been over a year since Wyoming passed the first U.S. law recognizing decentralized autonomous organizations (DAO) as legal partnerships. But demand for this registration remains muted.","The reality is that most DAOs will likely continue incorporating overseas (if they incorporate at all). This is not because of U.S. Securities and Exchange Commission’s (SEC) regulation, but because of the very same tax considerations venture capital and hedge fund managers have been grappling with for decades.","Mark Lurie is the CEO of Shipyard Software Inc, a decentralized exchange retail crypto traders. This article is part of CoinDesk’s Tax Week.","Around the world, DAOs are increasingly incorporating as legitimate businesses to protect their members from liability. In a first-of-its-kind lawsuit filed earlier this year, a group of plaintiffs charged members of bZx DAO with negligence in protecting the funds deposited in their protocol, which exposed it to a hack costing users $55 million.","A few months later, the Commodity Futures Trading Commission (CFTC) sued members of Ooki DAO for offering margin-traded financial products without registering as an official merchant. Events like these doubtlessly drive more DAOs to consider incorporation or some other type of entity formation in an effort to limit members’ personal liability.","These messy litigations fuel the prevailing understanding that DAOs prefer to incorporate overseas to avoid regulatory headaches in the U.S. This is a partial factor. However, ultimately, the main deterrent for DAOs incorporation in the U.S. actually comes down to the way the Internal Revenue Service (IRS) classifies and taxes business entities.","Within the U.S., the most common types of business entities are LLCs and corporations, or more specifically C-corporations. C-corps are legally distinct from their owners and responsible for paying their own taxes, except when they issue dividends, which often triggers a tax obligation to shareholders.","In contrast, LLCs are considered “pass-through entities,” which means that revenue passes through the business to the owners, who then report it on their personal tax returns as individual income. Many entrepreneurs choose to form an LLC because income is only taxed once at the individual level, rather than “double taxed” at the company level and on dividends.","Yet, there is one major drawback to opting for an LLC – unlike with corporations, all LLC owners must pay taxes on their share of LLC income. Even if the LLC does not distribute profits, the income tax allocations are automatic.","Read more: What's the Matter With Delaware? How Joe Biden's Home State Became a Global Tax Avoidance Hub \/ Opinion","For instance, if an LLC DAO with five owners holding equal shares makes $40 million in 2022, all five owners would be individually responsible for reporting taxes on $8 million in income, regardless of profits handed out.","U.S. citizens must pay these taxes even if they live outside of the country since they must pay taxes on income no matter where they live in the world – a policy unique to the US. Meanwhile, non-U.S. citizens might be able to avoid paying taxes on this income, but would likely still need to file an IRS tax return to report it.","Even without coughing up funds, the pain and expense of filing a U.S. tax return would likely be a dealbreaker for many non-U.S. citizens, particularly for those with complex financial holdings and income streams. And DAOs, like crypto generally, are a global phenomenon with contributors from all over the world.","If DAO members decide not to comply, the U.S. could soon sanction them under anti-corruption and fraud monitoring regulations, leaving them unable to use any U.S.-linked banks or financial institutions. This step is usually reserved for criminal activity, but it could be used in response to failed tax compliance, especially if the DAO has sizable revenues.","Hedge funds have navigated this issue for decades, often relying on what’s called a master-feeder fund. Those who must file U.S. tax returns regardless place their investment in a domestic fund, while those who are U.S. tax-exempt put their money in a foreign fund, perhaps in the Cayman or British Virgin Islands.","These feeder funds then deposit the investors’ capital into the hedge fund’s offshore master account, which then makes investments. Earnings would later be distributed to U.S. investors through the domestic feeder fund and to non-U.S. investors through the foreign feeder fund, thus skirting U.S. taxes.","Given these roadblocks, you can begin to see how a DAO that chooses to become a U.S. LLC will create a Kafkaesque maze of tax issues and potential financial liabilities for its members. And this byzantine structure would be further complicated if the DAO issues a governance token, triggering tax reporting obligations for hundreds, even thousands, of token holders.","Read more: Use Your Crypto Losses to Turn the Tables Against the IRS","As a result, most DAOs that are seriously considering U.S. business entity formation are either unaware of their looming tax obligations or 100% confident they’ll never have a non-U.S. citizen member. The former will soon awaken from their reverie; the latter will always have a limited talent pool.","This likely explains why only a handful of DAOs have formed entities in Wyoming in the year since the law’s passage, while foreign jurisdictions with similar DAO-friendly laws, such as the Marshall Islands, have seen DAOs arriving in droves.","This is why legal guidance on how to incorporate DAOs as LLCs in the U.S. largely miss the point. Andreessen Horowitz, for instance, recently published a DAO business entity flowchart, guiding concerned members through the decision-making process to ultimately form a limited liability company (LLC), a foreign foundation, a limited cooperative association (LCA) or remain entityless.","But as long as U.S. tax regulations make it infeasible or too expensive for DAOs to execute this in practice, any U.S.-based approach will likely fail to gain traction.","Unlike securities and financial regulation, U.S. tax policy is mostly black and white when it comes to crypto. Applying existing laws to this new form of currency is relatively straightforward, as it’s more about individuals, assets and income than innovative financial instruments and complex technologies.","What’s more, it’s an open secret that the IRS has perhaps the most insightful and sophisticated crypto team of any government agency.","The number of DAO members that still believe decentralization provides complete practical protections against regulation and legal liability is shrinking fast. In particular, the DeFi community is increasingly aware that the longer they operate without registering their DAO as a business entity, the more they risk being held legally and financially liable for any potential stumbles.","But taxes are the main practical impediment to U.S.-based DAO incorporation, and this issue must be resolved in order for the DAO members to be more receptive to policies like the one passed in Wyoming. Under the present tax regime, it would be silly to expect San Francisco, Boston or Miami to become the Silicon Valley of DAOs. That is, unless the U.S. overhauls its existing tax code to be more lenient towards DAO members (which isn’t going to happen)."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"the LLC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"Miami","content":"LOCATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Cayman","content":"LOCATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Tables Against the IRS","content":"ORGANIZATION"},{"type":"LCA","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$55 million","content":"MONEY"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Shipyard Software Inc","content":"ORGANIZATION"},{"type":"Silicon Valley of DAOs","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"$8 million","content":"MONEY"},{"type":"Marshall Islands","content":"LOCATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Avoidance Hub \/ Opinion","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"U.S. LLC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Mark Lurie","content":"PERSON"},{"type":"Home State","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["DAO","IRS","SEC","LLCs","Opinion","Tax Week 2022"],"authors":["Mark Lurie"]}