{"summary":"Kraken Institutional operates under the exchange’s state-chartered banking license in Wyoming, attained back in 2020.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/20\/kraken-unveils-qualified-custody-for-institutions-in-crypto-friendly-wyoming\/","publishDate":"2024-03-20T13:30:00","id":15963,"type":null,"title":"Kraken Unveils Qualified Custody for Institutions in Crypto-Friendly Wyoming","category":["Finance"],"content":["Cryptocurrency exchange Kraken has unveiled a qualified custody service for institutional clients in crypto-friendly Wyoming through the firm’s long-standing state-chartered banking license in the region.","Kraken Institutional, announced on Wednesday, operates under the special purpose depository institution (SPDI) charter snagged by the exchange back in 2020. All deposits will be held in segregated accounts remote from the exchange itself and on a full-reserve basis.","Wyoming, which is populated with twice as many cattle as people, has been steadily striving for regulatory clarity around crypto and has passed some 35 laws on the topic since 2016 – with Kraken being the biggest name to throw its weight behind that campaign.","\"Kraken made history as the first cryptocurrency exchange to receive a banking charter in the US in 2020,\" a spokesman for the exchange said in an email. \"It’s taken us the best part of three years since this important milestone to work through all the various legal and compliance checks required to launch a bank and bring Kraken Financial to market.\"","Kraken Institutional will continue to be a qualified custodian under the Security and Exchange Commission’s proposed Safeguarding Rule, which has not yet been adopted, the spokesman added.","Looking ahead, “Kraken’s engineering team has built out a smart order routing tool that provides access to highly liquid order books across multiple venues, aiming for the highest execution quality and price. This will offered by Kraken Institutional later this year,” he said.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Kraken Financial","content":"ORGANIZATION"},{"type":"Kraken Institutional","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Wyoming","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Security and Exchange Commission","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"}],"hashtag":["Kraken","Wyoming","Custody","Institutional Investors"],"authors":["Ian Allison"]}