{"summary":"The renowned a16z VC talks to Daniel Kuhn about his new book, “Read Write Own: Building the Next Era of the Internet.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/31\/chris-dixon-talks-techno-optimism-permissionless-innovation-and-the-need-for-crypto\/","publishDate":"2024-01-31T16:32:05","id":15961,"type":null,"title":"Chris Dixon Talks Techno-Optimism, Permissionless Innovation and the Need for Crypto","category":["Consensus Magazine"],"content":["There is a growing divide between techno-optimists and pessimists. Growing up I vaguely remember a public debate between bible thumpers and people who wanted evolution taught in school. The same sort of argument is playing out in a number of different ways today — a media “Techlash” vs. Silicon Valley, humanists vs. nerds, progressivism vs. material progress — but recently, in his \"Techno-Optimist Manifesto,\" venture capitalist Marc Andreessen boiled it down to a war between deccelerationists and accelerationists. That is, those who want the rate of technology to slow, stagnate or reverse and those who want the opposite.","Chris Dixon is a speaker at CoinDesk's Consensus conference, beginning May 29, in Austin, Texas.","In Andreessen’s eyes, the debate has metastasized to touch nearly every corner of human endeavor. And in many ways it has: with the increasing rate of internet adoption, tech plays an ever-larger role in our daily lives. More and more of our interactions are mediated by social media and mobile apps. As cash falls by the wayside, almost all economic activity is routed through digital rails operated by banks or fintechs. We’re streaming more, playing more online games and even taking work online.","While many of these developments have made modern life more convenient and efficient, tech also causes problems. Even if you buy into the idea that all technologies are neutral, just “tools” to be put to better or worse use, it’s hard not to think that there’s something dystopian about the past two decades of technological progress. As many crypto advocates point out, as the internet grows, our lives are put in the hands of a few monopolistic companies.","This is the point of departure for Chris Dixon’s new book, “Read Write Own: Building the Next Era of the Internet,” published on Jan. 30. Dixon, a long-time colleague of Andreessen, who runs the independent crypto arm at storied VC firm Andreessen Horowitz (a16z), traces the lineage of the web to find what has gone awry. What started out as a network of interoperable and open protocols, what’s now known as Web1, has been sectioned off in Web2. It’s an era where essentially five companies control who gets to use what, when and why. Thankfully, Dixon argues, what comes next, Web3, offers real solutions.","Web3 is a bit of a buzzword, Dixon admits. For him, it can be defined as the “ownership” layer that has been so far missing from the web. While Facebook and Twitter did connect the world in some sense, it never allowed users to own their identities or accounts. It’s a similar story across digital banking, blogging or really anything online with a sign-in and password. With the rise of blockchains, what Dixon refers to as virtual computers, users are finally in control over their digital lives — so long as they maintain control over their private keys.","It might take a techno-optimist to think that blockchain can reverse the consolidation of the web, considering the trillions of dollars at play, how little adoption has taken place so far and the industry’s battered reputation in the mainstream. But for Dixon, apart from crypto’s ability to hand back control to everyday users, blockchains also offer a space for permissionless development. We may not know exactly what blockchains are useful for today, but so long as there are people as excited about the tech as Dixon is, we’re likely to find out eventually.","See also: It's Time to BUIDL","CoinDesk spoke with Dixon, who will be at Consensus 2024, to get a better sense of the three eras of the web, his work as a venture capitalist funding the next wave of crypto startups and whether he thinks direct democracy is over- or underrated, among other pressing issues. The interview has been lightly edited and condensed.","The overall theme of the book is the evolution of the internet from Web1, composed of open source protocols, to Web2, which was walled off and siloed, to the re-decentralizing force of Web3 and crypto. Would you consider blockchain to be part of the wider open-source movement and in what ways are Web1 and Web3 different?","In the book I talked about outside versus inside-out technologies, which is this idea that, if you look at the history of computing, there's things like the iPhone and AI that came from established institutions like Apple and Google and Stanford, and then there's a whole separate tradition of hackers at the fringe, building stuff. Early PCs — the Homebrew Computer Club was Steve Jobs. They were outsiders. Open-source software, Linux and the whole stack of open source software came from outside. There's no central casting for computing platforms. Tim Berners-Lee, creator of the World Wide Web, was a physicist at CERN. Blockchain is very much in that mold, inheriting that tradition of deep believers of openness and shared systems that’s motivated through a distinct ethos.","A lot of people call Facebook a “platform” because you can technically build apps on it. Is there a better definition for what makes a platform, in the sense that blockchains won’t kick you off like Facebook did to Zynga?","Facebook may be a platform, but it's very shaky. There's a long history of entrepreneurs who tried to build on top of Facebook and Twitter, and felt essentially robbed because they changed the terms-of-condition and APIs. I think we see this going on with Apple right now with Epic suing them and companies like Netflix and Spotify not creating apps for the Meta Quest Pro or Apple Vision headsets. A platform is supposed to be a predictable, safe place that developers can build a real business on and have some degree of certainty. If you think about the offline world, like starting a restaurant, when you spend all this time and money, you can still run your restaurant even if the landlord jacks up the rent. That's what we have today: essentially five big landlords that appreciably change the rules and change rents. That's created a very inhospitable environment for independent developers and startups.","In the venture capital business, we invest in startups. We want to see a dynamic internet that's hospitable to startups. One of the reasons I'm excited about blockchains, is because I see them as a way to return us to predictable platforms, where entrepreneurs and creators can build direct relationships with their audiences. This is what the internet was supposed to be. I really worry that the way we're headed now, there's going to be three or four big platforms like broadcast TV in the 70s — ABC, NBC, CBS. And everyone's going to spend their time in one of those silos. To me, that's a tragic outcome for what was once this open, democratic network. We should be doing all we can to counter that.","Are you willing to say anything about Oculus? You’ve hinted in interviews in the past that you've been sort of unsatisfied with how it's been managed by Meta.","I made that investment for us back in November 2013. I'm glad Facebook is invested in VR and about Apple investing in VR. They’ve done a good job generally, and spent an incredible amount of money. I am concerned that, similar to the themes I'm talking about with the internet, we're going to end up with two new giant corporate platforms without an open-source alternative. There's no Linux of VR right now. They're both seemingly running the same strategy of a tightly controlled App Store with 30% payments, like the iOS ecosystem.","I'm very bullish on VR. I think it's going to be a big deal. I just worry we're going to keep repeating the same cycle. Everyone initially dismisses technology as a toy, then they suddenly wake up to the fact that two companies control a very important resource — like social media. We should put up the alarm bells earlier this time.","One of the major differences between Web1 and Web3 is the role of the government and academia developing the foundational internet protocols. Does Web3 need another DARPA like to succeed?","I don't think so. There's enough sources of funding, that's not the shortcoming. We need more entrepreneurs, we need more academics, we need clear policy. Because many policy decisions are playing out in courts, and that takes many years; it creates uncertainty and disincentivizes entrepreneurs.","We want to be as inclusive as possible. If folks in academia and government want to get involved in a constructive way, that's awesome. Our research team, led by Tim Roughgarden, who is a professor at Columbia, and Dan Boneh, a professor at Stanford, write academic papers and do seminars — everything's open-source. We try to get more people involved. Unfortunately, there's just a ton of misunderstanding around the blockchain space, which is a big reason I wrote the book. There's a lot more skepticism than is warranted.","You write that software is more like fiction than anything, and have said that information wants to be free. Does this imply that fiction or other creative works should be priced at the level for commodity inputs or devalued broadly?","I don’t think I said information wants to be free.","In previous interviews you've suggested it.","Okay, let me maybe add nuance. I don't know exactly what context I said it; I very strongly believe that creative people should be paid for their work. There’s a section in the book on the media business where I call attention to the attention monetization trade off, which is a trade-off in media between getting people to see what you do by sharing it on the internet and charging for it.","The video game industry is the most pioneering in that it has figured out it’s a better business to, instead of charging for the game, charge for compliments to the game like virtual goods. League of Legends and Fortnight, two of the most successful games, are free. I suspect, as AI enables anybody to create high-quality illustrations for free, that's gonna put downward pressure on the prices of illustrations. So it's more important than ever to think about new business models for creative people that don't involve simply, quote-unquote, selling the game. They sell other things.","Information can be free in the sense that content can be free, and creative people can still get paid. NFTs are an obvious example, right? How do artists get paid in the offline world? Artists don't get paid by copyrighting the image of a painting; they want that image to propagate and they sell the original paintings or photographs. They sell essentially the signed, authenticated version of the image, not the image itself. NFTs introduced a similar idea into the digital world. You can reconcile an internet where sharing content that drives the price of the content to zero with business models that make sure creative people get paid.","NFTs help monetize work and build alternative revenue streams, but they don't necessarily fix the problems of distribution or building audiences. This is an idea that came up in your conversation with Bob Iger, who argued, if you have a brand identity, it doesn’t matter which technological medium you’re using to distribute work. Do you see potential solutions to this problem?","I write about collaborative storytelling — where communities of people come together and create narrative worlds. Think of Star Wars, Harry Potter, but future versions of that. Creators work collaboratively, Wikipedia-style, to come up with storylines. You already see this happening on Reddit, where people critique Star Wars and suggest storylines. I read some of that stuff; people have really good ideas. Imagine those people got rewarded with NFTs and tokens that give them financial upside if the narrative world is successful? That also solves a distribution problem, right?","Hollywood only does sequels of existing IP because it costs hundreds of millions of dollars to market new IP. If you have a million fans who own tokens, who helped to create a narrative universe, they now have an incentive to evangelize that universe. You could fork Star Wars, create your own version of it. It's an internet-native way to create genuine fans with skin in the game. Think about how people get excited about bitcoin or meme coins or something and apply it to narrative storytelling to propagate and generate movies, video games and comics.","A few higher profile hires left a16z. Why do you stay instead of going solo?","Well, look, I've been here for over a decade. Among other things, I'm close to my partners Marc [Andreessen] and Ben [Horowitz]. What we're trying to do at the firm is kind of the best of both worlds: a bigger firm with a platform that helps us save on administrative overhead and use our business as a network to build relationships with Fortune 500 companies, limited partners and policymakers — all the different kinds of relevant constituents. At the same time, with our crypto fund, we were able to go really deep and vertical and bring experts onto our team.","Are there any fundamental disagreements you have with Marc?","We argue in a very friendly way, and try to encourage a culture of healthy debate at the firm. The thing that we share that's the kind of uniting principle across the firm is we're “tech optimists.” I have been my whole life, frankly. It's important to recognize that all technology has pros and cons. You can use a hammer to build or destroy a house. We also believe smart regulation balances innovation and consumer safety. But we strongly believe technology is a force for good — and that's what we see as our mission. Furthermore, we believe that startups are an important part of technology, that new company formation has been an important part of the U.S. economic engine and we want to play a part in that. There aren't that many scaled institutions that are strongly pro tech and pro startup.","See also: Coinbase vs. the SEC Argues About Beanie Babies","I agree in general that technology is neutral, but also that specific things are designed for harm. Do you at all disagree with the firm's investments in military technology?","Silicon Valley has a long history of being both supported by and supporting the U.S. government. Our view generally is that we're pro-U.S. and its allies. We want to do what we can to support the U.S. government more and it's not our place to decide on foreign policy. We don't have our own State Department.","You describe blockchains as “near-Turing complete” computers whereas others often just call them Turing complete. Why split hairs?","I have much smarter people on my team, computer scientists who get mad at me when I say Turing-complete. I think there's certain functions you can't do — recursion, random numbers, things you need oracles for. So I'm just trying to be academically precise. You still have a very rich design space as a developer.","You said that the overreliance on advertising was the “original sin of the internet.” Advertising has paid for many wonderful things: a once-thriving newspaper industry; great TV, movies, stuff like that. Why is advertising uniquely poisonous on the web?","I'm not against all advertising, but the pendulum swung way too far towards advertising and it's resulted in an adversarial relationship between companies and users. You're getting tracked constantly. You click on a lawn mower and then forever, you see more and more ads for lawn mowers. Google defaults all my preferences without asking me, storing all my searches forever. And the argument that ads pay for free services: there are other ways beyond freemium. Most SAAS software works this way — Slack, Discord, Spotify, a lot of software.","Games also have free tiers, and upsell you stuff. That's a way for them to essentially give away the software for free to [the] 95% of the users [who] won't pay for it. I probably play Clash Royale too much; it's a free game. But some percentage of the users, including me, end up buying upgrades that pays for everybody else. So I think there are other ways.","Free software is a very important thing. And we want software in the hands of billions of people. But I don't think advertising is the only way to go. The two biggest pure internet services, Meta and Google, are fully ad-based.","But is there something unique about the architecture of the web that made advertising a problem?","It was just a historical thing. I mentioned in the book, but it took a long lot longer for payments to develop. First you needed encryption. People forget this but there was a very controversial technology introduced by Netscape, SSL [Secure Sockets Layer] encryption, that caused arguments over encrypted internet communications. E-commerce didn't exist, online banking didn't exist, and so it seemed as if the only potential users of it would be terrorists and criminals. That was a common argument. Netscape was classified as munitions and was illegal to export; they had to have a special version for international users.","There was also a big political debate in the 90s over the Clipper Chip, the Clinton administration chip that would have forced weak encryption on everybody. So, because it took a long time for encryption to develop, it took a long time for payments to develop, and advertising filled that void. And then it just sort of became the norm throughout the 2000s as social networking and search grew.","Over the last decade, the pendulum has been swinging back very strongly. The vast majority of unicorns in the last 10 years have been paid services, enterprise software, prosumer software. But we're still overly reliant on advertising.","There’s a lot I wanted to touch on, would you maybe want to do a round of overrated\/underrated?","I'm always gonna want to probably add nuance.","Feel free definitely if something strikes. Web2 communities.","You mean like Reddit and Discord and all that?","Yeah, overrated\/underrated?","I think it's like I think the fact that we've built a system where five billion people can all communicate and congregate around shared interests is a great thing. It's an amazing accomplishment, I'm very pro.","Direct democracy? You mean in DAOs or in the real world?","Either, was thinking DAOs.","I have a chapter in the book about network governance. It's an important direction to develop. Having community owned networks and digital services is a vast improvement over having corporate-owned networks and digital services. People are exploring new ways to do this governance, including through DAOs – from Uniswap and Compound. I don't think it's figured out yet, by the way. I don't think it's figured out in the real world either. If you talk to governance experts, it's a constant struggle to get large groups of people together to govern things in an orderly way, and I think we're seeing similar things in the online world.","Point systems for airdrops. Overrated\/underrated?","I think that's an ambiguous word. As I understand points, it's sort of non-transferable tokens people use in different ways. There's just a lot of people experimenting. There's also regulatory reasons why points might be advantageous. They clearly behave much more like Starbucks points, or more traditional rewards.","CBDCs?","I'm not positive on those. What's happening with USDC, as an example; stablecoins show how popular digital dollars are, right? I mean, many trillions of dollars worth of transactions happen via stablecoins. There's been so much good work on the infrastructure layer, with L2s [layer 2s] and other blockchains, that I think the private sector will find high-quality technological solutions. Obviously, we need the use of dollars to be regulated. But that's different than having the government go and try to actually build the software.","VC funding in crypto. Overrated, underrated?","I mean — I know we get a lot of s**t on Twitter, but my view is, especially during the crypto winter… Let me tell you this, we started the first crypto fund beginning late 2017-18, and there just wasn't a lot of funding happening in crypto. We did the seed and Series A of Compound, did the Series A for Uniswap. We funded a bunch of NFT projects going back to I think 2017. I co-led the Series A of Dapper and CryptoKitties. So I just think that VC funding can play an important role in funding things. That might not be popular. The nature of VC funding is we have a very long term time horizon — 10 year funds — so we're able to fund things when other people aren't. That kind of persistence and commitment is sometimes overlooked, especially during boom times when funding is flowing. Of course, VC can mean a lot of things and there's a lot of different firms — some people call themselves VCs when they're really more like hedge funds or traders. But we roll up our sleeves, and I think play a valuable role in the startup ecosystem.","See also: If You're in Crypto, You're a Criminal","Your fund at a16z operates autonomously. Say on a 10 year horizon, if crypto grows, do you see the Crypto Fund diversifying further to have specific multi billion dollar funds focused just on DeFi or blockchain social media?","My hope is for blockchain to become synonymous with new internet innovation. In that case, I don't know exactly how we would structure it, but if you analogize it to the internet in the 90s, there were internet funds and internet investors and then, over time, there were more focused consumer internet, fintech and enterprise investors. Ideally, that would happen here.","There's a million other questions I could ask, wish we had more time.","How do you like the book?","I loved it, really. Maybe the best general introduction to crypto I’ve come across. Anything you wish I asked?","My hope is that crypto folks will like the book as much as you do. But really, I wanted a book that explains this all to the general public. There’s a big gap between why I'm excited and the general public, which has a more negative view. So, I really hope it becomes the book that people like to give to their friends and family and say, “Hey, this is why I'm excited.”","Was it significantly different writing the book versus Twitter threads?","I don't know if I fully understood what I was getting myself into. It was a ton of work. But it was gratifying and fun."],"entity":[{"type":"Stanford","content":"LOCATION"},{"type":"Apple Vision","content":"ORGANIZATION"},{"type":"November 2013","content":"DATE"},{"type":"Marc Andreessen","content":"PERSON"},{"type":"May 29","content":"DATE"},{"type":"Marc [Andreessen","content":"PERSON"},{"type":"Star Wars","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Andreessen","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Dan Boneh","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"trillions of dollars","content":"MONEY"},{"type":"Time to BUIDL","content":"ORGANIZATION"},{"type":"Lee","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"ABC","content":"ORGANIZATION"},{"type":"18","content":"DATE"},{"type":"Netscape","content":"ORGANIZATION"},{"type":"Steve Jobs","content":"PERSON"},{"type":"Discord","content":"LOCATION"},{"type":"State Department","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Zynga","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Columbia","content":"ORGANIZATION"},{"type":"Stanford","content":"ORGANIZATION"},{"type":"CERN","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Marc?","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Jan. 30","content":"DATE"},{"type":"Harry Potter","content":"PERSON"},{"type":"multi billion dollar","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Tim Roughgarden","content":"PERSON"},{"type":"Clinton","content":"PERSON"},{"type":"Dixon","content":"PERSON"},{"type":"CBS","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Wikipedia","content":"LOCATION"},{"type":"Homebrew Computer Club","content":"ORGANIZATION"},{"type":"last decade","content":"DATE"},{"type":"NBC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"DARPA","content":"ORGANIZATION"},{"type":"Ben [Horowitz","content":"PERSON"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Chris Dixon","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"Uniswap","content":"LOCATION"},{"type":"Tim Berners","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"2000s","content":"DATE"},{"type":"Bob Iger","content":"PERSON"}],"hashtag":["Opinion","A16z","Chris Dixon","open-source","Books","Web3","Venture Capital","VC","Technology","Consensus 2024"],"authors":["Daniel Kuhn"]}