{"summary":"Content creation and productivity are the main benefits of advisors utilizing AI tools. There are some helpful things that AI can do to help financial advisors.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/01\/crypto-for-advisors-ai-tools-for-advisors\/","publishDate":"2024-02-01T16:45:00","id":15960,"type":null,"title":"Crypto for Advisors: AI Tools for Advisors","category":["Finance"],"content":["We are told AI will revolutionize every business, and although the technology is relatively new, are advisors ready for AI crypto trading? Both AI and crypto investing require learning and regulatory maturity. At the same time, we don't see many tools ready for use today that will plug into a financial planner's business. AI for crypto trading aside, there are lots of pragmatic uses for AI that advisors can leverage. Brian Boughner from Fiduciary Alliance guides advisors on how to get started today.","Lynda Koster from Growthential answers questions about getting started with AI in the Ask an Expert section.","Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","*Please know this article is 100% human written*","About a year ago the world was discovering the phenomenon called ChatGPT and experiencing for the first time what Artificial Intelligence (AI) could do. A lot has changed since then and the growth of AI is now expanding at a rate no one could have imagined. Because of this rapid growth, it’s difficult to determine what is real versus hype with all of the noise being touted about AI.","It’s important to remember that we are only in Act 1 of the AI saga. This technology is still being discovered and developed. Act 2 will involve AI solving real human problems. While we are only in Act 1, there are still some helpful things that AI can do to help us in our role as financial advisors. Content creation and productivity are the main benefits of advisors utilizing AI tools.","Here are three tools that I have used as an advisor at my firm that have helped me save time and money. I do not receive any financial compensation from any of these solutions. You can also see videos on how these tools work at aiadvisortools.com.","Customized AI assistants","Many people have tried ChatGPT at least once. It’s a great way to start interacting with AI and learning how best to utilize it. One of their features if you subscribe to their 4.0 service are the customized AI assistants. You can create your own assistant and train them on your data, style, preferences, etc. so that the output is tailored to your needs. For example, my firm uploaded our compliance manual and trained the GPT assistant on all of our compliance procedures so our advisors now have a resource for compliance matters. The possibilities are endless here, but please remember that ChatGPT is not secure so do not upload any sensitive information.","AI generated learning courses","As financial advisors, a major part of our duties is educating our clients on financial matters. This of course takes a lot of time and effort to do effectively. What if you could easily create introductory courses around relevant topics like investing, insurance and retirement? Chat2course.com is a tool that utilizes AI to help you do this. It also has amazing customization where you can specify the length and tone of the content. By simply interacting with their prompts you can create relevant educational content for your target audience.","AI powered Internet searches","The days of internet searching where you type what you are looking for into a box and receive a list of links (half of which are sponsored) that you have to sort through are over. AI assisted internet searching is here and is a game changer. Perplexity.ai is an example of this where it not only searches the internet for answers to your question, it gives you the specific answer and also provides you with the websites it used to provide that answer. You can also utilize Microsoft’s Bing Copilot search engine in a similar way.","AI is disrupting knowledge based industries including digital assets. We are already seeing the emergence of a number of AI trading tools, robo advisors built for crypto and ChatGPT powered AI crypto analytics. As mentioned before, we are only in Act 1 as these tools are still being developed. Your priority as an advisor should be to simply set aside time to learn these tools.","You can either embrace this revolution or pretend this is just a short term fad that will eventually go away. If you choose to embrace it, then start using it. Start thinking about use cases in your practice where AI can help you be more efficient. If it’s data driven and repetitive, then there is a good chance AI can perform that task. Good or bad, AI is not going away. By simply using the three tools in this article, you can stay ahead of the curve in this new world of AI.","- Brian Boughner, co-founder, Fiduciary Alliance","Q: How should I get started with Generative AI?","A: The first step in adopting generative AI in your practice is to educate yourself and your team about its capabilities and limitations. Several courses available today cover the basics. Introductory courses can be found at online courseware providers such as Coursera, Udemy, LinkedIn Learning, and in online business courses at institutions like MIT, Kellogg School of Management, and Cornell, to name just a few. If you plan to experiment with some of the mainstream tools to start, make sure NOT to include any personal, client, private, or sensitive data or information. This is important for beginners as they grow their learning and begin to fully understand the proper safeguards that need to be in place.","Q: How can I ensure the accuracy of information generated by AI tools?","A. After gaining a foundational understanding of generative AI and beginning to experiment with various tools, it's crucial to thoroughly fact-check the generated content. Mainstream generative AI tools, while sophisticated, can still produce inaccuracies and biased information. To mitigate this, cross-reference AI-generated information with your own expertise in financial advisory along with additional credible sources. Remember, the responsibility for ensuring the accuracy and integrity of AI-generated content ultimately lies with the user.","Q: What strategies can I use to integrate Generative AI into my financial advisory practice?","A: The insights provided in the article above serve as a solid foundation for understanding some great use cases for generative AI. Building on this, the integration of generative AI into a financial advisory practice involves a thoughtful blend of understanding the tools and capabilities with business insight. As this landscape continues to evolve at such a rapid pace, it's essential to establish a strategy and governance model that not only aligns with you and your clients’ business goals but also operates within the bounds of relevant regulations and ethical guidelines. Such a model should include regular monitoring and evaluation of AI tools to ensure they meet your objectives and maintain compliance. Implementing a governance framework contributes to a responsible and strategic use of AI, mitigating risks and potential unintended consequences. With this approach, you can effectively and ethically incorporate AI into your financial services, enhancing value to your clients while upholding professional standards.","— Lynda Koster, co-founder & managing partner, Growthential","The United States Commodity Futures Trading Commission warned investors about using AI trading bots to “pick” the next crypto winner.","AI and bitcoin - stronger together? From increased development to AI fees in crypto, these technologies may advance each other’s adoption.","The Securities and Futures Commission of Hong Kong’s received the first spot bitcoin ETF application submitted by Chinese asset management firm Harvest Fund Management.","Edited by Bradley Keoun."],"entity":[{"type":"Lynda Koster","content":"PERSON"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Act 1","content":"DATE"},{"type":"S.M.","content":"LOCATION"},{"type":"Kellogg School of Management","content":"ORGANIZATION"},{"type":"GPT","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Fiduciary Alliance","content":"ORGANIZATION"},{"type":"Growthential","content":"LOCATION"},{"type":"Coursera","content":"LOCATION"},{"type":"Udemy","content":"LOCATION"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"Harvest Fund Management","content":"ORGANIZATION"},{"type":"Microsoft’s Bing Copilot","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Brian Boughner","content":"PERSON"},{"type":"United States Commodity Futures Trading Commission","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","AI","Artificial Intelligence","Chatgpt"],"authors":["Sarah Morton","Brian Boughner"]}