{"summary":"The launch of Mythical Marketplace 2.0 follows the studio's acquisition of gaming marketplace DMarket.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/01\/25\/web3-gaming-studio-mythical-games-releases-new-marketplace\/","publishDate":"2023-01-25T12:00:00","id":15968,"type":null,"title":"Web3 Gaming Studio Mythical Games Releases New Marketplace","category":["Web3"],"content":["Web3 gaming studio Mythical Games is rolling out Mythical Marketplace 2.0, its new digital game asset marketplace, the company said Wednesday.","Mythical Games also acquired gaming asset platform DMarket to help build out the new product. The company will provide Mythical with the infrastructure for the Mythical Marketplace 2.0 that will allow users to purchase gameplay assets. The marketplace will incorporate DMarket’s anti-money laundering and fraud protection standards, as well as foster a community-oriented marketplace focused on digital ownership.","John Linden, CEO of Mythical Games, told CoinDesk the new marketplace will usher in a new digital ownership economy while onboarding new gamers into Web3.","“Our core audience really is introducing gamers into these mechanics,” said Linden. “You're just you're playing the game – you're buying items in the game and we're doing all the hard and heavy lifting behind the scenes,” said Linden.","Since Mythical’s Ethereum-compatible chain went live six weeks ago, it has processed over 2 million transactions. Still, the company continues to feel the effects of a prolonged crypto winter and market uncertainty.","In November, Mythical laid off 10% of its employees, citing rapid growth during the bull market and the need to restructure. Weeks later in December, the firm said they were planning to sue three former executives who left the company to start a new firm, Fenix Games, with capital they had intended to raise for Mythical.","Linden noted that while he can’t discuss the details of the litigation, he is hopeful that it will soon be resolved for the sake of employees and investors."],"entity":[{"type":"Fenix Games","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"John Linden","content":"PERSON"},{"type":"Linden","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":["NFTs","Web3","Mythical Games"],"authors":["Cam Thompson"]}