{"summary":"Interest on the ETF's cash balances helps offset the cost of rolling from one set of futures to the next, ensuring a low performance discrepancy, the firm said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/07\/21\/proshares-says-bitcoin-etf-has-matched-btc-price-closely-roll-cost-concerns-are-unwarranted\/","publishDate":"2023-07-21T08:36:05","id":15964,"type":null,"title":"ProShares Says Bitcoin ETF Has Matched BTC Price Closely, 'Roll Cost' Concerns Are Unwarranted","category":["Markets"],"content":["ProShares, the issuer of the first U.S. bitcoin futures-linked exchange-traded fund (ETF), said concerns that costs associated with trading of the derivatives would lead to tracking errors are unfounded and the product has closely mimicked bitcoin's spot-price performance since day one.","The ProShares Bitcoin Strategy Fund began trading under the ticker BITO on the New York Stock Exchange in October, 2021, allowing investors to gain exposure to bitcoin (BTC) without having to own the cryptocurrency. The ETF, the world's largest crypto fund, invests in regulated and cash-settled bitcoin futures listed on the Chicago Mercantile Exchange (CME).","From the very beginning, observers speculated BITO and other futures-based ETFs would significantly underperform bitcoin due to costs associated with rolling over, or selling expiring futures contracts and buying the next set. Usually, longer-dated futures contracts trade at a premium to those closer to expiry, a condition known as contango. The contango tends to steepen during bull runs, and the steeper the contango, the higher the costs, and the so-called contango bleed.","\"Concerns about the roll costs are misguided; BITO has closely tracked bitcoin's price since inception,\" Simeon Hyman, global investment strategist at ProShares, told CoinDesk in an email interview. \"Since its inception (through 7\/18), BITO has returned -54.5% compared to -51.5% for bitcoin. And over half of that modest difference is BITO's fee of 95bps per annum.\"","Bitcoin's recent rally and the resulting widening of contango at the end of June have revived concerns about the roll costs and strengthened calls for spot-based ETFs, which invest directly in bitcoin and eliminate the need to roll over positions. Since June 15, a number of traditional finance giants like BlackRock, Invesco and others have filed applications with the U.S. Securities and Exchange Commission (SEC) for spot-based bitcoin ETFs.","According to Hyman, BITO continues to closely track the spot price as the fund's interest income from cash holdings compensates for the roll costs, which are closely tied to the level of interest rates in the U.S. economy.","\"For a financial future with no storage costs, as is the case with the CME bitcoin futures, the futures contract premium should be in the ballpark of the term-equivalent interest rate. The Fed's raising of the benchmark interest rate by 500 basis points since March 2022 has been a key driver of those premiums, and consequently the roll costs of a bitcoin futures strategy,\" Hyman said.","\"Here's the key piece of the puzzle. BITO earns interest on its cash balances which are driven by those same term-equivalent interest rates, which offset the roll costs. The result is close tracking to the price movements of spot bitcoin,\" Hyman added.","As Hyman says, one component of futures prices is interest rates, and the U.S. Federal Reserve has lifted its target range to 5%-5.25% to control inflation. Other variables include the price of the underlying asset, storage costs and convenience yield. The CME bitcoin futures are cash-settled, so there also no storage costs.","BITO earns interest from its cash holdings. The interest income is paid out in monthly dividends and covers the roll decay in the fund. BITO has paid dividends six times this year.","When asked if potential spot ETFs would drive investors away from futures-based products, Hyman said it's tough to speculate on products that don't exist.","\"BITO’s track record of performance and flows are a testament to the effectiveness of a bitcoin futures strategy within an ETF and investor interest,\" Hyman noted.","As of July 18, the ProShares ETF had $1.1 billion in assets under management. It has seen year-to-date inflows of $336.2 million. Since its inception, the fund has amassed $2.2 billion in investor money.","The market expects a potential launch of spot-based ETFs to unlock floodgates for institutional money.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Simeon Hyman","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"BITO","content":"ORGANIZATION"},{"type":"$2.2 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"July 18","content":"DATE"},{"type":"-54.5%","content":"PERCENT"},{"type":"Hyman","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"-51.5%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"5.25%","content":"PERCENT"},{"type":"October, 2021","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"BITO","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"June 15","content":"DATE"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$336.2 million","content":"MONEY"}],"hashtag":["Bitcoin","ETF","ProShares","ProShares Bitcoin Strategy ETF","Markets"],"authors":["Omkar Godbole"]}