{"summary":"Teams are still looking for members. Join a team and submit your project idea by Aug. 7.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/07\/22\/its-not-too-late-to-join-coindesk-and-cradls-web3athon\/","publishDate":"2022-07-22T16:14:09","id":15973,"type":null,"title":"It’s Not Too Late to Join CoinDesk and CRADL’s Web3athon","category":["Technology"],"content":["When you hear the word hackathon, you typically think of developers buried deep in their computers, furiously typing code. CoinDesk and CRADL’s Web3athon isn’t that kind of hackathon.","Web3athon is an entirely new form of competition, one that welcomes talent and creativity from all backgrounds and seeks to discover new ways crypto and Web3 technologies can be used to improve people’s lives. The more diverse talents your team brings to the table, the more poised you are to take home part of the $800,000 prize.","Read more: Register by July 7 to Join CoinDesk's Hackathon With CRADL and HackerEarth","Web3athon is not like other hackathons. It’s a hackathon for anyone interested in using technology to solve some hyperlocal challenges.","To participate in Web3athon you don’t need to know how to code. You also don’t need to be a blockchain expert. You could be a writer, a designer or a human-centered researcher. All you need to bring to the table is your unique set of talents and skills and a passion for improving lives.","Below, find a list of roles that make for a well-rounded team.","Read more: How to Build Your Web3athon Team","Unlike with other hackathons, CRADL is making sure you are set up for success. If you are passionate about using technology to improve lives but don’t have the time to research hyperlocal challenges or blockchains, then you are in luck. CRADL has put together a wealth of resources to help you lay the foundation of your project.","These resources are readily available on Web3athon’s welcome page.","The hard deadline for registration and ideas submission is Aug. 7. To join, you must first register through HackerEarth. You do not need to register as a full team. Just include information about yourself.","After you register, you can look for teams in need of your unique skill set on the Web3athon Discord channel #team-formation. Feel free to send a message to the group asking to join a team or inviting others to join yours.","Learn more about Web3athon and register today."],"entity":[{"type":"$800,000","content":"MONEY"},{"type":"July 7","content":"DATE"},{"type":"HackerEarth","content":"LOCATION"},{"type":"Aug. 7","content":"DATE"}],"hashtag":["Hackathon","no-livewire"],"authors":["CoinDesk Staff"]}