{"summary":"A high-profile failure in crypto’s burgeoning “real-world assets” niche may be about to offer some relief to investors.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/10\/12\/usdr-issuer-to-salvage-failed-property-backed-stablecoins-assets-make-users-whole\/","publishDate":"2023-10-12T12:12:02","id":15971,"type":null,"title":"USDR Issuer to Salvage Failed Property-Backed Stablecoin’s Assets, ‘Make Users Whole’","category":["Finance"],"content":["Crypto’s latest depegging disaster may take a turn for the better for affected investors. The issuer of failed real estate-backed stablecoin USDR plans to liquidate the token’s assets and hold a redemption.","“Our focus now is to make users whole,” Michael Slatkin, who leads marketing for USDR issuer Tangible, said in the group’s Discord server late Wednesday.","Holders of USDR will be able to redeem their severely devalued stablecoins for a mix of cryptocurrency assets, some of which represent real estate in the U.K., according to an announcement on the server. It's unclear how much value the redemption process – which could take months – will ultimately return for investors.","USDR fell from its $1 peg to nearly 50 cents this week after much of the asset’s DAI reserves got drained by investors fleeing the token, which is backed primarily by real estate holdings.","It’s among the first high-profile failures in a niche sector of the crypto markets called real-world assets (RWA) whose proponents find various ways to tokenize more traditional investments like real estate and treasuries. The $45.5 million USDR in circulation was trading at a 44% discount at press time.","The real estate investments that represented 78% of USDR’s backing also generated yields as high as 16% for its investors, according to the project. This supposedly made the stablecoin more appealing than more common dollar-pegged assets, like Circle’s USDC.","But it also made it riskier. Circle keeps much of its stablecoin’s reserves in highly liquid (and incredibly safe) short-term Treasury bonds. In contrast, USDR’s more speculative, illiquid real estate assets can’t be sold quickly to meet the bank run-like conditions that played out this week, one investor said.","Tangible, which specializes in creating such RWAs, will abandon USDR once the redemption is complete according to Slatkin’s statement.","“We tried something new, we learned from the experience, and we’ll keep building,” Slatkin said in the announcement. “New products, both announced and unannounced, will improve on what was developed for Real USD and Tangible will continue to be a leader in the category.”","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$45.5 million","content":"MONEY"},{"type":"USDR","content":"ORGANIZATION"},{"type":"Slatkin","content":"PERSON"},{"type":"78%","content":"PERCENT"},{"type":"U.K.","content":"LOCATION"},{"type":"44%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"50 cents","content":"MONEY"},{"type":"late Wednesday","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Michael Slatkin","content":"PERSON"}],"hashtag":["Real World Assets","Property","Real Estate","Stablecoins"],"authors":["Danny Nelson"]}