{"summary":"From airdrops to advertising, CoinList's Alex Topchishvili examines the effective ways crypto projects entice crypto traders to become longterm customers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/06\/5-strategies-for-acquiring-users-on-chain\/","publishDate":"2023-11-06T13:48:36","id":15989,"type":null,"title":"5 Strategies for Acquiring Users On-Chain","category":["Consensus Magazine"],"content":["User acquisition in crypto is broken and underdeveloped. Most projects don’t have a clear idea on how to acquire users, how their users interact with their applications, or where their users come from. Ask a crypto project what their LTV (lifetime value of a customer) or CAC (customer acquisition cost) is and you might receive some blank stares or fluffy answers.","This post is part of Consensus Magazine's Trading Week, sponsored by CME. Alex Topchishvili is the director of marketing at CoinList.","The reason for this is simple. Marketing is all about knowing your audience, but since crypto wallets are anonymized by design (on-chain and off-chain user identities are distinct), crypto marketers struggle to identify and communicate with potential customers.","Even those pseudo-anonymous individuals who are already your customers are difficult to communicate with as they can’t be identified among the large group of followers that projects have on Discord, Twitter or Telegram.","Luckily for marketers, the past couple years saw tremendous progress in on-chain identity and attribution. On-chain activity represents a new data set that can be used to construct user profiles and segment cohorts. Minting a non-fungible token (NFT), participating in a governance vote, using dApps on a specific chain or participating in a testnet are actions that signal meaningful interest and high intent.","In this piece, I’ll summarize the pros and cons of five user acquisition strategies that crypto projects might consider deploying.","Airdrops are a user acquisition and community building mechanism whereby a crypto project sends free tokens to members of their community in a bid to encourage adoption. In most cases, an airdrop is issued to users in exchange for completing a certain task related to the product offering or on-boarding journey like linking a wallet, following a social media account, sending or receiving a transaction, or minting an NFT.","Thanks to the transparency of blockchains, on-chain activity can also be leveraged for curating airdrop recipient selection. Most frequently, on-chain activity is recorded within a specific timeframe, after which a snapshot is taken to determine airdrop eligibility.","Airdrop eligibility can be done retroactively (e.g. Arbitrum), proactively (e.g. Blur) or through some combination (e.g. Optimism).","There are two challenges with airdrops as an acquisition model. Similar to the \"blitzscaling\" days of Uber, Netflix, etc, it’s not clear that users are interested in your product at a sustainable price point. Are users interested in your product or simply the free money?","Moreover, airdrops are easy to game. Because airdrops happen on-chain, there are few reliable ways for a project to evaluate a recipient’s off-chain reputation or identity. This creates two problems:","Without sufficient curation of the token recipients, airdropped tokens are often dumped immediately, causing price crashes, harm to the overall ecosystem and little (if any) real user acquisition. This is well illustrated by the botched airdrop that saw many airdrop recipients of Optimism's tokens immediately selling the freshly claimed tokens, driving the price of the OP token down over 70%.","Another interesting user acquisition channel that has picked up some traction this year is using crypto native ad networks that use on-chain data to deliver personalized and relevant content to crypto natives on dApps. In other words, crypto native versions of Google AdSense.","Rather than using cookies, these platforms use wallet and on-chain data for targeting, segmentation and cohort construction. The ad networks enable projects to monetize their dApps with display ads and advertisers to reach active crypto users.","The challenge of working with crypto native ad networks like Slise, HypeLab, Pr3sence, BlockchainAds and others is that the publishers they work with have limited reach. High quality crypto traffic is very difficult to acquire, and with the exception of media platforms like CoinDesk, CoinMarketCap, CoinGecko, CoinTelegraph and a couple more, there are very few ways of reaching interested audiences of users at scale.","This dearth of publishers in crypto is known as the “publisher problem,” and is made more difficult by the fact that most popular dApps like Uniswap, OpenSea or Magic Eden do not feature ads. The total dApp market is still small and amateur, and it will take time for projects to open up to placing ads and for their volume of traffic to grow.","One way to solve the “publisher problem” mentioned above is to target crypto users on traditional Web2 social networks like Facebook and Twitter. This is a complex and novel channel, but also one with a massive reach and distribution given the scale of Web2 social networks.","One crypto marketing company leading the charge in this category is Addressable, which allows marketers to connect the dots between on-chain blockchain data and off-chain social media accounts.","By leveraging machine learning and big data analysis, Addressable finds relationships between anonymous wallets and social media accounts, creating a channel for marketers to target crypto users in Web2. Once a custom audience segment is available, marketers can launch targeted ad campaigns on mainstream social media platforms like Twitter, TikTok, Instagram and Reddit.","Addressable is running several pilot campaigns with brands like Bancor and Immutable X and I look forward to tracking the results of those initial campaigns.","Quests have grown to be the de-facto native ad-unit in crypto, given the lack of effectiveness in other channels. Quests are incentivized rewards campaigns on platforms like Layer 3, Rabbithole and Galxe that reward users with crypto when they complete specific value-add on-chain actions (i.e. trade, stake, swap, lend, follow on Twitter, join Discord, etc).","Given the huge user friction in crypto applications, the user is presented with a set of tasks and quests with rewards at each stage for onboarding. For new users, it is a way to earn crypto while learning and building credentials to become a contributor to emerging projects. For crypto projects, it is a way to identify and acquire quality contributors based on their credentials and value-adding activities.","By incentivizing that initial taste of a product, builders hope to draw long-term users into the experience. The quest platforms generally charge for campaigns either on a per-campaign or per-completed-quest basis. Whatever the payment model, you will end up with a CAC from the campaign and will therefore be able to quantify the return on ad spend (ROAS) that will evaluate the performance of the campaign.","One big question for quest platforms is the quality of traffic they attract. Given that many quests follow the same airdrop model of earning tokens, quests often attract bots (or real users) chasing freebies. Once they pass quests challenges and obtain the reward, they churn and leave you with little to no retention.","See also: UK Regulator Publishes Guidance for Crypto Marketing Regime","Nonetheless, there appears to be some success in this model of capturing retained users. The question is how do you further target the potential real users while weeding out the bots to increase ROI on the campaign. When choosing a quest platform, make sure to ask for case studies and a breakdown of the userbase to make sure it matches the users you actually want to have.","Traditional tech companies have grown tremendously through large partnerships and integrations, and the crypto world has successfully adopted this strategy.","In the DeFi [decentralized finance] world, integration with other projects is a massive growth channel. DeFi protocols are composable, meaning they can be programmed to interact with and build on one another like building blocks.","This allows developers to bootstrap their own communities without having to build everything from scratch. When MakerDAO was launching Dai, their algorithmic stablecoin, their go-to-market strategy consisted of","Similarly in the crypto gaming world, a major growth channel is partnerships with guilds. A gaming guild is essentially a group of gamers that play together, share data and in-game assets, and support other gamers. Guilds such as Yield Guild Games and Good Games Guild allow new players to start playing a game by loaning them game assets that they might otherwise not be able to afford. They also help crypto games with user acquisition through scholarships, co-marketing and other direct contributions.","See also: Post-FTX, Bitcoin Is Ready for its Next Chapter","The challenge with crypto partnerships is that since many projects are decentralized, negotiations take place in governance forums rather than in conference rooms behind closed doors. The transition from founders-led towards community-led governance is complicated, and raises difficult questions around ongoing development, voter participation, and incentive alignment between stakeholders. It is critical that whatever partnership or integration is voted on is actually beneficial to the protocol and all its participants.","Whether it’s through product integrations, joint AMAs, or joint marketing initiatives, when you do have an opportunity to cross-pollinate and leverage your partner’s marketing reach, make it count.","CoinDesk does not share the editorial content or opinions contained within the package before publication and the sponsor does not sign off on or inherently endorse any individual opinions."],"entity":[{"type":"Good Games Guild","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Google AdSense","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Yield Guild Games","content":"ORGANIZATION"},{"type":"Rabbithole","content":"PERSON"},{"type":"CoinList","content":"ORGANIZATION"},{"type":"UK Regulator Publishes Guidance for Crypto Marketing Regime","content":"ORGANIZATION"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"LTV","content":"ORGANIZATION"},{"type":"CoinTelegraph","content":"ORGANIZATION"},{"type":"Addressable","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Alex Topchishvili","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":["Opinion","Trading Week 2023","Advertising","Marketing","Airdrops","CoinList"],"authors":["Alex Topchishvili"]}