{"summary":"Luke Dashjr's technical proposal sounded innocuous enough: to make the popular Bitcoin Core software \"effective with newer datacarrying styles.\" In reality, the effort represented a sophisticated but controversial plan to block the suddenly popular \"inscriptions\" known as \"NFTs on Bitcoin.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/01\/09\/bitcoin-developers-proposal-to-stop-spam-nfts-gets-shut-down\/","publishDate":"2024-01-09T19:28:02","id":15986,"type":null,"title":"Bitcoin Developer's Proposal to Stop 'Spam' NFTs Gets Shut Down","category":["Technology"],"content":["One of the most controversial proposals to hit Bitcoin in years – a move that would have made it harder to mint NFTs and tokens atop the blockchain – has been abruptly terminated without any action being taken, leading to claims of censorship by the lead proponent for the change.","The developer known publicly as Luke Dashjr, who has worked on Bitcoin for over a decade, created the proposal in September. The move came just months after the appearance of Ordinals, a protocol that allowed users to \"inscribe\" data onto the blockchain, such as NFTs or the specifications for new tokens. The Ordinals project quickly became so popular that it caused congestion on the network. The Bitcoin-based NFTs – previously only available on other blockchains, like Ethereum – have proven valuable in their own right, with a trio of \"BitcoinShrooms\" recently fetching about $450,000 in a sale at the historic auction house Sotheby's.","Dashjr filed his proposal on the open-source developer platform Github under the very mundane and technical-sounding goal of updating the popular Bitcoin Core software \"to be effective with newer datacarrying styles.\" But the discussion quickly turned into an acrimonious debate over whether the 14-year-old blockchain should be preserved as a peer-to-peer payments network or if market forces should determine which transactions get prioritized.","Even some experts who supported a more purist vision for the blockchain expressed skepticism that Dashjr's proposal to filter out the Ordinals transactions could win over Bitcoin miners, who play a key role in the network's operations and have benefited handsomely from the fee windfall.","Read more: Ordinals Upend Bitcoin Mining, Pushing Transaction Fees Above Mining Reward for First Time in Years","A few days ago, Ava Chow, a Bitcoin Core maintainer, abruptly cut off further discussion of Dashjr's proposal – technically known as a \"pull request\" or PR – without taking any action to incorporate the fresh code.","According to the web page for the open-source Bitcoin Core project, maintainers are responsible for adding code changes that \"the team agrees should be merged.\"","\"It's abundantly clear that this PR is controversial and, in its current state, has no hope of reaching a conclusion that is acceptable to everyone,\" Chow wrote. \"At this point in time, I see no reason to leave this open and to continue to send notifications for the constant back-and-forth stalemate discussion.\"","Another Bitcoin Core maintainer, Gloria Zhao, tweeted out a summary of the debate on Github, including a recap of the technical details.","The thrust of Dashjr's proposal was to apply strict data-size limits more broadly to Bitcoin transactions, similar to the hard 80-byte limit applied to a specific data field known as \"OP_RETURN.\"","\"There's been a lot of talk about adding filters to keep Ordinals TXs out of bitcoin, and this is a pretty sophisticated way to do that,\" said Lisa Neigut, a Blockstream developer who also teaches courses for Bitcoin developers at Base58. \"It would basically make getting Ordinals into blocks very hard to do using the normal TX delivery pipeline.\"","Zhao, in her summary, noted that the effort to \"Stop inscriptions\" as \"spam\" had been countered by arguments that \"We cannot write code to detect all embedded data.\"","In response, Dashjr tweeted that \"you conveniently left out that the objections to the PR have already been refuted\/answered,\" and that Chow had \"censored anyone who wants to reply.\"","Read More: 'Bitcoin NFT' Hysteria Comes to Sotheby's as Super-Mario-Style Mushroom Character Tops $200K","Dashjr, who has been pushing to purge from Bitcoin what he once described as \"data storage schemes\" since at least 2014, made headlines recently when his firm Mummolin raised $6.2 million in a seed funding round led by Block Inc.'s head and Twitter founder Jack Dorsey.","Notably, leaders of the company's Ocean bitcoin mining pool signaled last month that the new project might filter out many transactions involving the Ordinals inscriptions.","CoinDesk reached out to Dashjr for comment, and he responded by sending a link to a fresh post he wrote on Github a few days ago.","The proposal to \"fix the bug\" was \"inappropriately closed due to social attacks,\" Dashjr wrote on Github. \"This remains an active issue that needs to be addressed.\"","A slew of comments have already piled up on the new thread, starting a new debate on the topic.","After publication of this article, Dashjr tweeted, \"Spam filtering isn't dead until the spam is dead.\"","Read more: Bitcoin Inscriptions Divide BTC Community Amid Network Congestion, but Are 'Unstoppable'","Edited by Aoyon Ashraf."],"entity":[{"type":"2014","content":"DATE"},{"type":"Chow","content":"PERSON"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"Lisa Neigut","content":"PERSON"},{"type":"Dashjr","content":"ORGANIZATION"},{"type":"Bitcoin NFT","content":"ORGANIZATION"},{"type":"$6.2 million","content":"MONEY"},{"type":"$450,000","content":"MONEY"},{"type":"$200K","content":"MONEY"},{"type":"Github","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Gloria Zhao","content":"PERSON"},{"type":"Bitcoin Inscriptions Divide BTC Community Amid Network Congestion","content":"ORGANIZATION"},{"type":"Pushing Transaction Fees Above Mining Reward for First Time in Years","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Sotheby's","content":"ORGANIZATION"},{"type":"Dashjr","content":"PERSON"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"Ava Chow","content":"PERSON"},{"type":"Block Inc.","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ordinals Upend Bitcoin Mining","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Ordinals protocol","Ordinals","NFTs","Bitcoin","Bitcoin Core","GitHub"],"authors":["Bradley Keoun"]}