{"summary":"The crypto trading platform is trying to take the high road as it launches its largest marketing campaign to date in the U.S. and UK.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256712\/kraken-steers-clear-of-fomo-with-largest-ad-campaign-to-date","publishDate":"2023-10-16T11:06:52","id":1598,"type":null,"title":"Kraken steers clear of FOMO with largest ad campaign to date","category":["EXCHANGES"],"content":["During the last crypto bull run, with prices skyrocketing across the board, much advertising leaned into convincing people they might be missing out on a new way to make money. Now, deep into a prolonged bear market, trading platform Kraken is switching gears.","\"All the marketing that was happening around two years back was all around FOMO, get rich quick,\" said Kraken Chief Marketing Officer Mayur Gupta, who added his company's approach aims to convince people that everything should continue to evolve, even the world of finance.","\"A lot of what you're seeing ... is a focus on what is broken in the current traditional financial ecosystem, rightly so,\" he told The Block. \"But we strongly believe that that is not enough to bring the next billion people in the world to leverage and understand the depths of crypto.\"","Billed as the cryptocurrency trading exchange's biggest advertising campaign to date, Kraken hopes to capitalize on some <a href=\"https:\/\/www.theblock.co\/post\/240124\/kraken-share-of-us-spot-trading-volumes-reaches-18-month-high\" data-v-f87c67ca=\"\">recent growth<\/a> with a new marketing push designed to convince would-be users of what is says are the transformational aspects of embracing digital assets. Kraken's new campaign comes at a time when rival exchanges like Binance and Coinbase have faced regulatory headwinds in the U.S., the world's largest market for crypto.","The company's new campaign also takes a decidedly educational approach in the hopes of making people feel more comfortable with crypto. In a blog post, Kraken <a href=\"https:\/\/www.theblock.co\/post\/148929\/lack-of-knowledge-about-bitcoin-is-the-biggest-barrier-to-use-finds-new-study-by-block-inc\" data-v-f87c67ca=\"\">cited a story<\/a> from The Block which stated that \"51% of people ... haven’t purchased any bitcoin because they don’t know enough about it.\"&nbsp;","While Kraken has advertised in the past, including a <a href=\"https:\/\/www.theblock.co\/post\/223391\/kraken-f1-williams-racing\" data-v-f87c67ca=\"\">Formula 1 partnership<\/a>, Gupta said the exchange has never executed a direct-to-consumer marketing strategy of this scale. The campaign is initially launching in the U.S. and UK with plans to expand globally next year, said Gupta.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gupta","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Mayur Gupta","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kraken Chief Marketing","content":"ORGANIZATION"},{"type":"Kraken","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"}],"hashtag":["KRAKEN"],"authors":["RT Watson","The Block"]}