{"summary":"A strangle is essentially a bet that bitcoin’s price won’t break out anytime soon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/07\/09\/traders-make-money-selling-strangles-as-bitcoin-goes-quiet\/","publishDate":"2021-07-09T18:41:03","id":15983,"type":null,"title":"Traders Make Money Selling 'Strangles' as Bitcoin Goes Quiet","category":["Markets"],"content":["","It's turning out to be a boring summer for directional traders in the bitcoin market: The cryptocurrency has gone comatose in a narrow range above $30,000, less than half the all-time high reached just two months ago. ","","","But some options traders are busy as ever, taking relatively high-risk strategies to profit from the cryptocurrency's continued price consolidation. One of those strategies involves putting on “short strangles,” essentially a bet that bitcoin’s price won’t break out anytime soon.","","","\"Our favorite trade continues to be short BTC strangles within the $30,000 to $40,000 range,\" Singapore-based QCP Capital, said in a Telegram post on June 30. \"With psychological resistance at $40,000 and strong support at $30,000, there's a good chance that BTC trades in this $10,000 range in the near future, which would likely cause implied volatility to collapse.\" ","","","QCP said this week its conviction about the short strangle has only strengthened, given the lack of market-moving catalysts in the short term. ","","","\"Right now, our trading plan follows the 2018 BTC analog where we expect a dampened trading environment from here to August (short volatility), followed by a rally,\" the firm said. ","","","Also read: Bitcoin Options Open Interest Hits 2021 Low as Frenzy Cools, or Maybe It’s Soccer","","","Short strangles involve selling out-of-the-money (OTM) call and put options with the same expiry. OTM calls are ones at strike prices higher than bitcoin's current level, while OTM puts have strikes lower than bitcoin's going price. At press time, bitcoin is trading near $33,600. So calls above $33,600 and puts at lower strikes are out-of-the-money. ","","","Deribit data tracked by Swiss-based Laevitas shows a high concentration of open interest at $30,000 put and $40,000 call expiring on July 30. It means recently executed short strangle trades mainly involved selling July expiry $30,000 put and $40,000 call. ","","","\"It's the most popular trade right now,\" said Pankaj Balani, CEO of Delta Exchange. \"For July, open interest remains highest for $30,000 strike puts, and $40,000 strike calls as traders write this range to collect the premiums.\" Selling is referred to as writing in options parlance.","","","Selling strangles is akin to taking a bearish view on implied volatility – the degree of price turbulence expected over a specific time. The implied volatility has a positive impact on the options price because demand for hedges typically rises during uncertainty. The metric drops during consolidation and picks up during a strong directional move. ","","","When traders take a short strangle by selling higher strike calls and lower strike puts, they are essentially betting the market will consolidate, leading to a drop in implied volatility and the option's price. ","","","A call seller offers insurance against a bullish move above a particular price level and receives compensation or premium for taking the risk. That is the maximum money a call seller can make, and the call buyer can lose. ","","","Similarly, a put seller offers protection against a bearish move below a particular price level and receives a premium for providing insurance. That is the maximum profit a put seller can make and the maximum loss the buyer may suffer. ","","","Also read: Bitcoin at $200K by Year’s End? Some Crypto Options Traders Make That Bet","","","So, when traders sell short strangles, the profit is limited to the extent of the premium received for selling calls and puts; that is, offering protection against bullish and bearish moves. However, the loss can be huge if the market breaks out of the range, charting a strong bullish or bearish move, and call\/put buyer claims insurance. ","","","Let's consider an example. Assume a trader foresees bitcoin's continued range of between $30,000 and $40,000 and executes a short strangle on Deribit by selling the July 30 expiry $30,000 put and $40,000 call. ","","","The $30,000 put is currently drawing a premium of 0.0365 BTC, and the $40,000 call is changing hands at 0.0169 BTC. So, by selling both the strangle writer receives a total premium of 0.0534 ($1,794 at bitcoin's current price of $33,600). ","","","The trader will retain 0.0534 BTC, or $1,794, if bitcoin remains between $30,000 and $40,000 until July 30. Deribit settles options at 8:00 a.m. UTC. The position will yield a loss if bitcoin trades above $40,000 or below $30,000 on expiry. ","","","Theoretically, the market can rise to infinity and fall to zero, meaning losses can be in multiples of the max gain, as suggested by the inverted U in the graph below. ","","","As Charles M. Cottle, author of \"Options Trading: The Hidden Reality,\" says in the book: \"The ideal situation for a premium [strangle] seller is to go to sleep after initiating the trade and wake up at the expiration with the price of the underlying at the short strike price.\" (Or in this case, at $30,000 or $40,000 or anywhere in that range.) ","","","However, the market never lets the trader, especially an option seller, rest. \"Be careful when selling premium,\" Cottle noted in the book, saying the market stretches out the trader's wallet from time to time, causing him to react for protection. ","","","For example, if bitcoin rises above $40,000 in the next few days, the premium for the $40,000 call would rise, yielding a loss for the seller. As such, the seller may have to square off the position or buy the cryptocurrency in the spot market or futures market to compensate for the losses in the short call position. ","","","In other words, selling a strangle and then managing the position is a costly affair best suited to traders or entities with ample capital supply. ","","","Though a risky bet, QCP Capital and other trading firms have favored short strangles for quite some time. \"There is yield to be harvested by selling calls and puts or strangles, if we think the market is going to consolidate around these levels,\" Shillian Tang, chief investment officer at the $135 million crypto hedge fund LedgerPrime, told CoinDesk last month.","","","That's because bitcoin's one-month implied volatility traded significantly higher than its lifetime average and realized volatility following the mid-May sell-off. In other words, the volatility explosion looked overdone, and options appeared relatively costly and ripe to sell. Implied volatility is mean-reverting and cyclical in nature: a period of high volatility is followed by low-volatility consolidation.","","","The one-month implied volatility peaked above 140% on May 23. At press time, the gauge is seen at 83%. However, it's still richer than its lifetime average of 76%, according to data provided by Skew. ","","","\"If bitcoin manages to hold the bottom end of the current range convincingly, then one can expect strong range selling activity and implied volatilities getting crushed,\" Balani said. \"The seven-day implied volatility is at 87%, while the realized volatility is at 74%.","","","Also read: Reflation-Trade Rethink Keeps Bitcoin Under Pressure","","","Deribit Chief Commercial Officer Luuk Strijers said these low-volatility strategies are traded occasionally but do not amount to a significant percentage of the exchange’s volume yet. ","","","Edit: An earlier version of the article said the $40,000 put is changing hands at 0.0169 BTC. Its $40,000 call.",""],"entity":[{"type":"$33,600","content":"MONEY"},{"type":"8:00 a.m.","content":"TIME"},{"type":"BTC","content":"ORGANIZATION"},{"type":"76%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Pankaj Balani","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$1,794","content":"MONEY"},{"type":"Luuk Strijers","content":"PERSON"},{"type":"74%","content":"PERCENT"},{"type":"Bitcoin Options Open Interest Hits 2021","content":"ORGANIZATION"},{"type":"Shillian Tang","content":"PERSON"},{"type":"Crypto Options Traders Make","content":"ORGANIZATION"},{"type":"Cottle","content":"PERSON"},{"type":"140%","content":"PERCENT"},{"type":"August","content":"DATE"},{"type":"May 23","content":"DATE"},{"type":"Balani","content":"PERSON"},{"type":"July 30","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"Delta Exchange","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"87%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$200K","content":"MONEY"},{"type":"83%","content":"PERCENT"},{"type":"OTM","content":"ORGANIZATION"},{"type":"Charles M. Cottle","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$135 million","content":"MONEY"},{"type":"Swiss","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"$40,000","content":"MONEY"}],"hashtag":["Derivatives","Bitcoin","Options","Bitcoin Options","Cryptocurrency Markets"],"authors":["Omkar Godbole"]}