{"summary":"The brokerage firm lifted its rating on the crypto exchange’s shares to market perform from underperform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/12\/coinbase-gets-another-upgrade-this-time-at-raymond-james-as-bears-capitulate\/","publishDate":"2024-03-12T21:03:14","id":15981,"type":null,"title":"Coinbase Gets Another Upgrade, This Time at Raymond James, as Bears Capitulate","category":["Technology"],"content":["Investment bank Raymond James is the latest Wall Street firm to revise its negative rating of the shares of crypto exchange Coinbase (COIN), after surging exchange-traded fund (ETF) inflows triggered a rally in the stock and bitcoin (BTC) pushed to all time highs.","While Raymond James said its long-term bias on Coinbase remained negative, the firm admitted to underestimating the impact that spot ETF inflows would have on the valuations of cryptocurrencies, particularly bitcoin.","Raymond James upgraded the stock to market perform from underperform. Coinbase shares closed 0.8% higher at $256.14. The changes and commentary were contained in a research report published Tuesday.","Despite the upgrade, the firm maintained a cautious tone.","“We continue to have substantial doubts about the firm’s long term earnings prospects given what we view as an essentially commoditized client offering, a tenuous long-term earnings outlook for cryptocurrency valuations that appears to be largely premised on the Greater Fool Theory rather than inherent value, and meaningful regulatory risk,” analysts led by Patrick O’Shaughnessy wrote.","“We would suggest that the longer this crypto rally persists, the greater the odds that a competitor attacks Coinbase with a disruptive pricing strategy,” the authors wrote.","Until ETF flows taper or reverse, the stock’s positive momentum is likely to persist, the report added.\n\nThe Wall Street investment bank Goldman Sachs last week abandoned its bearish stance on Coinbase shares, upgrading the stock to neutral from sell, citing higher crypto prices and increased retail participation.\n\nRead more: Coinbase Upgraded to Neutral as Goldman Sachs Ends Bearish Stance"],"entity":[{"type":"Neutral","content":"LOCATION"},{"type":"Coinbase Upgraded","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"0.8%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Raymond James","content":"PERSON"},{"type":"$256.14","content":"MONEY"},{"type":"Goldman Sachs Ends Bearish Stance","content":"ORGANIZATION"},{"type":"Patrick O’Shaughnessy","content":"PERSON"}],"hashtag":["Coinbase","Stock Market","Analysis","Upgrades","Equities","Raymond james","Goldman Sachs","Wall Street","Brokerages"],"authors":["Will Canny"]}