{"summary":"A controversial Optimism governance proposal is pushing for some wallets that sold the airdrop to be banned from future airdrops.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/06\/01\/optimisms-op-token-plummets-after-botched-airdrop\/","publishDate":"2022-06-01T20:11:08","id":15984,"type":null,"title":"Optimism's OP Token Plummets After Botched Airdrop","category":["Markets"],"content":["Ethereum scaling project Optimism’s new OP token is down over 70% after launching via a community airdrop on Tuesday.","According to data from CoinMarketCap, the price of the token has plummeted to $1.20 from $4.50, as many airdrop recipients immediately sold the freshly claimed tokens.","Assuming a total supply of 4.3 billion OP tokens, the latest trading price would imply a fully diluted market capitalization of $5.1 billion. But such calculations can be tricky, because less than 5% of the total supply is actually in the hands of investors who can trade them.","The much-anticipated airdrop was met with widespread frustration from the Optimism community, as panicked users complained that some claimants were able to claim their tokens ahead of the official airdrop launch.","Optimism officially tweeted about the launch at 5:45 p.m. ET, hours after the smart contract was already deployed and the token began trading on both decentralized and centralized exchanges.","“At 11am (EST) we deployed and loaded our [smart contract] with the OP tokens for Drop #1,” Optimism tweeted in the wake of the airdrop. “Our biggest mistake here was failing to make this contract pausable. Claims were open, and we had no way to stop them.”","Later on, the increased activity on Optimism led to transaction delays, leading to more frustration from the community and further delaying the official airdrop announcement.","“We significantly underestimated the amount of expected load [deploying our claims user interface] would have on our public RPC endpoint,” Optimism said in a tweet, referring to remote procedure call. “We quickly moved to massively expand the resources available to serve our public RPC, a process which took several hours of coordination (and waiting) for the amount of load we observed.”","The Optimism team added that there were “a lot of lessons” learned from the botched airdrop and they would be “publishing an extensive retrospective next week.”","According to data from Dune Analytics, just over 43% of eligible wallet addresses had claimed their share of the airdrop as of press time.","In response to the OP token dumping, an Optimism community member, 0xJohn, submitted a governance proposal that would ban sellers of the initial airdrop from receiving future Optimism airdrops.","“These accounts are not playing a constructive role in Optimism governance,” 0xJohn wrote. “Instead of contributing to governance, they are maximizing for profit.”","Some community members voiced disagreement.","“People can do what they want with their airdrops,” Optimism user Mohammedt75 wrote. “Only those actually interested in governance should actually be involved in governance.”"],"entity":[{"type":"70%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$1.20","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"43%","content":"PERCENT"},{"type":"5:45 p.m. ET","content":"TIME"},{"type":"$5.1 billion","content":"MONEY"},{"type":"RPC","content":"ORGANIZATION"},{"type":"$4.50","content":"MONEY"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["Optimism","Markets","Trading","Airdrops"],"authors":["Tracy Wang"]}