{"summary":"Created in 2017, the collection of generative pixel art-style cats was rediscovered in 2021 and quickly gained popularity.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-mooncats-the-legacy-nft-project-revived-by-its-community\/","publishDate":"2023-03-13T18:56:45","id":15992,"type":null,"title":"What Are MoonCats? The Legacy NFT Project Revived by Its Community","category":["Learn"],"content":["MoonCats is a non-fungible token (NFT) collection of 25,440 generative pixel art-style cats. It is considered to be one of the earliest NFT projects. It was created on Aug. 9, 2017, by Ponderware, a tech duo made up of Ethereum enthusiasts.","David, one of the project’s founders, said on Kevin Rose’s \"Proof\" podcast that he and his co-founder Jason were inspired by the potential and seemingly limitless possibilities of smart contracts. “Moon, cats, the internet – it just all sort of came together.”","According to MoonCatRescue's website, the lore centers on an \"insanely cute operation\" to save the cats from an imminent solar eclipse that threatened their existence.","Typically, generative NFT collections reveal the artwork to holders only after minting. MoonCats, however, gave collectors the ability to customize their cats before minting.","“One of our shared design goals … is empowering people, and that’s why it has a very fair distribution. We wanted people to choose which cats they got, and we wanted people to be able to customize them,” Jason said on the \"Proof\" podcast.","Though the project was initially successful, not all of the MoonCats were minted, and interest in the project eventually faded. In March 2021, a group of crypto historians rediscovered the project, which inspired other NFT collectors to mint the remaining MoonCats.","After all of the cats were minted, the project’s founders re-engaged with the community.","In total, there are 96 black and white “Genesis Cats” and 25,344 “Rescue Cats” that are colorful. Because of the limited supply, Genesis Cats are priced higher on the secondary market. Cats that were minted earlier are also considered more valuable.","The original collection contract used the ERC-20 token standard, though most NFTs have since adopted the ERC-721 token standard. In order to build out the MoonCats ecosystem, the project developers built “The Acclimator,” which allowed holders to choose to wrap their assets. Doing so gives their tokens full ERC-721 and ERC-998 functionality and makes them compatible with secondary marketplaces like OpenSea.","MoonCats are stored entirely on the Ethereum blockchain, and so the project doesn't rely on external services like IPFS to store the data and visuals.","Collectors were able to mint a MoonCat for free, minus the cost of gas, on the MoonCat Rescue site.","The collection is available for purchase on secondary marketplaces like OpenSea. Because of the Acclimator and process of wrapping the assets, there are two categories of MoonCats listed for sale:","Acclimated MoonCats (Acclimated):","Official Wrapped MoonCats (Acclimated) are NFTs that have been migrated to the ERC-721 standard. As of March 2023, more than 19,400 Acclimated MoonCats have been created.","Unwrapped MoonCats:","Original MoonCats created on the ERC-20 standard can be traded through the official MoonCats adoption center.","A buying guide has been published on the official MoonCats Community medium account to understand the rarity traits and ecosystem.","Beyond owning one of the earliest NFT projects, holders can also choose to further customize their MoonCats with accessories that will be included with the cat every time it changes hands. Creators and designers can also customize and upload their accessories to sell on the MoonCat Boutique website.","MoonCat holders can also use several applications to expand their NFT utility: Isotile lets users create a virtual room where MoonCats can be generated as animated voxel characters, while Worldwide Webb is an online cyberpunk-style world where MoonCats can be uploaded.","In October 2021, Sotheby's auctioned off three MoonCats, further creating buzz around the project.","The Photobooth allows MoonCat owners to create various images with their NFTs and associated accessories. The team also created Lootprints, which are the plans for a MoonCat spaceship and which were available to holders as a free mint in September 2021. According to the team, Lootprints will eventually transform into full spaceships and will be integrated into future MoonCat projects.","MoonCatPop is an official derivative of MoonCats and was released as a joint project between Ponderware and the MoonCat community. A maximum of 256 virtual Vending Machine NFTs, each with a specific flavor and MoonCat image, were designed.","Playing off of the Ethereum Name Service (ENS) launched in May 2017, the MoonCat Name Service (MCNS) is a free feature and domain for all MoonCat owners that comes attached to their MoonCat's mint ID and hex.","Ponderware started as a team of two and has since expanded. The intellectual property behind the project was sold internally for an undisclosed amount in September 2022.","Ponderware and MoonCats have since separated into two business entities, with the former continuing to work on technical consulting and their respective creative projects.","A Rug Radio Twitter Space on Sept. 8, 2022 clarified how ownership of MoonCats will unfold. As of Sept. 6 2022, ownership of the MoonCats project was transferred to pseudonymous Ponderware team members. Lead developer MidnightLightning and community manager Paws. Some former Ponderware staff members have stayed on the MoonCats team as volunteers.","According to the MoonCats Community website, MoonCatsRescue LLC, the company behind the project, “owns all legal right, title and interest in and to the MoonCatArt, and all intellectual property rights therein.” Holders are granted commercial rights to use the image of their MoonCat and to create derivative work based on their MoonCat. However, MoonCatRescue LLC retains ownership of all derivative works.","The MoonCats community has published a road map with its future long- and-short-term plans, including the expansion of \"The JumpPort\" to allow MoonCats to interact with layer 2 blockchains and be used for staking.","There are also plans to make MoonCats interoperable in different metaverse worlds, and a mysterious project called \"GravBalls\" promises an \"’idle’-style game, where human owners have some influence over the game's outcome in the setup and entering of their MoonCats into the game."],"entity":[{"type":"MoonCats Community","content":"ORGANIZATION"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"20","content":"DATE"},{"type":"October 2021","content":"DATE"},{"type":"Aug. 9, 2017","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ponderware","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"MoonCat Boutique","content":"ORGANIZATION"},{"type":"Sept. 8, 2022","content":"DATE"},{"type":"May 2017","content":"DATE"},{"type":"Lootprints","content":"PERSON"},{"type":"MoonCat Name Service","content":"ORGANIZATION"},{"type":"David","content":"PERSON"},{"type":"MoonCatRescue","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"MoonCatsRescue LLC","content":"ORGANIZATION"},{"type":"Kevin Rose","content":"PERSON"},{"type":"Moon","content":"PERSON"},{"type":"MoonCatRescue LLC","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"Rug Radio Twitter Space","content":"ORGANIZATION"},{"type":"MoonCats","content":"ORGANIZATION"},{"type":"Sept. 6 2022","content":"DATE"},{"type":"ERC","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"Jason","content":"PERSON"},{"type":"MoonCat Rescue","content":"ORGANIZATION"},{"type":"Webb","content":"PERSON"}],"hashtag":["Beginner","Learn","Web3","NFTs"],"authors":["Mason Marcobello"]}