{"summary":"Technically the Shanghai upgrade is only on the execution side of Ethereum. Capella is the simultaneous upgrade happening on the consensus side. Hence the merging of the two names to “Shapella.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/03\/02\/shanghai-capella-shapella-how-ethereum-devs-now-refer-to-upcoming-upgrade\/","publishDate":"2023-03-02T17:58:10","id":15994,"type":null,"title":"Shanghai + Capella = 'Shapella': How Ethereum Devs Now Refer to Upcoming Upgrade","category":["Technology"],"content":["Ethereum developers have started to refer to the blockchain’s upcoming hard fork – in this case a key upgrade – as “Shapella.”","It’s confusing, since crypto traders, analysts and industry executives have mostly referred to the hard fork – expected by next month – as “Shanghai.”","First things first: Technically it’s not wrong to call it the Shanghai upgrade.","But it’s tricky.","The Ethereum protocol is made up of two layers: the execution layer and consensus layer.","The reason this matters – in the context of what to call the Ethereum upgrade – is that it goes by different names on each layer. The execution layer will undergo the Shanghai upgrade, while on the consensus layer it’s known as “Capella.” So developers are cleverly referring to the whole thing as “Shapella.”","To understand what the two layers are, one needs to understand Ethereum prior to when it went through the last upgrade, the Merge.","Ethereum’s old proof-of-work blockchain was also known as the execution (application) layer. When Ethereum started its proof-of-stake (PoS) chain, also known as the consensus layer, developers were originally going to transition over to just the PoS chain. But that seemed to be too complicated of a task for developers, so they decided to merge the two chains together – hence the \"Merge.\"","Now, the two layers have different functions that help move the Ethereum blockchain forward. The execution layer is where all smart contracts and protocol rules live, while the consensus layer is in charge of making sure that all validators on the network are following those rules.","The Ethereum Foundation did not come out with a specific blog that has rebranded the upgrade to Shapella, but over time, the core developers have started to call it Shapella.","On Twitter, Ethereum developers shared that Shapella went live on Sepolia earlier this week, referring to the two components of the upgrade.","Read more: ‘Ethereum’ vs ‘Eth 2’: What’s in a Name?"],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Sepolia","content":"LOCATION"},{"type":"Shapella","content":"PERSON"},{"type":"Shapella","content":"LOCATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":["Ethereum","Shanghai","Shanghai upgrade","Staked","ETH","Ether"],"authors":["Margaux Nijkerk"]}