{"summary":"It may “take a long time” to figure out Genesis' assets and liabilities, Eric Snyder, partner at Wilk Auslander, told CoinDesk TV.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/01\/20\/whats-next-for-genesis-creditors-it-depends-on-whats-in-the-bankruptcy-filing\/","publishDate":"2023-01-20T20:28:57","id":15997,"type":null,"title":"What's Next for Genesis Creditors? It Depends on What's in the Bankruptcy Filing","category":["Policy"],"content":["Three of Genesis’ crypto lending businesses have filed for bankruptcy protection, and that means creditors will likely take some hits, according to Eric Snyder, a partner at Wilk Auslander LLP.","Snyder, chair of the firm’s bankruptcy department, told CoinDesk TV’s “First Mover” on Friday it's unknown right now how much of a \"haircut\" Genesis' creditors could suffer. A haircut refers to the lower-than-market value placed on an asset being used as collateral for a loan.","The Genesis companies' bankruptcy filings included a plan but not a “disclosure statement,” which typically includes what's in the plan, Snyder said.","\"The issue is, what is the value of the collateral?\" he said. It's one thing if the collateral is cash, real estate or marketable securities. But when it comes to crypto, \"it's very difficult to tell what the markets are. For example, if they're holding FTT coins, we know that's going to have very limited value. So we just need to understand what kind of crypto they're holding or the kind of collateral they're holding,\" Snyder said, referring the token issued by the failed FTX crypto exchange.","According to his reading of the Genesis petitions, “their goal is either to sell themselves in an asset sale, or substantially [place] all of their assets under a plan and then decide who gets the assets,” Snyder said. “If [they] can't be sold then they're going to transfer all the assets to a general unsecured creditor trust.”","Snyder said if the companies can’t make a sale, a trustee for the creditors would then “run the operation until a buyer” can be found, “basically admitting that they’re giving it up,” he said.","Genesis Global Holdco LLC, the holding company of crypto lender Genesis Global Capital, filed for Chapter 11 bankruptcy protection in the U.S. Bankruptcy Court for the Southern District of New York late Thursday. Also filing was Genesis Global Capital and Genesis' Asia-based subsidiary.","Genesis owes over $3.5 billion to its top 50 creditors. In a separate filing on Friday, Genesis said it has over $5 billion in liabilities.","Still, it may “take a long time” to figure out Genesis' assets and liabilities, Snyder said.","Genesis, like CoinDesk, is an independent subsidiary of Digital Currency Group.","Read more: Genesis' Crypto Lending Businesses File for Bankruptcy Protection"],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"CoinDesk TV’s “First Mover”","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Holdco LLC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Wilk Auslander LLP","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Eric Snyder","content":"PERSON"},{"type":"Genesis","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Snyder","content":"PERSON"},{"type":"$3.5 billion","content":"MONEY"}],"hashtag":["Genesis global holdco llc","Genesis global capital","CoinDesk TV","Eric snyder","Wilk auslander llp","Bankruptcy","DCG","US"],"authors":["Fran Velasquez"]}