{"summary":"Amid a U.S. banking crisis, value is flowing into bitcoin. Is this the beginning of the “Great Reset?” investor and author Tatiana Koffman asks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/13\/bitcoin-was-built-was-for-this-moment\/","publishDate":"2023-03-13T22:28:51","id":15999,"type":null,"title":"Bitcoin Was Built for This Moment","category":["Consensus Magazine"],"content":["The failure of Silicon Valley Bank, Silvergate Bank and Signature Bank continue to ripple through the markets, causing U.S. bank stocks to plummet. Most recently, Charles Schwab's stock was halted in trading Monday morning. Meanwhile, bitcoin and the rest of the cryptocurrency market are experiencing a double-digit rally, which may be the first time that bitcoin is rallying in a risk-off environment. Perhaps this is exactly the moment bitcoin was built for.","Tatiana Koffman is an angel investor, author and creator of the weekly newsletter MythOfMoney.com.","\n","The Bitcoin network was created as a direct response to the Great Financial Crisis in 2008, during a period when many hardworking people felt both the government and the financial system were working against them. In fact, the very first block of Bitcoin had an inscription in the code: \"The Times 03\/Jan\/2009 Chancellor on the brink of the second bailout for banks.\"","Now that regulators are gearing up to backstop another centralized financial institution, which collapsed in part due to an aggressive monetary policy at the Federal Reserve and what appears to be either poor risk management or greed, it’s important to heed Satoshi Nakamoto’s message.","For years I’ve been talking about the “Great Reset”, a concept that advocates for us to stop trusting centralized institutions with the things that matter most. After all, these institutions are run by people who are not necessarily better or smarter than us but they make all the decisions and mistakes for us.","See also: What Now for Crypto Banking? | Opinion","If we look at the sequence of events over the last week, we quickly begin to recognize the errors of human centralization. Last Wednesday, Federal Reserve Chairman Powell outlined a new approach to the Federal Reserve's policy path, indicating that interest rates may continue to rise for a longer period than previously expected. The expectation of higher interest rates for a prolonged period of time almost immediately sent a ripple effect through the bond market, causing bond prices to drop drastically because prices move opposite to yields.","At the same time, Silicon Valley Bank was forced to sell some of the 10-year bonds on its balance sheet at a 20%-30% discount to meet obligations amid a period of climbing withdrawals. As rumors of a cash shortfall began to circulate, a full-on run on the bank ensued and regulators took over. This caused even further panic.","Could every regional bank go under? After all, according to fractional banking rules, most of these banks only hold only 5%-10% of your capital in reserves, making every bank vulnerable to a bank run.","And then there was the obvious question as to who led the risk management department that decided it was okay to buy 10-year securities for an institution that has daily cash flow obligations to their depositors.","When the current economic slowdown began last year, many were worried crypto failures, such as those at FTX, Three Arrows Capital and Terraform Labs, would spread to traditional finance. But the exact opposite happened because the Silicon Valley Bank failure directly impacted the stablecoin market.","USDC, the second-largest U.S. dollar-pegged stablecoin after USDT, is run by Circle. Circle's model is simple – it takes your money and gives you a digital coupon called USDC. Then it takes your money and invests in super-liquid three-month U.S. Treasury bonds (currently yielding 4.87%). What could be safer?","Well, Circle reasonably decided that it should still keep some cash on hand and spread it across six different banking partners, one of them being Silicon Valley Bank. As SVB began to go under, Circle announced it had $3.3 billion deposited with SVB, creating a hole of over 5% in its balance sheet.","Panic ensued as USDC lost its dollar peg and dropped below 87 cents on Saturday. Traders quickly switched to tether, the largest USD stablecoin, although questions have been raised about its issuer’s business practices and reserves. I personally chose to move a large portion of my holdings into bitcoin, apparently like many.","The depegging of USDC is significant because Circle, considered a highly regulated and secure business, was poised to go public as a separate entity. The incident provided a wakeup call to investors, demonstrating that \"not your keys, not your coins\" applies not only to banks but to all centralized entities, even those that run our stablecoins.","Circle tried to restore trust by announcing it will use its corporate resources to cover any shortfall, which caused the stablecoin market to rebound by Sunday evening. As a result, USDC and DAI (which has significant USDC reserves) have returned to their dollar peg, and it is expected that USDC will now trade at par after compensating for SVB depositors. But is that enough?","Our assets may be bouncing back but the shock to our nervous system, however, remains. How can we trust anything centralized? How can we keep our money in banks above the FDIC-insured limit of $250,000? Could the insurance fail? How can we keep our money in stablecoins that use the same banking partners?","See also: Silicon Valley Bank and Signature Bank Reignite ‘Moral Hazard’ Dilemma Bitcoin Was Designed to End | Opinion","Bitcoin's beauty lies in its ability to store value in a decentralized manner backed by math, without requiring humans to validate or support it. No one lends out 90% of your deposits to make a profit, there is no possibility of a bank run and no one gambles with your hard-earned money on bonds.","Bitcoin was made for this moment, and it seems the market agrees. The Great Reset presupposes a future where bitcoin is the most valuable asset and the ultimate measure of value. It is what we use to store our wealth, perhaps selling small pieces for stablecoins to pay our daily expenses, but nonetheless only trusting this decentralized store of value.","The concept of decentralization, however, applies to other areas as well, such as how we run our communities, allocate resources and decide what our government should or should not control. A significant shift is underway, and more people are opting out of the traditional system.","We do not know how long it will take, but the Great Reset is happening and bitcoin will be its chosen currency."],"entity":[{"type":"Tatiana Koffman","content":"PERSON"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Great Reset","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Powell","content":"PERSON"},{"type":"Crypto Banking","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Charles Schwab","content":"PERSON"},{"type":"Signature Bank Reignite ‘Moral Hazard’ Dilemma Bitcoin","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"87 cents","content":"MONEY"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"4.87%","content":"PERCENT"},{"type":"Saturday","content":"DATE"},{"type":"Sunday","content":"DATE"},{"type":"$250,000","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Last Wednesday","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"2008","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"2009","content":"DATE"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"USDC","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Great Financial Crisis","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Opinion","banks","Bitcoin","Silicon Valley Bank","Silvergate Bank","Signature Bank","Bank Run"],"authors":["Tatiana Koffman"]}