{"summary":"Four cops were among those arrested, while the operation's alleged kingpin, Subhash Sharma, remains at large, according to local media reports.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/06\/indian-police-arrest-8-more-in-300m-crypto-scam-report\/","publishDate":"2023-11-06T17:37:07","id":15991,"type":null,"title":"Indian Police Arrest 8 More in $300M Crypto Scam: Report","category":["Policy"],"content":["Eight new arrests have been made in India where a $300 million (2500 crore Indian rupees) crypto scam that duped around 100,000 people continues to unravel, according to local media reports from Monday.","Four cops were among those arrested, one report said. Victims of the Himachal Pradesh scam include 5,000 government officials and around 1,000 police personnel, according to findings by a Special Investigation Team (SIT).","The scam came to light in late September but may have begun as far back as 2018, with fraudsters approaching would-be victims with investment plans involving a local cryptocurrency called Korvio Coin (or KRO coins). Subsequently, several more cryptocurrencies were reportedly used through fake websites, with at least one being subject to a rug pull where the project was abandoned after people had already purchased the token.","The scam appears to have gained unprecedented legitimacy because it involved police personnel. More than 1,000 cops became involved in the scheme; most were duped, some made huge gains, but others volunteered and became promoters, according to local officials.","Around 56 complaints were filed with police stations in the past two years. Since then, multiple agencies, including the Enforcement Directorate, along with regional police teams, ran a sweeping investigation led by the SIT. Dozens of searches conducted in late October led to the discovery of around 250,000 identification cards linked to suspects. The investigations have reportedly found more than 100 people had earned profits of $240,000 each from the scam, while another 200 made around $120,000 each.","As many as 18 arrests have been made so far, but the alleged kingpin, Subhash Sharma, remains at large. Several properties linked to Sharma have been identified and seized.","The Enforcement Directorate is also investigating the role of five women, suspected of having worked as agents or promoters for the kingpin, a separate report said.","The Himachal Pradesh State Police did not immediately respond to CoinDesk's request for comment.","Read More: India Regulator Probes at Least 10 Crypto Exchanges on Money Laundering Allegations: Report","Edited by Sandali Handagama.","\n"],"entity":[{"type":"KRO","content":"ORGANIZATION"},{"type":"Enforcement Directorate","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Subhash Sharma","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"$240,000","content":"MONEY"},{"type":"India","content":"LOCATION"},{"type":"Himachal Pradesh State Police","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"$120,000","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Sandali Handagama","content":"ORGANIZATION"}],"hashtag":["Regulations","India","scam","Crypto","Police","Investigation","Arrest"],"authors":["Amitoj Singh"]}