{"summary":"The messaging app has made TON its official Web3 infrastructure, giving the network exclusive promotion within the user interface","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/09\/13\/messaging-app-telegram-gives-endorsement-to-ton-project-token-surges\/","publishDate":"2023-09-13T07:21:13","id":15990,"type":null,"title":"Messaging App Telegram Gives Endorsement to TON Project; Token Surges","category":["Finance"],"content":["Messaging app Telegram has endorsed the TON network as its blockchain of choice for Web3 infrastructure, and will integrate it into the app's user interface. Toncoin (TON), the blockchain's native token, surged after the news, adding 6.5% in 30 minutes.","The TON-built Web3 wallet that's already available as a standalone bot in Telegram and has 3 million registered users is being integrated into the app and will be available to all 800 million users through their settings. A self-custodial version named TON Space is being rolled out to all Telegram users outside the U.S. The rollout should be completed by November, TON Foundation said in an email.","\"We are putting digital ownership rights in the hands of our entire user base,\" Telegram's chief investment officer John Hyman said in the statement. \"While also giving TON projects the tools to reach our audience in the largest Web3\/Web2 partnership there has ever been.\"","Telegram, popular among crypto enthusiasts has a long history with the blockchain, which started as an internal project in 2018. Telegram abandoned development in August 2020 following legal action from the U.S. Securities and Exchange Commission (SEC) alleging that it was selling unregistered securities. The project was picked up the following year by members of the community, who formed the TON Foundation in order to keep it alive.","Development of the spinoff network continued, shepherded by the Foundation and seemingly independent of Telegram, though the association between the two remained. Many of TON's most noteworthy developments used Telegram as their arena.","TON, however, will remain a \"completely separate decentralized organization,\" Hyman said in an interview. \"Telegram will focus on providing a fantastic messenger platform. It is not getting into Web3, but recognizes the value Web3 has for its users,\" he said.","Toncoin is the 11th largest cryptocurrency, with a market cap of around $6.6 billion, according to data from CoinMarketCap. It has surged 13% in the past 24 hours to $1.91.","Read More: Messaging Platform Telegram Has Issued $270M in Bonds to Fund Growth","Amitoj Singh contributed reporting.","UPDATE (Sept. 13, 07:55 UTC): Adds details, history.","UPDATE (Sept. 13, 08:50 UTC): Adds Hyman comment on relationship between Telegram, TON in penultimate paragraph. Updates TON price.","Edited by Sheldon Reback.","\n","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"August 2020","content":"DATE"},{"type":"6.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$6.6 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"November","content":"DATE"},{"type":"$1.91","content":"MONEY"},{"type":"the U.S","content":"LOCATION"},{"type":"$270M","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"John Hyman","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Sept. 13","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Hyman","content":"PERSON"}],"hashtag":["Telegram","TON","Toncoin","TON Foundation"],"authors":["Jamie Crawley"]}