{"summary":"Bitmain is expected to undergo a major spinoff as a solution to end its yearlong internal power struggle\nCo-founder Wu Jihan is said to step down from Bitmain’s miner manufacture business\nA local report says Bitmain’s qualified IPO valuation threshold is now at $5.5 billion. That, if true, is significantly lower than the $18 billion minimum inked in its Articles of Association.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84370\/bitmain-bitcoin-spinoff-fight-end","publishDate":"2020-12-19T11:41:54","id":160,"type":null,"title":"Bitmain set to spin out business lines in bid to end the bitcoin mining giant&#x27;s year-long power struggle","category":["Bitcoin"],"content":["Bitmain is expected to undergo a major spinout process as a solution to end its year-long internal power struggle.","One person inside <a href=\"https:\/\/www.theblockcrypto.com\/linked\/5924\/bitmain-layoffs-underway-may-impact-up-to-50-of-staff\" data-v-f87c67ca=\"\">Bitmain<\/a> who is familiar with the thinking told The Block in early December that Bitmain's co-founder Wu Jihan and Zhan Ketuan have been negotiating since September. According to the person, a business divestiture appears to be a preferable plan.&nbsp;","\"Who gets to keep which part depends on the outcome of the negotiations but the spinoff is a foregone conclusion,\" the person said. \"Whatever the outcome is, that doesn't change an inevitable separation.\"","In fact, Bitmain Technologies Holding, the Cayman Islands-incorporated parent holding company of Bitmain, filed a notice in Hong Kong on December 2&nbsp;to cease its registration there as a non-Hong Kong entity.","The move, just weeks before <a href=\"https:\/\/www.theblockcrypto.com\/linked\/60285\/bitmain-releases-new-firmware-to-keep-its-ethereum-miner-antminer-e3-in-operation\" data-v-f87c67ca=\"\">Bitmain<\/a> was due to submit a company annual return in Hong Kong, suggests a potential overhaul may take place that would change its structure and board members.&nbsp;","Colin Wu, a former Bitmain PR manager, <a href=\"https:\/\/mp.weixin.qq.com\/s\/oZgFRsmFaTyaH6u6o6q74A\" data-v-f87c67ca=\"\">wrote<\/a> in his WeChat media blog on Saturday that the two sides had reached temporary terms on December 16.&nbsp;","Per the article, Zhan agreed to pledge his <a href=\"https:\/\/www.theblockcrypto.com\/linked\/62226\/bitmain-rival-microbt-launches-3-new-bitcoin-miners-ahead-of-halving\" data-v-f87c67ca=\"\">Bitmain<\/a> shares to borrow $600 million and &nbsp;buy out Wu's ownership stake. As a result, Bitmain is spinning off its cloud <a href=\"https:\/\/www.theblockcrypto.com\/linked\/13718\/coinhive-will-shut-down-its-cryptomining-service-in-march\" data-v-f87c67ca=\"\">mining<\/a> platform BitDeer, its flagship <a href=\"https:\/\/www.theblockcrypto.com\/linked\/18314\/mining-company-riot-blockchain-reports-huge-loss\" data-v-f87c67ca=\"\">mining<\/a> pool BTC.com, and its overseas <a href=\"https:\/\/www.theblockcrypto.com\/linked\/14668\/college-campuses-are-the-second-largest-mining-sector-research-has-shown\" data-v-f87c67ca=\"\">mining<\/a> farms from its bitcoin ASIC miner manufacture business, which accounts for more than 90% of Bitmain's revenue stream.","Wu will take BitDeer, BTC.com and the overseas <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35188\/malaysian-electricity-utility-raids-33-bitcoin-mining-premises-as-it-loses-760k\" data-v-f87c67ca=\"\">mining<\/a> farms, according to the article. His rival co-founder Zhan will formally return to take charge of Bitmain's manufacturing and AI businesses, Antpool, and domestic <a href=\"https:\/\/www.theblockcrypto.com\/linked\/83325\/bitcoin-mining-difficulty-largest-drop-asic-era\" data-v-f87c67ca=\"\">mining<\/a> farms.&nbsp;","That said, it appears the two sides will still remain competitors under this agreement.&nbsp;The person familiar with the talks said Zhan has also hired back Lu Haiyi, the former co-founder of BitDeer, who will spearhead a similar cloud <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84862\/bitcoin-mining-pools-taproot-schnorr\" data-v-f87c67ca=\"\">mining<\/a> offering together with Antpool to rival BTC.com and BitDeer.","Notably, the local report also said that, based on the temporary agreements, Zhan is committed to taking Bitmain public in the U.S. by the end of 2022. However, it said a qualified IPO valuation threshold is now at $5.5 billion.","That, if true, would mean external investors will take a significant discount to their investment since <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7028\/bitmain-to-appoint-new-ceo-as-co-founders-wu-and-zhan-step-aside\" data-v-f87c67ca=\"\">Bitmain's<\/a> qualified IPO valuation minimum inked in its latest version of Articles of Association is $18 billion.&nbsp;","When the firm raised over $700 million in a Series B and B+ round in July and August 2018, the valuation was at $12 billion and $14.5 billion, respectively.","At the time, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/646\/bitmain-announces-new-generation-asic-chips\" data-v-f87c67ca=\"\">Bitmain<\/a> signed redemption terms that external shareholders can require it to buy back their redeemable, convertible shares with interest if there is material adverse effect to the firm's management or it can't fulfill a qualified IPO within five years.&nbsp;","A qualified IPO was thus defined in the Articles of Association of Bitmain Technologies Holding as a public raise of no less than $500 million at a valuation of no less than $18 billion at one of the five designated stock exchanges in Shanghai, Shenzhen, Hong Kong or New York City.&nbsp;","It's not clear if <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7256\/bitmain-downsizes-further-as-amsterdam-office-folds\" data-v-f87c67ca=\"\">Bitmain<\/a> has already amended its Articles of Association to revise the minimum of a qualified IPO. The report said Bitmain will host a shareholder meeting on December 28 to seek approval from shareholders for a major change.&nbsp;","The latest twist comes three months after Wu took back the status, from Zhan, as a legal representative of Beijing Bitmain, the operating entity of the bitcoin miner maker.","In September 2020, Bitmain <a href=\"https:\/\/mp.weixin.qq.com\/s\/QjOSj-1mhr9teTyXlpjyZQ\" data-v-f87c67ca=\"\">said<\/a> Wu had regained the status as a legal representative while Zhan remained a general manager, hinting that the two sides had come to a short-term truce while pursuing efforts to work out a long-term sustainable solution.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/806\/bitmain-files-for-ipo-on-the-hong-kong-stock-exchange\" data-v-f87c67ca=\"\">Bitmain<\/a> said at the time that the year-long spat since October 2019 between Wu and Zhan caused serious damages to its bitcoin miner market share and its brand image while its customers and employees were caught in between.","The whole situation dated back to March 2019, when Wu and Zhan both stepped down as co-CEOs and co-chairmen after Bitmain's initial public offering application failed in Hong Kong. The two agreed to appoint a new CEO while Zhan became the sole chairman.&nbsp;","In an October 2019 coup, Wu suddenly ousted Zhan from the company and removed his roles as a legal representative, chairman and executive director, despite the fact that Zhan is a majority shareholder.&nbsp;","Wu said in an all-hands meeting with <a href=\"https:\/\/www.theblockcrypto.com\/post\/20301\/bitmain-and-kraken-motion-to-dismiss-alleged-bitcoin-cash-manipulation\" data-v-f87c67ca=\"\">Bitmain<\/a> employees in Beijing following the coup that he must return to \"save the ship\" and accused Zhan of ruining the company. The firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/88414\/bitmain-60m-2019-loss-court\" data-v-f87c67ca=\"\">recorded<\/a> a loss of $60 million in 2019, a company lawyer said in a court hearing this week.","Zhan subsequently brought lawsuits against <a href=\"https:\/\/www.theblockcrypto.com\/post\/231\/gold-in-them-thar-hills-bitmains-ipo-is-the-modern-merchant-fable-come-true\" data-v-f87c67ca=\"\">Bitmain<\/a> and won a partial victory in May to reinstate his status as a legal representative and executive director.","The tension between the two sides had since escalated publicly to the extent that each party launched their own lines of sales and supply chain operations that essentially \"hard-forked\" the company's bitcoin miner production."],"hashtag":[]}