{"summary":"A European Parliament event in Brussels today saw experts and regulators discuss the potential for encoding oversight into blockchain applications.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2016\/03\/02\/european-parliament-event-explores-coding-regulation-into-blockchain\/","publishDate":"2016-03-02T19:20:03","id":16003,"type":null,"title":"European Parliament Event Explores Coding Regulation into Blockchain","category":["Markets"],"content":["There is tension today between \"rule of law\" and \"rule of code\" as technology disrupts traditional ways of working.","So said Pindar Wong, chairman of financial tech consultancy VeriFi (Hong Kong), during remarks at a European Parliament event on the subject of blockchain technology in Brussels today.","The informal event","brought together a range of experts and stakeholders from both the bitcoin and blockchain industry, as well as government representatives, to investigate the topic.","The gathering was hosted by MEP Marietje Schaake of the Netherlands, in cooperation with COALA (Coalition of Automated Legal Applications) and the Dynamic Coalition on Blockchain Technologies at the Internet Governance Forum (IGF).","The workshop featured two sessions. The first offered an overview of how the technology works and its potential applications. Later, attendees examined possible regulatory approaches to blockchain tech.","The event comes amid a time of growing activity on the subject of bitcoin and blockchain within elements of the European Union governance structure. The European Parliament's Committee on Economic and Monetary Affairs (ECON) held a hearing in January and later released a report calling for a dedicated task force focused on digital currencies.","Both the European Commission, the executive arm of the European Union, and the European Council, composed of the bloc's heads of state as well as representatives from the Commission, are also moving to establish policies on the technology over the course of this year.","Notably, some of those present at the event pushed to bring credence to the idea that regulation of distributed ledgers could, in fact, be accomplished through the code itself, rather than a top-down approach from one agency or another.","In his opening comments, Wong referred to blockchain tech as a \"platform for innovation\", spelling out its advantages as money you can program. The transparent and verifiable transfer of ownership aspects of the technology, he stressed, amount to a \"huge change\" in how money works.","Primavera De Filippi, a researcher at Harvard University, remarked that blockchain could change the current financial industry and \"eliminate the need for financial intermediaries\".","This, she said, would allow individuals \"who don't trust each other to actually interact and exchange value\".","De Filippi also explored the idea of how distributed ledgers can improve governance through transparency. The technology, she argued, has the potential to spread power from top-heavy institutions out to the \"edges\", thereby offering a means of reducing the occurrence of corruption by providing a greater degree of visibility for constituents.","This could mean that the traditional format of organisations can \"progressively become more flexible and quicker to adapt\" in changing situations, she suggested.","Henning Diedrich, a programmer working on IBM's blockchain initiative for the Internet of Things (IoT), weighed in on the use of the technology to facilitate the creation of decentralized entities.","Diedrich explained that an entire company could run on a blockchain through the use of various smart contracts, allowing for the development of a decentralised Uber or Facebook, for example. But such a system, he warned, could be very hard to regulate.","\"How do you punish a [decentralized] company?\" he asked.","Mentioning author Isaac Asimov's famous Laws of Robotics, he raised the question of who, in a world increasingly governed by automated systems, will be coding the rules or instituting automated regulatory mechanisms.","\"Programmers will need to know law, or lawyers will need to know code,\" he suggested.","This sentiment was echoed by Wong, who foresaw issues where blockchains could be used to manage a multitude of devices within an Internet of Things framework.","\"Sending computers to jail will make no sense,\" he said, going on to add that some kind of governance model will be essential in this instance.","Wong used his introduction to raise the question of whether the technology should be regulated at all.","\"Would the Internet have happened if we had to apply the letter of the law of copyright?\" he asked.","Suggesting that regulation could stifle innovation in the space, Wong put forward the possibility that the technology itself could be leveraged to meet those perceived requirements.","Taking a similar view, De Filippi questioned what it means to regulate blockchain technology anyway. \"It's a data structure,\" she said.","The researcher suggested it may make more sense to focus regulatory efforts on the apps built on top of open and private blockchains rather than the technology itself.","Ruth Wandhöfer, CitiBank's global head of regulatory and market strategy, provided the overview that distributed ledgers can indeed usher in beneficial changes in finance.","Private and hybrid blockchains, she said, could bring increased privacy and control and, by removing the middleman, force the banks to change or even disintermediate them completely. Further benefits can be found in the removal of what she called centralised \"honeypots\" that are attractive to bad actors.","However, Wandhöfer concluded that some degree of regulation will be needed in order to \"establish trust\".","Image via Shutterstock"],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"European Parliament's Committee on Economic and Monetary Affairs","content":"ORGANIZATION"},{"type":"Robotics","content":"ORGANIZATION"},{"type":"Ruth Wandhöfer","content":"PERSON"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Dynamic Coalition on Blockchain Technologies","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"CitiBank","content":"ORGANIZATION"},{"type":"Filippi","content":"PERSON"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Harvard University","content":"ORGANIZATION"},{"type":"Henning Diedrich","content":"PERSON"},{"type":"Brussels","content":"LOCATION"},{"type":"Marietje Schaake","content":"PERSON"},{"type":"IBM","content":"ORGANIZATION"},{"type":"European Council","content":"ORGANIZATION"},{"type":"Wong","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Pindar Wong","content":"PERSON"},{"type":"Internet Governance Forum (IGF","content":"ORGANIZATION"},{"type":"Wandhöfer","content":"PERSON"},{"type":"Isaac Asimov","content":"PERSON"}],"hashtag":["Blockchain Technology","Regulation","News","Events","European Parliament"],"authors":["Daniel Palmer"]}