{"summary":"BTC price gains and trading activity have mostly concentrated during U.S. market hours, according to K33 Research.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/06\/29\/us-investors-are-driving-bitcoins-price-surge-as-institutional-demand-rises\/","publishDate":"2023-06-29T21:39:28","id":16012,"type":null,"title":"U.S. Investors Are Driving Bitcoin’s Price Surge as Institutional Demand Rises","category":["Markets"],"content":["U.S. investors have been piling into bitcoin (BTC) as institutional activity accelerated, driving the recent rally of the largest cryptocurrency by market capitalization.","BTC’s price gains and trading volume have concentrated during U.S. market hours recently, and have been the main force behind BTC’s strength, crypto analytics firm K33 Research noted in a report.","Bitcoin has surged 85% so far this year, per CoinDesk data, outperforming most of the crypto market. The price action has come as a slew of financial heavyweights, including BlackRock, Fidelity and Citadel Securities, have become more involved with BTC, spurring investor optimism.","Smaller cryptocurrencies have struggled amid increasing regulatory scrutiny whether they are unregistered securities. Trading platforms have subsequently curbed offering popular tokens to avoid risk.","Read more: A Straightforward Explanation for Why Financial Giants Want to Issue a Spot Bitcoin ETF","BTC has experienced some 30% cumulative gains during U.S. market hours since reaching a low point around $16,000 in bottom, significantly outpacing Asian and European trading sessions. Activity in the U.S. spiked after asset management giant BlackRock filed for a spot BTC exchange-traded fund on June 14.","Bitcoin’s latest surge has also coincided with decoupling from the performance of U.S. equities such as the S&P 500 and Nasdaq indices, its 30-day correlation turning negative last week for the first time since January 2021, K33 noted.","\"This illustrates that U.S. traders are allocating in BTC due to idiosyncratic reasons\" as a portfolio diversification, Vetle Lunde, senior analyst at K33, wrote.","BlackRock’s initiative has also rejuvenated institutional activity on the BTC market.","Open interest on the Chicago Mercantile Exchange (CME) futures market, a favored venue among sophisticated investment firms, has been nearing its all-time high, K33 data shows.","Digital asset funds recorded $199 million of inflows last week, the largest in almost a year, with bitcoin-focused funds enjoying 94% of all inflows, according to a report by asset management firm CoinShares earlier this week.","The recent activity showcases an inflection point in crypto’s institutional adoption, Samir Kerbage, chief investment officer at crypto asset management firm Hashdex, noted.","\"We may be at a generational moment in time for individual crypto investors,\" he said.","\"The current institutional interest we are witnessing is far from the opportunistic FOMO [fear of missing out] we have seen in the past that can push prices up in the short term,\" Kerbage wrote. \"These institutions move slowly and deliberately and invest for the long term—once they are in, they are in.\"","Edited by James Rubin.","\n","\n"],"entity":[{"type":"$16,000","content":"MONEY"},{"type":"earlier this week","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$199 million","content":"MONEY"},{"type":"January 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"94%","content":"PERCENT"},{"type":"Samir Kerbage","content":"PERSON"},{"type":"85%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"Straightforward Explanation for Why Financial Giants Want","content":"ORGANIZATION"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"James Rubin","content":"PERSON"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"June 14","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Bitcoin","btc","Institutional Bitcoin","Institutional Investment","Trading","Investing","Markets","K33 research"],"authors":["Krisztian Sandor"]}