{"summary":"SPACs have been around since the early 1990s but are experiencing a resurgence in popularity as private firms look for alternative methods to go public.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-spac-your-questions-answered\/","publishDate":"2021-07-06T20:21:55","id":16016,"type":null,"title":"What Is a SPAC? Your Questions Answered","category":["Learn"],"content":["SPACs have been an increasingly popular option for companies looking to go public, especially during the global slowdown caused by the coronavirus pandemic. But what is a SPAC and why is everyone talking about them?","A special purpose acquisition company (SPAC) is a newly created shell company formed by a group of investors known as “sponsors.” Sponsors raise funds for the SPAC through an initial public offering (IPO), a process in which a stake or an entire private company is publicly sold to institutional and retail investors in the form of shares (“stock” is also used interchangeably). A share is a unit of ownership in a public company.","The first SPACs were established in the early 1990s, but they’ve surged in popularity over recent years, with an increasing number of companies seeking faster ways to go public than an IPO.","Most companies that have passed through IPOs have commercial operations, i.e., they provide some forms of products and\/or services. Think about Apple, Facebook, Amazon – these are all public companies that were initially private but at some point went public. The shares of public companies are traded on special venues called stock exchanges, e.g., the New York Stock Exchange (NYSE), or over-the-counter (OTC) stock markets, which represent networks of stock dealers.","Unlike regular public companies, however, a SPAC has no commercial operations when it conducts its IPO. This is why SPACs are also referred to as “blank check companies.” In other words, they do nothing. The primary goal of a SPAC is simply to raise capital and then use that cash to acquire an existing private company that shows significant promise and is looking to go public. These private firms are also known as “target companies.''","As a rule, a SPAC IPO structure consists of common shares merged with a warrant. The latter is a contract that gives the holder the right to buy more shares at a fixed price at a later date. Exercising the warrant is one of the opportunities investors try to leverage.","Most SPACs price their IPO shares at $10 apiece while the warrant exercise price tends to be around 15% higher than the IPO price.","A SPAC typically has two years to acquire or merge with a private company after completing its IPO. If it fails to do so, the SPAC is dissolved and all funds are returned to shareholders who participated in the IPO. Note that a SPAC may or may not reveal which private company it plans to acquire or merge with during its IPO process.","If a SPAC does successfully merge with a private firm, it swaps the cash it raised during the IPO and the status of a public company for a stake in the resulting business.","Despite the success of SPACs, some companies opt for different methods to go public. For example, Coinbase recently debuted on the Nasdaq exchange via a direct listing, which is another fast-track method to become a publicly traded company rather than an IPO.","Here are the main differences of all three approaches:","SPACs are all about speed and convenience. For operational businesses with assets, conducting an IPO is an arduous process, especially during a pandemic.","Companies have to think about the roadshow and employing underwriters – usually investment banks – to promote the public offering to prospective investors. Unsurprisingly, working with investment banks is expensive and time-consuming as additional contracts need to be filed with the financial authorities.","To avoid this, many companies, especially smaller private firms, decide to merge with SPACs and become publicly traded companies in as little as three to four months. This compares to an IPO, which can take anywhere from six months to over a year to complete.","It’s worth mentioning that merging with SPACs has drawbacks as well. One of the main issues is that the post-merger business may not perform as expected. The Financial Times cited Refinitiv data showing that of the 13 SPACs announced acquisitions in May, 2021, only one was trading above $10.","Another issue for companies opting for this route is making sure all regulatory and legal filings are communicated before the SEC deadlines. Because SPAC mergers are typically much quicker than IPOs, post-SPAC companies have a shorter window to file all necessary documentation.","SPACs have also become attractive for blockchain and cryptocurrency firms that plan to go public. In this way, blockchain companies can avoid the rigorous scrutiny of an IPO.","All in all, SPACs have been booming over the last couple of years. Stock investors called 2020 the year of the SPAC because the blank check firms raised an impressive $83.4 billion, more than in all the previous years combined. However, it took only three months in 2021 to surpass that level and update the annual record.","\n"],"entity":[{"type":"2021","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"$10","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"$83.4 billion","content":"MONEY"},{"type":"Facebook","content":"LOCATION"},{"type":"May, 2021","content":"DATE"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"early 1990s","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Refinitiv","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Investing","Intermediate","Learn"],"authors":["Anatol Antonovici"]}