{"summary":"\"Though the petition is under Article 32 of the Constitution, it is evident that the real purpose is to seek bail in proceedings which are pending against the petitioner,\" the order said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/15\/indias-supreme-court-turns-away-petition-asking-government-to-frame-crypto-guidelines\/","publishDate":"2023-11-15T01:18:56","id":16015,"type":null,"title":"India's Supreme Court Turns Away Petition Asking Government to Frame Crypto Guidelines","category":["Policy"],"content":["India's Supreme Court, a historical hope for the nation's cryptocurrency industry, turned away a petition that sought to direct the government and relevant authorities to frame guidelines for regulating the trading and mining of cryptocurrencies.","The public interest litigation (PIL) by Manu Prashant Wig against the Union of India and others, which also asked for a direction for the prosecution of cases involving digital assets, was denied on Friday.","\"Though the petition is under Article 32 of the Constitution, it is evident that the real purpose is to seek bail in proceedings which are pending against the petitioner. We are unable to subscribe to this course of action,\" the order said. Article 32 of India's Constitution allows an individual to directly approach the highest court to protect their fundamental rights.","Wig, a Director at Blue Fox Motion Picture Limited, the entity purportedly behind Tokenz Limited, a centralized cryptocurrency exchange, is currently in judicial custody, accused of \"inducing people to invest money in a scheme\" in a case filed by the Economic Offence Wing of Delhi Police, according to Bar and Bench, a domestic news platform covering India's courts. More than 130 victims have alleged that they were defrauded. Earlier this year, Wig's wife also filed for and won anticipatory bail from a court as the investigation team sought to question her.","In 2020, the Supreme Court overturned a 2018 notice from India's central bank which effectively banned banks from supporting or engaging in crypto transactions, giving life to the industry. But in 2022 India introduced stiff taxes – which the industry saw as a \"shadow ban.\" Payment processors cut off local crypto exchanges, and the government undertook enforcement actions against at least 10 crypto exchanges, leaving them fighting for survival.","\"Why should the Supreme Court look into this?\" asked the bench, composed of Chief Justice of India D.Y. Chandrachud and Justices J.B. Pardiwala and Manoj Mishra, according to the Bar and Bench report. However, according to the order, India's top court gave Wig the \"liberty to move the appropriate court for the grant of regular bail\" because the relief concerned is more in a \"nature of a legislative direction.\"","\"Courts in India have no authority to direct the legislature to frame a law,\" according to legislative research body PRS, even though there are rare cases when the Supreme Court has challenged this \"separation of powers.\" Yet, India's government has previously told the Supreme Court that only the Parliament can frame or enact a law.","India's position on crypto came under increased scrutiny after Sept. 2023, when it pushed the G20 during its presidency to accept global guidelines for crypto without having its own legislation in place. India has kept a crypto bill in cold storage since 2021 but did indicate it will decide its position in the coming months.","India has seen a spate of crypto scams in the past few months leading to increased action from authorities.","Read More: Indian Police Arrest 8 More in $300M Crypto Scam: Report","Edited by Nikhilesh De."],"entity":[{"type":"Chief Justice of India D.Y. Chandrachud","content":"ORGANIZATION"},{"type":"Manoj Mishra","content":"PERSON"},{"type":"G20","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Sept. 2023","content":"DATE"},{"type":"$300M","content":"MONEY"},{"type":"India","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"India's Supreme Court","content":"ORGANIZATION"},{"type":"J.B. Pardiwala","content":"PERSON"},{"type":"Union of India","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Blue Fox Motion Picture Limited","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Economic Offence Wing of Delhi Police","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Manu Prashant Wig","content":"ORGANIZATION"}],"hashtag":["Regulations","India","Crypto","Legislation","Mining","Supreme Court","Recommended"],"authors":["Amitoj Singh"]}