{"summary":"The 25-year-old used the cryptocurrency monero to obfuscate payments for abusive sexual material, according to a CoinDesk Korea investigation.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/03\/26\/alleged-mastermind-of-sex-abuse-chatrooms-hid-payments-with-privacy-coin-monero\/","publishDate":"2020-03-26T13:22:46","id":16013,"type":null,"title":"Alleged Mastermind of Sex Abuse Chatrooms Hid Payments With Privacy Coin Monero","category":["Policy"],"content":["","Cryptocurrency accepted by the alleged ringleader of a Telegram chat group in exchange for abusive sexual material may never be retrieved.","","","Cho Ju-bin, 25, is said to have charged users anywhere between 200,000 to 1.5 million Korean won (around $160 to $1,200) to access images and videos of women, many younger than 16, who were forced to perform sex acts on themselves.","","","An investigation from CoinDesk Korea found Cho primarily dealt in the privacy-enhancing cryptocurrency monero (XMR) so he could cover his tracks.","","","Korean authorities took the unusual step Wednesday of publicly naming Cho as the alleged ringleader of a Telegram chat group known as the Doctor's Room, following a petition signed by more than five million South Koreans. He stands accused of violating the child protection, privacy and sexual abuse acts, as well as charges surrounding abuse, blackmail and threatening others.","","","Following a Supreme Court case in 2018, cryptocurrencies are considered a form of property subject to forfeit after conviction in South Korea.","","","But there are complications. Authorities have to find the wallets in which digital assets are stored, as well as the private key to access them. \"We may say that Mr. Cho has forgotten his private key,\" said Han Seo-hee, a Korean lawyer, to CoinDesk Korea. \"If I refuse to submit it, there is no way to force it [from him].\"","","","Although CoinDesk Korea has been able to show Cho received more than 8,800 ether (ETH), currently worth around $1.2 million, from more than 500 wallets from around the world, the majority of his payments were in monero.","","","Unlike other cryptocurrencies, where transactions can readily be viewed on a public blockchain, monero jumbles them together, making it next to impossible for third parties to trace payments. Even the amount he received may never be known without his cooperation.","","","Cho is accused of blackmailing at least 58 women and 16 girls to send degrading and sexually exploitative images of themselves, forcing many to carve 'slave' into their bodies. He operated multiple rooms on Telegram, with users paying extra to view more graphic or extreme material. Korean authorities have also arrested 124 suspects and 18 operators linked to the case.","","","“I apologize to those who were hurt by me,” Cho said following his public reveal Wednesday. “Thank you for ending the life of a demon that I couldn’t stop.”","","","Cho did not respond to questions from reporters on whether he had admitted to the charges.",""],"entity":[{"type":"” Cho","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"South Koreans","content":"LOCATION"},{"type":"Cho","content":"PERSON"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"$160","content":"MONEY"},{"type":"$1,200","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"$1.2 million","content":"MONEY"},{"type":"CoinDesk Korea","content":"LOCATION"},{"type":"Han Seo","content":"PERSON"}],"hashtag":["Crime","South Korea","Monero","Pornography"],"authors":["Paddy Baker"]}