{"summary":"The arrest of a web developer for the now-sanctioned currency mixer Tornado Cash has raised questions about whom states can hold responsible when bad actors use software to commit crimes. That's why Alexey Pertsev is one of CoinDesk’s Most Influential 2022.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/05\/alexey-pertsev-most-influential-2022\/","publishDate":"2022-12-05T12:16:48","id":16014,"type":null,"title":"‘We Are All F****d’: The Developers of Tornado Cash and the Future of Crypto","category":["Consensus Magazine"],"content":["“I never thought it could be as terrible as it is now. Virtually every aspect of my life is broken or destroyed.”","After three months in a Dutch jail, web developer Alexey Pertsev still doesn’t fully know what he’s accused of doing. Those who ordered his arrest in August had published little more than a press release by way of explanation.","“To me, it's more like they don't have to explain anything, they're just doing me a favor” in showing him legal documents for his case, Pertsev said of his Kafkaesque ordeal, in a statement given to CoinDesk early in November. “It doesn’t look like I’m here by any law.”","Read more: Presenting CoinDesk's Most Influential 2022","Together with Roman Storm and Roman Semenov, Pertsev is caught up in the case of Tornado Cash: a maelstrom that, in 2022, blew crypto apart, raising questions about its founding principles of privacy, freedom and open-source collaboration.","The U.S. Treasury Department’s Office of Foreign Assets Control (OFAC) may not have realized what it was getting into when, two days before Pertsev’s arrest, it sanctioned the Tornado protocol, the most widely used currency mixer on the Ethereum blockchain, citing the laundering of billions of dollars.","Immune from control by any one developer, Tornado is “unstoppable,” Semenov, who founded the protocol with Storm, told CoinDesk in a January interview. That didn’t stop regulators from trying.","Tornado lets users tip money into a central pool, later drawing it out using a zero-knowledge proof – a sort of receipt offering access to funds without revealing extraneous details. That anonymity can be used for good or ill. OFAC says Tornado was used by North Korea-sponsored hackers, the Lazarus Group. Ethereum co-founder Vitalik Buterin said he sent anonymous funds to aid Ukraine using it.","OFAC wanted to act against a tool that, it says, has been used to launder criminal money and fund weapons of mass destruction in North Korea – a country that’s hardly a poster child for crypto’s libertarian ideals. But regulators, tired of playing and losing at wallet whack-a-mole, caused significant collateral damage when they tried to take on the whole system.","Americans using the protocol lost access to funds and to other crypto applications and, though not personally sanctioned in the Aug. 8 measures, Semenov was soon tweeting he’d lost his account on Github, the site where open-source developers post their work. He asked if writing code was now illegal and later spoke of a “chilling effect” that made it taboo to talk about privacy at all.","Sanctions normally target people like Syrian President Bashar Al-Assad, or terrorists like Al-Qaeda; now it was blocking Americans from using a piece of software. Previous shutdowns, such as Blender.io in May, focused on those controlling a centralized mixer, but in 2020 Semenov and Storm destroyed their keys so Tornado works automatically. If nobody’s in charge, there’s nobody to blame.","OFAC, which declined to be interviewed by CoinDesk, has said it has the power to sanction a wide range of entities like associations, groups and other organizations, including Tornado Cash. For Peter Van Valkenburgh, director of research at think tank Coin Center, the unprecedented measure is “conceptually incoherent.”","“Sanctions are a tool for behavioral change,” Van Valkenburgh said. “Software in the abstract cannot change its behavior, it's just there.”","Coin Center is now suing OFAC for infringing the constitutional right to make private political donations, and Van Valkenburgh points to the many other absurdities the case has raised.","In one stunt this summer, celebrities including Shaquille O’Neal and Jimmy Fallon were sent funds from Tornado; the law says they are tainted by something they were powerless to prevent. Protocols can’t raise a legal petition – though that’s the normal route to get sanctions lifted. At one point, cryptography professors weren’t even sure if they were allowed to share code with students.","In the Netherlands, there were more than Github accounts under threat. Pertsev’s detention drew an outcry from the crypto world; Edward Snowden recently contrasted the detention “for the ‘crime’ of building privacy tools to protect you” with the kid glove regulatory service afforded to executives at failed crypto exchange FTX.","At a November hearing, the issue was painted by the Netherlands government as a clear case of money laundering. Far from being decentralized and automatic, Pertsev, Semenov and Storm ran the ecosystem like a business, the public prosecutor said. Pertsev’s lawyers, meanwhile, say the courts just don’t understand crypto, and are confusing Tornado with a centralized bitcoin mixer.","Maybe that level of education will improve as judges pore over the details of how Tornado’s supposedly decentralized governance structure worked. In the meantime, there has been a great personal cost.","“Imagine not seeing your loved one for months or years,” Pertsev told CoinDesk. To attend their weekly, one-hour supervised visit, his wife Xenia Malik must drive three hours in a borrowed car after his own was seized by the police, he said.","“I have never seen her cry so often,” he said, in a written statement given to CoinDesk by Malik.","Pertsev’s requests for bail, and to spend Christmas at home, were rejected on the basis that he could interfere with the investigation or try to flee – though he says he has little interest in returning to Russia, where he could face the draft.","As to the idea he could perpetrate his crime again if released, he said, “I was not even informed of what crime,” in remarks made before his hearing.","At an August demonstration against the arrest, developers said they are worried they’ll now be held liable for bad actors using their code. “Privacy is normal, it's not a crime,” protest organizer Eleonore Blanc told CoinDesk. Being free of centralized institutions is the whole point of crypto.","Malik told CoinDesk she’s heartened by the reaction from the crypto crowd. “This support is very important for us ... it is very nice to realize that we are surrounded by such a large number of cool people.”","But that may prove little solace if her life is effectively stolen from her for months, if not years.","“People have the right to privacy … people can write open-source [code] and not be afraid that they will be put in jail and their whole life will be destroyed,” Malik said in a written statement. “I hope we get justice no matter how long it takes.”","This isn’t the first time regulators tried to fix crypto using a rusty and ill-equipped toolbox, but it’s in everyone’s interest to figure out how to make blockchain fit with privacy, a puzzle raised in Satoshi Nakamoto’s Bitcoin white paper and still unsolved.","Either regulators continue to learn by doing, with all the pain that can cause, or the crypto community learns to stand up and be counted and show them how to do it better.","“This is a wake-up call to that community that they need to recognize and protect the open source community that they rest on top of,” Cindy Cohn, executive director of online rights organization the Electronic Frontier Foundation, said in a phone interview. “They should not take it as a given that code development and innovation are just going to magically continue, as a kind of free resource. They will have to invest in protecting it.”","In January, Semenov compared Tornado to the fights for online privacy in the early history of the web, leading to innovations like https secure encryption. Semenov declined to be interviewed for this article. But, in a message sent to CoinDesk, his colleague was more forthright about the risks the situation posed to the crypto community as a whole.","\"We are all f****d if nothing is changed,\" Storm said.","UPDATE (Feb. 2, 2023, 17:41 UTC): Main story image, an artist's interpretive rendering of Pertsev, replaced with photo from courthouse.","UPDATE (Dec. 12, 2022, 17:05 UTC): Clarifies Storm's comments referred to effect the Tornado Cash situation may have on the broader crypto industry."],"entity":[{"type":"U.S. Treasury Department’s Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Qaeda","content":"LOCATION"},{"type":"Netherlands","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"” Van Valkenburgh","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Dec. 12, 2022","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Github","content":"ORGANIZATION"},{"type":"Aug. 8","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Jimmy Fallon","content":"PERSON"},{"type":"Eleonore Blanc","content":"PERSON"},{"type":"Cindy Cohn","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"” Semenov","content":"PERSON"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Pertsev","content":"LOCATION"},{"type":"Pertsev","content":"PERSON"},{"type":"Roman Semenov","content":"PERSON"},{"type":"Semenov","content":"PERSON"},{"type":"Electronic Frontier Foundation","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Malik","content":"PERSON"},{"type":"Edward Snowden","content":"PERSON"},{"type":"Feb. 2, 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Xenia Malik","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bashar Al","content":"PERSON"},{"type":"Assad","content":"LOCATION"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"Peter Van Valkenburgh","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Van Valkenburgh","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"” Malik","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Most Influential","Most Influential 2022","Tornado Cash","Sanctions"],"authors":["Jack Schickler"]}