{"summary":"Crypto is increasingly interconnected in the global financial system, regulators warn. But the potential knock-on effects of a crypto market collapse would be of their own making.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/10\/14\/if-crypto-causes-instability-its-because-the-system-is-unstable\/","publishDate":"2021-10-14T18:26:44","id":16021,"type":null,"title":"If Crypto Causes ‘Instability,’ It’s Because the System Is Unstable","category":["Markets"],"content":["I started reading Nobel prize-winning economist Robert Shiller’s bestselling book “Irrational Exuberance” about asset bubbles recently. Wait, I should be more specific. I started reading the third edition published in 2015, during what Shiller identified as another asset run-up. The modern classic economics text was first printed in 2000, before the implosion of the “dot com boom,” and again in 2005, ahead of what turned out to be a housing market meltdown.","Shiller, you may not be surprised to learn, is not a huge fan of cryptocurrencies. He’s said interest in the sector is part of the “Wild West” mentality across stock, housing and bond markets. Something of a “perma-bear,” his dour prognostications seem to come from a place of concern about painful losses for investors of all stripes … in addition to selling books.","This article is excerpted from The Node, CoinDesk’s daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","The Yale professor isn’t the only economist who sees bubbles everywhere. Jon Cunliffe, the Bank of England’s deputy governor for financial stability, yesterday likened the $2.3 trillion crypto market to the $1.2 trillion subprime mortgage market in 2008, which contributed to that decade’s great financial crisis. Risks aren’t localized, but shared across this interconnected, global financial system.","“The crypto world is beginning to connect to the traditional financial system, and we are seeing the emergence of leveraged players. And, crucially, this is happening in largely unregulated space,” Cunliffe said. Could a major price correction in the volatile crypto market cause knock-on effects? Cunliffe was short on specifics and also on recommendations.","Indeed, today, crypto is something more than just an economic niche. Major financial actors, from pension funds to hedge funds, are taking on exposure to crypto assets – buying bitcoin directly, buying shares in investable vehicles like trusts and even leading capital raises for crypto startups. Millions of Americans trade in crypto markets. A nation state “hodls” bitcoin.","It seems fair to “take notice,” as Cunliffe says, of an industry that has exploded in value from $16 billion five years ago to the juggernaut it is today. But concerns from financial overseers are also a bit misplaced and seem designed to scapegoat crypto for overheated financial markets that their policies enable.","Cunliffe, to his credit, wasn’t totally paternalistic. He cautioned governments and regulators against overreacting to this novel tech-driven sector and added that crypto could offer “radical improvements” to traditional financial services.","Of those improvements, he might mention, is the fact that crypto does offer a more “interconnected” economy. Crypto is something new, something frightening, something potentially dangerous because blockchains and smart contracts open access to financial services to nearly everyone. It leaches power from power brokers and decision makers.","But as much as people talk about bitcoin “decoupling” from the financial system, that seems unlikely. The full picture is still emerging – crypto sometimes moves up and down following classic inflation hedges, sometimes like tech stocks, sometimes independently. But interconnected it is, and the sector’s growth isn’t whole and away independent from the runup in asset prices across the economy.","See also: Bubbles Are Good for Bitcoin | Yanhao Max Wei","Bitcoin may be the best performing asset ever, but its growth coincided with the longest and most profitable bull market in stocks in history. The S&P 500, a benchmark, closed out a decade-long bull run beginning March 2009 with 370% returns. It’s still growing. And the same cheap money policies and “inflation is good” mentality driving it are still in play.","Shiller, the expert on how emotions and narratives drive finance, has also noted the “impressive technology” behind crypto. But always the skeptic, he also thinks its “ultimate source of value is so ambiguous that it has a lot to do with our narratives rather than reality.” That was true too, he thinks, for the 90s’ tech sector, the aught’s housing speculation and today’s meme stocks.","But what’s the bigger story behind this bubble?"],"entity":[{"type":"2015","content":"DATE"},{"type":"2005","content":"DATE"},{"type":"$2.3 trillion","content":"MONEY"},{"type":"$1.2 trillion","content":"MONEY"},{"type":"Cunliffe","content":"PERSON"},{"type":"2000","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"Robert Shiller","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"Yale","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"Bitcoin | Yanhao Max Wei","content":"ORGANIZATION"},{"type":"March 2009","content":"DATE"},{"type":"370%","content":"PERCENT"},{"type":"Shiller","content":"PERSON"}],"hashtag":["Bubble","Bitcoin","The Node","Newsletters","Opinion","Regulation"],"authors":["Daniel Kuhn"]}