{"summary":"The company has installed the country's first permanent bitcoin ATM and has plans for more.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2014\/02\/27\/singapore-firm-tembusu-launches-customizable-bitcoin-atm\/","publishDate":"2014-02-27T21:40:25","id":16026,"type":null,"title":"Singapore Firm Tembusu Launches Customizable Bitcoin ATM","category":["Markets"],"content":["There is a new player in the world of bitcoin ATMs, Singapore-based Tembusu Terminals. The company has just installed Singapore’s first permanent bitcoin ATM at a bar in the Boat Quay district.","Tembusu","says it is talking to other merchants who would like to install the company’s ATMs, too.","Earlier this month, Bitcoiniac announced it would install Robocoin ATMs in London and Singapore by mid-March. It appears that Tembusu has beaten the Vancouver-based outfit to the punch.","The Tembusu ATM was designed and built in Singapore. It features several security and anti-theft measures, including biometric security features like thumbprint scanning and elaborate know-your-customer (KYC) features.","It can scan user ID cards and it also has integrated anti-money laundering (AML) features, that can be fine-tuned to meet legal requirements in different jurisdictions.","“It has been an exciting, and some would even say trying, past few weeks for bitcoin users worldwide,” said Andras Kristof, Chief Technical Officer, Tembusu Terminals.","Tembusu says its ATM differs from competing solutions, thanks to its customisability and an intuitive full-touch screen interface.","The ATM can be outfitted with a “myriad of options”, the company says, and the fact that its anti-money laundering features can be adapted to meet different requirements might also be attractive to buyers.","Incidentally, the device can also be used to dispense fiat cash.","There are a few more down-to-earth reasons for the Tembusu ATM’s flexibility. Since it has plenty of KYC and AML features, it can be customized to meet regulatory requirements in different markets.","Earlier this year, the Monetary Authority of Singapore (MAS) said that it does not regulate bitcoins, and it has been advising the public to be cautious with virtual currencies.","Last week, Singapore’s Deputy Prime Minister and Finance Minister Tharman Shanmugaratnam said bitcoin does not fall under the regulatory purview of either his ministry or the MAS.","The Inland Revenue Authority of Singapore (IRAS) issued an advisory on bitcoin taxation earlier this year.","The regulatory climate is not currently very positive and it is relatively vague, so the ability to customize the Tembusu ATM simply had to be built in.","[post-quote]","The same is true of Robocoin ATMs, which also feature plenty of superfluous features that may be required by regulators in different jurisdictions or at different times.","When it comes to bitcoin ATMs, it is vital to have future-proof hardware – not for fear of going obsolete, but due to regulatory issues that may arise in the future.","Interestingly, the company says it is willing to deploy Tembusu ATMs with no down payment. Tembusu says the same flexibility extends to pricing and financing options.","CoinDesk was not given pricing details, however – the company encourages those who are interested in a quote to get in touch directly.","Boat Quay district image via Shutterstock"],"entity":[{"type":"Tharman Shanmugaratnam","content":"PERSON"},{"type":"Bitcoiniac","content":"PERSON"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Tembusu ATM","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tembusu Terminals","content":"ORGANIZATION"},{"type":"Tembusu","content":"ORGANIZATION"},{"type":"Vancouver","content":"LOCATION"},{"type":"Andras Kristof","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Monetary Authority of Singapore (MAS)","content":"ORGANIZATION"},{"type":"Inland Revenue Authority of Singapore (","content":"ORGANIZATION"},{"type":"ATM","content":"ORGANIZATION"}],"hashtag":["ATMs","Robocoin","Singapore","Technology","Tembusu","Bitcoin ATMs","Bitcoin","Regulation","News","Technology News"],"authors":["Nermin Hajdarbegovic"]}