{"summary":"Art dealers were agog at the NFT frenzy earlier this year. They should have a look now at the trading volumes on the OpenSea platform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/08\/17\/nft-trading-surges-8x-as-penguins-apes-drive-new-boom\/","publishDate":"2021-08-17T21:20:53","id":16028,"type":null,"title":"NFT Trading Surges 8X as Penguins, Apes Drive New Boom","category":["Markets"],"content":["","Trading in non-fungible tokens, or NFTs, is soaring to multiples of the levels seen earlier this year when the phenomenon burst into public consciousness with breathless headlines in mainstream media and gasps among art dealers.","","","The number of sales on OpenSea, the largest NFT marketplace, reached more than 60,000 per day over the past week, nearly eight times the peak in March, according to a report by crypto intelligence firm Coin Metrics. According to another data tracker, DappRadar, OpenSea's trading volume over the past 30 days was $1.22 billion, up 933% from the previous 30 days.","","","Such growth suggests the hysteria epitomized by the artist Beeple's $69 million sale of his work, “Everydays: The First 5000 Days,” at Christie’s may have merely represented a glimpse of the industry's potential.","","","“If NFTs start gaining as much outside attention as they did earlier this year, there may be an even bigger boom yet to come,” wrote Coin Metrics.","","","The latest boom was partly driven by the sale of NFT collections such as CryptoPunk, Bored Ape Yacht Club and Pudgy Penguins. ","","","Google search activity globally still ranks lower than in March: ","","","A tricky question for cryptocurrency traders is how to play the trend. There's a chicken-and-egg dilemma over how the NFT market affects the price of ether, the native cryptocurrency of the Ethereum blockchain, where much of the NFT ecosystem resides.","","","As NFTs are usually priced in ETH, a sudden rise in ETH price may deter new entrants to the NFT markets, the report noted. However, higher NFT sales may help attract new users to Ethereum.","","","In March and during the recent NFT boom, OpenSea sales and ether increased in tandem, according to Coin Metrics. During other times, such as in May, the ETH price peaked while NFT sales on OpenSea plummeted. ",""],"entity":[{"type":"$69 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.22 billion","content":"MONEY"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"933%","content":"PERCENT"},{"type":"Ethereum blockchain","content":"PERSON"}],"hashtag":["NFTs","Non-Fungible Tokens","OpenSea"],"authors":["Frances Yue"]}