{"summary":"Temurian v. Piccolo\nThe plaintiffs allege that based on defendant Joseph Reid’s suggestion, they hired defendants Piccolo, Johnson, and Morris (PJM defendants) to help them develop a software suite that would allow Vista to manage their business, and give their customers a platform to monitor their Vista Mini Miner usage\nThe defendants, allegedly, used confidential information to order a dozen Mini Miners sent to a dozen individuals, delete said orders, pocket that revenue, and direct customers to their own venture “Travelada” that was fraudulently selling Vista Mini Miners\nThe Court relied upon other federal decisions to come to the conclusion that cryptocurrency may be money for a claim of conversion","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21939\/mini-miner-software-developers-allegedly-misused-confidential-information-and-stole-revenue","publishDate":"2019-05-05T14:15:14","id":1602,"type":null,"title":"Mini miner software developers allegedly misused confidential information and stole revenue","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Temurian v. Piccolo, 2019 U.S. Dist. LEXIS 67469 (SD Fla. Case №18-cv-62737-BLOOM\/Valle, decided April 22, 2019) [NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","This opinion is an order granting in part a motion to dismiss particular counts in the most recent Amended Complaint in this case. The underlying allegations revolve around a business deal gone sour (don’t they all?) related to a business that made crypto mining rigs and needed help managing the business. The plaintiffs, Temurian and Vista Technologies (Vista makes mining rigs called “Vista Mini Miners”) assert numerous claims, such as: stealing trade secrets, stealing assets, multiple instances of fraud, breach of fiduciary duty, trademark infringement, breach of fiduciary duty, and some other claims. There is a lot going on in this case, but the order is particularly interesting with respect to one thing all companies aspire to… revenue.","A bit of background is in order. Vista is a company run by Armen A. Temurian that manufactures the Vista Mini Miners. The plaintiffs allege that based on defendant Joseph Reid’s suggestion, they hired defendants Piccolo, Johnson, and Morris (PJM defendants) to help them develop a software suite that would allow Vista to manage their business, and give customers a platform to monitor their Vista Mini Miner usage. As part of this agreement the PJM defendants were granted access to customer lists and other confidential information of the plaintiffs. From January 2018 — April 2018, the defendants, allegedly, used this information to order a dozen Mini Miners sent to a dozen individuals, delete said orders, pocket that revenue, and direct customers to their own venture “Travelada” that was fraudulently selling Vista Mini Miners.","The PJM defendants move to dismiss many of the claims against them. In particular, one of the counts the defendants move to dismiss is with respect to conversion of revenue. Conversion is, essentially, theft. Here the plaintiffs allege that the defendants stole the revenue for at least two Vista Mini Miner orders. That revenue was allegedly in the form of bitcoin. The defendants countered that this allegation was not specific and identifiable enough to satisfy the elements of conversion. In this case, the defendants have carried the day, and this count has been dismissed. Why?","Well, the court explained that although the 11th Circuit Court of Appeals has not decided whether cryptocurrencies are considered “money” for purposes of a claim of conversion, other federal courts have found that crypto is money for purposes of federal money laundering statutes (US v. Faiella), and that bitcoin can be used as money (SEC v. Shavers). The plaintiffs first alleged in their response to this motion to dismiss that the revenue was in the form of bitcoin, because apparently in their first amended complaint the plaintiffs forgot to mention it. As such, the court explains the plaintiff failed to state a claim for conversion to the extent that it is “based on stealing of revenues for at least two Mini Miner orders.” The subtext of the courts reasoning here is that if the plaintiffs had stated in their first amended complaint that the conversion of revenue claim was specifically related to stealing bitcoin the plaintiff’s claim might have survived.","Moral of the story? Make sure all your legal filings are complete and adhere to the strict requirements of any claim you are bringing forward. That’s just nuts and bolts lawyering.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}