{"summary":"Arbitrum backtracked on a key proposal. The result could be seen as a win for the promise of DAOs. the ordeal raised a number of thorny issues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224829\/arbitrum-backtrack-dao-governance","publishDate":"2023-04-04T18:09:21","id":1602,"type":null,"title":"Arbitrum&#x27;s backtrack raises questions about nature of DAO governance","category":["COMPANIES"],"content":["Arbitrum was <a href=\"https:\/\/www.theblock.co\/post\/224459\/arbitrum-proposal-backlash-response\" data-v-f87c67ca=\"\">forced to backtrack<\/a> on a key proposal earlier this week after token holders in the Ethereum Layer 2 scaling project who control the protocol's decentralized autonomous organization staged an apparent revolt by voting to stop the planned transfer of ARB tokens worth about $1 billion meant to capitalize the Arbitrum Foundation.","While the result could be seen as a win for the promise of DAOs — truly decentralized governance that works, even when it goes against what management wants — the ordeal raised a number of thorny issues. The central question being whether or not an organization can really function from the bottom up, at least in the beginning stage and especially when huge amounts of money – and potential profit – are involved.&nbsp;","\"A key issue DAO governance can face is the misalignment of short-term incentives with longer term goals,\" <a href=\"https:\/\/www.linkedin.com\/in\/charlottesdodds\/\" data-v-f87c67ca=\"\">Charlotte Dodds<\/a>, head of marketing at uncollateralized lending platform <a href=\"https:\/\/www.maple.finance\/\" data-v-f87c67ca=\"\">Maple Finance<\/a>&nbsp;said in an interview.","She pointed toward her previous experience in more traditional tech companies such as TikTok and said that sometimes centralized decision-making is necessary when companies want to quickly scale.","That's exactly the argument that the Arbitrum developers initially tried to make when the plan to capitalize their Arbitrum Foundation first drew controversy, calling it a \"ratification\" instead of what many thought should have been a more of a consultation.&nbsp;","\"When it comes to setting up a DAO, there’s a chicken and an egg problem,\" the developers said in a governance forum post on Sunday, arguing that parameters involving code transfer, security council creation and the drafting of a constitution needed to be set before the DAO could take over. \"There simply was no community that could have voted on these numbers, and the very act of creating the community required these parameters to be specified.\"","The debate followed the&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/222205\/arbitrum-airdrop-token-claim-live\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/222205\/arbitrum-airdrop-token-claim-live\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">high-profile airdrop<\/a> of Arbitrum governance tokens last month, an event that saw more than 1 billion ARB tokens allocated to nearly 300,000 wallets. It also resulted in the creation of the ArbitrumDAO.","\"Slightest whiff of 'team dictates everything' won’t be met with benefit of the doubt from here,\" they wrote. \"Build community or just don’t bother.\"","","","Nick Cannon, vice president of growth at Gauntlet Network, said that chickens and eggs might not make the cleanest analogy, but that \"the evolution component is real and tough to get right.\"","\"How can you know the mandates\/stances of DAO delegates before delegation?\" he said, adding that Arbitrum could have used better messaging.","\"In some cases it's better to ask for forgiveness but with DAOs you always want to ask for permission first,\" he said. \"The clarity post should have come first.\"","And while users including PaperImperium favor the big tent approach promised by many DAOs, BlockTower Capital general partner Thomas Klocanas pointed out some of the problems decentralized organizational structures face, including voter apathy and low participation.","\"For the most part, it doesn't really work today, in an overwhelming majority of cases,\" he said.","\"We have too much speculation around the space,\" he said. \"A lot of market participants hold tokens with no long-term interest in a specific project, so they don't bother to look into governance, let alone participate.\"","It's a sentiment that was shared by Maple's Dodds, who pointed out that some token holders may be more interested in personal profit over the long-term sustainability and vision of the protocol. You can have decentralization on a purely technical level, she said, but it becomes harder on an ethical level.","\"Some token holders have become accustomed to expecting profit from governance tokens, whereas when you're building a business, you're in it for the long haul,\" she said.&nbsp;\"The incentives are not necessarily aligned in any of this,\" Dodds continued, noting that many DAOs were purposely structured in a decentralized way so that their tokens would not be classified as securities.","\"What is the point of a DAO? There are huge advantages to being community-led, but in reality, it's complicated,\" she said, noting that even if voting may be decentralized, the initial allocation of tokens may result in a centralized voting process.","Klocanas said that investor activism could point to a possible solution, noting projects including Paladin and StakeDAO that are working to create \"governance markets.\"&nbsp;","\"Long term though, tokens can't just confer rights to governance,\" he said. \"We need to find a way, as the crypto community and from a regulatory perspective, to have these things naturally evolve from idea, to meme \/ utility token, to governance token and eventually to network equity- ie something with cash flow rights but not to a company \/ common enterprise, but to a network \/ collective.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Nick Cannon","content":"PERSON"},{"type":"Thomas Klocanas","content":"PERSON"},{"type":"Maple","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"\" <a href=\"https:\/\/www.linkedin.com\/in\/charlottesdodds\/\" data-v-f87c67ca=\"\">Charlotte Dodds","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Gauntlet Network","content":"ORGANIZATION"},{"type":"Dodds","content":"PERSON"}],"hashtag":["DAOS"],"authors":["Nathan Crooks","Frank Chaparro","The Block"]}