{"summary":"Franklin Caldwell was trying to spoof an ongoing Ethereum Name Service (ENS) listing meme but lost 100 ETH in the process.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158912\/bored-ape-whale-loses-150000-of-eth-in-ens-listing-fumble","publishDate":"2022-07-21T07:11:19","id":1603,"type":null,"title":"Bored Ape whale loses $150,000 of ETH in ENS listing fumble","category":["NFTS"],"content":["Franklin Caldwell, or “franklinisbored” as he is known on Twitter, <a href=\"https:\/\/twitter.com\/franklinisbored\/status\/1549838025882042373\" data-v-f87c67ca=\"\">lost<\/a> 100 ETH ($150,000) in an Ethereum Name Service (ENS) domain name transaction on Wednesday.","Caldwell is the seventh-largest holder of Bored Ape Yacht Club non-fungible tokens (NFTs) and is regarded as an influencer in the NFT space.","It all started when Caldwell <a href=\"https:\/\/opensea.io\/assets\/ethereum\/0x57f1887a8bf19b14fc0df6fd9b2acc9af147ea85\/64553282419989963762071630881067131295599974090350095364987175249844824906958\" data-v-f87c67ca=\"\">created<\/a> the ENS domain “stop-doing-fake-bids-its-honestly-lame-my-guy.eth\" on Tuesday. Caldwell then placed a 100 wrapped ETH (WETH) bid on the ENS domain.","This was done to draw attention to the fact that people routinely create ENS with comical phrases and place fake bids on them. This is done to get attention from a listing bot that's shares such bids on Twitter — and can often see a large number of retweets if the names are particularly humorous.","Another NFT collector who goes by \"8892\" on Twitter placed a 1.89 WETH ($2800) offer on the x2y2 marketplace. Caldwell <a href=\"https:\/\/etherscan.io\/tx\/0xdf1b9abd7887694e912dac9415e46d776739e597bc7d16199c720e617a567611\" data-v-f87c67ca=\"\">accepted<\/a> the offer, forgetting that he had previously placed the 100 WETH “joke bid” on the same item. <em data-v-f87c67ca=\"\">8892<\/em> was then able to accept the existing 100 WETH offer since it was still there. This automatically triggered the sale of the ENS name back to Caldwell for 100 WETH.","In all, <em data-v-f87c67ca=\"\">8892<\/em> made a 97.5 WETH in profit off Caldwell’s mistake. The Bored Ape whale realized the error and contacted 8892 by sending an on-chain message to <em data-v-f87c67ca=\"\">8892<\/em>. Caldwell also refunded the 1.89 WETH in the hope of getting 8892 to reverse the transaction. Yet the latter wasn't moved by the gesture.","“I ripped this guy off for 100 ETH and he just sent me another 1.9?” <em data-v-f87c67ca=\"\">8892<\/em> <a href=\"https:\/\/twitter.com\/8892OS\/status\/1549864080059600903\" data-v-f87c67ca=\"\">tweeted<\/a> in response.","Caldwell is not the first to suffer such a loss due to a failure to cancel previous NFT listings. You have to pay transaction fees to cancel an existing listing and NFT owners have been known to forget to do so. Even when a sale happens, it does not cancel previous offers and the new owner can choose to accept any one of them.","Sometimes, NFT owners move their items to a different wallet, forgetting to cancel existing listings. When these items are moved back to the original wallet, the old listing becomes activated. <a href=\"https:\/\/www.theblockcrypto.com\/post\/131443\/opensea-reimburses-users-sold-nfts-below-market-value-ui-issue\" data-v-f87c67ca=\"\">This listing bug problem has been exploited<\/a> in the past on OpenSea leading to high-value NFTs being sold for significantly lower prices.","Caldwell’s mistake is also part of a <a href=\"https:\/\/www.theblock.co\/post\/155685\/ethereum-name-service-records-second-highest-ens-name-sale\" data-v-f87c67ca=\"\">growing interest in ENS domain names<\/a>. One ENS collector recently <a href=\"https:\/\/www.theblock.co\/post\/158540\/ethereum-name-service-collector-buys-sony-eth-ens-for-72000\" data-v-f87c67ca=\"\">bought sony.eth for $72,000<\/a> while amazon.eth has also saw a $1 million offer — although it wasn't accepted.","ENS belongs to the class of web3 usernames. They are a type of human-readable crypto address that are easier to read than&nbsp; blockchain wallet addresses that consist of long alphanumeric text strings. ENS names are minted as NFTs and can be transferred on sold on platforms like OpenSea, x2y2, and LooksRare.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$150,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Franklin Caldwell","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$72,000","content":"MONEY"},{"type":"Caldwell","content":"PERSON"},{"type":"8892","content":"DATE"},{"type":"$2800","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}