{"summary":"With a plan to buy up $10 billion of BTC, Do Kwon’s UST stablecoin project may be fulfilling a prophecy by the late recipient of the first bitcoin transaction.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/03\/27\/just-as-hal-finney-predicted-bitcoin-is-being-purchased-to-act-as-a-reserve-currency\/","publishDate":"2022-03-27T14:50:00","id":16037,"type":null,"title":"Just as Hal Finney Predicted, Bitcoin Is Being Purchased to Act as a Reserve Currency","category":["Markets"],"content":["Hal Finney received the first-ever Bitcoin transaction. Hal passed from ALS in 2014, but his legacy lives on because he was a genius (at least, by my account). Or a time traveler. Or a clairvoyant. I mean, he tweeted this in 2009.","Later, in 2010, Finney wrote a message on the famed BitcoinTalk forum that discussed the “ultimate fate of Bitcoin, to be the ‘high-powered money’ that serves as a reserve currency for banks that issue their own digital cash.” Now we’re seeing another Finney premonition potentially coming true.","You’re reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Sunday.","On March 14, Do Kwon, the founder of Terraform Labs, announced UST was going to be backed by a $10 billion reserve of bitcoin (BTC). Terraform Labs created the Terra protocol that issues the stablecoin terraUSD (UST) and luna (LUNA), the latter of which algorithmically backs the former.","While Terraform Labs is not exactly a bank, it is issuing its own digital cash to make paying for things easier – and it’s about to be backed by bitcoin. This is a big deal for anyone with a vested interest in the Bitcoin system, even if you vehemently reject altcoins (non-bitcoin cryptos; there is another, less flattering term for these).","Taking a step back, a stablecoin is a cryptocurrency whose value is pegged to some other asset, usually the U.S. dollar. Stablecoins are important because they are widely used in crypto trading, with Tether’s USDT making up a majority of trading volume. But they also have potential payment applications. In total, USD stablecoins represent at least $180 billion of total market value.","Most popular stablecoins, like USDT and Circle’s USD coin (USDC), hold real-world assets as backing. For USDT, it’s a mixed bag; for USDC it’s cash (and “fairly stated” cash equivalents). These are called collateralized stablecoins. There are other types of stablecoins known as algorithmic stablecoins, like UST.","I’ll admit that I sorta kinda lied to you. UST is algorithmic but it will become somewhat collateralized. The Luna Foundation Guard (LFG) was set up in January. LFG is a nonprofit organization with a mission focused on promoting a “truly decentralized economy.” Its primary focus is Terra and providing a reserve backstop in case the UST\/LUNA incentive mechanism fails. What better asset to hold in reserve than the preeminent crypto and reserve asset 3.0?","Initially, LFG intends to buy $3 billion of BTC. Of that, $2.2 billion has already been raised through $1 billion of outside funding and $1.2 billion of USDT which was purchased with UST that LFG already had (the remaining $800 million is coming). Kwon added on Twitter that the BTC reserve could grow to $10 billion by using a “portion of the seigniorage '' through normal operation of the Terra protocol to buy BTC. Seigniorage is a big word for the excess value of newly minted currency over the cost of producing it. In government terms, U.S. quarters have less than $0.25 of metal in them; in UST terms, the cost of production is nearly zero so a portion of seigniorage profits are burned and the other portion goes to the treasury.","It may have already started. There is a bitcoin address that’s rumored to be LFG’s and it looks as if the nonprofit is buying $125 million of BTC every day. For an asset that churns out >$20 billion in volume each day that doesn’t seem like much, but 60 basis points of volume can be meaningful. Kyle Davies of crypto hedge fund Three Arrows Capital indicated as much on Twitter. These daily purchases could also last for months if LFG does in fact want to get to $10 billion of BTC reserves.","This should appeal to anyone who pays attention to crypto. The main criticism of collateralized stablecoins is that their need for “attestations” (not quite the same thing as audits) by accountants cut against the ethos of crypto. “Don’t trust, verify” pulses through the veins of lovers of decentralization, and just taking what Circle or Tether tells us about their backing at face value seems wrong.","If successful, UST could become a dollar stablecoin backed by a completely auditable, transparent and decentralized digital asset. That’s a big deal. You won’t need to trust Do Kwon that the collateral is there, nor an accounting firm that will qualify its assurances with weasel words. You’ll be able to see for yourself on the blockchain.","And if this happens, you won’t be able to convince me that Hal wasn’t just another physical manifestation of Pythia."],"entity":[{"type":"2014","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2010","content":"DATE"},{"type":"$180 billion","content":"MONEY"},{"type":"$2.2 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Hal Finney","content":"PERSON"},{"type":"$20 billion","content":"MONEY"},{"type":"Terra","content":"LOCATION"},{"type":"$125 million","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Hal","content":"PERSON"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Finney","content":"PERSON"},{"type":"March 14","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"LFG","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"$0.25","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"$800 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Pythia","content":"LOCATION"}],"hashtag":["Crypto Long & Short","Hal Finney","Stablecoins","Terra","Do Kwon","Luna Foundation Guard"],"authors":["George Kaloudis"]}