{"summary":"The technology known as DVT involves splitting a validator's private key across several node operators. The goal is to increase the network's resilience – while also protect the individual validators – by reducing single points of failure.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/06\/14\/distributed-validator-technology-marks-last-key-milestone-in-ethereums-current-era\/","publishDate":"2023-06-14T15:30:00","id":16038,"type":null,"title":"‘Distributed Validator Technology’ Marks Last Key Milestone in Ethereum’s Current Era","category":["Technology"],"content":["Decentralization is a pillar of the blockchain ethos, and Ethereum developers are now prioritizing a new design feature that could take the precept to the next level.","The push is for “distributed validator technology,” or DVT. The Ethereum blockchain depends on 606,947 validators to confirm transactions made on the network, per BeaconScan, but each of those individually might be seen as a point of failure.","What’s more, the validators themselves can be subject to stiff financial penalties known as “slashing” when they go offline for extended periods. So the validators also have an incentive to increase their own resiliency.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday.","So the idea is that the validators themselves can become decentralized.","Ethereum co-founder Vitalik Buterin has listed distributed validators among the blockchain’s top priorities since at least 2021, when he wished the Beacon Chain happy birthday and provided an updated roadmap for the second largest blockchain by market capitalization, notable for its smart contracts.","DVT has attracted more discussion and development focus in recent months among entrepreneurs and crypto analysts at firms including Messari, Coin Metrics, Bankless, Wu Blockchain and Pantera Capital.","Under the technology, a validator’s private key – used to sign on-chain operations like block proposals and attestations – can be split across several node operators. As a result, the duties and responsibilities of a validator can be distributed and shared across a cluster of node operators, instead of a single node.","Distributed validator technology “allows you to have multiple parties running a single validator,” said staking service provider P2P’s head of Research Steven Quinn to CoinDesk. “From a technical perspective, what that means is you can geographically distribute the machines.”","The 2021 roadmap, while not entirely complete, shows Ethereum’s trajectory of where it’s been and where it’s going, delineating different eras of current and future development.","Currently, Ethereum is still in the first era, titled, “The Merge,” even though Ethereum has successfully shifted to a proof-of-stake consensus mechanism, completely overhauling its system for processing transactions.","What’s left among the key milestones in the current era is the deployment of distributed validators, which is on its way thanks to two open-source networks: Obol and SSV.","Obol Network is “responsible for fostering the adoption of multi-operator validation as a use case for Distributed Validator Technology,” as stated on its homepage, and SSV.Network “enables the distributed operation of an Ethereum validator across varying operators,” according to a blog post.","Currently, each Ethereum validator runs on a single node, and both Obol and SSV see this as a single point of failure in the validation process. If a node operator goes offline and becomes unavailable for whatever reason like an infrastructure bug in the validator’s client, then the validator wouldn’t be able to conduct its responsibilities, such as proposing blocks and attesting.","As a result, the validator would incur a slashing penalty for their staked ether. Obol and SSV are attempting to remove this single point of failure in the validation process.","In regards to DVT, Messari research analyst Stephanie Dunbar told CoinDesk, “What I’m most excited about is the idea of increasing resiliency on Ethereum and in the future, potentially on other blockchains as well.”","DVT’s importance lies in making the Ethereum blockchain more resilient, defined as Ethereum being able to “withstand external and internal disturbances - this can be from geopolitics, regulation, markets or even less intuitive disruptions like fires or earthquakes,” Walter Smith from technology-driven investment firm Galaxy to CoinDesk over email.","With more clients and node operators in different geographical areas running a single validator, even if several node operators experience downtime as a result of a malicious actor or a bug in the codebase, the entire validator wouldn’t go down since a significant portion of the network is using distributed validator technology.","“Should <33% of the participating nodes in a DV cluster go offline, the remaining active nodes can still come to consensus on what to sign and can produce valid signatures for their staking duties,” per Obol docs.","Distributed validator technology represents the last critical development in Ethereum’s Merge era before “The Surge,” as Obol and SSV have been gearing up to bring distributed validators to Ethereum mainnet.","SSV is in its last step before its mainnet launch, with the introduction of its public testnet Jato in March, and Obol had started deploying distributed validators on Ethereum mainnet in April.","DVT “makes the heart of the crypto universe - Ethereum - more robust, more decentralized and more credibly neutral, opening its protocols and uses to all in a more stable manner,” according to Smith.","Edited by Bradley Keoun."],"entity":[{"type":"2021","content":"DATE"},{"type":"Steven Quinn","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Smith","content":"PERSON"},{"type":"Bankless","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Walter Smith","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Stephanie Dunbar","content":"PERSON"},{"type":"Distributed Validator Technology","content":"ORGANIZATION"},{"type":"SSV","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Wu Blockchain","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Validators","Protocols","Staking","Decentralization"],"authors":["Sage D. Young"]}