{"summary":"The record high comes as the world’s two largest cryptocurrencies continue to rally.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/10\/21\/crypto-market-cap-surges-to-new-record-27-trillion\/","publishDate":"2021-10-21T13:11:51","id":16033,"type":null,"title":"Crypto Market Cap Surges to Record $2.7T","category":["Markets"],"content":["As bitcoin (BTC) rallied to an all-time high of $66,000 on Wednesday, the market capitalization for all cryptocurrencies has pushed to a new record of $2.7 trillion, according to data from CoinGecko.","Ether (ETH), the native cryptocurrency of the Ethereum network, has also been climbing. The cryptocurrency hit a five-month high over $4,200 early Thursday.","The industry’s total market cap has more than tripled since the beginning of this year, when it stood at $770 billion.","The surge in the overall industry’s valuation comes amid a new spirit of ebullience that has invigorated crypto markets since the start of October, with the rollout of first-of-their-kind exchange-traded funds (ETFs) linked to bitcoin futures prices and big Wall Street firms increasingly viewing cryptocurrencies as a legitimate asset class for investors.","The fast growth has also raised alarms among regulators, worried that stablecoins and other cryptocurrencies could present risks to the stability of the traditional financial system.","The total crypto market capitalization is now roughly double that of silver’s $1.4 trillion, according to the website companiesmarketcap.com, and has climbed as a percentage of gold’s $11.3 trillion. The crypto market cap also exceeds the valuation of the shares of Apple, the world’s largest publicly traded company, at $2.5 trillion.","At press time, bitcoin was trading at $65,000, up 12% on the week.","\n","\n"],"entity":[{"type":"$65,000","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$2.7 trillion","content":"MONEY"},{"type":"$1.4 trillion","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"$4,200","content":"MONEY"},{"type":"$2.5 trillion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$770 billion","content":"MONEY"},{"type":"$11.3 trillion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$66,000","content":"MONEY"}],"hashtag":["Market Cap","Bitcoin","Ether"],"authors":["Lyllah Ledesma"]}