{"summary":"The Blockchain Association CEO discusses the current regulatory moment, the rules crypto needs and life as a lobbyist on the Hill.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/04\/26\/kristin-smith-sees-bright-outlook-for-us-crypto-policy\/","publishDate":"2023-04-26T14:16:10","id":16035,"type":null,"title":"Kristin Smith Sees 'Bright' Outlook for U.S. Crypto Policy","category":["Consensus Magazine"],"content":["For years the U.S. crypto industry has been demanding regulatory clarity from policymakers. And Blockchain Association CEO Kristin Smith has been at the forefront of that charge. Today, few could say U.S. regulators and legislators are being ambivalent about crypto – even if they haven't exactly figured out how to treat this nascent industry.","This article is excerpted from The Node newsletter, which will send two editions daily during the Consensus 2023 conference running down the biggest news from the event. You can subscribe to get the full newsletter here or get IRL or virtual tickets for Consensus 2023 here.","CoinDesk sat down with Smith ahead of Consensus 2023 to get her thoughts on the current regulatory moment, the policies crypto needs and life as a lobbyist on the Hill.","What do you make of the term \"Operation Choke Point 2.0,\" coined to describe a seemingly coordinated effort among various U.S. government agencies to dislocate crypto from the wider economy?","Blockchain Association is currently investigating claims of crypto de-banking, launching a tipline – debanked@theblockchainassociation.org – and asking industry participants to come forward with stories. We’re committed to discovering the truth about these allegations.","Do you think we could expect to see comprehensive crypto regulation in the U.S. this year or in the coming years?","The industry will likely have to wait 18 to 22 months to see real movement. However, we are still in a period of great opportunity to continue educating and laying the foundation for a strong regulatory future.","Could you give us an inside view into your work in Washington. D.C.? Are you finding it easier to engage with policymakers these days?","Policymaker education is critical – and that’s our top priority at Blockchain Association. We have found that many policymakers are open to learning more about the technology and we believe that greater acceptance will come as people become more knowledgeable about the space.","What does Sen. Elizabeth Warren's [D-Mass.] anti-crypto army say, if anything, about the role crypto will play in the coming election cycle?","The senator has embraced the term “anti-crypto” when describing her critical views of the space. However, her views rarely reflect that of the mainstream, even within the Democratic party. Advocates are already pushing back in preparation for the next election cycle. The Blockchain Association is building a pro-crypto army, and continues to educate willing policymakers.","In a word, how would you describe your outlook regarding crypto policy in the U.S.?","Bright.","See also: Where the U.S. Government Went Wrong in Regulating Crypto | Opinion","Edited by Ben Schiller."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"U.S. Government Went Wrong","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"Kristin Smith","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Smith","content":"PERSON"}],"hashtag":["Opinion","Blockchain Association","Kristin Smith","Interview"],"authors":["Daniel Kuhn"]}