{"summary":"Multisignature wallets provide enhanced security for cryptocurrency holders, making them an excellent solutions for advanced users who need to manage funds as a group.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-multisig-wallets-and-how-do-they-work\/","publishDate":"2023-10-02T14:04:35","id":16045,"type":null,"title":"What Are Multisig Wallets And How Do They Work?","category":["Learn"],"content":["With security being a common concern among cryptocurrency users, multisig wallets are one of the most advanced security-enhancing tools available. Provided the keys are properly stored, multisig wallets can help eliminate the single point of failure that traditional single-key wallets face.","This is partner content sourced from Laura Shin’s Unchained and published by CoinDesk.","Read on to learn about multisig wallets, how they work, the various types available, and when to use them.","A multisignature wallet, also known as a multisig wallet, utilizes multiple private keys to access cryptocurrency assets or transfer them. The parties use smart contracts to determine the access rules when accessing the wallet.","With multisig wallets, you can enjoy a version of multi-factor authentication. This feature is especially relevant when the assets belong to multiple parties in a company or a decentralized autonomous organization (DAO).","Multisig wallets work by requiring two or more private keys to execute a transaction. Using a smart contract, the wallet owners agree to the access rules, including the minimum number of keys.","These wallets are a seedless form of self-custody since the owners govern them on-chain based on the rules established in the smart contract. Multisig wallets are a departure from traditional wallets that are user-controlled endpoints.","The required number of keys for a transaction distinguishes the various types of multisig wallets.","1-of-2 Signatures","Two parties that trust each other can use this multisig wallet to share funds without requiring the authorization of the other.","2-of-3 Signatures","This is one of the most popular multisig wallets that requires two private keys to execute a transaction. The common practice is having one key online, another offline, and the third with a security company.","3-of-5 Signatures","The key holders store four keys in different offline locations, and the fifth remains with the wallet provider or a security company for improved security. Access to your crypto assets is possible if you can access two of the four offline keys.","All three multisig wallet types above are threshold signature wallets. You can set the smart contract to require all private keys for access. If the predetermined number of signatories is five, all five keys are required to validate any transaction.","There are several benefits associated with multisig wallets.","Multisig wallets aren’t all rosy; there are some disadvantages as well.","Below are various instances where using multisig wallets comes in handy.","Escrow transactions between two parties can use 2-of-3 multisig wallets. With the two parties in agreement, the transaction proceeds without a hitch. In case of a dispute, the third party arbitrates and decides on the transaction direction.","Trading, borrowing, and lending can occur through collective decision-making without involving intermediaries. A transaction can occur if there is a consensus among the minimum threshold of key holders.","In cases where parties collectively own crypto assets, multisig wallets make it easier to build trust among wallet users. Transactions involving shared assets can only occur when all parties agree on using the funds.","The crypto industry is marred with several fraud cases, making wallet security paramount. In addition, the rampant exit scams make collaboration and investment challenging. As the cryptocurrency landscape changes, multisig wallets provide an excellent option for cryptocurrency holders to maintain control of their assets and keep them secure."],"entity":[{"type":"Signatures","content":"TIME"},{"type":"Laura Shin’s Unchained","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":["Learn","Multisig wallet","Unchained"],"authors":["Unchaine d"]}