{"summary":"The blockchain-friendly online retailer is planning to distribute its long-delayed digital asset shareholder dividend on May 19.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/04\/08\/overstock-is-set-to-finally-pay-out-its-digital-security-shareholder-dividend\/","publishDate":"2020-04-08T10:00:00","id":16047,"type":null,"title":"Overstock Is Set to Finally Pay Out Its Digital Security Shareholder Dividend","category":["Finance"],"content":["","Overstock.com plans to distribute its long-delayed \"digital security\" shareholder dividend on May 19.","","","Shareholders will receive one Digital Voting Series A-1 Preferred Stock (OSTKO) for every 10 of the online retailer’s shares they hold on April 27, the record date, according to Overstock’s Tuesday press release. OSKTO is a “digitally enhanced security” that trades on affiliate tZERO’s blockchain-backed platform – the only trading system that can support it.","","","If the distribution goes without a hitch, it may validate a corporate gambit whose creator, former Overstock CEO Patrick Byrne, considered revolutionary. Byrne thought the blockchain dividend could drive growth for tZERO’s blockchain trading system and simultaneously “expose the slop” he said was inherent to Wall Street’s capital markets. ","","","Byrne resigned less than a month after his proposal’s July 2019 reveal. Overstock’s new leadership continued to push for blockchain dividends, calling it “of great importance to the Company’s blockchain strategy,” in Securities and Exchange Commission (SEC) regulatory filings. ","","","“In particular, we believe the successful issuance of the Dividend will demonstrate to other issuers and market participants that this technology is scalable and has significant benefits to all market participants,” CEO Jonathan Johnson and chairwoman of the board Allison H. Abraham wrote in the undated filing from Overstock’s investor site.","","","Overstock’s May 19 dividend issuance will be more a theoretical demonstration than technological vindication, however. As described in the Tuesday filing, OSTKO is a “digitally enhanced security,” not a full digital asset.","","","That’s because OSTKO’s on-chain representation is a legally irrelevant “courtesy carbon copy” of the security’s real ownership records held on transfer agent Computershare’s “conventional records,” which update before the distributed ledger does.","","","Johnson told CoinDesk on Tuesday the technological concession helps the asset “fit within regulatory parameters” (OSTKO is being registered with the SEC). It’s essentially a bridge.","","","“The goal is that as regulators and market participants become increasingly comfortable with DLT\/blockchain technology, it will gradually play a larger role in the overall process to the benefit of investors, regulators and other market participants,” he said.",""],"entity":[{"type":"July 2019","content":"DATE"},{"type":"May 19","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Patrick Byrne","content":"PERSON"},{"type":"Jonathan Johnson","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Computershare","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"April 27","content":"DATE"},{"type":"Overstock","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Allison H. Abraham","content":"PERSON"}],"hashtag":["Overstock","Patrick Byrne","Dividends","Tzero","Digital Securities"],"authors":["Danny Nelson"]}