{"summary":"The story of Sevi, a talented artist who happens to be a 10-year-old autistic boy living in Manila.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/06\/far-from-the-sbf-trial-a-very-different-web3-narrative-is-unfolding\/","publishDate":"2023-10-06T16:08:28","id":16044,"type":null,"title":"Far From the SBF Trial, a Very Different Web3 Narrative Is Unfolding","category":["Consensus Magazine"],"content":["The collapse of FTX has cast a long shadow over Web3. Critics argue the company’s failure is proof that this new technology is a net negative to society when left to the free market, giving speculators new ways to gamble and criminals’ new tools to evade law enforcement.","Indeed, as the trial of FTX founder Sam Bankman Fried (SBF) is set to begin, the New York Times tells us crypto is on trial, and that the case will surely shine a “harsh glare” on all in the industry, like a blacklight on the proverbial hotel bedspread. Tying the fate of the industry to a spectacular failure fits a familiar pattern. The South Sea Bubble was blamed on the corporation itself. In 2009, the New York Times wrote that capitalism was on trial for the Financial Crisis. Sound familiar?","Alex Tapscott is the author of the new book \"Web3: Charting the Internet’s Next Economic and Cultural Frontier\" out now.","In actuality, we can blame the collapse of FTX not on Web3 or specific innovations like tokens but on the hubris and misdeeds of those wielding them. More simply put, FTX was likely garden-variety fraud.","I have spent the last two years writing a new book, “Web3: Charting the Internet’s Next Economic and Cultural Frontier,” shining a light on the ways in which citizens, entrepreneurs, creators and business leaders are being impacted by Web3. I have reached a different conclusion: If Web1 and Web2 democratized access to information and made it easier to meet and collaborate online, Web3 equips us with a more powerful toolset to earn money, own assets, and build wealth on a globally level playing field, decentralizing power and influence in the process.","While the FTX case reinforces the stereotype that crypto is the domain of rich tech bros and other entitled elites, the bigger picture is more nuanced. Other than the U.S. and Ukraine, the top ten counties for crypto adoption, according to Chainalysis, are all in the Global South, in countries like Vietnam and the Philippines.","Far away from the Manhattan courthouse where SBF is being tried, we see a different narrative unfolding, featuring Sevi, a 10-year-old autistic artist living in the Philippines. Like many families, Sevi’s carried the financial burden of providing specialized care for their autistic child. Early programs in art therapy, gymnastics and football helped Sevi develop essential skills and navigate social interactions. But the costs mounted. Ultimately, Sevi’s family asked him which program he wished to continue. He chose art.","When words failed him, Sevi’s mother, April Agregado, discovered he could communicate more easily through his paintings. She began sharing his artwork on social media, where it gained the attention of friends and family. Some even expressed interest in purchasing his pieces. Initially hesitant to sell her son’s art, April learned about the market for NFTs. With the guidance of her friend, April began minting NFTs, essentially creating unique digital versions of Sevi’s art.","NFTs are now often seen as speculative playthings promoted by unscrupulous promoters, celebrities, and other peddlers. Regrettably, as with everything in this nascent industry, that has a ring of truth to it. But NFTs are also one of several tools in the Web3 toolkit that can help creators flourish wherever they are in the world. Yat Siu, a prominent industry investor, told me recently “If bitcoin is a store of value, NFTs are a store of culture.”","Read more: Emily Parker - Michael Lewis Was Charmed by Sam Bankman-Fried – But So Was Everyone Else","In Sevi’s case, they function as exclusive and authorized digital twins of Sevi’s copyrighted work, where Sevi retains the original, but NFT buyers hold second sale rights, that is, the right to sell their NFTs to somebody else. April listed a selection of Sevi’s art pieces on the NFT marketplace OpenSea, accompanied by information about Sevi himself.","Sevi’s story resonated profoundly within the burgeoning Web3 community at home and abroad. His NFTs began to sell, and he garnered an invitation to showcase his work at NFT.NYC, one of the industry’s largest events. There, his creations graced a Times Square billboard.","To date, Sevi has earned around $16,000 from sales of his digital art — that’s more than the average annual income of a Filipino. While Sevi’s journey as an artist may be unique, the Web3 tools his family used are accessible to everyone. These tools give individuals a means of tracking provenance of their digital assets, from creation to the latest transaction, a paradigm shift with far-reaching implications.","Sevi’s newfound financial independence also grants him the freedom to pursue diverse interests. His mother April hopes he will rekindle his passion for football or gymnastics. The NFTs that have empowered Sevi’s family are the same tools for rebalancing the power among creators, consumers, and the intermediaries between them.","Back in the United States, Silicon Valley has been described as a “Tech Galapagos,” a place where unique conditions breed Internet giants. But Web3 transcends geographical boundaries, with potential to level the playing field and democratize economic opportunities for creators worldwide.","Sevi serves as a powerful testament to the transformative potential of Web3. His family demonstrates that Web3 is not just a buzzword or an abstract concept; it’s a game-changer with real-world impact on people’s lives. While Sevi’s story as an artist may not be replicable, the tools he used are available to everyone. They give individuals ownership over their digital goods — in this case, a talented autistic boy’s art. For now, Sevi is happy doing art, but his interests might change. Sevi’s mom, April, would love Sevi to pick up football or gymnastics again. Thanks to his art and Web3, they can now afford to give him the help he needs."],"entity":[{"type":"$16,000","content":"MONEY"},{"type":"Vietnam","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Emily Parker","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Michael Lewis","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Alex Tapscott","content":"PERSON"},{"type":"April Agregado","content":"PERSON"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Cultural Frontier","content":"ORGANIZATION"},{"type":"Tech Galapagos","content":"PERSON"},{"type":"Yat Siu","content":"PERSON"},{"type":"Sevi’s","content":"PERSON"},{"type":"Sevi","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"last two years","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"Sevi","content":"PERSON"},{"type":"Financial Crisis","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Opinion"],"authors":["Alex Tapscott"]}