{"summary":"New rules could kill off permissionless smart contracts, the industry worries.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/06\/20\/eu-commission-brushes-off-data-act-fears-by-crypto-industry\/","publishDate":"2023-06-20T17:28:54","id":16041,"type":null,"title":"EU Commission Brushes Off 'Data Act' Fears by Crypto Industry","category":["Policy"],"content":["New EU data rules won’t make smart contacts illegal, the European Commission has said, brushing off industry concerns about killing off blockchain innovation.","The industry fears that the Data Act, an EU bill now being deliberated, imposes unworkable requirements that smart contracts should withstand manipulation, safely reset, and control access – but officials say there’s nothing to worry about for Web3 entrepreneurs.","“There is no reason to fear existing smart contracts would become illegal upon the entry into force of the Data Act,” a spokesperson for the commission, which proposed the bill in 2022, told CoinDesk.","Though acknowledging the law goes wider than just covering the Internet of Things – meaning connected devices such as smart fridges – “the new provision is intended to cover software, which is used to automatize the execution of contracts (in the context of data sharing),” the spokesperson said, adding that requirements in the controversial parts of the law “are quite high-level and they should not be problematic for the vendors of smart contracts software.”","That explanation seems to have done little to assuage the concerns of industry lobbyists, who worry the law could end up going much wider than intended.","“The drafting as it stands is extremely wide, and it will therefore almost inevitably create uncertainty about what the intended scope is,” CoinDesk was told by Chris Donovan, general counsel at the NEAR Foundation, an organization which supports the NEAR blockchain protocol.","“We've seen what regulatory uncertainty can do to our industry in other jurisdictions,” Donovan added, referring to the U.S., where multiple crypto companies are now being pursued by securities regulators, adding that the EU’s proposed strictures “would probably be extremely challenging, or in some cases impossible to fulfill.”","Smart contracts are programs that use blockchain technology to release funds automatically when given conditions are met – and have numerous applications in decentralized finance.","While the EU’s plans could be workable for some private blockchains where there’s a central gatekeeper, Donovan worries they could undermine the whole point of public, permissionless networks where the fact that no party can manipulate the contract is the whole point.","“In a public permissionless context where everything is done on an open source basis, and often smart contracts are deployed in a way that is truly immutable, they can't actually be subsequently updated, paused or reversed,” he said. “That's deliberately by design to create trustless transaction environments.”","A recent open letter sent to lawmakers and the commission last week calls for a range of drafting changes to be made to the law to sweep away those unhelpful ambiguities.","The letter, signed by companies such as Fujitsu, Ledger and Ripple and lobbying organizations the European Crypto Initiative and Blockchain for Europe, says that the law would jeopardize smart contracts written on blockchains such as Ethereum, Avalanche, Cardano, NEAR and Polkadot, potentially conflict with recently agreed Markets in Crypto Assets law, and damage the European economy.","In terms of the legislative process, it’s late in the day. Both arms of the EU legislature – the Council which groups member states, and lawmakers at the European Parliament – have approved their own versions of the text, in each case containing the controversial smart contract provisions.","But Donovan remains optimistic.","“I'm hopeful that we will be heard, and that those modest requests will be accommodated,” he said.","Read more: EU Parliament Passes Bill Requiring Smart Contracts to Include Kill Switch","Edited by Sandali Handagama."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Chris Donovan","content":"PERSON"},{"type":"Cardano","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Council","content":"ORGANIZATION"},{"type":"EU Parliament Passes Bill Requiring Smart Contracts to Include Kill Switch","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Donovan","content":"PERSON"},{"type":"Fujitsu","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"European Crypto Initiative","content":"ORGANIZATION"},{"type":"NEAR Foundation","content":"ORGANIZATION"},{"type":"Sandali Handagama","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Regulations","EU","EU Parliament","smart contracts"],"authors":["Jack Schickler"]}