{"summary":"Cosmos is building a separate blockchain that will be used for trialing protocols prior to launching on the mainnet.\nLike Polkadot’s Kusama, tokens on the blockchain will have real value.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121257\/cosmos-is-building-a-new-blockchain-called-sagan-for-experimentation","publishDate":"2021-10-19T12:29:29","id":1605,"type":null,"title":"Cosmos is building a new blockchain called Sagan for experimentation","category":["Layer 1s"],"content":["Blockchain platform Cosmos is launching a new blockchain, called Sagan, for testing and experimentation.","At the end of its first <a href=\"https:\/\/www.youtube.com\/watch?v=6uKR5SoN8nE\" data-v-f87c67ca=\"\">keynote presentation<\/a> — which will now become a quarterly event — Cosmos teased the launch of Sagan with a 30-second clip that&nbsp;included a quote by Carl Sagan, a famous American cosmologist, the name of the blockchain, and an image of a canary.&nbsp;","The canary symbolizes that this blockchain will be a “canary network,” according to a source familiar with the situation. The term was coined by blockchain platform Polkadot — and its canary network Kusama — and refers to a blockchain that’s used for trialing protocols out before they go live on the main network.","There is a difference between testnets — which are similarly used for testing — and canary networks like Kusama and Sagan. Testnet tokens typically don’t carry any value, so they recreate the technical side of the main blockchain but not its real environment. On the other hand, tokens on canary networks do have real value, so they come much closer to mimicking the real environment. That creates greater incentives for people to find bugs and potential exploits.","Earlier in the keynote, Tendermint (which builds Cosmos) and the Interchain Foundation also announced a partnership with gaming company Forte — which will entail an undisclosed investment in the company, according to the source — and announced that its DeFi platform Emeris will launch in December. Emeris will include cross-chain farming and cross-chain staking within the Cosmos ecosystem.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["COSMOS"]}