{"summary":"Non-fungible tokens have created new ways for gamers to generate revenue in virtual worlds.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/nfts-in-the-metaverse-how-to-earn-money-with-unique-assets\/","publishDate":"2022-02-09T16:05:45","id":16054,"type":null,"title":"NFTs in the Metaverse: How to Earn Money With Unique Assets","category":["Learn"],"content":["First coined in Neal Stephenson’s 1992 science fiction novel “Snow Crash,” the metaverse is more or less defined as a virtual world (or worlds), reminiscent of games and films like \"Ready Player One,\" Roblox and Fortnite. Inside this space, people can live vicariously through their avatars by trading and maintaining digital assets that center around a fully functioning real-world economy.","But while some details of the metaverse market are still fairly abstract, other components like non-fungible tokens (NFTs) have emerged as something of a foundation for its internal infrastructure and economy. People are using NFTs within the metaverse to purchase virtual land plots, event passes, avatars and other digital items.","As mentioned, one way people are using NFTs in the metaverse is to buy virtual land, such as LAND – a digital piece of real estate in The Sandbox. These virtual spaces use NFTs, as opposed to a physical deed, to reflect ownership of specific locations within a virtual world.","In the Sandbox, LAND comprises about 300 square feet in the game world. In Decentraland, the size changes to 50-square-foott land parcels.","If users hold enough plots of land, they can combine them to create a single estate. One example of that is “The Secrets of Satoshi’s Tea Garden” – an estate on Decentraland made up of 64 separate plots of land. It sold for 1.3 million MANA in 2019 (about $80,000) because of its size and location. The \"land\" is completely surrounded by digital roads, making it convenient to access.","In 2021, the Metaverse Group bought an estate in Decentraland for 618,000 MANA, which was equivalent to about $3.2 million at the time. Just as in the real world, location is everything in digital real estate, and plots that are close to entry points or to places such as virtual arenas that promise virtual foot traffic tend to increase in value.","Depending on market demand, people can rent their NFTs to earn passive income. Landowners in the metaverse can do that through PARSIQ’s IQ Protocol, a decentralized finance (DeFi) platform that provides ways for game developers to make money.","Similar to the dynamics of traditional property and real estate, the IQ Protocol helps virtual landowners earn yield and rent fees through predetermined conditions that are negotiated with renters and enforced by smart contracts.","Along with royalties that creators can earn when NFTs are sold or resold on secondary markets, NFTs can also help investors earn passive dividends. One example of this is a segment of a digital Monaco racing track in the F1 Delta Time game that was auctioned for $222,000 in December 2020.","The NFT representing the digital track allows the owner to receive 5% dividends from all races that take place on it, including entry ticket fees for races and yields from “Elite Events” that require participants to stake REVV for entry.","Through games like Axie Infinity and Aavegotchi, the play-to-earn (P2E) model has created entirely new virtual economies that reward users with assets like NFTs and in-game cryptocurrencies that can be swapped, sold or borrowed. In addition, other games like Battle Racer help further utility by releasing car parts as separate NFTs. Users can then buy these parts to build their vehicles or sell them separately on secondary marketplaces like OpenSea.","Although it is still years away, the ways people are using NFTs in these blockchain networks can also be applied to skins and cosmetics in more mainstream games like Fortnite. Not only would that help players better reflect the ownership and originality of their assets, but it would increase global in-game spending, which is projected to surpass $74.4 billion by 2025.","Epic Games, the software developer and owner of Fortnite, welcomes any game that supports NFTs to its store, but it won’t directly release or engage with NFTs because of what is perceives as scams in the market.","Read More: How to Pick the Right Play-to-Earn Game for You","As seen with Twitter’s recent support of NFT profile pictures, people also collect NFTs for the social credit, status and sense of belonging that can be found in a community of like-minded supporters.","For instance, one example of how avatars are evolving in the metaverse can be seen in the partnership between Gutter Cat Gang, a collection of NFTs, with House of Kibaa, an emerging virtual reality studio. Together, House of Kibaa is creating animated 3D avatars available for all Gutter species, with the community eligible to exclusive raffles for free upgrades, including weapons, wearables, vehicles, pets and real estate like trap houses and mansions within the House of Kibaa metaverse.","Meanwhile, NFT passes can be used to generate revenue for virtual events, parties and concerts hosted in different metaverses. In September 2021, Snoop Dog, an avid NFT proponent, rapper and entrepreneur, partnered with The Sandbox to host a private party. As announced on The Sandbox, to attend the event, 1,000 NFT party passes were made available, with 650 released on The Sandbox’s marketplace. In essence, The Snoop Private Party Pass gave people access to Snoop Dogg’s private lifestyle, exclusive NFTs, experiences, and a chance to have Snoop Dogg perform an exclusive concert on their LAND.","Snoop Dog is among a long list of brands and influencers that have worked with The Sandbox for NFT-centric events and releases. Some of those brands include The Walking Dead, Atari and Warner Music Group.","Total spending on NFTs was reported to be more than $12.6 billion by the end of 2021, and some of the ways that buyers are earning passive yields (residual income) and maximizing the potential of their investments include:","Overall, nested NFTs help provide value for users in the metaverse by customizing and adding new functionality to virtual items. Ben Lakoff, co-founder and business lead of Charged Particles, highlighted in a webinar some use cases. They include weapon that gains power as the contained NFTs accrue interest and a painting that can shift depending on the amount of tokens deposited in it.","Read more: 5 Ways to Earn passive Income From NFTs"],"entity":[{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"House of Kibaa metaverse","content":"ORGANIZATION"},{"type":"Metaverse Group","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"$74.4 billion","content":"MONEY"},{"type":"$80,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"House of Kibaa","content":"ORGANIZATION"},{"type":"The Snoop Private Party Pass","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ben Lakoff","content":"PERSON"},{"type":"$12.6 billion","content":"MONEY"},{"type":"$222,000","content":"MONEY"},{"type":"1992","content":"DATE"},{"type":"2025","content":"DATE"},{"type":"Snoop Dog","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Satoshi’s Tea Garden","content":"ORGANIZATION"},{"type":"Warner Music Group","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"Atari","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Neal Stephenson","content":"PERSON"},{"type":"Aavegotchi","content":"PERSON"},{"type":"Delta Time","content":"ORGANIZATION"},{"type":"Gutter Cat Gang","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"$3.2 million","content":"MONEY"}],"hashtag":["NFTs","Beginner","Learn","Metaverse","The Sandbox","Axie Infinity","Metaverse-Week"],"authors":["Mason Marcobello"]}