{"summary":"Open interest in XBT\/USD on BitMEX has crashed by over 50 percent from 115,000 BTC to 55,000 BTC over the past 12 days.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/03\/24\/bitmex-open-interest-collapses-after-controversial-long-squeeze\/","publishDate":"2020-03-24T19:11:19","id":16051,"type":null,"title":"BitMEX Open Interest Collapses After Controversial Long Squeeze","category":["Markets"],"content":["","While bitcoin’s (BTC) price is rallying, traders have scaled back their open interest positions in bitcoin perpetual contracts listed on the crypto derivatives exchange BitMEX. \n","","","The world’s largest cryptocurrency by market capitalization rose to $6,863 early Tuesday, representing a 77 percent gain on the recent low of $3,867 registered on March 12, according to CoinDesk’s Bitcoin Price Index. \n","","","Meanwhile, open interest, or outstanding positions, in XBT\/USD (bitcoin) perpetual contracts fell to 55,000 BTC. That’s the lowest figure in at least 18 months, which is when crypto derivatives research firm Skew began tracking BitMEX’s data. ","","","A perpetual contract resembles a futures contract as it offers high leverage and is a margin-based product. However, there is no expiry or settlement and thus it trades close to the underlying reference index price. The exchange uses the term \"open value\" for open interest in its perpetual contracts when measured in bitcoin terms.","","","Open interest in XBT\/USD on BitMEX has crashed by over 50 percent from 115,000 BTC to 55,000 BTC over the past 12 days. \n","","","Activity has cooled significantly following bitcoin’s sudden drop from around $7,300 to $3,867 during a 16-hour period from 10: 00 UTC on March 12 to 02:00 UTC on March 13. ","","","“Markets in general – both traditional and cryptocurrency – have seen volumes hit as traders figure their way through the uncharted waters of recent weeks. Open interest on the BitMEX XBTUSD market, which remains the most liquid globally, has been impacted in line with what we have seen across the entire market,\" Greg Dwyer, head of business development at BitMEX told CoinDesk.\n","","","“Open interest is falling because the market is full of uncertainty,” Ben Zhou, CEO of Bybit, told CoinDesk. “Traders in all fields, whether traditional or crypto, are simply unsure of where the market is going. Therefore they are being cautious and want to sit on the sideline to observe the market, until a clear entry signal appears.\" ","","","See also: Bitcoin’s Approaching ‘Halving,’ Explained","","","While the market sentiment was bearish to begin with, the downside move was exaggerated by forced liquidations of long positions on BitMEX. \n","","","The “long squeeze” reportedly occurred between 02:16 and 02:40 UTC on March 13, when the exchange was down for maintenance. During that time, bitcoin’s price volatility spiked with prices dropping to $3,867 for just five minutes before quickly recovering above $4,000.\n","","","As a result, some in the crypto community suggested possible price manipulation on BitMEX. Sam Bankman-Fried, CEO of Alameda Research and BitMEX’s rival exchange FTX, published multiple tweets, wondering out loud if there really were hardware issues, and saying the exchange’s unwillingness to address the market situation promoted the price slide. \n","","","BitMEX dismissed Bankman-Fried’s argument as a conspiracy theory. However, the controversy seems to have led to a slowdown in the activity, as represented by the drop in open interest. \n","","","While open interest has declined from $1.2 billion to $500 million on BitMEX since the big long squeeze, it has skyrocketed for their rivals. On FTX, open interest has increased from $68 million to $128 million in the past 12 days. Similarly, for Bybit it has risen from $35 million on March 14 to $100 million on March 22. ","","","Nonetheless, overall activity has slowed significantly across the globe over the past five weeks.","","","“Markets in general – both traditional and cryptocurrency – have seen volumes hit as traders figure their way through the uncharted waters of recent weeks. Open interest on the BitMEX XBTUSD market, which remains the most liquid globally, has been impacted in line with what we have seen across the entire market.,”","","","Aggregate open interest has declined by 50 percent from highs witnessed in mid-February, Skew’s CEO Emmanuel Goh told CoinDesk.","","","Global open interest had risen above $5 billion in mid-February when bitcoin’s price was trading near $10,500. At press time, total open positions were around $1.6 billion. \n","","","Given the decline in the institutional activity, bitcoin's recent recovery rally looks to have been driven by the spot market, which is mainly dominated by long-term holders and retail traders. \n","","","See also: Bitcoin and Gold: Evaluating Hard-Cap Currencies in Times of Financial Crisis","","","Investors accumulated coins below $5,000 earlier this month, according to an  indicator called “hodler net position change,” tracked by data firm Glassnode.\n","","","The indicator stayed in the positive territory during the recent price slide, a sign net new positions were accumulated by investors (nicknamed “HODLers” by the crypto community). In the past, significant quantities were cashed out during bull markets of bitcoin, and net new positions were accumulated by HODLers in bear phases, according to Adamant Capital.","","","\n",""],"entity":[{"type":"past 12 days","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CoinDesk’s Bitcoin Price Index","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$3,867","content":"MONEY"},{"type":"Times of Financial Crisis","content":"ORGANIZATION"},{"type":"March 22","content":"DATE"},{"type":"Greg Dwyer","content":"PERSON"},{"type":"77 percent","content":"PERCENT"},{"type":"$68 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Adamant Capital","content":"ORGANIZATION"},{"type":"$7,300","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"},{"type":"Glassnode","content":"ORGANIZATION"},{"type":"mid-February","content":"DATE"},{"type":"$6,863","content":"MONEY"},{"type":"$35 million","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"$1.6 billion","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 14","content":"DATE"},{"type":"March 13","content":"DATE"},{"type":"March 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$128 million","content":"MONEY"},{"type":"Emmanuel Goh","content":"PERSON"},{"type":"$10,500","content":"MONEY"},{"type":"Ben Zhou","content":"PERSON"},{"type":"$4,000","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"XBT\/USD","content":"ORGANIZATION"}],"hashtag":["BitMEX","Bitcoin","Bitcoin Futures","Sam Bankman-Fried","perpetual contracts"],"authors":["Omkar Godbole"]}