{"summary":"Bitcoin has pulled back more than 15% since hitting an all-time high one month ago, with some major altcoins nosediving 40%-50%, but \"few understand how normal corrections like these are in bull markets,\" one observer noted.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/16\/is-the-bitcoin-rally-over-reasons-to-stay-bullish-on-btc-despite-correction\/","publishDate":"2024-04-16T17:49:30","id":16065,"type":null,"title":"Is the Bitcoin Rally Over? Reasons to Stay Bullish on BTC Despite Correction","category":["Markets"],"content":["Crypto markets took a sizable gut punch over the weekend, sending investors' sentiment to the basement from euphoric highs only a few weeks ago.","Bitcoin (BTC) tumbled below $62,000 on Tuesday, lower by more than 15% from its latest record price above $73,000, while altcoin darlings solana (SOL), pepe coin (PEPE) and dogwifhat (WIF) suffered 40%-50% setbacks from recent highs.","Despite the sizable drawdown across the board, there are still a handful of reasons to be bullish on digital assets even if prices cool off further or chop sideways for a while.","Bitcoin will undergo its fourth halving later this week, a recurring event in roughly every four years when the newly issued supply of tokens – the rewards for miners – will be cut in half. Historically, bitcoin's price didn't move much around the time of halving, but the event preceded parabolic rallies.","\"As far as the halving event goes, we’ve been in the camp where we don’t expect there to be much additional upside momentum,\" said Joel Kruger, a market strategist at LMAX Group, adding that \"this is a known event that has been well telegraphed by the market.\"","However, with spot exchange-traded funds (ETF) listed in the U.S. from traditional finance giants like BlackRock and Fidelity starting ramping up their sales machines to financial advisors and wealth managers introducing bitcoin to a broader investor base, this halving might bring some tailwinds for bitcoin's price.","\"At the same time, we do believe there is some room for a rally when considering this is the first bitcoin halving that will be playing out in front of a much wider audience, now that the bitcoin spot ETFs are up and running,\" Kruger pointed out.","\"The halving event could therefore get these investors more excited about bitcoin, as they are forced to take a deeper dive, which could then translate to the desire to take on even more exposure,\" he added.","Eric Balchunas, senior ETF analyst at Bloomberg Intelligence, last week noted BlackRock advertising its bitcoin fund IBIT on financial news outlet Bloomberg's homepage.","While momentum on crypto markets faltered over the past weeks, the catalyst that eventually kickstarted to correction last Friday stemmed from macro events. Traditional markets turned jittery on increasing fears of military escalation between Israel and Iran, while bond yields and the U.S. dollar rose sharply as investors priced out rate cut expectations amid strong U.S. economic data and rising concerns of sticky inflation.","Noelle Acheson, macro analyst and author of the Crypto Is Macro Now newsletter, pointed out that the earnings yield on the S&P 500 is now below that of both 3-month and the 10-year U.S. Treasuries, which could foreshadow further downside for U.S. equities. The relation should be the other way, to compensate investors for the higher risk in owning stocks rather than bonds, she explained.","\"If [the stock market] drops sharply, BTC and other crypto assets could get temporarily hit as well,\" Acheson said.","However, \"the crypto drop would be short-lived, though, as other ongoing narratives – store of value, halving, currency hedge, new use cases, growing adoption – will encourage accumulation at lower levels,\" she added.","Acheson said that there might be some potential good news on the short-term that would offer relief from rising yields that squeezed risk assets recently, although it's not very likely.","\"The Federal Reserve could revert to insisting that rate cuts are imminent, which should temper the rise in yields,\" she said. \"I'm not expecting this, but if it happens, risk assets should do well.\"","Massive liquidation events on derivatives markets often mark the bottom for asset prices, wiping out excessive leverage and cleansing the market from exuberance. Crypto markets endured one of their most brutal leverage flush, liquidating over $1.5 billion of bullish bets on Friday and Saturday combined.","\"The market is now much healthier,\" Vetle Lunde, senior market analyst at K33 Research said. \"Both open interest and funding rates have been drastically reduced, reducing the likelihood of liquidation cascades onwards.\"","\"This, accompanied by a bitcoin holding firm above $60,000, is a robust signal,\" Lunde added.","The events are reminiscent of last August's action, when BTC plunged from $28,000 to near $24,000 with liquidations nearing $1 billion across all digital assets. Following the largest daily drawdown since the FTX crash, prices hovered in a range for almost two very dull months until October's breakout above $30,000 to much higher prices.","With BTC pulling back 16% from its recent all-time high in March, the current drawdown is in line with typical drawdowns of previous bull markets.","The 2016-2017 and 2020-2021 bull cycles all had multiple 20%-30% pullbacks before continuing to much higher prices. \"Few understand how normal corrections like these are in bull markets,\" crypto analyst On-Chain College said in an X post.","Despite the current nervousness, hedge fund QCP Capital said Tuesday that it continued to see consistent, sizable demand for BTC and ETH calls for longer-term expiries out to March 2025, signaling that market participants still expect higher prices coming.","Edited by Stephen Alpher."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"Kruger","content":"PERSON"},{"type":"last August","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$24,000","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"Acheson","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Chain College","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$73,000","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"LMAX Group","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Joel Kruger","content":"PERSON"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$28,000","content":"MONEY"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"March 2025","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Lunde","content":"PERSON"},{"type":"16%","content":"PERCENT"},{"type":"$62,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Iran","content":"LOCATION"}],"hashtag":["Analysis","Bitcoin","Bitcoin Halving","Bitcoin ETF","Joel Kruger","Vetle lunde"],"authors":["Krisztian Sandor"]}