{"summary":"The network, which just went live a couple weeks ago as a so-called optimistic rollup – the core underpinning of OP Stack – will now become a “ZK-rollup,” which is what Polygon’s software kit provides.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/10\/16\/manta-layer-2-blockchain-already-plans-to-ditch-op-stack-for-polygon\/","publishDate":"2023-10-16T16:30:00","id":16068,"type":null,"title":"Manta's Layer-2 Blockchain Already Plans to Ditch OP Stack for Polygon","category":["Technology"],"content":["The Manta Pacific network, just a few weeks after going live as a layer-2 blockchain atop Ethereum with software from OP Labs’ OP Stack, is already planning to jump ship: Leaders of the project said Monday that the network will be retooled using a rival software package, Polygon’s Chain Development Kit (CDK).","The move means that Manta Pacific, a part of the Manta Network ecosystem, will ditch its status as a so-called optimistic rollup – the core underpinning of OP Stack – to become a “ZK-rollup,” which is what Polygon’s software kit provides. A ZK-rollup is a secondary network that relies on zero-knowledge proofs, a type of cryptography that has become one of 2023’s hottest blockchain trends, partly due to the technology’s ability to provide fast “finality” or settlement of transactions.","The news provides yet another jolt to the increasingly competitive field of layer 2 blockchain teams, which have been battling over prospective new projects that might help to expand their interconnected ecosystems. In addition to the OP Stack and Polygon zkEVM, there are rival software kits available or under development from Matter Labs, which stands behind the zkSync project, and Arbitrum, which is another layer-2 blockchain.","The point of these blockchain software development kits (SDKs) is to make the tools available to developers for free so that they can create their own customizable blockchains. Celo recently disclosed that it was considering Polygon’s CDK kit over the OP Stack to roll out its layer 2 chain, and Matter Labs quickly jumped in to say it was vying for the project as well.","The Manta decision could come as a blow to OP Labs, which has been riding high ever since the OP Stack was chosen as the foundation for cryptocurrency exchange Coinbase’s new layer-2 blockchain, ‘Base.’ OP Labs is the primary developer behind Optimism, or OP Mainnet, which is the second-biggest Ethereum layer-2 network after Arbitrum, according to L2Beat.","The Manta Network ecosystem also has its own layer-1 blockchain, Manta Atlantic, according to the project's documentation.","Blockchain experts have said that ZK technology might be more advanced than optimistic technology.","But OP Labs, the team behind the OP Stack, has insisted they don’t see any threat from ZK-rollup stacks, partially because of its modular proof system, which will eventually allow blockchains to choose to submit fault proofs or validity (ZK) proofs.","A key reason Manta Pacific mainnet is migrating to Polygon’s CDK is because of concerns over security, highlighting the fact that OP Stack currently doesn’t have any fault proofs to secure its system. Fault proofs are at the core of optimistic rollup technology, and OP Labs is currently still testing them on their OP Goerli testnet.","“Even with the proofs available, it really is contingent on someone in the network actually generating a proof,” said Kenny Li, a co-founder of Manta to CoinDesk. “There's that long delay on the withdrawal side, which, users are kind of impatient, as they should be. It's their assets.”","“The layer of security that we're primarily focused on is around the purpose,” Li adds.","Manta becoming a ZK rollup will take some time though, with a transition period for about six to nine months, Li told CoinDesk.","“We definitely want to take things slow, make sure that everything is being built out right, and we do the audits that we need to on our side,” Li said.","Read more: Coinbase’s Chosen Blockchain Brand Sees Zero Threat from Zero Knowledge","Edited by Bradley Keoun."],"entity":[{"type":"2023","content":"DATE"},{"type":"Manta Atlantic","content":"LOCATION"},{"type":"Kenny Li","content":"PERSON"},{"type":"OP Labs’ OP Stack","content":"ORGANIZATION"},{"type":"Manta Network ecosystem","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Manta Pacific","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Manta","content":"LOCATION"},{"type":"Polygon’s Chain Development","content":"ORGANIZATION"},{"type":"Coinbase’s Chosen Blockchain Brand","content":"ORGANIZATION"},{"type":"Arbitrum","content":"PERSON"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["Manta Network","Optimism","Polygon","rollup","Rollups","Zero knowledge","Zero-Knowledge Proofs","ZK rollups"],"authors":["Margaux Nijkerk"]}