{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 7-March 13.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/06\/protocol-latest-tech-news-crypto-blockchain\/","publishDate":"2024-03-14T14:33:07","id":16066,"type":null,"title":"Protocol Village: Fjord Foundry, a Token-Sale Platform, Raises $4.3M","category":["Technology"],"content":["March 13 (PROTOCOL VILLAGE EXCLUSIVE): Fjord Foundry, a token-sale platform, has raised $4.3 million in a seed round led by Lemniscap, with participation from Mechanism Cap, Zee Prime Cap, Castle Capital and various renowned angels, according to the team: \"Fjord offers a host of token sale methods, including its Liquidity Bootstrapping Pools (LBPs), which prioritize equitable distribution, mitigating the risk of whale manipulation and bots. The round comes as Fjord is preparing to announce all-inclusive chain aggregation and the upcoming launch of its native utility token FJO.\"","March 13: Anurag Arjun, a Polygon co-founder who now leads the data-availability project Avail, has joined Ternoa as a strategic advisor, according to the team: \"Ternoa has been a Layer 1 blockchain and TEE coprocessor infrastructure provider in the mainnet since 2022 and will launch a zkEVM layer-2 validium. As an advisor, Anurag will provide strategic counsel to Ternoa's leadership team, offering insights and recommendations to drive the company's growth and success and navigate Ethereum's layer-2 ecosystem.","March 13: Sovryn, a Bitcoin DeFi platform with $136 million of total value locked (TVL), is \"expanding to BOB, a Bitcoin and Ethereum hybrid layer 2 that offers unparalleled security and access to deep liquidity by integrating with both ecosystems,\" according to the team: \"This partnership aims to channel Ethereum's liquidity into Bitcoin DeFi and convert Ethereum users into Bitcoin adopters. Sovryn will deploy its DeFi suite on BOB, including Sovryn Dex 2.0 with lower gas fees and faster transactions than Uniswap. Launch is timed around the Bitcoin halving, signaling the start of a 'Bitcoin summer' amid rising interest for Bitcoin DeFi and L2s.\"","March 13: Injective today announced its integration with Noble, native issuer of USDC within the Injective blockchain ecosystem, to add the stablecoin. According to the team: \"Users now have direct access to native USDC – accessing its substantial $30.4 billion market cap – through a diverse set of Injective ecosystem dApps (e.g., Helix). This integration facilitates improved user experiences where TradFi offerings can be deployed in DeFi environments.\" (INJ)","March 13: Ethereum staking protocol Swell has introduced a layer-2 rollup with $1 billion in total value locked (TVL) using Polygon's chain development kit (CDK). Swell developed the rollup alongside Ethereum scaler AltLayer and a16z-backed crypto staking project EigenLayer. A layer 2 is a protocol designed to scale a blockchain's capacity by executing transactions off-chain and packaging them together for submission to the main network. The rollup will take the form of a \"restaked rollup,\" which comes with a range of services such as decentralized sequencing, verification and faster finality, Swell said on Wednesday.","March 13: Movement is integrating Aptos's Data Availability (DA) capabilities with the Move Stack and establishing sophisticated routing infrastructure between Movement, an Ethereum Virtual Machine (EVM) blockchain and Aptos (a non-EVM) blockchain, according to the team: \"Collaboration between Aptos Foundation and Movement will enable applications, networks and frameworks on Movement to seamlessly interact with the Aptos blockchain, marking a significant milestone towards a more interconnected and efficient global blockchain ecosystem.\"","March 13: Pyth Network, a data oracle, introduced \"Pyth Entropy\" as a random number generator (RNG) for blockchain apps, according to the team: \"Trustless RNG is critical for Web3 applications designed to deliver unpredictable outcomes across gaming, NFTs, lotteries, betting markets and more. Developers on Arbitrum, Blast, Chiliz Chain, Fantom, LightLink, Optimism are the first to have access to Entropy on their native mainnet environments.\"","March 13: PropyKeys, a project within the Propy ecosystem known for its blockchain-powered real estate solutions, announced the public launch of their decentralized application (dApp), which enables users to mint a digital address corresponding to a tangible property, according to the team: \"Deployed on Base, Coinbase’s layer-2 network, and powered by the PRO token, users can mint digital versions of any home addresses or global landmarks. Furthering Propy’s mission to democratize real estate ownership, PropyKeys is creating a home addresses platform and property deed storage on the blockchain.","March 13: SendingNetwork, communication infrastructure for Web3, launches its bandwidth mining testnet. This initiative is set to transform the digital communication space by leveraging underused bandwidth to create a decentralized, secure and efficient network.","March 13: Vega Protocol, a purpose-built blockchain for decentralized derivatives trading, is launching the first futures markets for \"points,\" according to the team. The first markets are for EigenLayer points, with more expected soon. Vega's permissionless points markets work by allowing anyone to propose the creation of derivatives markets for points. The community defines the market parameters, including the settlement methodology. Vega uses UMA's Optimistic Oracle to resolve each points market at the time of the \"Airdrop Event,\" which triggers settlement and determines the price per point. Users can assert claims to the oracle, which are verified on-chain if undisputed. This decentralized framework enables complex market rulesets without relying on a single centralized custodian.","March 13: Cleartoken, a cryptocurrency clearing house, has received over $10 million in seed investment from institutional investors, the company said Wednesday. Investment came from firms including Laser Digital, the digital assets subsidiary of Nomura, liquidity providers including Flow Traders and GSR and from digital asset companies LMAX Digital and Zodia Custody.","March 13: DEAR, the first fully on-chain game inbubated by ARPA Network, is now live on Redstone Holesky, according to the team: \"DEAR utilizes Randcast, ARPA Network's on-chain, verifiable random number generator (RNG), designed with a comprehensive suite of APIs to support Fully On-Chain Games (FOCG) and Autonomous Worlds. Randcast offers a cryptographically generated random source with superior security and low cost compared to other solutions. Metaverse, game, lottery, NFT minting and whitelisting, key generation, and blockchain validator task distribution can benefit from Randcast’s tamper-proof randomness.\"","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","March 12: Elixir, a decentralized network that improves liquidity across orderbook exchanges, completed an $8 million Series B funding round, \"bringing the project’s valuation to $800 million,\" according to the team: \"Mysten Labs and Maelstrom co-led the round, which also included participation from Manifold, Arthur Hayes, Amber Group, GSR, Flowdesk, Validation Cloud and others. Elixir allows users to supply liquidity to pairs on orderbook exchanges while earning rewards, including on Vertex, Bluefin and RabbitX – and soon dYdX, ApeX, Hyperliquid, Orderly, NFTPerp and more.\"","March 12: RSS3, a decentralized network designed to promote the free flow of information on the open web, said its Mainnet Alpha was set to go live on March 11 at 6 p.m. Pacific time (1 a.m. UTC on March 12). According to the team: \"Inspired by the original RSS protocol, RSS3 is aiming to enhance information freedom through decentralization. The unique Mainnet design consists of 3 parts: indexing nodes, structuring open data and a layer 2 focusing on AI and information. RSS3 nodes will be equipped with the capability to cover specific data sources, create search engines, and build local-first open AI models.\"","March 12: NibiruChain, a layer-1 blockchain built by founders from Google, Tendermint, IBM and Sommelier, is announcing the launch of its public mainnet, according to the team: \"Nibiru aims to address users’ onboarding challenges and provide a fully mainstream decentralized multichain solution. It is capable of processing 40,000 TPS with instant finality, made possible through parallel optimistic execution. Nibiru reduces the complexities associated with L2s by offering proven interoperability with other L1s, a fully sovereign network and increased developer infrastructure of its own.\" Smart contracts on Nibiru are written in Rust CosmWasm, which runs in the WebAssembly runtime, according to the project's documentation.","March 12: Bluwhale, a San Francisco-based AI-powered platform designed to connect companies with Web3 wallet holders, disclosed that it raised $7 million in seed funding. SBI led the round and was joined by Cardano, Momentum6, Primal Capital, NxGen, Ghaf Capital Partners, Spyre Capital, Baselayer Capital and others.","March 12: Bluechip financial blockchain provider Digital Asset has completed a test of its so-called Canton Network, with the participation of financial heavyweights like Goldman Sachs, BNY Mellon, DRW, Oliver Wyman,and Paxos. The Canton pilot, which involved 15 asset managers, 13 banks, four custodians and three exchanges, allowed the firms to seamlessly transact and settle tokenized assets and deal with fund registry, digital cash, repo, securities lending, and margin management transactions, according to a press release on Tuesday.","March 12: Studio369, the game development company behind the upcoming blockchain-powered multiplayer PvP-focused shooter MetalCore, announced the raise of $5 million via a new funding round with participation from BITKRAFT Ventures, Delphi Digital, Sanctor Capital, Spartan Group and other investors.","March 11: The team behind Solana-based lending protocol Solend has launched Suilend on the Sui Mainnet, marking the team's first venture outside of the Solana ecosystem: \"Solend, which boasts over $200 million in TVL across 170,000+ users with support for 70+ assets, brings its unparalleled DeFi expertise and experience building industry-leading lending protocols to the Sui ecosystem, adding to the quickly expanding depth of the network.\" Rooter, Solend's pseudonymous founder, said in a comment emailed by the Sui team: \"Developing on Ethereum and Solana felt like building a cathedral with chisels and hammers. That's not to say you can't build great things; cathedrals are some of the most beautiful human achievements. But we want to build rocket ships, and for that, you need advanced tools like laser cutters and welders. That's what Sui and Move offer with better developer tools.\"","March 11: BounceBit, a Bitcoin restaking infrastructure protocol, launched its testnet on March 8, \"offering the opportunity to users to experience a dual-token staking PoS Layer 1, which uses BTC as well as the native BounceBit token to secure the network with liquid staking,\" according to the team: \"BounceClub, a no-code solution for on-chain development, will go live on BounceBit as testnet event. Users who participate in Early Access will be given a free BounceClub. Mainnet is set to launch late April, at the Bitcoin halving.\" CoinDesk 20 asset: (BTC)","March 11: NFTfi, a peer-to-peer, decentralized lending protocol for loans collateralized with NFTs, has raised $6M in a Series A1 fundraising, led by Placeholder VC, bringing total funding to $15M, according to the team: \"Notable co-investors include Maven 11, Launch Labs Inc, Kahuna Ventures. Launched in 2020, NFTfi pioneers NFT Finance, facilitating significant on-chain loans. Future plans include enhancing dApp features, expanding SDK capabilities, and creating an open settlement layer for NFT finance. NFTfi allows NFT holders to borrow ETH, USDC or DAI from lenders using their NFTs as collateral, in a trustless P2P manner.\"","March 11: Members of the Rarimo community, a digital identity protocol, revealed that \"Russia2024 is the first use case of the recently launched Freedom Tool, an open-source solution for citizen-run, surveillance-free elections and polling.\" According to the team: \"Russia2024 is an encrypted polling app allowing dissenting Russian citizens to sign petitions, vote in polls and participate in protest elections without being traced. As a Freedom Tool application, Russia2024 uses zero-knowledge cryptography servers to ensure the safety and anonymity of its users, and votes are published directly onto the blockchain where they are tamper-proof. It was announced by opposition activist Mark Fegyin.\"","March 11: MetaMask, the popular cryptocurrency wallet for the Ethereum blockchain, is testing an entirely on-chain payment card running on Mastercard's giant network and issued by Baanx, according to promotional materials and a testing platform seen by CoinDesk.","March 11: Eclipse Labs, the company building a blockchain to scale Ethereum using parts from Solana, raised $50 million ahead of its mainnet debut, which should come within weeks. According to the story by CoinDesk's Danny Nelson: \"Eclipse seeks to use a mix of technology from Solana, Celestia, Ethereum and RISC Zero for its proposed scaling solution – basically, speed like Solana with security provided by Ethereum. Apps built for Solana will be able to run on Eclipse with minimal changes, with SOL being the token of the realm.\"","March 11: Aptos Foundation, LayerZero, and Stargate are expanding their integration to remove transaction limits and publish educational resources that help users navigate DeFi on Aptos while benefiting from interoperability, according to the team: \"Stargate’s Aptos Bridge, built directly on the LayerZero protocol, facilitates seamless asset transfers between Aptos and other chains, allowing builders and users to bridge tokens and use assets across blockchains. StargateDAO has elected to remove the daily transaction limit on the Aptos Bridge, allowing for unrestricted activity and enhanced scalability for builders using the bridge.\" {{APTOS}}","March 11: Lost Worlds, a project for location-based NFTs, has launched \"Creation Portal\" to enable simplified \"geoNFT\" minting. The portal is designed to integrate digital assets with real-world places by simplifying the process for users to mint geoNFTs. \"Previously, creating and deploying geoNFTs required direct coordination with the Lost Worlds team. The Creation Portal changes this, opening the doors to anyone – from individual enthusiasts to large-scale projects – interested in crafting and exploring geoNFTs across any supported blockchain,\" according to a press release. The project is supported by Ava Labs and Polygon, according to the team.","March 11: Pi Network, a utilities-based ecosystem for third-party apps on a mobile web platform, said in a message from the team that \"after the Open Network period is launched, advertisers or parties that want to place ads on Pi Browser and Pi Apps in the Pi Ecosystem will have to acquire PI and use such PI to pay the Pi platform for displaying ads. PI will, in turn, be distributed to the developers of Pi Apps displaying ads on the platform. In this way, the ad network will generate additional platform-level utility for PI, and thus, benefit the whole network.\" An explanation of the design and benefits is in the announcement.","March 8: Coinbase's head of protocols, Jesse Pollak, tweeted that it's now possible to \"build Arbitrum Orbit L3s on Base,\" which is the U.S. crypto exchange's layer-2 network atop Ethereum.\" (ARB)","March 8: S3, described as a \"stablecoin studio,\" launched on the layer-1 Sui blockchain, marking a key network functionality upgrade. According to the team: \"S3, powered by Cairo-based blockchain startup Pravica, provides builders on the Sui blockchain with the opportunity to seamlessly launch native stablecoins without the complexities of smart contract development and currency management. S3 simplifies the process for existing stablecoin issuers, such as USDC and USDT, to integrate with Sui, and also facilitates the creation of bespoke stablecoin solutions tailored to meet specific regulatory requirements in various jurisdictions.\"","March 8: GoPlus Security, a leading Web3 user security network, successfully concluded its Series II+ funding round with $4 million, according to the team: \"This latest round brings the project's cumulative fundraising total to $15 million, including funds raised in a private round led by Binance Labs with contributions from Redpoint China Ventures, Avalanche and others. GoPlus is reshaping Web3 security, offering transparent access and introducing a new platform 'SecWareX' to empower users. Their aim is to emerge as the foremost provider of User Security Modules as a Service across various blockchains.\"","March 8: Celo Foundation and Rarible announced the integration of Rarible’s new API solution on the Celo blockchain, designed for fast, low-cost payments, according to the team: \"Through the integration, creators and developers building on Celo can leverage a robust toolkit of solutions for their decentralized applications (dApps) which include: Real-time NFT indexer, aggregated order book, multi-chain support, powerful trading SDK.\"","March 8: RepubliK, a blockchain-enabled platform for rewarding artists and creators, is launching a new AI-powered SocialFi platform on March 8, according to a press release: \"Teaming up with AWS AI and ML, it plans to change how content is assessed and user interactions are analyzed. Instead of just popularity, the platform focuses on quality interactions with the help of AI. It's also making its technology better with a layer-2 solution and multi-chain approach, which will help transactions run smoother and support more people.\"","March 7: The DFINITY Foundation, supporting the Internet Computer blockchain, announced the open alpha release of DocuTrack, \"an open source decentralized application developed in collaboration with a Swiss private bank to enable secure encrypted document transfer between enterprises and their clients on-chain,\" according to the team: \"DocuTrack enables registered and unregistered users to securely transfer sensitive documents like applications, property deeds and identity certificates in an encrypted format.\" (ICP)","March 7: Open-source cryptography firm Zama has raised $73 million in Series A funding to develop applications based on fully homomorphic encryption (FHE), a technology that enables data to be processed without decrypting it – potentially useful for protecting privacy in blockchain and AI. The funding round was led by Multicoin Capital and Protocol Labs, Zama announced via email on Thursday. Participating investors included Solana co-founder Anatoly Yakovenko, Filecoin founder Juan Benet and Ethereum and Polkadot co-founder Gavin Wood, according to a press release.","March 7: Sonarverse, which according to its website offers \"curated, reliable datasets for over 32 chains by leveraging Snowflake technology,\" has raised $7 million in a seed funding round, led by BlockTower Capital with participation from United Overseas Bank, Aglaé Ventures, Third Prime Ventures, Ocular Funds, Aptos, FBG and FJ Labs. According to the team: \"Obtaining comprehensive, high-quality blockchain data is challenging, yielding incomplete data often riddled with quality issues without extensive infrastructure. Sonarverse resolves this pain point with powerful multi-chain data solutions capturing the ecosystem’s complete story – 3X+ more chains w\/ plans to be into the 100s of chains this year and rapidly cover new chains as clients demand.\"","March 7: APhone, a device-agnostic web-based virtual phone app, announced its official launch via the Solana ecosystem, according to a press release: \"APhone NFTs, which give users access to the in-app experience, can be minted and activated (burned) directly on the Solana chain. As an affordable DePIN-powered virtual mobile phone app, charging $20 per year, APhone bypasses the hardware limitations of older phone models and enables access to Solana’s strong DePIN ecosystem, where GPU, storage, and RAM are essential for seamless functionality.\"","March 7: Burnt Banksy announced the launch of XION’s mainnet, \"the first blockchain purpose-built for mainstream adoption and the first to use USDC, a fully-reserved digital dollar, as its primary transactional currency,\" according to the team: \"The announcement was made as part of Burnt's exclusive performance in New York, during which the founder lit himself on fire and subsequently set XION aflame, symbolizing a new light for the crypto industry.\"","March 7: New York-based Blackwing, founded by ex-Meta and Robinhood vets, raised $4.5 million, led by Hashed VC and gumi Cryptos Capital, according to the team: \"Blackwing developed the first modular layer 2 blockchain designed for liquidation-free leveraged trading. The blockchain uses 'Limitless Pools' that enable users to trade with borrowed funds without facing forced liquidations, ensuring liquidity providers benefit from earning more fees, and traders benefit from safer leverage.\"","March 7: Core Foundation announced a $5 million Innovation Fund to advance India's decentralized application ecosystem on Core Chain, a Bitcoin-secured and EVM-compatible blockchain, according to the team: \"This fund aims to empower Web3 communities, enhance education, and provide vital support to founders and builders throughout India.\" According to its project documentation, Core Chain runs on a consensus mechanism known as \"Satoshi Plus that unites Delegated Proof of Work (DPoW) and Delegated Proof of Stake (DPoS).\"","March 7: Beoble, a Web3 messaging platform, has received strategic investment from Animoca Brands, according to the team: \"This investment will be used by beoble to enhance user interaction, privacy and security through blockchain technology, as well as expand advanced Web3 chat features to selected companies within Animoca Brands’ portfolio. The new funding will be used to accelerate the platform’s development and expand its features, offering greater interoperability to its user base globally.\"","March 7: Hashflow, a leading decentralized finance (DeFi) trading platform, today announced the launch of its Arbitrum-native aggregator, creating a hub for all Arbitrum ecosystem traders, according to the team: \"Through its intent-based, Smart Order Routing architecture, Hashflow's new product, Aggregator+, enables traders to tap into roughly $8B of liquidity to get the best prices on the most popular tokens on Arbitrum. As the Arbitrum DeFi community continues to expand rapidly, Hashflow is positioning itself as a one-stop trading platform for all users in the ecosystem.\" (ARB)","March 7: Wert, a payment solution provider facilitating fiat payments in the Web3 space, is set to broaden its card acceptance to JCB, American Express (Amex) and Discover cards in collaboration with Worldpay, a global payment processor, according to the team: \"This promotes broader engagement from non-crypto native users and nurtures inclusivity in the Web3 space. Now, Wert will support cards for holders in a staggering 198 countries, giving seamless access to web3 for the estimated 121M Amex, 140M JCB and the roughly 57M Discover cardholders.\"","Edited by Bradley Keoun."],"entity":[{"type":"JCB","content":"ORGANIZATION"},{"type":"Aptos Foundation and Movement","content":"ORGANIZATION"},{"type":"Aptos Foundation","content":"ORGANIZATION"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"Flowdesk","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Stargate’s Aptos Bridge","content":"ORGANIZATION"},{"type":"Bitcoin DeFi","content":"ORGANIZATION"},{"type":"Redstone Holesky","content":"PERSON"},{"type":"Sui","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Service","content":"ORGANIZATION"},{"type":"Rarible","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"American Express","content":"ORGANIZATION"},{"type":"Early Access","content":"ORGANIZATION"},{"type":"LMAX Digital","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"Mark Fegyin","content":"PERSON"},{"type":"APTOS","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Ghaf Capital Partners","content":"ORGANIZATION"},{"type":"Digital Asset","content":"ORGANIZATION"},{"type":"$136 million","content":"MONEY"},{"type":"Vertex","content":"ORGANIZATION"},{"type":"Nibiru","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"S3","content":"ORGANIZATION"},{"type":"Gavin Wood","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Ternoa","content":"ORGANIZATION"},{"type":"Pyth Network","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Validation Cloud","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Canton Network","content":"ORGANIZATION"},{"type":"Chiliz Chain","content":"ORGANIZATION"},{"type":"BounceClub","content":"ORGANIZATION"},{"type":"SOL","content":"ORGANIZATION"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Fjord","content":"ORGANIZATION"},{"type":"Zama","content":"ORGANIZATION"},{"type":"Eclipse Labs","content":"ORGANIZATION"},{"type":"Fjord Foundry","content":"ORGANIZATION"},{"type":"Cairo","content":"LOCATION"},{"type":"Satoshi Plus","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Castle Capital","content":"ORGANIZATION"},{"type":"Baanx","content":"LOCATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"DEAR","content":"ORGANIZATION"},{"type":"United Overseas Bank","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Pi Apps","content":"LOCATION"},{"type":"March 8","content":"DATE"},{"type":"Tendermint","content":"LOCATION"},{"type":"March 7","content":"DATE"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Avail","content":"ORGANIZATION"},{"type":"Worldpay","content":"PERSON"},{"type":"Solend","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"DFINITY Foundation","content":"ORGANIZATION"},{"type":"Manifold","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"$4.3 million","content":"MONEY"},{"type":"$7 million","content":"MONEY"},{"type":"Third Prime Ventures","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Hyperliquid","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Swell","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"Delegated Proof of Stake","content":"ORGANIZATION"},{"type":"Primal Capital","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Aptos Bridge","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Kahuna Ventures","content":"ORGANIZATION"},{"type":"Hashflow","content":"PERSON"},{"type":"March 12)","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Hashflow","content":"ORGANIZATION"},{"type":"Trustless RNG","content":"ORGANIZATION"},{"type":"Vega Protocol","content":"ORGANIZATION"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Redpoint China Ventures","content":"ORGANIZATION"},{"type":"UMA","content":"ORGANIZATION"},{"type":"GoPlus Security","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sanctor Capital","content":"ORGANIZATION"},{"type":"Oliver Wyman","content":"PERSON"},{"type":"Danny Nelson","content":"PERSON"},{"type":"Juan Benet","content":"PERSON"},{"type":"oracle","content":"ORGANIZATION"},{"type":"ML","content":"ORGANIZATION"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$73 million","content":"MONEY"},{"type":"ICP","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"$8B","content":"MONEY"},{"type":"Pi Network","content":"ORGANIZATION"},{"type":"Burnt Banksy","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Baselayer Capital","content":"ORGANIZATION"},{"type":"Multicoin Capital and Protocol Labs","content":"ORGANIZATION"},{"type":"ARPA Network","content":"ORGANIZATION"},{"type":"6 p.m. Pacific time (1 a.m.","content":"TIME"},{"type":"Spyre Capital","content":"ORGANIZATION"},{"type":"User Security Modules","content":"ORGANIZATION"},{"type":"Sui Mainnet","content":"LOCATION"},{"type":"Solana","content":"LOCATION"},{"type":"$50 million","content":"MONEY"},{"type":"Core Foundation","content":"ORGANIZATION"},{"type":"PvP","content":"ORGANIZATION"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Aglaé Ventures","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Randcast","content":"LOCATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Fantom","content":"PERSON"},{"type":"$15M","content":"MONEY"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"Canton","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Anurag","content":"PERSON"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Launch Labs Inc","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"AWS","content":"ORGANIZATION"},{"type":"gumi Cryptos Capital","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"TVL","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Orderly","content":"LOCATION"},{"type":"Sovryn Dex","content":"ORGANIZATION"},{"type":"$4.5 million","content":"MONEY"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"BITKRAFT Ventures","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"$30.4 billion","content":"MONEY"},{"type":"March 12","content":"DATE"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"FBG","content":"ORGANIZATION"},{"type":"March 11","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"RAM","content":"ORGANIZATION"},{"type":"NFT Finance","content":"ORGANIZATION"},{"type":"BOB","content":"LOCATION"},{"type":"$800 million","content":"MONEY"},{"type":"$6M","content":"MONEY"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}