{"summary":"Digital money is becoming the go-to vehicle for serving people recovering from disaster. But when those in need have no smartphones or bank accounts, aid organizations have to distribute cash more creatively. That’s why Sempo is one of CoinDesk’s Projects to Watch 2023.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/04\/17\/humanitarian-aid-transformed-crypto-startup-sempo\/","publishDate":"2023-04-17T12:15:26","id":16067,"type":null,"title":"Sempo Delivers Cash Aid for the Unbanked in Crisis","category":["Consensus Magazine"],"content":["Humanitarian aid has undergone a radical transformation in the last decade because non-governmental organizations (NGO) have largely reduced their efforts for giving out in-kind donations – such as food, clothing, and medical supplies – in times of crisis. Now, cash is making up an increasingly large portion of all humanitarian aid.","Cash, unlike in-kind donations, lets recipients make their own choices about when and how to care for themselves and their families in emergency situations.","However, distributing cash aid comes with its own challenges. Moving physical cash around can be difficult and dangerous, especially in the aftermath of natural disasters. Other issues – like corruption or currency devaluation – can also be a problem.","Digital cash transfers can make things easier, but not everyone who needs aid has a bank account – or access to the internet. Crypto has been floated as a potential solution to these issues, but how can crypto serve disaster victims who do not have smartphones, bank accounts, or internet access?","Read profiles of all of the Projects to Watch 2023: Reclaiming Purpose in Crypto","Sempo was started in July 2017 by a pair of young Australians entrepreneurs, Tristan Cole and Nick Williams.","Their inspiration was a Web 2 humanitarian aid distribution platform called GiveDirectly, which allows donors to send cash to people living in poverty.","“What they do is give people money in Africa and other underserved communities,” Cole said. “They raise funds in places like Australia and the United States – all over the world – and they give people money. And for me, I found that very interesting.”","Cole pointed out that 90% of money sent through GiveDirectly goes to beneficiaries.","“With traditional NGOs, it’s not that at all,” Cole said. Overhead costs and administrative fees for traditional donation methods can eat up as much as 30% of the cash value. “I was, like, why can’t we do this with Oxfam or any of these other NGOs?” Cole said when he and Williams reached out to humanitarian aid organizations, they found that the organizations were struggling with major technological challenges in running their cash transfer programs.","“There’s no infrastructure in the places we work,” Cole said. “Like, in Vanuatu, the banking infrastructure isn’t great. Most people are unbanked who actually need the assistance. So that’s what really inspired me. I’m very interested in how we can do more financial empowerment for others … there’s still so many people who don’t have access to things that we take for granted.”","One such thing is access to the internet, which is a major challenge for many projects Sempo works with. Other crypto-native aid distribution programs, like Stellar Aid Assist, require the internet to function. But blockchain-powered Sempo has an option that doesn’t require the internet to function. Instead of sending crypto between beneficiaries and local merchants, beneficiaries can instead use a tap-to-pay card that doesn’t require an internet connection.","“The pay card is used by Oxfam as well as others,” Cole said. “It's used in places that maybe have lower levels of digital literacy, lower financial literacy and ultimately, places that don't have great internet infrastructure because it can work offline at times, which is the real key selling point there.”","The project went through several accelerators in Australia and the U.S., including dlab, an early-stage crypto accelerator. Between all the programs, Sempo’s founders raised approximately AU$450,000 – a little over US$300,000.","“It's pretty much been bootstrapped the whole way,” Cole told CoinDesk. “Just Nick and myself funding it, and revenue from customers.” Williams left Sempo in 2021, according to his LinkedIn profile.","Sempo’s core infrastructure was made open source in 2019, which means organizations that want to run projects on Sempo don’t need to pay for the privilege of doing so – something that was important to Cole, who wanted to make the software accessible to organizations helping people in need. There are a number of organizations, including the Red Cross, who use the open-source software for free, said Cole.","However, if organizations aren’t tech savvy enough to set up and run the project on their own using Sempo’s free tutorials, they can use Sempo’s hosted model, paying Cole a software service fee and consulting fees to get their help designing and running the project.","“It’s much more hand-holding from the start of the program – the ideation phase all the way to monitoring, evaluation and then scaling it up,” Cole said of the hosted model.","Eventually, once a project is set up, it can transition to an unpaid, self-run project, which happened with the Red Cross and another project called Grassroots Economics, Cole said. He said he is currently working with Oxfam to help it transition its hosted project to a self-run project as well.","Cole’s ambition for Sempo is to eventually help all projects transition to a self-hosted model.","“It’s a part of growing up – you have to learn to let go,” Cole said. “The best transition for [Sempo] was to move to just a fully open-source model because it’s the purpose of working with nonprofits.”","Edited by Jeanhee Kim."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Nick Williams","content":"PERSON"},{"type":"Williams","content":"PERSON"},{"type":"US$300,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Nick","content":"PERSON"},{"type":"NGOs","content":"ORGANIZATION"},{"type":"Sempo’s","content":"PERSON"},{"type":"Australia","content":"LOCATION"},{"type":"Red Cross","content":"ORGANIZATION"},{"type":"Sempo","content":"PERSON"},{"type":"July 2017","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"last decade","content":"DATE"},{"type":"Vanuatu","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Jeanhee Kim","content":"ORGANIZATION"},{"type":"Tristan Cole","content":"ORGANIZATION"},{"type":"Cole","content":"PERSON"},{"type":"Grassroots Economics","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Sempo]","content":"PERSON"},{"type":"NGO","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"Oxfam","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Crypto projects 23","humanitarianism","Blockchain"],"authors":["Cheyenne Ligon"]}