{"summary":"The two men who allegedly managed the scheme purchased bitcoin from funds connected to the unauthorized exploitation of copyrighted material.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275176\/german-authorities-seize-50000-bitcoin-connected-to-pirated-materials-operation","publishDate":"2024-01-30T10:35:20","id":1606,"type":null,"title":"German authorities seize 50,000 bitcoin connected to pirated materials operation","category":["POLICY"],"content":["German authorities seized 50,000 bitcoin worth nearly $2.2 billion that was allegedly purchased using funds connected to copyrighted materials.","This seizure became the largest amount of bitcoin German law enforcement has ever seized, according to a police <a href=\"https:\/\/www.medienservice.sachsen.de\/medien\/news\/1072857\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;","Two men of German and Polish nationality, respectively, are being investigated for managing a pirated materials operation, buying bitcoin with the funds. The two individuals could face charges including unauthorized commercial exploitation of copyrighted works and money laundering.","The suspects voluntarily transferred the bitcoin to wallets controlled by German authorities, and it is not clear what law enforcement will do with the cryptocurrency.&nbsp;","German authorities&nbsp;assisting in the investigation included the Dresden General Prosecutor’s Office, the Saxony State Criminal Police Office and the tax investigation of the Leipzig II Tax Office as the Saxony Integrated Investigation Unit.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Saxony State Criminal Police Office","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$2.2 billion","content":"MONEY"},{"type":"Saxony Integrated Investigation Unit","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dresden General Prosecutor’s Office","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Leipzig","content":"LOCATION"}],"hashtag":["ANTI-MONEY LAUNDERING","CRIME"],"authors":["MK Manoylov","The Block"]}