{"summary":"The European Council and Parliament will now negotiate the rules set out in the framework.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2021\/11\/24\/european-council-takes-one-step-closer-to-ratifying-landmark-crypto-regulation\/","publishDate":"2021-11-24T18:14:10","id":16063,"type":null,"title":"European Council Takes One Step Closer to Ratifying Landmark Crypto Regulation","category":["Policy"],"content":["The European Union’s (EU) proposed framework for regulating crypto is one step closer to ratification.","On Wednesday, the European Council, which sets the EU’s political agenda, adopted its position on the Markets in Crypto Assets (MiCA) framework, according to a statement on its website. This means that the Council and the European Parliament can now enter into negotiations on the proposal before it is formally adopted as law. This agreement also formed the Council’s negotiating mandate for discussing MiCA with the European Parliament.","The MiCA framework broadly captures cryptocurrencies like bitcoin and promises to make it simpler for crypto firms to expand throughout the EU by facilitating a passportable license.","Created in the wake of Facebook’s plans for issuing a “basket-backed stablecoin” or cryptocurrency pegged to the value of a combination of other assets or currencies, MiCA places a heavy emphasis on regulating stablecoin issuers in particular. The proposed MiCA framework referred to this type of stablecoin as “asset-referenced tokens” and dedicated about a fifth of the package to outlining requirements for issuers of these tokens.","The European Council’s own 405-page negotiation mandate for MiCA shows the EU might not be easing up on issuers of asset-referenced tokens, stating they should “be subject to more stringent requirements than issuers of other cryptoassets.”","The negotiation mandate also contained a number of exceptions to the MiCA framework. For one, the Council has agreed that credit institutions authorized under the EU’s capital requirements directive “should not need another authorisation under [MiCA] in order to issue asset-referenced tokens.” These institutions, the document said, should also be exempt from the capital requirements stablecoin issuers are required to maintain under MiCA.","The Council’s document also said that the MiCA regulations do not apply to non-fungible tokens (NFTs) “including digital art and collectibles, whose value is attributable to each cryptoasset’s unique characteristics and the utility it gives to the token holder.”","The document said that the regulations also do not apply to tokens “representing services or physical assets that are unique and not fungible, such as product guarantees or real estate.”","Other potential exceptions include crypto assets that are offered for free or as rewards, and transactions between global organizations like the International Monetary Fund and the Bank for International Settlements.","“It is appropriate to exempt certain intragroup transactions and some public entities from the scope as they do not pose risks,” the document said.","The MiCA framework was introduced in September 2020 by the European Commission, the EU’s executive branch. On Wednesday, the Council adopted its position on another framework, the Digital Operational Resilience Act (DORA) alongside MiCA. Both frameworks are part of the Union’s larger digital finance initiative."],"entity":[{"type":"European Union’s (EU","content":"ORGANIZATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Union","content":"ORGANIZATION"},{"type":"September 2020","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Council","content":"ORGANIZATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"European Parliament","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"European Council","content":"ORGANIZATION"},{"type":"European Council’s","content":"ORGANIZATION"}],"hashtag":["Europe","EU","Regulation","Cryptocurrency","Stablecoin","Diem","European Parliament"],"authors":["Sandali Handagama"]}