{"summary":"Block rewards are the units of cryptocurrency earned by miners or stakers for their work on a blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-block-reward\/","publishDate":"2022-02-25T20:19:14","id":16069,"type":null,"title":"What Is a Block Reward?","category":["Learn"],"content":["A block reward is a portion of newly minted digital tokens assigned to a user who helps to verify transactions on a blockchain protocol. The users who verify transactions are collectively known as validators, but can also be called stakers or miners – depending on the consensus mechanism used by the blockchain (proof-of-stake or proof-of-work, respectively.)","Protocols need to provide incentives for distributed volunteer users to discover new blocks in order to secure the network and ensure it continues to operate. Because no central administrator watches over bitcoin (BTC) and all other cryptocurrencies, block rewards serve as the primary financial incentive for people to participate in the network.","As mentioned, block rewards also serve as the exclusive issuance system for releasing newly minted coins into circulation. These are given to each successful validator that discovers (miner) or proposes (staker) new blocks. Sometimes, these rewards are fixed, meaning the same number of tokens are given as block rewards every time, while others gradually decrease the number of coins given as block rewards over time.","Bitcoin goes through a ‘‘halving‘’ roughly every four years, or 210,000 blocks. This means the block reward given to miners systematically halves over its lifespan. Since the last halving in May 2020, successful miners have been receiving 6.25 BTC for each block discovered, which usually takes approximately 10 minutes.","These figures and block reward schedules vary greatly among different projects.","Bitcoin’s block rewards have halved three times since the protocol launched in 2009 and will continue to halve until the total number of coins in circulation reaches the maximum supply of 21 million coins. After that, no more block rewards and no more new coins will enter circulation.","Read More: What Happens When All Bitcoin Are Mined?","It’s also important to note the difference between block rewards and transaction fees. For example, a bitcoin miner will receive both block rewards and any fees attached to the transactions they include in the new block. These are entirely separate, and once all bitcoin are mined it’s anticipated that miners will become solely reliant on transaction fees to maintain their operations.","Finally, block rewards are not always denominated in the same tokens being transacted on its blockchain. Stablecoins are a common example of this. In order to maintain a steady exchange rate against fiat currency, these protocols carefully control token supply. Therefore, they often reward their miners with a different native token. The Terra network, for example, rewards miners with its freely floating LUNA token, not with TerraUSD.","Find Out: Can You Still Mine Bitcoin and Other Crypto From Home?","\n"],"entity":[{"type":"May 2020","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2009","content":"DATE"}],"hashtag":["Learn","Beginner","Technology","Block Rewards"],"authors":["Benedict George"]}