{"summary":"CoinDesk Editor Pete Rizzo puts forth an alternate way to think about crypto valuations – one that might poke holes in critics' bubble talk.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/03\/27\/if-facebook-can-be-worth-billions-why-cant-cryptos\/","publishDate":"2018-03-27T08:00:56","id":16060,"type":null,"title":"If Facebook Can Be Worth Billions, Why Can't Cryptos?","category":["Markets"],"content":["Pete Rizzo is editor-in-chief for CoinDesk.","","","It’s been a rough month for Mark Zuckerberg.","In the fallout from the Cambridge Analytica fiasco, in which it was found a third-party data provider was mining user information on behalf of political groups, Facebook and its founder have faced an outcry of criticism over the company’s role as leader-supreme data custodian for the developed world.","But for the crypto community, the resulting plunge in Facebook’s stock price offers an instructive example for a fundamental argument: whether the current cryptocurrency market, in which more than 20 blockchain networks are “valued” in excess of $1 billion, is overheated or in a “bubble.”","To answer that question, it’s helpful to ask another one – namely, how exactly is it possible that Facebook, which collects users' identifying data and connects them through messaging, is valued so highly to begin with?","Indeed, it doesn’t seem like consumers are apt to bat an eye when they hear Facebook is worth nearly $500 billion, or that WeChat, an app which offers largely the same service for a China-based audience, is valued similarly. (Even Snap, a smaller fish in the pond, is valued at $20 billion, a figure that dwarfs all but the largest cryptocurrency networks.)","The analogy offers a sharp retort to the criticisms that bitcoin and other blockchains can’t possibly sustain or justify their current valuations, or achieve market capitalizations that exceed what we observe today in more \"rational\" times.","A useful question here is, if all social networks are created equal, using pretty much the same combination of technologies, how can they produce so much value?","After all, according to crypto critics, there’s no reason to have so many coins when they’re all using the same basic building blocks. Here in the market, however, we have an example of an almost wholly contrary outcome.","What might be most remarkable is that these naysayers, if they were to look closely at their phones, would uncover a swath of apps – SMS, Telegram, Signal, Slack, Skype, etc – all of which offer, in the grand scheme of things, what amount to slight variations on the same communications experience.","Put simply, it would seem, there’s a big market for “features,” or slight variations on popular tools, at least when the primary product is a mode of expression.","It follows that all of these social networks have different valuations for at least two reasons – the unique and different make-ups of their user bases and the variety of specific ways they offer users to communicate across the globe.","You might use Snapchat if you want to send a picture, WeChat if you wanted to talk to someone in Asia, or Signal if you wanted a truly encrypted, private experience.","In this case, you can think of the end user base as a form of liquidity and the features as the rules by which those interactions are governed. Some, like Twitter, might produce more casual relationships, while others, like Facebook, could be more familial.","Still, each network unlocks value in offering unique access to a certain kind of contact. The message is the same in each, the same mix of characters, emoticons and images.","What’s different is the network, how it’s valued by the users, and how they use it.","It would seem, then, that a similar argument could be applied to money and asset ownership by virtue of the new protocols that enable their expression – blockchains and cryptocurrencies.","Here, it’s helpful to think of what a starkly different environment today’s messaging protocols offer when compared to say, Bell Atlantic, or another long-forgotten phone company. Cherry-picking a somewhat random and self-serving example from a Google search, Bell Atlantic was valued at $125 billion at the time it was the largest local phone company the U.S.","My hunch is if you examined that data, you'd find all the market capitalizations of large telecos don't add up directly to those of communications companies today.","The implication is that internet protocols didn’t merely shift the value already created by communication, they unlocked more of it than was ever thought possible. Armed with the ability to communicate in infinitesimally small interactions (poke Zuck, anyone?) users appear to want to exercise that power and create new value streams.","Applied to blockchains, why couldn’t similar variations unlock similarly massive amounts of value?","I’d say the Telegram ICO is starting to make a bit more sense."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Bell Atlantic","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Telegram ICO","content":"ORGANIZATION"},{"type":"Zuck","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Telegram","content":"LOCATION"},{"type":"Cambridge Analytica","content":"LOCATION"},{"type":"$125 billion","content":"MONEY"},{"type":"Pete Rizzo","content":"PERSON"},{"type":"$20 billion","content":"MONEY"},{"type":"$500 billion","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Skype","content":"ORGANIZATION"}],"hashtag":["Ethereum","Bubble","Facebook","WhatsApp","Bitcoin","Snapchat","Markets","cryptocurrencies","Features","Markets News"],"authors":["Pete Rizzo"]}