{"summary":"Dogecoin founder Jackson Palmer has announced a \"leave of absence\" from the digital currency community.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2015\/04\/24\/dogecoin-founder-exits-crypto-community-citing-toxic-culture\/","publishDate":"2015-04-24T00:10:46","id":16061,"type":null,"title":"Dogecoin Founder Exits Crypto Community Citing 'Toxic' Culture","category":["Markets"],"content":["UPDATE (27th April, 16:10pm GMT): Jackson Palmer indicates that his leave of absence from the crypto community includes a separation with micropayments project Neucoin. Representatives from Neucoin have not yet responded to press inquiries.","","","Dogecoin founder and Adobe senior manager Jackson Palmer has announced he is taking an \"extended leave of absence\" from the cryptocurrency community.","Calling the ecosystem \"toxic\", Palmer used the occasion to blast aspects of the industry, while encouraging users of dogecoin not to lose sight of its fun and playful roots. Launched in December 2013, dogecoin quickly became one of the more popular alternative digital currencies, though its community has recently seen a decline in enthusiasm.","In statements, Palmer suggested that the industry is in the midst of a period of stagnation due to the ideologies of the individuals it is attracting, as well as what he characterized as the poor quality of startups founded by new participants in the space.","Palmer told CoinDesk:","Palmer went on to suggest the amount of venture capital in the space, which hit record volumes in Q1 2015, was playing a role by increasing the amount of \"anger-fuelled attacks\".","\"I don't have time for it anymore,\" he added.","The Australian native went on to present his opinion that digital currency participants have done little to create a community that is inclusive to all, citing the recent support of Kentucky Senator and US Tea Party member Rand Paul as evidence.","\"The community is very white male dominated, and there are a lot of anarcho-libertarian beliefs caught up in there which I really don't agree with,\" Palmer said.","The comments suggest that despite the influx of new participants into the ecosystem as a result of dogecoin's success, Palmer believes these individuals have been turned off by the activities of those in the space.","Notably, Palmer's comments echo those of observers in the space, including media outlets like Fusion, which commented on bitcoin's perceived male-dominance in a recent article.","Palmer also took aim at businesses in the digital currency industry for its lack of progress in bringing the technology to the masses.","\"I've yet to see a bitcoin business receive VC funding that has a provable business model (ie: one that generates profit) outside of exchanges and merchant services who simply take a slice of their customers' business,\" he said.","Calling it a \"hotbed for scams\", Palmer also expressed an overall fatigue at stories indicating that people have lost money. In tweets, he further expressed his love of the traditional payments service Venmo as well as for the ecosystem as a whole, suggesting he still sees long-term value in the underlying technology.","\"Those charges merchants incur on traditional credit card payments? They exist for a reason, and that's insurance against fraud protection,\" he continued, adding:","Image via Hackadoge"],"entity":[{"type":"Neucoin","content":"PERSON"},{"type":"2015","content":"DATE"},{"type":"Palmer","content":"PERSON"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"December 2013","content":"DATE"},{"type":"Hackadoge","content":"LOCATION"},{"type":"Rand Paul","content":"LOCATION"},{"type":"US Tea Party","content":"ORGANIZATION"},{"type":"Jackson Palmer","content":"PERSON"},{"type":"27th April","content":"DATE"}],"hashtag":["Dogecoin","Jackson Palmer","Altcoins","News","other-public-protocols"],"authors":["Pete Rizzo"]}