{"summary":"The Department of Justice pulled one charge, but it's still pursuing seven for trial this October – and another trial on different charges next March.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/07\/28\/sam-bankman-fried-maybe-hasnt-escaped-campaign-finance-charges\/","publishDate":"2023-07-28T19:02:29","id":16073,"type":null,"title":"Sam Bankman-Fried Maybe Hasn’t Escaped Campaign Finance Charges","category":["Policy"],"content":["Prosecutors just withdrew a campaign finance charge ahead of Sam Bankman-Fried’s criminal trial this October.","That doesn’t mean the U.S. Department of Justice is letting the FTX founder off on alleged criminal conduct, however – and campaign finance charges could still be tried later.","Bankman-Fried is currently set to go on trial on Oct. 2 on seven different charges, including conspiracy to commit wire fraud and wire fraud, conspiracy to commit securities fraud and conspiracy to commit money laundering. He is then set to go on trial again in March of next year on another five charges, including conspiracy to commit bank fraud, conspiracy to operate an unlicensed money transmitter and conspiracy to bribe foreign government officials.","The DOJ said in a letter Wednesday night that it was withdrawing the charge due to extradition treaty obligations with the Bahamas, sparking speculation that he was being protected by political backers.","The reality is much more boring.","Some background: Police in the Bahamas arrested Bankman-Fried in December in response to an extradition request from the U.S. government. Under the terms of the extradition treaty, Bankman-Fried had the ability to fight extradition, which he did initially before later agreeing to extradition.","At the time he was extradited, Bankman-Fried faced only the eight initial charges prosecutors brought in December 2022. The DOJ added another five charges through two superseding indictments over the next few months.","However, Bankman-Fried’s defense team argued in court that the Bahamas had to agree to those additional charges under the terms of its extradition treaty. The DOJ said it was willing to wait for that approval, and while the Bahamas government seemed willing to grant that OK, a Supreme Court judge ruled that Bankman-Fried had the right to contest it first.","As a result, the DOJ said it was willing to sever, or treat separately, the five additional charges, leading to the March trial date.","During a hearing last month, the defense team argued that the warrant of surrender did not include the campaign finance charge. The prosecution said that the charge was included in the extradition request.","In its letter Wednesday, the DOJ said that the government of the Bahamas had informed the U.S. government that it had not included the campaign finance charge in its arrest warrant and extradition document, suggesting that this charge also needed an OK from the Bahamas government.","The DOJ has not said whether it will push to add this charge to the March trial date. A spokesperson for the DOJ did not respond to a request for comment, though an interim gag order signed by District Judge Lewis Kaplan, who is overseeing the case, may prevent the DOJ from commenting one way or another outside the court docket.","In the meantime, the prosecutors on the case face a deadline to draft and file a formal motion to remand Bankman-Fried into custody, after Assistant U.S. Attorney Danielle Sassoon alleged he had willfully tried to tamper with witness testimony after sharing former Alameda Research CEO Caroline Ellison’s private diary with The New York Times. She told the court that the DOJ had concluded that his release conditions “placed too much trust” on him, and he had abused his privileges.","The DOJ filing is due by Friday night, and Bankman-Fried’s defense team has until Tuesday to respond.","Edited by Nick Baker."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Oct. 2","content":"DATE"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"night","content":"TIME"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Regulations","Sam Bankman-Fried","FTX","FTX Collapse"],"authors":["Nikhilesh De"]}