{"summary":"The combined company will have more than $350 million in assets and and north of 1 million customers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/09\/23\/canadian-digital-asset-brokerages-coinsquare-and-coinsmart-to-merge\/","publishDate":"2022-09-23T16:04:35","id":16070,"type":null,"title":"Canadian Digital Asset Brokerages Coinsquare and CoinSmart to Merge","category":["Finance"],"content":["Coinsquare said late Thursday it signed a deal to purchase peer Canadian digital asset brokerage CoinSmart for a combination of cash and stock.","Consolidation is the word in crypto as trading platforms and exchanges grapple with global competition alongside the ongoing market downturn. Earlier this year in Canada, Kevin O'Leary-backed WonderFi rolled up crypto platforms Bitbuy and Coinberry.","This new deal has a current value of just under $30 million Canadian dollars, but performance incentives for CoinSmart's SmartPay business and over-the-counter services could add up to another $20 million.","Specific terms will have CoinSmart receiving $3 million Canadian dollars in cash along with about 5.2 million in newly issued shares of Coinsquare (valued at just over $26 million).","“With a diversified product suite, exceptional crypto talent, and one of the largest user bases in Canada, the combined company will be well-positioned to pursue its aggressive expansion plans,” CoinSmart CEO Justin Hartzman said in the statement. “While the crypto market is in the building phase of its life cycle, this transaction will provide the torque needed to be in a favorable position entering the next bull run.\"","The combined company will have more than $350 million in assets under custody and a customer base topping 1 million, according to the statement. The deal is expected to close in the fourth quarter.","Read more: Canada’s WonderFi Bulks Up Further With Planned $31M Acquisition of Coinberry Crypto Exchange"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$350 million","content":"MONEY"},{"type":"$30 million Canadian dollars","content":"MONEY"},{"type":"$26 million","content":"MONEY"},{"type":"Kevin O'Leary","content":"PERSON"},{"type":"Coinberry","content":"ORGANIZATION"},{"type":"Justin Hartzman","content":"PERSON"},{"type":"late Thursday","content":"DATE"},{"type":"$3 million Canadian dollars","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"fourth quarter","content":"DATE"},{"type":"$31M","content":"MONEY"},{"type":"Acquisition of Coinberry Crypto Exchange","content":"ORGANIZATION"}],"hashtag":["Coinsquare","Acquisitions","Mergers","Crypto Trading","Crypto Exchange","Canada"],"authors":["Michael Bellusci"]}