{"summary":"Southeast Asian super-app Grab is currently piloting the new product to cover gas fees for its Singaporean users if they use NFT vouchers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/10\/19\/circle-to-let-merchants-pay-for-customers-gas-fees-with-web3-wallet-upgrade\/","publishDate":"2023-10-19T13:00:00","id":16078,"type":null,"title":"Circle to Let Merchants Pay for Customers' Gas Fees With Web3 Wallet Upgrade","category":["Technology"],"content":["USDC stablecoin issuer Circle Internet Financial on Thursday released an upgrade for its Web3 programmable crypto wallet that allows merchants to take over and pay for their customers' transaction fees.","According to the press release, the new function called Gas Station lets businesses sponsor users' gas fees – the cost for money transfers on blockchains – leveraging the ERC-4337 paymaster.","The function went live on Polygon (MATIC) mainnet and testnet as well as Ethereum (ETH) testnet at the start, and later will be expanded to more blockchains, Circle said.","Southeast Asian super-app Grab, for example, is currently trying out the Gas Station function to give its Singaporean users a gas-free experience if they use non-fungible token (NFT) vouchers from Grab’s Web3 wallet to earn rewards, the press release said.","Read more: Circle Seeks to Make Crypto Payments Easier With New 'Programmable Wallets'","The company also introduced Thursday its Smart Contract Platform, which aims to help developers build applications faster by offering a \"one-stop shop to import, explore, deploy, and manage smart contracts.\" The product's APIs are currently available on Avalanche (AVAX), Ethereum and Polygon.","\"We’re reducing friction and making blockchain transactions more accessible to everyone,” Gagan Mac, head of product for Web3 services at Circle, said in a statement. \"With the launch of Gas Station, we are abstracting away blockchain transaction fees for end users and Smart Contract Platform makes it easier for businesses to leverage the benefits of blockchain networks.\"","Edited by Aoyon Ashraf."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Gagan Mac","content":"PERSON"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["Circle","USDC","Crypto Wallets","gas fees","Web3"],"authors":["Krisztian Sandor"]}