{"summary":"Bitcoin trading volumes continued to suffer a free fall on 24th January, as markets reacted to fee policy changes at major Chinese exchanges.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2017\/01\/25\/real-volumes-revealed-how-chinas-bitcoin-market-is-adapting-to-fees\/","publishDate":"2017-01-25T11:00:17","id":16071,"type":null,"title":"Real Volumes Revealed? How China's Bitcoin Market is Adapting to Fees","category":["Markets"],"content":["Bitcoin volumes fell sharply yesterday, a move that illustrated the market’s strong response to a previously announced decision by China-based exchanges to end 'no fee' trading policies and halt margin lending.","Though analysts had long speculated as to what the result of the change would be (given assertions that the markets were being bolstered by high-frequency traders), the results have so far been more extreme than projected.","Overall, the lower volume at these three major exchanges has had a depressing effect, reducing transaction activity across the board.","In response, analysts quickly highlighted the potential benefits of the situation.","Entrepreneur and investor Vinny Lingham described the declines as \"healthy and positive moves\", predicting the market will enjoy new and genuine price discovery.","Petar Zivkovski, COO of leveraged bitcoin trading platform Whaleclub, also provided an upbeat assessment, telling CoinDesk:","While the input of these market analysts can certainly prove insightful, it is helpful to take a look at some hard numbers.","BTCC, OKCoin and Huobi all saw their trading volume drop early on 24th January.","For example, market participants traded less than 8,000 BTC through BTCC in the session's first hour, nearly 80% less than the 37,000 BTC the exchange recorded during the final hour of the 23rd January session, Bitcoinity data reveals.","This trend of sharp reduction continued, and trading volume reached a daily low of 138 BTC during the hour through 06:00 UTC before experiencing sharp gyrations.","This transaction activity rose to roughly 1,100 BTC and 2,300 BTC in the next two hours, before falling back to levels that were almost as depressed as the daily low.","OKCoin's trading volume followed a similar trajectory, plunging more than 50% from roughly 26,000 BTC during the final hour of 23rd January to approximately 13,000 BTC in the first hour of 24th January, Bitcoinity data shows.","This downward trend continued until trading volume fell to less than 500 BTC during the hour through 08:00 UTC.","Hourly transaction activity managed to stage a recovery after this, rising to almost 3,000 BTC at one point. But it declined significantly after, reaching roughly 126 BTC.","Notably, the last three hours through 20:00 UTC all experienced volume of less than 200 BTC.","Huobi’s trading volume suffered an even sharper drop than that of BTCC and OKCoin in the first hour of today’s session, declining more than 80% to roughly 382 BTC from 2,387 BTC in the prior session’s final hour, according to Cryptowatch.","The exchange’s transaction volume did push higher later in the day, rising to an hourly volume of close to 1,500 BTC. However, it never came close to the hourly volume of 11,900 BTC attained on 23rd January.","Now that the major Chinese exchanges have imposed fees, several market observers have forecast that the development will have a significant impact on the market.","While some of these analysts – for example Lingham and Zivkovski – made optimistic predictions about this situation, not everyone provided a rosy assessment.","While the People’s Bank of China’s (PBoC) decision to crack down on local trading could simply help “rein in” the minor transactions of hobbyist algorithmic traders, it could potentially provoke concerns in the markets, according to cryptocurrency fund manager Jacob Eliosoff.","\"The larger fear is that the PBoC's tougher stance will scare off the Chinese buyers who've driven BTC to these heights,\" he said.","Eliosoff ended on a bearish projection, suggesting a prolonged volume slump could have a much more significant impact on the price, adding:","Dry hose image via Shutterstock"],"entity":[{"type":"Vinny Lingham","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"Jacob Eliosoff","content":"PERSON"},{"type":"People’s Bank of China’s (PBoC","content":"ORGANIZATION"},{"type":"Petar Zivkovski","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"China","content":"LOCATION"}],"hashtag":["price-news","China","Trading Volume","Exchange Fees","Markets","Features"],"authors":["Charles Bovaird"]}