{"summary":"Staked ETH withdrawals made the cut – but the timeline for when that will happen still isn't any clearer.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/11\/24\/ethereum-developers-agree-on-what-could-be-included-in-the-next-upgrade-but-not-when\/","publishDate":"2022-11-24T16:06:19","id":16088,"type":null,"title":"Ethereum Developers Agree on What Could Be Included in the Next Upgrade – but Not When","category":["Technology"],"content":["Ethereum developers decided Thursday to consider eight Ethereum Improvement Proposals (EIPs) for inclusion in the network’s upcoming hard fork, called “Shanghai.” The hard fork upgrade will unlock Beacon Chain staked ETH withdrawals, and might include proposals that address issues of scalability and others designed to improve the Ethereum Virtual Machine.","But there is no consensus yet on when that will happen.","Having EIPs “considered for inclusion” (CFI) means that the developers will commit to developing these proposals and will run them through tests on developer networks (devnets). However, there’s no guarantee that all these proposals will make the final cut for inclusion in Shanghai.","Even before the core developers met, they’d determined that Beacon Chain withdrawals, or EIP 4895, was definitely going to be part of the fork. This means that once Ethereum goes through its next upgrade, users that staked ether prior to the Merge by locking them up in the Beacon Chain smart contract will be able to access them, along with any additional accrued rewards.","While developers agreed which EIPs they will focus their efforts on leading up to Shanghai, they didn’t settle on a time frame for the hard fork’s mainnet deployment. The Ethereum Foundation gave a soft timeline for unlocking staked ETH at six to 12 months after the Merge, but earlier last week, the language around that started to change.","By the end of this call, the timeline for Shanghai wasn’t any clearer. Some developers want to expedite Shanghai and include only the ETH withdrawal EIP along with a few other smaller EIPs, sometime in March 2023. Then, a subsequent fork would include another significant scaling upgrade – proto-danksharding – and would ship sometime during the fall of 2023.","Other developers want a bigger, comprehensive Shanghai upgrade to happen that would include both major upgrades at that second, later time.","For now, EIP 4844, also known as proto-danksharding, is in the CFI package. EIP 4844 is a significant first step the protocol would take toward making the network more scalable through sharding, a method that splits up the network into “shards” as a way to increase its capacity and bring down gas fees.","Read more: Anxious Ethereum Stakers Question When They’ll Be Able to Access Funds","The implementation of the EVM Object Format (EOF) made it into the batch, which is a collection of EIPs that essentially upgrade the Ethereum Virtual Machine, the environment where Ethereum is able to deploy smart contracts. Most of the changes are focused on making the smart contract execution safer, by verifying that certain conditions are met. The EIPs that will upgrade the Ethereum Virtual Machine are EIP 3540, EIP 3670, EIP 4200, EIP 4570, EIP 5450.","The last proposal that is being considered for inclusion is EIP 2537, which would see the addition of \"BLS precompile.\" With this proposal, Ethereum could create more secure cryptographic proofs,and allow for better interoperability with the Beacon Chain.","Last month, developers introduced the Shandong testnet, where they can explore and resolve any bugs related to some of these EIPs.","Read more: The Next Major Ethereum Upgrade, Shanghai, Now Has a Testnet"],"entity":[{"type":"BLS","content":"ORGANIZATION"},{"type":"CFI","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"4895","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"EIP 4844","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Shandong","content":"LOCATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"fall of 2023","content":"DATE"}],"hashtag":["Ethereum","Shanghai","EIP","Ether","Sharding","Staking"],"authors":["Margaux Nijkerk"]}