{"summary":"The blockade only applies to the Tornado Cash front end, not the underlying smart contract, one of the protocol's founders later tweeted.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/04\/15\/tornado-cash-adds-chainalysis-tool-for-blocking-ofac-sanctioned-wallets-from-dapp\/","publishDate":"2022-04-15T14:03:57","id":16086,"type":null,"title":"Tornado Cash Adds Chainalysis Tool for Blocking OFAC-Sanctioned Wallets From Dapp","category":["Technology"],"content":["In a move that raised the eyebrows of crypto privacy wonks, coin mixer Tornado Cash said Friday it is using a tool developed by compliance firm Chainalysis to block crypto wallets sanctioned by the U.S. Office of Foreign Assets Control (OFAC).","However, the blockade only applies to the user-facing decentralized application (dapp), not the underlying smart contract, one of the protocol's founders later tweeted.","The coin mixer, which claims to defend people's financial privacy, has often been used to obfuscate the trail of crypto obtained through hacks.","The protocol's founder has previously said it is \"technically impossible\" to enforce sanctions on decentralized protocols like Tornado Cash. \"There's not much we can do,\" he said in a March interview.","Read more: Tornado Cash Co-Founder Says the Mixer Protocol Is Unstoppable","The half-measure of restricting front-end access is not new, however.","A former U.S. Drug Enforcement Agency agent told CoinDesk in January that Tornado Cash complies with OFAC's list of sanctioned crypto wallets. The announcement Friday follows Thursday's news that North Korean hackers were alleged by U.S. authorities to be behind the $625 million exploit of Axie Infinity's Ronin blockchain.","The Ronin hackers \"have so far sent $80.3 million worth of ETH through Tornado Cash,\" tracing firm Elliptic wrote Thursday.","\"The fact that Tornado Cash doesn't allow access to its app to comply with regulations doesn't necessarily mean that the protocol and smart contracts are not available to the sanctioned entities,\" Tal Be'ery, the chief technology officer of crypto wallet ZenGo, told CoinDesk in a direct message.","OFAC is a U.S. government body responsible for enforcing economic sanctions to support national security and foreign policy. It maintains a list of crypto wallets tied to sanctioned individuals and entities.","The Chainalysis oracle for sanctions compliance is a free smart contract that scans for crypto wallets that are sanctioned by various governments. The sanctions-screening tool was launched in March against the backdrop of Russia's invasion of Ukraine.","\"Now is the time for the industry to demonstrate that blockchains' inherent transparency make cryptocurrency a powerful deterrent to sanctions evasion,\" Chainalysis CEO Michael Gronager said at the time, adding:"],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$80.3 million","content":"MONEY"},{"type":"Michael Gronager","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"U.S. Drug Enforcement Agency","content":"ORGANIZATION"},{"type":"U.S. Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"$625 million","content":"MONEY"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Tornado Cash","Privacy","Privacy Coin","Sanctions"],"authors":["Eliza Gkritsi"]}