{"summary":"The struggling VR platform reported losses of $3.7 billion in the second quarter, though CEO Mark Zuckerberg remains \"fully committed\" to the metaverse and AI.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/07\/28\/meta-hopes-to-recharge-lagging-horizon-worlds-metaverse-with-new-in-house-game-studio\/","publishDate":"2023-07-28T20:47:14","id":16089,"type":null,"title":"Meta Aims to Recharge Lagging Horizon Worlds Metaverse With New In-House Game Studio","category":["Web3"],"content":["Meta is working to reboot its lagging Horizon Worlds platform through a new in-house VR game studio, in a bid to help the platform recoup major losses and revive waning interest in its metaverse among consumers.","In an interview with tech newsletter Lowpass, Meta’s metaverse VP Vishal Shah said that the company is producing new first-party titles through a new in-house studio called Ouro Interactive. The newsletter's author, who played one of their new games called \"Super Rumble,\" said that the studio is making use of new technological advancements to produce \"much better-looking and immersive experiences.\"","\"We've really raised the ceiling on what can be built in Horizon in terms of visual complexity, interactivity and fun gameplay,” Meta’s metaverse VP Vishal Shah told Lowpass.","According to Shah, the platform is also hoping to better target the estimated billions of mobile gamers worldwide by bringing Horizon Worlds to app stores, though it's unclear when it plans to do that. By integrating cross-platform play, Shah told Lowpass that the mobile version is meant to act as a bridge for those who don't own a VR headset, shifting the platform further away from being \"VR only to a place where we're going to be VR first.\"","Over the last year, Horizon Worlds has focused its efforts on supporting more complex games and the ability for developers to import assets from using third-party tools. It is also investing in generative AI tools to make it easier for users to build in its world without the knowledge of professional 3D rendering tools.","\"This is definitely more than just a new world,” Shah told Lowpass. “[It's] the next generation of Horizon Worlds.”","CEO Mark Zuckerberg affirmed Meta's commitment to AI and the metaverse in an earnings call on Wednesday, calling them both \"major priorities\" that are now \"overlapping an complementary.\"","\"For Horizon, the team is focused on retention right now and we're making good progress on that,\" he said. \"We made big improvements on avatars as well and that's going to be a bridge between our mobile apps and our VR and mixed reality experiences.\"","Still, the company clocked an operating loss in the second quarter of 2023 of $3.7 billion in its Reality Labs department, the business and research unit behind its Quest VR headsets and Horizon Worlds platform. In a press release, Meta said its expects Reality Labs operating losses to increase year-over-year in 2023 due to ongoing product development.","Meta's renewed interest comes at a time when other companies are scaling back their metaverse projects. In March, Disney reportedly laid off its metaverse team and shuttered its virtual world-building efforts.","See Also: Is It Finally Time to ‘X-it’ Twitter for Threads?","Edited by Toby Leah Bochan.","\n","\n"],"entity":[{"type":"Horizon Worlds","content":"LOCATION"},{"type":"Toby Leah Bochan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Lowpass","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"second quarter of 2023","content":"DATE"},{"type":"Shah","content":"PERSON"},{"type":"Vishal Shah","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Lowpass","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$3.7 billion","content":"MONEY"},{"type":"Horizon","content":"LOCATION"},{"type":"Reality Labs","content":"ORGANIZATION"},{"type":"Disney","content":"ORGANIZATION"}],"hashtag":["NFTs","Web3","Metaverse","AI","Meta","Mark Zuckerberg"],"authors":["Rosie Perper"]}