{"summary":"Uniswap has released a new privacy policy, according to its official website.\nIt states that the exchange collects on-chain data on users’ crypto wallets.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188724\/uniswaps-new-privacy-policy-says-it-collects-data-tied-to-user-wallets","publishDate":"2022-11-21T06:24:06","id":1609,"type":null,"title":"Uniswap&#x27;s new privacy policy says it collects data tied to user wallets","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Uniswap, the largest Ethereum decentralized exchange,<\/span> <a href=\"https:\/\/uniswap.org\/blog\/commitment-to-privacy\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> a new privacy policy to provide transparency on the data it collects. <\/span><span data-v-f87c67ca=\"\">The <\/span><span data-v-f87c67ca=\"\">privacy policy<\/span><span data-v-f87c67ca=\"\"> <a href=\"https:\/\/uniswap.org\/privacy-policy\" data-v-f87c67ca=\"\">states<\/a>&nbsp;that the DEX collects certain on-chain and off-chain data connected to users’ crypto wallets.<\/span>","<span data-v-f87c67ca=\"\">It clarified that publicly-available on-chain data is analyzed to help make informed decisions.&nbsp;<\/span><span data-v-f87c67ca=\"\">As far as off-chain data goes, Uniswap claimed it does not gather sensitive personal data like names, emails or IP addresses.&nbsp; However, other off-chain web identifiers related to users' activity on front end website are still scraped, the exchange noted.<\/span>","<span data-v-f87c67ca=\"\">\"Our first priority is to protect user data and privacy, but we do want to make data-driven decisions that improve user experience. That includes public on-chain data and limited off-chain data like device type, browser version, etc.,\" Uniswap said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The privacy policy notes that the decentralized exchange and other “third-party services providers” may gather data related to users' mobile deviceID, cookies, information from localStorage, operating system, device or browser language. Such information can be used to remember which tokens users have imported, as well as learn their preferences and interactions, Uniswap said.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, the decentralized exchange confirmed that it screens user wallets with the help of certain blockchain analytics providers to help identify illicit activity. This comes a few months after the exchange —&nbsp;working with blockchain analytics firm TRM Labs —&nbsp;<\/span><a href=\"https:\/\/www.theblock.co\/post\/164626\/uniswap-has-blocked-253-crypto-addresses-related-to-stolen-funds-or-sanctions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blocked<\/span><\/a><span data-v-f87c67ca=\"\"> 253 crypto addresses tied to mixing service Tornado Cash.<\/span>","<span data-v-f87c67ca=\"\">“When you connect your non-custodial blockchain wallet to the Services, we collect and log your publicly-available blockchain address to learn more about your use of the Services and to screen your wallet for any prior illicit activity,” the<\/span> <span data-v-f87c67ca=\"\">privacy policy<\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/uniswap.org\/privacy-policy\" data-v-f87c67ca=\"\"> stated<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Uniswap is the highest-volume decentralized exchange on the Ethereum blockchain. So far in November, Uniswap has accounted for roughly 60% of Ethereum’s on-chain volume, according to<\/span> <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\"> from The Block.<\/span>","<span data-v-f87c67ca=\"\">Uniswap Labs, the developers of Uniswap, <\/span><a href=\"https:\/\/www.theblock.co\/post\/176944\/uniswap-labs-valued-at-1-66-billion-after-165-million-series-b\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised<\/span><\/a><span data-v-f87c67ca=\"\"> $165 million in a Series B round at a $1.6 billion valuation last month.<\/span>"],"hashtag":["DEXS","IDENTITY","UNISWAP"]}