{"summary":"As crypto becomes more widely used, Square will transition to providing a broader range of “internet services” rather than just fintech, Jack Dorsey predicted.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/09\/04\/jack-dorsey-mass-crypto-adoption-will-transform-squares-business\/","publishDate":"2019-09-04T19:40:02","id":16098,"type":null,"title":"Jack Dorsey: Mass Crypto Adoption Will Transform Square's Business","category":["Markets"],"content":["As cryptocurrency becomes more widely used, Square will transition to providing a broader range of “internet services” rather than just financial technology, co-founder Jack Dorsey predicted.","In an Aug. 5 interview with The Australian Financial Review, Dorsey detailed how he believes the emerging asset class will shape his company’s development. He said:","Rather than focusing on money transmission or payments, as at present, the firm will likely begin to develop services “like hardware, analytics and payroll and lending,” Dorsey said.","Square integrated bitcoin in 2018, when its Cash App began selling the cryptocurrency to users. This service generated over $190 million in revenue over the first two quarters of this year, yielding shy of $3 million in gross profit.","In a separate interview with two other Australian publications, The Age and The Sydney Morning Herald, Dorsey took a thinly veiled swipe at social media giant Facebook’s leap into cryptocurrency. He said neither Square nor his other company, Facebook rival Twitter, would create a native token, adding:","Dorsey reiterated his view that bitcoin has a “high probability” of becoming the internet’s “native currency,” or the basis for all payments made online.","“It's been the most resilient, it's around for 10 years, it has a great brand and it's been tested a bunch,” he said.","Still, Dorsey said Square’s exposure to various payment methods could help the company “weather storms,” referring to economic downturns.","These comments come on the heels of Square Crypto’s hire of renowned bitcoin developer Matt Corallo. The bitcoin-focused division, headed by former Google director Steve Lee, aims to bolster the adoption of crypto payments.","\"We're hiring five open source engineers to work entirely on making the crypto ecosystem better. I think the internet will have a native currency and anything we can do to make that happen we'll do,” Dorsey said.","Jack Dorsey at Consensus 2018, image via CoinDesk archives"],"entity":[{"type":"$190 million","content":"MONEY"},{"type":"Matt Corallo","content":"PERSON"},{"type":"Square Crypto","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Steve Lee","content":"PERSON"},{"type":"The Australian Financial Review","content":"ORGANIZATION"},{"type":"Dorsey","content":"PERSON"},{"type":"Aug. 5","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"The Sydney Morning Herald","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["Square","News","Jack Dorsey","Square Crypto"],"authors":["Daniel Kuhn"]}