{"summary":"HTX withdrawals and deposits have been temporarily suspended, and all losses will be covered by the exchange, Sun said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/11\/22\/justin-sun-confirms-htx-heco-chain-exploited-after-100m-in-suspicious-transfers\/","publishDate":"2023-11-22T13:13:32","id":16095,"type":null,"title":"Justin Sun Confirms HTX, Heco Chain Exploited After $100M in Suspicious Transfers","category":["Technology"],"content":["Crypto exchange HTX and blockchain protocol Heco Chain were hacked for a cumulative $97 million in various tokens earlier Wednesday, Justin Sun, one of the investors at the exchange, confirmed in a post.","Sun said HTX will fully compensate for any losses originating from the exchange. Deposits and withdrawals are temporarily suspended while the remaining funds are secure.","“We are investigating the specific reasons for the hacker attack. Once we complete the investigation and identify the cause, we will resume services,” Sun said.","Blockchain security firm Cyver flagged suspicious transfers to the tune of $85 million earlier Wednesday. It said in a message to CoinDesk that the attack was due to a suspected private key leak, which allowed their holders to access the Heco bridge, which lets users transfer tokens between Heco Chain and Ethereum.","Heco Chain was set up by HTX, which continued to be one of its maintainers. A HTX spokesperson told CoinDesk that HTX and Heco Chain operate independently.","The incident follows a smaller $8 million exploit of HTX in October, where hackers were able to steal 500 ether from the exchange. All losses were fully covered in the days following the incident.","UPDATE (Nov. 22, 14:07 UTC): Adds sentence from HTX spokesperson.","Edited by Oliver Knight."],"entity":[{"type":"earlier Wednesday","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"$85 million","content":"MONEY"},{"type":"Oliver Knight","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"HTX","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$97 million","content":"MONEY"},{"type":"Heco Chain","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Cyver","content":"PERSON"}],"hashtag":["Hack","Justin Sun"],"authors":["Shaurya Malwa"]}