{"summary":"South Korean prosecutors want the court to sentence Bithumb’s former chairman to eight years in prison for fraud.\nLee Jung-hoon is accused of defrauding investors to the tune of $70 million.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179587\/bithumb-ex-chair-lee-jung-hoon-jail-fraud-case","publishDate":"2022-10-25T05:53:28","id":161,"type":null,"title":"Bithumb ex-chair Lee Jung-hoon could face jail term in $70 million fraud case: YNA","category":["Legal"],"content":["South Korean prosecutors are pushing for Lee Jung-hoon, former chairman of crypto exchange platform Bithumb, to serve up to eight years in prison for alleged fraud, according to <a href=\"https:\/\/www.yna.co.kr\/view\/AKR20221025098200004\" data-v-f87c67ca=\"\">a report<\/a> by South Korean news agency Yonhap.","The fraud case is in <a href=\"https:\/\/www.theblock.co\/linked\/78131\/police-summon-bithumb-chairman-alleged-fraud\" data-v-f87c67ca=\"\">connection<\/a> to the sale of Bithumb's BXA tokens, which was part of an attempt by Singapore-based BK Group to acquire the crypto exchange in 2018. The initial deal saw Lee presell BXA tokens worth $25 million to BK Group as part of the acquisition process. These tokens were also sold to investors to the tune of about $45 million.","However, Bithumb did not list BXA and this allegedly led to significant losses on the part of investors. These investors sued both Lee and Kim Byung Gun, chairman of the BK Group, in court for fraud. South Korea’s investigative agency previously determined that Kim did not have a case to answer. Investigators concluded that Kim was as much a victim as the other investors in the BXA token sale.","Now, prosecutors are asking for Lee to be convicted of fraud, according to South Korea’s Act on the Aggravated Punishment of Specific Economic Crimes. “The amount of damage is very large, and the damage is especially great for ordinary coin investors,” said the prosecution at a Tuesday hearing before the Seoul Central District Court.","Lee’s defense, however, argued that the token sale was in accordance with a “typical stock sale contract.” The defense further argued that BK Group’s Kim was trying to avoid criminal responsibility for his part in the BXA token sale debacle.","The court will hold its sentencing hearing on December 20."],"hashtag":[]}