{"summary":"The creator of litecoin is no longer an investor in the cryptocurrency, according to a post he authored on Reddit Wednesday.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2017\/12\/20\/litecoin-creator-sells-stake-citing-conflict-of-interest\/","publishDate":"2017-12-20T13:20:31","id":16103,"type":null,"title":"Litecoin Creator Sells Stake Citing 'Conflict of Interest'","category":["Markets"],"content":["The creator of litecoin has sold off all his holdings in the cryptocurrency, citing a perceived conflict of interest.","Writing in a Reddit post this morning, developer Charlie Lee explained he no longer wants to fend off allegations his remarks about litecoin's price are being done for his personal enrichment, and that he saw the sale as the best way to ensure transparency over his actions.","Lee wrote:","While he claimed to \"always refrained\" from buying and selling litecoin close to \"major tweets,\" his actions could be perceived as aimed to boost his own personal wealth \"above the success of litecoin and crypto-currency in general,\" Lee explained.","As a result, Lee said has sold off or donated his litecoin holdings in recent days, barring a few physical litecoins being kept as \"collectibles.\" Lee added that the amount of litecoin he sold was \"a small percentage\" of the cryptocurrency's global trading volume.","Now, the seventh largest coin by market valuation, litecoin was formed via a fork of bitcoin back in 2011, and often previously referred to as the \"silver to bitcoin's gold.\" An employee of Google at the time, Lee envisioned litecoin as a cryptocurrency that would offer merchants faster transaction times.","Of late, litecoin has seen a recent resurgence in price as Lee proposed an ambitious technical roadmap, including adopting the scaling solution Segregated Witness originally planned for bitcoin. At press time, the cryptocurrency is trading at around $334, having achieved a new all-time high of $375.29 just yesterday.","Litecoin image via CoinDesk archives"],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"$375.29","content":"MONEY"},{"type":"Lee","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"$334","content":"MONEY"},{"type":"Charlie Lee","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"post this morning","content":"TIME"}],"hashtag":["Coinbase","Litecoin","Charlie Lee","News","Markets","other-public-protocols","Markets News"],"authors":["Daniel Palmer"]}