{"summary":"Also: More exploits in DeFi.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/11\/03\/looking-into-ethereums-economic-future\/","publishDate":"2021-11-03T11:30:00","id":16104,"type":null,"title":"Looking Into Ethereum’s Economic Future","category":["Markets"],"content":["This article originally appeared in Valid Points, CoinDesk’s weekly newsletter breaking down Ethereum 2.0 and its sweeping impact on crypto markets. Subscribe to Valid Points here.","While weeks and months in crypto often feel like years, it has only been 60 days since the hard fork that contained EIP 1559 was implemented on Ethereum’s mainnet. A world of data regarding EIP 1559 has surfaced, but ultimately the upgrade is still in its infancy.","In fact, a few weeks ago, I wrote about Nic Carter’s somewhat overly eager Ethereum takeaways and how it was probably too early to estimate EIP 1559′s impact on the network. However, this week I am changing my tone a bit and looking at the potential implications of the upgrade’s base fee burn and its effect on the longevity of Ethereum.","At a very high level, under proof-of-work (PoW) and proof-of-stake (PoS), Ethereum uses block rewards to incentivize miners and validators of the chain. This incentive helps properly secure the network by paying those that are beneficial for confirming transactions and logging the state of the chain, which in turn encourages competition to grow a large and distributed base of miners\/validators.","Bitcoin uses a similar model, but every four years the amount paid in block rewards decreases until the reward is extremely negligible and the bitcoin supply tops at 21 million. As block rewards become negligible, bitcoin miners will be forced to rely on transaction fees in order to remain profitable. Reasonably, the network will have to maintain a level of activity high enough to pay miners for their services.","Ethereum and EIP 1559, on the other hand, now take a reverse approach to Bitcoin’s security budget. EIP 1559 took away the vast majority of transaction fee revenue that miners previously received, but Ethereum will continue to emit block rewards to miners (and eventually validators), indefinitely. While Ethereum takes an uncapped supply approach, the newly introduced fee burn will help counteract ether’s inflation.","Bitcoin’s role as a hedge against inflation has certainly been a huge part of the asset’s success. However, its “digital gold” narrative leads to lower network activity as the asset is considered a store of value rather than a medium of exchange, at least for the time being. This issue has left some wondering if transaction fees will be enough to keep miners interested, if miners will adapt or if the network will have to pivot to an updated compensation model.","It’s likely wrong to say that EIP 1559 “solved” this issue of paying miners into perpetuity, because again bitcoin’s fixed supply is what makes investing in the asset so attractive. Ether’s supply, on the other hand, will be extremely dependent on network activity and the demand for blockspace. The Bitcoin network is years away from the concern becoming a reality and will likely surprise me with its ability to adapt and survive.","My comparison between the two networks is strictly how they approach miner incentives, something I believe EIP 1559 possibly addressed with its fee burn mechanism. A future in which Ethereum can continue to subsidize validators without diluting those that hold ether is very promising for the network.","The following is an overview of network activity on the Ethereum 2.0 Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Valid Points incorporates information and data about CoinDesk’s own Eth 2.0 validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post.","You can verify the activity of the CoinDesk Eth 2.0 validator in real time through our public validator key, which is:","0xad7fef3b2350d220de3ae360c70d7f488926b6117e5f785a8995487c46d323ddad0f574fdcc50eeefec34ed9d2039ecb.","Search for it on any Eth 2.0 block explorer site."],"entity":[{"type":"Valid Points","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Carter","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Valid Points","content":"LOCATION"},{"type":"1559","content":"DATE"}],"hashtag":["Ethereum","Ethereum 2.0","Ether","Bitcoin Mining","Validators"],"authors":["Edward Oosterbaan"]}