{"summary":"Four of the five biggest \"block builders\" on Ethereum are excluding transactions sanctioned by the U.S. government, data shows.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/12\/06\/ethereums-censorship-problem-is-getting-worse\/","publishDate":"2023-12-06T16:36:18","id":16101,"type":null,"title":"Ethereum's 'Censorship' Problem Is Getting Worse","category":["Technology"],"content":["For many believers in blockchain, the technology's allure lies in its open, uncontrolled nature – where decentralized networks are unfettered by the constraints and biases that shape today's internet.","But some researchers and users of Ethereum, the world's second-largest blockchain, are increasingly troubled by data showing a marked increase in censorship – what appears to be a concerted effort by block builders to exclude transactions linked to entities sanctioned by the U.S. government.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","A turning point came last year when the U.S. government sanctioned Tornado Cash – a \"privacy mixing\" program on Ethereum that helped people transact without leaving a trace. The Treasury Department's Office of Foreign Assets Control (OFAC) said the program was used by terrorists and other U.S.-sanctioned entities, so it added Tornado's Ethereum-based computer code to the same blacklist as Iran, North Korea and Hamas. In response, some blockchain advocates were defiant; they balked at OFAC's attempt at \"censorship\" and gloated that Ethereum would be immune to it as a result of its decentralized construction.","It hasn't really worked out that way. About 72% of data blocks posted to MEV-Boost, middleware that powers almost all of the validators that write blocks to Ethereum, are now considered \"censored,\" up from about 25% in November 2022, based on research from Toni Wahrstätter, a researcher at the Ethereum Foundation. The metric measures blocks assembled by MEV-Boost \"block builders\" which, based on statistical analysis, appear to deliberately exclude sanctioned crypto addresses.","As for why this is viewed as troubling, \"block builders have the authority to decide which transactions (and in which order) they put into their blocks and which they want to censor,\" Wahrstätter explained in a message to CoinDesk. \"This means block builders decide upon the content of the blockchain.\"","Of the five largest block builders, only one of them, “Titan Builder,” claims explicitly that it does not “filter” transactions – a practice corroborated by Wahrstätter’s research.","\"If Titan would start censoring tomorrow, then Ethereum would be at over 90% censorship,\" Martin Köppelmann, the founder of Ethereum scaling network Gnosis Chain, said in an interview. \"So essentially, we're just one builder away from quite heavy censorship on Ethereum.\"","Sanction-breaking transactions can still sneak their way onto Ethereum, but getting them there typically costs extra and takes longer. Wahrstätter refers to this sort of transaction throttling as censorship – an affront to what crypto is all about. Infrastructure operators might just call it \"compliance,\" a necessary step on Ethereum's journey toward mainstream adoption.","It's a marked departure from Ethereum's original pitch – as a network where \"code is law,\" where software replaces middlemen, and where \"decentralized\" networks can operate outside constraints from \"centralized\" companies and governments.","Wahrstätter's research gives a glimpse into a growing shift in Ethereum's under-the-hood transaction apparatus. The network's infrastructure has quietly become dominated by a few big players: trading bots and block builders that touch virtually all of the transactions issued onto Ethereum before they officially hit the chain's ledger.","Ethereum is a pretty simple network at its core: When a user submits a transaction, it isn't immediately added to the blockchain. Instead, it goes into a mempool – a waiting area for other yet-to-be-processed transactions. \"Validators\" then swoop in and organize those transactions into big groups, called blocks, which they officially add to the blockchain in exchange for fees and newly-minted ETH.","This pipeline has become more convoluted in recent years as people have developed strategies to earn maximum extractable value or MEV, which is the extra profit that one can squeeze from Ethereum by previewing upcoming transactions in the mempool.","Smart coders have figured out ways to \"front-run\" trades from other users, such as buying or selling tokens just before others to make an easy profit. They've also found ways to exploit spur-of-the-moment arbitrage opportunities – moving tokens between separate exchanges just before market prices will shift due to some other order in the queue.","Today, 90% of validators aren't assembling blocks themselves. Instead, they use MEV-Boost to outsource this work to third-party \"builders\" – bots that put together MEV-optimized blocks and hand them to validators.","Read more: What Is MEV, aka Maximal Extractable Value?.","Flashbots introduced MEV-boost as a way to spread out the riches of MEV, but its decentralized marketplace of \"builders,\" \"searchers\" and \"relayers\" has quietly transformed how activity travels through Ethereum, cementing little-understood infrastructure at key chokepoints in the chain's transaction pipeline.","Soon after the U.S. government sanctioned Tornado Cash, MEV-Boost's \"relayers\" were blamed for censoring Ethereum. Relayers are third-party software operators that hand transactions from builders to validators, and in November 2022, Wahrstätter found that 77% of them stopped passing along blocks with OFAC-sanctioned transactions.","This large percentage resulted, in part, from the fact that a small number of relayers were available in MEV-Boost's early days, and the most popular ones were filtering out OFAC transactions. After a blowback from the Ethereum community, several \"non-censoring\" relayers entered the MEV-Boost fray, and it looked like the tide was turning back in favor of network neutrality. Today, only 30% of relayed blocks are \"censored,\" by Wahrstätter's definition.","But things seem to have swung in favor of OFAC's sanctions in recent months, largely due to a shift in behavior among MEV-Boost's builders, rather than its relayers.","Just five builders contribute more than 90% of the blocks that go onto Ethereum. Four of those five are \"censoring\" transactions, according to Wahrstätter's research.","It's not surprising to see that certain infrastructure providers, particularly those based in the U.S., have taken steps to operate cautiously when it comes to sanctions. The headline-grabbing guilty pleas last month from the crypto exchange Binance and its CEO, Changpeng Zhao, showed the consequences of running afoul of OFAC's rules. The U.S. Department of Justice also charged two Tornado Cash developers with money laundering and arrested one of them back in August.","\"Block builders are also just people like you and me (that have families, that might want to move to the U.S., etc),\" wrote Wahrstätter. \"It's understandable that they try to minimize the risk for themselves as individuals and their business.\"","Beyond the neutrality concerns, Wahrstätter's research highlights how Ethereum's MEV economy has centralized key elements of the chain's inner workings, a potential security risk as well as a problem for the chain's neutrality.","In addition to five builders assembling 90% of Ethereum blocks, just four relayers are behind 96% of the blocks that are sent to validators.","Centralization and censorship are top of mind for Ethereum's builders. Wahrstätter, who has been one of the loudest voices on this issue, works at the Ethereum Foundation, the main non-profit that stewards the network's development.","Vitalik Buterin, Ethereum's co-founder and chief figurehead, has added censorship-curbing software updates to the most recent version of his proposed roadmap for the blockchain.","But even some of those solutions raise problems. For instance, some users who wish for their transactions to remain uncensored have opted to use \"private mempools\" – issuing transactions directly to builders, rather than Ethereum's mempool, to guarantee their inclusion. While this can help circumvent the censorship problem, it's not hard to see how the normalization of private order flow might introduce different problems to the network – like higher fees, less transparency and the same sorts of middlemen that blockchains were built to avoid."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Toni Wahrstätter","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"North Korea","content":"LOCATION"},{"type":"72%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"96%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Wahrstätter","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Treasury Department's Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Gnosis Chain","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"August","content":"DATE"},{"type":"77%","content":"PERCENT"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Martin Köppelmann","content":"PERSON"},{"type":"Wahrstätter","content":"PERSON"},{"type":"Iran","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Analysis","Censorship","Ethereum","Mev blocker","MEV","Vitalik Buterin","Infrastructure"],"authors":["Sam Kessler"]}