{"summary":"Balaji Srinivasan's thesis of forming countries online underpins a thought-provoking bestseller and maybe a new asset class – earning him a spot on CoinDesk’s Most Influential 2022 list.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/05\/pinning-the-idea-of-network-states-on-the-map\/","publishDate":"2022-12-05T12:30:24","id":16112,"type":null,"title":"Pinning the Idea of ‘Network States’ on the Map","category":["Consensus Magazine"],"content":["Two years after he made CoinDesk’s Most Influential list for early warnings about the coronavirus, angel investor Balaji Srinivasan is back for, at a minimum, writing a buzzy book – and, potentially, conceiving a new digital asset class.","In July, the ex-Coinbase chief technology officer and former Andreessen Horowitz partner published “The Network State: How to Start a New Country,” a crystallization of ideas he’s been kicking around for almost a decade. The book audaciously claims that like-minded people scattered across the globe can form new societies first by building communities on the internet and eventually coalescing in real life – though not necessarily in a single place.","Read more: Presenting CoinDesk's Most Influential 2022","“A key concept is to go cloud first, land last – but not land never – by starting with an online community and then materializing it into the physical world,” Srinivasan writes.","Cryptocurrencies, borderless by nature, would power the economies of these countries-to-be. Once prospective citizens know and trust each other – early on, those already in close proximity could hold in-person meetups – they could crowdfund the acquisition or construction of apartments, houses or towns in which to live together. These discontiguous outposts would be stitched together into a “network archipelago” using “mixed reality,” a combination of virtual reality, augmented reality (e.g., glasses that superimpose text or graphics over what’s in front of your nose) and face-to-face interactions. Digital IDs would confer citizenship and a census would be taken (how else?) on-chain. Ultimately, a network state would seek diplomatic recognition from the analog-world governments Srinivasan depicts as sclerotic.","Some readers may be thinking, “What is this man smoking?” But there are at least two projects, Praxis Society and Afropolitan, trying to make this apparent sci-fi dream into a reality. (Srinivasan is an investor in both.)","Read more: Balaji Srinivasan, the Man Who Called COVID (2020)","In 2020, when the coronavirus pandemic put much of the world on lockdown, Afropolitan formed an online community of 200,000 people in less than six months, according to co-founder Chika Uwazie. (They initially convened on Clubhouse, the voice-based social network that was briefly popular before Twitter Spaces ate its lunch.) The group raised “millions of dollars” in bitcoin and fiat currency from members of the diaspora of Nigerians living in the U.S., Europe and Latin America, Uwazie said during a presentation in October at CoinDesk’s I.D.E.A.S. conference in New York. (The group supplemented that with a $2.1 million pre-seed round this year from Srinivasan and other angel investors.)","A decentralized autonomous organization (DAO), Afropolitan aspires to build “a pan-African network state to help 1 billion Africans live their most abundant lives,” something it says the world’s nation-states have failed to do. But during her talk, Uwazie tailored her message to the investor crowd.","Unlike a social network, which needs millions of users to turn a profit, a network state could produce a return to investors with only a few hundred thousand members, Uwazie claimed. Revenue would come from “physical and e-resident taxes,” according to one of her slides.","“The network state is its own emerging asset,” she said. “It actually could be quite profitable.”","If nothing else, Srinivasan’s book is sparking conversations. As of mid-November, “The Network State” ranked third among Amazon’s bestsellers in the general technology and reference category, fourth in political philosophy ebooks and 16th in political philosophy books overall."],"entity":[{"type":"Network State","content":"ORGANIZATION"},{"type":"Praxis Society","content":"ORGANIZATION"},{"type":"Uwazie","content":"PERSON"},{"type":"“millions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"1 billion","content":"MONEY"},{"type":"Latin America","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"New Country","content":"LOCATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"$2.1 million","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"Clubhouse","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"CoinDesk’s I.D.E.A.S.","content":"ORGANIZATION"},{"type":"Chika Uwazie","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Srinivasan","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["Most Influential","Most Influential 2022","Balaji Srinivasan"],"authors":["Marc Hochstein"]}