{"summary":"Telegram abandoned its blockchain project in 2020, but devoted fans keep maintaining the open source code and now run two competing networks","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/08\/17\/ton-legacy-how-telegrams-crypto-coin-lives-on\/","publishDate":"2021-08-17T18:21:41","id":16110,"type":null,"title":"TON Legacy: How Telegram's Crypto Coin Lives On","category":["Markets"],"content":["","If the TON blockchain project by Telegram is dead, it’s having a busy afterlife with at least two forks managed by two competing communities.","","","A token running on the TON-derived blockchain, named TON Crystal, is now trading on several exchanges. Another competing token named TON Coin has been listed on EXMO, a crypto exchange, since last Monday and is now available to traders in Russia and the Commonwealth of Independent States (CIS), exchange spokeswoman Alesya Sypalo told CoinDesk. ","","","She added that the listing was a paid one but didn't disclose who paid for the service, only saying that Anatoly Makosov, one of the developers supporting the network, was “a point of contact” for the listing agreement. Makosov didn't respond to CoinDesk’s question if he himself arranged the listing. ","","","Both TON Crystal and TON Coin are using the TON brand and technology that was originally created by Telegram. Despite their common origin, the two communities keep apart from each other.","","","That’s far from the only vital signs the TON blockchain project has shown in recent months. ","","","The official website of the project, ton.org, came alive on Aug. 4 after more than a year of radio silence. The Telegram team, which had been maintaining the project’s repository, hadn’t updated the site since April 2020, right before the project was shelved. ","","","Now, the website displays information about one of the TON successors, The Open Network, which was previously named Newton. The network is maintained by a community of developers (led by Makosov) and validators that believes in the ultimate success of the ambitious blockchain project, which started as a $1.7 billion Web 3.0 utopia but drowned in a legal fight with the U.S. Securities and Exchange Commission over the status of its native token.","","","CoinDesk tried to figure out who is now maintaining the projects bearing the name of TON, why they are doing so and why they are competing with each other.  ","","","Telegram, the company behind the popular messenger app, dropped its plans to launch a blockchain in 2020, after two years of work and a massive, $1.7 billion token fundraising effort. Telegram Open Network was supposed to be a combination of a cryptocurrency and a range of decentralized services based on a native proof-of-stake blockchain. ","","","The concept included a decentralized domain name service (DNS), a virtual private network (VPN), file sharing and other features, which would, if implemented, create a complete Web 3.0 universe on the TON blockchain. All of that could be integrated with the Telegram messaging app, which back then boasted hundreds of millions of users. ","","","Not surprisingly, investors around the world, from Silicon Valley elite to Russian oligarchs, lined up to invest in the pre-sale of the future tokens.","","","The project was originally slated to go live in October 2019, but just weeks before launch, the SEC sued the company, citing securities law violation, and halted the launch. After nine months in court, Telegram quit the case and settled with the SEC, paying a penalty of $18.5 million. ","","","In May 2020, Telegram announced that it would no longer support the project, blaming the U.S. regulator. Before quitting, however, Telegram made TON’s code open source. The GitHub repository and the official website went radio silent after that, with one exception.","","","In early July 2020, a new feature was added to the blockchain code: “testgiver” contracts that provided a way for users to obtain pre-mined tokens using a proof-of-work algorithm. That allowed anyone who could set up a node to “mine” some tokens without buying them, although such a feature was not supposed to be a part of TON, which by design was coded as a proof-of-stake blockchain.","","","That proof-of-work option provided a chance for one of the TON offspring to exist.","","","After Telegram officially backed off from its blockchain project, it left behind a notable community of developers and small blockchain startups that had been waiting for TON to go live and had invested time, effort and computation power in the future blockchain. Many were not happy with the idea that it all had been in vain.","","","The disappointed group included developers who took part in Telegram’s blockchain hackathons while TON was under development, a bunch of small firms that had been getting ready to integrate Telegram’s cryptocurrency in their business models and would-be validators. ","","","These people decided that even though Telegram was no longer involved, the ambitious blockchain project had a future. ","","","One such community launched a blockchain named Free TON, with a native token called TON Crystal, in May 2020. The effort was led by TON Labs, a venture-backed tech company that helped Telegram to run the TON testnet early on, and some professional validator firms in Europe, such as Everstake, P2P and Certus One. ","","","The native token, called TON Crystal (TON), has been since listed and traded against the USDT stablecoin on several crypto exchanges, namely, CEX, DigiFinex and Kuna. The community has recently launched decentralized finance (DeFi) features, like yield farming, and native non-fungible token (NFT) marketplaces. ","","","The token has been integrated in wallet apps Changelly, Free Wallet and Lumi, and the community launched the bridge between the Free TON and Ethereum blockchains. According to Aleksandr Tetyukhin, who is responsible for FreeTON-related issues at the Everstake staking platform, at the moment, around 440 validators are active in the network.","","","In addition to that, the developers recently published a new white paper, bringing \"significant changes in philosophy and code base innovations\" to the original TON concept by Nikolai Durov, Telegram CEO Pavel Durov’s brother. The new white paper “elevates Pavel Durov’s concept of freedom to a new level,” Alexander Filatov, co-founder and CEO of TON Labs, told CoinDesk.","","","The document is now up for comments and evaluation by the community on the Free TON-dedicated forum. ","","","However, not all of the early supporters of Telegram’s blockchain utopia joined the Free TON party – some walked away to make their own version of TON. One of them, dubbed Newton, has been run by a different community of developers, who initially stayed out of public view. ","","","However, in late June, one of them, developer Anatoly Makosov, published a request on GitHub to the Telegram team to hand over the ownership of the ton.org domain and the Github repository to the Newton community (Makosov’s nickname is tolya-yanot, which is the author of the request). The owner of the ton-blockchain repository, presumably the Telegram developers, agreed to that request.  ","","","Since then, content on the ton.org website, previously updated by the Telegram team, was fully replaced by information about the Newton project. The GitHub repository hasn’t been updated by the presumed new owners yet. Telegram didn't return CoinDesk’s request for comment. ","","","Makosov told CoinDesk that when Telegram halted its own validators and stopped supporting the testnet, the team transferred the pre-mined tokens it had to the “testgiver” smart contracts and provided a way to mine them, and there is a notable number of miners doing that at this point. ","","","“So we realized that the token has value and started to discuss if we should create another testnet,” Makosov said. ","","","He added that he doesn’t know how many people and entities are involved in the TON “mining.”","","","A validator who asked not to be named said that according to his observations, around 500 addresses are actively mining at this point, all using quite powerful hardware. It’s hard to tell how many of those addresses belong to the same people, but he knows about at least 20 independent miners and entities that are accumulating tokens at this moment, using no fewer than 2,000 servers in total. Those individuals and entities, however, are not willing to disclose their names.  ","","","TON Labs’ Filatov said that the company secured rights for the “TON” and “The Open Network” brands in 41 countries, but struck a peaceful tone in a comment about the rival project, voicing hope that “all of that is open source [and] it will enrich the ecosystem at large.”","","","“I am genuinely hoping that 98% of TON coins that were already mined have value and owners behind them who would contribute to the network,” Filatov added.","","","Gregory Waisman, chief operation officer of the wallet app Mercuryo and a supporter of Newton, told CoinDesk that he believes Newton is closer to the initial concept created by Telegram. That Telegram transferred the ownership of ton.org to Newton underscores that Telegram “trusts the further development of the project to Newton,” he said.","","","Fedor Skuratov, former communications manager at TON Labs, believes that association with the original TON project by Telegram, in fact, does more harm than good because of the legal history of the project and the fact that it was effectively banned by the SEC. ","","","“The very name of TON became a negative factor for many potential partners, investors, banks and regulators. Free TON already got affected by that, and any other projects will be as well,” Skuratov said, adding that at this point, any hint to a connection with Telegram sounds good only for Telegram’s fans.","","","For that reason, the Free TON community chose to distance themselves from Telegram as far as possible, while the Newton community prefers to underscore its dedication to the original Telegram’s concept. Skuratov doesn't believe that Telegram itself is interested in the issue.","","","“Both Durovs have turned the page on TON for good,” he said, adding that Telegram simply wrote the project off and handed over the website and code repository to “those who asked first.”","","","Telegram didn't respond to questions about whether the company was supporting the Newton project.","","","UPDATE (Aug. 18, 2021, 19:30 UTC): This article was edited to clarify the number of exchanges TON Crystal is listed on and the description of the Free TON new white paper.","","","",""],"entity":[{"type":"Alexander Filatov","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Skuratov","content":"PERSON"},{"type":"Everstake","content":"LOCATION"},{"type":"Kuna","content":"LOCATION"},{"type":"Fedor Skuratov","content":"PERSON"},{"type":"Aug. 4","content":"DATE"},{"type":"$18.5 million","content":"MONEY"},{"type":"Aug. 18, 2021","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"late June","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Filatov","content":"PERSON"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Aleksandr Tetyukhin","content":"PERSON"},{"type":"Gregory Waisman","content":"PERSON"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Pavel Durov","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"DigiFinex","content":"ORGANIZATION"},{"type":"May 2020","content":"DATE"},{"type":"Newton","content":"LOCATION"},{"type":"October 2019","content":"DATE"},{"type":"TON Labs","content":"ORGANIZATION"},{"type":"Telegram CEO Pavel Durov","content":"ORGANIZATION"},{"type":"Anatoly Makosov","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Nikolai Durov","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Commonwealth of Independent States (CIS","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"July 2020","content":"DATE"},{"type":"Newton","content":"ORGANIZATION"},{"type":"Makosov","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Alesya Sypalo","content":"PERSON"}],"hashtag":["Telegram","Telegram Open Network","TON Crystal","TON Coin"],"authors":["Anna Baydakova"]}