{"summary":"Helio Money and Wombat Exchange also joined the liquid staking network.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/08\/30\/bnb-chain-introduces-liquid-staking-to-provide-crypto-users-access-to-additional-income-streams\/","publishDate":"2022-08-30T12:26:27","id":16115,"type":null,"title":"BNB Chain Introduces Liquid Staking to Provide Crypto Users Access to More Income Streams","category":["Finance"],"content":["BNB Chain, the base blockchain of crypto exchange Binance, has introduced so-called liquid staking with three leading Web3 protocols: Ankr, Stader and pStake, according to a press release shared with CoinDesk.","In liquid staking, users who have staked – or locked – their tokens for some use are issued new tokens with an equivalent value. The new tokens represent ownership of the underlying ones, are fully transferable and can be unwrapped to reclaim the staked assets. In the meantime, they can be used to generate yield, thus freeing up capital and making such products attractive to users.","Liquid staking is become more popular as Ethereum, the second-largest blockchain, proceeds toward becoming a proof-of-stake (PoS) system. Coinbase, a U.S. publicly traded crypto exchange, said last week it plans to offer its own liquid staking token, called Coinbase wrapped staked ETH (cbETH). It joins Lido Finance, which said in July it would soon offer staked ether on layer 2, or companion, networks.","With the BNB Chain introduction, users will be able to earn interest by allocating the BNB token to liquid staking protocols and receiving tradable aBNBc, BNBX and stkBNB tokens in return. Wombat Exchange has joined the liquid staking network to offer decentralized exchange trading facilities.","In addition, Helio Money is offering what it calls a \"destablecoin,\" which it says is a new asset class. The prefix “de-” stands for decentralized; it doesn't signify price volatility. While crypto-backed stablecoins are fixed relative to centralized crypto assets such as USDC, destablecoins such as Helios' HAY will use decentralized assets such as BNB as collateral. Destablecoins also differ from stablecoins in achieving stability broadly without an absolute peg to the fiat currencies.","Earlier this month, liquid staking protocol pStake and Stader, a staking-as-a-service platform, went live on the BNB Chain, complementing Ankr, which provides a software development kit to help protocols offer token staking, according to the release. As of Monday, the three together staked 101,100 BNB, or $30 million, in total value locked.","Read More: Ankr Introduces Token-Staking Tool Kits for Yield-Hunting Communities","\"Only 24 percent of the total market capitalization of staking platforms is locked in staking,\" said Gwendolyn Regina, the investment director at BNB Chain. \"We believe that users are not yet fully aware of the benefits of staking. [It] reduces concentration risk by utilizing three competitive protocols to avoid a single point of failure.\"","BNB Chain is the largest smart contract blockchain in terms of transaction volume, according to data from tracking tool YCharts.","Read More: Crypto Exchange Coinbase to Offer Liquid Staking Token Before Ethereum Merge"],"entity":[{"type":"Helio Money","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Gwendolyn Regina","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Crypto Exchange Coinbase to Offer Liquid Staking Token Before Ethereum Merge","content":"ORGANIZATION"},{"type":"Stader","content":"PERSON"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"24 percent","content":"PERCENT"},{"type":"Hunting Communities","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Binance","Staking","Liquid","Ethereum"],"authors":["Amitoj Singh"]}