{"summary":"Over $8 million in fees have been paid to the network by inscription creators since their inception.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/05\/03\/bitcoin-ordinals-surge-to-3m-inscriptions-but-most-are-just-text\/","publishDate":"2023-05-03T09:38:47","id":16114,"type":null,"title":"Bitcoin Ordinals Surge to 3M Inscriptions, but Most Are Just Text","category":["Technology"],"content":["The number of non-fungible tokens (NFT) tied to the Bitcoin blockchain surged above 3 million earlier this week after a one-day spike in activity that mainly consisted of text-based assets, data from Dune Analytics show.","The tokens, called inscriptions, function on the Ordinals Protocol, which allows users to embed data into the Bitcoin blockchain by inscribing references to digital art into small Bitcoin-based transactions.","The jump follows the introduction of the Bitcoin Request for Comment (BRC-20) token standard, allowing users to issue transferable tokens directly through the network. That spurred a collection of digital artwork and meme tokens built on Bitcoin. Market capitalization of the latter category jumped to $137 million on Tuesday.","Still, most inscriptions are text-based, data shows. These cost much less than digital art or meme coins because network fees are dependent on the amount of data inscribed.","Monday saw over 372,000 unique inscriptions on the Bitcoin blockchain, of which 371,000 were text based. Just 316 image-based inscriptions were created, with the remaining being applications or tokens.","Creators paid a cumulative 28 bitcoin (BTC) in fees for making the inscriptions, adding to the nearly 284 bitcoin in lifetime fees generated from Ordinals activity. That’s over $8 million at current prices.","Meanwhile, tokens focused on Bitcoin’s ecosystem usage grew in price as inscriptions surged.","Stacks’ stx (STX) token gained over 12% in the past 24 hours, outperforming the CoinDesk Market Index (CMI), which tracks the broader crypto market and gained just 1.2%.","Stacks is a layer 2 companion chain for smart contracts focused on bitcoin, allowing for the creation of related financial products. Crypto funds such as North Rock say Stacks offers several advantages over blockchain platforms such as Ethereum, including lower fees, faster transaction times and enhanced security.","Edited by Sheldon Reback."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"3 million","content":"MONEY"},{"type":"$137 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Bitcoin Request for Comment (BRC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"North Rock","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"CMI","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Ordinals","NFTs"],"authors":["Shaurya Malwa"]}