{"summary":"The implications of the CFTC’s lawsuit against Binance extend well beyond any civil action.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/03\/29\/that-binance-suit-sure-seems-bigger-than-just-a-cftc-case\/","publishDate":"2023-03-29T20:09:31","id":16122,"type":null,"title":"That Binance Suit Sure Seems Bigger Than Just a CFTC Case","category":["Policy"],"content":["Between Coinbase, Binance, Justin Sun, Do Kwon and Custodia, there has been just so much news over the last week. And that’s largely just the U.S. But Binance is the most interesting, not only for what happened (the Commodity Futures Trading Commission sued it), but also for what didn’t (the Department of Justice hasn’t filed anything). Plus, the CFTC’s Tech Advisory Committee met last Wednesday.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","The U.S. Commodity Futures Trading Commission (CFTC) sued Binance, the exchange’s founder Changpeng Zhao (CZ) and a couple other entities on Monday on charges of failing to register as a “futures commission merchant” while offering unregistered crypto derivatives options to U.S. customers.","The allegations are pretty striking, with details suggesting the company went out of its way to try to bypass U.S. regulations. CFTC Chief Counsel Gretchen Lowe described Binance’s actions as “willful evasion of U.S. law.” These are allegations that have yet to be proven in a court of law. In a statement Monday night, Zhao said the allegations are “an incomplete recitation of facts.”","The question remains: Is this actually a big deal for Binance? I’m going to speculate wildly, so consider this fair warning.","I think the answer is yes. Not for the CFTC charges themselves – the CFTC can impose monetary fines and bar Zhao from being an officer at a futures commission merchant in future but that assumes Zhao has any interest in being an officer to begin with.","The allegations in the CFTC’s complaint have strong implications for criminal and sanctions-related issues.","Some of the claims in the lawsuit, such as allegations that the exchange was aware that people from sanctioned entities such as Hamas, a Palestinian militant group, were trading on the platform but didn’t see it as a big deal, would probably trigger both Department of Justice and the Treasury Department’s Office of Foreign Asset Control laws.","“[Binance’s former Chief Compliance Officer Samuel] Lim explained to a colleague that terrorists usually send ‘small sums’ as ‘large sums constitute money laundering,” the filing said. “Lim’s colleague replied: ‘can barely buy an AK47 with 600 bucks.’ And with regard to certain Binance customers, including customers from Russia, Lim acknowledged in a February 2020 chat: ‘Like come on. They are here for crime.’ Binance’s [money laundering reporting officer] agreed that ‘we see the bad, but we close 2 eyes.’”","The CFTC complaint emphasized that Binance uses U.S. services to operate, pointing to Google Suite, Webex, WeWork and Amazon Web Services as examples.","“Among the services Binance purchases from Amazon Web Services that are provided to Binance in the United States is ‘AWS CloudFront,’ which according to Amazon Web Services is a ‘Global content delivery network,’” the filing said.","We’ve known for a while now that Binance used AWS servers in Japan after an outage affected the exchange a few years ago.","The final piece of this puzzle: We can look at how the Department of Justice has gone after companies and websites accused of distributing ransomware or offering “cyberattack-for-hire services” or even whatever the heck this was.","In those instances, the U.S. government was able to seize the domains and put up a large banner announcing that. The services themselves were inaccessible to their users.","All this is to say that if the U.S. really thought Binance was a criminal enterprise, it already has the tools it needs to shut down the exchange.","Now to be clear, I’m told there's nothing imminent coming from the Justice Department or Office of Foreign Asset Controls about Binance. But as we’ve seen with Terraform Labs founder Do Kwon and FTX founder Sam Bankman-Fried, sometimes the DOJ will have a sealed indictment that it won’t publish until the subject is arrested, and so we may now just be in a holding pattern.","Last week, the CFTC’s Technology Advisory Committee met for the first time under Commissioner Christy Goldsmith Romero, Chairwoman Carole House and Vice Chairman Ari Redbord.","“We look forward to taking a deep dive on the rapidly growing decentralized-finance (DeFi) ecosystem,” Goldsmith Romero said during her opening remarks. “As regulators and Congress make policy decisions related to DeFi, it is important to have a common foundation and understanding how DeFi works and how decentralized exchanges (DEXs) or other DeFi protocols [work].”","This foundation could be as basic as understanding what the indicators of decentralization are, she added, touching on other issues like the role of artificial intelligence in financial markets, digital identity and possible illicit activities in the digital sector.","The meeting was divided into presentations by various members interspersed by free-flowing discussions about issues surrounding regulatory questions in crypto (and other technology topics like artificial intelligence).","Different perspectives were all given equal weight by the different members of the committee, Goldsmith Romero told CoinDesk after the meeting ended, pointing to one participant who asked questions about the value crypto products brought the financial sector in a room full of crypto executives and researchers.","“People were very willing to contribute,” she said.","House said much of the discussion circled around the concept of accountability, which is at the heart of many of the topics discussed, whether that is privacy or decentralized finance or other issues.","“There has to be accountability, both for the regulated activity … but also for the non-financial activity that occurs,” she said.","Goldsmith Romero expressed a similar view during her opening remarks, saying there is discussion about where accountability rests within a DeFi project, whether it’s the code underpinning a smart contract, the organization responsible for bringing the code into the world, an evolving governance structure or something in between.","The forum saw a nuanced discussion about how different parties could achieve confidence in the technology around digital assets and other issues while still ensuring compliance with the law, Goldsmith Romero said after the meeting ended. “I’m glad to have that in this forum.”","There was much ado made the other week about New York Community Bancorp’s (NYCB) Flagstar Bank acquiring Signature Bank’s non-crypto deposits last Monday, leaving about $4 billion worth of deposits in the lurch. Coming on the heels of a Reuters report that the Federal Deposit Insurance Corp. (FDIC) would force any potential buyer of Signature to give up the crypto business (a report the FDIC denied), there was a growing wave of opinion that this was further evidence that bank regulators were trying to actively boot crypto off the banking system. As always, though, it’s possible things are a bit less conspiratorial than the public narrative seems.","Joshua Ashley Klayman, head of blockchain and digital assets at law firm Linklaters, pointed to 2021 guidance from the Office of the Comptroller of the Currency (OCC), one of the federal bank regulators, that told banks that they need permission before they can get into crypto-related activities. The regulator has already barred one new conditional bank from engaging with crypto when it approved SoFi in 2022, she said.","“It shouldn’t be a surprise that, as any bidding bank presumably would need OCC approval, that, if they didn’t already have OCC approval to engage in digital asset activities, they weren’t reasonably going to be able to obtain it over a weekend, even if they wanted to start doing crypto,” Klayman said.","The OCC indeed published a notice signing off on the Flagstar acquisition.","Klayman noted that “we don’t know if Flagstar even wanted to have a crypto business, or if it even had the capability to support one. But it almost certainly didn’t have the time to obtain regulatory approval to start one by Monday.”","Only 136 FDIC-insured banks in the U.S. even offer any kind of crypto activities or plan to, according to an FDIC Inspector General report from February. That’s out of 4,706 total FDIC-insured banks (as of the end of 2022).","The FDIC is now giving the remaining Signature Bridge Bank depositors until April 5 to withdraw their funds, or the regulator will send a check to the listed address. It’s also still trying to sell the Signet platform, a payments platform that was popular with Signature’s crypto customers.","This past weekend, the FDIC said that First Citizens Bank will acquire the deposits from Silicon Valley Bank. One detail that struck me: When the FDIC announced Flagstar’s takeover of Signature deposits, it explicitly said that Signature Bridge Bank depositors “other than cash depositors related to the digital-asset banking businesses, will automatically become depositors of” Flagstar.","No such language existed in the announcement of First Citizens’ takeover of SVB deposits. I reached out to the FDIC and First Citizens to confirm just what this meant. The FDIC referred me to First Citizens, which hasn’t responded.","Tuesday","Wednesday","Thursday","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!","Edited by Henry Bond."],"entity":[{"type":"CFTC’s Technology Advisory Committee","content":"ORGANIZATION"},{"type":"Goldsmith Romero","content":"PERSON"},{"type":"$4 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Signet","content":"ORGANIZATION"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"Zhao","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"February 2020","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Chairwoman Carole House","content":"ORGANIZATION"},{"type":"Henry Bond","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Signature Bridge Bank","content":"ORGANIZATION"},{"type":"Google Suite","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Treasury Department’s Office of Foreign Asset Control","content":"ORGANIZATION"},{"type":"Justice Department or Office of Foreign Asset Controls","content":"ORGANIZATION"},{"type":"Linklaters","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"April 5","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Gretchen Lowe","content":"PERSON"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Samuel] Lim","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"First Citizens Bank","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Tech Advisory Committee","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Signature Bridge Bank depositors","content":"ORGANIZATION"},{"type":"Webex","content":"ORGANIZATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"WeWork","content":"ORGANIZATION"},{"type":"New York Community Bancorp","content":"ORGANIZATION"},{"type":"last Wednesday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"AWS","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"First Citizens","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Klayman","content":"PERSON"},{"type":"Justin Sun","content":"PERSON"},{"type":"Joshua Ashley Klayman","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Custodia","content":"LOCATION"},{"type":"Ari Redbord","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"Flagstar","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Flagstar Bank acquiring Signature Bank","content":"ORGANIZATION"}],"hashtag":["Regulations","Newsletters","State of Crypto","Binance","CFTC","FDIC","Signature Bank","Silicon Valley Bank","OCC"],"authors":["Nikhilesh De"]}