{"summary":"A new European Parliament draft report on digital currencies calls for the creation of a task force specifically devoted to the technology.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2016\/02\/25\/european-parliament-report-proposes-task-force-on-digital-currencies\/","publishDate":"2016-02-25T18:22:46","id":16123,"type":null,"title":"European Parliament Report Proposes Task Force on Digital Currencies","category":["Markets"],"content":["A new European Parliament draft report on digital currencies calls for the creation of a task force specifically devoted to the technology.","The report, penned by European Parliament member (MEP) Jakob von Weizsäcker of the Committee on Economic and Monetary Affairs, seeks the establishment of a task force, with its own budget and dedicated staff, that would study digital currencies and provide policy advice to the European Union and member-states.","Further, the report calls for tightening regulation of both exchanges and wallet service providers – something the European Commission, the bloc’s executive arm, is already considering. At the same time, the European Council is also weighing digital currency regulation.","The publication of the report follows a hearing in late January during which MEPs discussed bitcoin and blockchain technology within the context of terrorist financing and money laundering.","Despite the calls for stronger rules in regards to digital currency activity, the report notes that the technology has \"the potential to contribute positively to consumer welfare and economic development\". It goes on to echo comments made by von Weizsäcker during the January hearing about avoiding burdensome regulation.","\"[The European Parliament] calls for a proportionate regulatory approach so as not to stifle innovation at an early stage, while taking seriously the regulatory challenges that the widespread use of [virtual currencies] and [distributed ledger technology] might pose,\" it states.","At the same time, the report seeks approval for what it calls \"rapid and forceful regulatory measures\", stating:","The Committee on Economic and Monetary Affairs is expected to vote on the report’s contents in April, and if approved, could move to the full Parliament for a vote as early as May.","The full report can be found below:","","Draft Report on Virtual Currencies",""],"entity":[{"type":"European Parliament","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"European Council","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Jakob von Weizsäcker","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Committee on Economic and Monetary Affairs","content":"ORGANIZATION"}],"hashtag":["Europe","Regulation","News","European Parliament"],"authors":["Stan Higgins"]}