{"summary":"Ledgers, the foundation of accounting, are as ancient as writing and money. Their medium has been clay, wooden tally sticks (that were a fire hazard), stone, papyrus and paper. Once computers became normalized in the 1980s and ’90s, paper records were digitized, often by manual data entry. These early digital ledgers mimicked the cataloguing and accounting […]","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-distributed-ledger\/","publishDate":"2022-02-14T19:54:55","id":16124,"type":null,"title":"What is a Distributed Ledger?","category":["Learn"],"content":["Ledgers, the foundation of accounting, are as ancient as writing and money.","Their medium has been clay, wooden tally sticks (that were a fire hazard), stone, papyrus and paper. Once computers became normalized in the 1980s and '90s, paper records were digitized, often by manual data entry.","\n","These early digital ledgers mimicked the cataloguing and accounting of the paper-based world, and it could be said that digitization has been applied more to the logistics of paper documents rather than their creation. Paper-based institutions remain the backbone of our society: money, seals, written signatures, bills, certificates and the use of double-entry bookkeeping.","Computing power and breakthroughs in cryptography, along with the discovery and use of some new and interesting algorithms, have allowed the creation of distributed ledgers.","In its simplest form, a distributed ledger is a database held and updated independently by each participant (or node) in a large network. The distribution is unique: records are not communicated to various nodes by a central authority, but are instead independently constructed and held by every node. That is, every single node on the network processes every transaction, coming to its own conclusions and then voting on those conclusions to make certain the majority agree with the conclusions.","Once there is this consensus, the distributed ledger has been updated, and all nodes maintain their own identical copy of the ledger. This architecture allows for a new dexterity as a system of record that goes beyond being a simple database.","Distributed Ledgers are a dynamic form of media and have properties and capabilities that go far beyond static paper-based ledgers. The short version is they enable us to formalize and secure new kinds of relationships in the digital world.","The gist of these new kinds of relationships is that the cost of trust (heretofore provided by notaries, lawyers, banks, regulatory compliance officers, governments, etc…) is avoided by the architecture and qualities of distributed ledgers.","The invention of distributed ledgers represents a revolution in how information is gathered and communicated. It applies to both static data (a registry), and dynamic data (transactions). Distributed ledgers allow users to move beyond the simple custodianship of a database and divert energy to how we use, manipulate and extract value from databases — less about maintaining a database, more about managing a system of record.","Authored by Nolan Bauerle; images by Maria Kuznetsov"],"entity":[{"type":"'90s","content":"DATE"},{"type":"Maria Kuznetsov","content":"PERSON"},{"type":"1980s","content":"DATE"},{"type":"Nolan Bauerle","content":"PERSON"}],"hashtag":["Beginner","Technology","Learn"],"authors":["Nolan Bauerle"]}