{"summary":"Crypto has major implications for economics, politics and culture, and is finding its way into a number of professors' courses.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/10\/01\/liberal-arts-colleges-show-the-inherent-interdisciplinary-nature-of-web3\/","publishDate":"2022-10-01T14:09:27","id":16127,"type":null,"title":"Liberal Arts Colleges Show the 'Inherent Interdisciplinary' Nature of Web3","category":["Consensus Magazine"],"content":["Professor Ricky Crano, formerly of Tufts University, is always amazed at how students' attention picks up when he brings up crypto.","“Everyone was coming at it pretty fresh and curious, uncertain what to make of it at the end of the day,” he said. They were reading primers on everything from Bitcoin to decentralized autonomous organizations (DAO), in the last week of his \"Science, Technology and Society\" seminar.","This article is part of CoinDesk's \"Education Week.\"","“Tufts was a special place for exploring [crypto] in the classroom, thanks to the hybrid liberal arts and strong computer science and engineering environment,” Crano said.","Studying blockchain and cryptocurrency goes hand-in-hand with a liberal arts education. Whether you’re an aspiring decentralized finance (DeFi) protocol developer, an artist minting paintings as non-fungible tokens (NFT) or a humanitarian curious about the promise of a disruptive monetary system to help the unbanked and underserved, the entry points for the crypto space span multiple disciplines.","Several liberal arts college professors are introducing these topics within their coursework across a variety of subjects.","At Amherst College, economics professor Neil White teaches a course called “Money and Banking” focused on how modern finance operates. From banks to regulators to inflation, White covers a broad range of topics surrounding economics. In the past year he has taught the course, he’s added crypto to the syllabus.","White includes a one-week crash course that covers the basics of bitcoin; he thinks it’s a solid place for a student to begin their journey into crypto, from the technology behind the blockchain to its use case as a method of payment.","“You have this electronic thing that can be traded and essentially traced through a public ledger. And we [study] that to compare and contrast it with the traditional monetary system for payment,” he said.","See also: Best Universities for Blockchain 2022","But it isn’t merely theoretical. While many of his students may end up with careers at JPMorgan or Goldman Sachs after graduation, a familiarity with crypto could help them distinguish themselves.","“The point is to not go into all the details about crypto, but more to give them a basic level of knowledge so that [students] can go out and learn about that stuff themselves, ” White said. In fact, he suspects a number of non-economic majors likely enroll in the course because of its crypto module.","Farah Qureshi, an anthropology professor at Colby College, teaches a course called “The Anthropology of Money” that spends time understanding the cultural aspects of crypto and other currencies. She takes an interdisciplinary approach to teaching, and the course attracts students interested in a number of subjects.","“The fact that I've even gotten that many people who are even signing up for the class, just literally only seeing surface level descriptions. It says a lot about how that education kind of needs to be out there, ” Qureshi said.","As a graduate student, Qureshi studied how crypto and mobile money systems could increase financial inclusion. She was particularly interested in bitcoin’s origins during the 2008 financial crisis. Money is often overlooked when studying anthropology, she said, but it impacts nearly every human institution.","As a part of the curriculum, students in Qureshi's course investigate a particular currency over the semester. One recent student who studies art history chose NFTs as her “currency” to research in the course.","“We have cultures looking at the history of repeating savings and credit associations … we also look into cultures of mobile money, as well as just the way that technological appropriations have been pushed through,” Qureshi said.","Crano said Science, Technology and Society (STS) focuses on how technological advancements have reshaped human society.","He noted that while crypto is still nascent, it could also have its effects though what that will be is less understood. But there’s an appetite and an interest among his students, he said.","When Crano taught his course “Reading Lab: Automation” online in the fall of 2020, he left the last two weeks of the course open-ended, allowing students to elect from a batch of readings what they would most like to talk about.","In his course, Crano’s students read Satoshi Nakamoto’s white paper introducing the Bitcoin system and a chapter of “Blockchain and the Law: The Rule of Code” by Aaron Wright and Primavera De Filippi that covered DAOs.","Crano chose these readings because of the blockchain’s ability to automate accounting and community governance, as well as having a personal interest in cryptocurrency as a whole in the broader world of technological developments.","“As a media technology and digital culture researcher, scholar and educator, I always try to keep an ear to the ground,” he said. “Also as a perennial kind of Marxist skeptic, I would say in a very loose sense I’m always trying to find things to demythologize.”","He said that STS allowed crypto to be demythologized; rather than studying the advanced technology that comprises the blockchain, look at its societal implications.","See also: Ranking Blockchain Universities Is Answering the Wrong Question | Opinion","Crano also noted that taking an STS approach to studying cryptocurrency helped put ideas in practice because of its “inevitable entanglements of technology with politics and law and baked-in structures of social inequality.”","Crypto education is permeating the liberal arts through several disciplines. It’s a subject that touches many areas of educational interest, including money, politics, culture and more. And, perhaps, rather than liberal arts colleges offering one major to study crypto, an \"interdisciplinary approach\" is what will help perpetuate the eventual mass adoption of Web3."],"entity":[{"type":"Neil White","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"White","content":"ORGANIZATION"},{"type":"end of the day","content":"TIME"},{"type":"2008","content":"DATE"},{"type":"Tufts University","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Colby College","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Aaron Wright","content":"PERSON"},{"type":"Farah Qureshi","content":"PERSON"},{"type":"Amherst College","content":"ORGANIZATION"},{"type":"CoinDesk's \"Education Week","content":"ORGANIZATION"},{"type":"Qureshi","content":"PERSON"},{"type":"STS","content":"ORGANIZATION"},{"type":"Ricky Crano","content":"PERSON"},{"type":"fall of 2020","content":"DATE"},{"type":"Qureshi","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Crano","content":"PERSON"}],"hashtag":["Education Week","Education","Web3"],"authors":["Cam Thompson"]}