{"summary":"The fundamentals of investing give an answer, and the impact from BTC ETFs from the likes of BlackRock and Fidelity could be huge.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/12\/06\/why-are-pros-craving-a-spot-bitcoin-etf\/","publishDate":"2023-12-06T16:45:00","id":16133,"type":null,"title":"Why Are Pros Craving a Spot Bitcoin ETF?","category":["Finance"],"content":["Gradually, then suddenly, as they say, bitcoin (BTC) is becoming mainstream. The biggest asset managers in the world like BlackRock and Fidelity have lined up to launch a spot bitcoin ETF in the U.S. Based on the Grayscale Bitcoin Trust's NAV discount, which has narrowed dramatically, the market assigns a probability of around 90% that the Securities and Exchange Commission will approve such a vehicle.","But why is there such a big need for a spot bitcoin ETF in the first place, especially since there are already futures-based bitcoin ETFs?","As a starter, BTC futures ETFs have many drawbacks compared to a spot-based product, including high roll costs that can eat up to 30 percentage points (!) of the annual performance if the bitcoin futures curve exhibits a steep contango.","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","In plain English: If bitcoin futures are priced significantly higher than today's spot price, bitcoin futures investors surrender a large chunk of their performance. Hence, the full performance benefits of holding bitcoin do not come to fruition when investing into a futures-based product.","Broadening investment access to bitcoin and other crypto assets can open up a whole new universe of potential portfolio allocations that were not possible before.","In portfolio managers' parlance: Investments into bitcoin significantly enlarge the so-called \"efficient frontier\" of possible multi-asset portfolios.","The efficient frontier represents all the potential portfolios displayed in a return-risk diagram based on varying weights of the different asset classes. For instance, one dot represents a portfolio that invests X% into equities, Y% into bonds and the rest into bitcoin.","Portfolio managers want to be at the very edge of that frontier since they receive the highest possible return for the lowest possible risk.","For illustrative purposes only. Source: ETC Group.","The black cloud of dots represents the universe of potential portfolios based on traditional asset classes only. The green cloud represents the whole new universe of potential portfolios when adding bitcoin. As you can see, the addition of crypto assets like bitcoin greatly expands things.","Thus, it is not surprising that including bitcoin in a classic 60\/40 stock-bond multi-asset portfolio has led to a significant increase in risk-adjusted returns (\"Sharpe Ratio\") in the past with only a minor increase in portfolio drawdowns.","For illustrative purposes only. Source: ETC Group.","When these spot bitcoin ETF applications will ultimately be approved is still uncertain, although the consensus expects a batch approval most likely in January.","These prospective bitcoin ETF issues have a significant amount of assets under management (we estimate around $16 trillion), so they could have a huge impact on crypto. If only a small percentage of that amount gets invested into bitcoin, the effect would most likely be very significant because, currently, bitcoin exchange-traded products only amount to $38.8 billion of assets, based on our calculations (including Grayscale's trust).","But this capital won't be invested overnight. It will probably take many months before investors start replacing parts of their traditional asset allocations with bitcoin.","Gradually, then suddenly, as they say.","Edited by Nick Baker."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Y%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"X%","content":"PERCENT"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"$16 trillion","content":"MONEY"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"$38.8 billion","content":"MONEY"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Sharpe Ratio","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto Long & Short","BlackRock","Fidelity","Grayscale Bitcoin Trust","Portfolio management","Bitcoin ETF"],"authors":["André Dragosch"]}