{"summary":"When the tech hub of Europe meets a society that prizes financial autonomy, the result is a crypto community that practices the very decentralization it preaches. Case in point: Blockchain Week Berlin, the flagship annual conference of the No. 10 spot in CoinDesk’s Crypto Hubs 2023, is a self-organized, crypto-agnostic community initiative.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/27\/berlin-the-center-for-decentralized-finance-and-techno-music\/","publishDate":"2023-06-27T11:30:10","id":16139,"type":null,"title":"Berlin: The Center for Decentralized Finance – and Techno Music","category":["Consensus Magazine"],"content":["Berlin had a strong showing in crypto regulatory structure and crypto adoption, which make up the drivers, the most heavily weighted category in CoinDesk’s rubric. Against this sample of 25 mostly high-performing and economically well-developed hubs, however, the German capital rated solidly in the middle of the pack in the opportunity scores that measure per-capita crypto jobs, companies and events, and enabler scores including ease of doing business and digital infrastructure.","For more on the criteria and how we weighted them, see: How We Ranked CoinDesk’s Crypto Hubs 2023: Our Methodology.","Berlin’s crypto scene may not be as famous as the city’s techno music, nightlife or architecture but its quiet influence on decentralized finance (DeFi) is undeniable. If the city were a painting, several brushstrokes trace the beginnings of Ethereum, with Berlin even playing host to the first ever Ethereum developers’ meetup DEVCON 0 in 2014, just months before the blockchain went live. Kreuzberg district’s Room 77 was the first bar in the world to accept bitcoin (BTC) as payment.","Since those early days of crypto, Germany’s capital – which was already a tech hub in its own right with Google and Facebook having opened offices in the city – has been a big draw for the blockchain-inclined, Patrick Hansen, director of EU strategy and policy at stablecoin issuer Circle, said.","Read Crypto Hubs 2023: Where to Live Freely and Work Smart","Hansen moved to Berlin in 2017 and quickly became an influential voice in blockchain policy in Europe just as Germany emerged as one of the first countries in the world to make a serious go of regulating crypto. He said the city’s crypto scene is “decentralized,” aptly reflecting its community favoring source code and core infrastructure over big centralized exchanges or custodians.","“There's … the Berlin Blockchain Week, by far the biggest conference, but even that is very decentralized. It's not one main event, but it's like hundreds of events that take place during the same week,” Hansen said. According to its website, “Blockchain Week Berlin is a decentralized community-organized initiative. There is no single owner. It is an agnostic movement based on the premise that self-organization is the backbone of the ecosystem.”","Aside from the flagship event, in Berlin, there is something for any kind of blockchain aficionado (DeFi, CeFi, NFTs – you name it!) with opportunities for diversity and growth, Santiago Abraham, association manager at BerChain, a member-led nonprofit that supports and promotes Berlin’s crypto community, said.","“The community is really decentralized,” Abraham echoed Hansen, adding that in any given week, there’s a myriad of blockchain-focused meetups, events and your pick of spaces to work from or hold friendly gatherings over drinks – called “Stammtisch.”","Berlin resident and crypto veteran Julian Grigo said he chose to move to the city because “it's such a livable, vibrant city, the most international, the most culturally interesting.” For techno music and partying, Berlin is still the place to go, Grigo said. “This kind of flavor Berlin has is different to many other cities in Europe.” Hansen added that Berlin’s cost of living is still favorable compared to other cities in the region, which are suffering from rising food and energy prices.","For Grigo, Berlin’s crypto scene reflects a broader appreciation in Germany for crypto’s promise of financial security and autonomy. Surveillance under East Germany’s “Stasi” secret police during Cold War times is still in the nation’s collective memory, Grigo said. That and a general fear of hyperinflation has left the country’s population somewhat amenable to crypto.","This national sentiment may be one more factor that allows projects that call Berlin home – from regulated DeFi platforms like Swarm to privacy-preserving portfolio tracking app Rotki – to thrive, and what helps to draw talented developers from all over the world to Berlin-native conferences like ETHBerlin and Dappcon, organized by GnosisDAO, which builds decentralized infrastructure for Ethereum.","\"Why Berlin and not Munich or Frankfurt? After all those are the German financial centers, right? Frankly ... I don't think this could have happened there,\" Lefteris Karapetsas, the creator of Rotki, said. Karapetsas, who says he was at the Ethereum office on Waldermarstr street in 2015 when the mainnet was launched, added that \"Berlin has the unique combination of talent, crazy, passion, dirty and even ugly stuff that combined together make it the capital of crypto for Europe.\"","Grigo also noted that Germany is only behind the U.S. globally in terms of the number of Bitcoin nodes and Ethereum validators hosted despite having one-fourth of the population.","“I think this is a strong indicator that crypto is very deeply rooted in Germany,” Grigo said. “And the heart of the German tech scene, and also its crypto scene, is definitely Berlin.”"],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Grigo","content":"PERSON"},{"type":"“Blockchain Week Berlin","content":"LOCATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Hansen","content":"PERSON"},{"type":"Munich","content":"LOCATION"},{"type":"Frankfurt","content":"LOCATION"},{"type":"Germany","content":"LOCATION"},{"type":"Patrick Hansen","content":"PERSON"},{"type":"Work Smart","content":"LOCATION"},{"type":"Stasi","content":"ORGANIZATION"},{"type":"East Germany","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Julian Grigo","content":"PERSON"},{"type":"Berlin Blockchain Week","content":"LOCATION"},{"type":"Lefteris Karapetsas","content":"PERSON"},{"type":"Rotki","content":"LOCATION"},{"type":"Kreuzberg","content":"LOCATION"},{"type":"Santiago Abraham","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Features","Crypto Hubs 2023","Berlin","DeFi","Decentralized Finance"],"authors":["Sandali Handagama"]}