{"summary":"Real CoinDesk journalists don't ask for money. Also, please be wary of links sent from people claiming to work for us.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/05\/warning-scammers-are-pretending-to-be-coindesk-journalists-on-social-media\/","publishDate":"2024-02-05T15:10:13","id":16136,"type":null,"title":"Warning! Scammers Are Pretending to Be CoinDesk Journalists on Social Media","category":["Finance"],"content":["Scammers are pretending to be CoinDesk journalists on social media and elsewhere. Be careful.","Real CoinDesk journalists reach out to strangers all the time as they attempt to find, substantiate and write stories. So, getting cold-called is not, per se, a sign of trouble.","But real CoinDesk journalists don't ask to be paid to write stories.","Scammers are also impersonating CoinDesk journalists on social media to send phishing links to investors and companies. This frequently happens on X (formerly Twitter); a scammer might DM you to request an \"interview\" and then send a malicious link that looks like it's from Calendly, the scheduling app, but is in fact from a different domain.","Before you click on any links, it's best to check the URL to make sure it comes from the correct domain (e.g. \"calendly.com\").","If you have been contacted by someone saying they're from CoinDesk, check out our masthead, which lists all of our reporters and editors by name (along with contact info and social media handles). If the person reaching out isn't listed there, or if they are contacting you from a social media handle that's different from what's listed on the masthead, then they're not a CoinDesk employee.","We do frequently publish third-party contributors. But if the person contacting you claiming to be a CoinDesk writer isn't listed in the masthead, be wary.","When in doubt, reach out to a CoinDesk employee – get their contact info from the masthead – to see if a query is legit.","CoinDesk isn't the only media organization whose journalists are being impersonated. And this isn't the first time CoinDesk journalists have been targeted.","Flashback to 2020: Don't Fall for It: Scammers Are Impersonating CoinDesk Staff on Social Media","We don't want you to get snagged in a scheme. (But please speak with our real journalists! It's how our award-winning journalism gets done.)","Bottom line: If the situation doesn't feel right, take your time.","Edited by Marc Hochstein and Sam Kessler."],"entity":[{"type":"Marc Hochstein","content":"PERSON"},{"type":"Calendly","content":"LOCATION"},{"type":"Sam Kessler","content":"PERSON"}],"hashtag":["Journalism","Phishing","Phishing Scam"],"authors":["Nick Baker"]}