{"summary":"Chainlink said it is helping Belgium-based SWIFT make token transfers and communicate across all blockchain environments.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/swift-is-partnering-with-chainlink-heres-the-down-low-on-the-blockchain-data-provider\/","publishDate":"2022-11-02T21:22:09","id":16146,"type":null,"title":"SWIFT Is Partnering With Chainlink: Here’s the Down-low on the Blockchain Data Provider","category":["Learn"],"content":["SWIFT and Chainlink’s “love story” began years ago when Sergey Nazarov, Chainlink’s co-founder, won its blockchain start-up competition.","“You were actually one of the first startups that we bet on,” Strategy Director Jonathan Ehrenfeld Solé of SWIFT, which executes financial transactions and payments between banks worldwide, told Nazarov at this year's SmartCon. Now their partnership could ensure that blockchain becomes an integral part of the financial system.","Chainlink announced recently it is helping Belgium-based SWIFT make token transfers and communicate across all blockchain environments.","“That'll accelerate the adoption of DLT [distributed ledger technology] blockchains and benefit various institutions all over the capital markets,\" Nazarov said at the conference.","So what is this significant protocol all about?","Read more: SWIFT Partners With Crypto Data Provider Chainlink on Cross-Chain Protocol in TradFi Play","The protocol’s mission is to help enable the creation of innovative smart contracts and decentralized, peer-to-peer applications that can be used by different types of enterprises across the globe, plus improve the way people access blockchain technology. An example of this is its network of oracles that enable the decentralized Web3 ecosystem to access data sources like weather information.","Chainlink Labs was founded in 2014, under the name SmartContract.com, a blockchain technology startup. Steve Ellis, Ari Juels and Sergey Nazarov published a white paper on Chainlink in September 2017. Nazarov’s track record with crypto technology dates back to 2011.","Steve Ellis also co-founded a crypto company in 2014 called the Secure Asset Exchange, and was a software engineer before that. Meanwhile, Ari Juels is a faculty member at Cornell Tech in New York and co-director of the Initiative for CryptoCurrencies and Contracts (IC3). He is currently the chief scientist at Chainlink Labs.","Chainlink operates on Ethereum Virtual Machine-based (EVM) chains that can execute smart contracts such as Ethereum, Binance Smart Chain, Polygon, Avalanche Mainnet and Fantom, Marc Arjoon, research associate at digital asset management firm CoinShares said in an interview with CoinDesk. It also supports non-EVM chains like Solana. Chainlink does not have its own blockchain.","Chainlink is working with SWIFT on a proof-of-concept (PoC), where it is exploring using the protocol's cross-chain interoperability protocol (CCIP) to help the interbank network communicate and transfer tokens across all blockchain environments. SWIFT is an interbank messaging system that connects to banks and enables cross-border payments.","The CCIP allows smart contracts, which are tools that can automatically execute functions after certain criteria is met, to communicate across multiple blockchains. Developers can easily build applications on top of it.","“So from SWIFT’s side, it becomes a lot more powerful because instead of just messaging, it can do settlements as well now, not directly but through the blockchain,” Arjoon said. Typically SWIFT just delivers the information from banks for example, while the banks handle the actual settlement.","Chainlink has 47% of the total value secured by all oracles, while the rest is distributed across competitors like WINKLink (17.45%). This made it the perfect candidate for a collaboration like this.","\"It's ... [partly] first mover's advantage ... they pioneered this space,\" Arjoon said of SWIFT. There is also “undeniable interest” in crypto from institutional investors, SWIFT’s Solé said at the conference.","SWIFT, an international cooperative owned by member financial institutions, is well positioned to lead the charge in putting more assets on-chain. Its partnership with Chainlink allows banks to test the waters with blockchain technology without triggering undue regulatory scrutiny.","“If banks wanted to interact with blockchains, without using SWIFT, without using Chainlink, that would take years and a lot of overhead costs and there's a lot of regulatory oversight,” Arjoon said. Whereas together they can combine their networks.","\"We connect to 11,000 banks, [Chainlink] connects to 15 blockchains,” Solé said at the conference. “Then you have these two infrastructures that are secure, that are reliable, that are scalable, that can actually work so that you can buy an asset wherever you want, and you can transact it in whatever country.”","It provides data feeds. This enables companies to connect smart contracts with real world data such as asset prices and reserve balances.","For example, if Compound, a decentralized finance (DeFi) lending protocol, wants to get the price of a token, it would contact Chainlink’s oracle. On the back end, different exchanges would submit data to the oracle and Chainlink would combine these messages, Arjoon said.","Chainlink has also developed a programmable token bridge built on the CCIP that enables developers to transfer tokens across blockchain networks. It has an automation service, a verifiable source of randomness for smart contract developers (like a random number generator), and a way to monitor reserves. It sets out where the protocol is going in its 2021 white paper.","Chainlink has its own coin, called LINK, an Ethereum token that drives Chainlink’s decentralized oracle network.","The Chainlink network uses LINK to pay its node operators (run by people) a reward to retrieve data from off-chain data feeds and then delivering that data on-chain to the smart contract, its white paper said. You need LINK to pay for Chainlink’s services. Node operators are the entities that are responsible for running Chainlink's hardware and software and monitoring the network. They also watch out for incoming data requests from smart contracts.","Soon, Chainlink will upgrade so that LINK can be staked on its platform and rewards can be retrieved to help secure its oracle services. The project will be underway by December.","Read more: SWIFT Says It's Proved It Can Be the Way Forward for Global CBDCs","CORRECTION (Nov. 3, 14:38 UTC): This article has been updated to correct key facts about Chainlink and its operations.","\n"],"entity":[{"type":"2014","content":"DATE"},{"type":"Compound","content":"ORGANIZATION"},{"type":"CCIP","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"Jonathan Ehrenfeld Solé","content":"PERSON"},{"type":"Solé","content":"PERSON"},{"type":"Steve Ellis","content":"PERSON"},{"type":"Cornell Tech","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Ari Juels","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Chainlink Labs","content":"ORGANIZATION"},{"type":"Secure Asset Exchange","content":"ORGANIZATION"},{"type":"Belgium","content":"LOCATION"},{"type":"17.45%","content":"PERCENT"},{"type":"September 2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Nazarov","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"\" Nazarov","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Marc Arjoon","content":"PERSON"},{"type":"Nov. 3","content":"DATE"},{"type":"Sergey Nazarov","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"SWIFT Partners With Crypto Data Provider Chainlink","content":"ORGANIZATION"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Arjoon","content":"PERSON"}],"hashtag":["Learn","Chainlink","Chainlink Labs","SWIFT","Blockchain","Crypto","Beginner","Technology"],"authors":["Camomile Shumba"]}