{"summary":"A specialist in white-collar criminal defense weighs in on the key elements at play in Sam Bankman-Fried&#x27;s criminal trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256422\/manchild-sbfs-defense-is-struggling-in-fast-moving-trial-says-former-assistant-us-attorney","publishDate":"2023-10-14T12:05:04","id":1614,"type":null,"title":"&#x27;Manchild&#x27; SBF&#x27;s defense is struggling in fast-moving trial, says former Assistant US Attorney","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">So far a no-nonsense judge and a rapid-paced trial has provided few openings for Sam Bankman-Fried's defense attorneys.<\/span>","<span data-v-f87c67ca=\"\">Instead, throughout the trial's second week, the prosecutors appear to have had a lot of success casting the former \"manchild\" billionaire as the ringleader responsible for the disastrous collapse of FTX, according to former <\/span><span data-v-f87c67ca=\"\">Assistant U.S. Attorney Kevin J. O'Brien, who's now a specialist in<\/span><span data-v-f87c67ca=\"\"> white-collar criminal defense.<\/span>","<span data-v-f87c67ca=\"\">\"Every defense lawyer looks for a toehold in reasonable doubt, just something they can argue to the jury, and it's very hard to see how that's going to materialize here,\" said the lawyer who is now a partner at <\/span><span data-v-f87c67ca=\"\">Ford O'Brien Landy LLP.<\/span><span data-v-f87c67ca=\"\"> \"It seems to me this is a very difficult chore for the defense.\"<\/span>","The trial is expected to last around six weeks, so there's still a lot more to come — including the defense's opportunity to take charge and present its version of events.&nbsp;","<span data-v-f87c67ca=\"\">\"They'<\/span><span data-v-f87c67ca=\"\">ve got to find some toehold moving forward. They have to catch one of the witnesses in a lie or self-dealing that they then tried to cover up,\" added O'Brien, who spoke with The Block as the second week of the trial drew to a close on Friday. \"Something where it was in their interest to blame Bankman-Fried for something he didn't do.\"<\/span>","<span data-v-f87c67ca=\"\">So far a major advantage for the prosecution, according to O'Brien, has been the strength of its multiple key witnesses — most notably Caroline Ellison, a former top Bankman-Fried lieutenant and former CEO of Alameda Research — who by cooperating in pleading guilty to criminal charges have made their testimony somewhat irreproachable.<\/span>","<span data-v-f87c67ca=\"\">\"That's a very hard witness to cross examine. Someone who admits their guilt and takes a counter to felony indictment and awaits sentencing and gets up and testifies 'Mr. Bankman-Fried did the following but I was in on it too and accepting my own guilt,'\" said O'Brien. \"I mean how do you cross examine someone like that? It's not as if they are trying to shift the blame to someone else.\"<\/span>","<span data-v-f87c67ca=\"\">So far, no witness has been more damning than Ellison, who has painted Bankman-Fried as being, for the most part, fully aware that he was crossing both ethical and legal lines, according to O'Brien.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"She’s been candid about her own guilt,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Already through the second of an estimated six weeks of trial, it's easy to think that the case is hurtling toward a conviction, partly because it is moving so fast, suggested O'Brien, who said a brisk pace generally benefits the prosecution.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He said a jury can begin to get fatigued in longer trials as minds start to wander.<\/span>","<span data-v-f87c67ca=\"\">\"The trial is moving fast,\" he added, noting that in cases where hearings move slowly, jurors often<\/span><span data-v-f87c67ca=\"\"> \"start to speculate about things that aren't in evidence. They find one defendant that they like and they look for all the reasons to acquit him and sometimes they do.\"<\/span>","<span data-v-f87c67ca=\"\">Although he hasn’t been in the courtroom watching the trial, O'Brien believes that Bankman-Fried has done little to cast himself in a new light that might bolster his defense.<\/span>","<span data-v-f87c67ca=\"\">\"It's almost like he's a manchild or something. How you present that to a jury is subtle. When you think about it, it's not strictly speaking a defense. I'm not even sure [Judge] Kaplan would allow them to lean on this argument. But it is a way to convey to a jury that this guy is not all there.\"<\/span>","<span data-v-f87c67ca=\"\">Oftentimes in the defense's cross examination of key witnesses for the prosecution, Bankman-Fried's lawyers appeared to be setting up a deeper exploration of a specific topic only to then quickly move on before scoring any points.<\/span>","<span data-v-f87c67ca=\"\">This and other decisions have led to speculation surrounding the defense attorneys' seemingly ineffective strategy, with some wondering if Bankman-Fried's lawyers are already looking ahead to a possible appeal. And while that might be the case, O'Brien doesn't think that would cause Bankman-Fried's team to hold back.<\/span>","<span data-v-f87c67ca=\"\">\"Even if you have cards up your sleeve for appeal, it doesn't preclude you from defending the case vigorously in the hopes you won't have to rely on an appeal,\" he said, adding that a clear reason for appeal doesn't appear to have emerged thus far.<\/span>","<span data-v-f87c67ca=\"\">If Bankman-Fried's lawyers do launch an appeal at a later date, however, they might claim the difficulty of preparing for the case hampered their ability to properly defend their client, said O'Brien.<\/span>","<span data-v-f87c67ca=\"\">\"The one thing that surprised me is he didn't let Bankman-Fried out of jail in the months before the hearing so he could properly prepare for the case with his lawyers,\" said O’Brien. \"It’s very hard to sit down with your lawyer and have intimate discussion about the facts of a case … when you're sitting in a stark room in a federal facility with guards posted inside and out and limited time.\"<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Kevin J. O'Brien","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Ford O'Brien Landy LLP","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"] Kaplan","content":"PERSON"},{"type":"O'Brien","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["RT Watson","The Block"]}