{"summary":"The network said funds are safe and unaffected.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/10\/05\/blockstreams-liquid-network-faces-delay-in-processing-as-transactions-begin-to-stack-up\/","publishDate":"2021-10-05T02:50:17","id":16148,"type":null,"title":"Blockstream’s Liquid Network Faces Delay in Processing as Transactions Begin to Stack Up","category":["Finance"],"content":["Liquid, a sidechain-based settlement network operated by bitcoin infrastructure firm Blockstream, is facing issues processing transactions.","The network’s mempool – a chamber where all valid transactions wait to be confirmed by the Bitcoin network – is beginning to fill as each transaction awaits processing. The last transaction occurred over four hours ago, according to Liquid’s web page.","Liquid said it was aware of an issue on its network that related to “block signing” because of a recent “functionary upgrade,” according to a tweet late Monday.","On Tuesday, the Liquid Network Oversight Board issued a detailed statement saying that the problems arose from the planned hard fork upgrade to the Dynamic Federation feature to the Liquid network. The statement said that developers quickly delivered a fix for the issue, and 10 of the 15 functionaries have already deployed the patched Liquid software.","Block production ie expected to resume within the next 24 hours, as soon as additional network functionaries can upgrade their nodes, according to the statement.","Block signing is a type of digital signature used to verify the authenticity of transactions on a blockchain.","While not nearly as popular as other non-bitcoin platforms, Liquid has 3,291 Liquid Bitcoin (L-BTC) in circulation and sees roughly 500 transactions processed on the network each day, according to Liquid’s web page.","L-BTC is an asset that claims to be verifiably backed 1-to-1 with bitcoin held by the Liquid Federation on the Bitcoin mainchain.","The Liquid network was launched in 2018 after three years in the making, and at the time, it touted the potential to carry large volume of transactions at a higher speed for several of bitcoin’s largest companies.","Read more: Blockstream Raises $210M, Acquires Mining Chip Manufacturer Spondoolies","UPDATE (Oct. 5, 20:05 UTC): Updated with details of statement from the Liquid Network Oversight Board on Tuesday."],"entity":[{"type":"Oct. 5","content":"DATE"},{"type":"Blockstream","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Liquid Federation","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Dynamic Federation","content":"ORGANIZATION"},{"type":"Acquires Mining Chip Manufacturer Spondoolies","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$210M","content":"MONEY"},{"type":"Liquid Network Oversight Board","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Liquid","Sidechains","Blockstream","Bitcoin"],"authors":["Sebastian Sinclair"]}