{"summary":"The fund, called zVentures Web3 Incubator, will leverage its expertise to grow early-stage projects building blockchain-based gaming infrastructure.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/04\/11\/gaming-tech-company-razer-introduces-web3-venture-fund\/","publishDate":"2023-04-11T21:48:41","id":16143,"type":null,"title":"Gaming Tech Company Razer Introduces Web3 Venture Fund","category":["Web3"],"content":["Gaming technology company Razer is tapping into Web3 by rolling out an investment fund to support blockchain-based games and developers.","Called zVentures Web3 Incubator (ZW3I), the fund plans to identify and invest in promising early-stage Web3 gaming projects. Using its expertise and network, it will focus on enhancing the gamer experience through games that are fun to play, provide a sound roadmap and are backed by an established team.","Lawrence Lin, director of blockchain at Razer, said in a press release that zW3I will be able to not only support emerging projects but also pave the way for mass adoption within the broader gaming industry.","“The gaming experience is the most important aspect of any successful game launch,” said Lin. “With blockchain technologies and support from companies with strong gaming knowledge, we are certain that Web3 will revolutionize this experience for all.”","ZW3I-funded companies will be able to access Razer’s marketing and partnership resources, as well as zVentures’ Web3 partners including leading gaming investment firms Animoca Brands and Griffin Gaming Partners, and software company Amazon Web Services, among others.","\"The future of Web3 gaming holds immense promise, as it has the potential to revolutionize the gaming industry by empowering players to truly own and monetize their in-game assets,\" Lin told CoinDesk.","Despite the ongoing lull in the crypto market, large amounts of capital continue to be invested in Web3 gaming. In May 2022, crypto investment firm a16z said it would dedicate $600 million to invest in the growing blockchain-based gaming sector. Last week, gaming-focused VC firm Bitkraft raised over $220 million for a “token fund” to continue to invest capital into Web3 gaming."],"entity":[{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Lawrence Lin","content":"PERSON"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$220 million","content":"MONEY"},{"type":"Razer","content":"ORGANIZATION"},{"type":"Griffin Gaming Partners","content":"ORGANIZATION"}],"hashtag":["Web3","Web3 gaming","Funding"],"authors":["Cam Thompson"]}