{"summary":"The Ethereum co-founder has warmed up on the potential intersection between AI and crypto, though he warns developers to be careful.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/01\/30\/vitalik-buterin-says-developers-should-tread-carefully-mixing-crypto-and-ai\/","publishDate":"2024-01-30T20:41:25","id":16153,"type":null,"title":"Vitalik Buterin Says Developers Should 'Tread Carefully' Mixing Crypto and AI","category":["Technology"],"content":["AI has stolen some of crypto's luster over the past year: a Silicon Valley obsessed with Web3 and the Metaverse seems to have turned its attention entirely towards large language models and apps like ChatGPT.","Some blockchain projects have tried to take advantage of the new AI hype, but while crypto startups like Worldcoin, the identity firm from OpenAI founder Sam Altman, have found use cases that straddle both worlds, many AI-flavored crypto projects tend to feel like they're more buzz than substance.","Whatever the potential pitfalls, according to Ethereum co-founder Vitalik Buterin, the intersection between crypto and AI still holds promise. In a blog post released on Tuesday, Buterin delivered his thoughts on where crypto and AI tech might collide in the coming years, though he also took care to warn that there might be challenges.","Using the analogy of a \"game,\" Buterin divided the potential overlaps between AI and blockchain into four distinct categories.","The most \"viable\" category, according to Buterin, contains applications where AI acts as \"a player in a game.\" At a high level, this category captures apps where \"the ultimate source of the incentives comes from a protocol with human inputs.\" An example of this would be a prediction market: AI can be used to predict the outcome of a given event, and a blockchain-based mechanism can enforce the rules around how much the AI (or the person operating it) should be rewarded or penalized based on its guess.","The next category, which Buterin tags as \"high potential, but with high risks,\" includes applications where AI acts as an \"interface to the game.\" In these applications, AI is used to help users \"understand the crypto world around them\" and ensure their behavior \"matches their intentions.\" Buterin gives the example of scam-detection features, like the one used in the MetaMask crypto wallet to warn users if they might be interacting with a deceptive application. Such features could be \"super-charged\" by AI's enhanced detection and explanatory capabilities.","The third category defined by Buterin describes apps where AI dictates the \"rules of the game.\" \"Think 'AI judges,'\" he explained, warning that one should \"tread very carefully\" when exploring this problem space. An obvious crypto use-case here would be to help DAOs, or decentralized autonomous organizations, make subjective decisions using AI.","Buterin's fourth category for the potential intermarriage of AI and crypto includes use cases where AI is the \"objective of the game.\" This \"longer-term\" category involves using blockchains as infrastructure for building better AI models.","While Buterin says he is more optimistic than he once was about the intersections between AI and crypto, he does see potential challenges with balancing the transparency of crypto with the customary opaqueness of \"black box\" AI systems: \"In cryptography, open source is the only way to make something truly secure, but in AI, a model (or even its training data) being open greatly increases its vulnerability to adversarial machine learning attacks.\"","At the end of his post, Buterin issues a warning to developers: \"It is worth treading carefully.\"","Edited by Bradley Keoun."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Buterin","content":"LOCATION"}],"hashtag":["Buterin","AI","Vitalik Buterin","Ethereum"],"authors":["Sam Kessler"]}