{"summary":"A drop in crypto prices doesn’t mean the new financial ecosystem they represent isn’t moving forward. Here’s what you can do with your practice in the meantime.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/03\/17\/what-advisors-can-do-during-a-bear-market\/","publishDate":"2022-03-17T12:50:00","id":16155,"type":null,"title":"What Advisors Can Do During a Bear Market","category":["Markets"],"content":["Financial service professionals got really excited in 2021. For many of us there was a new asset class called crypto, and it had all the makings of an explosive new niche.","Crypto offered new technology with intriguing narratives. There were easy on-ramps for retail investors, many of whom took it upon themselves to start investing. It included the allure of younger investors and celebrities.","This article originally appeared in Crypto for Advisors, CoinDesk’s weekly newsletter defining crypto, digital assets and the future of finance. Sign up here to get it in your inbox every Thursday.","We saw so much hype and media attention, huge price appreciation to all-time highs and all new memes, heroes and villains.","Then the prices stopped going up and they fell – sometimes violently. The advisors who helped clients invest were now fielding questions about the value and wondering if they had made a mistake.","Was it all too much hype? Are we just in a bear market? And how do advisors talk to clients about crypto now?","When the prices drop, the naysayers and told-you-soers make their opinions known. This is a great time for advisors to evaluate, or re-evaluate, crypto as a part of their practice. How do you go about this determination?","You may have gotten a quick education on bitcoin (BTC) last year, just so you could hurry and get your clients invested. Of course, all those quick investment theses were easy and made sense when everything was moving up.","Now is a good time to learn more about many of the new subjects pertaining to digital assets.","These include security and safety of wallets and custody as well as security of the underlying networks. You can also learn about some of the upcoming changes to networks like Bitcoin, so you’re prepared to better understand some of the potential demand.","The world, and therefore macroeconomic factors, is always in flux, and the world is a very different place than it was in mid-2021. Post-COVID-19 reopenings, inflation, supply-chain issues, world conflicts, unrest and revolution are creating new narratives and investment theses for bitcoin and other crypto assets. This is a good time to test your own investment theses and see what might drive or change prices.","Markets like this are also a good time for the builders developing the decentralized ecosystem. Remember, there may be other investment narratives besides just a store of value. Other tokens represent governance, value accrual or utility. Take this time to learn what is being built, and determine how you might look at investments for the future.","Regulators here in the U.S. and all over the world have been at work putting out opinions, and enforcing new laws. With some of the hype dying down, it might be time to get more familiar with the current laws and regulations for your country and state.","An even better use of your time might be to read about where regulators might go with enforcing new laws, and research any ongoing actions. This will help you as you establish your practice, including having to make decisions about what services to offer and how to do so. It will also make you more confident when offering crypto-related services to clients, as you can speak to regulatory-based objections.","Sign up for State of Crypto, CoinDesk’s weekly newsletter examining the intersection of cryptocurrency and government.","During the run-up of crypto prices, many custodians, fund companies and projects were able to spend money on infrastructure. This has led to a slew of new offerings and custodial options. If you started your crypto practice with a certain set of offerings – such as custody, management, funds —based on availability at the time, you might want to look at new options now.","If you have not yet started in crypto because there weren’t easy options, you might want to reevaluate the advisory or custodial choices available.","Remember, crypto and decentralized finance (DeFi) represent a new financial ecosystem. Just because the price of the tokens are down doesn’t mean the entire system being built is not moving forward.","The recent crypto executive order from President Joe Biden made us feel more comfortable with the idea that crypto and digital assets are here to stay.","Take the time during this bear market to learn about the financial system being built, the reasons to invest and the ways you can build digital assets into your practice, so you’ll be prepared when the market comes roaring back and your clients are turning to you for your help."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Crypto for Advisors","Financial Advisors","Crypto","Investing","Markets","Newsletters","Opinion"],"authors":["Adam Blumberg"]}