{"summary":"After a successful week of hacking, networking and partying, conference co-founder John Paller revealed he is in talks to organize satellite events in other countries.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/05\/ethdenver-teases-spin-off-plans-as-conference-winds-down\/","publishDate":"2023-03-05T23:44:32","id":16150,"type":null,"title":"ETHDenver Teases Spin-off Plans as Conference Winds Down","category":["Technology"],"content":["DENVER – The biggest ETHDenver ever closed out on Sunday, with finalists in the Ethereum ecosystem conference’s hackathon presenting their builds to a ragged but still energized crowd at Denver’s National Western Complex.","After two weeks of programming, hacker houses, parties and panels that spanned the city of Denver, thousands of attendees had whittled down to a couple hundred diehard developers at ETHDenver’s main stage for closing ceremonies.","The collectivist nature of the festival – a celebration of the Ethereum ecosystem and also a summit for developers building atop it – bled into conference co-founder John Paller’s closing remarks.","This year’s ETHDenver mascot was a spork – the multi-purpose dining utensil that organizers used as a metaphor for the conference's utility-minded goals. In his remarks on Sunday, Paller revealed the mascot for next year’s gathering would be the \"SporkWhale,\" which he said embodies community ownership.","ETHDenver, a community-run conference managed by token-holder members in a decentralized autonomous organization (DAO), reached new heights this year; on the first day of the main event, a staffer said there were over 16,000 tickets to be checked in – a sellout. The event had 600 staffers, Paller said.","The conference is poised to grow in size and scope next year, Paller said. He said organizers are in discussion with “countries” over setting up satellite feeder events around the world to which ETHDenver would be the “Super Bowl.”"],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Denver’s National Western Complex","content":"ORGANIZATION"},{"type":"Paller","content":"PERSON"},{"type":"Denver","content":"LOCATION"},{"type":"John Paller","content":"PERSON"}],"hashtag":["Ethereum","ETH Denver 2022","ETH","conference","Hackathon"],"authors":["Danny Nelson"]}