{"summary":"Blockstack has reported a 37% fall in its 2019 revenue \nThe drop is due to lower sales of its Stacks token \nMuneeb Ali, co-founder and CEO of Blockstack, said: “Unlike equity fundraising, we treat funds raised through token offerings as ‘revenue’ and pay taxes on them”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63540\/blockstacks-revenue-declined-37-last-year-due-to-lower-stacks-token-sales","publishDate":"2020-04-30T07:35:12","id":1615,"type":null,"title":"Blockstack&#x27;s revenue declined 37% last year, due to lower Stacks token sales","category":["Layer 1s"],"content":["Blockchain project Blockstack has reported a 37% fall in its 2019 revenue as compared to the previous year.","The firm's 2019 revenue stood at $23.3 million as compared to $36.7 million in 2018, according to an <a href=\"https:\/\/sec.report\/Document\/0001193125-20-124379\/\" data-v-f87c67ca=\"\">annual report<\/a> filed with the U.S. Securities and Exchange Commission (SEC) on Wednesday.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/19144\/blockstack-announces-plans-to-raise-50m-in-a-sec-regulated-token-offering\" data-v-f87c67ca=\"\">Blockstack<\/a> makes its revenue “primarily from token sales,” and hence, the drop is due to lower sales of its Stacks (STX) token last year.","\"In 2019, Blockstack sold approximately 75 million tokens for a total amount of $15.4 million in a cash offering [...] Blockstack also sold approximately 31 million tokens for a total amount of $7.6 million in a private placement,\" according to the filing.","While in 2018 and 2017, Blockstack sold \"approximately 395 million tokens for a total amount of $47.4 million in private token sales.\"","Blockstack said its revenue \"can vary significantly based on demand for Stacks Tokens,” adding that it \"does not expect to generate revenue from Stacks Token sales in the future.\"","Muneeb Ali, co-founder and CEO of Blockstack, <a href=\"https:\/\/blog.blockstack.org\/sec-annual-report\/\" data-v-f87c67ca=\"\">said<\/a>: “Unlike equity fundraising, we treat funds raised through token offerings as ‘revenue’ and pay taxes on them.”","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Higher expenses<\/strong> <\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBesides lower token sales, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19328\/early-blockstack-token-investors-could-make-over-2000x-on-their-investments\" data-v-f87c67ca=\"\">Blockstack’s<\/a> expenses also rose last year.","Its compensation expenses increased by 133% in 2019 to $9.6 million as compared to 2018, while general and administrative costs rose by 48% to $5.8 million in 2019 as compared to the previous year.","Giving details on the firm's reserves, Ali said <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19649\/social-network-path-co-founder-and-former-ceo-joins-blockstack-pbc-as-an-advisor\" data-v-f87c67ca=\"\">Blockstack<\/a> had $18.6 million in cash as of Dec. 31, 2019, of which $4.4 million was restricted. The firm also had cryptocurrency reserves of $7.8 million, of which $2.4 million was restricted. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"As of January 2020, the restricted cash and cryptocurrencies are no longer subject to any contingencies and are available for use by Blockstack PBC. We also have a short-term treasury of 293M STX and a long-term treasury of 110M STX,\" he added.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBlockstack also noted an \"achievement of a hurdle of one million Verified Users\" in the annual report, although the definition and counting of verified users have been questioned earlier this year, <a href=\"https:\/\/www.theblockcrypto.com\/post\/55531\/whats-in-a-milestone-on-blockstacks-1-million-verified-users-and-the-quest-for-adoption\" data-v-f87c67ca=\"\">as The Block reported<\/a> at the time.","Notably, Blockstack has added five full-time employees since Dec. 31, 2019, bringing the total to 32, said Ali. The firm has also opened a European subsidiary with an office in Amsterdam and is hiring for more people.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The future status of Stacks?<\/strong><\/span>","Stacks (STX) tokens are SEC-qualified tokens and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35967\/blockstack-partners-with-lambda-school-to-teach-students-to-build-dapps-on-its-network\" data-v-f87c67ca=\"\">Blockstack<\/a> currently treats these tokens as securities in the U.S. to comply with the country's securities regulations.","But the firm now thinks it will not have to treat STX tokens as securities forever. \"The board of Blockstack PBC will periodically consider if the Blockstack network is decentralized enough for Stacks to be treated as non-security in the US,\" said Ali.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/8422\/blackrock-exec-joins-crypto-startup-blockstack\" data-v-f87c67ca=\"\">Blockstack<\/a> is expected to release an updated version of the Stacks Blockchain (“Stacks Blockchain 2.0”) during the second or third quarter of 2020, according to the annual report.","\"Based upon various features that we believe may be included in Stacks Blockchain 2.0, the board of directors of Blockstack PBC may review whether the Stacks Tokens should no longer be deemed to be securities under the Howey Test upon the release and adoption of Stacks Blockchain 2.0,\" said Blockstack."],"hashtag":["TOKENS"]}