{"summary":"Regulators have been looking to increase supervision of crypto and mitigate risks posed by banks' exposure to crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/07\/basel-committee-seeks-to-consult-on-stablecoins-risk-treatment\/","publishDate":"2023-12-07T18:41:17","id":16165,"type":null,"title":"Basel Committee Seeks to Consult on Stablecoins Risk Treatment","category":["Policy"],"content":["The Basel Committee, a global standard-setter for banks, has said it plans to consult on potential revisions to its classification criteria for stablecoins on Thursday.","The news came after the committee \"took stock of its review of elements of the prudential standard for banks' exposure to crypto,\" published in December last year.","Regulators globally have been working to increase supervision of crypto and mitigate risks posed by banks' exposure to private digital assets. Recently, Silvergate Bank and Silicon Valley Bank – which had links to crypto – collapsed, prompting regulators to more closely scrutinize bank involvement with the sector.","The Basel Committee wants to consult on criteria used to determine how risky crypto assets are. More specifically, it wants to consult on changes to the criteria for stablecoins to receive group 1b regulatory treatment, referring to \"cryptoassets with effective stabilization mechanisms.\"","The initial December report separated its criteria for the risk treatment of crypto into two groups. Group one cryptos would meet the full set of classification conditions and would be subject to capital requirements. Group two cryptocurrencies include what the regulator sees as more risky assets like bitcoin (BTC), and it proposed for banks to cap their exposure to these types of assets.","\"The committee concluded that crypto assets that use permissionless blockchains create risks that cannot be sufficiently mitigated at present and therefore agreed to retain the existing treatment for such cryptoassets,\" the report said.","The standard-setter will also continue monitoring the evolution of banks' crypto custody activities and consider if additional work needs to be done.","Edited by Nikhilesh De and Sandali Handagama.","\n","\n"],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"Basel Committee","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Sandali Handagama","content":"PERSON"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Silicon Valley Bank –","content":"ORGANIZATION"}],"hashtag":["Regulations","Crypto","Basel Committee"],"authors":["Camomile Shumba"]}