{"summary":"A standalone blockchain, Celo is looking to migrate to become a layer-2 network atop Ethereum. The months-long selection process has started to look like \"The Bachelorette,\" with teams behind the Arbitrum, Optimism, Polygon and zkSync networks all vying to win the technology mandate.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/01\/25\/celo-shopping-for-blockchain-partner-turns-to-the-delicate-issue-of-money\/","publishDate":"2024-01-25T22:57:31","id":16168,"type":null,"title":"Celo, Shopping for Blockchain Partner, Turns to the Delicate Issue of Money","category":["Technology"],"content":["The time has come to put the cards on the table.","For the past couple months, developers behind the Celo blockchain have been evaluating technical proposals from teams who might provide technology as the project migrates to become a new layer-2 network atop Ethereum.","Vying for the mandate are some of the biggest players in the blockchain industry, standing behind the most prominent layer-2 networks in existence: Optimism, Polygon, zkSync, Arbitrum, all of them eager to share technological blueprints with new chain builders in hopes of attracting more critical mass to their mini-ecosystems and software offerings known as \"stacks.\"","In a blog post on Thursday, Tim Moreton, CEO of cLabs, the leading developer behind Celo, wrote that \"as we wrap up the technical evaluations, we’re moving to evaluating the non-technical dimensions described in the framework.\" Translation? Let's talk terms.","\"This is different to evaluating published software,\" Moreton wrote. \"It’s harder to predict exactly how quickly we’ll be able to conclude this, especially as the candidate stacks are actively assembling their economic terms and incentive programs.\"","The details of terms like revenue sharing can be key factors for builders of new layer-2 networks. Arbitrum, the biggest layer-2 network in terms of TVL, disclosed last week that users of its \"Expansion Program\" must \"promptly transfer 10% of the protocol net revenue\" to the Arbitrum Foundation, under the terms of use.","Moreton didn't provide a specific timeline for when a final recommendation might come about, writing, \"We're working as fast as we can to get a comprehensive proposal that we feel confident proposing.\"","Celo is a lesser blockchain, ranked 26th based on the crucial metric of total value locked, or TVL, at $116 million; for comparison, No. 1 Ethereum has $30.6 billion. But with the big Ethereum layer-2 networks racing to establish themselves as early leaders in the fast-moving space, their pursuit of Celo has taken on an outsize marketing significance – a beauty pageant of sorts, the blockchain industry's version of The Bachelorette.","\"Each of the candidate projects are awesome achievements with strong roadmaps backed by strong teams and communities, and are each moving fast,\" Moreton wrote. \"We’re trying to find the best stack for Celo’s needs, not the best stack.\"","One thing that stands out from Moreton's post is just how hard the various teams appear to be working to land Celo, supplying test networks, hands-on technical assistance and access to top executives.","Optimism developers provided the cLabs team with an \"internal OP Stack-based testnet, which has helped the team become very familiar with the codebase,” Moreton said.","Polygon executives have provided \"deep technical expertise\" along with two testnets.","Alex Gluchowski, co-founder of Matter Labs, a developer behind the zkSync project, joined a Celo community call and wrote an \"insightful post, providing his take on the exercise of applying the suggested framework to the zkSync Stack & zkSync,\" according to Moreton.","\"The zkSync team have been a pleasure to collaborate with,\" he wrote. \"They demonstrated remarkable proactivity, organizing meetings, sharing their 2024 roadmap and engaging in detailed technical discussions with our engineers.\"","Regarding Arbitrum, \"we were able to gather a lot of info from public sources, documentation and running the stack locally,\" Moreton wrote, but \"we also had the opportunity to pose questions to the Arbitrum team in our shared chats and calls.\"","Edited by Daniel Kuhn."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Polygon","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Alex Gluchowski","content":"PERSON"},{"type":"Tim Moreton","content":"PERSON"},{"type":"Moreton","content":"PERSON"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"Moreton","content":"LOCATION"},{"type":"$30.6 billion","content":"MONEY"},{"type":"zkSync Stack & zkSync","content":"ORGANIZATION"},{"type":"Arbitrum","content":"PERSON"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$116 million","content":"MONEY"}],"hashtag":["Celo","Polygon","Matter Labs","Zksync era","Optimism","Arbitrum","Layer 2s"],"authors":["Bradley Keoun"]}