{"summary":"Eth 1 or Eth 2? Consensus layer or execution layer? It's all Ethereum, basically.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/01\/26\/ethereum-vs-eth-2-whats-in-a-name\/","publishDate":"2022-01-26T12:30:00","id":16166,"type":null,"title":"‘Ethereum’ vs ‘Eth 2’: What’s in a Name?","category":["Consensus Magazine"],"content":["The Ethereum Foundation announced in a blog post that it is nearly time to put an end to “ETH2” and the nomenclature that seems to separate the proof-of-stake chain from the proof-of-work chain. While it made sense when Ethereum’s roadmap looked to build out a separate proof-of-stake chain and simultaneously destroy the proof-of-work chain as we know it, the roadmap now involves a Merge between Eth 1 and Eth 2, pairing the current execution (application) layer on the proof-of-work chain with the consensus layer of the Beacon Chain.","In the foundation’s own words:","So much focus on the terminology for the technical specifications of Ethereum may seem like overkill. However, making the large distinction between Ethereum 1.0 and Ethereum 2.0 can be confusing, leaving some everyday users wondering if Ethereum 2.0 will come with a new token or if they will have to migrate their balances to a new chain and plenty of other implications that scammers would love to use to their advantage.","Additionally, it will only become more inaccurate to refer to the execution and consensus layers as separate versions of Ethereum the closer we get to integrating the two layers.","If you are interested in taking a stroll through the history of Ethereum, I recommend reading the March 28, 2021, edition of Ben Edgington’s What's New In Eth2. Ben breaks down how Eth 2 came to be and how changes in the roadmap have made naming clarity nearly impossible over the years.","As we move closer to the Merge (fingers crossed for early this summer) and Eth 2 and Ethereum become synonymous, we at CoinDesk will also begin to step back from using Eth 2 without additional context. Instead, we will follow the Ethereum Foundation’s lead in referring to it primarily as the consensus layer.","Welcome to another issue of Valid Points.","The following is an overview of network activity on the Ethereum 2.0 Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Valid Points incorporates information and data about CoinDesk’s own Eth 2.0 validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post."],"entity":[{"type":"Ben Edgington","content":"PERSON"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"March 28, 2021","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":["Ethereum","Ethereum 2.0","Eth2.0","Valid Points","The Protocol"],"authors":["Edward Oosterbaan"]}