{"summary":"Eurogroup, the body comprised of European finance ministers, said the introduction of a digital euro requires political decisions that should be discussed and taken at the political level.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/01\/17\/european-finance-ministers-take-stock-of-digital-euro-progress\/","publishDate":"2023-01-17T08:12:05","id":16162,"type":null,"title":"European Finance Ministers Take Stock of Digital Euro Progress","category":["Policy"],"content":["The Eurogroup, a body comprising the Finance Ministers of the eurozone countries, said in a statement on Monday the digital euro could not be programmable money. In other words, there would be no restrictions on the types of goods and services to be purchased or on the time for use of the digital euro.","This was just one of several views stated by the Eurogroup after its meeting to take stock of the progress of the digital euro, the bloc's central bank digital currency (CBDC). The project began in July 2021 and is expected to be in the investigation phase for 24 months.","The European Union is just one among more than 100 jurisdictions around the world that are researching or developing a CBDC, while the U.S. remains cautious on the merits of a CBDC. The EU Commission is responsible for proposing a digital euro bill later this year and EU leaders are expected to decide whether to use a digital euro after October 2023.","Read more: Slicing the Elephant: Inside the Design of a Digital Euro","In its discussions, the Eurogroup observed that the digital euro should complement and not replace cash, be assigned a legal tender status and ensure a high level of privacy. The group also added the CDBC should be widely accessible to the public, guarantee access to central bank money for euro area users, and its design should consider environmental implications.","CoinDesk had earlier revealed similar details citing a leaked paper.","The Eurogroup also stressed on the need for the digital euro's design to prevent money laundering, illicit funding and tax evasion while maintaining users' trust. Critically, the finance ministers of the eurozone stated that the design of the digital euro should not impair the ability of the European central banks to fulfil their price stability mandate.","The Eurogroup supported the offline functionality of the digital euro for use by citizens in different scenarios, and stated that supervised intermediaries could play an \"important role.\" This comes after EU lawmakers criticized Amazon's involvement in the digital euro project to develop a prototype for e-commerce applications of the new CBDC.","The EU's finance ministers also voiced support for interoperability with other CBDCs as a feature for the digital euro while mitigating risks associated with the use of its CBDC outside the euro area. While the International Monetary Fund has raised the possibility of an international CBDC platform, its progress has been delayed.","The next update from the Eurogroup is scheduled for Mar. 13, 2023.","Read More: EU Lawmakers Attack Amazon’s Involvement in Digital Euro Project"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Digital Euro","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"EU Lawmakers Attack Amazon’s Involvement in Digital Euro Project","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Mar. 13, 2023","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"EU Commission","content":"ORGANIZATION"},{"type":"Finance Ministers","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"}],"hashtag":["Regulations","European Central Bank","Digital Euro","CBDC","EU","EU Commission","EU Parliament","Finance Minister"],"authors":["Amitoj Singh"]}