{"summary":"The Canadian firm said 5,800 machines will provide computing power of upward of 630 petahashes per second by end of January. That's less than the October forecast of 1 exahash.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/12\/09\/crypto-miner-hive-cuts-computing-power-forecast-for-intel-chip-based-rigs\/","publishDate":"2022-12-09T09:59:29","id":16176,"type":null,"title":"Crypto Miner Hive Cuts Computing Power Forecast for Intel Chip-Based Rigs","category":["Tech"],"content":["Crypto mining firm Hive Blockchain (HIVE) will receive less computing power than forecast from its mining rigs using Intel's (INTC) new chips.","The 5,800 new machines, dubbed Hive Buzzminers, will have total computing power of more than 630 petahash\/second (PH\/s), the Vancouver firm said Friday. In October, it estimated a total of 1 exahash\/second (EH\/s).","Hive did not give a reason for the discrepancy, and had not responded to CoinDesk's request for comment by the time of publication. It's possible it changed the specification of the machines to lower power consumption during a period of high electricity costs. It's also possible it ordered fewer machines than anticipated as the price of bitcoin fell more than 60% this year.","Some of the machines have already been installed, with the rest expected by the end of January. The rigs' computing power of about 109 terahahes\/second (TH\/s) per machine is a little over that of Bitmain's Antminer S19 Pro, released in 2020. Hive didn't divulge the energy efficiency or cost of the rigs, key metrics for miners struggling to keep up with high power costs. The Intel chip is touted as environmentally friendly, indicating that efficiency will be its strong suit.","Intel's second-generation Blocksale application-specific integrated circuit (ASIC) for bitcoin mining rigs was announced in April. It is expected to break the Bitmain and MicroBT duopoly in the bitcoin mining ASIC market. Miners can configure the chip into machines of their own design, such as Hive's. That is a marked difference from the Bitmain machines, which are notoriously closed-source. The flexibility, however, comes with the difficulties of deciding on designs and bringing them to production.","Argo Blockchain (ARBK), another one of Intel's early clients, decided to redesign the machines, leading to delays in deployment. The London-based company, which is working with ePIC Blockchain on the rigs, said it wanted to reorient the machines more toward power efficiency, bringing them closer to close to Bitmain's Antminer S19 XP with 134 TH\/s at 21.5 joules\/terahash. Initially, the machines were designed for computing power, Argo said.","Griid Infrastructure and Jack Dorsey's company, Block (formerly Square), have been named as other first customers.","Read more: Hive to Buy Intel Mining Chip That Can Raise Hashrate by 95%","\n","\n"],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"Intel","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"Vancouver","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Argo","content":"PERSON"}],"hashtag":["Bitcoin Mining","Intel","Mining","Tech","ASIC","HIVE Blockchain"],"authors":["Eliza Gkritsi"]}