{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 8-14.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/08\/protocol-latest-tech-news-crypto-blockchain\/","publishDate":"2024-02-14T14:46:08","id":16173,"type":null,"title":"Protocol Village: Sommelier Expands to Ethereum Layer-2s Via Axelar, Starting With Arbitrum","category":["Technology"],"content":["Feb. 14: Sommelier, a DeFi platform offering yield-generating vaults, is expanding to Ethereum layer 2s via Axelar's cross-chain messaging. According to the team: \"This allows accessing new opportunities and users across chains. Sommelier launches its first layer 2 vault, Real Yield ETH, on Arbitrum. The vault uses dynamic strategies like liquidity provision and risk-managed leverage to optimize yields on ETH-denominated assets. Building on the success of a similar vault on Ethereum mainnet, the Arbitrum vault aims to outperform holding staked ETH two- to three-fold.\"","Feb. 14: Core Chain, a blockchain that combines the security of Bitcoin with Ethereum's EVM compatibility, is launching its support program called Core Starter, according to the team: \"This program provides over $300,000 in tools and incentives for developers building dApps on Core. Core Chain will provide cost support to platforms like Google Cloud, CertiK, TokenSoft, Hacken, Halborn, Elixir, Request Finance and Questly.\"","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","Feb. 13: Nym Technologies, focused on privacy, announced that it has received a grant from the Zcash Community Grants, bringing the metadata privacy protections of the Nym mixnet to the Zcash ecosystem. According to the team: \"Nym will work with Zcash’s already privacy-preserving infrastructure to help provide an end-to-end protected solution for privacy for Zcash users, solving data leakage at the network layer that is currently undefended by Zcash. Unlike any other privacy technology, the Nym mixnet prevents government, corporate and criminal surveillance adversaries from tracing metadata.\" (ZEC)","Feb. 13: Cosmos Hub and Babylon, a platform developing the first Bitcoin Staking Protocol for the PoS ecosystem, announced a proposed initiative to integrate Babylon’s staking protocol into the Cosmos network. According to the team: \"If the proposal passes, Bitcoin holders will be able to stake their bitcoins to secure Cosmos Hub ICS consumer chains. Babylon is a trustless and self-custodial staking protocol that leverages timelock contracts to enable Bitcoin staking across traditional PoS chains. The result is a secure method that allows PoS chains to access over $800 billion in idle bitcoin.\" CoinDesk 20 assets: (ATOM) (BTC)","Feb. 13: Peaq, a blockchain for real-world applications, announced the expansion of its ecosystem, as PowerPod joins to decentralize electric vehicle (EV) charging. According to the team: \"PowerPod is building a decentralized physical infrastructure network (DePIN) of community-owned EV charging stations. As part of the integration, the project will use peaq as the layer-1 backbone for its DePIN, using it to store charging session data, handle transactions and reward the users with tokens for powering a more sustainable future of mobility... As part of its integration with peaq, PowerPod will outfit these devices with their multi-chain self-sovereign peaq IDs, enabling them to connect with the blockchain. It will also leverage peaq for data storage and eventually launch its token on the peaq mainnet, set to go live in the coming months. It will also use peaq to set up its rewards mechanism, granting users tokens for interacting with the DePIN.\"","Feb. 13: Toposware and Polygon have joined forces to introduce Plonky2, describing it as \"the most cost-effective Type 1 ZK-EVM, and a breakthrough in cryptographic research. The Plonky2 zkEVM operates within Ethereum's ecosystem and reduces transaction costs.\" according to the team. From the blog post: \"This means all new and existing smart contracts deployed to Ethereum and compatible chains are now able to take advantage of the power of zero-knowledge proofs.\" Separately, the Topos Builders Program Community Fund is now live.","Feb. 13: Watches.io, an end-to-end tracking and trading ecosystem for watches, has raised $1.9 million in a pre-seed funding round, led by Lemniscap. According to the team: \"Watches.io aims to simplify the tracking, trading, and purchasing process for luxury watches, turning them into tradable assets.\" According to a press release: \"The round was led by Lemniscap, with participation from Big Brain Holdings, Marin Ventures, Soft Holdings Inc, Builder Capital, Darkside Capital, Non-Fungible Technologies, and a host of top Web3 founders and angel investors, including partners from top funds such as Dragonfly, Lattice, No Limit Holdings.\" It uses an NFT infrastructure supported by NFT finance (NFTfi) platforms.","Feb. 13: The Titan Mining team is enabling frequent BTC earnings for mining efforts, providing Bitcoin miners with immediate access to their earnings through the Lightning Network, according to the team: \"Miners receive their Bitcoin earnings approximately every 10 minutes without needing to reach a minimum balance before payout.\"","Feb. 13: Hardware wallet maker Ledger announced that it is integrating products with Coinbase, allowing Ledger users to buy digital assets using the crypto exchange's Coinbase Pay as an on-ramp. Bringing Coinbase Pay into the Ledger Live app is supposed to benefit Ledger users, according to a press release seen by CoinDesk, making it easier for users to receive their crypto purchases from Coinbase directly on their Ledger hardware wallet, without any additional fees.","Feb. 13: Crypto wallet firm Fordefi raised $10 million in venture capital investment, aiming to solve one of the biggest pain points in crypto by expanding its institutional-focused wallet offering to retail-facing platforms, the company told CoinDesk in an exclusive interview. The fundraising was led by Electric Capital, with Paxos and Alchemy joining as new investors. The investment followed a $18 million seed capital raise in November 2022 with Lightspeed Ventures, Pantera Capital, and Jump Crypto, among others.","Feb. 13: Bybit, a crypto exchange, announced the launch of the Bybit Card in Australia. Powered by Mastercard, this card debits crypto balances on Bybit and converts them seamlessly into fiat money used to pay for card transactions.","Feb. 12: Analog, a U.S.-based Web3 platform focused on omni-chain interoperability, announced the completion of its latest funding round. According to the team: \"Investors in the round include Balaji Srinivasan, Mike Novogratz’s Samara Asset Group, Tribe Capital, NEAR and many more. A main component of Analog, The Timechain, is a Rust-based blockchain that hosts a number of validators, called Time Nodes and Chronicle Nodes, that validate and relay messages. It enables different applications to connect to different blockchains.\"","Feb. 12: Rarimo, a digital identity protocol based on the Tendermint Consensus and Cosmos SDK blockchain development kit, has released Freedom Tool, an open-source software for running anonymized elections and polls, according to the team: \"Built with a combination of zero-knowledge and blockchain technology, it aims to solve the technical challenge of enabling digital identity checks while also protecting citizens from tracking. Citizens prove their eligibility by scanning their biometric passports with their phones. The data on the biometric chip inside the passport is verified, and upon confirming authenticity, an anonymous voting pass is issued. The citizen then uses this pass to cast their vote.\"","Feb. 12: The Aave-Chan Initiative and Scroll, an Ethereum layer-2 network powered by zero-knowledge or ZK technology, announced the successful deployment of Aave V3 on the Scroll Mainnet, according to the team, \"marking the first market on a ZK rollup and providing users with a secure, scalable and user-friendly environment. The combined expertise of Aave V3 and Scroll creates a synergy that is set to invigorate both communities. This launch on Scroll represents Aave DAO’s first deployment to a zkEVM chain with others expected to be coming shortly this quarter.\" (AAVE)","Feb. 12: Lit Protocol has launched Litv0, \"a significant advancement in the way developers can create, control and manage secrets, keys and private data,\" according to the team: \"Lit offers a native system for identity-based encryption, compute and signing, merging TSS, secure hardware, blockchain, and IPFS for fault-tolerant key management and serverless functions.\"","Feb. 10: The Tezos blockchain on Friday activated its fifteenth upgrade, called Oxford 2, according to the team: \"The upgrade introduces private smart rollups as a new security feature for developers, a smoother staking process for validators and an adjustment to slashing penalties, among other changes. The upgrade comes a month before the main net launch of Etherlink, an EVM-compatible Layer 2 built on Tezos and powered by Smart Rollups.\" (XTZ)","Feb. 10: The Aptos Ecosystem Summit was built around setting up Aptos ecosystem projects, protocols and builders for success, according to the team: \"The week-long event celebrated achievements, unveiled news and highlighted best practices across 15+ countries, 32 projects, and 50+ investors from 26 firms. On the sidelines of the agenda, 122 one-on-one conversations took place. These 1:1 interactions between ecosystem leaders and Aptos Foundation representatives allowed for in-depth discussions, hands-on support, and the sharing of specific insights related to engineering, marketing, product development, legal, and more.\" (APT)","Feb. 9: The dYdX Foundation has secured $30M in DYDX from the dYdX Chain Community Treasury, after a vote by the dYdX DAO, according to the team: \"The Foundation Fundraise proposal had a 98% Yes vote and a 86.4% voter turnout. This funding provides 3 more years of runway for the dYdX Foundation to execute its roadmap.\" (DYDX)","Feb. 9: Web3 Foundation, supporting Polkadot as its flagship protocol, announced funding support for Ideal Labs in the creation of the Encryption to the Future (ETF) network, according to the team: \"The funding is part of the Foundation’s Decentralized Futures Funding Program, backed by $20M USD and 5M DOT. The ETF Network is a cutting-edge substrate-based blockchain leveraging a unique consensus mechanism focused on publicly variable on-chain randomness and timelock encryption. The initiative is a crucial step towards addressing the challenges of secure delayed transactions.\" (DOT)","Feb. 9: Zeitgeist, a leading platform in the decentralized prediction markets, is announcing its integration of USDC, according to the team: \"USDC will be integrated via Cross-Consensus Messaging (XCM). The development allows for the effortless transfer of USDC from two projects within the Polkadot ecosystem, HydraDX & Moonbeam, into Zeitgeist. This is more than just an event; it's a testament to Zeitgeist's ongoing commitment to the Polkadot ecosystem. By leveraging Polkadot's advanced technological framework and collaborative ethos, Zeitgeist continues to offer innovative solutions in the prediction market arena.\"","Feb. 8: Polygon Labs, the developer behind the Polygon blockchain, released Thursday a \"Type 1 prover,\" a new component allowing any network compatible with Ethereum's EVM standard to become a layer-2 network powered by zero-knowledge proofs, and to connect to Polygon’s broader ecosystem. The Polygon team claimed the release as a major breakthrough, a technological feat that even Ethereum co-founder Vitalik Buterin has touted as key to making auxiliary layer-2 networks nearly equivalent to the base blockchain. CoinDesk 20 asset: {{MATIC}}","Feb. 8: StarkWare, the developer behind the Starknet blockchain, announced on Thursday the launch of a new “Cairo Verifier” in the next few weeks, opening the door to layer-3 application-based chains on Starknet. Cairo, which the StarkWare and another developer, Herodotus, worked on together, is a key piece of technology that verifies proofs and posts them back to the layer-2 blockchain, instead of Ethereum’s mainnet.","Feb. 8: FuzzLand, a Web3 security and analytics company, has closed a $3M seed funding round led by 1kx with participation from HashKey Capital, SNZ and Panga Capital, according to the team: \"The funding will help accelerate research and development into automated solutions for smart contract analysis using dynamic analysis and distributed computing software. Founded by Chaofan Shou, Jeff Liu and Koushik Sen, FuzzLand aims to deliver cutting-edge vulnerability detection and analytics capabilities that go beyond traditional solutions.\"","Feb. 8: Flood, a protocol for order routing, management, and settlement, announced its $5.2M seed funding round, co-led by Bain Capital Crypto and Archetype, with participation from Robot Ventures. According to the team: \"Flood provides decentralized application (dApp) developers with a suite of tools for owning and managing the entire lifecycle of their application’s order flow. As the only decentralized exchange (DEX) currently available on the market with operational hooks, the user experience allows traders to quickly settle their transactions while seamlessly staying within the Flood ecosystem.\"","Feb. 8: Casper Association, supporting the proof-of-stake, smart-contracts blockchain Casper Network featuring a WASM code environment, sent the following message: \"The Casper Network Peregrine (v1.5.6) update is a patch release that includes enhancements and exciting new features to network operations. Significant changes are: the reduction of block times to 16 seconds, the 99% refund of unspent funds, and the lowering of control flow opcode costs, resulting in a reduction in mint and transfer costs for contracts. Casper's architecture is uniquely designed for continual evolution, meeting the evolving demands of its users, partners, and the projects it supports.\"","Feb. 8: Created in collaboration with Hashkey, TON Bootcamp has now accepted its first twelve projects, according to the team: \"The APAC-focused accelerator has earmarked up to $500,000 for each of these teams, with the selected projects uniquely leveraging blockchain technology within Telegram’s Web3 ecosystem. These projects will further embed TON's Web3 functionalities within Telegram's existing platform and engage Telegram’s over 800 million monthly active users. The program reflects TON Foundation’s commitment to the APAC region and community as it looks to leverage Hong Kong’s industry-leading regulatory environment.\"","Feb. 8: Dtravel says it has received \"backing and stamp of approval from Borderless Capital with a strategic investment to support its DePIN peer-to-peer vacation rental (VR) ecosystem. The partnership not only brings financial backing, but opens up a wealth of expertise and networking opportunities, including access to Borderless' DePIN portfolio companies, that will support Dtravel in becoming a leading provider for the VR industry. The funding will pave the way for the next phase of growth with hundreds of thousands of operators, travelers and TRVL token holders engaging with the Dtravel ecosystem.\"","Feb. 8: Cornucopias, a massive multiplayer online role-playing game (MMORPG) originally on Cardano and BSC, is moving ahead with a node sale and partnership with the Ethereum layer-2 network Base, according to the team: \"Currently in pre-alpha, the platform has already secured over 50K users following successful launches on both Cardano and the BNB Smart Chain. Developed with Unreal Engine 5, this expansion now allows gamers within the Eth ecosystem to experience Cornucopias superior graphics and immersive gaming experiences. Node sale participants will not only receive Cornucopias’ native token, COPI, but are also now able to engage and transact with the platform’s digital assets.\"","Feb. 8: Transak, a crypto on-ramp solution, \"is expanding into the APAC region with a new entity in Hong Kong, aiming to leverage the city's status as a financial hub and its regulatory framework for cryptocurrencies,\" according to the team. \"This move follows a Series A funding round led by CE Innovation Capital. Transak plans to integrate local payment methods and adhere to Hong Kong's regulatory standards to simplify Web3 accessibility. The company's global operations highlight its commitment to regulatory compliance. Additionally, Transak has joined Web3 Harbour to foster collaboration in the APAC's Web3 ecosystem.\"","Edited by Bradley Keoun."],"entity":[{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"Aptos Foundation","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"Lattice","content":"ORGANIZATION"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Casper Association","content":"ORGANIZATION"},{"type":"Axelar","content":"ORGANIZATION"},{"type":"PowerPod","content":"ORGANIZATION"},{"type":"$1.9 million","content":"MONEY"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Transak","content":"ORGANIZATION"},{"type":"Darkside Capital","content":"ORGANIZATION"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Koushik Sen","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"dYdX Foundation","content":"ORGANIZATION"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"$18 million","content":"MONEY"},{"type":"Casper Network Peregrine","content":"ORGANIZATION"},{"type":"Soft Holdings Inc","content":"ORGANIZATION"},{"type":"$800 billion","content":"MONEY"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"Time Nodes and Chronicle Nodes","content":"ORGANIZATION"},{"type":"Unreal Engine 5","content":"ORGANIZATION"},{"type":"SNZ","content":"PERSON"},{"type":"Jeff Liu","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"CE Innovation Capital","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Tribe Capital","content":"ORGANIZATION"},{"type":"Hacken","content":"LOCATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Panga Capital","content":"ORGANIZATION"},{"type":"Cairo","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Chaofan Shou","content":"PERSON"},{"type":"Request Finance","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Builder Capital","content":"ORGANIZATION"},{"type":"Feb. 8","content":"DATE"},{"type":"Feb. 9","content":"DATE"},{"type":"$3M","content":"MONEY"},{"type":"Titan Mining","content":"ORGANIZATION"},{"type":"Non-Fungible Technologies","content":"ORGANIZATION"},{"type":"Herodotus","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"TON Bootcamp","content":"ORGANIZATION"},{"type":"Cosmos Hub ICS","content":"ORGANIZATION"},{"type":"Casper Network","content":"ORGANIZATION"},{"type":"Babylon","content":"LOCATION"},{"type":"5M DOT","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"Dtravel","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"Hashkey","content":"LOCATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Feb. 10","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Lightspeed Ventures","content":"ORGANIZATION"},{"type":"Marin Ventures","content":"ORGANIZATION"},{"type":"Feb. 12","content":"DATE"},{"type":"Feb. 14","content":"DATE"},{"type":"Feb. 13","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"Topos Builders Program Community Fund","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$20M","content":"MONEY"},{"type":"TSS","content":"ORGANIZATION"},{"type":"HydraDX & Moonbeam","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Zcash Community Grants","content":"ORGANIZATION"},{"type":"Samara Asset Group","content":"ORGANIZATION"},{"type":"$5.2","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"86.4%","content":"PERCENT"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Halborn","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"3","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Fordefi","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"dYdX Chain Community Treasury","content":"ORGANIZATION"},{"type":"$30M","content":"MONEY"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}