{"summary":"The amount of ether held on exchanges is at an all-time low of 11%, a sign that more of the cryptocurrency is being locked up for DeFi, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/26\/ethers-bitcoin-beating-rally-not-just-because-of-potential-etf-approval-bernstein\/","publishDate":"2024-02-26T17:29:51","id":16177,"type":null,"title":"Ether's Bitcoin Beating Rally Not Just Because of Potential ETF Approval: Bernstein","category":["Finance"],"content":["Ether (ETH), the world's second-largest cryptocurrency, has outperformed its larger rival bitcoin (BTC), with a 33% gain year-to-date. This rally is being driven by catalysts other than the potential approval of a spot exchange-traded fund (ETF), broker Bernstein said in a research report on Monday.","Firstly, the ether supply is deflationary and has not increased since the Ethereum blockchain’s shift to a proof-of-stake consensus model in September 2022, the report said, adding that this fact is being underappreciated.","The amount of ether locked up is also an important factor. Bernstein notes that ETH held on exchanges is at an all-time low of 11%, a sign that more of the cryptocurrency is being locked up. There is ETH locked in staking pools, decentralized finance (DeFi) smart contracts and on layer-2s.","“With the growth of ETH transaction fees based on higher blockchain activity (more DeFi, NFTs, tokens), more ETH holders are incentivized to stake their ETH,” analysts Gautam Chhugani and Mahika Sapra wrote.","“And as financial smart contracts on Ethereum Layer 2 networks scale (Arbitrum, Optimism and Polygon), more ETH finds itself locked in smart contracts, leading to a reflexive feedback loop of increased demand,” the authors wrote.","The Eigen layer, a protocol used for restaking ether, has also attracted more staking demand, as “ETH (re)stakers gain from new tokens\/services launched on Eigen,” the note said.","Since the start of 2023, new layer 2 networks have brought scalability and lower fees to the Ethereum network in a revival of decentralized finance, Bernstein said.","With further clarity on token regulations, “application tokens such as DeFi tokens could potentially allow revenue sharing with token stakers,” the report said, adding that a “healthy DeFi ecosystem would continue to drive higher activity and Ethereum fees,” and therefore more value accrual to ETH.","The Uniswap fee switch proposal, which resulted in a 60% gain in the UNI governance token, is cited as one such example of how “token economic designs” could get better.","The last main catalyst is the Dencun upgrade of the Ethereum blockchain, planned for March this year. Following the upgrade, “ETH contributors expect a further 90% reduction in Ethereum layer 2 transaction costs and improved profitability of layer 2 networks,” which will reduce congestion on the mainnet and drive higher volumes to the ecosystem, the report added.","Read more: Ether Could Be The Next 'Institutional Darling,’ Bernstein Says","Edited by Aoyon Ashraf."],"entity":[{"type":"Eigen","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"Mahika Sapra","content":"ORGANIZATION"},{"type":"Gautam Chhugani","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bernstein","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"March this year","content":"DATE"}],"hashtag":["Ether","ETF","Analysts","DeFi"],"authors":["Will Canny"]}