{"summary":"Banking enforcement targeting legal crypto businesses appears to violate the FDIC's mandate. It may also be amplifying financial contagion.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/22\/the-reality-behind-the-crypto-banking-crackdown-operation-choke-point-20-is-here\/","publishDate":"2023-03-22T17:23:55","id":16180,"type":null,"title":"The Reality Behind the Crypto Banking Crackdown: ‘Operation Choke Point 2.0’ Is Here","category":["Consensus Magazine"],"content":["The Biden administration and federal regulators appear to be using whatever means necessary to cut the cryptocurrency industry off from banking services. Critical observers have dubbed this alleged effort “Choke Point 2.0” after a similar push by the Obama administration to cut undesirable but legal industries off from the financial system.","U.S. officials have so far uniformly denied the existence of any such coordinated agenda. But whether it’s an active extralegal conspiracy or merely an alignment of motivations, the evidence is increasingly clear that crypto is in the crosshairs.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","Figures including Brian Brooks, former head of the Office of the Comptroller of the Currency (OCC), allege this has led to banks being targeted for shutdown, in part, because they served cryptocurrency customers. That would have no grounding in existing law, may violate recent FDIC reforms, and may have caused collateral damage by fomenting instability in the banking sector.","A new report, authored by the White House Council of Economic Advisers, devotes a lot of space to crypto, and certainly confirms the negative sentiment in the U.S. executive branch. One former financial regulator described this report to CoinDesk as “a damning indictment of the space that makes [the Biden administration's] policy position crystal clear.\"","The report follows a wave of bank shutdowns that some have alleged were triggered not just by financial stability concerns, but by the broader push to strangle cryptocurrency businesses - despite the lack of any authorizing legislation. Former U.S. Rep. Barney Frank has explicitly claimed the shutdown of Signature Bank was intended “to send a message to get people away from [banking] crypto.” Frank is a member of Signature’s board, so he is motivated to claim crypto, rather than mismanagement, was to blame for the bank’s failure.","There is other support for the idea of an undisclosed crypto-strangling agenda. Reuters reported late last week the Federal Deposit Insurance Corporation (FDIC) required Signature’s acquirers to give up Signature’s crypto customers in the sale. The FDIC initially denied that report but, as with other recent events, its actions would seem to confirm it. Signature assets will now become part of Flagstar Bank, but the deal, announced on March 20, did not include roughly $4 billion in deposits belonging to digital asset firms, according to the FDIC.","As no less than the Wall Street Journal editorial board argued earlier this week, this seems to confirm the FDIC is not just actively pursuing an anti-crypto agenda, but is lying to the public about it.","Nic Carter of Castle Island Ventures seems to have been first to term this alleged initiative “Choke Point 2.0.” That refers to Operation Choke Point, an Obama Justice Department effort to lean on banks that served gun manufacturers, payday lenders and other legal but undesirable industries.","Though executed under the cover of anti-money laundering efforts, multiple critics, including former regulators and the House Financial Services Committee, ultimately condemned the original Operation Choke Point as an abuse of power, and further concluded that it had harmed lawful financial service providers. The Department of Justice launched an investigation of the effort.","Ultimately, new restrictions were placed on the power of the FDIC in the wake of Choke Point, in part to settle lawsuits brought by victims of the crackdown. Imposed in 2018, those restrictions included limitations on the FDIC’s ability to interfere with banks’ customer relationships, and a requirement that all efforts to terminate such relationships be expressed in writing. Informal or unwritten suggestions were also restricted, likely one major reason regulators and others continue to deny what is fairly obviously a targeted crackdown on a legal industry.","See also: Should I Keep My Money in Bitcoin or a Bank? | Opinion","In a statement announcing a 2019 settlement of its suit against FDIC, the payday lender Advance America said its lawsuit \"uncovered how some FDIC leaders and officials executed a campaign motivated by personal scorn for our industry, contempt for our millions of customers and blatant disregard for due process. This settlement will help to prevent this disenfranchisement from happening again – to our business or any other legal, regulated business.\"","It seems highly plausible that similar targeted bias is at play in the FDIC’s recent actions. That may mean the agency faces another wave of official and legal backlash for its unauthorized initiative. But the damage – both intended and accidental – has already been done.","The apparent interagency push to debank crypto firms is coming at a moment that is politically expedient but economically fraught. The wave of crypto frauds and collapses in 2022, particularly the allegedly manifold crimes of Sam Bankman-Fried and his FTX associates, have made crypto an easy target.","But at the same time, rapid interest rate rises in response to inflation have fueled broad anxiety about the banking sector – anxiety that may have been compounded by the very moves intended to target crypto. In particular, the collapse of Silvergate Bank under regulatory pressure and attacks from figures including Sen. Elizabeth Warren (D-Mass.) may have primed fears that then led to a run on Silicon Valley Bank, which in turn fueled even broader fears.","There are other clear ironies here. Efforts to debank legal, regulated crypto companies in the U.S. would not have prevented FTX or other offshore frauds that have made the crackdown politically appealing. Meanwhile, the Securities and Exchange Commission and other agencies had more power to protect victims of U.S.-based alleged frauds such as Celsius Network, but failed to do so.","See also: When Will Crypto Learn From the Mistakes of Banks? | Opinion","As Binance CEO Changpeng Zhao observed, the crackdown is already having unintended consequences that don’t particularly make Americans safer. One immediate effect has been pushing users away from the U.S.-regulated and broadly trusted stablecoin USDC, and towards tether (USDT), an unregulated offshore service whose stability is an eternally open question.","The same offshoring effect seems poised to continue: Banks in Europe and the Caribbean have reported increased interest from crypto firms looking for options. That could lead to crypto firms pushed entirely out of U.S. jurisdictions.","That would have many effects – but it’s not at all clear that protecting Americans would be one of them."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Obama","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"U.S. Rep. Barney Frank","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Brian Brooks","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"March 20","content":"DATE"},{"type":"Caribbean","content":"LOCATION"},{"type":"Nic Carter of Castle Island Ventures","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Mass.","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Operation Choke Point","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Advance America","content":"ORGANIZATION"},{"type":"Flagstar Bank","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Obama Justice Department","content":"ORGANIZATION"},{"type":"White House Council of Economic Advisers","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Choke Point","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Opinion","FDIC","Banking Regulation","Operation choke point","Regulation"],"authors":["David Z. Morris"]}