{"summary":"BlockFi has gathered another $18 million of bitcoin and ether deposits since last month, bringing its total interest-earning accounts to $53 million.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/04\/23\/blockfi-is-now-paying-interest-on-53-million-of-crypto-deposits\/","publishDate":"2019-04-23T16:30:36","id":16184,"type":null,"title":"BlockFi Is Now Paying Interest on $53 Million of Crypto Deposits","category":["Markets"],"content":["Crypto lending startup BlockFi has gathered another $18 million of bitcoin and ether deposits since last month, bringing its total interest-earning accounts to $53 million.","The company also lowered its minimum balance to earn interest on bitcoin from 1 BTC to 0.5 BTC and expanded its operations to India, meaning its service is now available globally, except for territories sanctioned by the U.S., U.K. and E.U.","\"We grew the client base around 50 percent in the first half of April from the end of March,\" BlockFi's CEO Zac Prince told CoinDesk Tuesday. \"We expect the quantity of new clients to increase further as we lower the minimum balance requirement for interest earning eligibility. We also see incremental deposits from existing clients, especially around the beginning of the month after interest payments are made.\"","However, in response to market conditions, BlockFi has also made its terms less favorable for large ether depositors.","Effective May 1, it will lower the maximum balance for which it will pay 6.2 percent annual interest to 250 ETH from 500. All amounts above that threshold will receive only 2 percent.","\"BlockFi’s ability to pay interest to our clients is based on crypto market lending conditions. As we’ve touched on previously, we exclusively work with institutional counterparties to generate this yield. Over the past month, demand for borrowing ETH has dropped, and as a result, ETH tier rates will be adjusted in tandem,\" the company explained Tuesday.","The startup, funded by Galaxy Digital, ConsenSys Ventures, SoFi and Kenetic Capital, has been providing fiat loans with bitcoin and ether collateral since January. In March, it launched a new service offering to pay clients interest on their crypto, which it loaned out to institutions. The product promised to pay depositors 6 percent monthly and 6.2 percent in compound interest every year.","However, the terms were amended soon after the launch: at the end of March, the company announced that accounts with more than 25 bitcoin or 500 ether would get 6 percent monthly only on the part of their holdings below that threshold, and 2 percent on the rest. To be clear, BlockFi's terms and conditions explicitly say that the company can change the interest rate at its discretion.","At the time, Prince explained to CoinDesk that the company had too many deposits to keep its business in balance: BlockFi was lending out most of the clients' crypto to institutional borrowers to earn interest, and the demand from the borrowers didn't cover the influx of crypto deposits.","\"We started to see institutional accounts created followed by deposits well over $1 million, which is not who we think of as our core client and not the type of activity we want at this time,” he said then, citing BlockFi's focus on retail depositors.","BlockFi image via CoinDesk archives"],"entity":[{"type":"May 1","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"E.U.","content":"ORGANIZATION"},{"type":"2 percent","content":"PERCENT"},{"type":"ConsenSys Ventures","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"U.K.","content":"LOCATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"$53 million","content":"MONEY"},{"type":"6 percent","content":"PERCENT"},{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"India","content":"LOCATION"},{"type":"the first half of April from the end of March","content":"DATE"},{"type":"50 percent","content":"PERCENT"},{"type":"6.2 percent","content":"PERCENT"}],"hashtag":["News","BlockFi"],"authors":["Anna Baydakova"]}