{"summary":"The SEC chair in his own words.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/10\/gary-genslers-statement-on-bitcoin-etf-approvals\/","publishDate":"2024-01-10T21:38:48","id":16185,"type":null,"title":"Gary Gensler's Statement on Bitcoin ETF Approvals","category":["Policy"],"content":["U.S. Securities and Exchange Commission Chair Gary Gensler released this statement after the regulator approved spot bitcoin ETFs:","Jan. 10, 2024","Today, the Commission approved the listing and trading of a number of spot bitcoin exchange-traded product (ETP) shares.","I have often said that the Commission acts within the law and how the courts interpret the law. Beginning under Chair Jay Clayton in 2018 and through March 2023, the Commission disapproved more than 20 exchange rule filings for spot bitcoin ETPs. One of those filings, made by Grayscale, contemplated the conversion of the Grayscale Bitcoin Trust into an ETP.","We are now faced with a new set of filings similar to those we have disapproved in the past. Circumstances, however, have changed. The U.S. Court of Appeals for the District of Columbia held that the Commission failed to adequately explain its reasoning in disapproving the listing and trading of Grayscale’s proposed ETP (the Grayscale Order). The court therefore vacated the Grayscale Order and remanded the matter to the Commission. Based on these circumstances and those discussed more fully in the approval order, I feel the most sustainable path forward is to approve the listing and trading of these spot bitcoin ETP shares.","The Commission evaluates any rule filing by a national securities exchange based upon whether it is consistent with the Exchange Act and regulations thereunder, including whether it is designed to protect investors and the public interest. The Commission is merit neutral and does not take a view on particular companies, investments, or the assets underlying an ETP. If the issuer of a security and the listing exchange comply with the Securities Act, the Exchange Act, and the Commission’s rules, that issuer must be provided the same access to our regulated markets as anyone else.","Importantly, today’s Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities. Nor does the approval signal anything about the Commission’s views as to the status of other crypto assets under the federal securities laws or about the current state of non-compliance of certain crypto asset market participants with the federal securities laws. As I’ve said in the past, and without prejudging any one crypto asset, the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws.","Investors today can already buy and sell or otherwise gain exposure to bitcoin at a number of brokerage houses, through mutual funds, on national securities exchanges, through peer-to peer payment apps, on non-compliant crypto trading platforms, and, of course, through the Grayscale Bitcoin Trust. Today’s action will include certain protections for investors:","First, sponsors of bitcoin ETPs will be required to provide full, fair, and truthful disclosure about the products. Investors in any bitcoin ETP that is listed and traded will benefit from the disclosure included in public registration statements and required periodic filings. While these disclosures are required, it is important to note that today’s action does not endorse the disclosed ETP arrangements, such as custody arrangements.","Second, these products will be listed and traded on registered national securities exchanges. Such regulated exchanges are required to have rules designed to prevent fraud and manipulation, and we will monitor them closely to ensure that they are enforcing those rules. Furthermore, the Commission will fully investigate any fraud or manipulation in the securities markets, including schemes that use social media platforms. Such regulated exchanges also have rules designed to address certain conflicts of interest as well as to protect investors and the public interest.","Further, existing rules and standards of conduct will apply to the purchase and sale of the approved ETPs. This includes, for example, Regulation Best Interest when broker-dealers recommend ETPs to retail investors, as well as a fiduciary duty under the Investment Advisers Act for investment advisers. Today’s action does not approve or endorse crypto trading platforms or intermediaries, which, for the most part, are non-compliant with the federal securities laws and often have conflicts of interest.","Third, Commission staff is separately completing the review of registration statements for 10 spot bitcoin ETPs simultaneously, which will help create a level playing field for issuers and promote fairness and competition, benefiting investors and the broader market.","Since 2004, this agency has had experience overseeing spot non-security commodity ETPs, such as those holding certain precious metals. That experience will be valuable in our oversight of spot bitcoin ETP trading.","Though we’re merit neutral, I’d note that the underlying assets in the metals ETPs have consumer and industrial uses, while in contrast bitcoin is primarily a speculative, volatile asset that’s also used for illicit activity including ransomware, money laundering, sanction evasion, and terrorist financing.","While we approved the listing and trading of certain spot bitcoin ETP shares today, we did not approve or endorse bitcoin. Investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto."],"entity":[{"type":"2004","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"U.S. Court of Appeals","content":"ORGANIZATION"},{"type":"Jan. 10, 2024","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"ETP","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"the District of Columbia","content":"ORGANIZATION"}],"hashtag":["Bitcoin ETF","SEC","btc"],"authors":["Nick Baker"]}