{"summary":"El Salvador. The metaverse. Web 3 catalysts. Ethereum’s future.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/24\/10-2022-predictions-from-pwcs-henri-arslanian\/","publishDate":"2021-12-24T16:02:34","id":16196,"type":null,"title":"10 2022 Predictions From PwC’s Henri Arslanian","category":["Consensus Magazine"],"content":["2021 was a historic year for crypto with many milestones. And there are no signs of the momentum slowing down in 2022!","As per our tradition since 2015, here are my 10 crypto predictions for the coming year:","2021 saw the concept of the metaverse burst into the mainstream. Although many metaverse games and ecosystems have been around for many years, from Second Life to Roblox, Facebook changing its name to Meta in late October brought this to the forefront. It put the spotlight on the growing metaverse ecosystem. The likes of Decentraland and The Sandbox are good examples, each of which has seen tremendous growth. Expect that to continue in 2022, with every Fortune 500 company trying to figure out its own metaverse strategy.","Twenty years ago, every business had to suddenly come up with its e-commerce or online strategy. Now, every Fortune 500 company will need to think about its metaverse strategy. Expect consulting firms (like ours) to be all over this.","2021 was the year the broader world “discovered” the metaverse. 2022 will be the year it may go mainstream.","Last year, we predicted that 2021 would see many private banks enter the crypto market. And they did. 2021 saw many private banks, from Morgan Stanley to J.P. Morgan, launch bitcoin and crypto products for their customers.","Such products were a response to the demand for exposure to digital assets from many of the family offices and high-net-worth individuals. In addition, these products still offer high fees and high margins for private banks in an environment in which fee compression is becoming the norm.","Having such products are now seen as a competitive advantage for these private banks, and we will probably soon move to an era in which not having any crypto products will be a stark disadvantage.","Many large private banks disregarded bitcoin as not a serious asset (not having crypto-related products to sell probably did not help!). But we should expect most to do a 180 and introduce crypto offerings in 2022.","Read more: Pantera’s Paul Veradittakit’s 2022 Predictions","2021 saw El Salvador become the first country in the world to recognize bitcoin as legal tender. The positive effects are already being recorded: According to El Salvador’s President Nayib Bukele, more people there now have a bitcoin wallet than a bank account, allowing the 70% of the population that receives remittances to be able to do so without the excessive fees, which can balloon up to 12.5%.","Not surprisingly, the International Monetary Fund and the World Bank – two organizations that were created during the 1944 Bretton Woods Conference in which the U.S. dollar was adopted as the global reserve currency – have been very opposed to such moves, publicly warning El Salvador to reverse course.","Many politicians or policymakers in other smaller countries, especially those that are dollarized or de facto dollarized like Panama, or those in the developing world like Paraguay, could follow El Salvador’s footsteps.","Others may not want bitcoin per se, but could be interested in other forms of digital currencies. For example, Palau announced that it is looking at launching a government-backed stablecoin, and the Marshall Islands is already looking at introducing its own digital currency. And this often goes beyond emerging markets. For example, a recent survey found that 27% of U.S. residents support making bitcoin legal tender.","Expect many other jurisdictions to monitor how things develop in El Salvador closely. They may not necessarily directly follow in El Salvador’s footsteps and recognize bitcoin as legal tender in 2022, but expect the topic to be actively discussed.","Ethereum is the biggest smart contract and layer 1 platform by market cap. However, 2021 showed its legacy issues, from scalability struggles to exorbitant fees, with average transaction fees ranging from around $4 all the way to $70.","There is a lot of optimism surrounding Ethereum 2.0, which, coupled with recent changes like EIP-1559, has driven the price of ETH from $750 to $4,800 at its peak this year. Although Ethereum was the only serious show in town during the last major crypto bull market of 2017, there are now numerous layer 1 alternatives, from Algorand and Avalanche to Solana and Tezos, which not only provide better scalability but also come with significantly lower fees.","The crypto community is patient and has a lot of goodwill toward Ethereum. But unless the ETH 2.0 upgrade happens on schedule, the network risks losing many of its users, who could ultimately determine that the grass may be greener on some of the other blockchains.","Web 1.0 was the static internet, represented by the likes of AOL and Netscape. Web 2.0 is an engaging internet, but controlled by the large tech players like Meta and Google. Web 3.0 is an internet that is decentralized and permissionless, but also one in which users have control of their data.","The convergence of non-fungible tokens (NFTs), decentralized finance (DeFi) and the metaverse is leading us toward a Web 3 ecosystem. And the catalyst here may be the video game industry.","There are more than 2.5 billion gamers around the globe, and frustration has been mounting in recent years over the outsized control exercised by some of the large gaming companies, from the inability of these players to own their in-game assets to the lack of interoperability with other games.","2021 showed us the power of DeFi and NFTs in gaming, in addition to the power of decentralized play-to-earn models like Axie Infinity and its 2 million-plus monthly active players. With the numerous funds popping up that are exclusively focused in the sector, Solana’s $150 million Web 3.0 gaming fund being a perfect example, expect this market to catalyze.","2021 saw NFTs come under the spotlight, with the total sales volume surging past $12 billion. Several splashy, high-profile sales led the way, from Beeple’s $69 million jpeg to the numerous multimillion dollar sales of CryptoPunks and Bored Ape Yacht Club NFTs.","The euphoria around NFTs (and the sky-high valuations) may fade, but the reality is that NFTs are here to stay. Expect them to become more mainstream and even invisible in day-to-day interactions.","We should expect to see NFTs featured in everything from limited edition sneakers and high-end purses to sports tickets and in-game collectibles as this medium becomes the standard rather than the exception.","The big question here now surrounds the legal, tax and accounting considerations around such NFTs, which are far from being clear. From a legal perspective, what are the considerations around intellectual property or consumer rights? From an accounting perspective, do NFTs represent an IP licensing right or an intangible asset? From a tax perspective, what are the considerations around revenue from the issuance of an NFT or the ongoing royalties?","A recent PricewaterhouseCoopers survey found that only 7% of tax authorities globally provide any form of tax guidance on NFTs. In 2022, that needs to change. Guidance will be beneficial not only to tax or regulatory authorities, but to the general public, as well.","2021 was a banner year for CBDCs. Not only did we see groundbreaking projects in the field of wholesale CBDCs, from Hong Kong’s Project mCBDC Bridge to Singapore’s Project Dunbar, we also saw numerous retail CBDCs take shape, from Nigeria’s eNaira to The Bahamas’ sand dollar.","But all eyes in 2022 will be on China with the upcoming launch of its e-CNY. The country has already processed around $9.7 billion in e-CNY transactions under its different pilot programs. More than 140 million Chinese residents already have their e-CNY wallet.","China’s latest cryptocurrency ban and the start of the Beijing Winter Olympics in February pave the way for the launch of the e-CNY early next year. This will be a historic moment in the world of money.","As we predicted last year, DeFI continued its rapid growth in 2021, with total value locked growing from just shy of $22 billion at the end of 2020 to over $250 billion today.","DeFi is without a doubt one of the most exciting areas in finance today, with new offerings from decentralized exchanges and lending to asset management and even insurance offerings being improved on a daily basis.","Some of the features of DeFi, such as composability, give us an opportunity to reimagine financial services with a first principles approach, something that we have not had the opportunity to do in several decades.","And that is attracting not only record levels of assets but, most importantly, talent, with many bright minds laser focused on this market.","DeFi will affect not only traditional financer but also centralized exchanges, especially when trading on DEXs becomes more user friendly. Centralized platforms will continue to exist and play a big role, especially as a fiat on-ramp and for new entrants, but they will need to cohabit increasingly with DEXs.","Until July, around 65% of global bitcoin mining took place in China. Following the ban there, almost all of that activity moved to countries friendlier to bitcoin mining, such as Canada, Kazakhstan, Russia and the United States.","The United States has already become the biggest bitcoin miner on the globe, with its share of activity skyrocketing from 4% back in late 2019 to more than 35% following the ban in China. With some of the regulatory uncertainty in countries like Kazakhstan, we should expect the U.S. share of mining activity to continue to grow over the coming months.","The main advantage here is that bitcoin mining will become greener. About 57% of bitcoin mining globally today uses renewable sources of energy, according to the Bitcoin Mining Council, an industry group, with that percentage being higher in the United States. Bitcoin mining could ultimately accelerate the growth of such renewables, from being a buyer of last resort to making renewable energy production more sustainable. This could also help when it comes to addressing the looming environmental, social and governance (ESG) debate.","Many initially thought of the China ban as a negative development. It may end up as one of the biggest positive catalysts in our industry. Expect to see the positive consequences play out in 2022.","As we predicted last year, 2021 turned out to be a record year for crypto mergers and acquisitions. According to some data sources, 2021 crypto M&A amounted to over $25 billion in value.","We should expect this to continue in 2022, particularly with crypto unicorns increasingly transforming into crypto octopuses by spending some of their bull market gains and acquiring or investing in firms that offer ancillary services to their current offerings.","In particular, firms that offer access to retail communities, ecosystems, content or data, or some combination of those, should be interesting acquisition targets for some of these crypto platforms. Same goes for firms that are regulated in key markets, thus enabling access and faster go to market strategies.","We should also expect some of the larger financial services firms, especially those that were late to embark on their crypto journey, to look for potential acquisitions.","In 2022, the crypto M&A party will be far from over!"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"El Salvador","content":"LOCATION"},{"type":"4%","content":"PERCENT"},{"type":"$9.7 billion","content":"MONEY"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Panama","content":"LOCATION"},{"type":"1944","content":"DATE"},{"type":"$69 million","content":"MONEY"},{"type":"Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"27%","content":"PERCENT"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"Beijing","content":"LOCATION"},{"type":"2 million","content":"MONEY"},{"type":"$25 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"65%","content":"PERCENT"},{"type":"Netscape","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club NFTs","content":"ORGANIZATION"},{"type":"Dunbar","content":"PERSON"},{"type":"Marshall Islands","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"Second Life to Roblox","content":"ORGANIZATION"},{"type":"multimillion dollar","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"ESG","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"12.5%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"$4","content":"MONEY"},{"type":"57%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"Algorand","content":"LOCATION"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"AOL","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$22 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$250 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"last year, 2021","content":"DATE"},{"type":"1559","content":"DATE"},{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$12 billion","content":"MONEY"},{"type":"Palau","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"Bretton Woods Conference","content":"ORGANIZATION"},{"type":"$750","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Paul Veradittakit","content":"PERSON"},{"type":"$70","content":"MONEY"},{"type":"PricewaterhouseCoopers","content":"ORGANIZATION"},{"type":"$4,800","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["Predictions","Crypto 2022","China","El Salvador","Bitcoin Mining","DeFi","Banking","Metaverse","Ethereum","NFTs","Digital Yuan","ESG","Web 3.0","Mergers"],"authors":["Henri Arslanian"]}