{"summary":"Tangible is looking to move past its failed stablecoin after learning the liquidity lesson the hard way.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/21\/collapsed-real-estate-backed-stablecoin-charts-path-to-recovery\/","publishDate":"2024-02-21T16:53:05","id":16194,"type":null,"title":"Collapsed Real Estate-Backed Stablecoin Charts Path to Recovery","category":["Finance"],"content":["The collapse of the real estate-backed stablecoin USDR last October threatened to leave its holders short millions of dollars. But the asset's issuer Tangible didn't walk away from the depegged stablecoin.","Instead, Tangible is getting closer to honoring redemptions of the stablecoin that should give holders 90 cents on the dollar with DAI and the final 10 cents in Tangible's own governance token, CEO Jag Singh told CoinDesk.","The path from failure to redemption sheds a light on the wonky tokenomics that underpin mixed-asset stablecoins, which attempt to hold their dollar peg through collateral that isn't always, well, a dollar. These constructions can have upside in good times but can go south in a hurry during a liquidity crunch.","That's basically what happened last October. USDR's promise was to offer holders extra yield by generating revenue via the U.K. real estate properties that gave it value. Holders who wanted out could also swap their USDR for DAI stablecoins – another component of its backing.","But a run on USDR's DAI holdings left the project short on swap liquidity. With no easy way for Tangible to quickly unload its real estate holdings, its USDR token fell from $1.00 to nearly $0.50.","\"We felt we would be able to meet redemptions but we knew there was always a risk, because tokenized real estate was not liquid,\" Singh said. He and his team learned they were wrong the hard way: \"A stablecoin can't really be backed by something that's not very, very liquid.\"","The irony, according to Singh, of USDR's October collapse was that it came days after the project published \"proof of reserves\" reports that definitively indicated Tangible had the real estate assets it claimed was backing the token. The market should have been assured by this information, he said.","Instead, \"a lot of strange on-chain activity\" on Oct. 11 forced USDR into a precarious position as coordinated wallets sold USDR en-masse to quickly buy it back at a heavy discount, Singh said. He pointed to a group of corporate raider-style arbitrage traders who stand to redeem millions of dollars worth of USDR when redemptions go live in the coming months.","The redemption itself hinges on the rollouts of Tangible's \"basket\" product, which for the first time will let investors access USDR's real estate backing on-chain. These baskets will contain NFTs that represent the legal right to the property. An investor who holds enough in baskets could burn their NFT and take legal ownership of the property itself, Singh said.","\"We're just reworking the product in a safer way that isn't pegged to the dollar,\" Singh said.","CORRECTION (Feb. 21, 2024, 17:44 UTC): Fixes the spelling of Jag Singh's first name.","Edited by Nikhilesh De."],"entity":[{"type":"Jag Singh","content":"PERSON"},{"type":"Jag Singh","content":"LOCATION"},{"type":"USDR","content":"ORGANIZATION"},{"type":"$0.50","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"90 cents","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"10 cents","content":"MONEY"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Oct. 11","content":"DATE"},{"type":"Feb. 21, 2024","content":"DATE"},{"type":"$1.00","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Singh","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["Stablecoin"],"authors":["Danny Nelson"]}