{"summary":"The Basel Committee, a Switzerland-based organization that plays a major role in setting banking regulatory standards for G20 countries, isn&#x27;t so sure about stablecoins after last spring&#x27;s crash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195864\/international-banking-regulatory-body-backtracks-on-stablecoins","publishDate":"2022-12-16T17:08:24","id":162,"type":null,"title":"International banking regulatory body backtracks on stablecoins","category":["POLICY"],"content":["A Switzerland-based organization that sets international banking standards released <a href=\"https:\/\/www.bis.org\/press\/p221216.htm\" data-v-f87c67ca=\"\">new proposed guidance<\/a> for banks to manage exposure to digital assets that retracts previous draft rules for stablecoins.","The Basel Committee on Banking Supervision, which expects to finalize a new framework for banking standards by 2025, published a new version of proposed guidance for banks to follow around the handling digital assets, including “tokenized traditional assets, stablecoins and unbacked cryptoassets.”","The new draft incorporates stakeholder feedback and recent developments in crypto markets, like the algorithmic stablecoin crash last spring, and retracts an effort to allow stablecoins to be stress-tested based on whether they could be sold for an amount that closely tracks its peg value.","Instead, it recommended stablecoin exposure for banks be supervised along existing prudential capital and liquidity requirements placed on traditional financial institutions, and that any testing of stablecoin exposure be done in addition to that, rather than instead of it.","Banks would also have to limit their exposure to certain tokens to less than 1% of their core equity assets — called Tier 1 capital — among other guidance, including criteria to determine which digital assets are safer than others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Basel Committee on Banking Supervision","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"1%","content":"PERCENT"}],"hashtag":[],"authors":["Colin Wilhelm","The Block"]}