{"summary":"BlockFi denied claims that it has “secret financials,” after unredacted court documents showed the firm has a $1.2 billion exposure to FTX and Alameda Research, CNBC reported.\nThe failed crypto lender filed for bankruptcy protection in November.","author":["Stephanie Murray","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205565\/blockfi-has-no-secret-financials-after-filings-show-1-2b-exposure-to-ftx-alameda","publishDate":"2023-01-25T13:07:11","id":162,"type":null,"title":"BlockFi has no &#x27;secret financials&#x27; after filings show $1.2b exposure to FTX, Alameda","category":["Companies"],"content":["Failed crypto lender BlockFi says it “disclosed accurate information” to a New Jersey bankruptcy court after an unredacted court filing showed the firm has a $1.2 billion exposure to troubled exchange FTX.","BlockFi had $831 million in loans to the crypto trading firm Alameda Research and $416 million in assets tied up with FTX, according to court documents, which is $200 million more than was previously known. The filing was first reported by CNBC.","“Stating that these numbers are ‘secret financials’ is inaccurate,” BlockFi said in a statement to The Block. “Throughout the Chapter 11 process, BlockFi has prioritized transparency.”","BlockFi&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">filed<\/span><\/a> for bankruptcy protection in November, weeks after FTX and Alameda filed for bankrutpcy. FTX, which <a href=\"https:\/\/www.theblock.co\/post\/154929\/ftx-blockfi-deal-sources\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">sought<\/span><\/a>&nbsp;to acquire BlockFi in June, is among the lending firm’s largest creditors, according to court documents.","A person familiar with BlockFi’s operation also said claims that the firm employed several people making an average $823,000 a year in salary were inaccurate, noting that no one at the firm earned that much. BlockFi’s chief people officer is requesting the court increase salaries to keep staff from leaving the firm amid its ongoing bankruptcy process.","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>"],"hashtag":[]}