{"summary":"The offbeat and controversial computing platform goes through growing pains as it seeks wider adoption through crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/09\/27\/an-urbit-airdrop-highlights-promises-and-problems-of-permissionless-development\/","publishDate":"2022-09-27T18:55:03","id":16209,"type":null,"title":"An Urbit Airdrop Highlights Promises and Problems of Permissionless Development","category":["Consensus Magazine (layer2)"],"content":["MIAMI – Urbit, the alternative version of the internet that’s been under active development for the better part of a decade, now has a native blockchain and token. The news came unexpectedly last week, after a long-time Urbit user known as ~doplur announced the project and an associated token airdrop on Twitter and internal Urbit message rooms – causing a fair amount of consternation and debate.","The launch of the community-driven project, dubbed Urbit Virtual Machine (UVM), represents the latest step the controversial Urbit project has taken into the world of crypto, as Urbit insiders attempt to build what they call \"sound computer\" infrastructure. It also highlights how a recent surge in public interest and developer count could lead Urbit to places never envisioned or desired by its committed user base.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","The blockchain is what’s known as an Ethereum Virtual Machine (EVM), a type of cryptocurrency network built to run decentralized applications that could plug into and replicate the things built on Ethereum, the world’s second-largest blockchain.","See also: 'More Bang for Less Byte': ICOs Confront Growing Pains | (2017)","\"For better or worse, EVM is the language of DeFi,\" doplur said in an interview at the Assembly conference in Miami last weekend, referring to decentralized finance. \"There is a huge amount of capital on Ethereum, and if we want Urbit to be relevant there needs to be a way to communicate between the networks.\"","The launch of UVM comes at a time when Urbit coders are actively attempting to court decentralized autonomous organizations (DAOs) and DeFi to the platform. Its suite of applications, many of which launched in recent months, could rival centralized crypto mainstays like Discord and Slack. The recently launched Uqbar Ethereum layer 2 network gives Urbit native crypto utility.","\"While they are trying to grow adoption, I don’t think the Urbit community necessarily want 'crypto types' to invade overnight and dilute the mission, at least not until there is immunity against the meaningless charades we see in crypto,\" Michelle Lai, an early Anchorage Digital hire and Urbit enthusiast, said.","For some in Urbit, UVM’s airdrop and white paper was reminiscent of the initial coin offering boom of in 2017 – a period now remembered for its litany of unfinished projects and outright scams, when “crypto devs” could raise millions of dollars from retail investors looking to buy into projects like “decentralized Uber” or “Dentacoin.”","\"They shipped before they had a usable product,\" Lane Rettig, a core developer of crypto community Spacemesh and former Ethereum Foundation coder, said. Urbit’s message boards were lit up with people questioning whether the functionality would ever be needed, he added, though Rettig chose to withhold his own opinion on the matter.","Urbit, which was founded by controversial blogger Curtis Yarvin (aka Mencius Moldbug) and which was built primarily by the company he founded and stepped back from, Tlon, hasn’t followed the traditional model of network development favored by the Silicon Valley software industry (often summed up as “move fast and break things”).","See also: Urbit Is Web3, Weird and Wonderful and I Don't Care Who Built It","Instead, it has unfolded slowly – aiming for the grandiose aim of giving everyone a personal server from which to run any type of computer application (like email, web browsing and online payments). Initially, the janky virtual computer was accessible only by the command line. For years, essentially the only service available was a stripped-down messaging platform and weather app.","\"For anyone who has followed the project, it seems like an organic process,\" Pax Dickinson, former chief technology officer of Business Insider and founder of Urbit infrastructure builder Wexman Systems, said in an interview. To date, Urbit was built primarily by the well-funded San Fransisco-based organization Tlon, which allowed it to take shape deliberately – from its two bespoke programming languages on up – and follow a clear roadmap.","Doplur's UVM system is among the first major projects to go live on Urbit without Tlon's involvement or funding from one of its sister agencies, like the Urbit Foundation. Doplur said he started work on the project a few months ago after \"Urbit NYC Week,\" and hopes to receive financial support for his efforts \"some day.\"","It's worth noting that one of crypto's great innovations is the ability to self-fund projects through token launches – solving what is sometimes called the \"cold start problem” of gaining potential users and financial runway for a new network. However, Lai and Rettig both note how one of Urbit's charms is that it has avoided the \"financialization\" of crypto so far.","\"You’ll find people who hate crypto here,\" Lai said. Assembly, the Miami conference, brought together a number of high-profile speakers from the world of crypto (including figures like Balaji Srinivasan, the former chief technology officer of crypto exchange Coinbase and DAO expert Aaron Wright) and the wider culture world (like author Walter Kirn, filmmaker Alex Lee Moyer and internet historian Katherine Dee).","For years, users of Urbit were self-filtering: Only those that could grok its peculiar argot and understand the tech ended up staying around. But the project is rapidly gaining cultural relevancy, and efforts are being made to more easily onboard users.","The new token was airdropped to 4.5 million Ethereum addresses, including all users who have an .eth wallet address as well as all Urbit “ship” holders, in an attempt to spur adoption, doplur said. The blockchain’s validation process will open this week, giving people a chance to stake their tokens and earn yield. A healthy fraction of the tokens was held in reserve to pay for later network development, including bridges to Ethereum, privacy tools and scaling products.","\"We noticed our first meme coin a few hours after launch! We are excited to see what the community comes up with,\" doplur said. $URBIT is not yet fully bridged to the wider crypto economy, and doesn’t yet have a price.","Although the $URBIT launch has yet to break into the wider crypto conversation, it is a possible sign of difficult conversations to come as Urbit continues to grow. Permissionless systems are open for anyone to add onto and use, probably in ways that a network’s first group of highly committed users never intended.","\"Nothing on Urbit needs to be sanctioned! It's open source, public infrastructure. Anything can build anything they want. In general, it's great for the system when people experiment,\" Tlon CEO Galen Wolfe-Pauly said via email. He added that “Urbit will definitely be a place where commerce happens” and tokens are to be expected.","Doplur said a more decentralized EVM chain tethered to Urbit could also encourage Ethereum developers to “refocus” on censorship resistance, amid rising concerns about potential network takeovers after Ethereum’s shift to a proof-of-stake system and the government sanctioning of Tornado Cash, the Ethereum-based cryptocurrency mixer.","Urbit’s official Twitter account said users should approach UVM with “caution.”","\"I’m not connecting my (digital wallet) MetaMask for this 'free AirDrop',\" Lai said, showing how she’s being cautious for now.","UPDATE (SEPT. 27, 2022 – 23:55 UTC): Adds context about UVM's founding.","CORRECTION (SEPT. 28, 2022 – 13:10 UTC): Corrects Josh Lehman's title in the photo caption.","CORRECTION (OCT. 4, 2022 – 18:10 UTC): Pax Dickinson's company is Wexpert Systems, not Wexman Systems. We regret the error."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"Tlon","content":"PERSON"},{"type":"Urbit enthusiast","content":"ORGANIZATION"},{"type":"Urbit","content":"PERSON"},{"type":"Josh Lehman","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Urbit","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"$URBIT","content":"MONEY"},{"type":"last weekend","content":"DATE"},{"type":"Michelle Lai","content":"PERSON"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Urbit Foundation","content":"ORGANIZATION"},{"type":"OCT. 4, 2022","content":"DATE"},{"type":"Pauly","content":"ORGANIZATION"},{"type":"Aaron Wright","content":"PERSON"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"SEPT. 27, 2022","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Assembly","content":"ORGANIZATION"},{"type":"Lane Rettig","content":"PERSON"},{"type":"Lai","content":"PERSON"},{"type":"Curtis Yarvin","content":"PERSON"},{"type":"Ethereum Foundation coder","content":"ORGANIZATION"},{"type":"UVM","content":"ORGANIZATION"},{"type":"Galen Wolfe","content":"PERSON"},{"type":"Urbit","content":"ORGANIZATION"},{"type":"Alex Lee Moyer","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Pax Dickinson","content":"PERSON"},{"type":"San Fransisco","content":"LOCATION"},{"type":"Rettig","content":"PERSON"},{"type":"Katherine Dee)","content":"PERSON"},{"type":"Walter Kirn","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Wexman Systems","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"SEPT. 28, 2022","content":"DATE"}],"hashtag":["Opinion","The Node","Newsletters","Decentralization","EVM","Airdrops"],"authors":["Daniel Kuhn"]}