{"summary":"Cred’s bankruptcy filing mainly blames fraud by an outside party. The full picture painted by former employees is more complex, and highlights the risks of the budding crypto lending market.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/11\/12\/bad-loans-bad-bets-bad-blood-how-crypto-lender-cred-really-went-bankrupt\/","publishDate":"2020-11-12T17:45:16","id":16202,"type":null,"title":"Bad Loans, Bad Bets, Bad Blood: How Crypto Lender Cred Really Went Bankrupt","category":["Finance"],"content":["","The takeaway:","","","When Cred filed for bankruptcy protection on Saturday, the cryptocurrency lender told the public only part of the story, according to seven former employees interviewed by CoinDesk.","","","The company’s Chapter 11 filing attributes Cred’s decline to former Chief Capital Officer James Alexander and his decision to on-board an asset manager who was later alleged to have committed fraud. The firm also singles out Alexander’s alleged “misappropriation” of customers’ digital assets, which, the filing claims, limited the company’s ability to hedge against fluctuating crypto prices. The bankruptcy filing, signed by CEO Dan Schatt, further cites legal fees associated with a lawsuit in which Alexander and Schatt are entangled. ","","","But the fuller picture, painted by former employees (most of whom spoke on condition of anonymity) and customers underscores the risks and lack of transparency in the budding crypto lending market.","","","Read more: The Case for Bitcoin Banking (Despite Cred’s Bankruptcy)","","","For starters, Cred’s investment with the allegedly fraudulent asset manager was worth a little over $10 million, insiders said. Yet, as of Nov. 7, Cred had $67.8 million in assets, supporting $136 million in liabilities, according to a slide presented by law firm Paul Hastings LLP in a bankruptcy hearing Tuesday. (In August and September, the company raised $2.6 million in equity, the filing shows.)","","","“If you add the totals up, $10 million alone can’t bankrupt Cred. There’s a lot else going on,” said Daniyal Inamullah, the company’s former head of capital markets.","","","Schatt, a former PayPal executive who co-founded Cred in 2018, could not be reached for comment on this story. CoinDesk also reached out to several executives in San Mateo, Calif.-based Cred’s C-suite on LinkedIn with no response.","","","One salient fact missing from the bankruptcy filing, the former employees said, is that Schatt and others also approved of Cred’s investment in the asset manager’s fund, unnamed in the filing, which the former employees identified as Quantcoin. ","","","Based in Delaware, Quantcoin was set up to generate yield on investors’ bitcoin, primarily through the use of derivatives, and it was one of four funds that Cred’s investment committee chose to invest in, former employees said. ","","","“James certainly led the [Quantcoin] diligence efforts, that was on him given he was head of capital markets [at the time],” said Inamullah. “But Dan signed off on the deal. It went through the investment committee, which is responsible for asking the right questions and doing the right diligence.” ","","","The committee’s initial investment in Quantcoin was 500 BTC in March (worth about $4.45 million at the time), and the committee eventually increased that to 800 BTC in April ($6.2 million then and about $12 million now). ","","","Soon, it was as good as gone. ","","","Read more: Cred Says Fraudulent Activity Led to Loss of Funds; Law Enforcement Investigating","","","Quantcoin’s manager disappeared in August and stopped returning emails, Inamullah said. According to multiple former employees, the FBI is looking into the manager's disappearance. Citing U.S. Department of Justice policies, the FBI declined to comment.","","","But even if Quantcoin took Cred for a ride, that’s not all that sunk the company, insiders said. ","","","In May 2018, Cred raised $26.4 million worth of ether (ETH) in an initial coin offering (ICO), but the proceeds lost value because the firm did not cash out until late 2018 after ETH had fallen in value, one former employee said. ","","","Initially, the company placed its bets on a business model popularized by firms like Celsius and BlockFi: Offering crypto-backed fiat loans so traders could buy more crypto and other borrowers could make big purchases like buying a car without spending their original assets. ","","","After the markets crashed that fall, Cred pivoted in December 2018 by rolling out an earnings product called Cred Earn, which was similar, at least superficially, to a certificate of deposit at a bank. Alexander, then the chief capital officer, oversaw the product.","","","The new product’s users signed unsecured notes to Cred, closer to lending money to a company than depositing it in an FDIC-insured bank, one employee said. (According to insiders, in the first quarter of this year the company’s capital markets team proposed a liquidation plan that would have prioritized repayment to Cred Earn noteholders over other creditors in the event of failure. The plan would have also avoided the legal fees associated with bankruptcy. Schatt rejected the plan, the sources said.)","","","Of Cred’s $136 million in liabilities, $114 million is owed to holders of Cred Earn notes, who number somewhere between 500 and 1,000, Inamullah said.","","","Under Schatt’s direction, Cred built a system by which Cred would convert the crypto loaned by depositors to yuan and funnel it to a Shanghai-based consumer lending platform called moKredit. ","","","In turn, moKredit used the funds to offer microloans to Chinese borrowers, with interest rates of over 40%, according to former Cred employees. The Chinese lender is led by Cred co-founder Lu Hua, who also did not respond to requests for comment. ","","","Read more: Visa Adds Crypto Lender Cred to Fast Track Payments Program","","","Schatt and Hua knew each other from their time at PayPal, where Schatt was the head of financial innovations. A well-known leader in the payments world, Schatt has presented at international conferences such as the United Nations Development Program Roundtable on Remittances.","","","Cred extended what was essentially a warehouse line of credit to moKredit, which lent the funds out to consumers. moKredit would collect a 20-point spread, and Cred would give its customers 10% (if they locked up their funds for six months) and keep the remaining 10% as profit, the sources said. (The bankruptcy filing says that Cred’s loans to moKredit were made at interest rates of 15% to 24% per annum.)","","","All told, moKredit has $39 million in loans to Chinese borrowers outstanding, according to the bankruptcy filing. ","","","According to former employees, the loans were two-week-term microloans for less than $200 each. Cred’s warehouse line of credit to Hua had a 30- to 60-day call provision, meaning the lender was allowed to demand full repayment within a month or two, depending on the portion of the line. ","","","After the COVID-sparked market crash in March 2020, Cred tried to call back $10 million from moKredit but moKredit was not able to return the funds, the former employees said. (The investment committee also asked several times that the full principal of the warehouse line be called, but each request was blocked by Schatt, these employees said.)","","","Hua told Cred that a loan forgiveness program from the Chinese government made it difficult for him to recall the loans from borrowers. Instead, he made a deal with Cred to pay an amortization of a couple-hundred grand a month along with the interest payments on the line of credit. ","","","So far, Hua has paid around $4 million out of the $40 million, Inamullah said, and he also noted that the investment committee never agreed to the renegotiated repayment schedule.","","","Several employees noted that the bankruptcy filing neglects to mention Cred’s calling of $10 million in March or moKredit’s failure to repay in full at that time. The filing simply attributes moKredit’s renegotiated payment program to “depressed financial markets” in May 2020.","","","“That doesn’t forbid a borrower from repaying principal,” Inamullah said. “It just extends their ability to repay the principal. … Why didn't Cred move forward with the notice of default and start bankruptcy proceedings for moKredit?” ","","","The moKredit situation also compounds the difficulty of ascertaining what Cred's assets are truly worth.","","","Read more: Cred Taps Former NSA, Western Union Bosses for Leadership Team","","","Inamullah also said Cred’s holdings of three obscure cryptocurrencies – TAP, LBA and UPT – valued at $14.5 million in the filing, should be considered worthless because the market for each of these coins is illiquid. ","","","Since Cred’s borrowers are unlikely now to get their collateral back, the $9.8 million of those loans should also not be counted towards the company’s assets, Inamullah said. ","","","From his estimates, this would mean the company has about $45 million if moKredit can repay – and $6 million if it cannot. ","","","Cred has also taken other hits to its balance sheet.","","","A June 2020 email reviewed by CoinDesk shows that the lender entered into a series of derivatives trades with JST Capital, based in Summit, N.J. After the March 2020 bitcoin crash, JST liquidated Cred's positions, costing the lender over $14 million, a former Cred employee and the email indicated.","","","JST Capital spokesman Kevin McGrath confirmed the firm did business with Cred, but disputed some details of the former employee's account, without elaborating. \"We do not comment on our trading activity with current or former clients,\" McGrath said. \"In March, we terminated our business relationship with Cred and became a creditor.\"","","","The asset troubles made it harder for Cred to honor its liabilities. For most of its history, the company has been using customer funds to pay out redemptions and interest on the earnings product, several former employees said. Normally, this wouldn’t be a “big deal” if the company had positive net assets, Inamullah said.","","","But, too many bad loans and investments laid bare the hazards of operating what was in essence a fractional reserve bank, especially without the usual protections of federal deposit insurance and “prudential” regulatory oversight. (Cred has just a California lending license, according to its website.) ","","","“There’s a fine line between being a Ponzi scheme and being a bank,” Inamullah quipped (though echoing a view long advanced unironically by economists of the Austrian school).","","","And like a bank, Cred became vulnerable to runs. The company would not have been able to pay its debts if many customers tried to redeem at once, several former employees said.","","","In May 2020, Alexander left Cred to start Cred Capital, a separate company. It would conduct Wall Street-style activities (securitization, wealth management) without putting Cred’s commercial bank-like business at risk. ","","","At the same time, Cred took a stake in the new entity in order to diversify its interests so it would be less dependent on moKredit and Hua, according to several people inside the firm. ","","","Quickly, the arrangement soured. ","","","In July 2020, Schatt fired Alexander and took over Cred Capital. That same month, Alexander sued Cred in California’s San Mateo County, alleging Schatt had illegally reincorporated Cred Capital, of which Alexander was the sole director. Also that month, Cred filed a countersuit against Alexander that alleged he had improperly incorporated Cred Capital and was attempting to make off with more than $2 million worth of cryptocurrency. ","","","The bankruptcy filing claims Hua loaned 300 BTC to Cred to maintain a hedging position and that Alexander used some of it to pay Cred Capital vendors and made off with the rest. Former Cred employees disputed these claims – the 300 BTC was the purchase price of Cred’s stake in Cred Capital, they said, so the funds rightfully belonged to the latter.","","","The suits remain pending.","","","Cred Earn customer Jamie Shiller said he wasn’t given the full picture when he decided to invest in the CD-like product.","","","The company explained its business model as making collateralized loans and loaning creditor assets to other lenders that had strong balance sheets, Shiller said. ","","","At the 2020 CoinAgenda Caribbean conference, Schatt told attendees Cred had the ability to repossess corporate borrowers' receivables so that it would have an early response system in case anything went wrong with these borrowers. \"We can actually seize assets on their balance sheet,\" Schatt said in his recorded talk, which Shiller transcribed.","","","“The company has never said anything about a big asset manager or Quantcoin,” Shiller said. “I had to do all my own research to be able to figure this stuff out.” (Shiller has been in contact with several former Cred employees.)","","","Instead of the savings product he thought he was buying, “we were investing in a crypto fund-of-funds,” Shiller said. ","","","“If I was investing in a crypto quant fund I would have expected a higher return than 6% on Ethereum,” he said. “They were very recklessly misrepresenting what they were doing ... without the same yield and without disclosing the risks.”","","","UPDATE (Nov. 12, 20:00 UTC): Added attribution to an email documenting Cred's relationship with JST Capital.","","","UPDATE (Nov. 12, 21:45 UTC): An earlier version of this article misquoted Jamie Shiller as attributing a statement to Cred's CFO. CEO Dan Schatt was the one who made the statement. The passage has been corrected.",""],"entity":[{"type":"Paul Hastings LLP","content":"PERSON"},{"type":"San Mateo","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"December 2018","content":"DATE"},{"type":"Nov. 7","content":"DATE"},{"type":"Alexander","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"JST","content":"ORGANIZATION"},{"type":"Schatt","content":"PERSON"},{"type":"United Nations Development Program Roundtable","content":"ORGANIZATION"},{"type":"Inamullah","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"May 2018","content":"DATE"},{"type":"$14.5 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$4.45 million","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"August","content":"DATE"},{"type":"$39 million","content":"MONEY"},{"type":"Dan","content":"PERSON"},{"type":"San Mateo County","content":"LOCATION"},{"type":"$136 million","content":"MONEY"},{"type":"Quantcoin","content":"PERSON"},{"type":"Quantcoin","content":"LOCATION"},{"type":"March 2020","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$45 million","content":"MONEY"},{"type":"July 2020","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"Kevin McGrath","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Shiller","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"fall","content":"DATE"},{"type":"Inamullah","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$12 million","content":"MONEY"},{"type":"Western Union Bosses for Leadership Team","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"$67.8 million","content":"MONEY"},{"type":"Daniyal Inamullah","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$114 million","content":"MONEY"},{"type":"$14 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"$26.4 million","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"CoinAgenda Caribbean","content":"ORGANIZATION"},{"type":"Nov. 12","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"Dan Schatt","content":"PERSON"},{"type":"May 2020","content":"DATE"},{"type":"June 2020","content":"DATE"},{"type":"Lu Hua","content":"PERSON"},{"type":"$4 million","content":"MONEY"},{"type":"McGrath","content":"PERSON"},{"type":"$6.2 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"$2.6 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Cred Taps Former NSA","content":"ORGANIZATION"},{"type":"N.J","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"LBA","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"24%","content":"PERCENT"},{"type":"James Alexander","content":"PERSON"},{"type":"Jamie Shiller","content":"PERSON"},{"type":"the first quarter of this year","content":"DATE"},{"type":"$9.8 million","content":"MONEY"},{"type":"JST Capital","content":"ORGANIZATION"}],"hashtag":["Bankruptcy","Cred","Crypto Lending"],"authors":["Nate DiCamillo"]}