{"summary":"The venture capitalist discusses non-ZIRP monetary policy, rebooting crypto’s market structure and why Ponzi bubbles always burst.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/04\/28\/defi-needs-more-than-synthetic-high-yield-products-dragonflys-haseeb-qureshi\/","publishDate":"2023-04-28T21:33:32","id":16212,"type":null,"title":"DeFi Needs More Than ‘Synthetic High-Yield Products’: Dragonfly’s Haseeb Qureshi","category":["Consensus Magazine"],"content":["Haseeb Qureshi is a managing partner of Dragonfly Capital, a well-watched crypto venture firm, and the moderator of one of crypto’s best podcasts, “The Chopping Block.” Both are roles he takes on with equanimity and poise. In the aftermath of the Terra fiasco, Qureshi wrote one of the most lucid articles about why the blockchain collapsed. Following FTX, he corralled his podcasting partners – including his Dragonfly colleague Thomas Schmidt, Gauntlet’s Tarun Chitra and Compound creator Robert Leshner – into doing a series of informative episodes on the fall of FTX. And as a VC, Qureshi has keen foresight but is afflicted with the same problem all humans share: an inability to foreknow.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","Still, when it comes to understanding the current moment in crypto he’s more or less unmatched. Or, at the very least, he’s not afraid to be a little contrarian. At Consensus 2023, for instance, Qureshi argued that CertiK, an auditing firm with a less-than-stellar reputation, was making a mistake by offering to reimburse victims of Merlin, a decentralized finance (DeFi) protocol Certik had recently audited. “This is explicitly insurance,” Qureshi said, arguing that if this move is repeated it would push premiums for audits without necessarily improving their accuracy because firms would expect to have to make payouts. CoinDesk caught up with Qureshi to talk about the state of crypto venture capital, the regulatory environment and why Ponzi schemes will always collapse.","Read full coverage of Consensus 2023 here.","How has your investment thesis changed in a non-ZIRP [zero interest-rate policy] environment?","The biggest change has been the demand for [decentralized finance]-sourced yield. This was a big theme of what made DeFi attractive in a ZIRP environment. Now the appetite for risk has totally changed, so in order to gain traction with consumers, you have to do more than just create synthetic high-yield products.","You've said in the past that one of crypto's particular selling points is permissionless innovation. Are there emerging trends that have developed this past year that you didn’t see coming.","Nope, I predicted everything perfectly. I also knew you would ask this question.","Don’t you have a hot take on the Cosmos ecosystem?","The Cosmos community is an army of generals. A community founded on the basis of radical independence from other chains is, unsurprisingly, unable to agree on stuff.","Following FTX there have been numerous calls to rethink crypto's market structure. Are there ways to redesign centralized exchanges (like separating trading from custody or adding a centralized clearing house) that you'd support?","Separating trading from custody is the obvious one. Prime brokers like Hidden Road and FalconX are already facilitating this. Post-FTX (and post the Binance Commodity Futures Trading Commission suit), institutional players are no longer comfortable facing risky exchanges directly and taking on counterparty risk. In that regard, we'll see the same disaggregation of financial layers that you see in [traditional finance].","See also: Mike Belshe – The SEC's Custody Rule Would Be a Net Positive for Crypto | Opinion","Do you believe that VCs should be subject to similar lockup periods on token stakes as they currently are on equity stakes?","To be clear, equity stakes are not necessarily locked up. There's nothing that generally stops a company from selling its equity via a secondary transaction (unless the board specifically prohibits such sales). The thing that usually stops them is the reputational damage of doing so. The same is true of tokens. But yes, in general we push for long lockups when we make investments, both for investors and for the team.","In 100 years, will there be more or fewer monies?","Fewer.","Is it better to be able to do what you want or feel compelled to do what you must?","It is better to feel compelled to do what you must. It doesn't feel as good, but it leads to a life better lived.","Are there ways of designing crypto systems that have network effects without \"Ponzi-like\" attributes?","Ponzi schemes don't have network effects (they are not networks). They don't even have economies of scale – that is, they don't get easier to sustain the bigger they get. It's the reverse – the bigger they get, the harder they are to sustain. That's why Ponzi schemes that are small can survive for a while, but the bigger they get, the more likely they are to pop.","Do you think mass automation will finally cause U.S. productivity to increase\/time spent working to shrink for most people? Bonus: any thoughts on why the past century-plus of techno progress has not increased leisure time?","I think it will cause productivity to increase, but I think it will lead to very unequal effects on time spent working. Poorer people will work less, wealthier people will work about the same I would guess, because wealthy people tend to like their jobs more.I think the way we are measuring increased leisure time is not well-measured. We do a lot more leisure at work now than we did in the past. It's difficult to quantify one for one.","Edited by Ben Schiller."],"entity":[{"type":"Haseeb Qureshi","content":"PERSON"},{"type":"Compound","content":"ORGANIZATION"},{"type":"Mike Belshe","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Merlin","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Hidden Road","content":"ORGANIZATION"},{"type":"Binance Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Thomas Schmidt","content":"PERSON"},{"type":"” Qureshi","content":"PERSON"},{"type":"Qureshi","content":"PERSON"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"Robert Leshner","content":"PERSON"}],"hashtag":["Opinion","Dragonfly Capital","Haseeb Qureshi","Interview","Consensus 2023"],"authors":["Daniel Kuhn"]}