{"summary":"With a spotlight on bitcoin and other digital assets, a looming U.S. spot bitcoin ETF approval and rising client interest, it may be time to start considering adoption for your practice. We understand that there is much to learn. We've got you covered if you haven't started learning about crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/01\/04\/crypto-for-advisors-digital-assets-in-2024\/","publishDate":"2024-01-04T16:45:00","id":16211,"type":null,"title":"Crypto for Advisors: Digital Assets in 2024","category":["Finance"],"content":["Welcome to 2024!","If you follow the market news about bitcoin, you will have seen the price increase at the end of 2023 in anticipation of U.S. approval of spot bitcoin ETFs. Applicants had until Dec. 29 to update their applications with the SEC in anticipation of possible approvals in early January.","Are you ready to answer client questions about this asset class? Are you familiar with direct ownership vs ETF ownership?","The Crypto for Advisors newsletter is committed to providing industry news to support advisors in navigating this asset class. In this issue, CoinDesk’s Kim Greenberg collaborated with Adam Blumberg, co-creator of the Certified Digital Asset Advisor course, and DJ Windle from Windle Wealth to provides a guide to getting started, cutting through the noise and disinformation prevalent in the space, and simply helping you begin your learning journey. Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","With a spotlight on bitcoin and other digital assets, a looming U.S. spot bitcoin ETF approval and rising client interest, it may be time to start considering adoption for your practice. We understand that there is much to learn, especially when digital assets are only part of a broader portfolio of client assets. We've got you covered if you haven't started learning about crypto. Here are five digital asset fundamentals:","1. What is Bitcoin?","Bitcoin (BTC) is the world's first decentralized cryptocurrency, using blockchain technology to secure and verify transactions.","Let's break that down:","The bitcoin protocol was created to have a total of 21 million coins; once the amount of coins in circulation reaches that number, the protocol will stop minting new coins. A feature of the Bitcoin software is that it uses a coin creation method known as \"bitcoin halving.” This ensures the amount of bitcoin distributed to miners as rewards reduces over time (though transaction fees could still increase). A bitcoin halving (sometimes called \"halvening\") happens every 210,000 blocks, occurring roughly every four years, with the next event set in April 2024. At that point, the bitcoin creation will go from 6.25 new bitcoin every 10 minutes to 3.125. By gradually decreasing the supply of new bitcoin entering circulation, the theory is that the limited supply of the asset should help support its value.","Now let’s explore bitcoin’s performance relative to other asset classes, shown in the table below. Important items to note:","For more on bitcoin, the Bitcoin Infographic from Deloitte is a good resource to showcase additional bitcoin basics.","2. Understanding the Regulatory Landscape","The global regulatory approach towards bitcoin and digital assets exhibits significant variation, reflecting the diverse perspectives on this innovative technology.","United Arab Emirates (UAE): The UAE showcases a forward-looking stance towards blockchain and cryptocurrencies. It has established a clear regulatory framework that fosters the growth of crypto-based businesses and exchanges, positioning the UAE as a potential central hub for digital asset activities.","European Union (EU): The EU has taken a structured approach with its comprehensive regulations named the Markets in Crypto-Assets (MiCA). This framework aims to safeguard consumer protection and financial stability within the crypto market, indicating a cautious yet organized regulatory mindset.","Hong Kong: Hong Kong has also moved towards providing more clarity in crypto regulations, fostering a safer and more transparent environment for digital asset transactions.","United States (U.S.): The regulatory environment in the U.S. is characterized by its complexity and delayed progress. Without a unified federal-level regulation, the management and trade of digital assets remain uncertain. Political views on cryptocurrencies vary widely, with some seeing them as essential for economic freedom and others expressing concerns about their potential misuse due to anonymity.","The U.S. is currently considering the approval of a spot bitcoin ETF and is developing guidelines for the issuance and use of stablecoins. The judiciary has suggested that comprehensive cryptocurrency regulations should originate from Congressional legislation rather than SEC enforcement actions, underscoring the need for clear and well-defined laws.","This array of regulatory attitudes underscores the dynamic nature of the cryptocurrency world. As digital assets continue to gain prominence, the creation of cohesive and effective regulatory frameworks will be pivotal for their sustainable integration into the global financial system.","3. There’s more than bitcoin.","While bitcoin is really its own animal, the rest of the crypto ecosystem jumped on the idea of a decentralized network to create additional blockchains. Over time, the share of bitcoin in total market capitalization has declined, and other cryptocurrencies have established themselves as market players, though bitcoin's value currently represents more than that of all other digital tokens combined.","As trends in crypto global market cap will tell us, other digital assets are emerging and some analysts say the world will need a broad based digital asset benchmark that includes - but isn’t limited to - bitcoin.","The global cryptocurrency market cap today is $1.81 Trillion. As cryptocurrencies tend to lead headlines, broadly speaking, other types of digital assets include non-fungible tokens (NFTs), stablecoins, central bank digital currencies (CBDCs) digital bonds and tokens.","4. Classification and Vernacular","As the broad spectrum of digital assets grows, how does one categorize this sprawling and ever evolving landscape? Several institutions have attempted to classify digital assets, similar to the MSCI GICS framework.","One such framework is the Digital Asset Classification Standard (DACS), created by CoinDesk Indices. DACS provides digital asset and crypto taxonomy with reliable, comprehensive and standardized industry definitions and classifications for digital assets. Other frameworks include: The Goldman Sachs, MSCI, and Coin Metrics Datonomy, the Digital Asset Taxonomy System (DATS) by Wilshire, A Taxonomy of Digital Assets by Milken Institute and others.","Using a classification framework to shape and classify digital assets can facilitate portfolio attribution analysis and help pinpoint investment opportunities.","Along with classification is understanding crypto vernacular, which can be daunting. While there is no “centralized” vocabulary, several firms have created glossaries to help understand the terminology. For crypto terms, the Grayscale Glossary, the CoinDesk Glossary, and the AmiLearn Glossary are fantastic resources.","5. Implementation: 5 Steps to Consider","In today's rapidly changing financial world, embracing digital assets is becoming more of a necessity than a choice for financial professionals. Here's a friendly guide to help you weave cryptocurrencies and other digital assets into the fabric of your financial practice.","Educate Yourself and Network:","Client Education and Market Research:","Compliance and Legalities:","Advise on Investment Options:","Custodian Partnerships:","By implementing these steps, financial professionals should be able to effectively integrate digital assets into their practice, offering comprehensive services that combine innovative solutions with thorough compliance and client education.","In conclusion:","Cryptocurrency ownership continues to grow with the U.S. lagging behind several countries. With widespread global interest, regulations are evolving, and adoption is growing. Institutions, asset owners and asset managers are launching differentiated products, classification systems, broad-based benchmarks and educational resources to further crypto adoption. There are many tools to aid with understanding and practice management. It’s just a matter of getting started.","- Kim Greenberg, Adam Blumberg, DJ Windle","We are looking forward to an exciting year in digital assets. As this newsletter is intended to help advisors grow their knowledge and business, we encourage you to reply to this email with comments, questions and topics you’d like to see addressed for 2024.","We’re also excited to announce that those who are looking to complete the Certified Digital Asset Advisor (CDAA) course, with a one year learning subscription upon registration and appropriate qualification of a CRD (or foreign equivalent) may qualify for a free Pro Pass to Consensus valued at $1,149. Visit the registration page to sign up or learn more.","Jamie Dimon testified before Congress and stated, “If i were the government I’d shut crypto down. Four days later Dimon’s firm, JPMorgan, is listed to play a key role in BlackRock's spot bitcoin application.","Crypto ETF applicants were given until Dec. 29 to update filings.","What if the SEC doesn’t approve the spot bitcoin ETFs?","Edited by Bradley Keoun."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Taxonomy of Digital Assets","content":"ORGANIZATION"},{"type":"Windle Wealth","content":"ORGANIZATION"},{"type":"United Arab Emirates (UAE","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wilshire","content":"ORGANIZATION"},{"type":"Dec. 29","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"Grayscale Glossary","content":"ORGANIZATION"},{"type":"Milken Institute","content":"ORGANIZATION"},{"type":"Adam Blumberg","content":"PERSON"},{"type":"$1.81 Trillion","content":"MONEY"},{"type":"Market Research","content":"ORGANIZATION"},{"type":"Digital Asset Classification Standard (DACS","content":"ORGANIZATION"},{"type":"Dimon","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"CoinDesk Glossary","content":"ORGANIZATION"},{"type":"$1,149","content":"MONEY"},{"type":"Kim Greenberg","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"United States (U.S.","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"European Union (EU","content":"ORGANIZATION"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"DACS","content":"ORGANIZATION"},{"type":"AmiLearn Glossary","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Regulatory Landscape","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"CRD","content":"ORGANIZATION"},{"type":"DJ Windle","content":"ORGANIZATION"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Financial Advisers","Digital Asset","Digital asset classification standard","Regulation"],"authors":["Sarah Morton","Kim Greenberg","Adam Blumberg","DJ Windle"]}