{"summary":"The Securitize-backed feeder fund makes the flagship direct equity fund available to more investors.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/01\/31\/investment-manager-hamilton-lane-opens-first-tokenized-fund-with-securitize\/","publishDate":"2023-01-31T13:30:00","id":16214,"type":null,"title":"Investment Manager Hamilton Lane Opens Tokenized Fund on Polygon Blockchain","category":["Finance"],"content":["Hamilton Lane (HLNE) – an investment-management firm with $824 billion in assets under management and supervision – has opened the first of three \"tokenized\" funds that it had said it would create in an effort to give more investors access to private markets.","In October, the firm announced plans to tokenize three of its funds under a partnership with digital-assets securities company Securitize.","In a statement shared with CoinDesk, Pennsylvania-based Hamilton Lane said that its flagship Equity Opportunities Fund V recently closed with $2.1 billion in investor commitments and that the firm is making a portion of that accessible to individual investors through a tokenized feeder fund on Securitize that’s backed by the Polygon blockchain. The fund offers “diversified exposure to unique and differentiated deals through an efficient fee structure,” Hamilton Lane said in the statement. A feeder fund collects money from a pool an investors.","With the tokenized version of the feeder fund, the minimum investment amount drops to $20,000 from at least $5 million for the traditional version.","“The new Hamilton Lane tokenized fund is a major step in the continued democratization of the private markets by significantly expanding access to the historically high-performing private-equity asset class, particularly through reduced investment minimums,” Securitize co-founder and CEO Carlos Domingo said in the statement.","“Private equity has outperformed the S&P 500 by 70% over the past 20 years, but that performance has mostly been enjoyed by major institutions, sovereign wealth funds and university endowments. Individual investors can begin accessing these opportunities, too,\" he added.","Hamilton Lane plans to launch the previously announced two additional feeder funds, which offer exposure to private credit and secondary transactions, in the coming months.","Read more: Swiss Bank Cité Gestion Becomes First Private Bank to Tokenize Its Own Shares","UPDATE (Jan. 31, 16:12 UTC): Rewrites headline to add Polygon blockchain; adds Securitize to subhead.","\n","\n","\n","\n","\n"],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$824 billion","content":"MONEY"},{"type":"Hamilton Lane","content":"PERSON"},{"type":"Swiss Bank Cité Gestion Becomes First Private Bank to Tokenize Its Own Shares","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"Jan. 31","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Carlos Domingo","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$2.1 billion","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":["Securitize","Tokenized Assets","TradFi","investment fund"],"authors":["Brandy Betz"]}