{"summary":"Proof-of-stake is a method of maintaining integrity in a blockchain, ensuring users of a cryptocurrency can’t mint coins they didn’t earn.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-proof-of-stake\/","publishDate":"2022-09-16T18:47:17","id":16218,"type":null,"title":"What Is Proof-of-Stake?","category":["Learn"],"content":["Proof-of-stake is a method of maintaining the integrity of a cryptocurrency, preventing users from printing extra coins they didn’t earn. While a different method, called proof-of-work, is currently used by Bitcoin and Dogecoin, for example.","Both proof-of-work and proof-of-stake are what are called “consensus mechanisms,” the method by which a blockchain maintains its integrity. Consensus is what addresses the \"double spending\" problem of digital money. If there were any way the user of a cryptocurrency could spend their coins more than once, it would undermine the entire system. The currency would be worthless.","This is a tricky problem, especially with online currencies that have no central authority, such as a bank or a government, to keep track of how much money each person has, how they’re spending it, and whom they’re paying.","The Bitcoin network was the first to solve this problem with proof-of-work. Proof-of-stake has emerged as a possible alternative that some researchers think is both more energy efficient and more secure.","It's not so hard to prevent double spending in a centralized manner, when there's one entity managing a ledger of all the transactions. When Alice sends Bob $1, the manager of the central ledger simply takes $1 from Alice and gives $1 to Bob. PayPal does exactly that.","But cryptocurrencies are different. The goal is not to have one leader or entity in control of the system, which makes this record-keeping more complicated.","Instead of just one leader, thousands of users run the Bitcoin software all over the world. These \"nodes\" ensure the rules of the network are followed. This sprawling infrastructure needs to be tied together so all the software is in agreement. Otherwise these nodes will be disconnected islands.","It turns out it isn't easy to get these users around the world to agree with each other, so decentralized money was out of reach for researchers for a long time. Until Bitcoin came along. Proof-of-work is the innovative algorithm that Bitcoin creator Satoshi Nakamoto came up with, making decentralized money without a leader come to life for the first time.","Some argue proof-of-work has problems. As bitcoin mining has become concentrated, some groups have become more powerful than Bitcoin's creator intended. You often hear critiques that Bitcoin uses as much energy as all of Argentina or some other nation. Recently, a report from the White House said that crypto mining's energy consumption undermines U.S. sustainability goals. On the other hand, some argue Bitcoin's energy use is not that bad because the current financial system also uses plenty of energy.","In a nutshell, these proof-of-X schemes help to verify what transactions are added to the blockchain by way of blocks, which are filled with the latest transactions. The winner gets a reward.","Proof-of-work and proof-of-stake each pick a \"winner\" – the entity that will create the next block – in a different way.","With proof-of-work, miners are the participants. They are more likely to add additional blocks to the blockchain if they have more computational power, which is fueled by electricity.","In proof-of-stake, miners are more likely to win additional blocks if they have more money – ether, in the case of Ethereum. In other words, proof-of-stake relies on \"proof\" of how much \"stake\" users have.","Critics argue it hasn't yet been proven that proof-of-stake can eradicate all these problems. But advocates think it could be the way forward.","The most ambitious proof-of-stake rollout to date is the Merge, a series of upgrades that transitioned Ethereum from proof-of-work to proof-of-stake. Here's how it works, at a high level.","Special entities in proof-of-stake known as \"validators\" are charged with selecting the next blocks for the Ethereum blockchain.","Validators tie up some of their ether so they can't use it as they're participating in the proof-of-stake process. Similar to miners in proof-of-work, they are rewarded for taking part in this process.","Validators are awarded when:","They attest to a new block, meaning they accept it as accurate, saying it follows the rules.","To make sure validators don't fool around, Ethereum's proof-of-stake doles out penalties as well.","Penalties are dispensed when:","To become a validator for Ethereum, you will need to stake 32 ether, worth roughly $45,000 as of September, 2022, to run a validator node.","Not necessarily. This question is still up for debate.","Proof-of-stake has drawn more than a few critics. Blockstream Director of Research Andrew Poelstra wrote a mathematical paper back in 2015 saying proof-of-stake is \"fundamentally unable to produce a distributed consensus within Bitcoin’s trust model.\"","Critics also argue the system risks leading to more centralization. While blockchains are supposed to not have leaders in charge, critics worry that proof-of-stake would unintentionally steer blockchains back in the direction of centralized control, since users who have the most ether have the most power over the system.","But if proof-of-stake could be a greener alternative that can accomplish the same goals as proof-of-work, but more efficiently.","See also: Crypto Staking 101: What Is Staking?"],"entity":[{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"September, 2022","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"White House","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Blockstream Director of Research Andrew Poelstra","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Alice","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"$45,000","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Technology","Intermediate","Learn"],"authors":["Alyssa Hertig"]}