{"summary":"FTX’s bankruptcy estate paid $121.8 million in legal, consulting and financial services fees and expenses between February 1 and April 30, according to data compiled by The Block Research’s Greg Lim. \nFTX advisors submitted their expenses and fees on June 15. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235547\/ftx-paid-over-120-million-in-advisor-fees-between-february-1-and-april-30","publishDate":"2023-06-19T14:51:56","id":1621,"type":null,"title":"FTX paid over $120 million in advisor fees between February 1 and April 30","category":["Companies"],"content":["The legal and advisory costs for bankrupt crypto exchange FTX are mounting.","Filings submitted on June 15 by FTX's advisors show that fees and expenses for the period between February 1 and April 30 totaled $121.8 million, according to data compiled by <a href=\"https:\/\/www.theblock.co\/reports\" data-v-f87c67ca=\"\">The Block Research<\/a>.&nbsp;","FTX lawyers at Sullivan &amp; Cromwell billed the bankrupt exchange $37.6 million for the period, amounting to 30.9% of all fees and expenses. Investment banking firm Jefferies billed the lowest amount, making up 0.6% of the total fees and expenses.&nbsp;","Restructuring consultants at Alvarez and Marsel charged $37 million with over $1.1 million in expenses that included $51,225 in meals, $149,155 in lodging and other miscellaneous items amounting to $1,995.&nbsp;","\"As restructuring advisors, their claims and compensation sit on top of other claims and are 'super senior' to the unsecured claims bucket which includes customer deposits,\" The Block Research's Greg Lim.&nbsp;","The mounting costs of FTX's bankruptcy are fueling a movement among some former clients to reboot the exchange under new leadership to return value to customers.&nbsp;","Travis Kling, the chief investment officer at Ikigai Asset Management, once <a href=\"https:\/\/www.theblock.co\/post\/222461\/ftx-sbf-clients-want-reboot-despite-scam\" data-v-f87c67ca=\"\">referred<\/a> to a reboot as “one of the most bullish outcomes possible for creditors.” Ikigai held a majority of its assets on FTX.","Loomdart, an anonymous crypto personality, is leading the charge on a movement dubbed the FTX 2.0 coalition. In his view, the regulatory woes facing Coinbase and Binance make a relaunch more viable.&nbsp;","Per filings, FTI Consulting spent about 686.8 hours and billed fees of $761,997.70 on a workstream titled \"Exchange restart.\""],"hashtag":[]}