{"summary":"As of Friday, LayerZero has not outright mentioned how it intends to reward users for using its network.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/12\/08\/layerzero-confirms-airdrop-plans-boosting-some-ecosystem-projects\/","publishDate":"2023-12-08T08:20:10","id":16224,"type":null,"title":"LayerZero Confirms Airdrop Plans, Boosting Some Ecosystem Projects","category":["Markets"],"content":["Airdrop season is back in some parts of the crypto world.","LayerZero developers said Friday morning that they planned to issue a token sometime in the first half of 2024, confirming widespread rumors and causing an immediate uptick in the metrics of some projects built on that network.","The network is an interoperability protocol that uses a novel technique to make it easier for different blockchain networks to connect. Its developer, LayerZero Labs, raised $120 million at a $3 billion valuation in April.","“LayerZero has always been built with the ability to have a native token within the protocol, as seen in the immutable code launched on day 1,” developers said in an X post. “We’ve heard the community discussion over the last few months and the lack of clear communication around this.’","“We’ll state now in no uncertain terms that there will be a LayerZero token. We’re committed to getting its distribution right and expect it to happen within the first half of 2024,” they added.","Airdrops refer to the unsolicited distribution of a project’s tokens to its users, usually in return for tasks or liquidity.","These are often worth a lot of money. On Thursday, Solana ecosystem project Jito dropped its JTO token starting at 4,941 tokens and increasing depending on how much they used its so-called liquid staking token (LST), jitoSOL.","Some users claimed to have received as much as $200,000 worth of JTO tokens. Not everyone is selling, however, with some users supplying their holdings back to other Solana projects in hopes of more airdrops in the future.","Meanwhile, after the Friday announcement, some LayerZero ecosystem projects saw a boost in token prices and locked value.","Tokens of Stargate and Radiant Capital, two projects that use LayerZero, surged as much as 10% before quickly reversing.","As of Friday, LayerZero has not outright mentioned how it intends to reward users for using its network. However, popular strategies include merely interacting with LayerZero-based platforms by using their services, such as borrowing, trading or lending.","Edited by Parikshit Mishra."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"the first half of 2024","content":"DATE"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"$200,000","content":"MONEY"},{"type":"$120 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"first half of 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Radiant Capital","content":"ORGANIZATION"}],"hashtag":["airdrop","token","Trading","LayerZero"],"authors":["Shaurya Malwa"]}