{"summary":"A new service uses the Ripple network to acquire, store and convert precious metals into 'any currency'.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2014\/01\/31\/bullion-exchange-brings-ripple-into-the-physical-world\/","publishDate":"2014-01-31T12:57:53","id":16228,"type":null,"title":"Bullion Exchange Brings Ripple into the Physical World","category":["Markets"],"content":["A new service launching in Singapore today uses the Ripple network to acquire, store and convert precious metals into any currency for customers anywhere in the world.","Ripple Singapore","is a new kind of Ripple 'gateway’, which is the name given to the exchange network's entry and exit points. It's Singapore's first major gateway, and the first in the world to offer trade in precious metals.","Users maintain a balance in a Ripple wallet (similar to a bitcoin wallet), while the bullion itself is vaulted in Singapore. They can then use that balance to pay anyone instantly in any currency available on Ripple, or trade the bullion itself. Ripple Singapore's model charges 0.2% per transaction, and nothing for vault storage.","There are two ways to buy bullion with Ripple Singapore: Directly via its 'Bullion Counter' (for a minimum 10oz of gold\/platinum or 500oz of silver), or indirectly from other users, with no minimum at all. Anyone who wants to take physical delivery of their bullion may do that too, with two working days' notice.","Ripple Singapore is open to users in any country, though there is an identification and verification process to comply with Singapore regulations. Co-founder James Cox is a big believer in both precious metals' stability as a store of value and the integrity of the Ripple Network's technology.","Ripple Singapore has partnered with Silver Bullion Pte Ltd to store all metals. Gold and platinum are held at the Certis CISCO Center II (operated by Singapore's Auxiliary Police) and silver at Ferrari Logistics. Currency balances are kept with Singapore's OCBC Bank, the country's oldest.","Ripple","has so far been used only to exchange currencies (both fiat and digital) but, in theory, it can be used to exchange any item of value for any other – provided someone is offering it. Cox said Ripple Singapore capitalizes on the \"huge advantage\" of Singapore's investor-friendly tax regime and its growing reputation as Asia's precious metals hub:","\"Everyone still needs to do their due diligence on taxes in their own local area, of course, but in Singapore there's 0% tax on investment-grade bullion, and Ripple Singapore charge 0% vaulting fee. Ripple Singapore will cover costs via the 0.2% transaction fee.\"","To 'establish a trustline', or exchange value, on the Ripple Network, users must spend a small amount of its native currency, XRP. Ripple Singapore will even supply the XRP to its users at no cost to get things moving.","Cox explained XRP simply: \"Imagine each transaction on Ripple is a sealed envelope going from A to B, and XRP is the stamp on that envelope. The network is neutral regarding the the sender, receiver or the contents or value of the letter, it still requires an XRP stamp.\"","\"We will be giving away free XRP to our customers so they can get started without further ado. We hope our new customers enjoy that.\"","The Ripple Network itself is an open-source, decentralized distributed currency exchange, payment system and remittance network upon which anything of value can be traded. Ripple Singapore, however, is perhaps the first major gateway to demonstrate its utility in the physical world.","Cox believes the absence of an internet protocol for exchanging value has led to an imbalance of value around the world; something Ripple's technology will help to restore.","He added: \"So we've lost track of value. It's led to a wacky, even out-of-kilter kind of world where an ounce of silver is worth less than a cocktail in some places, and an acre of farmland in one place is worth less than a handbag elsewhere. Now Ripple allows us to send value, it will play a part in helping restore balance and sanity.\"","He added that five years from now, having a Ripple address will be as essential as an email address has become today.","Watch a video of Ripple Labs CEO Chris Larsen, talk with Money & Tech about his digital currency and distributed payment system below:","","Bullion image via Shutterstock"],"entity":[{"type":"Ferrari Logistics","content":"ORGANIZATION"},{"type":"OCBC Bank","content":"ORGANIZATION"},{"type":"James Cox","content":"PERSON"},{"type":"Silver Bullion Pte Ltd","content":"ORGANIZATION"},{"type":"Chris Larsen","content":"PERSON"},{"type":"Money & Tech","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Ripple Network","content":"ORGANIZATION"},{"type":"0.2%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"CISCO","content":"ORGANIZATION"},{"type":"Auxiliary Police)","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"0%","content":"PERCENT"},{"type":"XRP","content":"ORGANIZATION"}],"hashtag":["Ripple","Exchanges","Singapore","Asia","startups","Gold","News","Companies"],"authors":["Jon Southurst"]}