{"summary":"OmiseGo's OMG token is reporting double-digit gains today, possibly due to new listings on Asian exchanges.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/04\/26\/omisego-hits-two-month-high-amid-exchange-listings\/","publishDate":"2018-04-26T13:45:32","id":16221,"type":null,"title":"OmiseGo Hits Two-Month High Amid Exchange Listings","category":["Markets"],"content":["OmiseGo's OMG token is reporting double-digit gains today, figures that throw shade on the rest of the top 25 cryptocurrencies by market valuation.","Having clocked a two-month high of $20.67 earlier today, OMG is now changing hands at $18.20 on Bitfinex – up 15 percent in the last 24 hours. Meanwhile, OMG's BTC-denominated exchange rate jumped to a seven-month high (highest since Sept. 30) of 0.0023466BTC.","The price rise may be associated with the OMG's listing today on Bithumb, one of the biggest cryptocurrency exchanges in South Korea. The token was alo listed on Zebpay, one of India's largest cryptocurrency exchanges, yesterday.","According to the chart analysis, though, the outlook will remain bullish as long as prices hold above $14.40.","The bullish triangle breakout indicates long-term bearish-to-bullish trend change and has opened the doors for a retest of the record high of $28.50.","It's worth noting that the bullish breakout is matched by a 415 percent spike in 24-hour trading volume. So, the rally looks sustainable. Further, the momentum studies are biased to the bulls too, with both the 5-day moving average (MA) and the 10-day MA trending north.","OMG will likely take out the immediate resistance at $20.83 (Feb. 28 high) in a convincing manner and could rise to $28.50 (record high) in the near-term.","Only a daily close (as per UTC) below $14.40 (April 21 low) would signal bullish invalidation. Meanwhile, a drop below $12 would signal a bullish-to-bearish trend change.","UPDATE: This article has been updated to remove a link to a fraudulent website that was misrepresenting OmiseGo in an effort scam users. CoinDesk regrets the error.","Falling balls image via Shutterstock"],"entity":[{"type":"$20.83","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"earlier today","content":"DATE"},{"type":"$12","content":"MONEY"},{"type":"$20.67","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 21","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Feb. 28","content":"DATE"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"$28.50","content":"MONEY"},{"type":"OMG","content":"ORGANIZATION"},{"type":"Sept. 30","content":"DATE"},{"type":"15 percent","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"$14.40","content":"MONEY"},{"type":"$18.20","content":"MONEY"},{"type":"415 percent","content":"PERCENT"}],"hashtag":["price-news","News","Airdrops","Markets","OmiseGo","Markets News"],"authors":["Omkar Godbole"]}