{"summary":"Solend’s whale crisis rattled depositors and threatened to crash Solana. Can the lending protocol recover?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/27\/solanas-biggest-defi-lender-almost-got-rekt-then-binance-stepped-in\/","publishDate":"2022-06-27T20:29:22","id":16229,"type":null,"title":"Solana’s Biggest DeFi Lender Almost Got Rekt. Then Binance Stepped In","category":["Finance"],"content":["What happens when there’s a multimillion-dollar margin call and no one picks up the phone?","That eerie prospect threatened to become a nightmarish reality last week for Solend, Solana’s second-biggest decentralized finance (DeFi) outpost. Its single-largest user – a wallet with $107 million in USDC borrowed against $170 million in SOL collateral – was on the verge of liquidation and completely MIA.","Developers tried Reddit posts, on-chain messages, even Twitter memes, hoping to alert the anonymous account of its impending fate. The whale account needed to either pony up more collateral or reduce its position to ward off a catastrophic on-chain liquidation that, project leads said, could crash Solend – and maybe even Solana.","The frantic rush to save Solend exploded into a governance and power controversy that elicited accusations of DeFi hypocrisy on Crypto Twitter and beyond.","Ultimately, it was CeFi giant Binance who woke the whale, Solend’s pseudonymous co-founder Rooter told CoinDesk. The world’s largest crypto exchange delivered a message to the account on Rooter’s behalf.","“I’m sorry that this issue has caused concern in the Solana community and with the Solana team,” the user emailed Rooter on June 21, according to screenshots shared with CoinDesk. “There’s no hard feelings about the recent governance proposal.”","Read more: DeFi Protocol Solend Passes Governance Vote to Reverse ‘Emergency Powers’","After establishing contact, the whale began redistributing its Solend bets into other Solana DeFi outposts like Mango Markets – ending the most acute crisis without a single cascading liquidation. The price of SOL has recovered enough to quiet all the chaos – despite the heavy dose of momentary schadenfreude.","Solend’s liquidation debacle came as the turbulent crypto markets rattled DeFi protocols of all stripes, pushing purportedly decentralized governing bodies to make tough decisions that affect protocol users in lasting ways.","That can make for a messy cocktail. In “decentralized finance,” programmatic smart contract code – devoid of the human biases that might, say, prompt a banker to refuse a loan to a minority group – is meant to be the immutable law of the land.","Of course, reality is more complicated.","Solend’s crisis emerged because its protocol had set no limits on how big a borrower could be. That result: A single whale accounted for the vast majority of Solend’s SOL collateral and USDC loans. That collateral was at risk of liquidation if the price of SOL fell too low.","Solend’s smart contracts automatically send liquidation sell orders to DEXs when user collateral falls too low. They’re pure, programmatic. They don’t holistically check to see if a trade will crash the markets, or worse, the chain.","While billions of dollars in SOL trade hands every day, most of that action happens on centralized exchanges, not over the much more thinly traded DEXs, where DeFi cousin Solend routes its trades. DEXs don’t have enough liquidity to soak up the whale’s dump, meaning SOL’s price would crash – perhaps 60% or 80% – until buyers arbitraged it back up.","That itself was a problem, Rooter said: “It’s such a crazy art arbitrage opportunity and liquidation opportunity that bots would just flock.” That type of activity has crashed the entire Solana blockchain in the past.","Solend was sure to take the brunt of the pain. It would be left with bad debt, a depleted treasury, and a disenchanted user base. “It’s basically over for us and our users will lose a ton of money,” Rooter said, explaining what would happen if the smart contracts did what they were designed to do.","“We really have to do something now,” he said, recalling the outreach effort.","Bankers in traditional finance can address a comparable snafu with a “margin call” to clients whereby they lay out the stakes and explain the need for more collateral to secure a loan. After all, they know their counterparties’ identities; the borrower is a phone call or email away. That’s not the case with pseudonymous DeFi (though a handful of startups are working on inter-wallet messaging solutions, none of which Solend used).","Unable to broadcast their message privately, Rooter took the plea for the whale’s attention public on Twitter. This spooked users into pulling their money from Solend en masse, emptying the vaults much as would happen in a bank run. Rooter admits the tweets backfired.","“It kind of exacerbated our problems because then not only were we dealing with a risk that something might happen, but we’re dealing with an immediate problem that people’s funds were frozen.”","Their solution was a controversial proposal to grant Solend Labs “emergency powers” over the whale’s collateral. Once in control, the caretaker company would “gracefully” liquidate the whale via off-chain, over-the-counter (OTC) trading desks and in effect sidestep the market zero day. It would turn the USDC back over to the whale, resolve the crisis and right the markets.","That said, it would overrule the smart contracts designed to be in control.","And that’s where the optics became painful.","Many DeFi protocols put code changes up to the community. Their token holders get to vote on new listings, rate hikes, partnerships, that sort of thing. The bigger the user’s token trove, the weightier its opinion. It’s an imperfect system for managing purportedly decentralized systems, albeit a popular one.","Solend hadn’t ever held a DAO vote before. But Rooter said it needed to put the controversial solution before the community. On June 19, it proposed SLND1, the “emergency powers” package. Six hours later, the vote passed by 97.5% with just enough participation to meet the 1% quorum.","Read more: Solana DeFi Platform Votes to Control Whale Account in Bid to Avoid Liquidation 'Chaos'","Beneath SLND1’s apparent landslide was a less savory picture: a single wallet with 1.01% of the turnout tokens (a ballot whale, if you will) made the difference. Without its participation, SLND1 would have failed to reach quorum and flopped on the technical. It only passed in the affirmative because it voted in the affirmative.","Rooter said Solend’s team asked the ballot whale to vote after fretting over SLND1 low turnout. He said they did not ask the whale, who is active on Discord to vote yes or no, only that they participate. The ballot whale obliged.","“Users of the protocol have generally been very supportive. And then the critics tend to be like people on Twitter who have no stake or no deposits,” Rooter said.","SLND1’s critics were so loud and the media coverage so fierce that Rooter and the team proposed a new vote, SLND2, that would invalidate the first. It, too, passed after the ballot whale stepped in.","“The whale, again, basically swayed the whole vote,” Rooter said.","After a lot of hemming and hawing – the whale didn’t want to act just to appease “Crypto Twitter’s armchair experts,” Rooter said – as well as tech hiccups, the ballot whale voted yes with 14 seconds to spare.","A final, June 21 vote on SLND3 saw the community approve what is effectively a new borrower ceiling at $50 million. This too was designed to mitigate whale risk. (It also passed with the ballot whale’s critical “yes” vote).","By this point Rooter’s parallel outreach effort had finally yielded fruit: Binance had gotten the borrower whale’s attention, and they were in contact via email. Over the next couple of days, the situation slowly resolved.","Binance declined to comment on the Solend situation.","A spokesperson at the exchange confirmed it has been an intermediary between project teams and account holders in the past. The spokesperson said Binance never shares information without its users permission.","There’s plenty of repetitional damage. Observers from Solana’s VC community told CoinDesk they feared Solend had suffered an insurmountable setback with its series of governance votes.","It is “inertia versus terrible governance decisions,” said one researcher on Monday. He wasn’t sure which force would win.","Solend’s total value locked (TVL) has dropped 10% over the last week and nearly 60% in a month while second-tier Solana DeFi lenders such as Larix, Hubble and Oxygen have fared far better. Mango Markets has gotten the lion’s share of the whale redistribution.","Speaking to CoinDesk last Friday, Rooter struck a hopeful tone. By then, Solend had steered through the crisis without suffering a catastrophic liquidation.","“I think this sentiment is kind of improving. I mean, the PR blowback has also blown over at this point. Solend lost a bunch of TVL. But, you know, people can use it now,” Rooter said.","Solend remains the second-biggest DeFi project on Solana."],"entity":[{"type":"Larix","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"SOL","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Solana DeFi Platform Votes to Control Whale Account","content":"ORGANIZATION"},{"type":"$107 million","content":"MONEY"},{"type":"June 21","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"DeFi Protocol Solend Passes Governance Vote to Reverse ‘Emergency Powers’","content":"ORGANIZATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"Rooter","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$170 million","content":"MONEY"},{"type":"1.01%","content":"PERCENT"},{"type":"June 19","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Crypto Twitter","content":"ORGANIZATION"},{"type":"last Friday","content":"DATE"},{"type":"” Rooter","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"97.5%","content":"PERCENT"},{"type":"Solend","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Solana","DeFi","Crypto Lending"],"authors":["Danny Nelson"]}