{"summary":"Binance will pay the U.S. government $4.3 billion to settle criminal and civil charges.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/22\/binances-busy-day-krakens-second-sec-fight\/","publishDate":"2023-11-22T01:30:00","id":16233,"type":null,"title":"Binance's Busy Day, Kraken's Second SEC Fight","category":["Policy"],"content":["Binance is paying one of the largest fines in corporate history to the U.S. Department of Justice, while its founder and CEO, Changpeng \"CZ\" Zhao, stepped down from his role running the platform as part of a settlement with multiple federal agencies. Meanwhile, Kraken is facing a lawsuit from the U.S. Securities and Exchange Commission that echoes the SEC's previous wave of suits.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","Binance settled charges with multiple U.S. agencies (with one major exception), ending one of the most highly anticipated regulatory actions in crypto.","Binance is the world's largest crypto exchange by volume, and just agreed to pay what federal officials are describing as some of the nation's largest fines.","Binance and Changpeng \"CZ\" Zhao settled with multiple federal agencies on Tuesday, agreeing to pay billions of dollars in a deal that will also see Zhao face potential prison time, Binance make a \"complete exit\" from the U.S. and agree to strict oversight from monitors over the next several years.","If you missed Tuesday's regulatory extravaganza:","If you noticed the numbers don’t add up, you’re right. It’s a confusing mess, largely because the amounts overlap with each other and involve some financial punishments that are put off unless the company strays again. An actual total of $4.3 billion will move from Binance to U.S. government coffers, officials said. FinCEN is collecting $780 million. Another $150 million is a suspended penalty, while $2.47 billion will be credited to the DOJ and CFTC. OFAC will collect another $70 million and credit another $898 million to the DOJ. CoinDesk's Jesse Hamilton checked and the CFTC is for sure getting the $1.35 million fine.","So in total:","\"One of the things that [Treasury] works hard in collaboration with the Justice Department on is that a substantial amount of this penalty will go to the victims of state-sponsored terrorism in a fund that supports payments to those families and individuals,\" a senior Treasury official said.","Binance's role as a major crypto exchange that operated secretively within the U.S. is maybe the bigger story. The exchange targeted \"VIP users\" in the U.S. to drive its growth in the early days, court filings said. Zhao knew about this, and knew that somewhere around one third of his platform's users were from the U.S., and spent time figuring out how to conceal that these users were on the platform instead of removing them.","Moreover, the exchange had a lot of users from sanctioned locations, the DOJ alleged, citing Binance's discovery of \"600 'verified level 2' users from Iran\" in November 2019 as just one example. Nearly $1 billion in trades between U.S. users and users in sanctioned nations occurred on Binance's platform.","Many of the allegations are repeats or tied to what we saw in the CFTC lawsuit from March – that the exchange knowingly and deliberately allowed U.S. persons to trade on its platform without conducting know-your-customer or anti-money laundering checks, and without registering properly. The exchange allowed U.S. customers to trade against customers from sanctioned nations, which is pretty obviously illegal.","\"The Justice Department is also imposing a monitorship, as well as reporting requirements on Binance as part of today's resolution,\" Attorney General Merrick Garland said. \"Moving forward, Binance must file the suspicious activity reports that were required by law. The company is required to review past transactions and report suspicious activity to federal authorities. This will advance our criminal investigations into malicious cyber activity and terrorism fundraising, including the use of cryptocurrency exchanges to support groups such as Hamas.\"","The DOJ monitor will be in place for three years. FinCEN is also appointing a monitor who will be in place for five years, and who will be granted access to all of Binance's books and records.","This seems to go well beyond just U.S. users, and I imagine there are regulators around the world who may be interested in what exactly the U.S. finds in those past transactions.","There was one notable absence on Tuesday: Securities and Exchange Commission Chair Gary Gensler was not among the federal officials announcing settlements with the exchange.","There's an easy answer to why this may have been the case: The SEC is likely looking for court wins it can point to as part of its ongoing effort to treat crypto exchanges similarly to U.S. stock exchange systems. The other agencies secured wins and massive penalties, but most of those allegations were basically the same: Binance offered U.S. people access to products and services without following the law.","We'll get into this more below, but the SEC is currently on a mission to have crypto trading platforms divide up their exchange, clearinghouse and broker\/dealer functions, like how stock trading works. Binance (and more Binance.US than Binance.com) is one of those companies that doesn't treat these functions differently.","For more on Tuesday's actions, read our coverage.","On first blush, this suit sounds really familiar.","Many of the arguments tread familiar ground. Kraken is operating an unregistered securities broker, clearinghouse and exchange, the regulator alleged, offering the U.S. investing public access to similarly unregistered securities without making full disclosures to that public. We've seen this a few times before. The SEC has secured two settlements (which aren't nothing, legal precedent-wise, but which also aren't really a whole lot) and sued a few other exchanges which are currently fighting.","\"Without registering with the SEC in any capacity, Kraken has simultaneously acted as a broker, dealer, exchange, and clearing agency with respect to these crypto asset securities. In doing so, Kraken has created risk for investors and taken in billions of dollars in fees and trading revenue from investors without adhering to or even recognizing the requirements of the U.S. securities laws that are designed to protect investors,\" the suit alleged.","Unlike the Coinbase lawsuit, but similarly to the Binance and Binance.US suit, the SEC is alleging commingling of customer and corporate funds, as well as poor controls and recordkeeping – things \"that would also be prohibited at any properly registered securities intermediary,\" per the filing.","In a blog post, Kraken made the argument that the SEC hadn't alleged any customer funds were lost or that any customers were harmed. This is a similar argument to what Binance argued in its early defenses to the SEC lawsuit against it.","It's unclear how much this will actually matter though. As Judge Lewis Kaplan said during Sam Bankman-Fried's criminal trial, the issue isn't whether customers can or will be made whole, it's that the funds were taken in the first place.","\"The crime charged is that [Bankman-Fried] took the money … what he did with it afterward doesn't matter,\" he said last month.","On the other hand, Judge Amy Berman Jackson, who's overseeing the Binance case, was visibly frustrated when she was unable to get a clear answer to the question of whether Binance had moved customer assets overseas.","There's some important differences – Jackson was in a hearing where the SEC sought a temporary restraining order, civil versus criminal, etc. – but if this case does proceed to a trial, it is an important distinction that's likely to come up.","The other interesting detail from Monday's Kraken suit, which CoinDesk's Danny Nelson pointed out, is the SEC detailed how Kraken, specifically, promoted the various cryptocurrencies the regulator alleges are unregistered securities.","In previous suits, the SEC detailed how it believed different cryptocurrencies, like the FIL token associated with the Filecoin network, may be securities. But the suits usually ended those analyses with the focus on the tokens' issuers.","Tuesday's suit referred to \"public statements made by Kraken\" as the platform listing these digital assets and making them available to the investing public, where the exchange \"reinforced investors' reasonable expectation of profits,\" if they invested in the tokens.","Pretty important details, if you're trying to suggest the exchange deliberately violated federal securities laws.","This week","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!","Correction (Nov. 22, 2023, 16:10 UTC): Notes that Zhao's DOJ fine is credited against his CFTC fine."],"entity":[{"type":"FIL","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"November 2019","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"Zhao","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$898 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Danny Nelson","content":"PERSON"},{"type":"$2.47 billion","content":"MONEY"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$780 million","content":"MONEY"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"The Justice Department","content":"ORGANIZATION"},{"type":"$1.35 million","content":"MONEY"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Jackson","content":"PERSON"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Amy Berman Jackson","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Nov. 22, 2023","content":"DATE"},{"type":"Merrick Garland","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Iran","content":"LOCATION"},{"type":"$150 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Newsletters","State of Crypto","Regulations","Binance","Changpeng \"CZ\" Zhao","CZ","DOJ","Kraken","SEC","FinCEN","OFAC"],"authors":["Nikhilesh De"]}