{"summary":"The co-founder and spiritual leader of Ethereum has achieved more than most in his relatively short lifetime.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/31\/30-reasons-to-love-vitalik-buterin-on-his-30th-birthday\/","publishDate":"2024-01-31T22:25:25","id":16235,"type":null,"title":"30 Reasons to Love Vitalik Buterin, on His 30th Birthday","category":["Consensus Magazine"],"content":["Vitalik Buterin, the co-creator and spiritual leader of Ethereum, turned 30 today. It’s a date that he refers to as the “end of my childhood.” Buterin has achieved much in his time so far, and there’s much more to accomplish. The job of following Satoshi Nakamoto — a pseudo-no-person-hero was hard, but Buterin, by avoiding all ego, has been up to the task. In honor of his many achievements, CoinDesk has come up with 30 reasons to love Buterin. The list is, of course, incomplete.","1 - Vitalik tells it like it is: In 2017, at the height of the initial coin offering (ICO) boom, when the total crypto market cap topped half a trillion dollars, Buterin tweeted “have we *earned* it?” A fair question, considering many (but not all) of the biggest ICOs of the time have delivered nothing.","2 - His heart is in the right place: Vitalik’s mission in creating Ethereum was to build a “world computer” that can run any conceivable application. But throughout his career, he has constantly focused the spotlight on projects working to solve real world issues.","3 - He repays favors: Buterin learned about Bitcoin from his father at the age of 17. Now, both of his parents, Dmitry Buterin and Natalia Ameline, are working in the crypto industry. Ameline is helping to build Ethereum layer 2 Metis.","4 - Buterin was a bitcoiner’s bitcoiner: In 2011, around the time he was introduced to Bitcoin, Buterin started writing about the first cryptocurrency for now the defunct publication Bitcoin Weekly in order to learn everything he could about the emerging technology. Towards the end of that year, Buterin co-founded Bitcoin Magazine and became one of it’s most prolific writers, covering and thinking up ideas for Bitcoin that are still being discussed, like introducing native smart contracts and scaling the chain through secondary layers.","5 - He’s humble as Pi: He’s been on the Forbes 30 under 30 list, Fortune 40 under 40 list, has received honorary doctorates and has been the subject of many a magazine profile. Yet, no one can credibly say Buterin is in it for the money or fame. Go on, say it. Be wrong.","6 - Buterin has added to the discipline of economics: Together with Glen Weyl and Zoe Hitzig, Buterin helped develop a mechanism for fairly distributing funds without the need for a central decision maker, called quadratic voting. Today, the system is working across crypto, particularly in the decentralized app Gitcoin, which provides funding for public goods.","See also: Gitcoin Founder on Crypto for Public Good and Web3 Communities","7 - He’s generous, not just with his time, but money: Buterin has made numerous charitable donations in recent years, including to AI safety causes, human longevity research and other more practical concerns.","8 - Even when being catty, he’s doing good: In 2021, during the first break out of “dog tokens,” the team behind Shiba Inu sent Buterin about 50% of the circulating supply of SHIB, unprompted, in a blatant attempt to market the project. Buterin decided to donate those coins, worth over $1 billion at the time, to India's Crypto Covid relief fund.","9 - He speaks out for causes he believes in: Although born in Russia, Buterin has spoken out against his native country’s invasion of Ukraine, even tweeting this all-time gem, “Ethereum is neutral, but I am not” on the first day of the invasion.","10 - He’s a lover of the simple things: Buterin’s current bio on Twitter\/X, “mi pinxe lo crino tcati,” apparently translates to “I drink the green tea,” in the constructed, rules-based language Lojban. He is also known to mix green tea with red wine (no one is perfect).","11 - Impeccable fashion sense: Whether it’s a unicorn t-shirt, furry suit or a pair of glasses straight out of The Matrix, Vitalik certainly knows how to pull off a look.","12 - He is comfortable playing the fool: Here’s Vitalik sort of doing the “Badger Dance” at the opening ceremonies of Edcon 2018 in Toronto, Canada.","13 - He has a voice all his own: Somewhere between Professor Fink from The Simpsons and Kermit the Frog, Buterin’s unique tonal expression is one for the history books.","See also: Vitalik Buterin and Birth of Ethereum","14 - Buterin lets his thoughts evolve, and isn’t afraid of challenging himself later: Here’s a tweet thread of Buterin rethinking dozens of the things he’s said and written about. It was not the first or last time either.","15 - He’s not afraid to critique his heroes: Many crypto leaders cite James Dale Davidson and William Rees-Mogg’s “The Soverign Individual” as a favorite book, including Buterin. In 2020, he wrote a detailed walkthrough of the book’s core concepts, and how they apply to the digital world today, nearly 30-years on from the date of publication, discussing the things they get right and wrong.","16 - He’s an advocate for accessibility: Not only is Ethereum designed to be open and available to anyone with an internet connection, Buterin is constantly thinking of ways to lower fees, increase access and subsidize use, including some controversial means that other blockchain advocates might discard.","17 - He knows how to throw a shindig: Just ask anyone who went to Zuzalu, in Montenegro, a two month retreat and study session for people interested in crypto and longevity research.","18 - He practices what he preaches: Buterin is a frequent user of decentralized applications, from social media apps like Farcaster to donation protocols like Gitcoin, he may just be the platonic ideal of an Ethereum user.","19: He sees rival chains as zero-plus not zero-sum: When Solana was ravished after the collapse of FTX and Sam Bankman-Fried, who was closely tied into the blockchain’s ecosystem, Buterin tweeted: “smart people tell me there is an earnest smart developer community in Solana, and now that the awful opportunistic money people have been washed out, the chain has a bright future. Hard for me to tell from outside, but I hope the community gets its fair chance to thrive.” Not to overstate the case, but this single tweet did a lot to reaffirm conviction in a rival project. He doesn’t kick others when they are down, but instead offers a hand up.","20 - Although a techno-optimist, he’s practically minded: Take his blog post yesterday on the ways AI and crypto could interact. Buterin placed a large amount of emphasis on areas he thought were easiest to get right, i.e. having AI agents work on-chain where the “underlying mechanism continues to be designed roughly as before.”","21 - He knows how to coin a term: From the recent defensive\/decentralized\/differential acceleration, or d\/acc (a play on the hyper-aggressive, pro-tech and pro-capitalism e\/acc), which proposes that humans take a considered approach to technological progress, to the blockchain “trilemma,” Buterin has coined many words in common parlance.","22 - He’s a bit of an anarchist (in a good way): In addition to creating Ethereum, Buterin has made contributions to a number of more radical projects, including Cody Wilson’s supposedly censorship-resistant DarkWallet.","23 - He pays homage: The word Ethereum is often said to come from Ethernet, or the physical backbone of the internet. (Although some say it is also derived from “ether,” what was known as the fifth element in medieval times, which Buterin came across while reading Wikipedia.)","24 - He gives away ideas if he doesn’t have time to build them: Just take Uniswap, the largest decentralized exchange.","25 - He’s a master developer: This one seems self-explanatory, but if you need an example look at the Merge, a moment that is often described as “changing out an airplane engine mid-flight.”","26 - He embodies the best aspects of Ethereum’s “social layer”: In the aftermath of the infamous DAO attack, Buterin initially advocated for a soft fork of Ethereum, so that the chain’s history would not be broken. In time, in part due to technical challenges, the community opted for a “hard fork,” leading to two versions of the chain, Ethereum and Ethereum Classic. This moment is key in the history of crypto, because it shows that code is not always law, and people have a say over how a project should develop.","27 - He’s not in it for the money: In a recent blog post, Buterin lamented how money-focused the crypto industry has become. He wants to make \"Ethereum cypherpunk again.\"","See also: Vitalik Buterin on Ethereum's 'Roads Not Taken'","28 - He has a sense of humor: I’m not quite sure if he coined the terms Verge, Surge, Purge and Splurge to describe the coming phases of Ethereum development after the Merge, but he certainly goes along with it.","29 - He seeks revenge (when warranted): It’s well-documented that the inciting incident for the creation of Ethereum was that Buterin’s warlock character in World of Warcraft was, in his words, “nerfed.” After game developers Blizzard downgraded his favorite Siphon Life spell, Buterin began to think of ways to give people control over their digital lives. He’s also tracking Craig Wright’s movements.","30 - Vitalik is the leader crypto has always needed: In the absence that Bitcoin founder Satoshi Nakamoto left, someone has had to keep the ethos of decentralization, censorship-resistance and credible neutrality alive. Buterin has faced the tough job of remaining in the limelight while building a technology that runs affront to many of the most powerful institutions today. As he writes in his recent manifesto, he’s doing it because he thinks it’s right, that the aims of open source and open access technologies will ultimately benefit the world: “I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good.” Crypto is good, in part, because Vitalik is good.","CORRECTION (FEB. 1, 2024): Vitalik received 50% of the supply of shiba inu tokens at launch, not 5%, and Zuzalu was two months."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2011","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Zuzalu","content":"LOCATION"},{"type":"William Rees","content":"PERSON"},{"type":"Zuzalu","content":"PERSON"},{"type":"Buterin","content":"LOCATION"},{"type":"Buterin","content":"PERSON"},{"type":"Fink","content":"PERSON"},{"type":"Toronto","content":"LOCATION"},{"type":"Bitcoin Magazine","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Zoe Hitzig","content":"PERSON"},{"type":"James Dale Davidson","content":"PERSON"},{"type":"Montenegro","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Gitcoin Founder on Crypto for Public Good","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"Bitcoin Weekly","content":"ORGANIZATION"},{"type":"Dmitry Buterin","content":"PERSON"},{"type":"Vitalik","content":"PERSON"},{"type":"Cody Wilson","content":"PERSON"},{"type":"Natalia Ameline","content":"PERSON"},{"type":"Mogg","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The Matrix","content":"ORGANIZATION"},{"type":"Glen Weyl","content":"PERSON"},{"type":"FEB. 1, 2024","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["Opinion","Ethereum","Vitalik Buterin","Culture"],"authors":["Daniel Kuhn"]}