{"summary":"The Basel Committee on Banking Supervision has warned that the growth of cryptocurrencies poses a number of risks to banks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/03\/14\/cryptocurrencies-pose-risks-to-banks-warns-basel-committee\/","publishDate":"2019-03-14T10:01:01","id":16234,"type":null,"title":"Cryptocurrencies Pose Risks to Banks, Warns Basel Committee","category":["Markets"],"content":["The Basel Committee on Banking Supervision, a group of international banking authorities, has warned that the growth of cryptocurrencies poses a number of risks to banks and global financial stability.","The committee – part of the Bank for International Settlements (BIS), widely considered the central bank of central banks – published a statement on Wednesday, saying that potential risks for banks include liquidity, credit and market risks, operational risk (including fraud and cyber risks), money laundering and terrorist financing risk, and legal and reputational risks.","Although banks currently have “very limited” direct exposure to cryptocurrencies, institutions should still \"at a mimimum\" carry out extensive due diligence and disclose any exposure to crypto assets to minimize the risks, the committee said.","Banks should further have a “clear and robust” risk management framework to deal with the “high degree” of risk posed by cryptocurrencies.","The risk management framework should be “fully integrated” into banks’ overall risks management processes, including those relating to anti-money laundering (AML), combating the financing of terrorism (CFT) and evasion of sanctions, the committee said.","A “comprehensive” assessment of the risks should be incorporated into their internal capital and liquidity adequacy assessment processes, it added.","Additionally, supervisory bodies should be informed of actual or planned cryptocurrency exposure, along with assurance that the institution has fully assessed and mitigated the risks.","Finally, the committee said that it is working with other global standard-setting bodies and the Financial Stability Board (FSB) to arrive at guidance on “prudential treatment” of banks’ exposure to cryptocurrencies in order to “appropriately” reflect the risks.","Last June, BIS said in its Annual Economic Report that it's hard to see if cryptocurrencies solve any specific economic problem yet. “Transactions are slow and costly, prone to congestion, and cannot scale with demand,” it said at the time.","BIS tower image via Shutterstock "],"entity":[{"type":"Basel Committee on Banking Supervision","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Financial Stability Board (FSB","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"}],"hashtag":["Banking","Regulation","News","BIS","Bank for International Settlements","Basel Committee"],"authors":["Yogita Khatri"]}