{"summary":"They have 30 days to comply.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/02\/22\/canadian-crypto-trading-platforms-face-enhanced-rules-under-new-regulations\/","publishDate":"2023-02-22T17:34:14","id":16232,"type":null,"title":"Canadian Crypto Trading Platforms Face 'Enhanced' Rules Under New Regulations","category":["Policy"],"content":["The Canadian Securities Administrators published new guidance for the local crypto industry Wednesday, warning exchanges and other platforms they would have to abide by \"enhanced investor protection commitments.\"","According to a press release, companies hoping to operate in Canada would have to make these commitments through a pre-registration process while working on their actual registrations. They have 30 days to comply. In this pre-registration process, exchanges and other companies will have to abide by custody rules, which discuss segregating crypto assets held for local clients, a ban on margin or other forms of leverage and a ban on selling stablecoins without the CSA's permission.","In a statement, CSA Chair Stan Magidson, who also runs the Alberta Securities Commission, said, \"Recent insolvencies involving several crypto asset trading platforms highlight the tremendous risks associated with trading crypto assets, particularly when conducted on unregistered platforms based outside of Canada.\"","Read more: Canada Close to Tightening Rules for Crypto Exchanges: Sources","According to the notice, unregistered crypto trading platforms now have 30 days to publish a revised pre-registration undertaking, which may end up posted on the CSA's website. Companies that cannot or will not comply are \"expected\" to offload Canadian users and block the jurisdiction.","\"Specifically, the enhanced PRU will include additional commitments from the CTP to hold assets, including cash, securities and crypto assets that are not securities, of a Canadian client ... In the case of crypto assets, in a designated trust account or in an account designated for the benefit of clients with a custodian that comes within the definition of 'Acceptable Third-party Custodian,'\" the notice said.","Third-party custodians can be Canadian or foreign companies, according to the document, but require a SOC 2 type 1 or 2 report within the last year.","\n"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"CSA","content":"ORGANIZATION"},{"type":"Stan Magidson","content":"PERSON"},{"type":"Alberta Securities Commission","content":"ORGANIZATION"},{"type":"PRU","content":"ORGANIZATION"},{"type":"CTP","content":"ORGANIZATION"},{"type":"Canadian Securities Administrators","content":"ORGANIZATION"},{"type":"Canada Close to Tightening Rules","content":"ORGANIZATION"}],"hashtag":["Regulations","Canada","Regulators","Trading Platform"],"authors":["Nikhilesh De"]}