{"summary":"Factors driving a surge in NFT loans include BendDAO&#x27;s emergence and increased borrowing activity for Yuga Labs&#x27; NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212861\/nft-lending-experiences-resurgence-driven-by-benddao-and-yuga-labs-collections","publishDate":"2023-02-17T10:30:19","id":1624,"type":null,"title":"NFT lending experiences resurgence, driven by BendDAO and Yuga Labs&#x27; collections","category":["METAVERSE & NFT"],"content":["NFT lending has become a trend since the start of 2023, as the industry experiences a resurgence in key metrics. &nbsp;","On-chain data revealed that the total monthly borrowing in January across NFT loan protocols reached the highest level since mid 2022, <a href=\"https:\/\/www.theblockresearch.com\/current-state-of-nft-lending-208568\" data-v-f87c67ca=\"\">according<\/a> to a report from The Block Research.","The trend has been driven by a combination of factors, including a recent boom in NFT markets, the emergence of lending protocol BendDAO and a surge in lending activity around NFTs created by Yuga Labs.","BendDAO has already outpaced its competition by currently occupying a market share of 43%, while NFTfi lags with 32% of the total borrowing volume, according to The Block Research.&nbsp;","BendDAO's success is mainly due to its user-friendly platform, which allows users to borrow instantly to meet short-term liquidity needs. Unlike rival protocols that use the more common peer-to-peer alternatives, BendDAO enables users to extract liquidity from the protocol by taking out loans against pools of blue-chip NFTs, referred to as \"peer-to-pool.\"&nbsp;","Most lending and borrowing activity on BendDAO involves Yuga Labs' Bored Ape Yacht Club (BAYC) and Mutant Ape Yacht Club (MAYC) collections. This has become one of the main catalysts for the surge in NFT lending, according to Thomas Bialek, a researcher at The Block.","On BendDAO, MAYC and BAYC NFTs have accounted for the majority of loans, with 78% of all loan value taken using these two NFT collections, <a href=\"https:\/\/dune.com\/cgq0123\/Bend-DAO\" data-v-f87c67ca=\"\">on-chain data<\/a> aggregated on Dune Analytics shows.","","","A similar trend can be seen on other platforms. One report from research firm eBit Labs, shared exclusively with The Block, said that lending against Bored Apes \"spearheads the majority of NFT loans\" made across the three lending platforms: BendDAO, X2Y2 and NFTfi.","Short-dated loans for BAYC reached all-time highs in January, eBit Labs noted, adding that a large percentage of these loans are liquidated within a day or two.","\"The most likely reason for this NFT surge would be a continuation of the trend of the last few months, with BAYC and MAYC NFTs being the most widely used collateral for NFT-backed loans,\" Bialek said.","NFT lending platforms offer a solution for traders who want to access instant liquidity without having to sell their assets. The lending space first made headlines in the middle of 2022, but faced liquidity issues when floor prices fell. Now there seems to be a resurgence.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yuga Labs' Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"32%","content":"PERCENT"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"78%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Bialek","content":"PERSON"}],"hashtag":["BAYC","LENDING","MAYC"],"authors":["Vishal Chawla","The Block"]}