{"summary":"The biggest threat from the banking crisis triggered by this month’s collapse of Silicon Valley Bank might not lie in the potential for depositors to lose their savings but in the censorship power that massive banks are now accumulating as customers move their money.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/24\/bank-consolidation-threatens-freedom-makes-case-for-bitcoin\/","publishDate":"2023-03-24T17:13:46","id":16249,"type":null,"title":"Bank Consolidation Threatens Freedom, Makes Case for Bitcoin","category":["Consensus Magazine"],"content":["The developing world’s case for bitcoin is starting to resonate in the developed world.","I, like many, have long argued it’s easier to explain bitcoin to people who live within dysfunctional financial and political systems than to those from stable, developed economies such as the U.S. Such populations have PTSD from past hyperinflation. Just as importantly, they often have first-hand experience of how banks can act as gatekeepers to their money.","I’ll always remember an image I was greeted with when, in 2003, I relocated to Argentina amid the ongoing banking freeze imposed during its financial crisis: Buenos Aires bank branches encased in impenetrable cages to protect them from enraged customers, their steel walls emblazoned with graffiti against “banqueros ladrones” (thieving bankers). It shouldn’t be a surprise that a decade later, once that banking crisis had run its sad, inevitable course toward profligate fiscal and monetary solutions that fostered perpetual double-digit inflation, Argentina became a hotbed of bitcoin adoption and crypto innovation.","You’re reading Money Reimagined, a weekly look at the technological, economic and social events and trends that are redefining our relationship with money and transforming the global financial system. Subscribe to get the full newsletter here.","For now, I don’t see U.S. and European banks forced into the same Argentina-style shutdown. But the current banking crisis, which has introduced a new source of uncertainty to developed economies, points to a more subtle but arguably more dangerous threat to freedom that also underscores the importance of bitcoin.","That threat won’t necessarily come from the Federal Reserve or other central banks being compelled to pursue lax monetary policy that becomes inflationary. (Those buying Balaji Srinivasan’s wild bet on $1 million bitcoin price by June 17 are missing the point that, to start with, collapsing banks equals collapsing money creation – i.e., the crisis will have a deflationary effect, not an inflationary one. Only if the Fed were to go full Weimar Republic would that effect be offset by massive money-printing.)","Rather, it relates to the second part of that developing world experience: society’s vulnerability to the centralized control that banks exert over people’s savings and transactions. In overseeing the lifeblood of an economy, banks have unique, corruptible power.","The core issue is not that people’s deposits are at risk from there being too little federal insurance or bailout money to go around, though the problem that there’s a natural limit to that important backstop is another argument for bitcoin. It’s the concentration of banking power that fearful depositors are now enabling by pulling their funds out of small regional banks and funneling them into a few behemoths: Citibank, JPMorgan Chase, Bank of America, Wells Fargo, et al.","We are unwittingly exacerbating the same “too big to fail” problem exposed in the previous crisis of 2008, the idea that a handful of huge financial institutions hold such sway over our financial system that they can effectively hold the government hostage, taking on risk in the knowledge that the taxpayer will always bail them out. Over time, this system has entrenched an unholy relationship between Wall Street and Washington, D.C., one that’s inseparable from the gobs of money that financial institutions donate to politicians and from the revolving-door jobs that former regulators routinely get at those institutions.","What’s bothering me about this right now, however, is not the systemic risks but the wider problem that a state-sponsored banking oligarchy takes shape. These institutions are amassing collective censorship power over transactions, positioning themselves as illiberal gatekeepers of human behavior. This risk is intensified by the special SIFI (systemically important financial institution) status that the biggest banks were assigned in the regulatory response to the 2008 crisis.","The SIFIs are “not really, in the traditional sense, private enterprises,” said Galaxy Digital’s head of research, Alex Thorn, on this week’s episode of our “Money Reimagined” podcast. “They work with a specific government charter, with specific government obligations and protections … [The government] can tell the banks what they can and can't hold and what they can and can't do. I think that centralization is really acute at that big level, and the solutions put forth to these types of crises really just push it further in that direction.”","There are very clear signs, if not hardline proof, that governments and banks are coordinating a crackdown on crypto firms. There are accounts everywhere that startups in the crypto industry that had previously banked with failed entities Silvergate, Signature or Silicon Valley Bank are getting rejections as they try to open new bank accounts. And although the New York Department of Financial Services swears that its closure of a seemingly solvent Signature Bank two weekends ago was not motivated by the bank’s exposure to crypto clients, Reuters reported that the FDIC, which took it over, has been demanding that any future buyer will have to relinquish the bank’s crypto business. The FDIC later denied that assertion.","Observers are calling this “Operation Choke Point 2.0,” an allusion to an unofficial Obama era policy in which banks were pressured to restrict access to the financial system for businesses such as gun sellers and pornographers. Regardless of the Securities and Exchange Commission’s spate of recent lawsuits against industry leaders and regardless of what some people in the wider population think of “crypto bros,” there is nothing inherently illegal about being a digital asset service provider. As with the Obama-era dragnet, this “shadow banning” of legal but politically unfavored activity is rightfully seen as a breach of those entity’s rights, which is probably why governments never formally admit that such policies exist.","The thing about public-sector agencies getting these private-sector entities to do their dirty work is that it allows the government agency plausible deniability, which makes it difficult for victims of discriminatory enforcement actions to plead their case before a judge. The Fed’s bank supervisors provide “guidelines” to bank compliance officers, not explicit instructions. It’s a deliberately ambiguous extra-legal strategy, one that you will find rife among authoritarian regimes.","To be clear, I’m not saying the U.S. has become authoritarian, but that the evolution of these relationships is a pathway toward it. We need to have our eyes wide open to it.","What’s at issue is much more than whether crypto firms can write and deposit checks. It’s that as banking becomes concentrated among a few huge, tightly regulated institutions, a very real threat to human freedom arises. Without the capacity to transact, people can be blocked from engaging in many otherwise legal activities that are unpalatable to the powers that be.","This is why bitcoin censorship-resistant money matters. It offers an alternative to dependence on that banking system. Just as it has provided a lifeline to young women in Afghanistan whose gender prevented them from opening bank accounts, to Ukrainian refugees and activists in Nigeria, it now offers an opt-out financial option for people in the U.S. and elsewhere.","For bitcoin to be important it doesn't need a massive number of people to use it. What matters is its mere existence as an alternative. The fact that the option is there for people if and when they need it makes it harder for bankers and governments to constrain freedom.","Two decades ago, Argentines didn’t have a way out of the banks’ trap. Now, people do. That is a game-changing situation.","Edited by Ben Schiller."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Weimar Republic","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Obama","content":"PERSON"},{"type":"Alex Thorn","content":"PERSON"},{"type":"Argentina","content":"LOCATION"},{"type":"U.S","content":"LOCATION"},{"type":"2003","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Wells Fargo","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Afghanistan","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"June 17","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"Citibank","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Opinion","Newsletters","Money Reimagined","centralization","Bitcoin","Argentina","emerging markets","emerging markets and developing economies","banks","Silicon Valley Bank","Signature Bank","Silvergate Bank"],"authors":["Michael J. Casey"]}