{"summary":"Music NFTs are about to disrupt an industry full of gatekeepers and middlemen.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/16\/music-nfts-are-set-for-an-explosive-2022\/","publishDate":"2021-12-16T13:43:58","id":16243,"type":null,"title":"Music NFTs Are Set for an Explosive 2022","category":["Crypto 2022: Culture and Entertainment Week"],"content":["I kicked off my journey in the music industry at 16 and spent five years touring, living at below minimum wage and putting every cent I could afford back into my career. Sleeping in squat houses on the road. Crashing on couches. Duct-taping our gear back together. It’s a brutal lifestyle and every musician understands the struggle. Streaming revenue didn’t cover snacks at the gas station, let alone petrol to make it to the next show. It turned a career in music into a daily battle to survive, leaving little room for the creative work of making music and performing.","Joan Westenberg is a writer, angel investor and member of MODA DAO. This article is part of Culture Week, which explores how crypto is changing media and entertainment.","The state of the music-industrial complex is the definition of unfair. We live in a time where music has never been easier to record, distribute and listen to. It’s also never been harder to make a career out of creating. The truth is, creators rarely hold power and influence in the commercial side of the ecosystem. The industry is dominated by middlemen and streaming services optimized for corporate profits. The shares are rarely split evenly.","It’s a situation that might have artists – who may create for the love of it but still need to eat – second-guessing where to pursue a career in the music industry. Through NFTs and other cryptographic tools, that may change.","Take Spotify. With nearly 400 million active users, half of those paying, it is by far the most widely adopted and popular music streaming service. There are around 8 million artists on Spotify who fight for attention daily, only to be overpowered by more renowned counterparts like Taylor Swift, Billie Eilish and Kanye West. It’s a challenging landscape for any artist if they aren’t at the top, especially when artists aren’t able to wholly capture the proceeds from their work. “Rights holders” on Spotify pocket up to 70% of streaming revenue, and for the most part rights holders are not actually the artists.","This is not the proper way to reward creatives whose work is central to the human experience.","Technology hasn’t yet delivered a cure to the ailments of musicians, besides paving the way for an oligopolistic reality in the context of distribution. It’s arguably made things worse for artists by stripping away uniqueness and scarcity and standardizing everything almost to the point of no return.","Until NFTs came along.","Whether Spotify or Apple Music is on board, NFTs – or non-fungible tokens, a type of cryptographic asset that can guarantee uniqueness of digital media – will inevitably change everything about music distribution and rewire the foundation of the music industry. What does that mean in practice? More power to the creators driven by enhanced control over distribution and an imminent reduction of the current structural shortcomings of the industry.","NFTs reintroduce scarcity back to music and enable musicians to be in absolute command over the subsequent distribution of their work as far as it goes down the “consumption chain.” On top of that, NFTs open up many ways for artists to connect with their audiences on a deeper, more meaningful level and form the most vibrant of communities around them, effectively making music a more intimate human experience.","Transformational, to say the least.","What does that mean for you and me? More creators, more music and a more human experience. The reimagining of the music distribution model may usher in a renaissance for musicians and fans alike, creating vast opportunities across the board. In practice this may result in novel revenue models like revenue sharing, tiered access, direct one-on-one interactions.","Next year could be pivotal for music NFTs. There are a number of protocols and platforms coming online now, ready to put music center stage. NFT brands, like Bored Apes and CryptoPunks, are signing media deals – and albums are in the works. It’s a technology-driven revolution driven by creators.","At the same time, DAOs, or decentralized autonomous organizations, the scorching hot topic on everyone’s lips, must also enter our consideration. If tired of the same old talent agents and record labels, DAOs could serve as a groundbreaking alternative in a new era of music.","See also: NFT Music Startup Sound.xyz Raises $5M From a16z, 21 Savage","Essentially a DAO is just a social group with a shared banking account and a procedure to make decisions together. For musicians, DAOs could function as brand makers, patrons and managers. Well-intentioned industry heavyweights may join to help out the next generation of artists creating on Web 3. Fans could join music-focused DAOs to amplify the human connection between artists and other music-lovers.","DAOs would eliminate the need for third-party intermediaries among artists, listeners and other stakeholders. Music industry imbalances could be addressed by DAOs, which could give artists a direct say in how their work is distributed and consumed, provide audiences with a direct connection to the musicians they support and give infrastructure layers like management and record companies the opportunity to interact with their core demographics and get closer to the music itself than ever before.","As a creator today, something feels different. The power structures have shifted. Speaking personally, the revenue I’ve been able to generate in NFT music has already eclipsed the sales of my last physical, record label-backed EP. If I was building my career for the first time today, I can’t help imagining how different it would have been. Creators launching their work now have access to a tool set that is incredibly powerful, a tool set we could have only dreamed of a decade ago."],"entity":[{"type":"Billie Eilish","content":"PERSON"},{"type":"Kanye West","content":"LOCATION"},{"type":"Apple Music","content":"ORGANIZATION"},{"type":"Joan Westenberg","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"MODA DAO","content":"ORGANIZATION"},{"type":"Taylor Swift","content":"PERSON"},{"type":"$5M","content":"MONEY"}],"hashtag":["Crypto 2022","Opinion","Culture Week","Music","NFTs"],"authors":["Joan Westenberg"]}