{"summary":"The token's rise comes alongside a wave of trading volume.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/03\/crypto-exchange-bitget-joins-meme-coin-hype-issues-token-that-rises-14000\/","publishDate":"2024-04-03T14:29:49","id":16240,"type":null,"title":"Crypto Exchange Bitget's Wallet Team Joins Meme Coin Hype, Issues Token That Rises 14,000%","category":["Finance"],"content":["A meme coin issued by cryptocurrency wallet Bitget has surged by more than 14,000% to a $31 million market cap hours after being released.","The ticker for the token, which was issued on Base network, is MOEW, and it is currently trading at $0.0028 on the back of $34 million worth of trading volume, CoinMarketCap data shows. 11,700 individual wallets currently hold MOEW, according to Basescan.","\"Just for funsies, nothing too serious. We wanna see what the power of memes can do,\" Bitget's wallet team wrote on social media platform X.","Base is rapidly emerging as a leading venue for meme coin traders as it attempts to steal the thunder from Solana, which has been the primary blockchain for memes so far in this bull market cycle.","The largest meme coin on Base is Brett (BRETT), a token that is based on a character from Matt Furie’s Boy’s club comic. Brett has increased in value by 89% in the past week, while MOEW has already recorded double the volume Brett has racked up in the past 24 hours.","Meme coins are volatile assets by nature as they have no underlying value or utilities. Several meme coins like WIF have achieved a market cap of above $1 billion in the past year, while many others have petered out to zero amid a wave of rug pulls.","Read more: Meme Coins (and Pepe's Best Friend) Swarm Coinbase Layer 2 Chain","UPDATE (April 3, 15:41 UTC): Clarifies that token was issued by Bitget wallet, not bitget exchange.","Edited by Aoyon Ashraf."],"entity":[{"type":"14,000%","content":"PERCENT"},{"type":"$34 million","content":"MONEY"},{"type":"$0.0028","content":"MONEY"},{"type":"April 3","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"$31 million","content":"MONEY"},{"type":"89%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"Brett","content":"PERSON"},{"type":"Matt Furie","content":"PERSON"},{"type":"Pepe","content":"PERSON"},{"type":"Brett (BRETT)","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["meme coin","meme","Bitget","Exchange"],"authors":["Oliver Knight"]}