{"summary":"With PayPal's announcement that they are creating a U.S. dollar-pegged stablecoin, PayPal USD (PYUSD), many are wondering about this type of cryptocurrency and how it functions.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-stablecoin\/","publishDate":"2022-09-16T19:28:10","id":16255,"type":null,"title":"What Is a Stablecoin?","category":["Learn"],"content":["On August 7, 2023, payments giant PayPal announced they were issuing their own stablecoin pegged to the U.S. dollar, PayPal USD (PYUSD). It marks the first time a major financial company is issuing its own regulated stablecoin, leading many newcomers to crypto wondering what a stablecoin is and why they are used.","A “stablecoin” is a type of cryptocurrency whose value is pegged to another asset class, such as a fiat currency or gold, to stabilize its price.","Here's why stablecoins are useful to crypto: Cryptocurrencies such as bitcoin and ether offer a number of benefits, such as not requiring trust in an intermediary institution to send payments anywhere and to anyone. But one key drawback is that cryptocurrencies' prices are unpredictable and have a tendency to fluctuate, often wildly.","This makes them hard for everyday people to use. Generally, people expect to be able to know how much their money will be worth a week from now, both for their security and their livelihood.","Cryptocurrency's unpredictability comes in contrast to the generally stable prices of fiat money, such as U.S. dollars, or other assets, such as gold. Values of currencies like the dollar do change gradually over time, but the day-to-day changes are often more drastic for cryptocurrencies, which rise and fall in value regularly.","The following graph shows the price of bitcoin vs. the U.S. dollar (USD) compared to another fiat currency, the Canadian dollar (CAD), to see how much each currency fluctuates in relation.","Stablecoins try to tackle price fluctuations by tying the value of cryptocurrencies to other more stable assets – usually fiat currencies. Fiat is the government-issued currency we're all used to using on a day-to-day basis, such as dollars or euros.","See Also: Fiat-Backed Stablecoins: What You Need to Know About Tether, USD Coin and Others","Usually, the entity behind a stablecoin will set up a \"reserve\" where it securely stores the asset or basket of assets backing the stablecoin – for example, $1 million in an old-fashioned bank (the kind with branches and tellers and ATMs in the lobby) to back up one million units of a stablecoin.","This is one way digital stablecoins are pegged to real-world assets. The money in the reserve serves as collateral for the stablecoin – meaning whenever a stablecoin holder wishes to cash out their tokens, an equal amount of whichever asset backs it is taken from the reserve.","There is a more complex type of stablecoin that is collateralized by other cryptocurrencies rather than fiat yet still is engineered to track a mainstream asset like the dollar.","MakerDAO, perhaps the most famous stablecoin issuer that uses this mechanism, accomplishes this through a service called “Vault” (formerly known as a Collateralized Debt Position), which locks up a user's cryptocurrency collateral. Then, once the smart contract knows the collateral is secured, a user can use it to borrow freshly minted dai, the stablecoin.","A third variety of stablecoin, known as an algorithmic stablecoin, isn’t collateralized at all; instead, coins are either burned or created to keep the coin’s value in line with the target price. Let’s say the stablecoin drops from the target price of $1 to $0.75. The algorithm will automatically burn a tranche of coins to introduce more scarcity, pushing up the price of the stablecoin. This type of stablecoin protocol is difficult to get right and has been tried and has failed several times over recent years. Yet, entrepreneurs keep trying.","Using this framework, stablecoins come in a range of flavors, and the collateralized stablecoins use a variety of types of assets as backing:","To give you a taste of the experimentation happening in stablecoin land, let's run through some of the most popular stablecoins.","Tether (USDT) is one of the oldest stablecoins, launched in 2014, and is the most popular to this day. It's one of the most valuable cryptocurrencies overall by market capitalization.","The primary use case for USDT is moving money between exchanges quickly to take advantage of arbitrage opportunities when the price of cryptocurrencies differs on two exchanges; traders can make money on this discrepancy. But it has found other applications: Chinese importers stationed in Russia have also used USDT to send millions of dollars worth of value across the border, bypassing strict capital controls in China.","Tether Ltd. the company that issues USDT, was embroiled in a 22-month legal battle with the New York Attorney General over allegations Bitfinex (a sister company of Tether) tried to cover up an $850 million shortfall using funds taken from Tether.","Eventually, the case was settled on Feb. 23, 2021, with Tether and Bitfinex forced to pay $18.5 million and submit quarterly reports showing Tether’s stablecoin reserves for the next two years.","Read More: How USDT Works","USD Coin is a stablecoin launched jointly by cryptocurrency firms Circle and Coinbase in 2018 through the Centre Consortium.","Like tether before its shift towards a mix of collateral assets, USD Coin is pegged to the U.S. dollar. USDC is an open-source protocol, which means any person or company can use it to develop their own products.","On July 8, 2021, Circle announced plans to go public through a $4.5 billion SPAC merger deal with Concord Acquisition Corp. The news came one month after Circle closed a $440 million funding round involving big industry names such as FTX, Digital Currency Group (the parent company of CoinDesk) and Fidelity Management and Research Company.","Read More: How USD Coin Works","Running on the MakerDAO protocol, dai is a stablecoin on the Ethereum blockchain. Created in 2015, dai is pegged to the U.S. dollar and backed by ether, the token behind Ethereum.","Unlike other stablecoins, MakerDAO intends for dai to be decentralized, meaning there's no central authority trusted with control of the system. Rather, Ethereum smart contracts – which encode rules that can't be changed – have this job instead.","There are still problems with this innovative model, however; for example, if the smart contracts underpinning MakerDAO don't work exactly as anticipated. Indeed, they were gamed in 2020, leading to losses of $8 million.","\n","There are a few drawbacks to stablecoins to keep in mind. Because of the way stablecoins are typically set up, they have different pain points than other cryptocurrencies.","If the reserves are stored with a bank or some other third party, another vulnerability is counterparty risk. This boils down to the question: Does the entity really have the collateral it claims to have? This has been a question frequently posed to Tether, for instance, over whether it maintains a true 1-1 backing between USDT tokens and U.S. dollars.","In the worst-case scenario, it's possible the reserves backing a stablecoin could turn out to be insufficient to redeem every unit, potentially shaking confidence in the coin.","Cryptocurrencies were created to replace intermediary companies that are typically trusted with a user's money. By their nature, intermediaries have control over that money; for example, they are typically able to stop a transaction from occurring. Some stablecoins add the ability to stop transactions back into the mix.","USD Coin openly has a back door to stop payments if coins are used in an illicit manner. Circle, one of the firms behind USDC, confirmed in July 2020 that it froze $100,000 of the stablecoin at the behest of law enforcement.","See Also: What's the Point of Stablecoins?","Edited by Toby Leah Bochan."],"entity":[{"type":"2014","content":"DATE"},{"type":"Feb. 23, 2021","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"$18.5 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Tether Ltd.","content":"ORGANIZATION"},{"type":"Fidelity Management and Research Company","content":"ORGANIZATION"},{"type":"$0.75","content":"MONEY"},{"type":"July 8, 2021","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"USD Coin Works","content":"ORGANIZATION"},{"type":"August 7, 2023","content":"DATE"},{"type":"CoinDesk)","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Toby Leah Bochan","content":"PERSON"},{"type":"Concord Acquisition Corp","content":"ORGANIZATION"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"$440 million","content":"MONEY"},{"type":"Centre Consortium","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$850 million","content":"MONEY"},{"type":"$4.5 billion","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"July 2020","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Technology","Beginner","Learn","Stablecoin"],"authors":["Alyssa Hertig"]}