{"summary":"Ethereum’s integrated staking rate is now part of the investment case for ether. Understanding and measuring it is key to driving innovation and acceptance of ETH-based financial products.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/11\/08\/why-an-ether-staking-rate-will-increase-crypto-adoption\/","publishDate":"2023-11-08T16:45:00","id":16258,"type":null,"title":"Why an Ether Staking Rate Will Increase Crypto Adoption","category":["Markets"],"content":["Ethereum’s conversion to proof-of-stake not only created the foundation for the liquid staking ecosystem, it delivered a native crypto rate to finance that can serve as a critical piece of market structure. The staking rate – measuring the total income that stakers receive for validating Ethereum transactions – has immediate applicability in DeFi, centralized digital asset finance and traditional finance. This has fueled market demand for an ether staking rate for benchmarking, research and risk transfer.","You’re reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","Mass adoption and integration of digital assets in investment portfolios is critically important to the future of the digital assets industry. While many investors will make their first allocation in Bitcoin, the investment case for Ethereum is likely to attract interest as a next step. Not only does ETH have history and scale; it now has an integrated yield.","As staking becomes better understood, investors will demand that yield rate be more predictable. Moreover, they will pit providers – LSTs, funds, ETPs, CEXes, futures contracts – against each other to hunt for the best return. Benchmarking these returns provides a yardstick for investors, and allows providers to show the alpha they are able to deliver.","What is ETH’s staking rate exactly?","It is a floating rate comprising two parts: rewards for consensus layer duties and priority transaction fees. The former is determined by Ethereum’s simple “monetary policy” which adjusts rewards based on the aggregate amount of ETH that is staked – a single-objective, security-based policy. The latter is determined by demand for the Ethereum network, which tends to rise when new information or opportunities enter the system.","How does this compare to rates in traditional finance? Consensus rewards are paid to help secure – but not finance – the network. They are determined by a stated policy, like a central bank rate, but not subject to political influence or economic interpretation. They are crystal clear and reasonably predictable.","Priority transaction fees – those paid to validators after base fees are burned – are less predictable and subject to spikes when network demand rises. This demand-spread widens when demand for Ethereum causes users to pay extra gas to get transactions on the blockchain faster.","Should we (and if so, how) compare this rate to U.S. Treasuries or SOFR? They are clearly not direct analogues, given the different profiles of their funding bases. However, there are similar opportunity-cost dynamics. For instance, we’ve seen a shrinking of the validator queue as the staking rate has declined relative to available fiat rates. Should demand for the rate be adjusted by ether’s forward-looking inflation\/deflation status? Should it be implied in ether futures contracts or the OTC forward market?","The calculation of a standardized and independently-calculated rate, along with access to its components, can provide analysts with information to help understand Ethereum better, both internally and in comparison to other money markets. (Note: CESR™, the composite ether staking rate, which is administered by CoinFund and calculated and published by CoinDesk Indices does just that.)","Ethereum validators stake 32 ETH, and get a variable stream of rewards. Future rewards can be hard to predict. This yield volatility is not optimal when evaluating a validator’s financial performance with measures like its Sharpe ratio.","What if the validator could swap its future staking yield for a fixed rate, and what rate would it accept to enter that transaction?","This is the genesis of a fixed vs floating swap market, and the birth of a forward curve for the ETH staking rate. Speculators may also want to gain exposure to the future rate, expressing views on network demand, volatility or macro events. OTC dealers and DeFi protocols can create such marketplaces, whose contracts must settle into an independently calculated, well understood value.","This embryonic but scalable market is an important addition to the idea set for crypto derivatives markets because it goes beyond serving investors and lenders and addresses a new use case: corporate finance.","Expanding the users and use cases for Ethereum’s staking rate will help improve network security, invite new investment interest in ether, and create new bridges from digital assets to traditional finance. This fueled the inspiration to create CESR™, the composite ether staking rate. CESR and other Ethereum-focused LSTfi Protocols can be found in the newly launched report, The Ultimate Q4 2023 Market Overview.","Edited by Ben Schiller."],"entity":[{"type":"CoinFund","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sharpe","content":"PERSON"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Crypto Long & Short","Ethereum","Ethereum staking","TradFi","Adoption","DeFi"],"authors":["Andy Baehr"]}