{"summary":"The U.S. Commodity Futures Trading Commission announced Tuesday that the Commission voted unanimously to finalize interpretive guidance on the question of what constitutes the &quot;delivery&quot; of digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59740\/cftc-announces-finalized-interpretive-guidance-on-the-actual-delivery-of-digital-assets","publishDate":"2020-03-24T15:33:44","id":1625,"type":null,"title":"CFTC announces finalized interpretive guidance on the &#x27;actual delivery&#x27; of digital assets","category":["THE BLOCK"],"content":["The U.S. Commodity Futures Trading Commission announced Tuesday that the Commission voted unanimously to finalize interpretive guidance on the question of what constitutes the \"delivery\" of digital assets.","The CFTC said that \"[t]he final interpretive guidance discusses two primary factors demonstrating 'actual delivery' of retail commodity transactions in virtual currency,\" which are as follows:","\"(1) a customer securing: (i) possession and control of the entire quantity of the commodity, whether it was purchased on margin, or using leverage, or any other financing arrangement, and (ii) the ability to use the entire quantity of the commodity freely in commerce (away from any particular execution venue) no later than 28 days from the date of the transaction and at all times thereafter; and","(2) the offeror and counterparty seller (including any of their respective affiliates or other persons acting in concert with the offeror or counterparty seller on a similar basis) do not retain any interest in, legal right, or control over any of the commodity purchased on margin, leverage, or other financing arrangement at the expiration of 28 days from the date of the transaction.\"","The move caps a years-long process that<a href=\"https:\/\/www.coindesk.com\/cftc-still-doesnt-know-constitutes-cryptocurrency-delivery\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> traces its origins<\/a> to a settlement between the CFTC and crypto exchange Bitfinex.&nbsp;<a href=\"https:\/\/www.coindesk.com\/cftc-bitcoin-exchange-bitfinex-trading-violations\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">That settlement<\/a> centered around the allegation that Bitfinex didn't actually \"deliver\" coins to its leveraged trading services customers (Bitfinex paid $75,000 and neither admitted or denied the agency's findings at the time).","U.S. law firm Steptoe &amp; Johnson LLP <a href=\"https:\/\/www.coindesk.com\/petition-cftc-clarify-blockchain-rules-delivery\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">pushed for clearer guidance<\/a> from the agency in the wake of that settlement. In filing that petition, Steptoe said that \"[a]bsent a definitive Commission statement identifying the essential elements, participants must attempt to discern what is lawful and what is problematic through assessments of enforcement orders, which are focused on a single entity at a time and may or may not be instructive.\"","According to the CFTC's new announcement on Tuesday, the finalized interpretive guidance \"reflects extensive insight gained by the agency through public input, advisory committee meetings on the evolution of digital asset and cryptocurrency markets, regulatory oversight of exchanges offering digital asset-based derivatives products, numerous LabCFTC and market interactions, as well as market surveillance in furtherance of the CFTC's enforcement responsibilities.\"","\"Our action provides long-awaited guidance to trading platforms, custodians, and other key market infrastructures and participants regarding those digital assets that are both “commodities” under U.S. law and traded via leverage provided by the counterparty or trading platform,\" CFTC chairman Heath Tarbert <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/tarbertstatement032420a?utm_source=govdelivery\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">said in a statement<\/a>.","<em data-v-f87c67ca=\"\">The full 35-page voting draft can be read below:<\/em>","&nbsp;","<a title=\"View Voting Draft 032420 on Scribd\" href=\"https:\/\/www.scribd.com\/document\/453086384\/Voting-Draft-032420#from_embed\" data-v-f87c67ca=\"\">Voting Draft 032420<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe id=\"doc_75438\" class=\"scribd_iframe_embed\" title=\"Voting Draft 032420\" src=\"https:\/\/www.scribd.com\/embeds\/453086384\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-7n3dbcOtMxhbsuvGozbN\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"Steptoe &amp; Johnson LLP","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"MichaelPatrickMcSweeney","content":"ORGANIZATION"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Heath Tarbert","content":"PERSON"},{"type":"Steptoe","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Michael McSweeney","The Block"]}