{"summary":"Elon Musk has repeatedly shown interest in toying with the crypto markets. We dive into how Tesla’s CEO has swayed the prices of DOGE and BTC during 2021.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/14\/the-elon-effect-how-musks-tweets-move-crypto-markets\/","publishDate":"2021-12-14T18:51:38","id":16264,"type":null,"title":"The Elon Effect: How Musk’s Tweets Move Crypto Markets","category":["Consensus Magazine (layer2)"],"content":["In the early stages of 2021, Elon Musk had the cryptocurrency market wrapped around his finger.","A single tweet about dogecoin by the Tesla and SpaceX founder sent prices flying as much as 50%. For a time, bitcoin price action seemed reliant on the opinion of the world’s richest man.","Tuesday offered a bit of deja vu: Musk’s tweet that Tesla would be accepting DOGE for merch sent the meme coin soaring 43%.","This post is part of CoinDesk’s Culture Week.","Musk is far from the only person to move the crypto market for no apparent reason other than making an endorsement. A sizable portion of the industry from meme coins to NFTs has proven to be highly responsive to celebrity shilling.","Inspired by Jeff Wilser’s profile of Musk for CoinDesk’s Most Influential 2021 series, here is a look into the role social media and celebrities play in the crypto market and how it has changed over the course of the year.","Trying to measure the exact impact any single event has on the market is often futile, but the correlation between dogecoin’s rise and Musk’s praise is undeniable. While other billionaires (such as Mark Cuban) and celebrities hopped on the DOGE bandwagon, Musk was often the most outspoken in his attempts at memeing the canine cryptocurrency “to the moon.”","Musk eventually found himself within the bitcoin conversation and Tesla played a vital role in price action throughout the spring. Disclosing Tesla’s purchase of BTC, accepting BTC as payment, eventually selling a portion of the BTC holdings and canceling BTC as a payment method all had significant effects on the market, amplifying crypto assets’ already considerable volatility.","On Feb. 8, Tesla announced its purchase of $1.5 billion in BTC and the price skyrocketed 19.5% from $38,850 to $46,400 within the day. The amount of BTC bought by Tesla and used to purchase its vehicles was relatively small compared to daily trading volume on the nearly $1 trillion asset, yet it controlled the narrative in the market for months. On May 12, an “Elon effect” of a different sort took place when the CEO announced Tesla would no longer accept BTC as payment. While the market had already fallen hard off of its highs in the months before, this tweet put the nail in the coffin, sending the price of BTC from $56,800 to $49,500.","However, Musk’s impact on prices diminished over the course of the year. Has the market grown stronger or are participants simply sick of hearing from him? Perhaps the billionaire wore out his welcome or perhaps the market became more rational. BTC was able to withstand a three-month bear market over the summer and retake April’s highs this fall without the constant help from Musk. DOGE had fallen from its glory and “the dogefather’s” latest dogecoin-themed tweets struggled to excite the market.","Or so it seemed until Tuesday morning.","The chart below tracks Musk’s influence on the DOGE price over time, using data from TradingView.","In any event, high-profile celebrities and Twitter accounts sowing FOMO (fear of missing out) are likely here to stay.","The power of social media in the crypto market is testament to the general lack of regulation and maturity, and the inherent liquidity of 24\/7, permissionless assets. For example, non-fungible tokens in their current form are essentially “tradable culture” with features (bespoke assets, thin liquidity, anonymous participants) that make prices easy to manipulate through bogus “wash” trades. Therefore, when a star like pro basketball’s Steph Curry purchased an NFT from the popular Bored Ape Yacht Club collection, the average sales price for this line of virtual tchotchkes nearly doubled in the following months.","The market will likely continue to mature with further regulation and innovation. If so, celebrity influence will continue to diminish as it seemingly has for Musk. While crypto natives are still very fond of the occasional meme coin , blockchain technology has showcased its potential and attracted real investors and billions of dollars in institutional capital.","The depths of crypto will likely remain the Wild West, but hopefully we have seen the worst of it."],"entity":[{"type":"$46,400","content":"MONEY"},{"type":"fall","content":"DATE"},{"type":"Tesla","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"CoinDesk’s Culture Week","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Elon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 trillion","content":"MONEY"},{"type":"Steph Curry","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"Feb. 8","content":"DATE"},{"type":"Elon Musk","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$49,500","content":"MONEY"},{"type":"19.5%","content":"PERCENT"},{"type":"$38,850","content":"MONEY"},{"type":"Tesla","content":"LOCATION"},{"type":"43%","content":"PERCENT"},{"type":"Tesla","content":"PERSON"},{"type":"$1.5 billion","content":"MONEY"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Jeff Wilser","content":"PERSON"},{"type":"$56,800","content":"MONEY"},{"type":"Musk","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"summer","content":"DATE"},{"type":"May 12","content":"DATE"}],"hashtag":["Elon Musk","DOGE","Dogecoin","NFTs","Social Media"],"authors":["Edward Oosterbaan"]}