{"summary":"Bitcoin mining should be hailed as an effective tool for a lower emissions future, not demonized as a monkey wrench in the works.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/06\/bitcoin-mining-is-good-for-the-energy-grid-and-good-for-the-environment\/","publishDate":"2023-03-06T21:11:55","id":16261,"type":null,"title":"Bitcoin Mining Is Good for the Energy Grid and Good for the Environment","category":["Consensus Magazine"],"content":["This week, the U.S. Senate Committee on Environment and Public Works (EPW) will hold a hearing on digital assets and the environment. This hearing will almost exclusively focus on the energy use from Bitcoin’s proof-of-work mining process.","At its simplest, Bitcoin data centers (also known as miners) use computers to secure the Bitcoin network and process transactions. For this work they are rewarded in bitcoin (BTC). Critics have highlighted the large amount of energy use of bitcoin miners and argued that governments should either clamp down on bitcoin mining or force miners to switch away from the proof-of-work protocol and operate in a less energy-intensive fashion.","Dennis Porter is the CEO of Satoshi Action Fund.","This critique lacks important context, such as the fact that more energy is lost in transmission and distribution of electricity than the entire Bitcoin network uses annually. Having governments clamp down on Bitcoin’s energy usage or attempting to switch how transactions are processed would not only undermine the Bitcoin network but also impede energy innovation, positive environmental outcomes and economic opportunity in America.","Bitcoin has the potential to expand renewable energy generation. Renewable energy currently struggles with reliability, cost and use of electricity throughout American power grids. Bitcoin mining provides a solution to each of these issues.","Solar and wind energy are intermittent because they only produce energy when the sun is shining and the wind is blowing. Much of this energy is generated when demand is low, and if this energy is not stored in batteries it is simply wasted or “curtailed.” Currently, the state of California is on track to curtail 5 million megawatt hours by 2030. This is more energy than the bottom 36 nations use combined. Bitcoin miners stand ready to purchase excess energy from wind and solar farms, improving the revenue for renewable generation and preventing taxpayers from subsidizing the generation of energy. A win-win.","Miners can also smooth out the intermittent generation of renewables by participating in grid-balancing services. Miners not only will consume excess generation from wind and solar generation, but also then reduce their energy consumption neary to zero when ratepayers and other key sectors, like hospitals and businesses, need power. Miners regularly reduce their consumption in states that allow this kind of grid participation, ensuring grid operators have the ability to keep the lights on and power prices low.","Miners aren’t just good for renewables. They can also make use of stranded methane, a potent greenhouse gas, that is often uneconomical to bring to market. Methane is frequently vented or flared from landfills, abandoned wells, and oil and gas operations.","Because bitcoin miners can operate anywhere, they can turn stranded methane gas into electricity and use it to mine bitcoin, generating both a monetary and environmental benefit. Former Greenpeace activist and researcher Daniel Batten has stated that it would take “around 50 mid-large sized landfills in the U.S. fully combusting their methane … to make the entire Bitcoin network carbon negative” – a feat which is nearly impossible for any other industry to accomplish unless they do so through the purchase of carbon credits.","These use cases highlight just a few ways bitcoin mining can reduce overall emissions while encouraging the buildout of America’s energy resources. Bitcoin mining should be viewed as an effective tool for a lower emissions future, not a contributing problem.","Despite these benefits, many have pressured those in the Bitcoin industry to move to another way to create new blocks of transactions, specifically a mechanism known as proof-of-stake. Rather than using specialized computers, proof-of-stake relies on users locking up their cryptocurrency for a period of time in a process known as “staking.” This allows users to generate a passive income while contributing to processing transactions and securing the network. While this process does use less energy, it comes with other complications.","Securities and Exchange Commission (SEC) Chair Gary Gensler recently sat down for an interview where he argued that every cryptocurrency, other than bitcoin, was a security and therefore under the jurisdiction of the SEC. The interview came just days after the SEC filed an enforcement action against the cryptocurrency exchange Kraken for letting its U.S. customers use their Ethereum tokens – ether (ETH) – to participate in “staking” to validate the Ethereum network. This enforcement action included a hefty fine and a cease-and-desist order.","On top of these actions, Gensler has commented separately that any cryptocurrency using proof-of-stake could be a security and therefore fall under the SEC’s regulatory jurisdiction. By maintaining its current proof-of-work structure, those in the Bitcoin space can avoid such complications.","The Bitcoin community should continue on its current path and look to empower renewable energy, mitigate methane emissions and utilize stranded energy to improve both the network and America’s power generation. EPW’s core mission is balancing fundamental American needs such as energy reliability alongside environmental stewardship. Bitcoin can help America achieve this.","With this in mind, we should be embracing bitcoin mining and fostering its growth across the nation to ensure the U.S. leads the globe in the next wave of energy and environmental innovation."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Daniel Batten","content":"PERSON"},{"type":"Dennis Porter","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Greenpeace","content":"ORGANIZATION"},{"type":"Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"2030","content":"DATE"},{"type":"CEO of Satoshi Action Fund","content":"ORGANIZATION"},{"type":"U.S. Senate Committee on Environment and Public Works (EPW","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Bitcoin","Mining regulation","Proof-of-Work","Proof-of-Stake"],"authors":["Dennis Porter"]}