{"summary":"Binance joins Kraken and Bitfinex in offering lightning network deposits.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/07\/17\/lightning-network-bitcoin-deposits-now-live-on-binance\/","publishDate":"2023-07-17T15:05:59","id":16263,"type":null,"title":"Lightning Network Bitcoin Deposits Now Live on Binance","category":["Technology"],"content":["Bitcoin (BTC) holders can now deposit their assets to the crypto exchange Binance using the Lightning Network, according to an announcement.","Binance has completed integration after stating last month that it had set up Lightning Network nodes.","Depositing bitcoin via Lightning is faster and cheaper than on the main blockchain; the base fee on lightning is $0.04, whereas regular bitcoin deposits spiked to as high as $30 in May, according to ycharts. Transactions also settle in under a minute, with regular bitcoin transactions taking roughly 10 minutes per confirmation.","The Lightning Network, which is often called \"Bitcoin's second layer,\" was designed in 2016 to speed up transaction times and assist with network congestion. The network currently has a capacity of $147 million with 69,395 payment channels, according to 1ml data.","Binance join the likes of Bitfinex and Kraken in offering Lightning Network deposits, with Coinbase (COIN) CEO Brian Armstrong recently suggesting that his exchange will also integrate the scaling solution in future.","Edited by Bradley Keoun."],"entity":[{"type":"$30","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"$0.04","content":"MONEY"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"$147 million","content":"MONEY"},{"type":"Bradley Keoun","content":"PERSON"}],"hashtag":["Binance","On-chain Data","Bitcoin","Lightning","Lightning Network"],"authors":["Oliver Knight"]}