{"summary":"All Fortnite players who visit the virtual Air-Max-themed island for 10 minutes or more will receive the Air Max 1 '86 Back Bling digital sneaker.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/06\/20\/nike-brings-swoosh-to-fortnites-240m-users-with-airphoria-virtual-experience\/","publishDate":"2023-06-20T18:28:55","id":16269,"type":null,"title":"Nike Brings .SWOOSH to Fortnite's 240M Users With 'Airphoria' Virtual Experience","category":["Web3"],"content":["Nike's Web3 community platform .SWOOSH has teamed up with popular online multiplayer game Fortnite to offer a virtual experience that will reward players with digital sneakers. This brings a massive audience for Nike's .SWOOSH with over 240 million users logging into Fortnite in the past 30 days alone.","\"Airphoria,\" a collaboration between Nike, Fortnite creator Epic Games and branded game builder Beyond Creative, will be available to play in Fortnite from now through June 27. All Fortnite players who play this island for 10 minutes or more will receive the Air Max 1 '86 Back Bling cosmetic in-game asset within Fortnite.","Additionally, players who link their Epic Games and Nike accounts while Airphoria is available will be able to claim an \"Achievement\" on .SWOOSH. Achievements cannot be traded or sold and do not have a monetary value.","\"Epic's partnership with Nike and the launch of 'Airphoria' is one of many future collaborations enabling players to opt-in to connecting their online presence across ecosystems. This is all part of a larger effort to bring Nike's Air Max brand into the world of Fortnite with cosmetics, Fortnite islands, and account linking between Nike and Epic, introducing Nike .SWOOSH achievement badges for players who link accounts.\" an Epic Games spokesperson told CoinDesk. \"The connection between Fortnite and Nike doesn't integrate any NFTs or digital item trading marketplaces into the Fortnite world or its economy.\"","Nike has also collaborated with Fortnite on several other digital items, including the Airie and Maxxed Out Max outfits, which can be purchased through the Fortnite Item Shop.","Players are being encouraged to link their Epic Games and .SWOOSH accounts, which will give them first access to a future .SWOOSH Air Max virtual collection. According to Epic Games, linking accounts will allow virtual goods like Fortnite skins and Nike achievements \"to be interoperable, starting with your ability to claim your .SWOOSH Achievements when you account link or purchase a cosmetic.\"",".SWOOSH uses crypto custody firm BitGo as its third-party wallet provider.",".SWOOSH recently released its first collection of non-fungible token (NFT) sneakers titled Our Force 1, surpassing $1 million in primary sales despite persistent delays. According to Polygonscan, the collection has a total supply of 62,250 OF1 boxes, which were priced at $19.82 each. (Disclaimer: This author collected one).","Nike allowed holders to reveal their NFTs on June 15, hinting at future rarity traits and utility. According to .SWOOSH, some Nike digital collectibles are linked to unique benefits like access to physical product drops, live experiences, video game use and more.","The footwear giant also has plans to expand the reach of its digital creations across video game platforms. Earlier this month, Nike Virtual Studios, the sportswear giant's digital arm, and video game developer EA Sports announced a partnership to bring digital creations from Nike's .SWOOSH platform to the EA Sports gaming ecosystem. EA Sports is a division of Electronic Arts that publishes games like FIFA, Madden NFL and more.","See Also: Fortnite Developer Epic Games’ Marketplace Lists First NFT Game","Update (June 20, 20:40 UTC): Clarifies details around claiming items and achievements and added quotes from Epic Games.","Edited by Toby Leah Bochan."],"entity":[{"type":"Airphoria","content":"PERSON"},{"type":"June 20","content":"DATE"},{"type":"Airphoria","content":"LOCATION"},{"type":"$19.82","content":"MONEY"},{"type":"Toby Leah Bochan","content":"PERSON"},{"type":"past 30 days","content":"DATE"},{"type":"Madden NFL","content":"ORGANIZATION"},{"type":"Polygonscan","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"EA Sports","content":"ORGANIZATION"},{"type":"Air Max","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Air Max 1","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Nike","content":"ORGANIZATION"},{"type":"June 15","content":"DATE"},{"type":"Fortnite Developer Epic Games’ Marketplace Lists First NFT","content":"ORGANIZATION"},{"type":"June 27","content":"DATE"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"Fortnite","content":"ORGANIZATION"}],"hashtag":["NFTs","Web3","Nike","Fortnite","Gaming","top news"],"authors":["Rosie Perper"]}