{"summary":"The downfall of Silvergate, Signature and Silicon Valley banks have wounded digital assets. But crypto might one day work with big banks if the industry can mature, WAX CEO William Quigley and Maicon CEO Alex Liu suggested.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/15\/crypto-must-do-better-to-be-banked-say-industry-executives\/","publishDate":"2023-03-15T02:14:39","id":16265,"type":null,"title":"Crypto Must Do Better to Be Banked, Say Industry Executives","category":["Finance"],"content":["The voluntary liquidation of Silvergate, crypto’s go-to bank, and subsequent regulator action to seize Silicon Valley Bank sent shockwaves through the industry.","While depositors will be made whole, the shockwaves the industry is feeling are no longer from the concept of funds lost, but rather the loss of industry-friendly banks that were pillars of the sector.","Most large, brand-name banks wouldn’t work with a small venture fund, a tech startup, or a crypto company – not to mention an exchange. But Silvergate, Silicon Valley Bank and Signature saw these as valued clients.","Everyone from OKX’s U.S. exchange OKCoin to CoinDesk itself has been impacted by the demise of these three institutions.","“We're going to struggle with banking for a while,” William Quigley, a Tether co-founder and CEO of non-fungible token exchange WAX, told CoinDesk in an interview. Quigley, who left Tether in 2015, is disappointed with its current management.","Holding long-dated, government-issued debt, purchased when interest rates were low, then having to jettison it at fire-sale prices to shore up liquidity when startup clients stopped raising money and started spending, was not a great move by banks. But this action should have only been a challenge and not a fatality, he says.","“It’s not the first time in the history of Silicon Valley that a weird phenomenon happened,” he said. “Has there ever been a rush of money into a sector, which then goes into [SVB], and gets burned off as the companies are making payroll? It’s literally how the system works!”","Quigley says that around June 2022 someone in management should have noticed and moved to sell off the portfolio and take the losses, or bring in more deposits.","“I've been an audit committee chairman and a bank auditor. I know the conversation that happens when deposits are going down at an accelerated rate and our investment portfolio is being impaired to the point where we don’t have enough money to pay off depositors,” he said.","Management should have been in touch with the Federal Reserve in January, and the Fed should have put the bank in some sort of supervisory wind-down then.","The problem that’s going to emerge from this, he says, is a lack of trust. SVB was regulated by multiple federal and state agencies, had a clean audit opinion, and was rated as investment grade by a federally licensed rating agency, making it seem like a good bank.","“It’s unfair to expect depositors to know more than all the regulators and regulated entities that reviewed the bank,” he said, pointing out that the U.S. can’t have a “South American” banking environment where minimal funds are kept in the bank because of low institutional trust.","VC and crypto investors prefer working with small, non-systemically important banks due to hesitance from big banks to work with these companies because of regulatory uncertainty, he explained.","But that doesn’t mean it's impossible.","For roughly the last decade, Taiwanese crypto exchange Maicoin has had a fiat on- and off-ramp with Far Eastern International Bank, which would be categorized as a big bank by the Fed.","Alex Liu, the CEO of Maicoin, told CoinDesk there wasn’t really any magic to convincing banks to give his exchange fiat pipelines. He’s also quick to highlight that the root cause of these three banks' demise in the U.S. is not crypto itself.","“It involves being able to come across not as a bomb-throwing radical. It helps if you can put on a suit, and talk about things like investor protection, [know your customer\/anti-money laundering] and so forth,” he said.","It also helps to have a physical address for your headquarters, he continued. Maicoin’s headquarters are in an office tower in downtown Taipei.","“How many crypto companies refuse to do that one thing?” he asks.","One of its local competitors is in a neighboring tower, visible from Liu’s office, yet provides an address on business cards for an off-shore jurisdiction.","Liu also says that a big part of getting banking access was respecting the idea of equivalence.","This means anything from ensuring that you are compliant in any jurisdiction you operate into respecting traditional finance (TradFi) rules that may apply to crypto, too. In Taiwan, for instance, trading futures or options is a licensed activity.","“We know plenty of players that said, ‘Oh, those equivalent rules don't apply to us, because there's nothing on the books that says they apply to us,'\" Liu said. “That could make you a lot of money for a while, but at some point, you’re going to get called on that.”","As all of this occurs, many jurisdictions in Asia, from Hong Kong to Taiwan, are working on building a crypto licensing regime for retail traders.","Certainly, they will be looking to the U.S. to see what’s going on especially given the last six months, which involved the collapse of FTX, and now three banks.","No regulator or lawmaker in the U.S. has come out and said directly: \"Hey, let’s just ban this thing,\" Liu points out.","Asia regulators are going to take that as a clue.","“The collapse of three banks, two of which are related, will give them a lot to think about as they shape their regulations,” he said. “It’s the stuff of regulator nightmares.”"],"entity":[{"type":"June 2022","content":"DATE"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"last decade","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Maicoin","content":"PERSON"},{"type":"Far Eastern International Bank","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Maicoin","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Alex Liu","content":"PERSON"},{"type":"Taiwan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"William Quigley","content":"PERSON"},{"type":"SVB","content":"ORGANIZATION"},{"type":"Liu","content":"PERSON"},{"type":"Quigley","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"Taipei","content":"LOCATION"}],"hashtag":["Silvergate Bank","Silvergate","Signature Bank","Silicon Valley","Silicon Valley Bank","Binance","Taiwan"],"authors":["Sam Reynolds"]}