{"summary":"Gary Gensler will testify before the U.S. Senate Banking Committee today for a confirmation hearing on his nomination to lead the SEC.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2021\/03\/02\/state-of-crypto-how-sec-chair-gary-gensler-could-differ-from-predecessor-jay-clayton\/","publishDate":"2021-03-02T14:30:00","id":16270,"type":null,"title":"State of Crypto: How SEC Chair Gary Gensler Could Differ From Predecessor Jay Clayton","category":["Policy"],"content":["Gary Gensler ran the Commodity Futures Trading Commission (CFTC) after the 2008 financial crisis. Now, he’ll get a chance to run its securities-regulating counterpart.","Former Commodity Futures Trading Commission (CFTC) Chairman Gary Gensler has been nominated to run the Securities and Exchange Commission (SEC) by President Joe Biden. Gensler unites a pro-regulation history with a pro-crypto viewpoint, and could finally implement the regulatory clarity many in the industry have desired. In this, he's likely to depart from predecessor Jay Clayton, who repeatedly said he believed initial coin offerings are securities but did not provide much guidance on when or how tokens might be classified as something other than a security.","Today, the U.S. Senate Committee on Banking, Housing and Urban Affairs will hold a hearing to consider his nomination for chairman of the SEC.","Should he be confirmed, Gensler will shape crypto policy over the next several years, though it’s an open question if the industry will love the rules he implements. Under his tenure, the CFTC approved nearly 70 rules or pieces of guidance, and he may just regulate the hell out of crypto. He told the Senate Banking Committee he intends to continue focusing on consumer protection at the SEC.","“We have seen that when the SEC does its job – when there are clear rules of the road and a cop on the beat to enforce them – our economy grows and our nation prospers.,” Gensler said in his prepared remarks.","Companies are already hinting at or have announced plans to file to launch a bitcoin exchange-traded fund (ETF), a retail-accessible product that the industry has been pursuing for years. Some in the industry hope that under Gensler the SEC might finally create “bright-lines” regulatory guidance that clearly defines when a token is a security and when one is not.","He’ll also oversee litigation against companies that SEC staff believe have violated federal securities laws, including the high-profile lawsuit against Ripple Labs.","Like many of Biden’s nominees, Gensler was an official in former President Barack Obama’s administration. As CFTC chair, he had a major role in the Dodd-Frank Act, which sought to bring some consumer-focused reforms to Wall Street. Gensler has been a part of Team Biden since the president won the White House last year; Biden announced Gensler would lead his Wall Street reform team just days after news organizations projected his victory.","Many of his views on the digital asset space can be found in the transcripts of his lectures at MIT, some of which my colleague Danny Nelson went through. Gensler gave these lectures in 2018, though he has remained active in the industry as a member of the MIT Digital Currency Initiative.","He’s also spoken out about blockchain over the past several years. Below is a summary of his views on some issues that are important to the crypto industry.","A day before former SEC Chair Jay Clayton stepped down, the securities regulator filed a lawsuit alleging Ripple Labs, the San Francisco startup closely associated with the XRP cryptocurrency, had violated securities laws for over seven years by selling XRP in unregistered securities transactions. Other senior SEC staff, including now-former Director of Enforcement Stephanie Avakian, also departed around that time. If approved, Gensler will inherit an agency overseeing one of its highest-profile crypto cases.","In his own words, Gensler believes XRP is “a non-compliant security,” though he said (again, this is from 2018) that it would require the courts to make that determination, “whether it's appellate courts or the Supreme Court.”","He went on to explain that he believes XRP meets the requirements of the Howey Test, the Supreme Court case often used to determine whether something is a security.","The SEC has spent years suing companies that conducted initial coin offerings (ICOs) without registering their tokens as securities, often because they raised money specifically to build a project that could issue a token that investors could re-sell at a profit.","Gensler raised concerns about information asymmetry in one of his lectures, noting that U.S. law is designed to protect investors and consumers. He’s also expressed concern that ICOs, which were numerous in 2018, might violate securities laws, particularly given the projects that launched without having any code or tokens developed.","“Jay Clayton, who runs the SEC, has said in congressional testimony in February that he hadn't met an ICO that he didn't think was a security ... But it wasn't quite enough,” Gensler said.","He said early tokens may fail, but as some projects go live they could provide a roadmap for how future projects could succeed, pointing to Telegram (which ended its blockchain ambitions after the SEC sued) and Filecoin (which went live last year).","Central bank digital currencies (CBDCs) are becoming increasingly popular, with multiple central banks now trialing different types of sovereign digital currencies. In Gensler’s view, CBDCs could bring efficiencies to cross-border remittances or local payments.","Central banks have to understand why they would launch a CBDC and what the benefit would be, he said, explaining:","Still, in that same lecture Gensler noted that a CBDC doesn’t necessarily need to rely on a blockchain platform, a view echoed by Boston Fed and MIT Digital Currency Initiative researchers looking into different technology bases that could support a digital dollar.","In 2019 Gensler participated in a wargaming exercise that looked at a hypothetical future where the digital yuan, China’s effort at a central bank digital currency, was live and used by the government of North Korea to bypass U.S. sanctions. The premise of the exercise was the U.S. may need to revisit how it enforces its sanctions regime, which basically seeks to lock individuals or entities out of the global financial system.","“I think it’s good to have a healthy debate about where we stand with the U.S. dollar, our reliance on SWIFT – the international messaging system – for a tool in our sanctions regime that we the U.S. have,” Gensler told CoinDesk ahead of the exercise. “We’re using it as a tool in geopolitics, a digital form of blockade that in the 17th and 18th and even in the 19th century, what one would have to do with ships we’re doing digitally.”","Gensler further noted during his MIT lectures that other countries could use CBDCs as part of an effort to bypass U.S. sanctions, citing Venezuela and Iran, both of which had announced efforts to create sovereign digital currencies at the time.","Last week, the U.S. House Financial Services Committee’s Subcommittee on National Security, International Development and Monetary Policy held its long-awaited hearing on domestic terror financing. You can read my preview and summary but my immediate impression was that it seems good crypto wasn’t being scapegoated as this tool for terror financing, despite multiple statements of concern by Treasury Secretary Janet Yellen and other lawmakers.","The hearing almost went in that direction at the beginning, when Rep. James Himes (D-Conn.), the subcommittee’s chair, asked the witnesses to speak to whether cryptocurrencies were enabling easier terror financing.","Instead, the witnesses compared cryptocurrencies to systems like PayPal or GoFundMe, and called for better moderation efforts by the companies behind these tools.","That said, the proposed FinCEN counterparty rule was raised multiple times, and so it is worth keeping an eye on any next steps here.","I wasn’t planning on talking about the Robinhood-GameStop thing again but the Depository Trust and Clearing Corporation (DTCC) published a proposal to shorten settlement times from T+2 to T+1, on the same day GameStop’s stock jumped like 100%. So let’s take a quick look.","First off: If the bit about T+2 to T+1 didn’t make sense, read this article first, then come back to the newsletter.","Okay, so moving to T+1 requires industry agreement, meaning participants have to get together and say, “We think one-day settlement makes financial and operational sense and that we are all capable of handling it.” Robinhood CEO Vlad Tenev has come out in favor of shortened settlement times, blaming T+2-related margin requirements for why his company had to suspend trading in volatile securities last month. The DTCC said in a blog post after that incident that it didn’t have the authority to unilaterally make that decision, but now “based on extensive industry engagement conducted throughout 2020,” it seems the industry could be open to faster settlement.","The DTCC has looked into whether blockchain in particular can offer a T+0\/1 settlement solution through its Project Ion last year. In short, a distributed ledger-based settlement system can effectively shorten settlement times, though the Project Ion proof-of-concept paper noted that its PoC focused on usability over scalability.","“It’s important to note that NSCC and DTC can support T+1 and even same-day (T+0) settlement today, using existing technology. In fact, NSCC clears T+1 and T+0 trades every day and DTC is already a T+0 settlement platform. However, the current T+2 settlement cycle is a convention of market practice,” last week’s white paper said.","Gary Gensler’s confirmation hearing is today, as is that of CFPB Director-Nominee Rohit Chopra. I’ll be live-tweeting the hearing (shameless plug here). As of press time, there’s still no formal nomination for the next heads of the CFTC or OCC.","If you’ve thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!"],"entity":[{"type":"Vlad Tenev","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"North Korea","content":"LOCATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"19th century","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Howey Test","content":"ORGANIZATION"},{"type":"U.S. House Financial Services Committee’s Subcommittee on National Security","content":"ORGANIZATION"},{"type":"Boston Fed","content":"ORGANIZATION"},{"type":"Danny Nelson","content":"PERSON"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S. Senate Committee on Banking, Housing and Urban Affairs","content":"ORGANIZATION"},{"type":"Stephanie Avakian","content":"PERSON"},{"type":"Conn.","content":"LOCATION"},{"type":"MIT","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Iran","content":"LOCATION"},{"type":"International Development and Monetary Policy","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"OCC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"White House","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Rohit Chopra","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"MIT Digital Currency Initiative","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"James Himes","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"” Gensler","content":"PERSON"},{"type":"Barack Obama","content":"PERSON"},{"type":"NSCC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Depository Trust","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"Biden","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["SEC","Terrorism","DTCC","Securities Regulators","Robinhood","Regulators","Gary Gensler","Newsletters","State of Crypto","GameStop","Bitcoin ETF"],"authors":["Nikhilesh De"]}