{"summary":"The move will allow the sports betting platform to contribute to Polygon’s governance.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/10\/18\/draftkings-steps-further-into-crypto-with-plans-to-become-polygon-validator\/","publishDate":"2021-10-18T22:38:19","id":16273,"type":null,"title":"DraftKings Steps Further Into Crypto With Plans to Become Polygon Validator","category":["Finance"],"content":["DraftKings tapped Polygon for its marquee non-fungible token (NFT) release with Tom Brady’s Autograph back in August.","Now the sports betting giant is going all-in on the Ethereum layer 2 application with a partnership that could make it one of the blockchain’s largest governors.","DraftKings, valued at nearly $20 billion on the public market, is planning to use Polygon to support custom NFT drops and secondary-market transactions.","“Scalability and sustainability remain among the critical challenges of blockchain technology,” Paul Liberman, president of global product and technology at DraftKings, said in a statement Monday. “Although DraftKings Marketplace is still in its nascency, we are bullish on the possibilities that blockchain, NFTs, cryptocurrency and more will present as we prepare for Web 3.0 alongside Polygon and the new innovations ahead for digital collectibles.”","Read more: DraftKings Charts NFT Long-Game With Marketplace Debut","The partnership also gives DraftKings the option to contribute to Polygon’s governance, a system where token holders have a say in implementing changes to the network after staking their tokens on the platform.","A Polygon representative told CoinDesk in an interview the company anticipates DraftKings’ governance to begin “in the next month.”","Europe’s largest telecommunications company, Deutsche Telekom AG, pulled a similar move in February, providing backend support for Chainlink and Flow, the blockchain that hosts NBA Top Shot."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$20 billion","content":"MONEY"},{"type":"Deutsche Telekom AG","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"DraftKings Marketplace","content":"ORGANIZATION"},{"type":"DraftKings Charts NFT","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Paul Liberman","content":"PERSON"}],"hashtag":["DraftKings","MATIC","Sports","Validators","Proof-of-Stake","NFTs"],"authors":["Eli Tan"]}