{"summary":"The firm said it is the first bank-owned custodian to offer staking services to institutional clients.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/06\/06\/zodia-custody-to-offer-staking-to-institutional-clients-through-blockdaemon\/","publishDate":"2023-06-06T08:00:00","id":16274,"type":null,"title":"Zodia Custody to Offer Staking to Institutional Clients Through Blockdaemon","category":["Finance"],"content":["Cryptocurrency storage provider Zodia Custody said it will offer crypto staking to institutional clients through an agreement with infrastructure provider Blockdaemon.","The two firms are attempting to capture the growing institutional interest for staking – the process of offering digital assets to help run a blockchain network in return for rewards – according to an emailed announcement on Tuesday.","Interest around staking has increased since the Ethereum blockchain completed its transition to a proof-of-stake system in September. Following the network's Shapella upgrade on April 12, the amount of ether (ETH) staked had surged by 4.4 million to 22.58 million ($42 billion) as of May 23.","Zodia Custody, which is a subsidiary of U.K-based multinational bank Standard Chartered and is also backed by Northern Trust and SBI Holdings, claims to be the first bank-owned custodian to offer staking services to institutional clients.","In April, Blockdaemon rolled out a wallet service to help financial institutions and crypto custodians to steward their assets without needing to store them with a third party.","Read More: Ethereum Staking Needs Its (Honest) LIBOR","Edited by Sheldon Reback.","\n","\n","\n","\n","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Northern Trust","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"$42 billion","content":"MONEY"},{"type":"April 12","content":"DATE"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Blockdaemon","content":"PERSON"},{"type":"SBI Holdings","content":"ORGANIZATION"},{"type":"May 23","content":"DATE"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["Zodia Custody","Staking","Institutional Investors","Blockdaemon"],"authors":["Jamie Crawley"]}