{"summary":"The possibility of not winning spurs gamers' participation because it gives them the opportunity to learn and improve.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/04\/the-psychology-of-failure-and-its-meaning-for-web3-games\/","publishDate":"2023-08-04T18:33:40","id":16285,"type":null,"title":"The Psychology of Failure and Its Meaning for Web3 Games","category":["Consensus Magazine"],"content":["Most gamers don’t spend much time analyzing why we game and what games we enjoy. In fact, much of the pleasure in gaming derives from the ability to disconnect from the real world. Nevertheless it’s worth asking: What makes gaming fun in the first place?","Richard Bartle’s taxonomy of player types uses psychology to provide clues as to which games certain gamers might enjoy by analyzing the way they play. And while his insightful 1996 analysis remains relevant nearly three decades later, it doesn’t explain why gamers game to begin with.","Adrian Krion is the CEO and Founder of the Berlin-based blockchain gaming startup Spielworks and maker of the user-friendly gaming wallet Wombat.","Many people see Web3 gaming as the next frontier of gaming itself, but so far the industry has been a little slow going. Is there anything crypto gaming could learn from the foundational principles of gaming to improve?","Renowned Danish game developer Jesper Juul also taps into the psychology of gaming by claiming that failure is a motivating factor among gamers. Juul posits in his 2016 book “The Art of Failure: An Essay on the Pain of Playing Video Games” that one of the main reasons people play video games is to fail, because it gives us the chance to learn and improve.","Read More: Towards a Web3 Without Wallets","In real life, we often view failure as a stop on the path to success, and it certainly serves as a motivating factor to help us overcome life’s challenges. But for video games – a recreational activity – the idea that failure could be a major motivating factor for gamers ahead of entertainment may sound absurd to both gamers and non-gamers.","In his book, Juul notes that “we generally avoid failure” in life, yet we “seek out games” where the experience itself either involves or is about failure. Juul refers to this as the “paradox of failure.”","This paradox doesn’t mean gaming isn’t fun, however difficult a certain mission or level may be. A game that is too easy is likely boring, but a challenging game that causes us to fail gives us the chance to improve. This has a powerful impact on the psyche and can be applied to other aspects of life. After all, improvement and overcoming adversity serve as confidence boosters.","Any gamer can tell you that beating an easy game or mission is far less satisfying than succeeding after multiple failed attempts. In this context, the failure paradox makes sense from a psychological point because when we overcome a challenge our brain responds by releasing dopamine.","“Dark Souls” probably provides us with the best example of this. The notoriously difficult action role-playing series from Bandai Namco boasts a loyal fanbase despite requiring a skillset that demands patience and the ability to recognize subtle patterns in the boss’s tactics to succeed. The game’s creativity, story, graphics and difficulty combine to make it so endearing.","Whether one eventually beats the boss or not, all good games know how to straddle the fine line between fun and frustrating.","But does this paradox of failure still apply to Web3 gaming? Considering the financial aspect plays a key role in this space, one might assume that turning a profit would negate the failure and drive to improve.","That assumption would be misguided.","Web3 communities tend to form around a collective sense of value and purpose, yet the ecosystem is undeniably individualistic. This is demonstrated through the pursuit of status symbols like unique NFTs, or being whitelisted for an exclusive airdrop.","Further, in the strongest Web3 gaming communities, not everybody gets to succeed. Failure is a part of participation, which hasn’t yet slowed growth.","In response to critics who claim Web3 gaming isn’t sustainable or fun (which may have held merit at one point), the industry has invested heavily in R&D, user experience and collaborating with traditional gaming businesses. The down market washed away a lot of flawed models and uninspiring storylines, and reignited an interest in gameplay, among developers.","These investments and industry-wide shifts flout reason if the primary motive of Web3 gamers were purely financial. (But for anyone interested, there are gamified sports-betting apps and plenty of other avenues for people who prioritize earning cash over a fun challenge.)","Still, Web3 gaming is projected to grow to over $65 billion by 2027 up from a $4.6 billion market in 2022. Even at a time when non-AI VC investments have trickled, the Web3 gaming sector is seeing a steady flow of new funding.","It’s true the thrill of turning a profit can add an exciting new element to gaming, one that Web3 games pioneered and then turned into a billion-dollar industry. But Web3 gamers still crave a fun experience and a challenging quest. Earning an NFT is as much about one’s status within the community as it is about cashing it in the marketplace.","Read More: Crypto and the Real Meaning of 'Radicalism'","Titles such as “Planet IX” and “Illuvium” marry enhanced storylines with breathtaking visuals, challenging and entertaining hardcore and casual traditional gamers as well as the Web3 crowd, while keeping the community spirit alive. The new generation of Web3 games are enticing gamers with well-crafted narratives, community-oriented models, and the freedom to own in-game assets.","As blockchain gaming passes a critical point, it’s safe to say Juul’s paradox of failure applies in the Web3 space as much as it does in the traditional gaming sector.","Web3 gaming is starting to disrupt the wider gaming industry. Down the road, expect to see mainstream gaming studios and franchises adopting their own versions of Web3 features: in-game economies, ownership of assets, and a community-first approach.","But crypto doesn’t have a winner-takes-all mentality. Advancements in smart contract design, token-based incentives and other gaming technologies will only benefit the world; that’s the spirit of open source development. And so the only way to really lose is not to play at all.","Edited by James Rubin."],"entity":[{"type":"2016","content":"DATE"},{"type":"2027","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$65 billion","content":"MONEY"},{"type":"1996","content":"DATE"},{"type":"Berlin","content":"LOCATION"},{"type":"Juul","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"James Rubin","content":"PERSON"},{"type":"Adrian Krion","content":"PERSON"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Bandai Namco","content":"ORGANIZATION"},{"type":"Richard Bartle","content":"PERSON"},{"type":"Jesper Juul","content":"PERSON"}],"hashtag":["Opinion","Consensus","Web3","Web3 gaming"],"authors":["Adrian Krion"]}