{"summary":"The crypto investment fund sent a letter demanding Aragon conduct buybacks of its ANT token.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/09\/heavyweight-hedge-fund-arca-joins-activist-fight-against-dao-builder-aragon\/","publishDate":"2023-05-09T17:05:45","id":16284,"type":null,"title":"Heavyweight Hedge Fund Arca Joins Activist Fight Against DAO Builder Aragon","category":["Finance"],"content":["Cryptocurrency investment fund Arca called on DAO builder Aragon to conduct buybacks of its ANT token in an open letter Tuesday, adding institutional weight to the activist investor row currently besieging the crypto governance startup.","“We are planning to work with other tokenholders to propose that Aragon continue the buybacks to return ANT to book value,” wrote researcher Alex Woodard in the letter, referring to the discrepancy between the value of ANT and the size of Aragon’s warchest.","The open letter escalated a fight already being waged between Aragon, a crypto governance project building tools for decentralized autonomous organizations (DAOs), and a tight-knit group of activist investors critical of project leadership and demanding they give disenchanted investors an exit ramp.","Their fight erupted last week when Aragon banned at least half a dozen Discord members, including Woodard, alleging they were rabble-rousers and not actual community members. In his letter Woodard took issue with that characterization and said the questions he was asking over months sought transparency about matters such as treasury, not trouble.","“There is no doubt that community management and governance are hard, but selectively removing the voices of the few tokenholders who want to engage strikes me as a massive step in the wrong direction,” Woodard wrote in the letter.","Arca’s vow to work with “other tokenholders” could add fuel and momentum to the activist effort. Arca is a major crypto hedge fund with $200 million under management at the end of last year and it has not shied away from governance debates in the past.","Aragon’s director of communications Jessica Smith did not return a request for comment.","Edited by Nick Baker."],"entity":[{"type":"DAO builder Aragon","content":"ORGANIZATION"},{"type":"Aragon","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Jessica Smith","content":"PERSON"},{"type":"Aragon","content":"PERSON"},{"type":"Alex Woodard","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"Woodard","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Arca","Aragon","Dao governance","activism","Hedge Fund"],"authors":["Danny Nelson"]}