{"summary":"This marks the 26th grant by the Cash App parent-company offshoot.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/04\/07\/square-cryptos-new-grant-funds-popular-bitcoin-blockchain-explorer\/","publishDate":"2021-04-07T18:37:40","id":16281,"type":null,"title":"Square Crypto’s New Grant Funds Popular Bitcoin Blockchain Explorer","category":["Markets"],"content":["","Square Crypto and Gemini have doled out yet another grant, this time to two pseudonymous developers who maintain one of the most popular Bitcoin block explorers.","","","Pseudonymous Bitcoiners Wiz and softsimon will receive $100,000 from Square Crypto and $25,000 from Gemini to continue their work on the website. The two-man team will take the one-year grant in bitcoin.","","","Grants like these have become more ubiquitous over the past year as Bitcoin and crypto companies step up to the plate to fund projects that typically subsist on donations and volunteer work. In an open-source, distributed world like Bitcoin, these grants are becoming the lifeblood of many projects and initiatives.","","","“It's long been our dream to work directly for Bitcoin, and now with the recent generous donations from the community we're able to cover all operating expenses for The Mempool Open Source Project and also take a full salary. So we're living the dream!” Wiz told CoinDesk.","","","A block explorer is an online tool that allows users to query blockchain data like transaction IDs, wallet addresses and other block data. Avid bitcoiners are drawn to mempool.space because it clearly demonstrates the average fee per block to help Bitcoin users estimate an appropriate fee when sending transactions.","","","Square Crypto has become a leader in the Bitcoin grants space, dishing out funding to Bitcoin Core contributors, open-source software and even user interface designers and Bitcoin educators.","","","Before Square, Blockstream, BitMEX and others sponsored Bitcoin development, either indirectly through grants or through in-house hires.","","","Last year, many exchanges and Bitcoin companies began issuing open-source grants for anything from Bitcoin protocol development to wallet software.",""],"entity":[{"type":"Bitcoiners Wiz","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Square Crypto","content":"ORGANIZATION"},{"type":"The Mempool Open Source Project","content":"ORGANIZATION"},{"type":"Gemini","content":"LOCATION"},{"type":"Blockstream","content":"LOCATION"},{"type":"$25,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":["Gemini","Grants","Square Crypto"],"authors":["Colin Harper"]}