{"summary":"DFINITY claims to be carrying out the largest airdrop ever.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/06\/08\/registration-for-dfinitys-biggest-airdrop-ever-is-closing-soon\/","publishDate":"2018-06-08T03:00:09","id":16293,"type":null,"title":"Registration for Dfinity's 'Biggest Airdrop Ever' Is Closing Soon","category":["Markets"],"content":["The registration period for what one startup claims to be the largest airdrop ever will come to a close on Friday.","\"Decentralized cloud\" foundation Dfinity announced its token distribution plans last week, and revealed in a statement that it will give away 35 million Swiss francs (about $35 million) worth of its DFN tokens to \"hundreds of thousands\" of community members. The company, which purports to be a \"blockchain computer with unlimited capacity,\" will launch its network later this year with the aim of staking a claim in the already competitive market of aspiring blockchain cloud computing services.","Backed","by major tech investor Andreessen Horowitz and crypto hedge fund Polychain Capital, Dfinity is also in the process of conducting a private sale of its forthcoming cryptocurrency, the conclusion of which the company says will push its total funding to nearly $200 million.","Likewise, unlike other companies in the space, Dfinity has eschewed token distribution via an ICO in favor of what might be called a \"compliant airdrop.\"","In practice, this means Dfinity community members must undergo and pass a know-your-customer (KYC) and anti-money laundering (AML) verification process facilitated by AngelList spinoff CoinList before they can benefit from the massive token giveaway. June 8 is the deadline for completing the process.","CoinList previously told CoinDesk that it developed its compliance tool (also dubbed Airdrops) to provide a means for token issuers to conduct airdrops without violating securities laws. Despite this, Dfinity is still excluding U.S. citizens and residents from participating, and cited \"regulatory uncertainty\" as its rationale in a Medium announcement.","Dfinity community members who are able to participate each stand to gain between around $500 to $2,500 worth of tokens, and those who have followed the projects' various community channels longest will receive their tokens first.","Unlike other nascent blockchain projects, Dfinity has not carried out fundraising on the ethereum blockchain, meaning it has not sold ERC-20 tokens as \"placeholders\" until it launches its technology in full. As such, KYC\/AML verified community members must wait for the network activation to receive their tokens.","Dfinity expects to launch its blockchain in quarter four.","Falling coins image via Shutterstock"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$35 million","content":"MONEY"},{"type":"$500","content":"MONEY"},{"type":"June 8","content":"DATE"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"35 million Swiss francs","content":"MONEY"},{"type":"Dfinity","content":"ORGANIZATION"},{"type":"$2,500","content":"MONEY"},{"type":"Dfinity","content":"PERSON"}],"hashtag":["News","Airdrops","investments","initial coin offerings","CoinList","Dfinity"],"authors":["Annaliese Milano"]}