{"summary":"Toncoin will be integrated into the Telegram messaging app, Rogozov says.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/01\/21\/facebook-of-russia-exec-rogozov-joins-telegrams-spin-off-blockchain-project\/","publishDate":"2022-01-21T11:09:38","id":16306,"type":null,"title":"Andrew Rogozov, Former Exec at VK, the 'Facebook of Russia,' Joins Telegram’s Spin-Off Blockchain Project","category":["Finance"],"content":["Toncoin, the offspring of the blockchain project designed by messaging service Telegram, just brought in reinforcements from the mainstream tech world – specifically, from Russian internet giant VK.","Andrew Rogozov, a vice president at VK, the parent company of “Facebook of Russia,” is joining the TON Foundation, a group of people and companies supporting the fledgling Toncoin blockchain, which was earlier known as Newton.","Rogozov plans to help Toncoin grow into a crypto project adopted by Telegram’s more than 500 million monthly users. He will move to an adviser role at VK, he told CoinDesk in an exclusive interview.","VK said in a statement that Rogozov “contributed significantly to the company over the years he’s been working here,” but that starting in the second quarter, he will focus on other projects, while advising VK CEO Vladimir Kirienko on key management priorities, strategic planning and social networks development.","Rogozov is also bringing “several people” with him, he said, although he declined to name them or say if they are coming from VK or other companies.","Toncoin, a blockchain project using code that was created several years ago by Telegram is on its way to becoming fully integrated into the messaging app, Rogozov said.","“We are now in talks with the Telegram team as well as the teams of developers working on various projects” based on the Toncoin blockchain, he said.","Telegram is on board with the plan, Rogozov said. Toncoin is already available to the messaging system’s users through two in-app bots: one that facilitates donations of Toncoin’s namesake tokens to content creators and a wallet bot providing in-app purchases of the token through the crypto trading firm Neocrypto.","Telegram didn't immediately comment.","A number of other projects using the Toncoin blockchain are in the works and might soon become available to Telegram users, Rogozov said. “My role is to help with proper communication between the teams and to make things happen,” he said.","In Rogozov’s view, Telegram is not just a messaging app: It’s a major content platform because its many channels function as media outlets. That means the current boom in content creation will benefit it and boost the development of crypto tools aimed at rewarding those creators – including Toncoin’s donation bot, Rogozov said.","Integration with Telegram will give Toncoin an advantage no other blockchain has, Rogozov said.","“I see potential for this for the next 10 years and want it to last long. I’m interested to be in the center of this movement,” he said.","Last year, Rogozov co-founded Tonkeeper, a non-custodial wallet for Toncoin launched in the fall, he said.","In December, Telegram CEO Pavel Durov publicly endorsed Toncoin as a project continuing the work his team had to abandon in 2020. Telegram planned to launch TON, an ambitious blockchain with a native crypto token, in 2019, but shelved the plan after a legal fight with the U.S. Securities and Exchange Commission over the status of the project’s token.","A community of developers who had been developing tools for the TON blockchain ecosystem and who participated in Telegram’s hackathons subsequently picked up the code, a move that led to the development of two separate projects based on the same technology and ideas: Free TON (later rebranded as Everscale) and Newton (later rebranded as Toncoin).","Rogozov is, in a sense, a crypto veteran. He bought his first bitcoin in 2014. Since 2007, he has been working at VK.com, Durov’s first company and a popular Russian social network, which Durov later exited not without a drama. Durov started working on Telegram messenger when he was still in VK.com. Rogozov was part of that, too, he said.","After Durov quit to build Telegram, Rogozov took over the CEO role at VK.com and later became a vice president for social platforms in Mail.ru, the company that acquired it. Mail.ru re-branded in October as VK, taking the name of its subsidiary."],"entity":[{"type":"2014","content":"DATE"},{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"Newton","content":"LOCATION"},{"type":"Durov","content":"PERSON"},{"type":"Newton (","content":"ORGANIZATION"},{"type":"Telegram CEO Pavel Durov","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Rogozov","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"2007","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Neocrypto","content":"ORGANIZATION"},{"type":"VK","content":"ORGANIZATION"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Rogozov","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Andrew Rogozov","content":"PERSON"},{"type":"Vladimir Kirienko","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"second quarter","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Durov","content":"ORGANIZATION"}],"hashtag":["Telegram","TON","TON Coin","Russia"],"authors":["Anna Baydakova"]}