{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of Dec 7-Dec. 13, with live updates throughout.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/12\/06\/protocol-latest-tech-news-crypto-blockchain\/","publishDate":"2023-12-13T20:36:41","id":16307,"type":null,"title":"Protocol Village: COTI Layer-1 Blockchain to Become Ethereum Layer-2 Network","category":["Technology"],"content":["Dec. 13: The layer-1 blockchain COTI unveiled plans to become the \"first privacy-preserving Ethereum layer-2,\" according to the team: \"To better serve the needs of Web3 companies and consumers, COTI will become an Ethereum-compatible layer 2 that solves the challenges of scalability, liquidity and privacy. COTI V2 will use a specialized cryptographic technology known as Garbled Circuits, performing 10 times more efficiently than ZK (Zero-Knowledge) solutions. The devnet release of COTI V2 is scheduled for Q2 2024.\"","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","Dec. 13: The Hedera Council today announced the appointment of Charles Adkins as its new president. \"A former leader at Aptos and Polygon, Adkins brings a wealth of experience in Web3 technology, as well as in finance, government, and consumer brands. This diverse experience makes Adkins a valuable addition to the Hedera leadership team, while bringing a new set of relationships to the Hedera ecosystem.\" (HBAR)","Dec. 13: Liquid Collective, \"an institutional liquid staking protocol that achieved 900% TVL growth in Q3 alone, announced that BitGo has joined as a custodian to offer Qualified Custody for LsETH, Liquid Collective’s receipt token,\" according to the team. \"This move represents BitGo’s entrance into the institutional liquid staking space, as Liquid Collective’s LsETH is the first and only Liquid Staking Token (LST) that BitGo offers custody support for. BitGo’s support of LsETH will allow all BitGo users and LsETH holders to participate securely in the largest DeFi sector.\"","Dec. 13: The Interchain Foundation, which supports the Cosmos blockchain ecosystem, detailed $26.4 million of planned funding in 2024. That compares with a $40 million budget estimate for 2023, released in February 2023, though final spending numbers are not in yet.","Dec. 13: Fetch.ai and SingularityNET, two organizations in AI and Web3, said they will \"join forces to solve critical issues in the AI space, according to the team. \"These include 'hallucination,' when LLMs give nonsensical\/irrelevant outputs, and non-determinism. Harnessing the core technologies of both, the pair will introduce AI models that are more reliable and have enhanced reasoning so developers can access the tools needed to create their own, more reasoning-capable LLMs via simple APIs and traditional programming languages. Available in 2024, the interface will merge LLMs and AI agents for an open, dynamic marketplace that connects users to services.\"","Dec. 13: Hyperion Decimus (HD), a digital asset management firm and a sponsor of a multi-strategy crypto hedge fund, and CoinDesk Indices (CDI), a subsidiary of CoinDesk and the leading provider of digital asset indices by AUM since 2014, announced the launch of the HD CoinDesk TrendMax Strategy. According to the team: \"This quantitative trading strategy is built on weighted signals from CoinDesk Indices' proprietary Bitcoin Trend Indicator (BTI) and Ether Trend Indicator (ETI), which each convey the presence, direction and strength of the trend in the price of bitcoin and ether respectively by using purpose-built, non-discretionary algorithms.\"","Dec. 12: Celestia, a so-called data availability (DA) solution designed to provide a cheaper alternative for verifying data generated from blockchain transactions, announced Tuesday that it will become an option for blockchain builders using Polygon's software tools to spin up new layer-2 networks atop Ethereum.","Dec. 12: Matter Labs and Chainlink Labs announced that Chainlink Price Feeds are live on zkSync Era, the zkEVM Ethereum layer-2 scaling solution. According to the team: \"This collaboration, part of the Chainlink SCALE program, aims to enhance DeFi protocols on zkSync, reducing gas costs and providing reliable oracle services.\"","Dec. 12: Decentralized exchange Vertex Protocol has partnered with Axelar to enable cross-chain collateral deposits through an integration of the Squid Router, according to the team: \"Traders can now bridge and deposit from eight different chains (Ethereum, Binance Smart Chain, Optimism, Polygon, Avalanche, Base Chain, Mantle and Fantom) directly into their trading accounts, through seamless deposits within an average processing time of only two minutes.","Dec. 12: Pi Network debuted \"Decentralized Moderation\" on its Web3 app Fireside Forum, according to the team: \"This cultivates a self-sustaining environment where users are active contributors in shaping the content narrative. Key aspects: Unique Tiered Moderation: a system where each tier has its own responsibilities with token-based incentives and disincentives; Tokenomics and Stakes: every decision and action in the system is backed by real stakes – if an action is challenged and overridden, it translates into a cost; Structured Fairness: curated token rewards and penalties are devised with fairness and accountability in mind.\"","Dec. 12: Nil Foundation announced the features of its new Type-1 zkEVM powered by zkLLVM, \"making it the first zkEVM with core components built automatically, preventing insecurities that result from manual circuit definition,\" according to the team: \"Nil’s zkEVM is designed to have security as a fundamental feature enabled by its proprietary zkLLVM compiler. The zkLLVM quickly and automatically compiles high-level code (C++ or Rust) into efficient zk-SNARK circuits. Starkly contrasting the current industry standard of manually defining circuits, which is time-intensive, creates overly complex circuits, and can introduce human error.\"","Dec. 12: A group of Web3 companies including Nym, Protocol Labs, Filecoin Foundation, Oasis and Aztec have founded the Universal Privacy Alliance (UPA), according to a message from the team, led by Nym: \"This is the first alliance of its kind which aims to advocate for global digital privacy rights, represent privacy-focused tech firms and engage with policymakers on critical issues like eIDAS and the Digital Services Act. The founders have collectively contributed funds to support immediate advocacy efforts + mission includes policy education.\"","Dec. 12: Verida, a self-sovereign digital identity provider, and inDAO have collaborated for \"36M Uzbekistan citizens to enter Web3 economy,\" according to the team: \"Leveraging inDAO's blockchain and Verida's Web3 wallet, the initiative includes projects such as zero-knowledge credentials for students as proof of their completed studies, safe healthcare data access and real estate digitization. The customized Verida wallet, integrated with the inDAO blockchain, showcase how self-sovereign digital technology can drive economic growth and transform Uzbekistan into a digital-first and efficient economy.\"","Dec. 12: Oasys, the blockchain gaming hub, has been \"working to enable Verse building on their platform with a single click while simplifying blockchain gaming and metaverse launches on the Oasys ecosystem,\" according to the team: \"Through a new partnership with AltLayer, the decentralized interlayer for rollups, Oasys is enabling one-click deployment through AltLayer’s no-code rollup launcher. Users can now create and launch their Verse on the Oasys platform with all of AltLayer’s user-friendly dashboards, and with just one click, can build blockchain games on Layer 2.\"","Dec. 12: SSV.Network, an Ethereum distributed validator technology (DVT) staking infrastructure, announces its permissionless launch, marking a significant advancement in ETH staking, according to the team: \"Following three years of development, it democratizes Ethereum staking, breaking entry barriers and inviting public validators and node operators into the network. The launch, promoting decentralization and offering robust infrastructure, is accompanied by a year-long incentivization program, earmarking 1 million $SSV tokens to reward validator registrations.\"","Dec. 11: Bitget, a crypto derivatives exchange, is making a multimillion-dollar Investment in the Ethereum layer-2 consumer-centric blockchain Morph (whose name recently changed from Morphism), according to the Morph team: \"Morph's innovative roll-up technology combines optimistic and ZK rollups to offer cost-effective, secure, and scalable transactions. The company is dedicated to bridging the divide between the present state of blockchain technology and everyday practical dApps that extend beyond traditional cryptocurrency transactions.\" Exact terms weren't disclosed.","Dec. 11: Seamless Protocol, a project on Coinbase's Base ecosystem, issued governance tokens that will trade on the crypto exchange with the ticker SEAM starting at 18:00 UTC Monday. Seamless is a lending and borrowing protocol. It is among the top platforms on the layer-2 blockchain, with a total value locked (TVL) of over $10 million. SEAM will be the first Base token listed on Coinbase. It was airdropped to users based on their involvement on the Seamless platform, such as funds supplied to and borrowed from the various trading pools. There was no public or private sale of SEAM tokens.","Dec. 11: chai","Dec. 11: Taiwan's central bank has finished a technical study of a wholesale central bank digital currency (CBDC), according to Deputy Governor Chu Mei-lie.","Dec. 8: Connext, a modular protocol for securely passing funds and data between chains and building cross-chain apps, announced that their latest network upgrade, Bacco, is coming Dec. 14. This follows several months of development with core development teams Proxima Labs and Wonderland, according to the team: \"Bacco will upgrade the existing 'slow path' of Connext to operate optimistically, reducing the operational costs of supporting new chains by 90%. Additionally, the upgrade paves the way for many new chains and L2s to operate on Connext, with approval for support of 20 new chains and L2s already on the way.\"","Dec. 8: Diva Staking, an Ethereum liquid staking protocol powered by distributed validator technology, said in a press release that it has \"joined forces\" with Octant, a platform for experiments in participatory public goods funding, to \"decentralize Ethereum's staking landscape,\" according to the team. \"The Golem Foundation is planning a phased transition of its validators to Diva’s DVT, contingent on the maturity and extensive testing of their technology. This includes allocating up to 100,000 ETH to Diva Staking, worth approximately $220M at the time of writing. The news follows Diva Staking's 'Early Stakers Initiative,' powered by Enzyme Finance, with over 18,000 stETH (approximately $40M) secured in Diva's vault as of Dec. 5.\" (ETH)","Dec. 8: Brahma, developer of Console, an institutional on-chain execution and automation platform using Safe smart accounts for custody, raised a $2.5M seed extension, according to the team. Investors included Greenfield, joined by Framework, Safe Foundation, Maven11 and Bitscale. The product launch was announced earlier in the week. \"Brahma Console enables asset managers, DAOs and power users to delegate and automate their on-chain execution collaboratively. Console sports Access Control and delegation capabilities with Sub-Accounts and granular transaction policies, an automation module with on\/off-chain trigger support, as well as an Execution toolkit which fully manages gas, RPC routing and transaction lifecycle. Console users maintain ownership and independent access to their Safes.\"","Dec. 8: Chainlink, the biggest blockchain data-oracle project, saw a powerful uptake for its expanded crypto-staking program, pulling in over $632 million worth of its LINK tokens and filling up to the limit just six hours after the start of an early-access period, the company said in a press release. (LINK)","Dec. 8: Avail, a modular blockchain data availability solution, said its testnet, launched Oct. 31, is seeing engagement levels \"suggesting a solid foundation\" for network security ahead of a planned mainnet launch in the first quarter of 2024, according to a message from the team. A little over a month in, the testnet boasts 220 validators. For comparison, the rival data availability network Celestia, which launched its mainnet on in late October, has 170 total validators, according to data on Mintscan.","Dec. 8: Flare, a layer-1 blockchain compatible with Ethereum's EVM standard, has onboarded Ankr, Figment, Restake, Luganodes and NorthStake as both validators and data providers for the network’s native oracles and for the first time in crypto, according to a web post. \"With this move, Flare becomes the first smart-contract platform for whom these institutional validators also provide decentralized data feeds for builders on the network and provide a far wider variety of decentralized data,\" based on a message from the team. The press release added: \"Flare currently has a total of 91 network validators across the globe, all of whom also act as data providers for the Flare Time Series Oracle (FTSO).\"","Dec. 8: Tether, issuer of USDT, the world's biggest stablecoin at $90 billion, is participating in El Salvador's new \"Freedom Visa\" program as a tech provider. CEO Paolo Ardoino said in a press release: \"It represents a unique opportunity for us to utilize our technological capabilities to foster growth and innovation in the region. Being chosen as the tech provider underscores the importance of robust infrastructure in driving meaningful change. This partnership reinforces our dedication to advancing technology, empowering nations, and enabling individuals to invest in a future where innovation and progress go hand in hand.\"","Dec. 8: Animoca Brands disclosed raising $11.9 million in a second tranche of funding for Mocaverse, following a previous $20 million raise announced in September. \"Participants in this second tranche of funding for Mocaverse included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, and others. In both tranches Animoca Brands raised the funds via the issue of new ordinary shares at a price per share of A$4.50; as part of each raise, the Company granted to the investors in each round a free-attaching utility token warrant on a 1:1 dollar basis,\" according to a press release.","Dec. 8: SKALE is the first blockchain to embrace an appchain infrastructure with zero gas fees for the end user, based on a vote by the community. According to the team: \"The SKALE Chain Pricing proposal brings sustainability to the blockchain, where chain owners' subscription payments offer validators an additional revenue stream and eliminate user gas fees. This vote will propel the network into the next phase, making it one of the only blockchains to run in an economically viable manner where without inflation. The network runs at a profit for decentralized workers and stakers.\"","Dec. 8: The Institute of Electrical and Electronics Engineers, with over 426,000 members in more than 160 countries, plans to issue credentials and certificates on the Avalanche C-Chain, according to a tweet. The effort will \"make the verification process tamper-proof, instant and secure,\" the post read. The team wrote in a message: \"As a leader in setting technical standards, IEEE's embrace of the blockchain for credentialing marks a significant milestone in the adoption of Web3.\" (AVAX)","Dec. 8: Blockaid, a provider of Web3 security tools, announced a new \"Transaction Safety\" feature on Rainbow wallet, according to the team: \"This security upgrade will provide millions of Rainbow wallet users with real-time protection against malicious sites and apps, and full transparency into the path of each Web3 transaction before signing any confirmations.\"","Dec. 7: Lantern Finance, a Web3 startup, has launched its user-friendly staking platform in 15 U.S. states, including major markets like California, Pennsylvania, Illinois, Virginia, and Massachusetts, according to the team: \"Inspired by the cofounders' experiences with the 2022 crypto bankruptcies, Lantern aims to redefine the crypto landscape with an emphasis on clarity, security, and regulatory adherence. The platform's goal is to democratize access to crypto banking services, making complex tasks like staking and taking on loans accessible and intuitive for everyday users, while upholding the highest standards of safety and compliance.\"","Dec. 7: Blocknative, a blockchain infrastructure company that cut staff in October after suspending work on a major business project, is releasing a new tool to examine the \"mempool\" of pending transactions awaiting processing on Ethereum, an effort that could ultimately help to reduce instances of block-level manipulation and protect users from front-running bots. The real-time explorer tool is called ethernow.xyz, which gives insights into Ethereum mempool data and the block building process, and Blocknative CEO Matt Cutler described it as the Etherscan for pre-chain data.","Dec. 7: The community supporting Orchid, the decentralized bandwidth marketplace and VPN app, has a new open-source initiative, “Storchid,” which expands the Orchid to include data storage and address the trust and security holes in the current centralized data storage standards, according to the team: \"The initiative builds on existing core technologies such as erasure coding, bonded commitments and stake-weighted random selection for incentive alignment. A core component is the Orchid Directory Mechanism where clients and providers alike are incentivized to maintain marketplace security.\"","Dec. 7: Jack Dorsey's fintech company Block (SQ) has unveiled its self-custody bitcoin wallet Bitkey for pre-order in more than 95 countries. Bitkey consists of a mobile app, hardware device and a set of recovery tools, Block announced on Thursday.","Dec. 7: Uphold, a Web3 financial platform, on Thursday launched the beta version of its new assisted self-custody wallet, Vault, which uniquely addresses the UX issues that plague users of typical crypto wallets and self-custody solutions, according to a press release. \"The first digital asset that will be supported on Vault is the XRP token, the native token of the XRP Ledger, a decentralized layer 1 blockchain. Vault will expand to offer additional chains starting with BTC in Q1,\" according to the release.","Dec. 7: Neon EVM, a smart-contract program on the Solana blockchain that accepts Ethereum-like transactions, integrates with Tide, a Web3 marketing and data analytics protocol, according to the team: \"Tide's approach incentivizes repeated community and product engagement, tracking on-chain transactions and fostering vibrant decentralized communities. With Neon's cutting-edge dApp ecosystem and Tide's features like building brand awareness, learn-to-earn incentives, Web3 quests and referral programs, users can participate in the first Neon EVM campaigns on Tide to earn badges and tokens on the newly launched chain.\"","Dec. 7: Aori, an off-chain orderbook protocol with permissionless settlement, launches today to create more capital efficient peer-to-peer markets on Ethereum, according to the team: \"Aori uses MEV 'searchers' as market makers for quicker settlements, bridging the CEX\/DEX gap. It focuses on gasless order creation, fair pricing and speedy settlements. Aori is intended to feel like a CEX experience but is entirely self-custodied. All transactions clear through Seaport, also utilized by OpenSea. Aori seeks to move existing on-chain infrastructure off-chain, to minimize smart contract risk wherever possible.\"","Dec. 7: Safe is joining forces with Sygnum Bank and CoinCover to launch Safe{RecoveryHub}, offering a suite of crypto recovery options ranging from fully self-custodial to fully custodial, catering to individual and institutional needs, according to the team: \"With Safe{RecoveryHub}, users can recover access to their accounts through designated recoverers, which can be personal backup devices, family members and collaborators, also known as social recovery. In addition, trusted third-party services like Sygnum and CoinCover can be designated as recoverers to facilitate the recovery of assets in the case of lost keys.\"","Dec. 7: Namada, a protocol that introduced to the world the concept of privacy as a public good, and scheduled to launch early next year, has initiated the Retroactive Public Goods Funding (RPGF) program, allocating 6.5% of its total NAM token supply to acknowledge and reward the invaluable contributions of individuals in the privacy, zero-knowledge (ZK) technology, and related ecosystems, according to the team. This distribution extends to:","- Developers of Zcash infrastructure.","- Rust dependencies vital for Namada.","-Contributors to various cryptographic protocols.","- Decentralized privacy solutions.","Dec. 7: HyperOracle integrates its zkOracle protocol with Polygon CDK, enhancing DeFi and on-chain AI capabilities, according to the team: \"This collaboration enables the creation of advanced dApps, including decentralized stablecoins and AI-powered applications. Polygon CDK's launch of ZK-powered layer-2 chains on Ethereum is augmented by HyperOracle's zkOracle, offering verifiable compute and historical on-chain data access. The collaboration aims to drive innovation in DeFi, with HyperOracle co-developing a new zk-WASM based proving backend for Polygon CDK.\"","Dec. 7: Bitcoin-focused project Babylon raised $18 million in an investment round led by Polychain Capital and Hack VC. Babylon is a marketplace offering bitcoin (BTC) as a staking asset, allowing proof-of-stake chains to acquire funding from the swells of capital stored in the largest cryptocurrency. Babylon will use the funds to advance the development of the staking protocol, according to an emailed statement shared with CoinDesk on Thursday. Framework Ventures, Polygon Ventures, Castle Island Ventures, OKX Ventures, Finality Capital, Breyer Capital and Symbolic Capital also participated in the fundraise.","Dec. 6: Beam, an open-source blockchain specialized for gaming and run by Merit Circle DAO, will now launch on Immutable zkEVM, a groundbreaking scaling solution powered by Polygon, according to the team: \"Beam is an ecosystem and a blockchain. We want to remain chain-agnostic. Where we started as a subnet on Avalanche, we don’t want to limit ourselves to the Avalanche ecosystem. Right now, we’re working with Immutable to launch some of our products on the zkEVM, and integrate that network into our products as well.\"","Edited by Bradley Keoun."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$2.5","content":"MONEY"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"Lantern Finance","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$90 billion","content":"MONEY"},{"type":"February 2023","content":"DATE"},{"type":"Breyer Capital and Symbolic Capital","content":"ORGANIZATION"},{"type":"Illinois","content":"LOCATION"},{"type":"Taiwan","content":"LOCATION"},{"type":"Wonderland","content":"LOCATION"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"Vault","content":"LOCATION"},{"type":"Sygnum Bank","content":"ORGANIZATION"},{"type":"Octant","content":"PERSON"},{"type":"first quarter of 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"BTI","content":"ORGANIZATION"},{"type":"Oct. 31","content":"DATE"},{"type":"Mantle","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"$40M","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Finality Capital","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"Connext","content":"ORGANIZATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"Universal Privacy Alliance (UPA","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"$632 million","content":"MONEY"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"$26.4 million","content":"MONEY"},{"type":"Restake","content":"ORGANIZATION"},{"type":"The Institute of Electrical and Electronics Engineers","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$220M","content":"MONEY"},{"type":"Enzyme Finance","content":"ORGANIZATION"},{"type":"Access Control","content":"ORGANIZATION"},{"type":"HyperOracle","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Merit Circle DAO","content":"ORGANIZATION"},{"type":"Brahma Console","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Uzbekistan","content":"LOCATION"},{"type":"$11.9 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Charles Adkins","content":"PERSON"},{"type":"El Salvador","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"credentialing marks","content":"MONEY"},{"type":"Adkins","content":"PERSON"},{"type":"1 million $SSV","content":"MONEY"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"AUM","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Seaport","content":"LOCATION"},{"type":"Golem Foundation","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Verida","content":"ORGANIZATION"},{"type":"The Hedera Council","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Chu Mei","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Vertex Protocol","content":"ORGANIZATION"},{"type":"Orchid Directory Mechanism","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Virginia","content":"LOCATION"},{"type":"Brahma","content":"LOCATION"},{"type":"6.5%","content":"PERCENT"},{"type":"Diva","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"900%","content":"PERCENT"},{"type":"Massachusetts","content":"LOCATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Fantom","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Dec. 8","content":"DATE"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Dec. 7","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Dec. 6","content":"DATE"},{"type":"Chainlink Labs","content":"ORGANIZATION"},{"type":"Dec. 5","content":"DATE"},{"type":"2","content":"DATE"},{"type":"Bacco","content":"ORGANIZATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"The Interchain Foundation","content":"ORGANIZATION"},{"type":"CDI","content":"ORGANIZATION"},{"type":"Dec. 11","content":"DATE"},{"type":"Namada","content":"ORGANIZATION"},{"type":"Nil Foundation","content":"ORGANIZATION"},{"type":"Matt Cutler","content":"PERSON"},{"type":"Dec. 14","content":"DATE"},{"type":"Dec. 12","content":"DATE"},{"type":"Dec. 13","content":"DATE"},{"type":"HD CoinDesk TrendMax Strategy","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Safe Foundation","content":"ORGANIZATION"},{"type":"Greenfield","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Flare Time Series Oracle","content":"ORGANIZATION"},{"type":"Chainlink Price Feeds","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}