{"summary":"The show is being developed by the creative team behind “Ratatouille – The TikTok Musical.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/06\/crypto-the-musical-aims-for-broadway\/","publishDate":"2022-07-06T19:46:41","id":16308,"type":null,"title":"‘Crypto: The Musical’ Aims for Broadway","category":["Finance"],"content":["Crypto has already established a foothold on Wall Street – but what about the Big Apple’s most famous avenue? If Amanda Cassatt has her way, “Crypto: The Musical” could be the next show to hit Broadway.","The musical – still in the very early stages of development – will tell the story of Zoe, a woman who leaves her corporate job to join a crypto startup, “and the many absurdities, heartbreaks and triumphs she experiences along the way.”","Much like the project’s main character, the team behind “Crypto: The Musical” will face their own heartbreaks and absurdities in their bid for Broadway. Producing a musical doesn’t come cheap, so Cassatt – the CEO of Web3 marketing agency Serotonin – turned to the crypto community for help fundraising.","Cassatt set up MusicalDAO, a self-described decentralized autonomous organization that allows donors to contribute to the project’s funding in exchange for pre-sale tickets and other privileges, including naming a character or making an on-stage cameo. A minimum donation of $1,000 – paid in either stablecoins USDT or USDC – is required to join the DAO. Once the DAO reaches 1,500 individual contributors, membership will close and the project will go before Broadway investors to get the real cash it needs to debut.","Cassatt was reluctant to share with CoinDesk the number of people who have contributed funds, but said the reception to the project, which debuted at CoinDesk’s Consensus festival in Austin, Texas, last month, has been “great” so far.","On-chain data paints a slightly different picture. According to Etherscan, the designated donation address cryptothemusical.eth had received a singular $1,000 stablecoin contribution by press time.","A spokesperson for the project told CoinDesk that while the address was correct, the creative team is in no hurry to raise money.","“It’s early days for this project. It typically takes years to put together Broadway musicals,” the spokesperson told CoinDesk. “We’re starting to see a community gather. Web3 is all about experimentation, community building, and creating new models to shake up how things are traditionally done, and that’s what [the show] is all about.”","The online crypto community’s tepid response to the project isn’t entirely surprising. Cassatt acknowledges the “strange bedfellows juxtaposition” of a crypto-themed musical. (“I think that’s what makes it funny,” she told CoinDesk.) Strange bedfellows or not, “Crypto: The Musical” wouldn’t be crypto’s first foray into the world of Broadway: the longtime musical “Dear Evan Hansen” partnered with Roblox earlier this year to release a non-fungible token (NFT) collection benefitting a children’s mental health charity.","It doesn’t help the project’s launch has coincided with the onslaught of crypto winter: Major players in the crypto space are declaring bankruptcy and dropping like flies, and layoffs are accelerating across the industry.","Cassatt is hopeful her show can thrive in the bear market anyway.","“I think in this market, selling things to audiences at a million-dollar price point isn’t always the right thing, but I think reaching people where they are and bringing in more supporters at a grassroots level … makes a lot of sense,” Cassatt told CoinDesk.","“To do something entertaining and interesting and off-the-beaten path – I think this is the kind of lightness that the community needs and wants during this time,” she said.","The project’s executive producers, composer Daniel Mertzlufft and Macy Schmidt, were part of the team behind the delirious COVID-19 pandemic spectacle, “Ratatouille: The TikTok Musical.” Cassatt’s company, Serotonin, will produce “Crypto: The Musical” alongside two Tony Award-winning producers.","Crypto-themed songs, including one about the Howey Test – a legal metric for determining what qualifies as a security – and another about NFTs, called “Right Click Save” will provide the soundtrack for “Crypto: The Musical.” Even the project’s ostensibly non-crypto songs are dripping with crypto references; in a love song sung by the main character, she references being “tethered to a stable man.”","But Mertzlufft told CoinDesk that while he wants the project’s songs to showcase the team’s knowledge, he’s wary of turning it into the “‘Schoolhouse Rock’ of Web3.”","“There’s lots of little things in there where if you know, you know and, if not, it’s just a song,” Mertzlufft said. “Our character, Zoe, is also not a Web3 person at the beginning of the show, so an audience member who is also not a Web3 person learns along with her. The goal is that you never feel like you’re being forced to learn.”"],"entity":[{"type":"Zoe","content":"PERSON"},{"type":"Cassatt","content":"PERSON"},{"type":"Macy Schmidt","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"Daniel Mertzlufft","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"$1,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Evan Hansen","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Roblox","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"TikTok Musical","content":"ORGANIZATION"},{"type":"Big Apple","content":"ORGANIZATION"},{"type":"CoinDesk’s Consensus festival","content":"ORGANIZATION"},{"type":"Tony Award","content":"PERSON"},{"type":"Mertzlufft","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Amanda Cassatt","content":"PERSON"},{"type":"Etherscan","content":"LOCATION"}],"hashtag":["New York","DAO","Web 3.0"],"authors":["Cheyenne Ligon"]}