{"summary":"The bill lets law enforcement freeze crypto without a conviction, promising faster and more substantial seizures.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/10\/26\/uk-lawmakers-pass-bill-to-help-seize-illicit-crypto\/#:~:text=A%20bill%20that%20will%20help,from%20drug%20trafficking%20to%20cybercrime.","publishDate":"2023-10-26T11:35:40","id":16311,"type":null,"title":"UK Bill for Seizing Illicit Crypto Finally Becomes Law","category":["Policy"],"content":["A bill that will help law enforcement agencies seize and freeze crypto used for crime became law on Thursday after receiving the King's approval .","The Economic Crime and Corporate Transparency Bill covers a range of criminal activities from drug trafficking to cybercrime. Provisions in the bill give broader powers to local cops, and will let them seize crypto with criminal links without a conviction – something experts say would come in handy, particularly in time-sensitive cases.","The bill was introduced last September, and since then amendments have been added to ensure the measures were extended to cover terrorism. Separate provisions to help authorities seize other assets that can help identify crypto linked to crime were also added. It was passed by Parliament on Wednesday.","Although the U.K. has expressed a desire to become a global hub for crypto and has passed some legislation to legitimize crypto in the country, it has also been clamping down on crypto crime and scams. Law enforcement agencies have already seized hundreds of millions of pounds worth of crypto tied to criminal activity and have placed crypto tactical advisers in police departments nationwide to assist in investigations.","Read more: UK Crime Bill Lets Cops Freeze Crypto Faster, Channels Tainted Assets to Public Funding","CORRECTION (Oct. 26, 14:55 UTC): Corrects to say the bill was passed by Parliament on Wednesday; adds that it received royal assent on Thursday.","Edited by Sandali Handagama."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"UK Crime Bill Lets Cops Freeze Crypto Faster","content":"ORGANIZATION"},{"type":"Oct. 26","content":"DATE"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Sandali Handagama","content":"ORGANIZATION"},{"type":"King","content":"ORGANIZATION"}],"hashtag":["Regulations","Crypto","UK"],"authors":["Camomile Shumba"]}