{"summary":"Mining economics have improved significantly, according to one analyst.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/07\/06\/bitcoin-miner-profitability-could-double-after-record-drop-in-network-difficulty\/","publishDate":"2021-07-06T21:31:11","id":16317,"type":null,"title":"Bitcoin Miner Profitability Could Double After Record Drop in Network Difficulty","category":["Markets"],"content":["","Active bitcoin miners may see their profitability double following the 28% downward difficulty adjustment in mining on July 3, according to several mining sites. ","","","The North American hash spread – an index invented by digital asset financial services platform BitOoda to measure the difference between bitcoin mining revenue per megawatt-hour and the cost of the needed power – has almost doubled to $449 from $225. ","","","\"Mining economics have improved significantly,\" Sam Doctor, chief strategy officer at BitOoda, wrote Monday in a newsletter.","","","Such projections follow the record downward adjustment in the Bitcoin blockchain's mining difficulty. The adjustment process, which was coded into the network's original programming, is designed to stabilize the blockchain by incentivizing miners back to the network whenever there's a significant drop in the hashrate, which is the amount of computational activity working to secure data and finalize transactions.","","","China's recent crackdown on the crypto industry forced many miners to shut down, cutting the total hash power by more than half from record levels earlier this year. The seven-day average hashrate fell to 84.3 exahashes per second on Friday, before the difficulty reset, the lowest since September 2019. But it has since jumped back to about 90.7 exahashes per second, according to Glassnode.","","","Miners may see similar profitability levels as in April, when bitcoin was trading at nearly double its current level, according to an analysis by Glassnode. While prices are much lower now, fewer miners are splitting the revenue. ","","","Meanwhile, as some Chinese miners have been selling their mining computers or \"rigs\" at discounts, prices for the machines have dropped. According to Luxor Mining, newer and next-generation rigs have lost 32% of resale value, while the oldest machines saw price declines of 36%.","","","Remaining miners will continue to see profitability boosts, until the infrastructure catches up, according to industry experts. ","","","“It's become both easier and more profitable to mine bitcoin,” said Nick Spanos, co-founder of Zap Protocol, an infrastructure provider for decentralized apps. “That’s a recipe for enticing more miners back in.”",""],"entity":[{"type":"$449","content":"MONEY"},{"type":"$225","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"Nick Spanos","content":"PERSON"},{"type":"Luxor Mining","content":"LOCATION"},{"type":"September 2019","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"36%","content":"PERCENT"},{"type":"July 3","content":"DATE"},{"type":"Sam Doctor","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Glassnode","content":"ORGANIZATION"},{"type":"BitOoda","content":"ORGANIZATION"}],"hashtag":["Bitcoin Mining","Bitcoin","Hashrate","Mining Difficulty"],"authors":["Frances Yue"]}