{"summary":"The move was announced in August by Prime Minister Anthony Albanese's new government .","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/02\/03\/australia-releases-token-mapping-consultation-paper-plans-to-reveal-crypto-rule-framework-in-2023\/","publishDate":"2023-02-03T06:49:28","id":16316,"type":null,"title":"Australia Releases Token Mapping Consultation Paper, Plans to Reveal Crypto Rule Framework in 2023","category":["Policy"],"content":["The Australian government released a token mapping consultation paper on Friday and has sought responses from stakeholders on it by March 3.","The move was announced in August 2022, around three months after Prime Minister Anthony Albanese's new government took over from the previous labor administration under Scott Morrison. The new government said at that time it would be taking a \"more serious approach to work out what is in the ecosystem and what risks need to be looked at first.\"","\"Token mapping is the process of identifying the key activities and functions of products in the crypto ecosystem and mapping them against existing regulatory frameworks,\" the paper said.","Australia has been in damage control mode ever since the crypto contagion of 2022, which was exacerbated by the FTX exchange collapse. The authorities have been clamping down on several companies after having missed acting on its own concerns around Sam Bankman-Fried's company. In December it moved to tighten safety around crypto announcing it would establish a framework for the licensing and regulation of crypto service providers in 2023.","“Australia’s token mapping exercise is the first of its kind by a national government, going back to first principles to understand crypto and map it to an existing regulatory framework,\" said Angela Ang, senior policy adviser at blockchain intelligence firm TRM Labs and former regulator at the Monetary Authority of Singapore. However, the biggest question was how Australia would tackle Decentralized Finance (DeFi), Ang added.","The token mapping consultation paper also revealed it's plans around crypto regulation.","The plan is to \"release a (separate) consultation paper proposing a licensing and custody framework for crypto asset service providers in mid-2023\" because \"after token mapping, licensing and custody reforms are the logical next step for crypto reforms in Australia.\"","The purpose of this consultation paper would be to identify appropriate obligations and operational standards for crypto asset service providers and how they safe-keep assets for customers.","The government will seek feedback for the crypto asset consultation paper to be released in mid-2023 around the role of government in regulation of the crypto eco-system, potential safeguards for investors, and how to prevent scams. Australia also plans to complete its CBDC pilot this year and at least two major Australian banks plan to create a stablecoin.","Read More: Australia to Use 'Token Mapping' as Framework for Crypto Regulation"],"entity":[{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Scott Morrison","content":"PERSON"},{"type":"August 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Anthony Albanese","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Angela Ang","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Crypto Regulation","content":"ORGANIZATION"},{"type":"March 3","content":"DATE"}],"hashtag":["Regulations","Australia","token","Policy","Treasury"],"authors":["Amitoj Singh"]}