{"summary":"Wallets containing bitcoin seized by the U.S. government in the notorious Bitfinex hack – later leading to guilty pleas for Ilya Lichtenstein and Heather \"Razzlekhan\" Morgan – have suddenly become active.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/28\/us-government-crypto-wallets-transfer-nearly-1b-of-bitcoin-seized-from-bitfinex-hacker\/","publishDate":"2024-02-28T20:31:46","id":16313,"type":null,"title":"U.S. Government Crypto Wallets Transfer Nearly $1B of Bitcoin Seized From Bitfinex Hacker","category":["Technology"],"content":["Two crypto wallets tagged as holding funds seized by the U.S. government related to the infamous Bitfinex hack have just transferred nearly $1 billion of bitcoin to unidentified addresses.","A wallet that's one of at least three tagged by the blockchain-data firm Arkham Intelligence as holding seized Bitfinex hacker funds, on behalf of the government, initially transferred 1 BTC around 18:39 UTC (1:39 pm ET). Roughly a half-hour later, the remaining 2,817 BTC in the wallet were sent, leaving the wallet empty. Together they represented about $173 million worth of bitcoin.","Shortly afterward, another wallet, containing about 12,300 BTC, transferred 0.01 BTC to a different unidentified address, according to Arkham, and shortly afterward the remaining BTC were sent. Those transfers represented about $750 million worth, bring the total value of the bitcoin transferred from the two wallets to about $923 million, based on the current price of the leading cryptocurrency.","The motive for the transfers wasn't clear, and the Justice Department declined to comment on the purpose, but an official confirmed that they were conducted as part of legitimate law enforcement-related activities.","The bitcoin moved during a volatile day of trading in the cryptocurrency, with its price hitting $60,000 for the first time since November 2021, then climbing further above $64,000 before abruptly plunging to just above $59,000. As of press time it was changing hands just above $60,000. The all-time high price, set in late 2021, was around $69,000.","According to Arkham, there is another U.S. government wallet containing about 94,600 BTC of seized Bitfinex hacker funds, worth roughly $5.79 billion at the current price.","The Bitfinex hack was one of the crypto industry's most notorious heists, partly due to the colorful social-media posts of Heather \"Razzlekhan\" Morgan, who was charged in the case along with Ilya Lichtenstein.","According to a Justice Department press release in August, the government seized about 95,000 stolen bitcoin from crypto wallets in the defendants' control, valued about $3.6 billion at the time of the seizure.","UPDATE (15:50 UTC): Adds that Justice Department confirms the transactions were conducted for legitimate law enforcement purposes."],"entity":[{"type":"$923 million","content":"MONEY"},{"type":"$60,000","content":"MONEY"},{"type":"$59,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Heather \"Razzlekhan\" Morgan","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"Arkham","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"$5.79 billion","content":"MONEY"},{"type":"$3.6 billion","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"$750 million","content":"MONEY"},{"type":"the Justice Department","content":"ORGANIZATION"},{"type":"$173 million","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"$64,000","content":"MONEY"},{"type":"Ilya Lichtenstein","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["Bitfinex","Bitcoin","U.S. Government","Justice department","Hack","Analysis","On-Chain Analysis","Arkham intelligence"],"authors":["Bradley Keoun"]}