{"summary":"In years past, regulatory clarity has fueled crypto bull markets. While global strides in clear crypto regulations are evident, particularly in Hong Kong, EU and UK, the US lags, emphasizing the need for enhanced regulatory certainty in the industry's advancement.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/coindesk-indices\/2023\/08\/10\/what-in-the-world-is-going-on-with-crypto-regulation\/","publishDate":"2023-08-10T15:45:00","id":16325,"type":null,"title":"What in the World Is Going on With Crypto Regulation?","category":["CoinDesk Indices"],"content":["While the technologies underpinning blockchain, crypto and tokenization continue to rapidly evolve, the regulatory frameworks of many countries continue to develop. We have seen some regions with unclear regulatory frameworks, while others are making their regulatory stance clear.","The digital asset space needs pillars of trust via regulatory certainty to bring codified benefits for investors, enabling the community to grow safely and function long-term.","Below, David Lawant and Purvi Maniar of FalconX have simplified the current global cryptocurrency regulation landscape, explaining how certainty has already impacted price movement.","Read on to understand the blossoming regulatory frameworks at work in our industry.","– S.M.","You're reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Technical developments and the blossoming of additional applications have been the hallmarks of crypto bull markets. More surprisingly, as the technology has matured, regulatory clarity has been a keen driver of crypto markets since the emergence of this asset class.","Japan’s recognition of crypto as a means of payment in 2016 was a relevant driver behind the 2016-2017 bull market. Even more significantly, a series of interpretative letters from the Office of the Comptroller of the Currency (OCC), the primary U.S. bank regulator, that gave comfort to financial institutions to engage with crypto in 2020 was an undeniable catalyst for the 2021 run.","Crypto has grown to the point that regulatory clarity is critical for the next potential bull market. And as the stakes get higher, the dynamics are becoming more complex.","The casual observer might be surprised by the sheer number of regions across the globe attempting to attract crypto businesses and innovators, by offering clear and understandable regulations. These are just some of the key developments in 2023 so far:","On the other hand, it is hard to deny that the U.S. is lagging behind other financial jurisdictions in providing the regulatory clarity that the industry craves so much.","Lack of U.S. banking access was a meaningful barrier to operations for crypto firms earlier this year due to what many considered a coordinated effort, which the industry nicknamed Operation Chokepoint 2.0. The SEC’s engagement with the crypto industry has gone beyond the welcomed chasing of bad actors to creating widespread uncertainty around applicable crypto regulation that is now driving legitimate players to move offshore.","There are, however, early signs that the tide is turning for crypto in America.","The Blackrock spot BTC ETF filling in mid-June marked the start of the most compelling round of such fillings to date. The SEC also indicated an openness to futures-based ETH ETFs. Recently, bills addressing crypto market structure and stablecoins have passed their relevant committees with bipartisan support. PayPal just announced a payments stablecoin using the Ethereum blockchain.","Each one of these events suggests a move towards improving the regulatory status for crypto in the U.S by key industry players or legislators.","Crypto regulatory clarity is no longer a wish list item but a necessity. The good news is that the balance of events in 2023 skews strongly positive around many significant jurisdictions. The not so good news is that we likely still have a long and winding road to get to where the industry wants and deserves to be. In the U.S.,for example, even if the market structure and stablecoins bills pass the House they will still have to deal with potentially more hostile Senate and White House, likely during a national election year.","We are optimistic. Even if the regulatory developments worldwide are not perfect and the U.S. still has a long way to catch up, in a few years we will remember this time as the critical juncture in which the foundational groundwork for adequate crypto regulation was laid out.","- David Lawant and Purvi Maniar from FalconX","Q: My U.S. clients have already invested in crypto, but are worried about whether it’s legal. How can I help them?","A:","You can start with some education for your clients regarding regulations. Unfortunately, in the U.S. we have less regulatory clarity than virtually anywhere else in the world when it comes to crypto assets. The need for clarity falls to many regulatory bodies – the SEC, IRS and Treasury Department, mainly.","If your clients have purchased crypto assets through an exchange like Coinbase or Kraken, they may not have been deemed a security at the time of purchase. If the tokens they invested in are later determined to be securities, your client may have tax considerations to manage.","For now, we’re sure bitcoin is not a security. Everything else is up for grabs, and the answer for any individual asset may be more nuanced than a simple “yes or no.”","The issues with regulations revolve around the ability to issue and market the tokens. If a token is determined to be a security, it would likely have to be delisted from most U.S. exchanges, which could have dramatic value implications. This is a good place to have a conversation about the risks of investing in crypto.","Q: My clients want to know: Should they set up crypto accounts or wallets in more friendly jurisdictions?","A:","This really depends on the amount of money your clients are investing in crypto. Clients who hold large crypto positions can consider geographical arbitrage. However, that could potentially cause more problems than it solves as they have to navigate more regulatory environments.","Regardless, if you have clients investing significant sums, it might be time to enlist a seasoned crypto CPA or attorney that can help with those questions. The jurisdiction where the assets are held, and the form in which they’re held, are going to be based on asset treatment, privacy, tax treatment, asset protection and more.","– Adam Blumberg, Interaxis","Fresh off the press, NASDAQ just released a report on the state of global regulation and crypto.","The XRP token is NOT a security when sold to the public, according to a ruling by Manhattan judge in June. The SEC doesn’t agree with the ruling, so it may not be settled yet, but the markets responded favourably to the ruling.","Is the SEC shifts focus from crypto for the next shiny object: AI? Will this delay clarity in the space?","Edited by Pete Pachal."],"entity":[{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Adam Blumberg","content":"PERSON"},{"type":"Purvi Maniar","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"David Lawant","content":"PERSON"},{"type":"Interaxis","content":"LOCATION"},{"type":"America","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Pete Pachal","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"the U.S.","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Investing","crypto regulation","SFC","Japan","OCC"],"authors":["Sarah Morton","David Lawant"]}