{"summary":"Atomic swaps open the door for truly decentralized cross-chain trading.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/atomic-swaps-what-are-they-how-do-they-work\/","publishDate":"2024-01-11T19:57:53","id":16328,"type":null,"title":"Atomic Swaps: What Are They & How Do They Work?","category":["Learn"],"content":["Decentralization in crypto involves eliminating intermediaries to facilitate transactions. Atomic swaps utilize self-executing smart contracts to enable peer-to-peer (P2P) cryptocurrency transactions across blockchains.","Read on to learn how atomic swaps work, how they differ from cross-chain bridges, and what their benefits and drawbacks are.","This is partner content sourced from Laura Shin’s Unchained and published by CoinDesk.","An atomic swap protocol enables P2P transactions between parties wishing to exchange cryptocurrencies on different blockchain networks.","Smart contracts eliminate the need for a third party, such as a centralized exchange, enabling decentralized, cross-chain crypto asset trading.","The trustless and private nature of atomic swaps ensures that the parties involved remain confidential. However, the individual transactions involved in a cross-chain swap are still trackable on the public ledger of their respective blockchains.","Atomic swaps enable cross-chain crypto asset swapping powered by cryptography and smart contracts. Let’s look at the process step by step.","If either party fails to execute their part as specified in the contract, the swap becomes invalid. If one party has sent their crypto, they receive a refund.","Cross-chain swaps differ from cross-chain bridges even though they both offer blockchain interoperability.","Blockchain bridges involve creating a wrapped token and then availing an equivalent amount on the target blockchain. You can then transfer or trade the wrapped token on the target blockchain or redeem it for the original assets on the source blockchain.","Alternatively, atomic swaps enable P2P exchanges between two parties across two separate blockchains. There are no intermediaries involved. Additionally, swaps require the same hashing algorithm, while bridges don’t.","Cross-chain swaps provide a suite of benefits to crypto traders.","In their current form, cross-chain swaps present several challenges to users.","One of the key aspects of decentralized trading is that users can maintain custody of their crypto assets. Conversely, centralized exchanges take custody of your assets and maintain access to your private keys. Consequently, the security of your crypto holdings relies on the exchange remaining solvent and invulnerable to any malicious attacks.","Cross-chain swaps offer greater interoperability across various blockchain networks, ensuring truly decentralized trading. However, support for atomic swaps is only available on a few platforms, making access challenging. Additionally, you need some programming and cryptographic knowledge to understand the technical aspects of atomic swaps, which may be daunting to non-tech-savvy traders."],"entity":[{"type":"Laura Shin’s Unchained","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":["Features","laura-shin"],"authors":["Unchaine d"]}