{"summary":"South Korea’s nearly 7 million registered users, many in the nation’s capital, show a huge interest in trading crypto. But No. 4 in CoinDesk’s Crypto Hubs 2023 is still licking its wounds after the catastrophic collapse of Terra blockchain – for a time, South Korea’s favorite crypto project.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/27\/seoul-asias-retail-crypto-capital-moves-on-after-do-kwon\/","publishDate":"2023-06-27T11:39:12","id":16321,"type":null,"title":"Seoul: Asia’s Retail Crypto Capital Moves on After Do Kwon","category":["Consensus Magazine"],"content":["The capital city of Seoul is in the top tier for regulatory structure and scored high for ease of doing business and digital infrastructure – all criteria in which the government has a strong influence. Its grassroots’ embrace of crypto puts the country within the top 15% of the world in the crypto adoption index. But as the most populous hub in our final 15, it was hurt by a low opportunities score, which is a measurement of per-capita crypto jobs, companies and events. The sparse postings could be due to a cultural or language barrier, however, as we measured activity on Linkedin, Eventbrite and Meetup.com.","For more on the criteria and how we weighted them, see: How We Ranked CoinDesk’s Crypto Hubs 2023: Our Methodology.","\n","Earlier this year XRP was soaring, and at first it wasn’t entirely clear why. It later became evident that this was just another example of how Korean retail investors have the power to move global markets. At the time UpBit, Korea’s biggest exchange, led global XRP trading volumes with more than $790 million in tokens traded over 24 hours, overtaking volumes on Binance, the largest exchange in the world.","This is just one instance. Korean retail traders are known for pushing up other coins as well – and no, that’s not just smaller altcoins. The Korean won is consistently in the top three national currencies traded against Bitcoin, according to Coinhills. More generally, awareness of and interest in crypto is relatively high. Korea’s Financial Intelligence Unit (FIU) reported in September that there were nearly seven million registered crypto users in Korea. That’s roughly 14% of the total population.","It’s not surprising that such a powerful retail market would help vault Seoul onto a list of global crypto hubs. But Seoul is appealing in plenty of other ways: It’s a fast-paced and entrepreneurial city in an often fast-paced and entrepreneurial region. It’s no secret that Asia’s prominence in crypto is on the rise, especially after regulatory crackdowns in the United States.","Read Crypto Hubs 2023: Where to Live Freely and Work Smart","Members of South Korea’s crypto community explained Seoul’s appeal in a few ways. One was an openness to experimentation. Another was Korea’s prowess in gaming. A third was simply its community of “builders.”","It certainly doesn’t hurt to have good Internet connectivity and a relatively mobile-savvy population. Literally nearly all South Koreans – 99.9% according to the government – have broadband internet access at home, and no other country comes close to South Korea’s 5G download speed of 432.7 Mbps, according to Statista. Some say that not knowing Korean can be a bit of an obstacle, but others say that the tech community knows English and people are also willing to learn.","A bigger obstacle, at least for now, might be Korea’s regulatory situation. President Yoon Suk-Yeol’s came to power with the promise of a crypto-friendly agenda. But he took office in May of 2022, the same month as the spectacular crash of the algorithmic stablecoin project Terra Luna. Terra Luna’s crash had a special impact in Korea — as its Terraform Labs co-founder Do Kwon was born in Korea and the project was extremely popular there. Korean media reported some 200,000 local victims of the crash. The project’s collapse seems to have dampened political enthusiasm for crypto, at least temporarily. Some in the Korean community complain that regulation is mostly focused on fighting crime like money laundering, rather than on fostering growth and development of the industry.","With Do Kwon’s arrest in Montenegro, the political mood may finally be thawing. But even if not, the next bull run could be all that it takes to give an extra push to this already vibrant market. Or as one Seoul-based crypto executive told me, “Crypto craze during a bull market is exciting anywhere in the world, we turn it up a few notches and make it f**king amazing in Seoul.”","Edited by Jeanhee Kim and David Z. Morris."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Meetup.com","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Jeanhee Kim","content":"ORGANIZATION"},{"type":"Korea","content":"LOCATION"},{"type":"May of 2022","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Korea’s Financial Intelligence Unit (FIU","content":"ORGANIZATION"},{"type":"David Z. Morris","content":"PERSON"},{"type":"Linkedin, Eventbrite","content":"ORGANIZATION"},{"type":"99.9%","content":"PERCENT"},{"type":"Terra Luna","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"Yoon Suk","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"Work Smart","content":"LOCATION"},{"type":"South Koreans","content":"LOCATION"},{"type":"$790 million","content":"MONEY"},{"type":"Statista","content":"LOCATION"},{"type":"Seoul","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Features","Crypto Hubs 2023","Seoul","Do Kwon","Yoon Suk-Yeol"],"authors":["Emily Parker"]}