{"summary":"Monaco’s Ministry of State has partnered with Tokeny to ensure control and compliance of tokenization projects in the tiny European country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69534\/government-of-monaco-teams-up-with-tokeny-to-oversee-tokenization-projects","publishDate":"2020-06-25T08:05:25","id":1632,"type":null,"title":"Government of Monaco teams up with Tokeny to oversee tokenization projects","category":["LAYER 1S"],"content":["Monaco’s Ministry of State has partnered with Tokeny to ensure control and compliance of tokenization projects in the tiny European country.","Tokeny <a href=\"https:\/\/tokeny.com\/the-principality-of-monaco-selects-tokeny-solutions-as-its-tokenization-platform\/\" data-v-f87c67ca=\"\">announced<\/a> the news on Thursday, saying that the ministry wants to support the financing of projects that are focused on environmental impact. The Monaco government recently <a href=\"https:\/\/wealthmonaco.com\/en\/monaco-votes-an-unprecedented-legislative-framework-for-cryptocurrency-fundraisers\/\" data-v-f87c67ca=\"\">passed<\/a> a bill that allows projects to fund themselves via issuing tokenized securities. The full regulatory framework is yet to be announced.","Tokeny CEO Luc Falempin told The Block that all issuers need to be approved by the government and get a visa to set up in Monaco. The projects must have an environmental, social and governance (ESG) focus, he added.","Since Tokeny is the government’s selected partner, all projects would have to use its platform, said Falempin. “Tokeny will provide the digital services for issuers to enforce the control and compliance on the blockchain. We do this through our protocol, the T-REX. Essentially this protocol ensures only eligible investors are onboarded through automated compliance,” said Falempin.","Tokeny will also provide issuers with an interface to onboard investors and manage their investors post issuance of securities. On the investors' side, the firm will provide a portal so they can manage their investments easily, said Falempin.","The first approved project to issue tokenized securities is production company IceBreaker Studios by French filmmaker Luc Jacquet.","Jacquet, whose documentary film March of the Penguins won an Oscar in 2015, said IceBreaker intends to leverage blockchain technology “to facilitate the financing of meaningful content production while retaining all associated rights enabling new monetization opportunities via films, exhibitions, etc.”","“March of the Penguins and the subsequent Antarctica exhibition have demonstrated that the model can be a profitable one making it appealing to investors while preserving the freedom to express my creativity and promoting the virtuous value of the projects I carry,” Jacquet added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Monaco government will select 5 to 15 projects a year, said Falempin. He added that Tokeny is in discussions with other governments and “some of the biggest financial players” for partnerships.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTokeny is <a href=\"https:\/\/www.euronext.com\/en\/about\/media\/euronext-press-releases\/euronext-invests-tokeny-solutions-compliant-tokenization\" data-v-f87c67ca=\"\">backed<\/a> by European stock exchange operator Euronext, which has a 23.5% stake in the startup.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Luc Falempin","content":"PERSON"},{"type":"2015","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Antarctica","content":"LOCATION"},{"type":"Luc Jacquet","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Tokeny","content":"ORGANIZATION"},{"type":"Euronext","content":"ORGANIZATION"},{"type":"Monaco’s Ministry of State","content":"ORGANIZATION"},{"type":"23.5%","content":"PERCENT"},{"type":"Monaco","content":"LOCATION"},{"type":"Falempin","content":"PERSON"}],"hashtag":["TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}