{"summary":"Blockchain load — a measure of how much data is contained in blocks over a certain period — rose to 50% in the second quarter from under 40% in the first. It peaked at 81% in May.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/08\/07\/cardano-blockchain-transactions-jumped-49-last-quarter-as-ada-sentiment-grew\/","publishDate":"2023-08-07T10:18:39","id":16332,"type":null,"title":"Cardano Blockchain Transactions Jumped 49% in Q2 on Network Upgrades, New Users","category":["Technology"],"content":["Cardano blockchain activity in the second quarter grew in both value locked and transactional metrics from the first quarter amid technical improvements and a rise in developer interest, a report by analytics firm Messari shows.","While decentralized exchange Minswap showed the largest absolute growth, several new decentralized applications, or dapps, also contributed to the increase, Messari said.","The report, which was commissioned by Cardano developer Input Output, compared second-quarter developments against first-quarter figures. It noted that while transaction activity grew, the number of active daily users decreased 4% — the fourth drop in address activity in the past five quarters.","“The ratio of transactions to active addresses has been growing steadily over the past five quarters, suggesting that the average user is more active now than they previously were,” the report said. “In Q2, the Transaction \/ Active Address ratio of 1.19 was up 6.1% QoQ and 13.2% YoY.”","Blockchain load — a measure of how much data is contained in blocks over a certain period — rose to 50% from under 40% in the previous three months. It peaked at 81% in May.","DefiLlama data shows that $175 million worth of tokens are locked on Cardano as of Monday, the highest level for this year, but still about 50% below a lifetime peak of $340 million hit in May 2022.","Such activity comes on the back of key Cardano upgrades since the start of this year.","A change to reduce \"epoch\" transitions and make the blockchain smoother for network users took effect in June. Epochs refer to the time periods on Cardano, with epoch lasting 432,000 slots and each slot being one second.","ADA tokens are staked during these epochs during which new blocks on the Cardano network are produced, potentially increasing demand for the tokens as block rewards become more lucrative, based on activity.","In March, a feature on Milkomeda, a network that connects blockchains to the Ethereum Virtual Machine, or EVM, began to allow Cardano blockchain users to gain access to EVM smart contracts with any cardano (ADA) wallet, expanding the ecosystem's usefulness.","An Ethereum Virtual Machine is where all Ethereum accounts and smart contracts live, serving as a virtual computer used by developers to create dapps.","The new feature will allow Ethereum application developers to build on Cardano’s network using Solidity — the computer language used to code Ethereum — without needing to install new toolkits or learn a new computer language.","Such applications can then be used solely with Cardano tokens instead of ether (ETH), the native token of the Ethereum network, increasing the tokens' utility for holders.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Milkomeda","content":"LOCATION"},{"type":"81%","content":"PERCENT"},{"type":"May 2022","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Transaction \/ Active Address","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"6.1%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$175 million","content":"MONEY"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"13.2%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Messari","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$340 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"ADA","content":"ORGANIZATION"},{"type":"second quarter","content":"DATE"}],"hashtag":["Cardano","ADA","Tech","On-chain Data"],"authors":["Shaurya Malwa"]}