{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 14-March 20.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/14\/protocol-latest-tech-news-crypto-blockchain\/","publishDate":"2024-03-20T22:57:55","id":16331,"type":null,"title":"Protocol Village: Mysten Labs, Developer Behind Sui Blockchain, Claims to Achieve 'Linear Scaling'","category":["Technology"],"content":["March 20: Mysten Labs, the company behind the Sui blockchain, claimed a \"landmark achievement in scaling blockchain capacity\" known as \"linear scaling,\" according to the team: \"During testing and development in a Sui blockchain environment, Pilotfish, a prototype Sui extension, increased throughput by 8x when backed by 8 machines, successfully illustrating the possibility of linear scaling. The latency per transaction decreased as more machines were added, proving the viability of linear horizontal scaling for low latency blockchain transactions for the first time ever on any blockchain.\" (SUI)","March 20: The developers behind Starknet, the Ethereum layer-2 network whose $2.3 billion STRK token airdrop last month captivated crypto markets, plan to add a design feature known as \"parallelization\" – one of the factors that reportedly makes rival blockchain Solana popular as a venue for fast, cheap transactions. The feature will go live as part of an upgrade set for the second quarter, allowing Starknet to \"process a greater number of transactions simultaneously, resulting in improved throughput and faster L2 finality,\" according to a press release distributed by a representative of the developer StarkWare. It is part of the 2024 road map released Wednesday. (STRK)","March 20: Playnance, a Web3 leader in the P2E category claiming to account for up to 10% of total Polygon POS transactions, is announcing the launch of PlayBlock, a gaming Layer-3 ecosystem powered by Arbitrum Orbit, according to the team: \"The PlayBlock chain, developed using Arbitrum Nitro’s rollup technology, will be run on Gelato’s RaaS platform that natively leverages a suite of industry-leading Web3 services like Relayers, VRF, Functions and Account Abstraction. This allows developers to create more user-friendly gameplay directly on the blockchain, thereby enhancing transparency, fairness, and ownership of in-game assets.\"","March 20 (PROTOCOL VILLAGE EXCLUSIVE): BitsCrunch, the decentralized AI-powered Web3 analytics network, announced the comprehensive indexing of all Solana blocks, \"enabling the platform to offer in-depth analytics and forensic services for NFTs projects, marketplaces, gaming projects and brands within the Solana ecosystem.\" According to the team: \"BitsCrunch’s expanding suite of AI-enhanced capabilities, including NFT price estimation and IP infringement detection, are now fully operational for Solana-based projects. BitsCrunch applies advanced AI models to evaluate not just transactions but also the intricate details of NFT images.\"","March 20: Mamram Alumni Association, a dedicated network for alumni of the Israeli Defense Force's Center of Computing and Information Technology Systems, is launching the first blockchain incubation program for early stage blockchain and Web3 startups in Israel for 2024, according to the team: \"The Mamram Blockchain Incubator (M.B.I) is focused on exploration and ideation-stage founders and teams, and aims to boost Israel's status as one of the world's leading hubs of blockchain innovation.\"","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","March 19: The Stellar Development Foundation, the nonprofit supporting development and growth of the Stellar network, announced that the phased rollout of Soroban, Stellar’s smart contracts platform, is now complete, enabling anyone to build, deploy and interact with Stellar-based dApps. According to the team: \"Soroban offers comparatively lower fees than other smart contracts platforms by simplifying transactions and utilizing lower levels of computing power. To encourage projects to leverage Stellar’s smart contracts capabilities, SDF has also launched a $100 million Soroban adoption fund, 15% of which has so far been deployed.\" (XLM)","March 19: Conio, a financial technology company partly owned by Poste Italiane and Banca Generali, announced the acquisition of a new patent in the U.S., No. 11,915,314, showcasing a cutting-edge multi-signature model for the creation, custody, recovery and management of a digital asset. According to the team: \"The solution, designed to be blockchain agnostic compared to the blockchain used and therefore adaptable to different digital assets, involves the generation of three private keys, only two of which are needed to authorize transactions, thus enabling the recovery of the digital asset if one of the three private keys is unavailable.\"","March 19: EOS Network has upgraded to system contract v3.3.0, adding Transferable RAM and a RAM Utilities App among other features, according to the team: \"These enhancements aim to enhance flexibility, efficiency and overall utility, fostering a more sustainable and scalable ecosystem. With zero fees for transfers, improved RAM logging and notifications, and the option to burn RAM, users now have greater control over their resources. Technical enhancements, including improved integration with action return values, ensure seamless integration into the existing ecosystem.\" (EOS)","March 19: Particle Network, an account and wallet abstraction provider, has unveiled a modular layer 1 for multi-chain coordination and settlement, according to the team: \"This L1 introduces Universal Accounts, allowing users one address for all chains. Built on Cosmos, Particle uses EigenLayer via dual staking, with Universal Liquidity for cross-chain txns, a single gas token for all chains, and aggregating DA providers. Particle's 17M+ end users, 900 dApps, and $2B TVL will automatically be onboarded for Bitcoin+EVM interoperability and Universal Accounts, making this a promising launch. Testnet will go live Q1 2024.\"","March 19: Golem Network, the decentralized computing platform and pioneer Web3 project in the DePIN domain, has announced its strategic partnership with Gamerhash. As Golem Network expands its ecosystem to meet the computing needs of the AI industry, this collaboration with Gamerhash aims to increase the supply of GPU, addressing the rising demand for computing power in AI projects. In addition to leveraging Golem Network GPU providers, Golem is now expanding its reach by tapping into the GPU resources available within the gaming market.","March 19: OP Labs, the main development firm behind the Optimism blockchain, planned Tuesday to begin testing fault proofs on Ethereum's Sepolia test network. The new deployment comes a few months after Optimism launched an initial version of fault proofs on Goerli, another Ethereum test network, in October. Karl Floersch, co-founder of Optimism and CEO of OP Labs, told CoinDesk he expects the proofs to reach Ethereum's main network later this year, with the Sepolia deployment bringing the team closer than ever to this goal. (OP)","March 19: Waterfall Network, a layer-1 smart-contract platform based on directed acyclic graphs (DAG) technology, has upgraded \"to bring more efficiency to staking and security for node runners,\" according to the team: \"Upgrades include optimized storage, the ability to withdraw rewards during a Stake Delegation Trial Period, plus better collaboration for stake funding. Users can also delegate coins securely from their cold wallets, while node runners monetize free space via Space Rental for Workers on Nodes. This marks a paradigm shift in staking, enhancing efficiency, security and inclusivity.\"","March 19: Stardust, a Web3 gaming infrastructure provider, has partnered with Shrapnel, an anticipated AAA first-person shooter. Stardust’s wallet-as-a-service (WaaS) has been integrated into Shrapnel and Neon Machine’s Mercury platform, simplifying wallet management. WaaS offers invisible, custodial wallets for seamless gaming, enhancing the Shrapnel subnet experience. Shrapnel operates its own Subnet on Avalanche, along with a token and various game NFTs.","March 19: Velar, a Bitcoin liquidity protocol, has announced the launch of Dharma, its automated market maker, \"to bring DeFi liquidity to the Bitcoin ecosystem,\" according to the team: \"Set to go live on Bitcoin L2 Stacks on March 19, Dharma will expand the DeFi capabilities of the Bitcoin network. Velar’s V1 Dharma introduces decentralized exchange, allowing token pairs to be traded fully on-chain. Two token pairs will be supported upon launch with additional tokens set to be added on consecutive days. STX-ABTC and STX-AEUSDC will initially be available for trading before being complemented by the introduction of further pairs.\"","March 19: London-based Keyring raised $6 million in venture capital funding to expand its on-chain compliance platform, which is targeted to institutional investors and protocols, the firm said Tuesday. Gumi Cryptos Capital and Greenfield Capital led the seed investment round, with Motier Ventures, Kima Ventures and others also participating, the company said.","March 19: Outlier Ventures, a Web3 accelerator, announced the launch of the DePIN Base Camp accelerator program in collaboration with peaq, the layer-1 blockchain for real-world applications. According to the team: \"The program will begin in May 2024 and last for 12 weeks, with teams receiving up to $200,000 investment. The new program will focus on supporting the best founders from around the world, with selected teams engaging in a variety of virtual workshops, mentoring sessions and more, culminating in a virtual Demo Day.\"","March 19: 1inch, the decentralized exchange aggregator, will integrate decentralized liquidity network Lumia's Request for Quote feature, allowing users on 1inch to receive price quotes from CEXes and DEXes across the space, while making trades with the best pricing available in DeFi, according to the team: \"Lumia's technology aggregates order books from exchanges (CEX and DEX) offering price intelligence for users from CEXes and DEXes, and cheaper liquidity for trading platforms, all in a bid to solve the liquidity fragmentation conundrum in DeFi and crypto.\"","March 19: Mantra Chain, a planned network for swapping tokenized real estate and other assets, raised $11 million. Early-stage tech backer Shorooq Partners led MANTRA's round which also included Three Point Capital, Forte Securities, Virtuzone, Hex Trust and GameFi Ventures, according to a press release. The Middle East-focused project, is in the final stages of securing licensures from Dubai’s crypto regulator VARA, founder John Patrick Mullin told CoinDesk. These approvals will be essential in MANTRA’s plans to build and host a suite of compliance-minded tools for issuing and trading RWAs.","March 19: OKX Ventures has invested in Meson Network, a decentralized physical infrastructure network (DePIN), according to the team: \"Meson Network is making remarkable progress in the rapidly evolving field of decentralized bandwidth and big data solutions, with a strong emphasis on scalability, efficiency and cutting-edge technologies. Thanks to its community, Meson's decentralized network now boasts over 250,000 active nodes across 153 countries, reaching a bandwidth capacity of approximately 26 Tb\/s, equivalent to one-tenth of Akamai's capacity. This achievement sets a stable groundwork for future expansion.\"","March 19: JDI Ventures, a prominent DePIN investment fund under the blockchain hardware manufacturer JDI Global, has announced a strategic investment of $10 million in MXC Foundation. According to the team: \"This significant investment is set to drive the development of Ethereum's most expansive Decentralized Physical Infrastructure Network (DePIN), solidifying MXC's position as a key player in the decentralized technology landscape.\" MXC Foundation is focused on DePIN, leveraging LPWAN technology and layer-3 solutions, according to a press release.","March 19: Bitcoin Virtual Machine (BVM), a Bitcoin layer-2 project, will soon release a platform that allows users to spin up artificial intelligence (AI) models, developer punk3700 told CoinDesk in a message on Tuesday. The new feature, called Truly Open AI, will let users float AI models on the blockchain for use in crypto applications. Lead developer punk3700 said that Filecoin, NEAR, Avail, Polygon and Syscoin will provide the storage layers for the AI models.","March 19: Fuel Labs, a developer of Fuel Network, has partnered with Graviton, an Indian Web3 accelerator, to accelerate its second volume of Indian Web3 startups following a two-month nationwide roadshow. According to the message: \"Teams include Ultimate Digits, Evolve Art, Quantlytica, Allocate Back, Gameland and Stake-n-Bake. Graviton's previous cohort translated into an average seed investment of $42K per team, with fundraising feedback and training received from VCs like HashKey Group, NGC Ventures and Moonrock Capital – including Fetch.xyz's pre-seed raise of $1.5M led by HashKey.\" Fuel Network describes itself in project documentation as an \"operating system purpose built for Ethereum Rollups. Fuel allows rollups to solve for PSI (parallelization, state minimized execution, interoperability) without making any sacrifices.\"","March 19: Umoja, describing itself as a \"smart money protocol,\" has successfully closed on a $2 million extension to its initial seed funding round, bringing the total amount raised in the round to $4 million, according to the team: \"Led by Robby Greenfield, the former head of social impact at ConsenSys, Umoja is backed by Coinbase, 500 Global, Quantstamp, Blockchain Founders Fund, Orange DAO, Hyperithm, Psalion and the Blizzard Fund by Avalanche, among others.\"","March 19: GRVT, a hybrid cryptocurrency centralized exchange (CEX), announced a strategic fundraise of $2.2 million, bringing the total raised to $9.3 million, according to the team: \"This influx of capital, driven by growing interest from both institutional and retail investors, aligns with the launch of GRVT’s private beta platform. Notably, major trading firms and market makers such as QCP Capital, Selini Capital, Antelope, Pulsar Trading and Ampersan have contributed to this latest funding round.\"","March 18: Hercules, a decentralized exchange (DEX), has launched on Metis, an Ethereum layer-2 network, according to the team: \"The Hercules DEX offers customizable liquidity infrastructure and tools to help builders launch, bootstrap third-party, project-owned liquidity and foster partnerships. They will introduce a suite of features such as custom automated liquidity management, concentrated liquidity pools and dynamic fees.\"","March 18: Gnosis Venture Studios, the venture-building arm of Gnosis, unveiled uRamp, a \"next-generation provider of seamless, lower-fee on- and off-chain ramping experiences,\" according to the team: \"Designed with UX in mind from the outset and launched in collaboration with licensed on-chain fiat issuer Monerium, uRamp aims to make on-ramping as user-friendly as possible. Based on the Gnosis Chain and therefore compatible with any EVM chain, uRamp allows users to on- or off-ramp any ERC-20 token to and from their bank accounts. In addition to Monerium, uRamp has been designed and developed in collaboration with BootNode.\"","March 17: Mantle Network, a modular Ethereum layer-2 scaling solution, announced the successful completion of its mainnet v2 \"Tectonic\" upgrade, according to the team: \"The upgrade began at 1 a.m. UTC on March 15 and concluded eight hours later at 9 a.m. UTC. The technical milestone extends Mantle Network’s lead in gas savings. Gas cost on Mantle post-v2 Tectonic is expected to remain as one of the least expensive, if not the least expensive among L2s, even with huge slashes post-Dencun’s EIP-4844. It also features enhanced interoperability with other OP Stack chains and a vastly rewarding user experience.\"","March 17: TEN, an encrypted Ethereum layer-2 network, announced a funding round of $9 million, led by R3, according to the team: \"R3, a consortium of 42 of the world’s largest banks exploring blockchain-based RWA tokenization and CBDCs, has been a major supporter of TEN from its inception, with over half of TEN’s senior team hailing from R3, which developed the leading tokenization platform Corda. In addition to R3, the funding round includes support from notable investors such as Republic Crypto, KuCoin Labs, Big Brain Capital, DWF Labs and Magnus Capital.\"","March 17: Aptos Labs is partnering with Google Cloud to bring Aptos Gamestack, a unified platform designed to enhance live service game offerings with Web3 capabilities, to the global gaming community, according to the team: \"Aptos GameStack complements Google Cloud’s leading solutions in data, analytics and AI\/ML with Web3 game tools such as development SDKs, API gateways, and access to world-class support, exclusively available on Aptos. Game builders can use Aptos GameStack today to integrate Aptos-powered Web3 features from seamless sign-on solutions to NFT token standards into any live game.\"","March 17: Space and Time (SxT), a Web3 data warehouse and verifiable compute layer for AI and blockchain, has partnered with Matter Labs to launch SxT’s network on zkSync’s hyperchain, boosting trustless data processing for smart contracts and enterprises, according to the team: \"SxT's data warehouse will combine blockchain data with off-chain datasets, deploying ZK proofs to guarantee data integrity (both off and on-chain).\"","March 17: Cosmos-based layer-1 blockchain Canto unveiled its \"Cyclone Stack,\" aimed at scaling and improving performance. It is also reversing course on its previously announced plan to shift to an Ethereum layer-2 network. Canto, a blockchain designed for decentralized finance (DeFi) applications, first announced in September that it would become an Ethereum layer-2 network using Polygon’s Chain Development Kit (CDK). The team clarified on Friday, however, that it will continue to function as a Cosmos-based layer-1 network. It will run Polygon's type-1 prover, plugging into their aggregation layer (AggLayer) designed to unify blockchain liquidity.","March 17: Chirp Network has launched its testnet on Sui Blockchain as it rolls-out an IoT network that has the power to seamlessly connect a large number of devices, according to the team: \"Chirp's Radio Access Network (RAN) is already deployed in 30 countries, with miners that install the project's 'Blackbird' devices able to earn Chirp tokens as they build a wireless network with unprecedented connectivity and mobile capability.\"","March 17: Constantin Kogan, co-founder of BullPerks and GamesPad, has joined TDVC, a Web3 venture fund by TradeDog Group, as a partner and the CEO of TDX, according to the team: \"With a decade in crypto, Kogan has invested in blockchain since 2012, incubating over 70 projects. In addition, he founded Adwivo, served as a partner at BitBull Capital, and was the managing director at Wave Financial. His expertise will support TDVC, which invests in early-stage companies and has backed unicorns like Biconomy and Chingari. TradeDog Group values Kogan's deep understanding and vision for Web3 advancement.\"","March 14: EVM-equivalent Ethereum Layer-2 scaling solution Metis is launching the Alpha Version of its groundbreaking Decentralized Sequencer, \"marking a major step on the path to rollup decentralization,\" according to the team. \"The Decentralized Sequencer is an evolutionary leap beyond the single-sequencer model currently being used by other layer-2 rollups. The launch makes Metis the first Ethereum rollup to decentralize its sequencer.\" (METIS)","March 14: BNB Chain has unveiled rollup-as-a-service (RaaS), for seamless layer-2 blockchain development on BNB Smart Chain (BSC), according to the team: \"RaaS empowers dApps and enterprises to create custom L2s. Collaboration with providers like AltLayer, NodeReal and Movement Labs enhances versatility. BNB Chain aims to be a 'one-stop shop' for Web3 building, emphasizing collaboration and mass adoption. OpBNB Connect facilitates the interconnection of all L2s built on BSC, for an integrated network to emerge where benefits and innovation are shared across diverse L2s.\" The RaaS rollout was included in BNB Chain's 2024 tech roadmap published in January. (BNB)","March 14: Edge & Node and The Graph Foundation \"announced the expansion of subgraph support on The Graph Network to include over 40 of the most widely used blockchains,\" according to the team. \"Developers building on the EVM and non-EVM chains like Arbitrum, Avalanche, Base, Celo, Fantom, Gnosis, NEAR, Optimism, Polygon Labs, Scroll and zkSync can now leverage The Graph’s decentralized network for lower costs and competitive syncing times. (GRT)","March 14: A new organization called Hadron Founders Club has launched \"to support and empower passionate founders, developers and creators building in Web3,\" with Ajit Tripathi as a core contributor and backing from Polygon Labs, according to the team: \"Hadron FC will launch with two inaugural cohorts in April, hosted at campuses in Dubai and New York City. These cohorts will serve as hubs for collaboration, learning and networking – providing founders with the right environment to build and scale their Web3 startups. Applications for these cohorts will open in the second week of March and remain open for four weeks. Founders of early-stage startups in the Web3 space are encouraged to apply. For more info, visit HadronFC.com, and founders building in the Polygon ecosystem can apply for the first cohort in April here.\"","March 14 (PROTOCOL VILLAGE EXCLUSIVE): Range, a security and risk platform focused on the Cosmos blockchain ecosystem, has raised $2.7M in a funding round led by Galileo. Range's tools, like the CCTP explorer and IBC Rate Limits, enhance the security of cross-chain applications. The platform plans to expand its services to Ethereum-native L2s like Arbitrum and Optimism.","March 14: Polyhedra Network, the Web 3 infrastructure provider behind the zero-knowledge protocol zkBridge, has closed a $20 million fundraising round valuing the company at $1 billion, the firm said in a press release Thursday. The Singapore-based company said the round was led by Polychain Capital, along with participation from Animoca Brands, Emirates Consortium, Mapleblock Capital, Hashkey Capital, UoB Ventures, Symbolic Capital, Longhash Ventures, MH Ventures, Arkstream Capital and Web3Port Foundation.","March 14: Story Protocol, a blockchain-based platform focused on intellectual property (IP) rights, says it will be used by the crypto-meets-AI startup Ritual to let builders create AI models and track their outputs on-chain. Under the so-called partnership, Ritual will begin posting its user-made AI models to Story Protocol to \"prove that outputs like text, image, and voice are generated by specific models\" and provide \"advanced watermarking schemes that will give developers stronger security guarantees around provenance and traceability,\" Story Protocol said in a statement. According to Story Protocol co-founder Jason Zhao, a new software development kit (SDK) is also in the works that will allow Ritual developers to seamlessly register their models as \"IP Assets\" on Story Protocol.","March 14: Polkadot is announcing a new Software Development Kit (SDK) developers can use to create dApps on the network, according to the team: \"The new Verified Polkadot SDK for Unity simplifies the development process for creators and developers seeking to create engaging Web3 games on Polkadot. Polkadot Play not only provides developers with the necessary tools & data but also offers a dedicated tech team to assist in game integration. In collaboration with the Blockchain Game Alliance (BGA), Polkadot Play will be introducing a Game Jam (hackathon) in 2024, inviting developers to build on the Polkadot SDK for Unity.\" (DOT)","Edited by Bradley Keoun."],"entity":[{"type":"$11 million","content":"MONEY"},{"type":"Meson Network","content":"LOCATION"},{"type":"Pilotfish","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$2.7","content":"MONEY"},{"type":"Jason Zhao","content":"PERSON"},{"type":"Sui","content":"ORGANIZATION"},{"type":"Ajit Tripathi","content":"PERSON"},{"type":"Dharma","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"EOS Network","content":"ORGANIZATION"},{"type":"Chingari","content":"ORGANIZATION"},{"type":"Sui Blockchain","content":"LOCATION"},{"type":"Banca Generali","content":"ORGANIZATION"},{"type":"Blockchain Game Alliance (BGA","content":"ORGANIZATION"},{"type":"SDF","content":"ORGANIZATION"},{"type":"Constantin Kogan","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"UoB Ventures","content":"ORGANIZATION"},{"type":"Adwivo","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Arkstream Capital","content":"ORGANIZATION"},{"type":"Arbitrum Orbit","content":"PERSON"},{"type":"NodeReal","content":"ORGANIZATION"},{"type":"Stellar Development Foundation","content":"ORGANIZATION"},{"type":"Virtuzone","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Syscoin","content":"PERSON"},{"type":"VARA","content":"ORGANIZATION"},{"type":"Galileo","content":"ORGANIZATION"},{"type":"Wave Financial","content":"ORGANIZATION"},{"type":"Gamerhash","content":"PERSON"},{"type":"Three Point Capital","content":"ORGANIZATION"},{"type":"Robby Greenfield","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Moonrock Capital","content":"ORGANIZATION"},{"type":"Israeli Defense Force","content":"ORGANIZATION"},{"type":"Gnosis Chain","content":"ORGANIZATION"},{"type":"Edge & Node","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"Base","content":"LOCATION"},{"type":"Umoja","content":"LOCATION"},{"type":"Mantle post-v2 Tectonic","content":"ORGANIZATION"},{"type":"Magnus Capital","content":"ORGANIZATION"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"Mamram Alumni Association","content":"ORGANIZATION"},{"type":"Information Technology Systems","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Orange DAO","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Aptos GameStack","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Particle","content":"ORGANIZATION"},{"type":"MXC Foundation","content":"ORGANIZATION"},{"type":"Avail","content":"ORGANIZATION"},{"type":"Hyperithm","content":"PERSON"},{"type":"Universal Liquidity","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"$4 million","content":"MONEY"},{"type":"Gnosis Venture Studios","content":"ORGANIZATION"},{"type":"Meson Network","content":"ORGANIZATION"},{"type":"Antelope","content":"LOCATION"},{"type":"Shorooq Partners","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Kogan","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Pulsar Trading","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"$2B","content":"MONEY"},{"type":"Dharma","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Polkadot SDK","content":"ORGANIZATION"},{"type":"TradeDog Group","content":"ORGANIZATION"},{"type":"Golem Network GPU","content":"ORGANIZATION"},{"type":"Ethereum Rollups","content":"ORGANIZATION"},{"type":"Forte Securities","content":"ORGANIZATION"},{"type":"\" Story Protocol","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"1 a.m.","content":"TIME"},{"type":"New York City","content":"LOCATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"Universal Accounts","content":"ORGANIZATION"},{"type":"Sui blockchain","content":"PERSON"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Motier Ventures","content":"ORGANIZATION"},{"type":"Transferable RAM","content":"ORGANIZATION"},{"type":"PSI","content":"ORGANIZATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Emirates Consortium","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Cosmos","content":"LOCATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"$9.3 million","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Akamai","content":"ORGANIZATION"},{"type":"Chirp Network","content":"ORGANIZATION"},{"type":"Golem Network","content":"ORGANIZATION"},{"type":"The Graph Foundation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$2.2 million","content":"MONEY"},{"type":"Aptos Gamestack","content":"PERSON"},{"type":"Neon Machine","content":"ORGANIZATION"},{"type":"Corda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Hadron Founders Club","content":"ORGANIZATION"},{"type":"Unity","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"second week of March","content":"DATE"},{"type":"Polyhedra Network","content":"ORGANIZATION"},{"type":"Longhash Ventures","content":"ORGANIZATION"},{"type":"$1.5","content":"MONEY"},{"type":"BitBull Capital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"John Patrick Mullin","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"Stake Delegation Trial Period","content":"ORGANIZATION"},{"type":"Lumia","content":"PERSON"},{"type":"Time (","content":"ORGANIZATION"},{"type":"Mapleblock Capital","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"TDX","content":"ORGANIZATION"},{"type":"Karl Floersch","content":"PERSON"},{"type":"Aptos","content":"LOCATION"},{"type":"March 20","content":"DATE"},{"type":"Psalion","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"Poste Italiane","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Web3Port Foundation","content":"ORGANIZATION"},{"type":"Selini Capital","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Chirp's Radio Access Network","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"Polygon’s Chain Development","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"HashKey","content":"ORGANIZATION"},{"type":"9 a.m.","content":"TIME"},{"type":"Middle East","content":"LOCATION"},{"type":"Republic Crypto","content":"LOCATION"},{"type":"eight hours later","content":"DATE"},{"type":"May 2024","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"March 18","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"March 17","content":"DATE"},{"type":"Greenfield Capital","content":"ORGANIZATION"},{"type":"Celo","content":"PERSON"},{"type":"March 15","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Mantle Network","content":"ORGANIZATION"},{"type":"March 14","content":"DATE"},{"type":"MH Ventures","content":"ORGANIZATION"},{"type":"Movement Labs","content":"ORGANIZATION"},{"type":"Monerium","content":"LOCATION"},{"type":"Space Rental for Workers on Nodes","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Story Protocol","content":"ORGANIZATION"},{"type":"Fuel Network","content":"ORGANIZATION"},{"type":"Particle Network","content":"ORGANIZATION"},{"type":"Quantlytica","content":"LOCATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Kima Ventures","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"$42K","content":"MONEY"},{"type":"HashKey Group","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}