{"summary":"PancakeSwap, the second-largest decentralized exchange protocol, has launched on Ethereum Layer 2 network Arbitrum One.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244153\/pancakeswap-expands-to-ethereum-layer-2-arbitrum-one","publishDate":"2023-08-10T09:15:45","id":1633,"type":null,"title":"PancakeSwap expands to Ethereum Layer 2 Arbitrum One","category":["CRYPTO ECOSYSTEMS"],"content":["PancakeSwap, the second-largest decentralized exchange protocol, has launched on Arbitrum One, an Ethereum Layer 2 scaling network, as it continues its multichain expansion.","Arbitrum One will help users with lower gas fees and faster transactions, PancakeSwap said Thursday. As an Ethereum Layer 2, Arbitrum One processes transactions on its network before summarizing them on the main Ethereum blockchain, which helps speed up transactions and reduce fees.&nbsp;","PancakeSwap will first make the swap and liquidity provisioning features available on Arbitrum One. Swap in decentralized finance or DeFi refers to exchanging one token for another, while liquidity provisioning involves adding funds to a pool to facilitate trading and earn rewards.","After the swap and liquidity provisioning features, PancakeSwap will bring its farm feature to Arbitrum One in the coming weeks, which allows users to stake their liquidity provider (LP) tokens and earn PancakeSwap's native CAKE token while keeping a position in their LP tokens. PancakeSwap will also deploy its initial farm offering or IFO platform to Arbitrum One in the coming weeks, which gives early access to new tokens.","PancakeSwap on Arbitrum One will be more capital efficient, PancakeSwap's \"Chef Cocoa,\" told The Block. \"The capital multiplier is due to our v3 upgrade,\" they said. \"v3 enables liquidity providers to focus their assets on specific price ranges, allowing their capital to be more efficient. Specifically, the capital efficiency gains can be up to 4000x compared to v2 for liquidity providers.\"","Arbitrum One is the sixth blockchain PancakeSwap has expanded to as it continues to focus on Ethereum scaling networks. Initially built on BNB Chain, PancakeSwap now also supports Ethereum, Aptos, Polygon zkEVM and zkSync Era.","Launched in 2020, PancakeSwap has grown to become the second largest decentralized exchange protocol, just after Uniswap, according to The Block's Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" title=\"DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"Uniswap","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"IFO","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","DEXS"],"authors":["Yogita Khatri","The Block"]}