{"summary":"Fidelity&#x27;s digital asset arm is on a hiring spree to build out its platform, according to a new blog post from Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/83690\/fidelity-engineering-hiring-initiative-out-crypto-trade-custody","publishDate":"2020-11-05T14:00:14","id":1634,"type":null,"title":"Fidelity launches engineering hiring initiative to build out crypto trade and custody services","category":["BITCOIN"],"content":["Fidelity Digital Assets — the cryptocurrency unit of investment giant Fidelity — is looking to bring on as many as 20 engineers as part of a hiring <a href=\"https:\/\/www.fidelitydigitalassets.com\/articles\/engineering-hiring-initiative\" data-v-f87c67ca=\"\">initiative<\/a> to ramp up development of its crypto trading and custody services.","The company, which first entered the market in late 2018, already provides hedge funds and other institutional investors with bitcoin custody and trade execution. The build-out of the team would help the firm serve the increase in institutional demand for such services, the firm said in a new blog post.&nbsp;","\"Over the next several months, we plan to hire more than twenty engineers across the full spectrum of our technology stack to capitalize on increased market demand and to expand our overall capabilities,\" the company said in the blog. \"We're looking to bring on passionate and innovative developers who enjoy collaborating in a rapidly changing environment.\"","The new talent could help the firm expand beyond bitcoin into other digital assets, like Ethereum's ETH. The move may also help the firm offer sub-custody to traditional banking firms.","As <a href=\"https:\/\/www.theblockcrypto.com\/daily\/82334\/jpmorgan-digital-asset-custody-subcustody\" data-v-f87c67ca=\"\">reported<\/a> by The Block, JPMorgan has been engaging with cryptocurrency firms about leveraging their tech to offer crypto custody to their clients. Earlier this year, the Office of the Comptroller of the Currency <a href=\"https:\/\/www.occ.gov\/news-issuances\/news-releases\/2020\/nr-occ-2020-98.html\" data-v-f87c67ca=\"\">gave<\/a> federally-registered banks the green light to custody digital &nbsp;assets—a move many industry insiders say could make banks more comfortable with offering access to cryptocurrencies like bitcoin.&nbsp;","\"In particular, the clarity from the OCC earlier this year has accelerated interest and development for many banks and traditional institutions, and the Fidelity Digital Assets infrastructure helps them gain faster access to the marketplace, as well as develop new offerings based on our secure stack,\" a spokesman said in an emailed statement.&nbsp;","\"The demand for a brokerage partner has steadily increased with this year’s price action and a new wave of traditional financial institutions taking strong interest in the digital asset class,\" the spokesman added.&nbsp;<u data-v-f87c67ca=\"\"><\/u>","Earlier this year, Fidelity released a report that showed more than 80% of investors found \"something appealing about the asset class.\"","\"22% of U.S. respondents invested in digital assets have exposure via futures, which is a substantial increase relative to 9% of U.S. investors surveyed in 2019,\" the survey found.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Fidelity Digital","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}