{"summary":"Nomics, a CoinMarketCap alternative, now publishes indices that track how transparent a token’s trading volume is \nThe platform found that only 17% of bitcoin (BTC) trading volume is transparent or trustworthy, although bitcoin has the largest transparent trading volume out of the 3,800+ coins the platform is tracking","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37711\/a-coinmarketcap-alternative-launches-trading-indices-that-find-only-17-btc-trading-volumes-trustworthy","publishDate":"2019-08-27T09:09:21","id":1634,"type":null,"title":"A CoinMarketCap alternative launches trading indices that find only 17% BTC trading volumes trustworthy","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">A cryptocurrency trading data provider is now showing how much of a cryptocurrency's trading volume can be trusted, and it finds that around 17% of bitcoin (BTC) trading volumes are trustworthy, while for ether (ETH), that number is 8%.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Backed by Coinbase Ventures, <a href=\"https:\/\/nomics.com\/\" data-v-f87c67ca=\"\">Nomics<\/a> measures the trustworthiness of a cryptocurrency's trading volume, or the so-called transparent volume, by summing the token’s trading volumes across several exchanges. This transparent volume is then divided by the total reported trading volume to derive the transparent volume percentage for the token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company ranks 167 cryptocurrency exchanges by how transparent they are with their trading data. Exchanges like Coinbase Pro, Kraken, and Binance can get an A or A+ rating if they share their complete trading history and raw trade data with Nomics. On the contrary, those who get D rating only make their ticker data available, including 24-hour volumes and trading prices, which is what CoinMarketCap mainly tracks, according to Nomics CEO Clay Collins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although BTC and ETH have relatively low percentages of transparent volumes, Collins explained that this is likely because these cryptocurrencies are widely traded on both high and low rating exchanges. The two coins, in fact, have the two highest raw transparent volumes among the 3,873 tokens Nomics lists on its website. Meanwhile, less popular coins that only trade on a few exchanges, such as Binance's BNB, can outperform BTC and ETH in the percentage index.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“For assets like BNB, it is traded primarily on Binance and Binance related exchanges. [This] causes a high amount of transparent volumes because it is primarily traded on exchanges that are very transparent,” said Collins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Collins also notes that tokens with 1% or above transparent volumes are already with the top quartile of all the cryptocurrencies that Nomics is tracking. This “speaks to how sad the space is,” said Collins, possibly referring to the opaque trading volumes of some exchanges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Collins and his team were partly motivated to track these indices by Bitwise’s <\/span><a href=\"https:\/\/www.forbes.com\/sites\/cbovaird\/2019\/03\/22\/95-of-reported-bitcoin-trading-volume-is-fake-says-bitwise\/#310393be6717\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">highly-cited report in March<\/span><\/a><span data-v-f87c67ca=\"\">, which states that 95% of the bitcoin trading volumes are fake. So far, Nomics said it has received some positive feedback from exchanges and investors for the ranking service it provides.<\/span>","<span data-v-f87c67ca=\"\">\"We are the very first aggregator to rate exchanges according to their data transparency practices,” said Collins. “We ended up getting a lot of new customers as a result of this and having some exchanges come to us and say we would like to be more transparent as well, what do you need from us in order for us to be qualified for an A rating.” <\/span>"],"hashtag":["BNB"]}