{"summary":"Flowdesk has raised a $50 million Series B round from Cathay Innovation, Ripple, Bpifrance and others.\nThe round brings the crypto market maker’s valuation to over $250 million, two sources told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273305\/flowdesk-series-b-funding-valuation","publishDate":"2024-01-18T09:00:03","id":1635,"type":null,"title":"Flowdesk reaches $250 million valuation with Series B round","category":["Venture Capital"],"content":["French crypto market maker Flowdesk has raised $50 million in a Series B funding round amid its growing business and revenue.","Cathay Innovation led the round, with <a href=\"https:\/\/www.theblock.co\/post\/150775\/ledger-cathay-innovation-crypto-vc-fund-110-million\" data-v-f87c67ca=\"\">Cathay Ledger Fund<\/a>, Eurazeo, ISAI, Speedinvest, Ripple, and Bpifrance (a French state-owned investment bank) participating, Flowdesk said Thursday. This was a pure equity funding round that commenced in June and concluded in November, Guilhem Chaumont, co-founder and CEO of Flowdesk, told The Block in an interview. Chaumont noted that the round went \"very smoothly\" despite challenging market conditions and a <a href=\"https:\/\/www.theblock.co\/post\/268972\/crypto-vc-funding-2023-recap\" data-v-f87c67ca=\"\">slowdown<\/a> in crypto venture capital funding last year.","Flowdesk's Series B round comes two and a half years after it raised $30 million in a Series A round in June 2022. The new round has elevated Flowdesk's valuation to over $250 million from $100 million at the time of its Series A round, two sources with direct knowledge of the matter told The Block. The increased valuation is notable, especially in light of recent <a href=\"https:\/\/www.theblock.co\/post\/271200\/crypto-custodian-finoa-funding-valuation\" data-v-f87c67ca=\"\">flat<\/a> and down rounds in the crypto industry.","As part of the Series B round, Jacky Abitbol, Cathay Innovation's managing partner, has joined Flowdesk's board of directors, Chaumont said.","The crypto market maker has seen significant growth in trading volumes and revenue in recent months as markets have rebounded, Chaumont said. \"As of Jan. 2024, we have witnessed a 3x year-on-year revenue increase and a 10x volume increase,\" he said. He declined to comment on specific revenue numbers but said the company trades anywhere from $150 to $400 million on spot markets per day and supports about 130 crypto exchanges, both centralized and decentralized.","Crypto markets have rebounded lately, initially driven by optimism regarding the potential approval of spot bitcoin exchange-traded funds in the United States, which eventually got a regulatory nod and launched last week. These funds have already <a href=\"https:\/\/www.theblock.co\/post\/273147\/cumulative-spot-bitcoin-etf-volume-crosses-10-billion-on-fourth-day-of-trading\" data-v-f87c67ca=\"\">crossed $11 billion<\/a> in trading volume within a few trading days. \"We will continue to see strong inflow in crypto through these ETFs,\" Chaumont said. \"And this would be very positive for the markets.\"","Flowdesk is one of the liquidity providers for Grayscale Bitcoin Trust, which uplisted as a spot bitcoin ETF last week. Chaumont said Flowdesk is also in talks with other ETF issuers to potentially be their liquidity provider.","With fresh capital in hand, Flowdesk plans to further expand its business globally, with a focus on growth in Singapore and the U.S., and with a new office in London, Chaumont said.","The firm is also planning to obtain regulatory licenses in those markets and is preparing to be compliant with the European Union's Markets in Crypto-Assets regulation from \"day one,\" Chaumont said. Flowdesk is currently registered in France.","As part of its expansion plans, Flowdesk also intends to hire around 50 more people to add to its current headcount of about 100 people, Chaumont said. The firm recently hired Charles Tighe as chief financial officer and onboarded several executives from the now-shuttered Genesis Global Trading, including Reed Werbitt, Hanson Birringer, Greg Guttas, and Warren Wynn.","Founded in 2020, Flowdesk also offers over-the-counter trading and treasury management services and plans to expand those offerings. The Series B round brings Flowdesk's total funding to date to over $80 million, including a $450,000 pre-seed funding round in 2021, Chaumont said."],"hashtag":["SERIES B"]}