{"summary":"The OC dreamboat has some reasonable criticisms of crypto. But he’s guilty of doing what he scolds: oversimplifying the story to make money for himself.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/07\/18\/ben-mckenzie-the-hollywood-hypocrite-crypto-critic\/","publishDate":"2023-07-18T18:22:41","id":16356,"type":null,"title":"Ben McKenzie, the Hollywood Hypocrite Crypto Critic","category":["Consensus Magazine"],"content":["Ben McKenzie, the former teen heartthrob who starred in “The O.C.\" and \"Gotham,” jokingly refers to his somewhat recent career pivot as going from a “mid-level celebrity” to part-time crypto critic. A few years ago, at a time when many of McKenzie’s actor peers were shilling things like EthereumMAX and FTX, he started building a brand as a blockchain scold by going after what he called the “Hollywoodization of crypto.”","The actor’s latest performance reached its apogee today, with the publication of a long-awaited anti-crypto book called “Easy Money,” co-written by freelance journalist Jacob Silverman. The two started working together during the height of the pandemic, when acting work was hard to come by. In their first co-written article, published by Slate in 2021, the duo chastise actors Kim Kardashian, Floyd Mayweather and Tom Brady, among others who were all paid crypto endorsers. (Kardashian and Mayweather were later fined by the U.S. Securities and Exchange Commission.)","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","It’s hard to call McKenzie’s commentary grandstanding, considering so much of what he says about the industry is at least rooted in partial truth. But he does have a habit of making massive, totalizing claims like crypto “represents the largest Ponzi scheme in history” and calling the entire industry a fraud. A graduate 20-odd years ago from the University of Virginia with a degree in economics, McKenzie also wanders out into the realm of economic history, and is comfortable enough saying “private money” itself has failed.","You might think such a scold would steer well clear of the thing he’s criticizing. But in McKenzie’s case, he was all-in for a time.","In a recent Guardian profile, the actor disclosed he lost as much as $250,000 trying to short the market. Allegedly he got the timing wrong. The article doesn’t share many details, so we can only speculate but this wager could undercut much of what McKenzie has been saying over the years. In other words, the self-declared paid liar is also a hypocrite.","Betting crypto will collapse is one thing, but betting the industry will collapse without disclosing you stand to profit from it is a whole other game. In fact, it’s essentially the same type of arrangement McKenzie often criticized others for. Kim Kardashian settled with the SEC for failing to say she was paid to promote EthereumMAX, an altcoin built to trade on Ethereum's better standing. Although it’s unknown when his bet was open, McKenzie was a frequent guest on CNBC, Bloomberg and other daytime finance news programs yapping away about the industry’s evils.","See also: NFTs, Celebrities and Perverse Deal-Making | Opinion","In the grand scheme, this basically changes nothing. Crypto’s supporters get to point and mock and speculate whether McKenzie broke the law, and the rest of the world will largely continue to ignore blockchain or look at it disapprovingly. I’m still going to read “Easy Money,” or at least the parts featuring pre-collapse Sam Bankman-Fried and Celsius’ Alex Mashinsky. And McKenzie will continue to walk around as a moral crusader, whose best lines are probably built on other people’s research.","McKenzie often says things like crypto’s allure is rooted in the idea that “we all agree…our current financial system is deeply flawed.” People project any number of desires and hopes on crypto making a better future, by tearing down the establishment or building “sovereign individuals” up. For McKenzie, the whole thing is a charade. But, again, McKenzie is guilty of doing what he criticizes so heatedly: oversimplifying the story because he has something for sale.","It is truly problematic when people treat blockchain as a solution for everything. It is an issue that people hire celebrities to hype scams. It is morally reprehensible when some people convince others to put more than they can afford to lose even in stable projects like bitcoin. But to ignore all of crypto’s actual advancements and benefits is also a mistake. There has to be a way of pointing out that blockchain has become a hotbed of scams, without calling the whole industry a fraud.","See also: Crypto Gets Critical, With Bennett Tomlin (Podcast)","It’s a plain matter of fact that crypto has benefited people in dire straits. It may not be the perfect inflation hedge, but bitcoin has helped people protect their savings in war zones and escape repressive regimes. It’s kept controversial, but useful websites, alive for years. It’s helped fund protests and dissidents and parties. Stablecoins are increasingly found to be better for remittances and to get charitable funding to high-risk areas. People have found communities in Web3, and artists a new medium to express themselves with NFTs. Blockchain has added to the body of knowledge in cryptography, and may have a role to play addressing climate change and making governments more accountable.","McKenzie may have the resources to bet against crypto (his “expensive lesson”), but others do not. Crypto is a powerful tool in niche applications. Is it an issue when the industry is captured by delusions of grandeur about “mass adoption?” Yes. But Mr. Hollywood isn’t trying to address that. He’s not drawing notice to crypto’s flaws or workable solutions, he’s rebooting a brand using the attention of a continuously problematic industry."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Mayweather","content":"PERSON"},{"type":"the University of Virginia","content":"ORGANIZATION"},{"type":"Hollywood","content":"PERSON"},{"type":"Gotham","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Floyd Mayweather","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Bennett Tomlin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Jacob Silverman","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Ben McKenzie","content":"PERSON"},{"type":"McKenzie","content":"PERSON"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"Kardashian","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"McKenzie","content":"ORGANIZATION"}],"hashtag":["Opinion","The Node","Newsletters","Hollywood","Celebrities","Scams"],"authors":["Daniel Kuhn"]}