{"summary":"European officials will vote on rules restricting anonymous crypto transactions later this week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/03\/29\/europes-landmark-crypto-regulation-is-advancing-but-new-privacy-rules-may-be-more-important\/","publishDate":"2022-03-29T17:51:33","id":16369,"type":null,"title":"Europe’s Landmark Crypto Regulation Is Advancing, but New Privacy Rules May Be More Important","category":["Policy"],"content":["Holy heck, was last week busy or what? Legislation in India and Europe took center stage, but there's a lot happening pretty widely. I’m going to take a second to shamelessly plug the CoinDesk regulatory team here because there's too much to run through in one newsletter – if you’re not following these folks, you’re missing out: Sandali Handagama, Jesse Hamilton, Cheyenne Ligon, Amitoj Singh, Lavender Au and Jack Schickler.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","The European Union is advancing its Markets in Crypto Assets (MiCA) legislation but lawmakers and proposed rules around anonymous transactions may be a more pressing concern for the industry.","MiCA seems to be moving forward. If implemented, it promises to dramatically streamline the launch process for crypto companies trying to set up shop in more than one of the European Union’s 27 member nations. However, separate from MiCA, another set of proposed rules that will be voted on this week promises to make using crypto a bit more difficult for companies and users.","Bitcoiners can breathe a sigh of relief. A controversial proposal to limit proof-of-work mining in the European Union will not be part of the EU's landmark Markets in Crypto Assets (MiCA) regulatory framework.","MiCA has advanced from a negotiation stage where lawmakers proposed and debated different provisions to a point where the different branches of the European government will discuss the bill. We are now going to see what's called a trilogue, which my colleague Sandali Handagama explains is when the European Parliament, the European Commission and the European Council all debate and agree on the legislation as it currently stands.","Meanwhile, a couple of thousand miles away in India, a controversial and equally disliked tax proposal has become law after the nation’s Parliament adopted it late last week. This tax provision will implement a 30% capital gains tax on all crypto transactions as well as a 1% tax deducted at source. Advocates for the industry feared this will lead to “brain drain,” or an exodus of developers and entrepreneurs in the cryptosphere from India to other, friendlier jurisdictions.","So basically, it was a pretty big week last week.","What we're seeing now is just a continuation of this idea regulators accept that crypto is here to stay and want to do something about it. In India’s case, much like last year’s U.S. infrastructure bill debate, that “something” is “tax the industry,” even if the specific circumstances are a bit different.","However, crypto industry participants in India have said they’re concerned by the fact the country hasn’t put forward any sort of guidance or regulations for startups and other businesses to operate under, instead leaving the regulatory framework at just the tax level issue.","Europe’s MiCA is a vastly different approach in that regard. The key benefit for the industry should MiCA be implemented is the common license for crypto businesses, allowing a company to operate across borders.","That being said, while MiCA is advancing (despite last-minute efforts to include a limit on PoW mining), the crypto industry should pay attention to some other rules in the works. From my colleague Jack Schickler:","These proposed rules would require exchanges to identify the recipients of crypto transfers. At present, recipients of bank transfers worth more than 1,000 euros have to be identified, but the proposed legislation would remove that minimum limit for crypto transactions.","The new proposed rules may also make it difficult for crypto exchanges to allow transactions to tax havens, which include the Virgin Islands (both U.S. and U.K.), Turkey, Hong Kong, Iran and others.","And in an episode that many readers of this newsletter might remember, the EU also wants to enforce anti-money laundering (AML) checks on private\/self-hosted (or unhosted or whatever you’d like to call them) wallets.","Wallet owners would need to be identified, according to the proposed rules.","The industry is already pushing back against these rules, claiming they would make it difficult for people to use self-hosted wallets and enforce strict surveillance against crypto exchanges.","Statements such as those made by European Central Bank President Christine Lagarde, Tracfin Director Guillaume Valette-Valla or the Bank of England underscore that many in the EU may not be comfortable with the crypto industry yet.","U.S. President Joe Biden unveiled his fiscal year 2023 budget request Monday, outlining an ambitious plan to tackle ongoing supply chain issues, tax billionaires and boost police budgets. And he may raise some $11 billion over the next 10 years by modernizing digital asset taxation rules.","The modernization would include amending mark-to-market rules for digital assets, modifying rules outlining the loans of securities and amending securities loan nonrecognition rules.","“The proposal would amend the securities loan nonrecognition rules to provide that they apply to loans of actively traded digital assets recorded on cryptographically secured distributed ledgers, provided that the loan has terms similar to those currently required for loans of securities,” the Treasury Department’s Green Book (explanation of the budget asks) said.","Another provision addresses Foreign Account Tax Compliance Act (FATCA) requirements and other foreign account holders, similar to last year’s budget proposal.","“In addition, tax evasion using digital assets is a rapidly growing problem. Since the industry is entirely digital, taxpayers can transact with offshore digital asset exchanges and wallet providers without leaving the United States,” the Green Book said.","The budget proposal also includes a provision increasing the Department of Justice’s budget by $52 million to tackle investigations, including its ransomware work and combating illicit uses of cryptocurrency.","While it doesn’t explicitly mention crypto, the proposal would also boost the Securities and Exchange Commission’s enforcement budget, which I imagine will go, at least in part, to furthering crypto investigations and enforcement actions.","Other budget increases include $210 million for the Financial Crimes Enforcement Network (FinCEN), $1.1 billion overall for the Internal Revenue Service and boosts for other agencies.","The Commodity Futures Trading Commission (CFTC) presented its own budget request, saying it “expects to register and oversee a growing number of derivatives exchanges offering novel and complex products,” including cryptocurrency-related products.","The CFTC also expects some decentralized exchanges or peer-to-peer networks to try and trade cryptocurrency derivatives without registering with the agency in the U.S.","It remains to be seen whether any of this comes to fruition: Congress would have to authorize the budget through legislation rather than kick the can down the road with temporary continuing resolutions, as we’ve seen over the past year.","CFTC Chairman Rostin Behnam will testify before the House Agriculture Committee on Thursday. It’s not yet clear whether crypto will come up but I imagine it will, given the congressional agriculture committees have oversight jurisdiction over the Commodity Futures Trading Commission.","Speaking of which, the CFTC is at full strength. The U.S. Senate confirmed Christy Goldsmith Romero, Kristin Johnson, Summer Kristine Mersinger and Caroline Pham as CFTC Commissioners. Two of them – Goldsmith Romero and Johnson – highlighted their work with cryptocurrencies in their opening remarks at a confirmation hearing earlier this month.","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!"],"entity":[{"type":"the Virgin Islands","content":"LOCATION"},{"type":"Goldsmith Romero","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"CFTC Commissioners","content":"ORGANIZATION"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Green Book","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Treasury Department’s Green Book","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"Johnson","content":"PERSON"},{"type":"Caroline Pham","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"$52 million","content":"MONEY"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Jack Schickler","content":"PERSON"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Iran","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Guillaume Valette","content":"PERSON"},{"type":"Cheyenne Ligon","content":"PERSON"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"European Council","content":"ORGANIZATION"},{"type":"MiCA","content":"PERSON"},{"type":"Amitoj Singh","content":"PERSON"},{"type":"Joe Biden","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Sandali Handagama","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Kristin Johnson","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"$210 million","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"Kristine Mersinger","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"U.S. Senate","content":"ORGANIZATION"}],"hashtag":["Regulations","Newsletters","State of Crypto","European Parliament","European Commission","MiCA","India","EU","Joe Biden"],"authors":["Nikhilesh De"]}