{"summary":"The macro outlook and why it matters for bitcoin and other crypto assets. An analysis by Noelle Acheson, CoinDesk’s former head of research.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/05\/03\/cryptos-macro-drivers-its-not-just-about-bitcoin\/","publishDate":"2023-05-03T18:23:07","id":16364,"type":null,"title":"Crypto’s Macro Drivers – It’s Not Just About Bitcoin","category":["Consensus Magazine"],"content":["This week, to no one’s great surprise, we saw another 25 basis point (bp) hike in the federal funds rate. The raise itself is not that significant – background noise, if you will. We’re all used to this by now. What is noteworthy about this one is that there is a strong likelihood it will be the last. This is a very big deal for the whole crypto market, not just for bitcoin (BTC).","Below, I dive into why I think this week’s will be the last U.S. interest rate hike, why this is good news for bitcoin and why the tailwind extends to other crypto assets as well.","Noelle Acheson is the former head of research at CoinDesk and Genesis Trading. This article is excerpted from her Crypto Is Macro Now newsletter, which focuses on the overlap between the shifting crypto and macro landscapes. These opinions are hers, and nothing she writes should be taken as investment advice.","Last week, preliminary U.S. GDP came in at 1.1% quarter-on-quarter growth, much lower than the expected 2.0%, and lower still than the fourth quarter’s downward revision of 2.6%. The bulk of the disappointment was due to weak inventory build, with defense and consumer spending accounting for most of what little growth there was. Adjusted for inflation, consumer spending jumped 3.7% in Q1, much higher than the previous quarter’s 1.0% increase. Bear in mind that this increase is after one of the steepest rate hike campaigns ever.","This is, unfortunately, reflected in inflation data. The Federal Reserve’s preferred inflation index of personal consumption expenditure (PCE) ex-food and energy (known as core PCE) for Q1 increased by 4.9%, more than the consensus estimate of 4.7% and than Q4’s 4.4%. The more granular core PCE reading for March, released on Friday, did not show a startling increase, but nor did it decline, coming in at a steady 0.3%, or 4.6% on a year-on-year basis. Again, frustrating resilience after almost five percentage points of interest rate hikes in 12 months.","So, because higher interest rates do not seem to be working, does that mean the Fed will need to raise them even more? Not necessarily. As the Fed has often reminded us, the data moves with long and variable lags, with no guidance as to what “long” means. There are signs that the acceleration in core prices seen in Q1 is trailing off. In addition to the March figure, we have the Cleveland Fed’s Inflation Nowcast, which models April core PCE steady at just over 4.6%. This could encourage the Fed to choose to wait and see if more impact starts to show up, which it is likely to do.","For now, this likelihood is not obvious. On Friday, we saw the employment cost index for Q1 come in at a slight increase of 1.2% quarter on quarter. This is the Fed’s preferred employment cost gauge because it takes benefits as well as wages into account and is therefore not distorted by employment shifts among occupations or industries. The uptick was only 0.1 percentage points, but that it was there at all is concerning, and the year-on-year increase was 4.8%, well above the target inflation rate of 2%.","But there are signs the employment market is cooling. Thursday’s U.S. continuing jobless claims held on to the increase seen at the beginning of April, with the most recent four readings up more than 6% from the preceding four. The wave of layoffs depressing our headlines suggests this figure is likely to keep heading up.","Furthermore, one thing that jumps out when looking at charts of the unemployment rate over time is that when it starts to move up, it does so suddenly and quickly. The tightening credit outlook will further constrain economic growth as companies struggle to refinance, leading to even more layoffs, and the impact on demand will exacerbate the painful momentum.","Aware of these trends, I believe it is likely that the Fed will pause rate hikes at the June Federal Open Market Committee (FOMC) meeting and then hold steady for some time as higher rates start to do their damage. We shouldn’t forget that reported economic data is backward-looking. The U.S. Conference Board’s Leading Economic Index dropped by 1.2% in March, more than double February’s decline. This downward trend should continue as the consequences of tighter bank credit roll through the economy, punctuated by damage done to balance sheets from falling collateral values. Dark clouds are gathering.","If the Fed does pause in June, this would be good for bitcoin, as it implies an easing of financial conditions.","While the rates themselves may not change, expectations of cuts on the rapidly approaching horizon should be enough to move the liquidity needle – with the exception of the 1960s, an extended pause after a series of hikes has always been followed by cuts. What’s more, financial conditions are not just defined by the rate of fed funds: they are also influenced by bank profits and policies, the oil price, the level of the dollar, fiscal policy and the credit outlook around the world, among other factors.","Indeed, while the Chicago Fed national financial conditions index – which looks at U.S. capital markets as well as shadow banking – shows a tighter environment than a couple of years ago, it is heading down, which means more market liquidity.","This matters for bitcoin because it is one of the most sensitive assets to changes in overall liquidity. You no doubt often hear that “risk assets” benefit from looser monetary conditions. Well, bitcoin is the ultimate “risk asset” in that respect:","We can expect BTC to continue to act as a liquidity barometer, as it did in January and again in March, once the Fed’s interest rate policy settles down into wait-and-see mode. And liquidity is likely to head up once peak rates are in and as the looming recession becomes increasingly obvious.","While bitcoin is the most “macro” of all crypto assets, the macro environment also influences other crypto assets, in different ways.","Bitcoin is still the anchor asset for the crypto market, with an increasing dominance (percentage of total market cap) and a high correlation with other tokens. In other words, what happens to bitcoin affects sentiment throughout the market cap table.","It does so through increased attention to the entire ecosystem, which encourages new businesses as well as their funding. A rising BTC price justifies investment in market infrastructure and crypto asset services, which in turn supports access to and liquidity of other assets. Where BTC goes, the market tends to follow.","What’s more, once funds are comfortable with an allocation to BTC, many will look for even higher return opportunities, which means heading out on the risk curve. This tends to be encouraged by easing financial conditions, with potential gains more than compensating the cost of leverage.","There’s also the special case of ether (ETH), which is more directly impacted by macro yields. Currently, staking on the Ethereum network earns approximately 5% in rewards, not taking into account any price appreciation. This is less attractive to macro investors when U.S. government bonds offer similar yields with no risk but, as these come down, the equation changes. What’s more, ETH’s relatively stable yield comes with the potential of upside. Now that staking is flexible after the recent Shapella upgrade, macro investors are more likely to consider ETH in relation to other steady-income opportunities, especially if it is seen as a window into greater ecosystem participation.","While the macro economic outlook and probable path of monetary policy is at one of its most uncertain moments in recent history, a step back to look at the entire investment landscape can reveal pockets of opportunity as well as highlight narratives that did not exist the last time the global economy found itself in a similar position. For the first time, we have assets that do not depend on considerations from the traditional economy for their operation, and that embody a range of emerging use cases that in turn lend resilience to investment theses.","All economic cycles have certain patterns that tend to repeat – that’s one of the reasons they’re called “cycles.” Crypto markets have cycles, too, only these in the past have been driven mainly by crypto-specific factors. Not any more – now the crypto market has multiple drivers, making the narratives more complex while opening up the market to new investing cohorts.","This should not only continue to close the gap between the crypto and macro landscapes; it should also shine even more attention on crypto assets’ unique characteristics.","Edited by Ben Schiller."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"4.9%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"2%","content":"PERCENT"},{"type":"4.7%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"June Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"1.2%","content":"PERCENT"},{"type":"1960s","content":"DATE"},{"type":"1.0%","content":"PERCENT"},{"type":"U.S. Conference Board’s Leading Economic Index","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"Cleveland Fed’s Inflation Nowcast","content":"ORGANIZATION"},{"type":"4.8%","content":"PERCENT"},{"type":"3.7%","content":"PERCENT"},{"type":"4.4%","content":"PERCENT"},{"type":"Chicago Fed","content":"ORGANIZATION"},{"type":"2.6%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"4.6%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"1.1%","content":"PERCENT"},{"type":"2.0%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Genesis Trading","content":"ORGANIZATION"}],"hashtag":["Opinion","Macro","Bitcoin","Federal Reserve","Economy","US"],"authors":["Noelle Acheson"]}