{"summary":"The Chamber of Digital Commerce’s annual event is being held in Washington this week. \nThis event and others have served to highlight the federal government’s growing interest in crypto. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148552\/everyones-a-crypto-native-now-how-dc-learned-to-stop-worrying-and-love-the-blockchain","publishDate":"2022-05-24T17:26:09","id":1636,"type":null,"title":"Everyone’s a crypto-native now: How DC learned to stop worrying and love the blockchain","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Faced with heightened regulatory interest, crypto has become remarkably fashionable within Washington, DC.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Recent weeks have seen the return of conference season with a vengeance. Within those focusing on government relations, the increasing priority of crypto has been palpable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Chamber of Digital Commerce’s DC Blockchain Summit on May 24, for example, featured three members of the House and four Senators as speakers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For comparison, only one member of Congress, Rep. Tom Emmer (R-MN) spoke at the last in-person summit, in 2020. Emmer reappeared at the more recent summit, as did Senator Cynthia Lummis (R-WY), the first Senator to hold Bitcoin publicly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But so, too, did more recent figures speak on crypto at the summit, including Senators Cory Booker (D-NJ), Steve Daines (R-MT) and Kirsten Gillibrand (D-NY) — the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/139245\/senators-lummis-and-gillibrand-are-collaborating-on-a-regulatory-framework-for-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">latter of whom only recently signed on to work with Lummis on a crypto-focused bil<\/span><\/a><span data-v-f87c67ca=\"\">l.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I hear a lot of patronizing things about this crypto space — and I’m with people on the real concerns — but I’m tired of people not seeing the potential and value and genius,” said Booker.<\/span>","<span data-v-f87c67ca=\"\">That political popularity brings with it a market for crypto expertise, which has many who work with the government pivoting to crypto or advertising existing crypto businesses with sudden vigor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This trend is in part thanks to the recent executive order from President Biden, which mandates a wide range of studies from federal agencies. And for the time being, it seems irrespective of a bear market and the collapse of TerraUST earlier in May. Indeed, those events have also sparked <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/146691\/terra-disaster-fuels-work-of-congress-on-stablecoin-legislation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">talk of major governmental action<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Deloitte, for example, has been a long-time sponsor of the DC Blockchain Summit, but this year became a top sponsor along with crypto-native firms BinanceUS and Dapper Labs. The big-four accounting firm hosted a branded lounge and a platoon of staff wearing pins that said “Trust is non-fungible.”<\/span>","<span data-v-f87c67ca=\"\">\"We have been in this space a long time,\" said Richard Rosenthal, a partner at the firm’s regulatory practice, told The Block. Only in the past year, Rosenthal said: \"We've stood up a strategic, roped off, literally a dedicated unit focused exclusively on coordinating across the firm.”<\/span>","<span data-v-f87c67ca=\"\">Rob Massey, a partner at Deloitte’s tax service, put his date of entry into crypto at 10 years ago, as the firm took on a miner, a token issuer and an exchange as clients.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"For the first couple of years, I think we were very careful about highlighting externally that we were engaged,\" Massey said. \"And now with the executive branch talking respectfully about blockchain and crypto — I think as more regulators engage thoughtfully and in a balanced tone, it's easier for us.\"<\/span>","<span data-v-f87c67ca=\"\">The Block has already noted how this trend has impacted the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/145913\/washingtons-think-tanks-and-wonks-turn-to-stablecoins-cbdcs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">think tanks that set the tone<\/span><\/a><span data-v-f87c67ca=\"\"> for policymaking conversations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chainalysis’ LINKS conference last week further highlighted this trend of government interest growing more overt — with some of the more traditionally discrete elements of the government publicly appearing. Those included investigation case studies from law enforcement agencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Moreover, dozens of attendees wandered LINKS with tags that displayed roles not only at traditional government contractors like Booz Allen Hamilton and Lockheed Martin, but agencies including the IRS, DHS, and even the FBI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many others featured “USG,” none of whom would specify which branch of the government when asked by The Block — though one bearded man wore a badge from the US Postal Service Inspection Service on his belt. <\/span>"],"hashtag":[]}