{"summary":"Finance is on the point of mass-market automation.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2021\/12\/20\/inside-the-defi-vending-machine\/","publishDate":"2021-12-20T23:52:00","id":16377,"type":null,"title":"Inside the DeFi Vending Machine","category":["Consensus Magazine"],"content":["Imagine the public astonishment when, in the early 1920s, vending machines started dispensing soda into cups. Instead of going to the counter of a soda shop and ordering their favorite drink, thirsty customers could now use coins, push some buttons and, voilá, out came the beverage.","As Nick Szabo quipped almost 25 years ago, these revolutionary automated machines can be seen as the ancestors of the applications and smart contracts now running on the Ethereum blockchain and enabling the rise of decentralized finance, or DeFi. In this sense, DeFi is like a full-line vending space where several automated machines, now digital, can be used to dispense not soda but financial services and products.","The automated machine interface, the display used to make choices and payments, appears in DeFi Land as applications that can be used from your phone or computer. Behind the scenes, smart contracts take the place of motors and mechanical arms, providing the protocols that make the applications work properly. To operate the DeFi automated machines you have to use stablecoins and cryptocurrencies as tokens, not dollar coins or bills, because traditional money only circulates off-chain (out of the blockchain).","Let’s say you want to buy a $5,000 non-fungible token (NFT) that you believe will increase in value, but you don’t have enough money now to make the purchase. You need three more weeks, when you’ll receive your salary. A three-week loan of a couple of thousand dollars isn’t something many banks would be willing to do because the transaction costs would be too high. You could get a cash advance from your credit card but, again, high costs could be a limitation since you’d be subject to a 25% APR.","Read more: The Real Trouble With Cross-Border Payments - Marcelo Prates","You could go instead to one of the vending machines in DeFi Land and use some of the stablecoins and NFTs you already have as collateral to choose a crypto loan that best fits your needs. The amount borrowed would then be immediately dispensed to your digital wallet and, in three weeks, automatically pulled out of the same digital wallet, plus interest, all set up by the digital vending machine of your choosing.","DeFi thus offers tailored solutions for financial needs through applications and smart contracts that are readily available 24\/7 for anyone who holds stablecoins or crypto that can make them work. More than that, as these smart contracts are built on top of the Ethereum blockchain as open and decentralized protocols, they can be reorganized, repackaged and rebuilt as a new smart contract.","It would be similar to having free access to any vending machine placed in a large retail store. A person could come and add cereal and chocolate bars to some of the open slots of a soda vending machine. Another could make changes for the vending machine to take credit cards besides dollar coins and bills. All the people who invested in improving the original soda vending machine would receive some compensation as the added features lead to more sales.","And, to avoid someone taking advantage of the unlocked vending machine to steal all its products or the sale’ proceeds, the open vending machines would be placed in a public area with their inner parts protected by tamper-proof seals and tags. You could make changes to add features and improve functionalities but not to damage the machines or hamper their regular workings.","In the DeFi environment, the open and decentralized infrastructure provided by the Ethereum blockchain combined with its cryptographic protection makes it harder for bad actors to corrupt or hack the smart contracts that power the applications. The open-source governance allows all network participants to easily verify whether a smart contract is correctly functioning and executing its automated operations and agreements. Transparency, cryptography and broad collaboration are, thus, used to improve security and resilience.","In light of its features, DeFi creates a borderless financial system from the ground up. At the infrastructural level, old rails controlled by a singular institution are substituted by a decentralized ledger running on hundreds of thousands of computers. At the institutional level, banks, financial institutions and even fintech firms with strong national ties are replaced by automated machines widely accessible. At the transactional level, sovereign currencies are superseded by stablecoins and native cryptocurrencies.","DeFi opens up a world of financial possibilities for those with access to stablecoins and cryptocurrencies regardless of their identity, nationality or location. The downside, for now, is that DeFi can be expensive for retail users. The fees for using the Ethereum blockchain, aka “gas fees,” can exceed $300 per transaction, no matter if you’re a so-called whale making a million-dollar investment or just trying to convert $100 worth of stablecoins into ether or another cryptocurrency.","The problem happens because the Ethereum blockchain cannot keep up with the increased demand for block space. It’s as if the success of the full-line vending area became so overwhelming, with hordes of new vending machines and customers arriving each day, that it would suddenly be too small to accommodate everybody. Because the physical space cannot be easily or quickly expanded without compromising its security, the alternative is to increase the cost to use the machines.","DeFi also creates challenges for regulators, who have trouble dealing with anything that isn’t connected to a jurisdiction. Once sovereign money is exchanged for stablecoins or crypto, regulators lose much of their control over what happens next. They can still track the movements happening on the blockchain and the history of all transactions, although with no immediate access to the identities behind each digital wallet and public key.","And even when regulators can identify who is making the transaction, it may be hard to establish whether they can do something because the transaction happens in a depersonalized platform and involves entities and money from different jurisdictions. International collaboration may be easier to achieve when it comes to preventing criminal activities, like money laundering and terrorism financing. But for typical regulatory considerations, like licensing or supervision, cooperation and coordination among different jurisdictions may be more difficult to attain.","Should these DeFi limitations concern regulators? As long as fraudulent and criminal activities can be averted and prosecuted, regulators should let DeFi run its course. The degree of transparency and auditability afforded by the Ethereum blockchain and the high level of education and resources of its typical participants play against direct regulatory intervention in DeFi.","Self-regulation through smart contracts should be the first line of defense. The same ingenuity used to build the DeFi space could be devoted to spreading essential information, creating basic contractual protections, and curbing abusive behavior. The choices made by the DeFi community will, therefore, be crucial for its future. DeFi can either grow as a reliable financial alternative for all or crystalize into a casino for the rich."],"entity":[{"type":"Marcelo Prates","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nick Szabo","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"$300","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"1920s","content":"DATE"},{"type":"$100","content":"MONEY"}],"hashtag":["Opinion","DeFi"],"authors":["Marcelo Prates"]}