{"summary":"Early adoption of new accounting standards means the company could report a gain of more than $300 per share for the first quarter and meet the remaining requirement for index inclusion, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/25\/microstrategy-could-merit-sp-500-inclusion-if-it-adopts-new-accounting-rules-benchmark\/","publishDate":"2024-04-25T12:48:18","id":16379,"type":null,"title":"MicroStrategy Could Merit S&P 500 Inclusion If It Adopts New Accounting Rules: Benchmark","category":["Finance"],"content":["MicroStrategy (MSTR) could surprise Wall Street analysts and report better-than-expected earnings if the software company chooses to adopt new accounting standards, a move that means it could qualify for inclusion in America’s most important stock index, the S&P 500, broker Benchmark said in a research report on Thursday.\n\nThe company will report results for the first quarter 2024 after the close of markets on April 29.","MicroStrategy’s corporate strategy is partly based on the acquisition and holding of bitcoin. As of March 19 it held 214,246 bitcoin worth $13.9 billion at current prices. Benchmark notes that since the software company started holding bitcoin on its balance sheet it has recorded $2.27 billion in cumulative impairment losses due to a Financial Accounting Standards Board (FASB) rule called ASC 350.\n\nThe FASB issued new guidance in December last year that allows companies that hold digital assets on their balance sheet to measure them at fair value, and record changes in fair value in net income in each reporting period. The new rules become effective as of Jan. 1, 2025, but early adoption of the standard is allowed.\n\n“The impact of doing so on MSTR’s reported earnings per share would be massive: the company in its 2023 10-K report estimated that early adoption would increase its 2024 beginning retained earnings balance by ~$3.1 billion,” analyst Mark Palmer wrote.","Analyst consensus is for MicroStrategy to report a first-quarter 2024 loss per share of $0.55. Benchmark estimates that if the company decides to opt for early adoption of the new standard it could report a gain of more than $300 per share for the quarter.\n\nMicroStrategy currently meets nearly all of the criteria for S&P 500 inclusion, the report said. The company is based in the U.S., its shares are highly liquid, 50% of its outstanding shares are available for trading, and its market cap is greater than $18 billion.","For the index committee to consider a stock for inclusion in the S&P 500 it must also report positive earnings in its most recent quarter. Benchmark notes that MicroStrategy has reported losses in 10 of the past 14 quarters. Early adoption of the new standards means the software company could meet this final criterion.\n\n“Inclusion in the S&P 500 would position MSTR’s stock valuation to receive an ongoing boost from the price-agnostic purchases of its shares resulting from enormous passive inflows,” Palmer wrote.\n\nStill, uncertainty around the tax impact of adopting the FASB’s updated guidance could cause MicroStrategy to hold off on early adoption, the report added","Read more: MicroStrategy Should Continue to Rally as Bitcoin Halving Nears: Benchmark"],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$300","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Financial Accounting Standards Board (FASB","content":"ORGANIZATION"},{"type":"FASB","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"$0.55","content":"MONEY"},{"type":"$13.9 billion","content":"MONEY"},{"type":"quarter 2024","content":"DATE"},{"type":"Palmer","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"2023 10","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"the first quarter 2024","content":"DATE"},{"type":"ASC","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Jan. 1, 2025","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"MicroStrategy Should Continue to Rally as Bitcoin Halving Nears","content":"ORGANIZATION"},{"type":"$2.27 billion","content":"MONEY"},{"type":"Mark Palmer","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":["Analyst Ratings","MicroStrategy"],"authors":["Will Canny"]}