{"summary":"EigenLayer y protocolos similares de \"restauración\" son actualmente la inversión más ruidosa en blockchain, pero la Tecnología no está exenta de riesgos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/restaking-101-what-are-restaking-and-liquid-restaking\/","publishDate":"2024-05-02T16:05:30","id":16372,"type":null,"title":"¿Qué es retomar? ¿Qué es la recuperación de líquidos? ¿Qué es la capa propia?","category":["Learn"],"content":["En menos de un año, el gigante de la \"recuperación\" de Ethereum , EigenLayer, ha engullido más de 16 mil millones de dólares en depósitos de ether (ETH), activos digitales que, en teoría, se utilizarán para ayudar a proteger los protocolos de Criptomonedas advenedizos.","Restablecer (la idea de utilizar una cadena de bloques para proteger otras aplicaciones) se ha convertido rápidamente en la nueva tendencia de inversión más importante de la industria de la Cripto . Cada semana parecen llegar nuevas empresas de recuperación, y industrias artesanales enteras, \"servicios validados activamente\" y plataformas de \"reactivación de líquidos\" han aprovechado el revuelo con sus propias versiones de la tecnología.","Si bien algunos elogian la recuperación como una oportunidad de inversión prometedora y un gran salto para la seguridad Cripto , otros lo ven como una táctica mucho más arriesgada : un esquema de rehipotecación que promete recompensas demasiado buenas para ser verdad basadas en fundamentos endebles.","Restablecer es la última respuesta a la pregunta de seguridad central de todo lo relacionado con las Cripto: cómo utilizar los juegos económicos para proteger los sistemas informáticos descentralizados.","En el corazón de todas las cadenas de bloques está la idea de \"descentralización\", donde una red de operadores ampliamente distribuida, en lugar de una sola parte, toma las transacciones de los usuarios, las escribe en el libro de contabilidad digital de la cadena y garantiza que todos los demás operadores informen los datos de manera honesta. .","A diferencia de las cadenas de bloques de prueba de trabajo como Bitcoin, donde los \"mineros\" gastan poder de cómputo para KEEP segura una cadena, las cadenas de bloques de prueba de participación como Ethereum y Solana están administradas por \"validadores\" que \"apuestan\" la moneda para ayudar a ejecutar el red.","Sigue leyendo: Cripto Stake 101: ¿Qué es el Stake?","Los validadores ganan intereses como recompensa por su trabajo. Cuanto mayor sea su apuesta, más recompensas obtendrán. La apuesta también actúa como garantía; Si un validador intenta mentirle a la cadena de bloques o está mal configurado, la red revoca una parte de la apuesta.","La mecánica exacta detrás de las apuestas puede variar de una cadena a otra, pero la conclusión importante cuando se trata de apostar es la siguiente: el costo de atacar (léase: drenar dinero de) un sistema de prueba de participación es aproximadamente la cantidad de dinero que se ha gastado. en juego en su defensa. Es por eso que Ethereum, en particular, se considera tan seguro: hay más de $100 mil millones en ETH en juego con él.","Remaking promete aplicar este juego económico a prácticamente cualquier cosa, aprovechando las grandes cantidades de apuestas en los protocolos existentes para ayudar a proteger las nuevas aplicaciones blockchain. Como oportunidad de inversión, se presenta como una forma de generar un BIT de interés adicional a partir de las apuestas convencionales.","EigenLayer, el líder de reinversión de Ethereum, permite a los usuarios tomar ETH que han apostado con Ethereum y luego volver a apostarlo con los llamados \"Servicios validados activamente\" o AVS. Hoy en día, se trata principalmente de protocolos blockchain que brindan soporte para las soluciones de escalamiento de Ethereum .","Los defensores de la tecnología argumentan que la reanudación ayuda a mejorar la seguridad de las aplicaciones blockchain más pequeñas, ya que podrían tener dificultades para apuntalar sus propios sistemas de seguridad de prueba de participación, dado que hacerlo requiere un capital sustancial y una comunidad activa.","En una entrevista con CoinDesk el mes pasado, el fundador de EigenLayer, Sreeram Kannan, explicó cómo funciona esto usando el ejemplo de 100 protocolos blockchain, cada uno de los cuales está asegurado por mil millones de dólares en participación: Imagine que \"en lugar de que cada uno de los protocolos tenga mil millones de dólares apostados por separado, había 100 mil millones de dólares en juego en 100 protocolos\", dijo Kannan. \"Para atacar ONE protocolo, ahora se necesitan 100.000 millones de dólares en lugar de 1.000 millones de dólares\".","Los detalles pueden parecer diferentes en otras cadenas de bloques, pero la esencia es la misma. En Solana, por ejemplo, los usuarios podrán volver a apostar SOL que hayan apostado en esa red para ganar intereses adicionales y ayudar a proteger otras aplicaciones.","Retomar a través de una plataforma como EigenLayer generalmente significa depositar el ETH (o derivados de ETH seleccionados) en el protocolo, activar un operador y luego seleccionar qué AVS asegurar a cambio de intereses.","Una forma más sencilla de apostar es a través de servicios de recuperación de líquidos como Puffer, Ether.Fi y Renzo. Se trata de intermediarios que toman activos de los usuarios, los depositan en EigenLayer y plataformas equivalentes, y ofrecen recibos, llamados \"tokens de recuperación líquida\" (LRT), que acumulan intereses y pueden negociarse en Finanzas descentralizadas para obtener rendimientos aún mayores.","Las plataformas de recuperación de líquidos hacen todo el trabajo pesado de configurar el software del operador y seleccionar con qué AVS trabajar. Los LRT permiten a los usuarios entrar y salir fácilmente de posiciones de reposición, y les ofrecen la posibilidad de aumentar su apalancamiento reinvirtiendo en protocolos Finanzas descentralizados.","Los servicios reflejan plataformas como Lido, el gigante de apuestas líquidas en Ethereum que apuesta activos en nombre de los inversores y ofrece un token de apuestas líquidas derivado, \"Lido sked ETH\" (stETH), que rastrea el precio de ETH. StETH es muy popular en las Finanzas descentralizadas, y las nuevas plataformas de recuperación de líquidos esperan replicar el éxito de Lido con sus LRT orientados a la conveniencia.","Si bien los inversores, desarrolladores y empresas de riesgo han adoptado la recapitalización, a algunos les preocupa que la tendencia sea la última bomba de tiempo de las criptomonedas, una rehipotecación de la confianza que inevitablemente colapsará.","Señalan el espectro del riesgo de contagio: la idea de que si un AVS elimina a un operador, el impacto podría extenderse a todo el ecosistema de apuestas, agotando el valor de todo el grupo de reapuestas y reduciendo la seguridad de todos los demás AVS. como resultado. (EigenLayer está agregando un programa de seguro llamado \"seguridad atribuible\" para abordar esta preocupación, pero los detalles aún no se han ultimado).","Con el auge de los LRT surge un temor aún mayor a una catástrofe masiva. Si los protocolos comienzan a aprovechar la confianza de las personas permitiéndoles apostar tokens, tokens de apuesta líquidos y también tokens de reapotación líquidos, entonces crece la superficie para una crisis de rehipotecación. Un evento de reducción o un activo desvinculado podría derribar a muchos.","Aunque existen versiones de seguridad conjunta desde hace algún tiempo (sobre todo en el ecosistema blockchain de Cosmos ), la formulación moderna de \"retomar\" sigue siendo más una teoría que una realidad. EigenLayer fue técnicamente el primer protocolo de recuperación que se lanzó en la red principal de Ethereum, pero permanece en versión beta limitada. EigenLayer acepta depósitos, pero la mayoría de sus características clave, incluida la reducción, aún no existían al momento de esta publicación, y los AVS solo pueden registrarse en el programa, pero aún no pueden implementarlo.","Sigue leyendo: A EigenLayer, el mayor proyecto de Crypto lanzado este año, todavía le falta una funcionalidad crucial","El único incentivo para la recuperación y la recuperación de líquidos hasta ahora han sido los \"puntos\", que son recuentos de puntuaciones rastreados por EigenLayer y protocolos de recuperación de líquidos que los depositantes esperan que estén vinculados a futuros lanzamientos aéreos de activos digitales.","Los puntos no están diseñados para tener ningún valor, pero los usuarios han comenzado a comprarlos y venderlos directamente, generando un frenesí especulativo en torno a reafirmar que algunos temores no se basan en la realidad económica y podrían generar decepción y grandes liquidaciones en el futuro. . EigenLayer y el protocolo de recuperación de líquidos Renzo ya han demostrado cómo los sistemas de puntos pueden establecer expectativas poco realistas: ambos proyectos provocaron furor el mes pasado cuando revelaron planes de lanzamiento aéreo de tokens que presentaban asignaciones más pequeñas para los ganadores de puntos de lo que algunos depositantes habían anticipado.","Un prolífico inversor ángel de proyectos de Solana le dijo a CoinDesk que \"no había (todavía)\" invertido en ningún equipo de recuperación para ese ecosistema. Cuando se le preguntó por qué, respondió descaradamente: \"Simplemente debatir cuándo volver a tomar hace estallar las Cripto\".","Danny Nelson contribuyó con el reportaje.","Editado por Bradley Keoun and Nick Baker."],"entity":[{"type":"Puffer","content":"PERSON"},{"type":"Ethereum y Solana","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Danny Nelson","content":"PERSON"},{"type":"su defensa","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Finanzas","content":"LOCATION"}],"hashtag":["EigenLayer","Staking","Restaking","Ethereum","Liquid staking","Lido","Eigenlabs","Spanish"],"authors":["Sam Kessler"]}