{"summary":"No.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/10\/was-sam-bankman-fried-proven-right-about-ftxs-solvency\/","publishDate":"2024-05-10T20:03:21","id":16383,"type":null,"title":"Was Sam Bankman-Fried Proven Right About FTX’s Solvency?","category":["Opinion"],"content":["Bankrupt crypto exchange FTX has recovered billions of dollars more than it needs to make the victim’s of Sam Bankman-Fried’s theft whole, according to the latest bankruptcy plan announced on Tuesday. Customers will receive $1.18 for every dollar’s worth of crypto assets they held on the exchange at the time of collapse in November 2022, plus interest.","This result – rare in the world of bankruptcies, where creditors typically receive pennies on the dollar – has raised a poignant question for some: Was Sam Bankman-Fried right all along?","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates. This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","For instance, Bloomberg’s Matt Levine opened a recent edition of the (always excellent) “Money Stuff” newsletter getting straight to the point: “FTX was … illiquid but solvent?” That is, in a way, a very simple and direct way of stating what SBF, who was recently sentenced to 25 years in prison for one of the largest financial heists ever, has been saying for years.","See also: Could Sam Bankman-Fried's Saga Happen Without Crypto?","To make it brief, in the days leading up to FTX’s bankruptcy on Nov. 11, 2022, SBF was frantically trying to shore up a gigantic hole in his company’s balance sheet by raising funds basically from anyone he could. This reportedly includes everyone from Silicon Valley VCs, Saudi money men and even SBF’s archrival ex-CEO of Binance Changpeng Zhao (who reneged on a handshake buyout deal after reviewing the state of FTX’s finances, only speeding up the ongoing run on the exchange).","He was trying to raise this money 1) because SBF and his inner circle had become painfully aware of a shortfall in capital needed to meet all customer withdrawals (a balance reportedly shown to prospective investors showed the exchange only had $900 million in liquid assets) and 2) because (and this is debatable) he believed – or said he believed – that there actually was enough capital, it was just illiquid. To wit:","\"FTX is fine. Assets are fine,” Bankman-Fried infamously tweeted out on Nov. 7 after being confronted by FTX co-founder Gary Wang about the exchange’s $8 billion hole as customer withdrawals began to pick up following Zhao’s announcement that he’d sell Binance’s FTT stack.","From the beginning of his ill-fated “media tour” to the end of his trial, SBF routinely characterized FTX’s implosion as due to an accounting error – in particular a \"confusing internal account” that made it seem to him that FTX was on more solid footing. Plus, as Michael Lewis noted in the hagiography “Going Infinite,” SBF privately estimated his personal worth at over $100 billion, though that was before the price of FTT, SOL and other “Sam Coins” cratered.","It was actually this insistence that he could have rescued FTX had he not declared bankruptcy, and unwillingness to take responsibility for his crime, that led to his lengthy sentence. “In 30 years, I’ve never seen a performance like that,” Judge Lewis Kaplan said during the sentencing hearing, describing SBF’s evasiveness and remorselessness.","But just because someone believes something doesn’t make it true, no matter how many Substack posts they write or spreadsheets they create. John J. Ray III, current FTX CEO overseeing the bankruptcy, says over the past 17 months the firm was able to recover between $14.5 billion and $16.3 billion in assets that weren’t on the exchange at the time it collapsed.","While it will likely take access to documents that aren’t actually publicly available, including FTX’s (abysmal) financial statements before the collapse and for today to conclusively prove this; it’s likely this recovery is due mostly to the rising price of crypto assets. Although JJR’s well-paid legal team likely put in a lot of effort to recover funds from “dozens of private entities,” it likely doesn’t add up to billions and billions of dollars.","See also: The Downfall of FTX: The Crypto Industry Reacts","Anthropic, for instance, one of SBF’s lucky bets in AI, got the firm a return of $884 million – a windfall, but likely the biggest non-crypto sale FTX made. FTX also sold off 38 Bahamian properties for around $199 million, and was able to recover nearly $2.6 billion in cash.","In comparison, the estate sold off $1.9 billion worth of deeply discounted SOL recently, and apparently still holds $7.5 billion worth of locked-up tokens. Those tokens were worth less than $500 million at the time of FTX’s collapse. In total, FTX raised about $5 billion by selling tokens, and it expects to raise another $4.4 billion over the next few months.","This to me all seems like FTX wasn’t actually solvent at the time it collapsed and that it could repay the $8 billion in missing customer funds if only SBF had the ability to quickly sell off all of its property, equity investments and crypto (without tanking prices even further). But instead due to the subsequent bull run, FTX became solvent.","Customers are being made whole, not in crypto assets, of which there is still a shortfall (i.e. there is not enough BTC to go around to pay back all customer BTC claims), but in the dollar value of their accounts in November 2022 prices. It’s a lucky break that the market rebounded enough so that the fraction pays for the whole.","But SBF didn’t have the benefit of waiting several months to see if crypto would rise from the ashes. And his argument that FTX only had an illiquidity problem is patently absurd.","Edited by Benjamin Schiller."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"$5 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Nov. 7","content":"DATE"},{"type":"$14.5 billion","content":"MONEY"},{"type":"$7.5 billion","content":"MONEY"},{"type":"$16.3 billion","content":"MONEY"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Crypto Industry Reacts","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Saga Happen Without Crypto","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$1.9 billion","content":"MONEY"},{"type":"Nov. 11, 2022","content":"DATE"},{"type":"Michael Lewis","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"$900 million","content":"MONEY"},{"type":"$199 million","content":"MONEY"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"$884 million","content":"MONEY"},{"type":"Sam Coins","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"$100 billion","content":"MONEY"},{"type":"Matt Levine","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"$1.18","content":"MONEY"},{"type":"$2.6 billion","content":"MONEY"},{"type":"$4.4 billion","content":"MONEY"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["Opinion","The Node","Newsletters","Sam Bankman-Fried","FTX","Bankruptcy"],"authors":["Daniel Kuhn"]}