{"summary":"Germany is a relatively conservative financial market, and landesbank are among its most conservative institutions. So what is the country’s largest landesbank doing launching crypto services? Noelle Acheson explains.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/24\/how-a-conservative-german-bank-offering-crypto-makes-sense\/","publishDate":"2024-04-24T12:38:47","id":16388,"type":null,"title":"How a Conservative German Bank Offering Crypto Makes Sense","category":["Consensus Magazine"],"content":["When thinking about global financial innovation (which I’m sure you all do often, right?), Germany is not usually the first jurisdiction to come to mind.","As well as a struggling manufacturing sector and messy politics, Europe’s largest economy is known for its conservative and rigid financial sector dominated by banks rather than by markets.","It is, therefore, somewhat of a surprise to see its banks lead Europe in the exploration of an entirely new type of market.","Noelle Acheson is the former head of research at CoinDesk and Genesis Trading, and host of the CoinDesk Markets Daily podcast. This article is excerpted from her Crypto Is Macro Now newsletter, which focuses on the overlap between the shifting crypto and macro landscapes. These opinions are hers, and nothing she writes should be taken as investment advice.","Last week, Germany’s Landesbank Baden-Württemberg (LBBW) announced that it was launching crypto procurement and custody services later this year.","Read more: Germany's Largest Federal Bank LBBW to Offer Crypto Custody Services With Bitpanda","LBBW is Germany’s largest landesbank, which is a type of savings institution usually owned at least partially by the state. As the name implies, savings institutions are among the most conservative institutions in an already conservative field, as their focus is stability, more so even than profit.","The current institution emerged in 1999 as the result of a merger, but the family tree goes back as far as 1818. Despite being owned by the Federal State of Baden-Württemberg, the Savings Bank Association of Baden-Württemberg, and the City of Stuttgart, LBBW has typically been more aggressive than many of its peers. It is one of the largest participants in Germany’s bond market, one of the largest real estate lenders in Germany, and yet can still boast high debt ratings.","And now, it will offer corporate clients access to assets that executives from much more aggressive banks in more supposedly forward-looking jurisdictions call “garbage” and other less-kind descriptions.","What is even more surprising is the language used in the announcement. A statement from Jürgen Harengel, COO of the Corporate Bank at LBBW, said:","\"The demand from our corporate customers for digital assets is increasing. We are convinced that crypto assets will establish themselves as a building block for further business models.”","You may well be asking yourself, “what kind of demand from corporate customers?”, and “what kind of business models?” We’ll get to that in a second, but first, let’s step back and take a look across the ocean.","Contrast this to the institutional vibe in the U.S., which is all about retail demand (and institutional interest, which in turn usually depends on retail or high-net-worth individuals). In other words, the U.S. focus seems to be on store-of-value hedging and speculative trading.","In Germany, the goal seems to be more about business.","Unlike the U.S., Germany’s financial industry is dominated by banks rather than by markets, with ultra-conservative state-owned savings banks playing a very large role. Debt dominates corporate financing much more than bonds or equities, which means that German banks are more deeply embedded in corporate activity than are their U.S. counterparts.","This brings us to LBBW’s probable motivation here. Thinking longer-term, the bank is not as interested in crypto trading as it is in token utility, and what that can do for its corporate clients.","Back in 2019, LBBW was one of the early participants in the Marco Polo distributed ledger trade finance solution, which dissolved last year. In 2022, LBBW was one of the first to issue digital securities on Deutsche Börse’s D7 post-trade platform. Last year, the bank invested in the tokenization network SWIAT, developed by DekaBank (itself an interesting story, for another time). This year, LBBW will be one of the first participants in the ECB’s wholesale DLT trial.","You can see the pattern? LBBW is actively exploring corporate blockchain applications. It seems to realize that these will need tokens, and my guess is that it wants an active token exchange platform up and running for when token issuance becomes more common among businesses developing enterprise blockchain applications.","It probably does see some demand from corporate clients for BTC, ETH and other liquid crypto assets. But that doesn’t feel like the real goal here. It feels like LBBW is getting ready for a more tokenized business world, in which value is more about function than form, and liquidity matters more than price appreciation.","To see this strategy playing out more in Germany than in the U.S. is fitting, given their different market characteristics. It is also encouraging in that it highlights how crypto markets are not just about portfolio allocations and nice capital gains; crypto markets are also about more efficient distribution, accountability and flexibility.","Edited by Benjamin Schiller."],"entity":[{"type":"Federal State of Baden","content":"ORGANIZATION"},{"type":"Württemberg","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"DekaBank","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Corporate Bank","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Savings Bank Association of Baden","content":"ORGANIZATION"},{"type":"1818","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Deutsche Börse","content":"ORGANIZATION"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"Landesbank Baden","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Marco Polo","content":"PERSON"},{"type":"Jürgen Harengel","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Stuttgart","content":"LOCATION"},{"type":"1999","content":"DATE"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Largest Federal Bank LBBW to Offer Crypto Custody Services With Bitpanda","content":"ORGANIZATION"}],"hashtag":["Opinion"],"authors":["Noelle Acheson"]}