{"summary":"El reciente caos en torno al intercambio centralizado FTX ha generado preguntas sobre los pros y los contras de mantener sus monedas en intercambios centralizados versus descentralizados. Lo descomponemos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/centralized-exchange-cex-vs-decentralized-exchange-dex-whats-the-difference\/","publishDate":"2022-11-15T16:12:18","id":16386,"type":null,"title":"Intercambio centralizado (CEX) frente a intercambio descentralizado (DEX): ¿cuál es la diferencia?","category":["Learn"],"content":["Si está considerando comprar o vender Cripto, su primer puerto de escala probablemente será un intercambio. Por lo general, el primer punto de entrada al comercio de Criptomonedas es un intercambio centralizado (CEX), un mercado digital donde se realiza el comercio de Cripto . Probablemente hayas oído hablar de algunos: Binance, Kraken, Coinbase, etc. En noviembre de 2022, una primicia de CoinDesk provocó un sorprendente giro de los Eventos que llevó al antiguo intercambio popular FTX al colapso y a declararse en quiebra .","Esto ha llevado a muchos inversores en Cripto a buscar alternativas a los intercambios centralizados. La alternativa obvia es un tipo más nuevo de intercambio descentralizado, como Uniswap y PancakeSwap . Estos intercambios descentralizados repensan radicalmente cómo pueden funcionar los intercambios.","Ver también: ¿Qué es un token de intercambio?","En los últimos cinco años han surgido intercambios descentralizados (DEX) para desafiar a los CEX existentes. En resumen, los DEX tienen como objetivo ofrecer tarifas de transacción más bajas, permitir a los usuarios conservar directamente sus propios activos y evitar algunas cargas regulatorias. Por otro lado, enfrentan el costo de compensar a sus proveedores de liquidez por un tipo especial de riesgo llamado “pérdida impermanente”.","Los CEX también ofrecen ventajas. La mayoría de las bolsas centralizadas utilizan un modelo de negocio similar a las instituciones tradicionales como la Bolsa de Valores de Nueva York, que es una estructura que los inversores tradicionales entienden y con la que pueden sentirse más cómodos. Sus interfaces y aplicaciones tienden a ser más fáciles de usar y para principiantes y, en general, ofrecen más liquidez y garantías regulatorias más sólidas, lo que puede ser especialmente importante para los clientes institucionales. Pero también significa que la empresa central que gestiona el intercambio tiene mucho poder y responsabilidad sobre la estabilidad financiera y la salud del intercambio.","Ver también: Cómo sacar su riqueza de un intercambio","Si el drama reciente en torno a FTX le hace considerar mudarse a un DEX, esto es lo que necesita saber.","Los DEX tienen como objetivo completar transacciones de manera más rápida y económica que sus contrapartes centralizadas. Lo hacen eliminando las entidades intermediarias que se quedan con una parte de las tarifas de transacción de los CEX. El documento técnico de 2018 del DEX más grande del mundo, Uniswap, proclama \"extracción de renta cero\". Su objetivo es proteger a sus usuarios de los costes adicionales que implica la generación de beneficios para los intermediarios que gestionan los CEX. Bancor , que se lanzó en 2017 y se describe a sí mismo como el primer DEX, aboga por el enfoque descentralizado de esta manera:","“Históricamente, la liquidez en los intercambios de activos tradicionales ha sido proporcionada por un pequeño grupo de empresas comerciales profesionales con acceso autorizado y herramientas especializadas. Esto concentra la liquidez en manos de unos pocos actores que pueden retirar sus activos durante períodos de volatilidad y restringir la negociación de un activo cuando los usuarios más lo necesitan”.","A finales de 2021, el principal DEX Uniswap cobraba una tarifa de transacción del 0,05% sobre la operación de 100.000 dólares muestreada por la contabilidad global KPMG . Los CEX Binance, Coinbase y Kraken cobraban 0,1%, 0,2% y 0,2%, respectivamente.","Los DEX utilizan protocolos de “ Maker de mercado automatizados” para determinar los precios de los activos sin un organismo centralizado que orqueste las operaciones. Un enfoque común es el mecanismo del “producto constante”, que determina los precios ofrecidos en función del ratio de las reservas totales del DEX de cada uno de los activos involucrados. Esto tiene la ventaja de tender a KEEP las reservas en relativo equilibrio: si algún activo escaseara, se volvería extremadamente caro.","Sin embargo, los DEX todavía tienden a ofrecer aproximadamente los mismos precios de activos que los CEX. Esto se debe a que los comerciantes o robots atentos pueden beneficiarse rápidamente de cualquier discrepancia en los precios mediante el arbitraje . Si un determinado grupo contuviera muy poco ETH, tendría que permitir que los comerciantes vendieran ETH en el grupo a un precio más alto que el indicado por el mercado en general. Los comerciantes podrían beneficiarse fácilmente comprándolo en el mercado más amplio y vendiéndolo en el pool. Al hacerlo, el volumen del pool aumentaría, reduciendo el precio de oferta hasta igualar el mercado en general.","Sigue leyendo: Comprender la Tecnología detrás de los intercambios descentralizados","Por muy ordenado que sea este sistema, introduce un riesgo para los proveedores de liquidez detrás del fondo común. El riesgo se llama pérdida impermanente. Los proveedores de liquidez tienen derecho a retirar la parte del valor del fondo común que contribuyeron, no la cantidad exacta de tokens que colocaron. No podría prometer a todos los proveedores sus tokens exactos, porque la proporción de diferentes tokens mantenidos en el fondo cambia a medida que se intercambian. ocurrir. Pero a medida que la proporción se ajusta para reflejar los precios actuales del mercado más amplio, el grupo contendrá progresivamente más tokens que estén perdiendo valor, y viceversa.","Esto significa que un proveedor de liquidez tenderá a terminar retirando más del token que perdió valor y menos del que ganó valor, en comparación con sus activos iniciales. Por lo tanto, terminarán siendo más pobres que si hubieran conservado sus activos de forma privada. En la práctica, los DEX generalmente compensan a los proveedores de liquidez mediante tarifas de transacción. Pero eso significa cobrar tarifas más altas de las que necesitarían de otro modo.","Otra parte de la compensación entre DEX y CEX se reduce a si los usuarios prefieren tener su propia Cripto directamente o confiarla al intercambio. Los CEX normalmente requieren que los usuarios coloquen activos bajo su custodia antes de negociar.","Mantener sus activos usted mismo mantiene el ideal de autosuficiencia que impregna el sector de las Cripto . Tienes control total y exclusivo sobre ellos. Pero, por otro lado, sin el debido cuidado, las claves privadas pueden perderse o destruirse, haciendo que los activos asociados sean irrecuperables. El galés James Howells tiró por error un disco duro en 2013 y perdió el acceso a 7.500 bitcoins que valdrían más de 100 millones de dólares en noviembre de 2022. Ha apelado repetidamente y sin éxito al consejo local para que le permitiera excavar su vertedero.","La creciente popularidad de los DEX puede reflejar en parte su éxito a la hora de sortear algunos obstáculos regulatorios. La empresa que construye un DEX evita actuar como intermediario financiero o contraparte y no tiene que cumplir con los estándares de conocimiento del cliente (KYC) o contra el lavado de dinero (AML) porque opera de forma autónoma. ShapeShift solía ser un CEX hasta que su CEO dijo que la compañía perdió el 95% de sus usuarios como resultado de las medidas KYC que se vio obligada a implementar en 2018. En 2021, Shapeshift decididamente dio un giro y se convirtió en un DEX para ignorar este problema.","Los DEX pueden tener más dificultades que los CEX cuando trabajan con inversores más grandes. En este momento, todavía no pueden competir en tamaño con los CEX más grandes, por lo que no pueden ofrecer tanta liquidez. Cuando se encuentran con una liquidez insuficiente, los pedidos grandes pueden enfrentar costos adicionales no planificados llamados \"deslizamientos\". Además, los inversores institucionales enfrentan sus propios obstáculos ALD y otros obstáculos regulatorios y pueden tener dificultades para negociar con bolsas que no se someten a requisitos similares.","Sergej Kunz, cofundador del agregador de liquidez DEX 1inch Network, señaló el año pasado que los bancos y los fondos de cobertura habían tardado en involucrarse con las Finanzas descentralizadas ( DeFi ) debido a sus propios obstáculos regulatorios. Aunque es un DEX, su empresa ahora planea lanzar un producto compatible llamado 1INCH Pro, específicamente para atender a estos clientes.","Han surgido nuevos protocolos de agregación como 1INCH específicamente para ayudar a los inversores más grandes a evitar problemas de liquidez al utilizar DEX. 1INCH recaudó 12 millones de dólares en 2020 en una ronda de financiación liderada por Pantera Capital.","El aumento de los agregadores en realidad significa que los usuarios pueden acceder a liquidez de DEX y CEX al mismo tiempo. El protocolo DiversiFi, que en sí mismo es un DEX, agrega liquidez de ambos tipos de intercambios para ayudar a sus usuarios a concluir operaciones más grandes de manera más eficiente. Esto ayuda a los inversores a evitar los costos que conlleva el hecho de que la liquidez de una bolsa resulte demasiado pequeña para su orden.","Cuando se trata de decidir qué tipo de intercambio usar, todo se reduce a dos cosas: si está interesado principalmente en la facilidad de uso y no se siente cómodo con el control total de su propia billetera, entonces un CEX es probablemente la mejor opción Para ti. Si lo más importante para usted son tarifas más bajas y más control sobre sus propios fondos, entonces un DEX es el camino a seguir. Cualquiera que sea el camino que elija, asegúrese de saber cómo sacar su Cripto de un intercambio y almacenarla en frío para KEEP su patrimonio seguro a largo plazo.","Ver también: Por qué los intercambios descentralizados son importantes en la Cripto"],"entity":[{"type":"James Howells","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"0,05%","content":"PERCENT"},{"type":"Bolsa de Valores de Nueva York","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"0,2%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"0,1%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"Shapeshift decididamente","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"como Uniswap y PancakeSwap","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Sergej Kunz","content":"PERSON"}],"hashtag":["industry","Beginner","Learn","Spanish"],"authors":["Benedict George","Toby Bochan"]}