{"summary":"¿Está interesado en invertir en Cripto pero le preocupa la huella de carbono y el consumo de electricidad planteadas por los críticos?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/can-crypto-go-green-how-to-invest-in-eco-friendly-cryptocurrencies\/","publishDate":"2022-01-25T15:21:21","id":16399,"type":null,"title":"¿Pueden las Cripto volverse ecológicas? Cómo invertir en criptomonedas ecológicas","category":["Learn"],"content":["A estas alturas casi todo el mundo ha oído hablar de cuánta energía consume la minería de Bitcoin . Solo para alimentar una sola transacción BTC se necesitan más de 2264 kilovatios-hora (kWh) de electricidad, suficiente para hervir 1500 teteras. Pero no es sólo Bitcoin el que tiene este problema. Otras criptomonedas que también utilizan el mismo mecanismo de consenso de prueba de trabajo (PoW) enfrentan el mismo problema.","A medida que un número cada vez mayor de inversores otorga más valor a las empresas que enfatizan los principios ambientales, sociales y de gobernanza (ESG), especialmente la parte ambiental, es posible que los creadores de Criptomonedas pronto tengan que responder a la pregunta: ¿Es posible que las Cripto se vuelvan ecológicas?","La creciente conciencia sobre el consumo de energía de las criptomonedas, la presión de personas muy influyentes como ELON Musk (quien detuvo los pagos de Bitcoin en Tesla debido al impacto ambiental de las criptomonedas) y las medidas enérgicas en países importantes como China están empujando a la industria de las Cripto a adaptarse.","En respuesta a estos Eventos, proyectos blockchain nuevos y existentes están explorando todo, desde migrar a sistemas de validación que consuman menos energía hasta explorar la minería basada en energías renovables. Ethereum es quizás ONE de los ejemplos más destacados de un proyecto líder de Criptomonedas que está pasando de PoW a un sistema de prueba de participación ( PoS ), con el objetivo de reducir su consumo total de energía en un 99,95% .","A diferencia de PoW, PoS selecciona validadores en función de cuántos tokens nativos del proyecto bloquean en un contrato inteligente de participación. Cuantos más tokens guarde una persona, mayores serán las posibilidades de que el protocolo la seleccione para agregar nuevos datos a la cadena de bloques.","De manera similar a la minería, los validadores elegidos reciben una cantidad de tokens recién acuñados como recompensa por su participación. ONE de los mayores beneficios de este sistema sobre la minería de Cripto es que los requisitos de hardware son significativamente menores, lo que significa que más personas pueden convertirse en validadores. Esto, a su vez, aumenta la descentralización de un proyecto y mejora aún más la seguridad de la red. También tiene el beneficio adicional de reducir la cantidad de energía necesaria para alimentar la red.","Sigue leyendo: ¿Qué es la prueba de participación?","También existen crecientes incentivos financieros para mejorar la huella de carbono de las Criptomonedas a medida que las políticas ambientales pesan más en el proceso de toma de decisiones de los inversores y los reguladores aumentan su enfoque en el uso de la Cripto .","Los desarrolladores y defensores de las Cripto están haciendo esfuerzos para lograr la sostenibilidad del ecosistema blockchain y Cripto . Organizaciones como Cripto Climate Accord , por ejemplo, están trabajando para lograr el objetivo de que todas las cadenas de bloques funcionen con energía renovable para 2025, e incluso han elaborado un documento de auditoría de 32 páginas para contabilizar el impacto ambiental de las Criptomonedas. En un informe publicado recientemente, el Consejo Minero de Bitcoin encuestó el 32% de su red y afirmó que sus usuarios estaban minando con una combinación de energía renovable del 67%.","Varios factores afectan la sostenibilidad y el impacto ambiental de una Criptomonedas. El uso de energía es ONE de los más citados, pero no se trata sólo de qué Criptomonedas utiliza más energía. También hay que tener en cuenta de qué combinación de fuentes proviene ese poder.","¿Cuántas operaciones mineras funcionan con fuentes de energía renovables, si corresponde? ¿Qué sistema de validación utilizan? ¿Cuánto equipo físico se requiere para extraer monedas nuevas?","Sigue leyendo: El frustrante, enloquecedor y consumidor debate sobre la energía de Bitcoin","Operaciones mineras como Equinor y Crusoe Energy han reutilizado plantas de energía convencionales no utilizadas o el exceso de Gas de la perforación que generalmente se quema para alimentar las operaciones mineras. Los críticos han señalado, sin embargo, que esto no elimina las emisiones nocivas: simplemente las transfiere a una industria diferente y podría incentivar más perforaciones.","También ha habido intentos de utilizar parques solares o eólicos para alimentar la minería exclusivamente con energía renovable. La empresa de tecnología Lancium, con sede en Houston, por ejemplo, anunció planes para invertir 150 millones de dólares en plantas mineras renovables en 2022. Y si bien esto es loable en teoría, podría no ser financieramente posible construir plantas renovables para alimentar una Criptomonedas que podría caer inesperadamente en picado. valor . El valor de Bitcoin tiende a mantenerse alto incluso cuando oscila, pero es posible que otras criptomonedas no puedan justificar el costo de plantas de energía completamente nuevas simplemente para explotarlas.","Para abordar estas deficiencias, los creadores de nuevos sistemas Cripto y blockchain están buscando diseños más eficientes energéticamente.","Algunas criptomonedas más nuevas han incorporado energía renovable en su modelo operativo, combinándola con métodos de validación alternativos para crear un token que utiliza mucha menos energía que sus predecesores.","Estas son sólo algunas de las nuevas criptomonedas que se están desarrollando teniendo en cuenta la sostenibilidad.","Los avances en los mecanismos de consenso y el enfoque en la utilización de fuentes de energía renovables reducirían el costo ambiental general de las redes de Criptomonedas y blockchain con una amplia adopción. Todavía queda el problema de los desechos electrónicos de las operaciones mineras heredadas que abordar, pero las criptomonedas que no son PoW reducirían la demanda para construir plataformas mineras más nuevas y más grandes en el futuro, reduciendo potencialmente esos desechos."],"entity":[{"type":"2025","content":"DATE"},{"type":"Cripto Climate Accord","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Equinor y Crusoe Energy","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"32%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"el Consejo Minero de Bitcoin","content":"ORGANIZATION"},{"type":"Houston","content":"LOCATION"},{"type":"ESG","content":"LOCATION"},{"type":"Bitcoin el que tiene este problema","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"99,95%","content":"PERCENT"}],"hashtag":["industry","Intermediate","Spanish"],"authors":["John Bogna"]}