{"summary":"The wealthy individual investor claims that his funds were unjustly liquidated by the exchange in November 2020.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121865\/european-investor-initiates-icc-arbitration-proceedings-against-binance-seeking-140-million","publishDate":"2021-10-25T11:12:58","id":1639,"type":null,"title":"European investor initiates ICC arbitration proceedings against Binance","category":["STARTUPS"],"content":["An unnamed investor based in Europe has initiated ICC arbitration proceedings against crypto exchange Binance, The Block has learned.&nbsp;","The investor is seeking compensation of more than $140 million, claiming that his funds were unjustly liquidated by the exchange in November 2020, according to a source familiar with the situation.","The claim is directed at more than 45 entities around the world said to be connected to Binance, since the exchange does not disclose its headquarters (initially deeming it an archaic concept before recently acknowledging that it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117855\/binance-shift-away-decentralized-headquarters-pitch\" data-v-f87c67ca=\"\">needs to have one<\/a>). The proceedings have begun in Switzerland after months of negotiations.","The claim centers around Binance’s automated liquidation system. It alleges that the exchange forced the investor to sell large amounts of a specific coin against his own interests. The investor also claims that Binance had a conflict of interest in the liquidation.","ICC arbitration rules are used around the world for cases that involve cross-border disputes. With arbitration proceedings, each side picks one arbitrator and a third independent one is put in place. So instead of a lawsuit where the case goes to a judge and jury, it’s presented to three arbitrators.&nbsp;","Binance is also facing another potential lawsuit from its own users. A group of six investors have <a href=\"https:\/\/markets.businessinsider.com\/news\/currencies\/binance-crypto-service-outage-lawsuit-class-action-exchange-headquarters-decentralized-2021-08\" data-v-f87c67ca=\"\">raised $5 million<\/a> to sue the exchange over an outage on May 19 — when the price of bitcoin dropped drastically. They claim they lost more than $20 million combined. Since they announced their intentions to sue the exchange, <a href=\"https:\/\/www.cnbc.com\/2021\/08\/19\/cryptocurrency-traders-seek-damages-from-binance-after-major-outage.html\" data-v-f87c67ca=\"\">nearly 1,000 people<\/a> have joined the potential lawsuit.&nbsp;","We have reached out to Binance for comment and will update the article should we hear back.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ICC","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"$140 million","content":"MONEY"},{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May 19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"November 2020","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Tim Copeland","The Block"]}