{"summary":"Sempre più persone chiedono alle società Cripto e a coloro che stanno dietro a prodotti come le stablecoin di dimostrare di avere fondi sufficienti per pagare i propri clienti.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/what-are-fully-backed-reserves\/","publishDate":"2022-11-22T23:04:02","id":16398,"type":null,"title":"Cosa sono le riserve \"interamente garantite\"?","category":["Learn"],"content":["Le banche normali in realtà non detengono tutti i tuoi soldi. Prestano la maggior parte dei tuoi depositi nel tentativo di ottenere rendimenti dai Mercati finanziari. Ciò funziona, per la maggior parte, perché la banca assicura i depositi presso il governo federale e perché diversifica ampiamente la propria esposizione al rischio per garantire che T venga colta a corto in caso di crollo finanziario.","Questo sistema occasionalmente fallisce nella Finanza tradizionale (vedi: Lehman ) ma fallisce spesso nelle Cripto. Il governo non assicura i depositi sulle piattaforme Cripto e le piattaforme spesso non gestiscono particolarmente bene il rischio (vedi: FTX , Voyager Digital , Celsius Network ), facendo scommesse ad alto rischio che finiscono in una catastrofe.","Continua a leggere: Prova delle riserve: avrebbe potuto prevenire il tracollo di FTX?","Dopo che così tante piattaforme hanno sperperato i fondi dei clienti, i trader Cripto ci stanno pensando due volte prima di depositare fondi su scambi di Cripto e istituti di credito che \"reipotecano\" i depositi non assicurati, il che significa che riutilizzano il denaro dei clienti e prestano i fondi sui Mercati. Una scommessa più sicura LOOKS quella di fare trading su piattaforme che “coprono completamente” le loro riserve. Ma cosa significa veramente questo, e tali affermazioni dovrebbero essere prese con le pinze?","Quando un prodotto finanziario, come una stablecoin o un istituto di deposito, afferma di \"coprire completamente\" le sue riserve, significa che ha immagazzinato abbastanza denaro dietro un prodotto, come una stablecoin o il conto di trading di un cliente, per sostenerne il valore.","Pertanto, uno scambio Cripto che “copre completamente” le sue riserve dovrebbe sempre essere in grado di pagare i prelievi dei clienti, indipendentemente dallo stato del mercato. ONE esempio è Coinbase , che non presta i fondi dei propri clienti senza il loro esplicito permesso, il che significa che dovrebbe sempre avere abbastanza soldi a portata di mano per evitare una corsa agli sportelli.","Una stablecoin che “copre completamente” le sue riserve è sempre in grado di soddisfare le conversioni nell’asset originale, qualunque cosa accada. ONE esempio è WBTC, o Wrapped Bitcoin , che contiene Bitcoin reali (BTC) in un portafoglio freddo , quindi emette una quantità uguale di una versione basata su Ethereum della moneta che viene scambiata come token ERC-20 .","Pienamente coperto, tuttavia, non significa necessariamente che le attività siano detenute ONE a ONE. Questa affermazione si riferisce all'idea che se tu, per esempio, mi dai un dollaro, terrò quel dollaro come un dollaro e T lo trasformerò in qualcos'altro. Molte stablecoin che affermano di essere completamente garantite, come la stablecoin in dollari USAUSDC , non ONE ONE.","Questo perché le società che emettono USDC detengono i depositi di dollari statunitensi reali in “contanti e mezzi equivalenti”. Le disponibilità liquide si riferiscono ai titoli del Tesoro statunitense, ovvero al debito emesso dal Dipartimento del Tesoro statunitense. Queste obbligazioni, che pagano piccoli rendimenti ai detentori nel tempo, sono abbastanza vicine al valore dei dollari statunitensi effettivi da far sì che il mercato accetti che le obbligazioni abbiano essenzialmente lo stesso valore.","Ma “completamente coperto” non significa sempre che il sostegno possa resistere agli shock finanziari. Anche la stablecoin in dollari statunitensi Tether (USDT) afferma che le sue riserve sono completamente garantite, ma tale supporto è garantito da \"altre attività e crediti derivanti da prestiti concessi da Tether [la società emittente] a terzi\". Pertanto, USDT potrebbe essere completamente coperto, ma è parzialmente sostenuto da prestiti ad altre società Cripto .","Fino all’ottobre 2022, USDT era sostenuto anche da carta commerciale – debito commerciale a breve termine verso altre società – e trasferiva tali fondi ai titoli del Tesoro statunitense. La preoccupazione riguardo alla carta commerciale era che nessuno sapeva quali società Tether stesse utilizzando per sostenere USDT, quindi era impossibile determinare il valore di tale sostegno. Inoltre, la sua affermazione “pienamente sostenuta” si è storicamente rivelata non vera dopo che nel 2019 è emerso che USDT era, a ONE punto, sostenuto solo al 74% . Come ha scritto Dawn D. Stump della Commodity Futures Trading Commission, l’affermazione secondo cui era garantito dal dollaro statunitense “non era vera al 100%, il 100% delle volte”.","Continua a leggere: Cos'è Tether? Come funziona USDT e cosa ne sostiene il valore","Alcune stablecoin non sostengono completamente le loro riserve, il che in alcuni casi ha portato a risultati catastrofici. La popolare stablecoin algoritmica UST, ad esempio, è crollata in modo spettacolare , spazzando via miliardi dal mercato.","All’estremità opposta dello spettro, la stablecoin in dollari USA Dai sovracollateralizza le sue riserve con Cripto, il che significa che ha Cripto più che sufficienti a disposizione per sostenere la sua moneta. Dai è sopravvissuto a diversi crolli del mercato.","\n"],"entity":[{"type":"Dawn D. Stump della Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tesoro","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"sui Mercati","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"74%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"dai Mercati finanziari","content":"ORGANIZATION"},{"type":"nella Finanza","content":"PERSON"},{"type":"USA Dai","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"nelle Cripto","content":"PERSON"}],"hashtag":["Learn","industry","Beginner","Italian"],"authors":["Robert Stevens"]}