{"summary":"Just like equities have the S&P 500 and NASDAQ 100, we now see the emergence of cryptocurrency and digital asset indices.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/28\/crypto-for-advisors-beyond-bitcoin-crypto-indices\/","publishDate":"2024-03-28T15:45:00","id":16395,"type":null,"title":"Crypto for Advisors: Beyond Bitcoin, Crypto Indices","category":["Finance"],"content":["Investor interest in digital assets continues to grow. Crypto indices and funds are being created to track and provide tools and vehicles that expose investors to a broader cryptocurrency offering beyond just bitcoin. Jason Leibowitz from Hashnote provides an overview of evolving products in this market. Kim Greenberg from CoinDesk Indices answers questions in Ask an Expert.","Links to SWIFT, BlackRock and the London Stock Exchange announcements about their plans are below in Keep Reading.","Happy reading.","–S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Bitcoin, having recently commemorated its 15th anniversary, symbolizes a significant milestone in the evolution of the cryptocurrency asset class. While bitcoin laid the foundation for this market, the narrative has since expanded to include thousands of diverse tokens collectively valued in trillions of dollars. This growth underscores the dynamic evolution of the cryptocurrency ecosystem beyond bitcoin's pioneering role.","As this asset class continues to burgeon, investors encounter a fundamental challenge: how to navigate the vast and varied landscape of cryptocurrencies effectively. While the allure of comprehensive exposure to the cryptocurrency market remains strong, achieving this goal presents hurdles around liquidity, wallet management, allocation weightings and ongoing portfolio maintenance through market cycles.","The need to measure, invest and trade in the digital asset ecosystem extending beyond bitcoin is underscored by several factors:","Diversification: While bitcoin remains the cryptocurrency pioneer, the market now boasts thousands of alternative digital assets. Investors seek exposure to a broader spectrum of cryptocurrencies, recognizing the importance of diversification in managing risk. With the recent introduction of a spot Bitcoin ETF in the US markets, investors are now looking for more diverse investments to add to their portfolios, including spot Ether (ETH), liquid-staked crypto assets like stETH, and other innovative crypto indexes.","Evaluating Market Trends: The performance of the cryptocurrency market transcends bitcoin's fluctuations. Alternative cryptocurrencies exhibit diverse price movements, trends, and adoption rates. By tracking a comprehensive index, investors gain insights into overall market performance independent of bitcoin's influence. Investors are now keen on identifying the next big crypto trend beyond bitcoin's dominance, making broad-based crypto indexes essential tools for market analysis and investment decision-making.","Assessing Investment Opportunities: With the growing popularity of staked crypto assets like stETH, investors are exploring new avenues for investment diversification, seeking opportunities beyond traditional cryptocurrencies. Broad-based benchmarks enable investors to evaluate sector-specific performance and identify promising investment opportunities within these niches.","Technological Innovation: Rapid technological innovation characterizes the cryptocurrency landscape. Beyond Bitcoin, projects like Ethereum, Cardano and Solana pioneer groundbreaking solutions. Monitoring a comprehensive index facilitates awareness of emerging technologies and their adoption rates. As investors seek exposure to innovative projects and emerging technologies in the crypto space, indexes provide a curated selection of assets that reflect the evolving landscape of digital assets.","Market Sentiment and Confidence: The performance of multiple cryptocurrencies reflects broader market sentiment and confidence in the crypto ecosystem. Fluctuations in index composition or performance signal shifts in investor sentiment, regulatory developments, or macroeconomic factors impacting the market. With increasing market maturity and regulatory clarity, investors are gaining confidence in the cryptocurrency market, driving demand for diversified investment options.","The solution?","Several firms are forming broad-based digital asset benchmarks. Just like equities have the S&P 500 and NASDAQ 100, we are now seeing the emergence of the CoinDesk 20 and others. These indices are designed with trading and liquidity in mind.","Ultimately, investments beyond bitcoin offer a holistic view of the cryptocurrency market. By providing investors with regulated access to a diversified portfolio of digital assets, investors can be empowered to navigate the evolving crypto landscape confidently, assess investment opportunities, and glean insights into broader market trends and sentiment. This approach streamlines the investment processes, offering investors a simplified avenue for exposure to a diversified and balanced portfolio of cryptocurrencies.","- Jason Leibowitz MD, head of private wealth, Hashnote","How should I measure the ever-changing crypto landscape?","As the new digital asset class emerges, market participants and observers will need a new reference index to measure performance, invest and trade. Similar to any asset class, benchmarks are used to capture the full market. Hence, broad-based indices will emerge as the reference for crypto and the new building block for investment products. Several broad-based digital asset indices already exist, including the Bitwise 10 Large Cap Crypto Index and the CoinDesk 20 Index.","Spot bitcoin ETFs have been approved. What’s next?","Now that bitcoin is more traditionally accessible, we are observing investors turning their attention to the following three emerging themes:","- Kim Greenberg, head of marketing, CoinDesk Indices","BlackRock’s next move into digital assets came with announcing its first tokenized fund built on Ethereum.","Global money mover SWIFT announced plans for a new platform to connect central bank digital currencies within 24 months.","London Stock Exchange expects bitcoin exchange-traded notes to start trading on the 28th of May.","Edited by Bradley Keoun."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"Kim Greenberg","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"28th of May","content":"DATE"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"London Stock Exchange","content":"ORGANIZATION"},{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Hashnote","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Jason Leibowitz","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Hashnote","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"CoinDesk Indices","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","CoinDesk Indices","Indices","Bitcoin","Portfolio management","Sentiment","CoinDesk 20"],"authors":["Sarah Morton","Jason Leibowitz"]}