{"summary":"Federal Reserve keeps interest rates unchanged, in line with expectations.\n“We’re prepared to raise rates further, if appropriate,” Federal Reserve Chair Jerome Powell said at a press conference.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252066\/bitcoins-price-is-flat-as-federal-reserve-keeps-interest-rates-unchanged","publishDate":"2023-09-20T14:20:21","id":1639,"type":null,"title":"Bitcoin declines after Federal Reserve keeps interest rates unchanged","category":["Markets"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.30%\n    <\/span><\/a> <!----><\/span><\/span>'s price declined on Wednesday after the Federal Reserve <\/span><\/span>did what many analysts expected it to do and kept interest rates unchanged.","The world's largest cryptocurrency by market capitalization fell 0.8% to $26,977 at 4:35 p.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","\"Recent indicators suggest that economic activity has been expanding at a solid pace,\" the Federal Reserve said in a <a href=\"https:\/\/www.federalreserve.gov\/monetarypolicy\/files\/monetary20230920a1.pdf\" data-v-f87c67ca=\"\">statement<\/a> after the Federal Open Market Committee meeting. \"Job gains have slowed in recent months but remain strong, and the unemployment rate has remained low. Inflation remains elevated.\"","\"The U.S. banking system is sound and resilient,\" it continued. \"Tighter credit conditions for households and businesses are likely to weigh on economic activity, hiring, and inflation. The extent of these effects remains uncertain. The Committee remains highly attentive to inflation risks.\"","Federal Reserve Chair Jerome Powell said the central bank had \"covered a lot of ground\" since starting to tighten monetary policy early last year, with the full effects of past hikes \"yet to be felt.\" He said the FOMC would \"proceed carefully in determining the extent of additional policy firming that may be appropriate.\"&nbsp;","\"We're prepared to raise rates further, if appropriate,\" he said at a press conference. \"And we intend to hold policy at a restrictive level until we're confident that inflation is moving down sustainably toward our objective.\"","YouHodler Chief of Markets Ruslan Lienkha thinks the<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;rate pause is unlikely to ignite bullish sentiment for risk assets.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Even with the same rate until the end of 2023, the yield of fixed income will continue to grow, which will exacerbate the situation for risk assets,\" he told The Block. He added that the current 5.5% target rate is not completely priced in yet, and that the current rate will affect markets for at least several months.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Analysts are optimistic the Federal Reserve will maintain its key rate in the range of 5.25%-5.50% until the end of the year.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"There will be roughly 75 basis points of interest rate cuts in 2024 as the Fed becomes increasingly dovish,\" CoinShares Head of Research James Butterfill told The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">According to Enclave Markets CEO David Wells, affirmations that the rate hike cycle could be ending is a positive signal for markets.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Introducing certainty into the markets with a rate pause is likely a positive signal for overall sentiment and likely will increase appetite for risk assets in the near term,\" he told The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">CoinShares' Butterfill said the effects of high interest rates will increasingly weigh on the economy over the coming months. He added that this will make it harder for the Fed to hold a hawkish monetary policy stance.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Looking a little further ahead, as high-interest rates increasingly weigh on the economy, the prospects for any further rate hikes will diminish, which will be likely supportive for bitcoin,\" he said.&nbsp;<\/span>","(<em data-v-f87c67ca=\"\">Updates price in second paragraph; adds comments from Federal Reserve Chair Jerome Powell.<\/em>)"],"hashtag":["RATE DECISIONS"]}