{"summary":"Ang EigenLayer at mga katulad na \"restaking\" na mga protocol ay kasalukuyang ang pinaka-buzziest investment sa blockchain, ngunit ang Technology ay T walang panganib.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fil\/learn\/restaking-101-what-are-restaking-and-liquid-restaking\/","publishDate":"2024-05-02T16:05:30","id":16418,"type":null,"title":"Ano ang Restaking? Ano ang Liquid Restaking? Ano ang EigenLayer?","category":["Learn"],"content":["Sa wala pang isang taon, ang \"restaking\" ng Ethereum na juggernaut na EigenLayer ay lumamon ng higit sa $16 bilyon sa ether (ETH) na mga deposito – mga digital na asset na ayon sa teorya ay gagamitin upang tumulong sa pag-secure ng mga nagsisimulang Cryptocurrency protocol.","Ang muling pagtatak – ang ideya ng paggamit ng blockchain upang ma-secure ang iba pang app – ay mabilis na naging pinakamalaking bagong trend ng pamumuhunan sa industriya ng Crypto . Ang mga bagong restaking startup ay tila dumarating bawat linggo, at ang buong industriya ng cottage, ang mga \"aktibong na-validate na serbisyo\" at \"liquid restaking\" na mga platform, ay nakakuha ng hype sa kanilang sariling mga pagkuha sa tech.","Bagama't pinuri ng ilan ang muling pagtatanging bilang isang magandang pagkakataon sa pamumuhunan at isang malaking hakbang para sa seguridad ng Crypto , ang iba ay nakikita ito bilang isang mas mapanganib na sugal - isang pamamaraan ng rehypothecation na nangangako ng napakahusay na mga gantimpala na batay sa manipis na mga batayan.","Ang muling pagtatanghal ay ang pinakabagong sagot sa tanong na panseguridad sa puso ng lahat ng bagay sa Crypto: kung paano gamitin ang mga pang-ekonomiyang laro upang protektahan ang mga desentralisadong sistema ng computing","Sa gitna ng lahat ng blockchain ay ang ideya ng \"desentralisasyon\" - kung saan ang malawak na ipinamamahaging network ng mga operator, sa halip na ONE partido, ay kumukuha ng mga transaksyon mula sa mga user, isinusulat ang mga ito sa digital ledger ng chain, at tinitiyak na ang lahat ng iba pang mga operator ay tapat na nag-uulat ng data. .","Kabaligtaran sa mga proof-of-work na blockchain tulad ng Bitcoin, kung saan ang \"mga minero\" ay gumugugol ng kapangyarihan sa pag-compute para KEEP secure ang isang chain, ang mga proof-of-stake blockchain tulad ng Ethereum at Solana ay pinatatakbo ng \"validators\" na \"stake\" currency upang makatulong na patakbuhin ang network.","Read More: Crypto Staking 101: Ano ang Staking?","Ang mga validator ay nakakakuha ng interes bilang gantimpala para sa kanilang trabaho. Kung mas malaki ang kanilang stake, mas marami silang kikitain sa mga reward. Ang stake ay kumikilos din bilang collateral; kung ang isang validator ay sumusubok na magsinungaling sa blockchain o maling pagkaka-configure, isang bahagi ng stake ang babawiin ng network.","Ang eksaktong mekanika sa likod ng staking ay maaaring mag-iba mula sa chain sa chain, ngunit ang mahalagang takeaway pagdating sa staking ay ito: Ang halaga ng pag-atake (basahin ang: draining money from) isang proof-of-stake system ay halos ang halaga ng pera na mayroon. ay nakataya sa pagtatanggol nito. Iyon ang dahilan kung bakit ang Ethereum, sa partikular, ay itinuturing na ligtas: mayroong higit sa $100 bilyong halaga ng ETH na nakataya dito.","Nangangako ang muling pagtatanghal na ilapat ang pang-ekonomiyang larong ito sa halos anumang bagay, na ginagamit ang malalaking numero ng staking sa kasalukuyang mga protocol upang makatulong sa pag-secure ng mga nagsisimulang blockchain apps. Bilang isang pagkakataon sa pamumuhunan, ito ay itinayo bilang isang paraan upang magkaroon ng BIT dagdag na interes mula sa nakasanayang staking.","Ang EigenLayer, ang nangunguna sa muling pagtatanghal ng Ethereum, ay nagbibigay-daan sa mga user na kunin ang ETH na na-stakes nila sa Ethereum at pagkatapos ay i-retake ito gamit ang tinatawag na \"Actively Validated Services,\" o AVSs. Ngayon, halos mga blockchain protocol lang iyon na nagbibigay ng suporta para sa mga solusyon sa pag-scale ng Ethereum .","Naninindigan ang mga tagapagtaguyod ng teknolohiya na ang muling pagtatak ay nakakatulong upang mapabuti ang seguridad ng mas maliliit na blockchain apps dahil maaaring mahirapan silang itaguyod ang kanilang sariling proof-of-stake na mga sistema ng seguridad, dahil ang paggawa nito ay nangangailangan ng malaking kapital at aktibong komunidad.","Sa isang panayam sa CoinDesk noong nakaraang buwan, ipinaliwanag ng tagapagtatag ng EigenLayer na si Sreeram Kannan kung paano ito gumagana sa pamamagitan ng paggamit ng halimbawa ng 100 blockchain protocol na ang bawat isa ay sinigurado ng $1 bilyon na halaga ng stake: Isipin na \"sa halip na ang bawat isa sa mga protocol ay mayroong $1 bilyon na hiwalay na nakataya, mayroong $100 bilyon na karaniwang nakataya sa 100 protocol,\" sabi ni Kannan. \"Upang atakehin ang ONE protocol, ngayon kailangan mo ng $100 bilyon kaysa sa $1 bilyon.\"","Ang mga detalye ay maaaring magmukhang iba sa iba pang mga blockchain, ngunit ang diwa ay pareho. Sa Solana, halimbawa, magagawa ng mga user na i-retake ang SOL na na-stakes nila sa network na iyon para makakuha ng karagdagang interes at para makatulong sa pag-secure ng iba pang app.","Ang muling pagtatangka sa pamamagitan ng isang platform tulad ng EigenLayer ay karaniwang nangangahulugan ng pagdedeposito ng isang ETH (o mga piling ETH derivatives) sa protocol, pag-ikot ng isang operator, at pagkatapos ay pagpili kung aling mga AVS ang ise-secure kapalit ng interes.","Ang isang mas simpleng paraan upang mag-stake ay sa pamamagitan ng mga serbisyo ng liquid restaking tulad ng Puffer, Ether.Fi at Renzo. Ito ang mga middlemen na kumukuha ng mga asset mula sa mga user, nagdedeposito ng mga ito sa EigenLayer at mga katumbas na platform, at nag-aalok ng mga resibo, na tinatawag na \"liquid restaking tokens\" (LRTs), na nakakaipon ng interes at maaaring i-trade sa desentralisadong Finance para makakuha ng mas malaking yield.","Ginagawa ng mga liquid restaking platform ang lahat ng mabigat na pag-aangat ng pag-set up ng software ng operator at pagpili kung aling mga AVS ang gagana. Hinahayaan ng mga LRT ang mga user na madaling pumasok at lumabas sa mga posisyon sa muling pagtatanghal, at nag-aalok sila sa mga user ng kakayahang pataasin ang kanilang leverage sa pamamagitan ng muling pamumuhunan sa mga desentralisadong protocol sa Finance .","Ang mga serbisyo ay sumasalamin sa mga platform tulad ng Lido, ang liquid staking behemoth sa Ethereum na nag-stakes ng mga asset sa ngalan ng mga investor at nag-aalok ng derivative liquid staking token, \"Lido staked ETH\" (stETH), na sumusubaybay sa presyo ng ETH. Sikat na sikat ang SteTH sa desentralisadong Finance, at umaasa ang mga upstart na liquid restaking platform na gayahin ang tagumpay ni Lido sa kanilang mga LRT na nakatuon sa kaginhawahan.","Bagama't tinanggap ng mga mamumuhunan, developer, at venture firm ang restaking, ang ilan ay nag-aalala na ang trend ay ang pinakabagong ticking time bomb ng crypto, isang rehypothecation ng tiwala na tiyak na babagsak.","Itinuturo nila ang multo ng panganib ng contagion - ang ideya na kung ang isang operator ay laslas ng isang AVS, ang epekto ay maaaring umakyat sa buong staking ecosystem, maubos ang halaga ng buong muling pagtatanghal, at mabawasan ang seguridad ng bawat iba pang AVS ang resulta. (Ang EigenLayer ay nagdaragdag ng isang insurance program na tinatawag na \"attributable security\" upang tugunan ang alalahaning ito, ngunit ang mga detalye ay T pa natatapos.)","Sa pagtaas ng mga LRT ay dumarating ang mas malaking takot sa isang malawakang sakuna. Kung sisimulan ng mga protocol ang paggamit ng tiwala ng mga tao sa pamamagitan ng pagpayag sa kanila na mag-stake ng mga token, liquid staking token, at pati na rin ng liquid re staking token, kung gayon ang surface area para sa isang krisis sa rehypothecation ay lalago. Ang ONE paglaslas na kaganapan o depegged na asset ay maaaring magpabagsak ng marami.","Bagama't matagal nang umiral ang mga bersyon ng pinagsama-samang seguridad – lalo na sa Cosmos blockchain ecosystem – ang modernong pagbabalangkas ng \"restaking\" ay nananatiling higit na teorya kaysa sa katotohanan. Ang EigenLayer ay teknikal na ang unang restaking protocol na inilunsad sa mainnet ng Ethereum, ngunit nananatili ito sa limitadong beta. Tumatanggap ang EigenLayer ng mga deposito, ngunit karamihan sa mga pangunahing tampok nito - kabilang ang pag-slash - ay hindi pa umiiral sa oras ng pag-print, at ang mga AVS ay pinapayagan lamang na magrehistro sa programa ngunit T pa maaaring i-deploy.","Read More: EigenLayer, Ang Pinakamalaking Paglulunsad ng Proyekto ng Crypto Ngayong Taon, Nawawala Pa rin ang Mahalagang Pag-andar","Ang tanging insentibo para sa muling pagtatak at pagbabalik ng likido sa ngayon ay ang \"mga puntos,\" na mga bilang ng marka na sinusubaybayan ng EigenLayer at mga protocol ng pagbabalik ng likido na inaasahan ng mga depositor na maiugnay sa mga airdrop sa hinaharap ng mga digital na asset.","Ang mga puntos ay T idinisenyo upang magkaroon ng anumang halaga, ngunit ang mga gumagamit ay nagsimulang bumili at magbenta ng mga ito nang direkta – na nag-aapoy ng isang haka-haka na kabaliwan sa muling pagsasabi na ang ilang pangamba ay T batay sa pang-ekonomiyang katotohanan, at maaaring humantong sa pagkabigo at malalaking pagbebenta sa linya. . Ang EigenLayer at ang liquid restaking protocol na si Renzo ay nagpakita na kung paano ang mga point system ay maaaring magtakda ng hindi makatotohanang mga inaasahan: Ang parehong mga proyekto ay nagdulot ng galit noong nakaraang buwan nang sila ay nagsiwalat ng mga token airdrop na plano na nagtatampok ng mas maliliit na alokasyon para sa mga point-earner kaysa sa inaasahan ng ilang depositor.","ONE napakagandang anghel na mamumuhunan ng mga proyekto ng Solana ang nagsabi sa CoinDesk na siya ay \"hindi pa\" namuhunan sa anumang muling pagtatanging mga koponan para sa ecosystem na iyon. Nang tanungin kung bakit, siya ay tumugon nang bastos: \"Nagdedebate lang kapag muling pumutok ang Crypto.\"","Nag-ambag si Danny Nelson ng pag-uulat","Edited by Bradley Keoun and Nick Baker."],"entity":[{"type":"Ang Pinakamalaking Paglulunsad ng Proyekto ng Crypto Ngayong Taon","content":"ORGANIZATION"},{"type":"$16 bilyon","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"Mahalagang Pag","content":"ORGANIZATION"},{"type":"Kannan","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"mga AVS","content":"ORGANIZATION"},{"type":"Danny Nelson","content":"PERSON"},{"type":"$100","content":"MONEY"},{"type":"pag","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"$1 bilyon","content":"MONEY"},{"type":"\"Actively Validated Services","content":"ORGANIZATION"},{"type":"ng Puffer","content":"PERSON"},{"type":"mga LRT","content":"ORGANIZATION"},{"type":"SteTH sa desentralisadong Finance","content":"ORGANIZATION"},{"type":"Nawawala Pa","content":"ORGANIZATION"},{"type":"mga","content":"ORGANIZATION"},{"type":"ideya","content":"LOCATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"mga pagkuha sa","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Nagdedebate lang","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["EigenLayer","Staking","Restaking","Ethereum","Liquid staking","Lido","Eigenlabs","Filipino"],"authors":["Sam Kessler"]}