{"summary":"While still in beta, Dapper Labs knew its NFL All Day collection would fail to pay the minimum guarantees agreed upon for licensing players&#x27; likenesses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228033\/nfl-crypto-millions-of-dollars-dapper-labs-digital-collectibles","publishDate":"2023-04-25T12:55:20","id":1641,"type":null,"title":"NFL crypto disaster: Dapper Labs football collection missed its mark","category":["METAVERSE & NFT"],"content":["Following the meteoric success of NBA Top Shot, the crypto-startup which created the sports-themed digital collectibles was eager for a repeat.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBack in 2021, <span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/linked\/146037\/dapper-labs-unveils-725-million-ecosystem-fund-for-flow-blockchain\" data-v-f87c67ca=\"\">Dapper Labs<\/a><\/span> inked a deal with both the NFL and OneTeam Partners, a marketing joint-venture&nbsp; founded in part by the NFL Players Association, or NFLPA. The plan was simple: replicate NBA Top Shot’s success by creating and selling a non-fungible token, or NFT, collection using video clips from an even more popular professional sports league, the NFL.","<span data-v-f87c67ca=\"\">At its zenith, NBA Top Shot generated<\/span><span data-v-f87c67ca=\"\"> sales revenues of $224 million in February 2021 before plummeting exactly one year to $47.6 million, according to CryptoSlam! Then, by February of this year, with the entire digital assets market in the grips of a prolonged bear market, NBA Top Shot collected a mere $2.9 million in sales, also according to CryptoSlam!.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">By the time the NFL deal came together and the football-themed digital collectibles known as NFL All Day became available to a limited group of individuals during a soft launch at the end of 2021, it was already apparent to Dapper executives they had overestimated revenue and would fail to achieve the minimum guaranteed requirements it had agreed to pay OneTeam Partners, according to two people familiar with the matter.<\/span>","<span data-v-f87c67ca=\"\">Not only would the collection fall short of expectations, <a href=\"https:\/\/nflallday.com\/\" data-v-f87c67ca=\"\">NFL All Day<\/a> was on pace to come up “hundreds of millions of dollars” short, one of the people said. Dapper attempted to bring OneTeam Partners back to the negotiating table, but the joint-venture instead threatened to sue at one point, the two people said. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Dapper and OneTeam fell into a protracted and heated negotiation which lasted months, the two people also said. Amid a significantly deteriorated NFT market the two sides eventually agreed to new terms, one of the people said. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>Dapper Labs didn't immediately respond to a request for comment. OneTeam Partners also did not immediately respond.<b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/b>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">NBA Top Shot vs. NFL All Day sales volumes: The Block Research<\/span><\/em>","<span data-v-f87c67ca=\"\">Even with superstar Kansas City Chiefs quarterback Patrick Mahomes promoting the collection, the NFTs failed to take off.&nbsp; NFL <\/span><span data-v-f87c67ca=\"\">All Day not only fell far below expectations, it also came up short attracting new consumers.&nbsp;<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/NFLALLDAY?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\">NFL All Day’s best month of sales<\/a> came a month after last year’s August launch and right as the NFL season kicked off. The collection fetched $14.3 million in September 2022, according to CryptoSlam! By January, the last full month of the NFL season, volume had dropped by more than 75% to $3.5 million, also according to CryptoSlam! <\/span>","<span data-v-f87c67ca=\"\">Unfortunately for Dapper, when examining the digital wallets which purchased NFL All Day NFTs, the company discovered that nearly all of the wallets had also bought NBA Top Shots, demonstrating that the company had barely grown its customer base with the football-themed collection, a person familiar with the matter said. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Dapper Labs, like many of its peers in the crypto and blockchain space, has struggled in <a href=\"https:\/\/www.theblock.co\/post\/215888\/nba-top-shot-ceos-decadent-lifestyle-public-shaming-led-to-toxic-culture-as-dapper-flails\" data-v-f87c67ca=\"\">recent months<\/a> and as a result has had to lay off staff accumulated during the bull run that helped drive NBA Top Shot sales. Dapper Labs was once valued at $7.6 billion.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"zenith","content":"ORGANIZATION"},{"type":"$7.6 billion","content":"MONEY"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"$3.5 million","content":"MONEY"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"“hundreds of millions of dollars","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Patrick Mahomes","content":"PERSON"},{"type":"NFL","content":"ORGANIZATION"},{"type":"OneTeam Partners","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"NBA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Kansas City Chiefs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"NFL Players Association","content":"ORGANIZATION"},{"type":"$14.3 million","content":"MONEY"},{"type":"$2.9 million","content":"MONEY"},{"type":"NFLPA","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"$224 million","content":"MONEY"},{"type":"$47.6 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}