{"summary":"Magazines are powerful when they spark dialogue about what’s happening now and could happen in the future. That’s Consensus all over, so we’re renaming Layer 2 after CoinDesk’s annual event.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/05\/introducing-consensus-magazine-putting-web3-in-perspective\/","publishDate":"2022-12-05T15:30:41","id":16428,"type":null,"title":"Introducing Consensus Magazine: Putting Web3 in Perspective","category":["Consensus Magazine"],"content":["As of today, CoinDesk’s digital magazine – formerly known as Layer 2 – will be renamed Consensus Magazine.","Last December we launched Layer 2 as a venue to explore crypto, blockchain and Web3’s big themes: the reinvention of money, the decentralization of the internet, the re-ordering of organizations around trustless collaboration (to name a few). We called it Layer 2 (normally used to describe supplements to a blockchain’s base layer) because we conceived it as a second layer to what we were doing in the newsroom. CoinDesk has long been a leading source of crypto news. Layer 2 aimed to build on the daily headlines, supplying context, explanation, opinion and investigation.","The need for such content has never been more acute. In the last 12 months, we’ve seen crypto and Web3 seep ever more into mainstream conversation. It has penetrated America’s power centers. NFTs (non-fungible tokens) are now minted by actors, athletes and musicians, while franchises such as Bored Ape Yacht Club are taken seriously in Hollywood. Central banks are releasing digital currencies, spurred by monetary competition from bitcoin and ether. Wall Street banks are offering custody and trading services, hoping to get a cut of the action. Washington, D.C., which for a long time largely avoided crypto, has finally stepped up to regulate the industry, and take its money.","At the same time, we’ve also witnessed the ugly side of the blockchain revolution. Names including Terra, Celsius Network, Three Arrows Capital and, not least of all, FTX have passed into the same notorious lexicon as Lehman, Enron and MF Global. Crypto’s reputation is once more in the toilet in the financial press, especially among skeptics who never gave it a chance anyway. Trillions in value has been lost, probably setting back the cause by several years.","It’s a mixed and complicated picture: a lot of good and too much bad. Crypto is an industry with much promise that’s sullied by frequent controversy, incompetence and malfeasance. (Sam Bankman-Fried’s FTX falls squarely in the last category.) But it’s an industry that deserves explaining and considering. Whatever the fallout from FTX, there are still millions of developers, asset holders and observers out there who believe in Web3 and want to understand its implications. Web3 offers solutions for the future even if it’s not always good at enunciating or proving them.","Also, FTX showed why journalism still matters: CoinDesk’s early November story about Alameda’s dodgy balance sheet, which set off the unraveling, is a riposte to all those who said the best reporting and analysis these days comes from vigilantes with anonymous Twitter accounts. At CoinDesk we’re never afraid to uncover unsavory aspects of what increasingly powerful actors are doing.","So why the name change? Because a magazine at its best is a conversation: a place where people can offer and debate ideas. Magazines are powerful when they spark dialogue about what’s happening now and could happen in the future. And that’s Consensus, CoinDesk’s annual event, all over. It’s where the biggest conversations in Web3 happen. Consensus Magazine aims to be the place where some of those conversations begin, whether it’s in features by our writers, in interviews with leading figures or in opinion pieces that tackle the latest scandals and triumphs.","Like Layer 2, Consensus Magazine is partly periodical, partly ongoing analysis. It’s made up of monthly Theme Weeks devoted to crypto and Web3 topics (such as our marquee Most Influential list, which we revealed today) as well as daily commentary. We’re here to explore the big themes in print and on TV (putting them on the stage in Austin, Texas, in April) and to offer commentary you don’t find anywhere else (like describing SBF for what he really is).","We have even more plans for the Consensus Magazine experience using our DESK social token. Stay tuned for more news on that soon.","We hope you enjoy our new look and that you, too, will want to be part of what’s next. None of us knows what the future holds. But we are steadfast in our belief that peer-to-peer, decentralized technologies will be part of it and it’s on all of us to be paying attention."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"Hollywood","content":"LOCATION"},{"type":"Enron","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Consensus Magazine","content":"ORGANIZATION"},{"type":"MF Global","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Lehman","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["Consensus 2023","Opinion"],"authors":["Ben Schiller"]}