{"summary":"The cryptocurrency is now trading below the average spot ETF purchase price of about $58K, and this could trigger liquidations, the bank said in a report.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/01\/bitcoin-could-drop-further-to-as-low-as-50k-standard-chartered-says\/","publishDate":"2024-05-01T14:37:27","id":16421,"type":null,"title":"Bitcoin Could Drop Further to as Low as $50K, Standard Chartered Says","category":["Finance"],"content":["Bitcoin’s (BTC) breakdown through the $60K technical level opens the way for another move lower to the $50K-$52K range, investment bank Standard Chartered said in emailed comments on Wednesday.","The driver of the move lower seems to be a combination of crypto specific factors and macro influences, the bank said. Bitcoin was trading 6% lower at around $57,200 at publication time.","There have now been five consecutive days of outflows from U.S. spot bitcoin exchange-traded funds (ETFs), the bank noted, and BTC is currently trading below the average ETF purchase price of about $58K.\n\n“This means that more than half of the spot ETF positions are under water and so the risk of liquidation of some of them must be considered as well,” analyst Geoff Kendrick wrote.","The bank notes that headlines around the Hong Kong spot ETF launch were also poor, as attention was focussed on the turnover volume of $11 million “rather than the net asset position of the new ETFs which was pretty good.”\n\nRisk assets such as cryptocurrencies, which thrive on liquidity, are also facing increasing macro headwinds, the bank said. It noted that broader liquidity measures in the U.S have deteriorated sharply since mid-April.\n\nThe bank advises buying bitcoin if it reaches the $50K-$52K range or if U.S. CPI on the 15th, a measure of inflation, is “friendly.”\n\nRead more: Bitcoin ETF Slowdown Is a Short-Term Pause Not the Beginning of a Negative Trend: Bernstein","Edited by Aoyon Ashraf."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"$57,200","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$11 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"mid-April","content":"DATE"},{"type":"Bernstein","content":"PERSON"},{"type":"$58K","content":"MONEY"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"Geoff Kendrick","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$50K","content":"MONEY"},{"type":"$60K","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$52K","content":"MONEY"},{"type":"Standard Chartered","content":"ORGANIZATION"},{"type":"15th","content":"DATE"}],"hashtag":["Bitcoin","Markets","Standard chartered","Analysts"],"authors":["Will Canny"]}