{"summary":"Twitter has filed a lawsuit against Elon Musk for failing to follow through with the billionaire entrepreneur&#x27;s proposed $44 billion acquisition. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157225\/twitter-sues-elon-musk-over-44-billion-acquisition-dispute","publishDate":"2022-07-12T17:28:14","id":1642,"type":null,"title":"Twitter sues Elon Musk over $44 billion acquisition dispute","category":["COMPANIES"],"content":["Twitter has sued Elon Musk to compel him to buy the platform for $44 billion, according to<a href=\"https:\/\/www.documentcloud.org\/documents\/22084453-twittermuskcomplaint\" data-v-f87c67ca=\"\"> court documents<\/a> made public on Tuesday evening.","Last week, Musk <a href=\"https:\/\/www.theblock.co\/post\/156722\/elon-musk-aims-to-terminate-44-billion-twitter-deal\" data-v-f87c67ca=\"\">pulled out<\/a> of the agreement, stating concern that there are bot and spam accounts on the platform. &nbsp;As a result, Twitter hired Watchell, Lipton, Rosen &amp; Katz LLP in preparation for the lawsuit, which was filed in the US state of Delaware.","\"Having mounted a public spectacle to put Twitter in play, and having proposed and then signed a seller-friendly merger agreement, Musk apparently believes that he — unlike every other party subject to Delaware contract law — is free to change his mind, trash the company, disrupt its operations, destroy stockholder value, and walk away,\" the lawsuit reads.","The filing later states:","\"Twitter is entitled to specific performance of defendants’ obligations under the merger agreement and to secure for Twitter stockholders the benefit of Musk’s bargain. Musk and his entities should be enjoined from further breaches, ordered to comply with their obligations to work toward satisfying the few closing conditions, and ordered to close upon satisfaction of those conditions.\"","Yesterday, <a href=\"https:\/\/www.theblock.co\/post\/156996\/twitter-declares-musk-deal-termination-bid-invalid-in-new-letter\" data-v-f87c67ca=\"\">a letter<\/a> on behalf of Twitter highlighted that Musk's move to terminate the deal is \"invalid and wrongful.\"&nbsp;","The 62-page lawsuit details Musk's ongoing relationship with the company.","\"Rather than bear the cost of the market downturn, as the merger agreement requires, Musk wants to shift it to Twitter’s stockholders,\" it states. \"This is in keeping with the tactics Musk has deployed against Twitter and its stockholders since earlier this year, when he started amassing an undisclosed stake in the company and continued to grow his position without required notification.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Delaware","content":"LOCATION"},{"type":"Lipton","content":"LOCATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"Watchell","content":"ORGANIZATION"},{"type":"Rosen &amp; Katz LLP","content":"ORGANIZATION"}],"hashtag":["ELON MUSK","TWITTER"],"authors":["Anushree Dave","The Block"]}