{"summary":"The top three spot bitcoin ETFs accounted for the lion’s share of volume as day three of trading concluded on Tuesday.\nThe day’s total volume finished at $1.8 billion, well below the $3 billion seen last Friday. ","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272945\/grayscale-blackrock-and-fidelity-dominate-spot-etf-market-with-nearly-90-of-volume-on-third-day-of-trading","publishDate":"2024-01-16T14:12:02","id":1643,"type":null,"title":"Grayscale, BlackRock and Fidelity dominate spot ETF market with nearly 90% of volume on third day of trading","category":["Markets"],"content":["In a third day of trading, the top three spot bitcoin ETFs by trading volume have positioned themselves heads and shoulders above the rest by nabbing just about 90% of the burgeoning market.&nbsp;","Funds offered by Grayscale, BlackRock and Fidelity are the clear leaders among the 11 spot bitcoin ETFs currently trading. After gaining approval, the new instruments began trading <a href=\"https:\/\/www.theblock.co\/post\/272460\/day-two-of-spot-bitcoin-etf-trading-tops-3-1-billion-as-grayscale-and-blackrock-lead\" data-v-f87c67ca=\"\">last week.<\/a>","As Tuesday trading came to a close, the three top funds had generated about $1.6 billion of the $1.8 billion of total trading volume, according to data from Yahoo Finance compiled by The Block.","The third day of trading finished well below the $3.1 billion seen on Friday. On last Thursday, the first day of trading, the total volume came in at $4.6 billion.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/bitcoin-spot-etf-market-share\/embed\" title=\"Spot Bitcoin ETF Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While Grayscale has been the clear leader in terms of volume among the new crypto-based instruments, the firm's ETF, which is a conversion of its flagship flagship GBTC fund, has experienced considerable outflows, according to Bloomberg Intelligence senior ETF analyst Eric Balchunas.&nbsp;","Grayscale's spot bitcoin ETF has shed more than $500 million since it started trading last week, according to Balchunas, who <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1747302471800684712\" data-v-f87c67ca=\"\">posted data<\/a> to the social media platform X on Tuesday. BlackRock's ETF is the \"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">most likely to overtake\" Grayscale <\/span><span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">as \"Liquidity King,\" he also said.<\/span>","<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">The funds offered by BlackRock and Fidelity have, in comparison, seen inflows over $400 million since they began trading.<\/span>","Overall, Balchunas said trading activity for the new funds was healthy. Cumulative volume over the first three days is now over $9.5 billion.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"About the same pattern dropoff rate as $BITO (which again was the most successful organic launch in ETF history),\" Balchunas added.","(<em data-v-f87c67ca=\"\">Updates with figures from market closing.<\/em>)&nbsp;"],"hashtag":["SPOT BITCOIN ETF"]}