{"summary":"We shouldn't ignore the risks that stablecoins potentially pose to the financial system, says our columnist.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2021\/07\/01\/stablecoins-risk-a-rerun-of-financial-crises-past\/","publishDate":"2021-07-01T20:07:26","id":16434,"type":null,"title":"Stablecoins Risk a Rerun of Financial Crises Past","category":["Policy"],"content":["","After all the buzz around bitcoin becoming legal tender in El Salvador, June ended with another surprising twist in the money world. In a speech, Randal K. Quarles, none other than the vice chair for Supervision of the Federal Reserve System, praised “stablecoins” and cast doubt on central bank digital currencies (CBDC).","","","In contrast with the more cautious view advocated by another board member a month ago, Quarles hinted that, with improvements in the payments system and “properly structured stablecoins,” digital dollars may well be “superfluous.” Time to ditch CBDC plans and go all in on “stablecoins”? ","","","Hold your horses!","","","“Stablecoin” is nothing but a fancy name for one of two assets that have existed for decades: electronic money or shares in money market funds. And both can only be stable with government support, either through regulation and supervision or through bailouts (I’ll come back to this shortly). To paint “stablecoins” as a product of private ingenuity that is superior to a public option for digital money fails to consider the recent history of monetary and financial crises.","","","The basic idea behind stablecoins is simple: You find someone willing to receive your dull (although perfectly stable) dollars in exchange for something more exciting; an asset (the “coin”) that is issued digitally may work to make some payments, and can also earn you some interest in the meantime.","","","More than that, the receiver of your dollars (and issuer of the “stablecoin”) promises you that it stands ready to exchange the “stablecoins” back to dollars on a 1:1 basis anytime you want, no losses, hassle-free. ","","","Sounds great, right? But there’s a catch.","","","The promise can only work if the stablecoin issuer properly manages the reserves, which are the dollars it received from all the people buying the stablecoins. Imagine that you pay me $100 for some coins I’ve just launched, say, 100 sambacoins. You can use the coins to stream newly released Brazilian music and, if you don’t spend them, I’ll exchange the sambacoins back to dollars at once.","","","What should I do with the $100 to avoid breaking the promise of exchanging the sambacoins back to dollars at any time? I could keep the $100 in cash at a safe place or deposited in a checking account, ready to be withdrawn when needed.","","","If the sambacoin is successful, and I start having more buyers, I could invest the dollars in short-term Treasurys, trusting that not all buyers will come to exchange the sambacoins back to dollars at the same time. Because Treasury bonds are typically stable in value and liquid, I could earn some (small) return and quickly sell the treasuries to meet payments when people wanted to sell me back their sambacoins. So far, so good.","","","What if I’m feeling bold and want to make higher returns from the sambacoin reserves? I could invest the reserve dollars in other crypto assets and use them on a decentralized finance (DeFi) lending platform to earn eye-popping gains. All good, unless I start having trouble to get out of these investments and convert them back into dollars, a situation that would leave my sambacoin reserves depleted.","","","At this point, I’ll not be able to buy back your 100 sambacoins for $100. Maybe I can give you $20 right away and, with luck, $20 more next week. That’s also the moment when you’ll probably start urging the government to step in and regulate stablecoin issuers – especially those using algorithms to keep the coin “stable.”","","","What are the lessons here? First, no money substitute can mimic the stability of cash – either dollar bills, as they exist today, or digital dollars, as they’ll exist in the future. Cash may not come with bells and whistles but, when issued by a credible central bank, its value is stable over time, meeting the need of those who prefer safety to profit. That’s why stablecoins can only be truly stable if they are 100% backed by – you got it! – cash.","","","Second, government’s support, in the form of regulation and supervision, is crucial for the success of privately issued stablecoins. Just look at the regulated stablecoins that already exist and have a prominent name outside the United States: electronic money.","","","As I said in a previous column, from the European Union to Brazil, e-money issuers work like narrow banks. They are legally required to keep the cash they receive from their clients safeguarded or insured so that e-money balances (kept in prepaid cards, for example) can always be converted back to cash with no loss of value. As they are licensed and supervised entities, customers know that, aside from gross regulatory failure, their e-money is safe.","","","In the United States, because no federal statute regulating e-money exists, stablecoin issuers are subject to state money transmitter laws and may end up regulated by 50 different regulators. The problem is that rules and regulations about segregation of clients’ funds and integrity of assets kept in reserve aren’t uniform or consistently enforced.","","","In practice, stablecoin issuers in the United States are taking advantage of the regulatory morass to escape accountability. Stablecoin holders have to blindly trust the issuer or try to find and examine its financial disclosures by themselves. Recent examples of disclosures made by stablecoin issuers have been concerning at best and disturbing at worst.","","","Third, private promises of stable money that go unchecked end badly – and often require the use of taxpayer money to clean up the mess. The history of money market funds in the United States is illustrative.","","","These funds were created in the 1970s to work around interest-rate ceilings on demand deposits that were imposed by the infamous “Regulation Q.” Balances in money market funds were believed to be as safe as insured deposits but with the advantage of earning a higher interest, which was especially enticing when inflation and interest rates were rising.","","","The assumption was that with good management, shares in these funds would always maintain a stable value of $1 per share. What seemed to be a brilliant idea ended up fueling the shadow banking system and leading to the 2007-2008 global financial crisis. To avoid even greater instability, the Federal Reserve had to backstop money market funds through the crisis and again during the coronavirus pandemic. The lessons are thus clear: Well-managed and properly regulated stablecoins may be useful for certain purposes and players, like those operating in the DeFi world. But stablecoins will never be as stable as dollars, physical or digital – and may even require a bailout when panic over broken promises spreads.",""],"entity":[{"type":"$20","content":"MONEY"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"Randal K. Quarles","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"$1","content":"MONEY"},{"type":"2007","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"1970s","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"Quarles","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Federal Reserve System","content":"ORGANIZATION"},{"type":") dollars","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"United States","content":"LOCATION"}],"hashtag":["Opinion","central bank digital currency","Stablecoins","Randal K. Quarles"],"authors":["Marcelo M. Prates"]}