{"summary":"Patterns of illicit activity involving groups of bitcoin nodes and chains of transactions are described in a research paper by Elliptic and MIT-IBM Watson AI Lab.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/01\/blockchain-sleuth-elliptic-explores-ai-and-anti-money-laundering-using-200m-bitcoin-transactions\/","publishDate":"2024-05-01T13:00:00","id":16433,"type":null,"title":"Blockchain Sleuth Elliptic Explores AI and Anti-Money Laundering Using 200M Bitcoin Transactions","category":["Technology"],"content":["Blockchain analytics firm Elliptic said it detected potential money laundering patterns on the Bitcoin blockchain after training an artificial intelligence (AI) model using a record 200 million transactions.","The work is an extension of a program carried out back in 2019 that used a dataset of only 200,000 transactions. The much larger \"Elliptic2\" dataset made use of 122,000 labeled \"subgraphs,\" groups of connected nodes and chains of transactions known to have links to illicit activity.","AI becomes more insightful the larger the dataset available to train the machine-learning algorithms, and cryptocurrencies like bitcoin offer a plentiful supply of transparent transaction data on the blockchain. Elliptic used the transactions for learning the set of \"shapes\" that money laundering exhibits in cryptocurrency and accurately classifying new criminal activity, Elliptic said in a paper co-authored with researchers from the MIT-IBM Watson AI Lab.","\"The money laundering techniques identified by the model have been identified because they are prevalent in bitcoin,\" Elliptic co-founder Tom Robinson said in an email. \"Crypto laundering practices will evolve over time as they cease being effective, but an advantage of an AI\/deep learning approach is that new money laundering patterns are identified automatically as they emerge.\"","Many of the suspicious subgraphs were found to contain what are known as \"peeling chains,\" where a user sends or \"peels\" cryptocurrency to a destination address, while the remainder is sent to another address under the user's control. This happens repeatedly to form a peeling chain.","\"In traditional finance this is known as 'smurfing,' where large amounts of cash are structured into multiple small transactions, to keep them under regulatory reporting limits and avoid detection,\" Elliptic said in the paper.","Another commonly occurring technique was the use of so-called \"nested services,\" businesses that move funds through accounts at larger cryptocurrency exchanges, sometimes without the awareness or approval of the exchange. A nested service might receive a deposit from one of their customers into a cryptocurrency address, and then forward the funds to their deposit address at an exchange.","\"Nested services are known to frequently have less stringent customer due diligence checks than the cryptocurrency exchanges they utilize, or sometimes have no such anti-money laundering checks at all, resulting in their misuse for cryptocurrency laundering - potentially causing them to feature in subgraphs deemed by the model as suspicious,\" said Elliptic.","Edited by Sheldon Reback."],"entity":[{"type":"Elliptic","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"IBM Watson","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Tom Robinson","content":"PERSON"}],"hashtag":["Elliptic","AI","Money Laundering","Crime"],"authors":["Ian Allison"]}