{"summary":"Despite the recent bounce, the correction isn't over, said one technical analyst, expecting bitcoin to fall to the low-mid $50,000 area before rallying to new all-time highs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/06\/bitcoin-slips-to-63k-as-crypto-market-faces-more-us-regulatory-pressure\/","publishDate":"2024-05-06T20:39:07","id":16438,"type":null,"title":"Bitcoin Slips to $63K as Crypto Market Faces More U.S. Regulatory Pressure","category":["Markets"],"content":["The crypto rally paused on Monday during U.S. trading hours with bitcoin (BTC) slipping back to near $63,300 as U.S. regulators ratcheted up pressure on crypto companies.","A move to above $65,000 early Monday quickly reversed and prices were pressured further after popular brokerage Robinhood (HOOD) disclosed its crypto arm received a Wells Notice over the weekend from the U.S. Securities and Exchange Commission (SEC), a move that often foreshadows an enforcement action against a company.","The pullback has been shallow, though, with most crypto assets firmly above last week's low. BTC declined 1.5% over the past 24 hours but was still up over 10% from Wednesday.","Alternative cryptocurrencies performed mixed, with ether (ETH), dogecoin (DOGE), shiba inu (SHIB) and layer-2 network Polygon's native token (MATIC) sinking 2%-3% during the day, while solana (SOL) and Ripple-adjacent XRP showed relative strength advancing 4%-6%. The broader market gauge CoinDesk 20 Index (CD20) was down 0.3%.","Despite the halt in the rally, crypto hedge fund QCP Capital observed renewed demand for bitcoin call options for September with a strike prices of $75,000 and $100,000, underscoring the increased optimism that BTC will climb to higher prices over the next few months.","\"We are seeing some bullish follow-through in volatility and [funding] rates following the reversal bounce from Friday and into the weekend,\" crypto hedge fund QCP Capital said in a Monday market update.","Perhaps fueling the quick recovery from last week's lows were rumors about broadening access to the newly listed Hong Kong spot bitcoin and ether ETFs for Chinese investors.","Richard Byworth, managing partner of Syzcapital, said in an X post that \"there's talk\" in Hong Kong about adding the crypto products to the so-called Stock Connect facility, which would allow qualified mainland Chinese investors to access eligible shares listed in Hong Kong.","In theory, the move would have a significant impact opening the floodgates of Chinese money seeking alternative assets amid the real estate and stock market rout.","However, Chinese investors have been barred from crypto ETFs and there wasn't any official communication about changing the rules.","Read more: Hong Kong-Listed Bitcoin ETFs Could Unlock Up to $25B in Demand, Crypto Firm Says","Bitcoin ended last week on a bullish tone, recovering swiftly from its pullback to $56,000. John Glover, chief investment officer at crypto lender Ledn, said there's still possibility for a breakdown to lower prices before ending its correction from March's all-time high of $73,000.","\"Although the dip to $56,500 may have completed the correction, I still expect to see a price of $52-55,000 before wave 4 completes,\" Glover said, referring to the Elliot Wave theory, a technical analysis that assumes that asset prices move in repetitive wave patterns.","The theory alleges that price trends develop in five stages, of which waves 1, 3, and 5 are impulse waves representing the main trend, while waves 2 and 4 are retracements between the impulsive price action.","\"Once the [corrective] wave is completed, I expect that the Wave 5 push to circa $92,000 will ensue,\" he concluded.","Edited by Stephen Alpher."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"$52","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"$63,300","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"weekend","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"John Glover","content":"PERSON"},{"type":"0.3%","content":"PERCENT"},{"type":"Glover","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$65,000","content":"MONEY"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"$73,000","content":"MONEY"},{"type":"1.5%","content":"PERCENT"},{"type":"$25B","content":"MONEY"},{"type":"$56,000","content":"MONEY"},{"type":"$56,500","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"$92,000","content":"MONEY"},{"type":"Richard Byworth","content":"PERSON"}],"hashtag":["Market Wrap","Bitcoin","Ether","Robinhood"],"authors":["Krisztian Sandor"]}