{"summary":"Estimates indicate that the next bitcoin mining difficulty update on Sunday will be around a 10% jump.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201203\/the-storm-has-passed-but-bitcoin-mining-difficulty-is-about-to-blow-through-the-roof","publishDate":"2023-01-14T20:05:20","id":1643,"type":null,"title":"The storm has passed, but bitcoin mining difficulty is about to blow through the roof","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miners are bracing for a massive jump in difficulty this weekend.","The increase could land somewhere around 10%, according to estimates from BTC.com, Bitrawr, Luxor and Braiins. Numbers could still change between now and Sunday, but estimates strongly indicate a sharp increase.","Difficulty refers to the complexity of the computational process behind mining, and it adjusts roughly every two weeks (or every 2,016 blocks), based on the average block time.","It fell <a href=\"https:\/\/www.theblock.co\/post\/198932\/bitcoin-mining-difficulty-down-3-6-while-revenue-pops-0-9-in-december\" data-v-f87c67ca=\"\">3.6% in the last update<\/a>, following a winter storm that led a number of miners to <a href=\"https:\/\/www.theblock.co\/post\/197800\/crypto-miners-bracing-for-impact-from-brutal-winter-storm\" data-v-f87c67ca=\"\">power down<\/a>, either due to price incentives or requests from grid operators.","Now a lot of that hashrate seems to have gone back online, along with newly deployed and more efficient machines.","\"It’s a combination of the institutional miners scaling a bit over that longer time period, and some positive variance,\" said Daniel Frumkin, director of research at Braiins.","Companies like Marathon and Hive Blockchain have been continually deploying efficient machines like S19 XPs and blockscale BuzzMiners, he said.","\"But due to the winter storm, we wouldn’t have seen any of that in the previous epoch, meaning that we are now seeing ~3 weeks of deployments rather than just one,\" he said.","Additionally, \"there’s probably a good bit of positive <a href=\"https:\/\/www.theblock.co\/post\/195531\/bitcoin-mining-jumps-3-27-after-substantial-dip-what-does-luck-have-to-do-with-it\" data-v-f87c67ca=\"\">luck<\/a> by pools in aggregate that’s contributing to this large adjustment,\" he said.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to the most recent round of operational updates from December, Hive installed 1,423 machines powered by Intel Blockscale, while Marathon said 12,000 S19 XPs would be energized in the coming month. Cipher Mining has been quickly ramping up production, increasing hashrate by 40% last month. Riot, which deployed 16,128 S19-series miners in December, said the storm knocked about 2.5 EH\/s offline.","Riot CEO Jason Les told The Block that the hashrate has been coming back online.&nbsp;&nbsp;","While the past week has been more bullish for the industry, with bitcoin now rallying above $20,000 and shares of public miners increasing, they are still facing tough economics.","\"We're not seeing any change in the energy costs associated with mining ... There's not a great amount of profitability unless you've got the most efficient miner,\" said Anthony Power, an accountant and mining analyst who puts together a <a href=\"https:\/\/compassmining.io\/education\/reflecting-on-argo-blockchains-bull-run\/\" data-v-f87c67ca=\"\">monthly roundup<\/a>. \"If you haven't got those you're not probably not making sufficient money to cover your costs.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Braiins","content":"PERSON"},{"type":"Marathon","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"3.6%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"Jason Les","content":"PERSON"},{"type":"Anthony Power","content":"PERSON"},{"type":"$20,000","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Intel Blockscale","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Daniel Frumkin","content":"PERSON"},{"type":"Bitrawr","content":"LOCATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}