{"summary":"The SEC is asking crypto and fintech firms to do the impossible. Only Congress can stop that, Marcelo M. Prates writes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/01\/the-catch-22-of-us-crypto-regulation\/","publishDate":"2024-03-01T21:05:55","id":16441,"type":null,"title":"The Catch-22 of U.S. Crypto Regulation","category":["Consensus Magazine"],"content":["The current state of crypto regulation is a “Catch-22,” a series of absurd and contradictory rules and requirements that are impossible to follow.","Marcelo M. Prates is a central bank lawyer and researcher.","In Joseph Heller’s famous novel, a Catch-22 refers to a stipulation that pilots seeking to be excused from their combat duties could file a request stating they are insane. With one catch: filing the request implies that the petitioner is sane and, thus, ineligible to be excused.","In 2024 America, the SEC’s “come in and register” approach is a Catch-22 for crypto.","SEC Chair Gary Gensler often says that registering with the SEC to comply with securities regulation is straightforward, “it’s just a form on our website.” And crypto issuers and exchanges “are just choosing not to do it” despite knowing how to do it. The SEC chair makes it sound like crypto firms have been unreasonably (if not unlawfully) stubborn in not filing the required registrations in the face of a welcoming SEC. This characterization hides a catch.","Even if we assume, as Gensler does, that all crypto tokens are securities and should be registered with the SEC — which is debatable — and that the registration process is simple — which is not — successful registration would lead to a dead end. Registered crypto tokens, like any registered securities, could only be traded on registered exchanges through registered broker-dealers. But that’s impossible today.","The Financial Industry Regulatory Authority (FINRA), a self-regulatory organization that oversees broker-dealers, has approved just a few institutions to deal with crypto tokens. Among these institutions, only one is a Special Purpose Broker-Dealer, Prometheum, which remains inactive and hasn’t yet listed a token to trade almost one year after the approval.","See also: Aspiring Crypto Bank's Plight Shows Binance's Issues","The SEC, moreover, hasn’t allowed any currently registered exchange or broker-dealer to list, custody or trade crypto tokens. The SEC’s view is that any registered institution willing to work with crypto tokens “could not deal in, effect transactions in, maintain custody of, or operate an alternative trading system for traditional securities.”","Further, virtually no crypto tokens have been registered with the SEC so far. And that’s the Catch-22: issuers won’t register their crypto tokens before they can find registered exchanges and broker-dealers that can work with them, and registered exchanges and broker-dealers won’t start working with crypto tokens until they see enough tokens registered to make the business model economically viable.","The reality for fintech isn’t much brighter. Because of the lack of a specific federal licensing framework, fintech firms using technology to offer more efficient and cost-effective financial products and services — from debit cards and loans to mobile payments and remittances — must partner with banks. This fintech-banking partnership is known as banking-as-a-service or BaaS.","Even when the fintech startup is a licensed money transmitter at the state level, it must partner with a bank to make and receive payments in dollars since only banks can directly access the payments system. As a result, licensed banks in the U.S. end up serving as gatekeepers to financial innovation, as new ideas in the financial system have to be implemented through them.","The Office of the Comptroller of the Currency, the national banking regulator, has been increasingly wary of BaaS arrangements, making it more difficult and costly for banks to keep “third-party relationships” with fintech firms. Regulators say they’re concerned with how fintech partners onboard customers, monitor transactions and handle sensitive information, as well as how banks manage these risks to ensure compliance with the applicable rules and regulations.","Because of this hardened regulatory stance and the enforcement actions and fines that may follow, many banks are “derisking” by reducing or outright ending fintech partnerships. At the same time, federal regulators aren’t open to crafting a licensing regime for fintech or allowing non-banks to directly access the payments system by having a Fed master account.","There we have another Catch-22: in the present regulatory environment, fintech can only survive in the U.S. with the active collaboration of banks, but federal regulators don’t want banks to partner with fintech companies. What can be done?","See also: In Lejilex vs. SEC, Crypto Goes on Offense in the Courts | Opinion","Only Congress can solve these puzzles. State legislators have been active on both fronts, designing bespoke regulatory frameworks for crypto, like the BitLicense in New York or the Digital Financial Assets Law in California, and fintech, like the special purpose depository institution (SPDI) charter in Wyoming","But none of these state laws and regimes relieve state-compliant institutions from facing troubles at the federal level. Just ask Coinbase, which holds a BitLicense but is being sued by the SEC “for operating as an unregistered securities exchange, broker, and clearing agency,” or Custodia, a chartered SPDI that wasn’t allowed to hold a Fed master account and thus cannot directly offer basic payment services.","Congress must act to keep financial innovation alive. Enacting tailored licensing and regulatory federal frameworks for crypto and fintech is crucial for holding the U.S. capital and financial markets sound, competitive, and inclusive. To paraphrase Heller, crypto and fintech companies should embrace the idea that they’re “going to live forever or die in the attempt.”"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Digital Financial Assets Law","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Financial Industry Regulatory Authority (FINRA","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Heller","content":"PERSON"},{"type":"22","content":"DATE"},{"type":"Joseph Heller","content":"PERSON"},{"type":"Aspiring Crypto Bank's Plight Shows Binance","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Custodia","content":"LOCATION"}],"hashtag":["Opinion","Fintech","SEC","broker-dealer"],"authors":["Marcelo Prates"]}