{"summary":"Withdrawals are still paused and the company has hired restructuring experts as it faces a financial crisis.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/04\/crypto-lender-celsius-cuts-150-jobs-amid-restructuring-report\/","publishDate":"2022-07-04T09:16:05","id":16449,"type":null,"title":"Crypto Lender Celsius Cuts 150 Jobs Amid Restructuring: Report","category":["Finance"],"content":["American-Israeli crypto lender Celsius laid off some 150 employees as it battles a financial crisis that saw it halt customer withdrawals last month, Calcalist reported over the weekend.","The firm has about 650 staff members listed on LinkedIn, including executives, meaning 23% of the company was affected.","The layoffs come amid uncertainty for the company as it faces possible insolvency. In June it paused withdrawals citing “extreme market conditions” and has since hired restructuring specialists. The company said it is exploring options to “preserve and protect assets” following its mid-June turmoil.","Goldman Sachs (GS) is said to be leading a $2 billion raise from investors to purchase Celsius’s distressed assets. Crypto exchange FTX, however, is said to have passed on a deal to purchase the lender after examining its finances.","Celsius joins a growing of crypto firms letting go of staff amid bearish market conditions. Coinbase (COIN) laid off over 1,100 employees in June, with exchanges Bybit, Huobi, Banxa and several others letting go of staff in the past month.","Prices of Celsius’s CEL tokens were up 15% in the past 24 hours, CoinGecko data show."],"entity":[{"type":"June","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Goldman Sachs (GS)","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"Huobi","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Banxa","content":"PERSON"}],"hashtag":["Celsius","Layoffs","Business","US"],"authors":["Shaurya Malwa"]}