{"summary":"The House Financial Services Committee will hold a hearing on FTX in December. \nIn a joint statement announcing the hearing, current Chair Maxine Waters, D-Calif., and likely incoming chair Rep. Patrick McHenry, R-N.C., said they expect participation from companies and individuals involved, including Sam Bankman-Fried, Alameda Research, and Binance.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187617\/u-s-house-committee-to-hold-hearing-on-ftx-collapse-and-crypto-fall-out","publishDate":"2022-11-16T10:19:41","id":1645,"type":null,"title":"U.S. House committee to hold hearing on FTX collapse and crypto fall out","category":["Policy"],"content":["The House Financial Services Committee will hold a hearing next month on FTX’s collapse and the broader implications for the digital asset industry.","The committee says it expects to hear from “the companies and individuals involved, the companies and individuals involved, including Sam Bankman-Fried, Alameda Research, Binance, FTX, and related entities, among others,” for a hearing to take place in December.","“Oversight is one of Congress’ most critical functions and we must get to the bottom of this for FTX’s customers and the American people,” said Rep. Patrick McHenry, R-N.C., the top committee Republican, in a statement. “It’s essential that we hold bad actors accountable so responsible players can harness technology to build a more inclusive financial system.”","Rep. Maxine Waters, D-Calif., the current but likely outgoing chair of the House Financial Services Committee, added:","“The fall of FTX has posed tremendous harm to over one million users, many of whom were everyday people who invested their hard-earned savings into the FTX cryptocurrency exchange, only to watch it all disappear within a matter of seconds. Unfortunately, this event is just one out of many examples of cryptocurrency platforms that have collapsed just this past year.”","McHenry, who is expected to take the committee gavel next year, thanked Waters for working together on the hearing.","“I appreciate Chairwoman Waters’&nbsp;working with Republicans to deliver accountability through a bipartisan process,” he said in their joint statement announcing the hearing.","FTX declared Chapter 11 bankruptcy last Friday.&nbsp;"],"hashtag":["HOUSE FINANCIAL SERVICES COMMITTEE"]}