{"summary":"Mantenerse al día con #cryptotwitter puede ayudarle a mantenerse informado sobre las últimas noticias, conversaciones y controversias importantes en el mundo de las Criptomonedas.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/getting-started-with-crypto-twitter\/","publishDate":"2022-07-29T20:11:00","id":16451,"type":null,"title":"Comenzando con Cripto Twitter","category":["Learn"],"content":["La comunidad Cripto en Twitter es un depósito en constante evolución de preguntas, respuestas, explicaciones y especulaciones de todos los rincones de la comunidad Cripto . Es una de las plataformas clave donde se intercambian ideas: las personas y los proyectos anuncian hitos en su progreso, dan garantías cuando las cosas van mal y comparten sus pensamientos personales.","Si eres nuevo en esto, aquí tienes algunas ideas sobre por dónde empezar.","Su primer paso para unirse a Cripto Twitter (#cryptotwitter) es comenzar a seguir algunas cuentas clave en Twitter, pero con el ruido y el volumen de un tema como Cripto, puede ser difícil saber por dónde empezar.","Para recopilar una buena cantidad de voces en su feed, un enfoque útil puede ser dividir la multitud de Cripto en categorías como desarrolladores, escritores, inversores, etc. Quizás quieras centrarte en una categoría. O tal vez quieras elegir algunos nombres importantes de cada uno para comenzar.","Para empezar, están los que mueven y agitan el mundo de las Cripto , las personas que han desarrollado o administrado personalmente las principales entidades Cripto . El equipo que fundó Ethereum es uno de los líderes en este campo. Sus cuentas lo KEEP actualizado sobre la cadena de bloques de capa 1, así como sobre los desarrollos en la amplia gama de proyectos en los que trabajan ahora.","Vitalik Buterin es quizás el más conocido de los fundadores de Ethereum. Escribió el libro blanco cuando sólo tenía 19 años. En estos días, tuitea una mezcla de comentarios continuos sobre los últimos debates Cripto y comentarios filosóficos que invitan a la reflexión. Muchas de sus publicaciones no tratan en absoluto sobre Cripto , sino cuestiones políticas o morales más amplias. Hace a sus seguidores preguntas desafiantes tan a menudo como expresa sus propios puntos de vista.","Desde entonces, el compañero fundador de Ethereum , Gavin Wood, ha cofundado Polkadot , ONE de los mayores competidores de Ethereum. Sus publicaciones suelen ser concisas, centradas en criptografía y técnicas. También retuitea muchos comentarios Cripto de otras voces. Y Joseph Lubin fundó ConsenSys, la incubadora de aplicaciones de Ethereum, después de desempeñar su papel en la fundación del propio Ethereum .","Es un poco más complicado Síguenos al fundador de Bitcoin en Twitter: nadie sabe quiénes son . Pero si estás especialmente interesado en Bitcoin, existen varias cuentas dedicadas exclusivamente a compartir noticias sobre la Criptomonedas original. Dos útiles para empezar son @DocumentingBTC y @BTC_Archive .","También vale la pena seguir a los fundadores de los principales intercambios de Cripto . El fundador de Binance, Changpeng Zhao , más conocido como CZ, tuitea opiniones y actualizaciones sobre su propia empresa y el espacio en general casi todos los días. El fundador de Coinbase, Brian Armstrong, también es muy activo en Twitter y comparte noticias frecuentes e ideas sobre la regulación de las Cripto , entre otras áreas.","Después de haber presionado \"Síguenos\" a algunos de los primeros visionarios de las criptomonedas, puede mirar a las personas que se han hecho nombres e incluso Empleo escribiendo sobre el tema. Además de autores populares, en Twitter también participan activamente algunos académicos e investigadores especializados. En esta categoría, probablemente querrás concentrarte en el nivel de detalle técnico que se adapte a tu experiencia.","Andreas Antonopoulos es un nombre famoso en esta zona. Es consultor, presentador de podcasts y autor que también ha creado un catálogo profundo de contenido de YouTube para ayudar a las personas a comprender las Cripto. Sus tweets a menudo ofrecen explicaciones concisas sobre conceptos Cripto o adoptan una postura sobre un tema HOT . Si su objetivo es educarse sobre las Cripto, pero no tiene mucha experiencia técnica, es posible que aprecie su trabajo. La podcaster y autora Laura Shin también publica una gran cantidad de contenido de video, entrevistas, noticias de terceros y otro contenido diseñado para KEEP actualizado con la conversación.","Si desea equilibrar su feed, es posible que le interese agregar algunos escépticos de Web3 a su lista, como Web3 de la editora de Wikipedia, Molly White, o Jackson Palmer , el fundador de Dogecoin que desde entonces se ha convertido en un ferviente crítico de las Cripto .","Una tercera categoría importante de carácter Cripto son los inversores. Algunas de estas personas son responsables de mover tanto dinero que probablemente valga la pena escuchar sus opiniones, incluso cuando no esté de acuerdo con ellas. Ejemplos destacados serían Ari David Paul , fundador de BlockTower Capital, o Cathie Wood , directora ejecutiva y fundadora de Ark Invest.","Si desea Síguenos a inversores famosos, simplemente busque los fondos de inversión en Cripto más importantes y luego busque los nombres de sus administradores en Twitter. Puede que no compartan sus estrategias, pero es posible que usted Aprende algo de todos modos.","Una vez que haya encontrado a alguien que le guste o le resulte interesante, podrá encontrar más rápidamente mirando a quién está retuiteando y con qué personas interactúa. Consulta la pestaña \"Tweets y respuestas\" de cualquier perfil para ver no sólo los hilos que inician, sino también las personas a las que responden. Puedes trazar un camino de esta manera a través de una comunidad en línea. En caso de duda, Síguenos: siempre puedes dejar de seguir más tarde.","Otro buen truco que Twitter ha escondido un BIT es encontrar a alguien que te guste y ver si ha seleccionado alguna de sus propias listas de Twitter. Por ejemplo, Taylor Monahan , que tiene un excelente hilo de recursos para principiantes en su perfil, también ha seleccionado listas que ella misma creó o encontró y siguió:","Para ver si alguien tiene listas, simplemente agregue \/lists al final de la URL de su perfil, por ejemplo: https:\/\/twitter.com\/tayvano_\/lists lo llevará a las listas anteriores. Puede Síguenos listas que otras personas crean al por mayor o usarlas para simplemente agregar personas de cualquier lista que despierten su curiosidad Cripto .","Incluso si ya eres un ávido usuario de Twitter, es posible que aún te confundan algunas de las cosas que las personas Cripto ponen en sus perfiles.","A algunos miembros de la comunidad Cripto les gusta mostrar sus activos Cripto visualmente a su audiencia digital. Así surgieron las \" NFT de imagen de perfil (PFP) \". A algunos titulares de NFT les gusta hacer de la obra de arte relevante su foto de perfil, proclamándose propietarios orgullosos y, a menudo, señalando su pasión por las Cripto en general.","El propio Twitter ha reconocido y, de hecho, alentado la práctica, ofreciéndose a verificar si los usuarios eran propietarios de los NFT asociados con sus imágenes de perfil. A partir de enero de 2022, podrá configurar su foto de perfil de Twitter en su NFT y obtener un borde hexagonal especial para mostrar su autenticidad. Alguien más podría copiar y pegar la imagen si quisiera, pero no obtendría el borde.","La gente Cripto a veces pone sus . nombre ETH en su perfil también. Esta es básicamente una forma de recopilar todas las billeteras Cripto y sitios web de esa persona bajo un ONE LINK, en lugar de proporcionar una lista de URL y direcciones de billetera. La mayor parte de la vida digital de un entusiasta de las Cripto se puede reunir, por así decirlo, en un ONE lugar. Por ejemplo, Vitalik Buterin ha convertido su nombre de usuario en Twitter en vitalik. ETH.","El proveedor del sistema es en realidad una aplicación descentralizada (dapp) llamada Ethereum Naming Service (ENS) y los nombres son en sí mismos NFT negociables.","Como ocurre con todas las redes sociales, el truco para aprovechar al máximo las Cripto Twitter es encontrar la parte que aporta más a tu vida, evitar las partes que no y tratar de no pasar todo el día en ello.","Ver también: Cripto Discord: dónde ir, qué saber"],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Ari David Paul","content":"PERSON"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Molly White","content":"PERSON"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"Cathie Wood","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"llamada Ethereum Naming Service","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Wikipedia","content":"LOCATION"},{"type":"Taylor Monahan","content":"PERSON"},{"type":"Gavin Wood","content":"PERSON"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Learn","Beginner","industry","Spanish"],"authors":["Benedict George"]}