{"summary":"The much-hyped restaking project initiated its long-awaited though highly controversial plan to distribute EIGEN tokens, by opening a window of time where eligible users can claim them. They're not freely tradeable, but speculators in side markets put the fully diluted value around $15 billion.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/10\/eigenlayer-opens-claims-for-airdrop-of-eigen-token-though-its-non-transferable\/","publishDate":"2024-05-10T17:12:56","id":16456,"type":null,"title":"EigenLayer Opens Claims for Airdrop of EIGEN Token, Though It's Non-Transferable","category":["Technology"],"content":["EigenLayer has finally kicked off its long-awaited EIGEN airdrop, but it will be a while before users can trade their new tokens – since the project has made them non-transferable.","The Eigen Foundation, a non-profit introduced last week by Eigen Labs, the team behind EigenLayer, opened up \"claims\" on EIGEN on Friday. Officials have said they would become transferable at a yet-to-be-defined later date. The Eigen Foundation said in a Telegram message that they are targeting September 30.","Speculators on decentralized exchanges like Aevo and Hyperliquid are currently valuing EIGEN at around $9. EIGEN's total supply at launch is 1,673,646,668.28466 tokens, which would give the token a fully diluted value of $15 billion.","Both markets allow users to trade perpetual futures, or \"perps,\" which are futures contracts that have no expiration date – crypto-native trading instruments that allow people to speculate on the future price of an asset without trading it outright.","\"You can probably view it as what people expect the spot price will trade at when it is transferable,\" Julian Koh, CEO of Aevo, explained in a Telegram message. \"People use it as a reference price like how people use prediction market odds as a reference for the actual event.\"","EigenLayer, the restaking service on Ethereum, is one of the buzziest blockchain startups to ever launch a token, raising more than $100M from Andreessen Horowitz, and luring in some $16 billion worth of user deposits into its \"pooled security\" system before it even launched.","While EigenLayer has emerged as one of the most talked-about blockchain projects to date, its EIGEN token has generated significant controversy.","As most of EigenLayer's key features remain in progress, the main incentive for depositing into the platform thus far has been \"points,\" which are score-counts that crypto traders expected would be tied to a future airdrop.","Last week, Eigen Labs, the team behind EigenLayer, unveiled details behind EIGEN, which it called a \"Universal Intersubjective Work Token\" that would help power the EigenLayer platform under the hood.","EIGEN's distribution plan was immediately met with backlash from EigenLayer point-earners.","In addition to the lengthy non-transferability period, some took issue with the project's decision to bar users from some jurisdictions – like the U.S., Canada and China – from claiming tokens. The grumbles came partly because the project had placed no geographic restrictions on the deposits or points awards.","Others were disappointed that some points from third-party \"liquid restaking services\" would not be considered in the \"Season 1\" airdrop even though they accounted for a large portion of overall deposits. (It remains to be seen how those points will be accounted for in EigenLayer's eventual \"Season 2\" airdrop).","EigenLayer revised its plan in response to the community feedback, allocating extra funds for some users in the \"Season 1\" airdrop.","CORRECTION (May. 10, 20:06 UTC): Some liquid restaking points will be counted in the Season 1 airdrop.","\n","\n","Edited by Bradley Keoun."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Julian Koh","content":"PERSON"},{"type":"$16 billion","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"September 30","content":"DATE"},{"type":"EIGEN","content":"LOCATION"},{"type":"$9","content":"MONEY"},{"type":"$100M","content":"MONEY"},{"type":"$15 billion","content":"MONEY"},{"type":"Eigen Labs","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Eigen Foundation","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["EigenLayer","airdrop","Restaking"],"authors":["Sam Kessler"]}