{"summary":"This period could last between one to six months, and the sentiment will be the most negative right before the turnaround, one hedge fund manager said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/10\/bitcoin-is-in-a-bore-you-to-death-phase-but-bottom-could-be-close-analysts-say\/","publishDate":"2024-05-10T20:26:33","id":16458,"type":null,"title":"Bitcoin Is in a 'Bore You to Death' Phase, but Bottom Could Be Close, Analysts Say","category":["Markets"],"content":["Crypto markets are stuck in a lull with digital assets consolidating for the last few weeks, testing investors conviction whether the bull market will resume.","All attempts for a sustained rally over the past weeks have been sold off, the latest instance coming Friday with bitcoin (BTC) tumbling nearly 5% from $63,000 to just above $60,000 amid discouraging inflation expectations and hawkish commentary from Federal Reserve policymakers.","Blockchain activity also points to low participation, with transactions on the Bitcoin network falling off a cliff and second-largest ether (ETH) turning inflationary.","We have been here before.","The current period resembles the action from April through September of 2023 when bitcoin was stuck in the $25,000-$30,000 range for an excruciating six months. Eventually, cryptocurrencies were able to sustain a multi-month rally, with BTC ultimately hitting an all-time high in March of this year.","\"Bitcoin is in the 'bore you to death' phase,\" Charles Edwards, founder of crypto hedge fund Capriole Investment said in an X post Thursday.","This period of consolidation could last for anywhere between one to six months, he explained, during which BTC will be rangebound with low volatility until market participants lose their patience. The sentiment will be the most negative just before the consolidation ends, he added.","\"When you are sufficiently bored from sideways chop, common symptoms will include thinking the halving is priced in, the bull market is over and selling to buy stocks at the bottom,\" Edwards said. \"Your symptoms and shorts will peak just before the mega rally.\"","Said bottom might be near, according to analytics firm Santiment.","\"Traders are showing weak 'buy the dip' interest in bitcoin's latest retrace,\" Santiment said Friday monitoring social media interactions. \"Generally, the crowd's lack of faith is a strong sign of prices being close to a bottom.\"","Bitfinex analysts noted in a Friday report that bitcoin's recent weakness happened amid a surging U.S. dollar with interest rate cut expectations tempered, and said the lull could continue into early summer.","\"We expect the market to remain uncertain over the short-term in a low volatility environment till the actual tapering of QT [quantitative tightening] takes place in June.\" The Federal Reserve announced plans to curb the pace of its balance sheet run-off starting next month, which would impact dollar liquidity positively benefitting risky assets such as cryptocurrencies that are sensitive to the global liquidity environment.","However, the greenback's tumble from a six-month peak last week following the Fed meeting and weak jobs report – coinciding with BTC to rebound from near $56,000 – was a turning point in the trend, and a weaker dollar could support the next leg in the crypto rally.","\"We believe sustained strength and a reclaim of range lows on BTC post-FOMC and job market data and the simultaneous weakness in the dollar is a sign of a new regime, which would set us up for a very bullish Q3-Q4 for bitcoin,\" the authors said.","Edited by Stephen Alpher."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$60,000","content":"MONEY"},{"type":"Charles Edwards","content":"PERSON"},{"type":"Capriole Investment","content":"ORGANIZATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"April through September of 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Santiment","content":"PERSON"},{"type":"$63,000","content":"MONEY"},{"type":"$56,000","content":"MONEY"},{"type":"Edwards","content":"PERSON"},{"type":"Federal Reserve policymakers","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$25,000","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"March of this year","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":["Markets","Bitcoin","Bitfinex","Santiment","Capriole Investments"],"authors":["Krisztian Sandor"]}