{"summary":"A working group consisting of South Korea’s top exchanges reported OKX to authorities for allegedly operating locally without registration.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276404\/okx-south-korea-probe","publishDate":"2024-02-07T04:40:44","id":1645,"type":null,"title":"OKX faces potential probe in South Korea after alleged rule-breaking","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Digital Asset Exchange Alliance, a working group consisting of South Korea’s top five cryptocurrency exchanges, told The Block Wednesday that it has reported global crypto trading platform OKX to the local authorities for allegedly operating locally without proper registration.<\/span>","<span data-v-f87c67ca=\"\">While OKX did not explicitly offer services to South Korean investors, DAXA reported the exchange to local authorities for allegedly promoting its Jumpstart program to local crypto users via Telegram influencers, news agency News1 <\/span><a href=\"https:\/\/www.news1.kr\/articles\/5315298\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> Wednesday, citing an industry source familiar with the matter. The source told the local news outlet that OKX paid Telegram communities to promote Jumpstart.<\/span>","Meanwhile, a spokesperson for DAXA told The Block that it does not hold authority to give verdict on OKX's alleged violation. \"The decision is for the Financial Intelligence Unit to make,\" the spokesperson said.&nbsp;","<span data-v-f87c67ca=\"\">The Block has reached out to OKX for further comment.<\/span>","<span data-v-f87c67ca=\"\">South Korea requires every cryptocurrency exchange to register with regulators before offering trading services to its citizens, which has effectively barred all foreign exchanges from legally serving South Korean investors. In 2021, the Financial Services Commission notified 27 foreign exchanges to register locally or withdraw Korean language services from their platforms.<\/span>","<span data-v-f87c67ca=\"\">However, such a mandate does not prohibit South Korean users from accessing foreign exchanges. The primary concern of South Korean regulators is whether foreign crypto platforms target local traders via marketing, offering trading in Korean won or providing Korean language services.<\/span>","<span data-v-f87c67ca=\"\">The Financial Intelligence Unit, a regulatory supervisor under the FSC, is expected to launch an investigation into OKX following DAXA’s report, according to News1.<\/span>","<span data-v-f87c67ca=\"\">DAXA was formed in 2022 following the collapse of the Terra-Luna crypto project to take joint action on various events that may impact the local crypto ecosystem. Its members — Upbit, Bithumb, Korbit, Coinone and Gopax — account for over 99% of the local crypto trade volume.<\/span>","<em data-v-f87c67ca=\"\">Updates made for additional quote from DAXA spokesperson.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"DAXA","content":"ORGANIZATION"},{"type":"Korbit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"South Korean","content":"LOCATION"},{"type":"Bithumb","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"Luna","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Digital Asset Exchange Alliance","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"OKX","content":"ORGANIZATION"},{"type":"FSC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Terra","content":"LOCATION"},{"type":"the Financial Services Commission","content":"ORGANIZATION"}],"hashtag":["OKX"],"authors":["Danny Park","The Block"]}