{"summary":"Ethena's USDe tokenized yield strategy has attracted over $2 billion in deposits and some scrutiny of the token's risks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/07\/ethenas-ena-jumps-8-as-bybit-endorses-usde-token-as-collateral-for-derivatives-trading\/","publishDate":"2024-05-07T16:37:33","id":16466,"type":null,"title":"Ethena's ENA Jumps 8% as Bybit Endorses USDe Token as Collateral for Derivatives Trading","category":["Markets"],"content":["Decentralized finance (DeFi) protocol Ethena's governance token ENA rose sharply Tuesday on the news that crypto exchange Bybit integrated the protocol's USDe \"synthetic dollar\" for various trading activities expanding the token's utility.","Bybit has added USDe as a collateral asset for perpetual futures trading with leverage and also listed spot bitcoin (BTC) and ether (ETH) trading pairs against the token, according to a press release.","ENA hit its highest price in two weeks before retreating somewhat to $0.96, still up more than 8% through the past 24 hours, CoinGecko data shows. It has outperformed the mostly flat broader crypto market benchmark CoinDesk 20 Index (CD20).","Bybit's move to accept USDe as collateral asset makes makes Ethena \"even more of a bridge between centralized finance (CeFi) and decentralized finance (DeFi)\", Joshua Lim, co-founder of derivatives dealer company Arbelos, said in an interview with CoinDesk.","Lim pointed out that the addition helps reduce risk for perpetual traders as USDe carries an embedded short position in itself.","\"[This] is actually a huge deal,\" Lim said.","Ethena has stormed the crypto scene this year, becoming one of the fastest growing DeFi protocol with its tokenized yield-generating investment offering that attracted over $2 billion in deposits, while also drawing plenty of scrutiny of risks from market observers still marred by the crypto implosions of the bear market.","Read more: Ethena Labs Divides Opinion as High Yield Stirs Memories of Terra","The protocol's USDe token, often referred to as \"synthetic dollar\" instead of a stablecoin, is a structured finance product wrapped in a token. It offers steady yields to investors by using ETH liquid staking derivatives such as Lido's stETH as backing assets, pairing them with an equal value of short ETH perpetual futures position on derivatives exchanges to keep anchored at $1 price. This strategy is also known as a \"cash and carry\" trade, which harvests derivatives funding rates for a yield.","Recently, the protocol also added BTC to its backing assets and debuted its governance token called ENA.","Edited by Stephen Alpher."],"entity":[{"type":"Lim","content":"PERSON"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"8%","content":"PERCENT"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"ENA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$0.96","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"Joshua Lim","content":"PERSON"},{"type":"Ethena Labs Divides Opinion as High Yield Stirs Memories of Terra","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Ethena","Bybit","Tokenized Assets","Yield","DeFi"],"authors":["Krisztian Sandor"]}