{"summary":"Stare al passo con #cryptotwitter può aiutarti a rimanere informato sulle ultime notizie, conversazioni e controversie che contano nel mondo delle Criptovaluta.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/getting-started-with-crypto-twitter\/","publishDate":"2022-07-29T20:11:00","id":16460,"type":null,"title":"Iniziare con Cripto Twitter","category":["Learn"],"content":["La comunità Cripto su Twitter è un archivio in continua evoluzione di domande, risposte, spiegazioni e speculazioni provenienti da ogni angolo della comunità Cripto . È ONE delle piattaforme chiave in cui si scambiano idee: persone e progetti annunciano le tappe fondamentali del loro progresso, rassicurano quando le cose vanno male e condividono i loro pensieri personali.","Se sei nuovo, ecco alcune idee su dove iniziare.","Il tuo primo passo per unirti a Cripto Twitter (#cryptotwitter) è iniziare a seguire alcuni account chiave su Twitter, ma con il rumore e il volume di un argomento come la Cripto, può essere difficile sapere da dove cominciare.","Per raccogliere un buon numero di voci sul tuo feed, un approccio utile potrebbe essere quello di suddividere il pubblico Cripto in categorie come sviluppatori, scrittori, investitori e così via. Forse vuoi concentrarti su ONE categoria. Oppure potresti voler scegliere alcuni grandi nomi da ciascuno per iniziare.","Per cominciare, ci sono i promotori e gli agitatori del mondo delle Cripto , le persone che hanno sviluppato o gestito personalmente le principali entità Cripto . Il team che ha fondato Ethereum è tra i leader in questo campo. I loro account ti KEEP aggiornato sulla blockchain di livello 1, nonché sugli sviluppi nell'ampia gamma di progetti su cui lavorano ora.","Vitalik Buterin è forse il più noto dei fondatori di Ethereum. Ha scritto il Libro Bianco quando aveva solo 19 anni. In questi giorni, twitta un misto di commenti sugli ultimi dibattiti Cripto e commenti filosofici stimolanti. Gran parte dei suoi post non riguardano affatto le Cripto , ma questioni politiche o morali più ampie. Chiede ai suoi seguaci domande stimolanti ogni volta che afferma le proprie opinioni.","Il collega fondatore Ethereum Gavin Wood da allora ha co-fondato Polkadot , ONE dei maggiori concorrenti di Ethereum. I suoi post sono solitamente concisi, incentrati sulla crittografia e tecnici. Ritwitta molti commenti Cripto anche da altre voci. E Joseph Lubin ha fondato ConsenSys, l’incubatore di applicazioni Ethereum, dopo aver svolto il suo ruolo nella fondazione della stessa Ethereum .","Il fondatore di Bitcoin è un po' più complicato da Seguici su Twitter: nessuno sa chi sia . Ma se sei particolarmente interessato al Bitcoin, ci sono una serie di account interamente dedicati alla condivisione di notizie sulla Criptovaluta originale. Due utili con cui iniziare sono @DocumentingBTC e @BTC_Archive .","Vale la pena seguire anche i fondatori dei principali scambi Cripto . Il fondatore di Binance Changpeng Zhao , meglio conosciuto come CZ, twitta opinioni e aggiornamenti sulla propria azienda e sul settore in generale quasi ogni giorno. Anche il fondatore di Coinbase Brian Armstrong è molto attivo su Twitter, condividendo frequenti notizie e approfondimenti sulla regolamentazione Cripto , tra le altre aree.","Dopo aver premuto \"Seguici\" su alcuni dei primi visionari delle criptovalute, potresti guardare le persone che hanno fatto nomi e persino Carriere scrivendo sull'argomento. Oltre agli autori famosi, anche alcuni accademici e ricercatori specializzati sono attivi su Twitter. In questa categoria probabilmente vorrai concentrarti sul livello di dettaglio tecnico adatto al tuo background.","Andreas Antonopoulos è un nome famoso in questa zona. È un consulente, podcaster e autore che ha anche creato un ampio catalogo di contenuti YouTube per aiutare le persone a comprendere le Cripto. I suoi tweet spesso offrono spiegazioni concise sui concetti Cripto o prendono posizione su un argomento HOT . Se il tuo obiettivo è istruirti sulle Cripto, ma T hai molto in termini di background tecnico, potresti apprezzare il suo lavoro. La podcaster e autrice Laura Shin pubblica anche molti contenuti video, interviste, notizie di terze parti e altri contenuti progettati per KEEP aggiornato sulla conversazione.","Se vuoi bilanciare il tuo feed, potresti essere interessato ad aggiungere alcuni scettici di Web3 alla tua lista, come Web3 sta andando alla grande dell'editore di Wikipedia Molly White o Jackson Palmer , il fondatore di Dogecoin che da allora è diventato un ardente critico Cripto .","Una terza importante categoria di carattere Cripto sono gli investitori. Alcune di queste persone sono responsabili di spostare così tanti soldi che probabilmente vale la pena ascoltare i loro pensieri, anche quando T sei d'accordo con loro. Esempi importanti sarebbero Ari David Paul , fondatore di BlockTower Capital, o Cathie Wood , CEO e fondatrice di Ark Invest.","Se vuoi Seguici in particolare investitori famosi, cerca semplicemente i più grandi fondi di investimento in Cripto e poi cerca i nomi dei loro gestori su Twitter. Potrebbero non condividere le loro strategie, ma potresti Imparare lo stesso qualcosa.","Una volta trovato qualcuno che ti piace o che trovi interessante, puoi trovarne rapidamente altri osservando chi sta ritwittando e le persone con cui interagisce. Controlla la scheda \"Tweet e risposte\" su qualsiasi profilo per vedere non solo le discussioni che iniziano, ma anche le persone a cui rispondono. Puoi tracciare un percorso in questo modo attraverso una comunità online. In caso di dubbio, Seguici: puoi sempre smettere di seguire più tardi.","Un altro buon trucco che Twitter ha nascosto un BIT' è trovare qualcuno che ti piace e vedere se ha curato qualcuno dei suoi elenchi Twitter. Ad esempio, Taylor Monahan , che ha un ottimo thread di risorse per principianti sul suo profilo, ha anche curato elenchi che ha creato o trovato e seguito lei stessa:","Per vedere se qualcuno ha delle liste, basta aggiungere \/lists alla fine dell'URL del suo profilo, ad esempio: https:\/\/twitter.com\/tayvano_\/lists ti porterà alle liste sopra. Puoi Seguici gli elenchi creati da altre persone all'ingrosso o utilizzarli semplicemente per aggiungere individui da qualsiasi elenco che stuzzicano la tua curiosità Cripto .","Anche se sei già un utente accanito di Twitter, potresti essere ancora confuso da alcune delle cose che le persone Cripto inseriscono nei loro profili.","Ad alcuni membri della comunità Cripto piace mostrare visivamente le proprie risorse Cripto al proprio pubblico digitale. È così che sono nati gli \" NFT dell'immagine del profilo (PFP) \". Ad alcuni possessori di NFT piace rendere l'opera d'arte in questione la loro immagine del profilo, proclamandosi orgogliosi proprietari e spesso segnalando la loro passione per le Cripto in generale.","Twitter stesso ha riconosciuto e di fatto incoraggiato la pratica, offrendo di verificare se gli utenti possedessero gli NFT associati alle loro immagini del profilo. A partire da gennaio 2022, potresti impostare l'immagine del tuo profilo Twitter sul tuo NFT e ottenere uno speciale bordo esagonale per mostrarne l'autenticità. Qualcun altro potrebbe copiare e incollare l'immagine se lo desidera, ma non otterrebbe il bordo.","Le persone Cripto a volte mettono i loro . ETH nome anche sul loro profilo. Questo è fondamentalmente un modo per raccogliere tutti i portafogli Cripto e i siti Web di quella persona sotto ONE LINK, invece di fornire un elenco di URL e indirizzi di portafogli. La maggior parte della vita digitale di un appassionato Cripto può essere raccolta, per così dire, in ONE posto. Ad esempio, Vitalik Buterin ha creato il suo nome utente Twitter vitalik. ETH.","Il fornitore del sistema è in realtà un'applicazione decentralizzata (dapp) chiamata Ethereum Naming Service (ENS) e i nomi stessi sono NFT negoziabili.","Come con tutti i social media, il trucco per ottenere il massimo dalle Cripto Twitter è trovare la parte che aggiunge di più alla tua vita, evitare le parti che T lo fanno e cercare di non dedicarci tutto il giorno.","Vedi anche: Cripto Discord: dove andare, cosa sapere"],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"sia","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Ari David Paul","content":"PERSON"},{"type":"Wikipedia Molly White","content":"ORGANIZATION"},{"type":"dell","content":"ORGANIZATION"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"questa zona","content":"LOCATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Libro Bianco","content":"PERSON"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"Coinbase Brian Armstrong","content":"ORGANIZATION"},{"type":"Cathie Wood","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Naming Service","content":"ORGANIZATION"},{"type":"Ethereum Gavin Wood da","content":"ORGANIZATION"},{"type":"massimo dalle","content":"PERSON"},{"type":"nei","content":"ORGANIZATION"},{"type":"Taylor Monahan","content":"PERSON"},{"type":"NFT dell","content":"ORGANIZATION"},{"type":"Carriere scrivendo sull","content":"PERSON"},{"type":"Binance Changpeng Zhao","content":"PERSON"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Learn","Beginner","industry","Italian"],"authors":["Benedict George"]}