{"summary":"Un currículum en cadena proporciona a los posibles empleadores de Web3 prueba de su experiencia en Cripto al mostrar su participación y actividad en la vida real en el sector.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/what-is-an-on-chain-resume\/","publishDate":"2022-06-28T15:11:51","id":16464,"type":null,"title":"¿Qué es un currículum en cadena?","category":["Learn"],"content":["Si desea trabajar en Cripto, es posible que necesite más que un currículum tradicional para conseguir un trabajo. Muchos trabajos querrán que muestres tu experiencia y habilidades con Criptomonedas , tokens no fungibles ( NFT ) y otros activos digitales, según el puesto. Ahí es donde entra en juego un currículum en cadena.","Aunque existen similitudes con un currículum tradicional, un currículum en cadena proporciona su experiencia profesional de una manera diferente.","Esta pieza es parte de la serie Future of Work de CoinDesk.","Un currículum tradicional es un documento que proporciona una descripción general de su experiencia profesional, como su historial laboral, educación y habilidades especiales.","Pero si desea conseguir un trabajo en Cripto, un currículum en cadena puede ser más importante. Lo que pasa con las Cripto es que las actividades de uno son visibles en las cadenas de bloques en las que participa, por lo que si está buscando trabajar en el sector NFT, puede señalar las NFT que ha acuñado en el mercado NFT OpenSea, su PFP (foto de perfil). en Twitter o la dirección del terreno que has comprado en un proyecto de metaverso como The Sandbox , por ejemplo.","Un currículum en cadena es un registro de sus actividades históricas almacenadas en una red blockchain como Ethereum ( ETH ) que destaca su experiencia, transacciones y habilidades. Se considera contenido Web3 .","Su currículum en cadena puede ser tan simple como una billetera o billeteras que contengan transacciones para verificar su actividad en una cadena de bloques. Estas actividades demuestran que usted \"hace Cripto\" y su experiencia a lo largo del tiempo con diferentes tokens y proyectos, lo que puede considerarse más valioso que un currículum tradicional que enumera sus calificaciones.","Sigue leyendo: Lo que necesita saber y hacer para conseguir un trabajo en Cripto","La creación de un currículum en cadena debe adaptarse al trabajo que desea conseguir. Su currículum en cadena para un trabajo como desarrollador en una plataforma de apuestas de Finanzas descentralizadas ( DeFi ) sería muy diferente a ONE que se centra en conseguir un trabajo en un desarrollador de juegos para ganar dinero .","Piense en un nicho en la Tecnología blockchain en el que desee trabajar. Haga una lista de posibles actividades de blockchain que puedan respaldar su credibilidad para ese nicho. Por ejemplo, si elige ser analista de mercado de Bitcoin ( BTC ), puede concentrarse en comprar y vender Bitcoin en su billetera.","Dos cosas con las que la mayoría de la gente debería empezar al crear un currículum en cadena incluyen:","Hay muchas opciones para crear su currículum en cadena, y las transacciones no se basan únicamente en Ethereum. Aquí hay algunas ideas para impulsar su viaje hacia el desarrollo de habilidades para roles Cripto específicos.","Si desea asesorar sobre inversiones en Cripto , operar en un intercambio descentralizado (DEX) es una excelente actividad. Puedes intercambiar Solana ( SOL ) con Binance Coin ( BNB ), que no son activos nativos de Ethereum.","Los DEX populares incluyen Sushiswap, PancakeSwap y Uniswap . Al operar en un DEX, puede mostrar su participación activa en DeFi.","Puede crear medios digitales como imágenes, música y otros formatos digitales para convertirlos en un NFT. Asimismo, también puedes iniciar una colección de NFT en tu billetera.","Puede crear fácilmente ONE de sus trabajos en OpenSea , el mercado NFT más grande de la red Ethereum . Otra buena opción es Solanart , otro gran mercado de NFT en la red Solana .","Tener un conocimiento profundo de un producto o servicio es esencial para ser desarrollador en esa industria. Apostar o ganar recompensas por mantener ciertas criptomonedas puede ayudarlo a ganar credibilidad como ingeniero de software blockchain. Puede apostar criptomonedas populares en plataformas como Binance, Cripto.com y Kraken.","Comprender las fórmulas matemáticas para las recompensas y los intereses demuestra su conocimiento sobre las apuestas.","Las criptomonedas se consideran activos de alto riesgo y alta recompensa. Poner sus criptomonedas en una bóveda de Maker muestra a los empleadores potenciales su experiencia con la exposición al riesgo. Los usuarios pueden depositar un tipo de Criptomonedas como garantía en una bóveda de Maker para obtener un préstamo pagado en Dai. Estas transacciones ayudan a demostrar su experiencia bancaria DeFi.","Al prestar criptomonedas en plataformas como AAVE y Compound , proporciona prueba de otra forma de comercio para su currículum en cadena. Si tiene curiosidad, puede experimentar con préstamos para ganar intereses.","Este tipo de transacciones también demuestran familiaridad con DeFi.","Además, puede utilizar servicios que pueden ayudarle a crear un currículum en cadena y ahorrarle algo de tiempo, como por ejemplo:","La Tecnología Blockchain siempre está evolucionando, y explorar nuevas actividades para incluir en su currículum en cadena demuestra que está aprendiendo y creciendo a medida que el mundo de las Cripto continúa expandiéndose.","Sigue leyendo:Aprenda a ganar, muévase para ganar: cómo ganar Cripto de nuevas maneras","Debido a que un currículum en cadena es público e inmutable, sería prudente separar su currículum en cadena de su billetera de cartera. No querrá atraer a los ciberdelincuentes y comprometer la seguridad de sus activos difíciles de obtener.","Por último, un currículum en cadena no debe verse como el único formato a enviar al solicitar empleo en la industria blockchain. De hecho, puede (y probablemente debería) usarse junto con un currículum tradicional, un perfil de LinkedIn y un portafolio para reforzar su perfil.","Puede que sea un mercado bajista, pero todavía quedan muchos puestos de trabajo en las empresas de Cripto .","Las Cripto pueden hacer que pagar a los trabajadores sea más rápido y barato. Este artículo es parte de la serie El futuro del trabajo.","Al adoptar un modelo más abierto y fluido, a las empresas tradicionales les resultaría más fácil atraer talento y terminarían con una fuerza laboral más apasionada y comprometida."],"entity":[{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Solana ( SOL","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PancakeSwap y Uniswap","content":"ORGANIZATION"},{"type":"Work de CoinDesk","content":"ORGANIZATION"},{"type":"Finanzas","content":"LOCATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["Learn","industry","Beginner","Future of Work Week","Spanish"],"authors":["Mike Antolin"]}