{"summary":"La misura è essenziale per impedire che i malintenzionati utilizzino risorse digitali per riciclare denaro. Colpisce tutti coloro che si dilettano nelle criptovalute, dagli scambi agli investitori di tutti i giorni.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/whats-the-crypto-travel-rule-and-what-does-it-mean-for-you\/","publishDate":"2022-05-26T21:00:46","id":16462,"type":null,"title":"Qual è la \"regola di viaggio\" Cripto e cosa significa Per te?","category":["Learn"],"content":["Quasi tre anni dopo la pubblicazione delle controverse linee guida sulle \"regole di viaggio\" da parte della Financial Action Task Force ( FATF ), i regolatori e i fornitori di servizi di asset virtuali ( VASP ) stanno ancora facendo i conti con le sfide economiche e tecniche legate all'implementazione di queste regole. Sebbene i VASP, che includono ma non si limitino a scambi Cripto , servizi di portafoglio e soluzioni di custodia Cripto , siano l'obiettivo principale di questo regolamento, si prevede che l'implementazione di massa avrà un impatto lento ma sicuro sul modo in cui si interagisce con le Cripto.","In questa guida discuteremo di tutto ciò che devi sapere sulla regola del viaggio in Cripto e su come influenzerà le tue attività Cripto quotidiane.","Continua a leggere: Bitcoin è legale?","Nel 2019, la Financial Action Task Force, un organismo intergovernativo che avvia politiche antiriciclaggio (AML) per il G-7 e altri 30 paesi sviluppati, ha raccomandato un approccio coordinato per combattere il riciclaggio di denaro e il finanziamento del terrorismo. La norma, formalmente nota come Raccomandazione FATF n. 16 , impone ai VASP di comunicare le informazioni degli originatori e dei beneficiari delle transazioni Cripto che superano una determinata soglia. Più specificamente, le normative richiedono ai VASP di scambiarsi informazioni riguardanti l’identità dell’ordinante e del beneficiario ogni volta che l’importo transato è superiore a 1.000 dollari.","In sostanza, ogni volta che vengono scambiate Cripto per un valore superiore a $ 1.000 tra due parti, il fornitore di servizi Cripto del mittente è tenuto a comunicare le informazioni di identificazione personale ( PII ) del mittente al fornitore di servizi Cripto del destinatario e viceversa. Anche se questo è un dato di fatto, gli Stati membri possono scegliere di interpretare queste linee guida e implementare le versioni che meglio si adattano alle loro industrie Cripto locali.","Ad esempio, la soglia alla quale entrano in vigore le regole sui viaggi in Cripto negli Stati Uniti è di 3.000 dollari (ovvero, le regole entrano in gioco quando il valore della transazione in Cripto supera i 3.000 dollari). In tali casi, i VASP sono tenuti a scambiare informazioni riguardanti l’importo transato, la data di esecuzione e l’identità del fornitore di servizi Cripto .","È noto che la Svizzera ha una versione rigorosa della regola di viaggio, in cui le autorità di regolamentazione richiedono l’identificazione dei portafogli privati ​​che interagiscono con i VASP locali.","Oltre alle informazioni aggiuntive richieste dai singoli regolatori, il GAFI raccomanda che i seguenti dati debbano essere trasmessi avanti e FORTH dai VASP:","La regola dei viaggi esisteva prima delle raccomandazioni del GAFI del 2019. Inizialmente, il regolamento era rivolto alle banche e agli istituti finanziari nell’ambito delle iniziative volte a mitigare il riciclaggio di denaro. In sostanza, le azioni del GAFI nel 2019 hanno solo ampliato questa regola in modo tale che le normative AML esistenti possano essere replicate nel settore Cripto . Vale la pena ricordare che prima dell'emissione della regola sui viaggi Cripto nel 2019, la Financial Crimes Enforcement Network ( FiCEN ), ai sensi del Bank Secrecy Act (BSA) statunitense, aveva imposto una regola simile ai VASP che operavano all'interno della sua giurisdizione.","Pertanto, a differenza della maggior parte delle nazioni, gli Stati Uniti non hanno avuto bisogno di formulare una nuova regolamentazione da zero per conformarsi alle raccomandazioni del GAFI. In base a questa regola, FinCEN richiede ai fornitori di servizi Cripto di confermare che le transazioni Cripto non provengono o non vengono inviate a paesi o società sanzionate.","Continua a leggere: Cos'è KYC e perché è importante per le Cripto?","Come accennato in precedenza, lo scopo Core dell’emanazione di questo regolamento è bloccare il finanziamento del terrorismo e il riciclaggio di denaro. Di seguito sono riportati altri motivi per cui la regola del viaggio è importante:","La prima sfida associata alla regola dei viaggi Cripto ruota attorno all’approccio non uniforme all’implementazione di questo regolamento in diverse regioni. Come accennato in precedenza, i requisiti della regola di viaggio differiscono da paese a paese. Pertanto, i VASP hanno il compito di incorporare solidi sistemi di autoconformità che considerino i diversi requisiti dei vari paesi e li implementino di conseguenza. La non uniformità delle regole di viaggio Cripto è popolarmente chiamata il \"problema dell'alba\".","Tenendo presente che i VASP sono tenuti a scambiare i dettagli delle transazioni, è necessario un sistema di comunicazione interoperabile in modo che i VASP possano facilmente ricevere e inviare PII. Ciò significa che l’intero settore delle Cripto deve adottare un approccio collaborativo per elaborare gli standard ideali di dati e comunicazione.","Comprensibilmente, questo è un po’ difficile perché l’industria Cripto storicamente favorisce un modello operativo decentralizzato. Detto questo, i fornitori di servizi Cripto stanno facendo i conti con questa situazione, e molti di loro stanno adottando protocolli appositamente progettati per facilitare il trasferimento e la raccolta di dati crittografati. Esempi di questi protocolli sono OpenVASP, Shyft, TRISA e TRP.","Ancora più importante, l’industria Cripto ha raggiunto un consenso su un unico formato di messaggistica dati per tutti i protocolli delle regole di viaggio. Questo formato si chiama IVMS 101 .","Un altro punto di discussione principale è l’effetto percepito dell’afflusso di regolamentazione degli asset digitali da parte di una fazione della comunità Cripto . Alcuni credono che regolamenti come la regola dei viaggi conferiscano ai regolatori gli strumenti e i dati necessari per sorvegliare e sanzionare gli utenti Cripto .","Vale anche la pena menzionare gli evidenti rischi per la sicurezza a cui saranno esposti i VASP durante la trasmissione delle informazioni degli utenti. È fondamentale istituire sistemi di sicurezza aggiuntivi che proteggano i dati degli utenti da tali rischi.","Infine, ci sono rischi di conformità Privacy dei dati a cui la regola di viaggio espone i VASP. Per quanto i VASP cerchino di aderire alle regole sui viaggi, devono garantire che le loro azioni siano in linea con le leggi Privacy dei dati delle giurisdizioni in cui operano.","La prima cosa che dovresti avere in mente è che potresti dover rinunciare a parte della tua Privacy per continuare a interagire con il mercato Cripto .","Dovrai inoltre conoscere almeno il nome dei tuoi beneficiari e di coloro che ti inviano i pagamenti. E poiché ci sono ancora sfide associate alle regole di viaggio, non si può dire in che modo le inefficienze di uno qualsiasi dei sistemi di conformità potrebbero influenzare la tua esperienza utente.","Nella fase iniziale di questa rivoluzione normativa, potresti non essere in grado di eseguire transazioni, a seconda dello stato di conformità del tuo VASP e di quello della tua controparte.","Continua a leggere:Cosa sono le Privacy Coins e sono legali?","CORREZIONE (27 marzo, 10:46 UTC): corregge il nome del watchdog in Financial Action Task Force. Una versione precedente la chiamava Forza fiscale per l’azione finanziaria."],"entity":[{"type":"Shyft","content":"PERSON"},{"type":"TRISA e TRP","content":"ORGANIZATION"},{"type":"chiamava Forza","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"dell","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"il nome del watchdog in Financial Action Task Force","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"la Financial Action Task Force","content":"ORGANIZATION"},{"type":"7","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"da parte della Financial Action Task Force","content":"ORGANIZATION"},{"type":"$ 1.000","content":"MONEY"},{"type":"la Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"Raccomandazione FATF","content":"ORGANIZATION"}],"hashtag":["Learn","Intermediate","industry","FATF","Travel Rule","Anti-Money Laundering","Italian"],"authors":["Andrey Sergeenkov"]}