{"summary":"Un curriculum on-chain fornisce ai potenziali datori di lavoro Web3 la prova della tua esperienza nel Cripto mostrando la tua partecipazione e attività nella vita reale nel settore.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/what-is-an-on-chain-resume\/","publishDate":"2022-06-28T15:11:51","id":16461,"type":null,"title":"Che cos'è un curriculum on-chain?","category":["Learn"],"content":["Se vuoi lavorare nel Cripto, potresti aver bisogno di qualcosa di più di un curriculum tradizionale per ottenere un lavoro. Molti lavori vorranno che tu mostri il tuo background e le tue competenze con Criptovaluta , token non fungibili ( NFT ) e altre risorse digitali, a seconda della posizione. È qui che entra in gioco un curriculum on-chain.","Sebbene esistano somiglianze con un curriculum tradizionale, un curriculum on-chain fornisce il tuo background professionale in modo diverso.","Questo pezzo fa parte della serie Future of Work di CoinDesk.","Un curriculum tradizionale è un documento che fornisce una panoramica del tuo background professionale, come la tua storia lavorativa, la tua istruzione e le tue competenze speciali.","Ma se vuoi trovare un lavoro nel Cripto, un curriculum on-chain potrebbe essere più importante. Il bello delle Cripto è che le proprie attività sono visibili sulle blockchain a cui partecipi, quindi se stai cercando di lavorare nel settore NFT, puoi indicare gli NFT che hai coniato sul mercato NFT OpenSea, il tuo PFP (immagine del profilo) su Twitter o l'indirizzo del terreno che hai acquistato in un progetto metaverso come The Sandbox , per esempio.","Un curriculum on-chain è un registro delle tue attività storiche archiviate in una rete blockchain come Ethereum ( ETH ) che evidenzia la tua esperienza, transazioni e competenze. È considerato contenuto Web3 .","Il tuo curriculum on-chain può essere semplice come uno o più portafogli contenenti transazioni per verificare la tua attività su una blockchain. Queste attività dimostrano che \"fai Cripto\" e la tua esperienza nel tempo con diversi token e progetti, che possono essere considerati più preziosi di un curriculum tradizionale che elenca le tue qualifiche.","Continua a leggere: Cosa devi sapere e fare per ottenere un lavoro in Cripto","La creazione di un curriculum on-chain dovrebbe essere adattata al lavoro che desideri ottenere. Il tuo curriculum on-chain per un lavoro come sviluppatore in una piattaforma di staking Finanza decentralizzata ( DeFi ) sarebbe molto diverso da ONE che si concentra sull'ottenimento di un lavoro in uno sviluppatore di giochi play-to-earn .","Pensa a una nicchia nella Tecnologie blockchain in cui vuoi svolgere un lavoro. Fai un elenco di potenziali attività blockchain che possono supportare la tua credibilità per quella nicchia. Ad esempio, se scegli di essere un analista di mercato Bitcoin ( BTC ), puoi concentrarti sull'acquisto e sulla vendita Bitcoin nel tuo portafoglio.","Due cose da cui la maggior parte delle persone dovrebbe iniziare quando creano un curriculum on-chain includono:","Esistono molte opzioni per creare il tuo curriculum on-chain e le transazioni T sono solo basate su Ethereum. Ecco alcune idee per iniziare il tuo viaggio verso lo sviluppo di competenze per specifici ruoli Cripto .","Se vuoi ricevere consigli sugli investimenti in Cripto , fare trading su un exchange decentralizzato (DEX) è un'ottima attività da svolgere. Puoi scambiare Solana ( SOL ) con Binance Coin ( BNB ), che T sono asset nativi di Ethereum.","I DEX più diffusi includono Sushiswap, PancakeSwap e Uniswap . Facendo trading su un DEX, puoi mostrare la tua partecipazione attiva alla DeFi.","Puoi creare media digitali come immagini, musica e altri formati digitali da coniare in un NFT. Allo stesso modo, puoi anche avviare una raccolta di NFT nel tuo portafoglio.","Puoi facilmente coniare ONE dei tuoi lavori su OpenSea , il più grande mercato NFT sulla rete Ethereum . Un'altra buona opzione è Solanart , un altro grande mercato NFT sulla rete Solana .","Avere una conoscenza approfondita di un prodotto o servizio è essenziale per essere uno sviluppatore in quel settore. Puntare o guadagnare premi per detenere determinate criptovalute può aiutarti a darti credibilità come ingegnere del software blockchain. Puoi puntare le criptovalute più popolari su piattaforme come Binance, Cripto.com e Kraken.","Comprendere le formule matematiche per i premi e gli interessi dimostra la tua conoscenza dello staking.","Le criptovalute sono considerate asset ad alto rischio e ad alto rendimento. Mettere le tue criptovalute in un caveau Maker mostra ai potenziali datori di lavoro la tua esperienza con l'esposizione al rischio. Gli utenti possono depositare ONE tipo di Criptovaluta come garanzia in un caveau Maker per ottenere un prestito pagato in Dai. Queste transazioni aiutano a dimostrare la tua esperienza bancaria DeFi.","Prestando criptovalute su piattaforme come AAVE e Compound , fornisci la prova di un'altra forma di trading per il tuo curriculum on-chain. Se sei curioso, puoi sperimentare il prestito per guadagnare interessi.","Questi tipi di transazioni dimostrano anche familiarità con la DeFi.","Inoltre, puoi utilizzare servizi che possono assisterti nella creazione di un curriculum on-chain e farti risparmiare tempo, come ad esempio:","La Tecnologie Blockchain è in continua evoluzione e l'esplorazione di nuove attività da includere nel tuo curriculum on-chain dimostra che stai imparando e crescendo mentre il mondo Cripto continua ad espandersi.","Continua a leggere:Impara a guadagnare, sposta per guadagnare: come guadagnare Cripto in nuovi modi","Poiché un curriculum on-chain è pubblico e immutabile, sarebbe saggio separare il tuo curriculum on-chain dal portafoglio del tuo portafoglio. T vorrai attirare i criminali informatici e compromettere la sicurezza dei tuoi beni difficili da guadagnare.","Infine, un curriculum on-chain T dovrebbe essere visto come l'unico formato da inviare quando si fa domanda per un lavoro nel settore blockchain. In effetti, può (e probabilmente dovrebbe) essere utilizzato insieme a un curriculum tradizionale, un profilo LinkedIn e un portfolio per rafforzare il tuo profilo.","Potrebbe essere un mercato ribassista, ma ci sono ancora molti posti di lavoro da svolgere presso le società Cripto .","Le Cripto possono rendere più veloce ed economico pagare i lavoratori. Questo articolo fa parte della serie Il futuro del lavoro.","Adottando un modello più aperto e fluido, le aziende tradizionali troverebbero più facile attrarre talenti e si ritroverebbero con una forza lavoro più appassionata e coinvolta."],"entity":[{"type":"fa parte della serie Future of Work di CoinDesk","content":"ORGANIZATION"},{"type":"Dai","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"nuovi modi","content":"LOCATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Cripto","content":"LOCATION"},{"type":"Solana ( SOL","content":"ORGANIZATION"},{"type":"PancakeSwap e Uniswap","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"fa","content":"ORGANIZATION"}],"hashtag":["Learn","industry","Beginner","Future of Work Week","Italian"],"authors":["Mike Antolin"]}