{"summary":"La medida es esencial para evitar que los malos actores utilicen activos digitales para lavar dinero. Afecta a todos los que incursionan en las criptomonedas, desde las bolsas hasta los inversores cotidianos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/es\/learn\/whats-the-crypto-travel-rule-and-what-does-it-mean-for-you\/","publishDate":"2022-05-26T21:00:46","id":16476,"type":null,"title":"¿Qué es la 'regla de viaje' de las Cripto y qué significa Para ti?","category":["Learn"],"content":["Casi tres años después de que el Grupo de Acción Financiera Internacional ( GAFI ) emitiera la controvertida guía sobre las \"reglas de viaje\", los reguladores y los proveedores de servicios de activos virtuales ( VASP ) todavía están afrontando los desafíos económicos y técnicos de implementar estas reglas. Si bien los VASP, que incluyen, entre otros, intercambios de Cripto , servicios de billetera y soluciones de custodia de Cripto , son el enfoque principal de esta regulación, se espera que la implementación masiva afecte de manera lenta pero segura la forma en que se interactúa con las Cripto.","En esta guía, discutiremos todo lo que necesita saber sobre la regla de viaje Cripto y cómo afectará sus actividades Cripto diarias.","Sigue leyendo: ¿ Es Bitcoin legal?","En 2019, el Grupo de Acción Financiera Internacional, un organismo intergubernamental que inicia políticas contra el lavado de dinero (AML) para el G-7 y unos 30 países desarrollados más, recomendó un enfoque coordinado para combatir el lavado de dinero y el financiamiento del terrorismo. La regla, conocida formalmente como Recomendación #16 del GAFI , requiere que los VASP comuniquen la información de los originadores y beneficiarios de las transacciones Cripto que superen un cierto umbral. Más específicamente, las regulaciones requieren que los VASP intercambien información sobre las identidades del originador y del beneficiario siempre que el monto de la transacción supere los $1,000.","En esencia, cada vez que se realizan transacciones con Cripto por un valor superior a $1000 entre dos partes, se espera que el proveedor de servicios de Cripto del remitente comunique la información de identificación personal ( PII ) del remitente al proveedor de servicios de Cripto del destinatario y viceversa. Si bien esto es un hecho, los estados miembros pueden optar por interpretar esta guía e implementar las versiones que mejor se adapten a sus industrias Cripto locales.","Por ejemplo, el umbral a partir del cual entra en vigor la norma de viajes Cripto en EE. UU. es de 3.000 dólares (es decir, las reglas entran en juego cuando el valor de la transacción Cripto supera los 3.000 dólares). En tales casos, los VASP deben intercambiar información sobre el monto de la transacción, la fecha de ejecución y la identidad del proveedor de servicios Cripto .","Se sabe que Suiza tiene una versión estricta de la regla de viaje, donde los reguladores exigen la identificación de billeteras privadas que interactúan con los VASP locales.","Además de la información adicional requerida por los reguladores individuales, el GAFI recomienda que los VASP transmitan los siguientes datos de un lado a FORTH :","La regla de viaje existía antes de las recomendaciones del GAFI de 2019. Inicialmente, la regulación estaba dirigida a bancos e instituciones financieras como parte de las iniciativas para mitigar el lavado de dinero. En esencia, las acciones del GAFI en 2019 solo ampliaron esta regla de modo que las regulaciones ALD existentes puedan replicarse en la industria de la Cripto . Vale la pena mencionar que antes de la emisión de la regla de viajes Cripto en 2019, Financial Crimes Enforcement Network ( FinCEN ), en virtud de la Ley de Secreto Bancario (BSA) de EE. UU., había impuesto una regla similar a los VASP que operan dentro de su jurisdicción.","Por lo tanto, a diferencia de la mayoría de las naciones, Estados Unidos no necesitó formular una nueva regulación desde cero para cumplir con las recomendaciones del GAFI. Según esta regla, FinCEN requiere que los proveedores de servicios de Cripto confirmen que las transacciones Cripto no se originan ni se envían a países o empresas sancionadas.","Sigue leyendo: ¿ Qué es KYC y por qué es importante para las Cripto?","Como se mencionó anteriormente, el propósito Core de emitir este reglamento es bloquear el financiamiento del terrorismo y el lavado de dinero. A continuación se detallan otras razones por las que la regla de viaje es importante:","El primer desafío asociado con la regla de viajes Cripto gira en torno al enfoque no uniforme para la implementación de esta regulación en diferentes regiones. Como se mencionó anteriormente, los requisitos de la regla de viaje difieren de un país a otro. Por lo tanto, los VASP tienen la tarea de incorporar sistemas sólidos de autocumplimiento que consideren los diferentes requisitos de los distintos países y los implementen en consecuencia. La falta de uniformidad de las reglas de viaje Cripto se denomina popularmente el \"problema del amanecer\".","Teniendo en cuenta que los VASP deben intercambiar detalles de transacciones, existe la necesidad de un sistema de comunicación interoperable de modo que los VASP puedan recibir y enviar PII fácilmente. Esto significa que toda la industria de la Cripto debe adoptar un enfoque colaborativo para crear los estándares ideales de datos y comunicación.","Es comprensible que esto sea un poco difícil porque la industria de la Cripto históricamente ha favorecido un modelo de operación descentralizado. Dicho esto, los proveedores de servicios Cripto están asumiendo esta situación y muchos adoptan protocolos especialmente diseñados para ayudar en la transferencia y recopilación de datos cifrados. Ejemplos de estos protocolos son OpenVASP, Shyft, TRISA y TRP.","Más importante aún, la industria de la Cripto ha llegado a un consenso sobre un formato único de mensajería de datos para todos los protocolos de reglas de viaje. Este formato se llama IVMS 101 .","Otro tema de conversación principal es el efecto percibido de la afluencia de regulación de activos digitales por parte de una facción de la comunidad Cripto . Algunos creen que regulaciones como la regla de viaje brindan a los reguladores las herramientas y los datos necesarios para vigilar y sancionar a los usuarios de Cripto .","También vale la pena mencionar los aparentes riesgos de seguridad a los que estarán expuestos los VASP al transmitir la información de los usuarios. Es crucial establecer sistemas de seguridad adicionales que protejan los datos de los usuarios de tales riesgos.","Por último, existen riesgos de cumplimiento de la Privacidad de los datos a los que la regla de viaje expone a los VASP. Por mucho que los VASP intenten cumplir con la regla de viaje, deben asegurarse de que sus acciones se alineen con las leyes de Privacidad de datos de las jurisdicciones donde operan.","Lo primero que debe tener en mente es que es posible que deba renunciar a parte de su Privacidad para continuar interactuando con el mercado de Cripto .","También tendrás que saber al menos el nombre de tus beneficiarios y de quienes te envían los pagos. Y dado que todavía existen desafíos asociados con la regla de viaje, no se puede decir cómo las ineficiencias de cualquiera de los sistemas de cumplimiento afectarían su experiencia de usuario.","En la fase inicial de esta revolución regulatoria, es posible que no pueda ejecutar transacciones, dependiendo del estado de cumplimiento de su VASP y el de su contraparte.","Sigue leyendo: ¿Qué son las monedas de Privacidad y son legales?","CORRECCIÓN (27 de marzo, 10:46 UTC): Corrige el nombre del organismo de control a Grupo de Acción Financiera Internacional. Una versión anterior se refería a él como Fuerza Tributaria de Acción Financiera."],"entity":[{"type":"Shyft","content":"PERSON"},{"type":"el Grupo de Acción Financiera Internacional","content":"ORGANIZATION"},{"type":"Suiza","content":"ORGANIZATION"},{"type":"TRISA y TRP","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Estados Unidos","content":"ORGANIZATION"},{"type":"Grupo de Acción Financiera Internacional","content":"ORGANIZATION"},{"type":"$1000","content":"MONEY"},{"type":"7","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Ley de Secreto Bancario (BSA","content":"ORGANIZATION"},{"type":"Financial Crimes Enforcement Network ( FinCEN","content":"ORGANIZATION"},{"type":"como Fuerza Tributaria de Acción Financiera","content":"ORGANIZATION"}],"hashtag":["Learn","Intermediate","industry","FATF","Travel Rule","Anti-Money Laundering","Spanish"],"authors":["Andrey Sergeenkov"]}