{"summary":"Investors included Solana Ventures, 6th Man Ventures, and Shima Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156786\/indie-gaming-studio-bravo-ready-raises-3-million-seed-round","publishDate":"2022-07-12T05:55:09","id":1647,"type":null,"title":"Indie gaming studio Bravo Ready raises $3 million seed round","category":["METAVERSE & NFT"],"content":["Bravo Ready, an independent video game studio based in Montreal, Canada, has raised a $3 million seed round to accelerate game and software development.","Investors include Solana Ventures, 6th Man Ventures, and Shima Capital.","Bravo Ready created BR1: Infinite Royale, which allows gamers to pay $1 to spawn and earn SOL for every win. The survival-style game places new characters far away from other players with little access to items. As players continue to play, they encounter more players and items.&nbsp;","“In Web3 gaming, the game always needs to come first and the economic model has to support the game,\" said Jon Cohen, CTO &amp; co-founder of Bravo Ready, in a statement.","\"Providing tangible value for the time players spend in video games requires people to want to spend their time playing that game on a daily or weekly basis. Without a fun game that appeals to a wide audience, the most well thought out economic model will crumble under small demand.\"","The team is aiming to create more games while driving value for players in the ecosystem.","\"This isn’t just a new game – it’s a new way to game. It fundamentally reinvents the financial side of being a player,\" said Evan Ryer, CEO and co-founder of Bravo Ready. \"Our mission is to be at the crossroads of great games that people love and a business model that will drive value for all stakeholders, whether you are a gamer, audience member, content creator or game investor, the BR1 ecosystem is designed to drive incentive and reward all while creating a truly next level gaming experience.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"Bravo Ready","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"Evan Ryer","content":"PERSON"},{"type":"Montreal","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Jon Cohen","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"}],"hashtag":["SOLANA"],"authors":["Anushree Dave","The Block"]}