{"summary":"Sei interessato a investire in Cripto ma sei preoccupato per l'impronta di carbonio e i timori sul consumo di elettricità sollevati dai critici?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/can-crypto-go-green-how-to-invest-in-eco-friendly-cryptocurrencies\/","publishDate":"2022-01-25T15:21:21","id":16472,"type":null,"title":"Le Cripto possono diventare verdi? Come investire in criptovalute ecologiche","category":["Learn"],"content":["Ormai quasi tutti hanno sentito parlare di quanta energia consuma il mining Bitcoin . Solo per alimentare una singola transazione BTC sono necessari oltre 2.264 kilowattora (kWh) di elettricità, sufficienti per far bollire 1.500 bollitori. Ma non è solo Bitcoin ad avere questo problema. Anche altre criptovalute che utilizzano lo stesso meccanismo di consenso Proof of Work (PoW) affrontano lo stesso problema.","Poiché un numero crescente di investitori attribuisce maggiore valore alle aziende che enfatizzano i principi ambientali, sociali e di governance (ESG), in particolare la parte ambientale, i produttori di Criptovaluta potrebbero presto dover rispondere alla domanda: è possibile che le Cripto diventino ecologiche?","La crescente consapevolezza del consumo energetico delle criptovalute, la pressione di persone molto influenti come ELON Musk (che ha bloccato i pagamenti Bitcoin presso Tesla a causa dell'impatto ambientale della criptovaluta) e le repressioni in paesi importanti come la Cina stanno spingendo l'industria Cripto ad adattarsi.","In risposta a questi Eventi, progetti blockchain nuovi ed esistenti stanno esplorando tutto, dalla migrazione verso sistemi di validazione a minore consumo energetico all’esplorazione del mining basato sull’energia rinnovabile. Ethereum è forse ONE degli esempi più importanti di un importante progetto Criptovaluta che sta passando dal PoW a un sistema Proof-of-Stake ( PoS ), con l'obiettivo di ridurre il consumo energetico complessivo del 99,95% .","A differenza della PoW, la PoS seleziona i validatori in base al numero di token nativi del progetto che bloccano in uno smart contract di staking. Più token una persona blocca, maggiore è la possibilità che venga scelta dal protocollo per aggiungere nuovi dati alla blockchain.","Similmente al mining, i validatori scelti ricevono una quantità di token appena coniati come ricompensa per la loro partecipazione. ONE dei maggiori vantaggi di questo sistema rispetto Cripto mining è che i requisiti hardware sono significativamente più bassi, il che significa che più persone possono diventare validatori. Ciò, a sua volta, aumenta la decentralizzazione di un progetto e migliora ulteriormente la sicurezza della rete. Ha anche il vantaggio aggiuntivo di ridurre la quantità di energia necessaria per alimentare la rete.","Continua a leggere: Cos'è la Proof of Stake?","Ci sono anche crescenti incentivi finanziari per migliorare l’impronta di carbonio della Criptovaluta poiché le politiche ambientali hanno un peso maggiore nel processo decisionale degli investitori e i regolatori aumentano la loro attenzione sull’uso dell’energia Cripto .","Gli sviluppatori e i sostenitori Cripto stanno compiendo sforzi verso la sostenibilità dell’ecosistema blockchain e Cripto . Organizzazioni come Cripto Climate Accord , ad esempio, stanno lavorando per raggiungere l'obiettivo di far sì che tutte le blockchain siano alimentate da energia rinnovabile entro il 2025, e hanno persino prodotto un documento di audit di 32 pagine per calcolare l'impatto ambientale della Criptovaluta. In un rapporto pubblicato di recente, il Bitcoin Mining Council ha esaminato il 32% della sua rete e ha affermato che i suoi utenti stavano estraendo con un mix di energia rinnovabile del 67%.","Diversi fattori influenzano la sostenibilità e l’impatto ambientale di una Criptovaluta. Il consumo di energia è ONE degli aspetti citati più spesso, ma T è solo una questione di quale Criptovaluta utilizza più energia. È inoltre necessario tenere conto della combinazione di fonti da cui proviene l'energia.","Quante operazioni minerarie sono alimentate da fonti di energia rinnovabile, se ce ne sono? Che sistema di validazione utilizzano? Quanta attrezzatura fisica è necessaria per estrarre nuove monete?","Continua a leggere: Il dibattito frustrante, esasperante e divorante sull'energia Bitcoin","Operazioni minerarie come Equinor e Crusoe Energy hanno riconvertito le centrali elettriche convenzionali inutilizzate o il Gas in eccesso derivante dalle trivellazioni che di solito viene bruciato per alimentare le operazioni minerarie. I critici hanno sottolineato, tuttavia, che ciò T elimina le emissioni nocive, ma le trasferisce semplicemente a un settore diverso e potrebbe incentivare ulteriori trivellazioni.","Ci sono stati anche tentativi di utilizzare parchi solari o eolici per alimentare l’attività mineraria interamente con energia rinnovabile. La società tecnologica Lancium con sede a Houston, ad esempio, ha annunciato l’intenzione di investire 150 milioni di dollari in impianti minerari rinnovabili nel 2022. E sebbene ciò sia lodevole in teoria, potrebbe non essere finanziariamente possibile costruire impianti rinnovabili per alimentare una Criptovaluta che potrebbe inaspettatamente precipitare. valore . Il valore del Bitcoin tende a rimanere elevato anche se oscilla, ma altre criptovalute potrebbero non essere in grado di giustificare il costo di impianti energetici completamente nuovi semplicemente per estrarli.","Per colmare queste carenze, i creatori di nuovi sistemi Cripto e blockchain stanno invece cercando progetti più efficienti dal punto di vista energetico.","Alcune criptovalute più recenti hanno incorporato l'energia rinnovabile nel loro modello operativo, abbinandola a metodi di convalida alternativi per creare un token che utilizza molta meno energia rispetto ai suoi predecessori.","Queste sono solo alcune delle nuove criptovalute sviluppate pensando alla sostenibilità.","I progressi nei meccanismi di consenso e l’attenzione all’utilizzo di fonti di energia rinnovabile ridurrebbero il costo ambientale complessivo delle Criptovaluta e delle reti blockchain con un’ampia adozione. C’è ancora il problema dei rifiuti elettronici derivanti dalle operazioni di mining legacy da affrontare, ma le criptovalute non PoW ridurrebbero la domanda di costruire impianti di mining più nuovi e più grandi in futuro, riducendo potenzialmente tali rifiuti."],"entity":[{"type":"2025","content":"DATE"},{"type":"Cripto Climate Accord","content":"ORGANIZATION"},{"type":"quanta","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"dell","content":"ORGANIZATION"},{"type":"67%","content":"PERCENT"},{"type":"Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"Houston","content":"LOCATION"},{"type":"ESG","content":"LOCATION"},{"type":"nei","content":"ORGANIZATION"},{"type":"Equinor e Crusoe Energy","content":"ORGANIZATION"},{"type":"99,95%","content":"PERCENT"}],"hashtag":["industry","Intermediate","Italian"],"authors":["John Bogna"]}