{"summary":"Il recente caos attorno all'exchange centralizzato FTX ha suscitato domande sui pro e contro di mantenere le proprie monete su exchange centralizzati rispetto a quelli decentralizzati. Lo analizziamo.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/it\/learn\/centralized-exchange-cex-vs-decentralized-exchange-dex-whats-the-difference\/","publishDate":"2022-11-15T16:12:18","id":16479,"type":null,"title":"Exchange centralizzato (CEX) e Exchange decentralizzato (DEX): qual è la differenza?","category":["Learn"],"content":["Se stai pensando di acquistare o vendere Cripto, il tuo primo approdo sarà probabilmente un exchange. Più comunemente, il primo punto di accesso al trading Criptovaluta è un exchange centralizzato (CEX), un mercato digitale in cui avviene il trading Cripto . Probabilmente ne hai sentito parlare alcuni: Binance, Kraken, Coinbase e così via. Nel novembre 2022, uno scoop CoinDesk ha portato a una straordinaria svolta di Eventi che ha portato al collasso dell'ex popolare exchange FTX e alla dichiarazione di fallimento .","Ciò ha portato molti investitori in Cripto a cercare alternative agli scambi centralizzati. L’alternativa ovvia è un nuovo tipo di scambio decentralizzato come Uniswap e PancakeSwap . Questi scambi decentralizzati ripensano radicalmente il modo in cui gli scambi possono funzionare.","Vedi anche: Cos'è un token di scambio?","Negli ultimi cinque anni sono emersi scambi decentralizzati (DEX) per sfidare gli attuali CEX . In breve, i DEX mirano a offrire commissioni di transazione più basse, consentire agli utenti di detenere direttamente i propri asset ed evitare alcuni oneri normativi. D’altro canto, devono affrontare il costo di risarcire i loro fornitori di liquidità per un tipo speciale di rischio chiamato “perdita impermanente”.","Anche i CEX offrono vantaggi. La maggior parte delle borse centralizzate utilizza un modello di business simile alle istituzioni tradizionali come la Borsa di New York, che è una struttura che gli investitori tradizionali comprendono e con cui potrebbero sentirsi più a proprio agio. Le loro interfacce e app tendono ad essere più facili da usare e per principianti e generalmente offrono più liquidità e garanzie normative più forti, il che può essere particolarmente importante per i clienti istituzionali. Ma significa anche che la società centrale che gestisce l’exchange ha molto potere e responsabilità per la stabilità finanziaria e la salute dell’exchange.","Vedi anche: Come ottenere la tua ricchezza da uno scambio","Se il recente dramma attorno a FTX ti ha fatto prendere in considerazione l'idea di passare a un DEX, ecco cosa devi sapere.","I DEX mirano a completare le transazioni in modo più rapido ed economico rispetto alle loro controparti centralizzate. Lo fanno eliminando le entità intermediarie che accettano una riduzione delle commissioni di transazione sui CEX. Il whitepaper del 2018 del DEX più grande del mondo, Uniswap, proclama \"estrazione di rendita zero\". Ha lo scopo di proteggere i suoi utenti dai costi aggiuntivi legati alla generazione di profitti per gli intermediari che gestiscono i CEX. Bancor , lanciato nel 2017 e descritto come il primo DEX, sostiene l'approccio decentralizzato in questo modo:","“La liquidità sugli scambi di asset tradizionali è stata storicamente fornita da una piccola manciata di società commerciali professionali con accesso autorizzato e strumenti specializzati. Ciò concentra la liquidità nelle mani di pochi attori che possono ritirare i propri asset durante i periodi di volatilità e limitare la negoziazione di un asset quando gli utenti ne hanno più bisogno”.","Alla fine del 2021, il principale DEX Uniswap addebitava una commissione di transazione dello 0,05% su un’operazione di 100.000 dollari campionata dalla contabilità globale KPMG . I CEX Binance, Coinbase e Kraken addebitavano rispettivamente lo 0,1%, 0,2% e 0,2%.","I DEX utilizzano protocolli di “market Maker automatizzato” per determinare i prezzi degli asset senza che un organismo centralizzato orchestra le operazioni. Un approccio comune è il meccanismo del “prodotto costante”, che determina i prezzi offerti in funzione del rapporto tra le riserve totali del DEX di ciascuno degli asset coinvolti. Ciò ha il vantaggio di tendere a KEEP le riserve in relativo equilibrio: se un asset dovesse scarseggiare, diventerebbe estremamente costoso.","Tuttavia, i DEX tendono ancora a offrire per gli asset più o meno gli stessi prezzi dei CEX. Questo perché trader o bot attenti possono trarre rapidamente profitto da qualsiasi discrepanza nei prezzi attraverso l'arbitraggio . Se un determinato pool contenesse pochissimi ETH, dovrebbe consentire ai trader di vendere ETH nel pool a un prezzo più alto rispetto a quello indicato dal mercato più ampio. I trader potrebbero facilmente trarre profitto acquistandolo nel mercato più ampio e vendendolo nel pool. Così facendo, il volume nel pool aumenterebbe, riducendo il prezzo offerto fino a raggiungere il mercato più ampio.","Continua a leggere: Comprendere la Tecnologie dietro gli scambi decentralizzati","Per quanto accurato sia questo sistema, introduce un rischio per i fornitori di liquidità dietro il pool. Il rischio è chiamato perdita impermanente. I fornitori di liquidità hanno il diritto di ritirare la parte del valore del pool a cui hanno contribuito, non il numero esatto di token che hanno inserito. Non potrebbe promettere a tutti i fornitori i loro token esatti, perché il rapporto tra i diversi token detenuti nel pool cambia durante le negoziazioni. verificarsi. Ma man mano che il rapporto si adegua per riflettere gli attuali prezzi di mercato più ampi, il pool conterrà progressivamente sempre più token che stanno perdendo valore e viceversa.","Ciò significa che un fornitore di liquidità tenderà a ritirare una parte maggiore del token che ha perso valore e una parte minore di ONE che ha guadagnato valore, rispetto ai suoi asset iniziali. Pertanto, finiranno per diventare più poveri che se avessero semplicemente conservato i loro beni in privato. In pratica, i DEX generalmente compensano i fornitori di liquidità attraverso commissioni di transazione. Ma ciò significa addebitare tariffe più elevate di quelle di cui avrebbero altrimenti bisogno.","Un'altra parte del compromesso tra DEX e CEX dipende dal fatto che gli utenti preferiscano detenere direttamente la propria Cripto o affidarla all'exchange. I CEX in genere richiedono che gli utenti pongano le risorse in loro custodia prima della negoziazione.","Detenere personalmente i propri beni rispetta l'ideale di fiducia in se stessi che permea il settore Cripto . Hai il controllo completo ed esclusivo su di loro. D’altro canto, senza la dovuta attenzione, le chiavi private possono andare perse o distrutte, rendendo irrecuperabili i beni ad esse associati. Il gallese James Howells ha erroneamente buttato via un disco rigido nel 2013 e ha perso l'accesso a 7.500 bitcoin che varrebbero ben oltre 100 milioni di dollari a novembre 2022. Ha ripetutamente e senza successo fatto appello al consiglio locale per consentirgli di scavare la sua discarica.","La crescente popolarità dei DEX potrebbe in parte riflettere il loro successo nell’evitare alcuni ostacoli normativi. La società che costruisce un DEX evita di agire come intermediario finanziario o controparte e non deve soddisfare gli standard know-your-customer (KYC) o antiriciclaggio (AML) perché opera in modo autonomo. ShapeShift era un CEX fino a quando il suo CEO non ha dichiarato che la società ha perso il 95% dei suoi utenti a causa delle misure KYC che è stata costretta a implementare nel 2018. Nel 2021, Shapeshift ha decisamente cambiato direzione ed è diventato un DEX per scrollarsi di dosso questo problema.","I DEX potrebbero avere più difficoltà dei CEX quando lavorano con investitori più grandi. In questo momento, non possono ancora competere con i più grandi CEX in termini di dimensioni, quindi non possono offrire la stessa liquidità. Quando incontrano una liquidità insufficiente, gli ordini di grandi dimensioni possono affrontare costi aggiuntivi non pianificati chiamati “slippage”. Inoltre, gli investitori istituzionali si trovano ad affrontare gli ostacoli antiriciclaggio e altri ostacoli normativi e potrebbero avere difficoltà a gestire gli scambi che non si sottopongono a requisiti simili.","Sergej Kunz, co-fondatore dell'aggregatore di liquidità DEX 1inch Network, ha osservato l'anno scorso che le banche e gli hedge fund sono stati lenti ad impegnarsi con la Finanza decentralizzata ( DeFi ) a causa dei loro stessi ostacoli normativi. Sebbene si tratti di un DEX, la sua azienda prevede ora di lanciare un prodotto conforme chiamato 1INCH Pro, appositamente per soddisfare questi clienti.","Nuovi protocolli aggregatori come 1INCH sono emersi appositamente per aiutare gli investitori più grandi a evitare problemi di liquidità quando utilizzano i DEX. 1INCH ha raccolto 12 milioni di dollari nel 2020 in un round di finanziamento guidato da Pantera Capital.","L’ascesa degli aggregatori significa in realtà che gli utenti possono accedere alla liquidità da DEX e CEX allo stesso tempo. Il protocollo DiversiFi, che è esso stesso un DEX, aggrega la liquidità di entrambi i tipi di scambi per aiutare i suoi utenti a concludere operazioni più grandi in modo più efficiente. Ciò aiuta gli investitori a evitare i costi derivanti dal fatto che la liquidità di uno scambio si rivela troppo piccola per il loro ordine.","Quando si tratta di decidere quale tipo di scambio utilizzare, si riduce a due cose: se sei interessato principalmente alla facilità d'uso e ti senti a disagio nell'avere il controllo totale del tuo portafoglio, allora un CEX è probabilmente l'opzione migliore Per te. Se per te sono più importanti commissioni più basse e un maggiore controllo sui tuoi fondi, allora un DEX è la strada da percorrere. Qualunque sia la tua strada, assicurati di sapere come portare le tue Cripto da un exchange e metterle in celle frigorifere per KEEP la tua ricchezza al sicuro a lungo termine.","Vedi anche: Perché gli scambi decentralizzati sono importanti nell'economia Cripto"],"entity":[{"type":"Uniswap e PancakeSwap","content":"ORGANIZATION"},{"type":"Coinbase e Kraken","content":"ORGANIZATION"},{"type":"James Howells","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"0,05%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"dell","content":"ORGANIZATION"},{"type":"0,2%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"0,1%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"quelle","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Sergej Kunz","content":"PERSON"}],"hashtag":["industry","Beginner","Learn","Italian"],"authors":["Benedict George","Toby Bochan"]}