{"summary":"It's the first step on a more ambitious roadmap to transform how Ethereum's biggest wallet works under the hood.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/06\/popular-crypto-wallet-metamask-rolls-out-smart-transactions-to-combat-ethereum-front-running\/","publishDate":"2024-05-06T13:14:11","id":16480,"type":null,"title":"Popular Crypto Wallet MetaMask Rolls Out 'Smart Transactions' to Combat Ethereum Front-Running","category":["Technology"],"content":["MetaMask, the most popular crypto wallet for Ethereum, is rolling out a new feature this week designed to help users avoid the consequences of maximal extractable value, or MEV.","The optional new feature, called Smart Transactions, will allow users to submit transactions to a \"virtual mempool\" before they are officially cemented on-chain. According to Consensys, the company behind MetaMask, the virtual mempool will protect against certain kinds of MEV strategies, and it will run behind-the-scenes simulations of transactions to help users get lower fees.","MEV is extra profit that blockchain operators can extract from users by previewing or re-ordering transactions before they are written to the network, sometimes likened to the unsavory practice of front-running orders in traditional financial markets. MEV has a major impact on how Ethereum operates – boosting prices for users, slowing down transaction speeds, and even causing transactions to fail under certain network conditions.","\"There's $400 million every year that are being wasted on reverting transactions, stuck transactions, and just very obviously predatory MEV front-running and sandwich attacks,\" Jason Linehan, director of the Special Mechanisms Group division of Consensys, said in an interview.","\"Everyone agrees it's a huge problem,\" said Linehan. \"From a user experience perspective, the idea that you pay for a transaction that does nothing, that's, like, nonsensical.\"","MetaMask's solution – its virtual mempool – bears some resemblance to a private mempool, which has become an increasingly popular strategy for ensuring transaction privacy and protecting against MEV. It's the platform's first step in a much more ambitious roadmap, which CoinDesk reported on earlier this year, to radically shift how MetaMask routes transactions to Ethereum under the hood.","Read more: MetaMask's Secret Project Could Shake Up How Ethereum Works","Private mempool services can sometimes raise centralization concerns since they allow middlemen to touch transactions before they are published to Ethereum. Consensys insists its virtual mempool is different, and is necessary for addressing Ethereum's large hidden costs.","\"We're not going to try to take over Ethereum or something,\" said Linehan, \"but there's no way that this becomes the base layer for the future of the global economy if it's wasting $400 million of its users' money every year on things that literally do nothing for them. That's pure waste.\"","When a user tells a blockchain wallet to submit a transaction to a chain like Ethereum, they are typically sending that transaction to a public mempool – a waiting area for yet-to-be-confirmed transactions operated by a decentralized network of bots and traders. \"Block builders\" and \"searchers\" work together to assemble transactions into bundles, called blocks, which eventually get written to the blockchain's digital ledger.","Builders and searchers scour the mempool for profitable trading opportunities and will sometimes re-order transactions or squeeze their own trades into blocks to extract an extra profit for themselves. This phenomenon, \"maximal extractable value,\" can sometimes lead to higher costs, failed transactions and slow-downs for everyday blockchain users.","Metamask will leverage some of these same operators – builders and searchers – to power its virtual mempool. Unlike on Ethereum's public mempool, the virtual mempool's builders and searchers will be financially penalized if they fail to execute transactions at the prices quoted by MetaMask to users.","Linehan says \"95%\" of the builders and searchers that currently operate Ethereum have already opted into its virtual mempool program, which will begin rolling out in phases over the course of this week. A more limited version of the tech, \"Smart Swaps,\" has already been available for several months.","The size of MetaMask's virtual mempool network – combined with its transparent inner workings and novel incentive scheme – makes it wholly unique from conventional private mempools, said Linehan.","In addition to ensuring better prices for users, Linehan says that the Smart Transactions feature will make it easier for users to track the progress of their transactions directly from within MetaMask – something that typically would've required users to visit a separate \"block explorer\" website like Etherscan.","Linehan describes Smart Transactions as a \"concrete first step,\" towards MetaMask's grander vision. \"It establishes the rails along which we might in the future start to build some of these other interesting use cases that people have buzzed about, like intent-based architectures.\"","Edited by Bradley Keoun."],"entity":[{"type":"Linehan","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Jason Linehan","content":"PERSON"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"Special Mechanisms Group","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"95%","content":"PERCENT"}],"hashtag":["MetaMask","Wallet","ConsenSys","MEV","Ethereum"],"authors":["Sam Kessler"]}