{"summary":"Arbitrum began rolling out the Nitro upgrade on its testnet on July 25. \nIf the test goes successfully, Arbitrum will bring Nitro to its mainnet within a few weeks. \nNitro will increase speed and decrease fees on Ethereum’s largest L2 rollup. ","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160101\/arbitrum-testing-nitro-upgrade-ahead-of-mainnet-launch","publishDate":"2022-07-29T04:47:03","id":1648,"type":null,"title":"Arbitrum testing Nitro upgrade ahead of mainnet launch","category":["Layer 2s and Scaling"],"content":["Arbitrum has begun testing its Nitro upgrade and, assuming the test goes well, will implement it within a few weeks. The upgrade is designed to increase the number of transactions the network can process while lowering costs. &nbsp;","Arbitrum is the most widely adopted scaling solution on Ethereum. It currently ranks first overall in Total Value Locked (TVL) — the measure of value held in a protocol’s smart contracts — for optimistic rollups and #7 across all blockchains.&nbsp;&nbsp;&nbsp;","The launch of Nitro will be a pivotal moment for Ethereum because it will make one of its major scaling solutions even more efficient. By supporting even faster and cheaper transactions, Abritrum will further help the network to be more scalable.&nbsp;","“Nitro will allow us to increase the demand significantly to many times Ethereum’s&nbsp;capacity. That will massively increase our ability to scale,” Arbitrum CEO Steven Goldfeder told The Block.&nbsp;","“Our mission is to provide the best scale to users and scale Ethereum using the best technology today, meaning scaling Ethereum's security and scaling Ethereum's decentralization,” he added. &nbsp;","Nitro implements a new prover using WebAssembly (WASM). This is the part that generates proofs of transactions in case they are disputed. The WASM implementation enables the writing and compiling of the L2 Arbitrum engine (the Arbitrum Virtual Machine)&nbsp;with standard tooling and languages — replacing the current custom-designed language and compiler.&nbsp;","\"Onboarding for developers was already super easy as Arbitrum has always been fully EVM compatible. With Nitro, even the internals are the same. Imagine that Arbitrum and Ethereum are cars. With Arbitrum classic, we built a beautiful car that looks, feels, and drives just like the Ethereum car. But if you pick up the hood, it looks very different. In the hood of the Arbitrum car is the AVM (Arbitrum Virtual Machine). With Nitro, even the internals are the same,\" explained Steven. &nbsp;","Geth, the most popular Ethereum Client, will&nbsp;be directly compiled into Arbitrum, mitigating the need for developers to&nbsp;optimize transaction fee pricing, making developer onboarding even more seamless than before.&nbsp;","Nitro is the latest development emerging out of the Ethereum rollup space as the entire industry prepares for <a href=\"https:\/\/www.theblock.co\/post\/160112\/ethereum-developers-announce-date-for-goerli-testnet-merger\" data-v-f87c67ca=\"\">The Merge<\/a> in Q4 of this year.&nbsp;&nbsp;","After the Nitro upgrade, Arbitrum will&nbsp;roll out <a href=\"https:\/\/medium.com\/offchainlabs\/introducing-anytrust-chains-cheaper-faster-l2-chains-with-minimal-trust-assumptions-31def59eb8d7\" data-v-f87c67ca=\"\">Anytrust Chains<\/a>, which are intended to help applications with specific needs (such as gaming) to maintain the same level of security as Ethereum’s main blockchain while lowering costs and throughput for their applications.&nbsp;"],"hashtag":["ARBITRUM","ETHEREUM"]}