{"summary":"The traditional financial system is a tool that can be used both against fellow citizens and despicable enemies.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/03\/03\/monetary-weapons-4-lessons-from-canada-and-russia\/","publishDate":"2022-03-03T23:10:18","id":16486,"type":null,"title":"Monetary Weapons: 4 Lessons from Canada and Russia","category":["Consensus Magazine"],"content":["Just when fear of the latest COVID-19 variant was waning and long-term planning was starting to seem possible again, February brought unsettling episodes that shattered dreams of lasting peace and normality. Money played a crucial part in these episodes.","In Canada, we saw a Liberal government invoking for the first time the federal Emergencies Act, enacted in 1988, to end disruptions caused by protestors blocking borders and streets with trucks. Among other measures, the government ordered banks, financial institutions and even crypto exchanges to freeze personal and corporate accounts suspected of sending contributions to protestors, eliminating the need to obtain a court order and the risk of later being sued for abuse.","Marcelo M. Prates, a CoinDesk columnist, is a lawyer and researcher helping shape the future of money and payments.","It didn’t matter whether you were transferring C$10 (US$7.89) or C$100,000 or paying for legitimate services provided a week ago: Send money to a targeted account and yours might end up frozen, too. A democratic government indiscriminately depriving its citizens of money as a sanction for supporting a protest shouldn’t be taken lightly – even after the emergency declaration was revoked. But this action paled in comparison to what was about to happen.","In the last weekend of February, reacting to a dreadful invasion of Ukraine, the U.S. and the European Union, among others, decided to impose sanctions on Russia. By executive order, political leaders decided to prevent the Russian central bank from using hundreds of billions of dollars of its international reserves – an unprecedented move in its breadth and intensity.","These reserves are safe and liquid assets denominated in foreign currencies, usually U.S. Treasury bonds, that a central bank keeps deposited around the world to support its country’s international transactions. Without international reserves, neither the government nor the private sector can import goods or services, from software and clothing to much-needed medicine and consumer goods that aren’t produced locally.","Read More: Bitcoiners Were Right: Weaponized Finance Just Created a Post-Dollar Planet","Cutting a country’s access to its international reserves amounts to unplugging it from the rest of the world: The longer the sanction lasts, the more isolated the country becomes and the scarcer essential goods and services get. It’s an extreme measure that affects all citizens, no matter their political preferences.","It’s still early to understand all the implications of these episodes, but some lessons can start to be drawn. First, and perhaps most sobering, money is a weapon that can be used both against fellow citizens and despicable enemies.","As a weapon, money needs better governance. We have to think harder about the powers a money issuer, public or private, has. Should money issuers, from states to stablecoin creators, be able to restrict access to the money we legitimately hold? Under which circumstances?","Read More: Bitcoin Is 'Armageddon Insurance'? | The Node","This concern grows stronger when we realize digital money is the money that matters most. The long lines outside ATMs in Russia and Ukraine are a reminder that banknotes and coins aren’t always available. Unless you have your mattress permanently stuffed with cash, you’ll run out of it in no time when times are tough.","In the end, we don’t really “hold” the bulk of our money. It’s held for us, somewhere in a computer that can be blocked, hacked or stolen. The technological and institutional protections around this computer represent the thin line that separates monetary order from chaos – and this is true for all digital currencies, from bank deposits and central bank digital currencies (CBDC) to stablecoins and crypto.","Second lesson: Monetary anonymity is a fallacy, not a solution. Against the Canadian background, it’s easy to argue that anonymous money would be the way to go. Wrong. Anonymous money in these circumstances would only give authorities more reasons to broaden their intervention and issue blanket bans.","That doesn’t mean we need fully transparent money to satiate the desires of a surveillance state. It means money transactions should run on a system of partial identification and protected identity, following David Birch’s ideas. If a decentralized pseudonymous bitcoin (BTC) type of coin seems too far-fetched for any sovereign currency, a decentralized pseudonymous identity should be allowed in money transactions.","Instead of providing your tax identification number and your personal details to open a bank account, for example, you’d digitally send the bank a code generated by a decentralized database holding the details of your identity. Every time you needed to prove your identity or a personal detail (like your age, nationality or monthly income), the decentralized database would authenticate your access and release the required information.","But only under certain conditions (say, a court order) would the database disclose your full identity.","Third, cryptocurrencies can offer a way out for those being attacked and also for regular people who disagree with the actions taken by their tyrannical government. Think about a Russian family who doesn’t feel safe in Russia anymore or simply doesn’t want to pay the price for the government’s lunacy. If they hold at least part of their savings in crypto, they have a chance of escape.","Sure, crypto can be volatile and isn’t widely accepted or easily used for everyday payments. But try fleeing a country at war with gold in a suitcase or making payments with rubles in a couple of weeks if this tragedy lingers. In these cases, crypto has only to be better than the alternatives – and it is.","See also: Into the Money-verse: Central Banks Under Siege in 2028","Finally, cryptocurrencies proved they can be valuable also for sovereign governments. The Ukrainian government asked for – and received – financial support via crypto donations. If crypto can provide some relief to a country being brutally attacked by a powerful neighbor, its social value becomes indisputable: it can be used against criminals.","More than that. As the freezing of the Russian international reserves raises doubts about how safe and liquid these reserves ultimately are, central banks might have started pondering if the time to add cryptocurrencies to their reserves’ portfolio has arrived.","Between securities controlled by foreign governments and cumbersome gold bars, crypto could end up offering a reasonable option."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"European Union","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"David Birch","content":"PERSON"},{"type":"2028","content":"DATE"},{"type":"19","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"C$10 (US$7.89","content":"MONEY"},{"type":"Weaponized Finance Just Created","content":"ORGANIZATION"},{"type":"1988","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"C$100,000","content":"MONEY"},{"type":"last weekend of February","content":"DATE"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Ukraine","Canada","Russia","Banking Regulation","Regulation"],"authors":["Marcelo Prates"]}