{"summary":"Law enforcement agencies will no longer need to wait for an arrest to seize crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/25\/uk-law-enforcement-agencies-can-now-seize-crypto-more-easily-as-new-rules-take-effect\/","publishDate":"2024-04-25T23:01:00","id":16482,"type":null,"title":"UK Law Enforcement Agencies Can Now Seize Crypto More Easily as New Rules Take Effect","category":["Policy"],"content":["New powers that will help law enforcement agencies seize crypto used for crime came into effect on Friday, the U.K Home Office said in a press release.","As a result of these new rules, police in the country will no longer be required to make an arrest before seizing crypto holdings, the Home Office announced. The new rules came after the U.K. Parliament passed a crime bill last year, which laid the foundations for crypto to be seized more quickly.","\"This will make it easier to take assets which are known to have been criminally obtained, even if sophisticated criminals are able to protect their anonymity or are based overseas,\" Friday's press release said.","The police has stationed crypto tactical advisors across the country and has already seized hundreds of millions of pounds worth of crypto. In January, the National Crime Agency worked with the U.S. Drug Enforcement Administration to investigate a drug enterprise which led to $150 million in cash and crypto being seized.","\"It is vital that investigators and prosecutors have the capability and agility to keep pace with this changing nature of crime which these new measures will greatly assist our ability to restrain, freeze, or eliminate crypto assets from illegal enterprise,\" said Chief Crown Prosecutor Adrian Foster in the press release.","Officers will also be able to transfer the crypto into a wallet controlled by law enforcement agencies. They will be able to destroy crypto assets \"if returning it to circulation is not conducive to the public good.\"","The press release pointed to privacy coins as an example of an asset type where seized coins may be destroyed.","\"These reforms will also enhance our national security,\" Home Secretary James Cleverly said in the statement. \"Terrorist organizations like Daesh are known to raise funds through crypto transactions and these updated powers will enable our agencies to more easily strip them of their assets.\"","Read more: UK Crime Bill Lets Cops Freeze Crypto Faster, Channels Tainted Assets to Public Funding","Edited by Nikhilesh De."],"entity":[{"type":"James Cleverly","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"Adrian Foster","content":"PERSON"},{"type":"Daesh","content":"PERSON"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Home Office","content":"ORGANIZATION"},{"type":"U.K Home Office","content":"ORGANIZATION"},{"type":"U.S. Drug Enforcement Administration","content":"ORGANIZATION"},{"type":"UK Crime Bill Lets Cops Freeze Crypto Faster","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"National Crime Agency","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["Regulations","Crypto","UK"],"authors":["Camomile Shumba"]}