{"summary":"Evmos&#x27; shift aims to reduce technical challenges and enhance development efficiency by dropping the need to maintain two transaction formats.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261855\/evmos-plans-to-deprecate-cosmos-transactions-signals-ethereum-alignment","publishDate":"2023-11-07T03:41:04","id":1649,"type":null,"title":"Evmos plans to deprecate Cosmos transactions, signals Ethereum alignment","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The core team at Layer 1 blockchain <a href=\"https:\/\/www.theblock.co\/post\/143771\/evmos-launches-blockchain-to-bring-ethereum-virtual-machine-to-cosmos\" data-v-f87c67ca=\"\">Evmos<\/a>, which facilitates the integration of Ethereum smart contracts within the Cosmos network, is planning to discontinue support for Cosmos transactions to focus exclusively on Ethereum-based transactions. This means the core network will support only Ethereum-based wallets and tools instead of those designed for Cosmos.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The transition to a single transaction format is expected to streamline the development workflow and improve the efficiency of Ethereum wallets on the network. <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Evmos <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257160\/evmos-evmos-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/evmos.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">EVMOS<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -5.39%\n    <\/span><\/a> <!----><\/span><\/span> announced a phased discontinuation of Cosmos transactions, targeting full completion by the third quarter of 2024.<\/span><\/span>","Evmos’ team has grappled with the dual challenge of maintaining compatibility for both Cosmos and Ethereum clients, according to the team. The network currently supports distinct transaction hashes for each ecosystem, a complexity the team plans to eliminate.","While Cosmos transactions cater to essential network operations like staking and governance, Ethereum transactions facilitate interactions with dApps via the Ethereum Virtual Machine on Evmos.","The strategic move to an EVM-centric transaction approach will allow the Evmos team to focus on simplification. The change is also anticipated to ease the workload for developers of wallets and blockchain explorers by removing the necessity to support two transaction formats.","The inherent distinction between Cosmos and Ethereum transactions, particularly the presence of two types of transaction hashes, adds complexity for wallet and explorer developers, as the team explained. For instance, this differentiation prevents Cosmos transactions from being indexed by EVM-based wallets, which in turn hinders the user experience. With this shift, the Evmos team will need to maintain less infrastructure, thereby allowing them to concentrate on enhancing the EVM user experience and interoperability.","Evmos will maintain the core Cosmos functionalities, such as staking and token transfers through <a href=\"https:\/\/www.theblock.co\/post\/230772\/evmos-unveils-evm-extensions-to-boost-cosmos-interoperability\" data-v-f87c67ca=\"\">EVM Extensions<\/a>, preserving uninterrupted access for users and developers to these features.&nbsp;","<span data-v-f87c67ca=\"\">“With the decision to maintain only compatibility with Ethereum-type transactions, we aim to increase our operational efficiency, align more closely to Ethereum developers and ship value to our users faster, while still supporting the core functionalities like staking, governance and interoperability that make Cosmos unique via our EVM Extensions,” Evmos co-founder Federico Kunze Küllmer said.<\/span>","<span data-v-f87c67ca=\"\">Kunze Küllmer added that<\/span> Cosmos' native cross-chain interoperability protocol, IBC, will continue to receive full support and enhancements from Evmos.&nbsp;","<span data-v-f87c67ca=\"\">With the transition, fees from the phased-out Cosmos transactions will be burned, marking a phased cessation of Cosmos transactions. Users with Cosmos-only wallets will be needed migrate to EVM-compatible clients, with popular wallets like WalletConnect, Rabby, and MetaMask offering the necessary support. Furthermore, hardware wallets such as Ledger will remain supported through their dedicated Ethereum applications.<\/span>","<span data-v-f87c67ca=\"\">Evmos is part of the Cosmos network — an interoperability network hosting over 50 unique Layer 1 blockchains. Evmos’ original objective was to allow users to deploy Ethereum-based smart contracts and assets and to facilitate their use within the Cosmos ecosystem. To fulfill this, the project has so far upheld compatibility with two types of network hashes, one for Cosmos and another for Ethereum.<\/span>","<span data-v-f87c67ca=\"\">Last year, the project <a href=\"https:\/\/www.theblock.co\/post\/182223\/evmos-developers-raise-27-million-in-a-token-sale-led-by-polychain\" data-v-f87c67ca=\"\">raised<\/a> $27 million in a token sale round led by Polychain Capital, with the valuation remaining undisclosed.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"-5.39%","content":"PERCENT"},{"type":"Cosmos","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"third quarter of 2024","content":"DATE"},{"type":"Evmos","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine on Evmos","content":"ORGANIZATION"},{"type":"Cosmos","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Rabby","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Federico Kunze Küllmer","content":"PERSON"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}