{"summary":"As central bank digital currencies have risen up the policy agenda, myths have emerged to confuse what they can and can't deliver.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/08\/13\/4-myths-about-cbdcs-debunked\/","publishDate":"2020-08-13T14:20:26","id":16503,"type":null,"title":"4 Myths About CBDCs Debunked","category":["Policy"],"content":["","Although the terminology of central-bank digital currencies (CBDCs) is becoming increasingly confusing, when we talk about CBDCs we’re talking about a type of money with at least three features:","","","The CBDC is, thus, a conceptual type of money that hasn’t yet been created, except for some limited prototypes. But myths surrounding CBDCs are already piling up.","","","No, Ecuador wasn’t the first country to issue a CBDC. Ecuador did have a bad experience with a so-called sovereign digital currency, the “Sistema de dinero electrónico,” or electronic money system, launched in December 2014. The official promise was that regular people could open digital accounts at Banco Central del Ecuador (BCE) and, with the help of a cell phone, spend or transfer money deposited in these accounts.","","","But “money,” in this case, was U.S. dollars, as Ecuador had dollarized its economy in early 2000. So “dinero electrónico” has never been a true sovereign currency digitally issued by the Ecuadorian central bank. “Dinero electrónico” was instead an attempt to create digital dollars. The BCE exchanged U.S. dollar bills and coins deposited by the public for a digital representation denominated in dollars that could allegedly be used by the depositor, with no loss of value, to make payments and transfer funds electronically.","","","See also: Ajit Tripathi - 4 Reasons Central Banks Should Launch Retail Digital Currencies","","","The main problem with this monetary scheme was allowing, at least in theory, the BCE to circumvent the dollarization, namely by ditching the parity between the amount available in the digital accounts and the amount of US dollars kept deposited. This concern contributed to public distrust and, ultimately, to the failure of the experiment. Street protests against “dinero electrónico” were common, with people holding signs that read “I don’t believe in your imaginary money.”","","","During the three years of operation, 400,000 accounts were opened with the central bank, but more than 70% of the accounts were inactive in late-2017. In December 2017, Ecuador’s legislature passed a law ending the digital-currency program, and the central bank was then ordered to close all digital accounts by April 16, 2018.","","","The tokenized CBDC is the second myth. If “tokenized” means using technology to scramble some data associated with the CBDC to transmit or store this information securely, fine. But if “tokenized” implies that a CBDC can or should have cash-like characteristics, we have a problem.","","","Why would we want a CBDC, or any digital asset for that matter, to mimic a physical object? It seems paradoxical to develop a series of arguments in favor of issuing sovereign money in the digital format – like improving monetary policy and enhancing financial stability – and then conclude this digital money should work as a token. If all we want is a tokenized form of money, we already have cash.","","","Cash is tokenized money because it carries in itself all the information needed to make a payment or transfer, and the monetary transaction is final when the token changes hands. With cash, the settlement is immediate and bilateral, without any intermediary intervention. It’s truly peer-to-peer. In payments or transfers using CBDCs, the transaction needs to be recorded in a ledger to indicate that some units of CBDC moved from one account or wallet to another. Some intermediation, even if decentralized, is needed for the transaction to be settled. It can’t be peer-to-peer.","","","It may be technologically feasible to authenticate a certain number of CBDCs that can be verified and accepted as legitimate, even when digital accounts or wallets are offline. But this process can only defer, not avoid, the settlement of the transaction with digital currency. At some point, the balances of the digital accounts or wallets must be reconciled and informed to all those keeping track of the transactions in the network, be they central banks or bitcoin miners. Otherwise, it’s impossible to determine who owns what.","","","Without reliable records, no one can know for sure whether the units of CBDC you’re trying to spend are really yours or whether you transferred these units from your wallet to another wallet 10 minutes ago. Therefore, the distinction between token-based and account-based CBDCs is particularly artificial. No digital currency, CBDCs included, can be token-based because none can be exchanged without intermediation and record keeping. Only cash can do the trick.","","","The third myth relates to the argument that, if central banks are to offer a digital currency to the public, they’ll have to observe anti-money-laundering (AML) and know-your-customer (KYC) rules. ","","","AML\/KYC rules exist for public authorities to gain access to financial information they wouldn’t otherwise know. Financial institutions were legally enlisted as gatekeepers to help combat illegal activities because they’re the ones with direct access to financial transactions’ records.","","","Once a public authority, the central bank, is the recipient of the financial information related to transactions conducted through the CBDC digital accounts or wallets, no more record keeping or reporting by third parties is needed. It would then be easier for the public authorities to follow and even restrict suspicious transactions – based, for example, on the amount transferred or the location of the counterparties, impeding transactions outside the sovereign territory. ","","","See also: Central Banks Mull Creating a CBDC, but Not on a Blockchain: Survey","","","With a CBDC, AML\/KYC rules wouldn’t be a matter of private institutions being statutorily required to share information with public authorities. These rules would instead be a framework for institutional collaboration between the central bank and fiscal and law enforcement authorities to inhibit suspicious monetary transactions. If, then, a person or entity wanted to apply for an official digital account or wallet to use CBDCs, the central bank shouldn’t be so quick to deny service on the grounds of “not knowing the customer.”","","","From countering illicit activities to advancing financial inclusion, the central bank would have good reasons to take as many “customers” as possible, easing initial AML\/KYC checks. The collection of information to set up a new digital account or wallet should be kept simple, creating an incentive for anyone to use the official CBDC channels. ","","","If the digital account or wallet were later used for suspicious transactions, the central bank would have the tools to react accordingly: the account or wallet could be temporarily restricted and the potentially illegal action, reported to law-enforcement authorities for further investigation, all subject to judicial review.","","","This assessment of AML\/KYC rules doesn’t imply that it’s impossible to have privacy when using CBDCs. With technology and well-designed rules we can build a robust framework for privacy protection with a CBDC. But first, we have to acknowledge, debunking the fourth CBDC myth, that the time for absolute monetary privacy, like secret Swiss bank accounts, is over. ","","","See also: Igor Mikhalev & Kaj Burchardi - Central Bank Digital Currencies Need Decentralization","","","Start with tech. The individual details of all transactions using CBDC must be encrypted by default and not be available to third parties, public or private. Then add the law. Transactions with CBDCs should be completely anonymous up to a certain amount – say, $3,000 per month. Everyone, even a foreigner, should be able to set up a digital account or wallet and use CBDCs up to that amount, even without producing an official identification. A phone number or email address would suffice.","","","Over this threshold, presenting some official identification when setting up the digital account or wallet would be required. But all identified CBDC users would have full privacy in their account or wallet, guaranteed by encryption. Monetary privacy would be relative, though, as it could be lifted, and the encryption broken, with a court order and under specific legally defined circumstances. ","","","Finally, violations of these rules should be criminal offenses, resembling the current legal framework, which protects, with much success, fiscal and financial information of individuals and businesses. CBDCs, like any other digital currency, need some kind of validation when transacted and, in turn, will inevitably leave a trail. That doesn’t mean that anyone should be able to see this trail. With technology, legal rules, and judicial protection, monetary privacy with CBDCs can be assured.",""],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Kaj Burchardi","content":"PERSON"},{"type":"Igor Mikhalev","content":"PERSON"},{"type":"2000","content":"DATE"},{"type":"BCE","content":"ORGANIZATION"},{"type":"April 16, 2018","content":"DATE"},{"type":"December 2017","content":"DATE"},{"type":"4 Reasons Central Banks Should Launch Retail Digital Currencies","content":"ORGANIZATION"},{"type":"Ajit Tripathi","content":"PERSON"},{"type":"Ecuador","content":"LOCATION"},{"type":"Central Bank Digital Currencies Need Decentralization","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"December 2014","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Banco Central del Ecuador (BCE","content":"ORGANIZATION"}],"hashtag":["Opinion","CBDCs"],"authors":["Marcelo M. Prates"]}