{"summary":"Crypto’s significance as an election issue remains non-existent or at best negligible.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/24\/whats-at-stake-for-crypto-in-india-as-the-worlds-largest-democracy-is-in-the-midst-of-its-national-election\/","publishDate":"2024-04-24T07:51:04","id":16502,"type":null,"title":"What’s at Stake for Crypto in India as the World’s Largest Democracy Is in the Midst of Its National Election?","category":["Policy"],"content":["India’s general election in 2024 is not expected to immediately affect crypto policy, and its current – restrictive – rules are expected to continue on through the upcoming Parliamentary term.","The world’s most populated country and the fastest growing major economy kicked off its multi-phased elections this month, with results expected on June 4, 2024. Several industry analysts told CoinDesk they don't expect any changes to crypto policy after the next term's lawmakers are elected, resulting in the near-term continuation of rules that have stifled the nation's digital asset ecosystem.","Prime Minister Narendra Modi, 73, is aiming for a third five-year term as the face of the ruling Bharatiya Janta Party (BJP), and is overwhelmingly expected to win the elections, pre-election surveys have shown.","Such is his expected dominance that the Indian National Congress (INC), the major opposition party and several regional parties, around 40 in total, have come together to form a coalition called I.N.D.I.A (Indian National Developmental Inclusive Alliance) to fight him.","The election is for 543 seats in the lower house of Parliament, referred to as the Lok Sabha. The party or alliance with the most seats would select the country's prime minister and form a government.","Crypto’s significance as an election issue remains non-existent or at best negligible. Web3 remains esoteric for an overwhelming majority of the voting population. Even the fact that India has implemented a steep tax deducted at source on crypto transactions (1% on every transaction) is unlikely to play a role in this year's election in any major way.","Issues such as lack of jobs, a Hindu-nationalist agenda against a constitutionally enshrined secularism, alleged marginalization of minorities, the role of electoral bonds, institutional independence and agrarian policies have dominated the headlines, making sure that crypto is not even a political talking point.","“Indian elections are still focussed mainly around socio-political issues,” said Kiran Vivekananda, Chief Public Policy officer at one of India’s largest cryptocurrency exchanges, CoinDCX. “Technology has started becoming an agenda item but is more from the setting up [of a] manufacturing base in India and the job-creation lens.”","Yet, Vivekananda expressed hope that the incoming government would work more closely with the industry to understand its challenges, provide solutions and protect the interests of citizens. However, other entrepreneurs believe more needs to be done by the Indian crypto industry.","“Developments in the U.S. show that crypto can indeed become a political talking point, influencing policy and voter choices,” said Ashish Khandelwal, founder of Anq, a digital banking platform and a person who has been engaging with legislators. “To mirror the U.S., the Indian crypto industry needs to highlight how the tech can offer more than just investment opportunities, creating awareness around tangible benefits.”","Neither major party, Modi’s BJP nor the INC, have mentioned the words cryptocurrency, blockchain or Web3 in their manifestos. However, this isn’t necessarily reflective of their plans toward the ecosystem. Indian government and political stakeholders, like other nations, have often used euphemisms to refer to the crypto-related space.","The ruling BJP’s manifesto said the party would educate senior citizens to avoid digital scams, take stringent action against those who threaten the nation’s digital sovereignty and would develop “Digital Public Infrastructure to remove information asymmetry in agriculture.”","The Congress Party (another name for INC) said it would give farmers the option to upload the sale-and-purchase agreement of the produce on a “digital ledger” and “work on digital\/cybersecurity issues that may threaten India's digital financial infrastructure.”","So far, during Modi's second term, his crypto-related policies included stiff taxes including a 30% tax on profits from selling digital assets, no off-setting of losses, a 1% tax deducted at source for every transaction and mandated registration of exchanges with India’s anti-money laundering and terrorist financing watchdog. These policies and other enforcement related actions brought the industry to its knees.","Only the recent bull run and the government’s banning of off-shore exchanges at the nudging of India’s crypto policy advocacy body appears to have brought some respite to the industry.","The Modi government “has consistently maintained a lukewarm stance towards cryptocurrencies,” putting in place a “patchwork of regulations,” said Mohit Chawdhry, a fellow at the Esya Centre Think Tank which has extensively researched how the crypto policies have so far impacted the industry.","A weak opposition party has not framed a comprehensive position on crypto policy, though at this point it is simply fighting for survival against the Modi juggernaut.","Regardless of how Parliament shakes out, India’s Web3 policies are expected to remain largely unchanged in the near future.","In the more likely scenario of Modi winning, his policies are expected to continue, and even if they would be updated, crypto is unlikely to be an immediate priority. Modi’s government has made no public indications that once it comes to power, crypto policy may be updated.","In another, less likely, scenario of the opposition alliance winning, the coalition government is likely to have other priorities. The coalition has not yet indicated any thoughts on how its members may approach crypto policy.","The best case scenario for a change in India’s crypto policy is around the end of 2024,","one person familiar with the framing of crypto regulations in the government but unauthorized to speak to reporters told CoinDesk.","And this isn't due to any specific policies that may be updated or introduced – it will simply take the government months to transition into governing after election results are announced in six weeks.","The Modi government “does not appear to be keen on a holistic policy framework for virtual digital assets,” said the Esya Centre's Chawdhry. “It seems that other emerging technologies, such as artificial intelligence and extended reality, are higher priorities for policymakers.”","Recently, finance minister Nirmala Sitharaman remained slightly ambiguous about crypto, saying the government’s position has always been that crypto assets can be traded, but that the government hasn't regulated them in the past, and won't change that stance yet.","The past few years of the Modi government indicate changes will come.","One of the major achievements touted by the Modi government has been its role in shaping globally coordinated crypto policy under its 2023 presidency of the Group of 20. India made it a priority and brought the major economies of the world to agree to a set of guidelines.","India has also purportedly achieved its ambitions with the digital rupee.","\"The policymaking process for crypto will definitely pick up pace in this (expected and upcoming) term of the Modi government,” said Tanvi Ratna, the founder and CEO of the emerging technology think tank Policy 4.0, which contributed to key research and inputs towards the G20 policy framework created under India.","“We can expect a close alignment between the government strategy [and] the global framework agreed by the G20 under India's leadership. Also worth noting that India's crypto policy will evolve alongside the scale up and launch of the eRupee. We are looking towards a very dynamic five years in India,” Ratna said.","Read More: India Won't See Crypto or Web3 Bill for Another 18 Months, Senior Lawmaker Tells CoinDesk","Edited by Nikhilesh De."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Bharatiya Janta Party (BJP","content":"ORGANIZATION"},{"type":"Kiran Vivekananda","content":"PERSON"},{"type":"Ratna","content":"PERSON"},{"type":"Hindu","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Digital Public Infrastructure","content":"ORGANIZATION"},{"type":"Narendra Modi","content":"PERSON"},{"type":"Indian National Congress (INC","content":"ORGANIZATION"},{"type":"Modi","content":"PERSON"},{"type":"Parliament","content":"LOCATION"},{"type":"Ashish Khandelwal","content":"PERSON"},{"type":"June 4, 2024","content":"DATE"},{"type":"Nirmala Sitharaman","content":"PERSON"},{"type":"Vivekananda","content":"PERSON"},{"type":"BJP","content":"ORGANIZATION"},{"type":"Esya Centre Think Tank","content":"ORGANIZATION"},{"type":"G20","content":"ORGANIZATION"},{"type":"Lok Sabha","content":"LOCATION"},{"type":"Mohit Chawdhry","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Congress Party","content":"ORGANIZATION"},{"type":"Esya Centre","content":"ORGANIZATION"},{"type":"Indian National Developmental Inclusive Alliance","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"INC","content":"ORGANIZATION"},{"type":"the Group","content":"ORGANIZATION"},{"type":"Tanvi Ratna","content":"PERSON"}],"hashtag":["Regulations","India","Election 2024","Narendra Modi","Congress","Blockchain","Ledger","Crypto","India Election"],"authors":["Amitoj Singh"]}