{"summary":"Almost half of all illicit crypto volume occurred on the TRON Blockchain, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/27\/illicit-funds-in-crypto-ecosystem-shrank-9-last-year-yet-criminals-still-handled-nearly-35b-trm-labs\/","publishDate":"2024-03-27T12:00:00","id":16500,"type":null,"title":"Illicit Funds in Crypto Ecosystem Shrank 9% Last Year, Yet Criminals Still Handled Nearly $35B: TRM Labs","category":["Policy"],"content":["Illicit activity in the cryptocurrency ecosystem appears to have reduced, with the total illicit funds shrinking by 9% in 2023 compared to 2022, even though criminals still handled nearly $35 billion worth of cryptocurrencies, blockchain analytics firm TRM Labs found.","TRM Labs published a report titled “The Illicit Crypto Economy” on Wednesday, which looked at the key trends of 2023.","The firm found that scams and frauds accounted for nearly a third of all crypto crimes 2023. Critically, the share of illicit funds in crypto fell over 2023, even though TRM found it is still substantially higher than existing industry estimates.","Regulatory pressure appears to have resulted in a drop in hacked and sanctions-exposed funds volumes. The report said the U.S. alone “tripled the number of crypto crime-linked entities and individuals subject to sanctions.” However, hackers linked to North Korea made off with 30% less than they did in 2022. Hack proceeds fell by over 50% to $1.8 billion from $3.7 billion in 2022.","The report also stated that sales of fentanyl and its precursor materials dropped by 150% in volume between 2023 and 2022. Yet, vendor sales increased by over 97% year-on-year, from $16 million to $33 million.","However, sales of illicit drugs on darknet marketplaces grew to $1.6 billion from $1.3 billion recorded in 2022.","The report said almost half of all illicit crypto volume (45% in 2023, up from 41% in 2022) occurred on the TRON Blockchain. Stablecoin Tether (USDT) had the largest share of illegal volume, at $19.3 billion, compared to Ethereum (24%) and Bitcoin (18%).","Regarding terrorism financing, the number of unique TRON addresses that received Tether rose by 125% in 2023.","“We cannot comment on these questions, which relate to the alleged actions of unrelated third parties,\" a TRON representative said. \"Like all public blockchains, the TRON blockchain is a technology. Any technology can, in theory, be used for questionable activities. For instance, fiat USD is often used for money laundering. In all, it is fundamentally false to assume that TRON or Ethereum has control over those using the respective technologies.”","Read More: Munchables Exploited for $62M, Hack Linked to Rogue North Korean Team Member","UPDATE (April 1, 2024, 05:52 UTC): Adds statement from TRON representative.","Edited by Parikshit Mishra."],"entity":[{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"North Korea","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$1.8 billion","content":"MONEY"},{"type":"150%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$3.7 billion","content":"MONEY"},{"type":"$19.3 billion","content":"MONEY"},{"type":"$35 billion","content":"MONEY"},{"type":"fiat USD","content":"ORGANIZATION"},{"type":"Rogue North Korean Team Member","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"TRM","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"$1.6 billion","content":"MONEY"},{"type":"April 1, 2024","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"125%","content":"PERCENT"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"41%","content":"PERCENT"},{"type":"18%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"$62M","content":"MONEY"},{"type":"TRON Blockchain","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"},{"type":"$33 million","content":"MONEY"}],"hashtag":["Regulations","North Korea","illicit finance","Crypto","TRM Labs","Fentanyl","Tron","Tether"],"authors":["Amitoj Singh"]}