{"summary":"CoinJoin will increase privacy by combining multiple bitcoin payments from multiple spenders to produce a single transaction whose history and ownership are obfuscated.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/04\/19\/trezor-model-t-gets-bitcoin-privacy-upgrade-with-new-coinjoin-feature\/","publishDate":"2023-04-19T22:25:41","id":16508,"type":null,"title":"Trezor Model T Gets Bitcoin Privacy Upgrade With New CoinJoin Feature","category":["Technology"],"content":["Crypto hardware wallet company Trezor has collaborated with Bitcoin privacy firm zkSNACKs to introduce “CoinJoin” to its Model T device. CoinJoin is a way of combining multiple bitcoin transactions to enhance privacy.","Trezor says the Model T is the first and only hardware wallet to enable CoinJoin transactions for bitcoin. Several software or “hot” wallets like zkSNACKs’ Wasabi wallet already have CoinJoin. The feature will be rolled out to Trezor’s Model One devices at a future date, according to the company.","Most transactions on the Bitcoin blockchain are publicly available. A basic tool such as a block explorer – a piece of software for analyzing cryptocurrency transactions – is all it takes to tie those transactions to real life identities and violate users’ financial privacy.","CoinJoin attempts to reinstate privacy by combining multiple bitcoin payments from multiple spenders to produce a single transaction whose history and ownership are obfuscated.","CoinJoin can be done through decentralized coinjoin marketplaces such as JoinMarket, or through wallets like Trezor’s Model T or zkSNACKs’ Wasabi wallet. Both Model T and Wasabi use zkSNACKs’ CoinJoin service that charges a coordination fee – 0.3% of the coinjoined amount according to Trezor.","Per Trezor’s release: “Users simply click on the ‘anonymize’ button. Users then choose the number of CoinJoin rounds — with every round increasing the level of privacy — confirm their choices on the Trezor device, and the rest of the coinjoin process is automated and requires no active user participation.”","Trezor’s other privacy features include Tor, coin control, and Shamir backup.","“Trezor values privacy as an individual’s most important asset,” said Matěj Žák, CEO of Trezor. “Consequently, we’re delighted that we’ve found a way for our community to keep their bitcoin history private.”"],"entity":[{"type":"Matěj Žák","content":"PERSON"},{"type":"0.3%","content":"PERCENT"}],"hashtag":["Bitcoin","Trezor","Wasabi Wallet","CoinJoin","Privacy"],"authors":["Frederick Munawa"]}