{"summary":"Research firm Gauntlet is going to work on lending protocol Morpho, designing and managing risk for lending vaults.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279275\/gauntlet-to-manage-lending-vaults-on-morpho-protocol","publishDate":"2024-02-27T09:01:18","id":1650,"type":null,"title":"Gauntlet to manage lending vaults on Morpho protocol","category":["CRYPTO ECOSYSTEMS"],"content":["Research firm Gauntlet is going to work on lending protocol Morpho, designing and managing risk for lending vaults.","The firm will curate various lending vaults using Metamorpho, an open-source protocol for permissionless lending vaults on top of Morpho, according to a statement shared with The Block. Such lending vaults combine isolated markets and multi-asset lending pools to provide users with a way to earn yield on their assets.","“Working with a team of quants used to trading in milliseconds, we’ve always looked for faster paths to proactively manage risk and capture growth opportunities. MetaMorpho is our best opportunity yet to directly stress test our capabilities,” said Nick Cannon, VP Growth at Gauntlet.&nbsp;","This comes as Gauntlet had <a href=\"https:\/\/www.theblock.co\/post\/278526\/gauntlet-announces-exit-from-aave-as-risk-manager\" data-v-f87c67ca=\"\">recently exited<\/a> its collaboration with Morpho's competitor AaveDAO citing \"inconsistent guidelines.\"&nbsp;","Notably, Gauntlet is not appointed by the Morpho DAO, unlike how Gauntlet worked with Aave. Unlike the approach DAOs select only one or two risk managers, Morpho takes a permissionless mechanism with MetaMorpho vaults.","Vaults designed by risk curators like Gauntlet earn their fees on their own risk management, and Morpho takes no cut, a spokesperson told The Block. Morpho has over $900 million in total value locked, nearly one-tenth of the $9.2 billion locked on Aave across different chains.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"Gauntlet","content":"LOCATION"},{"type":"Nick Cannon","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"VP Growth","content":"ORGANIZATION"},{"type":"Morpho","content":"ORGANIZATION"},{"type":"$9.2 billion","content":"MONEY"},{"type":"Morpho DAO","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["LENDING"],"authors":["Vishal Chawla","The Block"]}