{"summary":"The Bitcoin Cash halving is expected on April 4, blockchain trackers show, and has historically preceded price bumps.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/28\/bitcoin-cash-rallies-13-ahead-of-bch-halving-bitcoin-steady-around-70k\/","publishDate":"2024-03-28T07:34:23","id":16510,"type":null,"title":"Bitcoin Cash Rallies 13% Ahead of BCH Halving, Bitcoin Steady Around $70K","category":["Markets"],"content":["Bitcoin (BTC) prices were little changed over the past 24 hours amid few catalysts after a volatile week. Prices briefly jumped above $71,000 on Tuesday, but have since retreated and remain steady around $70,000 level ahead of a major options expiry on Friday.","Most major tokens posted slight losses. CoinGecko data shows that Solana’s SOL, XRP, and BNB Chain’s BNB dropped as much as 2%, while Internet Computer’s ICP fell 6%.","Some traders warned of a further market-wide pullback if bitcoin were to lose the $69,000 level in the coming days.","“Bitcoin has fallen back below $70K, which can be attributed to the bulls’ need to let off steam and the general decline in risk appetite in global markets,” said FxPro senior market analyst Alex Kuptsikevich in an email.","“The short-term focus for traders will be to see if bitcoin can retest Tuesday’s intra-day lows near $69.5K. A break below this level could signal a more protracted correction,” he added.","Dogecoin (DOGE) posted the most gains among majors with a 6% bump. Historic price action suggests the token is showing similar fractals that have preceded significant rallies. The increase took the token over 21 cents for the first time since December 2021.","The CoinDesk 20, a broad-based liquid index of top tokens minus stablecoins, was down 1.4%.","Meanwhile, Bitcoin Cash (BCH) zoomed 13% ahead of an expected halving event on April 4. The current block reward is 6.25 BCH, but after the next halving, it will be 3.125 BCH.","Open interest on BCH-tracked futures more than doubled to $500 million on Thursday from $213 million last week, showing an increase in levered bets on more expected price volatility.","Halving occurs when the reward for mining transactions is cut in half, reducing the rate at which new coins are created and thus lowering the available amount of new supply. Bitcoin’s own halving is expected on April 20, trackers show and has historically preceded a bull market for the token.","UPDATE (March 28, 11:56 UTC): Adds DOGE price highest in more than two years in sixth paragraph.","Edited by Parikshit Mishra."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"BCH","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"$71,000","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"1.4%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"Alex Kuptsikevich","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"ICP","content":"LOCATION"},{"type":"April 4","content":"DATE"},{"type":"$213 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"21 cents","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"K","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"$69.5","content":"MONEY"},{"type":"$70K","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["Trading","Markets","Bitcoin","Bitcoin Cash","Halving"],"authors":["Shaurya Malwa"]}