{"summary":"Ethereum’s shift to proof-of-stake is one of the most anticipated events in cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-the-merge-and-why-has-it-taken-so-long\/","publishDate":"2022-08-11T12:55:48","id":16519,"type":null,"title":"What Is the Ethereum Merge?","category":["Learn"],"content":["The “Merge” is intended to shift the Ethereum blockchain from the current proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) model intended to be faster and more energy efficient. But adjusting the second-largest blockchain from one system to another is an incredibly complex, multi-step process. It’s important that each decision be assessed thoroughly. We’ll take you through the reasons and various stages leading to the protocol’s new chapter.","Read More: What Is Ethereum?","In contrast to proof-of-work, which requires miners to compete for rewards based on the amount of computational power they can acquire, the proof-of-stake mechanism randomly selects validators relative to the total amount and time their ether (ETH) currency has been staked.","Unlike proof-of-work, PoS validators don't need to mine blocks to maintain the network. Instead, they need to create new blocks when chosen and validate others when not. Once a participant has validated the latest block of transactions, other contributors can attest (confirm) the block is valid. When enough attestations are made, the network adds a new block. Rewards are then distributed in ether, the blockchain's native currency, by the network in proportion to each validator's stake. However, to incentivize good behavior, there are also penalties (slashing) that can cause validators to lose a portion of their staked ETH if they go offline (fail to validate) or attest to malicious (bad) transactions.","Despite the high technical knowledge and expertise required to become a validator, anyone can join if they meet the minimum requirement of 32 ETH. People who can't meet the threshold can still contribute by staking ether in a pool (managed by third parties) and receive a portion of the rewards.","Read More: Ethereum After the Merge: What Comes Next?","While proof-of-work is reliable and secure, the comparative benefits of proof-of-stake include:","As evidenced by his early and later writings, Ethereum co-founder Vitalik Buterin has been a long-time proponent of the proof-of-stake consensus mechanism. Compared with Ethereum's current resource-intensive PoW governance system, PoS is predicted to reduce energy consumption of the network by at least 99.95%.","It will also pave the way for shard chains in 2023, which are expected to nullify data congestion, high gas (transaction) fees, and support the next generation of layer 2 scaling systems. Shard chains provide extra, cheaper, storage layers for applications and rollups to store data, according to the Ethereum Foundation.","Unlike ERC standards, or traditional companies that enforce regulations from the top down, any major changes to the core protocol require consensus from the global community of nodes.","Because of the process all Ethereum updates and decisions go through, what some critics are calling undue delays have been, in reality, a laborious and carefully implemented consolidation of the network through steady, incremental upgrades and forks across several core elements: the Beacon Chain, the Merge and shard chains. Each of these rely on one another to realize the full vision for Ethereum of more scalability, security and sustainability.","As of writing, Buterin has said the Merge will happen in August. This is when the Beacon Chain (the component that controls PoS) will mark its official transition from proof-of-work to proof-of-stake.","To increase the number of validators and process transactions using PoS, the Ethereum mainnet (which still uses proof-of-work) needs to merge with the Beacon Chain (otherwise known as the consensus layer).","Shipped on Dec. 1, 2020, at noon UTC, the Beacon Chain (which runs parallel to the mainnet, or live blockchain version) and currently has over 375,000 active validators, is the component responsible for controlling proof-of-stake.","It is also crucial in preparing Ethereum for the next multi-phase upgrade of shard chains, which will help expand the network's capacity to scale and store data. Although the original plan was to work on shard chains before the Merge, that has changed because of the accelerated growth of layer 2 scaling systems like Arbitrum, Optimism and Loopring. So most of the Ethereum community found the Merge and the transition to proof-of-stake to be a higher priority.","While the role of the Beacon Chain is expected to change over time, it will largely coordinate the network of shards and stakers. As the Beacon Chain cannot run smart contracts or handle accounts, the merging with the mainnet will bring this ability into the proof-of-stake ecosystem.","Unlike The DAO hard fork in 2016 (which took place after 3.6 million ETH was stolen in The DAO hack, prompting the creation of a separate blockchain called Ethereum Classic), Ethereum will continue as a single network after the Merge. In essence, the entire Ethereum PoW chain becomes the Ethereum PoS chain. The Merge will not affect the data layer of Ethereum so no transactions will be lost in this transition. However, because mining will no longer be required, miners will likely stake their assets and help validate the Ethereum mainnet.","Although it can be a drawn-out process given the number of moving parts and the market impact of Ethereum, these software upgrades require rigorous testing from the community and core developers to mitigate any bugs or vulnerabilities. Several notable tests, upgrades and forks since the launch of the Beacon Chain as part of the transition to proof-of-stake include:","Following the Beacon Chain genesis, the \"London\" hard fork was largely instrumental in dictating the way miners interact and profit with Ethereum through various improvements such as EIP-1559. Along with a reduction in fees, another drastic change in the financial incentives for miners is the “difficulty bomb” that will force the proof-of-work consensus to stop producing blocks and therefore make it unprofitable to mine. The EIP-3554 included in the London hard fork delayed the time bomb to December 2021. However, this was later extended by several months by the Arrow Glacier network upgrade (see below).","An overview of the EIP proposals related to the London hard fork can be found on the Ethereum Cat Herders Medium account.","As the first scheduled upgrade for the Beacon Chain, the Altair upgrade imposed no changes to Ethereum front-end users but required node operators to upgrade their clients. Nodes that didn’t undergo any upgrades would risk not being able to participate in the network post-Merge and might pay penalty fees.","The Arrow Glacier network upgrade pushed the date of the “difficulty bomb” back several months. It was the only change in the upgrade.","Ethereum reached a significant milestone in mid-March with the Klin testnet merge. This involved a proof-of-work execution layer merging with a proof-of-stake Beacon Chain. While the merging was largely successful, developer Tim Beiko found that one client was not producing blocks as expected.","The Ropsten testnet was the first of three public testnets to successfully merge its proof-of-work (PoW) execution layer with the Beacon Chain proof-of-stake (PoS) consensus chain. According to Ethereum developers, there was a 99% participation rate after configuration fixes and reboots. Despite a few minor issues, the Ropsten merge was generally considered a major success, and marked the beginning of similar trial runs that would take place on other Ethereum testnets ahead of the PoS Merge.","The Gray Glacier upgrade occurred at block 15,050,000 and introduced changes to the parameters of the network’s difficulty bomb, pushing it back by 700,000 blocks, to sometime in September. No other changes were introduced as part of Gray Glacier.","The second of three public testnets, Sepolia, went live when TTD hit 17,000,000,000,000,000. The merge happened over a two-step process: First the operators needed to update their consensus layer and execution layer clients together. That then activated two further phases: the first at an epoch height on the Beacon Chain and the second upon hitting the total difficulty value on the execution layer. No significant problems were encountered and the merge was considered successful.","The third and final public testnet completed a \"practice run\" of the Merge and successfully moved to proof-of-stake when the Terminal Total Difficulty (TTD) exceeded 10,790,000. This followed the Bellatrix upgrade to Goerli’s beacon chain, Prater, which was activated on Aug. 4.","In essence, a shadow fork is a test run of the Merge. Without actually impacting the network, they simulate what the shift from PoW to PoS would look like by testing it on a small number of network nodes. After running shadow forks on several of its testnets, Ethereum developers began testing on Ethereum's mainnet. Mainnet shadow forks, which simulate the Merge on Ethereum's high-traffic primary network, test how the Merge would work under the most realistic possible conditions.","As an example, according to Ethereum Foundation developer Parithosh Jayanthi, while the Kiln merge testnet was designed \"to allow the community to practice running their nodes, deploying contracts, testing infrastructure, etc\" the mainnet shadow fork goes a step further to stress-test the network. Credited to Van Der Wijden, it was noted as a historical event and key in determining the timing of the final merging.","Once the shadow fork went live, the developer team noticed some issues with Ethereum-based software systems provider Nethermind and Hyperledger Besu, a Java-based open-source Ethereum client.","Overall, ten successful mainnet shadow forks from April through July 2022 (with more planned) have made Ethereum developers optimistic the real Merge might finally be around the corner.","More detail on the history of Ethereum and its various milestones leading up to the Merge can be found here.","In essence, the goal of the Merge is to expedite the process of moving from proof-of-work to proof-of-stake. To accelerate the transition, developers are working on reducing the features that may cause delay and temporarily inhibit the ability to withdraw staked ETH once the Merge is finalized. However, these will likely be addressed in a post-Merge \"cleanup\" upgrade.","Read more: Ethereum After the Merge: What Comes Next?","Once the Merge is complete and Ethereum's newly adopted consensus layer takes on the role of adding new blocks to the Ethereum blockchain using the proof-of-stake consensus mechanism, developers will work on a few new phases they call the Surge, the Verge, the Purge and the Splurge. These will continue to make Ethereum's proof-of-stake blockchain more scalable and secure.","For example, while the Merge will not immediately solve challenges with scalability, it will help prepare the network for Ethereum’s version of subsidiary shard chains that will rely on a fully functional PoS network to operate. Through spreading the data load of the network across 64 blockchains, shard chains provide additional cheaper layers for applications and rollups to store data. They also enable layer 2 systems to offer low transaction fees while benefiting from the security of the Ethereum mainnet.","The following is a list of core resources about the Merge, the Beacon Chain and the state of Ethereum.","Edit note: Monday, July 25, 2022, 19:57 UTC: Updated to include information on shadow forks and developments from June 8, 2022.","Edit note: Thursday, August 11, 2022, 18:45 UTC: Updated to include information on developments since July 25, 2022."],"entity":[{"type":"Dec. 1, 2020","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"June 8, 2022","content":"DATE"},{"type":"Sepolia","content":"LOCATION"},{"type":"August 11, 2022","content":"DATE"},{"type":"Aug. 4","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Beacon Chain","content":"LOCATION"},{"type":"EIP","content":"ORGANIZATION"},{"type":"Klin","content":"PERSON"},{"type":"99.95%","content":"PERCENT"},{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Beacon Chain genesis","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Prater","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"3554","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"Van Der Wijden","content":"ORGANIZATION"},{"type":"Ethereum Cat Herders Medium","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"TTD","content":"ORGANIZATION"},{"type":"Hyperledger Besu","content":"PERSON"},{"type":"99%","content":"PERCENT"},{"type":"Monday, July 25, 2022","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ropsten","content":"PERSON"},{"type":"1559","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Parithosh Jayanthi","content":"PERSON"},{"type":"Java","content":"LOCATION"},{"type":"July 25, 2022","content":"DATE"},{"type":"Bellatrix","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Terminal Total Difficulty (TTD","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"}],"hashtag":["Learn","Ethereum","Intermediate","The Merge"],"authors":["Mason Marcobello"]}