{"summary":"SEC official William Hinman said the regulatory agency is not classifying ethereum as a security.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/06\/14\/sec-official-pushes-back-on-claims-ether-is-a-security\/","publishDate":"2018-06-14T17:00:29","id":16514,"type":null,"title":"SEC Official Pushes Back on Claims Ether Is a Security","category":["Markets"],"content":["Ethereum is not a security, at least in the view of U.S. Securities and Exchange Commission (SEC) director of corporation finance William Hinman.","Speaking at the Yahoo! All Markets Summit: Crypto event in San Francisco Thursday, the official told the audience that the agency \"doesn't see a lot of value in treating ether today as a security,\" explaining that the fact that there is no central figure or group responsible for ethereum, and therefore \"the assets may not represent an investment contract.\"","The statements are the latest in a long line of remarks that have found various regulatory officials opining on whether the nature of the sale in which ether was issued made it subject to U.S. securities laws. Such a view has been advanced largely by former regulators, while the SEC has largely spoken generally (and sometimes derogatorily) about ICOs and token sales.","In pre-written remarks today, Hinman said:","That being said, Hinman cautioned that \"the analysis of whether something is a security is not static and does not strictly inherent to the instrument.\"","He also pushed back on the idea that there can be utility tokens which are not securities, saying \"even digital assets with utility that function solely as a means of exchange in a decentralized network could be packaged and sold as an investment strategy that can be a security.\"","Other cryptocurrencies, by Hinman's explanation, can still be classified as securities. While a token in and of itself may not be a security, the purchaser's expectation during a sale will determine its classification, he said. If a purchaser has a reasonable expectation of profit based on the seller's actions, the token is likely a security.","Hinman reiterated that the SEC is willing to work with token projects and their legal counsel to establish whether a project should register with the regulator, echoing numerous other SEC officials.","William Hinman image via Yahoo! \/ YouTube"],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"William Hinman","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Hinman","content":"PERSON"},{"type":"Yahoo! \/ YouTube","content":"ORGANIZATION"}],"hashtag":["SEC","Ethereum","Regulation","News","Ether","Legal"],"authors":["Nikhilesh De"]}