{"summary":"Additionally, the SEC has said that Terraform should not be allowed to hire law firm Dentons or pay litigation costs for employees, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/29\/sec-objects-to-terraforms-166m-retainer-of-law-firm-dentons-reuters\/","publishDate":"2024-02-29T08:01:04","id":16511,"type":null,"title":"SEC Objects to Terraform’s $166M Retainer of Law Firm Dentons: Reuters","category":["Policy"],"content":["The U.S. Securities and Exchange Commission (SEC) has raised objections to a $166 million retainer payment to lawyers of Terraform, according to Reuters.","Additionally, the SEC has said that Terraform should not be allowed to hire law firm Dentons or pay litigation costs for employees, the report said.","The SEC has alleged that Terraform intended to avoid paying a future judgment in the SEC’s lawsuit, which is why it sent $166 million to Dentons.","Terraform Labs and its founder, Do Kwon, currently face a trial in the U.S. from the SEC regarding the collapse of TerraUSD. Terraform Labs filed a voluntary petition in Delaware for Chapter 11 bankruptcy in January 2024 after the failed stablecoin TerraUSD and the LUNA token collapsed in May 2022, destroying billions of dollars in investor wealth.","The money was “siphoned” off into an “opaque slush fund for its lawyers,” which could have gone to investors and creditors seeking to be repaid in Terraform’s bankruptcy, the SEC said, according to the report.","Terraform Labs or Dentons did not immediately respond to CoinDesk’s request for comment.","Read More: Do Kwon Tries to Delay SEC’s Terraform Trial so He Can Attend","Edited by Parikshit Mishra.","\n"],"entity":[{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"$166 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Kwon Tries to Delay SEC","content":"ORGANIZATION"}],"hashtag":["Regulations","terraform labs","Reuters","Bankruptcy","SEC","Do Kwon"],"authors":["Amitoj Singh"]}