{"summary":"Erik Voorhees’ ShapeShift is morphing into a decentralized exchange (DEX). It's losing the KYC restrictions at the same time.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/01\/06\/shapeshift-is-going-full-defi-to-lose-kyc-rules\/","publishDate":"2021-01-06T14:20:00","id":16525,"type":null,"title":"ShapeShift Is Going Full DeFi to Lose KYC Rules","category":["Finance"],"content":["","ShapeShift is swapping business structures again, this time by getting rid of its entire trading desk. ","","","The Colorado-based non-custodial exchange is now routing orders through decentralized finance (DeFi) applications in a bid to get rid of know-your-customer (KYC) regulations that gutted the cryptocurrency trading platform back in 2018.","","","The firm will gradually phase out its own centralized trading activity (and KYC policy) in favor of a decentralized alternative as it becomes “100% DEX-based for customers,” ShapeShift founder and CEO Erik Voorhees told CoinDesk in an email.","","","“ShapeShift’s original model was designed to protect users, providing instant liquidity without requiring them to trust a custodian,” Voorhees said. “We had to be the counterparty – the market maker – to provide that service at scale. The decentralized protocols are now providing a superior service, so we’re embracing this evolution and helping our customers easily connect with them.”","","","Founded in 2014, ShapeShift added a KYC requirement to its exchange in September 2018 following “duress” from regulators. Usually regarded as a vocal libertarian, Voorhees said at the time that ShapeShift added the restrictions as “a proactive step … to de-risk the company amid uncertain and changing global regulations.” ","","","Voorhees later said KYC implementation cost the platform 95% of its users.","","","Two years later the exchange has now integrated with multiple decentralized exchanges (DEX) including “Uniswap, Balancer, Curve, Bancor, Kyber, 0x, mStable and half a dozen other DEXs,” Voorhees said. According to DeFi Pulse, DeFi applications currently hold some $17.86 billion.","","","Bitcoin (BTC) will be available for trading via the DEX integration this quarter, he said. Cryptocurrencies and tokens from other non-Ethereum blockchains will also be available in Q1 as well. ","","","Voorhees said the integration will not only allow U.S. customers to use the platform without needing to perform KYC onboarding, but also will let ShapeShift open up “more jurisdictions, not fewer” as the exchange “removes itself from regulated activity.” ","","","“Because ShapeShift is no longer acting as any form of financial intermediary or counterparty, this new, frictionless [user experience] frees users from having to provide personal, private information,” a press release from ShapeShift states.","","","DEXs operate as trading systems on top of blockchains, such as Ethereum. True DEXs are completely permissionless and have eaten into centralized exchange volumes over 2020. For example, Uniswap cites itself as the fifth-largest spot-trading cryptocurrency exchange, after riding $6 billion in monthly trading volume in both August and September that briefly surpassed dominant U.S. exchange Coinbase.","","","Voorhees said prices on ShapeShift should benefit from DeFi liquidity as users gain more price exposure by routing orders through multiple exchanges. Indeed, the composable nature of DeFi markets has made some asset pairs more competitive than centralized alternatives such as ETH\/USDC.","","","“By integrating a dozen new liquidity sources, the pricing of assets is even more competitive. So, there is no trade-off for pricing. These new markets are highly liquid, and in addition to great pricing customers will now enjoy much higher order size limits,” he said.","","","ShapeShift receives a portion of trading fees that each DEX charges in return for directing traffic to the DEX, Voorhees said. ShapeShift customers also get the exchange’s native token, FOX, in return for every trade conducted on the platform to help facilitate a feeless experience.",""],"entity":[{"type":"2014","content":"DATE"},{"type":"$17.86 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Voorhees","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"FOX","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"ETH\/USDC","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"KYC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"DeFi Pulse","content":"ORGANIZATION"},{"type":"September 2018","content":"DATE"},{"type":"August","content":"DATE"},{"type":"Bancor","content":"ORGANIZATION"},{"type":"this quarter","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Colorado","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Balancer","content":"LOCATION"}],"hashtag":["KYC","ShapeShift","Trading","DEX","DeFi"],"authors":["William Foxley"]}