{"summary":"Alameda Research stockpiled tokens before they were listed on FTX, show a year&#x27;s records tracked by blockchain analytics firm Argus.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186986\/argus-ceo-alameda-pattern-of-trading-ftx-listings-seems-not-coincidental","publishDate":"2022-11-14T20:42:54","id":1652,"type":null,"title":"Argus CEO: Alameda pattern of trading FTX listings &#x27;seems not coincidental&#x27;","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Alameda Research loaded up on tokens before FTX listed them, potentially gaining an advantageous market position as a result, the CEO of Argus said.<\/span>","<span data-v-f87c67ca=\"\">Whether Alameda subsequently traded those tokens remains cloudy and part of an “incomplete picture, as most of their selling is done off-chain,” Argus co-founder and CEO Owen Rapaport told The Block via email, adding, “We can't really conclude to what extent they sell all their tokens or not — but given the timing of their market entrance shortly before listings, it seems not coincidental.”<\/span>","<span data-v-f87c67ca=\"\">In the 12 months following March 2021, Alameda Research stockpiled tokens before they were listed by sister company FTX, the exchange, as first reported by the Wall Street Journal, which cited an Argus investigation. <\/span><span data-v-f87c67ca=\"\">Public Ethereum blockchain records available to Argus indicated that Alameda possessed around $60 million allocated in 18 tokens before eventual FTX listings.<\/span>","<span data-v-f87c67ca=\"\">Alameda and FTX now fall under increasing pressure as agencies seek to better understand alleged <\/span><a href=\"https:\/\/www.theblock.co\/post\/185750\/ftx-faces-sec-and-cftc-investigation-bloomberg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mishandling<\/span><\/a><span data-v-f87c67ca=\"\"> of consumer funds, and the exact nature of the relationship between the companies founded by Sam Bankman-Fried.<\/span>","<span data-v-f87c67ca=\"\">Alameda has since shuttered, and FTX filed for Chapter 11 bankruptcy protection last week after the exchange paused withdrawals. The exchange's new CEO called on remaining staff for support as the company sorts out insolvency and how to plug an $8 billion hole in the books. &nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ensuing liquidity crunch from FTX's abrupt closure caused major upheaval as a number of industry players found themselves either unable to withdraw balances on the FTX exchange, or directly materially exposed to FTX shares and FTT tokens.<\/span>","<span data-v-f87c67ca=\"\">SBF is working with regulators and bankruptcy officials, he said in an <\/span><a href=\"https:\/\/www.theblock.co\/post\/186935\/sbf-tells-new-york-times-that-he-could-be-worse\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">interview<\/span><\/a><span data-v-f87c67ca=\"\"> with the New York Times, where he explained away his earlier <\/span><a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1592275869825134593?s=20&amp;t=M1jOlVgjdehFYKlDWVTMFQ\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cryptic tweets<\/span><\/a><span data-v-f87c67ca=\"\"> as improvisation.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Owen Rapaport","content":"PERSON"},{"type":"Argus","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$60 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","TOKENS"],"authors":["Jeremy Nation","The Block"]}