{"summary":"The put-call skew ahead of Friday’s week- and month-end bitcoin options expiry is a bearish indicator for the market, an analyst said.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274421\/bitcoin-put-call-options-ratio-is-a-bearish-indicator-for-the-market-says-analyst","publishDate":"2024-01-25T13:13:15","id":1652,"type":null,"title":"Bitcoin put-call options ratio is a bearish indicator for the market, says analyst","category":["Layer 1s"],"content":["An <a href=\"https:\/\/www.theblock.co\/post\/259136\/deribit-open-interest-ath-bitcoin-rally-crypto-derivatives\" data-v-f87c67ca=\"\">increase<\/a> in the number of outstanding puts compared to calls in bitcoin options open interest could be a bearish omen ahead of Friday's expiry.","Deribit Chief Commercial Officer Luuk Strijers said the put-call ratio for bitcoin options across all expiries currently stands at 0.44.","\"Focusing on tomorrow's expiry, the ratio adjusts to 0.52, indicating a higher number of puts compared to calls,\" Strijers told The Block. \"This suggests a bearish sentiment for this month's bitcoin options expiry compared to the general trend in open contracts.\"","The analyst added that the ratio suggests that the market expected a short-term downside for <a href=\"https:\/\/www.theblock.co\/post\/274474\/deribit-sees-increase-in-bitcoin-futures-open-interest-despite-declines-on-the-chicago-mercantile-exchange\" data-v-f87c67ca=\"\">bitcoin<\/a>, and investors have used puts to hedge.","\"However, they see the longer-term as having relatively more upside,\" he added.<u data-v-f87c67ca=\"\"><\/u>","Strijers said that the call-put options skew for longer-term 30- and 60-day <a href=\"https:\/\/www.theblock.co\/post\/273557\/ether-supply-could-be-affected-by-ethereums-dencun-upgrade-analyst-says\" data-v-f87c67ca=\"\">ether<\/a> options remains slightly negative. He added that it is, however, close to zero.","\"This indicates that puts are more expensive relative to calls, signaling a mildly bearish outlook for these longer-dated expiries,\" Strijers added.","Options are <a href=\"https:\/\/www.theblock.co\/learn\/245708\/what-are-decentralized-derivatives\" data-v-f87c67ca=\"\">derivative<\/a> contracts that give a trader the right but not the obligation to buy or sell the underlying asset at a predetermined price on or before a specific date. A call option gives the right to buy, and a put offers the right to sell. It is assumed that a trader who buys put options is implicitly bearish on the market, while a call buyer is bullish."],"hashtag":["BITCOIN","CRYPTO MOVERS","ETHEREUM"]}