{"summary":"Markets may relive last year's U.S. banking crisis as a crucial funding program is set to expire, Hayes said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/01\/05\/arthur-hayes-foresees-30-bitcoin-crash-amid-vicious-washout-heres-why\/","publishDate":"2024-01-05T19:04:19","id":16526,"type":null,"title":"Arthur Hayes Foresees 30% Bitcoin Crash Amid 'Vicious Washout.' Here's Why","category":["Markets"],"content":["While crypto investors are fixated on an imminent spot bitcoin exchange-traded fund (ETF) decision that could propel BTC's price even higher, Arthur Hayes, the chief investment officer of family office Maelstrom and the ex-CEO of BitMex, warned about a potential 20-30% plunge in the next few months.","In a Friday blog post, Hayes outlined looming risks for U.S. banks and markets potentially colliding in March and triggering a \"liquidity rug pull\" event akin to the banking crisis last March.","\"I am preparing for a vicious washout of all the crypto tourists in March of this year,\" he wrote. \"I loaded up on crypto in the second half of 2023, and I believe now until April is a no-trade zone in terms of the addition of risk.\"","The drawdown of the Federal Reserve's reverse repo program (RRP), where qualified banks and investment firms may park cash and earn interest on it, served as a tailwind for risky assets through last year, injecting capital into markets as participants took out cash from the facility and invested.","However, the RRP balance is quickly declining, dropping to $700 billion from a record high of $2.5 trillion at the end of 2022, and Hayes is projecting it to reach its historical average of $200 billion by around March.","\"When this number gets close to zero..., the market will wonder what is next,\" he said. \"Without any other new sources of dollar liquidity, bonds, stocks, and I believe crypto will also get the stick.\"","Second, a crucial Fed facility called the Bank Term Funding Program (BTFP) that helped stave off last year's regional banking crisis is set to expire on March 12, with the potential to create turbulence in the banking system.","The BTFP provided banks with funding to fulfill deposit withdrawals by lending them money at the notional value of their U.S. government bond holdings, at much better conditions than selling bonds on the open market at a loss due to the Fed's aggressive rate hikes.","Hayes expects that the facility won't be extended during this U.S. presidential election year, which could bankrupt some banks who sit on massive unrealized losses on their bond holdings.","\"The combination of a lack of liquidity gushing from the RRP and the lack of printed money to cover the bond losses on the non-TBTF [too big to fail] banks’ balance sheets will decimate the financial markets globally,\" he said.","As the market rout ensues, Hayes predicted the Fed will cut rates on its March 20 meeting and resume the BTFP funding line.","If this scenario plays out as Hayes outlined, bitcoin (BTC) will correct a \"healthy\" 20% to 30% from early March prices, according to the blog post. The decline could be as much as 40% if BTC rallies to $60,000-$70,000 in the coming weeks, he wrote.","\"Bitcoin initially will decline sharply with the broader financial markets but will rebound before the Fed meeting,\" Hayes said. \"That is because bitcoin is the only neutral reserve hard currency that is not a liability of the banking system and is traded globally.\"","Hayes joined a roster of crypto analysts who recently forecasted a correction for crypto markets.","CryptoQuant said that a spot-based ETF approval would be a \"sell the news\" event and BTC could drop to $32,000, while K33 Research suggested reducing exposure as the market became overheated. Bitcoin is currently above $43,000.","Matrixport head of research Markus Thielen warned about a bitcoin correction based on technical indicators with the SEC potentially putting off ETF decisions due to shortcomings in the filings. The report may have contributed to a near-10% decline in bitcoin's price earlier this week.","Edited by Nick Baker."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$700 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Markus Thielen","content":"PERSON"},{"type":"$200 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Nick Baker","content":"PERSON"},{"type":"March 20","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"second half of 2023","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"RRP","content":"ORGANIZATION"},{"type":"$43,000","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"March 12","content":"DATE"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"$2.5 trillion","content":"MONEY"},{"type":"$32,000","content":"MONEY"},{"type":"March of this year","content":"DATE"}],"hashtag":["Arthur Hayes","Bitcoin","Liquidity","Federal Reserve","Recommended"],"authors":["Krisztian Sandor"]}