{"summary":"Bitcoin's third halving, a once-every-four-years occurrence and the most anticipated event this year in the cryptocurrency industry, has finally happened.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2020\/05\/11\/bitcoin-halving-arrives-mining-rewards-drop-for-third-time-in-history\/","publishDate":"2020-05-11T19:26:24","id":16537,"type":null,"title":"Bitcoin Halving Arrives: Mining Rewards Drop for Third Time in History","category":["Tech"],"content":["","Bitcoin's third halving, the network's quadrennial landmark and the most anticipated event this year in the cryptocurrency industry, has finally happened.","","","Miners racing on the network to compete for freshly minted bitcoin produced the 630,000th block at 19:23 UTC on May 11, which triggered the programmed halving event, marking another milestone in the currency's 11-year history.","","","The first block in the new 6.25-bitcoin-per-block mining cycle was mined and relayed by China-based Antpool, the fourth-largest mining pool by total computing power.","","","In an homage to Satoshi Nakamoto's iconic \"brink of a second bailout\" message in the 2009 genesis block, f2pool, which mined the 629,999th block (the last before the halving), embedded a reference to the current financial crisis: \"NYTimes 09\/Apr\/2020 With $2.3T Injection, Fed’s Plan Far Exceeds 2008 Rescue.”","","","Bitcoin, the world's first and largest blockchain network by market capitalization, was designed by its pseudonymous creator Nakamoto to reduce the rewards for mining each block by half every 210,000 blocks in order to slow down the injection of new supply to the network as time goes by.","","","The mining reward is an economic incentive for those who contribute computing power to securing the network, as well as processing transactions on the network since no single entity functions as a central bookkeeper.","","","The 2020 halving, the third in the network's history, means the mining reward has now been reduced from 12.5 bitcoin per block to 6.25 units. It went down to 25 from 50 bitcoin per block in November 2012 and further decreased to 12.5 units in July 2016.","","","Read more: Bitcoin Halving, Explained","","","The immediate implication after halving is that the newly minted bitcoin in a day will fall from 1,800 to 900 units. That would also mean mining operators will see their daily total revenue – at bitcoin's current price of $8600 – reduced from $15 million to $8 million.","","","As such, it has been expected the computing power connected to the Bitcoin network will fall significantly after the halving as the revenue decrease will squeeze out those miner operators who lack efficient resources to cut their electricity costs.","","","However, it remains to be seen how that will play out after the halving. Currently, the average Bitcoin total computing power over the last seven days since the previous mining difficulty adjustment has hit a new all-time high of 121 exahashes per second (EH\/s), beating the previous record of 118 EH\/s, according to data from Chinese mining pool PoolIn.","","","As such, Bitcoin’s mining difficulty – a measure of how hard it is to compete for mining rewards – is expected to increase by 4.9% in about seven days to an all-time high above 16.55 trillion, based on PoolIn's data estimate.","","","Bitcoin's mining difficulty is programmed to adjust every 2,016 blocks – about every two weeks – based on the amount of computing power participating in mining activity during the period.",""],"entity":[{"type":"$2.3","content":"MONEY"},{"type":"4.9%","content":"PERCENT"},{"type":"November 2012","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"2009","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"July 2016","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"$8600","content":"MONEY"},{"type":"May 11","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin Halving"],"authors":["Wolfie Zhao"]}