{"summary":"Ethereum co-founder Vitalik Buterin describes soulbound tokens as non-transferable NFTs that can help represent a person's identity and achievements in Web3.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-soulbound-tokens-the-non-transferrable-nft-explained\/","publishDate":"2022-09-07T17:03:13","id":16534,"type":null,"title":"What Are Soulbound Tokens? The Non-Transferrable NFT Explained","category":["Learn"],"content":["Non-fungible tokens (NFT) are a type of blockchain asset that allows holders to prove ownership over an item, real or digital. Each NFT is unique and cannot be replicated and, in most cases, ownership of an NFT can be bought and sold.","NFTs are not tied to a particular person or group, and according to a recent Twitter poll, many people buy NFTs to make money. Popular NFT projects like CryptoPunks or Bored Ape Yacht Club can resell for hundreds of thousands of dollars on marketplaces like OpenSea, fostering an environment where NFTs trade hands frequently to whoever the highest bidder may be.","But what if there was a digital token tied to an individual that could not be bought or sold? In May 2022, a concept called soulbound tokens (SBT) was proposed by Ethereum co-founder Vitalik Buterin, economist Eric Glen Weyl and lawyer Puja Ohlhaver to address the current limitations of NFTs and other decentralized structures. Here’s what soulbound tokens are and how they work.","The concept of “soulbound” assets on the blockchain was first discussed in a January 2022 blog post by Buterin. In it, he explained that in the popular fantasy game World of Warcraft there are powerful “soulbound items” that cannot be transferred or sold to another player once picked up.","“NFTs in their current form have many of the same properties as rare and epic items in a massively multiplayer online game,” he wrote, before describing some of their shortcomings. “While transferable NFTs have their place and can be really valuable on their own for supporting artists and charities, there is also a large and underexplored design space of what non-transferable NFTs could become.”","This idea was expanded on by Buterin and his colleagues in a May 2022 paper titled “Decentralized Society: Finding Web3’s Soul.” Soulbound tokens are described as non-transferable digital tokens that represent social identity in a decentralized society.","In the paper’s vision for a decentralized society, accounts called “Souls” will hold or issue SBTs that represent the “commitments, credentials and affiliations” of an individual holder. “Such tokens would be like an extended resume, issued by other wallets that attest to these social relations,” the authors explain.","In their simplest form, SBTs can be “self-certified” in the same way a person might add their education or employment history to their resume. SBTs could also be issued by Souls representing individuals, companies or institutions, just as a university could award a diploma to a graduate for successfully completing their studies.","Soulbound tokens cannot be bought and sold and are not designed to have market value. Instead, they can be issued by individuals or by another entity to symbolize an accomplishment.","NFT innovation platform Idexo claims that it launched the first soulbound token in April 2021 before the idea was formally named. Its non-transferable Early Adopter NFTs were minted on the Binance Smart Chain and are tied to the holder’s Telegram username.","Idexo also recently added SBTs to its software development kit, enabling the community to create SBTs on multiple blockchain platforms.","As of September 2022, the concept and its use cases are still being researched.","According to the white paper, SBTs could help propel Web3 forward by lessening the dependence on centralized structures in Web2. For example, it notes that many users rely on custodial wallets managed by central entities like Coinbase or Binance to store their crypto, and NFT artists depend on centralized platforms like OpenSea or Twitter to sell their work.","In addition, SBTs seek to move us away from the “hyper-financialization” of crypto and discourage the use of NFTs as status symbols.","SBTs can also help navigate the trustless and largely pseudonymous nature of Web3 by creating socially verifiable reputations. For example, anyone can claim to be a Harvard graduate, but holding an SBT from the university could be used to prove your educational credentials in Web3.","Reputation can play a large role in how much faith a community is willing to place in an individual or team. You’d likely be very cautious in dealing with someone who has a history of defrauding investors or abandoning projects. Alternatively, you’d be very confident working with someone who has a proven track record.","According to the white paper, Souls and SBTs will serve as the foundation for a decentralized society, described as a “transformative, pluralist future” where social interactions and human relationships are important building blocks for your Web3 identity.","Soulbound tokens can help resolve the issue of trust in Web3 by establishing provenance and reputation. They are not transferable and theoretically lower the risk of people manipulating the ecosystem by buying status or lying about their achievements. This could also make Web3 scams less prevalent due to a more complex process of identity theft and impersonation.","Eric Glen Weyl, one of the white paper’s authors, predicts that SBTs will be available for early use cases by the end of 2022. In September 2020, cryptocurrency exchange Binance announced that it would be issuing soulbound tokens on the BNB blockchain to all users who complete know-your-customer (KYC) requirements.","Privacy remains a challenge for SBTs and creating a truly decentralized society. However, soulbound tokens have the potential for large-scale utility.","Read more: What Happens When You Die in the Metaverse?"],"entity":[{"type":"Eric Glen Weyl","content":"PERSON"},{"type":"SBTs","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"September 2020","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Harvard graduate","content":"ORGANIZATION"},{"type":"hundreds of thousands of dollars","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Buterin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"}],"hashtag":["Learn","Beginner","NFTs"],"authors":["Andrey Sergeenkov"]}