{"summary":"Bank of America is hiring a public policy analysis and insights manager for crypto to track legislative and regulatory action, and identify “key risks” emerging tech could pose for its business.\nThe bank posted the job opening on LinkedIn last week.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181146\/bank-of-america-seeks-crypto-public-policy-expert-to-draft-bills-spot-key-risks-to-business","publishDate":"2022-10-29T14:15:05","id":1653,"type":null,"title":"Bank of America seeks crypto public policy expert to draft bills, spot &#x27;key risks&#x27; to business","category":["Policy"],"content":["Bank of America is seeking a crypto policy expert to keep tabs on digital asset regulation and identify \"key risks\" fintech could pose to its business.&nbsp;","The posting of the job ad for a public policy analysis and insights manager for crypto comes as large institutions and lawmakers take a more serious look at digital assets.","“We seek a policy analysis and insights manager who will identify emerging issues and evaluate the potential impact to the enterprise, with a primary focus on fintech\/cyber\/AI\/crypto\/stablecoins\/blockchain,” Bank of America wrote in the job posting.","The candidate for Bank of America’s crypto job would be responsible for analyzing policy proposals, drafting legislation, developing advocacy strategies and building coalitions within the industry. The role would also entail writing bill amendments and comments to regulators, along with drafting testimony to present to lawmakers and regulators, among other tasks.","The role would also involve identifying “key risks that emerging financial technologies and fintech business models may pose,” according to the job posting.","The bank <a href=\"https:\/\/www.linkedin.com\/jobs\/view\/3318202452\/?alternateChannel=search&amp;refId=fLrkYM9XdbmNz9GWTZOpfw==&amp;trackingId=C0wPkKck5TR304WeF2y9wA==\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">posted<\/span><\/a> the job opening on LinkedIn last week. The move comes as policymakers in Washington, D.C. weigh new regulations for the crypto market. The House Financial Services Committee has drafted stablecoin legislation that would create a federal framework around the industry and temporarily ban payment coins not backed by outside assets, although the bill has stalled.&nbsp;","The banking giant has become more active in the cryptocurrency and blockchain space in recent years. The firm, for instance, began clearing cash-settled bitcoin futures last year and joined Paxos's blockchain-based settlement network for equities.","Bank of America did not immediately respond to a request for comment on Saturday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":[]}