{"summary":"Analysts said BTC traders are probably waiting for macroeconomic signals before making a move, referring to the current market lull.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/04\/bitcoin-cash-spikes-10-after-halving-bitcoin-hovers-above-66k\/","publishDate":"2024-04-04T11:53:43","id":16538,"type":null,"title":"Bitcoin Cash Spikes 10% After Halving, Bitcoin Hovers Above $66K","category":["Markets"],"content":["Bitcoin Cash (BCH) surged 10% after completing its reward halving event, becoming one of the few gainers in an otherwise tepid market as bitcoin (BTC) – whose own halving occurs later this month – remained little changed over 24 hours.","BCH changed hands at $660 in European morning hours, a price level not seen since December 2021. The token remains 80% below a lifetime peak of $3,700 set in December 2017.","Bitcoin Cash’s block reward is now 3.125 BCH. Halving occurs when the reward for mining transactions is cut by 50%, reducing the rate at which new coins are created and thus lowering the available new supply.","Bitcoin’s own halving is expected on April 20, trackers show, and has historically preceded a bull market for the token. The previous halving, in 2020, spurred a 1,000% run to a then-record high of $69,000 roughly a year and a half later.","Read more: Bitcoin Halving, Explained","Open interest on BCH-tracked futures swelled to $700 million earlier this week from below $200 million in March, showing an increase in leveraged bets on more expected price volatility, as previously reported.","Meanwhile, crypto markets remained little changed in the past 24 hours amid the lack of market-moving catalysts. Bitcoin traded at just above $66,300, up 0.3% in the past 24 hours, and the CoinDesk 20, a broad-based liquid index of major tokens, excluding stablecoins, was down 0.7%.","Ether (ETH), BNB Chain’s BNB and Solana’s (SOL) were up 1%, while dogecoin (DOGE), Polkadot’s DOT, XRP and Cardano’s ADA were down as much as 1.2%.","Alex Kuptsikevich, a senior market analyst at FxPro, told CoinDesk in an email that the current lull was expected and traders were likely to be waiting for macroeconomic catalysts before making a move.","“While Bitcoin's inability to rise is alarming, we saw a weaker dollar and stronger stock indices the day before, which is fuelling risk appetite,” Kuptsikevich said. “The cryptocurrency market's lagging performance can easily be attributed to accumulated overbought conditions and wariness ahead of the monthly labour market report,'’ which is due tomorrow.","“At the same time, we regard the current weakness as consolidation within the bull market, almost excluding the risks of a long-term reversal,” he said.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"BCH","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"1,000%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"0.7%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"0.3%","content":"PERCENT"},{"type":"1.2%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"$3,700","content":"MONEY"},{"type":"Alex Kuptsikevich","content":"PERSON"},{"type":"$700 million","content":"MONEY"},{"type":"$660","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"Kuptsikevich","content":"PERSON"},{"type":"Cardano’s ADA","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"March","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$66,300","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Trading","Investing","Bitcoin Cash"],"authors":["Shaurya Malwa"]}