{"summary":"The Treasury's next quarterly debt announcement may not turn out as much a tailwind for risk assets as the previous one did.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/01\/08\/after-bitcoin-etf-decision-us-debt-announcement-may-be-pivotal-for-crypto-traders\/","publishDate":"2024-01-08T11:13:31","id":16535,"type":null,"title":"After Bitcoin ETF Decision, U.S. Debt Announcement May Be Pivotal for Crypto Traders","category":["Markets"],"content":["The crypto market is squarely focused on the U.S. Securities and Exchange Commission's decision on spot bitcoin (BTC) ETF applications due this week. Perhaps rightfully so, as observers have long said an exchange-traded fund investing directly in BTC rather than futures tied to the cryptocurrency will unlock billions of dollars in investments from retail and institutional investors.","Once that's out of the way, the next major event to watch out for could be the quarterly refinancing announcement (QRA) from U.S. Treasury Secretary Janet Yellen's department, due Jan. 29.","With debt and deficits surging in the post-Covid world, the detailing of three-month borrowing needs and the size and duration of bond auctions have begun drawing more interest than usual.","In August, the Treasury said it would boost sales for the first time in over two years while predicting further increases. Then, on Nov. 1, it said it planned to borrow $776 billion for the quarter, significantly less than expected, with slower sales of the 10-year Treasury note.","The positive surprise saw the 10-year yield, or long-end rates, drop from the widely watched 5% level and end the year at 3.86%. Bond prices and yields move in opposite directions.","U.S. 10-year debt is seen as one of the world's safest investments, and its interest rate is a global benchmark. The decline in the so-called risk-free rate likely incentivized risk-taking in financial markets, helping maintain demand for both bitcoin and stocks. (The ETF speculation catalyzed the rally, and supportive yield moves added to the momentum.)","The upcoming announcement, however, might flag higher-than-expected borrowing and not be that helpful, according to Quinn Thompson, head of capital markets and growth at decentralized credit market Maple Finance.","At the Nov. 1 announcement, the Treasury said it expected to borrow $816 billion in the first quarter, a record for the quarter, according to CNN.","\"Coming down the pipe, we have the upcoming QRA from the Treasury set to be released on January 29th, [which] should not provide the same gleeful result for markets as last quarter's,\" Thompson wrote in the Jan. 7 edition of his newsletter. \"Long-end rates are now ~100 bps lower, and Yellen should be looking to take advantage of that by terming out some debt. This should be a headwind for USTs.\"","Higher-than-expected borrowing with more sales of 10-year notes could put upward pressure on the benchmark yield, potentially slowing risk assets' ascent.","At press time, bitcoin was trading at $43,780, with the 10-year yield at 4.01%.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thompson","content":"PERSON"},{"type":"$776 billion","content":"MONEY"},{"type":"January 29th","content":"DATE"},{"type":"$43,780","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"3.86%","content":"PERCENT"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"$816 billion","content":"MONEY"},{"type":"CNN","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Quinn Thompson","content":"PERSON"},{"type":"Jan. 7","content":"DATE"},{"type":"Jan. 29","content":"DATE"},{"type":"first quarter","content":"DATE"},{"type":"Nov. 1","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"4.01%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"unlock billions of dollars","content":"MONEY"},{"type":"Yellen","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["Analysis","Bitcoin","Markets","US","Treasury Department","Treasury Bond","Bonds"],"authors":["Omkar Godbole"]}