{"summary":"There are a lot of crypto jobs, but do you need to be \"crypto-native\" to qualify? Here’s how to land a job in crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-you-need-to-know-and-do-to-get-a-job-in-crypto\/","publishDate":"2022-07-01T18:08:08","id":16548,"type":null,"title":"What You Need to Know and Do to Get a Job in Crypto","category":["Learn"],"content":["Crypto is a fast-growing and diverse industry, home to a broad array of organizations, from traditionally structured companies running services like centralized exchanges to decentralized platforms run by anonymous contributors.","The industry is growing fast, but it suffers from a serious talent shortage. The industry average for a crypto developer is $120,000, according to job listings site web3.career data based on anonymized submissions. In some cases, the annual compensation package for experienced engineers can run as high as $750,000 or (according to one tweeted job) over $900,000.","It’s not just blockchain developers who are sought after. The crypto industry has many non-technical jobs available, and for those who are really good at what they do, the upside potential is huge.","Source: web3.career data based on anonymous submissions","But if your desire to work in crypto is only about money, you may struggle. Crypto is an especially difficult industry – or indeed a culture – to break into or keep going without a passion and curiosity about the rapidly evolving sector.","“Most folks work in an industry. Crypto is not an industry, crypto is a community,\" Fredrik Haga, co-founder of blockchain analytics firm Dune Analytics, wrote in a blog post last year.","\"Both in the sense that people across the world come together to make a better financial system, but also as a cultural phenomenon…. Working in crypto means out with the LinkedIn content marketing posts and suit-infused ‘life is very serious and I’m very professional’ soullessness. In with Twitter, Telegram and Discord chats, dank memes, hackathons and all the colors and quirkiness that make life fun and interesting,” he wrote.","And getting a job in crypto also has its own quirks.","Read More: Crypto Discord: Where to Go, What to Know","The first requirement of most crypto jobs is that you understand crypto. Of course, that doesn't apply to all jobs, as some may be open to someone who is curious and excited about crypto and is willing to learn.","There are many free online resources for self-study, including CoinDesk’s CryptoExplainer+ content and Crash Courses. Other resources to check out include:","But the best way of understanding crypto is just \"doing\" crypto, which brings us to the next point.","Most jobs in crypto care about your crypto experience, which can be different than what you might traditionally think of – it’s not necessarily about having a previous job at a crypto company, but about having experience “doing crypto.” That could mean a range of things such as leveraged trading, providing liquidity, collateralizing assets and borrowing, yield farming, flipping NFTs, qualifying for airdrops, contributing to distributed autonomous organizations, publishing think pieces on Mirror.xyz … you name it.","Depending on the job, interviewers often probe this by asking questions such as:","One common prediction among crypto people is that there won’t be any need for such questions in the future: Your on-chain resume will have all the details a recruiter needs to know about your experience.","By “doing” crypto, you will have built up an on-chain resume, meaning a record of your crypto activities on a blockchain. This is a verifiable reputation system, and so unlike with traditional resumes, you can’t bend the truth.","Some Web 3 projects are dedicated to helping you build an on-chain resume. RabbitHole curates on-chain quests such as swapping tokens and lending on the Avalanche platform or completing four tasks that give you an introduction to DeFi. In return, you earn experience points from RabbitHole that you can redeem for NFTs later, and those NFTs function like certificates that show you have completed a course.","You can also generate reports of your overall on-chain performance through apps like Degenscore. Degen, short for degenerate, is a term for those in crypto, especially in DeFi, who like to experiment boldly, take big risks and are relentlessly active on-chain. Some recent job requirements in crypto make explicit reference to that:","See Also: What's An On-Chain Resume","Crypto’s a massive jungle. You may have started out buying a bit of bitcoin on the Coinbase exchange, but the next thing you know, you’re spending hours on the Discord messaging app so that you can be whitelisted for an NFT presale.","Some are drawn to the play-to-earn niche, and so they’ll know the hottest new thing in that sector of online games and will try it out. They will understand the economics behind it because they have seen it many times.","Others like to frequent DAOs. They like working toward shared goals as part of a community. They understand how DAO governance works and can navigate their way through messy Discord chats.","Your niche could also be limited to a particular blockchain, though you should choose wisely. Having a laser focus on Bitcoin will come handy in a Bitcoin job, but could limit you from a role involving a protocol on other networks.","Your daily energy and attention span are limited, so choose your niche wisely, especially after experimenting with different areas of crypto.","One common way of getting hired in crypto is getting noticed for one’s contributions to projects. DAOs will often make hires from those in their organizations who help bootstrap the project. Here, the playbook is simple: Get involved in Discord servers, jump on community calls and get things done.","Your contribution doesn’t have to be project-specific; it could also help advance the industry. One common way of demonstrating competence in crypto is by publishing Medium or Mirror.xyz articles on various topics. These are not only good for research, media or analysis-oriented roles, but also for operations where understanding of the underlying infrastructure is paramount.","Crypto jobs aren’t always widely advertised and often skip traditional sites like LinkedIn. Sometimes a job post will be a simple Discord announcement to make sure only those in the community will apply.","Many crypto companies use the following sites to find talent:","Good luck!"],"entity":[{"type":"Degen","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$900,000","content":"MONEY"},{"type":"$120,000","content":"MONEY"},{"type":"Fredrik Haga","content":"PERSON"},{"type":"$750,000","content":"MONEY"}],"hashtag":["Learn","industry","Beginner","Crypto","Jobs","Hiring"],"authors":["Ekin Genç"]}