{"summary":"These Ethereum layer 2 protocols help process transactions separately from the main network to help increase speed and lower costs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-rollups-zk-rollups-and-optimistic-rollups-explained\/#:~:text=Rollups%20process%20transactions%20on%20another,a%20fraction%20of%20the%20price.","publishDate":"2022-08-18T18:50:28","id":16545,"type":null,"title":"What Are Rollups? ZK Rollups and Optimistic Rollups Explained","category":["Learn"],"content":["Blockchains, like Ethereum, can be slow and expensive. Having to spend $25 or more in gas fees for a single transaction is not ideal if you want to complete a decentralized finance (DeFi) trade.","That’s why layer 2 systems such as rollups have emerged. Rollups process transactions on another, faster blockchain (known as a layer 2), then port the transaction data back to the parent blockchain (the layer 1 or mainnet) at a fraction of the price. This means that users can benefit from the speed and cheapness of the rollup while also benefiting from the security of the bigger blockchain.","Rollups are one of several scaling systems, which are simply methods to make a slow blockchain faster and cheaper. Other scaling systems include sidechains and state channels.","Many scaling products relate specifically to Ethereum, the largest smart contract blockchain. The core Ethereum developers are trying to improve the blockchain’s speed and costs over the next few years through a series of updates. The first major integration, the much-talked about Merge, is expected to go live in September 2022. These upgrades will not necessarily diminish the importance of scaling solutions. Instead, scaling solutions are likely to complement the Ethereum upgrades.","Read More: What Is The Merge?","There are two main types of rollups, Optimistic and Zero-Knowledge (ZK). The benefit of either is they cut down transaction costs considerably. The idea is that instead of waiting and paying for each transaction to process independently on Ethereum, dozens and dozens of transactions are recorded on the layer 2 chain, then “rolled up” into a single transaction that is then fed back to the more expensive, slower blockchain. By doing this, the cost of that one transaction is split across lots of users.","The first variety is called an Optimistic rollup. This is because it optimistically assumes that all the transactions contained within a rollup are valid. Optimistic rollups give everyone on the network a certain amount of time, usually a week, to contest fraudulent transactions. The benefit of the Optimistic rollup is that it’s quick; by assuming things are correct, the network doesn’t have to waste time confirming things. The drawback is that it usually takes about a week to officially withdraw your funds from popular networks like Optimism or Arbirtrum.","The second kind of rollup is a Zero-Knowledge rollup, also known as a ZK-rollup. These protocols use a complex piece of cryptography called a Zero-Knowledge proof to determine that a transaction is valid using only minimal information about that transaction. It’s privacy-preserving, sleek and, most important, fast and cheap. Compared with an Optimistic rollup, which requires funds to stay on the network until the dispute resolution period has closed, ZK-rollups allow users to withdraw their funds with less of a delay.","ZK-rollups hold a number of advantages over Optimistic rollups in terms of speed and security, but they are considerably more complex under the hood. So far, all of the ZK-rollups out in the wild have had specific applications, meaning they can only support a specific service or use case (like swapping non-fungible tokens or transferring crypto between addresses).","Thanks to recent advances in cryptography, teams from Polygon, Matter Labs and Scroll say they are close to launching the first zkEVMs – ZK-rollups that function identically to Ethereum’s mainnet. Like today’s popular Optimistic rollups, these newer ZK-rollups should be able to support virtually any application developers would care to build on Ethereum – making things vastly quicker and cheaper for end users.","Rollups, while they borrow Ethereum’s core security guarantees, still come with some risks relative to Ethereum’s mainnet.","For one thing, a rollup’s smart contracts can contain bugs – not unlike any other program built on Ethereum. While fail-safes and audits should help prevent exploits, relying on an external program to handle transactions will always carry some added risk.","Both types of rollups are also still in their infancy, and as such the networks on which they operate are often somewhat centralized. In some cases, the developing team behind a rollup maintains partial control over the network, and can theoretically pause or switch it off wherever they like.","Many rollups also continue to rely on centralized “sequencers” to efficiently coordinate transactions on the layer 2 chain. A sequencer can’t spoof or alter transactions, but it could technically censor or re-order them to extract some benefit for itself.","Rollups generally plan to decentralize in some form. Optimism began the transition to community governance earlier this year, and advances to rollup technology should ameliorate some of the issues around centralized network control.","See Also: Ethereum’s Rollups Aren’t All Built the Same","Using rollups is easy. Both Optimistic and Zero-Knowledge rollups work pretty much the same way. The idea is that you bridge your funds to the layer 2 network and complete the transactions you want to do on the rollup, like buy and sell cryptocurrencies or NFTs, move funds between wallets or interact with DeFi protocols. Once the transaction is done, you can port your funds back to Ethereum. Here’s a brief guide on how that works.","First, you’ll need to fill your crypto wallet, such as a MetaMask, with ether (ETH) or ERC-20 tokens – tokens that are compliant with the Ethereum blockchain. Then you’ll have to switch your wallet to the layer 2 network. That’s the same process as with any DeFi protocol – just hit “connect wallet.” After you’ve connected your wallet to the layer 2, you’ll want to “bridge” your tokens – move them from one network to another.","There will be an Ethereum transaction fee you'll need to pay to bridge your funds to a rollup. Once your funds are on the rollup, you can trade as usual. Some networks, such as Optimism, charge you ETH for transaction fees, but they’re a lot cheaper than on Ethereum itself. Others, such as Loopring, charge barely any transaction fees at all.","Once you’ve completed whatever transactions you set out to accomplish, you can always bridge your funds back to Ethereum. That entails converting rollup funds back into ERC-20 tokens that are native to the Ethereum mainnet. The process is the same – head to the token bridge and withdraw your funds.","See also: Are Blockchain Bridges Safe? Why Bridges Are Targets of Hacks"],"entity":[{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Loopring","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"September 2022","content":"DATE"},{"type":"$25","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Learn","Ethereum","Intermediate"],"authors":["Robert Stevens"]}