{"summary":"Efforts to create decentralized stablecoins outside the dollar system are attractive for privacy reasons but may be impractical, says our columnist.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/03\/22\/can-decentralized-stablecoins-stabilize\/","publishDate":"2021-03-22T18:46:41","id":16547,"type":null,"title":"Can Decentralized Stablecoins Stabilize?","category":["Finance"],"content":["","Decentralized finance (DeFi) idealists want to create perfectly free financial ecosystems that can't be subverted by governments, corporations or regulators. They also want their decentralized nirvana to be equipped with stablecoins so users can be protected from price craziness.","","","Therein lies the contradiction. ","","","Are decentralized anarchic systems, those that have no link to existing centralized institutions, capable of creating stability? Or are they too unanchored to generate the traction necessary for a stablecoin to be, well, stable?  ","","","A new wave of stablecoin architects thinks it's possible. They want to create money that is not only stable but also avoids relying on the authorities that underpin the dollar system.","","","Whether these new experiments work is another question.","","","Before I describe what these new experiments are, let me show what problem they are trying to solve.","","","DeFi refers to a set of financial applications built on blockchains using smart contracts, unstoppable and transparent bits of computer code. The biggest DeFi community is on the Ethereum blockchain, but other competing blockchains such as Binance Smart Chain, Terra and Tron are also trying to nurture a DeFi ecosystem.","","","A stable money is important to people who participate in financial transactions. Volatile assets like bitcoin and ethereum don't cut it. The Ethereum DeFi ecosystem’s thirst for stability has led it to become hugely reliant on USD coin, a U.S. dollar stablecoin issued by the Centre Consortium, consisting of Coinbase and Circle. ","","","J.P. Koning - Regulation Could Actually Help Tether ","","","USD coins are rock solid, but only because they are backed by dollars held in Circle’s accounts at a regulated bank. That bank is, in turn, connected to what most DeFi “maximalists” would probably see as the triple-headed snake of centralization: the Federal Reserve, America's central bank; the Federal Deposit Insurance Corporation, which regulates and insures banks; and FinCEN, the U.S.'s anti-money laundering watchdog.","","","So, ironically, DeFi's success, which rests in part on its stable tokens, comes courtesy of good ol'-fashioned Wall Street database technology.","","","The decentralization idealists worry that Circle, the issuer of USD coin, might be required to freeze addresses at the behest of law enforcement. FinCEN may require it to carry out know your customer (KYC) checks, thus unveiling a huge swath of DeFi. None of this is compatible with a purely decentralized financial nirvana. ","","","Which gets us to some of the solutions that are being proposed.","","","The most radical stablecoin experiments are empty set dollar, dynamic set dollar and basis cash. This trio of stablecoins, deployed on the Ethereum blockchain, tries to achieve decentralization by doing away with collateral.","","","Collateral refers to the \"backing\" assets that traditional money issuers have always relied on to ensure the stability of the money they issue.","","","In place of collateral, all three stablecoins deploy incentives that encourage stablecoins owners to refrain from selling whenever the stablecoin falls below $1. As more stray stablecoins are temporarily locked away, the supply of stablecoins gets reduced. In theory, this should push the stablecoin’s price back up to $1.","","","No-collateral money is a breakthrough idea for decentralization maximalists. Collateral, especially when it is regulated, is one avenue by which a stablecoin can be \"subverted.\" That's why basis cash, one of the no-collateral experiments, advertises itself as \"without regulatory risk.\"","","","But there's a problem with empty set dollar, dynamic set dollar and basis cash. Their prices as of yesterday were $0.13, $0.16 and $0.28 respectively, far below their $1 target price. These experiments don’t seem to be working out.","","","One no-collateral stablecoin does appear to be functioning, however: terraUSD. Found on the Terra blockchain, terraUSD is currently ranked the fifth-largest stablecoin on CoinGecko.","","","Like empty set dollar and its close relatives, terraUSD's stability relies on incentives, not collateral. When terraUSD falls below $1, say to 98 cents, traders are given an opportunity to buy terraUSD and quickly convert them into $1 worth of newly created LUNA tokens, the Terra blockchain's governance token. And so traders earn a 2-cent profit. This has the effect of sucking up the excess supply of terraUSD and bringing it back to $1.","","","See also: J.P. Koning - What Happens if All Stablecoin Users Have to Be Identified?","","","Another stablecoin experiment, frax, has adopted a less radical collateral-lite framework. To maintain its $1 price, frax uses a similar incentive mechanism to terraUSD. But the frax protocol also holds a layer of collateral in reserve. The 110 million frax stablecoins currently in circulation are anchored by $96 million reserves, the remaining $14 million being unbacked.","","","Like terraUSD, frax has succeeded in maintaining a $1 price over the last few months.","","","So for decentralization maximalists who want stable money without collateral, it's a mixed bag. Experiments like empty set dollar have stalled. But others appear to be working, at least for now.","","","No-collateral and collateral-lite stablecoins are often advertised as technological advances. If so, one wonders why traditional finance never evolved its own versions of no-collateral money, despite centuries of lead time. ","","","One possibility is no-collateral money isn’t sustainable in the long term. The biggest threat to any stable asset is a \"black swan\" market disruption. People panic. There’s a run from riskier stable assets into less-risky ones. Pegs, once rock solid, melt away.","","","In response to these disruptions, a centuries-old blueprint for establishing stable money has evolved: over-collateralization. That is, if a bank issues $10,000 in fresh dollar IOUs to a home buyer, that $10,000 will be more than covered by the value of the borrower's house and downpayment.","","","Alternatively, if a bank lends to an investor and takes, say, Tesla shares as security, it will require $150 worth of Tesla for each dollar lent. The $50 is a \"haircut\" that the bank uses to protect itself.","","","As long as a banker is careful to apply appropriate haircuts, then when a panic hits and pressure builds on the bank’s $1 peg the bank can always sell this collateral and use the funds to support its peg. ","","","For instance, even if the value of Tesla collateral collapses from $150 to $100, the bank will still have enough “backing” to support the money it has issued. ","","","The worry is that in dispensing with collateral as a line of defense (or using less of it), the new breed of less-than-fully collateralized stablecoins may not be able to weather a major black swan event, say like a market crash, an outbreak of war or a new pandemic.","","","It’s possible that less-than-fully collateralized stablecoins will prove to be an enduring advance in financial technology. If so, they’ll imbue DeFi with true stability while simultaneously disconnecting it from the incumbent financial system. ","","","Or they could be highly risky assets that offer only the illusion of safety. We'll know which it is when the next big market disruption hits.",""],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tesla","content":"ORGANIZATION"},{"type":"$50","content":"MONEY"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"98 cents","content":"MONEY"},{"type":"$14 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$0.13","content":"MONEY"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"J.P. Koning","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"$0.16","content":"MONEY"},{"type":"Koning","content":"PERSON"},{"type":"Tesla","content":"LOCATION"},{"type":"Centre Consortium","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"$10,000","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$0.28","content":"MONEY"},{"type":"All Stablecoin Users Have","content":"ORGANIZATION"},{"type":"$96 million","content":"MONEY"},{"type":"$150","content":"MONEY"}],"hashtag":["Opinion","Stablecoins"],"authors":["JP Koning"]}