{"summary":"A judge ruled that the SEC made a plausible argument that Coinbase is operating as an unregistered broker, exchange and clearinghouse.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/27\/coinbase-loses-most-of-motion-to-dismiss-sec-lawsuit\/","publishDate":"2024-03-27T14:11:13","id":16540,"type":null,"title":"Coinbase Loses Most of Motion to Dismiss SEC Lawsuit","category":["Policy"],"content":["A federal judge ruled that the U.S. Securities and Exchange Commission brought enough of a case arguing that Coinbase is operating as an unregistered broker, exchange and clearinghouse that its suit against the cryptocurrency company should move forward.","Judge Katherine Polk Failla, of the U.S. District Court for the Southern District of New York, on Wednesday ruled against most of Coinbase's motion to dismiss the SEC lawsuit, finding that the regulatory agency had a \"plausible\" case against the exchange. She set an April 19 deadline for the parties to agree on a case scheduling plan.","The SEC sued Coinbase last year, the same week it sued fellow exchange Binance, alleging that it was violating federal securities laws by making trading and staking services available to the general public. It also argued that Coinbase Wallet acted as an unregistered brokerage.","\"We're pleased that yet another court has confirmed that, while the term 'crypto' may be relatively new, the framework that courts have used to identify securities for nearly 80 years still applies,\" an SEC spokesperson said in an email. \"It's the economic realities of a transaction, not the labels, that determine whether a particular offering constitutes a security.\"","While the judge said that the SEC seemed to have an argument that some of the tokens listed on Wallet might meet the standards for \"investment contracts,\" Coinbase didn't seem to be acting as a brokerage, dismissing that part of the suit.","The other aspects of the suit can proceed, she ruled, dismissing claims that the SEC is violating the Major Questions Doctrine (a U.S. Supreme Court ruling prohibiting federal agencies from exceeding their congressional mandates) or the Administrative Procedures Act. Indeed, Coinbase had ample notice the SEC was pressing cases against crypto companies, the judge ruled, pointing to the DAO Report and previous cases.","\"When a customer purchases a token on Coinbase's platform, she is not just purchasing a token, which in and of itself is valueless; rather, she is buying into the token's digital ecosystem, the growth of which is necessarily tied to value of the token,\" she said. \"This is evidenced by, among others, the facts that (i) initial coin offerings are engineered to have resale value in the secondary markets and (ii) crypto-asset issuers continue to publicize their plans to expand and support the token's blockchain long after its initial offering.\"","Similarly, token developers \"advertise the fact that capital raised through retail sales of tokens will continue to be re-invested,\" she noted.","These cases often survive past motions to dismiss, such as the SEC's case against Ripple. The judges are required to take the allegations as facts, but the substantive parts of the case will be argued later.","The case is one of many that may define how the crypto industry can operate in the U.S. If a judge rules that exchanges must be treated similarly to national securities exchanges, as the SEC seems to want, it would impose new restrictions and disclosure regulations on these trading platforms, as well as potentially limit the number of tokens available to retail investors.","UPDATE (March 27, 2024, 14:21 UTC): Updates with more background in the final two paragraphs.","UPDATE (March 27, 17:10 UTC): Adds SEC spokesperson comment in fourth paragraph.","Edited by Nick Baker.","\n"],"entity":[{"type":"March 27, 2024","content":"DATE"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 27","content":"DATE"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"April 19","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Major Questions Doctrine (a U.S. Supreme Court","content":"ORGANIZATION"}],"hashtag":["Regulations","Coinbase","SEC"],"authors":["Nikhilesh De"]}