{"summary":"UBS AG is the first financial institution to list a digital bond that is publicly traded and settled on both blockchain-based and traditional exchanges. \nInvestors can access the digital bond in traditional and digital markets.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182788\/ubs-ag-unveils-publicly-traded-digital-bond-that-settles-on-blockchain","publishDate":"2022-11-03T14:11:21","id":1654,"type":null,"title":"UBS AG unveils publicly traded digital bond that settles on blockchain","category":["Companies"],"content":["Investment bank UBS AG has introduced its new digital bond, which the bank says is<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>the first-ever to be publicly traded and settled on both blockchain-based and traditional exchanges<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The digital bond has the same investment structure, legal status and rating as a traditional senior unsecured note, the bank said in a <a href=\"https:\/\/www.ubs.com\/global\/en\/media\/display-page-ndp\/en-20221103-digital-bond.html?caasID=CAAS-ActivityStream\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">press release<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We are proud to leverage distributed ledger technology to launch the inaugural UBS digital bond,” UBS Group Treasurer Beatriz Martin said in a statement. “This shows our commitment to support the development of new financial market infrastructure.”","UBS AG’s senior unsecured digital bond is a 375 million Swiss franc-denominated ($272 million) three-year bond with 2.33% coupon. The bank will list the digital bond at SDX Trading and SIX Swiss Exchange. It will be eligible for the Swiss Bond Index, along with other UBS AG senior unsecured notes.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The digital bond settles instantly and automatically through atomic settlement technology, using the SIX Digital Exchange distributed ledger-based central securities depository network. Settlement does not require a central clearing counterparty, the bank said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":[]}