{"summary":"The Financial Stability Oversight Council met Thursday, releasing a report detailing all of its concerns from the past year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/14\/financial-regulators-reiterate-call-for-legislation-to-address-crypto-risks\/","publishDate":"2023-12-14T22:19:49","id":16558,"type":null,"title":"Financial Regulators Reiterate Call for Legislation to Address Crypto Risks","category":["Policy"],"content":["Congress still needs to pass legislation to address concerns the Financial Stability Oversight Council (FSOC) has about crypto, a new report by the intragovernmental group said Thursday.","FSOC, a financial stability watchdog composed of the heads of most major U.S. financial regulators, published its annual report after one of the group's meetings, taking a look at the past year in climate, banking, cybersecurity, artificial intelligence and other issues. As it has in years past, crypto received a section.","The council is recommending that Congress pass legislation defining and addressing crypto spot markets, as well as stablecoins. These are the same recommendations FSOC had at the end of 2022, the report noted.","\"The Council urges Congress to pass legislation that provides federal financial regulators with explicit rulemaking authority over the spot market for crypto-assets that are not securities. Congress should also pass legislation that would create a comprehensive prudential framework for stablecoin issuers that would also address the associated market integrity, investor and consumer protection, and payment risks.\"","The House of Representatives has two bills addressing these issues sitting before it, after Financial Services Committee Chair Patrick McHenry (R-N.C.) secured enough support to move these two bills out of committee.","It's unclear whether these bills will make it to a Senate vote. While McHenry reportedly tried to get the bills into annual must-pass defense legislation, Congress ultimately did not include any crypto provisions in this year's National Defense Authorization Act.","But as it did last year, FSOC said regulators may need to act if there is no Confessional action.","\"The Council remains prepared to consider steps available to it to address risks related to stablecoins in the event comprehensive legislation is not enacted,\" the report said.","Thursday's report flagged vulnerabilities like price volatility, a huge amount of leverage within the industry, cybersecurity and other risks to investors and financial markets as some of the group's concerns around crypto.","The report mentioned this year's Curve Finance hack, which saw the protocol lose $50 million. Though Curve later regained 73% of those funds, the report said one of the major concerns was that the loans backed by CRV might fall apart with the loss of so much collateral.","\"The drop in CRV’s price reportedly put over $100 million worth of loans taken out by Curve Finance’s founder at risk of being liquidated on other decentralized finance (DeFi) platforms,\" the report said. \"Given that DeFi protocols sell underlying collateral in the market if a user is unable to maintain their position, platforms holding CRV as collateral were at risk of experiencing significant losses if the loans liquidated and the price of CRV continually declined.\"","The report also continued to mention concerns about investor protections and market integrity, saying some companies may be operating outside existing law.","Stablecoins, which have long been a concern for finance regulators in the U.S., received its own subsection in the report.","\"if a stablecoin were to scale significantly, a run on the stablecoin could lead to fire sales of the traditional assets backing the stablecoin like bank deposits, MMFs, Treasury securities, and commercial markets is also small relative to the crypto-asset market and the traditional financial system,\" the report said as one example.","Another section of the report focused on nonbank financial institutions, which are becoming increasingly active and must be monitored for potential risks, the report said.","Edited by Aoyon Ashraf."],"entity":[{"type":"Financial Services Committee Chair Patrick McHenry (R-N.C","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Council","content":"ORGANIZATION"},{"type":"73%","content":"PERCENT"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"National Defense","content":"ORGANIZATION"},{"type":"Curve Finance’s","content":"ORGANIZATION"},{"type":"Financial Stability Oversight Council (FSOC","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"},{"type":"$50 million","content":"MONEY"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Regulations","FSOC","Treasury Department"],"authors":["Nikhilesh De"]}