{"summary":"Bankman-Fried's sentencing kicks off in a few hours.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/28\/recapping-ftx-founder-sam-bankman-frieds-trial\/","publishDate":"2024-03-28T10:00:00","id":16553,"type":null,"title":"Recapping FTX Founder Sam Bankman-Fried's Trial","category":["Policy"],"content":["Thousands of people’s financial stability was taken 15 months ago when FTX founder and then CEO Sam Bankman-Fried’s lies were exposed and the former crypto exchange fell apart.","Today, Bankman-Fried could be sentenced to up to 50 years in prison, which at his current age of 32 years, is nearly life-long.","For five weeks late last year, the former poster child fought for his freedom in a trial in which even his closest friends and confidants, including his onetime girlfriend Caroline Ellison, turned against him and came clean about the massive scheme that took place behind the scenes at FTX.","You're reading The SBF Trial, a CoinDesk newsletter bringing you daily insights from inside the courtroom where Sam Bankman-Fried will try to stay out of prison. Want to receive it directly? Sign up here.","Ellison, who took the stand for three consecutive days, detailed how her former boss ordered her to create seven different balance sheets to send to lenders at the time – all of them factually wrong as FTX wasn’t in a position to repay its loans.","Most importantly, she confirmed, through text messages and internal documents, how Bankman-Fried repeatedly made the conscious decision to take customer’s money and fund Alameda Research’s, the then trading arm of FTX, investments.","FTX and Alameda's collapse wasn't the accidental result of a poorly managed firm, as Bankman-Fried claimed it to be in his defense. It was a well-thought out plan that required several active decisions by the former CEO, knowing that they were criminal, a jury found last year.","In November, Bankman-Fried's jury convicted him on seven different charges: committing and conspiring to commit wire fraud on FTX customers; committing and conspiring to commit wire fraud on Alameda Research's lenders; conspiring to commit securities and commodities fraud against FTX's customers and conspiring to commit money laundering to hide the proceeds of wire fraud on FTX's customers.","Ellison, although by far the most anticipated and important witness in the trial, wasn’t the only person in Bankman-Fried’s close circle that turned on him.","Co-founder of FTX and chief technology officer Gary Wang and former engineering head Nishad Singh were two other key witnesses who took the stand for several days to talk about their involvement in the scheme.","Wang said that special privileges were given to Alameda Research which were written directly into the code. Singh confirmed that statement, and gave more details about how exactly money was moved, the code worked and other things, including Bankman-Fried’s lavish spending.","Despite all of that, Bankman-Fried seemed to remain hopeful throughout the trial and eventually took the stand himself. However, it quickly became clear that he wasn’t ready to answer fully. Instead, oftentimes he claimed he wouldn’t remember certain things he didn’t seem to want to answer. Prosecutors also pointed out several times that his statements were contradicting things that he had said before. Needless to say, it didn’t go well.","On November 3, Bankman-Fried was found guilty on all seven counts of fraud and conspiracy.","Last month, the defense urged Judge Lewis A. Kaplan, who oversees the case, to consider a sentence of six years, arguing that FTX creditors are likely to get the majority of their funds back.","Prosecutors called the proposal “woefully inadequate” and recommended that Bankman-Fried be sentenced to 40-50 years in prison, but the decision is ultimately up to Judge Kaplan.","Bankman-Fried’s sentencing starts at 9:30 a.m. Eastern time today.","— Helene Braun","Sam Bankman-Fried's sentencing hearing kicks off in a few short hours. For an analysis on how it might play out, check out yesterday's edition of this newsletter.","The hearing could be as brief as an hour or take all day, according to various attorneys (not affiliated with this case). It's all in Judge Lewis Kaplan's hands. Watch the CoinDesk website for live updates as and when they happen.","— Nikhilesh De","Edited by Nikhilesh De."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"November 3","content":"DATE"},{"type":"9:30 a.m. Eastern time","content":"TIME"},{"type":"today","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Helene Braun","content":"PERSON"},{"type":"Bankman","content":"LOCATION"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"50 years","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Sam Bankman-Fried","SBF Trial","Newsletters","The SBF Trial Newsletter"],"authors":["Helene Braun"]}