{"summary":"Wasabi Wallet 2.0 will introduce privacy enhancement \"WabiSabi,\" a more efficient CoinJoin framework.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2021\/07\/07\/bitcoin-privacy-wallet-wasabi-lays-out-roadmap-for-version-20\/","publishDate":"2021-07-07T19:00:00","id":16556,"type":null,"title":"Bitcoin Privacy Wallet Wasabi Lays Out Roadmap for Version 2.0","category":["Tech"],"content":["","Today, privacy-focused Bitcoin wallet Wasabi reports it has made significant progress toward the release of its Wasabi Wallet 2.0.","","","Founded almost three years ago, Wasabi Wallet pools multiple users’ unspent transactions (UTXOs) into a single Bitcoin transaction using CoinJoin. CoinJoin is a trustless process that makes it difficult for third-party observers, or even participants, to trace funds and it significantly lowers transaction fees. In order to protect the anonymity of its users, Wasabi traffic runs through the Tor network, an online network that focuses on censorship resistance and anonymity, by default. ","","","Wasabi Wallet 2.0 aims to improve the user interface of the wallet as well as introduce a more efficient coinjoin framework, which developers call WabiSabi.","","","“One of the biggest challenges was developing the software for more than just cypherpunks and people very well versed in Bitcoin,” said CTO David Molnar. ","","","“It was difficult to get the developers and contributors to see the bigger picture, that we can only win the privacy war if we expand our vision to include all future Bitcoin users and not just the privacy advocates and cypherpunks.” ","","","While the new UI will allow users to access “pleb-friendly,” frictionless and secure payments via Tor, WabiSabi boasts its own set of upgrades:","","","Wasabi Wallet 2.0 has no defined launch date; however, the company has committed to and published three milestones:",""],"entity":[{"type":"David Molnar","content":"PERSON"},{"type":"WabiSabi","content":"ORGANIZATION"},{"type":"Wasabi Wallet","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Privacy","Bitcoin","Bitcoin Wallets","Wasabi Wallet","WabiSabi"],"authors":["Myles Sherman"]}