{"summary":"Sen. John Hickenlooper, D-Colo., urged the Securities and Exchange Commission to set new rules for digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176985\/digital-asset-regulation-needed-now-senate-democrat-tells-secs-gensler","publishDate":"2022-10-13T10:05:32","id":1655,"type":null,"title":"Digital asset regulation &#x27;needed now&#x27; Senate Democrat tells SEC&#x27;s Gensler","category":["POLICY"],"content":["A formal regulatory process for digital assets is “needed now,” Sen. John Hickenlooper, D-Colo., wrote in a letter to Securities and Exchange Commission Chair Gary Gensler this week.","“Digital asset markets do not have a coordinated regulatory framework. This creates uneven enforcement, and deprives investors of a clear understanding of how they are protected from fraud, manipulation and abuse,” Hickenlooper wrote on Thursday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Hickenlooper is calling on Gensler to “engage” by collecting public input and putting forward new rules to determine which crypto tokens are securities or commodities. Clearer regulation will protect investors who “may not be fully aware of the risks associated with digital asset investments,” the Democratic lawmaker noted.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Given the complexity of these issues, and recognizing that some digital assets are securities, others may be commodities, and others may subject to a completely different regulatory regime, a formal regulatory process is needed now,” Hickenlooper wrote. When he was governor, Hickenlooper created the Colorado Council for the Advancement of Blockchain Technology Use.","Hickenlooper requested the commission clarify which types of digital assets are securities, determine how to issue and list digital securities and determine which disclosures are necessary to inform investors. Hickenlooper also encouraged the commission to create a registration regime for digital asset security trading platforms and set rules on how trading and custody of digital assets should be conducted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Colorado Council","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Colo.","content":"LOCATION"},{"type":"John Hickenlooper","content":"PERSON"},{"type":"Advancement of Blockchain Technology Use","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hickenlooper","content":"PERSON"}],"hashtag":["GARY GENSLER"],"authors":["Stephanie Murray","The Block"]}