{"summary":"From bringing bad actors to book to scaling Ethereum, this year prepared the ground for bigger things to come, says E&Y’s Paul Brody.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/18\/under-the-hood-2023-was-a-highly-constructive-year-for-crypto\/","publishDate":"2023-12-18T15:13:24","id":16569,"type":null,"title":"Under the Hood, 2023 Was a Highly Constructive Year for Crypto","category":["Consensus Magazine"],"content":["Bringing bad actors to justice has been the single most important accomplishment in the world of crypto and blockchain in 2023. Go back in time to November 2022. At that time, as the largest fraud in the history of crypto was being exposed (well done CoinDesk!), many feared that those responsible would never be held accountable. More than a few of my acquaintances thought that all the money given to the politicians would act as protection, clearly not.","This post is part of CoinDesk's \"Crypto 2024\" predictions package.","Fast forward to December 2023 and we pile on convictions and settlements and record fines for bad actors. Many people are going to spend real-time in real prisons for stealing customer money, misusing it or violating other laws.","As basic as this might seem, it's enormously helpful in laying the foundation for a better future. In case you've never experienced it, competing against a company that's a fraud is remarkably difficult. They can promise things you can't, because they have no intention of delivering. And have you tried selling regulatory compliance or audit services to companies where the executives are committing fraud? They always seem to have a reason why they're not ready to invest yet.","Justice matters for consumer confidence as well. The crypto markets have risen in price significantly this year, but on volumes that are much lower than in the past. Restoring some sense of trust in the markets as a whole and the offerings of exchanges, which are the main consumer on-ramps into the ecosystem, is going to be especially important.","Beyond the pursuit of justice, I think few people will look back upon 2023 as a pivotal year in the history of blockchain. It won't be because nothing important happened, but because all the really critical things that did happen were largely invisible.","Historians may say that Ethereum's triumph happened with the \"Merge\" in 2022. In reality, that was a culmination of many years of work. Even more so, it took much of 2023 for everyone to really absorb that and adapt to this new environment. The explosion of Layer 2 traffic on Ethereum, which now exceeds the Layer 1 traffic, took place this year. Ethereum might have officially been 2022's big winner, but the real work to build on that at scale happened in 2023.","Read more: Marc Hochstein - What Prediction Markets Are Forecasting for Crypto in 2024","Similarly, I think future historians will mark 2024 as the beginning of a new regulatory era for crypto and blockchains, with ETFs being added in the US market and the opening of regulated trading under the Markets In Crypto Assets (MiCA) legislation in Europe. Again, from ETF applications to the legislative and regulatory details to enable MiCA, much of it happened in 2023.","If you pay attention to the progress of blockchain and crypto, 2023 was an amazing and constructive year. As we approach the end of the year that was challenging from a business perspective, I can tell you, I still think we're going to make it. On the other hand, if you weren't tuned into the real work going on, all you heard about were criminals and convictions. IYKYK.","Edited by Benjamin Schiller."],"entity":[{"type":"Marc Hochstein","content":"PERSON"},{"type":"Crypto Assets (MiCA)","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"MiCA","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"Europe","content":"LOCATION"}],"hashtag":["Opinion","Crypto 2024"],"authors":["Paul Brody"]}