{"summary":"Which digital currencies are most useful in a crisis, asks a Brazilian central banker. CBDCs, bitcoin or libra?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/03\/24\/the-pandemic-gives-digital-currencies-another-chance-to-shine\/","publishDate":"2020-03-24T17:30:24","id":16560,"type":null,"title":"The Pandemic Gives Digital Currencies Another Chance to Shine","category":["Policy"],"content":["","Marcelo M. Prates is a lawyer at the Central Bank of Brazil and holds a doctorate from Duke University School of Law. The views expressed here are his own and do not reflect the position or policy of any of the institutions with which he is affiliated.","","","In times of crisis and radical uncertainty, the search for alternatives that can improve everyday life intensifies. The Bitcoin project was launched in October 2008, just six weeks after Lehman Brothers filed for bankruptcy and the financial crisis went from bad to dreadful. Since then, many other private cryptocurrencies have sprung up, and even central banks have began contemplating digital currencies of their own. None of these digital currencies became widely available or adopted, though.","","","The coronavirus pandemic and its severe social, political and economic repercussions give digital currencies one more chance to shine. Unlike cash, digital currencies would not be a potential source of virus transmission or require persons to overlook social distancing when making payments. A central-bank digital currency (CBDC) available to the public could, moreover, allow the government to send money directly to the population as part of a stimulus plan without having to mail checks.","","","But can digital currencies, private or public, finally deliver on their promises and change money for the better? It does not seem so.","","","First, cryptocurrencies are an elitist type of money. Bitcoin (BTC), the reigning cryptocurrency until these days, may be attractive to the tech savvy and wealthy, but fails to meet the needs of people fighting for survival. As bitcoin enthusiast Peter McCormack reports from a recent visit to Venezuela, the persons who could benefit the most from bitcoin cannot use it. The poor and the less educated, who rely on cash and are the most affected by surging inflation, don’t have regular access to smartphones, connectivity or even electricity.","","","See also: 4 Reasons Central Banks Should Launch Retail Digital Currencies","","","Here lies a lesson for central banks. If they plan to issue a digital currency that can be used by banks and the public alike, they’ll need to adopt an all-or-nothing approach. Either everyone – no matter how poor, uneducated or old they may be – will have full access to the CBDC or it isn’t ready for launch.","","","Instability is the second reason why cryptocurrencies still fall short of revolutionizing money. Even if people from a country facing monetary disarray could flight for bitcoin to seek protection against hyperinflation, they would continue to face price instability. During the coronavirus outbreaks, bitcoin lost half its value in dollars in a matter of weeks – not what is expected from “digital gold.” As usual, liquidity and safety were only found in U.S. bonds and dollars.","","","So, the issuer or the people behind the currency still matter. Facing doomsday scenarios, both sophisticated investors in Tokyo and regular people in Harare trust the U.S. Treasury and the Federal Reserve above all. Does that mean governments are more reliable than private money issuers? Not necessarily.","","","As Argentinians and Brazilians can tell, some governments will not think twice before freezing bank accounts and limiting withdrawals during a crisis. Imagine what they could do with a CBDC! More than that, about nine in 10 dollars in circulation are already created by private parties: commercial banks. Bank deposits are the closest we have to a digital sovereign currency – and they’re privately issued.","","","To be sure, as Cornell law professors Robert Hockett and Saule Omarova well underscore, the modern financial system is a public-private partnership, in which a sovereign government takes a privately issued liability (bank deposits) as a liability of its own (money). This franchise-like arrangement also means that, when things go wrong, the sovereign government has to provide support in the form of liquidity assistance and bailouts. After all, it’s “the sovereign’s full faith and credit” that are at stake.","","","A privately issued digital currency could only present a credible alternative to this public-private model now in place if it could avoid bitcoin’s shortcomings. Global technology companies, like Google or Facebook, are the most favorably positioned to come up with an option in the short run. They can take advantage of their extensive user base and geographical dispersion to quickly provide the public with a digital currency that would facilitate not only local transactions but also cross-border payments.","","","See also: The US Should Use Stablecoins for Emergency Coronavirus Payments","","","Facebook’s libra was the initial step in this direction. However, as I argue in another post, libra looks more like a security than a currency and may well be a short-lived project because of its flawed design. To avoid this fate, the Libra Association should shy away from the stablecoin model, which requires the digital currency to be backed by a basket of sovereign currencies. This feature may be useful to help the digital currency keep its value stable. But it also turns the currency into a digital claim on a portfolio of assets, much like shares in a money-market fund.","","","If the Libra Association wants to create a truly digital currency, it should move libra closer to the bitcoin model. Libra could still have an identified issuer, but it should also have its own unit of account and not rely on sovereign currencies to be created, transferred, or valued. In this case, libra could deliver the benefits of both the public and private monies without the hassles.","","","Because of Facebook’s 2.4 billion user base, a revamped libra would be readily available to more than 1\/3 of the world’s population. Rich or poor, old or young, educated or illiterate, if these users can already access Facebook, they could easily use libra, too. Also, with a known and reliable issuer behind it, libra could gain the public’s confidence – as long as the Libra Association can overcome Facebook’s complicated history with privacy protection. And the more trustworthy the issuer, the more stable and safe the currency.","","","Against this backdrop, Facebook seems to be the only institution ready to launch an alternative currency in the digital format that could be widely available and potentially stable. In any case, finding the money of choice eventually comes down to answering one salient yet old question: Who do you trust the most (or the least) to take care of your money? Your government, bitcoin’s developers and miners or Facebook?","","","For comments, please contact marcelo.prates@bcb.gov.br",""],"entity":[{"type":"Venezuela","content":"LOCATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Tokyo","content":"LOCATION"},{"type":"Harare","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Libra Association","content":"ORGANIZATION"},{"type":"October 2008","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"Duke University School of Law","content":"ORGANIZATION"},{"type":"Central Bank of Brazil","content":"ORGANIZATION"},{"type":"Peter McCormack","content":"PERSON"},{"type":"Saule Omarova","content":"PERSON"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Reasons Central Banks Should Launch Retail Digital Currencies","content":"ORGANIZATION"},{"type":"Robert Hockett","content":"PERSON"},{"type":"10 dollars","content":"MONEY"},{"type":"US Should Use Stablecoins for Emergency Coronavirus Payments","content":"ORGANIZATION"}],"hashtag":["digital currency","Opinion","CBDCs","Digital Dollar","bitconi"],"authors":["Marcelo M. Prates"]}