{"summary":"Christopher Jensen from Franklin Templeton tackles myths about crypto in today’s Crypto for Advisors newsletter.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/09\/21\/top-3-crypto-myths-tackled-for-advisors\/","publishDate":"2023-09-21T15:45:00","id":16570,"type":null,"title":"Top 3 Crypto Myths Tackled for Advisors","category":["Finance"],"content":["Unsurprisingly, people are cautious about investing in new digital assets like cryptocurrencies, as this is a previously unknown asset class. Bitcoin began just over 10 years ago and a lot has happened – good, bad and ugly. Over 100,000 tokens and crypto projects have launched, and many have failed, seemingly designed from the outset to scam investors.","Still, many projects are standing the test of time and building real-world value. Many of these projects are considered transformational from a technology basis (the underlying blockchains), with many associated cryptocurrencies having seen a meteoric rise in value.","How can advisors help navigate this asset class and support their clients? Christopher Jensen from Franklin Templeton Digital Assets dispels some common crypto myths, allowing you to navigate your fear, uncertainty and doubt in this space.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Cryptocurrencies have been around for over a decade now but remain largely misunderstood by the investment community. In this article we dispel a few of the biggest myths surrounding crypto to help you assess the opportunities and risks for clients.","Many investors like to lump cryptocurrencies in with tulips and Beanie Babies, believing that they have little to no intrinsic value. And with headlines of bubbles in certain “meme coins” – risky, speculative, often backed by nothing but a comical concept – it’s easy to see why.","The underreported side is that there are thousands of cryptocurrencies that are backed by an actual business (a protocol) complete with employees (developers), customers, and revenues. Protocols in crypto are basic sets of rules that allow data to be shared between computers and thus establish how a specific blockchain or decentralized application operates. A protocol may have a native token, a type of cryptocurrency, that is used to transact on its blockchain. The two largest native tokens by market capitalization and their respective protocols are BTC (Bitcoin) and ETH (Ethereum). Tokens are what the vast majority of crypto investors hold.","Evaluating protocols is not so dissimilar from evaluating companies to invest in via stocks or bonds. Major considerations include the protocol’s purpose, customers and value created, as well as the competitive landscape. What is different from traditional investments is that there is not always a mechanism for the value of a protocol to flow through to the token. Fundamental analysis of a protocol and its respective token, sometimes referred to as tokenomics, can help determine whether the token has meaningful capital appreciation potential that might make it suitable for client portfolios.","Investors are accustomed to the traditional and highly regulated banking system where banks require identification documents and are bound by strict Know-Your-Customer or KYC regulations. Banks are required to comply with anti-money laundering regulations, and governmental sanctions may be applied at any time in the form of accounts frozen or seized in the event of illicit activity.","In contrast, cryptocurrencies can be traded anonymously, practically instantaneously, and are not controlled by a central authority. This makes them a likely target for enabling illicit transactions – in theory. The catch is that all transactions that occur on a blockchain are kept on the public record, and in order to use the money outside of the digital asset ecosystem a criminal needs a “fiat off-ramp” like a centralized crypto exchange. The centralized exchanges that exist today are extremely censorable, thus making stolen crypto extremely hard to cash out of without getting caught.","The data reinforces that the vast majority of crypto transactions are not used for illicit activity. According to Chainalysis, the illicit share of all cryptocurrency transaction volume in 2022 was 0.24%, down from its peak of 1.90% in 2019. The 0.24% of the crypto market translates to $20.8 billion of illicit activity, which is a very small fraction of the United Nations estimate of the $800 billion to $2 trillion laundered globally on an annual basis.","Cryptocurrencies – particularly bitcoin – have traditionally been portrayed as “energy gluttons,” receiving harsh criticisms related to their energy consumption. Because of their perceived energy intensive nature, many investors, especially those with ESG considerations, overlook digital asset investments entirely. Recent studies, however, have shown that bitcoin’s network may be significantly less energy intensive than we originally believed, and ultimately possesses several efficiencies over the traditional monetary payment system.","Bitcoin’s network relies on a mechanism known as Proof-of-Work (PoW) to operate. This means that for the network to verify transactions, bitcoin requires computers to solve increasingly complex math problems that consume a considerable amount of energy in the process.","However, a recent peer-reviewed publication estimated that the Bitcoin network consumes at least 28 times less energy than the traditional monetary payment when accounting for banknotes and coins, cash management in ATM systems, card payments, point of sale (POS) payments, banking and inter-banking energy consumption and several other contributing factors.","Additionally, Ethereum’s energy usage, which was in the general ballpark as Bitcoin’s when it had a PoW mechanism, has declined by 99%since changing to the less energy intensive Proof-of-Stake mechanism in September 2022.","Disclosure statement link.","– Christopher Jensen, Head of Research, Franklin Templeton Digital Assets","Cryptocurrencies Are Completely Anonymous - Cryptocurrencies are not anonymous. They are pseudonymous. The fact that crypto wallets are a long, random string of letters and numbers means it is extremely difficult to figure out what wallet belongs to whom. But once a wallet’s owner becomes public knowledge (for example you receive crypto from someone which reveals their public address) the entire history of that wallet becomes public knowledge. It is the double-edged sword of a transparent, public ledger.","Cryptocurrencies Are Only Used for Illegal Activities - Crypto can be used for illicit activities but as mentioned previously once wallet addresses become public knowledge there is no way to hide how much crypto you own, how much you have sent, and how much you have received. Just because you aren’t dealing with a bank doesn’t mean you are staying hidden from authorities. As a matter of fact, fiat is still the best way to transact if you are doing something you shouldn’t be doing and want to fly under the radar.","Cryptocurrencies Are Guaranteed to Make You Rich Quickly - For every crypto millionaire you’ve read about there are thousands more who lost it all. Nothing is guaranteed in crypto, it’s just the winners who are most vocal. Crypto, like investing in stocks, presents opportunities to make money for those who put in the time and effort to do due diligence on projects and have the patience to let things play out. If you think you’ll become a millionaire overnight you’ll be disappointed.","– Bryan Courchesne, CEO, DAIM","Anne Connelly has written and spoken about how charities can benefit from receiving donations in the form of cryptocurrency, due to its transparency and ease of sending funds to the recipient.","Wellington Management considers the investment case for crypto as an asset class.","Consequences for bad business in the crypto space: over 1,000 year jail sentence handed out to crypto boss in Turkey.","Edited by Bradley Keoun."],"entity":[{"type":"$2 trillion","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"0.24%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"$20.8 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Chainalysis","content":"LOCATION"},{"type":"S.M.","content":"LOCATION"},{"type":"Franklin Templeton Digital Assets","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Wellington Management","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$800 billion","content":"MONEY"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"Bryan Courchesne","content":"PERSON"},{"type":"ESG","content":"LOCATION"},{"type":"September 2022","content":"DATE"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"Anne Connelly","content":"PERSON"},{"type":"Christopher Jensen","content":"PERSON"},{"type":"1.90%","content":"PERCENT"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Investing","Bitcoin","Franklin Templeton","Speculation","illicit finance","Environment"],"authors":["Sarah Morton","Christopher Jensen"]}