{"summary":"The proposal to establish a U.S. tax regime for digital assets has drawn a stunning 120,000 comments and will be the focus of an IRS hearing today.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/13\/irs-raided-by-crypto-investors-as-industry-puts-up-fight-against-us-tax-proposal\/","publishDate":"2023-11-13T13:30:00","id":16576,"type":null,"title":"IRS 'Raided' by Crypto Investors as Industry Puts Up Fight Against U.S. Tax Proposal","category":["Policy"],"content":["The U.S. Internal Revenue Service (IRS) is gathering the final words now from a crypto sector that is arguing the agency's proposal for a digital-assets taxation regime is an existential threat to investor privacy and to decentralized crypto projects.","After a comment deadline and a public hearing on Monday, the U.S. Department of the Treasury's tax arm will have a mountain of more than 120,000 comments to sift through – aided in some instances by the wordsmithing of artificial intelligence tied to such campaigns as the LeXpunK Army's \"Treasury Raid.\"","Monday's hearing – confined to audio – will gather prominent crypto advocates to lay out their arguments on this proposal that maps out how crypto brokers and investors would report transactions to the IRS.","Read more: Crypto Tax Basics: A 101 for Beginners","The new taxation system – which won't become final until IRS officials weigh the input, rewrite a final version and approve it – has drawn industry ire that's partially focused on how the proposal would define a \"broker\" that needs to comply.","\"The digital asset middleman category stretches the statutory language beyond its breaking point in direct contravention of the relevant legislative history,\" the DeFi Education Fund argued in a comment letter. The current language of the proposal \"inexorably leads to the conclusion that the proposed regulations could treat every participant in the blockchain technology stack as a broker.\"","By intentionally roping in some decentralized finance (DeFi) platforms, decentralized autonomous organizations (DAOs), wallet providers and certain payment processors, the IRS may be trying to require tax information from organizations that would have difficulty providing it.","A comment from Americans for Tax Reform says the government's scope for brokers is pursuing \"a broad definition that includes entities incapable of reporting the applicable transactional information.\" The group argued that \"the IRS wants to rope DeFi into the reporting regime to ensure that other entities do not convert to DeFi entities and circumvent reporting requirements.\"","Another frequent industry concern was for investor privacy when it comes to government reporting of transactions, which crypto brokerage Coinbase (COIN) argued \"would impose an unprecedented, unchecked and unlimited tracking on the daily lives of Americans,\" according to a comment letter from Lawrence Zlatkin, the company's vice president for tax. He contended that the regulations as written would allow \"government surveillance of the choices Americans make about their most private health care decisions, or even when they purchase a cup of coffee.\"","Despite the objections, there is a general bright side for a crypto taxation approach in the U.S. Establishing rules and forms for how investors report their gains would eliminate one of the central impediments toward wider interest in cryptocurrencies: uncertainty over how to figure out what one owes in taxes. The proposal would establish a bespoke tax form, akin to the 1099s stock market investors are used to dealing with.","Were an IRS rule to pass before any of the crypto proposals from the U.S. Securities and Exchange Commission (SEC), it would clear the first major hurdle in U.S. crypto regulation: establishing an official status for digital assets in U.S. finance, even as Congress continues to stumble in its debate over future crypto markets laws.","Federal agencies are compelled to review all comments in the process of giving birth to a new rule, and the incredible volume for this proposal could demand more time than usual to complete that task. Tens of thousands of individuals provided objections.","Other complaints with the proposal focused on its inclusion of stablecoins as reportable assets and its relationship with defining securities.","To avoid this rule reinforcing the argument that digital assets are securities, Nicolas Morgan, president of the Investor Choice Advocates Network, asked the Treasury Department to make it clear that this rule wouldn't apply to securities law.","Read More: How the Crypto Industry Responded to the IRS Proposed Broker Rule","Edited by Stephen Alpher."],"entity":[{"type":"Nicolas Morgan","content":"PERSON"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"U.S. Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Treasury Raid","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"U.S. Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Investor Choice Advocates Network","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Lawrence Zlatkin","content":"PERSON"},{"type":"Army","content":"ORGANIZATION"},{"type":"Crypto Industry Responded","content":"ORGANIZATION"}],"hashtag":["Regulations","Internal Revenue Service","Tax","DeFi","DAOs","Privacy","taxation","Treasury Department","Tax Week 2023"],"authors":["Jesse Hamilton"]}