{"summary":"BitMex founder Arthur Hayes speculated about SOL hitting near $100 in a bullish weekend for altcoins.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/12\/07\/ether-solana-hit-19-month-highs-as-bitcoin-rally-halts-with-traders-fearing-bull-trap\/","publishDate":"2023-12-07T22:42:25","id":16584,"type":null,"title":"Ether, Solana Hit 19-Month Highs as Bitcoin Rally Halts with Traders Fearing 'Bull Trap'","category":["Markets"],"content":["Bitcoin's (BTC) rally halted Thursday, ceding the stage to cryptocurrency majors ether (ETH) and solana (SOL) which led the crypto rally after surging to fresh 19-month high.","BTC dipped to $43,000 during the day following its breakneck climb to near $45,000 earlier this week, suggesting that traders took some profits after the largest crypto's breakout from $38,000 a week ago. Recently, bitcoin was changing hands at around $43,300, down 1.1% over the past 24 hours.","ETH, meanwhile, popped 5% over the same period and hit $2,372, its highest level since May 2022.","Its rally drove up the prices of other ETH-adjacent cryptocurrencies, making them the best performers of the day. Ether classic (ETC) appreciated 6%, while liquid staking protocol Lido's governance token (LDO) increased by over 11%.","Native tokens of Ethereum scaling networks Optimism and Arbitrum also gained 22% and 9%, respectively, during the day.","Solana (SOL) jumped over 8% to $69, the highest since May 2022, following a three-week cool-off since its mid-November local top. Arthur Hayes, crypto investor and BitMex exchange founder hinted at a $100 price target, speculating about a bullish weekend for altcoins in social media platform X (formerly Twitter) post on Tuesday.","The CoinDesk Market Index (CMI), which tracks a market capitalization-weighted basket of almost 200 digital assets, was slightly up 0.6%.","Crypto analytics firm Santiment noted that BTC's flattening price coincided with traders increasingly calling for a potential \"bull trap,\" a short-lived rally that bates investors back to the market before a major downtrend.","\"Traders are fearful that crypto markets may be in a bull trap at the moment,\" Santiment posted on X (formerly Twitter) Thursday, citing social media metrics.","The growing disbelief could actually help propel BTC further toward $50,000, Santiment said, squeezing shorts who are betting on lower prices.","\"FUD [fear, uncertainty, doubt] could propel BTC to $50K if it increases,\" the firm added.","Edited by Aoyon Ashraf."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"$38,000","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"CMI","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Santiment","content":"PERSON"},{"type":"$43,300","content":"MONEY"},{"type":"0.6%","content":"PERCENT"},{"type":"$43,000","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"$69","content":"MONEY"},{"type":"1.1%","content":"PERCENT"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"$45,000","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"$2,372","content":"MONEY"},{"type":"$50K","content":"MONEY"}],"hashtag":["Market Wrap","Solana","Ether","Bitcoin","Santiment","Arthur Hayes"],"authors":["Krisztian Sandor"]}