{"summary":"The department has reviewed decentralized finance’s role in such incidents as North Korean ransomware attacks, and will issue a risk assessment, a senior official said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/03\/14\/us-treasury-poised-to-release-view-on-how-defi-used-in-illicit-finance\/","publishDate":"2023-03-14T20:05:41","id":16585,"type":null,"title":"U.S. Treasury Poised to Release View on How DeFi Used in Illicit Finance","category":["Policy"],"content":["The U.S. Treasury Department is close to releasing a risk assessment analyzing criminal use of decentralized finance (DeFi), according to Assistant Secretary for Terrorist Financing and Financial Crimes Elizabeth Rosenberg.","“Illicit actors are constantly looking for effective ways to hide criminal activity and the laundering of their proceeds,” Rosenberg said at a Monday banking event in Sydney, Australia. “This is a threat to DeFi services or other elements of the virtual asset ecosystem.”","Her team is “actively working on” an assessment that will be released soon, she said.","Because of “astounding” growth in virtual assets, the industry often “treats regulations and financial crimes compliance as an afterthought,” Rosenberg said. She said the potential harms from criminal use of virtual assets has been illustrated by groups affiliated with North Korea that have “conducted ransomware attacks, stolen hundreds of millions of dollars’ worth of virtual assets and laundered their ill-gotten funds through mixers and other virtual asset service providers to fund North Korea’s illegal nuclear and ballistic missiles programs.”","Read More: US Treasury Wants Public to Comment on Crypto’s Role in Illicit Finance"],"entity":[{"type":"Monday","content":"DATE"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Sydney","content":"LOCATION"},{"type":"North Korea","content":"LOCATION"},{"type":"Rosenberg","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"US Treasury Wants Public to Comment on Crypto’s Role in Illicit Finance","content":"ORGANIZATION"},{"type":"Terrorist Financing and Financial Crimes Elizabeth Rosenberg","content":"ORGANIZATION"}],"hashtag":["Regulations","Treasury Department","DeFi","illicit finance","North Korea","US"],"authors":["Jesse Hamilton"]}