{"summary":"The company's new self-custody wallet consists of an app, hardware device and recovery tools","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/12\/07\/jack-dorseys-block-bitkey-bitcoin-wallet-comes-to-market-in-more-than-95-countries\/","publishDate":"2023-12-07T16:55:02","id":16589,"type":null,"title":"Jack Dorsey's Block Bitkey Bitcoin Wallet Comes to Market in More Than 95 Countries","category":["Technology"],"content":["Jack Dorsey's fintech company Block (SQ) has unveiled its self-custody bitcoin wallet Bitkey for pre-order in more than 95 countries.","Bitkey consists of a mobile app, hardware device and a set of recovery tools, Block announced on Thursday.","The app allows customers to make bitcoin transactions via their mobile phone, while the hardware device stores their assets offline.","The app and hardware device form two of the three keys used to secure a customer's bitcoin, with the third stored on Bitkey's servers. The third key is used to verify transactions made by customers using only their phone (when they don't have the hardware device to hand) and to recover their wallet if they lose their phone, device or both.","Bitkey commenced beta testing over the summer ahead of the global rollout. Block announced in June that the wallet would connect to its payments platform Cash App and crypto exchange Coinbase (COIN) to facilitate buying and selling of BTC within the app.","Self-custody of crypto-assets became an increasingly significant area of concern for users following the collapses of numerous centralized cryptocurrency platforms, most notably FTX, but also Voyager and Celsius. Millions of users found out the hard way the truth in the old adage: \"Not your keys not your coins.\"","Pre-orders of Bitkey are expected to be shipped in early 2024, Block said.","Read More: Trezor Unveils New Hardware Wallets, Corrosion-Resistant 'Keep Metal' for Recovery","\n","\n","\n"],"entity":[{"type":"Bitkey","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Jack Dorsey","Block","Bitcoin Wallets","Wallet"],"authors":["Jamie Crawley"]}