{"summary":"The \"restaking\" protocol with $15 billion in deposits won't pay rewards to depositors and is missing its mission-critical \"slashing\" feature.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/10\/eigenlayer-cryptos-biggest-project-launch-this-year-is-still-missing-crucial-functionality\/","publishDate":"2024-04-10T17:59:47","id":16583,"type":null,"title":"EigenLayer, Crypto's Biggest Project Launch This Year, Is Still Missing Crucial Functionality","category":["Technology"],"content":["The blockchain project EigenLayer didn't go live on Ethereum's mainnet until Tuesday, but it had already become one of the network's biggest-ever protocols, with $12 billion worth of user deposits – a hot ticket partly because of its highly touted innovation of \"restaking,\" a new technology that could usher in dramatic changes in the way crypto protocols bootstrap their security.","A closer inspection reveals that EigenLayer has not yet activated most of the core features that make the project notable – including its reward system and its mission-critical \"slashing\" mechanism.","In the fast-moving, big-money world of crypto, EigenLayer has attracted a level of investor, developer and media interest that's rare: On top of its $15 billion worth of deposits at press time, Eigen Labs, the project's developer, raised a staggering $100 million from venture giant Andreessen Horowitz last year.","There's also a cottage industry of startups – called \"actively validated services\" (AVSs) – that are waiting to plug into EigenLayer's security apparatus, as well as \"liquid restaking\" startups aiming to piggyback off of EigenLayer's success, already netting billions of dollars in their own deposits.","EigenDA, a data-availability protocol built by Eigen Labs, was the first AVS to launch on EigenLayer – released on Tuesday in tandem with the rest of the EigenLayer protocol. As other AVS networks wait in the wings – for now, they're only allowed to \"register\" – EigenDA is supposed to be a proof-of-concept for what EigenLayer will eventually enable for other services: A way for networks to base their own security on Ethereum's.","In EigenLayer's current, arguably still larval state, however, EigenDA relies on a strikingly conventional security model. The protocol is controlled by a globally distributed set of operators, but they won't be financially punished if they act dishonestly – a core component of EigenLayer's purported security model. The protocol also won't pay out rewards to depositors, which is supposed to be the main incentive for restaking.","Sreeram Kannan, EigenLayer's founder and chief architect, acknowledged in an interview last week that the launch would move forward without some crucial functionality, instead proceeding under a \"phased\" rollout under an unspecified timeline.","\"We are allowing the EigenLayer marketplace to develop and stabilize before introducing in-protocol payments and slashing to mainnet later this year,\" EigenLayer said on Tuesday in its launch thread.","The use of so-called training wheels is not out of the norm in crypto – particularly given the experimental culture of the industry: When a startup is trusted with billions of dollars in user deposits, Silicon Valley's \"move fast and break things\" approach doesn't really cut it.","\"There are a lot of other projects that just take shortcuts and kind of balloon and are much, much higher risk than this,\" said Mike Silagadze, CEO of Ether.fi, a liquid restaking service that has deposited $3.8 billion worth of its users' funds into EigenLayer. \"I think relative to other crypto projects, this has actually been reasonably measured.\"","But as the third-largest decentralized finance protocol in terms of total value locked (TVL) – and competitors beginning to encroach on its turf – expectations for EigenLayer couldn't be higher.","EigenLayer centers around \"restaking\" – a way of repurposing the Ethereum blockchain's security to cover additional protocols, these AVSs. Technically how it works is that investors can take the ether (ETH) they've staked on the main Ethereum chain, and then reapply (or \"restake\") it to secure the AVSs; they could be blockchain bridges, crypto exchanges or data storage facilities.","The benefit for EigenLayer investors – called \"restakers\" – is that they get an extra rate of return on top of the interest they already receive for staking ETH. The AVSs get the advantage of \"pooled security.\"","Kannan gives the example of 100 blockchain protocols that are each secured by $1 billion worth of stake.","Imagine that \"instead of each of the protocols having $1 billion separately staked, there was $100 billion commonly staked across 100 protocols,\" said Kannan. \"To attack any one protocol, now you need $100 billion rather than needing $1 billion.\"","That's the idea, at least. The actual meat of the EigenLayer security system remains more theory at this point than reality, as do the pieces of EigenLayer's design that are supposed to pay out interest to depositors.","Take, for example, the \"slashing\" feature that sits at the center of EigenLayer's security system. Slashing is integral to EigenLayer: It ensures that networks built on top of the protocol can penalize operators if they act dishonestly – by revoking all or a portion of their restaked deposits.","But slashing wasn't included in EigenLayer's launch this week, and in an interview, Kannan couldn't give a firm timeline on when it would be ready – beyond that it would be sometime later this year.","There also remain big questions about how the whole thing will actually work – including how, and in what proportion, slashed tokens will be burned and distributed once they've been revoked. For AVSs to build on EigenLayer, such questions eventually need to be answered.","\"Even though the full slashing is not live, we are going to run this system in beta and make sure that people are able to use it, and maybe have redundant backups and other stuff,\" said Kannan.","Another yet-to-be-defined element of EigenLayer's programming is its \"attributable security\" system – a fallback mechanism that Kannan plans to use to protect against black swan events that threaten to wipe out the protocol's security apparatus. The feature exists to address the potential for contagion risk – the idea that a slashing event triggered by one AVS could hurt the security of every other AVS.","Attributable security works a lot like insurance (crypto founders mint new terms as quickly as they do new tokens), and in principle, a new actuarial market will spring up with pricing for each of the AVSs, ostensibly linked to their perceived risk.","\"A service that's built on Eigenlayer can come in and say, 'Out of this $100 billion that is totally staked, I want a particular attribution of $3 billion,'\" explained Kannan. \"Now, it's EigenLayer as a protocol's job to make sure that even if every other AVS is simultaneously depleted, I will be able to redistribute the amount of $3 billion to this AVS.\"","But asked to define how EigenLayer's attributable security market will actually price things in practice, Kannan said that his team \"has not published\" anything on it yet.","Then there's EigenLayer's fee system – the source of revenue it will use to reward interest to depositors, which is supposed to be the main incentive for restaking.","Kannan said in an interview with CoinDesk that the fee system is at the top of his team's priority list and should be easy to implement, but its absence means that users won't be able to earn interest for restaking with AVSs.","In the absence of this core feature, the billions of dollars deposited into EigenLayer thus far have come as a result of the platform's point system: EigenLayer prints out loyalty points that investors hope will eventually be convertible into real crypto tokens.","Until EigenLayer launched this week, many crypto traders and users were simply pursuing these points – Earning them by depositing assets into EigenLayer and liquid restaking protocols like Ether.Fi, and, in some cases, buying the points outright and trading them on 40x leverage via third-party crypto protocols aimed at risk-seekers.","\"In hindsight, I would probably say, man, we should have really toned down the point stuff because that just went really crazy,\" said Ether.Fi's Silagadze. \"Crypto is insane, so people took it way too far.\"","Read more: As Crypto 'Points' Farming Grows, So Does Risk of Vague Promises","Without slashing, fees and attributable security, EigenDA, currently the only AVS, is a far cry from what is ultimately envisioned for EigenLayer.","In the near term, EigenDA will be operated by a community of validators, but those validators won't be at risk of slashing – this means they won't be financially incentivized to act honestly (which is, well… the whole point of EigenLayer's \"pooled security\").","Kannan says most of EigenLayer's main features will arrive by the end of this year, but some find it difficult to take those estimates at face value.","“In some cases, there's just engineering problems, where you kind of bat your head against it, and eventually you're gonna figure it out,\" said Silagadze. \"And then there's research problems [...] there's literally no solution known.\"","When it comes to those research problems, \"it's hard to respect timelines,\" said Silagadze, \"because these are unsolved problems that you're trying to sort out.\"","The lack of clarity around the state of EigenLayer's technical stack has led to mounting frustration among some EigenLayer developers who requested anonymity in order to discuss the topic candidly – along with confusion for users around where EigenLayer currently sits on its ambitious roadmap.","There are also concerns that EigenLayer's design is tantamount to \"rehypothecation\" – an oft-criticized practice from traditional finance where collateral is repackaged for higher potential returns, but also a higher risk of losses. (Kannan vehemently rebuts this argument, stating that, among other things, EigenLayer is different from conventional rehypothecation because it grants users complete control over their assets.)","\"I think we need to get better at communicating changes and our roadmap to the broader EigenLayer ecosystem,\" said Kannan. \"We did not expect to be at this scale where there's so many projects that are dependent and are downstream of our codebase.\"","Calvin Liu, Eigen Labs' chief strategy officer, says he welcomes the scrutiny.","\"When something has a ton of hype, that’s when you should examine most closely and be most skeptical. I appreciate that and take that view to other projects all the time,\" Liu said in a message on Telegram. \"I am confident that in time we’ll stand up to that view. And I welcome the prodding - it only makes us better in the long run.\"","Edited by Bradley Keoun."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"$3.8 billion","content":"MONEY"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Mike Silagadze","content":"PERSON"},{"type":"Silagadze","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum's","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$12 billion","content":"MONEY"},{"type":"$15 billion","content":"MONEY"},{"type":"Eigen Labs","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$100 billion","content":"MONEY"},{"type":"Liu","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"AVS","content":"ORGANIZATION"},{"type":"Calvin Liu","content":"PERSON"}],"hashtag":["Features","EigenLayer","Restaking","Ethereum","Liquid staking","Decentralized Finance"],"authors":["Sam Kessler"]}