{"summary":"Sepana has announced today it has closed a $10 million funding round led by venture firms Hack VC and Pitango First.\nFounded by two brothers, Daniel and David Keyes, Sepena seeks to make web3 content such as DAOs and NFTs more discoverable through its search tooling.","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184102\/decentralized-search-startup-sepana-raises-10-million","publishDate":"2022-11-08T06:32:21","id":1659,"type":null,"title":"Decentralized search startup Sepana raises $10 million","category":["Infrastructure"],"content":["Decentralized search startup Sepana has announced today it has closed a $10 million funding round led by venture firms Hack VC and Pitango First.","Protocol Labs, Lattice Capital and Balaji Srinivasan also took part in the round for the startup according to an email shared with The Block. Sepana declined to share its valuation, and said that the deal closed this week.","Founded by two brothers, Daniel and David Keyes, Sepana seeks to make web3 content such as DAOs and NFTs more discoverable through its search tooling. One way it's doing this is via a forthcoming web3 search API that aims to enable any decentralized application (dapp) to integrate with its search infrastructure.&nbsp;","It claims that millions of search queries on blockchains and dapps like Lens and Mirror are powered by its tooling.&nbsp;","The funding will be used to hire senior blockchain engineers and search experts and also launch a product to foster the \"search community\" around the product.&nbsp;","In the long term, the company is looking to build a fully decentralized peer-to-peer search protocol. It says that this infrastructure will help create information bridges between decentralized applications and protocols to improve search outcomes with privacy at the forefront.&nbsp;","“The algorithms that dictate our online lives should be open-source and community-governed,\" said Daniel Keyes in a statement shared with The Block.&nbsp;","This follows similar raises in the web3 search and indexing tooling space. Last month, Blockchain indexer Nxyz emerged from stealth to <a href=\"https:\/\/www.theblock.co\/post\/176512\/paradigm-leads-blockchain-indexer-nxyzs-40-million-raise\" data-v-f87c67ca=\"\">secure<\/a> $40 million in a Series A round led by Paradigm. In May, Montreal-based crypto startup Lighthouse Labs <a href=\"https:\/\/www.theblock.co\/linked\/146303\/lighthouse-labs-raises-7-million-in-seed-round-to-build-metaverse-search-engine\" data-v-f87c67ca=\"\">raised<\/a> $7 million in seed funding ahead of the launch of its metaverse search engine."],"hashtag":[]}