{"summary":"A blueprint for a central bank digital currency designed with a specific purpose: stopping layoffs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/04\/23\/digital-dollars-can-reduce-unemployment-heres-how\/","publishDate":"2020-04-23T11:30:21","id":16597,"type":null,"title":"Digital Dollars Can Reduce Unemployment, Here's How","category":["Policy"],"content":["","Marcelo M. Prates is a lawyer at the Central Bank of Brazil and holds a doctorate from Duke University School of Law. The views and opinions expressed here are his and do not reflect the position or policy of any of the institutions with which he is affiliated. @MMPrts ","","","Early in the coronavirus pandemic, one particular limitation of government action became evident. After crossing political hurdles to provide economic relief to those most in need, governments realized they lacked a fast and simple way to send money directly to their citizens. In the United States, the initial idea was to mail paper checks to the population. Aid recipients would have to wait several days not only for the check to arrive in their right address but for the deposited check to clear, making the funds finally available.","","","As sending money electronically would be far more convenient, direct deposits were eventually adopted as the default payment option in the stimulus bill signed into law. The money that will be sent to households, however, could take several weeks to arrive. In the meantime, 22 million Americans, or 13 percent of the labor force, have filed for unemployment benefits in the first four weeks after a stricter lockdown was enforced. The potential for lasting hardship and social unrest is frightening, requiring governments to do better.","","","See also: Money Reimagined: As Tech, Politics and COVID-19 Collide, a Global Reset Looms","","","Against this backdrop, I propose a central bank digital currency (CBDC) that would be the mirror image of the money we have today because it would reverse the process by which money is created and put in circulation. The CBDC would be issued by employers when paying wages and would reach the central bank only after circulating among persons and businesses. This CBDC would need legislative action to be created and be considered legal tender, requiring some political heavy lifting along the way. But its implementation would be relatively straightforward. Let’s call it MoneytothePeople (MttP) while referring to traditional money as dollars ($).","","","Figure 1 shows a stylized model of the current monetary system. Money flows from a central bank to the banks, which then spread it out to the economy. One of the essential characteristics of this model is perhaps the most overlooked: The central bank has no direct contact with the public. The modern central bank depends on the banking system to perform all monetary functions, from getting currency into circulation to conducting monetary policy. That is the reason why the government institution entrusted with the mystical power to “print money” cannot, even when it needs to, put money in people’s hands.\n","","","Figure 2, in contrast, models the MttP system. MttPs are issued by institutions when paying wages, and their employees spread MttPs out by making payments for essential goods and services. Banks, in turn, must accept payments in MttP or exchange MttPs for dollar balances in bank accounts with no loss of value. Only at that point do MttPs reach the central bank, which receives MttPs from the banks in exchange for reserves. Reserves are also issued by the central bank but only used to settle payments among the central bank, the banks, and the government.","","","The MttP model directly tackles unemployment by granting the power to issue the new currency to public and private institutions responsible for paying wages. No existing asset has to be encumbered, and no liability is created when an employer issues MttPs to pay its employees. In this sense, MttPs are created out of nothing and only become an asset once they appear in the digital wallets of the employees.","","","Operationally, employers with an identification number for tax purposes (the EIN in the U.S.) would be required to set digital wallets for their employees holding a taxpayer identification number (either ITIN or SSN). These wallets could be developed by fintech firms, like PayPal or Coinbase, using technology that already exists. But the wallets would be validated and ultimately managed by the central bank. Moreover, as all users would be identified by their tax identification number, the wallets would be automatically compliant with anti-money laundering rules.","","","Once the local or national government declared a state of emergency, all affected employers would be automatically authorized to pay up to a certain amount of the next wages in MttPs – say, $1,000, which is close to the average weekly earnings in the U.S. In this case, employees who received $900 in cash every week would now receive 900 MttPs in their digital wallets. Employees who usually received a $2,400 weekly deposit would get 1,000 MttPs in the digital wallet and $1,400 in the bank account. For the U.S., with almost 160 million people employed before the pandemic struck, this individual cap would limit the monthly issuance of MttPs to the equivalent of about $640 billion.","","","Employees would then be able to use the MttP balance on their digital wallets to make payments for essential goods and services. For that to happen, it would be mandatory at least for institutional landlords, utility providers, grocery stores, and financial institutions to set up corporate digital wallets to receive payments in MttPs. These institutions could, in turn, make payments among them using MttPs or exchange MttPs for dollar balances in their bank accounts at a one-on-one conversion rate.","","","For market participants, MttPs would be a liquid asset to pay for goods and services. But when banks finally transferred MttPs to the central bank in exchange for newly issued reserves, a central bank liability, these MttPs would turn into a non-performing asset. For the central bank, MttPs would retain some value only to the extent they could eventually be shifted to the treasury with the corresponding reduction in the central bank’s liabilities. ","","","MttPs would create an incentive for employers to keep workers on the payroll, thus avoiding extensive furloughs even in the face of store closures and plunging demand. But MttPs would be issued solely for wage payments. Other employers’ creditors, like suppliers and service providers, would continue to be paid in dollars. The MttP system aims not to substitute for the traditional monetary and banking systems but to offer a supplementary monetary channel that could be used to prevent massive layoffs and severe unemployment.","","","Although otherwise unencumbered for employers, MttPs should come with one condition to prevent fraud and abuse. As employers would self-declare the payroll, set digital wallets for their employees, and directly make the related payments, employers would have the legal obligation to hold the payroll unchanged for the same length of time the emergency lasted. After the emergency was over, the employer would continue to pay, now in dollars, the same wages paid during the emergency period, except for the employees who decided to quit the job.  ","","","For formal employees, MttPs would enable a direct and timely relief that would have positive externalities. If employees kept receiving their wages and, in turn, were able to meet their basic payments, the economy could still suffer a slowdown but would not grind to a halt. Without the burden of unpaid wages and the repercussions that follow, like loads of outstanding debts and broken contracts, commercial and financial markets as well as the judicial system could keep running more smoothly.","","","See also: How a Flurry of ‘Digital Dollar’ Proposals Made It to Congress","","","The MttP system would, moreover, allow the central bank to bridge what Agustín Carstens, the head of the Bank for International Settlements, recently called the “last mile.” As he rightly underscores, “central bank interventions to quell the crisis need to reach the individuals and businesses who are ultimately affected.” The MttP model could also reduce the need for the central bank to rely on unconventional measures to soothe financial and capital markets. With the trove of institutional and personal data generated by the digital wallets in real time, the central bank could make a more accurate decision on when and how to provide additional support for specific sectors or institutions.","","","MttPs could also serve as a sandbox for CBDCs. As I elaborate in another post, modeling a CBDC demands running cost-benefit analysis of several technological, social, economic, political, and legal issues. And it seems the more central banks agonize over these issues, the further away CBDCs get from implementation. Since MttPs would be limited in scope, they would be easier and faster to launch and would not disrupt the traditional monetary and banking systems or pose a significant privacy threat. ","","","Finally, because MttPs would be issued by employers and would reach the central bank only after circulating in the economy, the government would have time to frame the crisis response and manage its costs after it had already started. Depending on inflationary and fiscal constraints, the government could design the MttP injection as a monetary stimulus, keeping MttPs on the central bank’s balance sheet for an extended period. Or it could opt for a fiscal stimulus, creating the conditions for the central bank to transfer the MttPs to the treasury at once. This feature of the MttP system could be particularly useful for countries experiencing tough economic times even before the pandemic.","","","The MttP model brings, thus, not only a more efficient sovereign money for times of crisis but also a powerful mechanism to promote the goal of maximum employment, directing help to people and, with that, benefiting businesses and the economy – not the other way around. By enabling the prompt delivery of a targeted stimulus program with deferred costs, the MttP system overcomes the limitations of the current monetary system when facing extreme circumstances. The challenges ahead are formidable; so must our responses be.",""],"entity":[{"type":"$900","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$)","content":"MONEY"},{"type":"$640 billion","content":"MONEY"},{"type":"19","content":"DATE"},{"type":"today","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Agustín Carstens","content":"PERSON"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Duke University School of Law","content":"ORGANIZATION"},{"type":"13 percent","content":"PERCENT"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"$1,400","content":"MONEY"},{"type":"Central Bank of Brazil","content":"ORGANIZATION"},{"type":"$2,400","content":"MONEY"},{"type":"Tech","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Opinion","CBDC","Digital Dollar"],"authors":["Marcelo M. Prates"]}