{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of May 2-8.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/02\/protocol-village\/","publishDate":"2024-05-08T18:42:55","id":16592,"type":null,"title":"Protocol Village: Omni Launches Open-Source EVM Framework 'Octane' With Sub-Second Finality","category":["Technology"],"content":["May 8: Omni Foundation launched Omni Octane, an \"open-source EVM framework optimized for high performance which can be used to build customized blockchain infrastructure.\" According to the team: \"Modular design allows creation of new, performance-optimized L1 networks and can operate as the first L2 decentralized sequencer. Octane delivers sub-second finality, RPC query latencies as low as 5 milliseconds, and exceptionally high transaction throughput. This presents the first opportunity to unlock decentralization among L2 while maintaining the rapid confirmation which had only been possible with centralized sequencers.\"","May 8: Inference Labs has \"raised $2.3 million in pre-seed funding to develop a Proof-of-Inference network aimed at democratizing AI through zero-knowledge verification,\" according to the team. The funding round was led by Digital Asset Capital Management, Delphi Ventures and Mechanism Capital and attracted a diverse group of investors, including Big Brain Holdings, BitScale Capital, Edessa Capital, ID Theory and Metropolis DAO. Additionally, Inference Labs introduced Omron.ai to address the complex challenge of optimizing staked allocations across Actively Validated Services (AVS) through the application of artificial intelligence (AI). \"With Omron, Inference Labs blends zero-knowledge cryptography and advanced machine learning. Proof-of-Inference allows miners to provide predictions along with ZK proofs to ensure computational integrity, confirming their predictions were run on a specific model directly on the blockchain,\" according to a press release. \"Omron operates through a complex system of smart contracts, Bittensor validators and mining nodes, which are computers that process the computationally intensive requirements of Inference and zero-knowledge (ZK) proofs. The Bittensor economic model incentivized the creation of Subnet 2, a powerful zero-knowledge machine learning (ZK-ML) compute cluster.\"","May 8: Vega Protocol, a proof-of-stake network with a bridge to Ethereum that previously created a futures market for EigenLayer points, announced that its community-created \"permissionless Pre-Launch Market Cap (MCAP) futures\" will go live Wednesday. \"Pre-launch MCAP futures provide a unique opportunity for traders to hedge their positions and manage exposure to upcoming token releases. Given the growing interest in these releases and the substantial user base of the projects, investors can utilize market cap futures to effectively manage their risk,\" according to a press release. \"Vega's market cap futures utilize the UMA Optimistic Oracle for settlement, ensuring a fully decentralized process that does not rely on a single source of truth.\"","May 8: San Francisco-based Crestal Network, a \"dynamic modular services platform\" powered by ZetaChain and \"proof-of-performance,\" announced that it has secured $2 million in pre-seed funding from from Lingfeng Capital, Cogitent Ventures, Kyro Ventures, Veris Ventures, Smape Capital, MH Ventures, Layer Labs, Pragma Ventures, Builder Capital, NxGen.lens, Artemis Capital and Quotient Ventures as well as other luminaries in the space.","May 8: Telos, a delegated proof-of-stake layer-1 blockchain, has accepted a strategic investment of $1 million from Presto Labs, an Asia-based VC firm and liquidity provider with a track record in algorithmic trading, according to the team: \"The funds will be allocated to the development of the new SNARKtor-powered Ethereum Layer 2 zkEVM network being developed by Telos. The capital will also help incubate the growth of SNARKtor Labs, Telos’s Hong Kong-based business unit focused on the acceleration of its ZK-proving technology infrastructure.\"","May 8: Citi, JPMorgan, Mastercard, Swift and Deloitte are among major companies with an interest in financial services teaming up to explore sharing ledger technology by simulating multiasset transactions in U.S. dollars. The research project, titled Regulated Settlement Network (RSN) proof-of-concept (PoC), will explore the potential of bringing commercial-bank money, wholesale central-bank money and securities such as U.S. Treasuries and investment-grade debt to a common regulated venue, according to a statement shared with CoinDesk. The New York Innovation Center of the Federal Reserve Bank of New York will act as a technical observer.","May 8: Injective is planning a significant expansion – launching its own layer-3 network in the Ethereum ecosystem, based on the layer-2 project Arbitrum's technology. Injective’s \"inEVM,\" which is compatible with the Ethereum Virtual Machine (EVM) operating system and connects the Ethereum, Cosmos and Solana networks, will rely for its infrastructure on Arbitrum's Orbit toolkit, which allows developers to build customizable chains with Arbitrum’s technology while accessing interoperability between multiple ecosystems.","May 8 (PROTOCOL VILLAGE EXCLUSIVE): RAIR Technologies launched RAIRprotocol, described as an \"open-source toolbox for enterprise dapp development.\" According to the team: \"RAIRprotocol enables the creation of scalable dapps and offers out-of-the-box integrations for partnerships with Alchemy and Web3Auth, as well as integrations for Filebase, Google Cloud, Hashicorp, MongoDB Atlas, Coingecko, and many more. For the first time, 88+ documented API endpoints are available for enterprises to deploy via a novel open-source token licensing model – Smart Account, Marketplace, DRM, & NFT infrastructure all in one place.\"","May 8: D8X announced its launch on the crypto exchange OKX's new layer-2 network, X Layer, becoming the blockchain's first perpetual DEX, according to the team: \"In a two-month period on the X Layer testnet, D8X already attracted 15,000 users. In collaboration with X Layer, D8X brings to market the first perpetual futures DEX that allows users to collateralize trades in $OKB. D8X initially launched in February on Polygon zkEVM mainnet. X Layer and D8X are both committed to scaling Ethereum via the Polygon CDK ecosystem.\"","May 8: Polygon Labs, a developer of Ethereum layer-2 networks, announced that its \"Miden Alpha Testnet\" is live. Polygon Miden is a \"modular execution layer that extends Ethereum's capabilities using powerful features such as parallel transaction execution and client-side proving,\" according to the project's documentation. \"Users on Miden can locally generate proofs for their own state transitions without having to disclose the state to the network, and client-side proofs lower the burden on the network,\" according to a tweet. \"On the testnet, experiment with building:","May 8: OKX Ventures, the investment arm of crypto exchange OKX, has led a $1.5 million seed funding round for BlockBooster, an Asia-centered venture studio. The funding round also saw participation from Conflux Network, Neighbor Capital Series, IceRiver Venture and Bitcoin Lab, according to a press release: \"BlockBooster provides extensive, long-term support to select promising project teams on many different aspects, such as product design, go-to-market strategy, business development, talent recruitment, early-stage investment, as well as compliance and risk management. With this strategic investment, OKX Ventures aims to further enhance its access to investment opportunities of early-stage, quality projects and Web3 talent.\"","May 8: Peter Thiel's Founders Fund led a $13.2 million seed funding round into Lagrange Labs, a cryptography startup based on Ethereum's EigenLayer restaking platform. Lagrange specializes in zero-knowledge (ZK) proofs – a way for computers to mathematically verify certain kinds of data. Zero-knowledge proofs, a type of cryptography, have wide applications to blockchains and have become a popular component of layer-2 \"rollup\" chains, which are used to make networks like Ethereum faster and cheaper for end-users.","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","May 7: Silent Protocol introduced \"Ghost Layer,\" described as the \"world's first layer 1.5 for Ethereum,\" according to a blog post. It enables a \"modular secure value transfer layer, creating the first completely compliant, composable and privacy-preserving ecosystem,\" founder Novachrono wrote in the post. According to the team: \"Utilizing ZK-based system and 0VM technology, it enables private asset storage and cross-chain value flow. Silent Protocol also launched EZEE in 2023, addressing state denial challenges. The Ghost Layer signifies Silent Protocol's commitment to building a compliant and composable framework for Ethereum, empowering developers to create privacy-preserving applications.\"","May 7: Ethernity announced that it is \"transforming from an Ethereum-based NFT marketplace into a cutting-edge Ethereum layer-2 solution designed specifically for entertainment brands, utilizing the Optimism stack,\" according to the team. \"Our enhanced platform integrates an AI-powered DRM protocol to ensure robust IP protection, thereby improving both security and scalability. This strategic upgrade is geared towards redefining blockchain entertainment, aiming to attract major franchises from global entertainment brands and establish new industry standards.\" (ETH) (OP)","May 7: Galaxis, a Singapore-based Web3 platform, has raised $10 million from funders including Chainlink, Ethereum Name Services (ENS), Rarestone Capital, Taisu Ventures and ENS co-founder Nick Johnson, it announced Tuesday. Gains made through the company's node sale of more than 11,000 'Galaxis Engines' also contributed to the total funding.","May 7: RD Technologies, founded by Norman Chan, former Chief Executive of the Hong Kong Monetary Authority (HKMA), announced Tuesday that the company is exploring the launch of a Hong Kong dollar stablecoin, HKDR, \"with the mission of facilitating the development of Hong Kong and Asia’s evolving Web 3.0 and virtual assets landscape.\" According to the team: \"RD Technologies has announced that its HKDR is planning to integrate Chainlink CCIP and Chainlink Proof of Reserve to help advance its stablecoin business.\"","May 7: DWallet Labs, core contributors to dWallet Network, provided the following update: \"Developers within the Celo ecosystem can now implement decentralized, non-collusive solutions that control assets and enforce logic across networks thanks to an integration with dWallet. Users of solutions built on the Celo platform will benefit from an elevated level of security and the ability to directly interact with a variety of major cryptocurrencies, such as BTC, ETH and SOL, without leaving the Celo environment. This integration simplifies user interactions across different blockchains, maintaining user autonomy and asset control, irrespective of the network.\"","May 7: Lava Network, a modular network focused on providing access to every blockchain and rollup, is announcing the successful completion of an $11 million pre-mainnet round for the Lava Foundation, led by individual investors and VCs in the Web3 space, including top French blockchain publication Le Journal Du Coin, modular ecosystem media company The Rollup, TPC Ventures, Ash Crypto, CryptoLark, Polygon founder Sandeep Nailwal, Manifold Trading, CryptoTimes Japan, Animoca Brands, Gate Ventures, Gecko Ventures and the founders of eToro. This round follows a $15 million seed round raised by MagmaDevs, previously known as Lava Protocol Inc., in February.\"","May 7: Starknet Foundation, supporting the Ethereum layer-2 network Starknet, announced roughly $5 million in grants available via a \"Seed Grant Program\" with up to 25,000 USDC per award. According to the team: \"The Starknet Seed Grants Program has completed a small pilot project ( 20 teams for a total value of 500,000 USDC) and now earmarked some 5 million USDC for the continuation of the program to support another 200+ teams.\" According to a blog post: \"Seed Grants are intended for projects that have already developed a minimum viable product (MVP) or proof of concept, but haven’t yet gone to market. They are appropriate for projects and teams that meet the following criteria:","May 7: San Francisco-based Hemera, building the Hemera Protocol, described as \"a decentralized programmable indexing network,\" has raised $2.6 million from Web3 investors co-led by LIF Capital and Nomad Capital. The \"zero-day\" funding round included participation from SNZ and Chainlink, along with the founders of ZetaChain, Sending Labs, Wish Co-founder Danny Zhang and Microsoft Senior Vice President and AI expert Harry Shum. \"Funds will be used to fuel aggressive growth and ongoing development,\" according to the release.\" A public beta version of the project launched Tuesday with \"SocialScan, a community-owned AI built on top of the Hemera Protocol that reimagines user experiences through customizable Hemera AI Agents,\" according to a press release. \"Future compatibility with Large Language Models (LLMs) and broader AI models are built into the architecture of Hemera from day one,\" according to the project documentation.","May 7: Magic Eden, a digital collectibles marketplace, announced a \"partnership with APhone, the virtual phone app that turns any smartphone into a Web3 device.\" According to the team: \"The collaboration will enable 22 million monthly Magic Eden users exclusive access to APhone’s affordable DePIN-powered virtual mobile phone app.\"","May 7: ZKM, described as a \"general-purpose zkVM seeking to unite the fragmented Web3 universe\" announced it has completed a $5 million pre-A funding round led by OKX ventures, and is preparing to launch a Bitcoin layer 2 with native asset security and yield. According to the team: \"The ZKM BTC L2 will leverage a PoS decentralized sequencer architecture, giving BTC holders the ability to earn a sustainable BTC yield while securing the layer 2 network. The ZKM BTC L2 network will be the first demonstration of ZKM’s groundbreaking Entangled Rollups network, which aims to connect and unify the liquidity of all blockchains.","May 7 (PROTOCOL VILLAGE EXCLUSIVE): Anomaly, an AI gaming studio and layer-3 blockchain, announced the launch of \"the first AI-powered, zero-gas gaming platform testnet on Arbitrum.\" According to the team: \"Anomaly is a Web3 and SocialFi layer 3 blockchain aiming to redefine the gaming industry by empowering developers to focus on building immersive gaming experiences on the blockchain while the platform brings the community to their games. Anomaly’s layer 3 will function as a decentralized game layer with a native AI tech stack, promoting interoperability and platform experience.”","May 7: Morph, an optimistic zkEVM Ethereum layer 2 with a decentralized sequencer, has announced the launch of its Holesky Testnet. According to the team: \"Built on Ethereum Holesky, the Morph Holesky Testnet aims to improve performance and infrastructure, establishing a new benchmark in performance and a seamless transition into Morph’s mainnet infrastructure. Key features include an EIP-4844 Optimistic zkEVM integration to lower transaction costs, a revamped bridge mechanism to finalize withdrawals in a single transaction and increased network reliability and security supported by a decentralized sequencer network.\"","May 7: Bitcoin development startup Botanix Labs said it raised $8.5 million toward building of layer-2 network Spiderchain, taking its total backing to $11.5 million after a $3 million pre-seed round last year. The most recent round included Polychain Capital, Placeholder Capital, Valor Equity Partners and ABCDE, Botanix announced on Tuesday. The New York-based company built Spiderchain to be compatible with Ethereum Virtual Machine (EVM) layers.","May 6: Axelar, a blockchain interoperability project, said that Stacks, Moonriver, Hedera and Iron Fish have joined a devnet-phase pilot of \"Interchain Amplifier, the first service of its kind to enable permissionless connectivity across major blockchain networks including Bitcoin, Ethereum, EVM chains, IBC, Hedera and 64 more chains.\" According to a press release: \"Interchain Amplifier is a smart-contract-based developer toolkit developed by Interop Labs for the Axelar network. It makes new-chain integrations permissionless and easy. Once integrated with Axelar mainnet, Amplifier will automate routing and translation across Axelar’s growing, open network of interconnected blockchains. Designed to run via on-chain smart contracts, Amplifier will leverage the security guarantees of the Axelar network to quickly bootstrap new cross-chain paths, expanding use cases, liquidity and user base.\" (AXL)","May 6: MetaMask, the most popular crypto wallet for Ethereum, is rolling out a new feature this week designed to help users avoid the consequences of maximal extractable value, or MEV. The optional new feature, called Smart Transactions, will allow users to submit transactions to a \"virtual mempool\" before they are officially cemented on-chain. According to Consensys, the company behind MetaMask, the virtual mempool will protect against certain kinds of MEV strategies, and it will run behind-the-scenes simulations of transactions to help users get lower fees.","May 5: Volta, creator of Volta Circuit, a multi-signature non-custodial platform for institutional investors to secure digital assets, secured $4.1 million in seed funding from Fika Ventures and Haven Ventures, alongside support from Soma Capital, Dispersion Capital and Uphonest Capital. \"Volta Circuit embraces open signature standards, rendering the platform wallet-agnostic. This feature allows any wallet to integrate rules and permission controls, offering users the flexibility to tailor their wallet solutions according to their preferences,\" according to a press release. Volta was co-founded by George Melika, previously co-founded sFOX, and Daniel Kim, who led the growth of Maple Finance.","May 5: Jesse Pollak, who oversees the crypto exchange Coinbase's layer-2 network, Base, unveiled a new incentives campaign, \"Onchain Summer II,\" with more than 600 ETH ($2 million) of prices, grants and gas credits offered by the project and its ecosystem partners. \"Onchain Summer will kick off with a month-long online hackathon hosted by Base and partners,\" according to the post. \"Base is collaborating with teams across the ecosystem, including Coinbase, to enable tools for Onchain Summer builders,\" including easier wallet onboarding with Coinbase's new smart wallet recently launched on Base Sepolia testnet and \"seamless user experiences\" with account abstraction.","May 5: Aave Labs, the main developer behind Aave, a DeFi protocol, proposed to develop its \"V4\" as part of a wider grant proposal, involving community feedback and testing, with a timeline starting this quarter and leading to a full release by mid-2024. \"Aave V4 would be built with a completely new architecture with an efficient and modular design, while minimizing the impact on third-party integrators,\" the proposal reads. A key change would be the introduction of a \"unified liquidity layer\" and a new oracle design with Chainlink. (AAVE) (LINK)","May 5: MicroStrategy (MSTR), the largest corporate holder of bitcoin, unveiled plans to develop a decentralized identity service using Ordinals inscriptions. The goal of \"MicroStrategy Orange\" is to provide \"trustless, tamper-proof and long-lived\" decentralized identities using the Bitcoin blockchain, founder Michael Saylor said at the company's Bitcoin For Corporations conference on Wednesday. Orange harnesses Bitcoin's Ordinals Protocol. MicroStrategy has already built one application using its service called \"Orange For Outlook,\" which integrates digital signatures into emails to enable recipients to verify the identity of the sender. An unofficial draft describing the project was posted on MicroStrategy's GitHub page.","May 2: Polyhedra Network launched an open-source ZK proof system, Expander, \"that can generate proofs nearly 2x faster than alternatives while enhancing security and efficiency of ZK proof process,\" according to the team: \"Expander represents a new era in scaling ZK-proof tech and combines classical interactive proofs, establishes truth of a process and that it can be executed, with advanced polynomial commitment schemes that ensure proof is accurate and can't be changed once created. It follows Polyhedra’s recent partnership with Google Cloud where they are collaborating on Polyhedra’s ZK tech to all Google Cloud services via Proof Cloud.\" According to a blog post, \"Expander can prove 4,500 Keccak-f permutations per second on an Apple M3 Max Machine.\" Keccak-256 is a \"cryptographic hash function standardized by NIST in the secure hash algorithm 3 (SHA-3) and is the hash function used by the Ethereum blockchain,\" according to the post. The new proof system builds on Polyhedra's Libra paper, lead-authored by Polyhedra co-founder and CTO Tiancheng Xie.","May 2: Eclipse, an Ethereum layer-2 network powered by Solana Virtual Machine (SVM), said it is the \"first to break the EVM-SVM compatibility barrier\" with the deployment of Neon Stack, developed by the core Neon EVM team, according to a press release. Neon Stack is \"a standardized development stack that makes it easy for SVM-based blockchain networks to gain EVM compatibility for smart contract developers, which Eclipse will utilize on its SVM L2.\"","May 2: BOB (Build on Bitcoin), a hybrid layer-2 solution merging Bitcoin and Ethereum capabilities, has launched its mainnet, according to the team: \"Supported by leading crypto investors such as UTXO and CMS Holdings, BOB is advancing Bitcoin's relevance in the DeFi space by making Bitcoin assets like Ordinals, Runes and BRC20s accessible to ETH and other Web3 users. With the UX for Bitcoin DeFi still very limited, BOB aims to be the best place to start experimenting with Bitcoin L2. Notable projects deploying on BOB include Sovryn, Velodrome and Layerbank.\"","May 2: The Graph Foundation, stewarding core devs of The Graph Network, announced its Sunrise Upgrade Program, beginning May 2. The community-driven program will aid in The Graph’s pursuit to democratize data via a variety of “missions” that reward participants completing on chain and off chain activities. The Graph Foundation has committed up to 4M GRT (approx. $1.2M USD as of April 29), to recognize and reward participants for their contributions by completing missions in the program. (GRT)","May 2: Nibiru Chain, a secure smart contract platform that simultaneously addresses decentralization, security and scalability, announced its expansion into the Asia region, appointing Yura Nam, an ex-head of StarkNet Asia, to lead Asia growth, and Nicholas Lo, a former APAC Growth Manager at Bored Ape Yacht Club developer Yuga Labs, to oversee Asia business development.","May 2: Resonance, a provider of blockchain and smart-contract audits, announced a pre-seed fundraising of $1.5 million from Arca, Fabric and Blockchain Founders Fund, according to the team: \"The company’s initial raise will fuel a rapid expansion that has proceeded at an exponential rate since launching in March 2023.\" Resonance launched V1 in March after \"a highly successful beta phase that resulted in engagements with major Web2 and Web3 projects,\" according to the project.","May 2: Lukso, an EVM-compatible blockchain designed for the new creative economy, announces the launch of a new grant program designed to cultivate a vibrant ecosystem of user-centric, social and creative projects built on Lukso. The first application wave of the Lukso Grants Program is backed by $1 million, which will be followed by subsequent quarterly application waves.","May 2: Untangled Finance, a tokenized real-world asset (RWA) platform backed by Fasanara Capital, opened its first private credit pool on the Celo (CELO) network on Thursday with French fintech lender Karmen. The pool, structured under Luxembourg's securitization regulations with a debt ceiling of $6 million at the start, lets accredited investors deposit the USDC stablecoin and will provide capital to Karmen, which specializes in providing instantaneous loans and working capital to small and medium-sized digital enterprises in France, according to a press release. Institutional asset manager Fasanara Capital and The Credit Collective, a Celo community-led ecosystem development organization, were early investors in the facility.","Edited by Bradley Keoun.","\n"],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"Karmen","content":"LOCATION"},{"type":"RSN","content":"ORGANIZATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"$11 million","content":"MONEY"},{"type":"Moonriver","content":"PERSON"},{"type":"Keccak","content":"PERSON"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$8.5 million","content":"MONEY"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"Bitcoin DeFi","content":"ORGANIZATION"},{"type":"Untangled Finance","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$13.2 million","content":"MONEY"},{"type":"Ethereum Holesky","content":"PERSON"},{"type":"Danny Zhang","content":"PERSON"},{"type":"Yura Nam","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"4844","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Artemis Capital","content":"ORGANIZATION"},{"type":"CTO Tiancheng Xie","content":"ORGANIZATION"},{"type":"RAIR Technologies","content":"ORGANIZATION"},{"type":"Volta Circuit","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Valor Equity Partners","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Apple M3 Max Machine","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Manifold Trading","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Smape Capital","content":"ORGANIZATION"},{"type":"Uphonest Capital","content":"ORGANIZATION"},{"type":"Inference Labs","content":"ORGANIZATION"},{"type":"BitScale Capital","content":"ORGANIZATION"},{"type":"Norman Chan","content":"PERSON"},{"type":"Bitcoin For Corporations","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Dispersion Capital","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Coingecko","content":"LOCATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Karmen","content":"PERSON"},{"type":"New York Innovation Center of the Federal Reserve Bank of New York","content":"ORGANIZATION"},{"type":"Sovryn","content":"LOCATION"},{"type":"Morph Holesky Testnet","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Gate Ventures","content":"ORGANIZATION"},{"type":"UMA Optimistic Oracle","content":"ORGANIZATION"},{"type":"Botanix Labs","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Delphi Ventures and Mechanism Capital","content":"ORGANIZATION"},{"type":"Taisu Ventures","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"SNZ","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Builder Capital","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Haven Ventures","content":"ORGANIZATION"},{"type":"Bitcoin Lab","content":"ORGANIZATION"},{"type":"Polyhedra","content":"ORGANIZATION"},{"type":"Harry Shum","content":"PERSON"},{"type":"Citi","content":"ORGANIZATION"},{"type":"Lava Network","content":"ORGANIZATION"},{"type":"Onchain Summer","content":"ORGANIZATION"},{"type":"M USD","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"MicroStrategy Orange\"","content":"ORGANIZATION"},{"type":"RD Technologies","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Fasanara Capital","content":"ORGANIZATION"},{"type":"George Melika","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"TPC Ventures","content":"ORGANIZATION"},{"type":"NIST","content":"ORGANIZATION"},{"type":"Soma Capital","content":"ORGANIZATION"},{"type":"ZKM BTC","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"IceRiver Venture","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Lava Protocol Inc.","content":"ORGANIZATION"},{"type":"Bitcoin's Ordinals Protocol","content":"ORGANIZATION"},{"type":"Lagrange Labs","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Layerbank","content":"ORGANIZATION"},{"type":"Actively Validated Services (AVS","content":"ORGANIZATION"},{"type":"Gecko Ventures","content":"ORGANIZATION"},{"type":"Crestal Network","content":"ORGANIZATION"},{"type":"Pragma Ventures","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$11.5 million","content":"MONEY"},{"type":"Daniel Kim","content":"PERSON"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"LIF Capital","content":"ORGANIZATION"},{"type":"BOB","content":"ORGANIZATION"},{"type":"$OKB","content":"MONEY"},{"type":"StarkNet Asia","content":"ORGANIZATION"},{"type":"$2.3 million","content":"MONEY"},{"type":"Fika Ventures","content":"ORGANIZATION"},{"type":"Ethereum Name Services","content":"ORGANIZATION"},{"type":"Volta","content":"LOCATION"},{"type":"Omron","content":"ORGANIZATION"},{"type":"Nick Johnson","content":"PERSON"},{"type":"Ash Crypto","content":"LOCATION"},{"type":"May 2","content":"DATE"},{"type":"Nomad Capital","content":"ORGANIZATION"},{"type":"Veris Ventures","content":"ORGANIZATION"},{"type":"The Graph Foundation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"APAC Growth Manager","content":"ORGANIZATION"},{"type":"RPC","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Rarestone Capital","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Digital Asset Capital Management","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Novachrono","content":"PERSON"},{"type":"May 8","content":"DATE"},{"type":"Lava Foundation","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"Polyhedra Network","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Edessa Capital","content":"ORGANIZATION"},{"type":"Neon Stack","content":"ORGANIZATION"},{"type":"$1.2","content":"MONEY"},{"type":"Cogitent Ventures","content":"ORGANIZATION"},{"type":"Omni Foundation","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"The Graph Network","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"Graph Foundation","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$4.1 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Arbitrum","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Solana Virtual Machine (SVM","content":"ORGANIZATION"},{"type":"Nicholas Lo","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"$2.6 million","content":"MONEY"},{"type":"Telos","content":"ORGANIZATION"},{"type":"MH Ventures","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Metropolis DAO","content":"ORGANIZATION"},{"type":"Hedera","content":"PERSON"},{"type":"MongoDB Atlas","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Chainlink Proof of Reserve","content":"ORGANIZATION"},{"type":"Kyro Ventures","content":"ORGANIZATION"},{"type":"AXL","content":"ORGANIZATION"},{"type":"Hashicorp","content":"LOCATION"},{"type":"Nibiru Chain","content":"ORGANIZATION"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}