{"summary":"The payments firm stopped taking crypto payments in 2018 due to bitcoin’s high volatility.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/25\/stripe-brings-back-crypto-payments-via-usdc-stablecoin\/","publishDate":"2024-04-25T18:55:12","id":16599,"type":null,"title":"Stripe Brings Back Crypto Payments Via USDC Stablecoin","category":["Finance"],"content":["Six years after dropping support for bitcoin (BTC) and, thus, crypto payments altogether, Stripe is bringing back the service later this summer, though initially only for Circle’s USDC stablecoin.","“We’re excited to announce that we’re bringing back crypto as a way to accept payments, but this time with a much better experience,” Stripe co-founder and President John Collison said Thursday in a keynote address at the company’s Global Internet Economy conference.","The payments processor has a long history in crypto, first tapping the bitcoin ecosystem in 2014. Four years later, in 2018, it discontinued all of those efforts, arguing that bitcoin was too volatile and would function as an asset rather than a medium of exchange. It had also criticized its lengthy transaction times and growing fees at the time.","That year saw bitcoin’s first “crypto winter” with the token dropping from a high of $19,650 in December 2017 to $3,401 at the end of 2018.","The fintech giant took a step toward re-entering the market the following year by becoming a co-founder of Facebook’s Libra project, but it stepped away later that year and Libra never got off the ground. In 2022, Stripe introduced a project to facilitate fiat-to-crypto payments.","“Crypto is finding real utility,” Collison said in his keynote Thursday. “With transaction speeds increasing and costs coming down, we’re seeing crypto finally making sense as a means of exchange.”","Payments will be available on the Solana (SOL), Ethereum (ETH) and Polygon (MATIC) blockchains, Stripe said.","The company is currently valued at $65 billion, according to Bloomberg, and is one of the biggest payments providers in the world with over $1 trillion in transactions in 2023.","Edited by Nick Baker."],"entity":[{"type":"2014","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"$19,650","content":"MONEY"},{"type":"$65 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Stripe","content":"PERSON"},{"type":"$3,401","content":"MONEY"},{"type":"Collison","content":"PERSON"},{"type":"John Collison","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"$1 trillion","content":"MONEY"},{"type":"summer","content":"DATE"}],"hashtag":["Stripe","payments","Circle","USDC","Stablecoins"],"authors":["Helene Braun"]}