{"summary":"The former chancellor has clinched 100 backers to be the next leader of the Conservative Party and the UK’s next prime minister\nOther potential candidates for leadership include ousted prime minister Boris Johnson and Penny Mordaunt.","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179125\/crypto-curious-sunak-takes-early-lead-in-uk-leadership-race","publishDate":"2022-10-22T05:10:12","id":166,"type":null,"title":"Crypto-curious Sunak takes early lead in UK leadership race","category":["Policy"],"content":["Former chancellor Rishi Sunak has taken an early lead in the race to become the UK Conservative Party leader and the country's next prime minister.&nbsp;","The contest, which comes amid a prolonged period of political uncertainty in the country, could end as soon as Monday. Sunak has already secured the backing of at least 100 Tory MPs, meaning he will be considered in the ballot of party members next week if he declares that he is running.&nbsp;","Outgoing Prime Minister Liz Truss was confirmed as the country's leader <a href=\"https:\/\/www.theblock.co\/post\/167785\/sunaks-crypto-charm-offensive-brought-to-an-end-as-truss-named-uk-prime-minister\" data-v-f87c67ca=\"\">on Sept. 5.<\/a> She resigned this week following a backlash to Chancellor Kwasi Kwarteng's economic plan, which included tax cuts for top earners.&nbsp;","Sunak also ran in the last leadership election, but had lost out in the last round with 43% of the vote to Truss's 57%.&nbsp;","This time, other candidates in contention are ousted prime minister Boris Johnson and the leader of the House of Commons, Penny Mordaunt. Only three members of parliament will be able to get to the next round, as there are a total of 357 Conservative MPs.","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","Sunak proved himself as overtly crypto curious when he served as chancellor for the Exchequer between February 2020 and July 2022. In April this year, he <a href=\"https:\/\/www.theblock.co\/post\/140451\/uk-treasury-outlines-plan-to-regulate-stablecoins-and-issue-an-nft\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">set out plans<\/a> to make the UK a crypto-friendly tech hub, and said the Royal Mint would launch an NFT this summer. He also made moves for stablecoins to be brought within regulation, paving their way for use in the UK as a recognized form of payment.","The move came amid a protracted period of confusion around crypto regulation in the UK, as firms waited for verdicts from the financial regulator on anti-money laundering licensing. The process, conducted through the Financial Conduct Authority (FCA), forced many companies to consider their place in the UK market, including <a href=\"https:\/\/www.theblockcrypto.com\/post\/137484\/crypto-firms-uk-close-fca-register\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">crypto market maker B2C2,<\/a>&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/139679\/blockchain-com-becomes-latest-firm-to-retreat-from-uk-regulation-application\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Blockchain.com<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/139499\/wires-withdraws-fca-crypto-register\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">wallet firm Wirex,<\/a>&nbsp;which have all chosen to seek licenses elsewhere.&nbsp;","These policies followed meetings with top crypto executives and venture capital firms.&nbsp;","The Treasury minister's meetings log, <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1090828\/Meetings_Ministerial_Transparency_Jan-March_2022.csv\/preview\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">published on the UK government website,<\/a>&nbsp;shows Sunak met with Sequoia managing partner Douglas Leone to \"discuss the UK’s Venture Capital sector\"&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/158006\/uk-treasury-disclosures-for-first-quarter-reveal-meetings-with-top-crypto-execs\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">earlier this year<\/a>.&nbsp;<a href=\"https:\/\/twitter.com\/LHM1\/status\/1511248260693905412\/photo\/1\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Previous disclosures<\/a>&nbsp;also showed that at the end of last year, Sunak visited California and met with representatives from Sequoia and Andreessen Horowitz, as well as attending a roundtable with companies including Bitwise, Celo, Solana and Iqoniq.&nbsp;","While Boris Johnson oversaw Sunak's period as chancellor in office, he has not offered a clear opinion on the future of blockchain or crypto regulation in the country. It is thought unlikely by many in the party that he will win this contest after he was forced to resign during his last term.&nbsp;","\"Whether you’re an arch-Boris fan or an arch-Boris critic, I don’t see how you can reconcile making a return to frontline politics,\" former top Tory Dominic Raab told BBC Radio 4’s Today programme this morning.&nbsp;","Penny Mordaunt's stance on digital assets is also relatively unknown. In April, she <a href=\"https:\/\/twitter.com\/pennymordaunt\/status\/1514771530038669315?lang=en\" data-v-f87c67ca=\"\">met with<\/a> the president of the Texas Blockchain Association to discuss UK partnership opportunities.&nbsp;"],"hashtag":[]}