{"summary":"A new 22-page report from CoinDesk Research explains the technology behind Ethereum’s upcoming overhaul and the potential market impact of Eth 2.0.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/2020\/07\/24\/everything-you-need-to-know-about-ethereum-20\/","publishDate":"2020-07-24T17:05:50","id":16607,"type":null,"title":"Everything You Need to Know About Ethereum 2.0","category":["Learn"],"content":["Ethereum 2.0 is coming.","The years-long upgrade – intended to radically transform the world’s largest smart-contract platform – is inching closer to deployment. The Ethereum Foundation recently announced “Medalla,” a final testnet before the mainnet launch of the Eth 2.0 beacon chain.","As of July 10, some developers, including Ethereum founder Vitalik Buterin, estimate the oft-delayed Eth 2.0 will launch by the end of this year.","When phase zero of Eth 2.0 does ship, little about Ethereum will change in the near term for users and dapp developers. This is because unlike all other system-wide upgrades in Ethereum history, the Eth 2.0 overhaul will primarily be happening on a different blockchain.","The first phase of development for Eth 2.0 is centered around the creation of a separate proof-of-stake blockchain network called the beacon chain. On this new network, ETH holders with a minimum of 32 ETH can earn rewards in the form of annualized interest on their wealth. To earn these rewards, ETH holders must have the appropriate hardware and software connecting to the beacon chain and a strong understanding of how the technology works.","In a new 22-page report from CoinDesk Research, the technology behind Eth 2.0 is explained as well as the phases of development it will undergo in the years after its launch.","Ethereum as we know it today will eventually be folded into the Eth 2.0 upgrade in its entirety. The report features commentary from Ethereum developers about what benefits – but also risks – this may bring.","The report also discusses the potential market impact of Eth 2.0, including the ramifications of the new system’s economic design on coin supply, velocity and value.","The culmination of over five years of research and development, Ethereum 2.0 is a highly ambitious upgrade.","Never before has the cryptocurrency industry seen a blockchain of the same size and value as Ethereum attempt to transition all users, as well as assets, to an entirely new decentralized network while keeping all operations on the old network active and running.","Read more: Ethereum Turns Five Next Week: How CoinDesk Is Marking the Milestone","It will likely take many years for the Ethereum 2.0 upgrade – in all its complexity – to be complete. However, developer commentary featured in this report suggests the biggest hurdle (and perhaps most important milestone) in the Ethereum 2.0 roadmap is its initial launch."],"entity":[{"type":"July 10","content":"DATE"},{"type":"oft","content":"ORGANIZATION"},{"type":"CoinDesk Research","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":["Ethereum","Intermediate","Learn"],"authors":["Christine Kim"]}