{"summary":"Ray said Bankman-Fried’s victims “will never be returned to the same economic position they would have been in today absent his colossal fraud.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/20\/ftx-was-down-to-last-105-bitcoins-when-bankruptcy-rescue-crew-arrived-john-ray\/","publishDate":"2024-03-20T23:13:16","id":16609,"type":null,"title":"FTX Was Down to Last 105 Bitcoins When Bankruptcy Rescue Crew Arrived: John Ray","category":["Policy"],"content":["Current FTX CEO John J. Ray III is pushing back against his disgraced predecessor Sam Bankman-Fried’s claims that customers lost “zero” money in the exchange’s 2022 collapse, calling them “categorically, callously, and demonstrably false.”","In a victim impact statement penned by Ray on behalf of FTX and its subsidiaries, Ray told New York District Court Judge Lewis Kaplan that Bankman-Fried’s “delusional” claims that his exchange was solvent are a “mischaracterization” of the estate’s January statement that they expect to pay customers back in full.","Bankman-Fried and his legal team have leaned heavily on the estate’s recovery, arguing in his February sentencing submission that the “harm to customers, lenders, and investors is zero” and, as such, Judge Kaplan should consider a maximum sentence of 6.5 years in prison – far less than the 40-50 year sentence recommended by prosecutors or the 100 year sentence suggested by the probation department.","But just because the FTX estate was able to scrape together enough money to pay back the exchange’s customers – massively aided by the run-up in bitcoin’s price as well as the “tens of thousands of hours…spent digging through the rubble of Mr. Bankman-Fried’s sprawling criminal enterprise to unearth every possible dollar, token, or other asset” – does not mean that Bankman-Fried’s behavior was not criminal, Ray argued.","Ray told the court that, when he took over, the exchange’s coffers were nearly empty – a mere 105 bitcoins remained on the platform, compared with the nearly 100,000 bitcoins customers were entitled to.","Some of the lost assets were recovered, Ray said, while others, including bribes to Chinese officials and the “hundreds of millions of dollars” Bankman-Fried spent on various investments or buying access to celebrities and politicians are gone for good.","“The harm was vast. The remorse is nonexistent,” Ray wrote in the Wednesday court filing. “Effective altruism, at least as lived by Sam Bankman-Fried, was a lie.”","Ray told the court that, despite the current plan to get their money back, many of FTX’s customers remain “extremely unhappy” with the valuation of their funds.","Because customers will be refunded based on the value of their portfolios at the time of the bankruptcy – not today’s much higher value – they will “never be returned to the same economic position they would have been in today absent [Bankman-Fried’s] colossal fraud,” Ray argued.","In their own victim impact statements filed earlier this week, dozens of FTX customers detailed the emotional and financial toll the exchange’s collapse had on their personal lives.","“There should be no delusion that because assets have increased in value or that the professionals have been able to recover funds and assets taken or stolen from the estate, that there was no need [to file for bankruptcy],” Ray wrote. “Make no mistake; customers, non-governmental creditors, governmental creditors, and non-insider stockholders have suffered and continue to suffer.”","Bankman-Fried is scheduled to be sentenced on March 28.","Edited by Danny Nelson."],"entity":[{"type":"2022","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"March 28","content":"DATE"},{"type":"Ray","content":"PERSON"},{"type":"New York District Court","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"“hundreds of millions of dollars","content":"MONEY"},{"type":"50","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Danny Nelson","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"John J. Ray III","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Ftx group","Sam Bankman-Fried","John Ray III","Bankruptcy"],"authors":["Cheyenne Ligon"]}