{"summary":"TRM Labs' analysis was published in a report Monday that reviewed 2023 global crypto policy in 21 jurisdictions which represent 70% of global crypto exposure.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/08\/lesser-illicit-activity-among-crypto-service-providers-in-nations-with-full-licensing-regimes-in-2023-trm-labs\/","publishDate":"2024-01-08T13:00:00","id":16611,"type":null,"title":"Report Finds Less Illicit Crypto Activity in Nations With Full Licensing Regimes in 2023: TRM Labs","category":["Policy"],"content":["Blockchain analytics firm TRM Labs has found that crypto service providers in countries with full regulatory regimes had lower rates of illicit activity than those in less regulated jurisdictions in 2023.","TRM Labs' analysis was published in a report Monday that reviewed 2023 global crypto policy in 21 jurisdictions which represent 70% of global crypto exposure. As many as 80% of the 21 jurisdictions have moved to tighten crypto oversight and almost half have specifically progressed consumer protection measures, the report shared with CoinDesk found.","\"While differences in national philosophies and priorities persist, we observed a convergence toward certain standards,\" the report said. \"This increasing regulatory maturity and greater focus on compliance by the private sector have already impacted illicit finance activities.\"","The report predicts that in 2024 questions will remain in the DeFi space – for example, \"where responsibility and accountability lie, and how regulators can practically exercise oversight and authority.\"","While these questions are unlikely to be answered in 2024, data from standards adopted this year will provide insights to better understand the impact of the rules for 2025, the report said.","TRM Labs also predicted that 2024 will see the U.S. move on mixers and refresh national risk assessments on money laundering and terrorist financing.","Read More: ISIS Allies Used Crypto to Raise Millions: TRM Labs","Edited by Oliver Knight."],"entity":[{"type":"2025","content":"DATE"},{"type":"ISIS Allies Used Crypto","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Oliver Knight","content":"PERSON"}],"hashtag":["Regulations","TRM Labs","Crypto","Blockchain Analysis","illicit finance"],"authors":["Amitoj Singh"]}