{"summary":"Recent uncertainty swirling around FTX exchange's in-house token, FTT, has many wondering how these tokens work and what gives them value. We explain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-an-exchange-token\/","publishDate":"2022-11-08T17:19:12","id":16614,"type":null,"title":"What Is an Exchange Token?","category":["Learn"],"content":["The cryptocurrency exchange industry is a pretty tight market. Fees can only fall so far before trading becomes free, and each exchange promises missile-proof security (though those promises have been broken) and 24\/7 trading.","Crypto exchanges realized they had to differentiate themselves from the competition, so they drew on what they knew best – cryptocurrencies – and started to issue some of their own. These are known as exchange tokens.","Exchange tokens, minted by exchanges like Binance and FTX, entitle holders to benefits on cryptocurrency exchanges. Such benefits often include trading fee discounts, rebates and early access to token sales held on the platform (known as Initial Exchange Offerings, or IEOs).","The deal is sweeter yet for the exchanges. By minting these tokens, then keeping a bunch for themselves, they can generate a huge amount of wealth. That wealth is created, it should be noted, not by selling off equity or issuing debt – it is created by introducing the value of the token to the users of the exchange and making a handful of keynote speeches and announcements to build excitement for the mint. Exchange tokens also enhance the liquidity of an exchange, providing the platform additional dry powder to call on when markets get tight.","Exchange tokens function just like any other cryptocurrency token. You can trade them on secondary markets or hold them for speculative purposes. Examples of exchange tokens include FTX’s FTT token, Binance’s BNB, Huobi’s HT and WazirX’s WRX.","These exchange tokens are minted by the cryptocurrency exchange itself. The term is usually reserved for tokens issued by a centralized cryptocurrency exchange – a company with an executive team and structure similar to a traditional finance company, that maintains an order book of buyers and sellers.","Exchange tokens generally refer to volatile cryptocurrencies issued by the exchanges; stablecoin tokens issued by exchanges, like BUSD, HUSD, and Coinbase (and Circle’s) USDC are not generally called exchange tokens, and are simply referred to as stablecoins.","Decentralized exchanges, like Uniswap and SushiSwap, also have their own tokens, although these are usually separated into their own categories, like “DeFi tokens” or “DEX tokens.” These tokens are used in governance; stakers pledge them within various decentralized finance protocols to alter the parameters that define the platforms.","You can usually buy exchange tokens directly from the cryptocurrency exchange – which will often pay you in the token as a reward for completing tasks or trading certain coins. Some exchanges, like WazirX, airdrop, or give away, tokens to holders to kickstart the market.","Exchange tokens do not equate to stock in the company, and do not usually confer governance rights over the exchange. However, exchange token markets often work quite a bit like equity markets; their price is a function of the belief that the exchange will become successful, making its exchange token valuable to hold; the more activity there is on the exchange, the thinking goes, the more demand there will be for the exchange token.","For traders, the main benefit is a reduction in trading fees. Holders of WRX are entitled to discounts of up to 50% when they pay fees in WRX, and FTX offers those that hold more than $100 worth of FTT a 3% discount when trading on the exchange.","Generally, the more a user holds, the more discounts they’re entitled to. For instance, Crypto.com ties its exchange token, Cronos (CRO), to a Visa debit card. The rewards increase along with the CRO stake: stake more than 5 million CRO, which is $574,000 as of this writing, and you’ll get 8% interest paid in CRO, plus 5% back on (fiat) money spent using the card, among other benefits.","Exchange tokens each have different issuance schedules and tokenomics. However, commonly, the team running the exchange reserves a huge amount, then holds the bulk in reserves, doling it out to contributors and the trading community over time to incentivize growth on the platform.","This means that the exchanges remain in control. CoinDesk reported on documents obtained in November 2022 which revealed how FTX’s sister company, Alameda, held billions of dollars of FTT on its balance sheet. Alameda’s single biggest asset at the time of the CoinDesk report was $3.66 billion of “unlocked FTT.”","Lots of exchange tokens are deflationary. FTX buys FTT, then burns tokens that equate to a third of the revenue FTX generates each week (less a few caveats, such as payment processor fees). FTX is not alone in this practice; Binance has long regularly burned its exchange token, BNB, which is issued on its native BNB Chain.","Read Latest News on FTX"],"entity":[{"type":"8%","content":"PERCENT"},{"type":"billions of dollars","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$574,000","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"WRX","content":"ORGANIZATION"},{"type":"$3.66 billion","content":"MONEY"},{"type":"CRO","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Learn","Beginner","Cryptocurrency","Tokens"],"authors":["Robert Stevens"]}