{"summary":"The crypto exchange is launching a recovery token because of debt owed by a high-net-worth customer.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/28\/coinflex-says-roger-ver-owes-it-47m-usdc-as-spat-turns-public\/","publishDate":"2022-06-28T18:39:25","id":16612,"type":null,"title":"CoinFLEX Says Roger Ver Owes It $47M USDC as Spat Turns Public","category":["Finance"],"content":["CoinFLEX CEO Mark Lamb claims noted crypto investor Roger Ver owes the physical futures crypto exchange $47 million in USDC. Lamb made his allegation public Tuesday on Twitter, shortly after Ver denied \"some rumors\" he was involved with the default.","Lamb's Twitter comments came after his company announced late Monday it will launch a Recovery Value USD (rvUSD) token after recently halting withdrawals stemming from an outstanding debt that a high-net-worth customer – presumably Ver – owes the exchange.","Lamb claimed that Ver owes CoinFLEX $47 million USDC, and that the company has a “written contract with him obligating him to personally guarantee any negative equity on his CoinFLEX account and top up margin regularly. He has been in default of this agreement and we have served a notice of default.”","Lamb stressed that “the debt is 100% related to his account,” and that CoinFLEX is seeking to resolve the matter.","Prior to Lamb’s comments, Ver tweeted:","“Recently some rumors have been spreading that I have defaulted on a debt to a counter-party. These rumors are false. Not only do I not have a debt to this counter-party, but this counter-party owes me a substantial sum of money, and I am currently seeking the return of my funds.”","Ver was a very early investor in Bitcoin and Bitcoin startups, and is now one of the biggest supporters of Bitcoin Cash.","Read more: Roger Ver: Bitcoin Cash Hard Forks Could Have Thwarted PayPal Support"],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Bitcoin Cash Hard Forks Could Have Thwarted PayPal","content":"ORGANIZATION"},{"type":"Mark Lamb","content":"ORGANIZATION"},{"type":"Ver","content":"ORGANIZATION"},{"type":"Roger Ver","content":"PERSON"},{"type":"$47 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Speculation","Debt","Exchange Tokens","Roger Ver"],"authors":["Michael Bellusci"]}