{"summary":"Robinhood apparently made strenuous efforts to comply with the agency, even applying to become a special purpose crypto broker-dealer. The SEC is likely to sue for alleged securities violations in any case.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/06\/the-sec-cant-stop-suing-crypto-companies\/","publishDate":"2024-05-06T19:27:32","id":16616,"type":null,"title":"The SEC Can’t Stop Suing Crypto Companies","category":["Consensus Magazine"],"content":["Robinhood is the latest firm to draw the ire of the U.S. Securities and Exchange Commission (SEC). This weekend, it reported receiving a Wells notice – an announcement that the securities watchdog is building a case and intends to sue. In an 8-K filing, the fintech firm revealed it received the letter from the SEC’s enforcement division for alleged securities violations.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","At this point, it’s hard to be surprised by the SEC’s anti-crypto actions – shameless though they may be. Apparently, the agency sent the notice after Robinhood cooperated with the SEC’s investigative subpoenas about its crypto operations. A Wells notice is essentially the last chance the accused has to convince regulators that it didn’t break the law, which would be a sign of good faith except that the vast majority of these letters end up in a lawsuit.","As Robinhood legal, compliance, and corporate lead Dan Gallagher noted in a statement, the firm has been in direct communication with the SEC over its crypto offerings for years, which is exactly what you’d expect from a firm that really only dabbles in crypto. It’s not clear from the letter which tokens are considered securities by the SEC, though it’s worth noting the brokerage proactively delisted a number of tokens — including Solana (SOL), Polygon (MATIC) and Cardano (ADA) — in response to previous SEC lawsuits against rival trading firms.","“We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law,” Gallagher said. He noted in particular the firm’s “years of good faith attempts to work with the SEC for regulatory clarity” and, like other crypto firms in legal limbo, “well-known attempt to ‘come in and register.’”","Further, in heeding “the SEC’s calls,” Robinhood attempted to register as a special purpose broker-dealer with the agency. While there are many licensed crypto firms, so far Prometheum Ember Capital, a trading company that doesn’t yet offer any assets to trade, is essentially alone in receiving a special purpose broker-dealer license, which were introduced in 2020 to allow firms to custody and transact in “crypto asset securities.”","While just speculation, I have a sense the SEC started to build a case right around the time Gallagher, himself a former SEC commissioner and securities law expert, testified before Congress that the SPBD process is irrevocably broken and a profound waste of resources. To wit:","“When Chair Gensler at the SEC in 2021 said, ‘Come in and register,’ we did,” Gallagher said in a June 2023 House Agriculture Committee crypto hearing. “We went through a 16-month process with the SEC staff trying to register [as] a special purpose broker-dealer. And then we were pretty summarily told in March that that process was over and we would not see any fruits of that effort.”","So, to sum up, the SEC announced intentions to sue a firm for failing to register for a license after seemingly denying the firm that very license (though to be accurate, the SPBD licenses are given out by self-regulatory organization FINRA).","This fits with a long pattern. Since coming into office in 2021, SEC Chair Gary Gensler has made it his business to rein in the crypto industry, which he says is under his remit (an arguable contention). These efforts dramatically increased in the wake of the collapse of FTX, which was particularly embarrassing for U.S. regulators given how cozy Sam Bankman-Fried was with them.","The SEC now spends a disproportionate amount of time and money pursuing legal challenges against crypto firms both large and small. The agency has filed at least one lawsuit per month since last November against a crypto company, the majority of which go unnoticed and typically end in a settlement.","“The SEC just sent a Wells notice to Robinhood. The number they've sent about crypto in recent months is astonishing. It's hard to imagine that they would (or could) bring so many enforcement actions at once,” Variant Fund legal lead Jake Chervinsky said on X. “It seems like they're abusing the Wells process as a scare tactic now.”","See also: Consensys, a Target for the SEC's Assault on ETH, Is Fighting Back | Opinion","In some sense, these lawsuits — particularly the ones brought against big name firms like Coinbase and Robinhood — are an attempt to signal that crypto is essentially lawless. This is not squarely the fault of the SEC, but also that Congress slept on crypto regulation for over a decade and is now hampered by partisan gridlock.","“I don’t know why [the SEC] did what they did. But there’s no going back on rules now,” Beau J. Baumann, a PhD. candidate at Yale Law School, and co-author of an influential crypto law paper, told CoinDesk in an interview. “In that sense, the whole thing is bad faith. If the enforcement actions are unlawful, writing a rule is way more obviously so.”","“Congress should enact new legislation to avoid legal pitfalls, but it’s unclear to me whether they actually will,” Baumann added. Gensler, for his part, has stated directly that he doesn’t think crypto needs bespoke legislation or guidance, given his view that everything crypto, bar bitcoin, walks and talks like securities.","While the SEC has had legal victories, it’s suffered many court losses as well. It remains to be seen whether Robinhood will actually get sued, and if so whether it goes the way of Coinbase and Consensys and mounts its own offensive legal campaign.","If there is a silver lining here, it’s that, after years of trying to eat the entire crypto pie, Gensler’s SEC may have bitten off more than it could chew. Robinhood’s stock dipped in pre-market trading today, but has since bounced back, an indication in part that the market doesn’t take this action seriously, at least materially-speaking.","Afterall, even if the SEC wins, it’s hard to imagine the tangible benefits of preventing people from trading Stellar lumens (XLM) or dogecoin (DOGE)."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"weekend","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"Beau J. Baumann","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Gallagher","content":"PERSON"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Yale Law School","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Baumann","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Robinhood —","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"last November","content":"DATE"},{"type":"Dan Gallagher","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["Opinion","The Node","Newsletters","SEC","Gary Gensler","Robinhood","Regulation"],"authors":["Daniel Kuhn"]}