{"summary":"KYC measures are now a must for any crypto platform looking to offer services in jurisdictions like the U.S., Australia and the U.K. as regulators clamp down on anonymous crypto transactions.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-kyc-and-why-does-it-matter-for-crypto\/","publishDate":"2022-01-19T15:33:11","id":16627,"type":null,"title":"What Is KYC and Why Does It Matter For Crypto?","category":["Learn"],"content":["As the cryptocurrency industry grows and matures, global and national financial regulators are putting more pressure on firms that offer digital asset services to comply with the same rules as traditional banks. While there is an on-going debate about the balance between privacy and security, proper know-your-customer (KYC) measures help to prevent the illegal use of cryptocurrencies.","KYC means \"know your customer.\" It refers to a financial institution’s obligation to carry out certain identity and background checks on its clients before allowing them to use its product or platform. It is part of a broader set of measures that regulators around the world use to fight money laundering.","In other words, it stops bad actors from hiding the illicit source of their money behind legitimate financial activity.","Read more: Is Bitcoin Legal?","KYC is one of the biggest regulatory hurdles that crypto firms have had to clear in recent years. By its nature, the decentralized economy is prone to problems regarding KYC. Many decentralized services are designed to allow customers to remain anonymous and keep their personal information private from any central authority. This means many crypto firms are not able to identify who their customers actually are; something regulators do not find acceptable.","Even the most reluctant crypto firms have been compelled to introduce steadily more stringent KYC measures, as they face growing pressure and penalization from regulators.","Despite these efforts, federal prosecutors still chose to charge BitMEX with a variety of regulatory violations in late 2020, including lacking effective KYC safeguards. The following year, the company said all its users had been verified, before announcing a $100 million settlement with regulators.","KYC requirements do not apply to decentralized exchanges (DEXs), meaning those that organize trades through smart contracts instead of a central trading desk are not required to disclose their identities. The institutions that create DEX dodge the regulations because they are not financial intermediaries or counterparties. Their users trade directly with one another by leveraging the infrastructure provided by the DEX.","ShapeShift's CEO said it lost 95% of its users as a result of the KYC measures it was forced to implement. The changes requiring customers to reveal their identities began in 2018 shortly before The Wall Street Journal alleged the exchange had been widely used to launder money – which the company denied. In a bid to shrug off KYC requirements, ShapeShift pivoted business models and relaunched as a DEX in 2021.","Read more: Centralized Exchange (CEX) vs. Decentralized Exchange (DEX): What’s the Difference?","Some crypto exchanges avoid KYC requirements by domiciling in softer regulatory environments. Blockchain analysis firm CipherTrace has reported that as many as half of the exchanges registered in Seychelles have poor KYC measures in place. In 2020, the FBI claimed one defendant in the BitMEX case admitted it only cost “a coconut” to bribe Seychelles authorities.","Media attention and U.S. pressure can encourage those jurisdictions to toughen their stances. A senior figure in the Seychelles Financial Services Authority said “there’s going to be a tightening up now” in the aftermath of the BitMEX case.","Enforcing KYC compliance could help to tackle malicious activity adjacent to the crypto space, such as ransomware attacks that block a user’s access to a computer or network until payment is made. In 2020, victims paid nearly $350 million in crypto to attackers, who leveraged the anonymity provided by decentralized cryptocurrencies to evade detection.","A 2021 report by the Ransomware Task Force, an international grouping of public and private experts, described the crypto sector as enabling this kind of attack and proposed stronger enforcement of existing KYC laws, among other measures.","KYC may also be important in improving crypto’s public image throughout the economy. Stronger compliance, via more robust identification procedures, could help crypto shed its perceived association with money laundering and other criminal enterprises. This, in turn, could encourage wider adoption and investment.","A number of startups are now specifically devoted to solving KYC problems for crypto firms. ID verification startup Passbase offers apps a tool through which their users can upload a selfie along with their ID for speedy verification. The company has raised $13.5 million in seed and Series A round funding.","Identification startup Burrata, which has also recently raised seed funding, issues \"digital identity tokens\" to attach to cryptocurrency wallets. This approach can help other crypto firms to avoid storing users’ data themselves, keeping to their decentralized ethic.","These kinds of tools could ease many crypto firms into compliance, but they will not resolve the ideological opposition to ID checks found in some corners of the crypto world.","Online safety is paramount in this digital age, especially when investing and storing wealth in crypto assets.","Simply put, crypto custody means securing the private key that proves you own of the funds held within your crypto wallet.","Con artists preying on people looking for love is nothing new, but the latest scams have moved on from asking you to buy gift cards to an array of crypto scams."],"entity":[{"type":"$13.5 million","content":"MONEY"},{"type":"$350 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"CipherTrace","content":"ORGANIZATION"},{"type":"Ransomware Task Force","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Seychelles Financial Services Authority","content":"ORGANIZATION"}],"hashtag":["Beginner","industry"],"authors":["Benedict George"]}