{"summary":"Some banks, however, foresee a continued dollar strength on the back of divergent interest rate expectations and the threat of U.S. tariffs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/24\/bitcoin-bulls-pin-hopes-on-weaker-dollar-to-extend-rally\/","publishDate":"2024-04-24T08:04:40","id":16621,"type":null,"title":"Bitcoin Bulls Pin Hopes on Weaker Dollar to Extend Rally","category":["Markets"],"content":["Crypto traders are anticipating a renewed weakness in the U.S. dollar, which would catalyze risk-taking and extend the rally in bitcoin (BTC). However, some banks are forecasting continued dollar strength.","Since mid-March, bitcoin has mainly traded between $60,000 and $70,000, CoinDesk data show. The rally in bitcoin, which began in October last year, has paused, likely due to dwindling expectations of Fed rate cuts and a bounce in the dollar index, which tracks the greenback’s value against major fiat currencies.","The DXY picked up a bid at 102.35 on March 8 and rose to a five-month high of 106.52 last week, according to data from charting platform TradingView. Since then, it has pulled back slightly to 105.70, giving hope to crypto bulls.","“DXY dollar index hit resistance at 106 as expected and has started to turn over. A move back towards 102-103 will turbocharge this rally. The timing makes sense because bitcoin is primed to move to $90,000 in the short term. Longer term, I expect DXY at 92, perhaps by late 2025,” Mike Alfred, a value investor and founder and managing partner at value fund Alpine Fox LP, said on X Tuesday.","The U.S. dollar is a global reserve and invoicing currency, playing a major role in international debt, non-bank borrowing, and global trade. When the dollar appreciates, USD-denominated debt becomes expensive, which, in turn, disincentivizes risk-taking in financial markets. A weaker dollar has the opposite effect. As such, over the years, bitcoin and the broader crypto market have tended to move in the opposite direction of the DXY, just as stocks and gold.","Jan Happel and Yan Allemann, co-founders of Glassnode, who go by the name Negentropic on X, said the dollar looks to have topped out in an “expanding triangle” pattern and could slide in the coming weeks, powering the crypto market higher.","The expanding triangle is identified by diverging trendlines connecting higher highs and lower lows. The DXY has turned lower from the upper trendline resistance and could fall toward 103 next month.","Some banks, however, do not foresee immediate dollar weakness.","According to Societe Generale’s Cross Asset Research Team led by Kit Juckes, the Fed is now unlikely to cut rates before 2025, and that could see the DXY peak somewhere between 107 and 110.","“If the market now adjusts to our forecast of lower rates in 1Q25 (and no further hikes), then peak 2s [two-year yield] should be around 5-51\/4%, pointing to some, but not much more, DXY upside,” the research team said in a note to clients on April 18.","“Overall, if the Fed is on hold for the rest of this year and other central banks ease as expected, the peak DXY level should be in the 107-110 range,” the team added, expressing the possibility of the market overshooting the projected upside target.","In October, when the DXY peaked above 107, and bitcoin began the uptrend, markets expected the Fed to cut rates by 100 basis points in 2024. As of now, markets expect less than two rate cuts this year.","Scotiabank voiced a similar opinion in a note to clients on April 18, saying, “A higher for longer Fed likely means a strong for longer USD.”","Crypto traders might want to monitor potential trade war escalation between the U.S. and China, which could support the U.S. dollar.","Last week, U.S. President Joe Biden called for a steep increase in the tariff rate on Chinese steel and aluminum products to 25% from 7.5%. A tariff is a tax levied by governments on the value, including freight and insurance, of imported products and, in theory, adds to inflation.","Meanwhile, former President and current Republican presidential candidate Donald Trump has proposed implementing a tariff rate of 60% or more on Chinese imports.","According to Barclays, that could push the dollar higher.","“U.S. tariffs tend to support the dollar via the import substitution channel, but the size of the FX impact depends crucially on the details, Barclays’ FX strategy team said in a client note last week.","Barclays stress-tested the scenario of the U.S. imposing a 60% tariff on all Chinese imports and concluded that a Trump victory later this year could spark a 3% rally in DXY.","Edited by Parikshit Mishra."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Yan Allemann","content":"PERSON"},{"type":"Barclays","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Mike Alfred","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"5-51\/4%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Alpine Fox LP","content":"ORGANIZATION"},{"type":"Happel","content":"PERSON"},{"type":"Kit Juckes","content":"PERSON"},{"type":"Scotiabank","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Societe Generale’s Cross Asset Research Team","content":"ORGANIZATION"},{"type":"March 8","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Barclays’ FX","content":"ORGANIZATION"},{"type":"$90,000","content":"MONEY"},{"type":"2025","content":"DATE"},{"type":"7.5%","content":"PERCENT"},{"type":"$60,000","content":"MONEY"},{"type":"DXY","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"April 18","content":"DATE"},{"type":"Donald Trump","content":"PERSON"},{"type":"$70,000","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","Markets","Dollar index"],"authors":["Omkar Godbole"]}