{"summary":"As the implications of the invention of have become understood, a certain hype has sprung up around blockchain technology. This is, perhaps, because it is so easy to imagine high-level use cases. But, the technology has also been closely examined: millions of dollars have been spent researching blockchain technology over the past few years, and […]","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/why-use-a-blockchain\/","publishDate":"2017-03-15T21:06:38","id":16622,"type":null,"title":"Why Use a Blockchain?","category":["Learn"],"content":["As the implications of the invention of have become understood, a certain hype has sprung up around blockchain technology.","This is, perhaps, because it is so easy to imagine high-level use cases. But, the technology has also been closely examined: millions of dollars have been spent researching blockchain technology over the past few years, and numerous tests for whether or not blockchain technology is appropriate in various scenarios have been conducted.","Blockchain technology offers new tools for authentication and authorization in the digital world that preclude the need for many centralized administrators. As a result, it enables the creation of new digital relationships.","By formalizing and securing new digital relationships, the blockchain revolution is posed to create the backbone of a layer of the internet for transactions and interactions of value (often called the 'Internet of Value', as opposed to the 'Internet of Information' which uses the client-server, accounts and master copy databases we’ve been using for over the past 20 years.)","But, with all the talk of building the digital backbone of a new transactional layer to the internet, sometimes blockchains, private cryptographic keys and cryptocurrencies are simply not the right way to go.","Many groups have created flowcharts to help a person or entity decide between a blockchain or master copy, client-server database. The following factors are a distillation of much of what has been previously done:","Paper can be hard to counterfeit because of the complexity of physical seals or appearances. Like etching something in stone, paper documents have certain permanence.","But, if the data is in constant flux, if it is transactions occurring regularly and frequently, then paper as a medium may not be able to keep up the system of record. Manual data entry also has human limitations.","So, if the data and its history are important to the digital relationships they are helping to establish, then blockchains offer a flexible capacity by enabling many parties to write new entries into a system of record that is also held by many custodians.","There remain many reasons why a third party should be in charge of some authentications and authorizations. There are times when third-party control is totally appropriate and desirable. If privacy of the data is the most important consideration, there are ways to secure data by not even connecting it to a network.","But if existing IT infrastructure featuring accounts and log-ins is not sufficient for the security of digital identity, then the problem might be solved by blockchain technology.","As Satoshi Nakamoto wrote in his (or her) seminal work, \"Bitcoin: A Peer-to-Peer Electronic Cash System\": “Merchants must be wary of their customers, hassling them for more information than they would otherwise need. A certain percentage of fraud is accepted as unavoidable.”","Private key cryptography enables push transactions, which don't require centralized systems and the elaborate accounts used to establish digital relationships. If this database requires millions of dollars to secure lightweight financial transactions, then there’s a chance blockchains are the solution.","Does this database require high-performance millisecond transactions?","If high performance, millisecond transactions are what is required, then it’s best to stick with a traditional-model centralized system. Blockchains as databases are slow and there is a cost to storing the data – the processing (or 'mining') of every block in a chain. Centralized data systems based on the client-server model are faster and less expensive… for now.","In short, while we still don’t know the full limits and possibilities of blockchains, we can at least say the use cases which have passed inspection have all been about managing and securing digital relationships as part of a system of record.","Authored by Nolan Bauerle; images by Maria Kuznetsov"],"entity":[{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Maria Kuznetsov","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Nolan Bauerle","content":"PERSON"},{"type":"Value","content":"ORGANIZATION"}],"hashtag":["Learn","Technology","Intermediate"],"authors":["Nolan Bauerle"]}