{"summary":"But the market for cryptocurrencies and blockchains that deliver consumer and business benefits is likely to be bigger than the one for “digital gold,” says Paul Brody, head of blockchain at EY.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/22\/there-can-probably-be-only-one-bitcoin\/","publishDate":"2024-03-22T15:26:45","id":16638,"type":null,"title":"There Can (Probably) Be Only One Bitcoin","category":["Consensus Magazine"],"content":["One of my key questions about the next era in crypto and blockchain is this: How will all the capital likely be deployed into digital assets and cryptocurrencies as they become better regulated?","More than 90% of the world’s financial and business assets are considered “on-shore” – that is, they are owned and managed by entities and people residing in the countries where they are bought and sold.","Today, most crypto-assets are bought and sold off-shore (I estimate about 80% based on data from CoinGecko). However, as more regulated opportunities open up, new capital will flow into these digital asset environments. I don’t, however, think there will be a huge new range of cryptocurrency growth opportunities.","If you read my columns regularly, you know that I strongly believe that Ethereum will follow the path of many other technology ecosystems towards dominance. Ethereum is, first and foremost, a technology platform. Yes, ETH is a cryptocurrency, but its main demand driver is for use, as a payment for transaction processing. I think over time, ETH will largely be subject to the laws of supply and demand for processing power on this “world computer.”","The technology industry needs and thrives upon standards that provide economies of scale and network effects. Ethereum has won the standards war for programming and has largely fixed its scalability issues, making it the default choice. Digital assets will, by and large, exist in the Ethereum ecosystem.","Bitcoin isn’t subject to the same rules. Though people tend to lump them together, Bitcoin is a true crypto-asset and very much like gold; people don’t buy it with plans to use it. They buy it for its scarcity value and to see it appreciate as an asset. Like gold, people do not expect Bitcoin to generate a cash flow, just to appreciate through its scarcity.","Nor do I think that recent efforts to add a Layer 2 ecosystem to Bitcoin, similar to what exists in Ethereum, is likely to change this outcome. The Ethereum ecosystem has an enormous lead and Bitcoin users that want to make their asset programmable have already been migrating it into “wrapped” Bitcoins on Ethereum for some time.","Theoretically, there can be infinite Bitcoins. It feels like there practically already are. Litecoin, Dogecoin, and countless other meme coins and cryptocurrencies are nearly identical copies of Bitcoin. And while there is no BrodyCoin as of yet, I do offer complimentary NFTs (get yours here!).","Despite the effectively infinite supply of Bitcoin copies, I suspect that there really can and only ever will be one Bitcoin, and it’s the one we already have. Let’s stick with the gold analogy. While there isn’t an infinite supply of gold, there are quite a few other precious metals out there. We could just as easily trade in silver or diamonds as gold.","Despite there being multiple options available, however, gold absolutely dominates the market for precious metals. The total market cap of global gold stores is estimated at $13.7 trillion. Silver comes in at just $1.3 trillion and the market cap. An order of magnitude separates gold from the next alternative and so I believe we will see Bitcoin retain a position in the order of a magnitude higher than any other alternative crypto asset.","I think this has a couple of important implications for people as they prepare for the next wave of growth in these markets that will come from a regulated era. The first is that inventing a new cryptocurrency isn’t necessarily going to be a path to success. Bitcoin has that role and, as people want digital gold, that is what they are going to buy.","Second, the world of digital assets should, and can be much bigger than just a digital version of gold. Oil is essential (for the moment) to the global economy and it’s 10 times larger than gold – doing $1.7 trillion in revenue (not to be confused with market cap) annually. Net new growth opportunities are likely to be much bigger by creating something that is used by consumers or needed by enterprises. That space is much larger than holding reserve assets. It’s where I’ll be looking for the next opportunities for real growth."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"$1.7 trillion","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"$13.7 trillion","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Bitcoin Halving"],"authors":["Paul Brody"]}