{"summary":"One analyst firm said over $13 billion in open interest was wiped out as $1.5 billion in bullish bets were liquidated.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/15\/meme-coin-ai-tokens-lead-gains-after-bitcoin-drop-causes-2b-in-weekend-liquidations\/","publishDate":"2024-04-15T11:48:22","id":16637,"type":null,"title":"Meme-Coin, AI Tokens Lead Gains After Bitcoin Drop Causes $2B in Weekend Liquidations","category":["Markets"],"content":["Meme coins and artificial intelligence (AI)-linked tokens led gains in the past 24 hours as bitcoin and other major tokens started to reverse weekend losses.","Bitcoin (BTC) added 3.3% to trade around $66,600 in European morning hours, buoyed by reports prospective ETF providers said they had been approved to offer bitcoin and ether exchange-traded funds in Hong Kong.","Solana meme coins, dog-themed meme coins and Base network meme coins jumped over 15% on average, CoinGecko category data shows, while AI tokens zoomed over 17%. There was no apparent catalyst for the jumps.","Tokens of layer-1 blockchains, such as ether (ETH), Solana’s SOL and Avalanche’s AVAX, were among the worst-performing categories, with an average rise of 5.5%. The broad-based CoinDesk 20, a liquid index of major tokens, minus stablecoins, rose nearly 6%.","On-chain analysis tool Lookonchain said in an X post that whales, a colloquial term for wealthy traders whose actions can move token prices, picked up millions of dollars worth of meme tokens cat in a dogs world (MEW) and slerf (SLERF). Prices for the two rose almost 80% in the past 24 hours.","Profit taking ahead of the halving, due later this week, and macroeconomic tremors weighed on the market since late Friday, with bitcoin dropping from last week’s highs around $70,500 to as low as $62,800. That caused a market-wide decline as majors dropped as much as 18%.","As a result, $2 billion in futures positions were liquidated over the weekend, the most since March. Over $1.5 billion of those positions were betting on higher prices, data from analysis tool Coinalyze shows.","A Coinalyze representative told CoinDesk in an X message that the leverage flush caused open interest – or the number of unsettled futures contracts – to drop $13 billion since Friday, indicative of bets being closed.","Some traders said the price fall was expected ahead of the halving, a much-anticipated event on April 20 that will cut the rewards offered to network miners by half.","“While previous halving events have historically been followed by 9-12 months of uptrend, they have often triggered short-term 'sell the news' reactions before and after the event,” Matteo Greco, a research analyst at digital asset investment firm Fineqia International, told CoinDesk in an email.","“This short-term bearish sentiment is also reflected in the net outflow of $85 million from Bitcoin Spot ETFs during the week, signaling increased profit-taking and investor caution following the strong uptrend in both Q4 2023 and Q1 2024,” Greco added, referring to bitcoin ETF products in the U.S.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Fineqia International","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$85 million","content":"MONEY"},{"type":"Greco","content":"PERSON"},{"type":"April 20","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"millions of dollars","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"},{"type":"Lookonchain","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"3.3%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"12 months","content":"DATE"},{"type":"Matteo Greco","content":"PERSON"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"$70,500","content":"MONEY"},{"type":"18%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$62,800","content":"MONEY"},{"type":"$66,600","content":"MONEY"},{"type":"Solana’s SOL","content":"ORGANIZATION"},{"type":"$13 billion","content":"MONEY"}],"hashtag":["Bitcoin","Trading","Investing"],"authors":["Shaurya Malwa"]}