{"summary":"The challenge is part of a week-long educational game that has received support from 12 major partners, including Blockstream, Trezor, BTCPay and others.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/01\/24\/wasabi-wallet-will-pay-you-to-crack-a-bitcoin-wallet\/","publishDate":"2023-01-24T22:37:28","id":16634,"type":null,"title":"Wasabi Wallet Will Pay You to 'Crack' a Bitcoin Wallet","category":["Tech"],"content":["Bitcoin wallet company Wasabi Wallet has thrown down the gauntlet and challenged bitcoiners around the world to “crack” a bitcoin wallet and collect whatever bitcoin (BTC) it holds.","The challenge, which kicked off Monday, is part of a week-long global treasure hunt dubbed “Hunting Sats” – a gamified educational bootcamp on best practices for private key protection.","The Hunting Sats wallet has been funded with 3,454,811 satoshis or \"sats\" (0.03454811 BTC) and counting. Participants from anywhere in the world will attempt to correctly guess the wallet’s passphrase and 12-word seed phrase in order to claim the funds.","A bitcoin wallet typically comes with a “seed phrase” made up of 12 to 24 random words and is sometimes protected by a PIN, password or passphrase. The seed phrase is used to “recover” or regain access to the wallet in the case of accidental loss.","Read more: What Is a Seed Phrase?","Randomly guessing passwords or passphrases to gain unauthorized access is a method known as “brute-forcing.”","“Hands-on learning through fun games like Hunting Sats is a fantastic way for users to learn about seed phrase security and other benefits of self custody,” the release states. “It shows how brute force becomes more achievable if users reveal part of their seed.”","The secret words from the Hunting Sats seed and passphrase were distributed to 12 partners, including prominent bitcoin companies like Blockstream, Trezor and BTCPay. Each partner will randomly reveal their secret word on Twitter, making brute-forcing easier each time a word is publicly revealed.","“When users work responsibly with their seed and keep their private key in dedicated cold storage, the risk of cracking the wallet is practically zero,” the release states. “Understanding these basic concepts is one of the first steps towards self-sovereignty and self-custody.”"],"entity":[{"type":"Monday","content":"DATE"},{"type":"Blockstream","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Wasabi Wallet","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Gaming","Education","Wasabi Wallet"],"authors":["Frederick Munawa"]}