{"summary":"The new guidelines for listing and delisting of cryptocurrencies are expected as early as the end of April, according to a local news media.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286616\/south-korea-tighter-controls-crypto-listing","publishDate":"2024-04-05T02:46:47","id":1663,"type":null,"title":"South Korea to tighten crypto exchange listings with upcoming guidelines: report","category":["ASIA"],"content":["New guidelines imposing tighter regulations for token listings on centralized crypto exchanges will be released by South Korean financial authorities, news agency News1 reported.","The <a href=\"https:\/\/www.news1.kr\/articles\/5375227\" data-v-f87c67ca=\"\">report<\/a> states that tokens issued by projects that have been hacked and have not yet resolved security issues could be prevented from listing on local exchanges, per the guidelines.&nbsp;","Additionally, the report stated that the Financial Services Commission in the country may mandate that foreign token projects develop specific whitepapers for the local market to get listed on domestic exchanges. Yet, tokens already listed on a licensed exchange for over two years may not need to meet these new criteria.","The guidelines may also require exchanges to delist cryptocurrencies if their issuers fail to properly disclose necessary information, such as if the actual circulation number does not match the disclosed amount. The South Korean government plans to issue the new guidelines as early as later this month and is gathering opinions from local exchanges, the report further stated.","The Financial Services Commission, the leading regulatory body overseeing the local financial sector, has not responded to The Block’s request for comment.","South Korea hosts one of the world’s most active cryptocurrency markets. <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">Data<\/a> from The Block indicates that South Korea’s largest cryptocurrency exchange, Upbit, processed over $221 billion in spot trading volume in March, nearly 9% of the global spot volume.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Upbit","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Services Commission","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$221 billion","content":"MONEY"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}