{"summary":"Avalanche is trying to lure DeFi developers with a new liquidity mining incentive scheme.\n$30 million in AVAX has been allocated across three protocols for the first phase of the program.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114782\/avalanche-launches-180-million-defi-incentive-scheme-aave-curve","publishDate":"2021-08-18T10:00:13","id":1663,"type":null,"title":"Avalanche launches $180 million DeFi incentive scheme with Aave and Curve","category":["Layer 1s"],"content":["The Avalanche Foundation, the organization behind the Avalanche blockchain, has kicked off a new incentive program under the title Avalanche Rush.","The foundation is putting up $180 million in incentives to lure more decentralized finance (DeFi) assets and applications to the network.","Leading DeFi protocols Aave and Curve are among the first to participate in the scheme, alongside BENQi, a liquidity protocol native to Avalanche, with which the foundation recently launched a $3 million liquidity mining initiative. Stake DAO, another DeFi platform, is lined up to build yield generation strategies using Aave and Curve’s upcoming deployments on the network.","In the first phase of the program, AVAX – the network’s native currency – will be used as a liquidity mining incentive for Aave and Curve users over a three-month period. The foundation has set aside $20 million worth of AVAX for Aave users and $7 million for Curve users. Further allocations are planned for the second phase of the scheme over the coming months.","“This is an allocation for effectively a fund that will be disbursed over time, not all of that amount has been allocated,” said Luigi D’Onorio DeMeo, a director at Ava Labs. “This is really our effort to showcase what Avalanche can do as a Layer 1 technology and bring over some of the largest protocols that exist.”","The foundation is an organization distinct from Ava Labs; whereas the latter is a software development company (akin to ConsenSys in the context of the Ethereum), the foundation plays a broader support role for the ecosystem at large.","Avalanche, a proof-of-stake protocol, touts its smart contracts platform as the fastest in the blockchain space. Launched in September 2020, the protocol today underpins more than 225 projects, including Tether, Chainlink, Circle and The Graph.","The Avalanche Rush incentive scheme follows the launch of a new cross-chain bridge project that enables the smooth transfer of assets between blockchains.","In February, the team behind Avalanche <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94159\/bridge-avalanche-ethereum-defi-networks\" data-v-f87c67ca=\"\">unveiled a new bridge<\/a> connecting it with the Ethereum network – allowing DeFi users to transfer assets over. But that first bridge did not work particularly well, according to Emin Gün Sirer, director at the Avalanche Foundation. It proved expensive to use and offered a poor user experience “on days when Ethereum had hiccups,” he explained.","“We recently got a new bridge, a lot of this was predicated on the bridge. We were waiting for a bridge technology that was easy to use and cheap for bringing assets over,” Gün Sirer continued.","With the better bridge, the incentive scheme up and running, and some of DeFi’s best-known protocols involved, Avalanche’s claims of superior speed will be put to the test.","“I think every one of these new launches is both a challenge and an opportunity for us and it’s always going to be a testament to just how scalable the underlying technology is,” said Gün Sirer."],"hashtag":["AAVE","AVALANCHE"]}