{"summary":"The 2022 meltdown is not the first time the risks of “centralized DeFi” products have been laid bare.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/07\/22\/failed-crypto-lender-cred-blames-uphold-exchange-for-its-demise-in-suit\/","publishDate":"2022-07-22T22:00:29","id":16639,"type":null,"title":"Failed Crypto Lender Cred Blames Its Demise on Uphold Exchange in Suit","category":["Consensus Magazine"],"content":["The liquidation trust for cryptocurrency lender Cred sued Uphold Friday, alleging the crypto exchange masterminded the product that ultimately caused Cred to seek bankruptcy protection in 2020.","That product, CredEarn, offered retail investors high yields until the investments Cred made with depositor money soured.","Sound familiar?","Read more: Bad Loans, Bad Bets, Bad Blood: How Crypto Lender Cred Really Went Bankrupt","Although not as high in profile, Cred’s bankruptcy case holds a number of parallels to those of Celsius Network and Voyager Digital, two crypto investment platforms that filed for Chapter 11 bankruptcy protection this month. The drama surrounding Cred’s bankruptcy – who is to blame, whether and how depositors are to be repaid – may provide insight into how these more recent cases could play out.","The Cred case is also a reminder that centralized financial intermediaries have been drawing investors into the \"decentralized” world of cryptocurrency for years through flashy marketing and seemingly too-good-to-be-true promises of high interest rates. These past few months are not the first time the risks of what one might call CeDeFi – centralized decentralized finance – have been laid bare for consumers (and regulators) to see.","Cred’s liquidators are seeking at least $783 million in damages in the case filed in the U.S. Bankruptcy Court for the District of Delaware.","According to Cred Inc. Liquidation Trust, Cred and Uphold jointly created and promoted CredEarn, through which Cred loaned out more than $100 million in customer deposits before failing in 2020.","At the cryptocurrency market’s peak, those crypto investments – a majority of which were funneled to the lender through Uphold’s exchange – would have been worth upwards of $700 million, according to the suit.","The suit alleges that ‘“Uphold drove thousands of retail customers to lend cryptocurrency to the CredEarn program by falsely marketing it as ‘safe,’ ‘secured,’ ‘insured,’ and ‘fully hedged.’”","As evidence, the Cred Liquidation Trust points out that Cred’s founder, Dan Schatt, was a member of Uphold’s Board of Directors. The suit also claims CredEarn was at one time supposed to be called UpholdEarn. It was renamed, says the suit, to avoid regulatory risk.","“Uphold knew that Cred was implementing a highly risky hedging strategy, and that there was regulatory risk associated with cryptocurrency yield earning programs,” reads the suit. “Rather than take on all of these risks, Uphold and Schatt decided to shift the risks away from Uphold by running [‘Earn’] through Cred.”","Uphold disputed the claims made in the lawsuit. Uphold insisted that Cred was owned and operated completely independently, and it said it was unaware of CredEarn’s financial troubles when it promoted the product to Uphold customers.","“Cred was a third-party company over which Uphold had no control,\" said Simon McLoughlin, Uphold's CEO. \"We, like their other partners, were kept completely in the dark about the true state of affairs at the company until it was too late. Our trust was betrayed.”","In an email to CoinDesk, Dan Schatt said: \"I was an unpaid Board Member at Uphold with no equity or other renumeration. I was invited to Uphold’s board based on my expertise as a published author in financial technology and experience at PayPal. I left the Board in October 2020.\" (Uphold claims Schatt was removed from the board.)","Cred was similar in many ways to Celsius, the crypto lending firm (and one-time Cred competitor) that filed for bankruptcy this month after promising market-leading returns to depositors in exchange for their investments. To maintain these high yields, Cred and Celsius both re-invested customer money behind the scenes. They used the interest from these investments to pay back depositors and shaved off a fee for themselves.","Customers’ funds were on the line when these investments went sour.","In Cred’s case, Friday’s lawsuit notes that more than 90% of the cryptocurrency that Uphold’s customers lent to Cred was in turn loaned out to MoKredit – a Chinese micro-lending firm. As CoinDesk reported at the time, CredEarn ran into trouble when MoKredit was no longer able to pay back its loans.","Celsius’s failure stemmed, in part, from a loan it made to Three Arrows Capital – a major crypto hedge fund that filed for bankruptcy in July. Celsius was also heavily invested in Terra, the stablecoin ecosystem that collapsed in May and set off the wider crypto crash.","It remains unclear in either Cred’s or Celsius’ case whether depositors will be able to claw back any of their money.","In addition to Celsius, the Cred saga shares similarities to Voyager – another crypto exchange that filed for bankruptcy this month. In all three cases, questions swirl around whether customers were given false assurances about the safety of their deposits.","Voyager has been on the receiving end of criticism that it misleadingly implied customer deposits were insured by the Federal Deposit Insurance Corp.. The bank where Voyager held customer U.S. dollar deposits was insured. Voyager itself was not. The claims have sparked an FDIC probe, as well as angry posts on Voyager’s Reddit page from customers surprised by the inability to withdraw their funds.","According to Friday’s lawsuit, Cred customers were similarly misled by marketing suggesting that their investments were insured:","According to the Cred Liquidation Trust, “Cred maintained a small amount of basic business insurance … [but] the CredEarn and CredBorrow programs were not insured.”","UPDATE (July 25 15:28 UTC): Added a statement from former Dan Schatt, the former CEO of Cred.","UPDATE (July 26, 22:07 UTC): Adds attribution in eighth paragraph. additional comments from Uphold."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"July 25","content":"DATE"},{"type":"July 26","content":"DATE"},{"type":"How Crypto Lender Cred Really Went Bankrupt","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"$783 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Cred Inc","content":"ORGANIZATION"},{"type":"October 2020","content":"DATE"},{"type":"Schatt","content":"PERSON"},{"type":"Uphold","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"$700 million","content":"MONEY"},{"type":"Board","content":"ORGANIZATION"},{"type":"Cred Liquidation Trust","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Dan Schatt","content":"PERSON"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Uphold’s Board of Directors","content":"ORGANIZATION"},{"type":"Bad Bets","content":"LOCATION"},{"type":"Simon McLoughlin","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Uphold’s","content":"ORGANIZATION"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["Cred","Bankruptcy","Lawsuit","Celsius","Voyager Digital","Lending"],"authors":["Sam Kessler"]}