{"summary":"Tether’s stablecoin has de-pegged as the Curve 3Pool became heavily imbalanced.\nTether CTO Paolo Ardoino said the stablecoin issuer is “ready to redeem any amount.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234822\/tether-depeg-curve-3pool","publishDate":"2023-06-15T03:08:24","id":1664,"type":null,"title":"Tether wobbles as Curve 3Pool becomes imbalanced","category":["Stablecoins"],"content":["Tether's stablecoin, USDT, has de-pegged slightly as Curve's 3Pool — one of the top pools for stablecoin trading in decentralized finance — became heavily imbalanced.","The ideal balance of the Curve 3Pool should be 33.33% for each of its three stablecoins — USDT, USDC and DAI — but USDT's balance has <a href=\"https:\/\/curve.fi\/#\/ethereum\/pools\/3pool\/deposit\" data-v-f87c67ca=\"\">increased<\/a> to over 70%. That means traders are selling a lot of USDT for DAI or USDC, which has led to USDT de-pegging to $0.997.","\"I think the market is really tense in general,\" Tether CTO Paolo Ardoino told The Block.","\"All recent news etc. are pushing big groups to exit from crypto markets. Tether is the gateway for liquidity, inbound and outbound. So when the interest in crypto grows, we see inflows; when the sentiment on the crypto market is negative, we see outflows. We can't exclude a direct attack to Tether either, as we have seen in 2022,\" Ardoino said.","The last time Curve 3Pool became imbalanced was in March when USDC and DAI’s balance increased to over 45% each. It also became imbalanced in November when crypto exchange FTX&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/187982\/ftx-bankruptcy-filings-highlight-complete-failure-of-corporate-controls\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/187982\/ftx-bankruptcy-filings-highlight-complete-failure-of-corporate-controls\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">collapsed<\/a>. A similar imbalance was also observed after the Terra ecosystem’s&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/230590\/terra-death-spiral-turns-one-searching-for-silver-linings-among-the-wreckage\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/230590\/terra-death-spiral-turns-one-searching-for-silver-linings-among-the-wreckage\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">crash<\/a>&nbsp;in May 2022, which saw USDT turn volatile and temporarily lose its peg.","The price discrepancy in USDT serves as fuel for arbitrage opportunities in the market. USDT has experienced occasional price discrepancies in the past but has never maintained a prolonged depeg from its intended value.","Ardoino said Tether will monitor the situation, but it is \"ready to redeem any amount.\"","<em data-v-f87c67ca=\"\">The headline and article have been updated for clarification.<\/em>"],"hashtag":["DAI","TETHER","USDC"]}