{"summary":"The Department of Energy's statistics wing is feigning an \"emergency\" to attack legitimate U.S. businesses and score political points, Texas Blockchain Council President Lee Bratcher and Chamber of Digital Commerce CEO Perianne Boring write.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/08\/bitcoin-mining-and-the-politicization-of-a-once-reputable-federal-agency\/","publishDate":"2024-02-08T18:24:26","id":16642,"type":null,"title":"Bitcoin Mining and the Politicization of a Once Reputable Federal Agency","category":["Consensus Magazine"],"content":["The Energy Information Administration’s (EIA) mandatory emergency survey of electricity consumption data represents the latest in a politically motivated campaign against bitcoin mining, cryptocurrency, and U.S.-led innovation. We believe this should cause concern for all industries that rely on data centers as part of their operations.","Lee Bratcher is a board member and president at the Texas Blockchain Council. Perianne Boring is founder and CEO of the Chamber of Digital Commerce.","Instead of focusing on improving our aging electricity infrastructure and working to ensure grid stability, the Department of Energy and EIA have prioritized taking unprecedented steps to target private businesses for political purposes. This action is an abuse of authority in order to further the Biden administration’s public goal “to limit or eliminate” U.S. bitcoin miners, while pleading ignorance to U.S. miner’s utilization of renewable resources and uniquely flexible operations.","See also: The U.S. Government Seems to Be Closing in on Bitcoin Mining | Opinion","The survey asks for information that goes beyond the typical requests made by the EIA. For decades the EIA has conducted itself as an apolitical information gathering body within the Department of Energy (DOE). Had this survey been in-line with previous surveys, there would be no cause for alarm.","However, this survey is specifically targeting bitcoin miners and asking for private information such as the name of the energy company with which the miner has signed power purchase agreements. It is not a logical leap to be concerned about the Biden administration putting pressure on those energy providers to discontinue their business with bitcoin miners.","Thanks to bitcoin miners’ ability to rapidly adjust their data centers’ power usage according to grid conditions, their operations are the most flexible and responsive electrical loads in the nation. It is well known that they offer critical grid stabilizing benefits to the communities in which they operate.","These capabilities were on full display during recent periods of cold weather in Texas, which the EIA boldly cites in its justification for this misguided measure. If the stated justification for this emergency action – concern with data centers potentially overloading the grid – is to be trusted, other industries, such as financial institutions and social media companies, should now also be on notice of this troubling new tactic.","In ERCOT, which operates Texas's electrical grid, and many other independent system operators (ISOs) across the country, prices are the best proxy for grid stress. There are other proxies such as physical responsive capability (PRC), but prices are a better measure for most situations. For that reason, in order to prevent swings in prices and create more challenging grid conditions, an optimal environment is one in which the price does not swing wildly up and down. But that is traditionally what happens (see the graph below from last year’s Winter Storm Elliot).","Bitcoin miners are the economically perfect consumers of electricity. That is not to say that bitcoin miners will consume electricity in an altruistic way, but rather that bitcoin miners are so sensitive to the price of power that they are economically incentivized to curtail their consumption when power prices rise past their breakeven (current breakeven for most miners ranges between $100 and $200 per megawatts\/hour, with some exceptions for miners with hosting contracts that have uptime requirements).","See also: The Blocksize Wars Revisited: Why Bitcoin's 'Civil War' Still Matters","That means mining operations will run when prices are below their breakeven and turn off when prices are above it.","Bitcoin miners comprise one of the most transparent industries in the world, (e.g., EIA Website, Hashrate Index, Cambridge University, Texas A&M, ERCOT Data). Moreover, each data center’s development entails exhaustive investment, administrative, procurement and construction processes before they can begin operations. These facts belie the purported justification for this “emergency”mandate.","This is an attack against legitimate American businesses with the administration feigning an emergency to score political points. The White House has been clear that they desire to “to limit or eliminate” bitcoin miners from operating in the United States. Although the Bitcoin network is resilient against potential bans, the administration is seeking to make the lives of bitcoin miners, their employees and local communities too difficult to bear operating in the United States. This is deeply concerning.","It should be of concern to any industry in the United States that consumes energy. If an administration has political points to score by fabricating a crisis to justify removing access to the electricity, then an entire industry can be taken down on a whim.","We strongly believe EIA has overstepped its authority in issuing this emergency mandate. We urge the Biden administration to reconsider this course of action. Until that time, the industry will be pursuing all legal resources available to us."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Department of Energy (DOE)","content":"ORGANIZATION"},{"type":"Hashrate Index","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Lee Bratcher","content":"PERSON"},{"type":"ERCOT Data)","content":"ORGANIZATION"},{"type":"Energy Information Administration","content":"ORGANIZATION"},{"type":"Texas Blockchain Council","content":"ORGANIZATION"},{"type":"Winter","content":"DATE"},{"type":"PRC","content":"ORGANIZATION"},{"type":"Department of Energy","content":"ORGANIZATION"},{"type":"U.S. Government Seems","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"EIA","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Cambridge University","content":"ORGANIZATION"}],"hashtag":["Opinion","Mining","Texas","Department of Energy","Environment","Biden Administration"],"authors":["Lee Bratcher","Perianne Boring"]}