{"summary":"Increasing on-chain use of the network are driving up fees.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/22\/how-the-bitcoin-halving-will-drive-action-to-layer-2s\/","publishDate":"2024-04-22T19:15:17","id":16656,"type":null,"title":"How the Bitcoin Halving Will Drive Action to Layer 2s","category":["Consensus Magazine"],"content":["Welcome to “Epoch V” of Bitcoin. On April 20 Bitcoin underwent its fourth successful halving, the programmed slashing of the amount of new bitcoin (BTC) that enters into circulation via mining. While the event itself is a bit of a barnburner — a moment for people around the world to celebrate virtually and in person — many eyes are on what is to come.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","The launch of Runes, a new protocol that enables the creation of meme coins on Bitcoin, coincided with the halving. Already hundreds of tokens have launched, contributing over $80 million in fees to bitcoin miners. This increased trading activity has also driven up the costs associated with sending a transaction on Bitcoin, with the current average price over $70, an increase of 1,395.8% over the trailing 30 day average, according to TokenTerminal.","While it’s hard to say whether this activity will level out, there are some who think “Epoch V,” or the period of time leading up to the next halving in 2028, will be when Bitcoin layer 2s like the Lightning Network will finally catch on. On April 20, bitcoin fees hit an all-time high of $128.","“Anything that causes fee rates to spike will probably drive people to seek out other solutions,” Bitcoin Core developer Ava Chow said in an interview with CoinDesk. “Lightning is one option. Also there are side chains like Fedimint, Ark and a bunch of layer 2s. High fee environments will prompt people to look into them.”","See also: Bitcoin Transaction Fees Come Crashing Down Post Halving","It’s a point echoed by a recent Messari report, which argued that with the rising level of on-chain activity, “layer-2 solutions for Bitcoin are not just a luxury but a necessity,” analyst Nikhil Chaturvedi wrote. Bitcoin is no longer just “digital gold,” but a platform on which to build.","This shifting mindset was stirred by the launch of the Ordinals protocol last year, which enabled new ways of storing data on the smallest units of BTC, called satoshis. There have already been over $3 billion in NFT-like Ordinal “inscription” sales, and trading activity is trending up with the average number of transactions approaching 2 million.","But Ordinals is hardly alone in driving up Bitcoin fees. BitVM, a way to move computation off-chain, enables people to build Ethereum-like smart contracts on Bitcoin. Babylon is building a way to stake and earn yield on BTC holdings. And layer 2s like Stacks and Merlin are becoming home to a number of decentralized apps and meme coins.","Interestly, in the days since the halving, tokens associated with Bitcoin L2s have outperformed BTC. For instance, Elastos’ ELA token has risen 11%, and SatoshiVM’s SAVM climbed 5%. Stack’s STX token has gained nearly 20% to $2.87 — though that may also have been driven by the network’s anticipated Nakamoto upgrade, which began rolling out today.","While market forces will likely drive action to Bitcoin’s secondary layers, that may not always be a good thing. For one thing, those with low bitcoin balances may be priced out from using platforms like Lightning, if they want to use it non-custodially and set up their own channels, Chow suggested.","“The problem is, all of these layer 2s require an on-chain transaction,” Chow said, referring to something like the “inbound capacity” needed to fund a Lightning account. Lightning users also have to pay for an on-chain closing transaction. “In a high fee environment that means it's going to be a little bit hard to actually start using those things.”","See also: OG Bitcoin L2 Stacks Is Getting a Major Overhaul","Of course, there are workarounds to this: custodial Lightning companies that subsidize these surprisingly expensive transactions.","“I am concerned higher BTC fees will drive users to custodial Lightning services … giving BTC users no sovereignty or anonymity over their BTC holdings,” pseudonymous bitcoiner and Lightning critic Sovereign Matt told CoinDesk. “Custodial Lightning services will become the new banks\/middlemen that people will have to trust with their life savings as it will be too expensive to self-custody and transact using mainchain bitcoin.”","To some extent, all of this is downstream of the so-called Blocksize Wars over how to scale Bitcoin years ago, where it was decided that instead of ramping up the size of Bitcoin blocks to scale the chain through layer 2s. That set Bitcoin down the path it’s currently on.","“There's basically two schools of thought on increasing the number of transactions per block. You can make blocks bigger, or you can make transactions smaller,” Chow said, adding that expanding the block size is like “brute forcing” a solution.","There are ways of making bitcoin transactions smaller, and more compact, but until that happens, it’s like layer 2s will grow.","Edited by Bradley Keoun."],"entity":[{"type":"$128","content":"MONEY"},{"type":"Chow","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"Nakamoto","content":"PERSON"},{"type":"Blocksize Wars","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"1,395.8%","content":"PERCENT"},{"type":"OG Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin Transaction Fees Come Crashing Down Post Halving","content":"ORGANIZATION"},{"type":"2028","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"Merlin","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"years ago","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Nikhil Chaturvedi","content":"PERSON"},{"type":"$2.87","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Elastos’ ELA","content":"ORGANIZATION"},{"type":"$70","content":"MONEY"},{"type":"Ava Chow","content":"PERSON"},{"type":"Matt","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Bitcoin","Fees","Layer 2s"],"authors":["Daniel Kuhn"]}