{"summary":"The crypto market faces the U.S. tax season liquidity test around the time the Bitcoin blockchain implements the fourth mining-reward halving on April 20.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/09\/bitcoin-could-slump-around-reward-halving-time-arthur-hayes-says\/","publishDate":"2024-04-09T08:18:23","id":16655,"type":null,"title":"Bitcoin Could Slump Around Reward Halving Time, Arthur Hayes Says","category":["Markets"],"content":["Gear up for some pain in the digital assets market.","Bitcoin (BTC), the leading cryptocurrency by market value, will probably face selling pressure in the days before and after the mining-reward halving due April 20, a supposedly bullish event.","That's the message from Arthur Hayes, a co-founder and former CEO of crypto exchange BitMEX and the chief investment officer at Maelstrom.","In his latest blog post, \"Heatwave,\" Hayes explained that the bullish halving narrative is \"well entrenched,\" leaving the doors open for a so-called price correction. In crypto, a correction is considered a price drop of at least 10%.","Read More: Did Strong Bitcoin ETF Demand Kill Halving's Potential Bullish Rally?","The bullish narrative stems from data showing bitcoin tends to chalk out stellar multimonth rallies in the months after the halving, an event that reduces the pace of supply expansion rate by 50% every four years. This time the halving will cut the per-block issuance to 3.125 BTC from 6.25 BTC.","\"The narrative of the halving being positive for crypto prices is well entrenched,\" Hayes wrote. \"When most market participants agree on a certain outcome, the opposite usually occurs. That is why I believe Bitcoin and crypto prices in general will slump around the halving.\"","Several analysts have argued that the supply slowdown is priced in and the market could correct following the event. Bitcoin has rallied over 65% this year, setting new records above $70,000 well before the halving.","Hayes added that U.S. tax payments, due on April 15, coupled with the Federal Reserve's quantitative tightening (QT) policies, could remove dollar liquidity from the market, leading to broad-based risk aversion and a fire sale of crypto assets around halving.","\"Given that the halving occurs at a time when dollar liquidity is tighter than usual, it will add propellant to a raging firesale of crypto assets. The timing of the halving adds further weight to my decision to abstain from trading until May,\" Hayes said.","Tax payments typically remove liquidity from the financial system as individuals withdraw cash from bank deposits and market funds to pay their dues.","When the dollar's liquidity dries up, it appreciates against other fiat currencies, and borrowers with dollar-denominated loans face higher interest expenses and scale-back exposure to risk assets like cryptocurrencies and technology stocks. The dollar's weakening has the opposite impact. The U.S. dollar, a global reserve currency, plays an outsized role in global trade, non-bank borrowing, and international debt.","Liquidity outflows due to impending tax payments could be sizeable, thanks to capital gains from the booming stock markets and interest income from elevated interest rates. In other words, the balance in the Treasury General Account (TGA) is set to rise sharply in the second half of April. The TGA is the government's operating account maintained at the Fed to collect tax revenue, customs duties, proceeds from securities sales and debt receipts and meet government expenses.","\"When the Treasury receives tax payments, the TGA balance rises. I expect the TGA balance to swell well above the current ~$750 billion level as tax payments are processed on April 15th. This is dollar liquidity negative,\" Hayes said. \"The precarious period for risky assets is April 15th to May 1st.\"","Hayes expects Treasury Secretary Janet Yellen to run down the Treasury General Account after May 1, providing a bullish tailwind to risk assets in months leading up to the U.S. presidential election in November.","\"After May 1st, the pace of QT declines, and Yellen gets busy cashing checks to jack up asset prices. If you are a trader looking for an opportune time to put on a cheeky short position, the month of April is the perfect time to do so. After May 1st, it’s back to regular programming … asset inflation sponsored by Fed and U.S. Treasury financial shenanigans,\" Hayes wrote.","Edited by Sheldon Reback."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"TGA","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"November","content":"DATE"},{"type":"May 1st","content":"DATE"},{"type":"Treasury General Account","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Yellen","content":"PERSON"},{"type":"May 1","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"April 15th","content":"DATE"},{"type":"the second half of April","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"$750 billion","content":"MONEY"},{"type":"$70,000","content":"MONEY"},{"type":"April 15","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Treasury General Account (TGA","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Halving","Tax","US","Arthur Hayes"],"authors":["Omkar Godbole"]}