{"summary":"The London-based firm says the creditor promised to fork over two FTX accounts, only to back out of the deal after the value of its claims skyrocketed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/18\/ftx-claims-holder-attestor-takes-creditor-to-court-over-alleged-sellers-remorse\/","publishDate":"2024-03-18T17:45:44","id":16650,"type":null,"title":"FTX Claims Holder Attestor Takes Creditor to Court Over Alleged 'Seller’s Remorse'","category":["Policy"],"content":["London-based investment firm Attestor Capital, a top holder of FTX bankruptcy claims, has filed suit against a FTX creditor who allegedly promised to sell the firm two FTX accounts, only to back out of the deal once the value of its claims skyrocketed.","According to court documents filed in New York on Jan. 29, Attestor, through a wholly-owned subsidiary called Svalbard Holdings Limited, made an agreement with a Panamanian company, Lemma Technologies, to purchase the accounts – worth a combined $166 million at the time of FTX’s collapse – in June 2023, after placing the highest bid at an auction organized by Lemma Technologies in May 2023.","Lemma Technologies was not an original FTX creditor: the company had allegedly acquired the accounts on Jan. 18, 2023, when its majority owner and president, South Korean national Junho Bang, transferred the rights to both of his personal accounts to his firm. According to Attestor’s documents, Lemma Technologies has “no known assets” other than Bang’s transferred claims.","But after making a deal to sell its claims to Attestor for approximately $58 million – 35% of the initial value of its accounts – Attestor says Lemma and its South Korean owners got cold feet. According to Attestor’s complaint, Lemma “began to assert that complications had arisen” regarding its authority to sell the claims, and that Bang could be “exposed to liability to his business associates” if the accounts were transferred to Attestor.","While they delayed, Attestor claims Lemma Technologies “began to attempt to renegotiate” the agreed-upon purchase price of the accounts – evidence, Attestor says, of the company’s “seller’s remorse.”","At the time of Attestor’s purchase of Lemma Technologies’ claims, the 35% price was above the typical price paid to claims holders, according to data from Claims Market. But in the months following the agreement, while both parties were working on due diligence, the average bid for FTX claims steadily climbed, reaching 68% by the end of 2023. The most recent data from Claims Market puts the average bid for FTX claims at 92%.","The value for FTX claims has risen along with investors’ confidence that they will get their money back at the end of the bankruptcy process: in January, lawyers for the defunct exchange said they expected to be able to pay back customers in full, aided by the rising price of bitcoin.","Lemma has not publicly responded to Attestor’s suit or filed a defense against it. CoinDesk’s request for comment, sent to two email addresses connected to Bang in the court documents, remained unanswered at the time of publication.","Attestor’s suit against Lemma is not the only legal battle Bang is facing.","Along with two other executives connected to Haru Invest, a South Korean crypto yield platform, Bang was arrested in February after Korean authorities accused the trio of embezzling 1.1 trillion won – approximately $828 million – from customers. It is unclear whether Bang remains in custody.","Haru Invest halted withdrawals and deposits last June, citing “certain issues” with one of its service providers. The company later announced that it was filing both a criminal complaint and a civil lawsuit against B&S Holdings, which acted as a consignment operator for the platform, for allegedly providing fraudulent management reports.","Bang is, according to Haru Invest and local media, the majority shareholder of B&S Holdings.","Edited by Nikhilesh De."],"entity":[{"type":"92%","content":"PERCENT"},{"type":"$58 million","content":"MONEY"},{"type":"Attestor","content":"LOCATION"},{"type":"Svalbard Holdings Limited","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Jan. 29","content":"DATE"},{"type":"Lemma “","content":"PERSON"},{"type":"Lemma Technologies","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"Attestor Capital","content":"ORGANIZATION"},{"type":"Jan. 18, 2023","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Haru Invest","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Lemma","content":"PERSON"},{"type":"Claims Market","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$828 million","content":"MONEY"},{"type":"$166 million","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"B&S Holdings","content":"ORGANIZATION"},{"type":"Haru Invest","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Regulations","FTX","Bankruptcy"],"authors":["Cheyenne Ligon"]}