{"summary":"The crypto exchange is laying off 1,100, after saying it was in hiring mode earlier this year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/11\/30\/kraken-cuts-30-of-workforce-amid-crypto-winter\/","publishDate":"2022-11-30T16:21:55","id":16665,"type":null,"title":"Kraken Cuts 30% of Workforce Amid Crypto Winter","category":["Finance"],"content":["Crypto exchange Kraken said Wednesday it is laying off 30% of its global staff – around 1,100 people – in response to the crypto market downturn.","\"Since the start of this year, macroeconomic and geopolitical factors have weighed on financial markets. This resulted in significantly lower trading volumes and fewer client sign-ups,\" Kraken said in a blog post.","\"We responded by slowing hiring efforts and avoiding large marketing commitments. Unfortunately, negative influences on the financial markets have continued and we have exhausted preferable options for bringing costs in line with demand.\"","The crypto market has sunk this year, with bitcoin (BTC) losing 63% of its value since the end of 2021 and the total crypto market cap down more than two-thirds in the past 12 months. Companies that ramped up staffing levels during the preceding boom years have had to cut back during the decline. This month alone, publicly traded exchange Coinbase (COIN) trimmed 60 positions, and Unchained Capital, a bitcoin financial-services firm, shed more than 600.","As recently as June, Kraken said it was taking looking to expand as other companies laid off staff, flooding the market with experienced labor, saying it wanted to hire another 500 people.","\"We have not adjusted our hiring plan, and we do not intend to make any layoffs,\" it said at the time.","UPDATE (Nov. 30, 16:46 UTC): Adds market background, other companies' job cuts in fourth paragraph; reversal of expansion in fifth."],"entity":[{"type":"2021","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Nov. 30","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Kraken","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"ups","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"Unchained Capital","content":"ORGANIZATION"}],"hashtag":["Kabul","Crypto Exchange","Layoffs","Crypto Winter"],"authors":["Danny Nelson"]}