{"summary":"The new rules by the U.S. accounting standards setter would go into effect in December 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/13\/fasb-confirms-fair-value-approach-for-corporate-crypto-holdings\/","publishDate":"2023-12-13T16:25:52","id":16672,"type":null,"title":"FASB Confirms 'Fair Value' Approach for Corporate Crypto Holdings","category":["Policy"],"content":["The Financial Accounting Standards Board (FASB), a U.S. entity that details how companies should report assets on their balance sheet, published a standards update on Wednesday that will let corporations recognize \"fair value\" changes in crypto holdings.","The move will benefit companies with crypto on their balance sheets, like MicroStrategy (MSTR). Under the existing rulebook, companies have to report a loss if the crypto they hold is worth less than the purchase price, even if they haven't sold the assets. Under the new rules, companies will have to report the fair value, cost-basis and types of assets they're holding.","Stakeholders providing feedback to FASB said the existing guidance did not provide useful information for investors or other parties, the update document said.","\"Accounting for only the decreases, but not the increases, in the value of crypto assets in the financial statements until they are sold does not provide relevant information that reflects (1) the underlying economics of those assets and (2) an entity’s financial position,\" the document said.","The new rules were adopted unanimously by the board and will take effect after Dec. 15, 2024, the document said.","A section explaining how FASB got to the point of adopting new guidance said it received a vast amount of feedback supporting a new approach to digital assets.","\"Stakeholders’ feedback, including respondents to the 2021 FASB Invitation to Comment (ITC), Agenda Consultation, indicated that improving the accounting for and disclosure of crypto assets should be a top priority for the Board,\" the document said. \"Nearly 500 respondents to the 2021 ITC requested that the Board add to its agenda a project related to crypto assets.\"","FASB has been working on updating accounting rules for crypto holdings over the past several months, with FASB indicating in September it would adopt the new guidance.","Michael Saylor, MicroStrategy's founder and former CEO, previously tweeted that the move would make it easier for corporations to adopt bitcoin as a treasury asset, an argument he repeated Wednesday morning after the FASB guidance was released.","Bitcoin's (BTC) price rose more than 1% after the guidance was released, trading around $42,150 as of press time.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Financial Accounting Standards Board (FASB","content":"ORGANIZATION"},{"type":"FASB","content":"ORGANIZATION"},{"type":"ITC","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$42,150","content":"MONEY"},{"type":"Board","content":"ORGANIZATION"},{"type":"Dec. 15, 2024","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Regulations","FASB","Accounting"],"authors":["Nikhilesh De"]}