{"summary":"The proposal by Robin Linus, a core contributor to ZeroSync, a developer of zero-knowledge proofs for use on the Bitcoin blockchain, sets out how an open market for content hosting could be created by \"an atomic swap of coins for files.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/11\/13\/bitcoin-researcher-behind-bitvm-ignites-fresh-buzz-with-new-paper-on-file-hosting\/","publishDate":"2023-11-13T16:52:53","id":16676,"type":null,"title":"Bitcoin Researcher Behind 'BitVM' Ignites Fresh Buzz With New Paper on File Hosting","category":["Technology"],"content":["Bitcoin researcher Robin Linus, who turned heads last month with the release of his \"BitVM\" paper outlining a path for bringing Ethereum-style smart contracts to the original blockchain, is creating buzz anew with his latest publication: a proposal for decentralized file hosting, incentivized via Bitcoin payments.","The new \"BitStream\" proposal by Linus, a core contributor to Bitcoin-based zero-knowledge proofs developer ZeroSync, sets out how an open market for content hosting could be created by \"an atomic swap of coins for files.\"","Using payment channels like Lightning, the server would charge for each download, thereby avoiding spiraling overhead costs in the event of a subsequent huge number of downloads.","\"The server encrypts the file such that if there’s any mismatch during decryption the client can derive a compact fraud proof,\" Linus said in the abstract to the white paper dated Nov. 12. \"A bond contract guarantees the client receives the exact file or they can punish the server.\"","The BitStream proposal echoes the BitVM paper's attempt address the risk of damaging the network's performance by clogging it up with transactions or other computations by carrying them out off-chain. In both cases, transactions or computations would only need to carried out on-chain for verification or to address a dispute.","In response to Linus's post about the new white paper on X (formerly Twitter), one user suggested BitStream could do \"for storage space what BitVM does for execution time,\" with which Linus agreed and confirmed that the two proposals could be combined.","Another poster on X asked, \"What makes this better than the numerous storage cryptocurrencies we have had before?\"","Linus answered, \"It's Bitcoin.\"","Read More: Bitcoin Is Fundamentally Different From Other Cryptocurrencies: Fidelity Digital Assets","Edited by Bradley Keoun.","\n"],"entity":[{"type":"Linus","content":"PERSON"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"BitStream","content":"ORGANIZATION"},{"type":"Linus","content":"ORGANIZATION"},{"type":"Nov. 12","content":"DATE"},{"type":"Robin Linus","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Decentralization","File Sharing","Bitcoin"],"authors":["Jamie Crawley"]}