{"summary":"Dorsey, who led the social media platform from 2015 to 2021, developed a strong interest in crypto during that time and is now fully focused on the sector.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/10\/former-twitter-ceo-jack-dorsey-says-bitcoin-will-go-beyond-1-million-in-2030\/","publishDate":"2024-05-10T16:26:39","id":16678,"type":null,"title":"Jack Dorsey Says Bitcoin Price Will Go Beyond $1 Million in 2030","category":["Markets"],"content":["Former Twitter CEO and now founder and backer of several crypto projects, Jack Dorsey, believes that bitcoin (BTC) will go as high as $1 million by 2030.","When asked about a price prediction for bitcoin in an interview with Pirate Wires, Dorsey said, “I don’t know. Over… at least a million. I do think it hits that number and goes beyond.”","While the price of the cryptocurrency is interesting, he said, it’s the ecosystem and movement that fascinates Dorsey.","“The most amazing thing about bitcoin, apart from the founding story, is anyone who works on it, or gets paid in it, or buys it for themselves—everyone who puts any effort in to make it better—is making the entire ecosystem better, which makes the price go up,” he said.","While $1 million seems like a stretch from bitcoin’s current price of $60,886, other big names in the industry have voiced similar outlooks. Ark Invest founder and CEO Cathie Wood has even taken it a step further, predicting the token will reach $1.5 million by 2030.","Ever since stepping down as Twitter CEO in 2021, Dorsey has become an advocate for the industry, leading and endorsing several projects over the years. In 2019, he became a backer of social media startup BlueSky, which he recently stepped away from as his vision for a decentralized social media platform aligns more with a competitor Nostr.","Dorsey also founded a company called Square in 2009, which was rebranded to Block in 2021 as his interest in blockchain technology grew.","Edited by Aoyon Ashraf."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Pirate Wires","content":"ORGANIZATION"},{"type":"$60,886","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"2009","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Dorsey","content":"PERSON"}],"hashtag":["Bitcoin","Markets","Jack Dorsey"],"authors":["Helene Braun"]}