{"summary":"From exchanges that reward you to learn about certain tokens to apps that give you crypto for staying active, the play-to-earn crypto idea is extending beyond online games.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/learn-to-earn-move-to-earn-how-to-earn-crypto-in-new-ways\/","publishDate":"2022-06-07T20:07:30","id":16682,"type":null,"title":"Learn-to-Earn, Move-to-Earn: How to Earn Crypto in New Ways","category":["Learn"],"content":["Crypto projects are often preoccupied with different ways to promote themselves in a space full of loud and fast-moving players. One way involves handing out tokens to their users in return for learning, playing or even just walking around.","You may not need to buy or mine crypto to acquire some coins these days, but you do still have to give something in return – often it’s your time or attention. In some cases, you will still have to pay an initial lump sum to start earning income over time through your activities.","Whether these projects can prove sustainable in the long term is very much an open question.","\"Learn-to-earn\" is the idea of rewarding you with tokens simply for learning about crypto, usually in the form of some of the tokens you just learned about.","There are two motivations at play here: the companies behind the platform and the people behind the cryptocurrency. The learn platform (currently most often an exchange) wants you to do it on their platform. This will make you more likely to engage with them as soon as you know what’s what. They are competing to drive traffic to their platform.","The tokens are competing for market share in an increasingly competitive space. By teaching you and getting you invested in their projects by making you also investors (even in very small amounts), they have the chance to grab attention from 18,000 other cryptos and educate you on the “why” and “how” of their project.","A few well-known crypto entities offer this kind of incentive, including some of the big centralized exchanges.","With Coinbase Earn, you watch animated videos or read an article and then complete quizzes to test if you were paying attention. You get crypto rewards deposited into your account for completing the quizzes correctly and receive a bit of the specific crypto that you just learned about. The rewards aren’t going to make you rich, but it’s a relatively low time investment to learn and earn here.","To take part in Binance Learn, you have to have a Binance account already. So this partly serves as a perk or reward of having an account with Binance. Just like on Coinbase, you watch videos and take quizzes on what you learned. On Binance, however, you get a voucher for crypto tokens that you have to go and redeem yourself. But watch out: It’s only valid for 14 days.","Read More: Platform Pitches ‘Earn While You Learn’ For Business Execs","If you’re a newcomer to the world of crypto, and you’ve decided to stick to the sense of safety offered by a major centralized exchange, you might not care at first which one you use. Learn-to-earn features are one way they can differentiate themselves from the crowd.","Another centralized exchange, Phemex, has offered a learn-to-earn feature, but at the time of writing, it has announced on its website that the reward element has been suspended “due to the restructuring of our bonus program.” So it’s worth remembering that any rewards program can get cut when companies have to tighten their belts.","It might be a bit less obvious why crypto projects would reward you with tokens just for moving. Take a look at this example.","Stepn is one of the first \"move-to-earn\" projects. It rewards you for your physical, real-life step count. But you don’t just get to move and earn – you have to buy virtual sneakers in order to start earning. The sneakers are represented by a non-fungible token (NFT). At the time of writing, the cheapest Stepn sneakers on the Magic Eden marketplace were going for more than 13 solana tokens, a value of more than $650.","Read More: Stepn’s ‘Move-to-Earn’ Model Has Crypto Analysts Seeing Value","That’s your first clue as to how the project is making money while paying you to walk around. Stepn takes a royalty fee whenever its NFTs change hands. It also charges fees connected with various other things you can do in its app, including \"breeding\" two sneaker NFTs together to make a new one.","Once you have your \"sneakers,\" you can earn tokens for going out and physically exercising in real life. As of April 2022, the company said it had 200,000 daily users, and its app had been downloaded 1 million times. That’s a lot of people buying sneakers and royalty fees flowing to the creators. But at the same time, it could really be helping people to motivate themselves to exercise.","Read More: 'Move-to-Earn' Application Stepn Suffers Cyber Attack After Upgrade","Move-to-earn comes broadly under the category of GameFi, meaning gaming crypto finance.","Another term you’ll come across is \"play-to-earn.\" One of the most famous examples is Axie Infinity, which rewards users with its native token in return for various in-game achievements.","Gaming projects benefit from attracting a larger volume of users. The tokens they use for rewards have special uses within the game’s ecosystem and entice users to keep coming back. Some, like Axie Infinity, generate revenue by charging transaction fees within the ecosystem. The challenge for the creators is to design an in-game economy that will generate a profit.","Reports emerged in 2021 that impoverished users in countries such as Venezuela were using Axie Infinity to help them earn a living. But storm clouds have since gathered. Research showed that users in the Philippines, who were playing the game using borrowed NFTs and paying a yield to lenders, were still earning less than the country’s minimum wage for doing so. A hack in March 2022 led to the loss of tokens worth more than $625 million from a blockchain that serves the Axie ecosystem. And Axie's native token AXS dropped from around $94 on Jan. 1, 2022, to just over $20 at the time of writing.","The takeaway is that no project should ever be relied upon to keep paying you indefinitely and to look at these crypto earning projects with a critical eye, knowing that the rewards may not last forever.","Read More: How to Earn Crypto Playing Games Online"],"entity":[{"type":"Venezuela","content":"LOCATION"},{"type":"$20","content":"MONEY"},{"type":"Binance Learn","content":"LOCATION"},{"type":"Phemex","content":"ORGANIZATION"},{"type":"$94","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"the Philippines","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jan. 1, 2022","content":"DATE"},{"type":"Earn' Application Stepn Suffers Cyber Attack After Upgrade","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Axie","content":"ORGANIZATION"},{"type":"$650","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$625 million","content":"MONEY"}],"hashtag":["Learn","Beginner","Cryptocurrency"],"authors":["Benedict George"]}