{"summary":"How to earn, store and spend our blockchain-powered answer to loyalty points.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-desk-coindesks-social-token-explained\/","publishDate":"2022-12-09T14:08:04","id":16683,"type":null,"title":"What Is DESK? CoinDesk’s Social Token, Explained","category":["Learn"],"content":["At CoinDesk, we’re not just chronicling the business model transformation that digital assets and the blockchain have made possible – we’re actively participating in it.","At Consensus 2021, a virtual event, we beta-tested DESK, an experiment in using tokenized rewards to incentivize engagement and community-building, garnering positive feedback from our audience. At Consensus 2022, CoinDesk relaunched DESK as a full-fledged on-chain social token, making it a core part of the experience at our first live event since 2019.","In December 2022, CoinDesk expanded the functionality of DESK to integrate the token into the broader user experience. Now, readers can earn DESK by reading articles, watching videos and more on CoinDesk.com.","Read More: DESK Upgrade on CoinDesk’s Website Offers Tokenized Reader Experience","Below is everything you need to know about DESK and how to use it. This post will be updated regularly as we build out the DESK program, so check back every so often for the latest information.","DESK is CoinDesk’s social token.","DESK is designed to build a community around the CoinDesk brand and to reward our audience for engaging with our content.","DESK’s ethos is modeled on the founding principles of blockchain technology: openness, community, empowerment and innovation. We hope to use DESK to create a feedback loop with our users to help us build out an ecosystem together.","As of this update, you can start earning DESK by creating an account at coindesk.com and engaging with our content, such as reading Consensus Magazine articles. Other ways to earn DESK include:","At Consensus 2022, attendees were able to redeem DESK for such rewards as:","DESK runs on Polygon, a sidechain, or parallel network, to Ethereum.","Polygon helps us provide a gasless experience because of the lower costs per transaction.","You’ll need to set up a cryptocurrency wallet that works with Polygon. MetaMask and Coinbase Wallet are the easiest ones to use for beginners.","Read more: Get Started With DESK: How to Set Up Your Wallet","Yes. With the new release in Dec. 2022, you will be required to have a coindesk.com account.","In the Web2 era, content creators – be they writers, artists, filmmakers, publishers, media outlets or event organizers – have become beholden to the algorithms of intermediating platforms, complicating their efforts to directly reach and engage audiences. Simply put, the web ended up replacing one set of gatekeepers (major newspapers, magazines and television networks) with another (social media and search engines).","We’re hopeful, like many others, that crypto and Web3 solutions involving tokens and new data and governance models will facilitate a more direct relationship with our audience and the expansion of a community of engaged participants that is independent of the platforms.","We believe Consensus, which moves the content creator-audience relationship out of the digital realm and into a physical space where internet gatekeepers have less influence, is a great place to experiment with new tokens and incentive models in pursuit of this goal.","We hope DESK generates a community that engages year-round in rich interaction with each other and with CoinDesk articles and other content and then comes back each year to gather in person at this cornerstone annual event.","Social tokens allow for community-driven tech by creating a feedback loop between product creators and product users. This will allow the DESK team to get real-time data on engagement based on DESK usage, and use that data to iterate on the DESK ecosystem, aligning it more and more to user needs and wants.","Initially, the blockchain provides us with data on DESK usage. The blockchain also discourages insider deals or under-the-table giveaways because the public ledger would lay bare any such misbehavior. This means everyone who claims NFTs or physical rewards had to put in the work (engaging with our content) to earn their reward.","Simply put: DESK will be used to align our efforts as a media and events company to the wants and needs of our audience.","No. DESK is not a currency, nor is it a financial asset or investment product of any kind. It is not for speculation and will not make anyone rich. This is not a vehicle for anyone’s savings nor is it a money-making opportunity.","It is a reward token, analogous to airline frequent-flier miles, hotel guest points and the like. CoinDesk will be taking strong measures to discourage its use for speculation or trading.","By providing a system where users can contribute to the functioning of a collective, digital system, the blockchain lays the foundation for a new type of organization: the tokenized community. We've seen examples of this over the past few years with NFT communities and distributed autonomous organizations (DAO). To highlight this blockchain use case, we decided to focus on activating and expanding social utility to create community value, instead of focusing on monetization.","No. DESK can only be earned as a reward for engaging with CoinDesk events and content, or as a tip from fellow users.","No. See above.","No. We're not selling the token at all, just distributing it to audience members as a reward for their engagement.","Listing, buying or trading DESK is against our terms of use because we want the rewards and value to come from inside the ecosystem. We reserve the right to ban accounts and blacklist wallet addresses that violate our terms of use.","It’s important to remember that not all blockchain assets are fully decentralized or claim to be so. Ether, the native currency of Ethereum, is completely user-controlled, but ERC-20 tokens built on top of the network may or may not be, depending on how the issuer designs it. For example, a number of regulated stablecoins are ERC-20 tokens, and their issuers have the power to freeze funds of suspect addresses to comply with law enforcement requests.","So, no, DESK is not decentralized, nor does it purport to be. It is not competing with bitcoin or ether.","Part of the value DESK provides is what CoinDesk injects into the ecosystem when we want to reward our users for engaging at a deeper level. This means being able to use your DESK to redeem food and drinks at establishments that CoinDesk partners with on the ground.","No. The DESK ecosystem is 100% gasless.","CoinDesk is covering the gas costs on Polygon.","Because DESK has transitioned from testnet to mainnet, DESK collected in 2021 is no longer usable. That being said, we value the feedback and effort from DESK's beta testers.","Piranhas are the fledgling community that formed around DESK during Consensus 2021. They started their own Discord channel and created memes about the token. The phenomenon was a clear validation for CoinDesk of the concept.","At Consensus 2022, the official hub of the DESK community was CoinDesk’s Discord server, where we welcomed the Piranhas and newcomers alike.","CoinDesk did, with the help of several key external partners, including Coinvise and others.","As mentioned, MetaMask and Coinbase Wallet are easiest to use, but any wallet that works on Polygon can be used.","Navigate to the DESK dashboard. Select \"Create or Connect Wallet\" and approve the transaction in your wallet.","Depends. CoinDesk can associate identities with wallets only when users create accounts on desk.coindesk.com. We will not use this data for anything other than authenticating users when they sign on or distributing DESK rewards, we will never sell it, and we will protect user information assiduously. (See our privacy policy.) DESK transactions will appear on DESK's page on the Polyscan block explorer, but only the wallet addresses will be displayed.","DESK has no inherent monetary value, but, whether or not you live in a jurisdiction where utility tokens are deemed taxable, you should consult a tax professional if you have concerns.","We’ll keep a record of airdrops, product developments and other updates critical to DESK’s roadmap and tokenomics in our DESK product blog.","You can also keep abreast of DESK updates in our Discord server.","The latest release is only the beginning in developing our Web3 model for DESK on coindesk.com. We'll be working on improving our wallet functionality, currently in beta, and looking forward to seeing what data and reader feedback reveal as to how to continue improving the experience"],"entity":[{"type":"CoinDesk’s Website Offers Tokenized Reader Experience","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"Dec. 2022","content":"DATE"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Token Economy","Rewards","DESK","Learn","industry","Beginner"],"authors":["CoinDesk Staff"]}