{"summary":"The DOJ appears to be confident that a judge will agree with their position on Binance founder Changpeng Zhao's misdeeds – and an appeals court will too.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/29\/why-the-doj-may-have-recommended-a-three-year-sentence-for-cz\/","publishDate":"2024-04-29T13:30:00","id":16688,"type":null,"title":"Why the DOJ May Have Recommended a Three-Year Sentence for CZ","category":["Policy"],"content":["Former Binance CEO Changpeng “CZ” Zhao now faces the genuine possibility of spending three years in U.S. federal prison – well above the possible 18 months laid out in his plea agreement.","Zhao’s sentencing hearing will take place on Tuesday, giving both the U.S. Department of Justice (DOJ) and his defense attorneys a chance to argue over how much prison time he should serve after pleading guilty to one count of violating the Bank Secrecy Act last November. While a plea agreement, which was released in November, gave Zhao the ability to appeal any sentence longer than 18 months, the DOJ asked for 36 in a sentencing memo released last week. The defense asked for house arrest and probation, with no time in prison. The Probation Office recommended five months in its presentence report, according to last week’s defense filing.","By asking for a longer sentence, the DOJ seems to be sending a strong message, said Tama Kudman, a partner with Kudman Trachten Aloe Posner LLP. The DOJ has been trying to tamp down on money laundering via crypto, and Zhao was “pretty flagrant with anti-money laundering rules.”","Read more: Binance's CZ Will Spend Less Than a Year in Prison, Polymarket Traders Bet","“The government wants to make sure these low guidelines don’t give anyone comfort to equally feel free to violate our anti-money laundering initiatives,” she said.","And while the longer sentence may have initially taken the crypto industry by surprise, that doesn’t mean the DOJ is reneging on a firm agreement to only recommend up to 18 months, Kudman said.","“Generally, when we’re negotiating pleas, we’re negotiating things like loss amount and what arguments may be retained by the parties,” she said. “There’s nothing I see in this document that suggests they were limited to the 18 months.”","This cuts both ways: the DOJ kept the ability to argue for a longer sentence than the guidelines suggested, but this is also how the defense can argue for a much shorter sentence than the guidelines suggested, she said.","The DOJ pointed to the volume of funds that flew through Binance without appropriate know-your-customer or anti-money laundering checks in place in its filing.","Zhao’s lawyers have argued – with support from family and friends – that he’s repentant, tried to rectify the situation and won’t be a recidivist, so he shouldn’t serve any prison time at all. Instead, they argued that house arrest and probation would meet the needs of justice.","Either way, the decision now rests with the judge, who has broad discretion. He could accept or reject either party’s arguments about the importance of deterrence and what sort of sentence would sufficiently deter potential future crimes by not just Zhao but other members of the crypto community.","Another attorney, who couldn’t comment publicly on the case, agreed that it’s not unusual for prosecutors to ask for a sentence that diverges from the guidelines calculation.","Former FTX CEO Sam Bankman-Fried is an example of this – the guidelines calculation for his sentence was over 100 years, but prosecutors asked for 50 instead. A judge sentenced him to 25 years in prison.","“It also happens when the guidelines are viewed as not punitive. That’s often the case because the BSA guidelines are relatively low and don’t take into account the aggravating factors,” they said, adding they were not surprised that there was “a flavor of sanctions violation underneath what is formally a BSA charge.”","The biggest example of how Zhao’s hearing may go lies with former BitMEX CEO Arthur Hayes’ case. Like Zhao, Hayes was charged with violating the Bank Secrecy Act and pleaded guilty. Hayes received six months of house arrest and two years of probation from the judge overseeing his case.","While Zhao has the ability to appeal a longer sentence, it would be difficult for him to succeed, the second attorney said. Circuit courts rarely reverse a district court-imposed sentence, even if it’s excessive, they said.","“The parties wanted to be free to recommend whatever they wanted,” Kudman said. “Every negotiation in every case has its own different flavor with different concerns.”","Nor does she think the DOJ acted in bad faith here. If the DOJ hadn’t disclosed its position during plea negotiations, that would be a sign of bad faith.","But here, the DOJ had very little to lose by asking for a longer sentence, the second attorney said, though other attorneys who might be involved in future plea agreements will certainly be paying attention.","The DOJ’s suggestion that Zhao shouldn’t get credit for taking responsibility may come up.","“In some sense, the sophisticated white collar lawyers will track this plea agreement, and they’ll use it in future negotiations, and that’s why it’s [strange] to have such a low figure for a defendant who had a long history,” the attorney said. “That’ll get quoted back to the DOJ.”","Still, Zhao will earn goodwill from the system for coming in, the second attorney said. Part of that is in the plea agreement itself: “The fact he hasn’t pleaded guilty to sanctions violations is an enormous give to him.”","The DOJ-recommended sentence is also still shorter than if Zhao had gone to trial.","Zhao might also receive credit from the judge for those same actions, as well as for abiding by the terms of his bond release – even after they were modified.","“The difference between someone who tries to evade capture and someone who comes in and pleads guilty is night and day, and he’s going to get an enormous amount of credit,” the second attorney said.","Correction (April 29, 2024, 16:35 UTC): Corrects first bullet to note that Zhao cannot appeal a sentence shorter than 18 months.","Edited by Parikshit Mishra."],"entity":[{"type":"Kudman Trachten Aloe Posner LLP","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Hayes","content":"PERSON"},{"type":"April 29, 2024","content":"DATE"},{"type":"BSA","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"U.S. Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Tama Kudman","content":"PERSON"},{"type":"Kudman","content":"PERSON"},{"type":"last November","content":"DATE"},{"type":"Probation Office","content":"ORGANIZATION"}],"hashtag":["Regulations","Binance","Changpeng \"CZ\" Zhao","U.S. Department of Justice"],"authors":["Nikhilesh De"]}