{"summary":"A retail CBDC or an indirect one? Synthetic? An API approach? How central banks implement digital currencies will have seismic implications.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/10\/26\/the-big-choices-when-designing-central-bank-digital-currencies\/","publishDate":"2020-10-26T15:55:19","id":16687,"type":null,"title":"The Big Choices When Designing Central Bank Digital Currencies","category":["Policy"],"content":["","The increased interest in central bank digital currency (CBDC) has led to a surge in ideas and research about the topic, so much so that it’s all but impossible to keep up with everything that’s been published lately. All this information brings a welcome diversity of perspectives to the debate, but it also makes it more difficult to focus on the most important aspects of CBDC.","","","When it comes to designing a CBDC, we need to draw a crucial distinction between direct and indirect CBDCs. ","","","In simple terms, a direct CBDC makes it possible for everybody, from big banks to informal workers, to deposit their money with the central bank. It would be like having a central bank “checking account” for basic payment services: receiving, holding, spending and transferring money.","","","This direct model tends to raise concerns, though. In times of crisis, people could move their money from banks to the central bank, creating bank runs that would worsen the trouble. Even in normal times, if a significant number of bank deposits moved to the central bank, banks would lose a cheap source of funding and might have trouble providing as much credit as demanded. This situation could, in turn, hamper economic growth.","","","Other critics say payment services directly offered by the central bank can only be as good as the services provided by a Department of Motor Vehicles – hardly a compliment. These critics add that a direct CBDC would kill payments innovation, as government institutions are not known for boundless creativity. ","","","To avoid displacing banks and stifling innovation, central bankers and scholars have been exploring models of indirect CBDC.","","","Take, for example, the so-called two-tiered CBDC. In this model, a CBDC is issued to regulated and supervised institutions, which then distribute the CBDC to the public. Don’t we already have that? Most dollars circulating in the economy today are digital and made available through regulated intermediaries: the balances from bank accounts that we use to make payments and transfers. ","","","Consider now the synthetic CBDC, or sCBDC. The idea is that licensed private entities are authorized to issue “digital dollars” fully backed by central bank reserves, a type of central bank money used in transactions between banks and with the central bank. The sCBDC would certainly be a safe and stable type of money, but would it be a CBDC?","","","The synthetic CBDC looks a lot like e-money (aka prepaid debit cards) or its evil twin, the stablecoin, which is nothing but unregulated e-money. E-money issuers in the European Union, for example, are licensed and supervised institutions that are legally required to safeguard the funds of their clients, so that e-money balances can always be redeemed at their nominal value.   ","","","See also: Marcelo M. Prates - 4 Myths About CBDCs Debunked","","","The similarities are even more striking in Brazil, where e-money issuers can keep users’ funds deposited directly with the central bank. The Brazilian legal framework also requires these funds to be kept segregated from the issuer’s own funds to protect users if the payment provider goes bust.","","","Indirect CBDCs are, thus, far from a tempting option. Most models of indirect CBDCs are not offering anything new; some should not even be considered CBDCs. It seems that we’re trying to find a recipe for making a monetary omelet without breaking eggs.","","","The question about direct and indirect CBDCs is, in fact, a question about balance sheets. It’s all about defining whether the digital money you own is an entry in the central bank’s balance sheet or whether it appears in the balance sheet of an intermediary.","","","Balance sheets are for digital money what safes and vaults are for banknotes and coins: a place where you can put your money to keep it safeguarded. Today, only banks and some selected financial institutions can park their spare money in the huge vaults and balance sheet of the central bank. For the rest of us, the typical option is to keep our money in the vaults and balance sheets of commercial banks.","","","Why does this difference matter? Because the balance sheet of the central bank is the only one that never runs dry. If our digital money is deposited with the central bank, we know that, apart from political unrest or rampant inflation, we’ll always be able to save, spend, or transfer our money with minimal risks. ","","","Can’t we find a way to preserve the benefits of a direct CBDC while reducing its downside? Yes, we can. A good example is the platform model proposed by the Bank of England earlier this year (not the so-called hybrid model).","","","In this model you still find intermediaries between the central bank and the public. However, these intermediaries are not offering a balance sheet to hold people’s digital money. They provide instead technological tools to help any person or business connect with the central bank and access the digital money kept there.","","","In short: the platform model combines indirect connection to the central bank with direct access to the central bank balance sheet and the CBDCs.","","","This type of CBDC could promote innovation and boost public-private collaboration in the monetary system. The central bank would continue to be responsible for the monetary infrastructure, making the payment system work and setting money accounts for everyone, not just banks. This  would also make the distinction between “wholesale” and “retail” CBDC redundant: it would be the same CBDC for all.","","","More than that, the central bank would have to ensure that this infrastructure is not only safe and resilient but neutral and open. The goal should be to allow different types of software that meet performance and security requirements, the “application programming interfaces” (APIs), to access the payment system’s data and functionality.","","","APIs are like clever personal assistants who speak multiple languages and can easily perform common tasks. You may not know how to send a message in French for one of your customers living in Dubai. But you call your PA and, a couple of minutes later, the right customer receives the message written in proper French in her house. That’s similar to what APIs do when you use a fintech app to check the balance in your bank account or to initiate a payment. ","","","With the backend at the central bank, private parties, from banks to fintech and big tech firms, would take care of the front end: the “customer relations.” These private parties could offer all kinds of APIs and interface platforms to help persons and businesses plug into their central-bank accounts and use CBDCs from their cell phones, computers or other devices.","","","This technology already exists and is being used in jurisdictions that have adopted the initiative known as “open banking,” including the European Union, the U.K., Australia and, soon, Brazil. Under open banking rules, banks have to share, usually through APIs, customer information with other payments and financial services providers if the customer so chooses. ","","","Any central bank could opt for this technological arrangement to start issuing CBDC soon enough, an initiative that could be called “open central banking.” But how would this platform model affect credit creation?","","","On the one hand, the central bank should not offer credit products, not even overdraft, for its new “customers.” Financial intermediation and credit allocation would remain with financial institutions so that central banks avoided giving up their role as monetary authority to become development banks.","","","See also: Marcelo M. Prates - Digital Dollars Can Reduce Unemployment, Here’s How","","","On the other hand, if banks lost much of their deposits to the central bank, they would have to find other sources of CBDC to fund lending operations. That is why banks, under the platform model, would be able to borrow CBDC from the central bank against a broader range of collateral, and for longer periods.","","","The additional CBDC liquidity would provide banks with stable and inexpensive funding that could be used to meet the demand for credit in the economy, thus avoiding credit freeze and spikes in interest rates. As an incentive, especially in times of crisis or persistent deflation, favored borrowing conditions based on the volume of bank loans to specific segments, like small businesses or green projects, could apply.","","","Again, this is nothing new in central banking. The European Central Bank has been offering targeted longer-term refinancing operations since 2014. The TLTROs, as they are known, allow banks that lend more to non-financial corporations and households to borrow more and at a lower interest rate from the ECB.","","","In light of all that, let us not dismiss direct CBDCs too quickly. If properly designed, they may well be the most promising option for a CBDC, if not the only one that can bring real change to the monetary system.",""],"entity":[{"type":"2014","content":"DATE"},{"type":"Department of Motor Vehicles –","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"PA","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"Digital Dollars Can Reduce Unemployment","content":"ORGANIZATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"}],"hashtag":["Opinion","CBDCs"],"authors":["Marcelo M. Prates"]}