{"summary":"Cryptocurrency and blockchain technology rely on consensus mechanisms to function and be trusted by users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-consensus-mechanism\/","publishDate":"2022-05-16T20:57:37","id":16690,"type":null,"title":"What Is a Consensus Mechanism?","category":["Learn"],"content":["The blockchain is a distributed database that records data and allows users to exchange and store value in the form of cryptocurrency. To coordinate and maintain such a decentralized system, the participants must agree on the correct condition of the system and who owns what at any time.","A consensus mechanism is the standardized way of how the blockchain’s nodes – the computers that run the blockchain and keep the records of all transactions – reliably reach this agreement.","Read more: What Is a Node?","The goal of a consensus mechanism in the world of crypto is to prevent bad actors from deliberately cheating. The classic example of cheating in the world of crypto is “double-spending.”","Suppose Anthony, the bad guy in this scenario, tries to cheat by transferring 10 tokens to Bethany and then trying to transfer the exact same 10 tokens to Chris. The challenge is to make sure everyone can always know and agree on who owns which tokens. With that agreement, or consensus, Chris would already know that Anthony no longer owns the tokens he is proposing to send.","To “double-spend,” a bad actor would need to get the nodes to adopt a false history of the transactions, a narrative where the bad actor has not spent the tokens and given them to Bethany.","Consensus mechanisms solve the double-spending problem by making it expensive and difficult to propose a new block of validated transactions, discouraging bad actors from trying.","Simultaneously, the mechanisms incentivize the \"good\" nodes to propose blocks they genuinely believe will be accepted in order to receive valuable rewards. As long as there are more good actors than bad actors, Anthony will not be able to change the records on the blockchain to falsify his transaction with Bethany.","Read more: What Is a 51% Attack?","The huge number of crypto projects out there have explored a variety of different consensus mechanisms.","The two most widespread consensus mechanism are:","An underlying factor to the design of both is to make it extremely expensive to undermine the consensus mechanism in place. The difference between them is how they achieve it.","In the case of Proof-of-Work blockchains such as Bitcoin, consensus requires a significant amount of energy, hardware and computing power to propose a new group of transactions – called a block – to the ledger.","The nodes that validate transactions and propose new blocks are called miners. Miners compete to generate a random number to unlock the next block on the chain. The quickest miner to reach that number adds the next block and in exchange for the effort it receives a block reward. The only way to win is to generate random numbers as quickly as possible (the \"work\" in the name) and get lucky. That is a contest of computing power, which in turn requires hardware and electricity.","When it comes to Proof-of-Stake blockchains, the nodes – often referred to as validators – that verify transactions and propose new blocks are required to lock up a certain amount of value in the form of the blockchain’s native token – that’s their stake in the system. The more value a validator deposits, the bigger chance they have to propose a new block and earn the block reward. If a validator commits an error, it has to pay a fee or can be excluded from the validation.","Read More: What Is Staking?"],"entity":[{"type":"Bethany","content":"PERSON"},{"type":"Bethany","content":"LOCATION"},{"type":"Anthony","content":"PERSON"},{"type":"Chris","content":"PERSON"},{"type":"51%","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Learn","Beginner","Technology"],"authors":["Benedict George"]}