{"summary":"In this week's issue of Crypto for Advisors, Dawood Khan from Alix Partners discusses how on-chain analytics bring transparency to blockchain and cryptocurrency transactions.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/11\/16\/crypto-for-advisors-cryptocurrency-transparency-truths-vs-myths\/","publishDate":"2023-11-16T16:45:00","id":16696,"type":null,"title":"Crypto for Advisors: Cryptocurrency Transparency Truths vs. Myths","category":["Finance"],"content":["Benefits of blockchain technology include trust, transparency and traceability, alongside many other performance improvements. Yet the misconception that crypto is used primarily for money laundering still prevails. Based on publicly available data, there’s been a record increase of 237% of bitcoin wallet holders with over $1 million in them - talk about transparency.","This week, Dawood Khan from Alix Partners looks at on-chain analytics, tracing tools and just how much illicit activity leverages crypto and discusses why advisors should learn about blockchain technology.","Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Growing interest in cryptocurrencies is fueling the market","Cryptocurrencies have attracted a wide range of interest from individuals to start-ups exploring the uses of blockchain technology, and some companies are allocating a portion of their balance sheet into assets like bitcoin. However, the latest buzz has been all about the possibility of the SEC allowing spot bitcoin ETFs to trade in the U.S. by early 2024. While Canada has had bitcoin ETFs for a few years and Europe recently launched its first ETF, the U.S. market represents a significantly larger market. This opens the door for large financial institutions to enter; some of the initial ETF applicants include BlackRock, VanEck, Fidelity and Franklin Templeton. Outside of the ETF buzz, we’ve seen financial institutions such as JPMorgan experiment with the technology, namely using a “forked” version of Ethereum known as Quorum (later sold to ConsenSys). Now JPMorgan is reportedly exploring blockchain-based deposit tokens to speed up cross-border payments and settlement.","Cryptocurrencies, and the now-adopted term “digital assets,” mean different things to different people. A good way to start is to understand how the technology and the digital assets can be of benefit. As there are a plethora of online pundits, careful assessment of educational sources is important. Reputable programs are available online through the professional bodies such as the CIO Association and universities including MIT and Cornell.","Some types of digital assets are best suited to enable transactions, such as stablecoins, which provide a stable value representation pegged to a particular fiat currency. They are a way to access the global financial system. In developing countries, access to dollar-denominated assets can be a literal life saver. Some use them for daily payments, while others simply want to preserve their wealth.","Others view certain digital assets as an investment opportunity. For instance, Fidelity Digital Assets recently revisited its analysis of bitcoin, highlighting the difference between the broader “crypto token” ecosystem and bitcoin’s emergence as the go-to digital asset.","On the ultra-bull end of the spectrum you have those like Michael Saylor and his company MicroStrategy which adopted their “bitcoin strategy” in 2020, using cash flows and debt to purchase bitcoin for their balance sheet. MicroStrategy have radically outperformed the market since then.","Skepticism exists – some rightly placed and some misinformed","Unfortunately, what gets a lot of attention is the perception that cryptocurrencies are easy to use for criminal and illicit activity due to its perceived anonymity and difficulty in tracking the culprits. Other concerns include regulatory uncertainty, cryptocurrency price volatility, and the ecosystem’s disruption from multiple bankruptcies. There have been allegations and convictions for fraud, ponzi schemes and misappropriation of funds.","You may have seen news stories about dark web criminals and hackers wanting payment in bitcoin or other types of crypto. These reports have contributed to the perception that cryptocurrency is seen as a haven for criminals or terrorists. However, if we look at an analysis of criminal activity conducted by Chainalysis, illicit activity represented 0.24% of all crypto transactions in 2022. For perspective, the total market cap of cryptocurrencies is approximately $1.3 trillion as of Q4 2023. The UN’s Office on Drugs and Crime estimates the amount of money laundered in one year at around 2-5% of global GDP, or $800 billion-$2 trillion – more than the entire market cap of all crypto assets.","This is not to say that crime doesn’t take place. It does, according to Chainalysis, and in 2022, criminal activity represented $20 billion in illicit activity including use of crypto by sanctioned entities, scams and stolen funds.","While criminals use sophisticated approaches, tracking is possible","Although blockchain transactions are pseudo-anonymous, they are also recorded as part of the transaction on an end-to-end, fully traceable audit trail, captured on a permanent immutable ledger of transactions. Cryptocurrency transactions recorded on the ledger are uniquely identifiable, which allows investigators to track relationships between certain addresses, wallets, and entities. These relationships can be used by investigators to identify ties to regulated “on-ramps” to reveal connections to real-world entities. For major networks like Bitcoin and Ethereum, a sophisticated and rapidly-improving on-chain surveillance regime is emerging which has, and will continue to, root out bad actors.","Tracing assets is both a science and an art that continues to be perfected through the use of tools created by companies such as Chainalysis, Elliptic, TRM Labs and CipherTrace. Specialists use these tools to analyze and track transactions to trace cryptocurrencies leveraging the benefits of on-chain data to understand the full picture.","Last year, Axie Infinity’s (a popular metaverse gaming platform) Ronin bridge, used to transfer digital assets to the chain, experienced one of the largest crypto-hacks where $615 million were stolen in ether (ETH) and USDC stablecoin, with U.S. authorities linking the heist to the North Korean hacking group Lazarus Group. The culprits first exchanged the USDC stablecoins into ETH through decentralized exchanges (DEX), which typically do not conduct Know-Your-Customer\/Anti-Money-Laundering (KYC\/AML) compliance checks. Centralized exchanges coming under regulatory scrutiny have started to do these over the last few years. Interestingly enough, as shown in the graph, they then started to launder $16.7 million in ETH through three centralized exchanges. However, as the centralized exchanges started to collaborate with law enforcement, the culprits moved to using Tornado Cash a decentralized mixer, that was later sanctioned by U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC), and lost it’s appeal on the validity of the sanction in court. According to Elliptic, “Elliptic investigators are tracking these stolen funds and have labelled the addresses associated to this attacker in our systems.”","The graph from Elliptic Investigator shows how complex on-chain activity can be analyzed and tracked. In this case, it shows how the Lazarus Group laundered stolen funds following the Ronin Hack (Source: Elliptic)","According to Kevin Madura of AlixPartners, “criminal elements are beginning to realize that blockchains provide a goldmine of intelligence information and are actually the worst place to conduct illicit activity. Investors should understand that the characteristics of networks like bitcoin, and the ecosystem surrounding it, actually benefit good actors.”","From retail investment to institutional and corporate interest - On-chain Tracking is crucial for investor protection","In conclusion, the growing interest in cryptocurrencies, particularly in the context of potential SEC approval of spot bitcoin ETFs in the US, will continue to attract bad actors and hackers, and on-chain tracking is a critical part of protecting investors. However, it's important to note that, despite concerns about illicit activities, the percentage of criminal activity in crypto transactions is relatively small.","Moreover, while cryptocurrencies are often associated with illicit activities due to their pseudo-anonymity, the reality is that these transactions are recorded on an end-to-end, fully traceable and immutable ledger that provides a built-in audit trail. This allows for the possibility of tracking relationships between certain addresses, wallets, and entities, making it far easier to trace illicit activity across the entire transaction chain. This is made possible through the blockchain record itself and enhanced by on-chain analysis tools.","Given the ever-evolving nature of blockchain technology, a dynamic cryptocurrency market and regulations - it is critical that advisors and investors invest time in learning and understanding what looks to be the emerging future of global finance, trade and commerce.","– Dawood Khan, AlixPartners","Q: Can chain analytics add to the security of a network?","Yes. A common misconception is that crypto is completely anonymous and therefore perfect for criminals to move money in a permissionless manner without worrying about KYC\/AML banking rules. The truth is that users are pseudonymous, meaning that once an address is associated with a person their entire transaction history can be revealed. So chain analytics can be used to work backward from a known address to build a history of known activity. Further, because anyone in the general public can access on-chain data it actually makes it harder to keep illegal money movement on the down low. There are countless people looking at on-chain data at any given moment. Many do it as a hobby and post their findings on X (Twitter). With so many eyes around the world monitoring on-chain data it makes it harder for illegal activities to fly under the radar and adds security to the network.","Q: What meaningful data can be gathered from on-chain analytics?","As managers investing on behalf of clients, we are constantly monitoring on-chain analytics to ensure we are making informed decisions. You can gather a lot of useful, actionable information with on-chain analytics. For example, you can look at unique wallet addresses. If this is growing rapidly it could mean that adoption of the project is picking up. You could also look at wallet activity if there are a lot of transactions, addresses sending crypto back and forth, it could indicate that the project has a meaningful user base and it is not solely being traded on centralized exchanges. You can also see what percentage of the supply of a token is held by the largest wallet addresses. This is important because the main ethos of crypto is decentralization and giving autonomy to its users. However if a project’s tokens are more or less held by a few large wallets then this leads to a centralization that allows a few whales to manipulate, price, rewards, governance, etc. These are just a few examples. Analysis of this data is constantly evolving and new, meaningful relationships, ratios, and statistics are being discovered and tracked. And since this is done on public ledgers, anyone with an internet connection can do their own analysis. – Bryan Courchesne, CEO, DAIM","BlackRock files for another crypto spot ETF, this time ETH according to a Nasdaq filing.","Chainalysis 2023 Global crypto report shows that over 24% of global activity happened in North America.","More mythbusting, the top bitcoin myths by Investopedia.","Edited by Bradley Keoun."],"entity":[{"type":"Investopedia","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Alix Partners","content":"ORGANIZATION"},{"type":"Bryan Courchesne","content":"PERSON"},{"type":"Elliptic","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$800 billion","content":"MONEY"},{"type":"VanEck","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Dawood Khan","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"UN’s Office","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"CIO Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"0.24%","content":"PERCENT"},{"type":"237%","content":"PERCENT"},{"type":"S.M.","content":"LOCATION"},{"type":"$16.7 million","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"$20 billion","content":"MONEY"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Kevin Madura","content":"PERSON"},{"type":"$2 trillion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"CipherTrace","content":"ORGANIZATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"AlixPartners","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$615 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Institutional Adoption","Spot etf","Bitcoin ETF","SEC","illicit finance","Analytics"],"authors":["Sarah Morton","Dawood Khan"]}