{"summary":"Solana-based blockchain game MixMob announced it has licensed the rights to use the faceless stormtrooper character made famous by the Star Wars film franchise.\nMixMob said the move is the beginning of an “official licensing strategy, with plans to secure three additional licenses in 2024.”","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279681\/star-wars-iconic-stormtrooper-joining-solana-powered-crypto-game-mixmob","publishDate":"2024-02-29T07:01:06","id":167,"type":null,"title":"Star Wars&#x27; iconic stormtrooper joining Solana-powered crypto game MixMob","category":["Gaming"],"content":["<span data-v-f87c67ca=\"\">MixMob, creator of an eponymous <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.20%\n    <\/span><\/a> <!----><\/span><\/span>-based blockchain racing game, announced it has licensed Star Wars' iconic stormtrooper.&nbsp;<\/span>","The game-maker, which has been backed by investors like Solana Ventures and Arthur Hayes, said the licensing of the popular movie character serves as \"<span data-v-f87c67ca=\"\">the initiation of MixMob's official licensing strategy, with plans to secure three additional licenses in 2024.\"<\/span>","<span data-v-f87c67ca=\"\">MixMob is a web3<\/span> racing game that bills itself to be a mix of \"Clash Royale and Mario Kart.\"","\"<span data-v-f87c67ca=\"\">Embracing the essence of remix culture, MixMob is set to revolutionize the mobile gaming landscape by integrating the original stormtrooper into its debut card racing game, MixMob: Racer 1,\" the company said in a statement.<\/span>","The game is currently only available on desktop, but there are plans to launch MixMob on mobile devices during the second quarter of this year, the company said in its statement.","MixMob is led by CEO <span data-v-f87c67ca=\"\">Simon Viera, who previously worked at Electronic Arts, according to his LinkedIn profile. \"Our vision is to create dynamic teams and factions that rally under the banner of the original stormtroopers, transforming them into symbols of unity and competition within the game,\" he said in the statement.<\/span>","The company raised $7 million about two years ago, according to a <a href=\"https:\/\/mixmoborigin.medium.com\/mixmob-raises-7-million-in-latest-seed-funding-round-7589cc2fe75b\" data-v-f87c67ca=\"\">MixMob post<\/a>."],"hashtag":["GAME","TRADING CARD GAMES"]}