{"summary":"Web3 represents the next generation of the internet, one that focuses on shifting power from big tech companies to individual users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-web-3-and-why-is-everyone-talking-about-it\/","publishDate":"2022-08-18T14:14:29","id":16708,"type":null,"title":"What Is Web3?","category":["Learn"],"content":["Web3 – also known as “Web3″ or “Web 3.0″ – is a term you may of heard thrown around a lot lately. It simply refers to the next iteration of the internet that promotes decentralized protocols and aims to reduce dependency on large tech companies like Youtube, Netflix and Amazon. But what is it, and why is it on everyone’s minds?","To understand Web3, it makes sense to understand what came before. The first version of the Internet – known as Web1 – arrived in the late 1990s and comprised a collection of links and homepages. Websites weren’t particularly interactive. You couldn’t do much apart from read things and publish basic content for others to read.","Brian Brooks, the CEO of Bitfury, put it smartly in a speech to the U.S. Congress in December 2021: “If people remember their original AOL account, it was an ability to look in a curated ‘walled garden’ at a set of content that was not interactive, but was presented to you on AOL, the way that Time Magazine used to show you the articles they wanted you to see inside of their magazine, just you could see it on a screen.”","Web2 came next. Some people call this the “read\/write” version of the internet, in reference to a computer code that lets you both open and edit files rather than just view them. This version of the Internet allowed people to not only consume content, but create their own and publish it on blogs like Tumblr, Internet forums and marketplaces like Craigslist. Later, the emergence of social media platforms including Facebook, Twitter and Instagram took content sharing to new heights.","After a while, the general public became cognizant about the way their personal data was being harvested by tech giants and used to create tailored advertisements and marketing campaigns. Facebook, in particular, has had the spotlight shone on it innumerable times for breaching data privacy laws and was hit with a $5 billion fine in 2019 – the largest penalty ever issued by the Federal Trade Commission (FTC.)","Although Web2 has brought the world amazing free services, a lot of people have grown tired of the new “walled gardens” these huge tech companies have created and want to have more control over their data and content. This is where Web3 comes in.","Web3 can be understood as the “read\/write\/own” phase of the Internet. Rather than just using free tech platforms in exchange for our data, users can participate in the governance and operation of the protocols themselves. This means people can become participants and shareholders, not just customers or products.","In Web3, these shares are called tokens or cryptocurrencies, and they represent ownership of decentralized networks known as blockchains. If you hold enough of these tokens, you have a say over the network. Holders of governance tokens can spend their assets to vote on the future of, say, a decentralized lending protocol.","Again, here’s Brooks: “The real message here is that what happens on the decentralized internet is decided by the investors versus what happens on the main internet is decided by Twitter, Facebook, Google and a small number of other companies.”","Web3 makes the proliferation of cooperative governance structures for once-centralized products possible. Anything at all can be tokenized, whether it’s a meme, a piece of art, a person’s social media output or tickets to Gary Vee’s conferences.","A great example of the paradigm shift is in the gaming industry. Gamers grumble endlessly about the bugs that developers leave in their favorite video game, or how the latest patch has upset the balance of their favorite weapon. With Web3, gamers can invest in the game itself and vote on how things should be run. Large Web2 companies, like Meta and Ubisoft, are creating virtual worlds powered in part by Web3. Non-fungible tokens (NFTs) will also play a huge role in reshaping the gaming industry by allowing players to become the immutable owners of the items they accrue.","Cryptocurrencies are a key component of the Web3 ecosystem.","One of the core ideas of Web3 as laid out by the Ethereum Foundation is that “Web3 has native payments: it uses cryptocurrency for spending and sending money online instead of relying on the outdated infrastructure of banks and payment processors.”","Within Web3, the idea of ownership of assets is key, and cryptocurrencies not only serve as a medium of exchange, but also allow for a “token economy,” where users can earn cryptocurrencies for contributing to a platform, arguably fostering a more equitable internet. Cryptocurrencies provide the financial infrastructure and incentive mechanisms that underpin Web3.","Finally, cryptocurrencies provide a direct, trustless method of payments and exchange and remove the third party control that Web3 strives to eliminate.","Read More: What Are Web3 Cryptos?","Non-Fungible Tokens (NFTs) are another key component of Web3. NFTs are unique digital assets that are stored on a blockchain. Unlike crypto, every NFT has a distinct value and contains specific information that makes it unique.","NFTs enable the ownership and exchange of digital goods, such as digital art, music and even virtual real estate. NFTs provide a way to prove ownership and authenticity of digital content, which was not possible in the Web2 model. By allowing creators to tokenize their work, NFTs are democratizing the digital economy, arguably giving economic power back to creators and users, which aligns with the principles of Web3. Finally, NFTs can also allow players of games to own their in-game items such as outfits, weapons and other cosmetics, which they can then trade directly with other players without third-party intervention.","Read More: What Are NFTs and How Do They Work?","The metaverse refers to a collective virtual shared space, which may or may not have Web3 elements. People often refer to games like Roblox or Minecraft as Web2 metaverses. What separates the Web3 version of these virtual worlds is the inclusion of NFTs and blockchain as an essential part of the world.","The inherent decentralization of Web3 enables a metaverse where users have true ownership over virtual assets, identities and data. These virtual assets, often taking the form of non-fungible tokens (NFTs), can be bought, sold or traded on a blockchain directly.","Read More: A Crypto Guide to the Metaverse","The main criticism of Web3 technology is that it falls short of its ideals. Ownership over blockchain networks is not equally distributed but concentrated in the hands of early adopters and venture capitalists. A public spat recently erupted on Twitter between Block Inc. CEO Jack Dorsey’ and various venture capitalists over Web3, bringing this debate to the forefront.","At the heart of the critiques is the idea of “decentralization theater,” where blockchain projects are decentralized in name but not in substance. Private blockchains, VC-backed investments, or decentralized finance (DeFi) protocols where just a few people hold the keys to hundreds of millions of dollars are all examples of decentralization theater.","And despite the supposedly leaderless community of protocols, there are clear figureheads. Izabella Kaminska, the outgoing editor of the FT blog Alphaville, pointed to the huge amount of power that Vitalik Buterin, the co-founder of Ethereum, continues to have over the network, even though he’s no longer involved in its development:","“Vitalik is a funny and contradictory phenomenon in his own right. He operates as the spiritual leader of a de facto headless system, while holding incredible sway and influence over the headless system he created and oversees,” Kaminska told The Crypto Syllabus.","Things aren’t much better within decentralized finance protocols. They’re rife with voter absenteeism, often rely on centralized infrastructure and the barrier to entry in creating them is still high, given that creating blockchains seems to be arcane magic reserved for only the most highly specialized engineers.","But despite its problems, Web3 has a lot of potential. Whether it’s too idealistic to put into practice will be something that everyday users will discover over the next decade."],"entity":[{"type":"Izabella Kaminska","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Block Inc","content":"ORGANIZATION"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"1990s","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Brian Brooks","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Federal Trade Commission (FTC","content":"ORGANIZATION"},{"type":"Time Magazine","content":"ORGANIZATION"},{"type":"AOL","content":"ORGANIZATION"},{"type":"The Crypto Syllabus","content":"ORGANIZATION"},{"type":"Crypto Guide","content":"ORGANIZATION"},{"type":"Facebook","content":"LOCATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Gary Vee","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"Brooks","content":"PERSON"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Kaminska","content":"PERSON"},{"type":"Metaverse","content":"LOCATION"},{"type":"Ubisoft","content":"ORGANIZATION"}],"hashtag":["Cryptocurrency","Beginner","Learn"],"authors":["Robert Stevens"]}