{"summary":"PancakeSwap is a quick and cheap decentralized exchange.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-pancakeswap-heres-how-to-start-using-it\/","publishDate":"2022-04-21T19:24:48","id":16709,"type":null,"title":"What Is PancakeSwap? Here’s How to Start Using It","category":["Learn"],"content":["The explosion of decentralized finance (DeFi) has unlocked new financial iterations that revolve around autonomy, speed and inclusion – a combination lacking in the traditional financial realm.","This is especially true for the budding decentralized exchange (DEX) sector, where users increasingly engage with autonomous markets anchored by blockchain technology.","A prime example of such a market is PancakeSwap, the BNB Chain (formerly Binance Smart Chain) variant of decentralized exchanges like UniSwap (UNI) and SushiSwap (SUSHI).","In this guide, we will explain the workings of PancakeSwap and discuss some ways you can start utilizing its features.","PancakeSwap is a decentralized exchange native to BNB Chain. In other words, it shares some similarities with established platforms like UniSwap in that users can swap their coins for other coins without the input of middleman services.","The only difference is that PancakeSwap focuses on BEP20 tokens – a specific token standard developed by Binance.","The BEP20 standard is essentially a checklist of functions new tokens must be able to perform in order to be compatible with the broader Binance ecosystem of dapps, wallets and other services.","For those unfamiliar with the workings of decentralized exchanges, they use a special system known as an automated market maker (AMM) so the entire process does not require order books or a single, intermediary company to facilitate trading.","In essence, there is no need for an order matching system since traders trade against liquidity pools instead of counterparties. A liquidity pool in this context refers to funds deposited by investors – which can be anyone from around the world – into smart contracts for the aim of providing liquidity to traders.","With this system, buyers do not have to wait to be matched with sellers, or vice versa. Whenever someone wants to trade one token for another, they simply deposit the token they have into the pool and withdraw the other token they wish to receive.","For instance, if you want to change a particular BEP20-based token, say ALPHA to BNB on PancakeSwap, all you need to do is find an ALPHA\/BNB pool that has sufficient liquidity (meaning there’s enough tokens inside the pool to facilitate your trade).","Then, you would need to deposit your ALPHA tokens and automatically receive an amount of BNB based on the most recent exchange rate.","That said, PancakeSwap is not just for traders. You can also take up the role of a liquidity provider (that is, you can deposit tokens in a liquidity pool for the chance of earning a share of trading fees paid by those trading against the pool in question).","Yield Farming is another income-generating opportunity available on PancakeSwap. With this, you can farm for a token called CAKE (more on this later).","There is also the possibility of winning the lottery when you accurately guess a winning set of numbers. We will take a look at all of these services and features in the next section.","Read More: What Is Yield Farming? The Rocket Fuel of DeFi, Explained","The first thing you need to do before using PancakeSwap is to create a wallet compatible with BNB Chain.","Some of the available options are:","You can also use MetaMask, even though you may need to configure your MetaMask wallet so that it can start working with BNB Chain-based decentralized apps like PancakeSwap.","You can do this by accessing the Settings menu on MetaMask. From here, locate the Networks option and click on Add Network in the top right corner of the page. Once you have done this, you will be navigated to a page where you can fill in the following parameters:","Network Name: BNB Chain","ChainID: 56","Symbol: BNB","Block Explorer URL: https:\/\/bscscan.com","By doing so, you have successfully connected your MetaMask wallet to the mainnet version of BSC.","After connecting your wallet to BNB Chain, you can start interacting with dapps like PancakeSwap and add liquidity to one of the pools on the platform.","To do this, connect your wallet to PancakeSwap. You can do this by clicking on Connect Wallet at the top right corner of PancakeSwap’s homepage.","Once your wallet is connected, click on the Trade menu and select Liquidity. On the Liquidity page, select Add Liquidity and choose the token pair you wish to deposit. Note, you will need to deposit both tokens into the pool at a predetermined ratio.","You will then be required to sign the transaction from your wallet (which is free to do).","Thereafter, you will receive liquidity provider (LP) tokens indicating your share of the liquidity deposited in the chosen pool.","Now you have LP tokens, you can take advantage of your holding by depositing them in a “farm” to earn CAKE tokens – the native cryptocurrency of the PancakeSwap platform. Farms are essentially LP staking pools, and allow you to earn additional interest on your holdings.","Below are the steps you need to take to farm on PancakeSwap.","It is possible to compound your earnings by staking your CAKE token on the platform’s Syrup pools. To do this, click on Pools on the Earn drop-down menu. Here, you will find the pools available, the annual percentage yield (APY) of each and the total amount staked.","First, you need to select one of the pools. Then, you can activate CAKE staking on your wallet by clicking the Enable button. Next, enter the amount of CAKE you want to stake and click Confirm. Depending on the pool you have chosen, your earnings can be harvested and re-staked in the same pool automatically.","Breaking all of this down, here’s how a typical yield farming strategy might look on BNB Chain.","As you can see, by depositing two tokens and taking advantage of several staking pools you’re able to maximize your potential returns with multiple yields.","There is another service on PancakeSwap that promises passive income, called a “lottery.” However, unlike the products highlighted so far, this is more like gambling, as you need to guess a winning four-digit combination made up of numbers between 1 and 14. An example is 2-8-10-14.","When you buy a ticket, the system will auto-generate a random combination for you. At the end of the lottery session, you will emerge as the winner and receive 50% of the lottery pool if your combination matches the winning ticket. Note that the positions of the numbers are also considered.","But what if your ticket does not match the winning tickets? Well, you can still earn rewards if two or more numbers in your winning ticket match the numbers on the winning ticket. However, they must be in the same position as the numbers on the winning combination.","On PancakeSwap, there is also the opportunity to trade BNB Chain-based non-fungible tokens (NFTs). To list your own NFTs on PancakeSwap, all you need to do is apply by filling out this form.","Read More: How to Stay Safe in DeFi"],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"ALPHA\/BNB","content":"ORGANIZATION"},{"type":"Rocket Fuel of DeFi","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":["Learn","DeFi","Intermediate"],"authors":["Andrey Sergeenkov"]}