{"summary":"Judge William H. Orrick is scheduled to hear the matter on June 12.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/10\/kraken-asks-court-to-dismiss-sec-claims-to-avoid-significant-reordering-of-us-financial-structure\/","publishDate":"2024-05-10T06:53:02","id":16713,"type":null,"title":"Kraken Asks Court to Dismiss SEC Claims to Avoid 'Significant Reordering' of U.S. Financial Structure","category":["Policy"],"content":["Crypto exchange Kraken has asked a U.S. court to dismiss the claims brought against it by the U.S. Securities and Exchange Commission (SEC) to avoid a \"significant reordering\" of the U.S. financial regulatory structure, according to court filings submitted in the Northern District of California on Thursday.","The SEC initially sued Kraken last November, alleging it did not register as a broker, clearinghouse or exchange. This was months after settling charges over Kraken's former staking service.","In February 2024, the crypto company moved to kick out the SEC's lawsuit. It argued that cryptocurrencies – at least, those listed in the SEC's complaint – should be treated like commodities and not securities, CoinDesk reported earlier.","Last month, the SEC filed a 39-page opposition to Kraken's motion to dismiss in which it said \"it is simply not the case that this enforcement action exceeds the authority Congress granted the SEC.\"","\"The SEC was created by Congress to enforce the Securities Act and Exchange Act, including the requirement that securities intermediaries register with the SEC,\" the filing from April said. \"In applying the Howey test in its determination that Kraken must register, the SEC is simply following its Congressional mandate.\"","The SEC further argued that it is not \"assuming new powers\" and Congress does not need to \"enact bespoke laws to each new technology that emerges.\"","Kraken's latest reply to the SEC's motion to dismiss hinges on the extent to which one can interpret the SEC's jurisdiction by using the Howey test which determines what is and is not a security. It does so by determining whether four criteria are met - an investment of capital, in a common enterprise, with the expectation of profit, driven by the efforts of others.","\"The SEC cannot satisfy Howey’s additional requirements that there be investments of money in a common enterprise with a reasonable expectation of profits based on the efforts of others,\" Kraken's lawyers wrote. \"This would gut Howey by significantly expanding the SEC’s jurisdiction to a host of investment activities that were never delegated to the agency. Such a significant reordering of the U.S.’s financial regulatory structure should be debated in Congress, not in the courts.\"","Judge William H. Orrick is scheduled to hear the matter on June 12.","Read More: Looking at Kraken's Motion to Dismiss an SEC Lawsuit","Nikhilesh De contributed to this report.","Edited by Parikshit Mishra."],"entity":[{"type":"Northern District of California","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"William H. Orrick","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Kraken","content":"LOCATION"},{"type":"February 2024","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"June 12","content":"DATE"}],"hashtag":["Regulations","Crypto","SEC","Kraken","Howey Test"],"authors":["Amitoj Singh"]}