{"summary":"The human-focused blockchain network will be based on the OP Stack, a framework for building Ethereum-based layer-2 chains.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/17\/worldcoin-sam-altmans-crypto-project-is-building-a-layer-2-chain\/","publishDate":"2024-04-17T15:00:00","id":16714,"type":null,"title":"Worldcoin, Sam Altman's Crypto Project, Is Building a Layer-2 Chain","category":["Technology"],"content":["OpenAI founder Sam Altman's retina-scanning crypto startup, Worldcoin, is getting its own blockchain.","World Chain, a layer-2 network on Ethereum slated for a release this summer, will grant special treatment to users who scan their eyeballs in exchange for a \"World ID\" digital passport. It will build on Worldcoin's perennial pitch as a network for \"verified humans\" – an ecosystem designed to filter out bots in the increasingly uncanny age of AI.","Until now, Worldcoin's World ID protocol has simply operated as a decentralized application – essentially just a set of smart contracts on the Ethereum blockchain. The move to start an independent chain could give the developers greater control over the project with more optionality while also potentially reducing costs for users.","\"Verified humans will enjoy priority blockspace over bots and some free gas,\" Tools For Humanity, the team behind Worldcoin, said in a statement. \"For developers it will be a way to reach millions of users with apps focused on real-world utility.\"","World Chain will be based on the OP Stack, a blockchain-building framework that has become a popular choice among bootstrappers and was used by Coinbase to build its Base network. Like other layer-2 \"rollups,\" the chain will bundle up transactions from users and pass them down to Ethereum where they get cemented permanently. The setup will allow World Chain to offer users cheaper fees than they'd get by transacting directly on Ethereum.","\"All of these blockchains are putting a lot of work into reducing gas fees so that the network is more accessible, but what that means is you start seeing a lot more bot activity,\" said Tiago Sada, the head of product, engineering and design at Tools For Humanity, the development firm behind Worldcoin. \"That just ends up actually driving fees super high for humans, and the networks get clogged.\"","\"I would say it's pretty clear that somewhere between 50 and 90% of on-chain transactions are automated,\" Sada explained. \"World Chain will be open and permissionless. Anyone, including bots, can submit transactions. But transactions submitted by verified humans will have priority block space, so they will be processed faster.\"","Worldcoin's claim to fame (or notoriety, depending on one's perspective) is its \"orb\" – a bowling ball-shaped chrome sphere that contains a lens for scanning eyeballs. The orb differentiates Worldcoin from other internet services by ensuring that anyone who gets an account is a human – not a robot – and it removes the possibility of two accounts being owned by the same person.","The project's emphasis on \"proof of personhood\" ties back to the potential use cases as AI applications proliferate.","Tools For Humanity has taken its orb on the road to conduct in-person scans at conferences, events and pop-up shops. According to the project, over 10 million users across more than 167 countries have been onboarded.","The Worldcoin experience today mainly exists inside of the World App, a crypto wallet that integrates with some popular protocols and offers special functionality to orb-scanned users. The app currently plugs into the OP Chain, the layer-2 Ethereum blockchain that originated the OP Stack.","Worldcoin is the second-largest protocol on OP Chain by transaction volume, and its WLD token has the largest market cap on the chain behind ETH and the network's native OP coin.","By moving to a network entirely of Worldcoin's own making, \"it just allows us to keep onboarding users at the scale that we are at,\" said Sada. \"For existing users, it allows us to give them faster transactions and cheaper transactions.\"","Wolrdcoin's initial pitch revolved around universal basic income: People who scanned their retinas in certain regions (excluding the United States and some other countries) were given an allotment of WLD tokens and a verified World ID account. Over time, as AI has begun to reshape the internet, Worldcoin's financial ambitions have been subordinated, to an extent, to its broader goals around digital identity.","With the new network, Worldcoin will bake bot-vetting directly into its DNA, making it possible for other wallet apps beyond World App to integrate World ID. World Chain also turns WLD into a first-class currency alongside ether (ETH), meaning both assets will be usable to pay network fees.","World Chain comes after a tumultuous year for Worldcoin, which faced criticism almost immediately following its 2021 debut. Some crypto adherents raised privacy concerns: The eye-ball scanning orb carries a creepy factor that Worldcoin has struggled to shake, despite insistence from Worldcoin's creators that the hardware rigorously encrypts biometric data.","There was also an unflattering exposé from the MIT Technology Review that alleged Tools for Humanity had exploited underfinanced communities over the course of its rollout – dangling the prospect of free tokens in exchange for sign-ups over the course of its testing. According to the piece, Worldcoin engaged in \"deceptive marketing practices, collected more personal data than it acknowledged, and failed to obtain meaningful informed consent.\"","As AI has boomed and the crypto market has been on an upswing, the Worldcoin team has shipped a series of updates and integrations. There are new ways to use Worldcoin that don't require eye scans, and there's new encryption tech aimed at addressing some of the privacy concerns that have dogged the project since its inception.","The tweaks have helped Worldcoin grow in spite of its many naysayers, reaching more than 70 million transactions in total, according to the project's most recent data. Even Ethereum founder Vitalik Buterin – who delivered a point-by-point critique of Worldcoin in one of his blog posts – praised the project for \"doing quite a good job of taking the privacy critiques seriously and designing their system to be more and more data-minimal\" in a March X post.","Edited by Bradley Keoun."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"MIT Technology Review","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Worldcoin","content":"ORGANIZATION"},{"type":"Tools For Humanity","content":"ORGANIZATION"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Sada","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["worldcoin","Ethereum","Optimism","OP crypto","rollup","layer 2","Rollups","AI","Sam Altman"],"authors":["Sam Kessler"]}