{"summary":"A Hong Kong government study highlighted concerns the region is lagging behind competitors in terms of web3 development.\nIt cited the need for a new government-led blueprint to catch up with peers in East Asia and Gulf states.\nThe economic hub has made significant strides since the beginning of the year to position itself as an innovator in terms of crypto and web3 technologies.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235589\/hong-kong-can-draw-on-japan-singapores-lead-for-its-crypto-efforts-says-government-study","publishDate":"2023-06-20T06:40:49","id":1671,"type":null,"title":"Hong Kong can draw on Japan, Singapore’s lead for its crypto efforts, says government study","category":["Crypto Ecosystems"],"content":["A Hong Kong government study highlighted concerns the region is lagging behind its East Asian and Gulf peers in terms of web3 development and said these could be used to guide its own plans.","\"There are concerns over the progress of developing other web3 technology domains and hence Hong Kong’s competitiveness vis-à-vis its Asian and Gulf counterparts, as the latter are harnessing their own strengths to develop web3 and explore its potential on a wider variety of application scenarios,\" the <a href=\"https:\/\/app7.legco.gov.hk\/rpdb\/en\/uploads\/2023\/IN\/IN10_2023_20230614_en.pdf\" data-v-f87c67ca=\"\">study<\/a> claimed in its conclusion.","The study —&nbsp;called 'Development of web3 technologies in selected places' — said these countries can serve as guides for the region’s own plans. “Nevertheless, Hong Kong can draw on the experience of these early movers as policy guides when it gears up for the development of Web 3.0 technologies\/applications,” it said.","The study was created by the Hong Kong government's research office to focus on how other countries are adopting web3 technology. It was first <a href=\"https:\/\/twitter.com\/WuBlockchain\/status\/1671049604182458369\" data-v-f87c67ca=\"\">noted<\/a> by Wu Blockchain.","The June 2023 study highlighted calls for a robust blueprint that supports the development of web3 with a focus on encouraging start ups. This included the idea of web3 applications being used not just for financial services, but also for the development of metaverse technologies.","It described a need for the provision of more legal clarity to propagate an environment for web3 technologies that would include the emergence of DAOs and IP rights issues, and address concerns arising from the use of NFTs.","Lastly, it called for Hong Kong's Legislative Council to catch up with metaverse development seen in other jurisdictions, and explore metaverse applications in public services, tourism, and other industries.","The study listed the differing approaches by various global jurisdictions, including Japan, Singapore, and South Korea, in the development and adoption of web3 technologies.","Japan was noted for its high-level policy to make web3 a national strategy, the development of a dedicated Web 3.0 Policy Office, and its recent white paper entitled, 'Japan’s NFT Strategy for the Web3 Era.'","Singapore and the UAE were noted for emphasizing blockchain use cases, and South Korea for focusing on implementing a metaverse strategy to boost innovation in sectors like public services, culture, and tourism.","The study also looked at the tokenization of real-world assets for fungible and non-fungible tokens and stressed the importance of NFTs for ownership of digital assets and intellectual property rights.","It went on to highlight the recent announcement by Hong Kong's Financial Secretary in the special administrative region's 2023-2024 Budget, \"to nurture a web3 ecosystem and establish a task force on the development of virtual assets.\"","The recent study by the Legislative Council Secretariat's Research Office follows an announcement on June 1 by the Hong Kong Securities and Futures Commission (SFC) to <a href=\"https:\/\/www.theblock.co\/post\/232961\/hong-kong-crypto\" data-v-f87c67ca=\"\">accept license applications<\/a> for crypto exchanges. Huobi was one of the first to apply for registration and <a href=\"https:\/\/www.theblock.co\/post\/232449\/huobi-hk-hong-kong\" data-v-f87c67ca=\"\">open its doors<\/a> to clients.&nbsp;","In recent months, Hong Kong has made significant strides in the development of Web3 and blockchain technologies. January saw the launch of <a href=\"https:\/\/www.samsungetfhk.com\/about3135\/\" data-v-f87c67ca=\"\">Samsung's Bitcoin Futures<\/a> Active exchange-traded fund (ETF) on the Hong Kong Stock Exchange.&nbsp;"],"hashtag":["HTX"]}