{"summary":"The last Bitcoin halving took place on May 11, 2020, and the next bitcoin halving will likely occur in April 2024. But what is the halving, how does it affect the price, and what does it mean for miners and the cryptocurrency’s long-term prospects?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/bitcoin-halving-explained\/","publishDate":"2022-10-04T15:04:08","id":16720,"type":null,"title":"Bitcoin Halving, Explained","category":["Learn"],"content":["The Bitcoin halving, also known as “the halvening,” is the name for one of the most hotly anticipated recurring events in Bitcoin’s history.","In April 2024, the number of bitcoin entering circulation every 10 minutes – known as block rewards – will drop by half, from 6.25 to 3.125 BTC. It’s an event that is easy to see coming because it happens every 210,000 blocks (approximately every four years) and has happened three times since 2009, when Bitcoin was created.","The allure of possible riches is what draws so much attention to these events. The number of new bitcoin entering circulation shrinks, but demand should, in theory, stay the same, possibly driving up the bitcoin’s price. And so the event has inspired passionate debate about bitcoin price predictions and how the market will respond.","“The theory is that there will be less bitcoin available to buy if miners have less to sell,” said Michael Dubrovsky, a co-founder of PoWx, a crypto research nonprofit.","But the periodic decline in the Bitcoin network’s minting rate could have a deeper significance than any near-term price movements for the functioning of the cryptocurrency. The block reward is an important component of Bitcoin, one that ensures the security of this leaderless system. As the rewards dwindle to zero in the decades ahead, it could potentially destabilize the economic incentives underlying bitcoin’s security.","For those trying to make sense of this complex topic, here’s everything you need to know.","New bitcoins enter circulation as block rewards, produced by the efforts of bitcoin miners who use expensive electronic equipment to earn, or “mine,” them by discovering new blocks, verifying transactions and adding them to the Bitcoin blockchain.","Roughly every four years, the total number of bitcoin that miners can potentially win is halved (miners also earn transaction fees when building bitcoin blocks). This is intentional. Satoshi Nakamoto, the creator of Bitcoin, programmed the halving into Bitcoin’s core code with the intention of creating scarcity over time (more on that later).","In 2009, the system rewarded successful miners with 50 bitcoin every 10 minutes. Three halvings later, 6.25 bitcoins are being dispensed every 10 minutes.","Learn More: How the ‘Halving’ Could Impact Bitcoin","The process will end once the number of bitcoin in circulation reaches 21 million. A popular estimate is that it will occur sometime near the year 2140.","The next Bitcoin halving is expected to occur around April 2024. The exact date is difficult to predict as it depends on block height being reached, but it is estimated to happen around April 19-20. During the 2024 halving, the block reward for miners will be cut in half, from 6.25 BTC to 3.125 BTC.","Bitcoin’s pseudonymous creator, Satoshi Nakamoto, who may have been an individual or a team, disappeared about two years after he, she or they released the software into the world. So, he or she or they (we’ll just go with “they” from now on) are no longer around to explain why they chose this specific formula for adding new bitcoin into circulation.","But early emails written by Nakamoto shed some light on the mysterious figure’s (figures’) thinking.","Shortly after releasing the Bitcoin white paper, Nakamoto summarized the various ways their chosen monetary policy (the schedule by which miners receive block rewards) could play out, pondering the circumstances under which it could lead to deflation (when a currency’s purchasing power increases) or inflation (when the prices of goods and services purchasable with a currency increase).","Learn More: Who Is Satoshi Nakamoto?","At the time, Nakamoto couldn’t have known how many people would use the new digital money (if anyone).","They elaborated very little on why they chose the particular formula they did: “Coins have to get initially distributed somehow, and a constant rate seems like the best formula,” the wrote.","With most state-issued currencies a central bank, such as the U.S. Federal Reserve, has tools at its disposal that enable it to add or remove dollars from circulation. If the economy is floundering, for instance, the Fed can increase circulation and encourage lending by purchasing securities from banks. Alternatively, if the Fed wants to remove dollars from the economy, it can sell securities from its account.","For better or worse, bitcoin is a bit different. For one, the supply schedule is all but set in stone.","Unlike the monetary policy of state-issued currencies, which unfolds through political processes and human institutions, Bitcoin’s monetary policy is written into code shared across the network. Changing it would require an immense output of coordination and agreement across the community of Bitcoin users.","Additionally, the 21 million cap on the number of coins that can enter circulation makes them scarce (at least in comparison to dollars or euros), which for some people is enough to make them valuable.","Another unique aspect of Bitcoin is Nakamoto programmed the block reward to decrease over time, which is why some people say Bitcoin has a predictable monetary policy. That is another way in which it differs from the norm for modern financial systems, where central banks control the money supply. In stark contrast to Bitcoin’s halving block reward, the supply of the dollar has roughly tripled since 2000.","Nakamoto left clues that they created Bitcoin for political reasons. The first Bitcoin block features the headline of a newspaper article: “The Times 03\/Jan\/2009 Chancellor on brink of second bailout for banks.”","Many have come to interpret that statement as a sign of Nakamoto’s political beliefs and goals. If widely adopted, Bitcoin could potentially reduce the power banks and governments have over monetary policy, including bailouts of struggling institutions. As shown with the block reward, no central entity can create bitcoin outside of the strict schedule.","A Bitcoin halving grabs so much attention mostly because many believe it will lead to a price increase. The theory is that when the supply of bitcoin declines, the demand for bitcoin will stay the same, pushing the price up. The truth is, no one knows what's going to happen.","Bitcoin has seen three halvings so far, which we can look to as precedents.","The 2012 halving provided the first demonstration of how markets would respond to Nakamoto’s unorthodox supply schedule. Until then, the Bitcoin community didn’t know how a sudden decline in rewards would affect the network. As it turned out, the price began to rise shortly after the halving.","The second halving on July 16, 2016 was highly anticipated, with CoinDesk running a live blog of the event and Blockchain.com putting out a “countdown.” The price dropped by 10%, but then shot back up to where it was before.","Learn More: Bitcoin’s Third Halving Arrives","Although the immediate impact on the price of bitcoin was small, the market did eventually respond over the course of the year following the second halving. Some argue that the 2017 bull run was a delayed result of the halving. Looking at bitcoin’s price 365 days after the second halving, we can see it rose by 284% to $2,506, in July 2017. By the end of that year bitcoin was trading above $19,000.","After the 2020 halving, on May 11, bitcoin’s price continued to perform bullishly a full year after the event took place. This time, it rose by more than 559%, from around $8,700 in 2020 to $56,000 in 2021.","Still, just because the halvings have so far preceded bull runs does not mean there is a causal relationship — three data points is a trend, not a study. Many analysts treat the halving as a “buy the rumor, sell the news” type of event, given the amount of media attention that it typically garners.","Bitcoin wouldn’t work at all without block rewards.","As pseudonymous independent researcher Hasu put it, there are two parts to making Bitcoin work. “Bitcoin’s ledger state should answer the question of ‘who owns what, when?’” Hasu told CoinDesk.","The first part, “who owns what?” is solved by cryptography. Only the owner of a private key (which is like a secret access code) can spend the bitcoin.","“The second half (‘when?’) is the big challenge and was unsolved before Bitcoin,” Hasu said. Miners validate that transactions are legitimate, preventing people from “double-spending” their coins or effectively creating money from thin air.","Without the block rewards, which incentive miners to expend energy and costs to participate in this process, the Bitcoin network would be in chaos.","The more money miners can earn by way of block rewards or trading fees, the more mining power goes to Bitcoin, and thus the more protected the network is. That is why the periodic decrease in rewards might eventually become an issue.","Miners need an incentive to do what they do. They need to get paid. They’re not running these expensive, electricity-guzzling computers for their health after all.","But the consequence of the decline in block rewards is that eventually, it will dwindle to nothing. Transaction fees, which users pay each time they send a transaction, are the other way miners earn money. (Theoretically, these fees are optional, although as a practical matter, a transaction without one might have to wait a long time to be processed if the network is congested; the size of the fee is set by the user or their wallet software.)","Because the mining subsidy is designed to decrease through programmatic halving events, fees will become a more important source of remuneration for miners overtime.","“In a few decades when the reward gets too small, the transaction fee will become the main compensation for nodes. I’m sure that in 20 years, there will either be very large transaction volume or no volume,” Nakamoto wrote.","But for a long time, Bitcoin researchers have been considering the possibility that transaction fees won’t suffice. For one thing, it means transactions might need to grow more expensive over time to keep the network secure.","“This cannot really work without very expensive transaction costs because Bitcoin cannot process huge quantities of transactions on-chain,” Dubrovsky said.","The emergence of new ways of using the Bitcoin network, including the introduction of the Ordinals protocol that enables non-fungible tokens (NFTs) on Bitcoin and the BRC-20 standard for the development of Ethereum-like tokens has already driven up the number of on-chain transactions, and therefore the amount in fees miners are earning.","It is unclear where this activity will lead, especially because Ordinals and BRC-20 tokens are controversial among the Bitcoin community. To date, it is primarily mining rewards that have incentivized the development of a competitive, globally diverse bitcoin mining industry, hardening it against attacks that try to circumvent the network’s rules. It’s unclear whether a future attenuated block reward will have the same allure for miners.","It is already being predicted by research firms like Galaxy Digital that out-of-date ASICs chips designed for mining bitcoin will become unprofitable to run after the upcoming having, meaning there will be less total hashpower directed towards the network.","“I don’t think this halving will make Bitcoin significantly less secure, but in eight to 12 years, we could find ourselves in hot water,” Hasu said.","Part of the problem is that more than a decade after Bitcoin’s birth the market is still figuring out the true cost of protecting the network from attackers.","“Nobody knows the correct level of security needed to keep Bitcoin safe. Currently, Bitcoin pays out something like $5 billion per year and there are no successful attacks; however, there has","Updated 10\/06\/2021 to reflect the most recent bitcoin halving, which took place on May 11, 2020.","Updated 2\/13\/2024 to reflect the upcoming bitcoin halving, which will likely take place in April, 2024.","Updated 4\/16\/2024 to add additional information about Bitcoin network and the upcoming halving, likely to take place April, 2024."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$5 billion","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"May 11, 2020","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"$2,506","content":"MONEY"},{"type":"April, 2024","content":"DATE"},{"type":"Michael Dubrovsky","content":"PERSON"},{"type":"July 2017","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$19,000","content":"MONEY"},{"type":"559%","content":"PERCENT"},{"type":"$56,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"April 19","content":"DATE"},{"type":"July 16, 2016","content":"DATE"},{"type":"284%","content":"PERCENT"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Dubrovsky","content":"PERSON"},{"type":"BRC","content":"ORGANIZATION"},{"type":"2140","content":"DATE"},{"type":"Hasu","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$8,700","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"May 11","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Beginner","Learn","Bitcoin Halving"],"authors":["Alyssa Hertig"]}