{"summary":"The Treasury's financial-crimes arm found that bitcoin was increasingly popular for use in trafficking of people and materials tied to child sexual abuse, though the data is from 2021.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/13\/bitcoin-favored-in-human-trafficking-child-exploitation-fincen-report\/","publishDate":"2024-02-13T23:41:16","id":16723,"type":null,"title":"Bitcoin Favored in Human Trafficking, Child Exploitation: FinCEN Report","category":["Policy"],"content":["A few years ago, bitcoin (BTC) became a popular means to conduct illegal transactions to support a booming global business in the smuggling and exploitation of people, according to an analysis released Tuesday by the U.S. Department of the Treasury.","Based on financial firms' government filings in 2020 and 2021, that period saw an upswing in the use of crypto – most commonly bitcoin – in crimes that included human trafficking and the sexual exploitation of children, according to the trend report released by the Treasury's Financial Crimes Enforcement Network (FinCEN). In those two years, the analysis found 2,311 reported uses of crypto in such crimes, amounting to more than $412 million.","\"Victims of these crimes are placed into forced labor, slavery, involuntary servitude, peonage, and\/or forced to engage in commercial sex acts,\" the report said. And the use of crypto was on a sharp rise, with 1,975 reports in 2021 eclipsing the 336 in 2020.","\"Human traffickers and perpetrators of related crimes despicably exploit adults and children for financial gain,\" said FinCEN Director Andrea Gacki, in a statement. Financial firms flagging these cases \"ultimately helps law enforcement protect and save innocent lives.\"","But the most recent data examined was from December 2021 – more than two years ago. That period pre-dated the crypto winter and the subsequent recovery in recent months.","A majority of the cases evaluated in this report involved the exchange of crypto for \"child sexual abuse material\" – typically, \"CSAM\" involves explicit photos and videos of children – generally over darknet marketplaces, with the use of crypto kiosks (commonly known as bitcoin ATMs) or with transactions run through mixers, FinCEN noted.","The use of crypto and the common methods of transaction have undergone some changes since that period, and crypto data firm Chainalysis noted \"the scale and severity of CSAM activity peaked in 2021,\" according to a review published last month.","FinCEN's report suggested that some of the increase over the two-year span could have been spurred by \"raised awareness and vigilance\" from financial institutions informed of criminal use of cryptocurrencies.","Read More: U.S. Senators Float Bill Requiring Congressional Watchdog to Study Crypto's Role in Trafficking"],"entity":[{"type":"December 2021 – more than two years ago","content":"DATE"},{"type":"U.S. Department of the Treasury","content":"ORGANIZATION"},{"type":"Treasury's Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"$412 million","content":"MONEY"},{"type":"Andrea Gacki","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"winter","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"U.S. Senators Float Bill Requiring Congressional Watchdog to Study Crypto","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"CSAM","content":"ORGANIZATION"}],"hashtag":["Regulations","Bitcoin","btc","Human Trafficking","child abuse","Treasury Department","FinCEN"],"authors":["Jesse Hamilton"]}