{"summary":"Observers in the crypto space were stunned when nd4.eth sent 2,500 ether ($4.5 million) to a burn address for currently unknown reasons.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243514\/ethereum-mystery-burn","publishDate":"2023-08-07T05:24:03","id":1672,"type":null,"title":"Ethereum community baffled by mysterious $4.5 million ether burn","category":["LAYER 1S"],"content":["Observers in the crypto space were stunned when an unknown individual using the ENS name nd4.eth <a href=\"https:\/\/etherscan.io\/tx\/0x36f899bb27aa365c30a6f559c3512c063c366dae515d43fe05ec530ed440bb5a\" data-v-f87c67ca=\"\">sent<\/a> 2,500 ether ($4.5 million) to a burn address. This act effectively destroyed the coins for no specific reason.&nbsp;","The transfer took place on July 26 but only just gained widespread attention, leading to a surge in speculation and curiosity within the crypto community. The specifics of why this was done are still scant.","While many are perplexed by the fact that someone would destroy $4.5 million worth of ether seemingly without reason, others instead jokingly applauded the individual for effectively reducing Ethereum’s supply — aligning with the “Ethereum’s Ultrasound Money” narrative.&nbsp;","“If you didn’t wake up this morning and say thank you to nd4.eth for contributing to the ultrasound money narrative, I want you to have a long, hard think about what you’re trying to achieve here,” <a href=\"https:\/\/twitter.com\/functi0nZer0\/status\/1688454356796915712\" data-v-f87c67ca=\"\">commented<\/a> Laurence Day, the creator of Wildcat Protocol, in a tongue-in-cheek manner.","Here, “burning” refers to permanently removing tokens from circulation. This is typically done by sending them to a designated address, which in this case was <a href=\"https:\/\/etherscan.io\/tx\/0x36f899bb27aa365c30a6f559c3512c063c366dae515d43fe05ec530ed440bb5a\" data-v-f87c67ca=\"\">0xdea…069<\/a>.","On-chain analysts at Lookonchain <a href=\"https:\/\/twitter.com\/lookonchain\/status\/1688474075054886912\" data-v-f87c67ca=\"\">noted<\/a> the individual is currently a large holder of tokens from perpetual trading protocols, holding 34,287 GMX tokens (valued at $1.84 million ) and 311,003 Gains tokens worth $1.43 million. They also sent 1.5 ETH, 34.9 GMX and 600 GNS — worth about $7,000, in total — to the same burning address.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum’s Ultrasound Money” narrative","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"$1.84 million","content":"MONEY"},{"type":"July 26","content":"DATE"},{"type":"$7,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Laurence Day","content":"PERSON"},{"type":"$1.43 million","content":"MONEY"},{"type":"$4.5 million","content":"MONEY"},{"type":"GNS","content":"ORGANIZATION"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}