{"summary":"Alpen Labs has emerged from stealth mode following the funding round, having spent the last year developing Bitcoin rollup infrastructure to bring smart contract functionality to the network","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/10\/alpen-labs-looks-to-scale-bitcoin-with-zero-knowledge-proofs-using-106m-funding\/","publishDate":"2024-04-10T15:11:36","id":16725,"type":null,"title":"Alpen Labs Looks to Scale Bitcoin With Zero-Knowledge Proofs Using $10.6M Funding","category":["Technology"],"content":["Bitcoin layer-2 developer Alpen Labs, which has raised $10.6 million in funding, is looking to scale the blockchain of the world's largest cryptocurrency with zero-knowledge proofs.","Alpen Labs has emerged from stealth mode following the funding round, having spent the last year developing Bitcoin rollup infrastructure to bring smart contract functionality to the network.","Its $10.6 million seed round was led by Ribbit Capital and included contributions from Castle Island Ventures, Robot Ventures and Axiom Capital.","Zero-knowledge technology allows for data to be transferred securely and quickly between parties and is used to scale blockchains through rollups. Rollups are networks that operate in conjunction with a blockchain, bundle up transactions, to then be settled on the principal network, which will in theory improve speed and reduce costs.","Such developments have been relatively absent historically from Bitcoin, whose core developers have focused on keeping the network simple in the interest of security.","However, the proliferation of the Ordinals protocol in early 2023 followed by the release of Robin Linus's BitVM have demonstrated the appetite for development on the network to increase Bitcoin's utility.","Read More: Bitcoin Zero-Knowledge Rollup Citrea Raises $2.7M in Seed Funding","\n","\n"],"entity":[{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"Alpen Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10.6 million","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$2.7","content":"MONEY"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Robin Linus","content":"PERSON"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Zero-Knowledge Proofs","layer 2"],"authors":["Jamie Crawley"]}