{"summary":"The fundraise was led by Hack VC and included contributions from DAO5, L2Iterative, NomadCapital_io, FinalityCap, Symbolic VC and Theta Capital","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/25\/eigenlayer-powered-aligned-layer-raises-20m-to-make-zk-proofs-faster-cheaper-on-ethereum\/","publishDate":"2024-04-25T10:49:06","id":16728,"type":null,"title":"EigenLayer-Powered Aligned Layer Raises $20M to Make ZK Proofs Faster, Cheaper on Ethereum","category":["Finance"],"content":["Ethereum verification protocol Aligned Layer has raised a $20 million Series A to enable faster and cheaper zero-knowledge (ZK) proofs on the world's second-biggest blockchain.","The fundraiser was led by Hack VC and included contributions from DAO5, L2Iterative, NomadCapital_io, FinalityCap, Symbolic VC and Theta Capital.","ZK proofs refer to protocols in which one party can verify the truth of a statement to the other party without conveying any further information about it.","Aligned Layer’s aim is to help engineers avoid bottlenecks in proving their code while making it cheaper to build applications atop Ethereum that use ZK proofs, according to a blog post on Thursday.","“We verify proofs cheaply and quickly and post their results in Ethereum and any DA (data availability) layer that the developer wants,\" Aligned Layer said.","Aligned Layer is an EigenLayer “actively validated service\" (AVS). EigenLayer is a crypto project focused on \"restaking”, where ether (ETH) is deposited as security for the main blockchain and can be repurposed to secure other networks.","The project’s developer, Eigen Labs, has also been the recipient of substantial investment, raising $100 million from crypto VC kingpin Andreessen Horowitz (a16z) in February.","Read More: EigenLayer, Crypto's Biggest Project Launch This Year, Is Still Missing Crucial Functionality","Edited by Parikshit Mishra.","\n"],"entity":[{"type":"Crypto","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Eigen Labs","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Theta Capital","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"}],"hashtag":["Ethereum","Zero-Knowledge Proofs","EigenLayer","Funding Rounds"],"authors":["Jamie Crawley"]}