{"summary":"Sol is leading an altcoin rally with a 25% weekly gain, as ether reclaims the $1,600 mark.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258682\/major-altcoins-gain-ground-closing-in-on-bitcoins-week-long-rally","publishDate":"2023-10-20T14:10:40","id":1672,"type":null,"title":"Major altcoins gain ground, closing in on bitcoin&#x27;s week-long rally","category":["Markets"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.21%\n    <\/span><\/a> <!----><\/span><\/span> is leading an altcoin rally that follows bitcoin's week of steady gains. <\/span><a href=\"https:\/\/www.theblock.co\/post\/257727\/solana-based-multisig-protocol-squads-raises-5-7-million-from-multicoin-placeholder-and-others\" data-v-f87c67ca=\"\">Sol<\/a> has posted a 25% gain in the past week, outperforming other blue-chip cryptocurrencies on a day that saw the market capitalization of the entire sector increase by over 3%.","YouHodler Chief of Markets Ruslan Lienkha views the rally as a consequence of investors gaining a clearer understanding of the future of FTX's significant Sol holdings. Last week the FTX estate <a href=\"https:\/\/www.theblock.co\/post\/256466\/ftx-estate-stakes-122-million-of-solana-on-chain-data-shows\" data-v-f87c67ca=\"\">staked<\/a> over 5.5 million Sol, worth around $122 million.","\"Sol was undervalued for a long time because of its ties with the FTX saga,\" Linekha told The Block. \"With time the situation involving frozen FTX assets is getting clearer, so positive news in the industry has a better and greater impact on Sol.\"","Ryze Labs Co-Founder Matthew Graham sees the recent rally as reflecting a shift in perception as Solana's technology continues to mature.","\"Solana has 100% uptime for more than six months,\" Graham told The Block. \"State compression is here. And Solana’s high throughput technology significantly expands the space in which developers can create.\"&nbsp;","Sol is not the only altcoin that rallied Friday. <a href=\"https:\/\/www.theblock.co\/post\/258689\/ethereum-joseph-lubin-consensys-lawsuit\" data-v-f87c67ca=\"\">Ether<\/a> has regained a position above the $1,600 mark, and <a href=\"https:\/\/www.theblock.co\/post\/254795\/xrp-leads-crypto-rally-after-secs-appeal-bid-is-rejected\" data-v-f87c67ca=\"\">XRP<\/a> has rallied 7% over the past 24 hours.","Friday's rally comes after Federal Reserve Chair Jerome Powell's statement in New York on Thursday where he indicated the Fed is likely to continue pausing interest rate hikes at the next FOMC meeting, citng economic uncertainties and risks.","\"Tight policy is putting downward pressure on economic activity and inflation,\" Powell said during a discussion at the Economic Club of New York.","However, YouHodler's Lienkha said that Powell's comments failed to lift stock indices. Stocks retreated on Friday as a surge in the 10-year Treasury yield hinted at broader concerns about the state of the global economy. The S&amp;P 500, Nasdaq Composite and Dow Jones Industrial Average all fell in early day trading.","\"Any signs that the probability of a rate pause may be higher than the market is currently pricing in are bullish for bitcoin. We are inclined to believe that Powell’s speech probably fell into this category,\" Ryze Lab's Mathew Graham told The Block.","CryptoQuant analyst Adam Mourad told The Block that on-chain metrics show an increase of the dormant supply of <a href=\"https:\/\/www.theblock.co\/post\/258675\/bitcoin-price-flirts-with-30000-mark-during-sustained-rally\" data-v-f87c67ca=\"\">bitcoin<\/a>, across multiple cohorts. His analysis of the digital asset that has remained dormant for one, three and six month periods is that \"a consistent presence of inactive bitcoin underscores a notable shift in sentiment to hold and a diminished proclivity to sell.\"","Lienkha suggested the main driver for bitcoin’s recent performance was the <a href=\"https:\/\/www.theblock.co\/post\/258581\/ripple-celebrates-dismissed-lawsuit-calling-it-a-surrender-by-the-sec\" data-v-f87c67ca=\"\">dismissal<\/a> of charges against Ripple. The world's largest digital asset by market cap is up 3% over the past 24 hours, now changing hands for $29,500 at 1:15 p.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;"],"hashtag":["ANALYST REPORTS","CRYPTO MOVERS","ECONOMIC INDICATORS","EQUITY MOVERS","RATE DECISIONS"]}