{"summary":"After a series of high-profile exploits and indications that blockchain is being used to launder money, the industry and law enforcement have to develop better practices and tools to follow the money.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/20\/cryptos-responsibility-to-law-enforcement-in-2023-and-beyond\/","publishDate":"2022-12-20T19:59:27","id":16731,"type":null,"title":"Crypto’s Responsibility to Law Enforcement in 2023 and Beyond","category":["Consensus Magazine"],"content":["Shortly after the ball dropped in Times Square on New Year's Eve welcoming in 2022, the cryptocurrency, blockchain and digital assets community rang in the new year with thoughts of mass adoption into the mainstream. Bitcoin was trading around $40,000, an iconic arena in Los Angeles had just changed its name to one of the major crypto exchanges, and celebrities, athletes and musicians were lining up to sing the praises of this new financial ecosystem.","Bill Callahan, a former special agent financial investigator with the U.S. Department of Justice, is the director of government and strategic affairs at the Blockchain Intelligence Group. This article is part of Crypto 2023.","It’s been a bumpy ride since then. Bitcoin is down 60%. Once-prominent crypto apps Celsius Network and BlockFi are sitting in bankruptcy court. And as we head into the new year, at least one stadium will have to scrub a crypto exchange’s name off its facade.","Law enforcement, financial investigators and anti-money laundering examiners have had their hands full with digital asset-related scams, frauds, thefts and hacks this year. And we’re not just talking about stolen Bored Apes (though more than a few were phished). If we learned anything in 2022, it’s that blockchain analytics can help speed up an investigation – from the time law enforcement is first alerted to a potential financial crime to the time of arrest.","In March, my company, Blockchain Intelligence Group, uncovered potential suspicious activity involving a non-fungible token (NFT) project called Frosties and notified law enforcement authorities. Agents were able to track and trace financial transactions along the blockchain and along with other electronic data, were able to identify the culprits, arrest them and prevent another planned NFT fraud.","See also: Crypto 2023: It's Sanctions Season","What ordinarily would have taken months of painstaking financial investigative work was reduced to a matter of weeks. That’s important, considering the number and value of crypto exploits actually increased this year – despite the market pull back.","In 2023, the need for blockchain investigators (and analytics tools) will grow: from global regulatory agencies handling complex investigations of cyber-attacks and the cross-jurisdictional movement of money to local police agencies responding to citizen complaints of romance or investment scams.","Local police departments will no longer have the luxury to send these investigations to the feds but will dedicate resources to train and equip financial and economic crime detectives with the latest in cryptocurrency investigation education.","In 2023, crypto service providers will need to learn more about the trans-national criminal organization (TCO) and drug trafficking organizations (DTO), to use the parlance of investigators. It’s every ecosystem participant’s duty to file suspicious activity reports and stay aware of potential crimes.","Just as during the rise of the modern drug cartel in 1980s and 1990s, specific players have emerged with new technologies to service and support bad actors. Crypto, with its unprecedented level of transparency, should make it difficult for dark flows of cash – though that doesn’t always happen.","Although crypto is verifiable, transnational criminal syndicates benefit from the censorship resistance of decentralized networks such as Bitcoin and Ethereum (and maybe a handful of others) to consolidate their earnings from illicit activity.","See also: 10 Predictions About Crypto in 2023","Then there’s the rise of crime-as-a-service, such as providing a crypto for fiat or vice versa exchange, code and instructions to conduct a hack or a wallet service to collect crypto from a phishing scam. Actors have and will continue to emerge to segregate these duties from each other.","Blockchain analysis can help track flows from criminal activity, but it’s only part of a potential solution. Education on how to avoid being a victim of cryptocurrency fraud needs to increase in 2023. That will start with communities revolting against the proliferation of bitcoin ATM machines in places where you traditionally would not do your banking or investing (i.e., bars, gas stations and the back of a convenience store) – which have emerged as potential money laundering jukeboxes.","While the criminal element will continue their attacks, the cybersecurity industry will strengthen. Blockchain and cryptocurrency analytics will be incorporated into the response. The digital asset investigations space will continue to grow, tools to track and trace cryptocurrency scams and frauds will become more affordable and readily available to local police agencies and financial investigators will not just follow the money, they will follow the coins."],"entity":[{"type":"Sanctions Season","content":"ORGANIZATION"},{"type":"Blockchain Intelligence Group","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Los Angeles","content":"LOCATION"},{"type":"Bill Callahan","content":"PERSON"},{"type":"1980s","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"1990s","content":"DATE"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"TCO","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"}],"hashtag":["Opinion","Department of Justice","Law Enforcement","illicit finance","criminal activity","Crypto 2023"],"authors":["Bill Callahan"]}