{"summary":"With the right diligence, digital asset custody can offer more safety, transparency and cost efficiency than traditional models.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/08\/03\/assessing-custody-solutions-in-digital-assets\/","publishDate":"2023-08-03T15:45:00","id":16732,"type":null,"title":"Assessing Custody Solutions in Digital Assets","category":["Finance"],"content":["Meet James. In 2013, this Welsh IT worker threw away a hard drive holding a digital wallet containing 7,500 bitcoin, which today would have a market value of nearly USD 217 million. Since then, he has been on a campaign to get access to the local garbage dump to find this lost fortune, to no avail. This case is not unique, and James, like many of us, has learned that not realizing the tenuous nature of digital records comes with a penalty. Digital currencies are a growing storage and retrieval concern, and advisors must understand the safety mechanisms available.","The adoption of digital assets requires the ability for investors to securely store their investments and recover them if keys are lost. Depending on where you live, regulatory frameworks for crypto custody exist and follow the same rules as holding money and other investments.","As advisors, how can you support your client in making informed investment and custody decisions?","In today's discussion, Jason Hall and John McNiff from Methodic Capital Management introduce crypto custody solutions from self-storage to “custody as a service.” They discuss how the transparency of the blockchain can help support your custody considerations and help advisors start to navigate the services and options available to them..","Over the coming months, we will continue to dive deeper into topics like custody to help build your knowledge in this ever-changing space and demonstrate how technology and regulatory pieces come together for your clients. Stay tuned.","Happy reading.","– S.M.","You're reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Digital asset custody – having direct access to the assets’ cryptographic keys – is an important and often required component of crypto investment management. However, there is greater complexity in digital asset custody due to technological and regulatory challenges that necessitate greater due diligence by the advisor. By utilizing a robust framework, custodial solutions can be objectively and thoroughly assessed, enabling an advisor to unlock the unique benefits of digital asset custody. Here we review the basics of our framework which can be expanded to fit individual needs.","Unlike traditional assets, custody of digital assets introduces unique operational challenges and opportunities. On the blockchain, anyone can view wallet balances and transactions, but only private key holders can transfer assets. This immutable transparency applies universally, without the possibility of administrative overrides. This inflexibility means that everyone, including institutions, is governed by the same rules.","Categories of digital asset custody","Digital asset custody typically falls into two categories: self-custody and custody services.","Self-custody, an important and often lauded aspect of crypto, enables individuals to manage their digital assets independently. While third party providers can facilitate this process through wallet services and hardware solutions, the inherent risks and control lie with the individual.","In contrast, custody services offer an experience akin to traditional asset custodians. For asset managers and advisors, custody services are the likelier choice given regulatory interpretations, risk management, technical capabilities, and best practices. These custody service providers oversee asset movements, settlement times, and security. However, lack of standardization due to insufficient regulation presents a challenge to advisors.","Choosing a custody solution: A recommended framework","While by no means comprehensive, below is a high-level overview of our assessment framework.","Regulatory considerations","Digital asset custody brings its own legal obligations. For instance, in jurisdictions like the United States, registered investment advisors must use \"qualified custodians.\" While the specific parameters of this designation are not yet clearly defined for digital assets, this prerequisite favors more regulated entities. Globally, licensing and regulatory mandates can vary widely with some countries not requiring licensing at all.","Given the pending status of digital-asset legislation in the U.S. and throughout the world, working with custodians that have clear regulatory requirements and robust internal frameworks helps protect against fraud and ensures business integrity.","Transparency measures","Custodians should offer a certain level of transparency. Do they conduct comprehensive audits not only on their financials but their IT, risk management, and infosecurity procedures? Blockchain-based custody can offer high transparency through technologies like proof of reserves, with the potential to reduce fraud and irresponsible financial behavior. Proof of reserves enables companies to demonstrate to all participants that customer-pledged assets are held securely.","We spoke at length on this issue with Henrik Gebbing, COO of Finoa who said, “Qualified custodians [in Germany] must comply with the same IT regulation as other financial institutions, [and] regulators don’t distinguish between crypto and traditional assets. (...) Do you follow the latest standards of information security? This is where you’ll find a lot of players that are not fully audited.”","While on-chain commitments can be transparently verified, off-chain commitments require additional scrutiny. Therefore, further steps (like an audit) are necessary to ensure companies are not engaging in unauthorized rehypothecation, commingling or off-chain pledging of assets.","Compatibility with investment strategy","Sometimes it’s unclear whether the custodian can actually custody the assets required to support the investment strategy. Depending on technological limitations and regulatory restraints, custodians often support different asset mixes. Getting specific assurances of all relevant assets will prevent the need for multiple custodians.","Oftentimes, high velocity trading strategies and permissionless DeFi are not supported by many of the more regulated custodians. The fit with a custodian is a two-way street, the custodian must be able to support the execution of the advisor’s strategy “Supporting institutional relationships requires alignment of strategy, market access [execution\/trade settlement], custody, and associated reporting,” says Kevin Hall, COO of Etana Custody.","Be deliberate in due diligence","Digital asset custody is complex and must be seriously considered. We have provided a basic framework but the actual process must include a number of technical considerations like structure and private key management. Choosing the right custodian requires careful analysis of regulatory rules, security measures and transparency. However, with the appropriate diligence and resources, digital asset custody can offer more safety, transparency, and cost efficiency than traditional models of custody.","–Jason Hall and John McNiff of Methodic Capital Management","I help clients include crypto in their retirement accounts.","– Bryan Courchesne, CEO Daim","Q: Can my client move their existing crypto to an IRA?","A:","IRS rules dictate that contributions to IRAs can only be done in fiat. Digital assets can not be placed into an IRA. They must be sold to cash first.","Q: What type of retirement accounts can my client hold crypto in?","A:","As far as the types of accounts that can be serviced, you will have plenty of options including Traditional, Roth, SIMPLE, and SEP IRAs as well Individual 401(k)s and Profit Sharing Plans (PSP). If you have an old 401(k) from a previous employer, you can roll that into a Digital Asset IRA. If you have an active 401(k) you most likely cannot withdraw assets to invest in an IRA. This would necessitate an in-service withdrawal that most plans do not allow. DAIM can help on this front. They are currently a 3(38) fiduciary for employer sponsored 401(k) plans with direct bitcoin exposure.","NASDAQ announced it was no longer going to offer crypto custody solutions, choosing to work with existing custody providers, citing challenging and changing regulatory conditions in the U.S.A. How long will this uncertainty last in the U.S.?","The SEC's proposed custody rule would mandate that investment advisors maintain custody accounts for crypto similar to those for other client assets, such as stocks, bonds or mutual funds","Is U.S. regulatory certainty on the horizon? A crypto bill passes congressional committee, with many hoping this is a big step toward clarity.","Edited by Pete Pachal."],"entity":[{"type":"COO of Etana Custody","content":"ORGANIZATION"},{"type":"John McNiff of Methodic Capital Management","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Methodic Capital Management","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"the U.S.A","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"James","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Digital Asset IRA","content":"ORGANIZATION"},{"type":"John McNiff","content":"PERSON"},{"type":"IRA","content":"ORGANIZATION"},{"type":"Pete Pachal","content":"PERSON"},{"type":"Jason Hall","content":"PERSON"},{"type":"Henrik Gebbing","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Kevin Hall","content":"PERSON"},{"type":"Daim","content":"PERSON"},{"type":"Bryan Courchesne","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Roth","content":"PERSON"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Investing","Crypto Exchange","Crypto Custody"],"authors":["Sarah Morton","Jason Hall","John McNiff"]}