{"summary":"This excerpt from Dominic Frisby's book, 'Bitcoin: the Future of Money?', involves the search for bitcoin's creator, Satoshi Nakamoto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2014\/11\/08\/the-search-for-satoshi\/","publishDate":"2014-11-08T14:05:28","id":16730,"type":null,"title":"The Search for Satoshi","category":["Markets"],"content":["One of the first places where Satoshi Nakamoto mentioned bitcoin was at the P2PFoundation.ning.com. When you register there, you have to give your birthdate. Satoshi gave April 5th 1975. There might, at first, seem nothing unusual about that.","It’s easy to look through history, find some event that took place on April 5th and then attach some kind of significance to it. Pharrell Williams was born that day – perhaps Satoshi was a Pharrell Williams fan and wanted him to sing the theme tune in the bitcoin movie, should there ever be one.","But, for those who study their money, April 5th was one of the most significant dates in history. On that day in 1933, President Franklin D. Roosevelt signed Executive Order 6102, which made it illegal for American citizens to own gold.","Roosevelt confiscated Americans’ gold, gave them dollars in exchange, then de-valued those dollars by 40%, pushing the gold price upwards from $20 to $35. He did this to devalue US debt as a means to deal with the Great Depression – but some say he effectively stole 40% of Americans’ money.","There are many who regard this action as one of the most unconstitutional things the US government has ever done. It was direct theft by government from the people with no democratic process.","While the American constitution clearly states that only gold and silver should be money, suddenly those who owned gold faced imprisonment of five to ten years if they did not hand theirs over to the government.","Perhaps this is too small of a straw to clutch. After all, Satoshi didn’t say he was born in the year 1933. He gave the year 1975.","He could have put 1933 as his birthdate – but that would mean he was an unlikely 75 when he designed bitcoin. 1975 made him a rather more believable 33 in 2008.","So what happened in 1975?","1975 was the year it became legal for American citizens to own gold again.","Such is Satoshi’s meticulousness and his knowledge of monetary history, I’m sure this is no coincidence.","By combining the two dates – April 5th and 1975 – he gives himself a credible age and manages a dig at what some regard as one of the US government’s most unconstitutional actions of the past century.","It’s an obscure but brilliant reference. It is also extremely political.","As we’ll see, Satoshi was not outspoken in his political beliefs. Then again, Satoshi Nakamoto was just a vehicle to design and develop a product. Judging by the Easter eggs he has left us, the man behind Satoshi, it seems, was rather more political than we realise.","How many people are there who have the knowledge of monetary history to make a reference like that?","Again, the answer is: not many.\u2028 Particularly if you confine the search to Cypherpunks.","Bitcoin: the Future of Money? by Dominic Frisby is available at amazon.com and amazon.co.uk. The audiobook is available here.","Disclaimer: The views expressed in this article are those of the author and do not necessarily represent the views of, and should not be attributed to, CoinDesk.","Hidden identity image via Shutterstock"],"entity":[{"type":"$20","content":"MONEY"},{"type":"$35","content":"MONEY"},{"type":"Satoshi","content":"PERSON"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"1975","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"1933","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Pharrell Williams","content":"PERSON"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Dominic Frisby","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Franklin D. Roosevelt","content":"PERSON"},{"type":"April 5th 1975","content":"DATE"}],"hashtag":["Satoshi Nakamoto","Features"],"authors":["Dominic Frisby"]}