{"summary":"The feature was reinstated after advanced users complained about the constraints of Wasabi’s automated version of coin control, called “privacy control,” introduced in a previous upgrade.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/03\/21\/privacy-focused-wasabi-wallet-reinstates-coin-control-feature-in-latest-software-upgrade\/","publishDate":"2023-03-21T15:12:04","id":16744,"type":null,"title":"Privacy-Focused Wasabi Wallet Reinstates ‘Coin Control’ Feature in Latest Software Upgrade","category":["Technology"],"content":["Bitcoin privacy firm zkSNACKs has reinstated coin control in the latest iteration of its Wasabi wallet.","Coin control allows users to manually select the most private address and output configuration when sending bitcoin (BTC). Last year’s Wasabi 2.0 upgrade had introduced a more automated version of coin control called “privacy control” – much to the chagrin of Wasabi’s power users.","The bitcoin blockchain uses an unspent transaction output (UTXO) model where funds in a bitcoin address from prior transactions are considered unspent outputs. Those outputs can often be tied to a user’s identity thanks to know-your-customer (KYC) procedures at regulated entities such as centralized exchanges. From a privacy standpoint, these KYC’d coins are sometimes seen as compromised.","Coin control allows users to spot and separate the compromised outputs from more private ones, without the constraints of a fancy algorithm. The more private outputs can then be used for future transactions, lowering the chances of getting doxxed.","“Coin control is an essential privacy feature,” wrote one power user – openoms – on Wasabi’s github discussion board. “Taking it away and keeping users in the dark (behind a 'black box' algo) is counter-productive.”","Today’s announcement is part of Wasabi’s 2.0.3 release. Wasabi’s default settings will continue to automatically select which outputs to send for less-technical users.","“You asked, we listened,” zkSNACKs stated in a release provided to CoinDesk.","“We have an optional place to put the complexity, where skilled users can fine tune their wallet’s performance to their heart’s desire,” Max Hillebrand, CEO at zkSNACKs, said in the release.","Read more: Chinese 'Spies' Used Wasabi Wallet to Try to Conceal Bitcoin Bribes, Elliptic Says"],"entity":[{"type":"Max Hillebrand","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Privacy","Wasabi Wallet","bitcoin wallet"],"authors":["Frederick Munawa"]}