{"summary":"Henyep Group, a Hong Kong-headquartered financial services conglomerate, is expanding its traditional private wealth offerings into the crypto space.\nIt has formed a subsidiary called Q9 Capital to meet the increasing demand for digital assets from high-net-worth individuals and family offices.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92738\/hong-kong-henyep-bitcoin-crypto-prime-brokerage-q9","publishDate":"2021-01-27T13:28:23","id":1675,"type":null,"title":"Financial conglomerate Henyep expands to bitcoin offerings via Q9 Capital","category":["Asia"],"content":["Henyep Group, a Hong Kong-headquartered financial services conglomerate, is expanding its traditional private wealth offerings into the crypto space.","The group, founded in Hong Kong during the 1970s, has formed a new subsidiary called Q9 Capital, which officially launched crypto prime brokerage-like services last week targeting high-net-worth individuals and family offices.","The firm said in a press statement that it aims to meet growing demand from these types of institutionalized capital sources for digital assets by running a full crypto OTC desk to facilitate clients' trades and also offering crypto savings products and custodial services.","\"We view it [crypto space] as once in a life-time opportunity here because it's very rare where you have a new asset class that is spot,\" Aaron Chiu, co-founder of Q9 and executive director of Henyep Group, said in an interview. \"We see tremendous value in digital assets, which've become a truly global asset class – like gold did 40 years ago.\"","Henyep Group started as a gold dealer decades ago and has expanded its businesses into securities, foreign exchange, real estate and proprietary investment.","Chiu said the goal is to apply Henyep's dedicated client servicing experience in traditional wealth management into the crypto space. He added that while Henyep Group incubated Q9 Capital in-house, the long-term plan is to spin it off into a separate entity.","James Quinn, managing director of Q9 Capital and previously the head of markets at Hong Kong-based crypto investment firm Kenetic, said since Q9's soft launch in Q4, it has seen an uptick of interest from non-crypto native investors.&nbsp;","\"Around 90% of our clients are either completely new to crypto or did one or two investments previously but haven't been actively involved in the space – generally the Bitcoin Class 2021,\" Quinn said in an interview.","\"We have seen a definite uptick [for bitcoin] with a theme around the narrative of hedging for inflation and de-globalization,\" he said. \"That, combined with the price action, have generated interest for our client set who have bought crypto for the first time.\"","In terms of the crypto knowledge among non-native investors, Quinn said it has changed from a few years ago when it was \"really about convincing clients whether crypto is interesting at all.\"","\"I think the narrative right now is they have done some research and are pretty convinced they want to do something in the space but asking questions about platforms, services, security measures,\" Quinn said.","According to him, the average trade tickets from Q9's clients right now are \"over a couple of hundred thousand dollars\" after they allocate a relatively smaller amount as initial test trades.","\"It's definitely much bigger than retail and is exactly hitting the target market we are expecting, which is anywhere from young professionals and mass affluent all the way up to the ultra-high-net-worth,\" he said."],"hashtag":["BITCOIN"]}