{"summary":"Despite popular belief, you don't need your own wind turbine or nuclear power plant to mine crypto profitably from home in 2022.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/can-you-still-mine-bitcoin-and-other-crypto-from-home\/","publishDate":"2022-01-18T12:25:23","id":16755,"type":null,"title":"Can You Still Mine Bitcoin and Other Crypto From Home?","category":["Learn"],"content":["Over a decade ago, it used to be incredibly easy to mine bitcoin from home. You could simply cobble together a few gaming computers, or silently tap into your school or office’s infrastructure, and mine so much bitcoin that you would be set for life – provided you had diamond hands (never sold), sold at the right times or didn’t throw your hard drive away.","Despite one in a million exceptions like the bitcoin miner who managed to mine a block solo in January 2022, such crazy times are now a distant memory. The Bitcoin network has become so huge that mining operations with entire warehouses full of powerful, custom-purpose mining machines now compete against each other to earn block rewards. But there are ways in which cryptocurrency mining can still be profitable for the average person – and not just from bitcoin. In this piece, we’ll show you the tools you need to calculate your odds of turning a profit and which coins are best.","Read More: What is Bitcoin Mining Difficulty?","Bitcoin was the world’s first globally accessible cryptocurrency to popularize mining – the process of using computational power to generate a winning code (known as a hash) before anyone else in order to be selected to add a new block to the blockchain. In exchange for their effort, each successful miner is rewarded with newly minuted cryptocurrency and any fees attached to the transactions they include in the new block. This type of blockchain validation system is known as “proof-of-work.”","Read more: How Bitcoin Mining Works","When you mine a cryptocurrency, you need to be mindful of the liabilities that will cut into your profits: namely, bitcoin’s market price, the cost of electricity, maintenance fees and the cost of your mining equipment and how long it is likely to stand up against increasingly powerful miners. As more powerful machines reach the market, your once-powerful machine might not be able to keep up.","Profitability calculators, like those on Nicehash, help you determine whether your operation is likely to make or lose money. To run through an example, let’s operate on the assumption that you don’t have a hydroelectric dam at your disposal but are relying on the U.S. power grid’s average residential rate of $0.1411 per kilowatt-hour.","If you are mining bitcoin using one of Nvidia’s newer graphics cards, like the RTX 3080, you’ll generate $139 a month in bitcoin, according to Nicehash. As of January 2022, the RTX 3080 costs about $1,400.","If you are using a purpose-built AntMiner S19 Pro, Nicehash claims that you’ll turn a projected daily profit of $17.79. However, a single S19 Pro miner will cost you about $10,000, and it’s only good for mining bitcoin. Electricity costs eat up almost half of your revenue for the Antminer 19 Pro.","Because the price of bitcoin is so volatile, it’s impossible to guarantee you’ll be able to make your money back on an RTX 3080 graphics card in 10 months, or 25 months for the S19 Pro mining rig. At press time, the price of bitcoin has fallen about 10% in the past week alone.","The network difficulty, which determines how difficult it is (in computational terms) to mine new bitcoin, is also volatile. Following the crackdown on crypto mining in China in July 2021, network difficulty plummeted by 28% making it much easier for remaining miners to discover new blocks. However, this was short-lived and has since almost returned to previous highs.","Mining benefits from scale, and home miners generally stand to extract less profit per miner than a professional mining company. To cover their costs, professional mining outfits often flit between jurisdictions with cheap electricity, broker deals with local power grids, produce electricity themselves and toss away out-of-date mining hardware at a startling rate.","Still, there are plenty of other options for the weekend tinkerer to mine cryptocurrencies at home. Unfortunately, there are so many options and variables that it’s difficult to construct accurate comparisons.","There are some truisms: after a certain point, it is generally more efficient to mine bitcoin rather than ethereum with computer chips as opposed to using graphics cards, as Ethereum strongly favors graphics processing unit (GPU) miners. Though this won’t be the case for long, as Ethereum is phasing out miners ahead of its migration to a \"proof-of-stake\" blockchain system.","Sourcing the mining hardware itself also continues to be a major problem. In the bull run of 2021, the GPU market went crazy, making top graphics cards near impossible to buy at market value. To make matters more confusing, some networks, like Chia, rely on hard drives rather than graphics cards or computer chips, causing some to point the finger at Chia mining for the hard drive shortage of 2021.","That said, some profitability calculators like CoinWarz are illustrative in showing the ratio of profitability, assuming that your hash power – the amount of computational power you’re using to mine a cryptocurrency – is constant. Using a hardware budget of $1,000, CoinWarz ranks the following coins as the most profitable:","At an electricity rate of $0.411 per kilowatt, CoinWarz’s calculator claims that a thousand dollars worth of hash power will generate $20.94 a day of ethereum, more than double the $9.63 that mining ethereum classic would produce.","Small coins – those with less competition from other miners – might be more profitable. However, since the prices of smaller coins are generally more volatile than established coins, the value of your returns is far less predictable.","Whattomine predicts that by using three Radeon RX 480 cards, you will turn a daily profit of $1.21 mining firo, $1.07 mining ravencoin and $0.9 mining sero.","If you’re interested in increasing your chances of reaping mining rewards, you can also consider participating in a bitcoin mining pool. This involves joining forces with other miners to increase your odds of discovering new blocks and generating a profit – but it also means you’ll be splitting the returns.","Finally, if you don’t have the computing power at home, you can look into cloud mining and weigh the pros and cons of outsourcing your hardware needs.","Correction 01\/18\/22: This article previously stated S19 Antminer Pro profitability was $38 per month. The actual figures are $17.79 per day."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"January 2022","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"How Bitcoin Mining Works","content":"ORGANIZATION"},{"type":"$38","content":"MONEY"},{"type":"$0.9","content":"MONEY"},{"type":"$0.1411","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$1.21","content":"MONEY"},{"type":"$0.411","content":"MONEY"},{"type":"3080","content":"DATE"},{"type":"$1.07","content":"MONEY"},{"type":"$139","content":"MONEY"},{"type":"$20.94","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"GPU","content":"ORGANIZATION"},{"type":"$1,400","content":"MONEY"},{"type":"$9.63","content":"MONEY"},{"type":"$10,000","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"$17.79","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"Bitcoin Mining Difficulty","content":"ORGANIZATION"},{"type":"Chia","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","Beginner","Learn"],"authors":["Robert Stevens"]}