{"summary":"Bitcoin miner Hut 8 held on to all 328 bitcoin mined last month. As of June 30, it owned 7,406 BTC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156093\/miner-hut-8-expanded-its-bitcoin-holdings-with-june-production","publishDate":"2022-07-06T14:58:58","id":1675,"type":null,"title":"Miner Hut 8 expanded its bitcoin holdings with June production","category":["MINING"],"content":["Bitcoin miner Hut 8 deposited all 328 bitcoin mined in June.","As of June 30, the Canada-based company had 7,406 BTC in its holdings, according to a production update published Wednesday.","Hut 8 has strongly held on to the bitcoin it mines, even as market conditions have pressured other miners to sell a large portion of their holdings.","“We are confident that our HODL (hold on for dear life) strategy, coupled with the uncorrelated recurring revenue from our high performance computing business, will allow us to continue to successfully navigate the current market,” said the company's CEO, Jamie Leverton.","Last month, <a href=\"https:\/\/www.theblock.co\/post\/155853\/core-scientific-sold-7202-bitcoin-in-june-generating-167-million\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Core Scientific sold 7,202 BTC<\/a>&nbsp;— about 89% of the bitcoin holdings it had at the end of May. Bitfarms also&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">gave up 3,000 BTC to pay down part of a $100 million loan<\/a>.","In June, Hut 8 also started mining at its new North Bay, Ontario location. Production ramped up to roughly 5,800 miners operating on 20 megawatts of power by the end of the month.","\"The team had a successful month in North Bay and will continue to scale up over the next few weeks,\" Leverton said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"June 30","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Jamie Leverton","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"89%","content":"PERCENT"},{"type":"North Bay","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Ontario","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Leverton","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}