{"summary":"The proposal, introduced in February, could harden Ethereum's native cryptocurrency, ether (ETH), as a form of money – by reducing the inflation of new supply. But some members of the community say if it's not broke, don't fix it.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/05\/ethereum-foundation-researchers-proposal-to-slow-eth-issuance-draws-pushback\/","publishDate":"2024-04-05T17:56:45","id":16767,"type":null,"title":"Ethereum Foundation Researchers' Proposal to Slow ETH Issuance Draws Pushback","category":["Technology"],"content":["Earlier this year, a pair of Ethereum Foundation (EF) researchers put forth a proposal to reduce the pace of new issuance of ether (ETH) tokens. It was part of a concerted plan to reduce incentives for new stakers – the investors who lock cryptocurrency into the blockchain as a way of helping to secure the network. The freshly minted ETH is a crucial component of the rewards these investors hope to receive, in the form of staking yields.","As the researchers' thinking went, there's already enough stakers to provide effective security for the blockchain, and in fact any additional increases in the level of participation could enable the unwanted dominance of fast-growing third-party staking platforms like Lido. A side benefit of the proposed changes would be to harden ether as a form of money, since the total supply of the cryptocurrency wouldn't grow as quickly – effectively tapering ether's inflation rate.","Now, though, some members of the community are pushing back, questioning whether there's really a need to change the tokenomics of ether and, in the extreme, whether the Ethereum Foundation plays an outsize role in influencing code upgrades on the decentralized network.","The proposal was initially introduced in February by Ansgar Dietrichs and Caspar Schwarz-Schilling, both researchers at the EF. It suggests setting the blockchain's parameters so that the annual issuance of new ETH would not exceed 0.4% – a step change lower than the current effective limit of 1.5%.","The big idea is that top Ethereum researchers are satisfied with the number of stakers already working to secure the network, so it might make sense to reduce the incentives for newcomers. The change would also avoid extra dilution for ETH investors.","The current issuance rate \"dilutes ETH holders beyond what is necessary for security,\" the researchers wrote. They estimated that the proposal would reduce ETH staking yields by nearly a third.","Some members of the Ethereum community argue that the proposal is being rushed ahead without enough time for outside feedback. Viktor Bunin, a protocol specialist at Coinbase Cloud, wrote on the social-media platform X, “If it's not broke don't fix it.”","ETH staking is the main way the Ethereum network stays secure: Ethereum's \"proof-of-stake\" consensus model lets users deposit (\"stake\") ETH with the network in exchange for yield, and to help run the chain.","The substance of Dietrichs and Schwarz-Schilling's concern is that too many ETH tokens are getting staked with the network via third-party liquid staking services like Lido – crypto protocols that stake on behalf of users, and then issue derivative assets called \"liquid staking tokens\" (LSTs) representing their users' underlying deposits.","The EF researchers say they're concerned that LSTs like Lido's stETH token – the most-traded asset on Ethereum other than the ETH token itself – could eventually replace the blockchain’s native currency as the network's de facto money, making the entire system less secure.","Ethereum's security model needs ETH to be valuable in order to work, and a chief concern driving the new proposal is that if the cryptocurrency were to fall behind LSTs, it could go down in price relative to other assets.","Mike Neuder, another researcher at the EF, expanded on the initial proposal by explaining that, as “real yield from staking goes to zero,\" stakers will need to \"rely on exogenous rewards for profitability.”","Reducing the ETH issuance rate could enhance Ethereum's economic model by making ETH scarcer, potentially increasing its value.","Some community members, however, are pushing back on the argument that changing the tokenomics of the blockchain will improve Ethereum’s economic model.","Jon Charbonneau, co-founder at crypto investment firm DBA, wrote on X that “these tweaks try to solve an unsolvable problem of fundamental tradeoffs in PoS.” PoS stands for \"proof-of-stake,\" which is the core process or \"consensus mechanism\" used to secure the blockchain.","Paul Dylan-Ennis, a lecturer and assistant professor at the University College Dublin School of Business, wrote that “it seems to me it's not really issuance that is at stake, so much as people have a sense that EF-associated devs and researchers appear to have an outsized power.” He added that “they are not engaging in the appropriate level of 'rough consensus' from the wider set of stakeholders.”","The skepticism elicted responses from key figures within the Ethereum ecosystem, and at the Ethereum Foundation specifically.","Notably, Vitalik Buterin, the influential co-founder of the Ethereum blockchain, is one of three members of the executive board of the Ethereum Foundation, according to its website. The organization is described as a \"non-profit that supports the Ethereum ecosystem,\" and part of a \"larger community of organizations and individuals that fund protocol development, grow the ecosystem and advocate for Ethereum.\"","Tim Beiko, protocol support lead at the foundation, pushed back on Dylan-Ennis’ commentary, arguing that “it's pretty empirically untrue that 'core devs' or 'the EF' are uncontested re: governance. this current conversation is a clear example.”","\"Core devs\" is shorthand for the broader, group of developers – drawn from multiple companies and organizations, as well as individuals – who participate in regular discussions over the network's rules, code, upgrades and strategy roadmap.","Beiko added that: “I think core devs + researchers generally treat ethresearch+ethmag as a place to post WIP ideas\/proposals, whereas the broader community tends to perceive it as a place where the Official Roadmap gets shared after it's ~final.”","Dietrichs, the co-author of the initial proposal, responded that the \"intention was purely to propose this change for consideration to the community.\"","“Of course any change to such a sensitive part of the protocol requires broad community buy-in,\" Dietrichs wrote. \"We tried to be clear about that from the beginning, but could certainly have done a better job.”","Read more: Ethereum Finalizes 'Dencun' Upgrade, in Landmark Move to Reduce Data Fees"],"entity":[{"type":"Ennis","content":"PERSON"},{"type":"Paul Dylan","content":"PERSON"},{"type":"Ansgar Dietrichs","content":"PERSON"},{"type":"Dylan","content":"PERSON"},{"type":"Caspar Schwarz","content":"PERSON"},{"type":"Schilling","content":"PERSON"},{"type":"DBA","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Reduce Data Fees","content":"ORGANIZATION"},{"type":"0.4%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Viktor Bunin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Jon Charbonneau","content":"PERSON"},{"type":"Ethereum blockchain","content":"PERSON"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Mike Neuder","content":"PERSON"},{"type":"WIP","content":"ORGANIZATION"},{"type":"University College Dublin School of Business","content":"ORGANIZATION"},{"type":"Schwarz","content":"PERSON"},{"type":"Coinbase Cloud","content":"ORGANIZATION"},{"type":"Dencun","content":"PERSON"}],"hashtag":["Ethereum","Ether","ETH","Staking","Ethereum Foundation","Staking rewards","Staked eth","Liquid staking","Restaking","Lido"],"authors":["Margaux Nijkerk"]}