{"summary":"Sam Bankman-Fried&#x27;s lawyers appeared to struggle with cross-examining today&#x27;s witnesses, two of whom were longtime friends.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255095\/inside-the-trial-sbf-faces-his-former-friends","publishDate":"2023-10-05T19:58:20","id":1676,"type":null,"title":"Inside the trial: SBF faces his former friends","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">As FTX's collapse began, Sam Bankman-Fried received a message from Adam Yedidia, one of the exchange's senior developers and his roommate at the time. \"I love you Sam. I’m not going anywhere, don't worry,\" it read. Gary Wang, another longtime friend and the co-founder of both Alameda Research and FTX, was the last person other than Bankman-Fried himself to leave the $35 million Bahamian penthouse they shared with Yedidia and other senior FTX employees, according to reports.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet both men faced Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/255071\/inside-the-courtroom-sbfs-former-roommate-is-back-on-the-stand\" data-v-f87c67ca=\"\">today to testify<\/a>, under immunity agreements, that their onetime friend, roommate, and boss had leveraged their technical experience to keep his empire afloat, even if it meant breaking the law — or lying to investors like Matt Huang, co-founder of <a href=\"https:\/\/www.theblock.co\/post\/252862\/paradigm-launches-policy-lab-in-move-to-advance-crypto-advocacy\" data-v-f87c67ca=\"\">Paradigm<\/a>, who was also questioned today.<\/span>","<span data-v-f87c67ca=\"\">With his former friends on the opposite side of the room, Bankman-Fried had only his lawyers for backup. They appeared to be struggling, though: out of 21 overruled objections today, 15 came from the defense. Out of 55 sustained objections, Judge Lewis A. Kaplan ruled in the defense's favor only six times.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kaplan appeared to lose patience with the defense as the day progressed, taking issue with the repetitive nature of their questioning. \"We have been up and down that mountain a couple of times,\" Kaplan remarked in response to one of the defense's questions. \"This is needlessly repetitive, counsel,\" he replied to another. \"That's the third time since lunch you've made that point,\" he told defense attorney Christian Everdell, mere minutes after lunch.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The day's testimony largely concerned the relationship between Alameda Research, the sister trading firm co-founded by Bankman-Fried and Wang, and FTX, the exchange also co-founded by the two men.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yedidia <\/span><a href=\"https:\/\/www.theblock.co\/post\/255071\/inside-the-courtroom-sbfs-former-roommate-is-back-on-the-stand\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">testified<\/span><\/a><span data-v-f87c67ca=\"\"> that he had designed the automated system by which wire transfers to an Alameda Research-owned bank account were automatically credited to user accounts, and kept track of in an internal database entry known as “<\/span><a href=\"https:\/\/www.theblock.co\/post\/254855\/inside-the-courtroom-why-fiat-will-be-key-to-the-sbf-trial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">fiat@<\/span><\/a><span data-v-f87c67ca=\"\">.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yedidia also testified that a bug in the code overstated Alameda's liabilities to FTX by $8 billion, leading the fiat@ account to appear to have a balance of -$16 billion. (The magnitude of the apparent liability begs an obvious question — Did Alameda CEO Caroline Ellison ever see that figure?)<\/span>","Following Yedidia’s testimony, Paradigm's Huang described the process by which the VC firm decided to invest a total of around $278 million into FTX over two rounds. Huang said that FTX's early rapid growth in market share excited him, but that he was concerned by FTX's lack of a formal governance structure or even a board of directors. Huang also recalled being told by Bankman-Fried that Alameda Research had no preferential treatment on the FTX exchange.","As far as Paradigm’s investment? \"We have marked it to zero,\" Huang stated.","<span data-v-f87c67ca=\"\">Wang testified that, under Bankman-Fried's direction, Alameda Research was given the ability to withdraw funds even if its account had a negative balance. Wang noted that the funds, in that circumstance, would come from FTX customer deposits.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang also testified that Alameda Research had access to a $65 billion line of credit as a market maker on the exchange, and had \"slightly faster\" access to the platform than other market makers, which typically had credit lines on the order of \"single to double digit millions.\"<\/span>","Wang has long been seen as somewhat of an enigma, but in court today, the 30-year-old readily answered questions from the prosecution. His responses came so speedily, in fact, he was asked to slow down so the court reporter could properly transcribe his testimony.","<span data-v-f87c67ca=\"\">While Wang testified, Bankman-Fried appeared to pay close attention, refraining from his usual practice of taking notes on his laptop. He even sat still in his seat, a change from his typical fidgeting. His father, Joseph Bankman, took notes while his wife, Barbara Fried, sat beside him.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The prosecution has not finished examining Wang, who will also face cross-examination from the defense tomorrow. The Block will be back in the courthouse tomorrow for continuing coverage of the trial.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yedidia","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"Kaplan","content":"PERSON"},{"type":"$65 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"$278 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"$35 million","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Matt Huang","content":"PERSON"},{"type":"Wang","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Christian Everdell","content":"PERSON"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Adam Yedidia","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","The Block"]}