{"summary":"Nefta raised $5 million in seed funding at a $32.5 million valuation.\nThat’s a 225% jump in its valuation from last June.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212432\/web3-tooling-startup-nefta-raises-seed-round-at-32-5-million-valuation","publishDate":"2023-02-16T08:30:08","id":1676,"type":null,"title":"Web3 tooling startup Nefta raises seed round at $32.5 million valuation","category":["Deals"],"content":["Nefta, a web3 infrastructure startup focused on gaming and entertainment sectors, raised $5 million in a seed funding round.","Play Ventures led the round by injecting $2.5 million — the single largest investment from its Future Fund — Nefta said Wednesday. Other investors in the round included Polygon Ventures, SevenX Ventures, Sfermion and Picus Capital.","Nefta is now valued at $32.5 million, founder and CEO Geeshan Willink told The Block. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">That's a 225% jump in its valuation in the last eight months. Nefta was valued at $10 million last June when it raised $1 million in pre-seed funding from Picus Capital, said Willink.<\/span>","Nefta wasn't formally raising the seed round, according to Willink, who said SevenX Ventures first approached the firm last October. \"That conversation went so well that we received a term sheet to follow in our seed round. Following this, we received the lead term sheet from Play Ventures,\" he said. Nefta then met more investors and closed the round in January.","The startup was founded last year to provide tools to businesses looking to enter and grow in the web3 space. These tools include bespoke APIs, software development kits and white-label services to help businesses integrate digital assets, multi-chain wallets and custom marketplaces.","\"We've seen great demand for our products over the last 12 months, and we'll continue to scale our offering in accordance with this demand,\" said Willink.","There are currently eight people working for Nefta and Willink plans to double the team in the near future. He is currently hiring across functions, including business development, account management and technology.","The seed round brings Nefta's total funding to date to $6 million. As part of the deal, Kenrick Drijkoningen, general partner at Play Ventures, will join the Nefta board, said Willink."],"hashtag":["SEED &AMP; PRE-SEED"]}