{"summary":"Knowing how to move your cryptocurrencies is fundamental to risk management and preventing crypto losses when bad things happen on exchanges.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/crypto-risk-management-how-to-get-your-wealth-off-an-exchange\/","publishDate":"2022-08-04T19:45:00","id":16774,"type":null,"title":"Crypto Risk Management: How to Get Your Wealth Off an Exchange","category":["Learn"],"content":["Keeping your cryptocurrencies in exchanges comes with risks, and there are dangers in doing so for a long period of time. Crashes, hacks and exploits have resulted in losses of hundreds of millions of dollars in the short history of cryptocurrency. The stunning collapse of FTX goes to show how quickly fortunes can change even with the biggest names in crypto, and recent scrutiny of Binance has people worried anew about keeping their crypto in centralized exchanges.","If your intention is to buy and sell digital assets quickly, it’s convenient to leave them in an exchange. It is much safer, however, to store your digital assets in what’s known as cold storage, and it’s important to also know how to cash out into fiat, like the U.S. dollar, from whatever exchange or exchanges you’ve invested in.","While many people begin their crypto investment journey by opening an account on an exchange like Coinbase or Binance, they are not without risks. Here are some common ones:","There’s a famous saying in crypto, “not your keys, not your coins,” which basically means if you are entrusting another entity, such as an exchange, to hold the private keys to your crypto, it is the one who controls your crypto, not you.","To keep things simple, you want to have custody or control over your crypto and to not give that power to an exchange or other third party. To do so, you need a crypto wallet that gives you custody. There are two main kinds of these wallets, hot wallets and cold wallets.","A hot wallet gives you custody, but because it's connected to the internet, it's vulnerable to hacks such as the recent one on Solana wallets and past exploits such as KuCoin’s hot wallets being drained of $280 million.","A cold wallet is the safest way to protect your wealth regarding cryptocurrencies because it keeps your tokens offline. A cold storage wallet has no connection to the internet, which dramatically decreases the ability of hackers and cybercriminals to access your assets, keeping them safe and secure.","Some of the most popular cold storage devices are hardware-based, such as the Ledger Nano S and Trezor Model One. Additionally, a cold storage device offers better risk management and control than exchanges. When you hold crypto in a cold wallet, it completely belongs to you, giving you freedom to sell and trade when you want, how you want and with whom you want. Letting a crypto exchange store your digital assets falls under their surveillance and conditions.","Read more: How to Store Your Bitcoin","The steps for withdrawing your cryptocurrencies are similar among all exchanges:","For more detail on the process and how to set up a cold storage device, here’s our review of the Ledger Nano S Plus, which includes a step-by-step example of how it works with that device.","Cashing out into fiat, such U.S. dollars, is another option if you feel the investment risks of all cryptocurrencies or a specific cryptocurrency have risen above your comfort level. Exiting your positions and converting them into government-issued money will remove your wealth from any risk of hacks and the volatile nature of the crypto market.","There are times when the crypto markets are choppy and volatile, and 2022 has been a year of corrections and crashes in crypto. Whether you are unsure of the markets or are bearing large financial risk, cashing out even 50 percent of your portfolio can relieve you from the stress of what is still a highly speculative and volatile market and give stability to your financial planning.","There are times in recent history when cashing out into fiat would have saved your wealth – for example, the start of the Covid-19 pandemic or when China banned crypto transactions, both of which resulted in a crypto crash.","Cashing out your cryptocurrencies in the early stages of a crypto crash or correction can also help you sleep at night.","Being prepared for a turn of events in the crypto market is critical. Converting your crypto into fiat to withdraw from your bank account is a simple process:","1. If necessary, convert your cryptocurrency to a more popular one such as BTC or USDT, as not every crypto on an exchange can always be directly cashed out for fiat.","2. Select the cryptocurrency you would like to convert to fiat. This option is usually in a dropdown menu where you choose, for example, U.S. dollars or euros.","3. Upon confirming your selection, choose where\/how you would like to receive the fiat you exchanged. With many exchanges, you can receive payment through debit credit cards or ACH (U.S.-supported wire transfer).","4. Finally, check whether your funds are delivered into the account you chose.","\n","\n","\n"],"entity":[{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Ledger Nano","content":"ORGANIZATION"},{"type":"19","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"50 percent","content":"PERCENT"},{"type":"China","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$280 million","content":"MONEY"}],"hashtag":["Learn","Cryptocurrency","Beginner"],"authors":["Mike Antolin"]}