{"summary":"The principle of an open internet underpinned the growth of the early Web and is just as necessary now. If only the SEC could back innovation in a similar way, says Sarah Aberg, General Counsel at Nova Labs, the company behind Helium Mobile.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/08\/the-fccs-net-neutrality-ruling-is-good-news-for-web3-startups\/","publishDate":"2024-05-08T20:46:03","id":16773,"type":null,"title":"The FCC’s Net Neutrality Ruling Is Good News for Web3 Startups","category":["Consensus Magazine"],"content":["Last month’s FCC vote to restore net neutrality rules is a welcome example of forward-looking, innovation-friendly regulation. Rules aimed at ensuring an open internet are a model for the kind of regulation that champions innovation in the digital era and exemplifies core American values. Other regulators would do well to take note.","Opponents of net neutrality like to argue that rules guaranteeing equal access aren’t necessary (go back and watch John Oliver’s reports for an excellent refresher). They claim the old rules were perfectly suited for oversight of the modern internet, even though those rules were written for old-school telephone service.","Sarah Aberg is the General Counsel at Nova Labs, a pioneer in decentralized wireless networks and the creators of Helium Mobile.","While some regulators seem stuck in the 1930s and 40s (sound familiar?), the FCC is showing that it understands that 21st century technologies require 21st century regulations. The FCC’s net neutrality rule encourages innovation opportunities here in the U.S. because it means new technologies, applications, and services – some running on blockchain, some not – can join the marketplace and participate in fair competition for consumer attention.","It wasn’t always the case that you could choose your own phone, or design and run new applications on the nation’s telecom network. Before 1968, only a Western Electric phone could be plugged into a phone line because the incumbents argued that other devices could damage the network. It would be almost another 20 years before the government forced incumbents to open the network to competitive providers.","The development of packet-switching protocols – like TCP\/IP, which makes the modern Internet possible – took this evolution a giant step further. Today, a voice call is just a set of data packets that the network is tasked with delivering from the device where it originates to the device where it terminates. Same for a web page, a YouTube video or a ChatGPT session. These are all just packets of data that travel over the network. And net neutrality says that the network providers can’t discriminate by prioritizing sending data packets from some commercial providers over others.","This principle has made possible a long list of home-grown internet applications that live at the endpoints and run on the network. Many, like YouTube and Netflix, or Zoom and Facetime, are core components of American (and global) social and work life. Without net neutrality regulations, network providers could have stopped Zoom or Facetime from ever coming into being, favor their own services over any potential new entrants, and pick and choose who they compete with, if you can even call that competition.","Fair regulations create a sandbox for creative ideas to flourish and test themselves in the market. Blockchain-based solutions are ripe for creative innovation designed on the modern internet and with the potential to change much more than modern finance. But we need fair, clear, and smart regulations to do so in the US.","That’s what net neutrality does for innovators seeking to operate on the network. Think about generative AI or the blockchain-enabled affordable phone service offered by my company, Helium Mobile. Capabilities like these are the champions – and consequence – of the original intent of the Internet and net neutrality principles. Open access to the network is critical for their development and healthy competition.","Net neutrality guardrails protect new competitors like Helium Mobile from unfair network practices. Helium’s decentralized system of internet-connected hotspots creates a new dynamic network for wireless connectivity that challenges conventional wisdom about how phone networks are built and owned. Net neutrality makes it possible for us to innovate and compete in the wireless space with some of the most powerful companies in the world, including some of the network providers themselves.","Decentralized ownership of public infrastructure networks (DePIN) through token rewards for building and maintaining the network are among the myriad innovations made possible by blockchain. In our case, that’s wireless communications.","DePIN is uniquely situated to solve sticky problems like providing sustainable connectivity to rural and underserved communities, by empowering the members of those communities to create their own wireless infrastructure, tailored to their own use. However, the mere fact that DePIN involves blockchain and tokens has swamped it in a morass of regulatory uncertainty created by the enforcement-first approach taken by some other federal agencies. That uncertainty stifles competition, stifles innovation in America, and stifles opportunity for consumers.","The FCC has provided a model for what a smart regulatory approach looks like. By accounting for the evolution and development of the industry and markets it regulates, the regulator’s approach enhances the scale and scope of future innovation as much as possible consistent with essential protections for consumers and critical infrastructure.","Mirroring the FCC’s approach, rather than raising the drawbridge, regulators should engage with innovating DePIN projects to learn about the technology, innovation potential, and emerging capabilities that can usher infrastructure into the digital era and change the way consumers interact with and own that infrastructure. We can simultaneously protect consumers from undue harm and make possible the kinds of innovations that will give consumers choice in the market. That philosophy is one that will benefit U.S. consumers, society, and the economy in the next phase of the digital era.","Edited by Benjamin Schiller."],"entity":[{"type":"Helium Mobile","content":"ORGANIZATION"},{"type":"Facetime","content":"ORGANIZATION"},{"type":"FCC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Western Electric","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"1968","content":"DATE"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"1930s","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"Sarah Aberg","content":"PERSON"},{"type":"John Oliver’s","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Nova Labs","content":"ORGANIZATION"},{"type":"TCP","content":"ORGANIZATION"},{"type":"General Counsel","content":"ORGANIZATION"}],"hashtag":["Opinion"],"authors":["Sarah Aberg"]}