{"summary":"The Wall Street firm is seeking $2 billion in commitments from investors to buy distressed assets at steep discounts if the crypto lender goes bankrupt.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/24\/goldman-sachs-raising-funds-to-buy-celsius-assets-sources\/","publishDate":"2022-06-24T20:12:48","id":16782,"type":null,"title":"Goldman Sachs Leading Investor Group to Buy Celsius Assets: Sources","category":["Finance"],"content":["Goldman Sachs is looking to raise $2 billion from investors to buy up distressed assets from troubled crypto lender Celsius, according to two people familiar with the matter.","The proposed deal would allow investors to buy up Celsius’ assets at potentially big discounts in the event of a bankruptcy filing, the people said.","Goldman Sachs appears to be gauging interest and soliciting commitments from Web3 crypto funds, funds specializing in distressed assets and traditional financial institutions with ample cash on hand, according to a person familiar with the situation. The assets, most likely cryptocurrencies having to be sold on the cheap, would then likely be managed by participants in the fundraising push.","Celsius has tapped restructuring advisory firm Alvarez & Marsal, the Wall Street Journal reported Friday afternoon.","Goldman Sachs did not respond to a request for comment.","Celsius, which had more than $8 billion lent out to clients and $12 billion in assets under management as of May of this year, abruptly announced on June 12 that it would stop withdrawals from its platform, citing “extreme market conditions.” The disclosure exacerbated those conditions, briefly sending bitcoin’s price below $20,000.","In addition to hiring Alvarez & Marsal, Celsius has tapped restructuring attorneys from law firm Akin Gump Strauss Hauer & Feld, the Wall Street Journal reported earlier this month. Global investment bank Citigroup has also been enlisted by Celsius to advise on possible solutions, including an assessment of an offer from rival crypto lender Nexo, The Block reported.","Citigroup (C) and Akin Gump have both recommended Celsius file for bankruptcy, according to people familiar with the matter. Citigroup declined to comment. Akin Gump did not immediately respond to a request for comment.","Celsius raised $750 million from investors last year, including Canada’s second-largest pension fund, Caisse de dépôt et placement du Québec (CDPQ), valuing the business at $3.25 billion.","UPDATE (June 24, 20:41 UTC): Adds clarifying sentence in third paragraph.","UPDATE (June 24, 21:10 UTC): Modifies headline."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Alvarez & Marsal","content":"ORGANIZATION"},{"type":"$3.25 billion","content":"MONEY"},{"type":"Akin Gump Strauss Hauer & Feld","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"$750 million","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$12 billion","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"afternoon","content":"TIME"},{"type":"$8 billion","content":"MONEY"},{"type":"June 24","content":"DATE"},{"type":"June 12","content":"DATE"}],"hashtag":["Celsius","Crypto Lending","Goldman Sachs"],"authors":["Tracy Wang"]}