{"summary":"The hacking group sent more than 40 transactions to Tornado Cash over the past 24 hours.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/14\/north-korean-hackers-used-tornado-cash-to-launder-12m-from-heco-bridge-hack-elliptic\/","publishDate":"2024-03-14T15:58:28","id":16786,"type":null,"title":"North Korean Hackers Used Tornado Cash to Launder $12M From Heco Bridge Hack: Elliptic","category":["Finance"],"content":["North Korean hackers tied to its infamous Lazarus Group have used coin mixing service Tornado Cash to launder $12 million worth of ether (ETH) over the past 24 hours.","Research from blockchain analytics firm Elliptic shows that more than 40 transactions have been sent by Lazarus Group to Tornado Cash on March 13 and March 14. Elliptic has also attributed a $100 million Heco Bridge and HTX hack last November to Lazarus Group.","Lazarus is responsible for hacks worth more than $3 billion over the past six years, according to a report by cybersecurity firm Recorded Future.","Tornado Cash was hit by U.S. sanctions in August 2022. This spurred Lazarus Group to use another mixer, Sinbad, to obfuscate their ill-gotten gains. However, Sinbad itself was seized by U.S. authorities in November, prompting Lazarus to make the shift back to Tornado Cash, Elliptic said in its blog post. One of Tornado Cash's founders, Roman Storm, was arrested last year and is awaiting trial on money laundering charges. Another, Roman Semenov, has been charged but has yet to be arrested.","Despite being sanctioned twice, Tornado Cash still runs via decentralized smart contracts that cannot be seized or taken offline.","\"The change in behavior and return to the use of Tornado Cash likely reflects the limited number of large-scale mixers now operating, thanks to law enforcement takedowns of services such as Sinbad.io and Blender.io,\" Elliptic said.","Edited by Nikhilesh De."],"entity":[{"type":"Sinbad","content":"LOCATION"},{"type":"Lazarus","content":"PERSON"},{"type":"Elliptic","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$12 million","content":"MONEY"},{"type":"August 2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"March 14","content":"DATE"},{"type":"March 13","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"last November","content":"DATE"},{"type":"Roman Semenov","content":"PERSON"}],"hashtag":["Lazarus group","Hack","Elliptic","Sanctions","Tornado Cash"],"authors":["Oliver Knight"]}