{"summary":"The company is consulting with experts to try to reduce the fallout from its mid-June swoon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/30\/crypto-lender-celsius-network-exploring-options-to-preserve-and-protect-assets\/","publishDate":"2022-06-30T22:19:30","id":16780,"type":null,"title":"Crypto Lender Celsius Network Exploring Options to ‘Preserve and Protect’ Assets","category":["Finance"],"content":["Crypto lending platform Celsius is exploring options to “preserve and protect assets” following its mid-June turmoil, according to an announcement published on the firm’s blog on Thursday.","“Across Celsius today we are focused and working as quickly as we can to stabilize liquidity and operations, in order to be positioned to share more information with the community,” the post reads.","These actions could include “pursuing strategic transactions” and “restructuring its liabilities,” among other strategies, the company said. “These exhaustive explorations are complex and take time, but we want the community to know that our teams are working with experts from many different disciplines,” Celsius wrote.","On June 12, Celsius announced it was freezing withdrawals and transfers in response to “extreme market conditions,” fueling rumors that the platform had become insolvent. The move left 1.7 million users unable to redeem their assets, and sparked fears that funds would be locked indefinitely.","The firm has hired restructuring consultants from Alvarez & Marsal, an advisory firm, to explore the possibility of bankruptcy filings, according to people with knowledge of the matter who spoke to the Wall Street Journal last week.","The lender’s financial issues come amid a wider crypto market crash. In May, algorithmic stablecoin terraUSD and its sister coin LUNA imploded spectacularly in a $40 billion collapse, destabilizing the cryptocurrency market and spurring $300 billion in losses across the cryptocurrency economy.","The crash has been driven, in part, by the U.S. Federal Reserve’s efforts to fight sky-high inflation through a series of aggressive interest rate hikes, which has fueled a bout of risk-off selling of digital assets.","Prior to the crash, Celsius experienced massive success in its fundraising, accruing $750 million in its latest funding round in November 2021 at a valuation just north of $3.25 billion. As of May 2022, the firm had lent out more than $8 billion to clients and had $12 billion in assets under management.","Read More: How Crypto Lender Celsius Overheated"],"entity":[{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"How Crypto Lender Celsius Overheated","content":"ORGANIZATION"},{"type":"Alvarez & Marsal","content":"ORGANIZATION"},{"type":"$3.25 billion","content":"MONEY"},{"type":"$300 billion","content":"MONEY"},{"type":"$750 million","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$12 billion","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"June 12","content":"DATE"}],"hashtag":["Celsius","Crypto Winter"],"authors":["Elizabeth Napolitano"]}