{"summary":"Crypto custodians are in a race to build the next State Street or BNY Mellon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/06\/11\/custody-battle-pits-institutional-boomers-against-crypto-upstarts\/","publishDate":"2020-06-11T09:00:00","id":16789,"type":null,"title":"Custody Battle Pits Institutional Boomers Against Crypto Upstarts","category":["Finance"],"content":["","Crypto custodians are in a race to build the next State Street or BNY Mellon. ","","","There are only a handful of these types of large custody banks and most of them have been around for hundreds of years. But crypto is such a striking example of old world meeting new that it offers firms a rare opportunity to break into a market that would simply be impossible under normal circumstances.","","","“In the traditional world you can’t really build a custodian, it’s not something you can just break into,” said Diogo Monica, co-founder of Anchorage, a Silicon Valley-based custody platform specializing in crypto. “BNY Mellon has been around for 300 years and now, in crypto, we have a chance to actually build a foundational company that is potentially going to last for that long,” added Monica.","","","It’s an inspirational long view for sure, but how will things evolve over the short term?","","","Recent acquisitions in the crypto space have seen a bundling together of services such as custody, settlement, lending and trade execution. The latest push along the prime broker route came Wednesday with bitcoin futures platform Bakkt teaming up with Galaxy Digital to combine custodial and trading capabilities.","","","Read more: Behind ‘Prime Broker’ Buzzword Lies a Complex Strategy Game for Crypto Firms","","","If crypto is entering a period of accelerated consolidation and following similar lines to the traditional world, firms specializing in standalone custody or trade execution may need to pivot to offer additional services or risk being swallowed up.","","","An evolution towards something like traditional finance is definitely how regulated crypto custodian BitGo sees it playing out. ","","","“This space is going to consolidate very quickly around big strong reputable brands, much like what happened with State Street, JPMorgan, BNY Mellon,” said BitGo CEO Mike Belshe.","","","The recent unveiling of BitGo Prime allows the platform’s customers to trade directly from cold storage (where cryptographic keys are held deep inside BitGo’s offline, insured vaults) across a choice of two exchanges and two large over-the-counter (OTC) desks. ","","","This saves firms the rigmarole of opening and funding accounts at various exchanges and moving assets around, said Belshe, declining to name the venues currently connected to BitGo’s incipient trading offering.","","","“All four are tier-one, top-ranked, regulated businesses you’d recognize. We will start naming them in due course. The plan is to grow that by the end of the year to more than a dozen,” Belshe said.","","","Although a one-stop-shop prime broker platform seems to be what many crypto firms now aspire to, it could be about the buzzword rather than a full understanding of the services being provided.  ","","","Prime brokerage is more of a financial services function than a tech function, a fact that may be lost on the new breed of crypto pioneers, said Michael Moro, CEO, Genesis Trading, which recently acquired standalone custodian Vo1t. (Disclosure: Genesis is owned by CoinDesk parent company Digital Currency Group.)","","","Read more: Genesis Trading Buys Crypto Custodian Vo1t in Bid to Become Prime Broker","","","“As well as having a large balance sheet, attention to client services is an essential aspect when it comes to choosing a prime broker platform,” said Moro. “I think everyone wants the white glove, high touch service, which is how prime brokerage works in traditional finance. But that’s very different from a tech software model.”","","","The latter approach is to try and scale the business through technology as much as possible, rather than hiring customer service representatives or business development staff, Moro said.  ","","","“In institutional finance, the ability to pick up the phone and speak to your coverage person is so important,” he said. “Being able to speak to a human being, as opposed to clicking a few buttons on a platform, I think will be a differentiator among what prime broker platforms are around in a year or two.”","","","It’s tempting to write this off as an overly cautious crypto boomer approach, pandering to traditional legacy systems. But to do so could be a strategic error.","","","A focus on gently transitioning traditional capital markets over to crypto is gaining traction for London-based Koine, which is offering a post-trade solution for digital assets combining custody, settlement and cash management. Koine’s solution has so far been rubber-stamped by regulators in the U.K. and the United Arab Emirates. ","","","“The path we envisage involves the ability to transition from existing infrastructure, rather than a new model everyone must switch to,” said Phil Mochan, Koine’s co-founder and head of strategy.","","","Read more: Coinbase Buys Tagomi as ‘Foundation’ of Institutional Trading Arm","","","Building bridges between existing market infrastructure and crypto native exchanges is something Koine is tackling in stages, said Mochan. Bitfinex was the first exchange to publicly announce an integration with Koine, and there are currently 12 other workflow models at different stages depending on the trading venue or OTC desk, he said. ","","","“It’s not going to happen overnight,” said Mochan, framing the technological challenge specifically in terms of old-meets-new. “We find there are operational issues around API work almost everywhere, and that’s because 21-year-olds have built these platforms.”","","","Over the past couple of years, custody platforms have sought to differentiate themselves by offering new and innovative services such as earning yields on proof-of-stake (PoS) tokens by verifying transactions on a network or participating in governance decisions.  ","","","However, Moro of Genesis said that while this might have looked like a product differentiator at one stage, it no longer really counts – since many custodians now offer staking and even exchanges such as Binance have gotten in on the act.  ","","","“If you’ll pardon the pun, staking has become like table stakes for holding onto customers' funds,” said Moro. “I think it’s really hard to differentiate yourself because the barrier to mimicking is not that high.”","","","But not all staking services are the same, just as not all custody is the same, said Monica of Anchorage, which uses a complex blend of hardware security modules (HSMs), threshold signing and multiple signatures to lock down crypto assets. ","","","Read more: Beyond Storage: How Custody Is Evolving to Meet Institutional Needs","","","“The space is rife with people using manual operations from 10 years ago, where they have to actually go to a vault,” Monica said, adding that cold storage solutions of this type became unworkable under COVID-19 lockdown and social distancing.","","","On the subject of providing staking services, Monica said: “This stuff is hard to build. It may be table stakes in the sense that nobody wants to store an asset with you unless you can generate yield for it. Nobody wants to drop dividends on the floor in the traditional market so why would that be different in crypto?”","","","Anchorage’s strategy from day one has been to build everything in-house, said Monica, pointing to the Frankenstein-like assemblage of crypto’s recent crop of aspiring prime brokers. ","","","“This can’t just be bolted on. Everything that touches a cryptographic private key is deserving of the ultimate security and attention,” he said. “The path to prime [brokerage] is not by bolting on different solutions built by different individuals and companies with different backgrounds and philosophies.”","","","An unavoidable consequence of crypto prime brokerage is further centralization in a sector built on the premise of decentralization. While the prime broker model may bring a concentration of risk plus added costs, asking traditional players to try out new variants like DeFi (decentralized finance) is a big ask.","","","Nevertheless, the fast-growing world of DeFi is attracting lots of attention since it eschews traditional finance rather than simply trying to replicate it. With that, comes alternative approaches to trading, settlement and also custody. ","","","Read more: Crypto Long & Short: The Emergence of Prime Brokers Adds Resilience but Also Risk","","","“We have exactly the same goals but we always try to be slightly less centralized, as much as we possibly can,” said Alex Batlin, CEO of Trustology, a custody platform backed by ConsenSys and Two Sigma Ventures. ","","","“The question is,” Batlin said, “do you wrap it all up like in the old days into a single prime broker with all the risks associated with that, or do you try achieve the same goals but with the lower prices and lower risk associated with decentralization?”","","","The DeFi custody hypothesis also does away with cold storage: Trustology uses HSMs for near real-time access to assets that cannot be commingled in omnibus accounts. ","","","While the DeFi space is definitely tech-first, Trustology recognizes self-custody without controls is not fit for business or institutional contexts.","","","“There’s an emerging white space which we are trying to fill,” said Batlin, “We can sign any ethereum transaction or any DeFi protocol fast and segregated, and apply controls.”","","","Trustology sees decentralized clearing as a viable alternative option, with custodians acting as settlement agents, trying up with protocols like AirSwap. Brokers are also eyeing the billion or so dollars of liquidity locked up in DeFi, said Batlin.  ","","","“Brokers are looking to access liquidity and margin on those protocols; asset managers are looking at it the same,” he said. “There are possibly some really interesting plays around committing funds to staking, to collateralized lending, so you get the ability to do a long while being at yield that’s relatively safe.”","","","While Trustology is focused on Ethereum, Fidelity-backed KNØX is applying its energy towards Bitcoin. ","","","Read more: In Rare Deal, Crypto Custodian Wins Insurance on Full Value of Client Assets","","","The Canada-based custodian, which holds insurance from mega-broker Marsh, is “philosophically aligned” with Bitcoin and the technologies being built on top, according to KNØX co-founder and CEO Alex Daskalov.","","","“We have yet to see a custodian that has a tight integration with the Lightning Network, for example,” Daskalov said, referring to the bitcoin scaling solution built for faster payments. “We would love to be there in lockstep with a lot of the tech riding on Bitcoin and layers above it such as Lightning and Liquid.”","","","Growth in the traditional trading space is not all about competition, there’s co-operation too, which benefits the whole market. There’s also evidence of this among some crypto custodians and brokers ","","","For example, recently launched prime broker BeQuant, which has its own custody solution, says it is open to working with other custodians in the space, as clients want to spread risk just as they do in traditional finance.","","","“I think you need those standalone guys,” said Richard Shade, BeQuant’s head of custody. “We are open to working and collaborating with a number of these guys and we are talking to all of them, because we realize our customers may already be using them.”","","","Read more: Bequant Launches Crypto Prime Brokerage to Compete for Institutional Money","","","London-based custodian Copper, which raised an $8 million Series A in February, says it is also happy to collaborate, as well as compete.","","","“We are happy to work with people on financing and with people on clearing,” said Copper founder and CEO Dmitry Tokarev, who added that the recent funding affords the firm a further 18 months of runway.","","","Copper’s ClearLoop settlement solution differs from something like BitGo’s, which is geared towards everyone having a BitGo account, Tokarev said. ","","","“We have already asked other custodians to join the network because that is the best solution for clients at the end of the day. The more exchanges and custodians that join the network, the more efficient (and secure) the entire trading ecosystem becomes. It’s better for everyone, not just Copper,” Tokarev said.","","","It’s not all kumbaya around the crypto-custody campfire, however. When it comes to the crypto prime broker race, BitGo likes to take a jab at arch-rival Coinbase.","","","Last year, when Coinbase acquired the institutional business of crypto wallet and custody provider Xapo, that brought the San Francisco exchange’s assets under custody to over $7 billion. At that time, BitGo publicly courted former Xapo clients, which were said to have expressed concern over the new arrangement.","","","Read more: Crypto Exchange Coinbase Acquires Xapo’s Institutional Custody Business","","","Following this train of thought, BitGo’s Belshe said the recent acquisition of Vo1t by Genesis was probably a strategy to take back custody of about $2.7 billion worth of Grayscale Bitcoin Trust assets and bring these under common ownership. (Like Genesis, Grayscale is also a subsidiary of Digital Currency Group.)","","","“Grayscale was with Xapo and was sold over to Coinbase, for a pretty high premium by the way,” said Belshe. “I’m guessing that DCG, the Genesis team and the Grayscale team want to pull that custody back.”","","","But Michael Moro of Genesis scotched Belshe’s theory. ","","","“As I evaluated Vo1t, that was not a consideration at all,” said Moro. “I'm actually not even privy to the contract that Grayscale and Coinbase have so I don’t know the terms or how long it lasts. My understanding is it’s longer-term so that wouldn’t be a near-term event, regardless.”",""],"entity":[{"type":"Batlin","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Anchorage","content":"LOCATION"},{"type":"Moro of Genesis","content":"ORGANIZATION"},{"type":"Moro","content":"PERSON"},{"type":"Belshe","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Phil Mochan","content":"PERSON"},{"type":"Alex Daskalov","content":"PERSON"},{"type":"Michael Moro","content":"PERSON"},{"type":"Koine","content":"ORGANIZATION"},{"type":"Crypto Custodian Wins Insurance on Full Value of Client Assets","content":"ORGANIZATION"},{"type":"Mike Belshe","content":"PERSON"},{"type":"Daskalov","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"Genesis Trading Buys Crypto Custodian Vo1t","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Frankenstein","content":"LOCATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monica","content":"LOCATION"},{"type":"Bequant Launches Crypto Prime Brokerage to Compete for Institutional Money","content":"ORGANIZATION"},{"type":"Monica","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Tokarev","content":"PERSON"},{"type":"Two Sigma Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Alex Batlin","content":"PERSON"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Become Prime Broker","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Xapo","content":"PERSON"},{"type":"Crypto Firms","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Koine","content":"PERSON"},{"type":"Crypto Exchange Coinbase","content":"ORGANIZATION"},{"type":"Marsh","content":"PERSON"},{"type":"from 10 years ago","content":"DATE"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"State Street","content":"ORGANIZATION"},{"type":"Richard Shade","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Diogo Monica","content":"PERSON"},{"type":"AirSwap","content":"ORGANIZATION"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BitGo","Xapo","Institutional Investment","Institutional Investors","Custody","Genesis Trading","Anchorage","Knox Wallet","Trustology","Copper","Koine","Prime Brokerage"],"authors":["Ian Allison"]}