{"summary":"The new reorganization plan must first be approved by a Delaware bankruptcy court.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/08\/nearly-all-ftx-creditors-will-get-118-of-their-funds-back-in-cash-estate-says-in-new-plan\/","publishDate":"2024-05-08T02:49:46","id":16788,"type":null,"title":"Nearly All FTX Creditors Will Get 118% of Their Funds Back in Cash, Estate Says in New Plan","category":["Policy"],"content":["Bankrupt cryptocurrency exchange FTX has proposed a new reorganization plan that would see a whopping 98% of its creditors get back 118% of their claims – in cash – within 60 days of court approval, according to new documents filed Tuesday evening.","Under the plan, other non-governmental creditors would get back 100% of their claims plus up to 9% interest to compensate them “for the time value of their investments.” The arrangement is still subject to approval by the Delaware bankruptcy court overseeing the bankruptcy case.","The proposed payouts are higher than earlier estimates from the FTX estate, which said in October it expected to pay back only 90% of customer funds. In January, current FTX CEO John Jay Ray III revised that estimate, telling the court he expected to be able to pay customers back in full.","Though the crypto market has rebounded since FTX’s collapse and subsequent bankruptcy – irking many of FTX’s customers, who have missed out on the opportunity to profit from the run-up in crypto prices while their funds are stuck in bankruptcy limbo – the estate denies that the market recovery is the driving force behind its massive pile of cash.","In a Tuesday press release, the FTX estate said it expects to have between $14.5 and $16.3 billion in cash available for distribution by the time a plan is approved by a Delaware bankruptcy court – the result of a year-and-a-half of scraping together the company’s scattered assets around the world and liquidating them.","“As previously disclosed, FTX.com had a massive shortfall at the time of the Chapter 11 filing in November 2022 – holding only 0.1% of the Bitcon and only 1.2% of the Ethereum customers believed it held,” the press release stated. “Accordingly, Debtors have not been able to benefit from the appreciation of these missing tokens during these Chapter 11 cases.”","Other sources of value, including investments made by FTX and Alameda Research – such as its 8% stake in AI startup Anthropic, which was sold piecemeal to institutional investors for $884 million in March – have been liquidated to generate cash to pay back the claims.","See also: Bankers Are Lining Up Buyers for FTX's 8% Stake in Anthropic","FTX's new reorganization plan would also settle a host of claims from regulators and government agencies, including the Internal Revenue Service (IRS) and U.S. Commodity Futures Trading Commission (CFTC).","The IRS agreed to resolve its $24 billion in claims in return for a $200 million cash payment and a $685 million subordinated claim that will only be paid out after all creditors and other governmental entities.","The CFTC and other unnamed governmental claimants agreed to subordinate their claims as long as FTX users and investors were paid in full with interest. There are also plans for a special fund created to make “supplemental restitution” to certain customers and creditors, though the details of this agreement have not been finalized, according to the press release.","A hearing to discuss the proposed plan is scheduled for June.","Former FTX CEO and convicted fraudster Sam Bankman-Fried previously attempted to use the estate’s ability to pay back customers in full as evidence that the collapse of his exchange had “zero” harm to its customers.","Before his sentencing in March, Bankman-Fried’s lawyers argued that their client should receive a light sentence, in part because customers would get all their money back.","See also: Sam Bankman-Fried Agrees to Help FTX Investors Go After Celeb Promoters","Ray, along with dozens of FTX creditors, wrote to the court arguing that the estate’s ability to claw together enough to money pay back his victims – the result of “tens of thousands of hours … spent digging through the rubble of Mr. Bankman-Fried’s sprawling criminal enterprise to unearth every possible dollar, token or other asset” – doesn’t mean his conduct wasn’t criminal.","Bankman-Fried was sentenced to 25 years in prison. He plans to appeal his sentence and conviction.","Edited by Daniel Kuhn."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"Delaware","content":"LOCATION"},{"type":"98%","content":"PERCENT"},{"type":"118%","content":"PERCENT"},{"type":"$16.3 billion","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"0.1%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$14.5","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"Anthropic","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Celeb Promoters","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"John Jay Ray III","content":"PERSON"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"$884 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"$685 million","content":"MONEY"},{"type":"evening","content":"TIME"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"$24 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["Regulations","SBF","FTX","Bankruptcy"],"authors":["Cheyenne Ligon"]}