{"summary":"Crypto's second wave of custody solutions will be trained on satisfying the needs of institutions, writes Anchorage's Diogo Monica.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2019\/12\/22\/beyond-storage-how-custody-is-evolving-to-meet-institutional-needs\/","publishDate":"2019-12-22T14:30:00","id":16796,"type":null,"title":"Beyond Storage: How Custody Is Evolving to Meet Institutional Needs","category":["Finance"],"content":["This post is part of CoinDesk's 2019 Year in Review, a collection of 100 op-eds, interviews and takes on the state of blockchain and the world. Diogo Monica is president and co-founder of Anchorage, crypto’s premier custodian for institutional investors.","The last few years have seen the formation of many crypto-focused hedge funds and venture capital funds, whose collective assets under management total in the billions of dollars: institutional investors including Blockchain Capital, BlockTower, Paradigm and Polychain, among others. These funds know the blockchain ecosystem as well as anyone in the world.","We’re grateful institutional investors who know crypto best are helping to inform the development of our custody product. Clients tell us what they need, and we partner with them to build what they require. Through this process, we’ve learned some lessons worth sharing because they offer meaningful insight into the crypto space and how it’s evolving.","Because digital assets are bearer assets, most investment activities involve handling the underlying private keys. This means custody plays a much bigger role in crypto investors’ day-to-day operations than in traditional finance. Whatever investors want to do with their assets – buy and hold, exit a major position, actively trade, participate in staking and governance – the custodian will be involved.","As such, institutional investors want custodians to make buying and selling digital assets as easy and painless as possible. What’s typically a multi-step process, including navigating exchanges and OTC dealers, finding the best price, manually transferring crypto from or to custody, is ripe for disruption by custodians. Regulated trading involves custody and custody relies on technology, which means providing even simple financial services (like the ability to buy, hold and sell an asset) requires highly advanced underlying infrastructure in the custody function.","Funds and institutions should be able to focus on their investment strategies without having to worry about security or moving millions of dollars in crypto between addresses. The onus is on custodians to enable their clients to sell or buy directly through custody.","Institutional investors are painfully aware of the major hot wallet breaches our industry has suffered and the chilling effect they’ve had on the whole ecosystem. To counteract the risks of online exposure, custodians have attempted to secure assets by generating and managing keys entirely offline through a manual human process called “cold storage.” Holding assets offline is necessary for security purposes, but institutional investors are frustrated with cold storage as it has traditionally been implemented.","Questioning the practicality of cold storage is not something we at Anchorage take lightly: As project leads for the Glacier Protocol, my co-founder and I helped develop a step-by-step method for bitcoin self-custody that relies on cold storage. Cold storage has been instrumental for the broader adoption of decentralized currencies, allowing people with non-technical backgrounds to safely store their crypto assets offline. It was and continues to be a sensible custody solution for many retail investors.","But cold storage comes with serious usability constraints, and institutional investors have complex usability needs that cold storage simply cannot satisfy.","For one, institutional investors have an obligation to their LPs to generate as much yield as possible on their behalf. Cold storage is an impediment to institutions’ ability to quickly execute trades. When a time-sensitive trading opportunity arises, custodians must be able to ensure that a client’s assets are readily accessible for trading at a moment’s notice. Traditional forms of cold storage can entail hours or even days of waiting to withdraw assets, at which point trading opportunities are lost. Institutional custody providers must develop solutions that make offline assets easily accessible and securely tradeable.","Second, institutional investors are demanding staking and governance, two forms of on-chain participation that require the use of private keys for online operations. Some cold storage custodians rely on delegation and proxy contracts, technologies that enable one key or contract to act on behalf of another. But not all projects allow delegated staking, and proxy contracts can increase surface-of-attack and introduce unnecessary risk.","As more projects come to market with mechanisms requiring active participation, institutional investors, which have a major stake in their investments’ health and success, will rely on their custodians to act accordingly and get the most out of their holdings.","The fact that institutional funds are managed collectively presents its own set of challenges. While “not your keys, not your crypto” has become a common refrain among adherents to the value of self-sovereignty, which individual should ultimately control crypto keys owned by an institutional fund?","We believe the keys must be controlled by a multi-person team. Providers are using different solutions to achieve this result: some use Shamir’s Secret Sharing (a cryptography algorithm that divides keys into multiple parts), others use physical controls. We at Anchorage associate a unique key with each user and require all sensitive operations to be signed by a quorum of user keys.","But multi-person approval is only part of the solution. The custodian must verify institutional intent – in other words, the custodian must ensure that a given operation represents what the client organization wants to do, and not just what a rogue individual or rogue group wants to do. We believe institutional intent is best verified by authenticating each human approver for a given operation, not just verifying possession of a shard or user key; and by enabling institutional investors to configure customizable quorums based on the nature of the operation, since different team members may have different domains of authority.","In sum, the role of custodians is evolving as the crypto ecosystem matures.","Institutional investors have different needs than retail users, while new coins that offer staking and governance demand on-chain participation. If the first wave of custody solutions was designed to help individuals hold and trade bitcoin, then the second wave will be trained on satisfying the needs of institutions and enabling full participation in all cryptocurrencies."],"entity":[{"type":"Anchorage","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Glacier Protocol","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Diogo Monica","content":"PERSON"},{"type":"Blockchain Capital","content":"ORGANIZATION"}],"hashtag":["Custody","Anchorage","Year in Review 2019"],"authors":["Diogo Mónica"]}