{"summary":"A goal of Robin Linus's design for \"BitVM\" is to enable Turing-complete Bitcoin contracts – making the blockchain programmable, similar to a computer – without making the network more complicated for other users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/10\/11\/bitcoin-might-get-ethereum-style-smart-contracts-under-bitvm-plan\/","publishDate":"2023-10-11T15:08:29","id":16793,"type":null,"title":"Bitcoin Might Get Ethereum-Style Smart Contracts Under ‘BitVM’ Plan","category":["Technology"],"content":["A research paper published this week outlined a new paradigm to bring Ethereum-style smart contracts to the Bitcoin network.","BitVM, as it is known, was laid out in an Oct. 9 whitepaper by Robin Linus, a core contributor to ZeroSync, which is building tools for developers to use zero-knowledge proofs on Bitcoin.","The goal of BitVM is to enable Turing-complete Bitcoin contracts without making the network more complicated for other users. Turing completeness is a computing term for a system that can compute any possible calculation or program.","Under BitVM, computations would be performed off-chain and then verified on-chain, similar to the mechanics of optimistic rollups on Ethereum.","In theory, there should be no limits on the complexity of the computations as they are carried out off-chain, so there is no risk of clogging up the network at the expense of other users.","\"This enables more expressive smart contracts on Bitcoin,\" Linus wrote on X (formerly Twitter). \"Particularly, it enables functionality that we thought we'd need a soft fork for.\"","The protocol involves two parties: a \"prover\" and a \"verifier\". The prover makes a claim of a specific function producing a particular output when given certain inputs. They pre-sign a sequence of transaction, enabling a challenge-response game between the two of them.","They then make on-chain deposits to a Bitcoin address, activating the contract and they start to exchange off-chain data, with the verifier able to take the prover's deposit if any incorrect claim is made. This should mean that attackers always lose their deposits, Linus wrote.","Linus' proposal triggered a slew of responses on X, with commentators quick to point out BitVM's limitations.","Pseudonymous bitcoin writer Shinobi pointed out that the cost of off-chain data management is \"massive,\" adding that the protocol only involving two parties - the prover and the verifier - is also a \"big limitation.\"","Bob Bodily, CEO of Ordinals marketplace Bioniq, wrote in a post on X that BitVM is \"like a very early limited version of the Ethereum Virtual Machine (EVM).\"","\"BitVM is an amazing breakthrough because while there are many gaping holes right now in the BitVM, they are mostly solvable,\" he said. \"Over the next few months I expect many of these holes to get filled in, at which point we will have more capable Bitcoin script without a Bitcoin upgrade.\"","Attempts to implement smart contract capabilities in the Bitcoin network are of course not new. For some time, Bitcoin developers have been attempting to find ways round the network's limitations due to its simpler scripting language compared to blockchains like Ethereum or Solana.","In December last year, blockchain project Stacks published a whitepaper presenting its digital assets \"Stacks bitcoin\" (sBTC), pitched as a way of bringing smart contracts to Bitcoin.","Read More: Bitcoin Is Fundamentally Different From Other Cryptocurrencies: Fidelity Digital Assets","\n","\n","\n","\n","\n","\n","\n"],"entity":[{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"December last year","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Bob Bodily","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Oct. 9","content":"DATE"},{"type":"Robin Linus","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","smart contracts","Bitcoin Network","Bitcoin Upgrade","Zero-Knowledge Proofs"],"authors":["Jamie Crawley"]}