{"summary":"Sreeram Kannan, leader of the project, had previously refused to confirm any plans for an EIGEN token. That hadn't stopped crypto traders from betting heavily on the likelihood; they poured in more than $15 billion of deposits, aiming to collect incentives for early users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/29\/eigenlayer-after-touching-off-restaking-frenzy-plans-own-eigen-token\/","publishDate":"2024-04-29T18:09:03","id":16794,"type":null,"title":"EigenLayer, After Touching Off Restaking Frenzy, Plans Own EIGEN token","category":["Technology"],"content":["EigenLayer, the restaking protocol that has racked up $15.7 billion in deposits, released a whitepaper Monday confirming plans for an EIGEN token, in what's likely to be one of the year's most highly anticipated reward giveaways for users of the Ethereum blockchain ecosystem.","According to a blog post written by the Eigen Foundation, the non-profit supporting the protocol, there will be a total supply of about 1.67 billion EIGEN tokens, and 45% of those will go toward the EigenLayer community. The 45% is divided into three subgroups, with stakedrops, future community initiatives and ecosystem development each receiving buckets of 15%.","\"The total supply of EIGEN at launch is 1,673,646,668.28466 tokens,\" the foundation revealed. \"This number is the result of encoding the phrase 'Open Innovation' onto a classic telephone keypad.\"","EMBED: https:\/\/twitter.com\/eigenfoundation\/status\/1785000100315504776","Crypto traders have been speculating for many months that EigenLayer would come out with its own token, and they had piled deposits into the protocol even before it went live a few weeks ago, on bets that they would receive rewards for early users. EigenLayer is at the core of a new trend known as \"restaking,\" where users’ ether (ETH) tokens that are deposited or \"staked\" as security on the Ethereum blockchain can be repurposed to secure additional networks or protocols.","The project is led by Sreeram Kannan, who founded it in 2021 when he was an associate professor of electrical and computer engineering at the University of Washington.","EigenLayer went live earlier this month, but it is has not yet activated most of the core features that make the project notable – including its reward system and mission-critical \"slashing\" mechanism.","In Monday's post, Eigen Foundation wrote that the first \"season\" of the \"stakedrop,\" as the team described the planned token release, some 5% of the token supply will be distributed to users based on their staking activities on March 15, at Ethereum block No. 19437000. The claim for these EIGEN tokens opens on May 10, and will close after 120 days.","According to the foundation, investors will be allocated 29.5% of the token supply, and 25.5% will go towards early contributors. Both groups will have a three-year lock period, “with a full lock in year one, followed by a linear unlock of 4% of their total allocation each month over the next two years.”","In addition, at the launch of the EIGEN token, users will be able to secure EigenDA, Eigenlayer’s Actively Validated Service (AVS) for data availability, with their EIGEN tokens. Other AVSs are expected to follow, the foundation wrote.","That restaked ETH is used collectively to secure these auxiliary AVS networks on EigenLayer.","As part of the EIGEN drop, the protocol is bringing in a new technological design known as \"intersubjective forking,” a feature meant to support “intersubjective faults.”","“Intersubjective faults are instances of misbehavior that cannot be objectively identified on-chain, yet any two reasonable observers would agree that a penalty is deserved,” according to the blog post.","The system will empower the AVSs to make a \"much wider range of credible commitments than is possible today, significantly expanding the possibilities of what can be built on EigenLayer,\" the foundation said. \"Use cases include transaction ordering, databases, prediction markets, storage services, oracles, artificial intelligence, and more.\"","UPDATE (April 29, 19:19 UTC): Adds paragraph about intersubjective forking.","Read more: EigenLayer and EigenDA Launch on Ethereum Mainnet"],"entity":[{"type":"2021","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"1.67 billion","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 15","content":"DATE"},{"type":"Eigenlayer’s Actively Validated Service","content":"ORGANIZATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"the University of Washington","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"25.5%","content":"PERCENT"},{"type":"29.5%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"$15.7 billion","content":"MONEY"},{"type":"Eigen Foundation","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"}],"hashtag":["EigenLayer","Eigenlabs","Restaking"],"authors":["Margaux Nijkerk"]}