{"summary":"Yellen is set to tell U.S. lawmakers that the FSOC is especially wary of stablecoins and the potential for digital asset runs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/05\/treasury-secretary-janet-yellen-warns-of-crypto-risks\/","publishDate":"2024-02-05T22:56:56","id":16795,"type":null,"title":"Treasury Secretary Janet Yellen Warns of Crypto Risks","category":["Policy"],"content":["U.S. Treasury Secretary Janet Yellen is set to tell Congress that the crypto industry poses several potential hazards to the financial system, including the dangers of stablecoins, runs on crypto platforms and volatile prices, according to a brief portion of her testimony posted Monday.","Yellen is appearing before the House Financial Services Committee on Tuesday to explain the latest work of the Financial Stability Oversight Council (FSOC), a group of U.S. financial agency heads that the secretary leads. The council, which is meant to head off the next financial crisis before it happens, has paid special attention to crypto risks in recent years, putting them among the top categories of potential worry.","Read more: Treasury Secretary Yellen Says U.S. Needs Better Stablecoin Regulation","\"The council is focused on digital assets and related risks such as from runs on crypto-asset platforms and stablecoins, potential vulnerabilities from crypto-asset price volatility, and the proliferation of platforms acting outside of or out of compliance with applicable laws and regulations,\" she said in the testimony prepared for delivery, which was posted on the committee's website.","Yellen said she'll keep working with Congress on crypto legislation.","\"Applicable rules and regulations should be enforced, and Congress should pass legislation to provide for the regulation of stablecoins and of the spot market for crypto-assets that are not securities,\" she said.","Her brief remarks don't reveal any new interest or initiative, but the fact she included digital assets as one of her key issues keeps the crypto sector in the spotlight of the U.S. government's financial concerns.","Read More: A Backdoor Regulatory Option Haunts U.S. Crypto"],"entity":[{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"U.S. Needs Better Stablecoin Regulation","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Financial Stability Oversight Council (FSOC","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"Backdoor Regulatory Option Haunts U.S. Crypto","content":"ORGANIZATION"}],"hashtag":["Regulations","Financial Stability Oversight Council","Janet Yellen","Treasury Department","Stablecoins","Legislation"],"authors":["Jesse Hamilton"]}