{"summary":"Fannizadeh, a lawyer specializing in the crypto industry at Geneva Legal, is a speaker at this year’s Consensus festival, May 29-31, in Austin, Texas.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/10\/fatemeh-fannizadeh-on-crypto-law-switzerland-and-how-kyc-is-failing\/","publishDate":"2024-05-10T13:17:57","id":16805,"type":null,"title":"Fatemeh Fannizadeh on Crypto Law, Switzerland and How KYC Is Failing","category":["Opinion"],"content":["Fatemeh Fannizadeh, a lawyer specializing in the crypto industry at Geneva Legal, knows personally how the long arm of the U.S. financial laws can often sweep up innocent individuals. Born in Iran, raised in Switzerland, and now a resident of New York City, Fannizadeh said she has sometimes run into problems with banks and other financial institutions simply because of her name.","“The question of sanctions is something I grew up with,” Fannizadeh, who will be speaking at the Consensus 2024 conference in Austin, Texas later this month, told CoinDesk in an interview. “My name is Iranian, so I sometimes run into issues with financial institutions because my name flags in their system and so on.”","Consensus 2024 will take place in Austin, Texas from May 29 – May 31. Get your tickets here.","Apart from the inconvenience this causes to her personally, the topic of financial surveillance – often rolled out in the name of safety and to mitigate crimes like money laundering and terrorist financing – is something Fannizadeh thinks is actually a net negative for the world. Tracking nearly all financial flows is simply “inefficient,” she said.","Not only that, the rich and powerful who need to find a way around the law are often sophisticated enough to do just that. And so modern finance is in a state where everyone’s personal privacy is sacrificed — and for what? “Privacy is a right. It’s unfortunate that we have to actually really fight for it nowadays, because technology is so overpowering,” she said.","“My hope is that DeFi, in conjunction with privacy technology, will come up with innovative solutions that would be more inclusive to good actors and more exclusive to bad actors than the current system,” Fannizadeh said.","CoinDesk caught up with Fannizadeh to talk about the state of crypto law (and why it’s now impossible to keep up with the regulatory changes), why Switzerland is losing its status as a crypto hub (and how it may bounce back) and what she’s most looking forward to at Consensus, now just a few weeks away.","Do you still think that Switzerland is a crypto hub?","It depends on how you define a crypto hub. I still think that there are good reasons to base a project out of Switzerland. But I would say that the Swiss authorities were previously more welcoming to crypto and that has changed since the ICO [initial coin offering] boom, when a lot of projects were established out of Crypto Valley. It's not as attractive as before, but then again a lot of places are not as attractive as they once were.","Why do you think that is?","In general, we are seeing more and more regulation in the space. Whether a jurisdiction is welcoming depends on many factors, whether we are talking about a token lunch, where the project fits within the blockchain ecosystem, if and how it is permissioned or fully decentralized, etc. ? Depending on the needs of the project, the regulatory landscape it has to navigate changes a lot. If it's a privacy project, or there's no privacy element in it, then again, it changes a lot.","See also: Crypto Hubs 2023","I remember when I started doing crypto law, it was way more straightforward. We would advise projects and we would know what to do. Today, I don't think it's even possible for a lawyer to be up to date on everything that's happening anywhere in the world of crypto regulation. And it's fragmented too.","Do you think one region in particular stands out? Or maybe a handful of regions that are maybe more inviting? I'm thinking of Hong Kong, the United Arab Emirates or maybe the Bahamas.","Each region can be attractive depending on what one wants to do. So if someone is more involved within DeFi or just trading in general, the Emirates is now where a concentration of these projects are. If someone is launching a token nowadays we see that happening more in the islands, like Cayman or the British Virgin Islands.","Before it was easier to just launch a token out of Switzerland. With privacy projects, we know where to avoid, but it is a bit more of a complicated topic — there is no “shoe that fits all.” There are other things to maneuver, like budget restrictions or timeline restrictions where a project may need something done fast or they have a lot of time and budget to have a more sophisticated set up. These are things to consider before we can find a solution that meets their project’s needs and risk profile.","Do you think the tide will change in Switzerland to become more regulatory friendly to crypto or get worse?","That's a really good question. We see some evolution in Switzerland, especially within the tax realm that makes it more complicated than before to be a crypto project based there. But these are things that one can negotiate or structure around. Switzerland has always been a jurisdiction that had a very neutral and welcoming attitude to finance — particularly within its banking sector. Because it takes the position of being politically neutral,t carries trust from actors to establish there or open a bank account there.","This was historically largely supported by banking secrecy: the fact that banks have to keep their clientbase entirely confidential. Until the early 2000, Swiss banks would never disclose whether they have a relationship with you or how much money you have with them. Everything would remain confidential just as your relationship with your lawyer or doctor or priest is confidential. However, under U.S. pressure this policy of bank secrecy faded away. The U.S. tax administration, especially, wanted to know who had bank accounts there and was eventually not declaring their assets, to replenish their treasury after the 2008-2009 economic crisis. .","So Switzerland, after losing its banking confidentiality, became a less attractive sector for the banking sector. It started opening up a little bit after a few years. Blockchain naturally fits within this narrative of Switzerland being a financial hub, so Switzerland would pursue financial innovation and welcome that sector.","Ueli Maurer, Switzerland’s former finance minister and president, made few statements supporting blockchain innovation withinSwitzerland. Ethereum incorporated in Switzerland — a lot of other important projects went there. There is still this drive for Switzerland to be an attractive financial space that moves from the banking sector to the blockchain sector.","This has to tie in with the Bank Secrecy Act, which seems to me like a blessing and a curse, right? Because you want governments to have the power to go after wealthy individuals that dodge taxes, but the law is so overbroad that it ends up restrictive to businesses and individuals. That’s just my opinion.","I always find it amusing that banking secrecy in Switzerland is the opposite of the Bank Secrecy Act in the U.S, which is about surveillance and KYC, the exact opposite of what banking secrecy means in Switzerland. Surveillance is a social and political issue. I'm usually against surveillance in general and I believe that privacy is a right. It’s unfortunate that we have to actually really fight for it nowadays, because technology is so overpowering and it is only getting worse the more powerful our information technology becomes. I can foresee a form of surveillance that ends in a dystopian future. We need to make sure that we still have and keep control over our data now.","I do understand the arguments that tax evasion is bad and we need to find solutions against it. Obviously I believe that money laundering, terrorism financing and criminal activities are bad. But then I'm wondering whether the current way of tackling these issues, for instance by KYCing everyone, is actually constructive or productive. Did KYC stop money laundering or even lowered it? If you look at the state of the world, I think that the current ways are a very inefficient way to tackle these issues.","See also: If You're in Crypto, You're a Criminal","What I usually say is that KYC, which is just gathering information and tracking where money comes from and what it may be used for, is not preventing bad actors. Within the financial sector there are many sophisticated setups that can obfuscate where the money comes from or make it seem like somebody else is in possession of the money so that nothing flags in the KYC. Unfortunately, there are many wealthy and sophisticated bad actors that can do whatever they need to do to launder their money and use it in nefarious ways.","While normal people, people who don't have this knowledge, they are the ones who are actually harmed by the system. For instance, sanctions regulation, which is the topic of my panel at Consensus, usually targets a whole population based on their nationality or their place of residence. These are just normal people without bad intentions. My hope is that DeFi, in conjunction with privacy technology, will come up with innovative solutions that would be more inclusive to good actors and more exclusive to bad actors than the current system.","That’s a great answer.","It’s my passion and a topic I've been thinking a lot about lately. I'm originally from Iran and I lived most of my life in Switzerland. The question of sanctions and their impact is something I grew up with. My name is Iranian, so I sometimes ran into issues with financial institutions because my name flags in their system for example.","That’s bleak. To change this up a little bit, I sometimes talk to lawyers who work in the crypto space who take issue with the term “crypto law” because it's overbroad. Do you think it's a term that makes sense?","Interesting. I'm currently writing a chapter for a crypto law book, and the chapter is titled “The Madness of Crypto Law.” The title hints to the fact that crypto law is mad, meaning that there isn’t a common rational understanding of what it means and what it encompasses. It is both a term that makes sense and doesn’t make much sense. As I said before, crypto regulation has become so complex, there’s crypto legal news coming out everyday, it's almost impossible to follow and map everything.","I also think that there's an underlying philosophical discussion to this question. What do we mean by crypto law? Are we referring to state regulations relating to or impacting blockchain projects? Or is it relating to the normative realm of blockchain technology, i.e. the law of the code itself?","Well, in the U.S., it has to be the former, right? Even if there aren’t any specific crypto laws, no regulator is willing to consider crypto on its own merits.","There is this meme: “code is law,” meaning there are rules that are hardcoded and will be executed should the necessary preconditions be met, within decentralized, permissionless products or projects.Governance within DAOs, for instance, have their own set of rules. In order to interact with a DAO, one needs to get the token and vote through a certain process. These are all norms and rules. A postulate I have is that the main reason why no country has managed yet to really capture blockchain technology and regulate it in a satisfying manner is because these normative systems of state laws and crypto laws are so different. As if they speak two different languages.","See also: Consensys' Bill Hughes Talks Crypto Law","One cannot understand crypto with the language of U.S. law or vice versa. Like two puzzles with very different pieces that cannot be put together without an absurd, nonsensical result. And this is actually a feature of blockchain. I cannot blame the regulatory ecosystems for trying to capture it, but I think instead of capturing it, they have to understand that they need to interface with it. It's a very different approach.","Right. I'm not optimistic about it, to be honest.","You're not. Why?","More or less everything that you’ve already said, right? They're not willing to meet the technology on the technology’s terms.","In the U.S.?","Yeah, sorry. I have a very U.S. focus.","I mean, I moved here – it’s great. But seriously, even if I didn't live here, there is no way to avoid the U.S. in crypto law. It impacts any project, even if the project has no U.S. connections – nobody from the project is from the U.S. or resides there and all U.S. persons are excluded from token purchases, etc.– still, one needs to consider U.S. regulations.","Something to be optimistic about is that even if the U.S. fails in tackling crypto regulations constructively, there are tons of other jurisdictions. These projects live on the internet, so at least for the technology itself, there is a future. Whether this future is US or not, this is a valuable question.","Okay, last question is an easy one. What are you most looking forward to at Consensus?","Many things! It’ll actually be my first time and I'm very excited. We're almost a month away and I’ve already heard of many interesting events lined up and have meetings organized – I can’t wait to just get together with the attendees, I heard the crowd is excellent. I usually go to very specific community centric or legal and policy conferences. But Consensus is so comprehensive, right? It seems like a platform where we can reach “consensus,” discuss things with very different actors all in one place.","And you tell me, you've been. Is there anything I need to keep in mind?","Actually, there's this programming track called Consensus @ Consensus, which sort of like small breakout groups that focus on very narrow but consequential questions. Those tend to be pretty interesting. I've only attended in person twice, and basically work like a dog, but Austin is a fun city in general.","Yeah, that usually happens at conferences."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Fannizadeh","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Austin","content":"LOCATION"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"May 29 – May 31","content":"DATE"},{"type":"Crypto Valley","content":"ORGANIZATION"},{"type":"Bank Secrecy Act","content":"ORGANIZATION"},{"type":"2000","content":"DATE"},{"type":"Ueli Maurer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Geneva","content":"LOCATION"},{"type":"Emirates","content":"LOCATION"},{"type":"2008","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"2009","content":"DATE"},{"type":"British Virgin Islands","content":"ORGANIZATION"},{"type":"Cayman","content":"PERSON"},{"type":"Bill Hughes","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Iran","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Consensus 2024","Consensus","KYC","Surveillance","Law"],"authors":["Daniel Kuhn"]}