{"summary":"Chainalysis and Elliptic have found that crypto is useful for crime, but that’s hardly an argument for banning it.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/01\/why-elizabeth-warren-is-wrong-about-crypto-and-the-fentanyl-epidemic\/","publishDate":"2023-06-01T18:59:04","id":16812,"type":null,"title":"Why Elizabeth Warren Is Wrong About Crypto and the Fentanyl Epidemic","category":["Consensus Magazine"],"content":["For a while, crypto's role in the illegal and gray area drug trade seemed swept under the rug. Or, at least, it was not getting the attention it could have, which is good and bad for an industry still looking to shed its early associations with the Silk Road digital marketplace, which the Feds shuttered in 2013.","It’s good because people have a tendency to moralize about drug use, and the less crypto is linked to crime in general, the less the entire industry will be stigmatized. However, it would arguably be better to be upfront about such things (assuming they’re going on, as data now suggests), if crypto ever has a shot of finding a killer use case or mass user base who understands why blockchains are important.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","U.S. Sen. Elizabeth Warren (D-Mass.) is calling for a greater crypto crackdown following new research from blockchain analytic firms Chainalysis and Elliptic that found bitcoin and tether (USDT) have become cornerstone to the global fentanyl trade. These are the same research companies that put out annual reports showing a fraction of a fraction of crypto transactions can be tied to illicit use.","See also: Designer Drug Markets Get Boost From Crypto","“Crypto is helping fund the fentanyl trade, and we have the power to shut that down,” Warren said. “It's time.” The Senator is a long-time critic of crypto, who recently made an incomprehensible “anti-crypto army” campaign part of her re-election bid.","Does the Senator have a point?","I already know what the crypto faithful will say: Chainalyis estimates less than 1% of total crypto transactions are related to crime, so it doesn’t matter if Chainalysis is now saying there’s evidence at least $37.8 million worth of crypto was sent to drug manufacturers in China since 2018.","Hold that thought, we’ll get back to it. First, let’s try to place crypto's alleged use for drug sales in the context of the global drug trade.","To start, it’s difficult to judge how large the fentanyl economy is, because it is by nature kept mostly out of sight. But if Chainlysis and Ellipse’s figures are to be meaningful, they need context. According to one source Chainalysis cited, total “chemical exports” from China (assumed by most authorities to be the largest manufacturer and exporter of black and gray market drugs) surpassed $100 billion in 2021 alone.","But looking at the webpage, I’m pretty sure that figure refers to literally All Chemicals Exported From China, not just the funny ones that make you feel good – but also the ones that are prescribed, used to clean your floor and otherwise. Not to sound like a living Galaxy Brain meme but...your body is chemistry, the Earth is chemistry. It's a broad category.","More context: The U.S. Customs and Border Protection (CBP) said it seized a record 14,700 pounds of fentanyl in 2022. At a street price of ~$1,500 per pound (with an actual dose measured in milligrams or micrograms, depending on the fentanyl analogue in question), that’s a little over $22 million worth of the synthetic opioid that otherwise would have been sold.","But like the time when the U.S. Navy measured the success rate of WWII planes solely on those that returned from a bombing campaign, this figure is an example of selection bias. The U.S. government can count the pounds of fentanyl it catches, but not those that slip through its grasp.","Elsewhere, depending on where you look, the total global illicit drug trade ranges anywhere from tens of billions to hundreds of trillions of dollars. The important thing here isn’t to get hung up with the numbers, but to show that Chainalysis’ estimate is likely contingent on a number of factors that always come into play when trying to find the absolute value of something.","Notably, the drug industry does and does not include everything from the cultivation, manufacture, distribution and sale of illicit substances, depending on your chosen frame. The headline number Chainalysis supplies, $37.8 million, is severely limited in scope. It’s based on a predictive map using four identified shops that sell fentanyl precursors in China (precursors are not the drugs themselves, but seem like a fair proxy).","In other words, it says almost nothing about the scope of crypto’s use in the global drug trade – it barely says anything about crypto’s use in the fentanyl industry in just one country.","I’ve argued in the past that Chainalysis’ often cited figure that “less than 1%” of crypto transactions are connected to crime is likely incomplete. It’s based on a sampling of addresses the analytics firm can actually identify or a probabilistic mapping of addresses. That leaves room for unidentified alphanumeric public keys to be kept out of the count. (This, I think, explains why Chainalysis often retroactively increases its reported statistics, because it is literally mapping more crypto addresses giving a better sense of how much illicit activity is happening.)","See also: DeFi 'Rug Pull' Scams Pulled In $2.8B in 2021","As far as I can see, the company does not talk openly about what percentage of crypto addresses it can link to known entities. (I’ve asked, too, without detailed response.) And that’s fair. It’s not in its corporate interest to reveal such information – Chainalysis sells its analytics tech and knowhow to government and corporations that want to Know Things about the blockchain.","There are a lot of people in crypto who view Chainalysis with contempt, because it is a company expressly working against people’s privacy. What’s more important, however, is that Chainalysis showed that the idea of on-chain privacy is a joke. There was a time, I’ve read, when people genuinely thought Bitcoin was a way to transact privately online, which could not be further from the truth.","Being honest about the industry and the limits of this technology is the best thing crypto can do for itself. This includes being honest about crypto's use in online drug markets, rather than sweeping the story under the rug.","At an anecdotal level, almost all clearnet drug marketplaces now have an option for paying with crypto. Many even offer discounts on sales made in crypto, to encourage its use. We also all know that person whose first use of bitcoin was to buy pot or a fake ID. I’d wager, most transactions like this are not swept into analytics firms’ accounting, though, as know-your-customer (KYC) and other data surveillance and sharing rules come into play, that may change.","None of this is not to suggest that crypto plays a superordinate role in the modern illicit drug industry. Or that it should be targeted out in particular, as Sen. Warren suggests. If it wasn’t crypto being used, it’d be a different payment technology. Similar to how some have incorrectly argued that crypto is unlocking a wave of ransomware attacks, the rise in online drugs markets, online crime and crypto are all data points in a larger story: greater and greater internet use.","See also: The Hard Truth About Being an 'Anon' | Opinion","Remember: Transactions on-chain are permanent, which is why even though crypto is used for crime, you probably shouldn’t use it to do anything bad."],"entity":[{"type":"$37.8 million","content":"MONEY"},{"type":"Earth","content":"LOCATION"},{"type":"trillions of dollars","content":"MONEY"},{"type":"Mass.","content":"LOCATION"},{"type":"U.S. Navy","content":"ORGANIZATION"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"$2.8","content":"MONEY"},{"type":"Elizabeth Warren (","content":"PERSON"},{"type":"$1,500","content":"MONEY"},{"type":"Chainalysis","content":"PERSON"},{"type":"$22 million","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"Border Protection (CBP","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Opinion","Drugs","The Node","Newsletters","Elizaabeth Warren","illicit finance","Chainalysis","Elliptic"],"authors":["Daniel Kuhn"]}