{"summary":"BlackRock's first tokenized offering, created with Securitize, has captured almost 30% of the $1.3 billion tokenized Treasury market in just six weeks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/30\/blackrocks-buidl-becomes-largest-tokenized-treasury-fund-hitting-375m-toppling-franklin-templetons\/","publishDate":"2024-04-30T14:45:52","id":16817,"type":null,"title":"BlackRock's BUIDL Becomes Largest Tokenized Treasury Fund Hitting $375M, Toppling Franklin Templeton's","category":["Markets"],"content":["Asset management company BlackRock's (BLK) tokenized asset fund BUIDL became the largest of its kind Tuesday, overtaking rival Franklin Templeton's similar offering just six weeks after its debut.","The BlackRock USD Institutional Digital Liquidity Fund, represented by the BUIDL token on the Ethereum (ETH) network and backed by U.S. Treasury bills, repo agreements and cash, now boasts $375 million of deposits after enjoying $70 million of inflows last week, blockchain data by rwa.xyz shows. The fund, created with tokenization services platform Securitize, has captured almost 30% market share since its debut on March 21.","Meanwhile, the Franklin OnChain U.S. Government Money Fund with the BENJI token slid to $368 million in assets under management after experiencing minor outflows during the same period.","The change in guard was largely thanks to the growth of Ondo Finance (ONDO), whose tokenized Treasury offering OUSG leverages BlackRock's token as reserve asset and enjoyed $50 million of inflows in a week.","The rapid growth of BlackRock's first tokenized offering, occurred as putting conventional assets like bonds and credit onto blockchain rails in forms of tokens – also known as tokenization of real-world assets (RWA) – has captivated digital asset firms and traditional finance (TradFi) giants alike. Tokenization could offer benefits like faster, around-the-clock settlements, increased operational efficiency and greater transparency.","U.S. Treasuries among RWAs have emerged as a gateway for tokenization efforts as a low-risk, well-known instrument where investors can park their on-chain cash and earn stable yield without leaving the blockchain ecosystem. The tokenized Treasury market swelled to near $1.3 billion from near $100 million in early 2023, propelled by in part of BlackRock entrance to the competition.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"$375 million","content":"MONEY"},{"type":"$1.3 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$70 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"March 21","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Franklin OnChain","content":"PERSON"},{"type":"Ondo Finance (ONDO","content":"ORGANIZATION"},{"type":"BlackRock USD Institutional Digital Liquidity Fund","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$368 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BlackRock","Franklin Templeton","Tokenized Assets","Tokenization","Real World Assets"],"authors":["Krisztian Sandor"]}