{"summary":"Block unveiled Bitkey for pre-order in 95 countries last December having commenced beta testing during the summer","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/13\/jack-dorseys-block-begins-shipping-bitkey-bitcoin-wallets\/","publishDate":"2024-03-13T15:13:05","id":16814,"type":null,"title":"Jack Dorsey's Block Begins Shipping Bitkey Bitcoin Wallets","category":["Technology"],"content":["Jack Dorsey's fintech company Block (SQ) has started shipping its new self-custody bitcoin wallet Bitkey after four months of taking pre-orders.","Block unveiled Bitkey for pre-order in 95 countries last December, having commenced beta testing during the summer. In addition to its wallet function, Bitkey will connect to Block's payments platform Cash App and crypto exchange Coinbase (COIN) to allow buying and selling BTC within its app.","Bitkey consists of a hardware device, a phone app and a set of recovery tools.","The app and hardware device are two of the three keys used to secure a user's bitcoin, with the third stored on Bitkey's servers. Should customers lose their both their phone and the device, they can recover their funds using the \"Trusted Contacts\" tool, which relies on people known to the user to verify their recovery request.","SQ shares were up over 6% at $86.74 at the time of writing on Wednesday alongside a rally in the payments space.","Read More: Jack Dorsey's Block Inc. Begins Layoffs Under Previously Disclosed Plan to Cut Staff by 10%","\n"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Bitkey","content":"ORGANIZATION"},{"type":"$86.74","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Block Inc","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["Jack Dorsey","Block Inc.","Bitkey","Wallet"],"authors":["Jamie Crawley"]}