{"summary":"It's 2028. Once-dominant sovereign currencies face intense competition. Meanwhile, someone is attacking the Fed's e-Gov platform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2021\/03\/06\/into-the-money-verse-central-banks-under-siege-in-2028\/","publishDate":"2021-03-06T14:59:35","id":16820,"type":null,"title":"Into the Money-verse: Central Banks Under Siege in 2028","category":["Policy"],"content":["","We dive into the money-verse again to imagine how the choices being made today will shape the future of money. Once dominant, sovereign currencies are facing increasing competition, from bitcoin to diem and beyond. It is true that private currencies, and bitcoin in particular, have so far failed to promote the monetary revolution many people expected.","","","If, however, governments and central banks can’t offer a sound version of the sovereign money for the digital age, their downfall could be tragic. Let’s catch a glimpse of Washington, D.C., in 2028 to explore how the money wars could play out.","","","On the outskirts of the capital, it’s possible to see drones dropping bags of money in the neighborhoods most affected by the latest cyberattack on the e-Gov platform. It isn’t clear yet if the attack came from a domestic rebel or a foreign foe. But with the e-Gov platform down, nobody can transfer digital dollars or even check their FedAccount balance.","","","When designing digital dollars, the government decided that FedAccounts shouldn’t offer an offline option. The concern was that people would finance domestic terrorism with an offline FedCoin that could be transferred from person to person without identification. Any project that involved anonymous transactions became a nonstarter after the second U.S. Capitol invasion. ","","","See also: Jeff Wilser - The Man Who Forecast a Currency Cold War","","","Because of this limitation, every time the e-Gov platform is attacked, the government has to send military drones to disperse old dollar bills that can be used to make everyday payments until the platform is back on. That has been the reality since the money wars started in earnest. ","","","After several years agonizing over the right model for digital dollars, the U.S. Federal Reserve had to rush its introduction in 2024. Since millions were moving every day to BTAs, the global cryptocurrency the BigTech Alliance launched the year before, the demand for dollars was falling fast while inflation started to climb at a record pace. ","","","The massive fiscal expansion of the early 2020s was finally taking its toll, and the government could no longer roll over its soaring debt. The situation was so dire that, to avoid a massive default on U.S. Treasurys, the Federal Reserve had to print money and pay off all the bonds maturing in the last quarter of 2023. ","","","The rapid migration from the traditional monetary and financial systems to the BigTech Alliance platform also affected banks. With customers converting deposits into BTAs and using favorable loans from the Alliance to consolidate other debts, most banks failed. The wave of failures accelerated the shift of financial intermediation toward the hands of the BigTech Alliance.","","","The debacle wasn’t just a result of the Federal Reserve’s long-lasting ambivalence about digital dollars. Many believe the breaking point came when the government insisted on having exclusive control over the digital ID scheme created to provide every American citizen and corporation with a single digital identity. The goal was to keep track of the vaccination progress amid different coronavirus variants and better target the relief money sent monthly. ","","","But despite different voices in favor of a federated approach, including banks, consumer advocacy groups and scholars, the government opted for a centralized scheme that didn’t allow the participation of any private party. The decision was seen as a further step toward the growing surveillance state.","","","The alternative platforms thrived after the digital ID scheme was implemented. The number of members of a then-fringe group created by many of the “deplatformed” increased 10-fold in the first months of 2023. They could finally dream of confronting not only the U.S. government but the Big Tech companies that had cut their access to the traditional networks.","","","The rise of the BigTech Alliance was even more impressive, attracting more than 200 million people to its platform in the same period. They were able to build a country within the country, and the creation of their own money was a stinging blow to the dollar and the U.S. public finances.","","","See also: Jeff Wilser - The Currency Cold War: Four Scenarios","","","Only in 2027 could the government balance its budget and bring the government debt to a more sustainable path. Rolling back the contested digital ID scheme, creating a simple yet stable e-Gov platform and offering digital dollars in partnership with the surviving banks helped the government regain some trust. The challenge is to resist the constant attacks from the other platforms and fight back.","","","It’s clear by now that, with technology, different monetary arrangements are possible. Money does not need to be controlled by a government or limited to a sovereign territory anymore. Sure, as the American economist Hyman Minsky underscored 35 years ago, “Everyone can create money; the problem is to get it accepted.” ","","","At this point, though, Minsky’s warning may also apply to central banks designing digital currencies: Either they get it right, or they risk becoming redundant.",""],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"last quarter of 2023","content":"DATE"},{"type":"Minsky","content":"PERSON"},{"type":"the first months of 2023","content":"DATE"},{"type":"2027","content":"DATE"},{"type":"2028","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"earnest","content":"LOCATION"},{"type":"BigTech Alliance","content":"ORGANIZATION"},{"type":"Jeff Wilser","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"U.S. Treasurys","content":"ORGANIZATION"},{"type":"Hyman Minsky","content":"PERSON"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["Federal Reserve","Opinion","Treasury Bills","Internet 2030"],"authors":["Marcelo M. Prates"]}