{"summary":"President Nayib Bukele is eager to argue his doubters have been wrong amid his faith in bitcoin as a reliable store of value.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265903\/el-salvadors-bitcoin-bet-is-now-turning-a-profit-amid-latest-crypto-rally-president-nayib-bukele-says","publishDate":"2023-12-04T10:27:01","id":1682,"type":null,"title":"El Salvador&#x27;s bitcoin bet is now turning a profit amid latest crypto rally, President Nayib Bukele says","category":["MARKETS"],"content":["El Salvador President Nayib Bukele is clapping back at all the naysayers that doubted his nation's decision to purchase bitcoin, the world's largest cryptocurrency by market cap.","Bukele took to X to declare his country's controversial bet on bitcoin is now paying off. \"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">El Salvador's bitcoin <\/span><span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">investments are in the black,\" he <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1731653743668572498\" data-v-f87c67ca=\"\">posted on Monday<\/a>, \"With the current bitcoin market price, if we were to sell our bitcoin we would not only recover 100% of our investment but also make a profit.\"<\/span>","The small, Latin American nation made bitcoin, alongside the U.S. dollar, legal tender in September 2021. Since that point, El Salvador also <a href=\"https:\/\/www.theblock.co\/post\/155321\/el-salvador-purchases-80-additional-btc-at-19000-each\" data-v-f87c67ca=\"\">began buying<\/a> bitcoin periodically. While the amount of bitcoin accumulated has been relatively small — the country's portfolio is valued at roughly $131 million, according to <span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">Bukele's post — the fact a sovereign nation is buying the cryptocurrency, which many country's still view with much skepticism, is significant.&nbsp;<\/span>","In his post, Bukele said El Salvador is now up by about $3.6 million with the recent upswing in bitcoin's price.","\"We have no intention of selling,\" he also said. \"That has never been our objective. We are fully aware that the price will continue to fluctuate in the future, this doesn’t affect our long-term strategy.\"","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.95%\n    <\/span><\/a> <!----><\/span><\/span> is currently trading north of $41,000 after dipping to less than $17,000 in late 2022.<\/span>","Bukele also seemed eager to take a victory lap given past criticism of his move to use government funds to purchase bitcoin for his country.","\"It is important that the naysayers and the authors of those hit pieces take back their statements,\" he said. \"The responsible thing to do would be for them to issue retractions, offer apologies, or, at the very least, acknowledge that El Salvador is now yielding a profit.\"","At one point, with the price of bitcoin in decline during the onset of the crypto winter, the value of El Salvador's portfolio fell dramatically, causing some to question the wisdom of Bukele's fiscal strategy.","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"$131 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$3.6 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bukele","content":"PERSON"},{"type":"Bukele","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$17,000","content":"MONEY"},{"type":"+0.95%","content":"PERCENT"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"El Salvador","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}