{"summary":"Faced by the rise of stablecoins and other blockchain experiments, central banks had to rethink their roles in the world this year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/12\/21\/central-banks-had-to-up-their-money-game-this-year-and-they-did\/","publishDate":"2020-12-21T20:30:58","id":16826,"type":null,"title":"Central Banks Had to Up Their Money Game This Year – And They Did","category":["Policy"],"content":["","This year, pandemic and all, central bank digital currencies (CBDC) got their 15 minutes of fame. In 2019, Facebook awakened central banks to the possibility of serious private competition. And although libra, now diem, remains a paper tiger, it’s not difficult to imagine other Big Tech firms joining the pack. Central banks had to up their monetary game – and so they did.","","","The end of this strange year is a good time to look at the state of play on CBDCs and revisit some fundamental questions, starting with the most basic: What is a CBDC? With so many definitions and models out there, it’s become harder (not easier) to understand what CBDC means. Here is a good starting point: a CBDC is a direct claim on the central bank. You own or hold something that was directly issued by the central bank, not by an intermediary. ","","","If your money doesn’t appear in the central bank’s balance sheet as a liability, it’s not a CBDC. As a result, when we hear about indirect or two-tiered or synthetic CBDCs, chances are that we’re not looking at the real thing. That doesn’t mean these models are irrelevant, it just means they are promoting something different from CBDCs.","","","In fact, most of these models were designed with one goal in mind: preventing CBDCs from being a radical departure from the current system. The major concern of central banks is that people would easily move from bank deposits to CBDCs during crises, increasing financial risk and disintermediating banks at the worst possible time.","","","See also: Coronavirus Driving Interest in CBDCs, Say Central Bank Chiefs","","","But as Jon Cunliffe, Deputy Governor for Financial Stability at the Bank of England, recently said, the job of central banks “is not to protect banks’ business models; our job is to ensure that if banks’ business models change, we manage the financial and macroeconomic consequences of that.”","","","CBDCs are about more than making money digital. Nine out of 10 dollars used for savings and transfers are already digital, in the form of deposits held in checking and savings accounts. And this is a reality not only in the U.S. and European Union, but also in Brazil.","","","What’s new about CBDCs is creating the possibility for anyone to open a basic checking account at a central bank. Maybe we’ve been using the wrong name all along. Instead of “central bank digital currency” we should have been talking about “central bank accounts” – although CBACCT wouldn’t make for a great acronym.","","","Another relevant question when exploring the possibilities for CBDCs is, “Who needs them”? It’s not hard to find skeptics, even among central bankers, who believe the CBDC is a solution in search of a problem. Many will say, with good reason, that central banks aren’t made for providing retail services.","","","Others will add that regular people won’t care if their money is deposited with the central bank or a commercial bank, as long as their account comes with deposit insurance. Most people may even fail to notice the difference between a CBDC and the money they already use for payments through their debit cards or PayPal and Venmo apps.","","","Brazil offers some good examples here. The combination of a thriving payments sector with the recent introduction of instant payments for retail customers is making it easier and cheaper to use payment services wherever and whenever needed. Things may improve further next year with the implementation of open banking, which should allow people to compare, choose and even mix financial services from different institutions.","","","How would a CBDC fit in this ecosystem, with several private options working just fine, from bank deposits to e-money? Central banks have at least one good reason to get ready for a CBDC. Picture a country where money and payments are controlled only by private institutions. Sure, private parties are good at innovating and moving fast. But once they dominate a market and crush the competition, they tend to raise the price of their products and services, leaving many customers behind.","","","However, in the increasingly digital world, not having access to digital money means not being a full citizen. The pandemic has made this even more evident. It’s true that a CBDC, by itself, won’t promote financial inclusion. Digital currencies will prove useless for those who don’t have regular access to smartphones, connectivity or even electricity.","","","See also: Marcelo Prates - 4 Myths About CBDCs Debunked","","","But if central banks don’t offer a secure, stable and inexpensive public option for digital money and payments, people and small businesses that cannot afford private digital currencies will end up deprived of an essential service in the modern economy.","","","More than that, we know all too well how this story of private parties providing essential monetary services ends. Last decade’s global financial crisis showed us how far governments needed to go to save private institutions offering services that are vital for everyone, like money and payments. These institutions will always be not only “too big” but “too important to fail,” in the words of Mervyn King, former governor of the Bank of England.","","","The third and final question relates to the technology of CBDCs. The general assumption is that central banks will use blockchain to launch a CBDC. This isn’t correct.","","","Central banks have been successfully operating and supervising complex technological infrastructures for decades, including the payments systems that facilitate the circulation of money in the economy. The case for central banks moving from their reliable centralized system to a blockchain isn’t clear-cut, especially because blockchain remains untested on a large scale for retail payments.","","","See also: Stanford Prof Darrell Duffie on Our Big Stablecoin Future","","","Much more important from a technological perspective is to find a way to have a CBDC that can be used and transferred offline without leading to double-spending or fraud. A reliable offline CBDC is the holy grail for central banks willing to go digital.","","","Again, a recent example from Brazil illustrates the practical relevance of this feature. Last month, a northern state in Brazil faced a power outage that lasted several days. Can you imagine living not only without electricity but without money because your digital currency only works online? Although still at an early stage, some promising hardware solutions for an offline CBDC have started to appear.","","","Here’s to a 2021 low on viruses and high on digital currencies. Cheers!",""],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"Mervyn King","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Big Stablecoin Future","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Coronavirus Driving Interest","content":"ORGANIZATION"},{"type":"Marcelo Prates","content":"PERSON"},{"type":"Financial Stability","content":"ORGANIZATION"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"Central Bank Chiefs","content":"ORGANIZATION"},{"type":"Darrell Duffie","content":"PERSON"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"10 dollars","content":"MONEY"}],"hashtag":["Opinion","CBDCs","Year in Review 2020"],"authors":["Marcelo M. Prates"]}