{"summary":"MetaMask is quietly testing new tech that uses third parties to route user transactions. It will eventually be made available outside of MetaMask and will be closely scrutinized for how it manages to avoid centralization concerns.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/01\/17\/metamasks-secret-intents-project-could-radically-change-how-users-interact-with-blockchains\/","publishDate":"2024-01-17T16:39:57","id":16835,"type":null,"title":"MetaMask's Secret Project Could Shake Up How Ethereum Works","category":["Technology"],"content":["MetaMask, the most popular crypto wallet on Ethereum, is testing a new \"transaction routing\" technology that's likely to have major ramifications for how value flows through the second-biggest blockchain network.","CoinDesk learned of the new technology from developers briefed on the plan, and key details were subsequently confirmed by officials with MetaMask's parent company, Consensys.","The effort capitalizes on a concept known in blockchain circles as \"intents\" that is rapidly gaining momentum, potentially leading to a radical shift in how people interact with blockchains: Rather than specifying how they want to get something done (e.g. \"sell X tokens on Y exchange for Z price\"), blockchain users may only need to specify what they want the outcome to be (e.g. \"I want the best price for my tokens\").","The \"what\" versus \"how\" distinction might seem subtle, but it's a big departure from how MetaMask and other crypto wallets worked originally – as neutral, relatively simple pieces of software for connecting users to blockchains. The goal with the new tech is for users to get better execution on their transactions and improved ease of use, but intent-based programs ultimately represent a big shift to where – and to whom – value flows on blockchains.","Read more: 'Intents' Are Blockchain's Big New Buzzword. What are They, And What Are the Risks?","The new technology is being built by Special Mechanisms Group (SMG), a blockchain infrastructure firm that MetaMask owner Consensys purchased last year.","According to Consensys, which confirmed details of the project but was only willing to discuss them at a high level, an early version of SMG's new routing tech is already being used to power \"Smart Swaps,\" a feature in the MetaMask browser extension that helps users swap between tokens.","In the past, a MetaMask user looking to sell tokens would have needed to submit a transaction specifying exactly how, where, and for what price they wanted their tokens to be sold. With Smart Swaps, which is an \"opt-in\" feature based around intents, a user can simply request that MetaMask sell their tokens for the best price it can find.","Once MetaMask fully transitions Smart Swaps over to its new architecture, it will be powered by an underground ecosystem of third-party blockchain operators. These third parties will find the optimal route for a given swap, and they will then execute the requisite transactions on the user's behalf.","Compared to a simple exchange aggregator that finds the best price for an asset by comparing different exchanges, Smart Swaps, with its new routing tech, will have total freedom over the path that it takes to satisfy a user's request.","Consensys says it plans to expand its routing feature beyond Smart Swaps to other transaction types in the coming months, and it will also make it available to third parties that wish to use it themselves. On MetaMask, the technology will always be \"optional,\" meaning users won't have to use it if they don't want to.","Still, there are some risks. MetaMask, as the biggest player in the wallet world, might set a precedent for other wallet builders. Given that its new feature represents a radical re-think of how crypto wallets work, the new tech is likely to earn some scrutiny as its design becomes clearer.","With so many apps on Ethereum today, there are infinite paths one might take to accomplish a given task, and some will be far more lucrative (or will cost less) than others.","With its new transaction routing tech, MetaMask joins a growing field of “intent-centric” protocols like Anoma, Uniswap X, SUAVE and CoW Swap that aim to make Ethereum less daunting to navigate. Users issue goal-oriented “intents” to the protocols (e.g. \"Get me the best price for my tokens\") rather than step-by-step transaction instructions.","The behind-the-scenes third parties typically compete with one another to satisfy user requests for the best price, and, in exchange, get transaction fees or other economic incentives.","In addition to improving the Ethereum user experience, these programs are usually designed to help users avoid the scourge of maximal extractable value (MEV), where bots preview Ethereum's transaction queue to find profitable trading opportunities, so they can skim marginal profits from end users – sometimes likened to the unsavory practice of front-running.","However, there could be risks to the new intent-centric programs, including regulatory considerations and fears that some routing systems might entrench new power players at key points in a chain's transaction pipeline. The risks become even greater with the involvement of a player like MetaMask, the first touchpoint for a vast portion of the transactions that hit Ethereum.","Consensys says it has deliberately designed its new routing mechanism to sidestep certain key risks and to shift power from the validators that propose blocks (to earn fees and MEV) to the users who submit transactions.","In response to questions from CoinDesk, Consensys provided emailed comments from SMG director Jason Linehan indicating that SMG's technology is different from some other intent-centric projects, in that \"It is not a centralized solution, and it is not a vertical integration.\"","Typically when a user submits a request to an intent-centric program, it lands in a kind of private mempool – a waiting area for yet-to-be-processed transactions that is cordoned off from the default, \"public\" Ethereum mempool (a big part of how the protocols shield their users from MEV bots). From there, the intent is scooped up by a third-party blockchain operator, sometimes called a \"filler,\" that bids against other operators to fulfill the user's intent for the best possible price.","Linehan wouldn't disclose the specifics of SMG's mechanism, but he did confirm that it would involve a kind of \"auction-based optimization method.\" He pushed back against the idea that SMG would use a private mempool, however.","\"We have taken such a unique approach with this technology that it doesn't entirely make sense to call it a private mempool anymore,\" wrote Linehan. \"People tend to think it's a public mempool if every node sees every message, and a private mempool if only some of the nodes see every message, but why should any node see every message in the first place?\"","MetaMask's \"mechanism is a new design created by SMG and is a significant departure from existing solutions,\" Linehan told CoinDesk.","Linehan said that MetaMask's transaction router would be completely permissionless, meaning anyone can theoretically participate in its order flow auctions. \"There is a role to play for every searcher, builder, and solver, no matter how big or small,\" said Linehan.","Linehan also said SMG's intent tech would be open to other protocols. \"At this stage it’s too early to talk about licensing, but we like open source, so that’s going to play a role,\" he said.","\"We are currently focused on ensuring we have built the best system of its kind in terms of safety, features, performance, and control,\" he wrote. \"Once we are satisfied, everyone in the industry will have a chance to use it for themselves, and will be free to use it how they want.\"","Edited by Bradley Keoun."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Linehan","content":"PERSON"},{"type":"SMG","content":"ORGANIZATION"},{"type":"Big New Buzzword","content":"ORGANIZATION"},{"type":"Special Mechanisms Group (SMG","content":"ORGANIZATION"},{"type":"Anoma","content":"LOCATION"},{"type":"Jason Linehan","content":"PERSON"},{"type":"Smart Swaps","content":"ORGANIZATION"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"}],"hashtag":["Ethereum","ConsenSys","intents","Wallet","MetaMask","DeFi"],"authors":["Sam Kessler"]}