{"summary":"Expect greater stability on Ethereum, the convergence of CBDCs and stablecoins, and progress on industrial applications of blockchain tech, says EY’s Paul Brody.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/11\/in-2024-crypto-summer-is-coming-and-this-one-will-be-different\/","publishDate":"2024-01-11T21:34:28","id":16831,"type":null,"title":"In 2024, Crypto Summer Is Coming, and This One Will Be Different","category":["Consensus Magazine"],"content":["Looking back over my past predictions about the future, it’s clear that my columns have represented a lot of wishful thinking. Like Oscar Wilde, who once said he could resist anything except temptation, I can predict anything, as long as it's not about the future.","Although I've often been wrong about what will happen in any given year, I do think some of my major forecasts have turned out to be directionally correct. Nor am I content to be a sideline observer. I'm building a blockchain business and technology with the express purpose of influencing that future path.","This post is part of CoinDesk's \"Crypto 2024\" predictions package. Paul Brody is EY's global blockchain leader and a CoinDesk columnist.","The future I'm working to build is one built on the public Ethereum ecosystem with robust, regulatory-compliant business transactions, and meaningful privacy protections. In this open, censorship and monopoly-resistant model, we can build a kind of universal business infrastructure that makes snapping together business interactions a simple, scalable, and reliable experience. In this vision of the future, financial services are easy to integrate and serve their intended purpose: to funnel capital to useful projects from start-ups to green energy projects.","The path here has been much slower than I would like, but the progress is real. In the 10 years I've been in this sector, eight of them at EY in this role, we've seen enterprises embrace tokenization, Ethereum has become the global standard, and the fashion for permissioned chains, though not dead, is slowly fading out.","Enterprises have also embraced fiat currencies alongside crypto, and the ecosystem has largely conquered the scalability challenges though L2s. We are also remarkably far along the path to solving privacy challenges with zero knowledge tools and applications as well.","As always, much of that progress came about during the dark times of our crypto winters. We're not out of the winter yet, but I am hopeful that we are not far away. Indeed, I see the gradual implementation of the Markets in Crypto Assets (MiCA), which happens in Europe from June 2024, as an important milestone on the path back towards our next blockchain summer.","I have three hopes about the coming summer, which I'll go ahead and call \"predictions.\"","The first is that this summer proves much more sustainable. While macroeconomic changes have certainly impacted prior blockchain summers, I believe that other problems have had a much bigger impact including ecosystems like Ethereum hitting up against their capacity limits and generating high fees, waves of fraud, and the limits of institutional capital pools.","This time could be different. L2s have given Ethereum vast capacity, regulators around the world are unlocking institutional capital flows such as pension funds while simultaneously giving investors greater protections from rug-pulls and frauds. These measures are still immature and there are no financial ecosystems without fraud and risk, but in the next summer Ethereum and crypto will look and feel much closer to the rest of the financial ecosystem.","My second prediction is that we will start to see the world's central banks start to converge upon both regulated stablecoins and Central Bank Digital Currencies (CBDCs) as the preferred approach to implementing CBDCs. This won't be a result of regulators suddenly embracing decentralization and individual control. It will just be a practical choice.","Nearly all CBDC plans today are connected to tokenized, but centralized systems ̅̅almost none of which plan for real programmability. As a result, central banks are finding that while CBDC prototypes and pilots do work, technically, their \"value-add\" over existing Real Time Gross Settlement systems is quite limited.","None of the ways to \"fix\" these shortcomings look very appealing. For central banks to build fully programmable and open systems on a par with Ethereum, seems like a monumental technical challenge and deploying a single national coin onto a public network invites potential hacking risks.","Read more: Paul Brody - Under the Hood, 2023 Was a Highly Constructive Year for Crypto","There will be some cases where public sector managed CBDCs will go ahead and have compelling value propositions. I believe these will be most gripping in countries that have not yet implemented national real-time payments (there aren't many) or those where governments want to see more intense (and low cost) competition in the consumer payments space. The global consumer payments market is highly consolidated and, in many countries like the U.S. and Canada, payment fees look remarkably high compared to low-cost leaders such as Australia.","Despite these challenges and the lack of a clear value proposition, many central banks seem determined to deploy both retail and wholesale CBDCs. I confess I don’t understand what is driving this push, but am coming to suspect that the push towards CBDCs has more to do with gaining additional power and control over the financial system, than as something that really solves a major problem.","Even with a CBDC, I believe regulated stablecoins are coming as well. CBDCs won’t “quench” the demand for blockchain-based programmable money that can be used in DeFi services or for digital asset purchases.","Lastly, I hope to see industrial applications keep going with their progress. This is the slowest, most unglamorous progress you can get, but it’s happening. Corporations are easily scared off by scandals like some of the crypto exchanges of late, but my hope is that as memories fade and solutions improve, we will see a steady re-acceleration of adoption.","I cannot promise you summer is coming in 2024, but spring is definitely in the air.","Edited by Benjamin Schiller."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Oscar Wilde","content":"PERSON"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Time Gross Settlement","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Paul Brody","content":"PERSON"},{"type":"Hood","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"ups","content":"ORGANIZATION"},{"type":"June 2024","content":"DATE"}],"hashtag":["Opinion","ethererum","Crypto 2024"],"authors":["Paul Brody"]}