{"summary":"Lido has become a victim of its own success, attracting criticism as its share of staked ether has grown to nearly one-third. That's why it's one of CoinDesk's Most Influential of 2023.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/04\/lido-dao-democratized-eth-staking-then-dominated-it\/","publishDate":"2023-12-04T12:34:35","id":16833,"type":null,"title":"Lido DAO Democratized ETH Staking, Then Dominated It","category":["Consensus Magazine"],"content":["Depending on whom you ask, Lido is either Ethereum's best chance at staving off centralization, or accelerating that undesired fate.","On the one hand, Lido, a liquid staking provider on Ethereum, may have done more than any other to expand access to staking – the process that helps keep the second-most-valuable blockchain up and running.","This profile is part of CoinDesk's Most Influential 2023. For the full list, click here.","But it's also become a lightning rod for criticism, with skeptics alleging the group has accomplished the opposite of its stated goal of safeguarding the network’s decentralization, and instead amassed a dangerous amount of power to itself.","Either way, Lido DAO has earned a spot among CoinDesk's Most Influential list for 2023.","User deposits into Lido have climbed precipitously since it launched in December 2020, just as Ethereum was gearing up to abandon its power-hungry crypto mining system in favor of \"staking\" – a newer, more energy-efficient method for powering the blockchain.","Ethereum had recently opened up the ability for users to \"stake\" 32 ether – depositing it into an address on the blockchain in exchange for a steady stream of interest. The rewards came in exchange for help \"validating\" the up-and-coming version of the Ethereum chain, which went live in September 2022.","High up-front costs (32 ETH was worth $100,000 at the market's peak) and technical complexity made staking a challenging proposition for many, however. It was also impossible to withdraw staked ETH until an update that didn’t come until this year, so staking in the early days meant locking up a huge sum of ETH for an indeterminate amount of time.","Lido offered a solution. Staking became as easy as handing any sum of ETH to the protocol, which pooled it with funds from users from around the world in order to reach the 32 ETH threshold. Lido's third-party partners handled all the technical nitty-gritty of setting up a \"node\" to earn interest – simplifying the process drastically for end-users.","Lido also allowed users to stay liquid. It gave out a derivative token, \"staked ether\" (stETH), representing funds staked via the protocol. This stETH accrued interest and tended to trade around the price of normal ETH – essentially offering the same benefits of staking in a package that could be bought or sold at any time.","Today, the value of deposits into Lido surpasses $9 billion, and stETH is the largest decentralized finance token by market capitalization. Lido's boosters say the product has helped keep Ethereum staking from falling into the hands of a few large actors.","Lido's governance by a DAO – a decentralized autonomous organization of the project's LDO token-holders – means core decisions about how the protocol evolves are determined by community votes, rather than top-down directives from a company. Lido also works to decentralize its infrastructure, divvying up user deposits across dozens of third parties as a bulwark against centralized control.","But Lido has gradually become a victim of its own success, with the DAO attracting criticism as it has grown to dominate Ethereum's staking landscape. Lido currently commands 32% of all ether staked. This puts it just below a critical 33% threshold; if a single entity controls this much staked ETH, it could, theoretically, influence certain elements of how the chain operates.","The DAO has rejected a community proposal to cap the amount of ETH Lido will stake. Its supporters say Ethereum would be worse off if a big company – say, the crypto exchanges Coinbase or Binance – amassed the 33% instead of a community-led protocol that splits its operations between third parties.","However it proceeds, LDO token-holders have tremendous influence over how proof-of-stake blockchains like Ethereum continue to develop, and the group will be looked to by other DAOs as the world of decentralized governance continues to mature."],"entity":[{"type":"2023","content":"DATE"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"ETH Lido","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"$9 billion","content":"MONEY"}],"hashtag":["Features","Most Influential 2023","Lido","Lido dao","Staking","no-livewire"],"authors":["Sam Kessler"]}