{"summary":"At their peak in 2017, initial coin offerings (ICOs) had overtaken venture capital as the main fundraising method for blockchain startups.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-an-ico\/","publishDate":"2021-09-29T11:15:53","id":16830,"type":null,"title":"What Is an ICO?","category":["Learn"],"content":["As a type of digital crowdfunding, ICOs enable startups not only to raise funds without giving up equity but also to establish a community of incentivized users who want the project to succeed so their presale tokens rise in value.","While ICOs can offer an easy funding mechanism and an innovative approach for startups to raise money, buyers can also benefit from both access to the service that the token confers as well as a rise in the token’s price if the platform is successful (big IF!)","These gains can be realized by selling the tokens on an exchange once they’re listed. Or, buyers can double down on the project by purchasing more tokens once they hit the market.","Read more: Investing in Crypto: Alternatives to Bitcoin and Ether","Ethereum’s ICO was one of the first real success stories using this relatively new type of fundraising mechanism, raising $15.5 million in 2014. Fifty million ether tokens (ETH) were sold at $0.311 each, and on May 12, 2021, it hit an all-time high of $4,382.73, offering investors a 1,408,903% return on investment. Now not only is it one of the most valuable cryptocurrencies, but it has enabled an entire ecosystem of decentralized applications (dapps) to blossom from its technology.","It all started in 2013 when software engineer J.R. Willet wrote a white paper titled “The Second Bitcoin White Paper” for the token MasterCoin (which was rebranded as Omni Layer) and was able to raise US$600,000.","By 2014, seven projects had raised a total of $30 million. The largest that year was Ethereum: 50 million ether were created and sold to the public, raising more than $18 million.","2015 was a quieter year. Seven sales raised a total of $9 million, with the largest – Augur – collecting just over $5 million.","Activity started to pick up in 2016 when 43 ICOs – including Waves, Iconomi, Golem, and Lisk – raised $256 million. That included the infamous token sale of The DAO project, an autonomous investment fund that aimed to encourage Ethereum ecosystem development by allowing investors to vote on projects to fund. Not long after the sale raised a record $150 million, a hacker siphoned off approximately $60 million worth of ether, leading to the project’s collapse and a hard fork of the Ethereum protocol.","The DAO’s failure did not deter the increasingly ebullient enthusiasm for the nascent digital asset space, and in December the first fund dedicated to token investment got significant backing from old-school venture capitalists.","2017 saw ICO’s reach a new peak, in part to new technological advancements. 342 token issuances raised almost $5.4 billion and thrust the concept to the forefront of blockchain innovation. ICOs selling out in increasingly shorter periods of time fueled the frenzy, and in the haste to get ‘in on the action,’ project fundamentals became less important to would-be investors.","Along with increased attention came increased scrutiny, and concerns about the legality of token sales. This was evident when the U.S. Securities and Exchange Commission (SEC) put out a statement in 2017 warning that if a digital asset sold to U.S. investors had the characteristics of a security (ownership rights, an income stream, or even expectation of a profit from the efforts of others), it had to abide by U.S. securities laws or face punitive action. More recently, Gary Gensler, the latest Chairman of the SEC, says he believes all ICOs are securities, and are therefore in breach of United States securities laws – hinting more class actions could be on the horizon.","Financial regulators from Australia, the U.K and a long list of other countries also issued warnings to retail investors about the potential hazards of participating in these potentially fraudulent offerings.","South Korea and China decidedly imposed complete bans on ICOs around the same time, while Thailand issued a temporary ban on token offerings a year later as regulators drafted up a new legal framework.","Despite the widespread regulatory concern regarding ICOs, there is yet no global consensus on passing blanket laws – or amending existing ones – to protect investors from flimsy or fraudulent token sales.","Any token sold via an ICO is considered a high-risk investment. The market is still under-regulated, scam ICOs are rife and investors have no protection if an ICO fails or turns out to be fraudulent. A 2018 Satis report prepared for Bloomberg stated almost 80% of ICOs at the time were believed to be fraudulent sales.","Read more: Buying Your First Crypto? 10 Things You Should Know","For anyone looking to participate in an ICO, it’s important to include the following in your due diligence process:","Tokens, especially those that have had successful sales, are usually listed on crypto exchanges. Once listed, new investors who missed out on the token offering have an opportunity to purchase the coins. If a project has marketed itself well, there can be significant demand for its token post-ICO.","It’s become common practice, however, to see ICO investors offload their discounted coins onto the market to secure a quick-and-easy return on their investment or token prices to pump and dump heavily.","Few tokens seldom recovered in price from these types of sell-offs and is a big part of why ICOs are less commonly used today. A study from 2018 showed more than 50% of ICO projects failed to survive longer than four months after launching. Here’s a list of over 2,400 failed ICOs, or “dead coins.”","Cryptography allows digitals assets to be transacted and verified without the need for a trusted third party.","Blockchain technology eliminates the need for a trusted party to facilitate digital relationships and is the backbone of cryptocurrencies.","Here are a few suggestions to avoid falling victim to scammers and hucksters who will try to take advantage of people who are still new to the wild world of cryptocurrencies."],"entity":[{"type":"2014","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"2013","content":"DATE"},{"type":"US$600,000","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"1,408,903%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"J.R. Willet","content":"PERSON"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Australia","content":"LOCATION"},{"type":"$60 million","content":"MONEY"},{"type":"May 12, 2021","content":"DATE"},{"type":"$0.311","content":"MONEY"},{"type":"Iconomi","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"Golem","content":"LOCATION"},{"type":"$18 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"$256 million","content":"MONEY"},{"type":"$15.5 million","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$4,382.73","content":"MONEY"}],"hashtag":["Technology","Beginner","Learn"],"authors":["Annika Feign"]}