{"summary":"The latest upgrade ushers in an era of smart contract composability for the four-year-old network.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2021\/09\/12\/cardano-gains-smart-contract-capability-following-alonzo-hard-fork\/","publishDate":"2021-09-12T21:53:11","id":16841,"type":null,"title":"Cardano Gains Smart Contract Capability Following ‘Alonzo’ Hard Fork","category":["Technology"],"content":["Cardano’s network update, Alonzo, is finally live. With Alonzo’s arrival at at 21:47 UTC at epoch 290, smart contracts – pieces of code that self execute when predefined conditions are met – can now begin to be created and deployed on the Cardano mainnet.","Cardano is an open-source public blockchain developed by Input Output and founded by Charles Hoskinson, one of the founders of Ethereum. First released in September 2017, it was designed to challenge Ethereum’s decentralized finance dominance while also maintaining a level of interoperability with Ethereum and other blockchains.","Smart contracts are the golden ring when it comes to mounting that challenge. After months of progress on the Alonzo testnet, today’s hard fork to the Cardano mainnet paves the way for smart contracts to be written in Plutus scripts, “a purpose-built smart contract development language and execution platform using the functional programming language Haskell.”","The update is a key part of of the Goguen era, which focuses primarily on building smart contract capabilities. Goguen was developed in tandem with Shelley, the earlier era that introduced proof-of-stake protocol Ouroboros to the network more than a year ago, as part of an effort to build out the network’s security and decentralization.","Read more: Cardano Alonzo Hard Fork: What You Need to Know","The introduction of Cardano’s Plutus scripts will also enable decentralized applications (dapps) to be built in the ecosystem. However, it may still take some time before the Cardano ecosystem is entirely ready for dapps to fully materialize on the mainnet, as the protocol continues to be developed and to mature.","A blog post published today by Input Output reminds the Cardano community that development is still early:","The blog post also cautioned:","Still, Cardano watchers can expect to see a number of simple smart contracts deployed in the first few hours following the Alonzo hard fork, with the possibility of further projects currently under development being rolled out in the coming months.","As for Cardano itself, the team will continue to focus on various improvements including synchronization efforts and compression of transaction script sizes to optimize throughput on the network, said Neil Davies, a systems performance analyst at Input Output. Indeed, this is the first epoch in which the network exceeded half a million transactions, he said during the YouTube watch party leading up to the hard fork.","Cardano’s native cryptocurrency, ADA, is down 5.76% from today’s high of $2.79 at 18:22 UTC and is currently changing hands for around $2.56. ADA reached its all-time high of $3.09 on Sept. 2, 2021, according to CoinDesk data."],"entity":[{"type":"Neil Davies","content":"PERSON"},{"type":"5.76%","content":"PERCENT"},{"type":"Alonzo","content":"LOCATION"},{"type":"Cardano","content":"PERSON"},{"type":"Haskell","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Shelley","content":"PERSON"},{"type":"Cardano’s Plutus","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Sept. 2, 2021","content":"DATE"},{"type":"Input Output","content":"ORGANIZATION"},{"type":"$2.79","content":"MONEY"},{"type":"$2.56","content":"MONEY"},{"type":"Goguen","content":"PERSON"},{"type":"ADA","content":"ORGANIZATION"},{"type":"September 2017","content":"DATE"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"$3.09","content":"MONEY"}],"hashtag":["Cardano","Alonzo","hard-forks","smart contracts"],"authors":["Sebastian Sinclair"]}