{"summary":"In a wide-ranging interview with The Block, MicroStrategy executive chairman and co-founder Michael Saylor covered everything from spot bitcoin ETFs, Bitcoin maximalism, unregistered securities and “sawdust donuts.”\nSaylor said he underestimated bitcoin’s volatility but remains confident in its potential for widespread adoption.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237231\/michael-saylor-bitcoin-etf","publishDate":"2023-06-30T09:36:07","id":1684,"type":null,"title":"Michael Saylor: Bitcoin ETF would be a &#x27;milestone on the road to institutional adoption&#x27;","category":["Companies"],"content":["A Bitcoin ETF would be a big development for the industry, but it wouldn't necessarily lead to major price gains, according to MicroStrategy Executive Chairman Michael Saylor.","“It's a milestone on the road to institutional adoption,\" Saylor said, in an interview with The Block. \"I think it's important, but I don't think it drives bitcoin to $5 million overnight.”","Sat in front of the 1886 Monet painting “Fields of Tulip with the Rijnsburg Windmill\" — perhaps in a nod to deniers that say Bitcoin is a Tulip mania-like bubble — Saylor said that it would be a significant move because it provides clarity to institutional investors and shows them that Bitcoin is a legitimate asset.","“I think the spot ETF is an endorsement by the regulators of bitcoin as a legitimate asset, but also it provides an onramp where I could go and I could buy $10 million of it in 30 seconds by punching a button,” he added.","The race for a spot ETF is underway at full speed. BlackRock <a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\">reignited<\/a> the action on June 15, when it filed for a spot bitcoin fund for the first time. Sensing a change in the winds, <a href=\"https:\/\/www.theblock.co\/post\/235753\/wisdomtree-invesco-and-blackrock-are-now-all-gunning-for-a-bitcoin-etf\" data-v-f87c67ca=\"\">Wisdom Tree<\/a>, Bitwise, <a href=\"https:\/\/www.theblock.co\/post\/235753\/wisdomtree-invesco-and-blackrock-are-now-all-gunning-for-a-bitcoin-etf\" data-v-f87c67ca=\"\">Invesco<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/235921\/valkyrie-joins-race-for-spot-bitcoin-etf-with-wednesday-sec-filing\" data-v-f87c67ca=\"\">Valkyrie<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/235889\/fidelity-files-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">Fidelity<\/a> quickly followed suit in filing — not necessarily for the first time — for similar funds.","On August 10, 2020, MicroStrategy became the <a href=\"https:\/\/www.theblock.co\/linked\/74534\/microstrategy-becomes-first-listed-company-to-buy-bitcoin\" data-v-f87c67ca=\"\">first<\/a> publicly traded company to buy bitcoin as part of its capital allocation strategy, announcing it would buy $250 million worth of bitcoin from its cash reserves that had been generating a 0% yield.","Acknowledging his initial skepticism toward Bitcoin back in 2013, Saylor said, “I was slow to recognize the power. I didn't have the need.” But since embarking on its bitcoin strategy, MicroStrategy has made multiple purchases of the asset, the latest being an <a href=\"https:\/\/www.theblock.co\/post\/236904\/microstrategy-bitcoin-12333-btc-for-347-million\" data-v-f87c67ca=\"\">acquisition<\/a> of 12,333 BTC for $347 million in cash. This has expanded its total bitcoin holdings to around 152,333 BTC — worth over $4.6 billion.&nbsp;","“We bought it at $10,000, we bought it at 20, 30, 40, 50. We even bought some at $60,000,” Saylor said. The net result? Saylor thinks of it as a form of bitcoin dollar-cost averaging, claiming that bitcoin has been the best-performing asset over the last three years.&nbsp;","Turning to MicroStrategy’s MSTR stock, Saylor said, “You know, our stock's up 165%. So we actually outperformed bitcoin over the same time period simply by adopting a bitcoin standard and sweeping cash flows and equity and debt and the like into bitcoin.”","Some 34 months into MicroStrategy’s experiment, “Silver is down 21%. Long dated bonds? They're down 19%. What about gold? Gold's down 5%. Gold is dead money. So all that money printing, none of it found its way into gold,” Saylor said.","\"So what went up in value? Up in price? The Nasdaq is up 23%. The S&amp;P is up 29%. So actually the S&amp;P outperformed Nasdaq. Bitcoin is up 153%. So Bitcoin is outperforming the S&amp;P by a factor of five. It's left gold in the dust,\" he said.","Following bitcoin’s <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">fall<\/a> from around $69,000 in November 2021 to a low of around $16,000 at the end of last year, Saylor admitted that he had underestimated bitcoin’s volatility. While he expected fluctuations of around 30%, “I didn't think it would draw down to $16,000. It turned out to be a bit more brutal this cycle,” he said.","“I think that Bitcoin is kind of shocking, you know, and a little bit scary to people. But it's spreading at about the fastest rate. We just have to kind of hold on and suit up for the ride. It's not always easy.”","Bitcoin maximalism is a term coined by Ethereum co-founder Vitalik Buterin in response to the perceived closed-mindedness of bitcoin-only advocates. For Saylor, the definition is “just someone that believes Bitcoin is an instrument of economic empowerment.”","“I think that bitcoin is emerging as a supported asset class. If you've got the regulators endorsing it, Congress endorsing it, legislators endorsing it, you've got [presidential] candidates endorsing it, then I think you've turned a corner,” Saylor said.","He added that maximalism has sometimes painted people in a controversial way. Yet he views it quite differently. He sees a maximalist as someone who thinks the object in question is an ethical good.","“If you thought it's an ethical good to give property rights to 8 billion people, and you see a network that is nation state resistant that is not controlled by any company, that's a global network that's open and permissionless. Then you could just say I'm a Bitcoin maximalist. I believe this is an instrument of economic empowerment. It's good for the world,” he said.","Saylor takes a different view on other cryptocurrencies like ether. “Ethereum is a different situation, and all these crypto tokens are different issues. They're unregistered securities,” he said.&nbsp;","“If I actually create my own token and I keep a lot of it and I sell some to the world and I manipulate the price of it, and I don't tell you how many I have. And then I change the protocol to give myself more. Without telling you, that was an unregistered security, right?,” Saylor added. “So if someone notices that and they object to that, then all they're doing is observing the fact that I'm attempting to manipulate the securities market. I wouldn't endorse that.”","“Apple is a registered security. So the question is, if you're going to sell a security to the general public, have you made the full and fair disclosures as to who controls the protocol and what they can expect? And that's a challenging thing. It costs a lot of money to properly disclose any given security. I'm not here to tell you to buy Apple stock. I'm not here to endorse a currency or a trade. I'm here basically to say I like Bitcoin,” Saylor said.","So far, the SEC has made it clear that it views most tokens as securities. The only clear exception appears to be bitcoin. Ether, for its part, is the most ambigious as former SEC officials have expressed views that the agency doesn't appear to hold. When asked to clear up this issue, SEC Chair Gary Gensler refused to say whether ether is a security – <a href=\"https:\/\/www.theblock.co\/post\/226974\/gary-gensler-ether-security-crypto-clarity-congress-sec\" data-v-f87c67ca=\"\">purporting to claim<\/a> that there was already enough clarity.","Discussing the debate over the <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">surge<\/a> in popularity of Ordinals NFT-like tokens earlier this year and potential changes to the Bitcoin protocol to restrict them, Saylor said the protocol should just be left alone.","“My general view on the protocol is you shouldn't really change it unless there's an overwhelming consensus in the community that we're facing a fatal defect,” Saylor said. “Otherwise, I think most innovation ought to take place consistent with the protocol. If they want to create new open protocols, they should create them on Layer 2s like Lightning.”","“I'm an Austrian economist, so I would say it's okay to criticize people's business ideas, but one should not censor,” he added. \"Just like if you open up a bakery and you sell really awful donuts made of sawdust. It's a stupid idea. I wouldn't invest in it. I won't buy your sawdust donuts. You'll probably go bankrupt. But I don't think the mayor should pass a law saying you have to get permission before you sell your sawdust donuts in my town.”","Ordinals have continued to expand across bitcoin, as both NFTs and tokens, leaving higher transaction fees in their wake. Last month, NFTs on Bitcoin saw $15 million of trading volume.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/nft-trade-volume-by-chain\/embed\" title=\"NFT Trade Volume by Chain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["BITCOIN"]}