{"summary":"The news of the deployment of ERC-4337 will be shared at an ETHDenver-related event, known as WalletCon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/03\/01\/ethereum-activates-account-abstraction-touted-by-founder-buterin-as-key-advance\/","publishDate":"2023-03-01T18:45:31","id":16842,"type":null,"title":"Ethereum Says ERC-4337 Deployed, Tested, Beginning Era of Smart Accounts","category":["Technology"],"content":["The Ethereum blockchain has deployed a feature known as “account abstraction,” seen as a key enhancement that could make it easier for users to recover crypto if they lose private keys to an online wallet.","The new standard, formally known as ERC-4337, was deployed via a smart contract called EntryPoint, according to data on the blockchain explorer web site Etherscan and confirmed by Yoav Weiss, a security fellow at the Ethereum Foundation. The contract has already undergone a full security audit, people with knowledge of the matter told CoinDesk.","The Ethereum Foundation, which helps to fund and steward development on the blockchain, is expected to announce the development later Wednesday at the ETHDenver conference at a WalletCon event at 5 p.m. local time (0:00 UTC), the people with knowledge of the matter said. Once the announcement is made, several infrastructure providers will announce plans to support ERC-4337 through their services.","Part of the reason why ERC-4337 was so easy to deploy is because the upgrade was made via the addition of a smart contract, so it didn’t require any changes to Ethereum’s underlying programming, which would be complicated to implement. This proposal just adds a new layer atop Ethereum’s mainnet layer. The goal is to eventually integrate account abstraction into the main protocol.","The contract can be used on all EVM chains, meaning it can be deployed anywhere that is EMV-compatible.","Vitalik Buterin, co-founder of Ethereum, tweeted about ERC-4337’s advantages in October.","“We’re narrowing down an actual path for account abstraction, something we’ve always wanted but have not actually managed to have,” Buterin tweeted.","Account Abstraction is a concept that turns users' wallets into smart contract accounts, in order to make Ethereum wallets more user-friendly and to prevent any loss of crypto keys.","This upgrade was seen as a major milestone that would be years away, but the fact that it is already working on the Ethereum blockchain means that making crypto more user-friendly is here.","On Ethereum, users can create two types of accounts that hold their crypto: External Owned Accounts (EOA) and Contract Accounts (CA).","EOAs, which most Ethereum users opt for, are the type of account you use if you open a MetaMask and Coinbase Wallet.","With EOAs, users are given a pair of private and public keys, and anyone can send crypto to an EOA using their public key. On EOAs, only the owner of their account, the person who has access to their private keys, can initiate transactions.","CAs on the other hand, are accounts controlled by code – not private keys – so they cannot initiate transactions themselves.","The issue with EOAs comes down to human error – if a user loses their private keys, there is no way to recover that. Account Abstraction addresses the issues of an EOA account by merging it with a CA – therefore creating built-in mechanisms that can allow users to keep access to their crypto.","Some of these built-in mechanisms include a social recovery system, where several users have the ability to return access to that account should someone lose their personal private key. Account Abstraction also allows users to create “multisig wallets” that give a group of users access to an account, and require multiple users to sign off on transactions as an extra safety mechanism.","Read more: Ethereum Upgrade Could Make It Harder to Lose All Your Crypto"],"entity":[{"type":"5 p.m. local time (0:00","content":"TIME"},{"type":"EOA","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"Yoav Weiss","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"EMV","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Upgrade","ETH","Wallet","smart contracts","Exclusive"],"authors":["Margaux Nijkerk"]}