{"summary":"You would think the government would be against an online privacy service facilitating money laundering. But it actually created one of the best, says attorney Alexandra Damsker.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/07\/the-us-governments-hypocritical-case-against-tornado-cash\/","publishDate":"2024-05-07T17:06:51","id":16851,"type":null,"title":"The U.S. Government’s Hypocritical Case Against Tornado Cash","category":["Consensus Magazine"],"content":["I’ve been thinking quite a bit about Tornado Cash recently, which is unusual, because I normally spend approximately zero minutes thinking about crypto blenders most days. For reference, Tornado Cash is an Ethereum application that, among other tools, offers the ability to pool assets to allow privacy.","Blockchain transactions are typically public\/private transactions. That is, users can shield their identity in transactions by using a coded, unidentified wallet, but all transactions are public and trackable. That is actually the point of blockchain: trackable asset transactions. However, sometimes people don’t want their transactions tracked, for various reasons, some nefarious, others to do with issues like personal safety.","Alexandra Damsker's book, \"Understanding DeFi\" (O'Reilly), was published in February 2024. This op-ed is her personal view.","So privacy services like Tornado Cash exist, bundling assets together by the thousand and allowing individual wallets to shield the origin or lose the tracking of a particular asset. (This doesn’t work for unique assets, like one-of-one NFTs, for example.) It’s just a series of open-source smart contracts on the EVM (Ethereum compatible blockchain) that provides the pooling deposit and withdrawal service. To my knowledge, it does not take a percentage fee of any transaction.","So, this would exist, and no one would really care, except it’s used for money laundering. A LOT of money laundering. Especially by the North Koreans. And, naturally, that brings the attention of the U.S. government. The Treasury Department sanctioned the service in 2022, declaring it a “mixer,” which is illegal. They have arrested one and charged three of the Tornado Cash developers with conspiring to commit money laundering, conspiring to operate an unlicensed money transmitter and conspiring to violate sanctions law by creating and operating Tornado Cash.","Tornado Cash argues it was a money transmitter business (an unlicensed one), in that it received and transmitted currency, and nothing more. That’s not really a great argument, in general; it doesn’t save them from much.","Here, I think, there is a better argument to be made in that the definition of money transmitter business requires a “party” to be sending and\/or receiving currency. If you dig into what that actually means, we’re likely going to end up with a definition like this, from the Code of Federal Regulations: “an individual, a corporation, a partnership, a trust or estate, a joint stock company, an association, a syndicate, joint venture, or other unincorporated organization or group, an Indian Tribe (as that term is defined in the Indian Gaming Regulatory Act), and all entities cognizable as legal personalities.”","Without knowing more about the structure of Tornado Cash -- but seeing that the government charged the founders, not an entity – it looks like it was just a series of unowned smart contracts. Smart contracts are unlikely to be recognized in that definition without modifying the definition to include smart contracts and other algorithm-based operators.There was no “party” that could receive or send anything.","Still, the money laundering part -- that sounds bad, right? Creating something that shields illegal activity must be something the federal government hates. Except when it creates it.","Read more: Dan Kuhn - Samourai Wallet Charges Raise Existential Questions for Privacy Tech","For those who don’t know the history of The Onion Layer project, it was created in 1995 by three scientists at the Naval Research Lab for the express purpose of using the internet (recently opened from strict government and academic use) without being tracked. It was jointly funded by the Naval Research Lab and the Defense Advanced Research Projects Agency (DARPA), and eventually, in 2006, became Tor, the primary browser of the dark (or unindexed) web. Tor was created and used by the U.S. government for passing along and receiving coded intelligence messages, protecting the identities of agents and dissidents. It relies on the exact same principles as Tornado Cash. It has many users, without discretion as to whether the nature of the user or transaction is legal and exists to shield the privacy of particular users (i.e. for the exact same reasons).","It is well known that a massive amount of illegal transactions occur via Tor, the least of which is money laundering. (I tried to find a reliable statistic on the amount of darknet laundering and fraud, but, being the dark net, the numbers ranged from $1 to $100 billion.) Adversarial nations can access the browser -- both they and the US government count on the traffic and language-jumble to make masking easier. The government not only accepts this; it invites more people to participate. The CIA even gives you convenient access to their Tor portal at https:\/\/torproject.org, helpfully suggesting you use a VPN router “to mask your originating internet protocol (IP) address.”","I’m sure the government will rush to sanction itself for these activities, too (just kidding) since it’s illegal to “obfuscate the proceeds from illicit cyber activity and other crimes. . .including sanctions evasion through mixers, peer-to-peer exchangers, darknet markets, and exchanges[, ]. . . facilitation of heists, ransomware schemes, fraud, and other cybercrimes,” according to a 2022 U.S. Treasury press release, and this could equally apply to both Tornado Cash and Tor.","I’ll just wait while they do that. Good thing I brought a book to read. Hey, is that Godot…?","Edited by Benjamin Schiller."],"entity":[{"type":"Alexandra Damsker","content":"PERSON"},{"type":"O'Reilly)","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"1995","content":"DATE"},{"type":"2006","content":"DATE"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Samourai Wallet Charges Raise Existential Questions for Privacy Tech","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Dan Kuhn","content":"PERSON"},{"type":"Naval Research","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"North Koreans","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Defense Advanced Research Projects Agency (DARPA","content":"ORGANIZATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"CIA","content":"ORGANIZATION"}],"hashtag":["Opinion","Tornado Cash"],"authors":["Alexandra Damsker"]}