{"summary":"In the document filed on Thursday, Coinbase raised concerns about the SEC’s interpretation of securities laws, suggesting the agency was reaching beyond its legal authority.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237011\/coinbase-files-motion-to-dismiss-secs-suit-branding-it-an-extraordinary-abuse-of-process","publishDate":"2023-06-29T05:39:14","id":1685,"type":null,"title":"Coinbase files motion to dismiss SEC’s suit, branding it &#x27;an extraordinary abuse of process&#x27;","category":["POLICY"],"content":["Crypto exchange Coinbase filed a motion to dismiss the recent lawsuit lodged against it by the U.S. Securities and Exchange Commission (SEC).","The <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">lawsuit<\/a> alleged that Coinbase facilitated unregistered trading in 12 digital tokens that were deemed securities. The claim has been hotly contested by the exchange in its latest response.","The company argued that the SEC was applying securities laws to certain digital tokens in ways that significantly deviate from existing legal frameworks. Paul Grewal, Coinbase’s chief legal officer, <a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1674271484263661569\" data-v-f87c67ca=\"\">stated<\/a> that the SEC’s claims “go far beyond existing law” and should, therefore, be dismissed.","In a legal <a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/4oVJN5EioULD0QnSyg01b8\/2b1f34594a800c727fb61a384f37e74a\/SEC_v._Coinbase__Coinbase_Answer_to_Complaint__As-Filed_.pdf\" data-v-f87c67ca=\"\">document<\/a> filed on Thursday with the U.S. District Court for the Southern District of New York , Coinbase raised concerns about the SEC’s interpretation of securities laws, suggesting the agency was reaching beyond its legal authority.","Filing a motion to dismiss underscores Coinbase’s determination to challenge the SEC’s lawsuit. A motion to dismiss argues that even if all the allegations in the lawsuit are true, the plaintiff does not have a valid legal claim.","“Even if the SEC were correct that the assets and services it identifies are within the scope of its existing regulatory authority, this [legal] action must be dismissed on independent grounds that it violates Coinbase’s due process rights and constitutes an extraordinary abuse of process,” Coinbase’s legal team stated in the filing.","As a U.S. government agency, the SEC requires that any platform facilitating the trading of assets, which it defines as securities, must register with it.","SEC's definition of a security includes investment contracts, which have been interpreted by the Supreme Court in the Howey Test to include transactions where individuals invest money in a common enterprise and expect profits primarily from the efforts of others. In its suit, the SEC named 12 crypto tokens as securities, including SOL, ADA, MATIC, SAND, FLOW, ICP, NEAR and DASH.","In the Thursday filing, Coinbase claimed that the digital assets in question are not securities. “None of the assets the SEC has now identified are in fact securities, and for that and other reasons, secondary transactions in those assets are also not securities,” it stated.","The legal document further noted what the company described as inconsistencies in the SEC’s decisions, emphasizing that the SEC had not raised objections to six of these tokens in their previous dealings with Coinbase in 2021.","The exchange's lawyers further argued that in 2021, the SEC declared Coinbase’s registration statement with the commission effective, thereby permitting the company to sell its shares to investors when it went public.","The approval followed an extensive review process that spanned several months and involved in-depth discussions with Coinbase. The registration approval allowed Coinbase to trade more than 240 tokens on its spot exchange, including six of the 12 tokens now under dispute.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"ICP","content":"LOCATION"}],"hashtag":["LAWSUITS"],"authors":["Vishal Chawla","The Block"]}