{"summary":"A U.S. debt default could catapult the cryptocurrency onto the international stage.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/05\/17\/what-does-the-debt-limit-showdown-mean-for-bitcoin\/","publishDate":"2023-05-17T16:00:23","id":16853,"type":null,"title":"What Does the Debt Limit Showdown Mean for Bitcoin?","category":["Consensus Magazine"],"content":["U.S. lawmakers are currently locked in a passionate, high-stakes and entirely ridiculous battle over a strange quirk of U.S. law known as the “debt ceiling.” Since 1917, the U.S. budget appropriations process has separated the actual budget – which members of Congress have already approved – from the government’s ability to sell bonds to pay for it. Treasury Secretary Janey Yellen has said that if new debt isn’t approved by June 1, the U.S. government could default on its financial obligations – including halting the payment of interest on Treasury bonds.","This unusual process has become a very appealing tool for a theatrical, media-friendly form of politicking. With increasing frequency over the past three decades, fiscal conservatives have used the vote to raise the debt ceiling as an opportunity to agitate for lower spending. It makes for good TV, with a looming deadline and frantic dealmaking, but none of the political risk of negotiating over specific elements of the U.S. budget.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","For all its ultimate hollowness, the debt ceiling show down has real consequences in the traditional finance sector, most notably raising the cost of borrowing for everyone. Longer term, repeated debt ceiling standoffs have more systemic impacts on the U.S.’s standing as a pillar of global finance.","Both of those impacts have implications for bitcoin.","Most serious people regard the so-called “showdown” over the debt ceiling as pure political theater. First, because the legislators purportedly taking a bold stance against spending have already voted in favor of that spending. And second, because the consequences of actually defaulting on the U.S. national debt would be so incomprehensibly catastrophic that economists and the like can hardly conceive any lawmaker would actually follow through on the threat.","That theory is less reassuring when you realize that some of the loudest voices in the debt ceiling showdown come from the House Freedom Caucus, a coterie of far-right populists who seem to think defaulting on the U.S. debt would be Incredibly Based. That reality is leading Democrats to try to cut deals with the more restrained Republican factions, including House Speaker Kevin McCarthy (R-CA.), a politically fragile leader who needs protection from his own right wing.","It’s still very unlikely that the U.S. defaults on the national debt. But if it does, the price of bitcoin is going to be far down the list of almost anyone’s concerns. Janet Yellen was downplaying it when she described the consequences as “severe hardship for American families.” A U.S. default would trigger the domestic economic equivalent of a nuclear carpet bombing.","And just as with a barrage of nukes, the damage would come in two stages. The initial impact would include the interruption of all sorts of government payments, potentially anything from Social Security checks to big-money military contracts. This would cause an immediate, sharp drop in traditional metrics like GDP [gross domestic product] and the stock market. Given recent evidence of strong correlation between bitcoin and tech equities, it would almost certainly gut bitcoin’s short-term price, too.","A default is, again, a remote possibility. But its potential impact is so huge, even that slim chance is already being reflected in markets. The yield on 10-year and 30-year U.S. Treasury bonds is already inching up, reflecting increased risk of holding them. The Dow Jones Industrial Average and bitcoin have both limped downwards over the past two weeks, though other uncertainties in the market make it hard to connect those moves directly to the debt showdown.","But the second stage of the economic doomsday triggered by a default would be more complex and persistent – and just as deadly as the invisible radiation that lingers after a mushroom cloud drifts away.","A U.S. debt default would dramatically reshape the global financial system, in ways that would be likely to increase bitcoin’s role as global financial infrastructure. This is another example of bitcoin’s role as a theoretical hedge against a disastrous scenario: of something that’s good for bitcoin precisely because it’s very bad for human society.","A U.S. default would, first and foremost, decimate international appetite for holding U.S. debt. That would spike the cost of servicing existing debt, likely forcing the U.S. into a brutal austerity regime. That in turn would slow the entire global economy dramatically – another downward pressure on bitcoin.","But by the same token, U.S. default would accelerate international efforts to decouple from the U.S. dollar as a trade and investment instrument. The dollar’s biggest appeal is its strength and stability, and a default would obviously harm that faith. Saudi Arabia, Russia and China have all made significant recent gestures towards getting the key oil trade off the dollar, but a default could push those efforts from rhetoric closer to reality.","This anxiety would be very likely to create at least some added marginal demand for bitcoin as an international trade instrument.","But as the cartoon rabbit says, that’s not all, folks.","When I and others sneer at the debt ceiling standoff as pure theater, it’s not because we disagree with the nominal goal of reducing government spending. Rather, the gripe is that a semi-annual debt ceiling standoff is a very bad way of pursuing fiscal responsibility.","That’s unacceptable exactly because debts and deficits are such deadly serious issues, not just in the U.S. but around the world. In the U.S., a staggering 7% of federal spending goes to servicing debt. Those taxpayer dollars are no longer doing anything to strengthen the economy or improve the lives of its citizens. And every time we run an annual budget deficit, that spending on debt service goes up.","See also: The World's Best Crypto Policies: How They Do It in 37 Countries","We’re clearly on an unsustainable path. But so is everyone else. Global national debt levels now sit at 102% of GDP, an all-time record that is just above the roughly 100% debt-to-GDP ratio that is considered sustainable for an individual country. This has led to increasing worry about what some have termed a “Great Reset” – a cascading series of interlocking national defaults that wipes out debt holders at huge scale.","Because national debt makes up such a huge portion of the assets on global balance sheets, the impacts would be catastrophic, and instability in the U.S. debt market is as likely to set off the cascade as anything.","This scenario is part of the much broader case for bitcoin’s ascendancy as a global reserve and trade instrument (setting aside, for the moment, very real technical limitations). In an environment of rising defaults, bitcoin’s neutral monetary layer could very well form a significant backstop simply because it is unfettered from national debt risk. The U.S. debt limit showdown, in all its infantile ridiculousness, highlights just how serious and unpredictable that risk is.","Edited by Daniel Kuhn."],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"7%","content":"PERCENT"},{"type":"June 1","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Kevin McCarthy","content":"PERSON"},{"type":"House Freedom Caucus","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"102%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Janey Yellen","content":"PERSON"},{"type":"1917","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Opinion","Bitcoin","Debt","Macro","The Node","Newsletters"],"authors":["David Z. Morris"]}