{"summary":"The U.S. platform, which drew industry barbs for insisting crypto can comply with SEC rules, is now approved for clearing, though it won't begin for a few months at least.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/21\/prometheum-earns-final-regulatory-nod-to-try-hand-at-fully-compliant-crypto\/","publishDate":"2023-12-21T14:51:04","id":16865,"type":null,"title":"Prometheum Earns Final Regulatory Nod to Try Hand at Fully-Compliant Crypto","category":["Policy"],"content":["Prometheum Inc., with the latest regulatory notch on its belt, is about to finally test whether a viable crypto platform can operate entirely within U.S. Securities and Exchange Commission (SEC) regulations, according to a FINRA document outlining the expanded licensing. The letter, signed Wednesday by co-CEO Benjamin Kaplan, has to be resubmitted to FINRA to finalize the new status..","Prometheum was already the first and only special-purpose crypto broker dealer licensed under SEC rules. It's now obtained approval to clear and settle digital assets securities trades. While the company hasn't yet made its first trade or earned its first dollar of revenue, co-CEO Aaron Kaplan said it will begin taking custody of institutional clients' assets within the next quarter.","\"There's a significant amount of institutional pent-up demand that's been looking to participate in the space,\" Kaplan said in an interview, saying that's been illustrated by all the interest in the potential approval of a bitcoin spot exchange-traded fund by the SEC.","Kaplan said the regulatory questions plaguing U.S. crypto have kept some institutions on the sidelines, and an approved firm that speaks the same compliance language as them \"will allow those institutions to feel comfortable and allow for that pent up demand to be met.\"","A FINRA spokesperson said the self-regulatory organization had no comment.","The company's latest approval from the Financial Industry Regulatory Authority, a securities industry standards and licensing organization that reports to the SEC, will likely rekindle the tense debate over Prometheum's status. Kaplan has been an aggressive advocate of his company's approach to compliance, even as most of the crypto industry has devoted years of policy energy in explaining how it's impossible to run a digital-assets platform under existing rules.","Companies have actually made that case in court, with U.S. exchange Coinbase arguing in April that \"existing SEC registration and disclosure requirements are incompatible with digital assets.\"","The problem for the crypto sector: If Prometheum succeeds, it undermines everybody else's core complaint about operating in the U.S. Other companies have been waging expensive and time-consuming court battles with the SEC over how the agency defines crypto securities and demands registration from exchanges.","Prometheum intends to begin its digital asset custody services for asset managers, hedge funds and other financial institutions in the first quarter of 2024. By the second quarter, the company plans to make trading and clearing available to clients – first for institutional customers, then retail investors. Kaplan also sees it as a potential platform for the tokenization of traditional securities, he said.","As Prometheum rose to prominence this year for its sector-contrary view on compliance, Kaplan waged a rhetorical war with crypto competitors, which got the CEO tapped to testify in Congress. Some in the industry have predicted Prometheum's business model will never happen, despite the unusual and unprecedented regulatory licensing.","The SEC hasn't made the process of trading digital assets especially clear, with Chair Gary Gensler insisting that the same securities laws that have always applied to investment contracts should apply in the same way to virtually all cryptocurrencies. So far, judges haven't entirely agreed with that view.","Still, the commission will only openly acknowledge a single crypto name as being outside its securities jurisdiction: bitcoin. The agency routinely names other tokens as securities in enforcement cases, but that leaves the remaining thousands of tokens in a regulatory limbo. However, both Gensler and his predecessor, Jay Clayton, have publicly stated their view that most cryptocurrencies are securities.","Other, unregistered crypto platforms have made their own decisions about which tokens won't trigger the SEC's securities alarm, and their choices have often run afoul of enforcement actions from the regulator.","Prometheum has previously acknowledged that, when it got its approval as one of about 70 SEC-regulated alternative trading systems (ATSs), it disclosed examples of the securities it would support – a couple of which have also been marked as such by the agency. It told the regulator it could offer Flow (FLOW), Protocol Labs’ Filecoin (FIL), The Graph (GRT), Compound (COMP) and the Celo platform’s CELO, for instance.","\"The public discussion that basically almost every digital asset besides bitcoin is likely a security gives us a significant amount of potential assets which we can support for custody and trading,\" Kaplan said. When asked what specific tokens the company expects to take on, he said he's \"not answering specifics about assets.\"","Kaplan said Prometheum will make further announcements next year. He also declined to say whether the SEC had given the company any specific guidance as the company approached this latest approval.","\"There's been standard communication with our regulators,\" Kaplan said.","Industry executives and lobbyists contend that Prometheum would only be able to trade securities registered with the SEC. And since the bulk of crypto assets remain on the outside, they said the company will have nothing to trade. But Prometheum argues that the SEC's requirements, such as routine disclosures, are primarily the responsibility of whoever is backing an asset and not the job of a trading platform like this one.","\"While we support the SEC’s registration and accompanying disclosure requirements for issuers under federal securities laws, it is the SEC, not Prometheum, that is responsible for enforcement,\" Kaplan said.","An ATS, Kaplan said, has more leeway than a more acutely regulated national exchange. He said a registered exchange has to work with issuers to list their assets, but an ATS has a \"different consideration.\"","\"An alternative trading system chooses to support an asset based on its customers' needs,\" he said.","About 50 employees work at Prometheum and its affiliates, Kaplan said, and public records show eight registered brokers ready to handle trading there. Now that the company is licensed for custody, trading, clearing and settling, Kaplan said, it can \"service the lifecycle of a digital asset\" all in one shop.","With the doors set to open soon, the coming months will be the true test for the company. Until Prometheum operates as a custodian and trading platform for a while without the SEC rolling in to tell the company to cut it out, the business will remain surrounded by doubts from its detractors.","The SEC could also further boost the relevance of Prometheum if it finalizes its recent proposal to demand registered investment advisers only park their clients' crypto assets with \"qualified custodians\" – a term that Gensler argued doesn't include today's crypto exchanges. The rule is targeted for an April list on the SEC's latest rulemaking agenda. As a crypto-native firm licensed to take custody of digital assets, Prometheum could be on a very short list.","SEC Chair Gensler also gave Prometheum another shout-out – though not by name – on Friday when he rejected Coinbase's petition for the agency to write wide-ranging regulations tailored to the industry. Gensler said that the current approach is working fine, and he offered as an example the fact that one broker is already registered.","Read More: The Crypto Industry’s New Favorite Punching Bag – Prometheum – Asks for a Chance","Edited by Nikhilesh De."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"next quarter","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"Benjamin Kaplan","content":"PERSON"},{"type":"Prometheum","content":"PERSON"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Prometheum","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Prometheum Inc.","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"Prometheum","content":"ORGANIZATION"},{"type":"Crypto Industry","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Regulations","Securities and Exchange Commission","Prometheum","Financial Industry Regulatory Authority","broker-dealer","Clearing and Settlement","Exclusive","top news"],"authors":["Jesse Hamilton"]}