{"summary":"For the first time in our history, we have tradable assets that embody innovation, says Noelle Acheson.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/01\/10\/a-new-philosophy-of-markets-assets-that-embody-technology\/","publishDate":"2023-01-10T18:16:01","id":16869,"type":null,"title":"A New Philosophy of Markets: Assets That Embody Technology","category":["Consensus Magazine"],"content":["Amid all the “bah, told you it was all worthless” commentary from skeptics recently, something crystallized for me. I did not fully appreciate how much public perception of crypto had shifted since the last time prices were bouncing along cyclical lows. Back then, crypto was a new type of money, a global computer, an engagement incentive, a governance value.","Now, in the eyes of the mainstream, crypto is a market.","Like many of you, I spent part of the end-of-year break explaining to family and friends that, no, crypto was not “over.” I puzzled for a while over the extent of this misconception until it clicked: It’s not that the crypto market got financialized – we all know that, just as we all recognize the damage done to perception and sentiment by the collapse of some of the main architects and beneficiaries of that financialization.","Noelle Acheson is the former head of research at CoinDesk and Genesis Trading. This article is excerpted from her Crypto Is Macro Now newsletter, which focuses on the overlap between the shifting crypto and macro landscapes. These opinions are hers, and nothing she writes should be taken as investment advice.","It’s more that crypto became just a market for most casual observers. That’s all, just a market. And with the market in dire straits, well, obviously there’s no longer any point to the whole concept.","Looking back, it’s not hard to see how this shift happened. The increasing levels of institutional interest (Goldman Sachs! Fidelity! BlackRock!), prices (up 20% in a day! down 80% year to date!), scams (rug pull! exploit!) and regulatory concern (protect investors! protect the financial system!) fueled headlines that grabbed attention, incentivizing more stories along the same vein. The power of repetition as media coverage of the industry broadened cemented the association of “crypto” with “risky.”","I’m not pointing the finger at media – many publications have done a great job of also surfacing the more transformative aspects of our industry. But perception tends to latch on to what it can grasp, and the “public” (generalizing here) is familiar with markets, whereas it doesn’t necessarily understand Merkle trees. Price moves are easier to visualize than consensus algorithms. And the power of institutional signaling is more relatable than weighted decentralized liquidity pools. The markets narrative is stickier than the tech narrative because it is more comfortable. The risk narrative is stickier than the innovation narrative because drama is better at grabbing our attention.","Read more: Noelle Acheson - Shifting Crypto's Center of Gravity","The instinctive reaction here, then, is to vow to start focusing more on the technology angles of crypto – I and many others have argued for that elsewhere. But while that is still the case, there’s another fundamental aspect of crypto evolution that has been largely overlooked.","We know that crypto assets are both speculative and investment opportunities. We also know they represent radical new technologies. We can acknowledge that they are all those at the same time. What is harder to wrap our heads around is that the asset is the technology.","For the first time in our history, we have tradable assets that embody innovation. Sure, investors can get exposure to progress through equities or exchange-traded funds, but they are formulaic wrappers around potential earnings streams that become available to the public only long after the innovation is first tested.","Amazon, for example, was founded in 1994 and scrabbled together a startup existence for three years before offering the public the opportunity to speculate. Facebook was founded in 2004 but didn’t offer a tradable asset to represent a bet on its potential until 2012. Both were considered extremely risky in their early pre-initial public offering days, too much so for mainstream investors. And both were extremely volatile at launch and for some time after.","Read more: Crypto 2023 - What's Going to Happen After FTX?","Even those examples are not exactly comparable. Amazon and Facebook are not new technologies. They represent a new use of a technology. And both have frequently, and especially in recent weeks, seen their values buffeted by corporate decisions and fiat economy-based earnings outlooks. Bitcoin, ether and others are the new technology. Technically, they are assets that move on new rails – but neither the assets nor the rails work or have value without the other. Plus, there is no earnings risk stemming from strategic decisions taken behind closed doors or from difficult economic conditions. It’s as if you had a chance to buy stock in the internet in 1985 that gave you pure exposure to its adoption, with no corporation risk.","What’s more, crypto assets open up support for innovation unlike any other tradable vehicle to date. They are pure technology plays that anyone, anywhere can invest in, without having to prove a certain amount of wealth for early access. They are risky, yes, but new concepts usually are, and education as well as platform disclosure rules could offer some protection without erecting inequality-enhancing barriers.","Crypto is so much more than a market. It is also more than a new technology. It is a new way of thinking about value, risk, funding and engagement. It adds a jugful of philosophy to the soup of finance, garnishes it with a few dashes of ingenious code and a sprinkle of hype, and stirs it up to get a whole new flavor of evolution.","Maybe this year we can do better at getting that message across. Maybe, with that, we will earn a more thoughtful type of criticism as well as a more nuanced approach to regulation. And, in thinking more about the messaging, perhaps even those of us in the industry can face the next cycle with fortified conviction that what we’re working on matters, probably more than most of us realize."],"entity":[{"type":"Goldman Sachs!","content":"ORGANIZATION"},{"type":"2004","content":"DATE"},{"type":"1994","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"Amazon","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Shifting Crypto's Center of Gravity","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"1985","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Noelle Acheson","content":"PERSON"}],"hashtag":["Opinion","Crypto 2023"],"authors":["Noelle Acheson"]}