{"summary":"Until the world's largest crypto exchange gets better at corporate communications, it’s just FUDing itself.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/22\/binance-needs-to-get-off-twitter\/","publishDate":"2023-08-22T19:14:45","id":16864,"type":null,"title":"Binance Needs to Get Off Twitter","category":["Consensus Magazine"],"content":["You’d think Binance has enough going on that it’d avoid problems of its own doing. Like mistakenly announcing on social media that euro transactions are no longer available. And yet, on Monday, the world’s largest cryptocurrency exchange caused a bit of chaos after just such a corporate communications flub.","To clear everything up: no, Binance did not lose the ability to transact in Europe. Paysafe Payment Solutions, Binance’s banking partner in the area, confirmed that withdraws and deposits conducted in the Single Euro Payments Area (SEPA) will be available until Sept. 25, the original date it gave after announcing in June it would drop the global exchange as a customer following a “strategic review.”","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","The bank was mopping up Binance’s mess, and may now feel even more justified in leaving Binance high and dry. Mistakes happen – X (RIP Twitter) is basically only interesting because people say regrettable things everyday – though this particular misstatement likely couldn’t come at a more inopportune time for Binance.","Binance, although it retracted its statement, essentially said what it expects will happen when Paysafe pulls the plug: “At the moment, we don’t have a time frame for the restoration of SEPA transfers.” Sure, sure this is all speculation, but that is awfully official language for someone with access to the social media accounts to have teed up.","As far as the world knows, Binance does not yet have a replacement for Paysafe. But given that the exchange is having trouble in the U.K., faces an investigation in France and essentially is not welcome in the Netherlands, Germany and Cyprus, its potential alternatives are likely to be hesitant to link up with the exchange.","See also: Binance Under Investigation in France for 'Aggravated' Money Laundering","I mean, you know things are going wrong when you’re having financial issues in Cyprus, a nexus of European tax-dodging and financial opacity. This is to say nothing of Binance’s legal trouble across the Atlantic, where it faces separate lawsuits from the U.S. Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission (CFTC), and is apparently only being saved from criminal money laundering charges from the Department of Justice’s (DOJ) apparent concern over tanking crypto markets. (Alas for Razzlekhan, the mover of asses and markets.)","I’ve already written that I think Binance will make it through the mess, but I don’t bemoan other people’s fear, uncertainty and doubt, or FUD, to steal a phrase from the exchange’s founding chief executive Changpeng Zhao. In fact, CZ routinely tells his audience to simply ignore FUD. So much so that the billionaire entrepreneur has a catchphrase for when corporate challenges arise: often sending out just the number “4.”","See also: How Bad Is the Binance Suit? | Opinion","That bit of phraseology is, let’s say, enigmatic. As the Binance blog puts it when documenting the lineage of 4:","“Following a volatile year in the crypto markets, CZ wrote a post on Twitter on the second day of the year explaining that he would try to keep 2023 simple and spend more time on fewer things. After listing three ‘do’s’, including education, compliance, product & service, he added a number 4 of one ‘don’t’, which was to ‘Ignore FUD, fake news, attacks, etc.‘”","If you’re keeping count at home, that's three do’s. Do education. Do compliance. Do product and do service, which are obviously integrated. And one don’t. Don’t fear. Don’t uncertainty. And don’t even think about doubt. Now, I’m no math wiz but where I start to lose the scent is at “etc.,” which to my mind opens the door to other don’ts — maybe even an infinite amount of things to avoid or push out of mind.","Of course this could all be more arthimancy than arithmetic, if you catch my drift. Not exactly straight numerology (“translate the alphabet to numbers and then count the first letter of each Do and subtract the total numerical representation of FUD and you’ll peer into the mind of God and\/or Gary Gensler”), but bit of New Age thinking for the Crypto Age, where all problems past, present and future are insurmountable if you just think affirmatively and ignore the negatives.","Doesn’t crypto deserve better than the Power of Positive Thinking when facing a near constant stream of PR nightmare fuel?","Binance CEO CZ, like many leaders in the space, was once praised for his authenticity — a willingness to give people a direct line to his thinking on social media and in interviews. But there’s a time and place for everything. Sam Bankman-Fried, also once active on Twitter, learned this the hard way when realizing his old schtick of lying through his teeth and saying “all the right shibboleths” wouldn’t bring back FTX. (Though I might be giving SBF too much credit there, the wisdom probably came from his lawyers.)","With all due credit, in the past year Binance has completely changed its communications policy from essentially “we don’t bow before statist pigs” to full-on obsequiousness. It is now simply reaping what it sowed in trying to work with regulators it formerly blew off. And Binance execs like Chief Compliance Officer Noah Perlman and general counsel Eleanor Hughes have impossible jobs, but are trying to thread the needle.","But not everyone is willing to forgive innocent mistakes or just blow past credible accusations of serious financial crimes at Binance. But it’s sad to see that Binance, which is still perhaps the most important single enterprise in crypto, hasn’t yet figured out how to deal properly. Yes, mistakes happen. Yes, it’s difficult to please both crypto’s degens while also appearing professional. Yes, crypto’s unrelenting defiance and ability to roll with the punches is its enduring strength.","But we need to know whether CZ is staying or going as chief executive, we need to know if the business will ever have an official home and we need to know what is actually going on in Europe. Many of these things may not have official answers, yet – but until they do, Binance is only FUDing itself."],"entity":[{"type":"France","content":"LOCATION"},{"type":"Atlantic","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Power of Positive Thinking","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Noah Perlman","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Sept. 25","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Eleanor Hughes","content":"PERSON"},{"type":"Binance Under Investigation","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Opinion","Changpeng \"CZ\" Zhao","Binance","Culture","Social Media","top news"],"authors":["Daniel Kuhn"]}