{"summary":"Placing bitcoin in cold storage won't prevent losses, but it can eliminate counterparty risk.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/09\/29\/worried-about-a-financial-crisis-enter-self-custody\/","publishDate":"2022-09-29T12:45:00","id":16872,"type":null,"title":"Worried About a Financial Crisis? Enter – Self Custody.","category":["Markets"],"content":["You know what helps me sleep better at night? Having bitcoin (BTC) in cold storage.","Cold storage is an offline digital wallet that allows you to securely store your bitcoin and other digital assets through possession of unique private keys.","Unlike having your money held in a bank – which controls the funds, can lend them out freely and can even freeze the account – cold storage allows you to be your own banker and maintain full control.","That’s why I call bitcoin a bearer asset and think it’s a unique opportunity for clients of financial advisors in 2022. What is a bearer asset, you may ask? A bearer asset entitles the holder of an asset the rights of ownership or title to the underlying property.","You're reading Crypto for Advisors, a weekly look at digital assets and the future of finance for financial advisors. Subscribe here to receive the mailing every Thursday.","Most assets, like cash, stocks and bonds, are held by financial institutions on behalf of their customers and rely on centralized databases listing them as an asset owner.","By contrast, having bitcoin in self custody is a big benefit because it allows the owner to hold it without counterparty risk, the possibility that a third party may default on its contractual obligations.","Come hell or high water, bitcoin is secure in cold storage because the digital asset is in true possession by the owner.","Read more: Hot vs. Cold Crypto Storage: What Are the Differences?","For the first time in history, we’re experiencing a year where the long-term U.S. Treasury bond, the risk-off asset, has fallen even further than the S&P, which is down over 20%.","So, if we are on the brink of a financial crisis, we’ll want to be on guard.","From experience of previous financial crises, we know that the cascading risk can lead to contagion of other assets previously thought to be “safe.”","Individuals may be responsible for losses in these environments, but custodians or other financial intermediaries can also expose assets to risk.","I’ve written previously about why bitcoin belongs in portfolios even in a bear market as well as how to think about it in a portfolio with clients.","As currency markets are beyond strained, even the New York Times is asking whether bitcoin is going to be the “flight to safety.”","My crystal ball is cloudy, but the bitcoin optimist in me thinks bitcoin is a much needed asset, as I recently tweeted, “#Bitcoin was created following the last Great Financial Crisis. If we are entering another one, wouldn’t it make sense to have the best “outside” money you can w\/o counterparty risk?”","Bitcoin provides the ability to eliminate counterparty risk, eliminate the risks of supply inflation and allows for self-custody. All of those factors could help clients of financial advisors sleep better at night when the financial world is figuring out which side is up and which is down.","The good news is that financial advisors can be the heros who walk clients through the cold storage process.","Clients have two options when it comes to cold storage, although the latter can allow advisors to be more involved.","I believe the use of a multisignature wallet with an advisor holding one of three or more keys will be a billable and much-needed service for clients going forward.","Today, fees range from $250 to $3,000 for self-custody help and assistance in setting up multisignature wallets. To some that may sound like a lot. But if you hold a large amount of wealth in bitcoin, it’s worth doing it right.","Read more: Multisignature Wallets Can Keep Your Coins Safer (If You Use Them Right)","I’ve been fortunate enough to work with clients on self-custody both in-person and virtually around the country.","I can say from experience that helping clients understand why self-custody is important – and building their confidence in it – is tremendously valuable.","There are not many advisors today who understand all the options and can walk clients through the process.","When it comes to self-custody, a crypto-savvy financial advisor can serve as a great source of knowledge."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Great Financial Crisis","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"$250","content":"MONEY"}],"hashtag":["Crypto for Advisors","Newsletters","Opinion","Financial Advisers","Cold Storage","Wallets","Bitcoin"],"authors":["Isaiah Douglass"]}