{"summary":"Unprecedented transactions out of a multisig wallet spooked Pepecoin watchers last week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/08\/28\/pepecoin-says-bad-actors-on-team-stole-15m-pepe\/","publishDate":"2023-08-28T06:37:36","id":16878,"type":null,"title":"Pepecoin Says 'Bad Actors' on Team Stole $15M PEPE","category":["Technology"],"content":["Some rogue developers on the Pepecoin team were behind last week’s unprecedented transfers out of the token’s multisig wallet and effectively stole millions worth of pepe coin (PEPE), a team member claimed on X, formerly Twitter.","“Since its inception, $PEPE has unfortunately been plagued by inner strife with a portion of the team being bad actors led by big egos and greed,” a developer who claimed to now be in control of the project said in a tweet. “There has often been conflict, and the majority of the team involved in $PEPE creation started to distance themselves after the first week of project inception.”","Last week, over 16 trillion Pepe tokens ($15 million) were illicitly transferred to crypto exchanges OKX, Binance, Kucoin and Bybit before being sold – contributing to a nearly 20% slide in the frog-themed tokens, the team member said.","On-chain sleuths previously noted troubling changes to the oversight of how a developer-related wallet handled transaction approvals. Instead of requiring five of eight wallets to sign off on transactions, it had changed to only two out of eight, as reported.","The transactions represented the first time the project's multisig wallet – which held 26 trillion tokens out of a 420 trillion total supply – had ever sent out the meme coin.","But whoever is in control of the project now has been apologetic on X posts, stating they plan to grow, and eventually fully decentralize, the project in the months ahead.","“I have been in negotiation with the owners of some web domains and usernames that I am looking into acquiring for PEPE, and when I am complete with any of these prospective purchases or donations of PEPE from the multi-sig, I will burn the remainder of these multi-sig tokens,” they said. Burns refers to the permanent deletion of tokens from the open market.","Pepe was one of 2023’s biggest success stories amid a generally bearish market, zooming to a peak market capitalization of $1.8 billion in mid-May and seeing trading volumes surpass those of dogecoin (DOGE) and shiba inu (SHIB) – which are otherwise the biggest meme coins by trading volume.","However, analysts have repeatedly rang the alarm bells around the early activity of pepecoin traders as well as the absence of retail traders. The major risk has been too many tokens in too few hands, leaving the price action dependent on a few investors.","\"The limited amount of net liquidity is creating a high-stakes game of music chairs,” shared Rafe Tariq, senior quant at SingularityDAO in a research note in June. “Everyday investors are being lured in with the hopes of big profits but the reality is that a small percentage of investors will walk away with profit, while everyone else will get burnt.\"","At the time, SingularityDAO also found that a small number of large-scale investors, known as \"whales\", hold up to approximately 25% of PEPE, while other large investors hold up 46% of the currently circulating supply.","Edited by Parikshit Mishra."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Rafe Tariq","content":"PERSON"},{"type":"PEPE","content":"ORGANIZATION"},{"type":"Burns","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Pepecoin","content":"PERSON"},{"type":"$PEPE","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Kucoin","content":"PERSON"},{"type":"$1.8 billion","content":"MONEY"},{"type":"mid-May","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"46%","content":"PERCENT"},{"type":"$15 million","content":"MONEY"}],"hashtag":["Pepe","DeFi","token","On-chain Data"],"authors":["Shaurya Malwa"]}