{"summary":"Lawmakers appear to have largely ignored pleas from organizations linked to Polygon, NEAR and Cardano about the clause, according to a final version of the text seen by CoinDesk","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/07\/17\/eus-data-act-final-draft-still-contains-controversial-smart-contract-kill-switch\/","publishDate":"2023-07-17T10:53:24","id":16875,"type":null,"title":"EU's Data Act Final Draft Still Contains Controversial Smart Contract Kill Switch","category":["Policy"],"content":["A final version of new European Union Data Act rules largely ignores pleas from the blockchain industry, which worries they could make most smart contracts unlawful, according to a text seen by CoinDesk.","Provisions intended to ensure automated data-sharing agreements contain a kill switch under which they can be safely terminated still refer broadly to “smart contracts,” and aren’t limited to privately owned and permissioned data records as lobbyists hoped, a July 7 version of the law indicates.","Negotiators said they had struck a deal on the controversial text on June 28, shortly after organizations linked to numerous blockchains, including Stellar, Polygon, NEAR and Cardano, expressed their concerns in an open letter, but no text has been released until now.","The text of the law sent to CoinDesk under EU freedom of information laws still refers to “smart contracts” rather than the industry’s preferred formulation of “digital contracts.”","The text also puts duties on “vendors” of the automated programs – despite lobbyists’ fears that the wording could impose a “perpetual and limitless responsibility” in decentralized cases where there’s no single seller.","The text has changed from the European Commission's original February 2022 proposals to clarify that the rules apply only when programs are used for “automated execution” of data-sharing agreements that might be made for smart devices like connected cars and fridges. Yet the scope does not refer to private or permissioned networks, so still appears to be wider than lobbyists had requested.","The text, circulated privately to the bloc’s member governments by Spain, which is currently chairing talks, shows the law “updated according to the provisional political agreement reached” at a June 27 meeting, which it says “came to an agreement on all political issues and successfully closed the negotiations” in talks with lawmakers at the European Parliament.","In a statement issued Monday after publication of this story, signatories to the industry open letter said they \"regret\" that the regulation still covers smart contracts, rather than digital contracts, as the \"distinction between the two terms is significant.\"","\"We remain cautious about potential unintended implications in future regulatory proposals,\" the statement said, adding that \"forcing an intermediary in a disintermediated environment does not necessarily enhance technology security but introduces new risks.\"","To pass into law, the text must be formally agreed by the parliament and then by governments, who meet in a body known as the Council of the EU.","Signatories to the June open letter said the plans could prove unworkable and betray the purpose of permissionless networks where nobody is in charge. The commission has denied it would make existing contracts illegal.","Read more: EU Commission Brushes Off 'Data Act' Fears by Crypto Industry","UPDATE (July 17, 18:09 UTC): Adds response from signatories.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"July 7","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Crypto Industry","content":"ORGANIZATION"},{"type":"European Union Data Act","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Spain","content":"LOCATION"},{"type":"June 28","content":"DATE"},{"type":"June 27","content":"DATE"},{"type":"July 17","content":"DATE"}],"hashtag":["Regulations","EU","smart contracts","Data","EU Parliament"],"authors":["Jack Schickler"]}