{"summary":"CoinDesk takes a look at new developments in the Mt Gox case, attempting to provide an easy-to-read overview of the complex events.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2017\/07\/26\/the-big-news-behind-the-btc-e-arrest-and-mt-gox-connection\/","publishDate":"2017-07-26T21:17:19","id":16877,"type":null,"title":"The Big News Behind the BTC-e Arrest and Mt Gox Connection","category":["Markets"],"content":["BTC-e, Mt Gox, Bitcoinica.","Those who are new to bitcoin and blockchain technology may have been surprised today by an influx of strange companies and persons that have long been out of the mainstream news. Yet, for long-time industry technologists and observers, the developments are actually a major breakthrough with serious implications.","Not only does it shed light on notorious cases of massive bitcoin thefts, but it also connects one of bitcoin's longest-running legal efforts (in which creditors lost hundreds of millions in bitcoin) to its murkiest exchange long suspected of enabling criminal activity.","In short, the assertions being made by law enforcement and independent analysts (if true) could pull back the curtain on the earliest days of bitcoin's history.","For those who weren't following the blow-by-blow, we've assembled the timeline, implications and unknowns below.","To begin, here are the major players:","This cast of characters came to a head again this morning when news broke that an individual, said to be a native Russian, was arrested in Greece on money laundering charges connected to the use of bitcoin.","Since then, it's been a fast-developing story.","The prelude","","BTC-e announces on July 25 it is undertaking “unplanned maintenance in [its] data center.\"","Two hours after that initial tweet, the exchange tweets that its engineers \"are still looking into the issue.\" While no statement was given on an exact time at which it would come back online, the exchange said \"we hope to get back online soon,\" with more updates promised.","A similar tweet is issued roughly five hours later, effectively reiterating that prior message.","Arrest news breaks","","International news organizations, including the Associated Press, reported earlier today that a Russian man was arrested in Greece. The first details to emerge implicate the then-as-yet-named individual in a \"$4 billion\" laundering scheme involving bitcoins.","News services went on to say that the individual in question is named Alexander Vinnik. It's further added, per Reuters, that the laundering took place through a \"bitcoin\" platform.","As these details emerged, users – taking to social media to voice concern over the potential closure of BTC-e – began connecting Vinnik to one of the exchange’s leaders, named \"Alexander,\" who spoke with CoinDesk in a 2014 interview.","The next detail to drop, with Reuters citing sources close to BTC-e, was that Vinnik is \"connected\" to the exchange, though it later amended its article to state that he is \"suspected of being the anonymous mastermind behind one of the world's oldest crypto-currency exchanges.\"","This information was reportedly derived from a US arrest warrant that was then executed by Grecian authorities.","A source with knowledge of the investigation later told CoinDesk that the arrest warrant remains under seal at this time.","WizSec releases initial findings","At roughly 18:00 UTC, WizSec released a report which stressed that, at this time, there's nothing to definitively connect Vinnik or a related alias to the theft of funds from Mt Gox, but rather, the connection is with the subsequent laundering of that money.","In interview, the firm said its newly published work was not timed to coincide with today's news events – rather, it was inspired by it.","WizSec told CoinDesk that the news today rather added a missing piece to its investigation – namely, the connection between the Mt Gox heist and BTC-e. Instead, its focus was on tracing stolen Mt Gox coins across the blockchain to a network of wallets they had long known were involved in money laundering.","Notably, this network of wallets was also found to have contained coins connected to a hack on Mt Gox in 2011, as well as a hack on an exchange called Bitcoinica in 2012. Those accounts, according to the researchers, could be tied to an online account \"WME,\" which the firm identified as being owned by person named Alexander Vinnik prior to today’s developments.","The finding allowed WizSec to add new context to another clue – the fact that some of the coins connected to the theft seemed to go through a unique avenue within BTC-e's public wallet architecture.","According to the firm, some coins went directly to what they believe was a \"second-tier wallet,\" an irregularity that wasn't previously explored.","The finding, coupled with Vinnik's alleged connection to the exchange, prompted the firm to pen the blog post.","Despite quickly snowballing, some details about the story remain unclear.","What was Vinnik's role at BTC-e?","","Perhaps the biggest detail yet to be confirmed is the exact nature of Vinnik's connection to BTC-e. Though Reuters, citing sources, says that he is believed to be the \"mastermind\" of the cryptocurrency exchange, the relevant arrest warrant has yet to be made available.","Authorities have also not commented publicly on the arrest nor clarified Vinnik's relationship with BTC-e. Nor is it entirely clear when Vinnik may face a court hearing on the charges for which he has been arrested.","US authorities are said to be pursuing an extradition of Vinnik. Yet The Associated Press reported that \"under Greek law, he can be held for up to two months until the request is examined,\" meaning that it may be some time before Vinnik is brought to the US.","How involved was BTC-e in the laundering?","It's unclear whether BTC-e found face larger repercussions or if more arrests could be made.","While BTC-e has a long history of silence and secrecy, it's never been proven that the operation itself is a criminal enterprise, though this news would go a long way toward establishing suspicions.","Will Vinnik name names?","It's also unclear whether the arrest of Vinnik will lead to details about who could have been behind the Mt Gox and Bitcoinica thefts.","Should Vinnik be willing to provide details about the individual, it's possible that a suspect could be identified who could face criminal charges, shedding light on a long obtuse part of the story.","It’s a development that also comes as the trial of Mt Gox CEO Mark Karpeles is underway. Karpeles appeared in court earlier this month, pleading not guilty to embezzlement and data manipulation charges.","Is BTC-e finished?","There's a big emphasis on conditionals here, given that we don’t currently know whether authorities are moving to shut down the exchange or seize connected assets. However, recent dark market crackdowns suggest that law enforcement officials are taking an aggressive stance that could extend to BTC-e.","What we do know is that, earlier today, BTC-e’s official Twitter account issued a statement saying that it would come back online in the next five to 10 days.","\"Update2: at the moment we are working on the restoration of service. Approximate terms from 5 to 10 days. Thanks for your understanding #btce,\" the exchange’s account tweeted.","Given that BTC-e representatives have not responded to a request for comment by press time, only time will tell if that pledge comes true.","Wolfie Wei-Zhao and Stan Higgins contributed reporting.","Newsprint image via Shutterstock"],"entity":[{"type":"2014","content":"DATE"},{"type":"this morning","content":"TIME"},{"type":"July 25","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"2011","content":"DATE"},{"type":"Bitcoinica","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Alexander","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"The Associated Press","content":"ORGANIZATION"},{"type":"Vinnik","content":"PERSON"},{"type":"Stan Higgins","content":"PERSON"},{"type":"WizSec","content":"ORGANIZATION"},{"type":"Associated Press","content":"ORGANIZATION"},{"type":"Greece","content":"LOCATION"},{"type":"Wolfie Wei","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Mark Karpeles","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Alexander Vinnik","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"e. Though Reuters","content":"ORGANIZATION"}],"hashtag":["Crime","Law","Mt Gox","BTC-e","Bitcoin","Hack","Wizsec","Features","Technology News"],"authors":["Pete Rizzo"]}