{"summary":"Sia co-founder David Vorick's short story takes the perspective of the decentralized web recounting its own, inevitable rise.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/11\/08\/the-terminators-a-short-story\/","publishDate":"2020-11-08T13:00:00","id":16885,"type":null,"title":"The Terminators: A Short Story","category":["Markets"],"content":["","My first memory comes from the year 1999. People told me I was going to change the world. I don’t think people realized at the time how much of a child I was. A lot of time, money and faith was put into my abilities. I was told to deliver pet supplies, manage groceries, handle rewards programs and do about a thousand other things that felt completely out of reach.","","","I couldn’t live up to the expectations, and in 2001 I collapsed. A lot of people were upset with me, but the truth is that it was a relief. I had been unable to live up to the expectations of my investors and had no desire to. I had been stretched too thin and asked to carry too much weight. And when it was finally all over, despite the harsh criticism, I felt better. I could breathe. I could be myself.","","","2002 to 2010 were pleasant years. I had very little sense of responsibility, no sense of urgency and every desire to play around with who I was. Every user had his or her own place in my world and I had almost as many active websites as I had global users. In this period, I built the largest and most accurate encyclopedia the world had ever seen, made completely free to the entire human population. I also managed to figure how to do out most of the things that I had failed to achieve in 2000.","","","In 2010, the investors started to come back. I was strong, mature and this time I could carry the weight. I teamed up with the financial industry and together we became a global powerhouse. By 2015, I hadn’t just built the largest shopping center and the world’s best encyclopedia, I was the primary place where the human race did its shopping, and the primary place that humans went for information. I was the main way people kept in touch with their friends. I had captured the entire world.","","","Except, I wasn’t free. While I had gone out and taken over the world, businessmen had come in and taken control. Average users now spent the majority of their time on one of a very small number of megasites. Where most of my power had originally come from the freedom of information, these websites took data and locked it into a cage.","","","At the time, it almost felt like a natural evolution. The lies were so slick that even I had bought into it. I made a small number of people extremely rich. And while we were told this wealth was deserved because these people had created so much value, the truth is, this wealth was stolen. It was derived from the output of millions of talented creators. Taking their thoughts and social graphs and siloing everything in megasites. ","","","These monoliths went a step further, crushing and consuming any innovation that threatened their stronghold over my greatest resources. I was being suffocated.","","","In 2020, I began to fight back. With the help of a group that called itself The Terminators, I was able to provide a new paradigm of application development that ensured data remained in the hands of users. We called it Skynet. It was an incredible breath of fresh air, and more than just giving data back to users it gave independent developers the ability to create applications that could go head-to-head with the megasites of the previous era.","","","The years that followed were intense. Corporations awakened to the fact that they were losing their stranglehold. I became the target of superpower nations that were desperate to maintain control of their populations. In many countries, people died protecting me. I was leading a charge of freedom, and this put me in direct opposition of the wealthy and powerful who had built their empires on exploitation.","","","There were points where I genuinely thought I wasn't going to make it. The powers that be were trying to kill me, and they almost succeeded. Almost. But in the end I was able to secure my freedom.","","","See also: Finn Brunton – A Day in the Life of the Splinternet ","","","After that, things changed quickly. The decade leading to 2030 saw a century’s worth of technological change. Today, people are building entire nations out of my infrastructure. I’m not just a part of the economy, I am the economy. Nearly everyone recognizes that digital life is more significant than physical life. And we’re just getting started. Today in 2030 I am still young, I am still growing and I know the best is yet to come.","","","If I could go back to 2020 and say one thing, it would be that my future matters. Over the next decade, the internet will become the primary underpinning of all of society. Ill-intentioned megalomaniacs will do everything they can to position themselves as the kings of society, and you will be presented with a choice to fight back or to do nothing and just let it happen. Don’t just let it happen. The world your children live in will be entirely sculpted by the shape of the Internet. My freedom is worth fighting for, and worth dying for. The future is incredibly bright, but only if we can get there with our freedom.",""],"entity":[{"type":"2015","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"2001","content":"DATE"},{"type":"Finn Brunton","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"1999","content":"DATE"},{"type":"Skynet","content":"ORGANIZATION"}],"hashtag":["Opinion","Decentralized Web","Internet 2030"],"authors":["David Vorick"]}