{"summary":"Bitcoin's once-every-four-years \"halving\" this week may be very different from those of earlier epochs, typically ho-hum affairs. Now, an intense competition is underway to mine the first block after the halving, which could contain a rare and collectible fragment of a bitcoin known as an \"epic sat.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/15\/bitcoin-halving-has-crypto-miners-racing-for-epic-sat-potentially-worth-millions\/","publishDate":"2024-04-15T07:00:00","id":16883,"type":null,"title":"Bitcoin Halving Has Crypto Miners Racing for 'Epic Sat' Potentially Worth Millions","category":["Technology"],"content":["With Bitcoin's fourth quadrennial \"halving\" now as little as a week away, cryptocurrency mining companies are jockeying to capture what could be the most valuable data block of all time, worth millions of dollars potentially.","Almost two years ago, Casey Rodarmor, creator of the Ordinals protocol atop the Bitcoin blockchain, developed a system for categorizing the rarity of individual satoshis, or \"sats\" – the smallest denomination of the digital asset, similar to cents on the dollar or pence on the pound.","This feature is part of CoinDesk's \"Future of Bitcoin,\" package published to coincide with the Halving in April 2024.","The reason for the system was because, following the launch of Ordinals in early 2023, these satoshis could be numbered and traded as if they were unique tokens. But each one could also be thought of as collectibles, or a non-fungible token (NFT). And as any collector knows, the price of a collector's item is often linked to its rarity.","Rodarmor's scale went from \"uncommon,\" the first sat of each block, all the way up to \"mythic,\" which is the first sat of the first-ever block on Bitcoin — presumably lodged safely in Bitcoin creator Satoshi Nakamoto's possession. So don't even think about obtaining that.","Somewhere in between, but on the higher end of the scale, ranks the first sat after a Bitcoin rewards halving — the start of a new \"epoch,\" in the blockchain jargon. It is classed as \"epic.\" Tristan, the founder of Ordiscan, thinks this sat could be \"conservatively\" valued at $50 million by prospective Ordinals enthusiasts.","See also: The Bitcoin Halving Really Is Different This Time","So what's happening now is the first-ever race for an epic sat since Ordinals was introduced, prior Bitcoin halvings were much more ho-hum, because there was little more than bragging rights at stake for crypto miners. And bets are on that this first-ever epic sat could be valued very highly on Ordinals marketplaces.","\"So if we take that satoshi that is produced in an event that happens every two weeks, to a sat that's produced just once every four years, I don't know what that's going to be worth, but it could be millions,\" Adam Swick, chief growth officer of mining firm Marathon Digital Holdings (MARA), said in an interview.","Mining companies making a concerted effort to win this race could ramp up their operations to ensure they account for a high a percentage of the global hashrate — the total computing power working to confirm Bitcoin transactions — right at the point it becomes clear the halving is imminent.","Just as the miners responded to BTC's surge to new all-time highs last month in order to cash in on the higher prices, they might run flat-out to maximize their chances of catching the first block after the halving.","This might involve bringing new, more powerful equipment online and even reinstalling older and soon-to-be-obsolete kit.","The halving, the fourth in Bitcoin's 15-year history, is programmed to occur when the network reaches block height 840,000, sometime next week; it's looking like April 19 or 20.","The miner who adds that block to the blockchain rewarded with 3.125 BTC, about $219,000. It's not chump change, but it's a step change down from the 6.25 BTC, or $440,000 prior to the halving","But such calculations also show what's at stake if a single satoshi, which is one-hundred-millionth of 1 BTC, might be worth more than $1 million.","This miner would then need to send 546 satoshis – the minimum amount able to be sent over the blockchain in a transaction, also known as the \"dust limit\" – to a cold storage wallet. The first of the sats contained in this unspent transaction output (UXTO) would be retroactively labeled as the first sat post-halving, since the Ordinals protocol defines sats on a first-in-first-out basis.","\"They'd essentially break the 3.125 BTC into two: one of which is incredibly small and has the first sat in it, the rest is just bitcoin and doesn't have anything special about it,\" Tyler Whittle, of Ordinals project Taproot Wizards, said in an interview.","Tristan, founder of Ordinals project tracker Ordiscan.com, wrote in a blog post that under the “Rodarmor Rarity” system, the first sat in the block alone could be worth at least $1 million.","Miners have now had a year or so of experience, since Ordinals was launched, to cash in on the full value of their bitcoin rewards, including any especially valuable sats that are buried within.","\"We have thousands of these uncommon sats – the first satoshi of every block for example – and we've often looked at the market to see if we should sell them or hold them,\" Marathon Digital's Swick said..","Marathon has also mined the first sat after a difficulty adjustment, which at one point \"was worth hundreds of thousands of dollars,\" according to Swick.","Another publicly-listed mining firm, Hut 8 (HUT), has been scouring its balance sheet for rare sats that it may already own and monitoring what interest there may be in the market, its CEO told CoinDesk.","Asher Genoot compares the concept to demand for \"virgin\" bitcoin – BTC that has never been transacted.","\"When we first started mining, people were saying that they would pay a premium for virgin bitcoin, but it's not a very liquid market, so there's not a very clear price,\" he said.","The major miners, those that command a relatively significant percentage of global hashrate, may feel they have the resources to actively chase that first epic sat to be mined in the Ordinals era.","Marathon, for example, has around a 5% share, therefore could be said to have a 5% of winning it.","\"We recognize that it's kind of a lottery ticket,\" Swick said. \"But we're being careful to make sure all our machines are online, which is our goal anyway. But it's something we're acutely aware of coming up to the halving.\"","Some comparatively smaller firms might recognize that the structure of their operations make the trophy far too unrealistic. Marathon, for example, operates its own mining pool, but many other firms do not.","Thomas Chippas, CEO of Argo Blockchain (ARGO), believes that miners can only realistically chase it if they are in Marathon's position. Most miners are members of a pool and some pools will often drop the top two or three blocks and the bottom two or three blocks over a period of time when they commence their calculation of the payout to miners, Chippas explained in an interview with CoinDesk.","\"They do that as a way to avoid both positive and negative outliers,\" Chippas said. \"So in a pool like that, if there's some crazy block because someone paid up for a particular sat, you might not benefit from it because that pool might drop that block.\"","\"So, we are interested in that revenue that a rare sat could bring, but we're also very practical,\" he said.","Swick imagined a use case for a futures market to develop around the mining of rare and epic sats, whereby miners with substantial hashrate share are paid up front for rare sats they could theoretically obtain.","Read More: Ordinals Defy Bitcoin's Design Principles but Offer Miners Huge Post-Halving Advantages","Marathon's 5% global hashrate, for example, could lead an Ordinals trader to pay the company 5% of what they think the epic sat will be worth. So, if the first post-halving sat could fetch $100 million, the trader pays Marathon $5 million with the promise that the firm hands over the epic sat if their pool does win it.","\"It could be super interesting if someone runs round to all the publicly-listed mining firms pre-paying them for the epic sat, and then they have almost a 25% chance of winning it as these companies make up about 22.8% of total hash rate\" Swick said.","\"This has never been done before and I'm frankly fascinated that a futures market like this has not emerged yet,\" he added.","UPDATE (16:45 UTC): Changes Swick's quote on mining firms' total hash rate percentage from 40% to ~22.8%.","Edited by Bradley Keoun."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"$219,000","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tyler Whittle","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Adam Swick","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Chippas","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"22.8%","content":"PERCENT"},{"type":"$5 million","content":"MONEY"},{"type":"Time","content":"ORGANIZATION"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Offer Miners Huge Post-Halving Advantages","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Marathon","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"April 19","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Thomas Chippas","content":"PERSON"},{"type":"Marathon Digital Holdings (MARA","content":"ORGANIZATION"},{"type":"$440,000","content":"MONEY"},{"type":"Taproot Wizards","content":"ORGANIZATION"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Swick","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Features","Bitcoin Halving","Ordinals","Bitcoin Mining","Miners","Futures"],"authors":["Jamie Crawley"]}