{"summary":"Here's how influencer marketing drives the crypto industry – especially for product sales like hardware wallets and debit cards.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/06\/01\/crypto-influencers-are-following-the-beauty-playbook-even-if-they-dont-know-it\/","publishDate":"2020-06-01T10:00:00","id":16886,"type":null,"title":"Crypto Influencers Are Following the Beauty Playbook – Even if They Don't Know It","category":["Finance"],"content":["","Beauty mogul Michelle Phan isn’t the only woman to notice similarities between makeup startups and crypto communities. ","","","Both are dominated by influencer marketing with products sold through direct-to-consumer (DTC) models and aggregated retail platforms like Amazon, Etsy or Shopify. ","","","In emerging markets without direct access to Amazon, Lebanese bitcoiner Michel Haber said grassroots traders often fill the role of educating clients and helping them procure their first wallets. Social media accounts and chat groups become ad hoc retail networks. ","","","Read more: Michelle Phan: The Beauty of Bitcoin","","","When it comes to grassroots distribution strategies, few mainstream industries offer a better precedent for the nascent cryptocurrency space than small beauty businesses, according to decentralized finance (DeFi) user and skincare aficionado María Paula Fernandez.","","","In both startup sectors, users are encouraged to do their own research rather than trust traditional tastemakers like magazines. ","","","“I think DeFi and indie\/new beauty [entrepreneurs] are very similar in this regard … bringing power to the people, generating opportunities,” she said. “There is no harm in learning about what’s in your beauty products. ... It benefited consumers as well, as some of them can become influencers and broadcast their knowledge for compensation.”","","","Likewise, Fernandez said, she now looks for beauty products and crypto tools in similar ways. She builds up her own expertise, learning together with loved ones who work in the skincare industry, while also following influencers with professional experience in the field. So far, in the crypto industry, hardware wallet sellers predominantly rely on digital word-of-mouth. Much like the beauty marketing strategies on YouTube, Instagram and TikTok, this includes sending products to crypto influencers to review and make instructional guides.","","","This typically matures into a referral marketing strategy that leverages these same fan groups. ","","","For example, Iva Fiserova, head of communications at the Trezor wallet-maker SatoshiLabs, said the startup collaborates with social media influencers on “affiliate marketing activities” rather than paying influencers to advertise. ","","","A few exchanges, like Binance and Gemini, have already proved successful with the referral model, which has worked for decades for multilevel marketing companies like Avon and Mary Kay cosmetics. As such, the Instagram micro-influencer Chjango Unchained, who works at Cosmos developer Tendermint during the day, said she’s been earning pocket money through the Gemini referral link in her Instagram bio for a few months. ","","","If her fans use that link to sign up and buy more than $100 in crypto, she receives $10 in bitcoin. ","","","“I just see people on Instagram doing it,” she said of promoting brands through her Instagram, where she started featuring professional portraits with brand tags in 2019. “I wanted people who ask me about crypto to use Gemini instead of Coinbase because Coinbase’s fees are insane.”","","","It remains to be seen how these marketing strategies will scale during the coronavirus recession. ","","","“We sometimes get in touch with [users] to help them engage their followers by doing giveaways and joining campaigns,” Fiserova said of SatoshiLabs’ influencer strategy.","","","Unlike beauty brands, which look for experienced influencers with established followings, crypto brands are more likely to help users become influencers. ","","","Fiserova said her company has sold hundreds of thousands of Trezor wallets this way, working with “the community” to create a brand that users love so much the hardware seller “does not need to pay for advertising.”","","","“We have seen a growing demand for our products in the past three months,” Fiserova said. “There were some shipment issues in some markets, which we managed to resolve, so our customers would get their devices on time.”  ","","","Rodolfo Novak, co-founder of the hardware seller Coinkite, said he’s also seen an uptick in demand since the coronavirus crisis began. ","","","“Our sales are increasing week by week,” Novak said, declining to specify how many devices other than to say it is now comparable to the French wallet startup Ledger, which sold more than 1.8 million wallets to date, according to a Ledger spokesperson. Novak added his company sent more than 50 hardware products to YouTube reviewers over the past three years. In terms of community, the company’s Telegram group has roughly 773 members. This is their primary marketing strategy. ","","","“We find our users help other users,” Novak said. “If we added the cost of education [marketing] that would make our product more expensive.”","","","Even this small niche has proved profitable for Coinkite, which operates its own factory and DTC distribution. In the beauty industry, DTC startups are often acquired by larger brands or start more traditional ad campaigns as they grow. When it comes to crypto, so far it appears larger companies rely on sponsoring niche content creators. Because, after all, free products don’t pay the bills. ","","","The most successful crypto influencers generally seek to spin their star power into media startups. ","","","This may someday be the case for bitcoin podcaster Marty Bent, whose show is sponsored by Unchained Capital and Square’s Cash App. For now, Bent described his podcast and newsletter as an educational “passion project,” in addition to working at the bitcoin company Great American Mining. Bent said he rejects several prospective advertisers a month because he’s not in a rush to build a sustainable podcast business. ","","","“I wouldn’t be against advertising for a company that isn’t a bitcoin company, as long as I like and believe in the product,” Bent said. “I think content creators, especially if they’re successful in developing an engaged audience, should realize they can be selective and wait for advertisers they and their audiences align with.”   ","","","A spokesperson for Cash App declined to comment on the company’s sponsorship strategy, including deals with podcaster Joe Rogan and the Twitter-savvy rapper Lil B. Large companies, like Cash App and the Kraken crypto exchange, focus on sponsoring content creators that monetize their personal brands.","","","Read more: I Attended a Bitcoin Conference in VR and Still Got Sick","","","Kraken sponsors two such startups that emerged over the past year, including Reckless VR in April 2020, founded by virtual reality meetup organizer Udi Wertheimer, and podcaster Peter McCormack, who launched his media brand Defiance in 2019. McCormack is one of the few influencers who turned his hobby into a day job, reportedly earning $1 million in revenue last year. ","","","Still, micro-influencers make money through referrals rather than sponsorships. Bent is an unusual case, snagging a mainstream sponsor so early on. ","","","For a more typical example, Michael Gu, who created a Telegram group with more than 3,602 members and a YouTube channel with 203,000 subscribers, said he offers Ledger wallet affiliate links although the hardware company doesn’t sponsor his videos. Since Gu started creating crypto content in 2012 under the Boxmining moniker, he primarily monetizes his social media channels through affiliate links, viewer donations and, until recently, monthly YouTube memberships.   ","","","“I don’t view Boxmining as a business that demands monthly profits etc.,” Gu said of his crypto content brand. “We had an increase in donations after coronavirus, especially after the community found out that YouTube demonetized all videos covering the subject.”","","","The first lesson crypto brands are learning from their beauty industry predecessors is that influencers must be hyper-specific to drive sales, yet evolve as the audience grows in order to remain relevant. ","","","Companies like the payments startup and debit card provider Crypto.com may leverage their influencer strategies to spin out regional communities, such as Turkish or Russian Telegram groups. ","","","Read more: YouTube Temporarily Bans Two Popular Crypto Channels Claiming Policy Breach","","","Crypto.com CEO Kris Marszalek said his company already started this process during the demand surge of early 2020, and is now looking for local partners “from universities, to influencers, to payment partners.” Meanwhile, he said the startup’s user base doubled to 2 million people over the past six months. ","","","When it comes to what the company looks for in an influencer, Marszalek said people willing to broadcast themselves “using our product and testing it, introducing it to their audiences.”","","","“We get more return on investment on that [giveaways and referral bonuses] than Facebook ads,” Marszalek said. “The drop-offs are huge once you ask for know-your-customer information, so it’s an expensive thing to advertise if you don’t have an attractive product with a strong word-of-mouth [reputation].”","","","It’s clear how crypto companies benefit from focusing their marketing budgets on influencers and community management instead of ads and traditional media coverage. It remains to be seen how this plays into the broader influencer economy. ","","","In the beauty industry, the most successful influencers eventually launch their own product lines. This is much closer to the type of personality cult and product pairing seen with token issuers like Justin Sun of Tron or Binance founder Changpeng Zhao, creator of BNB tokens, than influencer media startups like theSkimm. Much like Sun, other types of influencers also occasionally do cash giveaways for fans on social media. This isn’t unique to crypto. ","","","Will we someday live in a world where fans speculate on a celebrity’s earning potential, like NBA player Spencer Dinwiddie is doing with security tokens? ","","","It’s still exceedingly rare for influencer clout to build a broader media or education business, in any sector, rather than advertise consumable products. The YouTube Queen herself, Michelle Phan, is looking to launch a podcast in 2020 and become an exception to this rule. ","","","In a space where most people get information about financial products through sponsored content, it’s up to consumers to determine whether the influencer is offering unbiased education or propaganda. ","","","Sometimes, marketing can be both. Tron founder Justin Sun sponsored a college campus tour by podcaster Ben Armstrong, aka BitBoy Crypto, in 2019, along with partners at the Blockchain Education Alliance. As for Bent, he’s not aiming to make “a ton of money,” any time soon, nor expand like McCormack.","","","Since Bent has traditional syndicate experience, from the podcast network Barstool Sports, he isn’t betting on that rare transition from sponsored educator to sustainable outlet. ","","","“My goal is to get quality information about bitcoin into as many minds as possible,” Bent said, referring to his podcast and newsletter as advocacy. “The fact that they are profitable is an added bonus. … Some people may call me an influencer, but that’s not my goal.” ",""],"entity":[{"type":"Blockchain Education Alliance","content":"ORGANIZATION"},{"type":"April 2020","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"Ben Armstrong","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"Iva Fiserova","content":"PERSON"},{"type":"$10","content":"MONEY"},{"type":"Michel Haber","content":"PERSON"},{"type":"” Gu","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Great American Mining","content":"ORGANIZATION"},{"type":"Joe Rogan","content":"PERSON"},{"type":"Spencer Dinwiddie","content":"PERSON"},{"type":"YouTube Temporarily Bans Two Popular Crypto Channels Claiming Policy Breach","content":"ORGANIZATION"},{"type":"McCormack","content":"PERSON"},{"type":"Etsy","content":"ORGANIZATION"},{"type":"Rodolfo Novak","content":"PERSON"},{"type":"Unchained Capital and Square’s Cash App","content":"ORGANIZATION"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"Michelle Phan","content":"PERSON"},{"type":"$100","content":"MONEY"},{"type":"Bitcoin Conference","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Marty Bent","content":"PERSON"},{"type":"María Paula Fernandez","content":"PERSON"},{"type":"Coinkite","content":"ORGANIZATION"},{"type":"Justin Sun","content":"PERSON"},{"type":"Marszalek","content":"PERSON"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"Novak","content":"PERSON"},{"type":"BitBoy Crypto","content":"ORGANIZATION"},{"type":"Peter McCormack","content":"PERSON"},{"type":"Fernandez","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Michael Gu","content":"PERSON"},{"type":"DTC","content":"ORGANIZATION"},{"type":"Fiserova","content":"PERSON"},{"type":"Udi Wertheimer","content":"PERSON"},{"type":"Mary Kay","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Trezor","Marketing","YouTube","Bitcoin","bitcoin wallet","Crypto","Spencer Dinwiddie","michelle-phan","influencer","instagram"],"authors":["Leigh Cuen"]}