{"summary":"Copper’s Series C round will value the company around $2 billion, according to two sources. The firm sought a $3 billion valuation in November.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/13\/crypto-custodian-copper-soon-to-close-delayed-funding-round-sources\/","publishDate":"2022-07-13T17:23:14","id":16881,"type":null,"title":"Crypto Custodian Copper Soon to Close Delayed Funding Round: Sources","category":["Finance"],"content":["Cryptocurrency custody firm Copper is about to close a funding round that was delayed last year, two people with direct knowledge of the situation said.","The Series C round, which was held up as Copper grappled with a temporary regulatory registration in the U.K., will value the company around $2 billion, according to the people, who didn’t want to be identified.","Copper was reported to be raising $500 million at a $3 billion valuation in November 2021, in what was something of a banner year for cryptocurrency custody firms raising money and commanding sky-high valuations. Since then a continued bear market has slashed the valuation of many crypto-linked companies as investors shy away from risk.","Copper’s latest round is expected to close in the next few weeks, one of the people said. It’s not known if the amount raised will be made public, the person added.","A spokesperson for Copper said the firm could not comment as the round was ongoing.","Copper, which boasts former U.K. Chancellor Philip Hammond as an adviser, has chosen to become regulated in Switzerland, following a license registration deadlock with U.K. regulator the Financial Conduct Authority.","State Street (STT) announced a licensing agreement with Copper in March of this year to develop and launch an institutional-grade digital asset custody product.","Copper raised $50 million in a Series B round in March 2021. It did not disclose a valuation."],"entity":[{"type":"$500 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Switzerland","content":"LOCATION"},{"type":"Philip Hammond","content":"PERSON"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Copper","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"November 2021","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"March 2021","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Copper","Custody","Crypto Custody","Funding","Series C"],"authors":["Ian Allison","Will Canny"]}