{"summary":"Ignite says it’s now a “product-first” company focused on its Cosmos portfolio manager and blockchain development platform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/02\/23\/cosmos-builder-tendermint-rebrands-to-ignite-as-team-shifts-focus\/","publishDate":"2022-02-23T13:00:00","id":16880,"type":null,"title":"Cosmos Builder Tendermint Rebrands to ‘Ignite’ as Team Shifts Focus","category":["Finance"],"content":["Tendermint, the company that launched the blockchain-interoperability protocol Cosmos, announced Wednesday it is rebranding to “Ignite.”","Ignite CEO Peng Zhong told CoinDesk that the rebranding doesn't involve major changes to the firm’s road map or leadership. Instead, the brand refresh is meant to symbolize a pivot to “a product-first focus,” with the name “Ignite” bringing to mind “the initiation of change and action.” Tendermint’s prior focus was on developing back-end Cosmos infrastructure.","The refresh comes as ATOM, the native token of the Cosmos blockchain, tops $7 billion in market capitalization. LUNA, the native token of the Cosmos-based Terra blockchain, has climbed to a market cap of $44 billion, suggesting that much of Tendermint’s early goals may have already been accomplished.","Zhong, who has a background in front-end development, frames Ignite’s pivot as a way to play to his team’s design and product chops. The team’s new growth strategy involves optimizing the user experience of Ignite’s portfolio manager, Emeris, to better on-board newer users into Cosmos and build its developer platform, Starport, into a tool that enables non-coders to easily churn out blockchains and decentralized autonomous organizations (DAOs).","Ignite launched Cosmos in 2017 to support its vision of a multi-chain future, where many different blockchains coexist to support specific use-cases.","Today, transferring assets between blockchains like Ethereum and Solana can be accomplished through the use of cross-chain “bridges,” but the recent $326 million hack of the Wormhole bridge demonstrates that sending assets between distinct blockchains can pose security risks. Cosmos provides a way for developers to quickly spin up blockchains that can interact with one another without the need for specialized tooling.","Since its launch, the Cosmos network has grown to host 38 different blockchains with a combined market cap of over $122 billion, and Ignite’s tools have been used by major projects like Terra, Binance Smart Chain and Facebook’s ill-fated libra stablecoin.","The Ignite team was responsible for building out the core infrastructure underpinning Cosmos, but the bulk of the project’s development has gradually shifted away from Ignite to Cosmos’s broader development community.","Though Ignite is over eight years old – practically ancient in crypto years – Zhong insists that the company is only at the beginning of its journey.","“We’re going see a future of tens of thousands, hundreds of thousands, potentially millions of [blockchains] connected to each other,” Zhong said in an interview. “That sort of growth is really only possible if we help educate, excite and galvanize people to build and be a part of this ecosystem together.”","Despite the messy breakup of Ignite’s founding team in 2020, the Cosmos ecosystem has enjoyed steady growth over the past year, and Ignite hired 90 new employees in 2021, bringing its total headcount to 120."],"entity":[{"type":"Emeris","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Peng Zhong","content":"PERSON"},{"type":"Zhong","content":"PERSON"},{"type":"ATOM","content":"ORGANIZATION"},{"type":"Starport","content":"LOCATION"},{"type":"$7 billion","content":"MONEY"},{"type":"$44 billion","content":"MONEY"},{"type":"$326 million","content":"MONEY"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$122 billion","content":"MONEY"}],"hashtag":["Tendermint","Cosmos","Terra"],"authors":["Sam Kessler"]}