{"summary":"The broker expects a 7% reduction in hashrate post-halving from shutdowns versus 15% earlier, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/21\/bitcoin-year-end-price-target-raised-to-90k-at-bernstein\/","publishDate":"2024-03-21T13:30:57","id":16896,"type":null,"title":"Bitcoin Year-End Price Target Raised to $90K at Bernstein","category":["Finance"],"content":["* Broker raised its year-end bitcoin target to $90K from $80K.\n* Bernstein now expects a 7% reduction in hashrate post halving from shutdowns.\n* Says bitcoin miners compelling buys for equity investors looking for exposure to crypto.","Bernstein raised its year-end bitcoin (BTC) price forecast to $90K from $80K and updated estimates for mining stocks in its coverage, the broker said in a research report on Thursday.","“With a new bitcoin bull cycle, strong ETF inflows, aggressive miner capacity expansion, and all-time high miner dollar revenues, we continue to find bitcoin miners compelling buys for equity investors seeking exposure to the crypto cycle,” wrote analysts Gautam Chhugani and Mahika Sapra.","“We assume a 7% reduction in hashrate post halving from shutdowns versus 15% earlier,” the authors wrote. Hashrate refers to the total combined computational power that is being used to mine and process transactions on a proof-of-work blockchain. The quadrennial reward halving is when mining rewards are cut in half. The next halving is expected in mid-April.","Bernstein raised its price target for outperform-rated CleanSpark (CLSK) to $30 from $14.20. It trimmed its price target for outperform-rated Riot Platforms (RIOT) to $22 from $$22.50 and lifted its Marathon Digital (market-perform) price target to $23 from $14.30.","CleanSpark closed at $20.25 on Wednesday, Riot at $12.40 and Marathon at $22.43.\n\nRiot and CleanSpark are set to emerge as leaders in the sector, as the “largest miners with the largest self-mining capacity,” the report added.\n\nRead more: Bitcoin Miners Need to Be Proactive to Hold Their Positions After Halving: Fidelity Digital Assets\n"],"entity":[{"type":"7%","content":"PERCENT"},{"type":"$30","content":"MONEY"},{"type":"Mahika Sapra","content":"ORGANIZATION"},{"type":"$$22.50","content":"MONEY"},{"type":"$22.43","content":"MONEY"},{"type":"$80K","content":"MONEY"},{"type":"Gautam Chhugani","content":"PERSON"},{"type":"Bitcoin Miners Need","content":"ORGANIZATION"},{"type":"$90K","content":"MONEY"},{"type":"$23","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"$22","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"mid-April","content":"DATE"},{"type":"Bernstein","content":"PERSON"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$20.25","content":"MONEY"},{"type":"$14.30","content":"MONEY"},{"type":"$14.20","content":"MONEY"},{"type":"$12.40","content":"MONEY"}],"hashtag":["Mining","Analyst Ratings","CleanSpark","Marathon Digital","Riot platforms","Bitcoin Price"],"authors":["Will Canny"]}