{"summary":"Some people are concerned about privacy. Some about data. And some about…Richard Heart?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/07\/the-crypto-industry-responded-to-the-irs-proposed-broker-rule\/","publishDate":"2023-11-07T17:30:00","id":16894,"type":null,"title":"How the Crypto Industry Responded to the IRS Proposed Broker Rule","category":["Policy"],"content":["I was just going to write about spending several hours in a Costco, but luckily perhaps for all of us, there are somewhat more important things happening in crypto and regulation. Such as: we have just passed the first deadline for comments on the IRS proposal to classify certain types of crypto entities as brokers for tax reporting purposes. There's going to be a public hearing later today (and tomorrow) discussing these comments, although the actual comment deadline has been extended by a few weeks.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","We're coming up on a comment deadline for the IRS' proposed rule for enforcing broker reporting requirements on certain types of crypto entities and transactions.","The U.S. Treasury Department and IRS are poised to bring fresh crypto tax reporting rules into effect. The crypto industry largely seems opposed – the majority of comments I read urged caution or raised concerns about the proposal as written while only a relative few seemed to support it.","A few months ago, the U.S. Treasury Department put out its long-awaited proposed rule for enforcing broker reporting standards on cryptocurrency entities. The proposal suggested capturing hosted wallet providers, payment processors, some decentralized finance (DeFi) entities and others as \"brokers,\" meaning these groups would be subject to specific crypto tax reporting requirements. The Treasury also announced a public comment period, asking for feedback on the overall rule, and also asking specific questions about different provisions detailed within the document.","Over 117,000 comments were received as of Nov. 6, and just under 40,000 of those were posted online (it seems like they're getting posted as Treasury officials read them).","I read…some of them. I can't really estimate how many because I closed a lot of the repetitive ones pretty quickly, and at some point started filtering out anonymous ones (many of which echoed the main themes I touch on below). Let's say more than a few, less than a lot and nowhere near 40,000.","A few main themes emerged over the limited selection of comments I read through: privacy implications, reporting requirements on stablecoin transactions, the collection burden on brokers and the possibility of requirements beyond what the proposal stated on DeFi applications. All of these themes were in turn focused on what various comments described as the sheer amount of information that would need to be collected and reported.","The central concern seems to be that DeFi platforms may not be set up to collect personally identifiable information (PII) from the parties transacting on said platforms, and cannot be easily configured to do so in a way that people would actually still use those platforms.","Factoring in stablecoin transactions also dramatically increases the volume of data that platforms may have to collect and report, some of the comments said.","Treasury said in the proposed rulemaking that – as of right now – stablecoins are not going to be excluded from the sale provisions of the rule, but it sought feedback on whether stablecoins should be excluded if their sale results in no gain or loss, as well as other aspects of this part of the proposal.","Some comments seemed concerned about having to report transactions as small as purchasing a cup of coffee. To the best of my knowledge, U.S. persons are already supposed to report those transactions, but the concern may be in how these transactions are reported and who's collecting and listing the data. More on this below.","The privacy implications outlined are also split into two groups. One group suggested that because some people self-custody assets, their personal information – including addresses – may be more easily leaked, putting them in direct danger. It's worth noting that while unhosted wallet providers – seeming to refer to entities that develop and sell or license unhosted wallet software to others – may have broker reporting requirements, unhosted wallet users themselves only have the actual tax reporting obligations. It's entirely possible that I'm missing a specific nuance here on the tax form that's being shared but if you're filing taxes, you're sharing your address with the IRS anyway.","There's also concerns that the brokers themselves – say a centralized or decentralized platform – may be compromised, which, erm, yeah fair enough.","The other group – and I'm reading between the lines here a little – seemed to suggest that to some extent, cryptocurrency transactions below a certain level (dare I say \"de minimis?\") should just be exempt from tax reporting requirements, though that's not an issue raised by this proposed rule.","Requests for extensions filed by various companies and entities in the crypto sector made up a smaller sub-theme. Treasury extended the comment deadline by two weeks, and the public hearing was pushed to Nov. 13. People who'd like to attend as a listener should email the IRS with \"Request to ATTEND Hearing Telephonically for REG–122793–19\" in the subject line before Nov. 9, per instructions on the Federal Register.","Some of the comments were less on-topic. A few seemed to have some boilerplate language about Pulsechain or defended Richard Heart, the face of that project who's now facing a Securities and Exchange Commission lawsuit. Another called Heart a \"scammer\" and seemed to urge the federal government to heavily regulate anything that isn't Bitcoin. I'm going to do something a little bit unusual and inject my personal opinion here, which is that maybe sending comments intended (I'm guessing?) for the SEC to the IRS is a waste of everyone's time.","One comment ignored the proposed rule itself to mostly complain about the Federal Register's search function, which I'm including because it made me snort at [redacted] p.m. on a Monday.","Also – neither here nor there but regulations.gov, the site hosting these comments, was intermittently inaccessible from Monday night into Tuesday morning.","As some of you may have noticed, Sam Bankman-Fried was found guilty on seven different charges tied to the operation and collapse of his crypto exchange FTX and trading firm Alameda Research last week. The verdict came on the one-year anniversary of CoinDesk's Ian Allison publishing a balance sheet from Alameda, which led to Binance's Changpeng \"CZ\" Zhao threatening to dump the exchange's entire FTT stack, which in turn accelerated withdrawal requests and ultimately led to FTX's bankruptcy on Nov. 11, 2022.","Obviously I – and 20 or 30 other reporters – have spent quite a bit of time at the federal courthouse in downtown Manhattan throughout October covering this trial, and its conclusion seemed as abrupt as it was inevitable. Read all of CoinDesk's coverage of the trial here, and feel free to send any comments or questions either as a reply to this email or to sbftrial@coindesk.com.","Monday","Tuesday","Wednesday","Thursday","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Nov. 6","content":"DATE"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"Nov. 9","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"erm","content":"ORGANIZATION"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Nov. 11, 2022","content":"DATE"},{"type":"Manhattan","content":"LOCATION"},{"type":"U.S. Treasury Department and IRS","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Nov. 13","content":"DATE"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Richard Heart","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Costco","content":"ORGANIZATION"},{"type":"Ian Allison","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"] p.m.","content":"TIME"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Newsletters","State of Crypto","Regulations"],"authors":["Nikhilesh De"]}