{"summary":"In total, investors, users, and exchanges have lost some $4.3 billion from illicit activity.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/08\/12\/exit-scams-swindled-31-billion-from-crypto-investors-in-2019-report\/","publishDate":"2019-08-12T20:00:06","id":16893,"type":null,"title":"Exit Scams Swindled $3.1 Billion From Crypto Investors in 2019: Report","category":["Markets"],"content":["Cryptocurrency crime made good money last quarter, although less than in the first quarter of 2019.","Cybercrime against exchanges amounted to $125 million in Q2 compared to $356 million in Q1, according to an initial release of CipherTrace's Q2 2019 Cryptocurrency Anti-Money Laundering Report. Aggregate crypto losses reached $4.3 billion this year on the back of one particular exit scam, \"Plus Token.\"","Given that CipherTrace’s price estimations are set at the time of initial reporting, current valuations would be much higher.","Included within Q1 is the QuadrigaCX exchange collapse which CipherTrace labelled an exit scam. Investors lost $195 million.","CipherTrace further claims 2019 may be the “Year of the Exit Scam,” with $3.1 billion stolen through exits and another $874 million in misappropriated funds. These numbers, CipherTrace notes, are only preliminary with numerous other allegations under investigation. ","An unconfirmed exit scam by South Korean exchange and pyramid scheme Plus Token is included in the estimates. Investors are suspected to have lost as much as $2.9 billion. The details around the exit scam have yet to be established, however.","In total, investors, users, and exchanges have lost almost $4.3 billion from illicit activity year to date.","CipherTrace notes that illicit funds will soon come under more intense scrutiny following the Financial Action Task Force’s (FATF) recent Travel Rule. The rules mandate personal information for both the sender and receiver of funds for transfers over $1,000.","UPDATE (13, August 16:00 UTC): A prior version of this story incorrectly labelled the QuadrigaCX exchange collapse a hacking event.","Image via CoinDesk archives"],"entity":[{"type":"CipherTrace","content":"ORGANIZATION"},{"type":"the first quarter of 2019","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"$2.9 billion","content":"MONEY"},{"type":"$1,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$874 million","content":"MONEY"},{"type":"$195 million","content":"MONEY"},{"type":"$356 million","content":"MONEY"},{"type":"$4.3 billion","content":"MONEY"},{"type":"$125 million","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["News","Hacks","CipherTrace"],"authors":["William Foxley"]}