{"summary":"Bitcoin mining incentivizes the decarbonization of energy markets and addresses market imbalances, according to Iris Energy’s Daniel Roberts.\nThe Iris Energy co-founder and co-CEO discussed the firm’s focus on renewable energy sources for Bitcoin mining in an interview with The Block.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262604\/bitcoin-mining-incentivizes-decarbonization-of-energy-markets-iris-energy","publishDate":"2023-11-10T08:39:27","id":1689,"type":null,"title":"Bitcoin mining incentivizes energy market decarbonization: Iris Energy","category":["People"],"content":["Daniel Roberts, co-founder and co-CEO of Bitcoin mining firm Iris Energy, shed light on how Bitcoin mining can play a crucial role in decarbonizing energy markets in an interview with The Block.&nbsp;","By strategically placing Bitcoin mining operations near renewable energy sources, Iris Energy helps balance the supply and demand of renewable power, Roberts said — utilizing idle renewable energy assets and providing critical support to the energy grid, particularly in regions like West Texas where renewable generation exceeds transmission capacity.","“Renewable power markets need to find a balance in supply and demand,” Roberts explained. “Where you have renewable energy, you have subsidies. In the case of a business model for a solar or wind farm, earning revenue from renewable energy certificates can lead to a divergence from underlying demand for that electricity.”","“This results in situations where wind and solar projects are built in remote, low-cost locations with ample sun or wind, generating renewable energy certificates that can be monetized, but with no immediate local demand, leading to idle assets,” Roberts added.","“Bitcoin mining is well-suited to address these issues and provide a valuable service to the grid. It can quickly adapt to price changes, making it a responsive solution for grid management, relative to more traditional industries,” he continued. “In more simple terms, we can take energy from the grid when it’s advantageous to all parties involved, or turn off our Bitcoin mining and re-supply power to the grid when it’s in need.”","Iris Energy previously reported receiving <a href=\"https:\/\/www.theblock.co\/post\/249904\/iris-energy-bitcoin-mining\" data-v-f87c67ca=\"\">$2.3 million power credits<\/a> in August, primarily driven by voluntary curtailment at its Childress site in Texas during peak demand.","Using 100% renewable energy is core to Iris Energy’s business. Beyond that, Roberts said it was committed to only entering markets where Iris Energy’s energy consumption is helping to solve problems in that energy market.","Being able to shed load to balance energy grids has been very challenging for traditional industries, but Bitcoin mining is a powerful tool to solve the problem, Roberts argued.","“When you're dealing with Bitcoin mining, which is a fully digital operation — we are able to automatically put our miners to sleep in a matter of seconds,” he said. “This is a game changer in terms of being able to provide a demand response capability to the grids — and this is exactly what we are doing today in Texas.”","Roberts also highlighted the company's focus on building institutional-grade data centers, optimized, not just for Bitcoin mining, but for high power-density applications like generative AI.","The purpose-built facilities provide superior operational efficiency compared to traditional data centers, are designed to withstand extreme temperature variations and are better equipped to meet the power requirements of modern AI workloads, Roberts claimed.","“For example, a traditional data center historically works with 5-15kW rack density, compared to around 40kW per rack for GPU workloads. Our Bitcoin mining operations are running at approximately 70kW per rack,” Roberts continued.","“What we are seeing is traditional data centers encountering the challenge of having to triple their power density and adapt their electrical infrastructure, airflow and cooling solutions — which is a real challenge that will take time to solve,” he added.","In response to the growing energy demands of Bitcoin mining — often <a href=\"https:\/\/www.greenpeace.org\/usa\/reports\/investing-in-bitcoins-climate-pollution\/\" data-v-f87c67ca=\"\">criticized<\/a> by groups like Greenpeace — and emerging technologies like AI, Iris Energy implemented several strategies to boost energy efficiency, according to Roberts. This includes using advanced cooling systems and acquiring the latest generation of energy-efficient Bitmain S21 Bitcoin miners, combined with locating near renewable energy sources to provide a sustainable and responsible means to mine Bitcoin and power AI, he said.","Reflecting on market dynamics compared to a year ago, just as the FTX debacle began to unfold, Roberts said the market feels like it’s in a much better place.&nbsp;","“The Bitcoin price around the time of the FTX collapse was hovering around $15,000. Bitcoin is trading around $35,000 today, a Bitcoin ETF is likely round the corner and we have the halving event coming up in 2024. Things have certainly improved materially over the last 12 months,” he said.","Iris Energy's expansion plans, including continued investment in the growth of its core Bitcoin mining business and the provision of services to generative AI customers, reflect the team’s optimism about the market's future, he added.","Discussing the evolving landscape of Bitcoin mining, Robert said he had witnessed a shift from chip manufacturing dominance to building large-scale infrastructure and accessing institutional capital.","“If we go back in time, competitive advantage in mining was dominated by the manufacturers of chips,” he said. However, as the industry continued to grow, it necessitated a “significant increase in the scale of real-world infrastructure and energy required to support the industry.”","“We have seen large amounts of capital being invested into Bitcoin mining, particularly from public market investors, which has fueled expansion in the global hashrate,” Robert continued. “The shift in competitive advantage moved away from chip quality and towards who could build large-scale, real-world infrastructure businesses and access institutional capital markets for scaling — all of which are core competencies of the Iris Energy team.”"],"hashtag":["BITCOIN","MINING COMPANIES"]}