{"summary":"EIGEN's airdrop comes after a wave of criticism of its distribution plan and points program.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/09\/eigenlayers-eigen-airdrop-might-signal-demise-of-once-popular-points\/","publishDate":"2024-05-09T23:12:48","id":16903,"type":null,"title":"EigenLayer's EIGEN Airdrop Might Signal Demise of Once-Popular 'Points'","category":["Technology"],"content":["What is perhaps the most-hyped crypto airdrop ever is set to kick off on Friday, but not necessarily with the kind of enthusiasm that its builders may have hoped for.","EigenLayer, a restaking platform on Ethereum, accrued $16 billion worth of crypto deposits within its first year of opening up to users – even prior to its official launch last month. When most of that money came in, the project was little more than a glorified blockchain wallet on the Ethereum blockchain – a non-functional lockbox that dangled the prospect of future rewards but didn't yet have any actual features. (Although the project did \"launch\" its pooled security service in April, many mission-critical features remain missing).","But it's the details around the token distribution that have generated the bulk of criticism on X and other social-media platforms. The tone has gotten so negative that some industry officials wonder whether it will lead to the demise of the wildly popular crypto incentive system known as \"points\" rewards.","Read more: As Crypto 'Points' Farming Grows, So Does Risk of Vague Promises","As its primary incentive model, depositors into EigenLayer were rewarded with points – tallies tracked by EigenLayer and other third parties that accumulated according to how much a person deposited into the project, and for how long. The points weren't themselves crypto tokens, but most depositors expected them to eventually be convertible into them – an expectation that followed from months of lookalike programs from other upstart crypto projects.","In addition to earning points by depositing into EigenLayer, some people began trading them outright on platforms like Pendle, which offered as much as \"40x leverage\" on points trading.","EigenLayer's points program helped it attract users and lure in billions of dollars, but when the airdrop of the EIGEN token was finally announced last week, the project's community erupted with anger.","First, there was the revelation that the tokens would be non-transferable until some yet-to-be-determined future date – meaning users would need to wait even longer to cash out on their investments.","\"Although there purposefully wasn't any communication saying that the token would be transferable on day 1, the fact that the EigenLayer points program has been going on for nearly a year certainly led to the expectation that depositors would be able to claim their tokens on day 1,\" said Luxas Outumuro, who leads research at IntoTheBlock, a blockchain market intelligence firm. \"It's understandable that they want to decentralize their token further, but it was a mismanagement of expectations that wasn't properly addressed.\"","Read more: Why Eigenlayer’s Airdrop Is Controversial","More blowback revolved around EigenLayer's decision to restrict its airdrop to users from select regions – even though the project had placed no geographic restrictions on users making deposits and earning points. Users from more than a dozen countries, including the U.S., Canada and China, will be barred from the airdrop.","\"There was so much 'wink, wink' going on around points and how they were making an infinite sum game and everyone's gonna win and all of this shit. And then they basically cut off two-thirds of potential users and airdrop recipients,\" said one EigenLayer venture investor who agreed to speak on the condition of anonymity. \"I think it's completely fine to cut off the U.S. from an airdrop, but then don't let them use it in the first place.\"","Other criticisms came down to the token's \"Season 1\" distribution plan, which will place EIGEN tokens into the hands of some point earners but will force others to wait for a \"Season 2\" airdrop that hasn't been detailed. This means users who deposited into EigenLayer via some liquid restaking services and other third-party platforms don't yet know how many EIGEN tokens they'll receive – despite the fact that these services are responsible for a lion's share of overall EigenLayer deposits.","\"EigenLayer chose to allow others to, sort of, rehypothecate and play all these crazy games. They could have just said, 'No, don't do that. We're not making any commitment that we're going to honor those points,'\" said Mike Silgadze, founder of liquid restaking platform Ether.Fi.","EigenLayer revised its token plans in response to the community backlash, but it's unlikely that the changes will be enough to place EigenLayer back into the crypto community's good graces.","EigenLayer isn't the only recent project that's struggled to meet the expectations set by a points program.","Renzo, a liquid restaking protocol on EigenLayer, faced similar backlash last month when its point system failed to meet investors' expectations. Blur, one of the originators of crypto points, received criticism for repeatedly extending its points window and changing the rules around when and how tokens would be airdropped.","Some point programs have converted into airdrops with little controversy, but more and more of them – particularly larger projects, like EigenLayer – have led to disappointment.","Many investors are beginning to think that the practice – which has become ubiquitous among crypto startups – may finally be nearing its end.","Silgadze explains that points were a way to \"encourage protocol activity in advance of the token launch.\" This improved upon the old system, where users would \"farm\" for an airdrop by interacting with a blockchain protocol, but didn't know exactly what sorts of activities would ultimately lead to airdrops. Point-based systems \"give much more clarity to people about what the protocol wants you to do,\" said Silgadze.","While point systems are a great way to entice would-be users, they also exist as the result of regulatory protection. Crypto companies are hesitant to directly sell tokens initial coin offering (ICO)-style, since doing so could place them in the cross-hairs of regulators.","But when it comes to protecting investors and offering transparency, Robert Leshner, the founder of Compound and Robot Ventures, an investor in EigenLayer developer Eigen Labs, thinks points are the worst of all worlds. \"The entire root of investor protection is making sure that there's not an information asymmetry between the investors and the sponsors. And points create the largest information asymmetry that exists in crypto,\" he said. \"Everything is at the team's discretion, and users and investors are just praying that they get treated right by the team.\"","Leshner thinks the litany of points failures of the past year will eventually lead to a dying-out of the practice.","\"When you see one of the largest, most ambitious, most genuine projects in all of crypto, EigenLayer, f_ck up a points program – If EigenLayer can't do this correctly, who can? No one can.\"","Edited by Bradley Keoun."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Silgadze","content":"PERSON"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"Mike Silgadze","content":"PERSON"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"Luxas Outumuro","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Pendle","content":"PERSON"},{"type":"Eigen Labs","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"IntoTheBlock","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Robert Leshner","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Robot Ventures","content":"ORGANIZATION"}],"hashtag":["EigenLayer","airdrop","Eigenlabs","Ethereum"],"authors":["Sam Kessler"]}