{"summary":"Voice, the social media app launched by Block.one, has received $150 million from its parent company\nThe funding is said to kickstart Voice’s independent operations\nVoice was built on a special-purpose blockchain based on the EOSIO protocol","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59702\/block-one-invests-150m-in-its-social-media-app-voice-to-fund-independent-operations","publishDate":"2020-03-26T09:21:21","id":1691,"type":null,"title":"Block.one invests $150M in its social media app Voice to fund independent operations","category":["Layer 1s"],"content":["Block.one, the publisher of the EOS blockchain protocol, has invested $150 million in Voice, a social media platform launched in June last year.&nbsp;","Announced on Thursday, the investment is said to kickstart Voice's independent operation separate from Block.one, per a company statement. The $150 million consists of $100 million in cash and $50 million in IP assets, a Block.one spokesperson told The Block.&nbsp;","In January, the social media app <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52560\/block-ones-social-media-app-voice-poaches-forbes-exec-as-ceo\" data-v-f87c67ca=\"\">hired<\/a> former Forbes global chief digital officer Salah Zalatimo as its CEO and rolled out a public beta the following month. The company is looking to officially roll out the app in Q1, 2021, Zalatimo told The Block.&nbsp;","\"Under Salah's leadership, Voice is to operate as a separate business and will deploy the $150 million in capital to expand its operations and build out the company's workforce,\" the announcement stated.&nbsp;&nbsp;","Voice had a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/25549\/block-one-the-firm-behind-eos-launches-social-media-app\" data-v-f87c67ca=\"\">high-profile debut<\/a> in the summer of 2019. At the time, the product was branded as a social media platform that allowed real users, instead of bots, to post and share content for token rewards. To ensure authenticity, the app requires identity verification for every user. All verified users will then receive some Voice Tokens on a daily basis and can use these tokens to boost certain posts. They can also earn additional tokens by creating original content.&nbsp;","“Voice is truly a content marketplace, where the user is in control of the type of content that is promoted, and where community members are not afraid to be wrong. By designing a platform where every user has gone through Know Your Customer (KYC) verification and real identities are attached to the original content being shared, we are empowering users to hold each other accountable,\" Zalatimo said in the announcement.&nbsp;","According to Voice's website, the use of blockchain-based tokens is said to make the content promotion process more transparent and auditable. However, the app, which is currently available, was built on a purpose-made EOSIO blockchain instead of the EOS public blockchain, according to Zalatimo.&nbsp;","\"Voice will be launched on a special purpose blockchain. Iterating and optimizing a product like Voice is not feasible on a public blockchain due to the inability to rapidly innovate,\" Zalatimo said.&nbsp;","As The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/daily\/25741\/block-one-poured-150-million-into-its-new-social-media-platform\" data-v-f87c67ca=\"\">reported<\/a>, the social media app took <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90686\/block-one-cto-daniel-larimer-announces-resignation\" data-v-f87c67ca=\"\">Block.one<\/a> at least a year to build and cost $150 million, including a $30 million purchase of the Voice.com domain name. In total, the company has spent $300 million on the social media app to date, Block.one confirmed to The Block.&nbsp;"],"hashtag":[]}