{"summary":"Mia Khalifa, Snoop Dogg, Elon Musk and Gene Simmons are just a handful of celebrities that can't get enough of the dog-themed cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/02\/16\/how-dogecoin-became-so-popular\/","publishDate":"2021-02-16T19:26:22","id":16910,"type":null,"title":"How Dogecoin Became So Popular","category":["Markets"],"content":["","Dogecoin started off as a joke cryptocurrency but now has a market capitalization of $7 billion and a huge global following. How did it all happen?","","","Dogecoin was a parody cryptocurrency created by Adobe Product Marketing Manager Jackson Palmer and software engineer Billy Markus in late 2013. The two set out to make the project “as ridiculous as possible” and centered it around a popular internet meme of a Japanese Shiba Inu “doge” that would say nonsensical phrases like “much wow” and “such tired.”","","","The total supply of 100 billion coins was another one of the “wacky decisions” the co-founders made to “make [dogecoin] ... undesirable as a cryptocurrency so that it [didn’t] become serious.” Eventually, though, the supply limit was removed to promote the use of the crypto token and discourage hodling.","","","Dogecoin was forked from Lucky Coin – a fork of Litecoin, which is a fork of Bitcoin – because Lucky Coin had a random block reward schedule where miners could receive zero or potentially thousands of free coins for producing new blocks. Palmer and Markus implemented this feature in Dogecoin, hoping the randomness would irritate doge miners and prevent them from actually using the token as a payment solution long-term. Just one month after the project launched, however, the official Dogecoin website was visited more than a million times and quickly amassed a substantial following. ","","","In March 2014, the block reward schedule was decidedly changed to a fixed one similar to bitcoin’s and most other cryptocurrencies to make it more feasible as the number of users continued to grow exponentially.","","","Dogecoin officially went live on Dec. 6, 2013, and became an instant hit with the community. Not only was it a comical cryptocurrency that could be easily mined and cost fractions of a cent to buy, but the outrageousness of its creation came as a welcomed breath of fresh air for people who just wanted to freely play around with cryptocurrencies.","","","Within two weeks, the r\/Dogecoin Reddit channel had over 19,000 users and DOGE’s price skyrocketed 300%, despite China announcing a ban on payment companies from dealing with Bitcoin, at the time. ","","","On Dec. 25, the community was rocked by its first major hack. Dubbed “the Dogecoin Christmas hack,” a malicious attacker reportedly broke into DogeWallet – a third-party Dogecoin wallet provider – and stole 11 million doge (worth approximately $12,000 at the time). According to the official response from DogeWallet members, “the attack originated from the hacker gaining access to our filesystem and modifying the send\/receive page to send to a static address.”","","","A community-driven effort to reimburse victims of the hack called “SaveDogmas” began two days after the attack. Despite having only formed a few weeks ago, the “shibes” community – as they would come to be known – pulled together and donated 15 million doge to the SaveDogmas wallet. This act of generosity would become a key defining characteristic of the Dogecoin community in the year that followed.","","","In 2014, the Dogecoin community was eager to prove the meme-based cryptocurrency did, in fact, have real-world utility and began raising funds through DOGE donations to help support a wide range of sporting and charitable causes.\n\nThe first saw the community raise $30,000 in a matter of hours to help send the Jamaican bobsled team to Sochi, Russia, for the 2014 Winter Olympics. The story was picked up by a number of mainstream news outlets including Business Insider, The Washington Post and The Guardian, and helped broadcast the dog-themed crypto project to the rest of the world. By mid-January, DOGEdaily transaction volumes briefly overtook bitcoin and every other cryptocurrency (in U.S. dollar equivalent).\n\nAnother community-led initiative called “Doge4Kids” started in February and raised $30,000 for the 4 Paws For Ability charity which provides service dogs to children with special needs.","","","Also that month, a Washington Post article was shared in the Dogecoin Reddit channel describing an Indian luger named Shiva Keshavan who desperately needed funding to make it to the 2014 Sochi Winter Olympics, after his home country was suspended by the International Olympic Committee for corruption. Within 24 hours, over $7,500 worth of DOGE was raised by the Reddit community, allowing Keshavan to enter the competition.","","","On Mar.11, 2014, the Dogecoin community contributed $50,000 to support a Charity: water project that builds clean water facilities in Kenya. The generous donations allowed the U.S.-based non-profit organization to construct two new water wells in the area.","","","On March 17, 2014, a Nascar driver by the name of Josh Wise was struggling to secure sponsorship that would enable him to enter into the Talladega Superspeedway race. A post appeared in the r\/Dogecoin Reddit channel once again rallying the community to put their doge to good use and become the leading sponsor of Wise’s vehicle. Over 67 million doge amounting to $55,000 was donated in total. The car named “#98 Moonrocket” was emblazoned with the infamous Shiba Inu meme and was the first time the project had ever been physically advertised at a major sporting event.","","","2014 also saw the creation of DogeTipBot, a third-party tipping service that interfaced with Reddit and allowed users to send dogecoin microtransactions to each other for posting favorable content. This service was instrumental in encouraging the early use of doge and also played a huge role in exposing non-crypto users to digital tokens for the very first time. By August, DogeTipBot had become the crypto industry’s leading tipping service with over 70,000 sign-ups.","","","In 2017, however, the creator of DogeTipBot, Josh Mohland, took to Reddit to announce he had gone bankrupt, was closing down the service and had squandered all doge held on the platform to cover operating costs and his own debts.","","","Another major contributor to dogecoin’s global popularity in more recent years is its growing list of influential celebrity endorsers who frequently voice their support for the Shiba Inu-themed cryptocurrency on social media. The list includes Netflix’s \"Tiger King\" star Carole Baskin, Kiss co-lead singer Gene Simmons, former professional bodybuilder Kai Greene, former adult film star Mia Khalifa and American rappers Snoop Dogg and Lil Yachty.","","","The most notable celebrity endorser of dogecoin, however, is none other than Tesla CEO, and the world’s richest man, Elon Musk.","","","Musk first came into contact with DOGE back in September 2018 when he publicly enlisted the help of former dogecoin creator, Jackson Palmer, to combat Twitter scam bots that were impersonating Musk to steal people’s crypto. Seven months later, Musk tweeted “Doge might be my fav cryptocurrency. It’s pretty cool.” in response to winning an April Fool's Day poll to become the project’s newly elected CEO.","","","In March 2020, Musk followed up with another doge-related tweet stating “Dogs rock ... they have the best coin”, and four months later shared a dogecoin meme to his 46.9 million Twitter followers with the caption “it’s inevitable.”","","","Towards the end of 2020, Musk continued tweeting about DOGE – causing prices to pump 25% on Dec.20 after he posted “One word: DOGE.” He even jokingly commented that dogecoin could one day become the official currency of Mars. Musk's ability to dramatically influence the crypto market through social media posts became known as the \"Elon effect.\"","","","During the WallStreetBets stock market frenzy that gripped the traditional financial markets in January 2021, Musk sent dogecoin prices soaring 800% towards a peak of $0.08 after tweeting an image of a dog on the cover of a “Dogue” magazine. On April 15, he continued to demonstrate the power of the Elon effect by tweeting another image of a famous painting entitled \"dog barking at the moon\" with the caption \"doge barking at the moon.\" This immediately had an impact on dogecoin's price, catapulting it 260% to a new all-time high above $0.45, according to CoinDesk data.","","","So how did dogecoin become so popular? In short, it seems the selfless community, the light-hearted origin of the project and the real-world utility were the biggest contributors to dogecoin’s early success in the crypto market. Over the last few years, however, dogecoin has really become a kind of cryptocurrency avatar for meme culture, fueled by online communities and support from internet personalities like Elon Musk. As that culture has risen in influence, DOGE has risen in value – essentially taking on a life of its own that its creators never intended.",""],"entity":[{"type":"March 17, 2014","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"15 million","content":"MONEY"},{"type":"300%","content":"PERCENT"},{"type":"$7,500","content":"MONEY"},{"type":"March 2014","content":"DATE"},{"type":"American rappers Snoop Dogg","content":"ORGANIZATION"},{"type":"Dogecoin Reddit","content":"ORGANIZATION"},{"type":"Tesla CEO","content":"LOCATION"},{"type":"International Olympic Committee","content":"ORGANIZATION"},{"type":"Markus","content":"PERSON"},{"type":"mid-January","content":"DATE"},{"type":"August","content":"DATE"},{"type":"September 2018","content":"DATE"},{"type":"Josh Wise","content":"PERSON"},{"type":"Dogecoin Christmas","content":"PERSON"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"Gene Simmons","content":"PERSON"},{"type":"March 2020","content":"DATE"},{"type":"Lil Yachty","content":"ORGANIZATION"},{"type":"$0.45","content":"MONEY"},{"type":"$7 billion","content":"MONEY"},{"type":"April 15","content":"DATE"},{"type":"260%","content":"PERCENT"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Dogecoin Reddit","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"67 million","content":"MONEY"},{"type":"Jackson Palmer","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Dec.20","content":"DATE"},{"type":"Litecoin","content":"LOCATION"},{"type":"April Fool's Day","content":"DATE"},{"type":"$0.08","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"Mia Khalifa","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"DogeTipBot","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Dec. 25","content":"DATE"},{"type":"The Washington Post","content":"ORGANIZATION"},{"type":"Sochi Winter Olympics","content":"ORGANIZATION"},{"type":"Elon","content":"LOCATION"},{"type":"Josh Mohland","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Sochi","content":"LOCATION"},{"type":"Dec. 6, 2013","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"$55,000","content":"MONEY"},{"type":"Carole Baskin","content":"PERSON"},{"type":"Elon Musk","content":"LOCATION"},{"type":"$12,000","content":"MONEY"},{"type":"Kenya","content":"LOCATION"},{"type":"Dogecoin","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Dogecoin","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"800%","content":"PERCENT"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Billy Markus","content":"PERSON"},{"type":"Shiva","content":"ORGANIZATION"},{"type":"Kai Greene","content":"PERSON"},{"type":"Adobe Product Marketing","content":"ORGANIZATION"},{"type":"Mar.11, 2014","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nascar","content":"ORGANIZATION"}],"hashtag":["Dogecoin","Explainers","Learn","Evergreen"],"authors":["Ollie Leech"]}