{"summary":"While bitcoin’s wild price movements might seem random, they are often driven by the same fundamental catalysts as in the traditional markets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-makes-bitcoin-price-go-up-or-crash-down\/","publishDate":"2021-12-17T23:04:58","id":16917,"type":null,"title":"What Makes Bitcoin Price Go Up ... or Crash Down?","category":["Learn"],"content":["Some analysts claim bitcoin (BTC) is impervious to shocks that affect global finance; it’s a hedge against things like inflation, they claim, and a sure bet against tides of uncertainty. Not so, says the media. There are countless news articles showing bitcoin is affected by exogenous market shocks plus other things that don’t touch conventional financial products, such as international regulation and social media.","In this piece, we’ll give you a quick rundown of the main catalysts that cause the price of bitcoin to crash or skyrocket..","Crypto often crashes in tandem with global markets. When the coronavirus pandemic throttled global markets in March 2020, bitcoin crashed with it. Within the space of a week in mid-March, bitcoin fell by 57% to lows of $3,867. Then, like the stock market, it recovered and became stronger than ever, hitting all-time highs the following year. Analysts think this was due to the excess amounts of spare time and disposable income some retail traders had during the coronavirus pandemic, plus the buoyancy of the stock market.","Bitcoin has reacted to other market shocks, too. For instance, bitcoin fell by 6.9% in late 2021 when traders feared that Evergrande, the Chinese real estate giant, was about to collapse, and again when Didi announced plans to delist from the New York Stock Exchange. More broadly, it has reacted positively to inflation, rising along with the prices of consumer goods and materials.","It’s impossible to list all of the economic shocks that affect bitcoin, but there’s enough evidence to suggest that bitcoin tracks global markets to some extent.","A 2020 paper on bitcoin volatility in the Journal of Economic Dynamics and Control found volatility is not influenced by “most scheduled U.S. macroeconomic news announcements” but that the waters become choppier when “forward-looking indicators, such as the consumer confidence index,” are published.","Systemic overleveraging exaggerates these shocks and contributes to volatility. Leveraging is when a trader borrows capital from the exchange to turbocharge investment potential. Instead of trading with $1,000 of your own money, for example, some exchanges previously allowed you to borrow up to 100x your initial deposit – meaning you could potentially trade with up to $100,000. Of course, borrowing that sort of money carries serious liquidation risks.","When large numbers of highly leveraged traders all bet on bitcoin’s price moving one way it creates an opportunity for other large investors (whales) to move bitcoin’s price in the other direction. Doing so triggers a cascade of liquidations, sending bitcoin’s price to crash and creating huge paper losses for leveraged long traders. The whales are then free to pick up bitcoin at a much cheaper price than before at the expense of “rekt” traders.","Finally, weekends – believe it or not – can also have a significant impact on bitcoin price volatility. Fewer traders are actively behind their computers monitoring the markets during these times, meaning there’s less resistance when prices tumble and not as much profit taking when bitcoin spikes. This can often lead to more significant price swings in both directions.","International regulation has a serious impact on bitcoin’s price because it determines which markets can access it, where companies can set up shop and where bitcoin miners can operate. While countries like the United Kingdom, Thailand and India have shown to have direct influence on bitcoin’s price, two major markets impact bitcoin’s price the most: the U.S. and China.","Bitcoin’s crash, from close to $65,000 in April 2021 to around $35,000 by mid-June, was in large part a response to China’s crackdown on bitcoin mining. Bitcoin fell 5.5% when the Chinese government clarified in September 2021 that cryptocurrencies are illegal.","In the U.S., bitcoin responds to news from regulators and legislators. In 2021, President Joe Biden’s infrastructure bill hurt bitcoin’s price because it posed difficulties to decentralized wallet companies, which would have to report tax data about their customers that they, by their nature, do not collect.","It’s not all bad. Bitcoin responds positively to good news, too. Expectations of an announcement that the U.S. Securities and Exchange Commission would green-light a bitcoin futures exchange-traded fund helped the price of bitcoin climb by around $3,000 in October 2021.","Moves within traditional finance can boost or burn bitcoin’s price because they determine how easy it is for financial epicenters like Wall Street to invest in bitcoin. Moves that would send more Wall Street money into bitcoin, like major banks offering bitcoin to clients, often correlate with price rises. Traders are afraid of bad news, like a Wall Street titan slamming bitcoin.","Bitcoin has often risen when major companies announce that they have added bitcoin to their balance sheet. Bitcoin surged after companies like MicroStrategy and Tesla invested in bitcoin. Conversely, the total market capitalization of crypto fell from $2.43 trillion to $2.03 trillion after CEO Elon Musk said that Tesla would no longer accept bitcoin for payments in May 2021, citing environmental reasons.","Traditional financial products can also have an impact on the market price of bitcoin, particularly derivative products that represent contracts that track the underlying price of BTC. As we’ve already discussed, leveraged futures trading can often fuel steep price changes, but so can other products such as crypto options. In short, crypto options give investors the right, but not the obligation, to buy or sell the underlying asset (in this case, bitcoin) at a certain price (known as the strike price) prior to, or on, a certain date.","When a large number of out-of-the-money (OTM) bitcoin options are due for expiry at the same time, it can sometimes impact bitcoin’s market volatility. OTM refers to when options are not profitable. For example, a call option (the right to buy the underlying asset) is considered out-of-the-money when the strike price (the agreed price to buy the underlying asset) is higher than the current market price.","Before expiry, it’s common for big investors such as market makers to hedge with the underlying asset to reduce extended losses if bitcoin swings in the opposite direction.","When tech CEOs are all over social media, the lines between traditional finance and social media influence can blur. Retail investors appear particularly sensitive to comments about bitcoin from large influencers. Bitcoin surged by more than 20% after Elon Musk changed his Twitter bio to bitcoin because it signaled to retail investors that Musk could be about to invest in bitcoin, something he later did through Tesla. This runs in parallel with the CEO’s strong influence over other assets, particularly dogecoin.","Some analysts have tried looking at social media to predict prices. In a 2021 paper, two South Korean scientists concluded that bitcoin posts are more frequent when prices are high, and less frequent when prices are low. A 2019 research paper from Indian analysts concluded that negative and positive posts are correlated with bitcoin’s price.","This guide to the RSI indicator will help you in making timely trades and hopefully walk away with a win.","Crypto arbitrage trading is a great option for investors looking to make high-frequency trades with very low-risk returns.","The crypto industry is booming. Here are some top tips on how to start your new career in it."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"6.9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Tesla","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Journal of Economic Dynamics and Control","content":"ORGANIZATION"},{"type":"$3,867","content":"MONEY"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Didi","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"RSI","content":"ORGANIZATION"},{"type":"October 2021","content":"DATE"},{"type":"57%","content":"PERCENT"},{"type":"Joe Biden","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"$65,000","content":"MONEY"},{"type":"$35,000","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"Evergrande","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$2.43 trillion","content":"MONEY"},{"type":"5.5%","content":"PERCENT"},{"type":"Tesla","content":"LOCATION"},{"type":"$1,000","content":"MONEY"},{"type":"OTM","content":"ORGANIZATION"},{"type":"March 2020","content":"DATE"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Thailand","content":"LOCATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$2.03 trillion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","Intermediate","Learn"],"authors":["Robert Stevens"]}