{"summary":"Digital Euro Use Won’t Push Out Swedish Krona: Central Bank","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/digital-euro-wont-push-out-swedish-krona.htm","publishDate":"2024-05-14T11:59:05","id":16927,"type":null,"title":"Digital Euro Use Won’t Push Out Swedish Krona: Central Bank","category":["News "],"content":["Adopting a potential digital euro won’t displace the Swedish krona, Sweden’s central bank said.","In a staff memo published Tuesday, the Sveriges Riksbank indicated it sees potential benefits for Sweden in the digital euro. It highlighted the possibility of a more robust and competitive payment system.","The bank added that there may be a small shift away from traditional bank deposits. However, the Riksbank believes any impact will be limited due to the proposed cap on individual holdings of digital euros.","Using the digital euro might extend beyond the eurozone. While it’s designed for eurozone countries, a proposal allows non-eurozone members to potentially join the system through agreements with the European Central Bank (ECB). This could give residents and businesses in those countries access to the digital euro on equal footing with those in the eurozone.","Sweden’s central bank downplayed the impact of a potential agreement, arguing that institutional factors won’t “crowd out” the krona. Firstly, payments involving the government are conducted in Swedish kronor, solidifying its position as the primary currency, it said.","“For instance, given we pay our taxes in Swedish kronor, we also prefer to receive our salary in Swedish kronor,” the Riksbank said. “And when businesses pay salaries, their main expenditures, in Swedish kronor, they prefer to charge customers in Swedish kronor.”","Also, Swedes can use digital euros even if they haven’t visited or lived in the eurozone before. Meanwhile, businesses in Sweden can accept digital euro payments, but they must transfer them directly to a bank account, just like businesses in the eurozone.","The European Central Bank (ECB) launched a two-year planning stage for the digital euro project late last year. Its goals for this period include finalizing the rules, choosing private sector partners, and running tests and experiments.","According to the EU’s draft proposal, which might be revised before release, advantages with a digital euro are significant. Meanwhile, the potential downsides tied to not having one could be substantial.","The draft rules give the ECB the authority to restrict how much money individuals can hold in digital form. A possible limit of between 3,000 to 4,000 euros is being discussed.","A potential downside of the digital euro is that it could threaten the Swedish krona’s stability. High inflation can lead to price swings. If this becomes a problem in Sweden, businesses might switch to pricing things in euros. People might also choose to hold more of their money in euros (seen as a more stable currency) instead of krona. This “flight to quality” could weaken the krona.","Further, the decision to launch a digital Swedish krona, or e-krona, hinges on the development of the digital euro. An e-krona would bolster the Swedish krona’s position within Sweden if the digital euro becomes widely used, according to the bank.","Additionally, leveraging the technology and regulations built for the digital euro could significantly reduce the cost and complexity of launching an e-krona. Finally, the coexistence of both digital currencies could lead to smoother cross-border payments, it said."],"entity":[{"type":"Sweden","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Riksbank","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"Sveriges Riksbank","content":"ORGANIZATION"}],"hashtag":["CBDC","European Union","Sweden"],"authors":["Shalini Nagarajan"]}