{"summary":"Brazil Upholds Crypto Donations Ban for Political Parties and Candidates","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazil-upholds-crypto-donations-ban-for-political-parties-and-candidates.htm","publishDate":"2024-05-14T23:30:32","id":16922,"type":null,"title":"Brazil Upholds Crypto Donations Ban for Political Parties and Candidates","category":["Blockchain News "],"content":["Brazilian authorities have upheld a ban on the use of crypto donations to fund political parties and candidates’ electoral campaigns in the country.","In a ruling published on its website, the nation’s electoral court (Tribunal Superior Eleitoral, or TSE for short) wrote that it would “maintain” an existing “ban on the use of donations made in cryptocurrency.”","The TSE’s ruling covers the period up until the 2024 municipal elections. Polls are slated for October 6 this year. A run-off vote is scheduled for October 27.","Brazilians go to the polls in October to vote for mayors, deputy mayors, and local councilors in over 5,500 regions.","The new ruling effectively updates the existing regulations surrounding the funding of political campaigns. The TSE wrote:","“The payment of electoral expenses with virtual currencies and pre-paid cards managed by third parties is prohibited.”","The TSE explained its reasons for upholding the ban, claiming its rules “aim to ensure transparency and the proper tracking of donations made to political campaigns.”","It said the ruling was made “in accordance” with its “legal and accountability requirements.”","The electoral regulator said that its updated rules would reinforce its “commitment to supervise the fairness of the electoral process.”","It added that it would continue to “protect elections against irregular or illicit practices.”","The rules stipulate that donations to the value of just over $200 “must only be made by bank transfer,” and would be subject to cross-checking.","“All” crypto donations, even contributions worth less than $200, remain banned. The TSE first explicitly banned crypto as a donations tool in December 2019.","Stand With Crypto has received a $1 million donation from MoonPay ahead of the 2024 elections. Here's why it matters.#MoonPay #StandWithCrypto #Electionshttps:\/\/t.co\/ldnDhOEtji","— Cryptonews.com (@cryptonews) May 13, 2024","","It has subsequently updated its guidelines on several occasions. In each case, it has explicitly banned crypto donations.","Crypto community members had been hoping for a change, considering the phenomenal rate of adoption in Brazil and the wider LATAM region.","The TSE also instructed all candidates to detail their expenses and donated income in mandatory financial statements.","The body warned that those who fail to adhere to its rules could face censure from the Public Prosecutor’s Office and its own court system.","Nubank, one of the world’s largest digital banks, surpassed 100 million clients across its operations in Brazil, Mexico and Colombia https:\/\/t.co\/MHERUtxJv2","— Bloomberg (@business) May 8, 2024","","Last month, Nubank, the country’s biggest neobank and the third-largest company in Brazil by market cap, announced it would begin allowing its customers to make Bitcoin and Ethereum withdrawals from its banking app."],"entity":[{"type":"October 27","content":"DATE"},{"type":"May 8, 2024","content":"DATE"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"October 6 this year","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Mexico","content":"LOCATION"},{"type":"TSE","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Colombia","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Public Prosecutor’s Office","content":"ORGANIZATION"},{"type":"May 13, 2024","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Nubank","content":"ORGANIZATION"}],"hashtag":["Brazil","Politics"],"authors":["Tim Alper"]}