{"summary":"Bitcoin Hash Rate Declines as Mining Firms Shut Down Unprofitable Rigs Post-Halving","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-hash-rate-declines-as-mining-firms-shut-down-unprofitable-rigs-post-halving.htm","publishDate":"2024-05-14T11:24:56","id":16934,"type":null,"title":"Bitcoin Hash Rate Declines as Mining Firms Shut Down Unprofitable Rigs Post-Halving","category":["Bitcoin News "],"content":["The hash rate of the Bitcoin network has experienced a significant decline as mining firms are shutting down unprofitable mining rigs following the fourth Bitcoin halving.","Data from blockchain.com reveals that the hash rate dropped to its lowest level in over two months, reaching 575 exahash per second (EH\/s) on May 10. It has since made a small recovery and currently stands at 586 EH\/s.","The decline in hash rate can be attributed to miners turning off rigs that are no longer profitable, James Butterfill, the head of research at CoinShares, explained in a recent post on X.","Miners are beginning to turn off unprofitable rigs","We write about it here in detailhttps:\/\/t.co\/8tSQKDY5lk pic.twitter.com\/498SvO01Bz","— James Butterfill (@jbutterfill) May 13, 2024","","In a recent blog post, CoinShares predicted the temporary drop in Bitcoin hash rate.","However, the firm also expects the hash rate to surge in the coming years.","The increased costs of Bitcoin mining resulting from the halving, coupled with rising electricity costs, are cited as the main factors behind the reduction in hash rate.","The report suggests several mitigation strategies, including optimizing energy costs, improving mining efficiency, and securing favorable hardware procurement terms.","Nazar Khan, the co-founder and COO of TeraWulf, believes that only smaller mining operations with less energy-efficient equipment will face challenges after the 2024 halving.","TeraWulf, one of the world’s largest Bitcoin mining companies, worth over $670 million, plans to expand its operations despite the reduction in block rewards.","However, the profitability of mining operations heavily depends on the cost of electricity.","According to the Hashrate index, older ASIC models such as the S19 XP and M50S++ operate at a loss when electricity costs exceed $0.09\/kWh.","At $0.08\/kWh or higher, the Pros and M50S+ models become unprofitable. Even the S19j Pro+, j Pros, and M30S++ models will face challenges when electricity costs range between $0.06 and $0.07\/kWh.","Popular ASIC models profit\/loss at different Hashcost levels:","S19 XP & M50S++ will operate at a loss if hashcost rises >$0.09\/kWh.",">$0.08\/kWh k Pros & M50S+ will be unprofitable\n \nAnd at $0.06-$0.07\/kWh the S19j Pro+, j Pros, and M30S++ will struggle pic.twitter.com\/s6Zaz2KbrZ","— Hashrate Index 🟧⛏️ (@hashrateindex) May 2, 2024","","As mining firms adapt to the changing landscape, optimizing energy efficiency and reducing operational costs will be crucial for maintaining profitability in the Bitcoin mining industry.","Bitcoin miners, including Riot Platforms, have been adjusting their operations after the halving event on April 20, which reduced mining rewards from 6.25 BTC to 3.125 BTC, equivalent to approximately $180,600 at present.","As reported, a notable outflow of Bitcoin from miners could be on the horizon in the months following the upcoming halving event.","In a recent note, Markus Thielen, the head of research at 10x Research, estimated that Bitcoin miners have the potential to liquidate approximately $5 billion worth of BTC after the halving.","Asset manager CoinShares analysis suggests that Riot, TeraWulf, and CleanSpark are among the best-positioned companies to weather the impending storm.","It is worth noting that the number of new Runes etched on Bitcoin daily has experienced a drastic decline, falling below 250 for the past six days.","Initially, the protocol provided a much-needed revenue boost for Bitcoin miners seeking to offset the impact of the recent halving."],"entity":[{"type":"May 2, 2024","content":"DATE"},{"type":"Hashrate","content":"LOCATION"},{"type":"$0.09\/kWh","content":"MONEY"},{"type":"James Butterfill","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Markus Thielen","content":"PERSON"},{"type":"$670 million","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"10x Research","content":"ORGANIZATION"},{"type":"$0.08\/kWh","content":"MONEY"},{"type":"$0.07\/kWh","content":"MONEY"},{"type":"$180,600","content":"MONEY"},{"type":"May 13, 2024","content":"DATE"},{"type":"Nazar Khan","content":"PERSON"},{"type":"May 10","content":"DATE"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"$0.06","content":"MONEY"},{"type":"$0.07","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Mining"],"authors":["Ruholamin Haqshanas"]}