{"summary":"Singapore’s state-owned investment fund Temasek issued a statement strongly denying reports it had invested in a crypto startup named Array.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229036\/temasek-denies-investing-array-crypto","publishDate":"2023-05-02T05:29:07","id":1693,"type":null,"title":"Temasek denies investing in crypto project Array","category":["DEALS"],"content":["Singapore’s state-owned investment fund Temasek issued a statement denying it had invested in a crypto startup named Array.","Reports published yesterday suggested <a href=\"https:\/\/cointelegraph.com\/news\/ftx-investor-temasek-pours-10m-in-algorithmic-currency-system-array\" data-v-f87c67ca=\"\">Temasek had invested $10 million in Array<\/a>, an algorithmic currency system that on also claims to use AI. The investment supposedly brought the project’s valuation to more than $100 million. But Temasek <a href=\"https:\/\/twitter.com\/Temasek\/status\/1653246130124394496?s=20\" data-v-f87c67ca=\"\">took to Twitter<\/a> today to deny those reports.","“We have seen news articles and a tweet from Array about Temasek’s investment in it. This news is incorrect. Temasek has not invested in Array and we have no relationship with them,” it said in a statement.","Array, which had <a href=\"https:\/\/twitter.com\/Cointelegraph\/status\/1653030545155309574?s=20\" data-v-f87c67ca=\"\">shared coverage<\/a> of the supposed Temasek investment yesterday via its Twitter account, did not immediately respond to a request for comment.","The project <a href=\"https:\/\/arrayfi.io\/\" data-v-f87c67ca=\"\">lists a bevy of top-tier investors<\/a> on its website alongside Temasek, including Binance Labs, the venture arm of the biggest crypto exchange. Binance Labs has also not invested, a spokesperson told The Block.&nbsp;","Temasek was forced to <a href=\"https:\/\/www.theblock.co\/post\/187868\/temasek-writes-down-275-million-investment-in-ftx\" data-v-f87c67ca=\"\">write down its $275 million bet<\/a> on Sam Bankman-Fried’s FTX to zero in November last year, after the crypto exchange and its subsidiaries collapsed in spectacular fashion. The investment firm said at the time that the episode had “demonstrated what we have identified previously — the nascency of the blockchain and crypto industry and the innumerable opportunities as well as significant risks involved.”","The denials from Temasek and Binance Labs come less than two weeks after a similar episode involving OPNX, the crypto exchange founded by Su Zhu and Kyle Davies, the people behind the collapsed hedge fund Three Arrows Capital. After OPNX unveiled a <a href=\"https:\/\/www.theblock.co\/post\/227630\/opnx-investors-revealed-3ac\" data-v-f87c67ca=\"\">list of supposed investors<\/a> in the new endeavor on April 21, several names on the list — including RW and Nascent — were <a href=\"https:\/\/www.theblock.co\/post\/227651\/drw-3ac-investment-vc-venture-capital-opnx\" data-v-f87c67ca=\"\">quick to distance themselves<\/a> from the project entirely.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$275 million","content":"MONEY"},{"type":"Kyle Davies","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 21","content":"DATE"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}