{"summary":"Deutsche Bank Joins Singapore’s Project Guardian Asset Tokenization Project","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/deutsche-bank-joins-singapore-asset-tokenization.htm","publishDate":"2024-05-14T21:22:59","id":16941,"type":null,"title":"Deutsche Bank Joins Singapore’s Project Guardian Asset Tokenization Project","category":["Blockchain News "],"content":["Deutsche Bank, a German multinational investment bank, joined Singapore’s Monetary Authority of Singapore’s (MAS) Project Guardian on asset tokenization Tuesday in a press release.","Project Guardian was launched by MAS in 2022 in an effort to fuel collaboration between MAS and other key players in the financial market.","The project focuses on asset tokenization in wholesale funding markets and decentralized finance (DeFi) applications.","It seeks to explore diverse use cases of asset tokenization, including listing, distribution, trading, settlement, and asset servicing.","The bank’s decision came shortly after publishing a report on stablecoins, raising concerns about the transparency of leading issuers such as Tether.","Tether slammed Deutsche Bank’s claims, stating that the report lacked substantial evidence or concrete data to support them.","Deutsche Bank will test an open architecture and interoperable blockchain platform for servicing tokenized and digital funds as part of the collaboration.","This morning, @DeutscheBank announced participation in @MAS_sg Project Guardian, testing compliant asset tokenization applications.","Institutions participating in Guardian have picked Axelar for interoperability 2 years in a row.","Thoughts on why interop is critical for RWAs 🧵⤵️","— Axelar Network (@axelarnetwork) May 14, 2024","","The bank will also propose protocol standards and determine the best approach to contribute to industry advancement.","Boon-Hiong Chan, Deutsche’s Asia Pacific head of securities and technology, will lead Project Guardian.","The bank will collaborate closely with Memento Blockchain, a software platform that specializes in DeFi and digital asset management.","Deutsche and Memento Blockchain previously worked together on Project DAMA (Digital Assets Management Access) in 2022 and 2023, completing a successful proof-of-concept.","The initiative seeks to realize the potential for a more efficient, secure, and flexible digital fund management and investment servicing solution.","Deutsche intends to build on this foundation with the introduction of DAMA 2. It will employ the development of Interop Labs, the original developer of the Axelar network – a key player in bringing interoperability to tokenization.","In February, Ripple partnered with the Axelar Foundation to enhance interoperability on the XRP Ledger (XRPL) blockchain. Their efforts focused on advancing the tokenization of real-world assets (RWAs).","Over the past year, there has been a considerable rise in real-world asset (RWA) tokenization protocols. This came with massive adoption, growing to over 8 billion dollars in total value locked (TVL).","The RWA narrative unfolds as political parties advocate for regulations to foster a positive environment for cryptocurrency.","This can be seen in the upcoming UK election as the Labor Party promises to continue the Conservative Party’s legislative efforts to make the UK a “global hub for crypto assets technology.”","Investment bank Citi Group estimated that tokenized assets could be worth close to $4 trillion globally by 2030 in a report published in 2023. In the report, they cited a Labour-governed UK as a catalyst.","“A future Labour government will therefore look to make the U.K. a global leader in tokenization by advancing work to clarify the law around tokenization, and working with regulators to establish a proportionate, outcomes-based regulatory regime to oversee the technology,” the report read.","The US is also pushing for crypto in the upcoming election. The Trump administration opposes the current Biden administration’s rigorous regulatory standpoint, which some have interpreted as hostility.","In a Q&A, Trump agreed that many cryptocurrency businesses are leaving the country “because of the hostility.”","“Well, we’ll stop it because I don’t want that… If we’re going to embrace [crypto], we have to let them be,” he said."],"entity":[{"type":"Deutsche","content":"ORGANIZATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"Axelar Foundation","content":"ORGANIZATION"},{"type":"Deutsche Bank’s","content":"ORGANIZATION"},{"type":"$4 trillion","content":"MONEY"},{"type":"U.K.","content":"LOCATION"},{"type":"Memento Blockchain","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"8 billion dollars","content":"MONEY"},{"type":"Conservative Party","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Hiong Chan","content":"PERSON"},{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"Project DAMA (Digital Assets Management Access","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Singapore’s Monetary Authority of Singapore’s (MAS) Project Guardian","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Trump","content":"PERSON"},{"type":"Citi Group","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Asia Pacific","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"Labor Party","content":"ORGANIZATION"}],"hashtag":["German Bank","Monetary Authority of Singapore","Tokenization"],"authors":["Harvey Hunter"]}