{"summary":"CFTC Urges Caution to Job Seekers Amid Rising Money Mule Scams","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cftc-urges-caution-amid-rising-money-mule-scams.htm","publishDate":"2024-05-14T07:16:11","id":16960,"type":null,"title":"CFTC Urges Caution to Job Seekers Amid Rising Money Mule Scams","category":["News "],"content":["The Commodity Futures Trading Commission (CFTC) is warning against “money mule” scams targeting remote job seekers.","On Monday, the regulator said people seeking work-from-home opportunities should be on the lookout for these deceptive schemes.","According to Melanie Devoe, director at the Office of Customer Education and Outreach (OCEO), summer job seekers, drawn to part-time online work, could be especially vulnerable to scams. However, they end up risking jail time as unwitting money mules for criminals, she said.","Criminal organizations are actively recruiting networks of people to launder money, according to the CFTC. They move illegal funds between bank accounts, converting currencies, and using blockchains to avoid law enforcement detection.","The criminals often target unsuspecting people who might not realize they’re involved in a crime. These victims may believe they’re helping a friend, a romantic interest, or simply fulfilling work duties. However, both willing and unwitting participants face the same consequences, which can include criminal charges.","The CFTC cracked down on money mule activity in two recent cases. In one instance, the CFTC accused Debiex of using well-known romance scam tactics to steal $2.3m in customer funds meant for digital asset trading.","Another enforcement action involved a California man and his company. They were charged with running a complex romance scam, also known as a “pig butchering scheme” that defrauded dozens of investors for over $1m.","The CFTC warned potential victims to be wary of two main red flags: “off-ramping” and “on-ramping” crypto-assets. With off-ramping, criminals might send you crypto and ask you to convert it to dollars, moving the cash through your bank account to another, essentially laundering their money.","On the other hand, on-ramping could involve criminals giving you cash to buy crypto (like at a bitcoin kiosk) and then forwarding it to another walle, again, using you to get their money into the crypto system. A third tactic, “smurfing,” involves receiving a large amount of crypto yourself, which could raise suspicion."],"entity":[{"type":"Office of Customer Education","content":"ORGANIZATION"},{"type":"$2.3","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$1m","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Melanie Devoe","content":"PERSON"}],"hashtag":["CFTC","crypto scams"],"authors":["Shalini Nagarajan"]}