{"summary":"The Premier League, one of the largest soccer organizations in the world, is allegedly having conversations with its teams about signing a multi-year deal with Sorare for digital collectibles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180650\/premier-league-weighs-34-7-million-nft-deal-with-sorare-sky-news","publishDate":"2022-10-27T16:40:19","id":1696,"type":null,"title":"Premier League weighs $34.7 million NFT deal with Sorare: Sky News","category":["NFTS"],"content":["&nbsp;","The Premier League, one of the largest soccer organizations in the world, is reportedly having conversations with its teams about signing a multi-year deal with Sorare for digital collectibles.","The deal would include a multi-year contract for static images of players in the form of NFTs. If signed, it would total approximately $34.7 million per year and replace the Premier League’s initial deal with ConsenSys, which had been in the works — but not signed — earlier this year, <a href=\"https:\/\/news.sky.com\/story\/premier-league-lines-up-30m-a-year-digital-tokens-deal-with-sorare-12731686\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sky News first reported<\/a>.","ConsenSys, the blockchain infrastructure provider of Infura and MetaMask, is thought to have tried to renegotiate a lower-priced contract with the Premier League after NFT valuations and volumes dipped this past year.","Sorare was said to have then offered a “more lucrative” contract than the revised ConsenSys proposal, as reported by Sky News.","The Premier League, the UK's top-tier soccer organization with hundreds of millions of avid fans, also is reportedly in discussions with Dapper Labs, another digital collectibles company which started the NBA Top Shots platform.","Sorare is an NFT digital collectibles platform that recently <a href=\"https:\/\/www.theblock.co\/post\/168321\/sorare-partners-with-nba-to-launch-fantasy-basketball-game\" data-v-f87c67ca=\"\">partnered with the NBA<\/a> as well as other sporting leagues. It recently raised $680 million and was valued at over $4 billion.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Sky News","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$34.7 million","content":"MONEY"},{"type":"$680 million","content":"MONEY"},{"type":"Premier League","content":"ORGANIZATION"}],"hashtag":["SORARE"],"authors":["Mike Truppa","The Block"]}