{"summary":"Bitcoin Miners Begin Curtailing Operations After Halving, Data Shows","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-miners-halving.htm","publishDate":"2024-05-13T17:14:27","id":16978,"type":null,"title":"Bitcoin Miners Begin Curtailing Operations After Halving, Data Shows","category":["Bitcoin News "],"content":["Bitcoin mining firms are scaling back the use of their computer fleets after industry revenues crunched substantially last month, according to a May 13 Coinshares report.","After reaching an all-time high last month, the seven-day rolling average for the Bitcoin network hash rate has declined quickly since the beginning of May. Peaking at roughly 650 exahashes per second (EH\/s) on April 19, the metric stood at 586 EH\/s as of May 11.","A “hash” is a guess answer to a complex math problem required to solve and mine Bitcoin’s next block. Bitcoin miners race to solve these blocks using energy-intensive computer systems that specialize in producing hashes as fast as they can.","As such, the total network hash rate can help measure how much energy miners devote to their operations.","Miners are beginning to turn off unprofitable rigs","We write about it here in detailhttps:\/\/t.co\/8tSQKDY5lk pic.twitter.com\/498SvO01Bz","— James Butterfill (@jbutterfill) May 13, 2024","","While hash rate ordinarily trends upward over time, events impacting miner profitability can cause industry operations to scale back. One of those occurred on April 19 in the form of the Bitcoin halving, which reduced the fixed subsidy attached to each Bitcoin block from 6.25 BTC to 3125 BTC – a nearly 50% reduction in net miner revenue.","Based on their Q4 2023 reporting figures, CoinShares estimates that publicly listed Bitcoin miners’ average BTC production cost was $53,000 per coin immediately after the halving. With BTC trading at $63,000 on Monday, this suggests that miners are still profitable – albeit far less than before.","“Key mitigation strategies include optimizing energy costs, increasing mining efficiency, and securing favorable hardware procurement terms,” wrote CoinShares. “Miners are actively managing financial liabilities, with some using excess cash to reduce debt significantly.”","Reporting figures from public miners in April showed that most had experienced small but manageable Bitcoin revenue drops in April, which will likely fall even more by the end of May.","Some firms, such as Marathon Digital (MARA) and Riot Platforms (RIOT), reported halving mined with roughly one-third of their energized hash rate, suggesting curtailment activities have already begun.","Thankfully for miners, new Bitcoin applications like Ordinals and Runes have helped increase on-chain activity and network transaction fees, from which they also derive profit.","Last week, CryptoQuant CEO Ki Young Ju said transaction fees now accounted for 7% of miner revenue, up from 1% two years ago."],"entity":[{"type":"May 13","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"James Butterfill","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$63,000","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"April 19","content":"DATE"},{"type":"$53,000","content":"MONEY"},{"type":"CryptoQuant CEO Ki Young Ju","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"May 13, 2024","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"May 11","content":"DATE"}],"hashtag":["Bitcoin halving","Bitcoin Mining"],"authors":["Andrew Throuvalas"]}