{"summary":"PayPal Says NFT Purchases No Longer Backed By Its Protection Program","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/paypal-says-nft-purchases-no-longer-backed-its-protection-program.htm","publishDate":"2024-04-17T08:39:56","id":16987,"type":null,"title":"PayPal Says NFT Purchases No Longer Backed By Its Protection Program","category":["Blockchain News "],"content":["Payments giant PayPal plans to remove non-fungible token (NFT) purchases from its purchase protection program from May 20.","In an online announcement, PayPal said amendments to its protection program will exclude NFTs and any payments that you initiated via a third-party platform using the PayPal Balance.","We are revising PayPal’s Seller Protection Program to exclude from eligibility Non-Fungible Tokens (NFTs) with a transaction amount of: $10,000.01 USD or above (or equivalent value in local currency as calculated at the time of the transaction); $10,000.00 USD or below (or equivalent value in local currency as calculated at the time of the transaction), unless the buyer claims it was an Unauthorized Transaction and the transaction meets all other eligibility requirements. [PayPal]","Over the years, PayPal has been exploring ways to integrate NFTs into its platform, allowing users to buy, sell, and hold NFTs directly through their PayPal accounts. This move signified PayPal’s recognition of the growing interest in NFTs and its willingness to cater to this emerging market.","On Monday, NFT sales volume was down 24% over the last 24 hours, standing at $35,628,790. While the number of sellers is down 1%, buyers and transactions are up 3% and 9%, respectively, according to CryptoSlam. Half of the top 10 collections by sales were up. Among these green coins, Bored Ape Yacht Club’s sales increased the most.","In 2021, buyers were willing to part with millions on digital collectables for NFTs offered by artists and luxury brands. It seems the chatter and hype around NFTs has faded into the background.","In January, GameStop revealed it had shut down its NFT marketplace, signalling its withdrawal from the cryptocurrency space. The announcement was made via a statement on the platform with the firm stating “the continuing regulatory uncertainty of the crypto space” as the primary reason behind this decision.","Trading of NFTs has been in decline for over a year. Data compiled by Statista shows the number of active wallets involved in NFT trading has declined.","The NFT bear market continues which can be linked to the crypto market which has been stagnant. Is it game ove for NFTs? Or will the digital collectible make a comeback?","In 2023 PayPal launched its native dollar-pegged Stablecoin “PYUSD” which is backed by cash and short-term treasuries. Recently the Silicon Valley-based company announced the new feature powered by its money transfer platform Xoom. The service was made available to U.S. users starting from April 4."],"entity":[{"type":"$35,628,790","content":"MONEY"},{"type":"PayPal’s Seller Protection Program","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Xoom","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"PayPal Balance","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"24%","content":"PERCENT"},{"type":"$10,000.00","content":"MONEY"},{"type":"$10,000.01","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"May 20","content":"DATE"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["NFTs","PayPal","Policy"],"authors":["Tanzeel Akhtar"]}