{"summary":"Pudgy Penguins Partners with Unstoppable Domains to Launch ‘.pudgy’ Domain Names","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pudgy-penguins-partners-with-unstoppable-domains-to-launch-pudgy-domain-names.htm","publishDate":"2024-02-23T12:10:36","id":16989,"type":null,"title":"Pudgy Penguins Partners with Unstoppable Domains to Launch ‘.pudgy’ Domain Names","category":["NFT News "],"content":["Blue-chip NFT collection Pudgy Penguins has partnered with Unstoppable Domains to introduce “.pudgy” domain names. ","The collaboration, announced on February 23, allows customers of Unstoppable Domains to purchase top-level domain names ending in “.pudgy,” which can be associated with Pudgy Penguin NFTs. ","The integration introduces numerous possibilities for domain holders, including the ability to send and receive web3 messages, make crypto payments between domain addresses, and collect exclusive utility badges through the new domains.","“We are thrilled to welcome Pudgy Penguins, a true innovator and a strong brand, into the Unstoppable Domains family,” said Sandy Carter, COO at Unstoppable Domains. ","“This partnership is not just about adding another domain; it’s about embracing a community that embodies the spirit of Web3 and the future of digital identity.”","Unstoppable Domains has also launched the Pudgy Ambassador Program and the Pudgy Storytelling Campaign in order to further engage the community.","The Ambassador Program aims to select ambassadors from Pudgy’s prominent community members who will promote the use of “.pudgy” domain names and receive special Pudgy Ambassador badges. ","We are excited to announce our collaboration with Pudgy Penguins and rolling out the \".pudgy\" domain extension for their community! But how does it benefit holders? 👀 pic.twitter.com\/XtXxVYfzJg","— matt.crypto | matt.pudgy (@matthewegould) February 23, 2024","","Meanwhile, the Storytelling Campaign encourages users to create and share Pudgy-related content on social media. ","Each month, Unstoppable Domains will choose community Storytellers to showcase on its website, with winners receiving multiple “.pudgy” domains free of charge.","Unstoppable Domains is well-known for providing easily readable domain names that can be linked to wallet addresses, enabling users to consolidate their digital identity across the web3 ecosystem. ","Instead of relying on complex alphanumeric strings for crypto wallet addresses, individuals can associate their wallets with simple domain addresses ending in web3-centric extensions such as “.crypto,” “.eth,” or now, “.pudgy.”","With the addition of “.pudgy” domains, Unstoppable Domains expands its partner portfolio to include the tenth top-level domain.","The announcement comes on the heels of a successful month for Pudgy Penguins. ","The collection experienced a surge in popularity, briefly surpassing the renowned Bored Ape Yacht Club (BAYC) in terms of floor price, according to NftPriceFloor. ","Presently, the floor price for Pudgy Penguins stands at 19 ETH, marking a 25% increase since the beginning of February. ","In USD, the collection is trading at $56,540 after a remarkable 66% rally. ","With a market cap of $504 million, Pudgy Penguins currently holds the third position, trailing only CryptoPunks with $1.6 billion and BAYC with $651.7 million.","Moreover, Pudgy Penguins recently announced an expansion of its collectible toy line across 1,100 new Walmart locations, bringing the total number of stores carrying Pudgy toys to 3,100. ","Yesterday’s @pudgypenguins haul from @Walmart! Go to a local store to support if they have them in stock. Add some toys to your collection. Give a gift to a friend. Let’s bring Web3 to the masses with fun and cute IP. For the culture. 🫡 pic.twitter.com\/uaT3MHkkZA","— STMcFly (@ST_McFly) February 21, 2024","","Alongside this expansion, the project unveiled 30 new toy designs. ","Notably, these toys will feature QR codes that allow buyers to unlock digital traits and collectibles within Pudgy World, the project’s ZkSync Era-based open-world game.","Furthermore, Pudgy holders whose NFTs are depicted as toys sold in-store will earn royalties from sales through the OverpassIP platform, which simplifies the licensing process and adds real-world utility and value for Pudgy holders."],"entity":[{"type":"Pudgy Penguins","content":"PERSON"},{"type":"$504 million","content":"MONEY"},{"type":"February 23","content":"DATE"},{"type":"Storytelling Campaign","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.6 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$56,540","content":"MONEY"},{"type":"66%","content":"PERCENT"},{"type":"Pudgy World","content":"LOCATION"},{"type":"$651.7 million","content":"MONEY"},{"type":"February 21, 2024","content":"DATE"},{"type":"NftPriceFloor","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 23, 2024","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Pudgy Penguin NFTs","content":"ORGANIZATION"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"}],"hashtag":["NFT","Pudgy Penguins"],"authors":["Ruholamin Haqshanas"]}