{"summary":"Donald Trump’s Bitcoin Ordinals NFT Collection Sparks Controversy","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/donald-trump-unique-nft-collection-sparks-controversy-in-crypto-community.htm","publishDate":"2024-01-19T11:44:14","id":16984,"type":null,"title":"Donald Trump’s Bitcoin Ordinals NFT Collection Sparks Controversy","category":["Altcoin News "],"content":["Former U.S. President Donald Trump has launched yet another series of digital collectibles, sparking controversy in the cryptocurrency community.","Trump’s latest creation is hosted on the Bitcoin (BTC) blockchain but has a unique twist.","What sets these digital collectibles apart is that they cannot be traded on their owners until December 2024. This limitation has left many enthusiasts scratching their heads.","In a recent post on X, the official Trump Cards account said collectors who are willing to invest $99 for 100 of the “mugshot edition” NFTs, which were issued on the Polygon blockchain in December, will also receive a unique digital card, known as an “ordinal,” on the Bitcoin blockchain.","Trump’s announcement on social media touted these as “The First Ever Trump Trading Cards officially created on the Bitcoin Blockchain!”","TRUMP DIGITAL TRADING CARDS on BITCOIN ORDINALS 🟧 The FIRST EVER Trump Trading Cards on Bitcoin. Read this thread ⬇️","— CollectTrumpCards (@CollectTrump) January 18, 2024","","However, the announcement thread featured grammatical errors and non-standard capitalization, drawing further attention to the venture.","The catch is that only 200 of these “one of one” Ordinals will be minted.","This limitation, supposedly aimed at preventing them from being seen as “investment vehicles,” has paradoxically diminished their appeal as NFTs in the eyes of potential buyers.","As reported, the former president released the NFT collection, dubbed “Trump Cards,” in December 2022.","The NFT collection features a series of digital “cards” depicting Trump in various iconic poses and situations, which include Trump as a muscle-bound wrestling champion, Trump holding a basketball, and even Trump in space.","Donald Trumps in 2021: Crypto is dangerous. It can be an explosion like we have never seen before.","Donald Trump in 2022: I'm doing my first official NFT collection. pic.twitter.com\/lHRxWUYNqw","— Altcoin Daily (@AltcoinDailyio) December 15, 2022","","According to data from OpenSea, the series of NFTs has generated over $26 million in trading volume.","Trump launched his second series of Trump Trading Cards in August last year, which also sold out immediately after release.","The second collection featured 47,000 tokens, each with a price tag of $99, this time with limited one-of-one NFTs and autographed cards.\nSpeculation surrounding the ownership of the NFT projects has been rampant since its initial release.","On the official Trump Trading Cards website, it says that CIC Digital LLC allowed NFT INT LLC, the company behind the NFT project, to use Trump’s likeness, name, and image under a paid licensing agreement.","The project’s website also claims that funds raised from the NFTs won’t be used for Donald Trump’s presidential campaign.","In an April filing, Trump revealed that he has raked in up to $1 million from the sales of his digital trading cards.","The filing was part of his personal financial disclosure with the Federal Election Commission, which also showed that the American politician earned millions from speaking engagements.","According to the filing, Trump holds the position of “manager, president, secretary and treasurer” at CIC Digital LLC and CIC Ventures LLC."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"FIRST EVER Trump Trading Cards","content":"ORGANIZATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"$26 million","content":"MONEY"},{"type":"$99","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"CIC Digital LLC","content":"ORGANIZATION"},{"type":"Federal Election Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Trump Cards","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Trump Trading Cards","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"January 18, 2024","content":"DATE"},{"type":"August last year","content":"DATE"},{"type":"Donald Trump","content":"PERSON"},{"type":"December 2024","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"First Ever Trump Trading Cards","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Trump","content":"PERSON"},{"type":"NFT INT LLC","content":"ORGANIZATION"},{"type":"December 15, 2022","content":"DATE"},{"type":"CIC Ventures LLC","content":"ORGANIZATION"}],"hashtag":["Donald Trump","NFTs"],"authors":["Ruholamin Haqshanas"]}