{"summary":"Securities and Exchange Commission staff believe Binance.US is operating an unregistered securities exchange in the United States, a lawyer for the commission said on Friday.\nThe staff belief does not represent the position of the SEC.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217075\/sec-staff-believe-binance-us-is-operating-an-unregistered-securities-exchange","publishDate":"2023-03-03T18:27:59","id":1698,"type":null,"title":"SEC staff believe Binance.US is operating an unregistered securities exchange","category":["Bankruptcy"],"content":["Securities and Exchange Commission staff believe Binance.US is operating an unregistered securities exchange in the United States, a lawyer said during a Voyager Digital bankruptcy hearing on Friday evening.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","SEC lawyer William Uptegrove also raised concerns that the offering and sale of Voyager’s VGX token have the attributes of a securities transaction.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The commission has not made any determination on either of these issues and the staff beliefs do not represent the position of the commission,” Uptegrove said during a hearing in the U.S. Bankruptcy Court for the Southern District of New York. Commissioners vote on enforcement actions based on recommendations provided by staff.&nbsp;","The comments come as the SEC ramps up its crypto enforcement activity, including settling with crypto exchange Kraken over its staking service last month and proposing tighter rules for crypto custodians. Representatives for Binance and Binance.US did not immediately comment.","Judge Michael Wiles is weighing whether to approve the proposed sale of Voyager assets to Binance.US. The SEC has objected to the sale, and has faced pushback from Wiles on Thursday for offering limited evidence to back up the objection.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The commission’s lawyer asked the judge to meet behind closed doors on Friday evening, citing “statutory restrictions on our ability to share nonpublic information.” After a brief private conversation between the judge, the SEC, the Voyager debtors and lawyers for Binance.US, the judge pressed the commission to make its statements in public.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“This is a public court proceeding,” Wiles said. “Anything that further explains the basis for the SEC’s position, that seems to me is something everybody's entitled to hear.”","The commission's enforcement investigations are nonpublic, Uptegrove replied, calling the matter a \"complicated, complicated situation.\"","After the SEC lawyer clarified that staff believes Binance is operating an unregistered securities exchange, Wiles said he still did not have “very much clarity” because the commission did not take an official position. Over the last two days, witnesses have testified on the proposed sale for more than 13 hours."],"hashtag":[]}