{"summary":"The UST crisis is causing billions of Luna to be minted — and it may not ease up any time soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146532\/billions-of-luna-minted-as-supply-grows-20-fold-in-four-days","publishDate":"2022-05-12T08:06:47","id":1699,"type":null,"title":"Billions of Luna minted as supply grows 20-fold in four days","category":["CRYPTOCURRENCY"],"content":["The supply of Luna (LUNA) has increased by more than 20 times over the last few days, as the effect of TerraUSD (UST) <a href=\"https:\/\/www.theblockcrypto.com\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">losing its peg<\/a> to the US dollar continues to take its toll.","This massive supply increase has accelerated the fall in Luna’s price, which is down 99% in the last two days. And if the price of Luna continues to fall, its supply will also continue to increase.&nbsp;","To understand what is going on, we need to know the relationship between Luna and UST.","Luna is the token used to help UST meet its peg with the dollar. If the price of UST goes above a dollar, $1 of Luna can be burned and redeemed for 1 UST, a factor that helped push Luna’s price up during its epic rally earlier this year. Yet there’s a counterweight: if the price of UST falls the peg, traders can swap 1 UST for $1 worth of Luna.","At present, the value of UST is way below its peg, trading at just $0.57 as of 8:05 a.m. ET on Thursday. As a result, rather than sell on the market, UST holders are trying to cash out through Luna, using the mechanism designed to keep the peg in place. When this happens, more Luna is minted in response to the amount of UST being burned.","When Luna’s price was much higher, say $100, if you redeemed 1 UST for $1 worth of Luna, you would only get 0.01 LUNA. As a result, such swaps wouldn’t have increased Luna’s supply by very much.","Yet now Luna’s price is much lower and large holders are cashing out, it’s causing a big increase in Luna’s supply. At Luna’s current price of $0.10, swapping 1 UST gets you 10 LUNA. So if someone wants to swap a large amount, say 100,000 UST, that would lead to the minting of 1 million LUNA.","This has led to a downward spiral. As holders redeem UST for Luna, they increase the supply of Luna and likely sell these tokens on the market. This puts the price of Luna down even further, meaning the next person to redeem their UST creates even more Luna — putting an even greater downward force on the market.","It has also led to an exponential increase in the supply of Luna. On Wednesday the supply of Luna increased from 386 million to 1.5 billion — up by 1.2 billion. So far today, the supply has already increased to 7.1 billion — up a further 5.5 billion.","<span data-v-f87c67ca=\"\">The supply of Luna has increased by 5.5 billion in just a few days. Image: The Block Research.<\/span>","At the same time as this huge supply increase, the price keeps driving lower.","On May 10, the price fell 64%. On May 11, it fell a further 95%. So far today, it has slid a further 90%. The coin now trades at a fraction of a fraction of what it was worth just a few days ago.","<span data-v-f87c67ca=\"\">The price of Luna keeps collapsing under large selling pressure. Image: TradingView.<\/span>","Currently Terraform Labs is <a href=\"https:\/\/www.theblockcrypto.com\/post\/146499\/terra-outlines-stablecoin-support-measures-as-luna-slides-below-10-cents\" data-v-f87c67ca=\"\">backing a few proposals<\/a> to try to rescue the ecosystem. One would increase the amount of UST that can be swapped for Luna per day by four times. This would increase how quickly the supply of Luna could be expanding — making the situation even worse for the Luna price. The <a href=\"https:\/\/www.theblockcrypto.com\/post\/146254\/terraform-labs-ceo-do-kwon-unveils-plan-to-restore-ust-peg\" data-v-f87c67ca=\"\">theory is that<\/a> rescuing the UST peg would be the fastest way to redeem the situation, even though it would impact Luna.","Terraform Labs is also pushing forward proposals that would see it burn 1.39 billion UST held in community and incentive pools. The idea is that this may reduce pressure on the system.","At the same time as this is happening, many Luna holders are <a href=\"https:\/\/www.theblockcrypto.com\/post\/146279\/as-luna-holders-watch-the-token-slide-many-wont-be-able-to-cash-out-for-weeks\" data-v-f87c67ca=\"\">watching their tokens<\/a> lose more than 99% of their value — and can't do anything about it. This is because many had staked their coins, a way of locking them up to receive rewards. The current unstaking period is 21 days, so stakers had no way of selling their coins unless they had already moved to unstake them three weeks before this crash.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Luna","content":"LOCATION"},{"type":"64%","content":"PERCENT"},{"type":"99%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"95%","content":"PERCENT"},{"type":"Luna","content":"ORGANIZATION"},{"type":"$0.57","content":"MONEY"},{"type":"8:05 a.m.","content":"TIME"},{"type":"Luna (LUNA","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$0.10","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$100","content":"MONEY"},{"type":"1.5 billion","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"},{"type":"May 11","content":"DATE"}],"hashtag":["CRYPTO","DO KWON"],"authors":["Tim Copeland","The Block"]}