{"summary":"Bitcoin&#x27;s March all-time high saw a spike in profit-taking by long-term holders, but this activity has since begun to tapering off.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287353\/bitcoin-long-term-holder-begin-to-ease-off-profit-taking-glassnode","publishDate":"2024-04-09T12:23:13","id":17,"type":null,"title":"Bitcoin long-term holders begin to ease off profit-taking: Glassnode","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.36%\n    <\/span><\/a> <!----><\/span><\/span>'s March all-time high saw a spike in profit-taking by long-term holders, but this activity has since begun to taper off, a Glassnode report said.<\/span>","\"Profit-taking, typically by long-term holders, tends to ramp up around all-time high breaks, but is cooling down in recent weeks,\" Tuesday's Glassnode Insights <a href=\"https:\/\/insights.glassnode.com\/the-week-onchain-week-15-2024\" data-v-f87c67ca=\"\">report<\/a> said.","According to the report, the balance of assets between long-term bitcoin holders and new demand suggests the current market is in the early stages of a euphoria, or price discovery, phase. However, the Glassnode analysis noted that previous euphoria phases have experienced numerous price drawdowns exceeding 10%, with the majority being much deeper, with 25% plus price corrections being commonplace.","\"There has been just two around 10% plus price corrections since the bitcoin all-time high was broken in March,\" the report added.","The upcoming bitcoin halving is a significant driver of market speculation at the moment. According to VeChain Founder Sunny Lu, the evolving impact of regulation will affect bitcoin's trajectory after the upcoming halving event. \"If we compare this cycle to the previous one, the impact of regulation becomes evident,\" Lu said in an email sent to The Block.","He said that regulatory-related actions have also driven the pivotal price moments since the last halving in May 2020. Lu described how the bitcoin price had reached multiple former all-time highs following the previous halving in May 2020, with three significant price peaks occurring after the <a href=\"https:\/\/www.theblock.co\/post\/286978\/coinbase-and-microstrategy-stocks-surge-as-bitcoin-break-above-72000\" data-v-f87c67ca=\"\">Coinbase<\/a> IPO in April 2021, the approval of bitcoin futures ETFs in November of the same year, and the third in March of this year, catalyzed by the approval of <a href=\"https:\/\/www.theblock.co\/post\/285564\/spot-bitcoin-etf-inflows-good-friday\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a>.","\"This was the first cycle that saw multiple all-time highs post-halving, triggered by regulatory progress in addition to the psychological impact the halving innately has on the entire market,\" Lu added.","The VeChain founder said there is now a shift in focus from the traditional understanding of the halving's impact solely based on supply dynamics to a broader consideration of macroeconomic factors. \"It’s becoming less about the mathematics of the halving, which by nature causes an increase in prices due to a smaller supply, and more about the impact of macro forces.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 2020","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"+1.36%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"VeChain Founder Sunny Lu","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"March of this year","content":"DATE"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}