{"summary":"Indonesian College Student Behind NFT Selfies Success Returns with $1.8 Million Meme Coin Presale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/indonesian-college-student-behind-nft-selfies-success-returns-with-1-8-million-meme-coin-presale.htm","publishDate":"2024-03-25T13:46:29","id":17000,"type":null,"title":"Indonesian College Student Behind NFT Selfies Success Returns with $1.8 Million Meme Coin Presale","category":["Altcoin News "],"content":["Sultan Gustaf Al Ghozali, the Indonesian college student who became an internet sensation in 2022 for selling millions of dollars worth of NFTs featuring his daily selfies, is back in the spotlight with a meme coin presale.","Ghozali announced the second edition of “Ghozali Everyday” on March 224th. This project uniquely blends meme coins with NFTs on the Base blockchain. The project’s presale surpassed its initial target of 400 Ether (ETH), reaching 527 ETH.","","Uploading my photo into nft lolhttps:\/\/t.co\/E3Q4sBmN26#NFT #opensea pic.twitter.com\/rD51rdcpzp","— Ghozali (@Ghozali_Ghozalu) January 10, 2022","","In January 2022, Sultan Gustaf Al Ghozali, a 22-year-old computer science student from Semarang, Indonesia, made waves in the crypto world by minting nonfungible tokens (NFTs) featuring daily selfies he took over five years. He captured nearly 1,000 self-portraits that chronicled his journey from 18 to 22.","These selfies, taken as a personal reflection on his academic journey, depicted him sitting or standing in front of his computer in various poses. This collection, named “Ghozali Everyday,” quickly gained traction within the crypto community, earning Ghozali, a student at the time, more than $1 million.","Just took the last selfie when I graduated from college and finally i can stop this doing this shit almost every day","6 years taking selfies every day is the stupidest idea I ever came up with, but luckily I can make money from it pic.twitter.com\/qftRH6WRua","— Ghozali (@Ghozali_Ghozalu) August 24, 2023","","Reflecting on his success, Ghozali expressed gratitude for the support and opportunity to turn a personal project into a profitable venture. He announced on X that with his graduation, he would no longer continue the daily selfie tradition, marking the end of an era that unexpectedly brought him financial success and recognition in the NFT space.","On March 22, after being absent from X for several months, Ghozali returned amidst the rising interest in meme coins. He made a significant announcement about the second iteration of his project, “Ghozali Everyday,” which now combined meme coins and NFTs in an ERC-404 format on the Base blockchain. To kick things off, he initiated an airdrop for the holders of the first Ghozali Everyday NFTs.","TuRn On NOtIfIcaTioN, Drop sOmE NeWs SoOn 🛎️ pic.twitter.com\/7zJ7BIrA2j","— Ghozali (@Ghozali_Ghozalu) March 22, 2024","","Following this, on March 24, Ghozali unveiled the launch of the second part of “Ghozali Everyday.” He disclosed the presale address with an intended cap set at 400 ETH. However, the presale quickly exceeded this limit, reaching 527 ETH, equivalent to around $1.8 million at the time of writing.","launching the second part of Ghozali Everyday: a memecoin and nft hybrid on Base 🛜","PRESALE is open, send eth to 0x4553555f6a451EC415f698A524B5e02E38acFB6C (eth mainnet\/base only) 🙏🏻","min 0.05 ETH 👈🏻\nmax 2 ETH ✅\ncap 400 ETH 🛎\n100% of ETH raised goes to LP 🛜","Ghozali 404 🙆🏻‍♂️… pic.twitter.com\/HYAfHkh1z3","— Ghozali (@Ghozali_Ghozalu) March 24, 2024","","Despite the overwhelming response, Ghozali took to X to announce that he would refund those who sent more than 2 ETH after the cap was reached. He also clarified that the cap would not increase, ensuring fairness and transparency in the project’s execution.","Amidst the recent bullish run of Bitcoin (BTC) prices, there has been a resurgence of interest in meme coins, mainly driven by traders on the Solana blockchain. Notably, data indicates that presale projects on Solana raised an astounding $100 million within just three days, from March 15 to 18.","This surge in funding reflects a trend where meme coin founders are leveraging token presales to raise significant amounts for unreleased coins. The presale mechanism typically involves investors sending cryptocurrency to a specified wallet address in exchange for the distribution of tokens once the coin is officially launched. Nevertheless, there’s no guarantee of receiving tokens in return, making presales susceptible to fraud and scams.","The recent frenzy surrounding meme coin presales peaked with the launch of Book of Meme on March 14. Created by the pseudonymous artist Darkfarms1, the coin initially held a valuation of approximately $4 million but skyrocketed by an astonishing 36,000% within just 56 hours, reaching a peak market capitalization of $1.45 billion.","While the profitability of meme coins has captivated the crypto space, concerns about the presale model and its associated risks surfaced."],"entity":[{"type":"January 10, 2022","content":"DATE"},{"type":"Semarang","content":"LOCATION"},{"type":"January 2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Indonesia","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"March 24","content":"DATE"},{"type":"March 22","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"LP","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"36,000%","content":"PERCENT"},{"type":"March 15","content":"DATE"},{"type":"March 14","content":"DATE"},{"type":"March 22, 2024","content":"DATE"},{"type":"March 24, 2024","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Ghozali Everyday","content":"ORGANIZATION"},{"type":"Ghozali","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$1.45 billion","content":"MONEY"},{"type":"March 224th","content":"DATE"},{"type":"August 24, 2023","content":"DATE"},{"type":"Sultan Gustaf Al Ghozali","content":"PERSON"}],"hashtag":["Base","Memecoin","NFT"],"authors":["Hassan Shittu"]}