{"summary":"Rare Alien CryptoPunk NFT Sells For Record Breaking $12.38 Million ETH","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/rare-alien-cryptopunk-nft-sells-for-record-breaking-12-38-million-eth.htm","publishDate":"2024-04-26T15:59:16","id":17007,"type":null,"title":"Rare Alien CryptoPunk NFT Sells For Record Breaking $12.38 Million ETH","category":["Ethereum News "],"content":["NFT art collection CryptoPunks has sold another record-breaking piece entitled CryptoPunk 635 on the Ethereum blockchain for $12.38 Million ETH, the collection announced Thursday in a statement to X.","As one of only nine alien punks, CryptoPunk 635 is an ultra-rare entity. It was sold as the fourth highest-value piece in the entire collection.","According to Thursday’s statement, the piece was previously owned by CryptoPunk’s parent company, Larva Labs, and last sold by the Christie’s Contemporary Art Evening Sale in May 2021. ","The deal between the NFT collection and the new owner of CryptoPunk 635, who has chosen to stay anonymous, was facilitated by high-value NFT broker, Fountain.","CryptoPunk 635, the Alien originally owned by Larva Labs and sold at the Christie’s Contemporary Art Evening Sale in May 2021, has just been acquired by an anonymous collector in a deal brokered by Fountain. We’re honored to have played a small role in this sale. Congratulations… pic.twitter.com\/glisy3MZpv","— Fountain (@Fountainxyz) April 25, 2024","","“We’re honored to have played a small role in this sale,” the NFT project said in Thursday’s statement. “Congratulations to the seller and the new owner!”","Launched in 2017 by Canadian software developers Matt Hall and John Watkinson, CryptoPunks is a collection of an estimated 10,000 uniquely generated digital depictions inspired by the cyberpunk movement. ","The project’s website states, “No two are exactly alike, and each one can be trustlessly collected by anyone interacting with the Ethereum blockchain.”","While most of the project’s collectibles are depicted as human, a few select limited edition pieces are in circulation that represent zombies, apes, and aliens.","Other digital artworks culpable to CryptoPunk 635 sold by the project have retailed for as high as $23.7 million.","Just last month, another anonymous buyer purchased an alien CryptoPunk for $16.03 million, the second-highest recorded transaction in the project’s history.","In March 2022, CryptoPunks was acquired by the wildly successful NFT collection Bored Ape Yacht Club (BAYC)’s parent company, Yuga Labs, for an undisclosed amount.","“We’ve long admired CryptoPunks, and the work of the project’s founders, Matt & John,” Yuga Labs said in a post to X shortly following the announcement. “They’ve pushed NFTs and the broader crypto world forward, and we’re honored to carry the brands they’ve built into the future we’re building at Yuga.”","Some big news to share today: Yuga has acquired the CryptoPunks and Meebits collections from @LarvaLabs, and the first thing we’re doing is giving full commercial rights to the NFT holders. Just like we did for BAYC and MAYC owners. pic.twitter.com\/lAIKKvoEDj","— Yuga Labs (@yugalabs) March 11, 2022","","Those who missed out on the NFT project’s latest sale need not fret: CryptoPunk 5905, a similar alien punk, is currently on the market for $15.64 million.","Despite NFT art monthly sale prices trending downward in recent years, the sale of CryptoPunk 635 and others may signify staying power for NFTs throughout the art industry."],"entity":[{"type":"Christie’s Contemporary Art Evening Sale","content":"ORGANIZATION"},{"type":"March 11, 2022","content":"DATE"},{"type":"Yuga Labs","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"April 25, 2024","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Fountain","content":"ORGANIZATION"},{"type":"5905","content":"DATE"},{"type":"$16.03 million","content":"MONEY"},{"type":"$23.7 million","content":"MONEY"},{"type":"March 2022","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"” Yuga Labs","content":"ORGANIZATION"},{"type":"Matt & John","content":"PERSON"},{"type":"$15.64 million","content":"MONEY"},{"type":"$12.38 Million","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"CryptoPunk 635","content":"ORGANIZATION"},{"type":"Matt Hall","content":"PERSON"},{"type":"John Watkinson","content":"PERSON"}],"hashtag":["CryptoPunks","Non-fungible tokens","Yuga Labs"],"authors":["Julia Smith"]}