{"summary":"Best Crypto to Buy Now May 14 – SLOTH, DOGEVERSE, WAI","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/best-crypto-to-buy-now-may-14-sloth-dogeverse-wai.htm","publishDate":"2024-05-14T18:31:57","id":17005,"type":null,"title":"Best Crypto to Buy Now May 14 – SLOTH, DOGEVERSE, WAI","category":["Industry Talk "],"content":["Crypto markets were in a sea of red on Tuesday in the wake of US PPI inflation data and comments from Fed Chair Jerome Powell, with investors struggling to pick which crypto to buy now.","The only top 100 crypto in the green in the past 24 hours is Pepe, which just hit record highs.","Iconic GameStop investor Roaring Kitty, a key figure in the 2021 meme stock craze, returned to social media on Monday.","And his return triggered a spike in speculative trading activity, with the likes of GME, AMC and meme coins pumping.","Aside from Pepe, that pump has now reversed for most meme coins.","Dogecoin (DOGE) and Shiba Inu (SHIB) were last down 3-5% in 24 hours, as per CoinMarketCap.","Bitcoin (BTC), meanwhile, was last down around 2% in the mid-$61,000s.","Spikes in meme coin risk appetite are often viewed as a short-term bearish sign for the broader market.","Macro strategist Otavio Costa pointed out that the latest spike in GameStop could indicate an impending spike in inflation expectations.","Meme stocks vs. inflation expectations pic.twitter.com\/hLDh0zr8w2","— Otavio (Tavi) Costa (@TaviCosta) May 14, 2024","","A spike in inflation expectations would presumably force the Fed to raise interest rates, as happened in 2021\/2022.","That said, Fed’s Powell reiterated on Tuesday that he doesn’t expect the Fed’s next move to be a rate hike.","He added that he expected inflation to move lower again but isn’t as confident about inflation as before.","Fed’s Powell: We Did Not Expect A Smooth Road On Inflation, Must Be Patient And Let Policy Do Its Work\n– We Expect Continued GDP Growth 2% Or Better, Labor Market To Continue To Rebalance But Remain Strong\n– Expect Inflation To Move Down Back To Levels More Like Last Year\n-…","— LiveSquawk (@LiveSquawk) May 14, 2024","","His remarks come after the release of hotter-than-expected PPI data and one day ahead of the release of CPI data.","Powell’s remarks and the latest PPI data appear to have weighed on sentiment in the broader market.","❖ U.S PPI (MOM) (APR) ACTUAL: 0.5% VS 0.2% PREVIOUS; EST 0.3%","❖ U.S PPI (YOY) (APR) ACTUAL: 2.2% VS 2.1% PREVIOUS; EST 2.2%","❖ U.S CORE PPI (MOM) (APR) ACTUAL: 0.5% VS 0.2% PREVIOUS; EST 0.2%","❖ U.S CORE PPI (YOY) (APR) ACTUAL: 2.4% VS 2.4% PREVIOUS; EST 2.4%","— *Walter Bloomberg (@DeItaone) May 14, 2024","","Bitcoin is still trading well within recent ranges, while Ether (ETH) is threatening a break below $2,850 support.","With so many cryptos in the red, investors might be struggling to find the best crypto to buy today. Here are a few candidates that analysts at Cryptonews are big fans of.","","A new Solana meme coin, Slothana (SLOTH), has witnessed a major surge in price since its launch earlier this month. The sloth-themed meme coin has experienced a remarkable 550% increase since May 1 and boasts a market cap approaching $90 million.","🚀🦥 It's LAMBO TIME for the $SLOTH community! Let's take a look back at the past 7 days as $SLOTH presale buyers make 300% gains. 📈","💥 100m $SLOTH Tokens Burnt, totaling 5% of supply and $3m\n🔒 Liquidity locked with Streamflow Finance\n🔄 Organic listings on multiple… pic.twitter.com\/1PyFCzzSSW","— Slothana (@SlothanaCoin) May 13, 2024","","Slothana’s goal is to dethrone its predecessor, Slerf (SLERF), another sloth-themed meme coin that once held a market cap of nearly $500 million but has since dwindled to $127 million.","With a resurgence in meme coin interest, Slothana’s potential to become a multi-billion dollar asset is attracting those searching for the best crypto to buy today.","Dogeverse, a new meme coin with unique cross-chain capabilities, is generating considerable excitement in the market. Dogeverse seeks to be the multi-chain equivalent of the original meme coin, Dogecoin, launching on six of the most popular blockchains (excluding Bitcoin).","Why limit to one when you can have it all? $DOGEVERSE begins on the secure #Ethereum network, ensuring robust security and reliability. 🛡️💻","🔥 Bridging gaps between #Cryptocurrency ecosystems, we enhance liquidity, utility, and fun across the entire #Cryptoverse! 🎉#AltSeason pic.twitter.com\/zOg8albhry","— DogeVerse (@The_DogeVerse) May 3, 2024","","Recognizing the fierce competition among blockchains vying to become the leading platform for meme coin launches, Dogeverse distinguishes itself by establishing a presence on all major chains. Its cross-chain bridge capabilities further enhance its appeal, making it a “Doge with superpowers.”","Currently in presale, Dogeverse has raised over $15 million, positioning itself as a strong contender for the best crypto to buy now. Interested investors are encouraged to act quickly before the official launch.","Visit Dogeverse Here","Wiener AI (WAI), a new meme coin currently in presale, presents another option for those seeking the best crypto to buy now. This sausage dog-themed coin offers a suite of AI-powered trading tools and has already raised over $1.8 million in its presale.","CONGRATS!","WEENIES ARE BEING STAKED AND STACKED AT RECORD SPEED!","Get yours here: https:\/\/t.co\/k7IFimoTWr","🌭🤖🌭🤖🌭🤖🌭🤖🌭🤖🌭🤖🌭🤖🌭🤖🌭🤖 pic.twitter.com\/WCVGZRODer","— WienerAI (@WienerDogAI) May 11, 2024","","Priced at $0.000707, WAI currently boasts a market cap under $50 million. If it achieves market leadership, early investors stand to benefit greatly, with a potential for 100x gains or more.","With 20% of the token supply allocated to staking rewards, investors are currently enjoying an impressive 566% APY, according to the project’s official website.","Buy WAI Here",""],"entity":[{"type":"$SLOTH","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Walter Bloomberg","content":"PERSON"},{"type":"Powell","content":"PERSON"},{"type":"0.3%","content":"PERCENT"},{"type":"300%","content":"PERCENT"},{"type":"2.1%","content":"PERCENT"},{"type":"566%","content":"PERCENT"},{"type":"$90 million","content":"MONEY"},{"type":"$127 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"AMC","content":"ORGANIZATION"},{"type":"550%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Pepe","content":"LOCATION"},{"type":"Pepe","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"May 3, 2024","content":"DATE"},{"type":"GME","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"May 1","content":"DATE"},{"type":"Roaring Kitty","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Dogecoin","content":"PERSON"},{"type":"2.4%","content":"PERCENT"},{"type":"2.2%","content":"PERCENT"},{"type":"Dogeverse","content":"ORGANIZATION"},{"type":"$0.000707","content":"MONEY"},{"type":"0.2%","content":"PERCENT"},{"type":"$2,850","content":"MONEY"},{"type":"May 11, 2024","content":"DATE"},{"type":"US PPI","content":"ORGANIZATION"},{"type":"Streamflow Finance\n🔄 Organic","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"$61,000","content":"MONEY"},{"type":"WAI","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"May 13, 2024","content":"DATE"},{"type":"$3m","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Best Crypto","Bitcoin","Meme coin"],"authors":["Joel Frank"]}