{"summary":"Plaintiff sues 12,000 defendants, alleging loss of retirement funds in crypto investment scheme.\nComplaint alleges promise that investment in “ARB tokens” would result in investment doubling every two months.\nPlaintiff says the whole thing was a fiction, sues for securities fraud among other counts.","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38090\/plaintiff-who-invested-retirement-fund-in-token-scheme-promising-doubled-income-in-two-months-files-suit-saying-whole-thing-turned-out-to-be-a-scam","publishDate":"2019-08-31T09:05:33","id":1701,"type":null,"title":"Plaintiff who invested retirement fund in token scheme, files suit","category":["Legal"],"content":["<strong class=\"ld lu\" data-v-f87c67ca=\"\">Ferrie v. Woodford Research LLC, et al., 3:19-cv-05798 (W.D. Wash. filed August 28, 2019)[NMR]<\/strong>","This newly filed lawsuit from Washington state has about 12,000 defendants, which is a lot. The complaint also has this quote allegedly from Richard Branson, “People have made fortunes off Bitcoin. Some have lost money. It is volatile, but people make money off of volatility too.” The reason that quote is in this lawsuit is because the plaintiff allegedly engaged the defendants to take advantage of an arbitrage scheme that they say went south.","The plaintiff here is Douglas Ferrie a resident of Washington who for several years says he followed something called “Hubert Senters Daily Video Update.” The daily video programming covered price trends of stocks and commodities.","Allegedly, on Nov. 30, 2018, two of the defendants that allegedly control an outfit called Woodford Research, published a presentation online regarding “The 1% Club” that “described a new investment opportunity involving arbitraging cryptocurrencies.” (Mkay, sounds pretty par for the course in this space). The idea was that a trading bot would capture arbitrage opportunities across crypto exchanges around the world. Allegedly, in that presentation the defendants made the following statements:","Something, something, about things seeming to be too good to be true. The pièce de résistance though of this marketing puffery was the following line “[t]his opportunity only arises once in a generation.” Naturally, seeking to capitalize on the opportunity of a lifetime the plaintiff contacted the defendants allegedly in charge of Woodford Research on Dec. 1, 2018. The sign up process to take part in the investment was as follows:","To recap, the plaintiff, allegedly on the advice of the people running Woodford Research, invested money into another company that promised arbitrage opportunities if you bought their token, ARBs, which would somehow power their advanced arbitrage bot, I guess? You can guess where this is heading.","The plaintiff, allegedly with the help of the defendants, went through the account setup process, and then problems started popping up almost immediately. Despite difficulties with the process, the plaintiff made three separate investments into the arbitrage company. Over the course of many months there was back-and-forth communication between the plaintiff and the defendants about difficulties using their website and why the plaintiff was being charged so much in fees, and why wasn’t his investment taking off, etc. “In total, Plaintiff invested $166,000 of his retirement, health savings account (HSA), and personal funds at Defendant ARBITRAGING.” Ouch.","In essence, the plaintiff is alleging here that all the people that run the defendant companies, the investment research firm and the arbitrage bot company, are all in cahoots and no such bot exists. The alleged counts include securities fraud, breach of contract, fraudulent misrepresentation, negligent misrepresentation, fraudulent concealment, unjust enrichment, alter ego liability (a CCM first?), and civil conspiracy.","A wise man once said to me “the real hero of the crypto space is Charles Ponzi.” Perhaps, that take is too cynical and irreverent, but we’ve seen so many lawsuits that look and feel like this lawsuit. The defendants will likely deny the allegations, and perhaps be able to shed some light on why the plaintiff had these alleged difficulties and where his money may have gone, but we’ll have to wait and see.&nbsp;","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"http:\/\/@nelsonmrosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. This is not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>"],"hashtag":[]}