{"summary":"Miners Could Offload $5 Billion in Bitcoin Following Halving, Warns 10x Research","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/miners-could-offload-5-billion-bitcoin-following-halving.htm","publishDate":"2024-04-15T05:53:41","id":17017,"type":null,"title":"Miners Could Offload $5 Billion in Bitcoin Following Halving, Warns 10x Research","category":["Altcoin News "],"content":["A notable outflow of Bitcoin from miners could be on the horizon in the months following the upcoming halving event.","In a recent note, Markus Thielen, the head of research at 10x Research, estimated that Bitcoin miners have the potential to liquidate approximately $5 billion worth of BTC after the halving.","Thielen also highlighted that this selling pressure from miners could persist for four to six months, leading to a potential sideways movement in Bitcoin’s price during that period, similar to what has been observed in past halving cycles.","He emphasized the historical pattern of Bitcoin prices remaining range-bound between $9,000 and $11,500 in the five months following the 2020 halving.","#Bitcoin Might Trade Sideways for 6 months As Miners Could Sell $5bn of BTC -> Here is why: https:\/\/t.co\/gLRgs8yyGg pic.twitter.com\/zBLdV95MAl","— 10x Research (@10x_Research) April 13, 2024","","The halving, expected to occur around April 20, is anticipated to trigger a supply\/demand imbalance as miners typically accumulate BTC leading up to the event. ","This accumulation often results in a subsequent rally in Bitcoin prices. ","In 2024, Bitcoin experienced a surge of 74% and reached an all-time high of $73,734 on March 14 before undergoing a correction to below $63,000 in mid-April.","Thielen also expressed concern for altcoins, suggesting that they may bear the brunt of the situation. ","Many altcoins have experienced significant declines in recent weeks and remain far from their peak levels reached in 2021. ","While there are predictions of a potential altcoin rally correlated with the halving, historical evidence suggests that such rallies typically commence almost six months later.","The analyst further speculated that Marathon, the world’s largest Bitcoin miner, has likely accumulated an inventory that will be gradually sold after the halving to avoid a sudden revenue decline. ","Thielen estimated that Marathon’s inventory, combined with its post-halving mining production of 14-15 BTC per day, could result in an additional 133 days of supply hitting the market.","If other miners adopt a similar strategy of gradually liquidating their inventories post-halving, Thielen warned that it could lead to a maximum of $104 million worth of BTC being sold daily, potentially reversing the supply\/demand imbalance that fueled the BTC rally before the halving.","Marathon CEO Peter Thiel had previously mentioned that the firm’s break-even rate post-halving would be around $46,000 per BTC, suggesting limited expectations for significant price movements in the six months following the event.","Crypto speculators are eagerly anticipating the upcoming Bitcoin halving, expected to occur around April 20. ","Given that Bitcoin recently hit a historical peak, doubts have arisen regarding whether the halving will have the same impact this time around.","For one, billionaire Arthur Hayes has expressed a cautious view regarding the upcoming Bitcoin halving and the effects it will have on the price of the asset. ","While many experts anticipate a significant rally for Bitcoin following the halving event, Hayes believes that the price action before and after the event could actually be negative. ","Likewise, Coinbase has warned that the time of year could pose challenges for an upward momentum as traders await a price surge ahead of Bitcoin halving."," "],"entity":[{"type":"Peter Thiel","content":"PERSON"},{"type":"Hayes","content":"PERSON"},{"type":"$11,500","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"$46,000","content":"MONEY"},{"type":"$5 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"six months later","content":"DATE"},{"type":"$5bn","content":"MONEY"},{"type":"$63,000","content":"MONEY"},{"type":"Markus Thielen","content":"PERSON"},{"type":"$73,734","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"74%","content":"PERCENT"},{"type":"Bitcoin miner","content":"ORGANIZATION"},{"type":"10x Research","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Thielen","content":"PERSON"},{"type":"mid-April","content":"DATE"},{"type":"15","content":"DATE"},{"type":"March 14","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"$104 million","content":"MONEY"},{"type":"$9,000","content":"MONEY"},{"type":"April 13, 2024","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin halving"],"authors":["Ruholamin Haqshanas"]}