{"summary":"Brett Harrison recalls working with an emotionally volatile Sam Bankman-Fried during his time as president of FTX US. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202446\/ex-president-of-ftx-us-says-relationship-with-sbf-reached-total-deterioration","publishDate":"2023-01-14T18:09:59","id":1703,"type":null,"title":"Ex-president of FTX US says SBF relationship reached &#x27;total deterioration&#x27;","category":["COMPANIES"],"content":["Brett Harrison, former president of FTX US, shared his experience at the company and working with Sam Bankman-Fried — and ultimately why he left his so-called \"dream job.\"","In a 49-part Twitter <a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1614371358519042051\" data-v-f87c67ca=\"\">thread<\/a> surpassing 1,200 words, Harrison claims Bankman-Fried showed emotionally volatile behavior, avoided conflict, pushed back against criticism and even isolated Harrison from communication on key decision-making.&nbsp;","\"My relationship with Sam Bankman-Fried and his deputies had reached a point of total deterioration, after months of disputes over management practices at FTX,\" Harrison wrote.","Harrison recalled working with Bankman-Fried at Jane Street, a global proprietary trading firm based in New York City, in which Bankman-Fried seemed like a promising trader as well as a sensitive and intellectual person. During his first few months as FTX US President, Harrison helped expand the U.S. team and cement professional relationships, such as with the crypto derivatives platform LedgerX.","\"Six months into my time at the company, pronounced cracks began to form in my own relationship with Sam. Around then I began advocating strongly for establishing separation and independence for the executive, legal, and developer teams of FTX US, and Sam disagreed.\"","Harrison added that Bankman-Fried seemed rarely engaged in the U.S. business and that would impart decisions impacting the U.S. without warning from the Bahamas.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"I saw in that early conflict his total insecurity and intransigence when his decisions were questioned, his spitefulness, and the volatility of his temperament. I realized he wasn’t who I remembered,\" he wrote.","After further workplace hostility for five months, Harrison decided to make one last attempt at change. In his 11th month at the company, he wrote a formal complaint detailing the company's biggest obstacles to success and that he would resign if they weren't addressed.&nbsp;","\"In response, I was threatened on Sam’s behalf that I would be fired and that Sam would destroy my professional reputation. I was instructed to formally retract what I’d written and to deliver an apology to Sam that had been drafted for me. That event solidified my decision to leave. I knew an abrupt departure would be harmful to the company and my FTX US reports, and I wanted to best position the company for future success after I left. So I gradually wound down, finished building and releasing the U.S. stock brokerage, and saw FTX U.S. employees through their mid-year reviews.\"","\"I never could have guessed that underlying these kinds of issues — which I’d seen at other more mature firms in my career and believed not to be fatal to business success — was multi-billion-dollar fraud,\" Harrison added. \"It’s clear from what has been made public that the scheme was held closely by Sam and his inner circle at FTX. com and Alameda, which I was not a part of, nor were other executives at FTX U.S.\"","Harrison <a href=\"https:\/\/www.theblock.co\/post\/172744\/ftx-us-president-harrison-is-stepping-down\" data-v-f87c67ca=\"\">stepped down<\/a> as president of FTX U.S. on Sept. 27, 2022. The Jan. 14 thread is a follow-up to the FTX U.S. information that Harrison said he would share \"<a href=\"https:\/\/www.theblock.co\/post\/200054\/former-ftx-u-s-president-harrison-says-hell-share-information-on-exchange-in-time\" data-v-f87c67ca=\"\">in time<\/a>\" on Jan. 9.","FTX <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection on Nov. 12, 2022, and Bankman-Fried was <a href=\"https:\/\/www.theblock.co\/post\/186393\/sam-bankman-fried-arrested-in-the-bahamas\" data-v-f87c67ca=\"\">arrested<\/a> in the Bahamas on Dec. 12 for charges related to wire fraud and money laundering.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Harrison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Sept. 27, 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jane Street","content":"PERSON"},{"type":"Jan. 14","content":"DATE"},{"type":"Jan. 9","content":"DATE"},{"type":"Dec. 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Nov. 12, 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"FTX U.S.","content":"LOCATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"Sam’s","content":"PERSON"}],"hashtag":["SAM BANKMAN-FRIED"],"authors":["MK Manoylov","The Block"]}