{"summary":"UN Report Highlights Tether’s Rising Role in Money Laundering Across Southeast Asia","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-is-gaining-popularity-among-money-launderers-un-report.htm","publishDate":"2024-01-15T07:06:11","id":17033,"type":null,"title":"UN Report Highlights Tether’s Rising Role in Money Laundering Across Southeast Asia","category":["News "],"content":["In a recent report released by the United Nations Office on Drugs and Crime, Tether, one of the world’s largest stablecoin Tether, has been identified as a prominent tool employed by money launderers and fraudsters operating in Southeast Asia.","The report sheds light on the increasing use of Tether’s stablecoin USDT as a preferred method for illicit activities, raising concerns among law enforcement and financial intelligence authorities.","The UN report, published on Monday, highlights the alarming surge in scams associated with Tether, including schemes that manipulate false romantic connections to gain victims’ trust before coaxing them into transferring substantial sums – a tactic commonly known as “pig butchering,” Financial Times reported.","","According to the report, authorities have observed a rapid growth in sophisticated, high-speed money laundering teams that specialize in utilizing Tether for underground transactions.","The evolution of cryptocurrency, coupled with other technological advancements, has further propelled organized crime gangs in southeast Asia to exploit black market casinos for laundering illicit funds.","The report points out that online gambling platforms, particularly those operating illegally, have become popular avenues for cryptocurrency-based money launderers, with USDT being a favored choice.","Jeremy Douglas of the UN’s Office on Drugs and Crime commented on the situation, stating,","“Organized crime has effectively created a parallel banking system using new technologies, and the proliferation of loosely or entirely unregulated online casinos, together with crypto, has supercharged the region’s criminal ecosystem.”","","Tether, a stablecoin pegged to the US dollar, has allowed traders to navigate in and out of crypto trades, distinguishing it from other cryptocurrencies like Bitcoin predominantly used for speculation.","The report highlights recent efforts by authorities to dismantle money laundering networks associated with Tether, including a successful operation by Singaporean authorities that recovered $737 million in cash and crypto last August.","Despite regulatory scrutiny and enforcement crackdowns in various jurisdictions, criminal groups persist in adopting the leading stablecoin as a preferred method for moving funds.","Some casinos have even specialized in handling stablecoin transactions, further emphasizing the cryptocurrency’s role in illicit financial activities."],"entity":[{"type":"UN’s Office on Drugs","content":"ORGANIZATION"},{"type":"$737 million","content":"MONEY"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Jeremy Douglas","content":"PERSON"},{"type":"southeast Asia","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"last August","content":"DATE"},{"type":"United Nations Office","content":"ORGANIZATION"},{"type":"” Financial Times","content":"ORGANIZATION"}],"hashtag":["anti-money laundering","Tether","USDT"],"authors":["Jai Pratap"]}