{"summary":"Logan Paul Fights Back, Says CryptoZoo Project Wasn’t A Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/logan-paul-says-cryptozoo-project-wasnt-a-scam.htm","publishDate":"2024-03-28T18:25:12","id":17041,"type":null,"title":"Logan Paul Fights Back, Says CryptoZoo Project Wasn’t A Scam","category":["NFT News "],"content":["YouTuber Logan Paul addressed accusations regarding his infamous CryptoZoo non-fungible token (NFT) in a March 27 documentary titled “5 Months with Logan Paul,” stating in the film that the NFT project was not a scam.","The documentary sheds light on Paul’s perspective on the project and features journalist Graham Besinger detailing the demise of the NFT project and the backlash and allegations that sprung up.","Besinger alleged in the documentary that Logan Paul’s CryptoZoo NFT was a mess that caused huge losses for people, leading to a spate of allegations and threats against the YouTuber.","","Paul admitted that while the allegations had an element of truth, the NFT project was not a scam.","“Everything you just said has an element of truth to it,” he said. “Here’s the problem. What you just described isn’t a scam. I took on a project that I was simply incapable of handling at the time.”","He further disclosed that he didn’t profit from the project but suffered a loss of “half a million dollars.”","JUST IN:","YouTuber Logan Paul argues CryptoZoo ‘isn’t a scam’ in new documentary","— Whalefud.eth (@WhaleFUD) March 28, 2024","","Meanwhile, the YouTuber noted that the failure of CryptoZoo led him to have suicidal thoughts.","“For the first time in my life I was having suicidal thoughts,” he stated. “I was just spiraling, Graham. Spiraling. I was crying, like sobbing … I felt weak, which is uncommon for me. I’m supposed to be the leader.”","Logan Paul first announced the CryptoZoo NFT project on his YouTube podcast in August 2021.","","The project was inspired by Pokémon but was designed as a fun game where collectors could purchase eggs and breed them to produce rare NFTs.","And while the project generated a lot of excitement, it never really took off. This was after collectors had purchased the initial 10,000 collectibles (priced at 0.1 ETH at the team). The dev team found it difficult to bring the game to fruition, as they announced multiple delays as time passed.","Shortly after CryptoZoo’s collapse, Coffeezilla, a popular YouTube journalist, published a three-part docuseries to expose issues with the game, detailing the tribulations of investors who suffered financial losses.","","Coffeezilla’s exposè revealed that Logan Paul employed multiple con men to work on the project, including a developer known as “Z,” who held the CryptoZoo source code hostage for $1M.","A class-action lawsuit was filed against Logan Paul in February 2023 based on the allegations that CryptoZoo was a “fraudulent venture.”","Despite the lawsuit, Paul announced a $2.3M buyback program in January 2024, pledging to purchase all NFTs at their original prices. The tokens are down 99% from their all-time high of $0.0004963 in August 2021.","Today, I am incredibly happy to announce that I am delivering on my promise to buy back Base Egg and Base Animal CryptoZoo NFTs for their original purchase price. This buy-back program is being carried out at https:\/\/t.co\/XIQzLAGKiG. Claims can be submitted through this site… pic.twitter.com\/VMPDHvdXkq","— Logan Paul (@LoganPaul) January 4, 2024","","While the CryptoZoo NFT fiasco has gotten some publicity, crypto scams continue to increase, right along with the growing number of traders and investors interested in digital assets.","According to BBB Scam Tracker annual data, over 67,000 scams were reported in 2023 representing huge financial losses.","The Chainalysis 2024 crypto crime trends report also showed that illicit addresses received $39.6B and $24.2B worth of cryptocurrency in 2022 and 2023, respectively.","Another report by Scam Sniffer revealed that hackers used a phishing crypto scam to drain $300M from 320K traders and investors in 2023. The web3 anti-scam solution company also reported that $46.86 million worth of crypto was stolen by scams in February 2024."],"entity":[{"type":"$2.3","content":"MONEY"},{"type":"CryptoZoo NFT","content":"ORGANIZATION"},{"type":"$39.6","content":"MONEY"},{"type":"August 2021","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"$300M","content":"MONEY"},{"type":"March 27","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"million dollars","content":"MONEY"},{"type":"February 2023","content":"DATE"},{"type":"Graham Besinger","content":"PERSON"},{"type":"YouTuber","content":"PERSON"},{"type":"Coffeezilla","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"March 28, 2024","content":"DATE"},{"type":"Graham","content":"PERSON"},{"type":"$1M","content":"MONEY"},{"type":"$0.0004963","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Logan Paul","content":"LOCATION"},{"type":"Logan Paul","content":"PERSON"},{"type":"99%","content":"PERCENT"},{"type":"$46.86 million","content":"MONEY"},{"type":"Paul","content":"PERSON"},{"type":"January 4, 2024","content":"DATE"},{"type":"Pokémon","content":"PERSON"},{"type":"$24.2","content":"MONEY"}],"hashtag":["crypto scams","Logan Paul","NFT"],"authors":["Jimmy Aki"]}