{"summary":"Senator Tim Scott Calls Crypto A “Scapegoat” For Illicit Finance Concerns in Crucial Remarks During Crypto Hearing","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tim-scott-says-crypto-a-scapegoat-for-illicit-finance-during-crypto-hearing.htm","publishDate":"2024-04-09T21:19:07","id":17054,"type":null,"title":"Senator Tim Scott Calls Crypto A “Scapegoat” For Illicit Finance Concerns in Crucial Remarks During Crypto Hearing","category":["Blockchain News "],"content":["Senator Tim Scott (R-SC) called cryptocurrencies a “scapegoat” for the federal government’s concerns about illicit finance, according to his testimony from a Tuesday crypto hearing held by the United States Senate Committee on Banking, Housing, and Urban Affairs.","During the hearing focused on countering illicit finance, terrorism, and sanctions evasions, Deputy Secretary of the Department of the Treasury Adewale O. Adeyemo requested additional tools to combat rising unlawful cryptocurrency use, including the ability to “reach extraterritorially” when digital assets harm U.S. interests.","“Our problem is that actors are increasingly finding ways to hide their identities and move resources using virtual currency,” Adeyemo said. “What has always been true is that terrorists and other malign actors seek new ways to move their resources in light of the actions we are taking to cut them off from accessing the traditional financial system.","Key senatorial figures such as Scott, questioned Adeyemo about the entire illicit finance landscape beyond crypto, where most unlawful funding comes from.","“It feels like digital assets have become the scapegoat of this administration,” Scott said to Adeyemo, noting that conversations regarding the topic focused wholly on digital assets “misses the elephant in the room.”","“For us to have a conversation that sounds like a digital asset conversation as opposed to a conversation about illicit financing that is far larger than digital assets to me makes it into a scapegoat,” Scott said.","Blockchain trade association Chamber of Digital Commerce referred to Scott’s remarks as “crucial,” given that they could “influence future digital regulations.”","In just a few moments, @SenateBanking will hold a hearing on 'Countering illicit finance, terrorism, and sanctions evasion' with U.S. Deputy Treasury Secretary @wallyadeyemo","Here's what to expect👇https:\/\/t.co\/O4tLAAytby","— The Digital Chamber (@DigitalChamber) April 9, 2024","","Questions on how to effectively legislate cryptocurrencies have reached a fever pitch in recent months, particularly after the October 7th Hamas attack on Israel that saw conflicting data surrounding crypto affect political debates on the topic.","In particular, Senator Elizabeth Warren has been a staunch advocate for preventing crypto-related money laundering, going so far as to draft the Digital Asset Anti-Money Laundering Act (DAAMLA) in 2022.","Critical players in the crypto industry have come out against the bill, however, claiming it would effectively serve as a proposed ban on crypto.","Digital assets have been under attack from politicians for years, but never like this. Senators @SenWarren and @SenSherrodBrown are trying to kill the entire industry, and their efforts are moving forward. pic.twitter.com\/n7jJEAIjKI","— The Digital Chamber (@DigitalChamber) February 20, 2024","","During Tuesday’s hearing, Warren continued to push for the bill, saying the U.S. “doesn’t have the right anti-money laundering laws in place.”","“Name your bad guy and crypto is the way they can move money around,” Warren said.","Tuesday’s crypto hearing is the latest legislative session to address the hot-button issue of unlawful crypto funding. With the U.S. presidential election around the corner, it’s unclear whether or not the government can advance any legislation on the matter beforehand."],"entity":[{"type":"Adeyemo","content":"PERSON"},{"type":"Adeyemo","content":"LOCATION"},{"type":"February 20, 2024","content":"DATE"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Urban Affairs","content":"ORGANIZATION"},{"type":"7th Hamas","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"United States Senate Committee on Banking","content":"ORGANIZATION"},{"type":"April 9, 2024","content":"DATE"},{"type":"Scott","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"Scott","content":"LOCATION"},{"type":"Department of the Treasury Adewale O. Adeyemo","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Tim Scott (","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":["Crypto Regulation","daamla","US Senators"],"authors":["Julia Smith"]}