{"summary":"Regulatory Investigation Targets South Korean Crypto Lender Delio","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/regulatory-investigation-targets-south-korean-crypto-lender-delio.htm","publishDate":"2023-07-03T17:42:00","id":17057,"type":null,"title":"Regulatory Investigation Targets South Korean Crypto Lender Delio","category":["Blockchain News "],"content":["South Korea-based Delio is currently under scrutiny as the country’s Financial Services Commission (FSC) investigates the crypto lending firm for alleged fraud, embezzlement, and breach of trust.","According to reports from local news outlet Digital Asset, the investigation sprouts from Delio’s unilateral decision to suspend users’ deposits and withdrawals on June 14, raising concerns among investors.","#Delio, a #SouthKorean virtual asset manager, suspends customer withdrawals to protect assets amid market volatility caused by challenges at Haru Invest.\n\nDownload Our #Koinpark App For More Updates:https:\/\/t.co\/MzCi2WUS7s pic.twitter.com\/8AOgr6F4jA","The FSC is examining the circumstances surrounding the decision, including the alleged fraudulent practices and breach of trust by Delio.","The company’s management is also under scrutiny for denying any connection or exposure to its troubled sister lending firm, Haru Invest, before the suspension.","During an extraordinary investors’ meeting held on June 17, Delio’s CEO, Jung Sang-ho, announced that the firm would gradually resume withdrawals, without providing a fixed schedule.","Partial withdrawals for some of its staking services commenced on June 27, as Delio sought to assure investors of its commitment to securing capital for compensation.","Delio, known as one of South Korea’s prominent crypto lenders, holds substantial assets, including an estimated $1 billion in Bitcoin (BTC), $200 million in Ethereum (ETH), and $8.1 billion in various altcoins.","However, the ongoing investigation has resulted in restrictions placed on the CEO and management staff, preventing them from leaving the country while prosecutors conduct their inquiries.","The investigation also casts a shadow on Delio’s sister firm, Haru Invest, which suspended withdrawals and deposits on June 13, citing issues with a “consignment operator.”","Reports attributed the suspension to fraudulent management reports provided by its operating partner, B&S Holdings (formerly Aventus). Legal action, including criminal and civil proceedings, are underway.","Haru Invest suspends deposit and withdrawal services due to fraudulent management reports provided by its operating partner, B&S Holdings (formerly Aventus). Legal action, including criminal and civil proceedings, has been initiated.https:\/\/t.co\/q1P959Jnty","\nDelio followed suit the next day, likely due to concerns regarding counterparty exposure. Haru Invest has since downsized its staff significantly and is taking legal action against its service partner.","As a registered virtual asset provider (VASP), Delio falls under the regulation of South Korea’s Financial Intelligence Unit. However, Haru Invest, being a non-VASP, remains outside the jurisdiction of regulators.","The investigation by the FSC underscores the importance of regulatory oversight and investor protection in the crypto lending sector.","Stakeholders are closely monitoring the developments of this case, as it may have broader implications for the regulatory framework and transparency requirements for virtual asset providers in South Korea.","The investigation into Delio brings to the forefront the inherent risks associated with engaging in the crypto industry. With its decentralized nature and lack of traditional oversight, the crypto sector has attracted both legitimate businesses and bad actors alike.","Cases like Delio serve as cautionary tales, underlining the need for comprehensive regulatory frameworks that can effectively address and mitigate such risks.","By implementing stringent regulations, authorities can establish clear guidelines for market participants, promoting transparency and accountability throughout the industry.","In addition to robust regulatory frameworks, effective risk management practices are imperative for the long-term stability and sustainability of the crypto lending sector.","Market participants must adopt rigorous risk assessment protocols, conduct thorough due diligence on potential partners, and implement robust internal controls. These would help identify and mitigate potential vulnerabilities, fortifying operations against fraudulent activities and unforeseen market fluctuations.\n "],"entity":[{"type":"’s Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Haru Invest","content":"PERSON"},{"type":"Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"Jung Sang","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"FSC","content":"ORGANIZATION"},{"type":"$8.1 billion","content":"MONEY"},{"type":"B&S Holdings","content":"ORGANIZATION"},{"type":"Delio","content":"LOCATION"},{"type":"June 14","content":"DATE"},{"type":"Haru Invest","content":"ORGANIZATION"},{"type":"June 17","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Delio","content":"ORGANIZATION"},{"type":"June 27","content":"DATE"},{"type":"June 13","content":"DATE"}],"hashtag":["CRYPTO","Crypto Exchange","Cryptocurrency","South Korea"],"authors":["Lockridge Okoth"]}