{"summary":"Showdown: Shiba Inu Challenges Dogecoin for Meme Coin Dominance","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/showdown-shiba-inu-challenges-dogecoin-for-meme-coin-dominance.htm","publishDate":"2021-10-12T10:57:00","id":17059,"type":null,"title":"Showdown: Shiba Inu Challenges Dogecoin for Meme Coin Dominance","category":["Altcoin News "],"content":["The recently hot meme coin shiba inu (SHIB) is not slowing down on its march to the top of the meme coin throne, with even the original dogecoin (DOGE) now feeling the heat as the ultimate showdown nears.","At 09:29 UTC, almost USD 15bn in valuation separated the two networks, with SHIB worth USD 15.3bn and DOGE worth just under USD 30bn. The two meme coins, ranked 10 and 11 on CoinGecko’s ranking of the most valuable cryptoassets, have already surpassed many widely used decentralized finance (DeFi) tokens, and are closing in on the likes of polkadot (DOT) and solana (SOL).","But although the two coins stood back to back on the market capitalization rankings today, they stood far apart from each other in terms of their recent performance.","Over the past 24 hours, SHIB was up by more than 10% while its 7-day gain was a notable 128%. Meanwhile, DOGE was down by 5% for the past 24 hours, and down 4% for the past 7 days. ","Looking at trading volumes, the figures were also strongly in favor of SHIB over DOGE. According to data from CoinGecko on Tuesday, SHIB saw trading volumes of USD 7.16bn over the past 24 hours, while DOGE recorded only USD 1.25bn in volume over the same time period – less than one fifth that of SHIB.","The majority of trading of both SHIB and DOGE takes place on crypto exchange Binance, although the exchange has an even stronger grip on SHIB than on DOGE, with nearly 33% of SHIB volume seen on it. ","Further, in terms of SHIB volume, Binance is followed by Coinbase, which saw slightly less than half of Binance’s volume, per CoinGecko’s data.","The latest gains for shiba inu today followed a major dump on Thursday last week, as well as another slight correction over the weekend.","According to the on-chain analytics firm Santiment, the dump on Thursday could be attributed to a large number of small retail traders who made “their largest dump in the asset’s 6-month history,” with SHIB 31.07bn being moved from wallets holding between 1m and 10m tokens.","🐶 #ShibaInu's addresses worth 1M to 10M $SHIB made their largest dump in the asset's 6-month history on Thursday's price drop. 31.07B coins were shed from these addresses, 3.02% of all of these modest-sized address holdings. Things are now rebounding. 📈 https:\/\/t.co\/qja8cfp9fE pic.twitter.com\/D8M1WjDanh","Following the launch of SHIB in late 2020, the meme coin has evolved into an ecosystem consisting of the related tokens LEASH and BONE, the Shiboshi non-fungible token (NFT) collection, as well as the decentralized exchange ShibaSwap. ","Unlike the original dogecoin, the entire Shiba Inu ecosystem is built on Ethereum (ETH) and tokens can be transferred and held as regular ERC-20 tokens.","____","Learn more:\n– ‘DOGE Killer’ Shiba Inu Clogs Ethereum While Musk Lifts Dogecoin Again\n– Vitalik Buterin Shows Mercy To Shiba Inu As Meme Coin Halves In Price \n\n– Dogecoin Wannabes Flood The Market With Pumps & Dumps\n– Who Let the DOGE Clones out? Dogecoin Knockoffs Dominate DEX Trading","– Dogecoin Needs 3 Conditions Fulfilled to Move Beyond USD 1\n– ‘The Most Honest Sh*tcoin,’ Dogecoin, Will Survive Alongside Bitcoin – Analysts"],"entity":[{"type":"SHIB","content":"ORGANIZATION"},{"type":"Dogecoin Needs 3 Conditions Fulfilled","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Thursday last week","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"3.02%","content":"PERCENT"},{"type":"128%","content":"PERCENT"},{"type":"33%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$SHIB","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Shiba Inu Clogs Ethereum While Musk Lifts Dogecoin Again\n– Vitalik Buterin Shows Mercy To Shiba Inu As Meme Coin Halves In Price \n\n– Dogecoin Wannabes Flood The Market With Pumps & Dumps","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Altcoins","Binance","Coinbase","DeFi","Dogecoin","Market","NFT","Polkadot","Solana"],"authors":["Fredrik Vold"]}