{"summary":"Insider Trading in the NFT Market? Moonbirds’ Unusual Sales Activity Before Yuga Deal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/insider-trading-in-the-nft-market-moonbirds-unusual-sales-activity-before-yuga-deal.htm","publishDate":"2024-02-17T08:30:49","id":17066,"type":null,"title":"Insider Trading in the NFT Market? Moonbirds’ Unusual Sales Activity Before Yuga Deal","category":["NFT News "],"content":["Prices and trading volume for the Ethereum NFT collection Moonbirds experienced a significant surge on Friday following the announcement of Yuga Labs’ acquisition of the collection’s intellectual property alongside creator Proof.","However, there were also considerable spikes in sales activity in the days leading up to the revalation, which has sparked speculation of potential insider trading.","Data from blockchain analytics platform CryptoSlam reveals that daily sales volume for Moonbirds NFTs remained below the $100,000 mark for each day throughout this month until February 13, with only one exception on February 4, totaling approximately $141,000.","On February 14, daily sales volume skyrocketed fivefold to about $460,000, accompanied by almost four times the number of transactions seen previously.","The elevated sales volume persisted on February 15, amounting to roughly $333,000.","Following the afternoon announcement on February 16, sales surged even further, with the current daily tally at approximately $3.1 million and rising.","A closer look at the project’s price floor, which represents the lowest listed asset price in the collection, reveals a similar pattern of spikes in the days leading up to the Friday announcement.","On Monday afternoon, the price stood at around $2,680 worth of ETH according to data from NFT Price Floor.","It began climbing on Wednesday, reaching $5,000 before experiencing a slight decline.","However, on Friday, after the announcement, it briefly peaked at over $6,000 worth of ETH before settling at approximately $5,170 at the time of writing.","While it is not surprising for asset prices to rise following a deal announcement, the surge prior to the announcement raises suspicions of potential insider trading.","Influencers, developers, and community members took to Crypto Twitter on Friday to highlight this possibility.","Pseudonymous blockchain developer cygaar tweeted a sales\/price chart for the week, showing the unexplained spike on Wednesday.","“Moonbirds chart before the Yuga acquisition tweet. Nope, definitely no insider trading here,” he sarcastically said.","Moonbirds chart before the Yuga acquisition tweet.","Nope, definitely no insider trading here. pic.twitter.com\/UqV0DeXUr8","— cygaar (@0xCygaar) February 16, 2024","","Another well-known pseudonymous crypto trader and influencer, Cirrus, jokingly referred to a wallet that had purchased over 150 NFTs from the Proof ecosystem in the past few days as “Nancy Pelosi’s wallet,” alluding to accusations of the U.S. Representative and former Speaker of the House trading stocks based on insider knowledge.","Cirrus also mentioned being in profit after the Yuga news.","Found Nancy Pelosis NFT wallet","80 Moonbirds, 71 Moonbird Mythics, 28 Oddities, and 13 Mythic eggs bought in the last 7 days","Sitting on a couple hundred thousand in profit after the Yuga news pic.twitter.com\/VqImNT77tA","— Cirrus (@CirrusNFT) February 16, 2024","","Last year, Nathaniel Chastain, former Head of Product at OpenSea was arrested and charged with wire fraud and money laundering in connection with insider trading in NFTs.","At the time, prosecutors in New York’s Southern District accused the 31-year-old of “using confidential information about what NFTs were going to be featured on OpenSea’s homepage for his personal financial gain.”","Chastain earned over $50,000 by trading at least 45 NFTs he knew would be featured on OpenSea’s homepage.","He was then sentenced to three months in prison for profiting tens of thousands of dollars through insider trading."],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"February 15","content":"DATE"},{"type":"February 14","content":"DATE"},{"type":"$333,000","content":"MONEY"},{"type":"$5,170","content":"MONEY"},{"type":"February 16","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"tens of thousands of dollars","content":"MONEY"},{"type":"February 13","content":"DATE"},{"type":"NFT Price Floor","content":"ORGANIZATION"},{"type":"$3.1 million","content":"MONEY"},{"type":"$50,000","content":"MONEY"},{"type":"February 16, 2024","content":"DATE"},{"type":"$141,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$2,680","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Moonbirds","content":"PERSON"},{"type":"Moonbird Mythics","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"afternoon","content":"TIME"},{"type":"New York’s Southern District","content":"LOCATION"},{"type":"$460,000","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"$6,000","content":"MONEY"},{"type":"Nancy Pelosi","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"February 4","content":"DATE"},{"type":"Cirrus","content":"ORGANIZATION"},{"type":"last 7 days","content":"DATE"},{"type":"Nathaniel Chastain","content":"PERSON"},{"type":"Nancy Pelosis NFT","content":"ORGANIZATION"}],"hashtag":["Crypto Regulation","NFT"],"authors":["Ruholamin Haqshanas"]}