{"summary":"Aura CEO: Luxury Industry on Verge of Embracing Crypto with On-Chain Digital Passports","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/aura-ceo-luxury-crypto-adoption-rising-with-on-chain-digital-passports.htm","publishDate":"2024-02-28T11:24:14","id":17073,"type":null,"title":"Aura CEO: Luxury Industry on Verge of Embracing Crypto with On-Chain Digital Passports","category":["NFT News "],"content":["The luxury industry’s involvement with crypto is about to leap forward, according to Aura CEO Romain Carrere.","The Aura Blockchain Consortium is a collective formed by leading luxury brands to establish a unified blockchain approach. According to Carrere, the number of Web3 customers engaged with luxury brands is growing rapidly, exhibiting exponential growth. ","Carrere shared his insights at the recent NFT Paris event, held near the iconic Eiffel Tower.","Aura counts luxury giants such as Louis Vuitton, Prada, Mercedes Benz, Dior, Cartier, and Bulgari among its 40 members.","Carrere is currently focused on preparing these companies for the European Union’s anticipated regulations on Digital Product Passports (DPPs) that are expected to come into effect in 2026 or 2027.","DPPs are part of a series of EU regulations aimed at promoting sustainability in manufacturing. ","They will require luxury brands and various European companies to provide customers with comprehensive information about the origins and composition of their products. ","While these regulations do not explicitly mention cryptocurrencies, Aura sees an opportunity to create an industry-standard form of DPPs for luxury brands by leveraging on-chain technology.","Delve into how luxury brands are utilising blockchain solutions, such as the Digital Product Passport, to provide unprecedented authenticity & transparency throughout the supply chain – both upstream and downstream.","— Aura Blockchain Consortium (@AuraConsortium) February 19, 2024","","According to Carrere, simply complying with the minimum requirements of the EU regulations by creating a digital product passport would not be sufficient to engage customers. ","The luxury brands guided by Aura are embracing the potential of on-chain DPPs, building on their previous successful blockchain experiments. ","Carrere envisions a future where European customers accessing the DPP associated with their Louis Vuitton handbag or Dior jacket will have a secure on-chain portal at their disposal. ","This portal will not only provide proof of the product’s authenticity but also offer additional features related to loyalty programs, warranties, and insurance.","While Aura is establishing a unified framework for DPPs, the specific on-chain features offered by each brand may vary based on their preferences. ","Physical NFC chips are one approach, with some brands choosing to embed them into their fashion items.","Others are exploring innovative techniques like AI image fingerprinting, which verifies the product’s origin and authenticity by analyzing high-quality photos down to the pixel level.","Carrere believes that the commitment of leading luxury brands to connect their products to blockchain networks, and their collaboration through Aura, represents a significant milestone for the industry. ","Despite being fierce competitors, these brands are setting aside their rivalries to establish a standard that benefits the entire luxury industry. ","Carrere describes this collective effort as something unique and transformative.","It is worth noting that the market for NFTs has been on an upward movement recently amid the recovery in crypto prices.","In October, NFT trading volume surged by $99 million, reaching $405 million, signifying levels of sales not seen since August.","Likewise, sales of NFTs on the Bitcoin (BTC) network reached a new milestone in December 2023, surpassing $881 million for the first time ever. ","NFT sales on the Bitcoin chain reached $881,223,753.92 last month, setting the highest single-month sales record to date.","This included 111,713 buyer addresses and 98,744 seller addresses, both setting the highest single-month records to date."," "],"entity":[{"type":"2026","content":"DATE"},{"type":"2027","content":"DATE"},{"type":"$405 million","content":"MONEY"},{"type":"Bulgari","content":"ORGANIZATION"},{"type":"DPP","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Romain Carrere","content":"PERSON"},{"type":"European Union","content":"ORGANIZATION"},{"type":"$99 million","content":"MONEY"},{"type":"$881,223,753.92","content":"MONEY"},{"type":"Prada","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 19, 2024","content":"DATE"},{"type":"December 2023","content":"DATE"},{"type":"$881 million","content":"MONEY"},{"type":"Carrere","content":"PERSON"},{"type":"Mercedes Benz","content":"ORGANIZATION"},{"type":"Aura Blockchain Consortium","content":"ORGANIZATION"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Cartier","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["Adoption","Luxury Brands","NFT"],"authors":["Ruholamin Haqshanas"]}