{"summary":"Grayscale Launches Crypto Staking Fund – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/grayscale-launches-crypto-staking-fund.htm","publishDate":"2024-03-05T22:02:52","id":17086,"type":null,"title":"Grayscale Launches Crypto Staking Fund – Here’s What You Need to Know","category":["Blockchain News "],"content":["Investment firm Grayscale has launched a new crypto staking fund that owns tokens for nine blockchains.","In a press release published on March 5, the investment firm behind the biggest spot bitcoin ETF announced the launch of the Grayscale Dynamic Income Fund (GDIF), which will own tokens for Aptos, Celestia, Coinbase Staked Ethereum, Cosmos, Near, Osmosis, Polkadot, SEI Network, and Solana.","According to the release, the fund will distribute rewards in U.S. dollars quarterly.","As we've built our product family, we've only ever incorporated passive strategies. This week, that changes.\nMeet Grayscale Dynamic Income Fund (GDIF), our first actively managed investment product, focused on multi-asset staking. Here’s how it works: (1\/5) pic.twitter.com\/oJEAskutXG","— Grayscale (@Grayscale) March 5, 2024","","“The Grayscale team is at the forefront of developments taking place in the crypto ecosystem, and we continue to leverage our expertise to create innovative investment opportunities,” said Grayscale CEO Michael Sonnenshein. “As our first actively managed Fund, GDIF is an important expansion of our product suite and enables investors to participate in multi-asset staking through the convenience and familiarity of a singular investment vehicle.”","Staking in crypto refers to the process of actively participating in the operations of a blockchain network by locking up a certain amount of crypto to support the network’s functions. Staking offers a way for crypto holders to contribute to the security and functionality of a blockchain while earning passive income through the rewards associated with the staking process.","While the Bitcoin blockchain depends on the proof-of-work mechanism, where miners solve intricate mathematical puzzles to generate new Bitcoin, proof-of-stake networks such as Ethereum operate differently by allowing token owners to pledge their assets to run the network.","To evaluate protocols for potential inclusion in the Fund, Grayscale will use a combination of qualitative and quantitative criteria, including factors such as staking rewards, market capitalization, and liquidity.","The GDIF is currently available for investment by qualified clients, defined by the SEC as an individual with a net worth of at least $2.2 million, excluding the value of their primary residence, or possessing assets under management amounting to $1,100,000.\n","Since its conversion to an ETF in mid-January, Grayscale has witnessed a reduction of nearly 33% in its Bitcoin holdings within its Grayscale Bitcoin Trust (GBTC).","Before the conversion, Grayscale’s fund held approximately 620,000 BTC, according to Coinglass. GBTC currently holds 420,682 BTC, with an estimated value of $28.8 billion at current market prices, according to its website and portfolio."],"entity":[{"type":"$1,100,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$2.2 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"Aptos","content":"LOCATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Polkadot","content":"LOCATION"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"$28.8 billion","content":"MONEY"},{"type":"March 5","content":"DATE"},{"type":"Coinbase Staked Ethereum","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"mid-January","content":"DATE"},{"type":"March 5, 2024","content":"DATE"}],"hashtag":["Grayscale","Staking"],"authors":["Brian Yue"]}