{"summary":"Ethereum Co-founder Joe Lubin Bullish on Crypto: “Momentum Unstoppable”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-co-founder-joe-lubin-bullish-on-crypto-momentum-unstoppable.htm","publishDate":"2024-03-03T09:00:50","id":17082,"type":null,"title":"Ethereum Co-founder Joe Lubin Bullish on Crypto: “Momentum Unstoppable”","category":["Altcoin News "],"content":["The majority of attendees at ETH Denver, one of the largest Ethereum conferences, believe that bullish sentiment is pervading the crypto market. ","Even Joe Lubin, co-founder of Ethereum and CEO of Consensys, shares this optimistic outlook, asserting that the best is yet to come.","During a chat moderated by Axios reporter Crystal Kim on February 29th, Lubin discussed various topics including the current “super cycle,” the potential benefits of BTC and ETH ETFs for retail investors and the developer-focused community, and the growing need for decentralization in multiple industries.","“We are in this 4th turning, and we are ready for a new system of the world,” he said when asked about the catalyst for the next super cycle.","“The other way of thinking about it is that it’s a monetary super cycle, where the monetary systems of the world reach an end of life essentially, basically because of interest, and there’s too much debt in the system because certain generations broke the monetary system and other elements of the financial system.”","Lubin highlighted the contrast between the current centralized, top-down trust model and the decentralized trust introduced by cryptocurrencies. ","He emphasized that crypto was born into an era of constrained and controlled money, but it offers a paradigm shift towards decentralized trust, a concept that had never been seen before.","The approval of spot Bitcoin ETFs, after more than seven years of waiting, has been hailed as a significant milestone for crypto advocates and investors. ","","However, concerns remain about institutional investors potentially diluting the original vision of Bitcoin’s creator, Satoshi Nakamoto. ","When asked about the impact of spot Bitcoin ETFs and the potential for an ETH ETF, Lubin expressed optimism, stating that the “floodgates are open now, and there’s an enormous amount of value piling into the crypto ecosystem.”","“The good thing about that is it’s going to be hard for regulators and politicians to stomp on people’s portfolios, and we’re going to see more and more funding come into our ecosystem.”","The United States has historically taken a firm stance against the crypto industry, hindering its growth for years. ","However, Lubin believes that the decision to impede the industry’s progress may no longer rest solely in the hands of policymakers. ","“I think the momentum is picking up, and it’s unstoppable,” he said. ","“The SEC has done some things under the Biden administration that are real headscratchers, there’s an element of gaslighting and unreasonableness in some of the actions they have brought, and the judicial branch has been wonderful in seeing things clearly and ensuring the laws of the United States of America and the Constitution are followed and protected.”","More recently, US SEC Commissioner Hester Peirce also reiterated her criticisms of her own agency’s approach to cryptocurrencies in a recent appearance at ETH Denver.","Peirce expressed frustration over the SEC’s tendency to “regulate by enforcement” and criticized the slow approval process for spot Bitcoin ETFs."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Joe Lubin","content":"PERSON"},{"type":"February 29th","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"Lubin","content":"PERSON"},{"type":"Biden","content":"PERSON"},{"type":"ETH Denver","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"United States of America","content":"LOCATION"}],"hashtag":["Adoption","bullish","Ethereum"],"authors":["Ruholamin Haqshanas"]}