{"summary":"The CoW AMM aims to protect liquidity providers by capturing and redistributing MEV that would otherwise benefit arbitrageurs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277425\/cow-dao-amm-exchange-mev","publishDate":"2024-02-14T10:00:04","id":1708,"type":null,"title":"CoW DAO unveils AMM aimed at protecting liquidity providers from MEV","category":["DEFI"],"content":["CoW DAO, which operates user-protective protocols like CoW Swap and MEV Blocker, is launching an automated market maker solution that aims to protect liquidity providers from <a href=\"https:\/\/www.theblock.co\/learn\/245701\/what-is-maximal-extractable-value-mev\" data-v-f87c67ca=\"\">maximal extractable value<\/a>.","CoW DAO's solution — unlike typical AMMs — will protect liquidity providers against what is described as a type of MEV called loss versus rebalancing. LVR refers to the losses liquidity providers on an AMM-based decentralized exchange incur due to arbitrage bots constantly rebalancing liquidity pools.","The AMM would capture the MEV that would otherwise be lost to arbitrageurs — or MEV bots — and share it back with LPs, the developers explained. “Liquidity providers are protected from toxic flow and know that whoever rebalances will always forward them surplus,” a spokesperson for CoW DAO said.","An automated market maker is a decentralized exchange that facilitates trading between crypto tokens. Instead of relying on traditional order books where buyers and sellers directly match orders, AMMs use liquidity pools to automate the pricing and trading.&nbsp;","The project's flagship offering until now is <a href=\"https:\/\/www.theblock.co\/post\/261547\/dex-aggregator-cow-swaps-core-team-has-proposed-adding-fees-in-six-month-test\" data-v-f87c67ca=\"\">CoW Swap<\/a> — an intent-based decentralized exchange aggregator. Its AMM release will complement the aggregator, allowing existing users to tap into better liquidity.","While CoW DAO’s other products already secure traders from MEV, CoW AMM is the first product from the project protecting liquidity providers.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"AMM","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["DEXS","MEV","PROTOCOLS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}