{"summary":"Coinbase Unveils Two New Wallet Solutions Aimed at Easing Crypto Onboarding","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-unveils-two-new-wallet-solutions-aimed-at-easing-crypto-onboarding.htm","publishDate":"2024-02-29T21:28:07","id":17091,"type":null,"title":"Coinbase Unveils Two New Wallet Solutions Aimed at Easing Crypto Onboarding","category":["Blockchain News "],"content":["On February 29, crypto exchange Coinbase unveiled two new wallet solutions, focusing on simplifying the onboarding process for newcomers to crypto.","A tweet from Coinbase Wallet revealed the upcoming launch of a smart wallet and embedded wallet features.","The biggest barrier to growing onchain adoption is the complexity of onboarding.","We’re excited to introduce our smart wallet solution to help make onchain onboarding faster, easier, and safer. Available on testnet for developers now.","Learn more: https:\/\/t.co\/86ANCip7UO pic.twitter.com\/jV1Of4U6nW","— Coinbase Wallet 🛡️ (@CoinbaseWallet) February 29, 2024","","The features are designed to address challenges commonly associated with the unintuitive user experience when creating crypto wallets, the company said in its press release.","“Users struggle with the core parts of getting started with on-chain applications, like seed phrases, transaction signing, and gas fees, and we believe that it needs to be much simpler,” Coinbase stated.\n","","The new smart wallet will serve as an extension to the Coinbase Wallet SDK—a software toolkit that enables developers to instantly integrate a wallet within decentralized applications using a passkey. This eliminates the need for intricate systems such as using seed phrases or additional steps.","The smart wallet is currently in the testnet phase, the company noted. Constructed on Coinbase’s layer-2 network Base, the wallet employs a widely adopted blockchain technology called account abstraction, which provides users with recovery options in case they misplace their keys.","Coinbase also plans to provide gas fee credits through their Account Abstraction Kit.","Coinbase expressed in its blog post that one of its core objectives for 2024 would be to establish smart wallets as the default option.","“Smart wallets will help solve the key challenges in security and usability that are holding back on-chain adoption today – bringing more users on-chain and letting builders offer simple onboarding and better experiences,” they wrote.\n","","Additionally, Coinbase plans to tackle user experience challenges with the introduction of embedded wallets.","The embedded wallets will be driven by “wallet as a service,” or WaaS, which revolves around the concept that companies can tailor blockchain wallets to meet the specific needs of their customers.","The new feature will “allow developers to create white-labeled embedded wallets that abstract away the complexities of crypto in favor of familiar email and social login flows.”","“Building the next generation of on-chain experiences will be critical to bringing a billion users on-chain, and we believe that evolving wallets are a critical step,” the company added."],"entity":[{"type":"February 29, 2024","content":"DATE"},{"type":"Coinbase Wallet SDK","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"February 29","content":"DATE"}],"hashtag":["Coinbase"],"authors":["Brian Yue"]}