{"summary":"CoinGecko to Expand into NFT Playing Ground","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coingecko-to-expand-into-nft-playing-ground-3681.htm","publishDate":"2019-04-12T11:04:00","id":17099,"type":null,"title":"CoinGecko to Expand into NFT Playing Ground","category":["News "],"content":["Major crypto market data provider CoinGecko is looking to get into the non-fungible token (NFT) space, having launched an NFT forum only days ago, Bobby Ong, co-founder of the company, told Cryptonews.com, adding, “We believe there is strong growth potential in NFT, and that the NFT space in 2019 is like the crypto space in 2014.”","The company is working on “a bigger plan around the analytics of NFT which we plan to launch in a few months,” Ong added without specifying. Now they’re are curating a community of people interested in discussing and trade NFTs.","Non-fungible tokens are a special type of token representing something unique, which means they are not interchangeable. The most popular example are CryptoKitties, an Ethereum-based dapp (decentralized application) game that consists of collecting cats represented by tokens, each of them unique; other examples include Axie Infinity, another collection dapp, and Decentraland, a virtual reality platform that lets users create their own world.","The NFT forum recently launched by CoinGecko currently has a giveaway for their users with two rare NFTs being the main prize. All they have to do to participate is introduce themselves, write what they think about NFTs and their future, attach a picture of an NFT they own, retweet a post and follow Boxswap, an NFT management project, on Twitter. The thread already has 36 users participating, out of the total of 55 users currently registered on the forum.","Also, CoinGecko, which tracks over 4,300 coins from more than 300 exchanges and aims to track “the most data points in the crypto space,” is going to implement new measures in its combat with providers of fake trading volume.","“We are busy working in the office now to provide more data to users to better show which exchanges have real and which have fake trading volume,” Ong said, adding, “More information will be displayed in the coming weeks and months to come. We agree, there needs to be more transparency surrounding crypto exchanges and we aim to help provide such information to the market.”","Last year, CoinGecko introduced Social data for each exchange in order to help users to evaluate trading volume.","Exchanges engaging in wash trading actually follow a predictable pattern so they can be exposed by any trader, as previously reported. Around 95% of trading volume as per competing coin market ranking chart Coinmarketcap is fake and\/or non-economic in nature, according to crypto investment company Bitwise Asset Management.","Meanwhile, Coingecko is also different from its competitors due to its rankings of the listed coins.","For example, Ethereum Classic is 17th on Coinmarketcap, and 20th on Coingecko, while BitShares is 42nd on Coinmarketcap and 48th on Coingecko.","“It is possible that our circulating supply is different from the other crypto data aggregators resulting in a different market capitalization,” Ong explained, pointing at their methodology, published on their website.","Separately, the co-founder added that their don’t have intentions to change their advertising-based business model and don’t have plans to raise additional capital at this stage.","“MyEtherWallet, Trezor, Masternodes.Online, Etherscan, EOSPark and many are using our API [application programming interface] and we plan to keep this free for as long as we can,” Ong said. In March, the website had 7.95 million visits, according to digital market intelligence platform Similarweb.","Coingecko visits:","Some of their competitors include the earlier mentioned Coinmarketcap.com (57.82 million visits in March), Cryptocompare.com (4.5 million), Coinpaprika.com (1.43 million), Messari.io (349,710 visits) and Coincodex.com (753,750 visits) among others."],"entity":[{"type":"2014","content":"DATE"},{"type":"Coingecko","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"March)","content":"DATE"},{"type":"Bobby Ong","content":"PERSON"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Etherscan","content":"LOCATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["Exchanges","Non-fungible tokens"],"authors":["Sead Fadilpašić"]}