{"summary":"Top 10 NFTs by All-time Trading Volume","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-10-nfts-by-all-time-trading-volume-7018.htm","publishDate":"2020-07-03T18:00:00","id":17093,"type":null,"title":"Top 10 NFTs by All-time Trading Volume","category":["News "],"content":["With a major milestone about to be reached in total all-time volume, non-fungible tokens (NFTs) have the potential to become a trillion-dollar market one day, industry insiders argue. Among the companies that have already entered this young market, we’ve listed the current top ten by all-time trading volume.","Source: CryptoKitties","NFT is at the verge of hitting a major milestone – USD 100 million NFTs sold, noted Ryan Sean Adams, founder of crypto investment company Mythos Capital and creator of the Bankless program.","At the time of writing (9:10 UTC), according to NonFungible:","We live in “the earliest of early days,” said Adams in a recent Bankless post.","“NFTs will be a trillion-dollar market someday. That means USD 999.9 billion in future opportunity. We’re just .01% of the way in,” he added.","Adams named Collectibles, Gaming, Worlds, Art, and Culture as NFT categories, stating that “there’s likely billion-dollar opportunities in each of these categories.”","Andrew Steinwold, Partner at digital asset fund Polynexus Capital and founder of Zima Red podcast, added that the numbers we see today “show just how early we are in a market that one day could be worth trillions of dollars.” Given that the exact time of birth of NFTs is debated, Steinwold took it to be December 2017, arguing that trade volumes had been minimal before that.","Over time, the NFT market has seen a steady increase, he said, adding that about 18,500 wallets have either purchased or sold an NFT.","“Going forward, I expect more differentiated NFT categories to arise and NFT market activity to increase dramatically,” Steinwold added.","Per NonFungible, the top 10 by all-time volume among the 120 on their list are:","CryptoKitties is a blockchain game on Ethereum, developed by Axiom Zen, allows players to purchase, collect, breed and sell virtual cats. In the last month, it had USD 107,000 in volume, and nearly 21,000 sales, with the average price of USD 5.11.","This decentralized Ethereum-based, virtual reality platform Decentraland allows users to use MANA to purchase parcels of LAND, the 3D virtual space. Its volume in the past month is USD 309,800, with nearly 1,800 sales and the average price of USD 172.7.","MCH is a turn-based battle game for smartphones and PC, where players collect and train historical heroes to send them to the battlefield and conquer enemies. Looking at its numbers over the past month, it had USD 88,383 in volume and approximately 1,520 sales, while the average price was USD 58.","Developed by Australia-based blockchain gaming startup Immutable, Gods Unchained is a one-on-one battle between players, where each can choose a deck of 30 cards from their collection of gods. Its monthly volume is USD 3,891, also recording some 460 sales, per the average price of USD 8.5.","FOAM provides the tools to enable a crowdsourced map and decentralized location services. Signals are backed by FOAM Tokens and show demand for location services in the area it exists in. Over the past month, however, it had only USD 1.5 recorded by NonFungible, with 1 sale. Looking at its chart, periods of low volume followed by spikes are not uncommon.","This is a virtual world, which consists of a city called Origin City, where players can buy land and build stores and art galleries. Cryptovoxels has had USD 246,850 in volume in the past month, 480 sales, and the average price of USD 514.","ENS is a distributed and open naming system that replaces the hex addresses employed in the Ethereum blockchain with human-readable addresses. Its volume for the past month is USD 35,000; it has some 1,770 sales, and the average price was USD 20.","In this decentralized city builder game, every building is a crypto token with ownership rights verified on the blоckсhain, and these tokens can be traded in the open market. MegaCryptoPolis’ monthly volume reached USD 94,500, with nearly 3,500 sales, and the average price of USD 26.","MLB Champions is a fantasy baseball game that uses Ethereum-backed digital collectible figures of Major League Baseball players. In the past month, it had USD 1,500 in volume, 80 sales, and USD 19 as the average price.","This digital collectible game enables players to purchase and trade dragons using ether, and each dragon comes with unique attributes and appearance. Hyper Dragons’ volume last month was USD 124, having achieved 35 sales, with the average price of USD 3.4.","__","Learn more:\nNon-Fungible Tokens: What Is It and What’s Been Happening in 2019\nNFT Devs Build While Users Follow Ethereum Price & Wait For Better Products"],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"Origin City","content":"LOCATION"},{"type":"Major League Baseball","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"Andrew Steinwold","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":".01%","content":"PERCENT"},{"type":"Axiom Zen","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Ryan Sean Adams","content":"PERSON"},{"type":"Adams","content":"PERSON"},{"type":"USD 19","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"NFT Devs Build While Users Follow Ethereum Price & Wait For Better Products","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Polynexus Capital","content":"ORGANIZATION"},{"type":"NonFungible","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"last month","content":"DATE"}],"hashtag":["Adoption","Gaming","Non-fungible tokens"],"authors":["Sead Fadilpašić"]}