{"summary":"Ethereum Moves Ahead With Plans for Earlier Transition to Proof-of-Stake","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-moves-ahead-with-plans-for-earlier-transition-to-pr-9607.htm","publishDate":"2021-03-19T10:52:24","id":17095,"type":null,"title":"Ethereum Moves Ahead With Plans for Earlier Transition to Proof-of-Stake","category":["Ethereum News "],"content":["Ethereum (ETH)’s planned move to a proof-of-stake (PoS) consensus mechanism appears to be gaining further momentum, after developers proposed merging the existing mainnet with the Ethereum 2.0 beacon chain as early as October.","The proposal arrives at the same time as another new Ethereum improvement proposal (EIP), EIP-3074, which has outlined batch transactions as a means of reducing existing Ethereum transaction fees. This proposal would be part of the London upgrade planned for July, which will also introduce a separate and much-discussed EIP-1559 that is designed to cut transaction costs by introducing fixed fees.","Such moves indicate that, after months of wondering when Ethereum 2.0 will arrive, the PoS-based upgrade might be closer than expected, accelerated in large part by the miner backlash over EIP-1559.","Submitted to GitHub yesterday, Mikhail Kalinin’s proposal is to accelerate the move to Ethereum 2.0, largely by ending work “on other initiatives” so that “the Merge becomes the main focus of Ethereum core developers” after the London upgrade.","In response to this proposal, Ethereum Foundation community manager Tim Beiko replied on GitHub with a link to a similar proposal from Tomasz Kajetan Stańczak, who wants to execute the upgrade in October, three months after London. It, therefore, seems that a growing number of developers and members of the Ethereum community are rallying around an earlier launch date for Ethereum 2.0.","Kalinin’s latest proposal also follows on from Vitalik Buterin’s “quick merge proposal” from last week, in which the Ethereum founder outlined a technical “mechanism by which a merge can happen quickly.”","It also arrives in the context of steps to reduce Ethereum’s currently high transaction fees.","Predictably enough, miners didn’t respond too enthusiastically to EIP-1559, with some of them planning to move their hashpower to the Ethermine pool on April 1 as a show of power.","This protest appears to have caused the present drive among developers to move more quickly to Ethereum 2.0 and proof-of-stake, which will do away with mining and miners altogether.","In the meantime, other Ethereum developers have introduced another proposal that could also help reduce transaction fees prior to the Ethereum 2.0 merge, thereby reducing miner revenues even further.","This proposal, EIP-3074, would enable sponsored transactions, where the fee for a transaction between a first and second wallet is paid for by a third wallet. It would also allow for greater transaction batching, which would help to indirectly reduce fees by as much as 20%.","If accepted, this proposal would be implemented as part of July’s London upgrade, which will also see the introduction of the 1559 proposal.","And if Mikhail Kalinin’s proposal to speed up the transition to Ethereum 2.0 is supported by the wider Ethereum development community, London would be the final major Ethereum upgrade before the move to PoS.","However, while the new proposal to accelerate the Ethereum 2.0 may be exciting for the Ethereum community, it doesn’t really seem to have affected the price of ETH. At the time of writing (10:35 UTC), ETH is almost unchanged in a day and a week. It’s up by almost 2% in a month and 1,440% in a year.\n___\nLearn more:\n– Ethereum Miners Are Likely to Accept EIP-1559 Activation – Analysts\n– EIP-1559 Won’t Lower High Ethereum Fees On Its Own – Professor\n– ETH ‘Insanely Cheap,’ DeFi To Rally, BTC Dominance to Drop – Pantera Capital CIO\n– What’s in Store for Ethereum in 2021?\n– Too Costly Ethereum is Pushing DeFi Users Away, Fuelling BNB Rally\n– Ethereum Miners Don’t Cause Price Volatility, Says Analyst"],"entity":[{"type":"1,440%","content":"PERCENT"},{"type":"Ethereum Miners","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Fuelling BNB Rally\n– Ethereum Miners Don’t Cause Price Volatility","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Pantera Capital CIO","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"1559","content":"DATE"},{"type":"Tomasz Kajetan Stańczak","content":"PERSON"},{"type":"Tim Beiko","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"3074","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Mikhail Kalinin","content":"PERSON"}],"hashtag":["Ethereum","Fees","Mining","Proof-of-stake","Proof-of-work"],"authors":["Simon Chandler"]}