{"summary":"Celestia’s TIA Price Falls 5%, as Capital Shifts to Upcoming Solana Meme Coin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/celestias-tia-price-falls-5-as-capital-shifts-to-upcoming-solana-meme-coin.htm","publishDate":"2024-05-08T13:24:30","id":17106,"type":null,"title":"Celestia’s TIA Price Falls 5%, as Capital Shifts to Upcoming Solana Meme Coin","category":["Industry Talk "],"content":["Celestia’s $TIA has fallen more than 5% in the last 24 hours to trade at $9.44 as of this writing.","TIA is the native token powering Celestia’s modular data availability blockchain, a new solution to the problem of scalability.","Celestia stems from British cybersecurity expert Mustafa Al-Bassam’s 2019 whitepaper, LazyLedger.","His goal was to create a blockchain ledger that doesn’t do any computation or execution, it just focuses on consensus and making transaction data on the ledger available for anyone to access and verify.","By outsourcing execution tasks to rollups and Layer 2s, Celestia claims it has found a potential solution to blockchain’s classic trilemma.","That’s the idea that improvements in a blockchain’s decentralization, security or scaleability necessarily result in compromises in the other categories.","Celestia’s intraday losses continue a two-week losing streak that has plunged TIA by 20%.","The token appears to be tracking broader market movements today. It is currently exaggerating losses posted by market leaders Bitcoin ($BTC) and Ethereum ($ETH).","Bitcoin fell 3.2% over the last 24 hours and currently trades at $62,708. Nearest rival Ethereum fell 4.1% over the same period and changes hands at $2,993.","Ethereum’s number one competitor as the blockchain for apps and DeFi, Solana ($SOL), posted heavier intraday losses of 8.1%, although at $145.71, that’s still about 20% pricier than it was this time last week. ","Celestia’s trading chart shows a token that has been in steady 55% decline since setting a new all-time high of $20.85 on February 10.","However, in spite of this, it has weathered crypto’s headwinds well. It bottomed out above $8 before spending late April\/early May seesawing between $9 and $12. ","A relative strength index (RSI) of 34 and falling indicates a continuing selloff.","This is likely to depreciate the token further in the short-term. ","","With a market cap of nearly $2 billion Celestia’s $TIA is the 60th biggest cryptocurrency in the world right now. It’s also one of several eye-catching protocols ushering in a new generation of scalability.","That said, it appears to be a little more volatile than the market leaders. Most cryptocurrencies this year rallied in step with Bitcoin and posted all-time or recent highs in early-to-mid March while TIA had peaked in early February.","Investors wanting to track market movements are perhaps better served by the plethora of exciting new meme coins. By buying in early during the presale, crypto fans can advantage of some sweltering price pumps if their token goes viral on listing.","Solana’s Sealana ($SEAL) the all-American redneck seal has already raised over a quarter of a million dollars in a hilarious new week-old presale. ","#Sealana, making #Memecoins great again! 🇺🇸","Manifesto\n1⃣ No Frogs 🐸\n2⃣ Less Hats 🧢\n3⃣ Many Whales 🐳\n4⃣ Zero Rugs 📉\n5⃣ More $SEAL 🦭 pic.twitter.com\/FEImgpWxWz","— Sealana (@Sealana_Token) May 7, 2024","","Sealana is a spin on South Park’s viral Gamer Guy, aka Fat Computer Nerd.","Gamer Guy appeared in the hit cartoon’s side-splitting World of Warcraft episode and became a viral meme all on his own thanks to his milk-bottle glasses, screen-locked stare, messy room and gravity-defying girth. ","He has symbolized anyone from the legions of disgruntled keyboard warriors writing sharp, acerbic opinions in internet comments sections, to a kind of Everyman – a symbol of the idler in everyone.","Sealana is Web3’s Everyman, beached at his desk and ballooning by the day. When he’s not making filthy degen trades, Sealana’s roving flippers reach for sustenance of chips and tinned tuna. ","For every 1 SOL, investors get 6,900 $SEAL tokens after the ICO’s concludes. ","Users can pay using a widget on the website or by sending SOL from a decentralized wallet to this address: DJ15ZYXqUNMYJ3hL7z4ciSaSFAw5cbos3YjGpdvwmF6c.","Follow the latest developments on Sealana’s X account.","Buy Sealana at the official website here. ",""],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"$ETH","content":"MONEY"},{"type":"8.1%","content":"PERCENT"},{"type":"$20.85","content":"MONEY"},{"type":"February 10","content":"DATE"},{"type":"$12","content":"MONEY"},{"type":"$SEAL","content":"MONEY"},{"type":"Sealana","content":"LOCATION"},{"type":"4.1%","content":"PERCENT"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"3.2%","content":"PERCENT"},{"type":"million dollars","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"$145.71","content":"MONEY"},{"type":"$9","content":"MONEY"},{"type":"April\/early May","content":"DATE"},{"type":"$8","content":"MONEY"},{"type":"Mustafa Al","content":"ORGANIZATION"},{"type":"$SOL","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"South Park","content":"LOCATION"},{"type":"$TIA","content":"MONEY"},{"type":"$9.44","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"$62,708","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"$2,993","content":"MONEY"},{"type":"$2 billion Celestia’s $TIA","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"May 7, 2024","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Celestia","sealana","TIA"],"authors":["Tim Hakki"]}