{"summary":"Bitcoin Miners’ Reserves Drops to Lowest Level Since 2021","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-miners-reserves-drops-to-lowest-level-since-2021.htm","publishDate":"2024-02-29T15:40:51","id":17105,"type":null,"title":"Bitcoin Miners’ Reserves Drops to Lowest Level Since 2021","category":["Bitcoin News "],"content":["Bitcoin (BTC) miners are offloading part of their assets as they look towards the upcoming halving amid increased market activity and the rising Bitcoin price.","New data from on-chain analytics firm Glassnode shows a drop in the amount of assets held by Bitcoin miners this year. The amount of Bitcoin in miner wallets has plunged by 8,426 since the start of the year as the next halving nears.","This is the lowest level since July 2021. Currently, miners’ Bitcoin holdings stand at 1,812,482 BTC, with some miners looking to take profits following the recent Bitcoin price hike.","Miners’ offload since January totaled $530 million, with serious fees following into centralized exchanges and other custodians.","The Bitcoin and entire cryptocurrency ecosystem braces for the next halving in April, which will reduce block rewards by 50%. Miners receive 6.25 BTC per block with the slash bringing rewards down to 3.125 BTC.","The halving event takes place every four years, and although rewards are slashed, it is generally perceived as a bullish activity. This is based on statistically increasing asset prices following halving due to the reduced supply.","Several crypto commentators opine that miners seek to bank on the higher processing fees before the slash in rewards.","Following the 2022 bear market, miners posted huge losses leading to focus pivots to Artificial Intelligence (AI), computing, and the sale of Bitcoin reserves to stay afloat.","Some miners also sold equipment to competitors and merged due to plunging asset prices. Following the uptick recorded with BlackRock’s spot Bitcoin ETF application, the Bitcoin price gained momentum, giving miners a lifeline.","Miners began posting quarterly profits as more institutional funds flowed into the market, causing a price uptick and wiping out losses of the previous year.","In December, Bitcoin miners offloaded $129 million worth of Bitcoin in a day to centralized exchanges after a brief selling pressure.","In a notable move, #Bitcoin miners have sold over 3,000 #BTC in just the last 24 hours, amounting to approximately $129 million. This substantial sell-off could influence the price of $BTC. pic.twitter.com\/mUl4ebDwpm","— Ali (@ali_charts) December 28, 2023","","Spot Bitcoin ETF approval in the United States led to an uphill run of the market leader and altcoins taking the total crypto market capitalization above $2 trillion.","Bitcoin miners moved $1 billion worth of assets to exchanges hours after ETF approval, a move interpreted as a sale or hedge to secure bigger investments.","The price surge after the approval ignited the interests of bullish traders, with miners hedging their assets to expand their capacity before April. At press time, over $5.2 billion has trickled into Bitcoin ETFs, showing strong institutional demand for the product."],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"$2 trillion","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"$530 million","content":"MONEY"},{"type":"December 28, 2023","content":"DATE"},{"type":"$129 million","content":"MONEY"},{"type":"$5.2 billion","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"}],"hashtag":["Bitcoin","ETF","Miners"],"authors":["David Pokima"]}