{"summary":"Associated Gas Pilot Could Lead to Huge Boon for Russian Bitcoin Miners","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/associated-gas-pilot-could-lead-to-huge-boon-for-russian-bit-8919.htm","publishDate":"2021-01-15T20:00:00","id":17110,"type":null,"title":"Associated Gas Pilot Could Lead to Huge Boon for Russian Bitcoin Miners","category":["Bitcoin News "],"content":["Russian Bitcoin (BTC) miners could be in for a massive, unexpected environmentally friendly windfall if a pilot leads the nation’s energy giants to embrace crypto mining en masse.","Further details have been unveiled about a plant operated by the oil arm of Gazprom, Gazprom Neft, which late last year invited miners to set up shop at an oilfield in the Khanty-Mansi region. The miners have been at work with a month-long Bitcoin mining effort.","Pumping oil from fields like these produces associate gas – not the intended target of the oil extraction.","Typically, such gas is flared – essentially just burned up – releasing pollutants into the atmosphere. But associated gas can also be converted on-site into electrical energy. And given the fact that the Khanty-Mansi region is located conveniently (from a mining perspective) in Western Siberia, famous for its icy winters, cooling costs are also low in the region.","The pilot, per Ugra-News, is seeing Gazprom Neft provide enough power to allow a setup of 150 Antminer ASIC S9 devices to mine a haul of BTC 1.8 (USD 64,000) in the space of a month, using power provided by 49,500 cubic meters of associate gas. The Gazprom subsidiary carried out the energy conversion process.","The media outlet says that “preliminary estimates” from 2020 show that in 2020 about 34 billion cubic meters of associated gas were produced in the region last year.","The miners at the oilfield paid “less than USD 0.04” per kW of energy. Businesses typically pay at least double that amount for electricity on average elsewhere in the country, according to Global Petrol Prices data.","But the ramifications of the pilot could be even bigger, as the pilot is in its early stages and there are at least nine such oilfields in the region. The media outlet quotes Natalya Komarova, the long-serving Governor of the Khanty-Mansiysk Autonomous Okrug, and a former MP, as stating,","“The region has several competitive advantages for hosting [crypto miners]. Among the favorable factors are low air temperature, which significantly reduces energy consumption, the availability of land plots that meet the basic requirements for the location of [mining] centers, a system of telecommunications and transport infrastructure.”","The pilot also has support in parliament from the likes of Pavel Zavalny the chairman of the parliamentary energy committee – a man who also happens to be the President of the Russian Gas Society. Zavalny was quoted as saying, albeit with several caveats about other potential uses of crypto and tokens’ legal status,","“Crypto mining is one of the ways to monetize cheap electricity where there is a surplus, or where the cost of electricity production is higher than market prices. In this case, it is economically more expedient to monetize bitcoin and exchange it for material goods in exchange. This is a competitive way to monetize the electricity generated.”","___","Learn more:\nBitcoin Mining in 2021: Growth, Consolidation, Renewables, and Regulation\nThis Is How Institutional Players Help Bitcoin Mining Industry Grow\nBitcoin Miners Are Using New Strategies to Hedge Risks\nBillionaire Turns to Bitcoin Mining To Help His Troubled Business\nPower-starved Abkhazians Face Internet Restrictions in Crypto Mining Crisis\nPolish Crypto Miner Prepares Its Services For South Korean Gamers\nVenezuelan Army Engineers Start Mining Bitcoin\nHenry Ford’s Energy Standard: A 100-Year Old Bitcoin Prediction"],"entity":[{"type":"Mansiysk Autonomous Okrug","content":"PERSON"},{"type":"Natalya Komarova","content":"PERSON"},{"type":"Khanty","content":"LOCATION"},{"type":"Western Siberia","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Khanty","content":"PERSON"},{"type":"Bitcoin Mining","content":"ORGANIZATION"},{"type":"Gazprom Neft","content":"ORGANIZATION"},{"type":"Antminer ASIC S9","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Gazprom","content":"ORGANIZATION"},{"type":"Pavel Zavalny","content":"PERSON"},{"type":"Mansi","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Crypto Mining Crisis\nPolish Crypto Miner Prepares Its Services For South Korean Gamers\nVenezuelan Army Engineers Start Mining Bitcoin\nHenry Ford","content":"ORGANIZATION"},{"type":"Bitcoin Mining Industry Grow\nBitcoin Miners","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Mining","Russia"],"authors":["Tim Alper"]}