{"summary":"The dYdX community is voting on a Wintermute proposal to upgrade to version 4 and introduce DYDX as the Layer 1 token for the upcoming dYdX Chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247845\/governance-proposal-for-upcoming-dydx-chain-goes-to-snapshot-vote","publishDate":"2023-08-29T06:44:52","id":1712,"type":null,"title":"Governance proposal for upcoming dYdX Chain goes to Snapshot vote","category":["CRYPTO ECOSYSTEMS"],"content":["The dYdX community is currently voting on a governance proposal from Wintermute that suggests upgrading the protocol to version 4 and introducing DYDX as the Layer 1 token for the new dYdX Chain.","The voting <a href=\"https:\/\/snapshot.org\/#\/dydxgov.eth\/proposal\/0x17026e18317dc29fe745d3130246a83b1485612da9c97e7261e8f659cf33663c\" data-v-f87c67ca=\"\">process<\/a> began today on the Snapshot platform and is slated to conclude on September 4.","Wintermute’s proposal includes a call for a creation of an Ethereum smart contract, commissioned by the dYdX Foundation. This contract will be designed to allow a one-way permissionless migration of DYDX tokens from the current Ethereum network to the dYdX Chain.","As of now, the vote on the Snapshot platform shows unanimous support, predominantly driven by 10 million votes from Wintermute. If the proposal gains 20 million votes in favor, it will transition into a \"long timelock\" proposal, set to be finalized on-chain.","This vote follows a recent blog post by the dYdX Foundation that <a href=\"https:\/\/www.theblock.co\/post\/243270\/dydx-evaluates-transitioning-token-to-native-asset-of-upcoming-layer-1-chain-on-cosmos\" data-v-f87c67ca=\"\">discussed<\/a> the possibility of migrating DYDX tokens from the Ethereum network to a Layer 1 protocol on the Cosmos network (currently on testnet) via a community vote.","“The dYdX Chain will be a proof-of-stake blockchain network and, as such, if and when deployed on mainnet, it will require a Layer 1 protocol token for staking to validators in order to secure the chain and for stakers of the Layer 1 token to govern the network,” Charles d’Haussy, CEO of the dYdX Foundation <a href=\"https:\/\/www.theblock.co\/post\/247160\/smart-money-traders-seemingly-increasing-dydx-token-holdings-nansen?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">told<\/a> The Block last week.","<em data-v-f87c67ca=\"\">Disclosure: Wintermute co-founder Evgeny Gaevoy sits on The Block’s board.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"Charles d’Haussy","content":"PERSON"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 4","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":["ASSETS","DEXS","GOVERNANCE VOTES","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}