{"summary":"FTX Opens Claim Window, Prices Crypto Assets Significantly Below Market Values","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ftx-opens-claim-window-prices-crypto-assets-significantly-below-market-values.htm","publishDate":"2024-03-04T20:30:15","id":17130,"type":null,"title":"FTX Opens Claim Window, Prices Crypto Assets Significantly Below Market Values","category":["Blockchain News "],"content":["Fallen crypto exchange FTX has opened its claim window for creditors to retrieve their crypto assets.","However, the exchange has faced criticism on social media from users who have blasted FTX for pricing major crypto assets significantly lower than their market values.","An X post on March 2nd from crypto reporter Colin Wu, who goes by the name @WuBlockchain, noted that the FTX claim window pricing set stands at $16,871 for BTC, $1,258 for ETH, $16.24 for SOL and $286 for BNB, well below current market prices.","FTX recently opened a claim window, and claims for major crypto assets were priced at $16,871 for BTC, $1258 for ETH, $16.24 for SOL, and $286 for BNB, which is a large gap from the current price.\nhttps:\/\/t.co\/zeKnz7fauy pic.twitter.com\/W8cPwzVz2g","— Wu Blockchain (@WuBlockchain) March 2, 2024","","At time of writing, BTC is currently trading at $66,660, with ETH at $3588,88, SOL at $129.93, and BNB at $415.10.","Social media users affected by FTX’s bankruptcy expressed outrage at the low prices.","“Stealing wealth with the approval of the law,” user @cryptocu84 said on X. “I hope a proper lawsuit will be setup for victims of this scam.”","FTX’s bankruptcy plan aims to reimburse customers based on crypto prices at the time of the exchange’s bankruptcy filing in November 2022. Although FTX asserts that U.S. bankruptcy law dictates claims to be valued using that date, some FTX customers contend that this approach undervalues volatile cryptocurrencies that have significantly appreciated in value since the market’s low point in 2022.\n","PwC Partners, the court-appointed liquidators for FTX assets, released an official statement on their website addressing the situation. FTX Digital Markets is undergoing a Chapter 11 settlement with FTX Trading and related debtors, the company noted, with the main objective being to consolidate assets from the estates of both entities.","PwC has informed creditors to submit electronic claims by May 15 this year. A claims portal managed by PwC is anticipated to begin its initial interim distribution in late 2024 or early 2025, with all eligible claims denominated in U.S. dollars.","FTX has issued a precautionary statement regarding its authorized investment manager, cautioning against unauthorized third parties attempting to bid on behalf of FTX Debtors. FTX clarified that the sale of Digital Assets by FTX Debtors, as mandated by a bankruptcy court order, is solely under the jurisdiction of Galaxy Asset Management, the court-appointed investment manager.","In its inaugural monthly communication to stakeholders on X, FTX emphasized that only Galaxy Asset Management is authorized to handle selling offers or buying requests."],"entity":[{"type":"2025","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Colin Wu","content":"PERSON"},{"type":"SOL","content":"ORGANIZATION"},{"type":"Galaxy Asset Management","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$3588,88","content":"MONEY"},{"type":"$129.93","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$1,258","content":"MONEY"},{"type":"$415.10","content":"MONEY"},{"type":"March 2, 2024","content":"DATE"},{"type":"May 15 this year","content":"DATE"},{"type":"PwC","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$16.24","content":"MONEY"},{"type":"$286","content":"MONEY"},{"type":"$1258","content":"MONEY"},{"type":"March 2nd","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"$16,871","content":"MONEY"},{"type":"$66,660","content":"MONEY"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["FTX","FTX Bankruptcy","FTX Creditors"],"authors":["Brian Yue"]}