{"summary":"Republican leadership say a proposed rule from the CFPB has an unclear impact on digital assets and wants the agency to take a step back. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275399\/republican-house-leadership-asks-cfpb-to-review-proposed-payments-rule-over-potential-impact-on-crypto","publishDate":"2024-01-31T11:28:34","id":1713,"type":null,"title":"Republican House leadership asks CFPB to review proposed payments rule over potential impact on crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Republican leadership in the House Financial Services Committee say a proposed rule from the Consumer Financial Protection Bureau has an unclear impact on digital assets and wants the agency to take a step back.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The rule, dubbed the 'Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications,' is not clear on whether it would apply to specific digital asset entities, lawmakers wrote in a letter to CFPB Director Rohit Chopra on Tuesday. House Financial Services Committee Chair Patrick McHenry, R-N.C., French Hill, R-Ark., and Mike Flood, R- Neb., signed the <a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/2024-01-30mchenry_hill_flood_cfpb_lpr_comment_letter_final.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a> and brought up other concerns about the rule.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Prior to finalizing any rule, we urge the CFPB to provide sufficient justification demonstrating the need for the proposed rule,\" they said. \"The justification should include a more detailed analysis of the scope of the proposed rule and its impact. Absent such justification, the CFPB should forgo finalizing the rule.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The rule was first proposed in <a href=\"https:\/\/www.consumerfinance.gov\/about-us\/newsroom\/cfpb-proposes-new-federal-oversight-of-big-tech-companies-and-other-providers-of-digital-wallets-and-payment-apps\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">November<\/span><\/a> and would give the CFPB the ability to supervise \"larger nonbank companies\" that have services like digital wallets and payment apps. The rule would require nonbank financial companies handling more than five million transactions a year to follow the same rules as large banks and credit unions, the CFPB said. Comments were <a href=\"https:\/\/www.consumerfinance.gov\/rules-policy\/rules-under-development\/defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">due<\/span><\/a> Jan. 8.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Many Republicans have historically not been fans of the CFPB, which was created in 2011 under the Dodd-Frank Act and is tasked with overseeing financial services offered to consumers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Bureau’s approach creates more regulatory uncertainty that could undermine the digital asset industry’s functionality with respect to digital asset transactions,\" the three lawmakers said in their letter.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Reps. McHenry, Flood and Hill also voiced concerns over the CFPB's proposed rule, even though the rule says explicitly that fiat-to-crypto and crypto-to-crypto transactions on an exchange would not be covered under the rule.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It remains unclear if this exclusion would exempt digital asset exchanges entirely, or only in instances where they offer services limited to the conversion of fiat-to-crypto and crypto-to-crypto transactions,\" they said. \"If the latter is true, then digital asset exchanges may be dissuaded from expanding their services to allow for peer-to-peer transactions through wallets hosted on the platform.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFPB told The Block that it received the letter and is reviewing it.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Crypto Council for Innovation said the CFPB's proposed rule could \"increase regulatory <\/span><span class=\"s3\" data-v-f87c67ca=\"\">fragmentation\" and noted in its Jan. 9 comment letter that the rule \"front-runs\" Congress.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"For the first time, and absent any congressional directive or prior industry engagement, the Bureau is looking to broadly sweep into its supervisory oversight digital asset activity that is already regulated under state and other federal frameworks,\" CCI said in its <a href=\"https:\/\/cryptoforinnovation.org\/comment-letter-cfpbs-proposed-rulemaking-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Peter Van Valkenburgh, director of research at Coin Center, said developers and publishers of crypto software should not be swept into the proposed rule.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"Mere software publishers engage in a constitutionally protected activity, expressive speech, and applying a supervisory regime to said persons would unconstitutionally burden that protected speech,\" according to a <a href=\"https:\/\/www.coincenter.org\/comments-to-the-consumer-financial-protection-bureau-on-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications\/\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">letter<\/span><\/a> sent earlier this month.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CCI","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Rohit Chopra","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Bureau","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Neb.","content":"LOCATION"},{"type":"Jan. 9","content":"DATE"},{"type":"Jan. 8","content":"DATE"},{"type":"CFPB","content":"ORGANIZATION"},{"type":"Peter Van Valkenburgh","content":"PERSON"},{"type":"Ark.","content":"LOCATION"},{"type":"General","content":"ORGANIZATION"},{"type":"Mike Flood","content":"PERSON"},{"type":"McHenry","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}