{"summary":"Avalanche Foundation Dives into Memecoin Market with $100 Million NFT Initiative","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/avalanche-foundation-dives-into-memecoin-market-with-100-million-nft-initiative.htm","publishDate":"2023-12-29T15:00:53","id":17148,"type":null,"title":"Avalanche Foundation Dives into Memecoin Market with $100 Million NFT Initiative","category":["Altcoin News "],"content":["The Avalanche Foundation, the nonprofit organization overseeing the development of the Avalanche Network, aims to allocate its $100 million non-fungible token (NFT) incubator fund to purchase memecoins. ","The move is part of the foundation’s “Culture Catalyst” initiative, which was initially launched in March 2022 to support promising NFT projects on the network.","The Avalanche Foundation plans to leverage the fund to create a collection of select Avalanche-based memecoins through this new initiative.","The goal is to recognize and encourage the culture and fun associated with meme coins, which the foundation believes go beyond their utility value. ","According to Avalanche, memecoins symbolize the collective spirit and shared interests of diverse crypto communities.","One user on X (formerly Twitter) summarized the news by stating, “TLDR: Avalanche Foundation to buy memecoins.” ","Another user humorously added, “We will be max bidding all memecoins on our chain.”","However, not all memecoins will be eligible for inclusion in the foundation’s collection. ","Avalanche clarified that stringent selection criteria will be applied, including factors such as the number of holders, liquidity thresholds, project maturity, principles of a fair launch, and overall social sentiment.","Recently, one memecoin that has gained significant attention within the Avalanche community is Coqinu (COQ), a rooster-themed token. ","Despite openly acknowledging its lack of intrinsic value and absence of a team or roadmap on its official website, COQ experienced a staggering surge of over 1.47 million percent between its inception on December 8 and its all-time high on December 20, according to DexScreener data.","Avalanche’s announcement comes amidst a marketwide frenzy for memecoins across various blockchain networks that support smart contracts or inscriptions. ","Traders have capitalized on these trends, with one individual turning a $450 investment into over $1.5 million in realized profit. ","The trader used 17.26 Avalanche tokens ($454) to acquire 4.86 trillion COQ through multiple wallets, subsequently selling a portion for 32,251 AVAX worth $1.26 million.","As of now, the trader still retains 250 billion COQ, which holds a value of $318,300 based on current prices.","As reported, the market for NFTs has experienced a resurgence, with October witnessing a substantial 32% growth in trading volume compared to the previous month.","According to data released by crypto data firm DappRadar, NFT trading volume surged by $99 million, reaching $405 million in October, signifying levels of sales not seen since August.","DappRadar pointed out that this growth marks a significant shift from the year-long downward trend in NFT trading.","The report highlighted the promising signs of recovery in this sector, offering renewed hope to projects that have faced challenges throughout this year."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"$405 million","content":"MONEY"},{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"COQ","content":"ORGANIZATION"},{"type":"$454","content":"MONEY"},{"type":"December 20","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"$318,300","content":"MONEY"},{"type":"March 2022","content":"DATE"},{"type":"December 8","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"$99 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"1.47 million percent","content":"PERCENT"},{"type":"$450","content":"MONEY"},{"type":"$1.26 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"250 billion","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["Avalanche","Meme coin","Memecoin"],"authors":["Ruholamin Haqshanas"]}