{"summary":"Blockchain Gaming Hits Another NFT-related Hitch in South Korea","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-gaming-hits-another-nft-related-hitch-in-south-ko-7770.htm","publishDate":"2020-09-22T03:00:00","id":17147,"type":null,"title":"Blockchain Gaming Hits Another NFT-related Hitch in South Korea","category":["News "],"content":["Blockchain, gaming and crypto advocates are bracing for the worst after the South Korean video game censor issued an ominous delay for ratings on another blockchain gaming title – over apparent non-fungible token (NFT)-related concerns.","Per iNews24, the regulatory Game Rating and Administration Committee (GRAC) has postponed the issuance of a rating for a game named Five Stars, developed for domestic tech giant Kakao’s Klaytn blockchain network.","The intricacies of South Korean law mean that unrated games cannot be circulated in the country. As previously reported, GRAC’s last blockchain gaming intervention was met with great disdain by the crypto and blockchain community, as well as gaming giants. Last year, the gaming regulator refused to issue the domestic gaming firm NodeBrick with a rating for a game called Infinity Star, effectively blocking its release.","The move provoked one industry expert into stating at the time,","“If NFT items are a problem, blockchain gaming’s death warrant has already been signed.”","GRAC appears to be concerned that NFTs can be traded for crypto, and thus converted to fiat, using networks such as Ethereum.","South Korea’s partial crypto crackdown, issued in early 2018, has apparently eased in recent months, with one major blockchain gaming player telling Cryptonews.com,","“Regulations will change in parallel with industry development and it will move in a direction that will prove to be comparatively moderate.”","GRAC’s latest move appears to run contrary to this, however.","iNews24 reports that SkyPeople, the developer of Five Stars, launched its bid for ratings approval with the regulator over a month ago, and has complied with multiple requests to provide GRAC with additional data on “blockchain functions.” It usually takes 15 days for GRAC to complete ratings issuance procedures.","SkyPeople described the process as “frustrating,” although the firm’s case is not yet a lost cause – as the regulator stated that it needs more time to deliberate, rather than issuing a flat refusal.","However, the same media outlet claimed that “virtually no” blockchain gaming titles have received GRAC ratings as of yet. Although South Korean firms can seek to issue their offerings on international platforms such as the Google Play Store, SkyPeople said,","“We want to respect the systems used by government agencies so that we can legally provide services in accordance with domestic gaming laws and regulations.”","It is perhaps ironic that Kakao’s own blockchain subsidiary so recently spoke of creating a “digital assets” trading “ecosystem” built around Klaytn, making reference to NFTs, at a recent event hosted by the government’s tech agency.\n___\nLearn more:\n‘First True Litecoin Game’ Is an RPG Knights and Wizard-fest\nLegend of Mir Developer Plays For Success In Blockchain Gaming Market"],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Administration Committee (GRAC","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"GRAC","content":"ORGANIZATION"},{"type":"Blockchain Gaming Market","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Klaytn","content":"LOCATION"},{"type":"Infinity Star","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"SkyPeople","content":"PERSON"}],"hashtag":["Blockchain","Gaming","Non-fungible tokens","Regulation","South Korea"],"authors":["Tim Alper"]}