{"summary":"Blockchain Investigator ZachXBT Retrieves Most of $177K Stolen DeGods NFT Funds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-investigator-zachxbt-retrieves-most-of-177k-stolen-degods-nft-funds.htm","publishDate":"2024-02-26T10:02:42","id":17142,"type":null,"title":"Blockchain Investigator ZachXBT Retrieves Most of $177K Stolen DeGods NFT Funds","category":["NFT News "],"content":["Pseudonymous blockchain investigator ZachXBT has successfully recovered the majority of funds from the sale of a rare DeGods non-fungible token (NFT).","The NFT was stolen in May 2023 after the original owner fell victim to a phishing scam. ","In a recent post on X, ZachXBT, known for his extensive investigations in the crypto space, revealed the outcome of his nine-month probe into the DeGods #3251 NFT theft.","The stolen NFT, which was sold in May 2023 for 99 Ether, equivalent to approximately $177,000 at the time, has now been returned to its rightful owner. ","“I am pleased to share that I was able to help recover a decent chunk of the stolen funds which have now been returned back to the victim,” he announced.","ZachXBT’s investigations can span various durations depending on the complexity of the case. ","He often employs visual aids, such as diagrams, to elucidate the mechanics of phishing scams and trace the movement of funds, even when they have been laundered through crypto mixers. ","“While recovery can be a lengthy process, it does happen, and I am always happy to share these success stories,” ZachXBT stated.","However, the renowned blockchain investigator also shared his intention to conclude his pro bono work in the field of blockchain investigations soon. ","This decision comes in response to frustration expressed by some users on X who expected him to help recover their stolen cryptocurrencies as well. ","Despite reiterating that his services are provided free of charge, ZachXBT decided to halt his public goods work due to the mounting criticism. ","“This is exactly why I am stopping all public goods work soon,” he declared.","ZachXBT has been a prominent figure in the crypto industry, lending his expertise in deciphering crypto crimes to individuals and even national authorities. ","In fact, in October 2022, French authorities relied on ZachXBT’s research to apprehend fraudsters involved in a $2.5 million NFT theft. ","Christophe Durand, the deputy chief of France’s national cyber unit, acknowledged that they became aware of the incident through ZachXBT’s investigation shared on social media.","More recently, ZachXBT tried to uncover concerning behavior involving the influencer Crypto Rover. ","The investigation revealed that Rover ghosted a crypto project he was paid to promote. ","1\/ An investigation into how the influencer Crypto Rover ghosted a project he was paid to promote, mislead followers about his trading positions, and also his shills for pump and dump meme coins. pic.twitter.com\/s4fDQubYwu","— ZachXBT (@zachxbt) February 20, 2024","","The online sleuth alleged that the influencer misled followers about his trading positions and participated in pump and dump schemes with meme coins.","To verify Rover’s involvement, ZachXBT mapped out transactions tied to Rover’s address.","The tracker found the connections to posts matching the amounts. ","Prior to this, ZachXBT alleged YouTube star KSI engaged in pump and dump scams. ","The accusations stem from KSI’s posts about crypto token investments. This includes a screenshot showing his wallet dumping $850,000 in XCAD Network (XCAD) tokens shortly after an endorsement. ","ZachXBT highlighted a similar pattern in 2021, where KSI posted favorably about Ethernity Chain (ERN) before selling around $350,000 in ERN tokens hours later."],"entity":[{"type":"$850,000","content":"MONEY"},{"type":"February 20, 2024","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"$177,000","content":"MONEY"},{"type":"$2.5 million","content":"MONEY"},{"type":"Christophe Durand","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"#3251","content":"DATE"},{"type":"KSI","content":"ORGANIZATION"},{"type":"$350,000","content":"MONEY"}],"hashtag":["Crypto hack","NFT"],"authors":["Ruholamin Haqshanas"]}