{"summary":"The world’s largest cryptocurrency exchange launches a self-custody wallet that works within the Binance app.\nThe announcement was made during its conference in Turkey.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262106\/binance-announces-self-custody-crypto-wallet-during-conference","publishDate":"2023-11-08T02:50:22","id":1714,"type":null,"title":"Binance announces self-custody crypto wallet during conference","category":["Exchanges"],"content":["Binance, the world's largest cryptocurrency exchange by volume, has launched a self-custody wallet that works within its native app.","The company made the announcement during its Binance Blockchain Week conference in Istanbul, Turkey, it said in a statement. \"Millions of Binance users can now explore and experience w<span class=\"s1\" data-v-f87c67ca=\"\">eb3, without the risk of losing seed phrases or struggling with complicated onboarding processes,\" Binance said in its statement.<\/span>","Binance's aim is that its customers will use the wallet to \"swap thousands of tokens across\" more than 30 networks, explore decentralized applications, transfer funds between exchange and wallet in addition to earning yield on digital assets, the company said.","\"To help drive web3 adoption, we have to identify and plug the gaps between centralized and decentralized systems,\" Binance founder Changpeng Zhao said in the statement. \"Binance’s web3 Wallet lowers the barriers of entry for users to achieve full self-custody of their assets.\"","Binance said in its statement that the wallet offers \"robust\" security through the use of multi-party computation technology. \"A user’s private keys are broken into three smaller parts known as key-shares. Having the key-shares split across three different locations mitigates the risk of the keys being compromised and reduces the vulnerability of the system,\" the company said. \"Funds held in the wallet are exclusively owned and accessible only by the user.\"","Although the prices of cryptocurrencies have rallied lately, led by Bitcoin, Binance's market share <a href=\"https:\/\/www.theblock.co\/post\/259575\/binances-marketshare-continues-to-decline-amid-rally\" data-v-f87c67ca=\"\">has experienced<\/a> a gradual decline, falling from 74% in December 2022 to 50% last month."],"hashtag":[]}