{"summary":"Argo has been forced to disclose inside information after forecasts discussed during a private meeting were posted on Twitter.\nThe filing reveals that the company’s Texan mining facility, which has drawn scrutiny from a short seller, could cost $1.5-2 billion to construct.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123386\/argo-filing-reveals-texas-mining-facility-could-cost-up-to-2-billion-to-build","publishDate":"2021-11-05T06:41:29","id":1715,"type":null,"title":"Argo filing reveals Texas mining facility could cost up to $2 billion to build","category":["Mining"],"content":["Argo Blockchain, the London-listed crypto miner, estimates that the cost of building and kitting out its proposed 800-megawatt mining facility in Texas could be $1.5-2 billion.","The company has been forced to disclose the estimate alongside several other key nuggets of inside information that were discussed in a meeting and subsequently posted on Twitter.","In <a href=\"https:\/\/www.investegate.co.uk\/argo-blockchain-plc--arb-\/rns\/disclosure-of-inside-information\/202111050700044333R\/\" data-v-f87c67ca=\"\">a regulatory filing<\/a> this morning, Argo stated that its representatives had met with equity portfolio manager Anthony Coyle on November 4. At the meeting, Argo’s employees “inadvertently disclosed certain information that could be viewed as material non-public information under U.S. securities laws or inside information under U.K. securities laws,” according to the filing. Coyle then published that information on Twitter — a post that has since been deleted.","Argo is listed on the London Stock Exchange in the United Kingdom and on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117601\/crypto-miner-argo-blockchain-ipo-nasdaq\" data-v-f87c67ca=\"\">the Nasdaq Global Market<\/a> in the United States. Its current market capitalization is £573 million (roughly $770 million).","The publication of the potential costs of constructing the mining facility in Texas comes just a few months after <a href=\"https:\/\/theboatmancapital.com\/wp-content\/uploads\/2021\/08\/Argo-Blockchain-090821_.pdf\" data-v-f87c67ca=\"\">a damning report<\/a> from short-seller Boatman Capital, which focused on the land on which the facility will be built.","Boatman argued that Argo’s $17.5 million purchase of the plot of land in question had been overpaid for by a factor of up to 100 times. &nbsp;In a video shared on social media at the time, Argo’s CEO Peter Wall defended the purchase as “a very solid deal” and a “project acquisition.”","In this morning’s filing, Argo stated that the $1.5-2 billion range is based on “numerous assumptions,” including the type of machines used at the facility, the mix of owned and hosted machines, raw material costs, labour and power costs, and when construction begins.","“The actual costs for Argo to build and kit out the Helios facility in Texas will also depend on the extent to which Argo decides to fully develop the property, which has not yet been determined,” said Argo in the filing.&nbsp;“Each of the foregoing assumptions is subject to numerous inherent risks and uncertainties, and, as a result, future results could differ materially from the estimated range above.”","In his post on Twitter, Coyle stated that Argo claimed it had achieved a 25% uplift in hash rate from the use of immersion cooling technology. Argo denied making the claim in its filing.","During the meeting, the company’s representatives told Coyle that Argo could, in the future, make up to 20% of its revenues from currencies other than bitcoin — its main focus at present. In this morning’s filing, Argo clarified that this was not intended as a forecast but as “directional insight.”","Another claim made by Argo’s representatives was that it had seen a 500% return on its investment in Equihash machines purchased in June 2020. “This statement was made to illustrate that return on investment can vary greatly, and this was a particularly favorable example,” said Argo in the filing.&nbsp;"],"hashtag":[]}