{"summary":"Crypto “Best Hedge” Against Inflation: Robert F. Kennedy Jr. at ETHDenver","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-best-hedge-against-inflation-robertf-kennedy-jr.htm","publishDate":"2024-03-04T08:38:02","id":17157,"type":null,"title":"Crypto “Best Hedge” Against Inflation: Robert F. Kennedy Jr. at ETHDenver","category":["Altcoin News "],"content":["US Presidential Candidate Robert F. Kennedy Jr. has hailed cryptocurrencies as the best hedge against inflation. ","In a recent discussion with Caitlin Long, founder and CEO of Custodia Bank at ETHDenver, Kennedy said that cryptocurrencies reclaim control from both the government and monopolistic institutions, offering a myriad of freedoms to individuals. ","“And among the freedoms that we’re concerned about is the freedom to keep the fruits of your labor, which inflation robs you of,” he said. ","The Presidential Candidate added that cryptocurrencies provide the best hedge against inflation, safeguarding individuals’ financial well-being.","There has been a growing interest and acceptance of cryptocurrencies as a safeguard against inflation, particularly in countries suffering from high inflation. ","During the conversation, Kennedy also expressed his growing realization that cryptocurrencies serve as an offramp from society’s addiction to the Federal Reserve’s money printing and the monopolistic banking system. ","He highlighted how these systems have funded wars and perpetuated a cycle of enriching a new oligarchy of billionaires while leaving the rest of the population impoverished. ","","“Transactional freedom is as important to a free society as the guarantees of freedom of expression,” he said. ","Kennedy emphasized that just as the First Amendment guarantees freedom of expression, the ability to engage in transactions freely is equally vital. ","He argued that if the government possessed the authority to shut down one’s bank account and deprive them of financial resources based on differing opinions, the essence of the First Amendment would be rendered meaningless. ","This realization, coupled with the trucker’s strike in Ottawa, sparked Kennedy’s interest in cryptocurrencies and alternative currencies as a means to circumvent government control.","Kennedy voiced concerns regarding the federal government’s current stance on cryptocurrencies, describing it as waging war against the innovative technology. ","He lamented the government’s efforts to stifle innovation, ultimately driving cryptocurrency operations offshore to Asia and parts of Europe.","As a presidential candidate, Kennedy vowed to position the United States as the global hub for cryptocurrency and blockchain innovation, fostering an environment conducive to progress in these transformative fields.","Notably, digital assets have already emerged as a campaign issue for Republican Party presidential candidates.","Florida Governor Ron DeSantis, who later withdrew from the race, expressed opposition to central bank digital currencies in the United States.","Former President Donald Trump has even vowed to prevent the introduction of a digital dollar should he be reelected.","During a recent interview, he called the prospect of a central bank digital currency (CBDC) a “very dangerous thing.”","As reported, approximately 73% of US voters believe that US presidential candidates should have an informed perspective on innovative technologies like artificial intelligence (AI) and cryptocurrency. ","Likewise, a recent report from Coinbase claimed that California voters who own cryptocurrencies are expected to have a significant impact on the 2024 elections.","It said that 78% of crypto holders in the state believe that policymakers should support “new, innovative, and disruptive technologies” and express their intention to vote for candidates who align with these views."," "],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Ron DeSantis","content":"PERSON"},{"type":"Custodia Bank","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"Kennedy","content":"PERSON"},{"type":"Kennedy","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"78%","content":"PERCENT"},{"type":"Robert F. Kennedy Jr.","content":"PERSON"},{"type":"Caitlin Long","content":"PERSON"},{"type":"Ottawa","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"73%","content":"PERCENT"},{"type":"Donald Trump","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Inflation","Kennedy"],"authors":["Ruholamin Haqshanas"]}