{"summary":"Ethernity Switches to AI Enhanced Ethereum Layer 2 to Prevent Counterfeit Asset Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethernity-switches-to-ai-enhanced-ethereum-layer-2.htm","publishDate":"2024-05-07T15:00:52","id":17150,"type":null,"title":"Ethernity Switches to AI Enhanced Ethereum Layer 2 to Prevent Counterfeit Asset Trading","category":["Ethereum News "],"content":["Non-fungible token (NFT) platform Ethernity, said it has switched to an artificial intelligence (AI) enhanced Ethereum Layer 2 network with new capabilities allowing the firm to combat counterfeit asset trading.","The Ethernity platform has authenticated and licensed NFTs for sports celebrities such as footballer Lionel Messi and the four-time NBA champion and prolific ad pitchman Shaquille O’Neal. Ethernity Chain is a community-oriented platform that produces limited edition authenticated NFTs by artists.","Ethernity said in its recent interactions with entertainment brands the firm found one barrier to adoption was privacy, cost and complex interfaces. These concerns have been addressed by the firm.","“Our goal is to revolutionize how entertainment brands engage with their audiences through web3 technologies,” said Nick Rose Ntertsas, co-CEO at Ethernity in a press release shared with CryptoNews. ","“By evolving into a Layer 2, we are not only expanding our capabilities but also providing a navigable, sustainable and secure environment for brands to create next-gen entertainment products and fan experiences,” adds Ntertsas","Ethernity said in its update it has reduced gas fees, and includes a plug-and-play toolkit, making it easier for entertainment brands to integrate their franchises into the blockchain.","The updated Ethernity Chain will include AI capabilities with comprehensive Digital Rights Management (DRM) controls allowing the platform to combat counterfeit asset trading and provide a secure environment for both users and brands.","Over the years, NFTs have been revolutionizing the concept of sports memorabilia from the NBA to mainstream football clubs and individual athletes, NFTs play an active role in sports merchandising.","In April, OKX, a leading global cryptocurrency exchange, teamed up with Manchester City to introduce commemorative football shirts that can be minted as NFTs. The initiative, named “Unseen City Shirts,” presents Manchester City fans, the reigning English football champions, with the opportunity to own exclusive memorabilia and win exciting prizes.","Currently, there are no specific laws or regulations which cover NFTs but in some countries, there are restrictions around NFT-related advertising.  In 2023, it emerged that Portuguese football player Cristiano Ronaldo had been hit with a class-action lawsuit seeking at least $1 billion in damages for his role in promoting NFTs from the cryptocurrency exchange Binance."],"entity":[{"type":"NBA","content":"ORGANIZATION"},{"type":"Lionel Messi","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Unseen City Shirts","content":"ORGANIZATION"},{"type":"Cristiano Ronaldo","content":"PERSON"},{"type":"Ethernity Chain","content":"ORGANIZATION"},{"type":"Manchester City","content":"ORGANIZATION"},{"type":"Manchester City","content":"LOCATION"},{"type":"Ntertsas","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Digital Rights Management","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Nick Rose Ntertsas","content":"PERSON"}],"hashtag":["AI","Ethereum","NFT Platform"],"authors":["Tanzeel Akhtar"]}