{"summary":"Bitfinex Market Analysts Predict $3.2 Trillion Crypto Market Capitalization – Here’s More","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitfinex-market-analysts-predict-3-2-trillion-crypto-market-capitalization-heres-more.htm","publishDate":"2023-12-22T19:01:29","id":17160,"type":null,"title":"Bitfinex Market Analysts Predict $3.2 Trillion Crypto Market Capitalization – Here’s More","category":["Blockchain News "],"content":["Bitfinex analysts say the digital asset market capitalization could hit $3.2 trillion if bullish factors remain amid soaring prices towards the end of the year.","In a new market report, the firm made market projections ahead of the new year with present market forces and indices highlighting the growth recorded so far amid regulatory challenges in several jurisdictions. ","According to the report, 2024 is met with a positive outlook from several quarters in the industry because of the drive of investors and asset prices pushing through despite a shaky start of the year.","Market analysts at the company predict the total market capitalization to tap $3.2 trillion with present bullish sentiment trickling into the new year. With the current market cap at $1.6 trillion, an uphill run hinged on several factors including institutional inflows on the back of a spot Bitcoin ETF.","The report touches on how wider macroeconomic conditions can affect the prices of crypto assets, noting a positive outlook ahead. Citing wages, demand, and inflation, cryptocurrencies can expect more inflows after a horrid 2022 riddled with plunging asset prices and gripping macroeconomic factors. ","This year with slowing inflation, investors continue to increase exposure to digital assets unlike in previous months when risky assets recorded exits. In the last two months, Bitcoin has posted massive gains soaring above $43,000 and hitting $1.6 billion in inflows in institutional funds.","“The inflation rate is also projected to decline in 2024. A combination of factors, including a subdued global economy and more efficient supply chains, is expected to keep commodity prices in check and support the manufacturing sector. An uptick in labor supply, observed in the latter part of 2023, is likely to moderate wage increases, helping to maintain inflation at manageable levels while correlating with a softening labor market.”","The firm’s bullish prediction on asset prices and institutional inflows into 2024 also includes a growing number of new digital asset users. Per the report, if present conditions remain, there would be a rising number of crypto users from 575 million to between 850 million and 950 million users. ","Multiple reports have also been released on an increasing number of crypto users globally as adoption and use cases grow. Coinbase CEO Brian Armstrong said on X that being anti-crypto is a bad stance going into next year’s United States elections because about 52 million Americans use digital assets.","👨🏻‍💻 Coinbase CEO Says an Anti-Crypto Stance is a Bad Political Strategy Ahead of 2024@coinbase CEO @brian_armstrong has said that an anti-crypto stance will be a bad political strategy for the 2024 elections.#CryptoNews #news https:\/\/t.co\/FWibwOMlMB","— Cryptonews.com (@cryptonews) December 20, 2023","","The adoption of Bitcoin by El Salvador and the pro-Bitcoin stance of Argentina’s President are also factors for a potential industry boom next year. Finally, the rise in mining activity with the next halving a few months away has led to more investment in the sector. ","“…Facing the prospect of seeing only half the Bitcoin being earned post halving, miners will need to demonstrate that they can continue to run their operations efficiently and profitably.”"],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"$43,000","content":"MONEY"},{"type":"Argentina","content":"LOCATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"$3.2 trillion","content":"MONEY"},{"type":"$1.6 trillion","content":"MONEY"},{"type":"last two months","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"December 20, 2023","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["Bitfinex","bullish","CRYPTO"],"authors":["David Pokima"]}