{"summary":"World Economic Forum Study Reveals 98% of Central Banks Are Eyeing CBDCs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/world-economic-forum-report-wholesale-cbdcs-use-cases.htm","publishDate":"2024-04-22T06:36:20","id":17168,"type":null,"title":"World Economic Forum Study Reveals 98% of Central Banks Are Eyeing CBDCs","category":["News "],"content":["The World Economic Forum (WEF) recently released a report investigating wholesale central bank digital currencies (wCBDCs). The document explored ongoing initiatives, potential use cases in financial markets, and the potential of wCBDCs to alleviate significant industry challenges and address key pain points.","It revealed that more than 98% of central banks worldwide are conducting research, pilot programs, or implementation of CBDCs to enhance the functionality of and broaden access to central bank money (CeBM).","“CeBM is ideal for systemically important transactions despite the emergence of alternative payment instruments,” the report states. “Wholesale central bank digital currency (wCBDC) is a form of CeBM that could unlock new economic models and integration points that are not possible today.”","The report states that CeBM is a particularly suitable choice for interbank payments and securities transactions due to several key characteristics. Firstly, CeBM eliminates credit and liquidity risks, aligning with the recommendations of the Principles for Financial Market Infrastructures (PFMI) for critical transactions. This reduces the possibility of financial instability stemming from these areas.","Secondly, CeBM facilitates final settlement of transactions. Backed by a robust legal framework, it guarantees the irreversible transfer of assets, fostering confidence and stability within the financial system.","Finally, CeBM promotes financial stability by acting as a virtually risk-free instrument. It complements existing credit creation processes without introducing additional risks, ensuring a healthy financial ecosystem.","The report identified eight longstanding challenges within the industry, with four specifically highlighted as areas where a wCBDC could offer significant value. These areas represent opportunities for modernization using wCBDC technology.","One key challenge is the issue of “disparate settlement cycles” in cross-border securities settlements. The globalization of capital markets necessitates harmonized settlement cycles across different regions. However, most real-time gross settlement (RTGS) systems operate within limited windows.","For instance, the Bank for International Settlements (BIS) has identified a narrow five-hour window (from 6 AM to 11 AM GMT) with maximum overlap between systems. To address this limitation, the report proposes that wCBDC could facilitate a global settlement window, effectively extending the reach of RTGS systems by offering near 24\/7 operation.","“This report offers key findings to facilitate further exploration of wCBDC and hopes to serve as a foundational step towards a more efficient, responsible and secure future for financial markets,” it said."],"entity":[{"type":"RTGS","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Principles for Financial Market Infrastructures","content":"ORGANIZATION"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"WEF","content":"ORGANIZATION"}],"hashtag":["CBDC","World Economic Forum"],"authors":["Shalini Nagarajan"]}