{"summary":"The European and Securities Markets Authority (ESMA) has shot a warning to the crypto industry after releasing its first set of MiCA proposals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239349\/eu-regulator-says-no-such-thing-as-a-safe-crypto-asset","publishDate":"2023-07-13T05:36:29","id":1717,"type":null,"title":"EU regulator says &#x27;no such thing as a safe crypto-asset&#x27;","category":["POLICY"],"content":["The European and Securities Markets Authority (ESMA) has shot a <a href=\"https:\/\/www.esma.europa.eu\/sites\/default\/files\/2023-07\/ESMA74-449133380-425_MiCA_Consultation_Paper_1st_package.pdf\" data-v-f87c67ca=\"\">warning<\/a> to the crypto industry after releasing its first set of MiCA proposals.","The new proposals for crypto-asset service providers (<a href=\"https:\/\/www.theblockresearch.com\/mica-european-unions-attempt-at-unified-regulation-230196\" data-v-f87c67ca=\"\">CASPs<\/a>) cover conflict-of-interest rules and how crypto firms should handle customer complaints. Speaking about the proposals, chairwoman of the ESMA Verena Ross advised consumers there is cryptocurrencies are still risky.","\"We are determined to ensure entities involved in crypto-asset related activities understand the EU is not a place for forum-shopping. We also want to remind consumers that, even with the implementation of <a href=\"https:\/\/www.theblockresearch.com\/mica-european-unions-attempt-at-unified-regulation-230196\" data-v-f87c67ca=\"\">MiCA<\/a>, there will be no such thing as a safe crypto-asset,\" Ross said in a statement.","Entitled, \"Technical standards specifying certain requirements of MiCA regulation,\" the proposal document is seeking the crypto industry's input on the bloc's <a href=\"https:\/\/www.theblock.co\/post\/238100\/afme-defi-mica-exclusion\" data-v-f87c67ca=\"\">MiCA regulatory<\/a> framework. The consultation lasts until September 20. The agency is asking crypto companies for confidential information about their expected revenue.","The regulator referred to recent collapses in the crypto world that show \"a misuse of clients’ funds and crypto-assets.\" It also pointed to \"media reports about hack attacks at CASPs, which have often resulted in the theft of significant amounts of client crypto-assets.”","MiCA takes effect in 2024 and gives wallet providers and exchanges the ability to operate across the 27-nation bloc with one license.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 20","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Ross","content":"PERSON"},{"type":"Securities Markets Authority (ESMA","content":"ORGANIZATION"},{"type":"ESMA Verena Ross","content":"PERSON"}],"hashtag":["EUROPEAN COUNCIL","EUROPEAN PARLIAMENT","EUROZONE REGULATION"],"authors":["Brian McGleenon","The Block"]}