{"summary":"Senior U.S. Military Airman and Cyber Analyst Charged with Money Laundering for NFT “Rug Pull” Scheme","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/senior-u-s-military-airman-and-cyber-analyst-charged-with-money-laundering-for-nft-rug-pull-scheme.htm","publishDate":"2024-02-27T20:26:46","id":17175,"type":null,"title":"Senior U.S. Military Airman and Cyber Analyst Charged with Money Laundering for NFT “Rug Pull” Scheme","category":["NFT News "],"content":["Two individuals, including a senior airman and cyber analyst in the U.S. military, have been charged for money laundering in connection to an NFT “rug pull” scheme, according to a February 23 statement from U.S. Immigrations and Customs Enforcement (ICE).","Devin Alan Rhoden (a.k.a Denny or Deviinz), 24, of Florida, and Berman Jerry Nowlin Jr. (a.k.a Repulse or Zayous), 20, of Alabama were indicted for money laundering and conspiracy to commit wire fraud following an investigation by Homeland Security.","According to the indictment, Rhoden and Nowlin “convinced hundreds of victims to invest tens of thousands in cryptocurrency in a non-fungible token collection named ‘Undead Tombstone.’”","The duo failed to follow through on their victims’ investments, instead stealing and ultimately laundering the funds.","Beginning in March 2022, Rhoden and Nowlin opened a number of social media accounts to promote “Undead Tombstone” to the masses. The value increased “significantly” in the following weeks, with the duo launching collections titled “Undead Apes” and “Undead Lady Apes.”","The following month, the co-conspirators announced their collaboration on X “with a well-known and successful NFT project.”","That same day, Roden and Nowlin “abandoned Undead Tombstone” before ultimately laundering and transferring the funds to cash.","“In a matter of weeks, the three NFT collections resulted in Rhoden and Nowlin receiving more than $300,000 in cryptocurrency from hundreds of victim-investors all over the world,” the indictment noted.","The scheme, known as a “rug pull”, occurs when a founder or investor hypes up a product only to suddenly abandon it at its peak and disappear with the funds.","Blockchain data firm Chainalysis reported that over $2.8 billion was lost to “rug pull” incidents in 2022 alone.","In this case, Rhoden and Nowlin utilized a technique called “chain-hopping” to obfuscate customer investments, where funds are transferred between different cryptocurrencies in hopes of evading law enforcement.","According to Elliptic, cross-chain-hopping reached a fever pitch in 2023 when the value of illicit crypto laundered through the technique reached an estimated $7 billion.","On February 26—three days after ICE’s statement—an NFT collection entitled “Undead Apes” was released on launchmynft.io by a user named AZEJGH…R57g.","🚨PUBLIC FREE MINT IS LIVE 🚨https:\/\/t.co\/hJKhwUHA3W#SolanaNFTs #Freemint #Solana #NFTCommunity","— Undead Apes ┃ FREE MINT (@Apes_undead) February 26, 2024","","At the time of article publication, it’s unclear whether the project is related to Rhoden and Nowlin and if it’s also an NFT rug pull scheme.","If convicted, both Rhoden and Nowlin face a maximum penalty of five years in federal prison."],"entity":[{"type":"February 26","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Devin Alan Rhoden","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February 23","content":"DATE"},{"type":"Homeland Security","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Nowlin","content":"PERSON"},{"type":"Roden","content":"PERSON"},{"type":"February 26, 2024","content":"DATE"},{"type":"$7 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Berman Jerry Nowlin Jr.","content":"PERSON"},{"type":"Alabama","content":"LOCATION"},{"type":"Rhoden","content":"PERSON"},{"type":"$2.8 billion","content":"MONEY"},{"type":"$300,000","content":"MONEY"},{"type":"Elliptic","content":"LOCATION"}],"hashtag":["anti-money laundering","NFT","rug pull"],"authors":["Julia Smith"]}