{"summary":"Plaintiffs who claim to be early investors in crypto derivatives exchange BitMEX have filed an amended lawsuit, arguing that they are collectively owed $540 million\nLast December, Frank Amato and RBG Coin Ltd filed a lawsuit, claiming that BitMEX owes them $300 million \nThe new lawsuit adds an additional plaintiff and the higher total amount in claims","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64901\/bitmex-amended-lawsuit-540-million","publishDate":"2020-05-12T09:55:19","id":1717,"type":null,"title":"Plaintiffs claim they are owed $540 million in amended BitMEX investor lawsuit","category":["Legal"],"content":["An amended investor lawsuit has been filed against crypto derivatives exchange BitMEX and founder Arthur Hayes, with the plaintiffs claiming that they are owed $540 million compared to the $300 million cited in an earlier complaint.","Last December, plaintiffs Frank Amato and RGB Coin Ltd – claiming to be BitMEX's first seed investors –&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-12-11\/crypto-exchange-bitmex-is-hit-with-300-million-investor-lawsuit\" data-v-f87c67ca=\"\">sued<\/a> the exchange for $300 million. Their $30,000 initial investment in BitMEX in 2015 was allegedly supposed to be converted into equity upon the exchange's first fundraising event, but they weren't given the equity, per the lawsuit at the time.","Amato and RGB Coin, therefore, wanted to recover the value of their equity, currently worth more than $50 million, and $250 million in punitive damages.","Now, per the amended lawsuit, filed late last month, an additional plaintiff named Elfio Guido has been added as the second seed investor in BitMEX.&nbsp;As such, the total equity rights amount claimed has risen from $50 million to $90 million, and punitive damages amount has been increased from $250 million to now $450 million.","\"Through this action, Plaintiffs accordingly seek (a) damages representing the value of their equity interest in BitMEX, which is conservatively estimated, jointly, to exceed $90,000,000, (b) damages from the failure to pay Plaintiffs' dividends during the period, and (c) punitive damages in an amount to be determined, but in excess of $450,000,000,\" according to the amended filing.","The plaintiffs argued that they took \"incredible risk\" and became BitMEX's first outside investors, but defendants \"cynically seek to deny Plaintiffs their rights or returns.\"","\"BitMEX's executives, especially Defendant Hayes, also have taken other actions, including violating state securities laws, that undermine and depress the value of Plaintiffs’ ownership,\" per the amended filing.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA BitMEX spokesperson told The Block: \"We will address these claims through the proper legal channels and will not comment beyond that.\"","The Block has also reached out to plaintiffs' lawyers but did not receive responses by press time.&nbsp;","<em data-v-f87c67ca=\"\">A full copy of the amended complaint can be found below:<\/em>","<a title=\"View First Amended Complaint on Scribd\" href=\"https:\/\/www.scribd.com\/document\/461066096\/First-Amended-Complaint#from_embed\" data-v-f87c67ca=\"\">First Amended Complaint<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe class=\"scribd_iframe_embed\" title=\"First Amended Complaint\" src=\"https:\/\/www.scribd.com\/embeds\/461066096\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-1vWTsaycHJYqT5oSX5B6\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"true\" data-aspect-ratio=\"0.7729220222793488\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update (May 13): This story has been updated to include comments from a BitMEX spokesperson&nbsp;<\/em><\/span>"],"hashtag":["BITMEX","LAWSUITS"]}