{"summary":"Hong Kong Businessman and Son Surrender to Police Over Kidnapping of Crypto Investor in $1.9 Million Dispute","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-businessman-and-son-surrender-to-police-over-kidnapping-of-crypto-investor-in-1-9-million-dispute.htm","publishDate":"2024-05-10T14:13:47","id":17188,"type":null,"title":"Hong Kong Businessman and Son Surrender to Police Over Kidnapping of Crypto Investor in $1.9 Million Dispute","category":["Blockchain News "],"content":["A Hong Kong businessman and his son have surrendered to police in connection with the abduction of a cryptocurrency investor, according to a local news outlet, the South China Morning Post, citing sources familiar with the matter.","The 70-year-old man and his 30-year-old son were arrested on suspicion of false imprisonment and assault, according to police sources. As of Thursday morning, they remained in custody for questioning.","Accompanied by their lawyer, the pair turned themselves in at Tai Po Police Station on Wednesday afternoon. They were subsequently arrested on suspicion of false imprisonment and assault. Although the surrendered suspects were not directly involved in the abduction itself, investigations revealed that the vehicle used in the incident belonged to their family.","The businessman’s frustration reportedly stemmed from his investment in the cryptocurrency project approximately 18 months ago. Despite initial optimism, the inability of the investor to repay the funds led to escalating tensions and, ultimately, the unfortunate abduction incident.","The businessman had allegedly invested approximately HK$15 million (US$1.9 million) in virtual currency around 18 months ago with the assistance of the victim, whom he had known through referrals. Preliminary investigations suggest that the businessman encountered difficulties retrieving the invested funds, and the victim was occasionally unreachable.","According to Hong Kong authorities, the abduction took place in the Sheung Shui residential district, where the victim’s husband attempted to intervene and was attacked with a stun gun. Both the husband and wife sustained injuries primarily to their limbs and were subsequently hospitalized for treatment.","As of midday on Thursday, police were still searching for the four individuals directly involved in the abduction and assault. Detectives from the Tai Po district crime squad are investigating this incident, which marks the city’s second abduction in 32 hours.","“We do not rule out the possibility that the four men were paid to carry out the job,” stated an unidentified source in the report.","According to local police in Hong Kong, losses from cryptocurrency scams surged to 1.7 billion Hong Kong dollars ($216.6 million) in 2022, marking a significant increase of 106% from the previous year. The number of reported crypto-related scams also saw a notable rise, reaching 2,336 cases in 2022, representing a 67% surge from 2021.","These scams accounted for over 50% of the total 3.2 billion HK$ ($407 million) stolen from city residents in technology-related crimes last year, as reported by the Hong Kong Police CyberDefender website. Over the past four years, online scammers have consistently targeted victims, with an annual amount of approximately 3 billion HK$ being siphoned off.","The surge in crypto-related scams has been attributed to the anonymity and complexity offered by cryptocurrencies, making it challenging for law enforcement to track the flow of funds and identify perpetrators. The Hong Kong police cybersecurity and technology crime bureau observed increased use of cryptocurrencies as a medium for online scams, complicating efforts to trace criminal proceeds.","According to sources, scammers often pose as experienced investors in crypto assets, precious metals, or foreign exchange products. They lure victims into installing fraudulent investment applications and promising fake transactions and returns. These tactics make it difficult for victims to discern the legitimacy of the investment schemes, leading to significant financial losses.","With almost 23,000 reported cases of technology-related crimes in 2022, the Hong Kong face growing challenges in combating online fraud, particularly within cryptocurrency."],"entity":[{"type":"$216.6 million","content":"MONEY"},{"type":"3.2 billion HK$ ($407 million","content":"MONEY"},{"type":"Hong Kong Police","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"67%","content":"PERCENT"},{"type":"Sheung Shui","content":"LOCATION"},{"type":"106%","content":"PERCENT"},{"type":"3 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"1.7 billion Hong Kong dollars","content":"MONEY"},{"type":"midday","content":"TIME"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Tai Po Police Station","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HK$15 million (US$1.9 million","content":"MONEY"},{"type":"afternoon","content":"TIME"}],"hashtag":["crypto scam","Hong Kong"],"authors":["Hassan Shittu"]}