{"summary":"New ERC-7231 NFT Standard Enters The Space","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-standard-enters-nft-arena-erc-7231.htm","publishDate":"2024-03-19T13:26:04","id":17180,"type":null,"title":"New ERC-7231 NFT Standard Enters The Space","category":["NFT News "],"content":["CARV, a self-sovereign identity oracle and AI-powered gaming app, recently announced the final approval of a new ERC-7231 NFT standard representing identity-aggregated non-fungible tokens (NFT).","According to the press release,through the standard, Ethereum has backed CARV’s plan for data self-sovereignty.","CARV stated that this is “a major step in bridging disparate digital identities and enabling users to own their online history, relationships, and experiences across platforms.”","“It’s been an exciting journey to get to this point,” CARV Co-Founder Victor Yu told Cryptonews.","ERC-7231 was initiated by CARV with a proposal submission in June 2023.","Following drafts and revisions, the Ethereum Foundation “greenlit” the proposal with a last call and final acceptance at the start of February.","Moreover, ERC-7231 is publicly available.","Yu stated that the team looks forward to the ecosystem adopting it and bringing users in on the value generation of their information.","The announcement explained that ERC-7231 binds multiple Web2 and Web3 identities to one NFT. It also achieves encrypted aggregation of multi-domain identity data.","Per CARV,","“The result is an “identity of identities” that enables self-authentication, social overlapping, and commercial value generation from targeted user data.”","Yu commented that “this solution breaks down identity silos and rewrites the rules of data ownership.”","The new standard, he said, enables a “new era of data-to-earn” in and beyond blockchain gaming. “Data self-sovereignty is now a reality across Ethereum and the sky’s the limit,” said Yu.","The standard offers three benefits:","Users can opt to share certain on-chain and off-chain identity information and then passively earn whenever brands leverage it.","CARV's not loud, but our impact is clear🌐","ERC-7231 is now an official standard, bringing every piece of your online self together, safely in your hands. ✋Own your data, protect your privacy.","Join us in this silent revolution🌱\nLearn more: https:\/\/t.co\/4lrWGscXw7#CARV…","— CARV (@carv_official) February 22, 2024","","Moreover, CARV ID is integrated with the standard.","Per the announcement, more than 800,000 users are playing games and earning rewards across CARV’s solution, which includes numerous layers, from foundational data stack to its gaming-focused application layer.","That said, ERC-7231 is “the key to stringing everything together,” it stated.","CARV has already seen great integration and use of the standard, said Yu for Cryptonews.","CARV ID, which follows ERC-7231, is adopted by more than 900,000 users globally across Southeast Asia, Japan, CIS, US, UK, and Latin America.","Daily active numbers are close to 500,000 across games and ecosystems.","Before this standard, Yu argued, understanding gamers has been difficult for games.","Users increasingly opt out of app tracking (IDFA), and shifting privacy regulations (CCPA) make data collection difficult.","With ERC7231, users can not only aggregate, own, and control their reputation, identities, and behavior across Web2 and Web3, but this quality zero- and first-party data can support games and artificial intelligence (AI) companies to create customized experiences.","","As for future plans, CARV aims to work with more Web2 and Web3 studios. The team wants to enable users to move across platforms interoperably.","On the tech side, “we welcome all user identity solutions to adopt ERC-7231 and usher in a new age of identity-aggregated NFTs,” said Yu.","ERC-404, launched shortly before ERC-7231, made quite an entrance in early February. It quickly became popular.","The ERC-404-based collection Pandora, though no longer in the first place, still ranks among the top 10 NFT collections per sales volume, per CryptoSlam.","Per GitHub, ERC-404 is an experimental, mixed ERC20 \/ ERC721 implementation with native liquidity and fractionalization. This means that it combines the ERC-20 (token standard) and ERC-720 (NFT standard).","Which ecosystem should we bring 404s to next?","— Pandora (@Pandora_ERC404) March 16, 2024","","Then in the second half of February, CARV launched ERC-7231.","“First and most importantly, ERC-404 is an experimental standard yet to be formally proposed for inclusion in Ethereum Improvement Proposals (EIPs),” Yu told Cryptonews. ERC-7231, on the other hand, is a fully finalized and approved ERC standard.","However, per Yu,","“It must be said that 7231 and 404 both move the needle toward democratizing asset ownership and the share of value creation – this is a good thing. However, each standard works in a different way.”","ERC-404 is a semi-fungible token that allows multiple wallets to own an NFT. But ERC-7231 binds multiple Web2 and Web3 identities to a single NFT holder.","Via this holder NFT, users can standardize their identities, modify the NFT based on behavior (data aggregation), and share in value generation from user targeting whenever brands leverage it on-chain and off-chain.","“The result is an “identity of identities” that achieves encrypted aggregation of multi-domain identity data, offering something for both games and gamers. A data win-win,” said Yu.","CARV is starting with gaming but there are many ways this technology can be used.","“Imagine AI-based healthcare solutions making earth-shattering breakthroughs with the help of access to clean and encrypted data from users, and then rewarding these users with the monetary value such breakthroughs are creating, enabled by smart contracts,” Yu concluded.","Notably, in mid-February, a different team of developers announced the launch of the ‘Divisible NFT’ standard (DN404), calling it “a hybrid ERC20\/721 token.","This team’s approach was to have two contracts: a “base” ERC-20 with a “mirror” ERC-721. You can read more about it here.","🌐Ethereum's Dencun upgrade @ethereum, it's a big step towards a more open and free economy.\nAt CARV, we are proud to align with this vision. Our significant achievement? The final approval of CARV's ERC-7231 identity-aggregated NFT standard! Together, we're building a more… pic.twitter.com\/3nZjn52U31","— CARV (@carv_official) March 13, 2024","",""],"entity":[{"type":"Southeast Asia","content":"LOCATION"},{"type":"Pandora (","content":"ORGANIZATION"},{"type":"Divisible NFT","content":"ORGANIZATION"},{"type":"CARV","content":"ORGANIZATION"},{"type":"Latin America","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"February 22, 2024","content":"DATE"},{"type":"March 16, 2024","content":"DATE"},{"type":"CIS","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"7231","content":"DATE"},{"type":"Victor Yu","content":"PERSON"},{"type":"June 2023","content":"DATE"},{"type":"second half of February","content":"DATE"},{"type":"mid-February","content":"DATE"}],"hashtag":["AI","Ethereum","NFT"],"authors":["Sead Fadilpašić"]}