{"summary":"Bitcoin-Based Strike Debuts Lightning Network Cross-Border Payments in Mexico – Crypto Adoption on the Rise","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-based-strike-debuts-lightning-network-cross-border-payments-in-mexico-crypto-adoption-on-the-rise.htm","publishDate":"2023-06-15T12:34:00","id":17183,"type":null,"title":"Bitcoin-Based Strike Debuts Lightning Network Cross-Border Payments in Mexico – Crypto Adoption on the Rise","category":["Blockchain News "],"content":["Bitcoin payments firm Strike has extended the reach of its cross-border payments service to Mexico, as the company aims to leverage the country’s expansive remittances market.","As of June 14, 2023, the company has introduced its ‘Send Globally’ service to the third-largest country in Latin America. The service allows users to send funds internationally, providing a convenient solution for cross-border transactions.","Based on data from BBVA Research, in 2021 94.9% of remittance payments flowing to Mexico originated in the US.","According to the digital payments firm, transfers to the country’s citizenry account for approximately 95% of total remittances processed by Strike from overseas senders.","With this move, U.S. dollars (USD) sent to Mexico via Send Globally “will be received as Mexican Pesos in the recipient’s bank account.” – helping to reinforce Strike’s presence in Latin America.  ","The announcement follows closely on the heels of Strike CEO and co-founder Jack Mallers’ recent revelation that the company has decided to bring its custody operations in-house. ","This strategic move eliminates the reliance on intermediaries as service providers.","I just published Strike Infrastructure Update: We Now Serve Customers on Our Own Infrastructure\n\nWe're proud to offer our own safe and reliable infrastructure to custody our customers' #Bitcoin and U.S. dollars.\nhttps:\/\/t.co\/rMBiXeG0zI","Notably, the company set up a headquarters in El Salvador for its global arm on May 24 as part of its effort to expand its app to more than 65 countries. Although, the primary headquarters remains in Chicago. ","Citing Strike’s vice president of products, Manuela Rios at the time:","Our end goal is to address the 7 to 8 billion people in every single country.","As a testament to that commitment, the company stated, “Strike’s expansion to Mexico brings a better alternative to 12 million Mexican Americans.”","This development will address the plight of an ever-growing number of Mexican migrants in the U.S., who suffer the brunt of “high fees, slow settlement, and lack of innovation in incumbent cross-border payments services.”","The Send Globally service runs on the Lightning Network, a Layer-2 payment protocol built on top of Bitcoin.","The Lightning Network enables cheap and fast transactions, making it an attractive solution for the remittance industry.","The service comes at a time when network congestion is a big concern, as witnessed recently when Binance exchange complained of Bitcoin (BTC) network backlog.","We've temporarily closed $BTC withdrawals as the #Bitcoin network is experiencing a congestion issue.\n\nOur team is currently working on a fix until the network is stabilized and will reopen $BTC withdrawals as soon as possible.\n\nRest assured, funds are SAFU.","Notably, Argentina, another country in Latin America, has recently introduced an online course that educates individuals about the Lightning Network.","This serves as evidence of the increasing acceptance of cryptocurrencies, as countries and companies actively work on developing the necessary infrastructure to foster innovation."],"entity":[{"type":"June 14, 2023","content":"DATE"},{"type":"May 24","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"Manuela Rios","content":"PERSON"},{"type":"Latin America","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Mexico","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"Jack Mallers","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Chicago","content":"LOCATION"},{"type":"$BTC","content":"MONEY"},{"type":"BBVA Research","content":"ORGANIZATION"},{"type":"94.9%","content":"PERCENT"}],"hashtag":["Argentina","Binance","Bitcoin","Layer-2","Lightning Network"],"authors":["Lockridge Okoth"]}