{"summary":"FBI Busts $43M Crypto and Las Vegas Hospitality Ponzi Scheme","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fbi-busts-43m-crypto-and-las-vegas-hospitality-ponzi-scheme.htm","publishDate":"2024-05-02T11:57:56","id":17194,"type":null,"title":"FBI Busts $43M Crypto and Las Vegas Hospitality Ponzi Scheme","category":["Blockchain News "],"content":["The FBI arrested New York resident Idin Dalpour for defrauding investors of $43 million in a multi-year Ponzi scheme that included a Las Vegas hospitality business and crypto trading operation.","On May 1st, the  Federal Bureau of Investigation (FBI), alongside a New York court, charged Dalpour. ","According to a press release from the Manhattan District Attorney’s office, Dalpour allegedly lured unsuspecting investors with promises of substantial returns that were nothing more than a facade to conceal a large-scale Ponzi scheme. ","The Scheme ran from 2020 through April 2024, targeting investors located in the U.S. and abroad.","Through an entity he controlled, Dalpour solicited investments in fictitious business ventures. These ventures included a Las Vegas hospitality enterprise and a crypto trading enterprise.","Today @SDNYLIVE charging IDIN DALPOUR with wire fraud in connection with a multi-year Ponzi scheme that defrauded investors of $43 million, purporting to have an interest in a Las Vegas hospitality enterprise and a cryptocurrency trading enterprise. pic.twitter.com\/o4Bd0Jyus4","— Inner City Press (@innercitypress) May 1, 2024","","Dalpour enticed investors with promises of lucrative annual returns starting at 42%. This was reinforced with purported insurance and escrow arrangements to create false security in their investments. US Attorney Damian Williams said:","“Idin Dalpour told investors that they could reap huge returns by investing through him in a purported Las Vegas hospitality business and a crypto trading operation.”","These ludicrous prospects were backed with fabricated contracts, falsified bank statements, and fictitious email correspondence which lulled investors into believing in the viability of the ventures.","As part of the purported Las Vegas hospitality enterprise, Dalpour falsely represented that his “entity” had contracted with a Management Company and a prominent Las Vegas hotel. ","Dalpour Allegedly falsified proceeds from entertainment packages for the hotel and visitors to several Las Vegas-based sports stadiums.","In connection with the Las Vegas Ponzi scheme, Dalpour further misrepresented a so-called crypto trading enterprise, which he operated. ","As part of the cryptocurrency trading scheme, he claimed that he purchased crypto at wholesale. He then presumably sold it at a profit to retail investors.","In reality, the investor funds were siphoned off to fulfill earlier investors’ returns, with Dalpour pocketing the difference. ","In all, he accumulated over $43 million, which he used to finance personal expenses. These included approximately $1.7 million in gambling losses, over $400,000 from Art Direct, and private school tuition for his children.","The scheme came crashing down in November 2023 when a group of victims confronted Dalpour. He confessed to all his wrongdoings: the fake ventures, falsified documents, and misallocated funds.","Dalpour acknowledged the gravity of the situation. In his own words, “[w]hat you already have, you have, you can put me in jail now. Like right now.”","As crypto adoption rises, it has become increasingly prevalent in scam operations, organized crime, and money laundering schemes. ","Dalpour’s arrest is just one event in a string of cryptocurrency-related Ponzi schemes stopped by US officials in the last year.","On March 15th, the US Securities and Exchange Commission (SEC) took legal action against 17 individuals involved in an alleged $300 million Ponzi scheme operating under the name CryptoFX, a cryptocurrency trading platform.","Days earlier on March 18th, a New York jury convicted two people who promoted the now-defunct fake crypto mining and trading scheme IcomTech.","Most recently, on April 4, Irina Dilkinska, the former head of legal and compliance for the multibillion-dollar OneCoin fraud scheme, received a four-year jail sentence after admitting to her role in laundering millions of dollars.","Cryptocurrency-based crime is an emergent issue that has prompted a response from jurisdictions around the world. Education is key to protect those vulnerable to crypto scams.","Representing Dalpour’s arrest, FBI Assistant Director James Smith said: ","“Today’s arrest illustrates the FBI’s dedication to maintaining economic justice and ensuring the actions of one individual are not at the expense of others.”"," "],"entity":[{"type":"April 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$400,000","content":"MONEY"},{"type":"$43 million","content":"MONEY"},{"type":"March 18th","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"Management Company","content":"ORGANIZATION"},{"type":"$1.7 million","content":"MONEY"},{"type":"March 15th","content":"DATE"},{"type":"Damian Williams","content":"PERSON"},{"type":"Idin Dalpour","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"May 1st","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"James Smith","content":"PERSON"},{"type":"laundering millions of dollars","content":"MONEY"},{"type":"May 1, 2024","content":"DATE"},{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"April 4","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Irina Dilkinska","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Dalpour","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"2020","content":"DATE"}],"hashtag":["crypto scam","FBI","United States"],"authors":["Harvey Hunter"]}