{"summary":"Solana NFT Weekly Sales Hit $62M, Surpassing Bitcoin Network","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nft-sales-solana-bitcoin-ethereum-weekly-trading-volume.htm","publishDate":"2024-01-25T08:54:54","id":17198,"type":null,"title":"Solana NFT Weekly Sales Hit $62M, Surpassing Bitcoin Network","category":["News "],"content":["Weekly NFT sales on Solana experienced a surge this past week, surpassing Bitcoin.","Cryptoslam data reveals that the blockchain’s weekly trading volume exceeded $62m between Jan. 18 to Jan. 25.","It’s worth noting that around $3.4m constituted wash volume, or trading designed to create the illusion of market activity.","Even so, the weekly NFT sales volume on Solana marks an impressive increase of nearly 17% compared to Bitcoin’s volume of $53m.","Apart from Ethereum, #Solana has witnessed booming #NFT activities during the week with sales volume surging to $62M, surpassing even #Bitcoin!","The NFT landscape on Solana has been welcoming great developments non-stop, expect more to come in the future as it flourish#SOL $SOL pic.twitter.com\/U1bGGLGAdg","— Solanians (@SolaniansHub) January 25, 2024","","In December, Solana surpassed Ethereum with NFT sales exceeding $365m.","While January had a sluggish start, it’s clear that sales gained momentum at $192m.","Froganas, CryptoUndeads, Claynosaurz, Sujiko Warriors and Tensorians were among the top collections on Solana.","Solana’s accomplishment in surpassing Ethereum and Bitcoin in NFT sales volume carries weight, particularly because Ethereum has been a dominant force in the NFT market.","The competition between Solana and Ethereum in the NFT space, especially, is expected to drive further innovations and improvements in the NFT market.","Still, Ethereum has maintained its lead for the month with NFT sales volume reaching $291m as of Jan. 25.","NFTs debuted on Solana in 2022, with OpenSea announcing its incorporation of Solana NFTs in April.","This jumpstarted NFT trading on Solana, leading to major sales growth that ultimately saw Solana surpass Ethereum in NFT sales volume.","The priciest Solana NFT so far hails from the SolanaMonkeyBusiness collection. In specific, the SolMonkey #1355 went for a whopping 13,027 SOL, roughly translating to $2.1m at the time.","Solana is seen as a blockchain offering similar services and apps as Ethereum, but with fewer downsides.","That has made the community discuss how it could potentially steal Ethereum’s thunder down the road.","Notably, one of its strong suits is how it deals with transaction hiccups and its increasing love from the NFT and gaming crowds.","On Wednesday, Solana launched token extensions. These are designed “to cater to builders across various industries,” including payments, stablecoins, and real-world assets.","Solana last traded at $87.76, and is down around 13% in the last week, TradingView data showed."],"entity":[{"type":"$3.4","content":"MONEY"},{"type":"$2.1","content":"MONEY"},{"type":"17%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$SOL","content":"MONEY"},{"type":"$62m","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$192m","content":"MONEY"},{"type":"$291m","content":"MONEY"},{"type":"Claynosaurz","content":"PERSON"},{"type":"Solana NFTs","content":"ORGANIZATION"},{"type":"1355","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$87.76","content":"MONEY"},{"type":"Jan. 25","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Sujiko Warriors","content":"ORGANIZATION"},{"type":"Jan. 18","content":"DATE"},{"type":"$365m","content":"MONEY"},{"type":"$53m","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"January 25, 2024","content":"DATE"},{"type":"$62M","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","NFT","Solana"],"authors":["Shalini Nagarajan"]}