{"summary":"The cross-chain protocol Wormhole closed a $225 million funding round, netting the firm a $2.5 billion valuation. \nAlso announced was the launch of Wormhole Labs, an independent technology company that became the core contributor to Wormhole. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265184\/cross-chain-protocol-wormhole-closes-225-million-funding-round-at-2-5-billion-valuation","publishDate":"2023-11-29T10:06:23","id":1719,"type":null,"title":"Cross-chain protocol Wormhole closes $225 million funding round at $2.5 billion valuation","category":["Companies"],"content":["Crypto bridge developer Wormhole closed a funding round of $225 million, securing the firm a valuation of $2.5 billion.&nbsp;","Investors included Brevan Howard, Coinbase Ventures, Multicoin Capital, Jump Trading, ParaFi, Dialectic, Borderless Capital, Arrington Capital and others, according to a statement.","\"We are ecstatic to bring more new and groundbreaking products to market as we head into next year, and look forward to continuing to support our ecosystem of developers who are building with our tools every day to expand their businesses and build great experiences for users,\" Wormhole Foundation chief operating officer Dan Reecer said in the statement.&nbsp;","Along with the funding news, Wormhole launched an independent technology company called Wormhole Labs, which came out from stealth and has become Wormhole's core contributor.&nbsp;","Wormhole's investor Jump Trading rescued the bridge when it lost <a href=\"https:\/\/www.theblock.co\/linked\/132841\/256-million-in-eth-stolen-from-cross-chain-protocol-wormhole\" data-v-f87c67ca=\"\">120,000 ETH<\/a> in a February 2022 hack, replenishing the <a href=\"https:\/\/www.theblock.co\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\">$325 million<\/a> in stolen funds soon after the exploit. On Nov. 17, Jump opted to make Wormhole its own <a href=\"https:\/\/www.theblock.co\/post\/263539\/jump-trading-makes-cross-chain-protocol-wormhole-a-separate-business-bloomberg\" data-v-f87c67ca=\"\">separate<\/a> business, The Block previously reported.&nbsp;"],"hashtag":["STRATEGIC INVESTMENTS"]}