{"summary":"Edward Snowden Predicts Government Bitcoin Buys, US Transfers 15,085 Bitcoin Following Price Surge","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/edward-snowden-bitcoin-buys-us-transfers-15085-bitcoin-following-price-surge.htm","publishDate":"2024-02-29T17:35:27","id":17203,"type":null,"title":"Edward Snowden Predicts Government Bitcoin Buys, US Transfers 15,085 Bitcoin Following Price Surge","category":["Bitcoin News "],"content":["Bitcoin wallets linked to the United States government have seen $922 million worth of assets moved since the asset’s price hit $60,000, while Edward Snowden came out with an interesting prediction regarding government involvement with Bitcoin.","The transactions included 15,085 BTC and were carried out after the price surge as bulls kept up buying momentum.","On-chain data from Arkham Intelligence shows accounts linked to the government made four transactions on Feb 28. The first was a transfer of 1 BTC worth $60,000 before a second transfer of 2,817 BTC, worth approximately $172 million at the time.","Subsequently, they made the final two transactions, 0.01 BTC and 12.267 BTC, worth  $748 million. The transfers drew interest from the wider cryptocurrency community as the wallets involved in these movements are linked to Bitcoin seized following the Bitfinex hack in 2016.","Approximately 119,755 BTC worth over $72 million was stolen from Bitfinex in 2016. This amount is now valued at over $7 billion, as the Bitcoin price skyrocketed in the past several weeks.","Bitcoin moved past $60,000 on Feb 28, posting over 40% gains in the last month. The valuation spike is linked to institutional inflows on the back of a spot Bitcoin ETF approval by the United States Securities and Exchange Commission (SEC).","Amid speculations on social media spaces as to the reason behind the sudden transfer, some analysts point out that it was for law enforcement purposes.","Meanwhile, technology specialist Edward Snowden predicted that information revealing a national government has been buying Bitcoin will come out. Snowden also called the asset “the modern replacement for monetary gold.’","Prediction: A national government will be revealed this year to have been buying Bitcoin—the modern replacement for monetary gold—without having disclosed that fact publicly.","— Edward Snowden (@Snowden) February 28, 2024","","After the Bitfinex hack, authorities clamped down on IIya Lichtenstein, the suspected bad actor accused of stealing the assets.","The United States Department of Justice (DOJ) confirmed in 2023 that about 95,000 BTC was in his possession after seizures.","A recent Bloomberg report shows Lichtenstein appeared in court a day before the transfer of assets. The defendant told the jury how he used Bitcoin  Fog multiple times to launder assets.","“US prosecutors have accused Roman Sterlingov of operating the mixing service, which they claim received tens of millions of dollars from darknet markets known for trafficking in illegal drugs. Sterlingov’s attorney, Tor Ekeland, has argued that there is no evidence such as eyewitness accounts and server logs to link his client to running the mixer.”","Lichtenstein explained that his motivation resulted from his struggling tech start-up at the time while giving more information on the 2016 incident.","He was arrested alongside his wife last year with prosecutors alleging a conspiracy to launder $4.5 billion worth of assets while the government seized $3.6 billion of the stolen funds."],"entity":[{"type":"2016","content":"DATE"},{"type":"$72 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"$3.6 billion","content":"MONEY"},{"type":"$172 million","content":"MONEY"},{"type":"February 28, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Snowden","content":"PERSON"},{"type":"$60,000","content":"MONEY"},{"type":"Edward Snowden","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"$748 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Tor Ekeland","content":"LOCATION"},{"type":"Lichtenstein","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"$4.5 billion","content":"MONEY"},{"type":"$7 billion","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"United States Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Feb 28","content":"DATE"},{"type":"$922 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Bitfinex","US Government"],"authors":["David Pokima"]}