{"summary":"Chainlink Labs has announced a program for encouraging blockchain ecosystem development related to oracles. \nThe program’s goal is to help with Layer 1 and Layer 2 blockchain ecosystem acccess and cost barriers to oracle services. \nAvalanche, Metis, Moonbeam, and Moonriver are the first chains to join the SCALE program.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173405\/chainlink-announces-ecosystem-growth-program-called-scale","publishDate":"2022-09-28T10:33:44","id":1721,"type":null,"title":"Chainlink announces ecosystem growth program called ‘SCALE’","category":["Cryptocurrency"],"content":["Chainlink Labs, a provider of blockchain oracles, has announced a program for encouraging blockchain ecosystem development related to oracles.&nbsp;","SCALE stands for “Sustainable Chainlink Access for Layer 1 and 2 Enablement.” The program’s goal is to grow decentralized application ecosystems in the Layer 1 and 2 space by helping with access and cost barriers to oracle services and configurations.","Chainlink oracles allow on-chain smart contracts and applications to utilize off-chain data in a secure and decentralized manner.","Chainlink's services are used by a wide variety of blockchain applications that handle a lot of value. In fact, Chainlink's Transaction Value Enabled (TVE) — which is a measure of its total value of facilitated transactions — sits at $6.1 trillion, Chainlink CEO Sergey Nazarov told The Block. This figure includes transactions such as swaps, borrowing, and derivatives.","The SCALE program is an initiative within Chainlink’s broader <a href=\"https:\/\/blog.chain.link\/chainlink-staking-roadmap\/\" data-v-f87c67ca=\"\">Economics 2.0<\/a> program, which aims to improve data security, utility, and operating costs of Chainlink oracle services.","The initial blockchains collaborating with Chainlink Labs on this initiative are Avalanche, Metis, Moonbeam, and Moonriver. Each ecosystem will contribute toward oracle networking operating costs.","Nazarov said Chainlink Economics 2.0 and SCALE put in a place a “holistic economic model” that is viable for the long-term success of blockchains, decentralized applications, and the Chainlink ecosystem."],"hashtag":["AVALANCHE","STAKING"]}