{"summary":"Aave Stablecoin GHO Hits $1 Peg After Six Months – Here’s More","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/aave-stablecoin-gho-hits-1-peg-after-six-months-heres-more.htm","publishDate":"2024-02-07T15:21:01","id":17216,"type":null,"title":"Aave Stablecoin GHO Hits $1 Peg After Six Months – Here’s More","category":["Blockchain News "],"content":["Aave’s GHO stablecoin has hit the $1 mark after trading below the peg for over six months since its launch in July 2023.","The asset’s price hit $1 on Feb 6 following efforts from the wider community, which included integrations with the Aave decentralized finance (DeFi) lending protocol.","Stani Kulechov, the founder of Aave, wrote on X (formerly Twitter) praising the wider community’s efforts in the last six months as the over-collateralized GHO hit its peg.","“Was a long journey for the Aave community to get here and now finally after 6 months the overcollateralized GHO is finally at peg. Congrats to the Aave community for enabling fundamental building blocks for DeFi and payments.” ","GHO is minted on the Aave platform when it is borrowed against collateral. The token struggled for months because of low demand and other factors hindering GHO swaps for fiat.","As DeFi activity picks up across several networks, the community projects the asset can maintain its price with more demand coming into the market.","📊🧐 DeFi TVL Reaches $60 Billion, Highest Level Since August 2022","Short recap 👇","— Cryptonews.com (@cryptonews) February 6, 2024","","The DeFi market capitalization stands at $78.4 billion, with a trading volume of $2.8 billion in the last 24 hours as the broader cryptocurrency market rebounds after slight corrections.","Currently, there are 1.3 million GHO tokens in circulation, with an 84% decline in trading volumes in the last 24 hours.","The integration of GHO to Aave’s Safety Module appeared to be a factor helping the price surge and boosting GHO to its $1 destination.","Safety modules are tokens locked away to be distributed in the event of a downturn, acting as a form of reserve. Specifically, by the platform’s proposal, users will earn yield for holding and staking the token. The 10% yield attracted needed inflows and positive community reactions to increase the rate of Network activity.","Users can now borrow GHO tokens with their USDC or USDT stablecoins and also redeem tokens through Aave on a 1:1 basis.","Since its launch, the asset has been on a slight decline below the $1 mark before key integrations that attracted more traction to the token. Last year, the stablecoin dropped as low as $0.96 in November.","Aave announced the rollout of GHO stablecoin on July 16, describing it as over-collateralized and backed by several assets, including Ethereum (ETH) and Aave.","“All transactions are performed through self-executing smart contracts, and all data regarding GHO transactions is available and auditable directly from the blockchain or via numerous user interfaces.”","The launch came into effect after a governance vote that saw almost all participating addresses vote in favor. Hitting the peg for the stablecoin remains the first step in its drive as the market share is dominated by competitors with USDT at the fore."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"August 2022","content":"DATE"},{"type":"February 6, 2024","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"GHO","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"84%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"$60 Billion","content":"MONEY"},{"type":"$0.96","content":"MONEY"},{"type":"$2.8 billion","content":"MONEY"},{"type":"$1 mark","content":"MONEY"},{"type":"$78.4 billion","content":"MONEY"},{"type":"July 16","content":"DATE"},{"type":"July 2023","content":"DATE"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["Aave","GHO","Stablecoin"],"authors":["David Pokima"]}