{"summary":"Physics Professor Claims “Power Law” Model Shows Bitcoin Will Reach $10 Million by 2045","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/physics-professor-claims-power-law-model-shows-bitcoin-will-reach-10-million-by-2045.htm","publishDate":"2024-03-04T16:44:46","id":17226,"type":null,"title":"Physics Professor Claims “Power Law” Model Shows Bitcoin Will Reach $10 Million by 2045","category":["Blockchain News "],"content":["A physics professor has claimed that Bitcoin could reach $10 million by 2045, citing his own “power law” mathematical relationship.","In a video published on X on March 2, Professor Giovanni Santostasi told mathematician and Bitcoin investor Fred Krueger that his power law model is a more understandable and predictable model of Bitcoin price over a long period of time.","First cut from my 90 min deep dive with @Giovann35084111","This is the chart that you \"can't unsee\".\nNon-intuitive aspects of the power law\nIn the next 15 years of Bitcoin, we expect the price\nto go up not by 2, but by 64! pic.twitter.com\/K1RiQSPt1M","— Fred Krueger (@dotkrueger) March 2, 2024","","“The linear chart that they usually show in TV — what [Jim] Cramer is talking about — looks messy,” Santostasi said. “But when you do the log of the y-axis, and you start to see some regularity there, it doesn’t look that messy, it looks like a very nice pattern.”","Santostasi pointed out that most short-term Bitcoin price charts featured in mainstream media present a disorganized and unreliable depiction of Bitcoin’s price movements.","The professor highlighted a crucial distinction from the widely criticized stock-to-flow model, emphasizing that the power law is logarithmic instead of exponential. This implies that Bitcoin’s price is not obligated to experience continuous growth over time, and substantial fluctuations in value, such as those observed from 2020 to 2023, can still be explained within the framework of his power law model.","A power law is a mathematical concept describing a relationship where one variable changes proportionally to a constant exponent of another.  The power law is a recurring pattern found in various natural phenomena, from the frequency of earthquakes to the dynamics of stock market fluctuations.","Santostasi initially introduced his model on the r\/Bitcoin subreddit in 2018. It gained renewed attention in January when finance YouTuber Andrei Jeikh, who has 2.3 million subscribers, discussed it in a video.","In a subsequent post following up on his conversation with Santostasi on X, Krueger delved into additional mathematical modeling of the power law applied to Bitcoin, predicting that Bitcoin could reach $100,000 within the next two years.","Krueger further stated that if Bitcoin follows the model, its market cap is projected to surpass that of gold by the year 2033, which would see Bitcoin’s value reach $1 million per coin."],"entity":[{"type":"next 15 years of Bitcoin","content":"DATE"},{"type":"2033","content":"DATE"},{"type":"2045","content":"DATE"},{"type":"Santostasi","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Fred Krueger","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"YouTuber Andrei Jeikh","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"March 2, 2024","content":"DATE"},{"type":"Jim] Cramer","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Giovanni Santostasi","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Krueger","content":"PERSON"},{"type":"March 2","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Price","Bitcoin Price Prediction"],"authors":["Brian Yue"]}