{"summary":"XRP Price Prediction as SEC Pushes for $2 Billion Penalty Against Ripple – Will XRP Plummet?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-price-prediction-as-sec-pushes-for-2-billion-penalty-against-ripple-will-xrp-plummet.htm","publishDate":"2024-05-09T14:14:22","id":17223,"type":null,"title":"XRP Price Prediction as SEC Pushes for $2 Billion Penalty Against Ripple – Will XRP Plummet?","category":["Price Predictions "],"content":["The XRP price has slid by 1.5% in the past 24 hours, dropping to $0.5136 after the SEC filed in support of its motion requesting a nearly $2 billion penalty for Ripple.","XRP is now down by close to 1% in a week and by 17% in a month, with the altcoin up by a very modest 20% in the past year.","This means that XRP has significantly underperformed relative to other major tokens (e.g., BTC, ETH, SOL), yet the implication of its underperformance is that it could potentially surge in the coming months.","This is particularly the case if the eventual penalty doesn’t end up being as steep as feared, freeing Ripple to move on from its long-running legal saga.","","XRP follows most of the market in having a subdued chart with weak indicators, with the pain likely to continue for at least a few more days before things pick up.","Its 30-day average (orange) has only recently dropped below the 200-day (blue), meaning that it needs a little more time before bottoming out.","It’s a similar story with the relative strength index (purple), which, after spending several days above 50, has recently dropped towards 40 and under.","Again, it may need to languish for two or three days yet before XRP begins recovering, although any further losses shouldn’t be significant.","The reason why the coin has been unable to progress much during recent bull periods is the ongoing Ripple-SEC case.","The latter is nearing its end, with Ripple pushing for a settlement penalty in the region of $10 million, and SEC pushing for a figure closer to $2 billion.","The Ripple v. SEC briefs are FINISHED!","And I think the SEC went out with a whimper here.","It didn't even try to attack ODL sales, just noting that Ripple was trying to re-litigate the issue (which it is).","And it brought nothing new on damages.","Just waiting for The Judge now! https:\/\/t.co\/r8nxNMTzqj pic.twitter.com\/Futa93lXUb","— Jeremy Hogan (@attorneyjeremy1) May 8, 2024","","Now, all that’s left to do is wait for the judge to reach a decision, with the SEC filing what is likely its final reply yesterday.","Noted lawyer Jeremy Hogan expects a decision by July, or September at the latest.","Either way, a final settlement will enable Ripple to cut its losses (in terms of paying a fine) and move on with its business.","It will be able to expand its cross-border payments business again, and investors will feel more confident in XRP.","As a result, the XRP price could rally significantly, potentially reaching $1 by the end of the year.","","Given that XRP will have to wait at least a few more months to make a really big move, traders looking for big short-term gains may prefer to investigate newer tokens.","One of the newest and most interesting coins in the space right now is WienerAI (WAI), an ERC-20 token that has raised over $1.3 million in its popular presale.","Don't be left out in the cold.","GET IT WHILE IT'S HOT","🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 pic.twitter.com\/I69IUJanLC","— WienerAI (@WienerDogAI) May 8, 2024","","With a name like WienerAI, casual observers may be forgiven for assuming that WAI is just another potentially viral meme coin.","Yet it also boasts some real utility, with the coin serving as the native token for the WienerAI trading bot.","As a trading-focused chatbot, WienerAI will answer trading queries and help investors identify high-potential tokens.","It will also enable the same traders to purchase tokens, with the bot featuring an atomic swap function through which users can purchase any recommended token.","On top of this, WienerAI will also include front-running protection, meaning it will enable traders to make trades ahead of any bots looking to take advantage of cross-platform arbitrage opportunities.","These features are why investors are flocking to the coin’s presale, with WAI coming with a max supply of 69 billion tokens.","STAKE NOW and fill your wallet with beautiful Wieners!!!","Current staking apy is over 2000%!","Buy and stake here: https:\/\/t.co\/FCpYSr1k8g","🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭 pic.twitter.com\/FSIVZ3tXUr","— WienerAI (@WienerDogAI) April 21, 2024","","Holders will also be able to stake the token, with its yield currently standing at close to 700%.","Investors can join its sale by visiting the official WienerAI website, where 1 WAI is selling for $0.000705.","Buy WAI Today",""],"entity":[{"type":"May 8, 2024","content":"DATE"},{"type":"2000%","content":"PERCENT"},{"type":"Today","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jeremy Hogan","content":"PERSON"},{"type":"$1.3 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"700%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"$0.5136","content":"MONEY"},{"type":"April 21, 2024","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"$0.000705","content":"MONEY"},{"type":"WAI","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"XRP","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Price Prediction","Ripple","XRP"],"authors":["Simon Chandler"]}