{"summary":"Israel’s Central Bank to Roll Out Sandbox for CBDC Experiments","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/israel-central-bank-roll-out-sandbox-cbdc-experiments.htm","publishDate":"2024-04-17T06:38:25","id":17221,"type":null,"title":"Israel’s Central Bank to Roll Out Sandbox for CBDC Experiments","category":["Altcoin News "],"content":["The Bank of Israel is launching a sandbox environment for testing CBDC use cases, in an effort to refine the design of the digital shekel and ensure its capacity to facilitate advanced applications.","“We are now building the system and intend to officially announce the project in the coming weeks,” Andrew Abir, the central bank’s deputy governor, said in a statement on Tuesday.","A sandbox establishes a controlled environment for the evaluation of novel digital technologies, including financial innovations, prior to their broad implementation. Governments leverage sandboxes to foster innovation by permitting firms to experiment with these technologies under relaxed regulatory stipulations.","This API-driven sandbox will facilitate participation from financial institutions, fintech enterprises, and other relevant stakeholders. Here, they can collaboratively develop and test innovative applications for the digital shekel.","During his address, Abir characterized the digital shekel as a “liability of the Bank of Israel to the public.”","He emphasized its similarity to physical cash, where possession does not entail credit risk. He also clarified the need to distinguish the digital shekel from cryptocurrencies.","“The digital shekel will not be developed by some anonymous Satoshi Nakamoto,” the official said. “Everyone will know who is behind the digital shekel and who is responsible for it – it will be the central bank, the same Bank of Israel that stands behind the cash we all know and trust.”","He asserted that the digital shekel’s value would show stability, unlike cryptocurrencies which can experience significant fluctuations.","“A digital shekel will always be worth one cash shekel which is always worth one shekel in a bank account,” he said.","The official went on to highlight a CBDC’s utility. He explained that it would facilitate various transactions currently not possible with cash, such as those conducted in the e-commerce domain.","The digital shekel will use a two-tiered operational model, enabling a broad spectrum of entities to participate as Payment Service Providers or Additional Services Providers within the platform.","Notably, the Bank of Israel intends to make the platform it constructs accessible not only to traditional banks, as is the current practice. But also to a wider range of participants, including payment companies, fintech firms, consumer clubs, and others."],"entity":[{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Bank of Israel","content":"ORGANIZATION"},{"type":"Abir","content":"PERSON"},{"type":"Andrew Abir","content":"PERSON"},{"type":"Payment Service Providers or Additional Services Providers","content":"ORGANIZATION"}],"hashtag":["CBDC","Israel"],"authors":["Shalini Nagarajan"]}