{"summary":"Cryptocurrency exchange Coinbase today announced it is adding three trading signals to its platform which track users’ holding patterns\nThe exchange hopes that the new feature can attract day traders and first-time investors less familiar with various trading tools and with less market expertise than professional traders ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32090\/coinbase-now-publishes-users-crypto-trading-and-holding-patterns-appealing-to-novice-and-retail-investors","publishDate":"2019-07-17T19:00:21","id":1722,"type":null,"title":"Coinbase now publishes aggregated trading and holding patterns, appealing to novice and retail investors","category":["Markets"],"content":["<span data-v-f87c67ca=\"\">Coinbase today <a href=\"https:\/\/medium.com\/@coinbaseblog\/b3e6852fa2ce\" data-v-f87c67ca=\"\">unveiled three trading signals<\/a> that track users' trading activities, another step the exchange hopes will help it maintain its lead in the retail cryptocurrency brokerage business.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The three indicators, which are available free to all Coinbase users, reflect information such as the percentage of buyers and sellers among the top 10% holders of a certain crypto asset within 24 hours, the median number of days a trader holds an asset, the ranking of each crypto asset by number of holders, and price correlation between different cryptocurrencies. The goal here, according to a Coinbase spokesperson, is to help individual investors better capture market trends and attract more users to the exchange.&nbsp;<\/span>","\"We want trading signals to help first-time investors build the right portfolio to suit their investment goals,\" a Coinbase spokesperson told The Block. \"Similar to traditional market sentiment indicators, this information is intended to provide more context for customers rather than impact the broader market.\"&nbsp;","Although Coinbase may have the best intentions in helping retail traders make informed investment decisions, a market observer told The Block that revealing trading activities of top crypto holders might discourage these investors from using Coinbase to avoid exposing their positions. Besides, the market observer also pointed out that <span data-v-f87c67ca=\"\">most day traders will not likely adopt these trading signals but rather, \"<\/span>still largely make trades based off of pure technical indicators.\"","In terms of performance,&nbsp; an analysis by Coinbase reveals that a bitcoin buy-in strategy based on the top holder activity signal would outperform a strategy that buys a fixed amount of crypto regularly by around 30% in the 2o17 bull run.","","","&nbsp;","In comparison, applying the same two strategies to ZRX during a time period when its price was dropping would result in a 2% steeper loss in the rate of return if the signal-based trading strategy is adopted.&nbsp;","","","While trading signals cannot guarantee consistent outperformance, it is also worth noting that trading signals like these measuring market sentiment tend to lose their predictive power once a large number of traders start to pay attention and trade accordingly.","\"The core problem with popularizing trade signals is that once a large number of traders start using them the edge disappears. Professional traders will ignore [these signals] and can't imagine retail even trades on an active basis,\" said the market observer."],"hashtag":["COINBASE"]}