{"summary":"Bullish Sentiment Grows as Centralized Exchanges See Record Outflows in 12 Months","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bullish-sentiment-grows-as-centralized-exchanges-see-record-outflows-in-12-months.htm","publishDate":"2023-12-29T17:51:21","id":17228,"type":null,"title":"Bullish Sentiment Grows as Centralized Exchanges See Record Outflows in 12 Months","category":["Blockchain News "],"content":["Cryptocurrency traders maintain a bullish drive to end the year with another positive on-chain metric going into 2024 as favorable market forces boost optimism.","Data from blockchain analytics firm, Glassnode shows over $1.1 billion net outflows from centralized exchanges as Bitcoin (BTC) bulls expect more highs into the new year. ","Trading activity on Dec 27 records over 28,000 BTC transferred out of centralized exchanges marking the largest Bitcoin exits since Dec 14, 2022, a new 12-month high.","The move comes as the asset hovers near $43,000 following a month of huge gains driven by cooling inflationary measures taken by the Feds and the widespread anticipation for a spot Bitcoin ETF approval by the United States Securities and Exchange Commission (SEC).","Traditionally, net outflows represent an upward sentiment as most traders are keen on holding their assets for longer periods out of centralized exchanges while inflows to exchanges point to a potential sale.","This holding strategy can be seen across bear and bull cycles over the years leading to analysts predicting movements as a result. According to the data, Coinbase posted outflows of over 18,000 BTC as investors look long-term in their cryptocurrency exposure. ","Coinbase is listed as the custodian for nine Bitcoin ETF applications in the United States with its community predicting an imminent approval. Furthermore, Coinbase is listed on NASDAQ opening it to a wide range of institutional investors some of whom are keen on entering the market directly through an ETF. ","Per the data, Bitcoin on exchanges now stands at 2,327,025 BTC the lowest point since April 2018 as the asset continues its upward movement poised with strong fundamentals into the new year. ","The massive inflows into the Bitcoin market can be seen from its institutional products that have skyrocketed following anticipation for a spot ETF. Starting the year slightly sideways, the asset has peaked following the filing of ETF applications and court victories over the SEC. ","BTC has gained over 157% this year wiping out losses recorded last year due to market collapses and macroeconomic factors which reduced investor exposure to digital assets. ","In October, centralized exchanges saw net outflows when the price of Bitcoin touched $35,000 before making a slight correction. The movement was also linked to the spot ETF drive that has shaped the narrative of this year’s market.","📊🚀 Centralized Exchanges Record Net Outflows as Bitcoin Price Inches Near $35,000","The surge in the price of #Bitcoin has led to a change in investors' sentiment towards the market, sparking different calls from market players not recorded in months.https:\/\/t.co\/feMlASSApX","— Cryptonews.com (@cryptonews) October 24, 2023","","However, BTC miners are reducing their asset holdings as the price inches closer to $43,000. While miners were among the most hit in their bear cycle leading the selling of reserves and equipment to stay afloat, a turn in the price of BTC has seen mining operations become profitable ahead of the next halving.","On Dec 27, miners’ wallets plunged by 700 BTC suggesting that most are taking up profits, reducing debt, and investing in more efficiency ahead of the upcoming halving projected to take effect in April."],"entity":[{"type":"$35,000","content":"MONEY"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"$43,000","content":"MONEY"},{"type":"Bitcoin Price Inches Near","content":"ORGANIZATION"},{"type":"Dec 14, 2022","content":"DATE"},{"type":"157%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Dec 27","content":"DATE"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Glassnode","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"October 24, 2023","content":"DATE"},{"type":"April 2018","content":"DATE"}],"hashtag":["Bitcoin","bullish","centralized exchanges"],"authors":["David Pokima"]}