{"summary":"The IRS said rewards earned through validation activities in a proof-of-stake network will need to be included as part of a taxpayer’s gross income.","author":["Timmy Shen","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242404\/crypto-staking-rewards-must-count-as-taxable-income-irs-says","publishDate":"2023-07-31T23:19:32","id":1723,"type":null,"title":"Crypto staking rewards must count as taxable income, IRS says","category":["Tax"],"content":["<span data-v-f87c67ca=\"\">U.S. cryptocurrency investors who earn rewards from staking services will need to include the value of those rewards as part of their gross income, the Internal Revenue Service said Monday.<\/span>","<span data-v-f87c67ca=\"\">The IRS said in a <\/span><a href=\"https:\/\/www.irs.gov\/pub\/irs-drop\/rr-23-14.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ruling<\/span><\/a><span data-v-f87c67ca=\"\"> that if a taxpayer stakes cryptocurrency native to a proof-of-stake blockchain and receives rewards, “the fair market value of the validation rewards received is included in the taxpayer's gross income in the taxable year in which the taxpayer gains dominion and control over the validation rewards.”<\/span>","<span data-v-f87c67ca=\"\">The fair market value is determined as of the date and time the investor gains dominion and control over the rewards, according to the IRS.<\/span>","<span data-v-f87c67ca=\"\">The IRS update comes as authorities have homed in on certain staking services provided by crypto exchanges in the U.S.<\/span>","<span data-v-f87c67ca=\"\">In February, the Kraken crypto exchange <\/span><a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">settled charges<\/span><\/a><span data-v-f87c67ca=\"\"> brought by the Securities and Exchange Commission for failing to register the offer and sale of its staking program, and agreed to pay a $30 million fine.<\/span>","<span data-v-f87c67ca=\"\">A federal court also ruled in July that Kraken must provide the IRS with account and transaction information.<\/span>","<span data-v-f87c67ca=\"\">Staking is also at the heart of the SEC’s lawsuit against Coinbase, the largest crypto exchange in the U.S. The SEC <\/span><a href=\"https:\/\/www.theblock.co\/post\/233297\/sec-claims-coinbases-staking-service-is-an-investment-contract-in-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">alleged<\/span><\/a><span data-v-f87c67ca=\"\"> that<\/span><span data-v-f87c67ca=\"\">&nbsp;the company’s staking products amount to an investment contract under American law and the exchange failed to register its staking-as-a-service program.<\/span>"],"hashtag":[]}