{"summary":"Binance Targets Traditional Asset Traders With New VIP Program Promotion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-targets-traditional-asset-traders-with-new-vip-program-promotion.htm","publishDate":"2024-02-28T17:38:07","id":17233,"type":null,"title":"Binance Targets Traditional Asset Traders With New VIP Program Promotion","category":["Blockchain News "],"content":["Crypto exchange Binance unveiled a new promotion on February 28 for its VIP Invitation Program that is set to target traditional asset traders.","In an X post, the exchange announced that its new initiative would enable new users to qualify for its VIP Invitation Program by utilizing the combined volume of their conventional assets or cryptocurrencies from external trading platforms.","Trading high volumes in crypto or traditional assets on other platforms?","New Binance users can now submit aggregate volumes from up to two crypto and\/or TradFi exchanges to gain #Binance VIP status! Promotion ends on 28\/05.","More details 👉 https:\/\/t.co\/iPjkrrP7yZ pic.twitter.com\/P9usodg1uR","— Binance VIP & Institutional (@BinanceVIP) February 28, 2024",""," ","Binance asserted that the promotion was the “first of its kind” by a major crypto exchange designed for high-volume traditional asset traders.","The initiative will allow new users on the platform to participate by achieving a 30-day combined spot or futures trading volume in crypto or traditional assets that meets the existing trading volume criteria in the Binance VIP Program.","To qualify for the VIP Invitation Program, a user’s trading volumes over a 30-day period on other exchanges should meet or exceed $1 million BUSD on spot markets or $15 million BUSD on futures markets. BUSD is a 1:1 USD-backed stablecoin issued by Paxos in partnership with Binance.","Eligible users will receive an immediate upgrade to a higher VIP level on the exchange for a duration of two months, the announcement noted. Users may also qualify for subsequent VIP upgrades and benefits by completing certain requirements.","Catherine Chen, the head of Binance VIP and Institutional, said in the announcement that the exchange wants to help “high-volume users of traditional assets platforms reduce their entry barriers to cryptocurrencies.”","“The successful listing of bitcoin spot ETFs and their inflows not only demonstrates that there is clear market demand for cryptocurrencies, it also shows any gap between traditional and digital assets is closing,” Chen said.\n","Binance has consistently launched initiatives targeting niche groups of traders to broaden its user base. In November 2023, the exchange finalized a tri-party banking agreement, allowing institutional investors to secure their trading collateral in fiat through a third-party banking partner.","Since mid-2022, the exchange has also operated an institutional branch, catering to users such as asset managers, brokers, hedge funds, family offices, liquidity providers, and proprietary trading firms.","On February 27, rival crypto exchange Kraken responded to the excitement surrounding the approval of spot Bitcoin ETFs in the U.S. by launching an institutional-focused segment of its platform."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"February 28","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Binance VIP","content":"ORGANIZATION"},{"type":"February 27","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Binance VIP & Institutional","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Catherine Chen","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"February 28, 2024","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":["Binance","Crypto Assets"],"authors":["Brian Yue"]}