{"summary":"Is It Too Late to Buy Bitcoin Cash? BCH Price Up 11% as GambleFi Project Reaches $700,000 Milestone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-it-too-late-to-buy-bitcoin-cash-bch-price-up-11-as-gamblefi-project-reaches-700000-milestone.htm","publishDate":"2024-05-08T14:28:03","id":17241,"type":null,"title":"Is It Too Late to Buy Bitcoin Cash? BCH Price Up 11% as GambleFi Project Reaches $700,000 Milestone","category":["Industry Talk "],"content":["Bitcoin Cash’s ($BCH) price gains over the last seven days have outpaced market leaders Bitcoin and Ethereum.","Since Wednesday May 1, Bitcoin Cash has risen 11% to change hands at a current price of $453. Over the same peiod, the token representing the original unforked Bitcoin ledger, $BTC, has risen 8% and trades at $62,370 as of this writing. ","Ethereum ($ETH) lags behind both Bitcoin tokens this week. It only added 3.5% and currently trades at $2,999. It trailed behind its number one competitor Solana ($SOL), which rose a steamy 19% to trade at $146. ","Based on its current price, Bitcoin Cash is trading higher than its three-month low of $350 but a long way off its high of $700 over the same period. The coin is currently about $15 short of its 30-day moving average.","This is likely due to a recent selloff, as indicated by the fact that BCH’s relative strength index (RSI) is 37 and falling, just 7 points short of being oversold.","","Bitcoin Cash ($BCH) and original Bitcoin ($BTC) are family. In fact, they were technically the same thing before 2017.","However, that year, Bitcoiners formed two distinct factions around a software upgrade called Bitcoin Improvement Proposal (BIP) 91. ","The faction that forked from Bitcoin to Bitcoin Cash was in favor of larger block sizes, which reduced fees and allowed the network to process more transactions per second.","Although, bigger block sizes mean miners need more power to do their business.","This makes mining only really viable for universities, private companies and other organizations.","The added speed enabled Bitcoin Cash to become the cryptocurrency of utility for the big block supporters, who see Bitcoin primarily as a means of payments.","Original Bitcoin maxis see Bitcoin more as a store of value.","","With a $9 billion market cap, Bitcoin Cash ($BCH) is so firmly entrenched in the crypto market now that it’s hard to see a future where it delivers the returns of newer offerings.","There are many Web3 platforms and applications that hint at a glowing and prosperous future for crypto beyond simply payments or storing value. One such application is the world of GambleFi.","GambleFi is one sector that’s getting more of a look-in nowadays. The term refers to any crypto-native online gambling platform or product.","According to data by Statista, online gambling is projected to take in $100.90 billion in revenue this year. This means there has never been a better time for crypto to show the world its iGaming utility. ","A new ICO for Solana GameFi token Mega Dice (DICE) started in mid-April, and it has already taken over $800,000 in investments, according to the token’s website.","Mega Dice launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram.","Since then, 50,000 players have signed up and helped the casino become a well-established name in GambleFi. ","As the platform’s native token, players can fund games and receive winnings with $DICE.","$DICE Token Launch! 🏆","The moment we've all been waiting for is finally here! The #DICE #TokenLaunch is LIVE! 🚀","If you participated in our presale, here's how you can claim your tokens:","– If you used SOL to buy $DICE, you'll receive an airdrop—just sit back and relax!\n– If… pic.twitter.com\/l35GMlfj4w","— Mega Dice Casino (@megadice) May 8, 2024","","Casino customers who play with the token will get further benefits down the line, as the casino plans to integrate it into the loyalty program, offering more generous rewards to gamers who play with it.","The token will also unlock exclusive competitions and VIP experiences.","Lastly, Mega Dice has indicated there will be a buyback and burn program. This means the casino will periodically buy some of the tokens and remove them from circulation to keep them scarce, helping to drive their value.","Follow Mega Dice news over on X\/Twitter and Telegram.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"$700","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"BCH","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"$146","content":"MONEY"},{"type":"Solana GameFi","content":"ORGANIZATION"},{"type":"$100.90 billion","content":"MONEY"},{"type":"$15","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"$BCH","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"$DICE","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"$SOL","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"Bitcoin maxis","content":"ORGANIZATION"},{"type":"Statista","content":"LOCATION"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"$62,370","content":"MONEY"},{"type":"May 8, 2024","content":"DATE"},{"type":"3.5%","content":"PERCENT"},{"type":"mid-April","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"DICE Token Launch!","content":"ORGANIZATION"},{"type":"Wednesday May 1","content":"DATE"},{"type":"$800,000","content":"MONEY"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$2,999","content":"MONEY"},{"type":"$9 billion","content":"MONEY"},{"type":"$453","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$350","content":"MONEY"}],"hashtag":["BCH","Bitcoin Cash","Mega Dice"],"authors":["Tim Hakki"]}