{"summary":"Uniswap Community Rejects Governance Proposal to Distribute Revenue to UNI Token Holders","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uniswap-community-rejects-proposal-to-distribute-revenue-to-uni-token-holders.htm","publishDate":"2024-03-11T11:40:14","id":17248,"type":null,"title":"Uniswap Community Rejects Governance Proposal to Distribute Revenue to UNI Token Holders","category":["DeFi News "],"content":["The Uniswap community has rejected a governance proposal that aimed to introduce changes to the platform’s fee mechanism, including allowing revenue distribution to UNI token holders. ","The voting period for the proposal concluded on March 9, with 59.9% of mobilized UNI votes opposing the proposal.","The rejected proposal intended to grant the decentralized autonomous organization (DAO) the authority to modify Uniswap’s fee mechanism, making way for the activation of a highly anticipated Uniswap “fee-switch.” ","This mechanism would have enabled the distribution of protocol revenue to UNI token holders.","Just two days prior to the rejection of this proposal, another separate proposal to enable the collection of protocol revenue had passed with nearly unanimous support. ","The activation of a fee-switch has been a sought-after goal since Uniswap distributed its UNI token to early adopters in 2020.","GFX Labs, a DeFi-focused research and development firm that co-authored the latest fee switch proposal, had previously introduced a similar proposal last year. ","It suggested distributing 10% or 20% of Uniswap revenue from pool fees to token holders. ","However, the previous proposal was also met with resistance, as 45.3% of votes were cast against it, while 42.3% supported a 20% fee distribution and 12.3% favored a 10% fee distribution. ","Despite its failure, the majority of votes expressed a desire to activate some form of fee switch.","One of the main concerns raised against the proposal was the potential tax and legal liabilities that the Uniswap protocol or its core team could face as a result of fee distributions. ","There were some criticism regarding the reluctance of influential entities within Uniswap governance, such as a16z and Hayden, to activate the fee switch due to the fear of creating legal liabilities.","The discussions surrounding the recent proposal also highlighted worries about the security and technical risks associated with granting the Uniswap DAO the ability to modify the underlying code of the fee mechanism. ","Some argued that allowing for upgradability in contracts could pose risks and potentially undermine the system’s stability and integrity.","Last month, Uniswap launched a browser sidebar extension along with a limit order placement function and other tools to facilitate cryptocurrency transactions.","The Uniswap Extension introduces a new way to interact with digital assets directly from a browser sidebar, streamlining the process of swapping digital assets, signing transactions, and trading.","“Let’s be real — most wallet extensions are stuck in the past, with old UX paradigms and clunky onboarding flows,” said Uniswap on social media. “That’s why we built our own.”","With Uniswap Extension you’ll be able to swap, sign transactions, and send or receive crypto anywhere on the web","Everything is right there in your sidebar — exactly where you need it to be","It's like ✨magic✨ pic.twitter.com\/G5WoO60osF","— Uniswap Labs 🦄 (@Uniswap) February 27, 2024","","The update also included a Limit Orders feature, allowing users to automate buying or selling cryptocurrencies at predetermined prices.","Meanwhile, UNI is currently trading at $14.30, almost flat over the past day. ","However, the token is up by more than 14% over the past week and by a whopping 115% over the past month, according to data from CoinMarketCap. "," "],"entity":[{"type":"42.3%","content":"PERCENT"},{"type":"45.3%","content":"PERCENT"},{"type":"UNI","content":"ORGANIZATION"},{"type":"February 27, 2024","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"115%","content":"PERCENT"},{"type":"12.3%","content":"PERCENT"},{"type":"Uniswap DAO","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"March 9","content":"DATE"},{"type":"$14.30","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"59.9%","content":"PERCENT"},{"type":"Hayden","content":"PERSON"},{"type":"Uniswap Extension","content":"ORGANIZATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["DAO","UNI","Uniswap"],"authors":["Ruholamin Haqshanas"]}