{"summary":"Pakistan’s Finance Minister Reaffirms Government’s Interest in Digital Currency","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pakistan-finance-minister-reaffirms-digital-currency-interest.htm","publishDate":"2024-04-29T07:28:27","id":17245,"type":null,"title":"Pakistan’s Finance Minister Reaffirms Government’s Interest in Digital Currency","category":["Altcoin News "],"content":["Pakistan’s plans for a central bank digital currency (CBDC) gained fresh momentum on Sunday, with finance minister Muhammad Aurangzeb raising the debate again.","At the World Economic Forum (WEF) special meeting in Riyadh, Aurangzeb highlighted the nation’s undocumented economy as its biggest hurdle, local outlet World Echo reported. He revealed that Pakistan’s annual revenue stands at Rs. 9.4 trillion ($33.7b), but about half of its economy is not officially recorded.","He also acknowledged the struggle for financial inclusion, particularly for women facing issues like cash theft by family members. He highlighted government assistance programs for women in Pakistan, but also emphasized the potential of digital wallets to empower them financially by offering greater control over their money.","Separately at the event, IMF Managing Director Kristalina Georgieva expressed concern about the economic struggles of some nations, including Pakistan. She indicated a global economic divide, with certain countries thriving while others fall behind.","Pakistan’s central bank, the State Bank of Pakistan (SBP), is aiming to fast-track the development of a digital rupee, aiming for a potential launch in 2025. Governor Jameel Ahmad announced the plan in July 2023, saying it involves careful consideration of other central banks’ experiences with CBDCs. Ahmad emphasized a cautious approach, prioritizing a well-designed and secure digital currency for Pakistan.","While financial inclusion for the unbanked is a major driver for CBDCs in many developing nations, Pakistan’s central bank might have additional motives.","Pakistan’s high inflation (20.7% as of May) could be pushing businesses and individuals toward alternative currencies like crypto. Despite government crackdowns, Pakistan ranked eighth globally in crypto adoption in 2023, just ahead of Brazil. This suggests the SBP might be considering a CBDC as a way to maintain control over the national digital currency and potentially counter the appeal of cryptocurrencies.","Pakistan’s central bank risks falling behind in the global race for CBDCs. While regional neighbors like India are already piloting wholesale and retail uses for their CBDCs, the SBP seems to be playing catch-up.","This urgency is underscored by over 98% of central banks worldwide actively exploring CBDCs to improve access to central bank money and expand its functionalities."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"2025","content":"DATE"},{"type":"the World Economic Forum (WEF","content":"ORGANIZATION"},{"type":"Pakistan","content":"LOCATION"},{"type":"Riyadh","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"98%","content":"PERCENT"},{"type":"State Bank of Pakistan (SBP","content":"ORGANIZATION"},{"type":"Muhammad Aurangzeb","content":"PERSON"},{"type":"Kristalina Georgieva","content":"PERSON"},{"type":"Jameel Ahmad","content":"PERSON"},{"type":"SBP","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"$33.7","content":"MONEY"},{"type":"20.7%","content":"PERCENT"},{"type":"July 2023","content":"DATE"}],"hashtag":["CBDC","Pakistan"],"authors":["Shalini Nagarajan"]}