{"summary":"Ledn has raised $70 million in new funding and is now valued at $540 million.\nThe firm has also announced a new bitcoin-backed mortgage product to provide home loans.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127592\/crypto-ledn-series-b-funding-bitcoin-backed-mortgage-product","publishDate":"2021-12-15T07:00:30","id":1724,"type":null,"title":"Ledn raises $70 million, announces new bitcoin-backed mortgage product","category":["Venture Capital"],"content":["Crypto lending firm Ledn announced Wednesday that it has raised $70 million in a Series B funding round and is now valued at $540 million.","Dan Tapiero's <a href=\"https:\/\/www.theblockcrypto.com\/post\/126629\/dan-tapieros-10t-is-raising-500-million-for-a-third-digital-assets-fund\" data-v-f87c67ca=\"\">10T Holdings<\/a> led the round. As part of the deal, Tapiero is joining Ledn's board of directors.","Other new investors in the round included Golden Tree Asset Management, Raptor Group, and FJ Labs. All existing investors, including Coinbase Ventures, Alan Howard, ParaFi Capital, and Susquehanna Private Equity Investments also participated in the round.","Ledn says its business has grown significantly this year, both in terms of loan originations and assets (collateral placed for loans and balances of savings accounts).","\"Since inception, Ledn has processed over $450 million in loan originations, with 90% of those originations occurring during 2021,\" Ledn co-founder Mauricio Di Bartolomeo told The Block.","As for assets, they have surpassed $1.7 billion — representing a 4,000% increase from Q3 2020. Bartolomeo said Ledn now has 100,000 registered clients in 127 countries — representing a 10x growth from Q3 2020. The firm serves both retail and institutional clients.","Its key products include interest-bearing savings accounts for bitcoin and USDC, bitcoin and USD loans, and a trading feature between bitcoin and USDC.","Today, Ledn has also announced a new bitcoin-backed mortgage product, which will allow users to borrow to buy a home with their bitcoin holdings as collateral.","\"Most people that hold extensive wealth in bitcoin still can't utilize their assets to qualify for a mortgage at a bank,\" said Adam Reeds, co-founder and CEO of Ledn. \"That is why we are launching this product, in order to provide access to key financial products for those who choose to invest outside the mainstream of legacy banks.\"","The Bitcoin Mortgage product is currently in pilot mode and is expected to be made broadly available in the US and Canada in early 2022. Ledn said it is targeting over $100 million in bitcoin-backed mortgage originations by the end of Q1 2022.","With fresh capital at hand, Ledn plans to expand its team further. Bartolomeo said Ledn's team has grown substantially from 8 people to over 65 in 2021 and it is looking to double headcount in 2022.","While Ledn offers services like a bank, it isn't a regulated one yet. Bartolomeo said Ledn has applied to the Ontario Securities Commission to be registered as an investment dealer in all jurisdictions of Canada under the crypto regulatory regime set out by the Canadian Securities Administrators.","Ledn currently complies with AML\/KYC rules in Canada and the US as it it is registered as a money service business with FINTRAC in Canada and FINCEN in the US, said Bartolomeo.","The Series B round brings Ledn's total funding to date to $103.8 million. In May, the firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/106107\/crypto-lender-ledn-raises-30-million-series-a\" data-v-f87c67ca=\"\">raised<\/a> $30 million in Series A funding. Bartolomeo said Ledn may raise more funds in 2022."],"hashtag":["SERIES B"]}