{"summary":"International Auction House Christie’s Launches First On-Chain Generative Art Collection","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/international-auction-house-christies-launches-first-on-chain-generative-art-collection.htm","publishDate":"2024-03-12T22:22:01","id":17255,"type":null,"title":"International Auction House Christie’s Launches First On-Chain Generative Art Collection","category":["NFT News "],"content":["World-renowned auction house Christie’s officially debuted their first on-chain generative art collection entitled SOURCE (On NFTs) on Thursday, with over 400 pieces created by crypto and NFT artist Robert Alice.","According to Christie’s website, the works are “a form of digital graffiti” that recasts “the tradition of color field paintings” made popular by abstract painters in the mid-nineteenth “as a celebration of the RGB color spectrum that characterizes digital art.”","“Referencing the importance of blockchains as a new form of publishing, and the idea of NFTs as fundamentally made out of text, the works poetically distill the pre-history of NFTs into large contemporary digital color fields paintings,” Christie’s stated. “Each artwork, made entirely out of text, is a collision of two of these source texts, violently collided together using NLP algorithms to create new histories.”","Starting at a price of 5 ETH, the cost of each NFT piece will diminish “until all 400 works are either sold out or the price lands at its resting price of 0.3 ETH.”","TODAY! The auction for SOURCE [On NFTs], @robertalice_21 begins at 11am EST","Dutch Auction: 11am – 1pm EST\nStarting price: 5 ETH, decreasing 0.175 ETH every 3 minutes until 1.5 ETH, then slowing to increments of 0.06 ETH","Mint here: https:\/\/t.co\/F7zrPFxnEM","— Christie's (@ChristiesInc) March 12, 2024","","“The source material was intentionally selected by the artist to reveal the cultural ecology of the origin of NFTs,” Christie’s continued. “Disparate histories entwine to create new meaning, as works of science fiction collide with seminal digital art history manifestos while cryptography whitepapers collide with 7th-century Chinese philosophical texts.”","Alice has a storied legacy of art within the crypto space himself, having originally been the first artist to sell an NFT through Christie’s in October 2020.","The on-chain generative art auction coincides with the release of On NFTs, a physical book edited by Alice featuring 10 academic essays and illustrated profiles of 101 artists working with NFTs.","Published by luxury art book publisher Taschen, On NFTs offers “a deep dive into the sphere of non-fungible tokens” by encompassing everything from “algorithmic art to avatars.”","“This book is one of the first major survey publications on blockchain-based art and the wider on-chain cultural ecosystem,” Alice said.","Works minted for 1.5 Eth or higher at Christie’s will receive a special edition of On NFTs hand-signed by Alice."],"entity":[{"type":"October 2020","content":"DATE"},{"type":"Taschen","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Christie’s website","content":"ORGANIZATION"},{"type":"RGB","content":"ORGANIZATION"},{"type":"EST","content":"ORGANIZATION"},{"type":"Christie’s","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"NLP","content":"ORGANIZATION"},{"type":"March 12, 2024","content":"DATE"},{"type":"Robert Alice","content":"PERSON"},{"type":"Alice","content":"PERSON"}],"hashtag":["NFT","NFT Auction house"],"authors":["Julia Smith"]}