{"summary":"Bitcoin NFTs Eclipse Ethereum with $168.5 Million in Weekly Sales","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-nfts-eclipse-ethereum-with-168-5-million-in-weekly-sales.htm","publishDate":"2024-03-04T07:19:26","id":17257,"type":null,"title":"Bitcoin NFTs Eclipse Ethereum with $168.5 Million in Weekly Sales","category":["Blockchain News "],"content":["Bitcoin (BTC) non-fungible token (NFT) sales have outshined Ethereum (ETH) in the past seven days, driven by a sudden surge in Bitcoin Ordinals-based NFT collections. ","Led prominently by the NodeMonkes collection, the Bitcoin NFT market experienced an impressive 80% week-over-week growth, reaching a staggering $168.5 million in sales. ","In contrast, Ethereum generated $162 million in NFT sales during the same period, according to data from CryptoSlam.","The rise of Bitcoin Ordinals has contributed significantly to this remarkable shift in the NFT landscape. ","Launched in January 2023, Ordinals introduced a novel approach by allowing users to associate files, such as images, with satoshis (sats), the smallest unit of Bitcoin, essentially creating NFT-like assets on the Bitcoin blockchain.","Among the best-selling NFT collections of the week, three out of the top five were Bitcoin Ordinals-based. ","The leading sales came from the uncategorized Ordinals, which generated over $43 million worth of sales through more than 47,000 transactions. ","Following closely behind was the NodeMonkes collection, a Bitcoin-based series of 10,000 unique pixelated profile picture (PFP)-style Ordinals. ","NodeMonkes recorded over $41 million in sales, marking a nearly 170% increase from the previous week. ","The Natcats collection, another Ordinals-based project, secured the fourth position with over $10 million in sales.","NodeMonkes, launched in December, claims to be the first 10,000-strong collection on Bitcoin. ","Although other 10,000-count Ordinals collections had emerged earlier, the NodeMonkes team engraved their collection onto the blockchain in February 2023, just a month after Ordinals’ initial release.","On March 2, user “NFTstats” reported that NodeMonkes’ market capitalization surpassed $500 million, positioning it as the third-largest PFP-style NFT collection across all blockchains, trailing only the Ethereum-based Bored Ape Yacht Club (BAYC).","NodeMonkes have flipped Pudgy market cap and jumped to the #3 overall spot in terms of PFPs.","Just 3 days ago, Pudgy market cap was more than 2x NodeMonkes.","Puppets have flipped Milady as well.","The speed of moves in this space is pretty insane. pic.twitter.com\/ZMafTWJPl2","— NFTstats.eth (@punk9059) March 3, 2024","","While the exact reasons behind NodeMonkes’ recent surge remain unclear, industry insiders speculate that its appeal lies in its “meaningful provenance.” ","Kevin Wu, the founder of NFT collection GRAYCRAFT, noted in a February 22 post that NodeMonkes holds significance as the first PFP-style NFT collection on “the first chain ever,” creating a compelling narrative that speculative investors may now be latching onto.","It is worth noting that the market for NFTs has been on an upward movement recently amid the recovery in crypto prices.","In October, NFT trading volume surged by $99 million, reaching $405 million, signifying levels of sales not seen since August.","Likewise, sales of NFTs on the Bitcoin (BTC) network reached a new milestone in December 2023, surpassing $881 million for the first time ever. ","This included 111,713 buyer addresses and 98,744 seller addresses, both setting the highest single-month records to date.","More recently, it was revealed that the Musée d’Orsay, a renowned museum in Paris, is venturing into the world of blockchain and digital art with its first-ever commission of an on-chain NFT exhibition.","The museum is set to release a collection of tokenized artwork titled “The Convergence of Breath.” ","These five single-edition NFTs, minted on the Tezos blockchain, are a result of a captivating art installation and social experiment currently on display as part of the museum’s digital-themed exhibition, “Le Code d’Orsay.”"],"entity":[{"type":"$168.5 million","content":"MONEY"},{"type":"$41 million","content":"MONEY"},{"type":"$405 million","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"Bitcoin Ordinals","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"$43 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$162 million","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Bitcoin NFT","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"PFP","content":"ORGANIZATION"},{"type":"$99 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"170%","content":"PERCENT"},{"type":"Kevin Wu","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"March 2","content":"DATE"},{"type":"August","content":"DATE"},{"type":"February 22","content":"DATE"},{"type":"March 3, 2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"December 2023","content":"DATE"},{"type":"$881 million","content":"MONEY"},{"type":"Bitcoin Ordinals","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"3 days ago","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Ethereum","NFTs"],"authors":["Ruholamin Haqshanas"]}