{"summary":"South Korean Tax Body Liquidates Crypto Worth Over $800,000","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-tax-body-liquidates-crypto-worth-over-800000.htm","publishDate":"2024-05-15T03:00:22","id":17253,"type":null,"title":"South Korean Tax Body Liquidates Crypto Worth Over $800,000","category":["Blockchain News "],"content":["The South Korean tax body, the National Tax Service (NTS), has announced it has liquidated previously frozen crypto worth more than $800,000.","In a press conference held at its Seoul headquarters on May 14, the NTS exhibited some of the items it had seized in raids on “high-value” and “habitual” tax delinquents.","The NTS and its regional affiliates have been cracking down on tax dodgers who use crypto investments to hide their income in recent years.","These crackdowns have yielded great success for the NTS and local tax bodies. They have seized and forcibly liquidated coins belonging to thousands of crypto holders nationwide.","The NTS showcased its results over the past five years, explaining it had enacted “forced collections” for “641 high-value and habitual delinquents.”","The tax body said that, as of 2021, it had frozen over $79 million worth of coins from tax dodgers.","These tax dodgers have since paid the NTS over $69 million in fines and outstanding tax bills to unfreeze their tokens.","The NTS said that it has “directly” sold $800,000 worth of coins from people who failed to pay their fines and outstanding bills.","That would suggest that the tax body is currently holding coins worth over $9 million. Should tax evaders fail to pay their bills, the NTS would likely liquidate the entire $9 million.","Yang Dong-hoon, the head of the NTS’ Tax Collection and Legal Department, said:","“The National Tax Service will achieve tax justice. We will do so by tracking the assets of high-value and habitual tax delinquents. Right to the very end.”","The NTS also gave details about the other types of assets it had seized, and in some instances, sold off.","These included valuable works of art, as well as undeclared inheritances. The haul also included luxury cars and prepaid golf course memberships.","Emart24 to sell 'bitcoin meal box'https:\/\/t.co\/Td3zxhBmf6","— The Korea Times (@koreatimescokr) May 9, 2024","","The tax body said that in many cases, tax delinquents were “living lives of luxury” in “expensive houses.”","In March, tax authorities in the city of Hwaseong said they had confiscated crypto worth over $768,500 from tax offenders.","This figure involved a confiscation worth around $567,000 from a single individual."],"entity":[{"type":"May 14","content":"DATE"},{"type":"NTS","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"The National Tax Service","content":"ORGANIZATION"},{"type":"Hwaseong","content":"ORGANIZATION"},{"type":"$768,500","content":"MONEY"},{"type":"May 9, 2024","content":"DATE"},{"type":"$567,000","content":"MONEY"},{"type":"$69 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$800,000","content":"MONEY"},{"type":"$9 million","content":"MONEY"},{"type":"Legal Department","content":"ORGANIZATION"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"},{"type":"$79 million","content":"MONEY"}],"hashtag":["South Korea","Tax"],"authors":["Tim Alper"]}