{"summary":"Helium’s wireless 5g hotspot-driven network has wide gaps in coverage.\nThe five-year agreement will provide T-Mobile’s 5g services in places where Helium coverage doesn’t exist.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171411\/nova-labs-will-use-t-mobile-to-fill-coverage-dead-zones","publishDate":"2022-09-20T13:46:02","id":1725,"type":null,"title":"Nova Labs will use T-Mobile to fill coverage dead zones","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">The ink is dry on a five-year agreement that will see T-Mobile fill in service gaps on the blockchain-based Nova Labs’ Helium network to offer U.S. nationwide 5g powered by Nova Labs, <a href=\"https:\/\/www.coindesk.com\/markets\/2022\/09\/20\/nova-labs-says-t-mobile-to-cover-5g-dead-spots-in-helium-network\/\" data-v-f87c67ca=\"\">reports CoinDesk<\/a>.<\/span>","<span data-v-f87c67ca=\"\">T-Mobile confirmed the five-year deal to The Block, but declined to provide further details about the agreement. The deal will allow Nova Labs to offer Helium subscribers mobile products services that use both networks, a press release said. The companies said the announcement coincides with the release of Helium Mobile from Nova Labs, “which will enable subscribers to earn crypto rewards for using the network.”<\/span>","<span data-v-f87c67ca=\"\">Helium network provides access to a decentralized grid powered by user-maintained IoT-driven wireless hotspots. A current <\/span><a href=\"https:\/\/explorer.helium.com\/mobile\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">map<\/span><\/a><span data-v-f87c67ca=\"\"> of available 5g coverage on the Helium network shows dense coverage in some areas and wide gaps elsewhere.<\/span>","<span data-v-f87c67ca=\"\">The current gaps in Helium’s hotspot-based coverage will be filled with T-Mobile’s network, Boris Renski, general manager of wireless at Nova Labs told Coindesk in an interview. He acknowledged that coverage is “not perfect” with “lots of dead spots.”<\/span>","<span data-v-f87c67ca=\"\">“But with the model that we are pursuing, it's important to understand we are not looking to replace large mobile operators with our network. We are building a network that could be a complement to the existing macro network of the operators,” Renski said.<\/span>","<span data-v-f87c67ca=\"\">Subscribers might see a beta launch of the service as soon as the first quarter of 2023, according to Nova Labs.<\/span>","<span data-v-f87c67ca=\"\">In July Helium on its website had <\/span><a href=\"https:\/\/www.theblock.co\/post\/160422\/lime-salesforce-do-not-have-partnerships-with-helium-mashable-the-verge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claimed<\/span><\/a><span data-v-f87c67ca=\"\"> that it is used by companies Lime and Salesforce website, but no such partnerships exist, according to reports from <\/span><a href=\"https:\/\/mashable.com\/article\/helium-lime-web3-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mashable<\/span><\/a><span data-v-f87c67ca=\"\">, and <\/span><a href=\"https:\/\/www.theverge.com\/2022\/7\/29\/23284330\/helium-crypto-mesh-network-lime-salesforce-denials\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Verge<\/span><\/a><span data-v-f87c67ca=\"\">.<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Editor's Note: This story has been updated with comment from T-Mobile.<\/em><br data-v-f87c67ca=\"\">\n<\/span>"],"hashtag":["CRYPTO"]}