{"summary":"Portofino Technologies Obtains FCA’s Approval to Offer Crypto Services","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/portofino-technologies-obtains-fcas-approval-to-offer-crypto-services.htm","publishDate":"2024-02-28T18:25:51","id":17250,"type":null,"title":"Portofino Technologies Obtains FCA’s Approval to Offer Crypto Services","category":["Blockchain News "],"content":["Portofino Technologies announced on Tuesday that its UK entity received the regulatory permit to act as a registered crypto asset firm.","The company stated that its UK subsidiary has been listed as a crypto asset by the Financial Conduct Authority (FCA).","Portofino Technologies will expand its services as it is now able to trade cryptocurrencies with institutional clients. The company hinted at an expansion of the institutional client base resulting in the approval.","This development secures Portofino’s place as a company registered to offer OTC services in Switzerland and the UK. The move is also part of the company’s plan to ensure compliance in regulated markets globally.","The unfortunate events recorded in the sector led to authorities rolling out tougher rules in both institutional and retail markets. Firms must obtain the regulatory nod after fulfilling several requirements and disclosures before they can afford cryptocurrency-related services.","This is to protect investors and the financial market from fraud cases and prevent losses in the market. Portofino Technologies is a Switzerland-based firm that provides crypto trading infrastructure in the market.","🚀 Big news! #PortofinoTechnologies, a Switzerland-based crypto native tech start-up, gets FCA nod as Registered Cryptoasset Firm. This enables them to trade #cryptocurrencies with institutional investors in the UK. 💰🌐 @AlexCasimo @LeonardLancia #CryptoNews #FCA #CryptoTrading pic.twitter.com\/oyiioiqn1z","— John Bravo (@JohnBTCBravo) February 28, 2024","","Last year, the company announced a $50 million investment to build financial technology to power crypto assets.","“Two former Citadel Securities leaders, Leonard Lancia, and Alex Casimo, have launched Portofino Technologies and have raised over US$50 million in equity funding from Valar Ventures, Global Founders Capital, and Coatue,” the press release read.","Portofino’s executives have expressed optimism and confidence with the recent regulatory milestone going into the UK market. alex Casimo, the co-founder and Chief Operating Officer stated that the firm can expand its institutional client base as investors look toward regulated entities.","“Receiving the FCA’s approval to operate as a crypto asset trading firm in the UK is a significant milestone for Portofino Technologies, which will allow us to expand our institutional client base. After having successfully built our product for on-exchange trading, Portofino sees the growth of its client franchise as a significant profit driver for the company in the coming years.” ","He added that the firm hopes to solidify its position among global regulatory digital assets market makers. Celyn Armstrong Portofino’s General Counsel and Head of Compliance expressed similar sentiments adding that the firm’s traditional and digital asset clients have full confidence in the company’s regulatory standards.","“The FCA rightly sets a high bar for cryptoasset firms seeking registration, and we are proud to have successfully demonstrated our strong and sophisticated compliance controls. Our traditional finance and digital asset clients alike can have full confidence that we are committed to stringent regulatory compliance and risk management standards.”As institutional investors troop into the cryptocurrency market, the company looks to gain more adoption in several markets.",""],"entity":[{"type":"Portofino","content":"ORGANIZATION"},{"type":"US$50 million","content":"MONEY"},{"type":"Switzerland","content":"LOCATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Leonard Lancia","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Portofino Technologies","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Head of Compliance","content":"ORGANIZATION"},{"type":"February 28, 2024","content":"DATE"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Alex Casimo","content":"PERSON"},{"type":"Celyn Armstrong Portofino’s General Counsel","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"John Bravo","content":"PERSON"},{"type":"Valar Ventures","content":"ORGANIZATION"},{"type":"Global Founders Capital","content":"ORGANIZATION"},{"type":"Casimo","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["CRYPTO","FCA","Portofino"],"authors":["David Pokima"]}