{"summary":"Digital asset lender Genesis announced today the launch of its derivatives trading desk\nThe firm has hired former Galaxy Digital head of trading strategy Joshua Lim to lead the new division ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66671\/crypto-lender-genesis-expands-into-derivatives-trading-space-with-new-hire-from-galaxy-digital","publishDate":"2020-05-28T09:00:35","id":1726,"type":null,"title":"Genesis expands into derivatives trading space with new hire from Galaxy Digital","category":["Cryptocurrency"],"content":["A week after <a href=\"https:\/\/www.theblockcrypto.com\/post\/65928\/genesis-crypto-prime-broker-race\" data-v-f87c67ca=\"\">announcing<\/a> its foray into the prime brokerage space, digital asset lender Genesis said on Thursday that it has also expanded its business into the derivatives trading market.&nbsp;","The company revealed today that it would begin making markets in derivatives, spearheaded by a new hire. Joshua Lim, who previously led trading strategies at Galaxy Digital and Circle, has joined the company to oversee the new derivatives trading desk as head of derivatives, according to a statement shared with The Block.&nbsp;","\"Josh brings a wealth of knowledge and industry experience to the Genesis team. He provides immediate credibility to our derivatives desk as we look to grow this important aspect of the digital asset market,\" said Genesis CEO Michael Moro in the statement.","Genesis announced the launch of its prime brokerage arm Genesis Prime last week. This week, crypto custodian <a href=\"https:\/\/www.theblockcrypto.com\/post\/66550\/bitgo-prime-institutions-trading-launch\" data-v-f87c67ca=\"\">BitGo<\/a> and crypto exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/66479\/coinbase-tagomi-acquisition\" data-v-f87c67ca=\"\">Coinbase<\/a> launched similar services. The latter also acquired one of the earliest brokers in the crypto space, Tagomi, to add to its suite of institutional offerings.&nbsp;","Genesis' move takes the firm a step closer to becoming a full-fledged financial services firm for digital assets. As one of the largest crypto lenders in the space, the company has been continuously breaking its own records both in terms of the total loan outstanding and new loan issuance. Its active loan outstanding <a href=\"https:\/\/www.theblockcrypto.com\/post\/63516\/genesis-doubled-new-loan-issuance-to-2-billion-in-a-recording-breaking-q1\" data-v-f87c67ca=\"\">briefly hit<\/a> the $1 billion all-time high in March, although the March 12 equity market sell-off sent the number down subsequently.&nbsp;&nbsp;","The launch of the desk comes at a red-hot time for the nascent crypto derivatives market. Since the beginning of the year, exchanges such as Binance and Huobi have launched BTC <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52102\/binance-futures-launches-xrp-perpetual-contract-with-up-to-75x-leverage\" data-v-f87c67ca=\"\">perpetual swaps<\/a> to rival BitMEX, while daily trading volumes in BTC futures and options have also soared since late April. Total daily trading volumes in bitcoin futures hit a $38.4 billion monthly high across exchanges on April 30, while options daily trading volumes reached over $220.2 million across Deribit, LedgerX and OKEx on May 10.&nbsp;","&nbsp;"],"hashtag":["LENDING"]}