{"summary":"This Is How Satoshi Nakamoto Defended Bitcoin Mining & Converted A Skeptic","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/this-is-how-satoshi-nakamoto-defended-bitcoin-mining-convert-9640.htm","publishDate":"2021-03-24T01:00:00","id":17263,"type":null,"title":"This Is How Satoshi Nakamoto Defended Bitcoin Mining & Converted A Skeptic","category":["Bitcoin News "],"content":["Reddit users have been looking back with no small amount of nostalgia at a forum post by the Bitcoin (BTC) founder Satoshi Nakomoto that dates back to August 7, 2010 – and sees the network architect change a skeptic’s mind about the energy efficiency of mining BTC.","The post comes from the Bitcoin Talk forum, in a thread created by a user named Gridecoin.","In their original post, Gridecoin opined that while they considered BTC to be a worthy project, energy issues would likely plague it.","They wrote,","“I believe that the amount of energy input required to the bitcoin economy represents a serious obstacle to its growth. I think in the long-term, transactions may be even more serious than minting in this regard, but I will for the moment discuss minting because it is more precisely bounded and defined. The idea that the value of bitcoins is in some way related to the value of the electricity required, on average, to mint a winning block is generally accepted, but the precise nature of this relationship is contentious.”","And after some back and forth with other site contributors, Nakomoto made a rare appearance in the chat to explain that the “situation” was not unlike gold and its relation with gold mining.","Nakomoto wrote,","“The marginal cost of gold mining tends to stay near the price of gold. Gold mining is a waste, but that waste is far less than the utility of having gold available as a medium of exchange. I think the case will be the same for Bitcoin. The utility of the exchanges made possible by Bitcoin will far exceed the cost of electricity used. Therefore, not having Bitcoin would be the net waste.”","And Nakomoto went on to defend Bitcoin’s proof-of-work model. However, Gridecoin disagreed with the idea that the very high computational burden of coin generation is in fact a necessity of the current system:","“As I understand it, currency creation is fundamentally metered by time – and if that is the fundamental controlling variable, what is the need for everyone to ‘roll as many dice as possible’ within that given time period? The ‘chain of proof’ for coin ownership and transactions doesn’t depend on the method for spawning coins.”","But the BTC founder responded that “Proof-of-work has the nice property that it can be relayed through untrusted middlemen. We don’t have to worry about a chain of custody of communication. It doesn’t matter who tells you a longest chain, the proof-of-work speaks for itself.”","And that drew a positive response from Gridecoin, who wrote,","“I agree with your analysis, and this thread has actually changed my mind as to my initial criticism. After more careful study of the design of the Bitcoin network and trying to understand the exact manner in which Bitcoin attempts to create value from the computational work invested, […] thinking now is that bitcoin does not, in fact ‘waste’ computational work at all – instead it works hard to deliver the most value possible from that computational work.”","And Gridecoin went a step further, asserting that while “government-issued fiat currency may not have any obvious energy burden beyond its printing,” the “energy cost of hiring police officers to enforce economic honesty” far outweighed the energy costs involved with mining tokens on the Bitcoin network.","Modern-day Redditors appear enchanted by the exchange.","One mused: “I love how smart Satoshi sounds.”","Some returned to the key points made in the 2010 discussion, with one remarking that “everything has a price” and bemoaning “carbon clowns trying to make trouble.”","But another pined for days gone by on the internet, and times of more civil exchanges, writing,","“I love that proper conversation and change of opinion was still possible in 2010. Discussions were not motivated by political bias and ultimately ending in ad hominems, but by the actual will to learn and understand things. It is so refreshing to look back at.”","____\nLearn more:\n– Satoshi Nakamoto from NSA, AntiChrist and Other Bitcoin Conspiracy Theories\n– Satoshi Nakamoto Mined More Than 1 Million Bitcoin – Report\n– Bitcoin Miners Buy Oversupplied Energy, Turn To Renewables – Nic Carter\n– Why Bitcoin’s Energy Consumption May Be a Price Worth Paying\n– Norwegian Giant Aker Goes Bitcoin, Defends BTC Mining, Eyes Micropayments\n– Bitcoin Mining in 2021: Growth, Consolidation, Renewables, and Regulation\n– Bitcoiners May Change Their Mind on PoS, ‘Who Knows,’ Says Buterin"],"entity":[{"type":"August 7, 2010","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Satoshi Nakomoto","content":"PERSON"},{"type":"Nic Carter\n– Why Bitcoin’s Energy Consumption","content":"ORGANIZATION"},{"type":"Gridecoin","content":"PERSON"},{"type":"NSA","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Eyes Micropayments\n– Bitcoin Mining","content":"ORGANIZATION"},{"type":"Nakomoto","content":"PERSON"},{"type":"Bitcoin Miners Buy Oversupplied Energy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Mining","Satoshi Nakamoto"],"authors":["Tim Alper"]}