{"summary":"Bitcoin’s price stability is merely a last stand before capitulation, an ECB blog suggests. \nThe leading cryptocurrency by market cap is rarely used in legal transactions and poses a reputational risk to banks, the post says. \nRegulation is often misunderstood as approval and gives false security to investors, it argues.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190922\/bitcoin-last-gasp-before-road-to-irrelevance","publishDate":"2022-11-30T08:12:34","id":1728,"type":null,"title":"Bitcoin is on its &#x27;last gasp before the road to irrelevance,&#x27; ECB advisers argue","category":["Policy"],"content":["While bitcoin might appear stable for now, it's on the brink of irrelevance — at least according to a report from two advisers to the European Central Bank (ECB).","Bitcoin is rarely used in transactions and poses a reputational risk for banks, according to an ECB blog <a href=\"https:\/\/www.ecb.europa.eu\/press\/blog\/date\/2022\/html\/ecb.blog221130~5301eecd19.en.html\" data-v-f87c67ca=\"\">post<\/a>, which argues that regulation could be misunderstood as approval.","Bitcoin's price peaked at $69,000 in November 2021 before falling to $17,000 this summer, note Ulrich Bindseil and Jürgen Schaaf, the report's authors. And since the collapse of the Terra ecosystem in May, and this month's bankruptcy of the FTX exchange, it's mainly fluctuated between $17,000 and $20,000.","While some see this stability in the face of multiple crises as an optimistic sign, Bindseil and Schaaf see it as \"an artificially induced last gasp before the road to irrelevance — and this was already foreseeable before FTX went bust.\"","While the blog post is described as a \"opinion piece\" that doesn't necessarily represent the views of the ECB, both authors have roles with the central bank. Bindseil is the ECB's director general of market infrastructure and payments and Schaaf is an adviser.&nbsp;","The report points out that bitcoin is hardly ever used for transactions and purchases — at least not legal ones.","Despite being created to overcome the existing monetary and financial system, bitcoin has many shortcomings, Bindseil and Schaaf argue, adding that the conceptual design and technological failings make bitcoin questionable as a means of payment.","\"Bitcoin transactions are cumbersome, slow and expensive. Bitcoin has never been used significantly for legal real-world transactions,\" they write, arguing that bitcoin's market value is based purely on speculation.&nbsp;","As such, the post states, bitcoin is neither suitable as a payment system nor as a form of investment. Therefore, it shouldn't be treated as either in regulatory terms and shouldn't be legitimized.","Banks and the financial industry should be wary of the long-term damage of promoting bitcoin investments, according to the report. Bindseil and Schaaf argue that short-term profits don't offset the negative impact on customer relations.","The authors go as far as to say the reputational damage to the entire industry could be enormous if bitcoin investors make further losses.","In addition, the authors posit that regulatory oversight is often misunderstood as approval.&nbsp;","They point to bitcoin proponents funding lobbyists to push the case for acceptance with lawmakers and regulators, biting that the number of crypto lobbyists in the U.S. alone tripled from 115 in 2018 to 320 in 2021. The report didn't share numbers from 2022.","While lawmakers have sometimes facilitated the influx of funds by supporting the proposed merits of bitcoin, some even offered regulations that gave the impression that crypto is just another asset class.","However, this is not the case. According to the ECB authors, the risks of crypto assets are undisputed among regulators.&nbsp;","\"In July, the Financial Stability Board (FSB) called for crypto assets and markets to be subject to effective regulation and supervision commensurate with the risks they pose — along the doctrine of 'same risk, same regulation.'\"","Despite this, regulation has been slow to ratify, with implementation often lagging. Different jurisdictions aren't proceeding at the same pace, Bindseil and Schaaf point out.&nbsp;","The EU has agreed on a \"comprehensive regulatory package\" in the <a href=\"https:\/\/www.theblock.co\/post\/189568\/mica-would-have-limited-impact-on-ftx-breakdown-says-mep-ondrej-kovarik\" data-v-f87c67ca=\"\">Markets in Crypto Assets Regulation<\/a> (MiCA) proposal. However, the U.S. has not yet been able to agree on \"coherent rules.\"","Misconceptions also shape current regulations, especially \"the belief that the space must be given to innovation at all costs stubbornly persists\" even as blockchain technology has so far created little value for society.","\"Since bitcoin appears to be neither suitable as a payment system nor as a form of investment, it should be treated as neither in regulatory terms and thus should not be legitimised,\" they conclude.&nbsp;"],"hashtag":["BITCOIN","ECB"]}