{"summary":"DeFi Exploits in February Cause Losses of $82 Million With Just $1.3 Million Recovered: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/defi-sees-february-losses-of-82-million-with-just-1-3-million-recovered-report.htm","publishDate":"2024-03-01T21:30:33","id":17287,"type":null,"title":"DeFi Exploits in February Cause Losses of $82 Million With Just $1.3 Million Recovered: Report","category":["DeFi News "],"content":["February 2024 witnessed the DeFi sector grappling with security exploits that led to losses exceeding $82 million.","A report sent to Cryptonews by Web3 app and antivirus solution De.Fi noted that $82,287,101 was lost, with just $1,325,932 recovered.","The biggest DeFi security exploit in February happened in the Ethereum-based Play-to-Earn game PlayDapp, causing a loss of $32.3 million on Ethereum.","PlayDapp faced a major security breach with compromised private keys, resulting in the unauthorized minting and theft of 1.79 billion PLA tokens. The attacker added a new minter to PlayDapp, converting tokens into $32 million USD, then proceeded to disperse stolen funds across various addresses.","🚨🚨Major DeFi Exploit! @playdapp_io Loses $31M in Token Mint Attack.","A critical exploit on PlayDapp resulted in the minting of 200M $PLA tokens, causing a -12% price drop and a $31M loss! This represents a significant increase in circulating supply, impacting the price.","📉 The… pic.twitter.com\/dkSSLxRvFb","— Olympix (@Olympix_ai) February 9, 2024","","Access control issues dominated the past month, accounting for $72,823,472 in losses across four cases.","“Proper access control mechanisms are essential to ensure that only authorized users can perform sensitive operations, thereby preventing unauthorized access or manipulation of funds,” De.Fi said in its report. “The cases impacted by access control issues emphasize the importance of comprehensive security audits to identify and rectify potential vulnerabilities in the system’s access control protocols.”\n","The gaming\/metaverse sector recorded the biggest losses, with PlayDapp’s losses being the main contributor. Decentralized Exchanges were also popular targets, with FixedFloat, which lost $26.1 million on Bitcoin, being the largest contributor.","Borrowing and lending platforms were the third most-impacted category, losing over $1.3 million last month.","#FixedFloat hacker continues laundering stolen funds using mixers. Today 43 #btc were sent to an unknown mixer.#hack #exploit #cryptocurrency pic.twitter.com\/NxpbryJWb6","— Evgenii| BLIN Analytics (@CryptoEvgen) February 24, 2024","","Ethereum was the chain with the highest losses at $40.1 million, with Bitcoin ($26.1 million), BNB Chain ($4.77 million), and Ronin ($9.7 million) also experiencing major losses.","De.Fi concluded that DeFi platforms have to embrace stringent security measures to protect against phishing and other exploits.","“To navigate these challenges, platforms must prioritize comprehensive security audits, embrace robust access management practices, and foster community education to empower users against phishing and other social engineering attacks,” De.Fi said. “As DeFi continues to mature, the collaboration between platforms like De.Fi, security researchers, and users will be paramount in safeguarding the ecosystem and fostering its sustainable growth.”"],"entity":[{"type":"$40.1 million","content":"MONEY"},{"type":"Token Mint Attack","content":"ORGANIZATION"},{"type":"$32.3 million","content":"MONEY"},{"type":"$9.7 million","content":"MONEY"},{"type":"$72,823,472","content":"MONEY"},{"type":"$1.3 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"PLA","content":"ORGANIZATION"},{"type":"-12%","content":"PERCENT"},{"type":"February 9, 2024","content":"DATE"},{"type":"Evgenii| BLIN Analytics","content":"ORGANIZATION"},{"type":"$26.1 million","content":"MONEY"},{"type":"$82 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$PLA","content":"MONEY"},{"type":"$1,325,932","content":"MONEY"},{"type":"1.79 billion","content":"MONEY"},{"type":"$31M","content":"MONEY"},{"type":"$32 million","content":"MONEY"},{"type":"$82,287,101","content":"MONEY"},{"type":"$4.77 million","content":"MONEY"},{"type":"February 24, 2024","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DeFi","Ethereum","Exploit"],"authors":["Brian Yue"]}