{"summary":"Hong Kong Cracks Down on Fake Crypto Exchange Allegedly Linked to Elon Musk","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-cracks-down-on-fake-crypto-exchange-allegedly-linked-to-elon-musk.htm","publishDate":"2024-05-08T14:26:25","id":17280,"type":null,"title":"Hong Kong Cracks Down on Fake Crypto Exchange Allegedly Linked to Elon Musk","category":["Blockchain News "],"content":["The Hong Kong Securities and Futures Commission (SFC) has warned the public regarding Quantum AI, an entity allegedly engaged in fraudulent activities related to virtual assets and impersonating Elon Musk. Quantum AI claims to leverage artificial intelligence technology to provide cryptocurrency trading services.","However, the Hong Kong SFC has raised suspicions that Quantum AI deceived the public by impersonating Elon Musk, the renowned entrepreneur and developer of Quantum AI’s purported technologies.","","According to the report, Quantum AI utilized deepfake videos and photos on its website and social media platforms to create the illusion that Elon Musk was associated with the platform. This deceptive tactic misled investors into believing Quantum AI had Elon Musk’s endorsement or involvement.","","The Hong Kong SFC issues an alert against Quantum AI. Source: sfc.hk","Furthermore, on May 8, the Hong Kong Securities and Futures Commission (SFC) raised suspicions against Quantum AI for allegedly disseminating “false and misleading information” about the company through an undisclosed news website. This strategy was purportedly aimed at promoting its crypto trading services and gaining credibility among unsuspecting investors in Hong Kong.","According to SFC suspicion alert on its website, SFC wrote,","“It claims on the “news” website that the Hong Kong public has been using its technology to trade in cryptocurrencies and is able to earn “too-good-to-be-true” returns.”","In response to these allegations, the Hong Kong Police Force has intervened, taking action to block Quantum AI’s website and remove associated social media pages at the request of the SFC. Despite these enforcement measures, authorities remain vigilant, cautioning the public against potential ongoing fraudulent activities.","There is a concern that fraudsters may attempt to circumvent regulatory actions by creating new websites and social media pages with similar domain names, perpetuating the deception and posing risks to unsuspecting investors.","As such, investors are advised to exercise caution and perform thorough due diligence before engaging with any virtual asset-related services.","","The SFC recently warned about an alleged fraudulent crypto exchange named MEXC, cautioning the public against its activities. The fake MEXC reportedly enticed victims through social media and messaging groups, offering free investment advice and prompting them to buy crypto on its websites.","The SFC added the fake MEXC and its websites to its alert list, suspecting illegal virtual asset trading activities. Hong Kong police have restricted access to MEXC websites and are collaborating with the SFC to investigate further instances of fraudulent behavior. The SFC has also warned about suspicious websites impersonating licensed virtual asset trading platforms. Specifically, the commission identified two platforms—HSKEX and OSL Digital Securities Limited—being impersonated by fraudulent websites, potentially deceiving investors into believing they are interacting with legitimate entities.","Hong Kong SFC also issued a public notice on March 4 regarding BitForex, a cryptocurrency exchange allegedly involved in fraudulent activities. The SFC’s notice highlights suspected virtual asset fraud involving BitForex, emphasizing that the exchange is neither licensed by the SFC nor has it applied for a license to operate a virtual asset trading platform in Hong Kong. Given the risks of dealing with unlicensed entities, investors are urged to exercise caution when engaging with unregistered Bitcoin platforms. In response to these concerns, the SFC has blocked access to BitForex’s web links and social media pages to reduce potential harm to investors.","The SFC also issued a cautionary statement on March 14, advising crypto traders against using the cryptocurrency exchange Bybit and identifying 11 of its products as suspicious investments. The SFC has flagged leveraged tokens, options, futures contracts, and similar crypto services offered by Bybit, highlighting the potential financial risks and losses for investors associated with these unauthorized products."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Hong Kong Police Force","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"May 8","content":"DATE"},{"type":"Hong Kong SFC","content":"ORGANIZATION"},{"type":"Elon Musk","content":"PERSON"},{"type":"OSL Digital Securities","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"March 14","content":"DATE"},{"type":"March 4","content":"DATE"},{"type":"Hong Kong Securities and Futures Commission (SFC","content":"ORGANIZATION"}],"hashtag":["Elon Musk","Hong Kong","SFC"],"authors":["Hassan Shittu"]}