{"summary":"Gary Gensler is not backing down from the crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168600\/gensler-sec-has-been-clear-on-cryptocurrencies","publishDate":"2022-09-08T10:00:03","id":1729,"type":null,"title":"Gensler: SEC has been &#x27;clear&#x27; on cryptocurrencies","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Gary Gensler is not backing down from the crypto industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Of the nearly 10,000 tokens in the crypto market, I believe the vast majority are securities,” Gensler said, reiterating the SEC's stance that most digital currencies are unregistered securities. Gensler spoke virtually at a legal conference in Washington on Thursday. <\/span>","<span data-v-f87c67ca=\"\">The SEC chair took direct aim at the crypto industry’s frequent complaint about the SEC under his purview: that they lack clear guidance.<\/span>","<span data-v-f87c67ca=\"\">“Without prejudging any one token, most crypto tokens are investment contracts under the Howey test,\" Gensler said, referring to the longstanding legal test for whether an asset fits the definition of a security under U.S. law. \"Some in the crypto industry have called for clearer guidance,” Gensler said. “Through the past 5 years, the SEC has spoken with a pretty clear voice.”<\/span>","<span data-v-f87c67ca=\"\">Gensler did allow that, “Some tokens may not meet the definition of securities, what I’ll call non-security tokens,” that are, “small in number, but maybe significant in value.” So far U.S. regulators have only determined Bitcoin and Ether to be clear non-securities among cryptocurrencies.&nbsp;<\/span>","The SEC chair also cautioned that stablecoins could fall under the category of unregistered securities.&nbsp;","\"Stablecoins have features similar to, and potentially competing with, money market funds, other securities, and bank deposits, and raise important policy issues,\" Gensler said. \"Depending on their attributes, such as whether these instruments pay interest, directly or indirectly, through affiliates or otherwise; what mechanisms are used to maintain value; or how the tokens are offered, sold, and used within the crypto ecosystem, they may be shares of a money market fund or another kind of security.\"","He added: \"If so, they would need to register and provide important investor protections.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Howey","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","CFTC","GARY GENSLER","SEC"],"authors":["Kollen Post","The Block"]}