{"summary":"An NFT Was Sold For Nearly USD 129,900 Profit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/an-nft-was-sold-for-nearly-usd-129-900-profit-9097.htm","publishDate":"2021-02-02T10:20:00","id":17299,"type":null,"title":"An NFT Was Sold For Nearly USD 129,900 Profit","category":["News "],"content":["A single non-fungible token (NFT) was flipped for a profit of c. USD 129,870 in less than four days.","","The Cryptoverse is abuzz over a couple of pieces of art sold and bought recently for a substantial amount of money. The pieces are a part of a Hashmasks collection of 16,384 portraits by over 70 artists, the sale of which has ended.","The sale started with the first batch of artworks being sold for ETH 0.1 (c. USD 130) on January 28. Each following tranche increased in price with the last one costing ETH 100 a piece.","Collector Westcoastbill owns a piece called ‘Trump’ – bought for nearly ETH 100 on January 31, translating to USD 130,000, which means that the seller who acquired it for just ETH 0.1 earned major profit: roughly 99,900%. Westcoastbill holds a number of other items as well in their collection.","Meanwhile, another artwork was said to have been sold for ETH 100 on January 31, making this person massive profit. But this specific piece called ‘Denver’ is owned by ‘15396C’ and no bids are recorded as of yet.","These art pieces reportedly come with implicit and explicit rarity: the former stemming from the fact that this is art, inviting consumers to project their interpretation of value into the artwork, as the website says, while the former is produced by various characteristics the artists included in a piece, with each detail being more or less common or rare: “The smart contracts allow you to assign a name to your Hashmask giving you the ability to add your unique stroke to the canvas.”","“Above all, the control over the rarest of all traits – the name – is given to the full extent to the consumer,” the site adds. By holding the artwork, users accumulate the Name Changing Token (NCT) on a daily basis, which allows them to choose a name for their portrait on the Ethereum (ETH) blockchain.","Meanwhile, the Cryptoverse is also showing off pieces from their collections, discussing their rarity.","__","And these recent discussions seem to have awoken curiosity in others too.","____\nLearn more:\nNon-Fungible 2021: Prepare Your NFTs For DeFi, Staking, and Sharing\n‘Traditional’ Art vs. Crypto Art: How to Value It"],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"January 31","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Westcoastbill","content":"PERSON"},{"type":"January 28","content":"DATE"},{"type":"Denver","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"99,900%","content":"PERCENT"},{"type":"Name Changing Token (NCT","content":"ORGANIZATION"},{"type":"Cryptoverse","content":"ORGANIZATION"}],"hashtag":["Art","Ethereum","NFT"],"authors":["Sead Fadilpašić"]}