{"summary":"NFT Issues Freeze South Korean Gaming Regulator into Inaction","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nft-issues-freeze-south-korean-gaming-regulator-into-inactio-7804.htm","publishDate":"2020-09-25T03:00:00","id":17296,"type":null,"title":"NFT Issues Freeze South Korean Gaming Regulator into Inaction","category":["News "],"content":["The debate about blockchain gaming, non-fungible tokens (NFTs) and regulation continues to rumble on in South Korea – with the nation’s gaming commission speaking out about its reasoning for long delays in issuing ratings to blockchain game developers.","As previously reported, video game developer SkyPeople has been forced to wait over a month for the regulatory Game Rating and Administration Committee (GRAC) to decide whether or not it will issue the new game Five Stars, with a ratings certificate.","Unrated games may not be distributed through domestic distribution platforms under South Korean law.","GRAC refused to issue a license to a rival game maker in 2019, claiming that game-related NFTs could be traded for crypto or fiat on the Ethereum (ETH) blockchain.","Per Daily Hanguk, SkyPeople is proceeding with a rollout for a “non-blockchain” version of Five Stars in the meantime – as there now seems to be no clear end in sight to its struggle to get a ratings certificate for the blockchain version. The company also aims to release an international blockchain version of the game next year.","The game is due to be released on the Klaytn blockchain network, operated by domestic chat app operator Kakao.","However, SkyPeople stated that GRAC has now “postponed its deliberation” indefinitely as it conducts an “in-depth review” into the use of NFTs in game releases.","The same media outlet stated that the commission is wary of rushing into a decision that would likely become a precedent for scores of other domestic blockchain game developers.","A GRAC official was quoted as stating:","“We have a positive stance on blockchain technology, but we are carefully looking into matters pertaining to the creation of digital assets by encrypting in-game items. We have to be careful here because cryptoassets’ prices vary and are subject to volatility.”","__","Learn more: As DeFi Cools, Altcoin Pump Addicts Smell Fresh Blood in NFTs"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Administration Committee (GRAC","content":"ORGANIZATION"},{"type":"SkyPeople","content":"ORGANIZATION"},{"type":"GRAC","content":"ORGANIZATION"},{"type":"Altcoin Pump Addicts Smell Fresh Blood","content":"ORGANIZATION"},{"type":"Kakao","content":"PERSON"},{"type":"2019","content":"DATE"}],"hashtag":["Blockchain","Gaming","Non-fungible tokens","Regulation","South Korea"],"authors":["Tim Alper"]}