{"summary":"Digital Euro Not Expected to Debut Until 2028 or 2029: German Central Bank President","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/digital-euro-launch-not-expected-until-2028-bundesbank-president.htm","publishDate":"2024-04-25T09:32:28","id":17293,"type":null,"title":"Digital Euro Not Expected to Debut Until 2028 or 2029: German Central Bank President","category":["News "],"content":["The digital euro will likely not launch until 2028 or 2029, Germany’s central bank president, Dr. Joachim Nagel, said on Wednesday.","“It may take another four or five years before it is actually implemented,” he said at the DZ Bank Capital Markets Conference 2024.","The European Central Bank (ECB) initiated a two-year “preparation phase” for the project late last year. During this period, it plans to finalize rules, select private-sector partners, and conduct testing and experimentation.","After these two years, the Governing Council will determine whether to proceed to the next stage of preparations. This will lay the groundwork for potential future issuance, the ECB said.","According to Nagel, the Governing Council can only decide after the European legislative process ends.","The digital euro is envisioned as a central bank digital currency (CBDC), essentially an electronic form of cash. Unlike cryptocurrencies, it would be backed by a central bank. The ECB is among the majority of central banks exploring CBDCs to improve the capabilities and accessibility of central bank money.","Nagel emphasized the advantages of a European payment method. He said it will be secure, convenient, fast, reliable, free, and accepted across the eurozone.","Currently, German bank cards may not function in other euro area nations, he pointed out. The digital euro could facilitate various transactions. This includes online purchases to in-store transactions and payments to public authorities, especially if it becomes legally recognized as tender.","Most people would pay with digital euro using either their existing online banking app (provided by their bank) or the digital euro app on their smartphone with baseline functionalities (provided by the Eurosystem), he said.","Critics oppose the idea of a digital euro. Banks and regulators worry it will reduce the money they hold, while others are concerned about privacy. Some argue it might not be much better than existing options and could even cause problems for banks during financial crises.","The ECB says a digital euro would create competition in payments, currently dominated by American companies. To address worries about harming banks, they plan to limit how much any one person can hold, likely around 3,000 euros."],"entity":[{"type":"Governing Council","content":"ORGANIZATION"},{"type":"Nagel","content":"PERSON"},{"type":"DZ Bank Capital Markets Conference 2024","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Joachim Nagel","content":"PERSON"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"2029","content":"DATE"}],"hashtag":["CBDC","Digital Euro","Germany"],"authors":["Shalini Nagarajan"]}