{"summary":"Disney Invests $1.5 Billion in Epic Games to Create New Virtual World tied to Fortnite","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/disney-invests-1-5-billion-in-epic-games-to-create-new-virtual-world-tied-to-fortnite.htm","publishDate":"2024-02-08T06:17:10","id":17309,"type":null,"title":"Disney Invests $1.5 Billion in Epic Games to Create New Virtual World tied to Fortnite","category":["Altcoin News "],"content":["Entertainment giant Disney and video game developer Epic Games have joined forces to build a new immersive virtual universe tied to Fortnite.","In a recent press release, Disney said it also plans to invest $1.5 billion to acquire an equity stake in Epic Games alongside the multiyear project.","While specific details about this metaverse-like venture remain scarce, Disney has provided some insights into their plans.","The forthcoming persistent universe will not only offer a world-class gaming experience and integrate with Fortnite but will also provide a wide range of opportunities for consumers to engage with beloved Disney, Pixar, Marvel, Star Wars, and Avatar characters, stories, and content.","“Players, gamers, and fans will be able to create their own stories and experiences, express their fandom in a distinctly Disney way, and share content with each other in ways that they love,” the company said.","The project will be powered by Unreal Engine, Epic Games’ cutting-edge technology.","Last year, Disney pulled the plug on its metaverse division, eliminating the entire team of 50 people tasked with exploring ways to tell interactive stories in new technological formats.","The metaverse division was tasked with finding ways to tell interactive stories in new technological formats using Disney’s extensive library of intellectual property.","However, with the new collaboration, Disney is making a major foray into the gaming world.","“This marks Disney’s biggest entry ever into the world of games and offers significant opportunities for growth and expansion,” Disney CEO Bob Iger said in a statement.","","Epic Games CEO Tim Sweeney echoed the sentiment, emphasizing their aim to create a persistent, open, and interconnected ecosystem that unites the Disney and Fortnite communities.","“Disney was one of the first companies to believe in the potential of bringing their worlds together with ours in Fortnite, and they use Unreal Engine across their portfolio,” said Tim Sweeney, CEO and Founder, Epic Games.","The exact timeline for the debut of this metaverse remains uncertain.","Meta subsidiary Reality Labs, which focuses on the development of the metaverse, recorded a significant operating loss of over $4.6 billion in the fourth quarter of 2023.","In its fourth-quarter report, released on February 1, Meta revealed that Reality Labs reported a loss of $4.65 billion during Q4, while generating nearly $1.1 billion in revenue.","The metaverse has been a topic of intense debate in the tech world, with some industry leaders like Bill Gates expressing a tepid outlook.","The gloomy outlook regarding the metaverse is not entirely out of the norm, particularly since many big supporters of the idea have recently backed down from their ambitions.","For one, Microsoft has discontinued its Industrial Metaverse Core team this year, a four-month-old project aimed to encourage the use of the metaverse in industrial environments.","The tech giant also laid off all employees working on the project, which amounts to about 100 people."],"entity":[{"type":"Tim Sweeney","content":"PERSON"},{"type":"Fortnite","content":"LOCATION"},{"type":"Marvel","content":"ORGANIZATION"},{"type":"Star Wars","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"the fourth quarter of 2023","content":"DATE"},{"type":"Pixar","content":"ORGANIZATION"},{"type":"Unreal Engine","content":"ORGANIZATION"},{"type":"Bill Gates","content":"PERSON"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"February 1","content":"DATE"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Reality Labs","content":"ORGANIZATION"},{"type":"Disney","content":"ORGANIZATION"},{"type":"Bob Iger","content":"PERSON"},{"type":"$4.65 billion","content":"MONEY"}],"hashtag":["Disney","Epic Games","Metaverse"],"authors":["Ruholamin Haqshanas"]}