{"summary":"Chinese Prosecutors Promise Increased Punishment for Blockchain and Metaverse Crimes","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chinese-prosecutors-promise-increased-punishment-for-blockchain-and-metaverse-crimes.htm","publishDate":"2024-02-23T20:24:37","id":17304,"type":null,"title":"Chinese Prosecutors Promise Increased Punishment for Blockchain and Metaverse Crimes","category":["Blockchain News "],"content":["Criminals engaging in illicit operations through the use of blockchain technology and metaverse projects will face increased repercussions, China’s highest prosecutor said today.","In a press conference hosted by the China’s Supreme People’s Procuratorate on February 23, spokesperson Li Xuehui highlighted a surge in cybercrime occurring within blockchains and the metaverse.","Li noted that crypto money laundering has rapidly evolved into a mainstream conduit for illicit wealth and criminal activities.","“In the next step, the procuratorial organs will conscientiously implement the requirements of the 20th National Congress of the Communist Party of China, plan and promote the Internet legal work of procuratorial organs from a higher starting point, and provide strong judicial guarantee for promoting the formation of a good Internet ecology,” Li said in the press conference.","Zhang Xiaojin, the Director of the Fourth Procuratorate of the Supreme People’s Procuratorate, warned the public about the prevalence of “high yield, low risk” investment scams within China’s local crypto economy. The Chinese prosecutor urged individuals to stay vigilant and adapt to evolving criminal strategies, citing the example of pig butchering as one of the most prominent scams.","The practice of pig butchering involves establishing a connection with a victim, persuading them to invest in a deceptive digital asset project or exchange, and subsequently vanishing with their invested capital. U.S. authorities successfully seized over $9 million in Tether’s USDT stablecoin last year in connection with a pig butchering scam.\n","Last year, Chinese authorities prosecuted over 42,000 individuals implicated in electronic fraud and crypto scams.","Crypto trading and mining have been prohibited in China since 2021. Despite this, the country has made advancements in CBDCs and regulatory policies surrounding Web3 technologies.","China’s recent crackdown on individuals running blockchain and metaverse scams aligns with a surge in illicit crypto activities in Hong Kong. Crypto-related crimes in the special administrative region have nearly tripled since 2021, according to Hong Kong’s Financial Services and Treasury.","Hong Kong has recently implemented crypto-friendly regulations aimed at standardizing its local digital asset ecosystem and safeguarding investors. The region has introduced a licensing regime for compliant businesses and even hinted at the possibility of allowing spot Bitcoin ETFs to trade on local exchanges following the approval of 11 issuers by the U.S. Securities and Exchange Commission.","As the transitional period for the #VirtualAsset Service Providers licensing system enters its final stage, we are gradually enhancing measures on virtual asset regulation to facilitate market development #ChristopherHui https:\/\/t.co\/SZCYooCwWK","— Hong Kong SAR Government News (@newsgovhk) February 2, 2024","",""],"entity":[{"type":"#VirtualAsset Service Providers","content":"ORGANIZATION"},{"type":"20th National Congress","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Fourth Procuratorate of the Supreme People’s Procuratorate","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"February 23","content":"DATE"},{"type":"Communist Party of China","content":"ORGANIZATION"},{"type":"China’s Supreme People’s Procuratorate","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Hong Kong’s Financial Services and Treasury","content":"ORGANIZATION"},{"type":"Hong Kong SAR Government News","content":"ORGANIZATION"},{"type":"February 2, 2024","content":"DATE"},{"type":"Li Xuehui","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Zhang Xiaojin","content":"PERSON"}],"hashtag":["China","crypto scam","Hong Kong"],"authors":["Brian Yue"]}