{"summary":"North Korea’s Cyber Activities and Crypto Theft Fuel Half of Foreign Currency Revenue: UN","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/north-koreas-cyber-activities-crypto-theft-fuel-half-of-foreign-currency-revenue-un.htm","publishDate":"2024-03-21T12:15:52","id":17315,"type":null,"title":"North Korea’s Cyber Activities and Crypto Theft Fuel Half of Foreign Currency Revenue: UN","category":["Altcoin News "],"content":["In recent news, the UN stated that North Korea has been actively involved in “malicious” cyber activities and crypto theft, contributing to nearly half of its foreign currency revenue and funding its weapons programs. ","According to a recent report by a United Nations (UN) panel of experts, Pyongyang has been using cyber means to generate approximately 50 percent of its foreign currency income, with one member state divulging this information. ","Additionally, the panel’s findings indicate that 40 percent of North Korea’s weapons of mass destruction (WMD) programs are financed through illicit cyber activities, Yonhap reported. ","The UN panel’s investigation focuses on cyberattacks linked to cryptocurrency-related companies, dating back to 2017. ","It has identified 58 suspected attacks by North Korea during this period, with an estimated value of around $3 billion. ","The report underscores the ongoing targeting of the virtual asset industry by North Korean cyber threat actors, who seek to generate revenue and bypass UN sanctions.","Highlighting the severity of the situation, the panel identifies 17 cryptocurrency heists in 2023 alone that may be attributed to North Korea, amounting to over $750 million in stolen funds. ","The report further emphasizes the panel’s scrutiny of a total of 58 suspected cyberattacks on crypto-linked firms between 2017 and 2023, revealing the significant impact of North Korea’s cyber theft operations. ","These activities have led one cybersecurity company to label North Korea as the world’s most prolific cyber thief.","While engaging in these illicit cyber activities, North Korea has flagrantly disregarded UN Security Council resolutions and intensified its nuclear and missile programs. ","The panel’s report highlights the country’s continued development of nuclear weapons and production of nuclear fissile materials, despite its last known nuclear test occurring in 2017. ","Notably, the report draws attention to observations made by the Director General of the International Atomic Energy Agency (IAEA), Rafael Grossi, regarding the potential production of more fissile materials used for nuclear bombs. ","Grossi’s remarks indicate concerning activities related to the commissioning of a “light water reactor” that could contribute to North Korea’s nuclear ambitions.","In addition to its nuclear pursuits, the panel pointed out North Korea’s persistent violations of UN resolutions through advancements in ballistic missile capabilities. ","The country has conducted missile launches, tested satellite launchers, and allegedly commissioned a ballistic missile submarine. ","The panel’s assessment suggests that North Korea has made progress in several aspects of its missile program, including reliability, maneuverability, precision, air bursts, and mobile launcher manufacturing.","In 2022, Chainalysis, a blockchain monitoring firm, reported an all-time high of $3.8 billion stolen by cybercriminals in the crypto realm. ","Notably, North Korean government hackers, known as the Lazarus Group, accounted for $1.7 billion of that total. ","The group’s prolific activities aimed to fund the country’s nuclear weapons program in violation of international sanctions.","Back in 2021, hackers managed to seize $3.3 billion in digital assets, according to data from Chainalysis. "],"entity":[{"type":"2017","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Yonhap","content":"ORGANIZATION"},{"type":"$3.8 billion","content":"MONEY"},{"type":"40 percent","content":"PERCENT"},{"type":"Director General of the International Atomic Energy Agency (IAEA","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"UN Security Council","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"UN","content":"ORGANIZATION"},{"type":"$750 million","content":"MONEY"},{"type":"Pyongyang","content":"LOCATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"},{"type":"Rafael Grossi","content":"PERSON"}],"hashtag":["Crypto hack","North Korea"],"authors":["Ruholamin Haqshanas"]}