{"summary":"Stefan Qin--a former crypto hedge funder--was sentenced to 7 and a half years in prison for running a Ponzi scheme. This was his pitch to investors back in 2020.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117824\/a-former-crypto-hedge-funder-was-sentenced-to-more-than-7-years-in-prison-for-running-a-ponzi-heres-how-he-pitched-investors","publishDate":"2021-09-15T19:29:56","id":1731,"type":null,"title":"A former crypto hedge funder was sentenced to more than 7 years in prison for running a Ponzi - here&#x27;s how he pitched investors","category":["CAPITAL MARKETS"],"content":["A former cryptocurrency executive, who raised more than $90 million for an investment fund, was sentenced on Wednesday to more than 7 years in prison for running what prosecutors described as a Ponzi scheme.&nbsp;","24-year-old Stefan Qin ran Virgil Sigma Fund LP for three years until 2020. He pleaded guilty in February and received sentencing on Wednesday.&nbsp;","\"I abused their trust in immoral and illegal ways to boost my success,” Qin said, referring to his scammed investors.","The Department of Justice said in a statement from February:","\"Stefan He Qin drained almost all of the assets from the $90 million cryptocurrency fund he owned, stealing investors’ money, spending it on indulgences and speculative personal investments, and lying to investors about the performance of the fund and what he had done with their money.\"","In March 2020, a well-placed investor in the market shared a pitch briefing Virgil was sending to investors as part of an effort to raise more funds. &nbsp;The US attorney's office for the Southern District of New York claimed that the former hedge funder scammed more than 100 investors, as The Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/ex-cryptocurrency-fund-manager-sentenced-to-7-years-in-prison-11631736989\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","\"We sniffed it out pretty quickly cause the numbers didn’t make sense,\" the investor said. \"The performance numbers vs the market just seemed off.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Although arbitrage strategies at that time were lucrative, the numbers he was talking about didn’t make sense.\"","The pitch said that the firm \"pursues opportunities off traditionally risky indicators for crypto-currencies, such as extreme volatilities, high barriers of entry, and cross-border trading nascence by taking advantage of arbitrage opportunities globally.\"","It shared its returns, which it claimed to have been audited:","","","The firm claimed to return more than 100% in 2018—a year during which crypto prices plunged that many refer to as crypto winter. It said it returned 30% in 2019.&nbsp;","Other claims include that the firm was averaging 20,000-60,000 trades a day and boasted a long track record with limited volatility.","","","The document mentions a fund, dubbed 'Virgil Sigma Fund China', that had a 30% performance fee. A source said that this was a new fund for which the firm had been raising capital. In the document, Virgil claimed that Silvergate—a publicly traded crypto firm—served as the fund's bank.","The document later notes:","\"Virgil does NOT invest in tokens or ICOs. Virgil does NOT buy-and-hold cryptocurrencies for return. The bulk of Virgil portfolio is held in fiat currency and hedged wherever\/whenever appropriate. Less than 10% of the Fund is held in any single exchange at any given time, capping the Fund’s exposure to isolated sec.\"","The aforementioned Journal report noted that in addition to using the firm's assets to pay redemption requests, Qin also used it to pay the rent on his luxury New York City apartment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Virgil","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"March 2020","content":"DATE"},{"type":"$90 million","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Stefan Qin","content":"PERSON"},{"type":"Virgil Sigma Fund LP","content":"ORGANIZATION"},{"type":"Stefan He Qin","content":"PERSON"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Qin","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}