{"summary":"The plaintiff in a new lawsuit is alleging that his constitutional rights were violated by the Internal Revenue Service (IRS) when it obtained information about his crypto transactions\nJames Harper, who was one of thousands of recipients of an IRS letter referencing their recent crypto transactions, alleges that the agency unlawfully solicited user data from crypto exchanges","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71764\/tax-day-lawsuit-alleges-the-irs-violated-crypto-holders-constitutional-rights","publishDate":"2020-07-15T16:15:53","id":1731,"type":null,"title":"Tax Day lawsuit alleges the IRS violated crypto holders&#x27; constitutional rights","category":["Tax"],"content":["<span data-v-f87c67ca=\"\">Last summer, the Internal Revenue Service (IRS) issued<\/span> <a href=\"https:\/\/www.theblockcrypto.com\/linked\/33760\/cryptocurrency-investors-start-receiving-letters-from-the-irs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">thousands of letters<\/span><\/a><span data-v-f87c67ca=\"\"> to crypto holders warning them that if they did not report their digital assets properly they could face penalties. Now, one of that letter’s recipients is suing the agency on Tax Day, alleging it violated taxpayers’ constitutional rights.<\/span>","<span data-v-f87c67ca=\"\">Plaintiff James Harper filed a suit against the IRS, its commissioner Charles P. Rettig and unnamed IRS agents for their role in the alleged unlawful seizure of information that identified him as a crypto holder. Harper contends that the IRS violated his rights under the Fourth and Fifth Amendments to the Constitution.<\/span>","<span data-v-f87c67ca=\"\">In August of 2019, Harper received a letter from the IRS related to his crypto holdings, which read: “You have had one or more accounts containing virtual currency but may not have properly reported your transactions involving virtual currency.” The wording closely resembles that of a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/33760\/cryptocurrency-investors-start-receiving-letters-from-the-irs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">letter<\/span><\/a><span data-v-f87c67ca=\"\"> The Block obtained last year.<\/span>","<span data-v-f87c67ca=\"\">Harper argues that he accurately and diligently reported his holdings from the year he first held bitcoin. Besides that, he says, he only dealt with crypto exchanges where he argues he had a “reasonable expectation of privacy,” and therefore the IRS shouldn’t have gotten access to his financial history without a court order.<\/span>","<span data-v-f87c67ca=\"\">It remains unclear exactly where the IRS obtained the information it used to build its list of warning letter recipients. When it sent the letters, the agency said the recipients were identified “through various ongoing IRS compliance efforts.” Harper alleges that these efforts entailed soliciting user information from crypto exchanges he used, and that this violated laws related to unlawful search and seizure and due process.<\/span>","<span data-v-f87c67ca=\"\">According to the lawsuit filing, Harper opened a Coinbase account in 2013, for bitcoin he received as payment for consulting work. He liquidated those holdings in 2015 and sent the remaining bitcoin from his Coinbase account to a hardware wallet. By 2016, he no longer held bitcoin on Coinbase, but&nbsp; he and his wife continued to use exchanges Abra and Uphold to liquidate bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2016, the IRS obtained a court order to compel Coinbase to produce customer information including transaction logs, taxpayer identification number, name and address among other data for accounts that exceeded $20,000 in any kind of transaction from 2013–2015. That added up to 14,355 account holders, according to Coinbase.<\/span>","<span data-v-f87c67ca=\"\">But the new lawsuit alleges that in addition to that, IRS agents “issued an informal demand for Mr. Harper’s financial records to Abra, Coinbase, and\/or Uphold, with which one more or more exchanges complied.” It notes that all three said in their privacy agreements that they wouldn’t give up personal data without a subpoena or warrant.<\/span>","<span data-v-f87c67ca=\"\">The Fourth Amendment protects a person’s property, including their “papers,” saying they can’t be searched or seized without probable cause. Harper’s argument alleges that in today’s world, one’s financial information is akin to their “papers,” and the IRS’s intention to remind crypto holders of their tax burdens was not enough to legally demand private information.<\/span>","<span data-v-f87c67ca=\"\">“The John Doe summons issued to Abra, Coinbase and\/or Uphold did not relate to a particular person or ascertainable group or class of persons as required by statute, but to all owners of virtual currencies based only on a gross judgment that some virtual currency holders may not comply with their tax obligations,” read the lawsuit.<\/span>","<span data-v-f87c67ca=\"\">Harper claims the IRS violated due process laws outlined in the Fifth Amendment since those whose information was at the center of the demands weren’t issued summons or otherwise notified that the IRS was attempting to seize their information, meaning they couldn’t fight to protect it. <\/span>"],"hashtag":["IRS"]}