{"summary":"September 2023 Marks Record-High Crypto Exploits with $329 Million Stolen: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/september-2023-marks-record-high-crypto-exploits-with-329-million-stolen-report.htm","publishDate":"2023-10-02T09:44:00","id":17324,"type":null,"title":"September 2023 Marks Record-High Crypto Exploits with $329 Million Stolen: Report","category":["Blockchain News "],"content":["On September 30, CertiK confirmed that a total of approximately $332 million had been lost to various exploits, hacks, and scams throughout September.","#CertiKStatsAlert 🚨\n\nCombining all the incidents in September we’ve confirmed ~$332M lost to exploits, hacks and scams.\n\nExit scams were ~$1.9M\n\nFlash loans were ~$0.4M\n\nExploits were ~$329.8M\n\nSee more details below 👇 pic.twitter.com\/DMFN9LWU8V","September 2023 has emerged as the most concerning month for crypto-related exploits, as reported by CertiK. In September, the crypto space witnessed various types of incidents. Exit scams accounted for around $1.9 million in losses, while flash loans led to losses of approximately $400,000. The most significant contributor to the month’s total, however, was exploits, which amounted to roughly $329.8 million in losses.","One notable event was the Mixin Network attack on September 23. The Hong Kong-based decentralized cross-chain transfer protocol suffered a substantial breach, resulting in a loss of $200 million due to a breach of its cloud service provider.","Another major incident occurred on September 12, when CoinEx, a cryptocurrency exchange, experienced a suspected attack following a substantial outflow from four of its hot wallets. This breach led to losses exceeding $53.1 million across the hot wallets.","Additionally, on September 4, stake.com experienced an attack resulting in a loss of $41 million. During this incident, different cryptocurrencies worth that amount were received by an account before being distributed to multiple addresses.","September also saw several other major incidents in the crypto space. A phishing incident resulted in a loss of $24.2 million, while HTX Global experienced a loss of $7.9 million. Additionally, entrepreneur Mark Cuban reported a personal loss of $900,000 during the month.","In August, losses amounted to $45 million in digital assets, bringing the year-to-date total to $997 million. Notably, July was the second-highest month for exploit losses, accounting for $285.8 million pilfered. This brings the total lost in 2023 to exploits, scams, and hacks to a staggering $1.34 billion.","The total losses from hacks, phishing scams, and rug pulls in Web3 reached $889.26 million in Q3 2023.\n\nLosses in Q3 even exceeded the combined sum of the first two quarters ($330 million in Q1 and $333 million in Q2).\n\nRead the full pdf version of Q3 2023 Global Web3 Security… https:\/\/t.co\/aoPWOrRBeZ pic.twitter.com\/5f3uYpG27e","Additionally, a report from BeosinAlert highlights that losses stemming from hacks, phishing scams, and rug pulls in the Web3 sector reached an alarming total of $889.26 million in Q3 2023. This quarterly figure surpasses the combined losses from the initial two quarters, amounting to $330 million in Q1 and $333 million in Q2.","Reports indicate that the Lazarus Group, a North Korean hacking collective, has been responsible for most of the recent crypto-related attacks in 2023, including the stake.com attack and the CoinEx exchange hack. Other attacks attributed to the group include the $620 million theft from Sky Mavis’ Ronin Bridge, a $100 million theft from Harmony’s Horizon Bridge, and a $100 million theft from Atomic Wallet.","According to the US government, approximately half of North Korea’s funding for its missile program comes from cybercrime and crypto theft. Efforts are ongoing to understand how a nation like North Korea is so adept at cybercrime and crypto-related activities.","Data from Dune Analytics suggests that the group currently holds approximately $45.6 million in crypto assets. Additionally, a report from institutional crypto platform provider 21.co reveals that wallets linked to the Lazarus Group contain around 1,600 Bitcoin, 10,810 Ether (ETH), and 64,490 Binance Coin (BNB), totaling $47 million in cryptocurrency. This data was compiled from a Dune Analytics dashboard tracking 295 wallets identified by the US government as belonging to the Lazarus Group.","Notably, the amount of crypto held by the group has decreased from the $86 million it held on September 6, shortly after the Stake.com hack in which Lazarus was implicated."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"Lazarus","content":"PERSON"},{"type":"$53.1 million","content":"MONEY"},{"type":"$45.6 million","content":"MONEY"},{"type":"$86 million","content":"MONEY"},{"type":"September 6","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"$0.4","content":"MONEY"},{"type":"September 4","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"$900,000","content":"MONEY"},{"type":"Sky Mavis’ Ronin Bridge","content":"ORGANIZATION"},{"type":"$285.8 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"$1.9","content":"MONEY"},{"type":"$1.34 billion","content":"MONEY"},{"type":"September 30","content":"DATE"},{"type":"September 23","content":"DATE"},{"type":"$24.2 million","content":"MONEY"},{"type":"$1.9 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"$7.9 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Mixin Network","content":"ORGANIZATION"},{"type":"$332 million","content":"MONEY"},{"type":"$45 million","content":"MONEY"},{"type":"September 12","content":"DATE"},{"type":"$333 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$332M","content":"MONEY"},{"type":"$329.8","content":"MONEY"},{"type":"$997 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"September 2023","content":"DATE"},{"type":"$329.8 million","content":"MONEY"},{"type":"$620 million","content":"MONEY"},{"type":"$330 million","content":"MONEY"},{"type":"$889.26 million","content":"MONEY"},{"type":"$47 million","content":"MONEY"}],"hashtag":["Hack"],"authors":["Hassan Shittu"]}