{"summary":"Crypto Whales Rally Behind Emerging Web3 Gambling Project with 1,000x Growth Potential","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-whales-rally-behind-emerging-web3-gambling-project-with-1000x-growth-potential.htm","publishDate":"2024-04-23T16:21:25","id":17326,"type":null,"title":"Crypto Whales Rally Behind Emerging Web3 Gambling Project with 1,000x Growth Potential","category":["Industry Talk "],"content":["The presale for Solana’s promising new GambleFi token, Mega Dice (DICE), kicked off last week, quickly garnering nearly $500,000 dollars, as reported on the token’s website.","The ICO began last Wednesday and raised a beefy $300,000 within 24 hours.","Indeed, early supporters were not hard to find.","With around 50,000 active players, Mega Dice is already a well-established name in GambleFi, the umbrella term (acronym: Gamble Finance) covering crypto’s panoply of gambling platforms.","Mega Dice launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram.","Since then, others have followed suit with the Web3\/Telegram integration, notably TG Casino.","The DICE token amps up Mega Dice’s services to a whole new level. Being the platform’s native token, players can use DICE to fund games and receive payment, with some games requiring the token.","The first thing anyone will notice about Mega Dice is its huge selection of games.","The website currently offers gamers over 4,500 ways to win money, including classic staples like slots, roulette and blackjack, in addition to a comprehensive bookmaker that live streams of the most popular games in over 50 sports and esports, with average collective monthly wagers at $50 million between some 10,000 monthly active users.","DICE has a hard supply cap of 420 million tokens, with 35% allocated to the presale, where the token sells at a current fixed price of $0.069 per coin.","This is the cheapest price investors can purchase it for before the presale price rises.","Once the token lists on exchanges, though, the sky’s the limit on potential appreciation.","Join the $DICE airdrop and earn your share of the $750,000 airdrop🏆🚀","To stand a chance, wager $5000 or more between 12.04.24 to 03.05.24 – with a maximum airdrop of $37 500 per player! 💸","The more you wager, the bigger your airdrop 🚀","How to qualify & FAQs 🤔👇 pic.twitter.com\/Qv8GaxuayC","— Mega Dice Casino (@megadice) April 22, 2024","","You don’t exclusively have to gamble with DICE, either. It can be staked to earn passive income, with 10% of the total supply earmarked by the casino for staking rewards.","In sum, early investors are snapping up DICE because it’s GambleFi’s latest premium offering, backed by a well-established brand with transparent tokenomics, strong fundamentals and utility beyond gaming.","It’s also going to get even better in the future.  The casino has outlined plans to integrate DICE into the casino’s loyalty program, offering more generous rewards to gamers who play with the native token. It will also unlock access to exclusive competitions and VIP experiences.","The casino has also announced a buyback and burn program, which will reduce the supply, increasing scarcity and potentially pumping value.","Finally, there will be a $2.25 million airdrop across three seasons of $750,000 each, including early bird bonuses, limited edition NFTs, and a referral program that gives people a 10% cut of the initial investment of any gamer they refer to the casino, according to a recent announcement by the Mega Dice team. ","FAQs:","– Total airdrop per player is 5% of each seasons airdrop pool. The total pool is $2.25M.\n– The $2.25M is split between 3 seasons – each season valued at $750,000.\n– The airdrop will be paid in $DICE – sent directly to your casino wallet.","— Mega Dice Casino (@megadice) April 22, 2024","","Given the multiple ways investors can put their DICE to work, it’s obvious why GambleFi investors are stacking Mega Dice.","Stay in touch with Mega Dice token ($DICE) news and developments on X\/Twitter and Telegram.","Don’t miss out.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"5%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"$37","content":"MONEY"},{"type":"$2.25 million","content":"MONEY"},{"type":"$500,000 dollars","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"$2.25","content":"MONEY"},{"type":"$DICE","content":"MONEY"},{"type":"VIP","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"April 22, 2024","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"TG Casino","content":"ORGANIZATION"},{"type":"$5000","content":"MONEY"},{"type":"$300,000","content":"MONEY"},{"type":"$0.069","content":"MONEY"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"$750,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["dice","Gamblefi","Mega Dice"],"authors":["Tim Hakki"]}