{"summary":"Digital Chamber Criticizes SEC Over Wells Notice Issue to Robinhood Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/digital-chamber-criticizes-sec-over-wells-notice-issue-to-robinhood-crypto.htm","publishDate":"2024-05-07T07:25:06","id":17328,"type":null,"title":"Digital Chamber Criticizes SEC Over Wells Notice Issue to Robinhood Crypto","category":["Blockchain News "],"content":["Crypto trade association Digital Chamber has slammed the US Securities and Exchange Commission (SEC) for issuing a Wells Notice to Robinhood Crypto, calling it an “alarming development.”","The Digital Chamber called this as yet another instance of the regulator’s “unchecked regulatory overreach,” similar to previous ones. The SEC has previously issued Wells Notice to major industry players like Uniswap and Consensys.","A Wells Notice informs recipient that the regulator has concluded investigation against them and plans to file an enforcement action.","The criticism comes after Robinhood’s response statement on Monday, expressing profound disappointment over receiving a Wells Notice, despite strong compliance.","“After years of good faith attempts to work with the SEC for regulatory clarity including our well-known attempt to ‘come in and register,’ we are disappointed that the agency has decided to issue a Wells Notice related to our U.S. crypto business,” Dan Gallagher, Chief Legal Officer at Robinhood stated.","“We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law.”","The Chamber agreed to Robinhood’s reply, adding that the SEC has chosen a path that significantly undermines innovation and investor protection in the crypto space.","“When Congress is actively deliberating legislation that would define regulatory jurisdictions for digital-assets, the SEC’s actions contradict the legislative process.”","It further said that SEC’s “aggressive stance” has bypassed its investor protection mandate. As a result, the Chamber has urged for immediate legislative action to address such judicial discrepancies and clarify regulatory framework.","Furthermore, the Chamber also stressed that SEC Chair Gary Gensler is responsible to explain the reason behind SEC’s continued attempts to stifle crypto industry.","Top legal experts in the crypto industry have raised concerns over the SEC’s several Wells Notices. For instance, Jake Chervinsky, Variant Fund’s Chief Legal Officer, took to X (Twitter), expressing his dismay over SEC’s enforcement intensions.","If the SEC brings as many enforcement actions as it has sent Wells notices, it will be in flagrant violation of both the law and its Congressional mandate.","If not, it's clearly abusing the Wells process to get free discovery and terrorize upstanding US companies.","Which is it?","— Jake Chervinsky (@jchervinsky) May 6, 2024","","“If the SEC brings as many enforcement actions as it has sent Wells notices, it will be in flagrant violation of both the law and its Congressional mandate,” he wrote. “If not, it’s clearly abusing the Wells process to get free discovery and terrorize upstanding US companies.”","Adam Cochran, who runs the niche venture fund Cinneamhain Ventures, noted that the Wells Notice targeting Robinhood is “yet another fumble in the ever-miscalculated steps of this SEC.”","2\/10","Issuing a Wells Notice to Robinhood about their crypto offerings, is yet another fumble in the ever miscalculated steps of this SEC.","Because once and for all, it should dispel the notion that \"crypto users just don't want to play ball\"","— Adam Cochran (adamscochran.eth) (@adamscochran) May 6, 2024","",""],"entity":[{"type":"Digital Chamber","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Adam Cochran","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Cinneamhain Ventures","content":"ORGANIZATION"},{"type":"May 6, 2024","content":"DATE"},{"type":"Wells Notices","content":"ORGANIZATION"},{"type":"Dan Gallagher","content":"PERSON"}],"hashtag":["Digital Chamber","Robinhood","SEC"],"authors":["Sujha Sundararajan"]}