{"summary":"Sens. Cynthia Lummis, R-Wyo., and Kirsten Gillibrand, D-N.Y., will introduce a revised version of their comprehensive crypto regulatory bill.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239210\/lummis-gillibrand-to-introduce-revised-comprehensive-crypto-bill","publishDate":"2023-07-12T11:59:50","id":1732,"type":null,"title":"Lummis, Gillibrand to introduce revised comprehensive crypto bill","category":["Policy"],"content":["Sens. Cynthia Lummis, R-Wyo., and Kirsten Gillibrand, D-N.Y., will introduce a revised version of their comprehensive crypto regulatory bill Wednesday.","According to information provided by Lummis's office, the revised bill maintains much of the broad scope of the crypto legislation they introduced last Congress but is updated to reflect major developments in the industry like the collapse of FTX. House Republicans also have <a href=\"https:\/\/www.theblock.co\/post\/227474\/crypto-markets-bill-congress\" data-v-f87c67ca=\"\">their own legislation<\/a> that would establish a clearly defined path for a digital asset to transition from being treated as a security to a commodity, along with creating a comprehensive regulatory framework for the trading of digital assets in the U.S. and issuance of stablecoins.&nbsp;","The revised version of the bill would expand the Commodity Futures Trading Commission’s power over spot markets and centralized digital asset exchanges, and would give “crypto asset companies” the power to define assets they create on their own terms.","Digital assets issued by those companies, even if the network is not decentralized, could be “presumed a commodity” if they do not involve debt, equity, or other financial interests in a company. That would place the asset under the jurisdiction of commodities law, though companies would be required to provide disclosures about the asset twice a year to the Securities and Exchange Commission.","Sweeping in scope, the bill involves policy areas across the jurisdictions of several Senate committees. That's likely to complicate a path for the bill to become law, especially as the Biden administration and crypto skeptics in Congress may view it as too friendly for the industry.","The bill would also redefine custody rules for digital assets that qualify as securities. A “commercially reasonable” level of cybersecurity for a private key could satisfy part of the existing rule around custody.","Lummis and Gillibrand also want to require stablecoin issuers to register federally or at the state level as depository institutions, with mandatory federal supervision for state-chartered issuers. They would be required to maintain high-quality liquid assets – cash or short-term Treasury bonds – and provide proof-of-reserves. The bill would ban the use of the term “stablecoin” by algorithmic stablecoins that are unbacked by reserves without banning the assets themselves.","If passed into law, the bill would also appropriate an additional $500 million each to the CFTC and SEC, but the SEC would be prohibited from using those additional funds for enforcement, and the CFTC could only access theirs if the agency charters a crypto-specific self-regulatory organization. The Federal Trade Commission, which holds authority over false advertising, would also be appropriated $150 million over five years for consumer education and enforcement relating to digital assets.","The New York Democrat and Wyoming Republican also want to revise tax treatment of digital assets, including refining the definition of broker included in the 2021 infrastructure law that led to concerns about crypto developers and other network participants being treated as financial intermediaries for tax purposes. &nbsp;","An official announcement of the revised bill introduction is expected to come later on Wednesday."],"hashtag":["CONGRESS","CYNTHIA LUMMIS","FTX","PATRICK MCHENRY","SAM BANKMAN-FRIED"]}