{"summary":"Chainlink Says Cross-Chain Interoperability Protocol Available to All Developers Now","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chainlink-says-cross-chain-interoperability-protocol-available-to-all-developers-now.htm","publishDate":"2024-04-24T06:00:53","id":17321,"type":null,"title":"Chainlink Says Cross-Chain Interoperability Protocol Available to All Developers Now","category":["News "],"content":["Chainlink, a leading provider of data feeds to blockchain-based smart contracts, said its Cross-Chain Interoperability Protocol (CCIP) – the standard for cross-chain interoperability, is now allowing developers to permissionlessly use CCIP to transfer onboarded tokens cross-chain.","In an announcement, Chainlins said CCIP can be used by developers to securely transfer onboarded tokens cross-chain, send arbitrary messages to smart contracts on another blockchain, or simultaneously send data.","The protocol supports blockchains including Arbitrum, Avalanche, Base, BNB Chain, Ethereum, Kroma, Optimism, Polygon, and WEMIX, with more to come in the future.","“CCIP is now starting to become the standard for both capital markets blockchain transactions across banks, as well as the way that secure Web3 cross-chain value and data is moved across public chains,” said Sergey Nazarov, co-founder of Chainlink, in a press release. ","“The mainnet general availability of CCIP is something that makes it even easier for developers to quickly adopt CCIP as a secure mechanism for cross-chain connectivity,” adds Nazarov. ","Earlier this month Chainlink released a new application dubbed the transporter for submitting and monitoring cross-chain transactions. The firm went on to describe the new Transporter application as a “hyper-secure bridging Aapp” — explaining it is built on Chainlink CCIP to bring “unprecedented security” to users wanting to transfer tokens across blockchains.","Transporter allows users to track their assets and messages at every step of the transaction, both on the Transporter app and through the Chainlink CCIP Explorer.","The new application doesn’t charge additional fees, just the regular fees for using CCIP, which cover the gas costs of completing transactions on the destination chain and the fees paid to CCIP service providers.","Chainlink said CCIP entering General Availability has been made possible by the introduction of several new in-demand features, including Transporter.  As well as the addition of token transfer support for USDC.","The firm said CCIP has achieved 900%+ growth in the number of cross-chain transactions and a 4,000%+ growth in cross-chain transfer volume processed by CCIP during Early Access in the first quarter of 2024 compared to the fourth quarter of 2023. This has included multiple transactions of nearly $1 million USDC, showcasing CCIP’s ability to secure large amounts of value over an extended period. "],"entity":[{"type":"4,000%","content":"PERCENT"},{"type":"first quarter of 2024","content":"DATE"},{"type":"CCIP","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Chainlins","content":"PERSON"},{"type":"Nazarov","content":"ORGANIZATION"},{"type":"General Availability","content":"ORGANIZATION"},{"type":"900%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"Kroma","content":"LOCATION"},{"type":"Sergey Nazarov","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ChainLink","Cross-Chain Interoperability Protocol","developers"],"authors":["Tanzeel Akhtar"]}