{"summary":"Bitcoin Dips 3% in Minutes as DTCC Removes BlackRock’s iShares Bitcoin Trust Ticker From List – Are Spot BTC ETF Approvals At Risk?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-dips-3-minutes-as-dtcc-removes-blackrocks-ishares-bitcoin-trust-ticker-from-list-are-spot-btc-etf-approvals-at-risk.htm","publishDate":"2023-10-24T15:53:00","id":17325,"type":null,"title":"Bitcoin Dips 3% in Minutes as DTCC Removes BlackRock’s iShares Bitcoin Trust Ticker From List – Are Spot BTC ETF Approvals At Risk?","category":["Bitcoin News "],"content":["The Bitcoin (BTC) price is selling off as FUD (fear, uncertainty and doubt) spreads around the market that spot Bitcoin Exchange Traded Fund (ETF) approvals might not be as close as previously though.","BTC dipped 3% from around $34,500 to around $33,500 in minutes following the removal of BlackRock’s iShares Bitcoin Trust ticker $IBTC from the US Depository Trust & Clearing Corp.’s (DTCC) list on its website, which was first flagged on X by Barron’s journalist Joe Light.","Bloomberg’s senior ETF analyst Eric Balchunas responded that he wasn’t “totally shocked”, adding that his guess is “they were told to or want to wait until they are days not weeks or months away (from spot Bitcoin ETF approval)”.","The removal of BlackRock’s spot Bitcoin ETF ticker from the DTCC’s website list will come as a disappointment to some Bitcoin bulls who might have been expecting approval within days, as it implies approval is still some time off.","That probably explains the sell pressure in the Bitcoin market.","The DTCC’s decision to remove the ticker from its list is just a technicality and likely has no bearing on the likelihood of when a spot Bitcoin ETF will be approved.","Markets participants are likely to remain confident that approvals are near given 1) the SEC’s recent decision to back down in its lawsuit versus Grayscale over its decision not to approve the digital asset managers spot Bitcoin ETF application and 2) recent tweaks made by major Wall Street institutions to their own spot Bitcoin ETF applications, which suggests the SEC is working constructively with these firms regarding their approvals.","A growing throng of analysts have been calling for a batch of spot Bitcoin ETFs to secure approval within a few months, with JP Morgan recently saying they expect approval before January 10th.","Matrixport is still predicting that the Bitcoin price goes into the $40,000s.","As such, dips such as the current one being observed in the Bitcoin market are likely to be looked upon as buying opportunities, with the near-term bullish trend likely to continue."],"entity":[{"type":"Barron’s journalist Joe Light","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"$33,500","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"US Depository Trust & Clearing Corp.","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"$IBTC","content":"MONEY"},{"type":"$34,500","content":"MONEY"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"January 10th","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","Blackrock","btc"],"authors":["Joel Frank"]}