{"summary":"Hong Kong Central Bank Launches Wholesale CBDC Project to Foster Tokenization","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-central-bank-launches-wholesale-cbdc-project-to-foster-tokenization.htm","publishDate":"2024-03-07T13:21:03","id":17336,"type":null,"title":"Hong Kong Central Bank Launches Wholesale CBDC Project to Foster Tokenization","category":["Altcoin News "],"content":["Hong Kong’s central bank has announced the launch of a new project called “Project Ensemble,” aimed at supporting the development of the tokenization market in the city-state through a wholesale central bank digital currency (wCBDC). ","In a Thursday press release, the Hong Kong Monetary Authority (HKMA) said the project aims to explore financial market infrastructure that facilitates seamless interbank settlement of tokenized money using wCBDC.","Initially, Project Ensemble will focus on tokenized deposits, which are digital representations of commercial bank deposits issued by commercial banks and available to the general public. ","By using wCBDC as the foundation, these tokenized deposits can be utilized for transactions involving tokenized assets, thereby unlocking new opportunities for optimization and innovation in the tokenization era, according to the HKMA.","Eddie Yue Wai-man, the Chief Executive of the HKMA, said the Wholesale CBDC project will provide a boost to Hong Kong’s vibrant financial industry and reinforce the city’s leading position in tokenized money and assets. ","Yue Wai-man emphasized Hong Kong’s commitment to innovation and international collaboration, inviting global talents and industry players to participate in this exciting tokenization journey.","“Project Ensemble will provide fresh impetus to our vibrant financial industry and reinforce our forefront position in tokenized money and assets.”","As part of the project, the HKMA plans to launch a wCBDC Sandbox later this year to facilitate research and testing of tokenization use cases. ","This includes exploring the settlement of tokenized real-world assets such as green bonds, carbon credits, aircraft, electric vehicle charging stations, electronic bills of lading, and treasury management. ","The goal is to bridge the gap between tokenized real-world assets and money in transactions, potentially forging a new financial market infrastructure.","To ensure industry standards and a future-proof strategy, the HKMA will establish a wCBDC architecture community consisting of local and multinational banks, digital asset industry key players, technology companies, and the CBDC Expert Group. ","Additionally, the HKMA will continue its partnership with Cyberport and the Hong Kong Science and Technology Parks Corporation to support the development of asset tokenization and foster homegrown fintech innovation.","The deadline for virtual asset trading platform (VATP) crypto license applications in Hong Kong has passed, with the number of applicants reaching 24.","At least five cryptocurrency firms submitted their applications in the final days leading up to the February 29 deadline.","Cryptocurrency exchanges that have not yet applied must exit the Hong Kong market by May 31.","The Securities and Futures Commission (SFC) will announce approved and declined applications on a public register by June 1, 2024.","After securing approval, virtual asset trading platforms can onboard new retail and institutional crypto investors and start marketing in Hong Kong.","In comparison, when Singapore’s Monetary Authority gave crypto companies one month to notify their pre-existing status and intention to be licensed in 2021, it resulted in about 70 official license applications by the end of 2021, three times the number in Hong Kong."],"entity":[{"type":"Hong Kong Science and Technology Parks Corporation","content":"ORGANIZATION"},{"type":"Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Eddie Yue Wai","content":"PERSON"},{"type":"June 1, 2024","content":"DATE"},{"type":"February 29","content":"DATE"},{"type":"Project Ensemble","content":"ORGANIZATION"},{"type":"Singapore’s Monetary Authority","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"May 31","content":"DATE"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"CBDC Expert Group","content":"ORGANIZATION"}],"hashtag":["CBDC","Hong Kong","Hong Kong crypto"],"authors":["Ruholamin Haqshanas"]}