{"summary":"Binance issued a statement in response to the SEC’s lawsuit filed Monday.\n“While we take the SEC’s allegations seriously, they should not be the subject of an SEC enforcement action, let alone on an emergency basis,” Binance said. “We intend to defend our platform vigorously.”","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233186\/binance-says-it-will-defend-our-platform-vigorously-from-sec-lawsuit","publishDate":"2023-06-05T12:39:24","id":1733,"type":null,"title":"Binance says it will &#x27;defend our platform vigorously&#x27; from SEC lawsuit","category":["Companies"],"content":["Binance will defend itself \"vigorously\" against the SEC claims contained in a lawsuit filed Monday.","The American regulator <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">accused<\/a> Binance and its CEO, Changpeng Zhao, of violating U.S. securities laws and orchestrating an \"extensive web of deception\" to mask its activities in the country.&nbsp;","In the statement, Binance argued that it sought to cooperate with the SEC and pursue a settlement over the agency's previously reported investigations into the crypto exchange.&nbsp;","\"Most recently, we have engaged in extensive good-faith discussions to reach a negotiated settlement to resolve their investigations,\" Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/sec-complaint-aims-to-unilaterally-define-crypto-market-structure-8707489117122437402\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a>. \"But despite our efforts, with its complaint today the SEC abandoned that process and instead chose to act unilaterally and litigate. We are disheartened by that choice.\"","Binance's statement echoed a refrain common among critics of the SEC and its chair, Gary Gensler. The exchange alleged that \"the Commission has determined to regulate with the blunt weapons of enforcement and litigation rather than the thoughtful, nuanced approach demanded by this dynamic and complex technology.\"","The exchange also pushed back against the complaint's contention that Binance's practices put customer funds at risk. \"This case arises from Defendants’ blatant disregard of the federal securities laws and the investor and market protections these laws provide. In so doing, Defendants have enriched themselves by billions of U.S. dollars while placing investors’ assets at significant risk,\" the SEC complaint said.","\"All user assets on Binance and Binance affiliate platforms, including Binance.US, are safe and secure, and we will vigorously defend against any allegations to the contrary,\" Binance said in its statement.&nbsp;","Notably, Binance claimed that because it is not based in the U.S., \"the SEC’s actions are limited in reach.\"&nbsp;"],"hashtag":["BINANCE"]}