{"summary":"Yes, Huawei Is Getting into Mining – But Not Bitcoin Mining","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/yes-huawei-is-getting-into-mining-but-not-bitcoin-mining-9168.htm","publishDate":"2021-02-09T08:50:18","id":17348,"type":null,"title":"Yes, Huawei Is Getting into Mining – But Not Bitcoin Mining","category":["Bitcoin News "],"content":["With the number of companies getting into bitcoin (BTC) and altcoins on the rise everywhere in the world, some say that it is now only a matter of time before Asia’s tech giants turn their attention to tokens.","But it appears that a few folks have jumped the gun with reports that Chinese mobile and electronics giant Huawei is set to begin BTC mining. The truth, some crypto advocates will be dismayed to learn, is that the Chinese conglomerate is actually getting into a more mundane form of mining altogether – the kind involving digging stuff out of the ground.","In an official release, Huawei wrote that its much-vaunted 5G “empowers mining production.” And while to the average bitcoiner, this may sound like a story going in just one exciting direction, the story beneath that rather eye-catching headline is about molybdenum – and using 5G-powered, remote-controlled excavators to extract it from the ground.","It may sound like a sexy new altcoin, but molybdenum is actually a rather unsexy metal used to make steel alloys and sometimes dietary supplements.","Perhaps the problem was in the wording of an initial report from Reuters – picked up by newspapers around the world, including US News – which carried quotes from Huawei’s CEO speaking to reporters “on the sidelines of a 5G mining project Huawei was launching in the northern Chinese city of Taiyuan.” The report did not go into any details about this project, so some decided to connect the dots…","And this sentence, it seems, was apparently enough to get some crypto industry players with thousand of followers on Twitter talking about Huawei “mining bitcoin.”","BTC advocates, some with relatively large followings, and high-profile individuals like Swan Bitcoin founder Cory Klippsten, shared the “news.” Others still began speculating about how 5G innovation might help crypto users mine tokens on next-gen mobile devices.","___","But while BTC mining remains so lucrative in China that citizens in the nation have reportedly started mining it on laptops – causing shortfalls for much of the rest of the world – Huawei does not seem to be ready to take the crypto mining plunge just yet.","That said, Huawei and digital currencies are not total strangers. Reports both from within and outside China have linked the company with work on the Chinese central bank digital currency (CBDC), the digital yuan. The firm has already unveiled digital RMB-compatible mobile devices.","And the company is active in the world of blockchain: It is set to unveil a series of blockchain offerings this year and last year agreed to work with Beijing on a blockchain-powered governance platform.","But there is one final and (somewhat dark) crypto twist in this tale. Bitcoin-related events elsewhere in the world, namely those sparked by Elon Musk and Tesla, could indeed produce a spike in mining in China: just not one related to Huawei.","Bloomberg reported that the BTC price rise will provide a boon for miners (yes, actual bitcoin miners this time). And that will likely spur them on to intensify their efforts yet further in the troubled Xinjiang Uyghur Autonomous Region, making use of old-fashioned coal power stations.","At the time of writing (08:46 UTC), BTC trades at USD 46,869, correcting lower from its new all-time high of USD 48,025, reached today. The price is up by 20% in a day and 40% in a week.","___\nLearn more:\nUkraine Wants to Bolster its Budget with Nuclear-powered Crypto Mining\nAssociated Gas Pilot Could Lead to Huge Boon for Russian Bitcoin Miners\nBitcoin Mining in 2021: Growth, Consolidation, Renewables, and Regulation"],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"Cory Klippsten","content":"PERSON"},{"type":"Crypto Mining\nAssociated","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Huawei","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Russian Bitcoin Miners\nBitcoin Mining","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Xinjiang Uyghur Autonomous Region","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Taiyuan","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Bitcoin","Mining"],"authors":["Tim Alper"]}