{"summary":"Solana Sloth Meme Project Slothana Raises $15 Million – 48 Hour Presale Countdown Begins","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-sloth-meme-project-slothana-raises-15-million-48-hour-presale-countdown-begins.htm","publishDate":"2024-04-26T14:56:11","id":17341,"type":null,"title":"Solana Sloth Meme Project Slothana Raises $15 Million – 48 Hour Presale Countdown Begins","category":["Press Releases "],"content":["Thursday, April 25, 2024 – Just under three days remain for investors to buy into Solana’s sensational new 420-themed meme coin project Slothana ($SLOTH). ","The token has raised an eye-popping $15 million dollars in a month-long presale that’s due to end on April 29, according to a timer on the website. ","At the beginning of last week, Slothana had raised over $10 million. By the start of this week, a further $5 million dollars flooded into the project. ","The recent gains appear to have been spurred on by Saturday, April 20, a milestone day for the project because it was both Bitcoin’s fourth quadrennial halving and international stoner day. ","At the ICO’s conclusion next Monday, there will be an airdrop date announcement that could catalyze some potentially explosive buying in the coming weeks. Beyond that, the team will be eyeing up exchange listings. ","So, just how does Slothana differ from its Pepe and Doge-themed predecessors? Well, for a start, this is the first time stoner culture has been properly represented in crypto. ","To date, various crypto communities have flirted with 4\/20. The self-styled “Doge Army” that rallies around Dogecoin has appropriated with stoner culture before.","It selected April 20 to mark International Doge Day because of its irreverent connotations and instantly memorable appeal. ","Slothana doesn’t beat about the herb – sorry, bush. Coming hot on the heels of the popular Slerf token, Slothana is a sloth chained to a desk. With his hazed red eyes, he’s clockwatching because he knows at 4:20, he’ll get the break he needs.","It may even be quite a big break, with multiple price-driving industry developments inbound this year. ","🎬🌵 Are you feeling lucky, sloths? 🎰 With just 3 days left in the presale, it's time to saddle up and make your move. Are you gonna sit there, or are you gonna join the ride to the moon with Slothana? The choice is yours. Make it count. 🔥🦥 #Slothana #memecoins pic.twitter.com\/lnyqisy2EB","— Slothana (@SlothanaCoin) April 25, 2024","","Last Saturday, a Bitcoin software update called “the halving” slashed mining rewards from 6.25 BTC per block to 3.125. This means miners now need to mine twice as hard as they did before Saturday to get the same rewards.","Since miners control the issuance of new BTC, this has now halved the rate at which new Bitcoin is sold onto the open market. Logically, the depleted supply during Bitcoin’s most popular year yet will serve as a catalyst for mid-term appreciation. ","That’s why all three of the previous halvings have resulted in significant rallies well within a year of the update. ","And where Bitcoin goes, the rest of the market follows. Virtually every leading cryptocurrency tracked the price movements of Bitcoin, with late February\/early March accounting for some of the steepest gains so far this year across many projects. ","In addition to that, Bitcoin is becoming a popular investment product in the US, a strong sign that the same auspicious fate may befall Ethereum and its closest contender, Solana, Slothana’s native blockchain.","Back in January, the US Securities and Exchange Commission approved the launch of 11 Bitcoin ETFs, essentially investment products that enable investors to buy and hold Bitcoin through a regulated vehicle with all the safeguards that entails.","The news helped Bitcoin reach a new all-time high of $73,737.94 about a month ago. ","The SEC has until May 23 to return a verdict on the latest round of applications for Ethereum ETFs. ","Should the agency greenlight the products – and there’s very little reason not to, now that Bitcoin ETFs are trading – that could foment some explosive rallies across not only Ethereum, but also competitor Layer 1 blockchains deploying high-functionality smart contracts, like Solana. ","🚀🌕 Prepare for a moonshot as we ready the engines of the Slothship! 🌿🦥 With the launch just around the corner, our slothful crew is gearing up for an epic journey through the crypto cosmos. Buckle up and hold onto your branches, because there's just 6 days to go 🌌🌟… pic.twitter.com\/yHBrE3NP5x","— Slothana (@SlothanaCoin) April 22, 2024","","In addition to that, there is a growing gold rush around Slothana’s native network, Solana, as its ecosystem continues to expand. ","In recent months, Solana meme coins like Slerf, DogWifHat and Bonk have on good days far outpaced the gains posted by their Ethereum-based rivals Floki, Pepe and Shiba Inu.","These successes have spurred investors to look into Slothana’s own $15 million presale as a prime contender for the network’s next viral meme coin.","","This month, Solana developers deployed a mainnet beta update aimed at addressing the network’s congestion problems. This means Solana is the healthiest it has ever been, and its entire ecosystem is ready for a heady ascent this year. ","There are now less than three days left to join the $SLOTH presale. To do so, investors need a funded SOL wallet to use the contribution widget on the Slothana website.","At its current price, 1 SOL token buys 10,000 $SLOTH. It is a steal for any investor who sees the upside potential in blockchain’s highest sloth. ","Buy Slothana here",""],"entity":[{"type":"$73,737.94","content":"MONEY"},{"type":"$SLOTH","content":"MONEY"},{"type":"4:20","content":"TIME"},{"type":"April 25, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Saturday, April 20","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"$5 million dollars","content":"MONEY"},{"type":"April 29","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"April 22, 2024","content":"DATE"},{"type":"Pepe","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"May 23","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Doge Army","content":"ORGANIZATION"},{"type":"Dogecoin","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Slothana","content":"LOCATION"},{"type":"Slothana","content":"PERSON"},{"type":"Bonk","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$15 million dollars","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"International Doge Day","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Presale","sloth","slothana"],"authors":["Tim Hakki"]}