{"summary":"Coinbase has begun issuing transparency reports that detail information requests from law enforcement agencies.\nIn the first half of 2020, the exchange received a total of 1,914 such requests.\nU.S. agencies alone sent 1,113 requests out of the total.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81458\/coinbase-transparency-report-2020","publishDate":"2020-10-16T12:00:17","id":1734,"type":null,"title":"Coinbase has published its first-ever transparency report","category":["Exchanges"],"content":["Crypto exchange Coinbase has published its first-ever \"transparency report\" quantifying the information requests it receives from global law enforcement agencies. The report comes a month after the exchange was called out by a digital rights organization for failing to publish this information.","The report, <a href=\"https:\/\/medium.com\/@coinbaseblog\/c8edf6dce4d6\" data-v-f87c67ca=\"\">published<\/a> Friday, revealed that Coinbase received a total of 1,914 such requests in the first half of 2020. About 90%&nbsp; came from three jurisdictions: the U.S., the U.K., and Germany.&nbsp;","U.S. agencies alone sent 1,113 requests, representing around 60%. The Federal Bureau of Investigation (FBI) was the most active U.S. law enforcement agency, sending 340 requests. Homeland Security Investigations (HSI), local state agencies, and the Drug Enforcement Administration (DEA) followed with 184, 180, and 104 requests, respectively.&nbsp;","","","","","Coinbase, in its new report, said it regularly receives requests from law enforcement, mainly in the form of subpoenas. Sometimes, the requests involve search warrants, court orders, and other formal processes.","\"When these requests are valid under financial regulations and other applicable laws, Coinbase has an obligation to respond,\" said the exchange. \"Yet we do not hesitate to push back where appropriate, even when it is inconvenient or costly to do so.\"&nbsp;","","","Coinbase said its plans to release transparency reports on a regular basis, but did not say exactly how frequently that would be."],"hashtag":["COINBASE"]}