{"summary":"Fantom Plans Multichain Liquidation to Help Recover Millions Lost in Exploit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fantom-plans-multichain-liquidation-to-help-recover-lost-funds.htm","publishDate":"2024-03-05T08:53:15","id":17354,"type":null,"title":"Fantom Plans Multichain Liquidation to Help Recover Millions Lost in Exploit","category":["Altcoin News "],"content":["Fantom Foundation, the team that builds Fantom Network, has received a favorable judgement from the High Court of Singapore in its legal action against the cross-chain protocol Multichain.","The Foundation fell victim to Multichain exploit in July 2023, leading to a significant loss of over $210 million in assets.","Following the exploit, it filed a lawsuit against Multichain Foundation for “breach of contract and fraudulent misrepresentations” for Fantom’s losses.","“Since the July 2023 Multichain exploit, Fantom Foundation’s management and legal team have been working tirelessly across multiple jurisdictions to chart a path forward that enables victims to partially recover assets lost,” the company wrote in a post on X (formerly Twitter).","Since the July 2023 Multichain exploit, Fantom Foundation’s management and legal team have been working tirelessly across multiple jurisdictions to chart a path forward that enables victims to partially recover assets lost. We have an important update in this regard.","After all… pic.twitter.com\/pUxyalPdMD","— Fantom Foundation (@FantomFDN) March 4, 2024","","Per Fantom’s claims, it made several attempts to engage with the former directors and key personnel of the Multichain Foundation. However, the attempts failed, leading the firm to file an action against the Multichain in Singapore, where Multichain is incorporated.","The lack of cooperation by the Multichain team created “complexity to addressing the exploit,” it said in a blog, Monday.","“We are pleased to announce that on January 30, 2024, the Honorable Registrar Tan Boon Heng of the General Division of the High Court of Singapore granted a default judgment ruling in Fantom’s favor.”","Fantom filed a petition at the Singapore court to appoint a Multichain liquidator to possibly recover the lost funds.","“A court-appointed liquidator will have the expertise required to aid in the tracing and recovery of assets; unique legal powers.”","A liquidator will also act in the interests of all creditors, it added. Furthermore, Fantom plans to use its legal victory against Multichain to “have suitably qualified experts recover and distribute assets.”","The foundation also suffered a significant loss of approximately $6.7 million worth of digital assets in another hack in October. Per blockchain security firm Certik’s estimates, attackers siphoned off nearly $657,000 worth of crypto assets in the Fantom Foundation incident."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"January 30, 2024","content":"DATE"},{"type":"March 4, 2024","content":"DATE"},{"type":"Multichain Foundation","content":"ORGANIZATION"},{"type":"$6.7 million","content":"MONEY"},{"type":"Fantom Network","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"High Court","content":"ORGANIZATION"},{"type":"$210 million","content":"MONEY"},{"type":"Fantom","content":"LOCATION"},{"type":"Fantom","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Honorable Registrar Tan Boon Heng","content":"PERSON"},{"type":"General Division of the High Court","content":"ORGANIZATION"},{"type":"$657,000","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"July 2023","content":"DATE"}],"hashtag":["Crypto hack","Fantom"],"authors":["Sujha Sundararajan"]}