{"summary":"Gauntlet Ends Risk Management Role with Aave Citing ‘Inconsistent Guidelines’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gauntlet-ends-risk-management-role-with-aave-citing-inconsistent-guidelines.htm","publishDate":"2024-02-22T07:55:48","id":17355,"type":null,"title":"Gauntlet Ends Risk Management Role with Aave Citing ‘Inconsistent Guidelines’","category":["Altcoin News "],"content":["The independent risk manager Gauntlet has terminated its services for Aave.","In a post on the Aave forum, John Morrow, co-founder of Gauntlet, pointed to the challenges of working with the decentralized autonomous organization‘s unclear instructions and goals as the reason for this decision.","“It is because of all this that it pains us to say that Gauntlet is no longer able to continue our work with Aave,” said Morrow. “We will be terminating our payment stream as soon as possible and working with other contributors to find a replacement for the Risk Steward.”","Morrow detailed the firm’s experiences with Aave’s governance model, highlighting the difficulties Gauntlet faced in navigating the DAO’s inconsistent guidelines and unwritten objectives.","“A lot has changed during the four years we’ve worked with Aave,” said Morrow. “It’s been truly amazing to watch one of our customers grow from an upstart to a juggernaut.”","“However, in the past year, we’ve found it difficult to navigate the inconsistent guidelines and unwritten objectives of the largest stakeholders,” said Morrow.","In addition, Morrow elaborated on some of the challenges and disagreements the team faced during the collaboration with the community, including duplicate proposals and allegedly unreasonable criticisms.","Aave’s former CTO Ernesto Boado replied to the post and shared his perspective, saying, “As an Aave community member and professional collaborator with Gauntlet via BGD (service provider as Gauntlet), I don’t particularly understand the rationale of this unilateral decision.”","“Yes, sometimes criticism is harsher than it should on DAOs, but generally the broad community has always shown appreciation for Gauntlet’s work,” said Boado.","Marc Zeller, the founder of Aave-Chan Initiative, harshly rebutted Morrow’s statement. According to Zeller, the claimed unfair treatment was only “a poor excuse to justify Gauntlet looking into external business opportunities.”","Zeller also made it clear that the community has begun to recruit other service providers to fill the vacancy.","“At the ACI, we are considering a very prestigious slot with a current budget of 1.6m\/year just opened, and we’re looking forward to the candidates’ risk teams’ proposals,” said Zeller."],"entity":[{"type":"Gauntlet","content":"PERSON"},{"type":"John Morrow","content":"PERSON"},{"type":"Gauntlet","content":"LOCATION"},{"type":"ACI","content":"ORGANIZATION"},{"type":"Morrow","content":"PERSON"},{"type":"Zeller","content":"PERSON"},{"type":"CTO Ernesto Boado","content":"ORGANIZATION"},{"type":"Boado","content":"PERSON"},{"type":"Marc Zeller","content":"PERSON"}],"hashtag":["Aave","DAO"],"authors":["Hongji Feng"]}