{"summary":"Bank of England and UK’s FCA Propose Plans to Regulate Stablecoins","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bank-of-england-and-uks-fca-propose-plans-to-regulate-stablecoins.htm","publishDate":"2023-11-06T17:01:05","id":17375,"type":null,"title":"Bank of England and UK’s FCA Propose Plans to Regulate Stablecoins","category":["Altcoin News "],"content":["The UK’s central bank and the financial regulator have both proposed plans to regulate stablecoins in discussion papers, published Monday.","The Bank of England (BoE) revealed that the regulatory measures focus on sterling-denominated stablecoins. This is because they have the potential for everyday payments.","“It is important for policymakers to set out the regulatory requirements so innovators can plan ahead and so that innovation can be adopted safely,” the bank said.","The discussion paper would potentially receive feedback from the industry on the initial proposals. The Bank would then consult on its final proposed regime, which could be adopted over time as the industry evolves.","The central bank would also regulate other entities providing services to these payment systems such as stablecoin issuers. If not regulated, these nascent payment systems could pose risks to financial stability in the UK, the bank added.","However, stablecoins can “enhance digital retail payments in the UK,” says Sarah Breeden, deputy governor for financial stability, BoE.","“Our proposals aim to support safe innovation so that firms can understand the risks they need to manage and ensure that the public can be confident in all forms of digital money and payments.”","The consultation paper is open for feedback from the public and industry until 6 February 2024.","The Financial Conduct Authority’s (FCA) discussion paper explores the proposed regulation around issuing and holding stablecoins.","FCA sees stablecoins as a means of faster and cheaper payments. “That’s why we want to offer firms the ability to utilize this innovation safely and securely,” said Sheldon Mills, executive director at FCA.","“Getting views from others is essential for creating proportionate rules that benefit consumers and firms and also meet our objectives.”","Further, the Prudential Regulatory Authority (PRA) also published a “Dear CEO” letter, on innovative uses of deposits, e-money and stablecoins. The letter explores how it expects deposit-takers to address the risks that arise from issuing multiple forms of digital money."],"entity":[{"type":"Monday","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Sarah Breeden","content":"PERSON"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Prudential Regulatory Authority (PRA","content":"ORGANIZATION"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Bank of England (BoE","content":"ORGANIZATION"}],"hashtag":["Stablecoin"],"authors":["Sujha Sundararajan"]}