{"summary":"Solana’s Greatest Multichain Meme Coin Dogeverse Bags $13 Million In Ongoing Presale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solanas-greatest-multichain-meme-coin-dogeverse-bags-13-million-in-ongoing-presale.htm","publishDate":"2024-05-01T14:47:05","id":17370,"type":null,"title":"Solana’s Greatest Multichain Meme Coin Dogeverse Bags $13 Million In Ongoing Presale","category":["Press Releases "],"content":["Wednesday, May 01, 2024 – An ongoing presale for Solana’s greatest multichain good boy Dogeverse ($DOGEVERSE) has taken in $13 million so far, with at least $2 million flooding into the ICO in the five days since it deployed on Solana. ","Crypto’s latest Shiba Inu-inspired funny token has pricked the ears of meme fans, degens and crypto evangelists alike, who see Dogeverse’s hyper-jumping cross-chain capabilities as a hint of tomorrow’s meme coin capabilities.","Now SOL fans are in on the action too. As of Friday, April 26, Dogeverse has rolled out on its sixth native chain, Solana, joining a digital economy that is home to $3.465 billion in total value locked (TVL), with 1.13 million active users transacting daily and over 2,500 monthly active developers. ","Since Dogeverse exists on multiple chains, anyone with Ethereum ($ETH), BNB Smart Chain ($BNB), Polygon ($MATIC), Avalanche ($AVAX), Base ($BASE) and now Solana ($SOL) to spare can purchase it. ","To purchase with SOL, simply head to the website and select “Buy With SOL” from the drop-down menu of the buy widget. Doing so will transport users to a Solana-based version of the site hosted on solana.thedogeverse.com. ","The option to pay with Solana is hosted on a subdomain, due to wallet connect functions not being able to support Ethereum Virtual Machine (EVM) and Solana-integrated wallets in tandem.","The SOL-specific version of the Dogeverse website also adds the ability to buy tokens using Circle’s hugely popular USDC, which is the stablecoin of choice on the Solana network,","#Cosmo ventures to a new world in the vast #Blockchain Universe! 🚀","This time landing on planet #Solana and expanding the horizons of the #DOGEVERSE even more! 🪐","Empowering users with benefits like:","⚡️ Lightning-Fast Transactions\n💸 Low Transaction Costs\n🌐 Scalability and… pic.twitter.com\/BH4l5RjhIS","— DogeVerse (@The_DogeVerse) April 30, 2024","","Currently priced at $0.000304 and due to rise in a few days, Dogeverse sold out its initial soft cap allocation of 200 billion tokens after trending virally on launching at the beginning of April. ","A heady $1 million flooded the project barely 48 hours into its ICO, selling out of tokens allocated to the first two presale rounds and far exceeding the team’s initial expectation of a 6-day first round.  ","This enabled Dogeverse to move onto the second half of its ICO a day ahead of schedule. A further 200 billion tokens are being sold to the public across the remaining rounds before the presale closes. Initially, this was planned for June 11, however, due to the immense success of the presale, it’s likely to conclude substantially earlier.","The funds from these additional tokens, which would otherwise be sold on decentralized (DEX) or centralized (CEX) exchanges after the claim, will now bolster liquidity to ensure high-volume trading and for buy-back funds.","Token holders can stake on Ethereum to earn passive rewards. ","The team is currently working towards CoinGecko and CoinMarketCap listing applications, while later DEX and CEX listings form part of the project roadmap.","Bridging Blockchains with $DOGEVERSE Tech 🌉📚","Wormhole and Portal Bridge play a crucial role in enhancing the interoperability within the #DOGEVERSE ecosystem. 🔑 🔗","We're eager to learn from your experiences—share your thoughts and insights below! #AltSeason #ETH #SOL #BNB pic.twitter.com\/7rZm66mCWj","— DogeVerse (@The_DogeVerse) April 30, 2024","","The market’s appetite for canine-themed coins began with Dogecoin (DOGE) back at the end of 2013. Dogecoin didn’t need much of a sales pitch, because it was based on a viral meme that virtually anyone with a social media account had seen before. (Wow! Such meme! Very crypto!) ","Since then, many celebrities have professed their love for the novelty canine cryptocurrency, including Tesla CEO Elon Musk, American entrepreneur Mark Cuban, and musicians Gene Simmons and Snoop Dogg. ","But fun as it may be, Dogecoin is not without its problems. ","Since Dogecoin is its own proprietary network based on Bitcoin, it utilizes a consensus mechanism called Proof-of-Work (PoW) to validate transactions. This means that the miners with the most computation and power mine the most Dogecoin. Like Bitcoin, mining DOGE consumes a lot of energy. ","Shiba Inu (SHIB), Floki (FLOKI), Bonk (BONK), and DogWifHat (WIF) were hot on Doge’s trail. All of them reference original viral doge memes in some way, but all of them have either come from the most commercially important blockchain, Ethereum, or its nearest rival, Solana, both of which use less energy than Bitcoin and Dogecoin. ","To date, none of the alternative Dogecoins have seriously challenged the original’s dominance.","Dogeverse hopes to change that. It is built on a multichain network spanning six chains, none of which deploy the PoW consensus mechanism. ","At the center of the Dogeverse is our four-legged friend Cosmo. Born from a supernova, Cosmo discovered he had a unique ability: the power to hyper-jump across universes. ","Now, Cosmo wants to share the chain-leaping fun with his owners. ","🌟 Introducing #Cosmo, the remarkable #Doge born from stardust! 🌠","As the ambassador of #DOGEVERSE, Cosmo symbolizes liberty, ingenuity, and unity.","Embark with him on an adventure across the #Crypto cosmos, breaking barriers and venturing into uncharted territories together. 🚀 pic.twitter.com\/wzLatjuLMu","— DogeVerse (@The_DogeVerse) April 21, 2024","","Analysts are anticipating potentially price-driving news this month, on May 23. That’s the SEC’s first deadline to respond to the latest round of applications for US spot Ethereum ETFs. ","The date could mark the start of a potential Ethereum gold rush, and with Ethereum being crypto’s most commercially important blockchain, the whole ecosystem will benefit.","So will Layer 1 competitors like Solana and Avalanche and Layer 2s like Polygon, all of which are native to the Dogeverse.  ","Given the fact that a federal court overturned the SEC’s earlier refusal of Bitcoin ETFs as “arbitrary and capricious” it’s possible that spot Ethereum ETFs will pass through unopposed, smashing the doors down for the approval of similar products for Solana and Avalanche. ","","The ETF effect is a very real catalyst, too. Earlier this year, the US launch of eleven spot Bitcoin ETFs rallied the original cryptocurrency to set a new high watermark of $73,737.94 on March 14.","So Cosmo is a clean and green representative of not one, not two, but six different blockchain networks. And with staking capabilities, seamless multi-chain fun and a potentially catalytic news cycle in the coming months, what’s not to love about crypto’s new hyper-jumping pupper?","Join the presale over on the Dogeverse website before the price rises. ","Social Channels: Twitter | Telegram",""],"entity":[{"type":"$73,737.94","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"Solana ($SOL","content":"ORGANIZATION"},{"type":"Bonk (BONK)","content":"PERSON"},{"type":"$BNB","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"$AVAX","content":"MONEY"},{"type":"Cosmo","content":"ORGANIZATION"},{"type":"Portal Bridge","content":"ORGANIZATION"},{"type":"200 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Elon Musk","content":"PERSON"},{"type":"Friday, April 26","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$DOGEVERSE","content":"MONEY"},{"type":"May 23","content":"DATE"},{"type":"$3.465 billion","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Dogeverse","content":"ORGANIZATION"},{"type":"$BASE","content":"MONEY"},{"type":"Gene Simmons","content":"PERSON"},{"type":"March 14","content":"DATE"},{"type":"April 21, 2024","content":"DATE"},{"type":"May 01, 2024","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Tech 🌉📚","content":"ORGANIZATION"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"$0.000304","content":"MONEY"},{"type":"$MATIC","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"June 11","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Dogeverse","Meme coin","MultiChain"],"authors":["Tim Hakki"]}