{"summary":"The CEO of Intercontinental Exchange (ICE) said on Thursday that Bakkt is in talks with all financial institutions, including major banks and brokers, to","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45349\/ice-ceo-all-kinds-of-financial-institutions-are-talking-to-bakkt","publishDate":"2019-10-31T15:33:11","id":1737,"type":null,"title":"ICE CEO: &#x27;all kinds of financial institutions&#x27; are talking to Bakkt","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">The CEO of Intercontinental Exchange (ICE) said on Thursday that Bakkt is in talks with all financial institutions, including major banks and brokers, to explore the possibility of adopting bitcoin derivatives.<\/span>","<span data-v-f87c67ca=\"\">In the stock-and-futures giant's Q3 earnings call, CEO Jeffrey Sprecher responded to a question about Bakkt, the bitcoin derivatives platform backed by ICE, which questioned Bakkt’s rapid moves into bitcoin options and the payments space only a month after its launch.<\/span>","<span data-v-f87c67ca=\"\">Sprecher noted that the two initiatives are launched against the backdrop that the institutional interest in bitcoin derivatives is very high and there is an emphasis on how to gain exposure to crypto in a compliant manner.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“All [kinds] of financial institutions are talking to us and looking at this and trying to figure out where this fits and what the global regulators are going to think about this and so on and so forth. So there's a tremendous amount of dialogue around it,” said Sprecher.&nbsp;<\/span>","Following its underwhelming inception, Bakkt recently witnessed a jump in the trading volume of its physically-settled monthly bitcoin futures, hitting around $10.25 million on Oct. 25.","<span data-v-f87c67ca=\"\">According to Sprecher, Bakkt’s fast advance into the options market is looking to be among the first that offers the space transparent price discovery. As Sprecher pointed out, the current options market for bitcoin is active but murky. Meanwhile, Bakkt’s derivatives platform can act as a source of price discovery independent of unregulated cash markets, bringing more transparency to the space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“So it lends itself very nicely to an options market where people trade options and hedge with the underlying can have perfect hedging in one venue that they know is transparent. So that was the pressure to get the options out quickly,” said Sprecher.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Regarding Bakkt’s plans in the consumer payments space, Sprecher said that the move stemmed from the belief that bitcoin will be both a payments method and a store of value, similar to gold.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We don't think that, that whole space will be relevant and grow unless there are real use cases. And we do, as you pointed out, think that a use case is going to be digital transfer of value through payments,” said Sprecher.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, Bakkt <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/44872\/bakkt-to-launch-consumer-app-in-first-half-of-2020-will-test-product-with-starbucks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> that it will launch a cryptocurrency consumer app and merchant portal in the first half of 2020, in partnership with Starbucks. Prior to that, the firm said it will <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/44494\/bakkt-to-launch-options-for-its-bitcoin-futures-in-december\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">roll out <\/span><\/a><span data-v-f87c67ca=\"\">the first regulated options contract for bitcoin futures on Dec. 9. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"Sprecher","content":"PERSON"},{"type":"Bakkt","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Jeffrey Sprecher","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Oct. 25","content":"DATE"},{"type":"Bakkt","content":"PERSON"},{"type":"$10.25 million","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Dec. 9","content":"DATE"},{"type":"the first half of 2020","content":"DATE"}],"hashtag":[],"authors":["Celia Wan","The Block"]}