{"summary":"Hacker Behind $320 Million Wormhole Bridge Exploit Initially Eligible for $50,000 Airdrop","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hacker-320-million-wormhole-bridge-exploit-eligible-for-airdrop.htm","publishDate":"2024-04-04T13:11:36","id":17386,"type":null,"title":"Hacker Behind $320 Million Wormhole Bridge Exploit Initially Eligible for $50,000 Airdrop","category":["Altcoin News "],"content":["The hacker responsible for the notorious $320 million exploit of the Wormhole bridge In 2022 found themselves initially eligible for an airdrop, potentially claiming $50,000 in newly launched W tokens.","An investigation conducted by pseudonymous researcher Pland, detailed in an X post on April 4th, revealed that the Wormhole team overlooked excluding several wallet addresses associated with the exploit that drained $321 million in crypto from the cross-chain bridge.","","Wormhole forgot to exclude the exploiter from the airdrop pic.twitter.com\/xkkpDz9RAl","— Pland (@Pland__) April 3, 2024","","Wormhole, a cross-chain protocol, is a token bridge that allows users to send and receive crypto between Ethereum, Solana, Binance Smart Chain (BSC), Polygon, Avalanche, Oasis, and Terra without the use of a centralized exchange. ","In February 2022,  hackers compromised Wormhole Bridge leading to 120,000 wETH loss from the platform, equivalent to $321 million. It was the largest DeFi attack of 2022 and the hacker swapped wETH tokens with Ethereum, SOL, USDC, APE, SX, etc.","Later, Wormhole rewarded a white hacker with $10 million for rectifying a bug in its core bridge contract on Ethereum just after its platform was compromised in the cyber attack.","However, in February 2023, Web3 infrastructure firm Jump Crypto and decentralized finance (DeFi) platform Oasis.app executed a “counter exploit” on the Wormhole protocol hacker. Through their efforts, a total of $225 million in digital assets were successfully recovered and returned to secure wallets.","SOURCE A: https:\/\/t.co\/EXtHwdBpIH\nSOURCE B: https:\/\/t.co\/JF4TKftJPn\nSOURCE C: https:\/\/t.co\/sbMhdtrU61\nSOURCE D: https:\/\/t.co\/5emx1r8kfe\nSOURCE E: https:\/\/t.co\/ILLzx6SbtG\nSOURCE F: https:\/\/t.co\/y11GEbWKM8","— DEGEN NEWS 🗞️ (@DegenerateNews) April 4, 2024","","According to recent information obtained from the Solana-based airdrop checker Airdrop.link, and later reported by Degen News on April 4, a total of four wallet addresses linked to the hackers were temporarily able to claim Wormhole’s airdrop.","Solana block explorer Solana.fm flagged all four of the eligible wallet addresses as being linked to the 2022 Wormhole exploit.","If the hacker had opted to claim the airdrop, they would have received approximately 31,642 Wormhole (W) tokens, equivalent to $50,000 based on current market prices.","However, further investigation revealed that the hacker wallet addresses were no longer eligible for the airdrop, indicating that the Wormhole team may have swiftly addressed the oversight.","On April 3, Wormhole made an announcement regarding the airdrop of over 675 million new Wormhole (W) tokens, with an approximate value of $850 million based on current market prices, to eligible users.","Having previously disclosed details for the W token airdrop, Wormhole revealed that more than 400,000 total wallets are eligible to participate in claiming the tokens. Of the total allocation, 617.3 million W tokens have been allocated for the initial community and ecosystem airdrop. This distribution aims to reward early users across Solana, Ethereum, and other compatible chains, as well as various crypto communities.","An intriguing feature of the W token is its governance functionality, which allows holders to delegate their tokens to participate in governance votes. This delegation process is available on Solana or any compatible Ethereum-based chains, representing what Wormhole describes as the “first ever” multichain governance system.","Following the launch of the W token on Wednesday, the asset surged to a price of $1.66 before experiencing a sharp decline. Currently, the price of W stands at $1.31, marking a 20% decrease on the day.","Market data from CoinGecko indicates that the asset’s market capitalization briefly approached $3 billion at its peak price but has since settled at nearly $2.4 billion, positioning it as the 54th largest digital asset by market capitalization."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"April 4, 2024","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"February 2023","content":"DATE"},{"type":"$2.4 billion","content":"MONEY"},{"type":"February 2022","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$1.66","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"DEGEN","content":"PERSON"},{"type":"$320 million","content":"MONEY"},{"type":"April 3, 2024","content":"DATE"},{"type":"April 3","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"$321 million","content":"MONEY"},{"type":"$850 million","content":"MONEY"},{"type":"Pland","content":"LOCATION"},{"type":"April 4th","content":"DATE"},{"type":"$225 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$1.31","content":"MONEY"},{"type":"Degen News","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Airdrop","Crypto hack","Wormhole"],"authors":["Hassan Shittu"]}