{"summary":"Bakkt has raised $300 million in a new funding round\nInvestors include Intercontinental Exchange, Microsoft’s M12, Goldfinch Partners, Pantera Capital\nThe firm has also unveiled a newly redesigned website","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58838\/bakkt-raises-300-million-series-b-funding-round","publishDate":"2020-03-16T09:27:09","id":1738,"type":null,"title":"Bakkt raises $300 million Series B funding round","category":["Bitcoin"],"content":["Bakkt has raised a $300 million Series B round of financing, according to a Monday morning announcement.","The companies backing the round include Intercontinental Exchange, Microsoft’s M12, PayU, Boston Consulting Group, Goldfinch Partners, CMT Digital, and Pantera Capital, according to <a href=\"https:\/\/medium.com\/bakkt-blog\/bakkt-completes-300-million-series-b-financing-a072ff029135\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a blog post<\/a>.","\"With the completion of our Series B financing and recent acquisition of Bridge2 Solutions, Bakkt is now a team of 350 employees and powers the loyalty redemption programs for 7 of the top 10 financial institutions and over 4,500 loyalty and incentive programs including two of the largest US airlines,\" Bakkt CEO Mike Blandina wrote in the post.","Bakkt indicated that its consumer-centric app would launch \"this summer\" – the firm previously indicated that it would go live sometime this year, as <a href=\"https:\/\/www.theblockcrypto.com\/post\/53745\/bakkts-consumer-app-is-coming-in-2020-and-itll-look-more-like-paypal-than-coinbase\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">previously reported<\/a> by The Block.&nbsp;","\"I’m excited at our potential to unlock nearly $1 trillion of digital assets when the Bakkt app launches this summer,\" Blandina wrote.","Blandina also built on the idea that Bakkt's app will take an expansive view of the term \"digital assets,\" which would seemingly encompass things like airline miles, reward points and game data.","<strong data-v-f87c67ca=\"\">Integration with Starbucks<\/strong>","In a follow-up announcement, Bakkt President Adam White said in a <a href=\"https:\/\/twitter.com\/WhiteAdamL\/status\/1239606993909841923?s=20\" data-v-f87c67ca=\"\">tweet<\/a> that the firm has integrated with Starbucks. <span class=\"css-901oao css-16my406 r-1qd0xha r-ad9z0x r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"Bakkt Cash\" now shows up as a payment option in the Starbucks app and customers can select it to sign up for Bakkt's early access program. <\/span>","<span class=\"css-901oao css-16my406 r-1qd0xha r-ad9z0x r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This's the Bakkt app's first case of direct integration with merchants that aimed to \"[reduce]<\/span><span class=\"css-901oao css-16my406 r-1qd0xha r-ad9z0x r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> payment costs for merchants which improves their bottom line,\" White said.&nbsp;<\/span>","According to a Starbucks spokesperson, the company's continued strategic partnership with Bakkt is due to its long-term plan to offer customers payment options that allow them to swap their cryptos for dollars.","\"Starbucks continues to be a strategic launch partner for Bakkt in developing practical, trusted and regulated applications for consumers to convert their digital assets into U.S. dollars for use at Starbucks,\" the spokesperson told The Block. \"We anticipate that a range of cryptocurrencies will gain traction with customers and, through our work with Bakkt, we will be uniquely positioned to constantly consider and offer customers new and unique ways to pay seamlessly, at Starbucks.\"<u data-v-f87c67ca=\"\"><\/u><u data-v-f87c67ca=\"\"><\/u>","The feature, however, is still in test mode and is only available for a limited audience right now, according to the spokesperson.&nbsp;"],"hashtag":[]}