{"summary":"232 Wikipedia Users Force the Online Encyclopedia to Ditch Bitcoin, Ethereum, and BCH Donation Options","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/232-wikipedia-users-force-the-online-encyclopedia-to-ditch-bitcoin-ethereum-and-bch-donation-options.htm","publishDate":"2022-05-02T08:26:00","id":17383,"type":null,"title":"232 Wikipedia Users Force the Online Encyclopedia to Ditch Bitcoin, Ethereum, and BCH Donation Options","category":["Bitcoin News "],"content":[" ","The Wikimedia Foundation, the body that operates the user-created web-based encyclopedia Wikipedia, has announced that it will no longer accept crypto donations. ","The move came after a request for comment and vote on a key proposal put forward by the Wikipedia editor and software engineer Molly White. Wikipedia began accepting coins like bitcoin (BTC), bitcoin cash (BCH), and ethereum (ETH) in 2014, but White created a request for comment that was opened “to community input between January 10, 2022 and April 12, 2022,” with a “little under 400 users” participating in “the voting and discussion,” with 232 (or just over 71%) voting in favor of ending crypto donations.","Congrats on cutting yourselves out of the most inclusive monetary system to ever exist 👍\n\nEveryone always comes back to #Bitcoin","Wikimedia has used BitPay as a payment gateway, but noted that in “the last financial year,” it had received just over USD 130,000 worth of donations in crypto from under 350 donors, adding: ","“Crypto was around 0.08% of our revenue last year, and it remains one of our smallest revenue channels.” ","Unsurprisingly for some, perhaps, concerns about the “environmental sustainability” of both BTC and ETH were put forward. But there were also other reasons, including the accusation that “accepting cryptocurrencies constitutes implicit endorsement of the issues surrounding cryptocurrencies,” as well as claims that there were “risks to “the movement’s reputation for accepting cryptocurrencies.”","“Cryptocurrencies are extremely risky investments that have only been gaining popularity among retail investors particularly in recent times, and I do not think we should be endorsing their use in this way. In accepting them, I believe we are mainstreaming the usage of ‘investments’ and technology that are inherently predatory,” according to White.","White concluded that Wikimedia risked “damaging our reputation by participating” in the crypto space, noting that “one our peers,” Mozilla, was “reevaluating their choice to accept cryptocurrency donations after considerable backlash from their supporters, including from their own founder.”\n___\nLearn more: \n– Bitcoin Mining Efficiency Up 63% in Year, ‘Sustainable Electricity Mix’ Jumped 59% – Bitcoin Mining Council\n– Ripple’s Exec Campaign Has ‘Zero Chance’ of Forcing Bitcoin to Proof-of-Stake, But Brace for More Attacks\n\n– Illicit Activity’s Share in Crypto Shrinks, ‘Significant Problem’ Remains\n– ‘PoS Fanatics Attacking PoW are Actual Supervillains’, Kraken’s Powell Says as US Politicians Charge"],"entity":[{"type":"2014","content":"DATE"},{"type":"BCH","content":"ORGANIZATION"},{"type":"January 10, 2022","content":"DATE"},{"type":"Crypto Shrinks","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"71%","content":"PERCENT"},{"type":"Molly White","content":"PERSON"},{"type":"63%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"Mozilla","content":"LOCATION"},{"type":"April 12, 2022","content":"DATE"},{"type":"Wikimedia Foundation","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"59%","content":"PERCENT"},{"type":"0.08%","content":"PERCENT"}],"hashtag":["Adoption","Bitcoin","Bitcoin Cash","Ecology","Ethereum","Payments"],"authors":["Tim Alper"]}