{"summary":"Is Wormhole About to Crash? W Price Drops 18% as Whale Money Shifts to Slothana","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-wormhole-about-to-crash-w-price-drops-18-as-whale-money-shifts-to-slothana.htm","publishDate":"2024-04-05T14:35:04","id":17388,"type":null,"title":"Is Wormhole About to Crash? W Price Drops 18% as Whale Money Shifts to Slothana","category":["Industry Talk "],"content":["Wormhole’s W token is down 18% in the last 24 hours, barely two days after listing on Binance, according to data by CoinGecko.","The losses come amidst a broader market pullback that has shaved 2.2% off the price of Ethereum (ETH), the world’s second-largest cryptocurrency by market capitalization.","Market leader Bitcoin (BTC) has remained virtually unchanged since 24 hours ago.","The world’s favorite cryptocurrency actually grew 0.5% intraday, but at $66,654, it’s currently trading about 5% lower than it was this time last week. ","Among the top 20 cryptocurrencies by market capitalization, Solana (SOL) posted the biggest depreciation. SOL fell 7.5% overnight to trade at $172.","So, Wormhole’s W token is following broader market patterns, however, it appears to be one of the heaviest losers today.","Over on the trading chart, we can see a steady depreciation in price since the listing two days ago.","W initially traded with a lot of volatility, but this has largely stabilized over the last two days.","The W token’s Relative Strength Index (RSI) is currently in the mid-fifties.","Overall, W has relatively accurate pricing at the minute, however, we can see the RSI dropped below 40 three times in the last 24 hours, indicating heavy selling.","Wormhole entered the market at $1.66 a token with a $3 billion market capitalization. Each W token grants holders governance voting rights over the cross-chain interoperability protocol.","Delegation can take place on Solana or any of the compatible Ethereum-based chains in a process that is being dubbed the “first ever” multichain governance system.","However, Wormhole is a tough sell. To start with, as a cross-chain bridging protocol, so it’s a lot more vulnerable to hacks.","One of the largest in history was the Ronin Bridge hack in 2022. Hackers looted over $600 million in crypto from a vulnerability in Axis Infinity’s Ethereum sidechain. ","While Ronin may have been the largest, Wormhole wasn’t that far behind.","That same year, hackers purloined $321 million from the cross-chain bridge.","Given the fact that cross-chain bridges are a bit of a bullseye for hackers, prudent investors may want alternative small market cap projects with less security concerns.","Meme coins are one such sector and Solana meme coins are some of the buzziest right now.","The network’s latest star is a 420-friendly sloth with big dreams.","In a few days, traders have poured $8.26 million into an ICO for new Solana meme coin Slothana ($SLOTH) to try and recapture some of the early upside potential of established Solana funny tokens like Slerfs, DogWifHat and Bonk.","🚨 Attention Slothana community! Thread ahead 🌿 Due to expected upcoming volatility, we've moved funds into USDT on Polygon. SOL USDT withdrawals are suspended on major exchanges therefore we have had to use Polygon. Address in bio.","— Slothana (@SlothanaCoin) April 4, 2024","","Solana’s latest meme sensation is a lazy critter who lives and works on the blockchain. But with his permanently red eyes, he can’t hide the fact that he really doesn’t want to work; he wants to go from 420 to $420 million.","Word on the grapevine says Slothana is by the same team that launched Smog (SMOG), which rallied strongly after ending its presale and listing.","Details are scarce at present, but interested investors can join the presale by sending SOL to this address: EnSawje2vQSQKtGbPYdXEuYKm2sHgeLKJTqCmrDErKEA","Visit Slothana Here",""],"entity":[{"type":"$SLOTH","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"$8.26 million","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"$420 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 4, 2024","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"Bonk","content":"LOCATION"},{"type":"$600 million","content":"MONEY"},{"type":"RSI","content":"ORGANIZATION"},{"type":"$1.66","content":"MONEY"},{"type":"$66,654","content":"MONEY"},{"type":"7.5%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"last two days","content":"DATE"},{"type":"$321 million","content":"MONEY"},{"type":"2.2%","content":"PERCENT"},{"type":"Slothana","content":"PERSON"},{"type":"18%","content":"PERCENT"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$172","content":"MONEY"}],"hashtag":["slothana","w","Wormhole"],"authors":["Tim Hakki"]}