{"summary":"LayerZero Labs Vows to Exclude Sybil Farmers From Upcoming Airdrop","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/layerzero-labs-vows-to-exclude-sybil-farmers-from-upcoming-airdrop.htm","publishDate":"2024-05-06T11:04:48","id":17387,"type":null,"title":"LayerZero Labs Vows to Exclude Sybil Farmers From Upcoming Airdrop","category":["Altcoin News "],"content":["LayerZero Labs, a renowned cross-chain interoperability protocol, has vowed to tackle the issue of sybil farmers ahead of its highly anticipated airdrop. ","In a recent announcement, LayerZero Labs stated that it will conduct an internal investigation to identify and exclude sybil farmers from receiving allocations in its future token generation event. ","Additionally, the project plans to launch a reward program, offering a 10% bonus of the intended token allocation to bounty hunters who identify additional sybil users.","Sybil farming involves the creation of multiple wallets controlled by a single user, with the aim of generating significant activity on a network or protocol to maximize their airdrop benefits. ","LayerZero Labs expressed its intention to distribute tokens to genuine and long-term users rather than sybil farmers, emphasizing the protocol’s best interests.","Since its initial launch over two years ago, LayerZero has witnessed interaction from nearly 6 million unique wallet addresses. ","The team believes that sybil farmers should be excluded from the airdrop in order to ensure fair distribution of tokens. ","The project made this commitment public via a tweet, highlighting their dedication to combating sybil farming.","Merkly is the second most used LayerZero application by volume behind only Stargate","But if you used it, you’re a sybil!","Great idea @LayerZero_Labs pic.twitter.com\/Wd9F4R7c4l","— Blur (@BlurCrypto) May 3, 2024","","Instances of sybil farming have been observed in the crypto space before. ","In 2022, Optimism disqualified over 17,000 suspected wallets engaged in sybil activity from its airdrop, accounting for 6.83% of eligible wallets. ","Similarly, in September, a network named ZkSync Era discovered 21,877 wallets involved in sybil farming activities, where the wallets were transacting a closed-source token among themselves using a private decentralized exchange.","LayerZero Labs has identified several on-chain activities that may lead to exclusion from the airdrop. ","These include instances where a single entity engages in “industrial farming” through multiple wallets, users who mint “valueless” NFTs solely for the purpose of transferring them across networks, those who repeatedly bridge minuscule asset values between chains, and individuals interacting with well-known sybil farming applications.","The project encourages self-reporting by sybil farmers through signed on-chain messaging until May 18, offering them a chance to receive 15% of their intended airdrop allocation. ","Furthermore, LayerZero Labs plans to provide an API that allows industrial farmers to self-report.","It is worth noting that airdrop eligibility will be subject to “legal or geographic requirements.” ","This suggests that sybil farmers operating from countries with regulatory risks, such as the United States or North Korea, may have little to gain from self-reporting.","LayerZero Labs recently completed the first snapshot for its highly anticipated airdrop. ","In December, the project announced its plans to distribute tokens to early adopters in the first half of 2024.","Anticipation for the ZRO token launch is already evident, particularly on decentralized exchanges. ","On Hyperliquid, the world’s largest perps DEX, a perpetual futures contract for ZRO is currently trading at $8.4, which suggests a fully diluted valuation of approximately $17 billion for the forthcoming token."],"entity":[{"type":"Stargate","content":"LOCATION"},{"type":"$17 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"May 18","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"the first half of 2024","content":"DATE"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"$8.4","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"6.83%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"May 3, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"}],"hashtag":["Airdrop","Cross-Chain","LayerZero"],"authors":["Ruholamin Haqshanas"]}