{"summary":"The Depository Trust & Clearing Corporation (DTCC) is developing a prototype of how a central bank digital currency (CBDC) might work in the US in practice.\nDTCC says it aims to demonstrate the direct, bilateral settlement of cash tokens between participants in real-time delivery-versus-payment (DVP) settlement.","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141565\/clearing-service-dtcc-pushes-ahead-with-cbdc-prototype-project-lithium","publishDate":"2022-04-12T08:00:21","id":1739,"type":null,"title":"Clearing service DTCC pushes ahead with CBDC prototype &#x27;Project Lithium&#x27;","category":["Central Banks"],"content":["The Depository Trust &amp; Clearing Corporation (DTCC) said on Tuesday that it is set to develop a prototype of how a central bank digital currency (CBDC) might work in the US in practice.&nbsp;","The corporation, which provides post-trade market infrastructure for the financial services industry, said in a press release that the model will use distributed ledger technology (DLT) and measure the benefits of a CBDC.&nbsp;","The assignment, dubbed 'Project Lithium,' comes as part of the digital dollar project (DDP) effort. It will also explore how a CBDC could enable atomic settlement, a conditional settlement that occurs if delivery and payment are both received at the same time.","Unlike private cryptocurrencies such as bitcoin, a CBDC would be issued and backed by the Federal Reserve, just like US paper dollars and coins.","With this prototype, DTCC says it aims to demonstrate the direct, bilateral settlement of cash tokens between participants in real-time delivery-versus-payment (DVP) settlement. The pilot will also identify how it can leverage DTCC’s clearing and settlement capabilities to fully realize the potential benefits of a CBDC.","These benefits could include reduced counterparty risk and trapped liquidity, increased capital efficiency and added transparency for regulators.","The move comes as governments around the world are considering the benefits of developing a digital currency. According to research conducted by PwC, more than 80% of central banks are considering launching a CBDC or have already done so.","Among countries that have already launched, or have projects in pilot are mainland China, Nigeria and the Bahamas. Bangko Sentral ng Pilipinas, the central bank of the Philippines, also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/136496\/philippines-central-bank-to-launch-cbdc-research-effort\" data-v-f87c67ca=\"\">said in March<\/a> it intends to move forward with a research project focused on central bank digital currencies. Meanwhile, the Bank of England has said it doesn't expect a digital currency to launch until the second half of this decade.&nbsp;"],"hashtag":[]}