{"summary":"DOGE Price Is Up 7%, Holders Venture Into New Dog-Themed ICO, Looking For 1,121% returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/doge-price-is-up-7-holders-venture-into-new-dog-themed-ico-looking-for-1121-returns.htm","publishDate":"2024-05-02T16:02:55","id":17391,"type":null,"title":"DOGE Price Is Up 7%, Holders Venture Into New Dog-Themed ICO, Looking For 1,121% returns","category":["Industry Talk "],"content":["Original meme coin Dogecoin ($DOGE) has risen 7% in the last 24 hours to become one of the fastest recovering cryptocurrencies following a brief market crash this week.","DOGE currently trades for $0.1317. That’s about 12% down from where it was this time last week, making the world’s first Shiba Inu meme-inspired cryptocurrency one of the biggest sponges for losses in the last seven days. ","Bitcoin ($BTC) fared a bit better this week. The original cryptocurrency only shed 7% in value and currently changes hands at $59,044. However, it crashed from a Tuesday high of $64,515 to a Wednesday bottom of $56,804, an intraday drop of about 12%.","Ethereum retained value better this week than both Bitcoin and Dogecoin. The ETH token underpinning the most commercially important blockchain only shed 4.4% over the week and currently trades for $2,992. Both Bitcoin and Ethereum have risen a little over 3% in the last 24 hours. ","The only meme coin that came matched Dogecoin’s losses this week was Floki ($FLOKI). Floki is a meme coin inspired by Dogecoin fan and Tesla CEO Elon Musk’s pet Shiba Inu, Floki. Like DOGE, FLOKI also shed 12% and currently trades for $0.0001645. ","Dogecoin’s trading chart shows a cryptocurrency that at times, trades at odds with the wider market. Where most projects peaked along with Bitcoin in early-to-mid March, Dogecoin holders posted more muted gains until after Bitcoin had peaked on March 14.","In late March, DOGE rallied to over 22 cents, twice. There also appears to be some buying momentum right now. Dogecoin has a relative strength index (RSI) of 61 and climbing, but it’s almost reached the overbought threshold so this brief rally is likely to lose steam soon.","Dogecoin’s rally came at the same time as the launch of another canine-themed meme coin. This one has a far more alluring premise, though.","WienerAI ($WAI) is the brand new meme token and AI companion that has degens stacking in preparation for some potentially eye-watering rallies.","Touted as a “Revolutionary AI Trading partner”, WienerAI is a digital companion that offers his owners user-friendly AI-enhanced trading advice, seamless swap functionality and zero fees. With unparalleled capabilities, WienerAI is the ultimate asset for every crypto trader.","His whitepaper mentions “The Sausage Army”, the endearing term for the legions of followers Wiener hopes to attract, so there are subtle hints at a strong social component down the line. ","Dogecoin ($DOGE), also has an army: the “Doge Army”, but Wiener’s army is greener. That’s because WienerAI utilizes a Proof-of-Stake (PoS) consensus mechanism, where the miners that stake the most ETH get the most rewards.","This is well over 99% more energy efficient than Bitcoin and Dogecoin’s Proof-of-Work consensus mechanism, which requires vast computing and energy resources to mine crypto. ","How it feels to Stake $WAI. pic.twitter.com\/IpkkxWHh8J","— WienerAI (@WienerDogAI) May 1, 2024","","The WienerAI smart contract was audited by Coinsult, a blockchain security platform that conducts security checks on various crypto and blockchain platforms. ","Some 20% of $WAI’s supply is for staking. Buyers are encouraged to stake during the presale, in order to take advantage of the lucrative 1121% APY on offer at present. ","Mysterious he may be, but it’s no mystery why investors have put over $800,000 into WienerAI’s new presale. Everybody wants to get their hands on a tokenized piece of crypto’s most advanced beginner-friendly AI trading companion yet.","Keep on top of the latest developments on X\/Twitter and Telegram. ","Join the presale now over on the website",""],"entity":[{"type":"$0.1317","content":"MONEY"},{"type":"$59,044","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"Coinsult","content":"ORGANIZATION"},{"type":"$0.0001645","content":"MONEY"},{"type":"$WAI","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$DOGE","content":"MONEY"},{"type":"1121%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$BTC","content":"MONEY"},{"type":"Floki","content":"PERSON"},{"type":"22 cents","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"May 1, 2024","content":"DATE"},{"type":"4.4%","content":"PERCENT"},{"type":"Doge Army","content":"ORGANIZATION"},{"type":"$64,515","content":"MONEY"},{"type":"$FLOKI","content":"MONEY"},{"type":"99%","content":"PERCENT"},{"type":"March 14","content":"DATE"},{"type":"Sausage Army","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Wiener’s army","content":"ORGANIZATION"},{"type":"$800,000","content":"MONEY"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"$2,992","content":"MONEY"},{"type":"Wiener","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"$56,804","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Dogecoin","Meme coin","wienerai"],"authors":["Tim Hakki"]}