{"summary":"Croatian Post Launches Crypto Stamp & Ethereum-Based ‘Postereum’ Token","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/croatian-post-launches-crypto-stamp-ethereum-based-postereum-7680.htm","publishDate":"2020-09-10T17:00:00","id":17395,"type":null,"title":"Croatian Post Launches Crypto Stamp & Ethereum-Based ‘Postereum’ Token","category":["Ethereum News "],"content":["The Croatian Post, in cooperation with the Blockchain and Cryptocurrency Association, has issued the country’s first crypto postage stamp, along with a digital token ‘Postereum’ created on Ethereum (ETH).","“The Croatian crypto stamp is envisioned as the perfect combination of the analogue and the digital,” said Vlaho Hrdalo, Chairman of the Blockchain and Cryptocurrency Association. “The crypto stamp project is extremely important for the development of this relatively new industry in Croatia, but also for putting Croatia on the blockchain world map, as well as on the world philately map, since the crypto stamp also marks an anniversary: 180 years since the first stamp, the “Penny Black”, was issued,” he said.","The cryptostamp comes in two parts, according to the Post’s website:","“Postereum can live forever on blockchain and has a collecting value, thus achieving a faithful translation of philately into the digital world,” said the Post.","The cryptostamps are classified into five categories, or tiers, chosen due to their “historical significance as a means of providing Croatian Post’s services,” depicting different means of transport as motifs, with the total quantity to 100,000 stamps:","These can be bought in major postal offices, and official online shops. Five cryptoassets can be used to buy a crypto stamp in the interactive web shop: bitcoin (BTC), ethereum (ETH), XRP, DAI, stellar (XLM).","“Whether digital albums will replace philately albums remains to be seen, but it is already clear that the passion that people have for collecting rare items did not disappear with the emergence of digital technologies,” Hrdalo concluded.","Croatia is the third country in the world to have issued a cryptostamp, following Gibraltar and Austria, claimed Jutarnji list.","As previously reported, the national post has started a pilot project last year, allowing all local and international crypto owners to exchange their tokens to HRK in the city of Zadar’s post offices.\n___\nLearn more: This Eurozone Member Opens A ‘Playground’ for Testing CBDCs"],"entity":[{"type":"Cryptocurrency Association","content":"ORGANIZATION"},{"type":"Austria","content":"LOCATION"},{"type":"Gibraltar","content":"LOCATION"},{"type":"Zadar","content":"LOCATION"},{"type":"Vlaho Hrdalo","content":"PERSON"},{"type":"Croatia","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"}],"hashtag":["Adoption","Ethereum","Non-fungible tokens"],"authors":["Sead Fadilpašić"]}