{"summary":"Breaking: Ethereum Foundation Faces Investigation by Unnamed ‘State Authority’ – Will ETH Get Banned?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/breaking-ethereum-foundation-faces-investigation-by-unnamed-state-authority-will-eth-get-banned.htm","publishDate":"2024-03-20T17:03:07","id":17394,"type":null,"title":"Breaking: Ethereum Foundation Faces Investigation by Unnamed ‘State Authority’ – Will ETH Get Banned?","category":["Blockchain News "],"content":["","The Ethereum Foundation, the Switzerland-based non-profit organization that created and continues to develop the Ethereum blockchain, faces investigation by an unnamed “state authority”, the group’s GitHub repository says.","As per a GitHub commit submitted on the 26th of February, “we have received a voluntary enquiry from a state authority that included a requirement for confidentiality.”","The Ethereum Foundation – the Swiss non-profit organization at the heart of the Ethereum ecosystem – is under investigation by an unnamed \"state authority,\" according to the group's website's GitHub repository.","An attorney familiar with the situation said a Swiss regulator may…","— Crypto News Updates (@CryptoNewsUpd8s) March 20, 2024","","But traders and crypto media outlets only began to pick up on the news on Wednesday the 20th of March.","And as the news began to circulate, the Ether price has come under pressure.","ETH was last trading back around $3,200, having traded as high as $3,400 prior to the Ethereum Foundation investigation news emerging.","One attorney cited by various crypto news outlets suggested that the Swiss regulator may be behind the inquiry.","Moreover, this regulator may be working alongside the US Securities and Exchange Commission (SEC).","The SEC is currently looking at multiple applications from major Wall Street firms to launch spot Ether ETFs.","Most of the key deadline dates for the SEC to issue a decision are coming up in May.","But, in recent weeks, analysts and the market have become pessimistic about approval, despite approving Ether futures ETF last year.","Bloomberg ETF analyst James Seyffart recently predicted that Ether ETF applications will ultimately be denied in May.","My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round. The SEC hasn't engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall. https:\/\/t.co\/TyAzAOrAC5","— James Seyffart (@JSeyff) March 19, 2024","","That’s owing to a lack of engagement between the SEC and issuers on Ethereum specifics, he said.","Well, that lack of engagement makes sense if the SEC is working with Swiss regulators to look into the Ethereum Foundation, Ethereum’s creator.","While the SEC hasn’t outlined an official position on whether it views Ether a security or not, SEC Chair Gary Gensler has long argued (including during his time as a professor at MIT) Ether is a security issued by the Ethereum Foundation.","The Ethereum Foundation sold ETH in a presale back in 2015 to fund blockchain development.","When the SEC approved Ether futures ETFs last year, this was interpreted by most as confirmation that the agency views ETH as a commodity, not a security.","But if the SEC is looking into the Ethereum Foundation, via a Swiss regulator, this raises the risk the agency might label it as a security.","If the SEC does this, then US exchanges would be forced to delist ETH. If they didn’t, the SEC would likely accuse them of acting as an unlicensed securities exchange.","Of course, it’s a big jump to assume the SEC is about to label Ether a security, just because an unnamed regulator has served the Ethereum Foundation.","But it does raise such risks.","In that sense, it makes sense that the ETH price has dropped.","Attention now turns to the upcoming Fed meeting, which could further pressure prices. That’s if the Fed revises lower expectations as to the number of rate cuts it will make this year.","Profit-taking following Bitcoin hitting all-time highs last week also continues to weigh the market.","GBTC outflows are a particularly strong headwind. Net flows into spot Bitcoin ETF came in at negative $326 million on Tuesday, the highest on record.","Bitcoin ETF Flow – 19 March 2024","All data in. Record net outflow of $326m pic.twitter.com\/iBmBiMR74Z","— BitMEX Research (@BitMEXResearch) March 20, 2024","","",""],"entity":[{"type":"2015","content":"DATE"},{"type":"$3,200","content":"MONEY"},{"type":"fall","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$3,400","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Crypto News Updates","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"March 20, 2024","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"May 23rd","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"$326m","content":"MONEY"},{"type":"MIT","content":"ORGANIZATION"},{"type":"$326 million","content":"MONEY"},{"type":"March 2024","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"March 19, 2024","content":"DATE"},{"type":"26th of February","content":"DATE"},{"type":"Wednesday the 20th of March","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ether","Ethereum","Ethereum Foundation"],"authors":["Joel Frank"]}