{"summary":"NFT Trader Loses $145K To BAYC Phishing Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nft-trader-loses-145k-to-bayc-phishing-scam.htm","publishDate":"2024-05-09T19:36:21","id":17404,"type":null,"title":"NFT Trader Loses $145K To BAYC Phishing Scam","category":["NFT News "],"content":["An NFT trader lost over $145,000 worth of tokens in a BAYC phishing scam, according to May 9 data from on-chain security platform PeckShield.","PeckShield revealed that a trader known as “tatis.eth” fell victim to a phishing scam perpetrated by an attacker identified as “PinkDrainer.” The malicious entity stole three valuable BAYC NFTs – BAYC 7531, BAYC 6736, and BAYC 2100 – from the trader’s wallet.","","BAYC, also known as Bored Ape Yacht Club (BAYC), is a collection of 100,000 Ethereum-based collectibles. These NFTs are among the most influential and expensive ones around. They feature profile pictures of bored cartoon apes in various facial expressions and clothing.","#PeckShieldAlert ZachXBT has detected that tatis.eth has fallen victim to a phishing attack, resulting in the loss of 3 #BoredApeYachtClub NFTs, specifically #BAYC #7531, #BAYC #6736, & #BAYC #2100.\nThe scammer #PinkDrainer has already sold the stolen #BAYCs for a total of ~48.5… pic.twitter.com\/vU0EPndvRM","— PeckShieldAlert (@PeckShieldAlert) May 9, 2024","","A similar report from ZachXBT revealed that the stolen NFTs were transferred to a phishing address labeled “Fake_Phishing328357” on May 8 at 5:47 PM UTC. Thereafter, the attacker sold the three NFTs for a total of 48.5 ETH, equivalent to approximately $145,000.","This is not the first time the “PinkDrainer” scammer has been involved in such atrocious activities. Cyvers Alerts, a real-time security alert platform, recently reported a similar phishing scheme where a victim’s wallet was drained of $92,800 worth of Ethereum to the same “PinkDrainer” address.","🚨ALERT🚨Our system just detected #PinkDrainer phished and address at https:\/\/t.co\/WA1Jg18sbL","Victim lost $92.8K worth of $stETH.\nVictim: https:\/\/t.co\/NT0lpuIlPB\nScammer: https:\/\/t.co\/RdUNZJ1F7W\nFund are funneled to https:\/\/t.co\/hyH2yXD4Tmhttps:\/\/t.co\/hyH2yXD4Tm","Want to keep… pic.twitter.com\/1kbcI95PsK","— 🚨 Cyvers Alerts 🚨 (@CyversAlerts) May 9, 2024","","In December 2023, the same hacker group reportedly stole Chainlink (LINK) tokens worth $4.4 million by tricking users into authorizing transactions linked to the “IncreaseAllowance” function.","In Q4 of 2023, recurrent incidents of scammers impersonating reputable platforms and protocols to obtain transaction approvals and steal digital assets from unsuspecting users were widely reported.","A notable instance was the JPEG’d NFT protocol, where the community had to come out in October 2023 about multiple fraudulent platforms imitating its offerings in an attempt to obtain transaction approvals so they could scam users of their NFTs and digital assets.","","The crypto industry has been on the receiving end of enormous losses due to phishing attacks in the first two months of 2024.","According to Scam Sniffer data, an estimated 97,000 users have fallen victim to these sophisticated scams, resulting in a total loss of $104 million worth of cryptocurrencies. This was followed by its report that showed $46.86 million worth of crypto was stolen in February 2024.","The Ethereum ecosystem has been specifically targeted, with $78 million of the total losses coming from users’ Ether and ERC20 tokens being drained from their wallets.","Most of these funds were lost due to unsuspecting users signing malicious signatures, such as “ERC20 Permit” and “increaseAllowance,” which grant attackers unauthorized access to their assets.","Crypto News also reported in April 2024 that phishing campaigns were targeting users of Etherscan, with several advertisements being used for malicious operations.\nScam Sniffer’s analysis revealed that cybercriminals have been leveraging social media platforms, particularly X (formerly Twitter), to lure unsuspecting victims to phishing sites.","These hackers post deceptive comments under the X posts of targeted accounts in a way that impersonates their customer representatives and directs users to malicious websites where their assets are compromised.","While the losses in the first two months of 2024 are concerning, they represent only a fraction of the $300 million in total funds lost by users to crypto phishing attacks throughout 2023."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"6736","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"May 9, 2024","content":"DATE"},{"type":"$92.8","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"5:47 PM","content":"TIME"},{"type":"2100","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto News","content":"ORGANIZATION"},{"type":"$145,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$4.4 million","content":"MONEY"},{"type":"$stETH","content":"MONEY"},{"type":"the first two months of 2024","content":"DATE"},{"type":"$104 million","content":"MONEY"},{"type":"$46.86 million","content":"MONEY"},{"type":"$92,800","content":"MONEY"},{"type":"December 2023","content":"DATE"},{"type":"May 8","content":"DATE"},{"type":"May 9","content":"DATE"},{"type":"7531","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"$78 million","content":"MONEY"}],"hashtag":["BAYC","NFT","Phishing scams"],"authors":["Jimmy Aki"]}