{"summary":"Crypto Wealth Management Firm Abra Launches New Platforms for Private Clients","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-lender-abra-launches-new-platforms-for-institutional-and-private-clients.htm","publishDate":"2024-04-18T11:00:40","id":17419,"type":null,"title":"Crypto Wealth Management Firm Abra Launches New Platforms for Private Clients","category":["Blockchain News "],"content":["Crypto wealth management firm Abra said it has launched the “Abra Prime” and “Abra Private” platforms for private clients and received approval from the U.S. Securities and Exchange Commission to operate as an investment advisor.","In an announcement,  Abra said the Abra Private platform is aimed at providing a bespoke service for private clients, family offices and trusts, while Abra Prime’s client base includes hedge funds, venture capital, crypto infrastructure firms and other institutional investors.","The firm said the new services are the result of strong demand for bespoke digital assets solutions from wealthy clients.","The firm’s platform integrates over-the-counter (OTC) trading for both spot and options borrowing, lending, staking and yield services and asset management into one offering.","In other news, Abra said its subsidiary Abra Capital Management LP has been approved by the U.S. Securities and Exchange Commission to operate as a registered investment advisor.","“We launched Abra a decade ago as one of the first companies working to develop a novel type of borderless and trustless decentralized global payment infrastructure,” said Bill Barhydt, Founder and CEO of Abra, in the announcement.","The firm has have evolved significantly since then and leveraged that experience to create an integrated prime services and wealth management offering powered by DeFi expertise.","“As an SEC registered investment advisor we are excited for Abra’s next chapter, and we remain committed to building a future where financial services are digital, open and borderless,” adds Barhydt.","Big News! Today we're announcing the launch of Abra Private.","Targeted at high net worth individuals, family offices, corporate treasuries and non profits, this service is offered by our new SEC-registered investment advisor (RIA), Abra Capital Management (ACM). Abra Private…","— Abra (@AbraGlobal) April 17, 2024","","On June 15, 2023, the Texas State Securities Board (TSSB) issued an emergency cease and desist order, accusing Abra CEO Bill Barhydt and his company of committing securities fraud and engaging in deception regarding the sale of investment products.","In January, Abra has reached a tentative settlement with the Texas State Securities Board. According to a document published January 22, Abra agreed to reimburse the assets invested by the state’s residents.\n\nThe document highlighted that Abra had begun winding down its U.S. retail operations. Clients holding balances exceeding $10 received notifications, giving them seven days to withdraw their assets. Unclaimed funds will be converted to fiat currency and distributed to remaining investors in Texas.","With services such as Abra Earn and Abra Boost, the lending firm assured users of interest on their digital asset deposits. In return, the company generated profits by lending these funds."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"June 15, 2023","content":"DATE"},{"type":"Abra","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Texas State Securities Board","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Bill Barhydt","content":"PERSON"},{"type":"Abra Capital Management LP","content":"ORGANIZATION"},{"type":"Abra","content":"ORGANIZATION"},{"type":"January 22","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"Barhydt","content":"PERSON"},{"type":"Abra Capital Management","content":"ORGANIZATION"},{"type":"April 17, 2024","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["Securities and Exchange Commission"],"authors":["Tanzeel Akhtar"]}