{"summary":"Betterment&#x27;s crypto offering launched on Wednesday a few weeks after it was revealed Gemini would be handling custody for the robo-advisor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176513\/betterment-launches-crypto-product-for-customers-with-custody-by-gemini","publishDate":"2022-10-12T09:22:27","id":1741,"type":null,"title":"Betterment launches crypto product for customers with custody by Gemini","category":["COMPANIES"],"content":["Robo-advisor Betterment has launched crypto investment services for its 730,000 advisor and investor customers.","Through a <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/173040\/gemini-to-partner-with-financial-advisor-betterment-act-as-custodian-for-crypto-clients\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/173040\/gemini-to-partner-with-financial-advisor-betterment-act-as-custodian-for-crypto-clients\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">partnership<\/a> with Gemini, who will act as the crypto custodian for Betterment, customers can now invest in four separate crypto portfolios.","Betterment made its first move into the crypto space through the <a href=\"https:\/\/www.theblock.co\/linked\/133473\/crypto-focused-robo-advisor-makara-acquired-by-betterment\" data-v-f87c67ca=\"\">acquisition<\/a> of Makara in February. At the time Jesse Proudman, Makara co-founder and then CEO, said the company was developed to bring an easy and accessible long-term investing approach to cryptocurrencies.","Proudman sat down with The Block again this week, in his new role as VP of cryptocurrency at Betterment. He reemphasised the firm's desire to simplify access to the space, which he said can be \"complex and unapproachable\" at times.&nbsp;","Crypto by Betterment will allow users to opt-in to create separate accounts to invest in cryptocurrencies. The investment options include four portfolios, which are modelled on exchange traded funds, according to Proudman.","The portfolios include the Universe portfolio with exposure to BTC, ETH and LINK; the Sustainable portfolio includes ETH, MATIC, XTZ and SOL; a DeFi portfolio including AAVE, UNI and COMP; and finally the metaverse portfolio which has exposure to SAND and MANA.","These are examples of cryptocurrencies in the portfolios and are not an exhaustive list of the tokens available in each portfolio, the company said. Users can also customize portfolios by choosing to remove certain tokens before investing, Proudman added.&nbsp;","Users own the cryptocurrencies in the portfolios they invest in and Gemini handles the custody.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Makara","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jesse Proudman","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"}],"hashtag":["BITCOIN","GEMINI","POLYGON"],"authors":["Adam Morgan McCarthy","The Block"]}