{"summary":"The failed crypto lender’s CEO faces criminal charges, while the company itself now faces significant regulatory action on top of its ongoing bankruptcy. \nThe indictment and filings by federal regulators allege that Mashinsky and the company pumped the price of Celsius’s native token using customer assets and repeatedly misled their customers.","author":["Sarah Wynn","Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239432\/celsius-and-alex-mashinsky-face-slew-of-criminal-regulatory-allegations","publishDate":"2023-07-13T21:41:26","id":1741,"type":null,"title":"Celsius and Alex Mashinsky face slew of criminal, regulatory allegations","category":["Policy"],"content":["Alex Mashinsky and the company he founded and led face a battery of fraud-related accusations after criminal and civil charges were brought against the former Celsius CEO, and the company was named as co-defendant in civil enforcement cases brought by U.S. regulators.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The former CEO of the bankrupt crypto lender Celsius was charged by federal prosecutors in an indictment made public on Thursday, with allegations of multiple schemes to defraud his customers.&nbsp;<\/span>","The indictment and filings by federal regulators allege that Mashinsky and the company <span class=\"s1\" data-v-f87c67ca=\"\">pumped the price of Celsius’s native token using customer assets and repeatedly misled their customers. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission, Federal Trade Commission and Commodity Futures Trading Commission also <a href=\"https:\/\/www.theblock.co\/post\/239407\/sec-files-lawsuit-against-celsius-and-ex-ceo-alex-mashinsky\" data-v-f87c67ca=\"\">took<\/a> their own civil enforcement actions against Mashinsky and the company.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“<\/span><span class=\"s1\" data-v-f87c67ca=\"\">In sum and substance<\/span><span class=\"s3\" data-v-f87c67ca=\"\">, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Mashinsky portrayed Celsius as a modem-day bank<\/span><span class=\"s3\" data-v-f87c67ca=\"\">, <\/span><span class=\"s4\" data-v-f87c67ca=\"\">where <\/span><span class=\"s1\" data-v-f87c67ca=\"\">customers could safely deposit crypto assets and earn interest,\" prosecutors said in their indictment of the embattled former CEO and Roni Cohen-Pavon, the company's chief revenue officer.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In truth<\/span><span class=\"s3\" data-v-f87c67ca=\"\">, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">however<\/span><span class=\"s3\" data-v-f87c67ca=\"\">, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Mashinsky operated Celsius as <\/span><span class=\"s4\" data-v-f87c67ca=\"\">a <\/span><span class=\"s1\" data-v-f87c67ca=\"\">risky investment fund<\/span><span class=\"s3\" data-v-f87c67ca=\"\">, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">taking in customer money under false and misleading pretenses and turning customers into unwitting investors in a business far riskier and far less profitable than what Mashinsky had represented,\" they continued.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Celsius itself settled with the FTC for $4.7 billion, though b<\/span>ecause of the company's ongoing bankruptcy, the FTC agreed to suspend the payment to allow Celsius to maximize return of its remaining assets to customers. <span class=\"s1\" data-v-f87c67ca=\"\">Mashinsky and co-founders Shlomi Daniel Leon and Hanoch “Nuke” Goldstein” did not, meaning the agency will press forward with a civil case against them in court.&nbsp;<\/span>","“While lying to their customers to keep them from withdrawing their cryptocurrency deposits, Leon, Goldstein, and Mashinsky protected themselves by withdrawing significant sums of cryptocurrency from Celsius two months before the company filed for bankruptcy,” the FTC said in a <a href=\"https:\/\/www.ftc.gov\/news-events\/news\/press-releases\/2023\/07\/ftc-reaches-settlement-crypto-platform-celsius-network-charges-former-executives-duping-consumers\" data-v-f87c67ca=\"\">statement<\/a>. “Consumers subsequently lost access to their life savings, college funds, and money saved for retirement.”","The SEC and CFTC enforcement actions remain open despite the company's settlement with the FTC.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors and regulators said Mashinsky “made so many false and misleading statements” in live internet broadcasts that employees began reviewing the videos after they aired, at some points editing out “misrepresentations” after repeatedly warning Mashinsky that what he said wasn't true.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Mashinsky and the company are also accused of lying to customers and conducting business operations that contributed to the company's failure, including the issuance of over $1 billion in unsecured business loans despite public statements by Mashinsky to the contrary.&nbsp;<\/span>"],"hashtag":["CFTC","COURT HEARINGS","CRIME","CRYPTO BANKS AND LENDERS","FTC","SEC"]}