{"summary":"Bitcoin’s Market Cap Increased by a Peak of 172% in 2023 + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoins-market-cap-increased-by-a-peak-of-172-in-2023-more-news.htm","publishDate":"2023-12-20T15:15:38","id":17412,"type":null,"title":"Bitcoin’s Market Cap Increased by a Peak of 172% in 2023 + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","2023 has been an exceptional year for digital assets, with Bitcoin’s market capitalization increasing by a peak of 172%, according to on-chain analysis firm Glassnode.","Other digital assets have also had a strong year. Ethereum and the wider altcoin ecosystem have seen 90% growth in their market caps, the report said.","The market has broken above several important technical and on-chain pricing models this year. The rally since late October has been responsible for most of the gains.","Furthermore, digital assets have “significantly” outperformed traditional assets, including Equities, Bonds, and Precious Metals all year.","Regarding BTC, the deepest correction in 2023 closed just 20% below the local high. This suggests that buy-side support and the supply and demand balance have been favorable all year.","Bitcoin transaction volumes were relatively stagnant until October, supporting the notion that this was a market phase shift.","Exchange inflow and outflow volumes for BTC and ETH are picking up throughout the year, suggesting an expansion in spot trading interest.","Bitcoin transaction counts reached new all-time highs this year, largely due to the rise of Ordinals and Inscriptions.","Long-term holders currently hold a near all-time high of the bitcoin supply. Also, a super-majority of coins are now held in profit, whether due to changing hands, or by prices rallying above the cost basis.","Bitfinex Securities, alongside Mikro Kapital, announced the successful raise of $5,200,100 USDT of ALT2611 bonds on the Liquid Network.","The raise by ALTERNATIVE, a Luxembourg-based securitization fund managed by microfinancing firm Mikro Kapital, closed earlier this week.","Per the announcement, ALT2612 represents the first tokenized bond in the microcredit industry and one of the world’s first tokenized bonds.","This is Mikro Kapital’s debut issue of a tokenized bond, which has a 36-month tenor with a 10% coupon, denominated in USDT.","The bond was issued on the Liquid Network, a side-chain of the Bitcoin blockchain purpose-built for the issuance of assets like regulated security token offerings.","Earlier this quarter, Mikro Kapital and Bitfinex Securities signed an agreement to explore asset tokenization and the use of USDT and EURT within the microfinancing industry.","Gaming company Immutable announced the official launch of Immutable Passport inside games and marketplaces.","Per the press release, this “massively” simplifies the sign-up process for players by providing universal profiles that enable them to carry their identity, achievements, and digital assets across different online games and marketplaces.","This simple onboarding solution has already been integrated into five Web3 games and marketplaces: Gods Unchained, Blocklete Golf, Bleacher Report Watch2Earn, TokenTrove, and AtomicHub. These have a combined user base of over 500,000 people.","To celebrate the debut of Immutable Passport, Gods Unchained players who use this solution will receive a free NFT (in-game cosmetic item) airdrop.","Other launch partners include Bleacher Report Watch to Earn (B\/R W2E), which sits within the digital arm of Warner Bros, Warner Bros. Discovery. B\/R W2E is a loyalty program that leverages Web3 technology and utilizes rewards and real-time gamification.","Tokens.com Corp., a publicly traded company that builds Web3 businesses and owns an inventory of digital assets, announced the launch of Valor, a proprietary e-commerce platform within Metaverse Group that allows product placement and advertising within virtual gaming worlds, including Roblox and Fortnite.","According to the press release, Metaverse Group has spent the last year developing Helix Worlds, the technology that powers the Valor app.","Valor is designed as a loyalty program that enables clients to place branded products in games. Players use the app by scanning branded items and are redirected to the brand’s page to claim offers and earn points that are redeemable for rewards.","Valor is available for download on the Google Play Store and iOS App Store.","“The Valor app was developed to solve a key problem for brands who were looking to advertise in popular gaming platforms like Roblox and Fortnite where links and QR codes are not allowed,” said Andrew Kiguel, CEO of Tokens.com. It enables brands “to offer a shopping experience to players, without taking them out of the game flow and disrupting the environment with links and QR codes.”"],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Tokens.com Corp.","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Blocklete Golf","content":"ORGANIZATION"},{"type":"Metaverse Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Earlier this quarter","content":"DATE"},{"type":"Roblox","content":"PERSON"},{"type":"AtomicHub","content":"ORGANIZATION"},{"type":"Warner Bros","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$5,200,100","content":"MONEY"},{"type":"172%","content":"PERCENT"},{"type":"Google Play Store","content":"ORGANIZATION"},{"type":"Andrew Kiguel","content":"PERSON"},{"type":"Bitfinex Securities","content":"ORGANIZATION"},{"type":"EURT","content":"ORGANIZATION"},{"type":"Mikro Kapital","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["Apple","Bitcoin","Bitfinex","Ethereum","Gaming","Google","Investment","Market","USDT","Web3"],"authors":["Sead Fadilpašić"]}