{"summary":"Liquid Staking Solution Lido Winds Down Solana Staking Following Community Vote","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/liquid-staking-solution-lido-winds-down-solana-staking-following-community-vote.htm","publishDate":"2023-10-17T09:23:00","id":17423,"type":null,"title":"Liquid Staking Solution Lido Winds Down Solana Staking Following Community Vote","category":["Altcoin News "],"content":["Lido Finance, a decentralized liquid staking platform, is ending its Solana (SOL) operations after the DAO community voted in favor of sunsetting the Lido on Solana protocol.","Per Lido’s blog post on Monday, the process of shutting down Solana staking product will “begin shortly” phasing out.","“After much discussion and a vote by Lido DAO members, it was decided that the best course of action would be to wind down Lido on Solana.”","According to Lido’s community voting on Snapshot, 65 million of the Lido (LDO) holders voted in favor of sunsetting the Solana blockchain. Only 5.1 million said yes to providing funding for the protocol to sustain Lido on Solana.","The complete ceasing of the Solana operations will tentatively end by February 2024, the snapshot post revealed.","“Similar to the sunset of Lido on Kusama and Lido on Polkadot, a 100k DAI budget would be allocated to cover the sunset costs,” the platform said.","The move comes after Lido on Solana development team presented a proposal outlining the challenges and financial support needed from Lido DAO to sustain Lido on Solana.","The P2P contributor has sought 1.5 million DAI tokens to fund 12 months of operations citing unsustainable financials and the low amount of fees generated by Lido on Solana protocol.","The team noted that during 2022-2023, P2P invested in Lido on Solana project approximately $700,000, “mostly in development and support.” More losses were incurred amounting to $484,000 than profits which were around $220,000, the proposal added.","As a result, achieving even 2% of the market share in 2023-2024 seems improbable, in the current Solana market, the team noted.","“Considering the aforementioned information, we seek financial support from Lido DAO to sustain our efforts and elevate Lido on Solana to the next level.”","The team proposed the sunset process of Solana if financial support from Lido DAO is unavailable.","However, the Solana development team was optimistic that Lido on Solana could play a pivotal role in its growth and believed that the DAO community would collectively support the proposed financial backing.","“With the proposed financial backing, we can not only sustain our operations but also innovate, grow, and contribute more value to the Lido DAO and the broader Solana ecosystem,” the team anticipated."],"entity":[{"type":"$220,000","content":"MONEY"},{"type":"$484,000","content":"MONEY"},{"type":"Kusama","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"Lido on Solana","content":"LOCATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Lido DAO","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$700,000","content":"MONEY"}],"hashtag":["DAO","Solana","Staking"],"authors":["Sujha Sundararajan"]}