{"summary":"Cardano Price Prediction as ADA Takes a Tumble – Where is the Next ADA Support?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-prediction-as-ada-takes-a-tumble-where-is-the-next-ada-support.htm","publishDate":"2024-02-23T13:08:11","id":17428,"type":null,"title":"Cardano Price Prediction as ADA Takes a Tumble – Where is the Next ADA Support?","category":["News "],"content":["Cardano (ADA) has shed 3% overnight to trade at $0.5832 as of this writing.","The coin’s depreciation is part of a broader market pullback that has shaved 1% off market leader Bitcoin (BTC) and 2% from its closest contender, Ethereum (ETH), in the last 24 hours.","Cardano may be dipping this week, but it’s far off from the spiralling prices posted by other leading so-called “Ethereum killers”.","Solana’s SOL is down 8% over the last 7 days, while Avalanche’s AVAX is down 9.3%","By contrast, ADA’s 7-day depreciation hovers around 2.1%.","Looking at the chart, it’s clear that today’s pullback is not likely to result in any major short-term depreciation of Cardano’s price, which has found strong support around $0.54.","The cryptocurrency is currently trading marginally shy of its 30-day moving average of 59 cents, and with a Relative Strength Index of 45, it’s likely to hold the fort over the weekend without any unruly price swings either way.","Perhaps part of Cardano’s resilience this week, compared with its nearest rivals SOL and AVAX, is down to its creator’s activity on X.","Charles Hoskinson is both vaunted and criticized for his unfiltered feed, where he typically ventures his sometimes controversial opinions on other crypto projects and politics.","This week, he played the visionary CEO and protocol founder during his AMAs when he called on the online developer community to decentralize social media by rebuilding it on Web3.","Hoskinson took aim at fellow CEO and X owner Elon Musk, saying:","“I like Elon Musk, today he has a commitment to freedom of speech and expression. I’m not naïve enough to believe that it’s absolute. I’m not naïve enough to believe I’m always going to be on the right side. But the problem is that you live or die by whether he gets up on the left or right side of the bed.”","Cardano’s ADA is one of the industry’s safest altcoins. It’s not an opaque blockchain like Solana, so it doesn’t suffer frequent outages. It’s not in the middle of a legal quagmire with regulators like Binance or Ripple.","That means it’s not frittering away resources defending itself and having its image scrutinized. Finally, it doesn’t face the same accusations as Ava Labs. The AVAX progenitors allegedly use corrupt lawyers and vast troll bot armies to weaken competitors.","But one thing ADA can’t do as well as other tokens is Bitcoin mining. Enter Bitcoin Minetrix (BTCMTX), a promising project that has raised over $11.3 million in an ongoing presale from excitement over its utility alone.","Wanna mine Bitcoin but don’t want to buy the energy-intensive hardware for it?","Bitcoin Minetrix has got you.","The protocol uses Ethereum smart contracts to turn investors’ BTCMTX tokens into cloud mining machinery. There is no need to purchase specialist mining rigs. Simply buy and stake BTCMTX via the website.","The more BTCMTX tokens an investor stakes, the more cloud mining credits they’ll receive.","Mining credits represent hash power.","The greater the hash power, the more attempts the cloud Bitcoin mining software can make to break cryptographic puzzles and validate blocks of transactions.","This is the process of mining, and it is rewarded in Bitcoin.","The staked BTCMTX also generates yields in BTCMTX, further fuelling the staking\/mining cycle.","Only 2 days remaining until the conclusion of Stage 27 for #BitcoinMinetrix!","How do mining hardware advancements impact the landscape of #Bitcoin mining? 💻⛏️ pic.twitter.com\/sfM36jAx9K","— Bitcoinminetrix (@bitcoinminetrix) February 23, 2024","","With miners’ rewards set to halve on April 19, investors may want to get in early. It’s currently priced at $0.0136, but this is due to rise in two days.","Buy Bitcoin Minetrix Here",""],"entity":[{"type":"Hoskinson","content":"PERSON"},{"type":"last 24 hours","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"weekend","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"$0.5832","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2.1%","content":"PERCENT"},{"type":"February 23, 2024","content":"DATE"},{"type":"$0.54","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"$11.3 million","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"9.3%","content":"PERCENT"},{"type":"$0.0136","content":"MONEY"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"59 cents","content":"MONEY"},{"type":"this week","content":"DATE"},{"type":"BTCMTX","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ADA","bitcoin minetrix","Cardano"],"authors":["Tim Hakki"]}