{"summary":"Chainlink Launches ‘Transporter’ App for Moving Crypto Cross-Chain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chainlink-launches-transporter-app-for-moving-crypto-cross-chain.htm","publishDate":"2024-04-11T16:45:08","id":17420,"type":null,"title":"Chainlink Launches ‘Transporter’ App for Moving Crypto Cross-Chain","category":["News "],"content":["Chainlink, a leading provider of data feeds to blockchain-based smart contracts, has released a new application dubbed the transporter for submitting and monitoring cross-chain transactions.","In an announcement, Chainlink said the application is built using its Cross-Chain Interoperability Protocol (CCIP) – the standard for cross-chain interoperability. ","The firm went on to describe the new Transporter application as a “hyper-secure bridging Aapp” — explaining it is built on Chainlink CCIP to bring “unprecedented security” to users wanting to transfer tokens across blockchains.","The Transporter app allows users to transfer tokens across a variety of blockchains, starting with Arbitrum, Avalanche, Base, BNB Chain, Ethereum, Optimism, Polygon, and WEMIX.","“Transporter makes it easier to utilize the security benefits of Chainlink CCIP for the transfer of large token value and critical messages across chains,” said Sergey Nazarov, co-founder of Chainlink in a press release.","“Having a secure way to move both value and data across chains is something the blockchain industry has needed for years and I’m excited that Transporter is making that more accessible,” said Nazarov.","Chainlink said it has also unveiled a new token transfer mechanism for CCIP, which allows native ETH to be transferred cross-chain through WETH token pools.","“This marks the first instance of a lock and unlock mechanism being implemented in CCIP,” said the firm.","According to Chainlink, the Transporter application is built to give users complete peace of mind by offering an intuitive UI, and 24\/7 global support. The application has a visual tracker that provides real-time visibility into the state of their cross-chain transactions. ","Transporter allows users to track their assets and messages at every step of the transaction, both on the Transporter app and through the Chainlink CCIP Explorer.","Chainlink said the new application doesn’t charge additional fees, just the regular fees for using CCIP, which cover the gas costs of completing transactions on the destination chain and the fees paid to CCIP service providers.","Venture capital firms Fourth Revolution Capital and Moonrock Capital are two early users of the Transporter application, said Chainlink."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"Fourth Revolution Capital","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Nazarov","content":"PERSON"},{"type":"Sergey Nazarov","content":"PERSON"},{"type":"Moonrock Capital","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Chainlink","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ChainLink","Cross-Chain","Transporter"],"authors":["Tanzeel Akhtar"]}