{"summary":"Captain Kirk Goes Crypto Collectible with Shatner-WAX Partnership","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/captain-kirk-goes-crypto-collectible-with-shatner-wax-partne-7295.htm","publishDate":"2020-07-31T11:10:13","id":17425,"type":null,"title":"Captain Kirk Goes Crypto Collectible with Shatner-WAX Partnership","category":["Blockchain News "],"content":["Cryptonews.com boldly goes where (almost) no crypto media outlet has gone before to bring you news of William Shatner and his adventures with blockchain technology.","Iconic actor Shatner played Captain James Kirk in the hit TV series Star Trek, a role that won him cult status among the franchise’s legions of fans.","The show’s unwavering popularity is largely powered by its dedicated fandom, famous for hoarding collectible Star Trek-themed items. So perhaps it was only a matter of time before somebody made the blockchain connection.","And that somebody has turned out to be the operators of the WAX blockchain network and the Worldwide Asset eXchange, who partnered with the actor famous for playing the skipper of the Starship Enterprise for a series of Shatner-themed blockchain-based trading cards powered by non-fungible tokens (NFTs).","WAX’s move has already seen some 10,000 bundles of Shatner cards sell out within just nine minutes following their release on July 30, the operator said.","Close to 125,000 digital cards were issued on the WAX blockchain, generating some USD 110,000 worth in sales, said Evan Vandenberg, Wax’s Director Of Business Development.","In a tweet, Vandenberg suggested that the cards were already hot property among Star Trek fans.","He wrote,","“Secondary market sales are now booming. More proof that NFTs are the future of trading cards and collectibles.”","Shatner also took to Twitter to state that the “cards represent a small glimpse into an incredible future.”","Indeed, secondary sales of the cards are now taking place at a number of collectibles marketplaces, with trading platform Myth Markets tweeting that an ultra-rare golden ticket card featuring Shatner recently attracted a record bid of WAX 25,000, or USD 1,290, making it the most expensive card for series 1 of the Shatner collection to date.","The card features the actor’s headshot, along with Shatner’s signature, and can be redeemed for a physical, autographed headshot.","Other Shatner-themed digital collectibles show the actor hugging Leonard Nimoy, the late actor who played Spock in the original Star Trek series. Another card shows Shatner celebrating the birth of his daughter.","WAX says the latest NFT sale is the third record-breaking event on its blockchain platform since May 2020. As of July 31, WAX has a total of 509,348 registered accounts and 18,213 WAX wallet holders, the operator stated.","WAX will doubtlessly be hoping its latest NFT offering will help it live long and prosper."],"entity":[{"type":"James Kirk","content":"PERSON"},{"type":"July 30","content":"DATE"},{"type":"May 2020","content":"DATE"},{"type":"July 31","content":"DATE"},{"type":"Vandenberg","content":"ORGANIZATION"},{"type":"Spock","content":"PERSON"},{"type":"Leonard Nimoy","content":"PERSON"},{"type":"Starship Enterprise","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"William Shatner","content":"PERSON"},{"type":"Shatner","content":"PERSON"},{"type":"Evan Vandenberg","content":"PERSON"},{"type":"Wax’s Director Of Business Development","content":"ORGANIZATION"}],"hashtag":["Adoption","Blockchain","Entertainment","Non-fungible tokens"],"authors":["Jaroslaw Adamowski"]}