{"summary":"Post ​​Bitcoin Halving Miners See Temporarily Higher Fees: CryptoQuant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/post-bitcoin-halving-miners-see-temporarily-higher-fees-cryptoquant.htm","publishDate":"2024-04-25T03:10:33","id":17429,"type":null,"title":"Post ​​Bitcoin Halving Miners See Temporarily Higher Fees: CryptoQuant","category":["Bitcoin News "],"content":["Since the fourth Bitcoin halving took place resulting in Bitcoin issuance dropping from 900 to 450 per day miners have seen daily revenue hit a record high of over $100 million, said CryptoQuant the on-chain data analytics firm based in South Korea.","In its weekly research note, CryptoQuant said the spike in revenues was the result of record-high transaction fees of $80 million or 1,252 Bitcoin – representing 75% of total miner revenue that day.","The issuance of new Bitcoin per block has been cut in half to 3.125 Bitcoin. This implies that only 450 new Bitcoins will be issued per day on average, compared to 900 Bitcoins before the recent halving.","The data analytics firm highlights that daily revenue initially spiked to $100 million on halving day. Miner revenue has since declined to around $50 million. This represents a 35% decline in daily revenues from record-high levels before the halving of about $78 million.\n\n","CryptoQuant said the reason why miner daily revenue increased despite lower Bitcoin issuance was due to a spike in Bitcoin transaction fees to the highest daily level on record. Daily fees at halving day totalled 1,258 Bitcoin, a record high. However, fees have declined to similar levels previous to the halving.","It is still too early to see any long-term effects of the halving on the network hashrate, miners seem to be running operations at the same rate as before the halving. The total network hashrate has remained flat to slightly higher at a rate of 617 EH\/s, said CryptoQuant.","Hashrates are how many hashes an entity generates per second. It can indicate how popular a cryptocurrency is, but it also tells you how powerful your mining competitors or peers are. The more computing power dedicated to a given crypto miner or pool, the more chance it has of winning the reward. [Investopedia]","High network hashrate and lower miner revenues after the halving day have pushed down hashprice for miners. The price is now at $0.07 per TH\/s, the lowest since October 2023, adds CryptoQuant.","Before the 2024 halving Bitcoin experienced a rally. Since the beginning of the year alone, Bitcoin’s price surged by 52%, and over the past twelve months, it recorded an impressive 134% increase. The cryptocurrency reached a preliminary peak of its rally on March 13, 2024, setting a new record high at $73,605. "],"entity":[{"type":"CryptoQuant","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"March 13, 2024","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"52%","content":"PERCENT"},{"type":"134%","content":"PERCENT"},{"type":"$73,605","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"$78 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"$0.07","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Bitcoin halving","crypto fees","CryptoQuant"],"authors":["Tanzeel Akhtar"]}