{"summary":"Revolut To Roll Out “Invite-Only” Crypto Exchange","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/revolut-to-roll-out-invite-only-crypto-exchange.htm","publishDate":"2024-02-16T20:48:35","id":17436,"type":null,"title":"Revolut To Roll Out “Invite-Only” Crypto Exchange","category":["Blockchain News "],"content":["Banking services provider Revolut is set to debut a new “invite-only” crypto exchange, according to a February 16 report.","A U.K.-based customer email confirmed by CoinDesk stated that Revolut is launching a new crypto exchange with advanced traders in mind.","“You’ll find deeper analytical tools and lower fees than the app,” the company’s email said, with CoinDesk reporting fees between 0.9% and 0.09%.","“We always develop new products and functionalities, desired by our customers or asked by the market,” Revolut told Cryptonews. “The standalone cryptocurrency exchange is one of the future developments, but more information will be released only when the product will be available in-app.”","“Currently, this product is accessible by invite only, we will be rolling this out and inviting more customers to take part,” the company explained.","Prior to Revolut’s latest venture, the company suspended crypto purchasing services in the UK following heightened digital asset regulations from the Financial Conduct Authority (FCA).","“These requirements aim to enhance the customer journey and provide additional protection for new and existing investors of crypto assets,” Revolut stated in a December email. “As a result, we’ll need to adjust our current Business crypto offering to make sure all of the new requirements are met.”","Similarly, in August 2023, the digital bank shuttered its cryptocurrency services altogether for U.S. customers, citing regulatory concerns.","“As a result of the evolving regulatory environment and the uncertainties around the crypto market in the U.S., we’ve taken the difficult decision, together with our U.S. banking partner, to suspend access to cryptocurrencies through Revolut in the U.S.,” Revolut said in a statement at the time.","Earlier this week, however, the company announced that the Solana-based meme coin, Bonk, will begin trading on its platform, prompting a 15% spike in the coin’s value.","🚨 JUST IN: Revolut steps up its game, announcing a new exchange platform for 'Advanced Traders' with deep analytics and competitive fees. A strategic move for crypto enthusiasts seeking a robust trading environment. #RevolutCrypto #Fintech #CryptoNews pic.twitter.com\/xs8VescNwC","— Ryù (@Ryu_Tenchi) February 16, 2024","","Meanwhile, members of the crypto community took to X to respond to the news with varying opinions.","“The launch of a cryptocurrency exchange targeting ‘advanced traders’ is a bold move,” one user posted to X. “It’ll be interesting to see how they cater to this specific market segment.”","“@RevolutApp has fees that only attract boomers…real traders will never go to them,” another user posted.","It is currently unclear which customers will have access to the exchange or when an expected release date will be confirmed."],"entity":[{"type":"February 16","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"August 2023","content":"DATE"},{"type":"0.9%","content":"PERCENT"},{"type":"U.K.","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"February 16, 2024","content":"DATE"},{"type":"Revolut","content":"PERSON"},{"type":"Bonk","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"0.09%","content":"PERCENT"}],"hashtag":["Crypto Exchange","Crypto Regulation","Revolut"],"authors":["Julia Smith"]}