{"summary":"Is The Bull Market Over Before The Bitcoin Halving? Glassnode Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-halving-bull-market-glassnode.htm","publishDate":"2024-04-19T23:21:11","id":17437,"type":null,"title":"Is The Bull Market Over Before The Bitcoin Halving? Glassnode Report","category":["Bitcoin News "],"content":["Bitcoin’s latest price dip to under $60,000 has raised questions as to whether the asset’s spectacular bull run this year could be ending earlier than expected.","Lead Glassnode analyst James Check, however, says bull have very little to worry about.","In a video analysis posted on Friday, Check reviewed various on-chain metrics concerning short-term Bitcoin holders, who first acquired their coins less than five months prior.","Firstly, Bitcoin’s short-term holder MVRV ratio is now re-approaching 1.0, meaning its unrealized profit and loss have reached a break-even point. This level can serve as support after a bull market dip, but also major resistance during bear markets when most Bitcoin holders are underwater.","“Little undercuts are good,” said Check. “In 2023 we had several of these retests. If we assume this is a resilient uptrend, we should expect the short-term holder cost basis to hold, somewhere in that $58,000 to $59,000 region. “","Similarly, short-term holder SOPR has also recently dipped beneath 1.0, meaning that short-term holders are now beginning to realize more losses than profits. Should SOPR fall significantly under this level without resurfacing, it may be a sign of a sustained bear market to come.","As of this week, short-term holders realized losses have spiked substantially – a sign that new buyers were panic selling at a loss amid news of rising conflict between Iran and Israel.","“This is essentially what you do want to see, as a contrarian,” Check added. “As a contrarian, you kind of want to see people doing the wrong thing at the wrong time.”","Days ago, Check noted that Bitcoin’s price may transition into being “top-heavy” if its price moves below $58,800. The asset trades for $64,000 at writing time.","Other metrics like the AVIV momentum indicator suggest that Bitcoin price momentum remains positive on longer time frames, merely experiencing a cooldown on the 30-day timeframe for a “proper reset.”","The AVIV Momentum indicator also remains in positive territory, with all timeframes hitting higher altitudes on each successive peak.","A cooldown is underway on the faster 30-day indicator, which is what we want to see for a proper reset.https:\/\/t.co\/hk4UJ1FZ7x pic.twitter.com\/aSDhff53AM","— _Checkmate 🟠🔑⚡☢️🛢️ (@_Checkmatey_) April 18, 2024","","Regarding the Bitcoin halving itself, Check believes its financial impact may be overhyped. Compared to Bitcoin futures volume, spot volume, and ETF trade volume, the daily BTC issued to miners is a tiny fraction of the market.","“The size of the halving, is a narrative game more than it is in terms of size now… it’s just very very small,” he said."],"entity":[{"type":"April 18, 2024","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"$58,000","content":"MONEY"},{"type":"$59,000","content":"MONEY"},{"type":"Israel","content":"LOCATION"},{"type":"James Check","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$58,800","content":"MONEY"},{"type":"Iran","content":"LOCATION"},{"type":"$64,000","content":"MONEY"}],"hashtag":["Bitcoin halving","bull market"],"authors":["Andrew Throuvalas"]}