{"summary":"CoinDesk has formally joined the legal proceedings between Tether and the NYAG over the release of company documents to the news outlet.\nThe case centers on a FOIL request CoinDesk made for documents detailing Tether reserve breakdowns, which was initially denied but then was overturned in an appeal.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129602\/coindesk-formally-joins-tether-freedom-of-information-case-in-new-york-tether-responds","publishDate":"2022-01-07T17:27:17","id":1743,"type":null,"title":"CoinDesk formally joins Tether Freedom of Information case in New York, Tether responds","category":["Legal"],"content":["CoinDesk has formally joined the legal proceedings between Tether and the New York Attorney General in a case centering on the release of company documents to the news outlet.","The conflict dates back to June of last year, when CoinDesk filed a Freedom of Information Law request, or FOIL, in New York requesting documents detailing Tether's reserve breakdown, which the stablecoin issuer and its parent company iFinex provided to the NYAG <a href=\"https:\/\/www.theblockcrypto.com\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">as part of a settlement agreement<\/a> in February. New York's Freedom of Information Law allows members of the public to submit requests for access to government records, including court documents.","The NYAG FOIL officer denied the request after a push from Tether's attorneys. However, CoinDesk won access on an appeal.","Tether then attempted to block CoinDesk's access to the documents it requested by <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116170\/tether-asks-court-to-block-request-by-coindesk-for-nyag-disclosure-documents\" data-v-f87c67ca=\"\">asking a New York court<\/a> to compel the state attorney general to deny the request on the grounds that the information would compromise its competitive edge.&nbsp;","As the battle over the disclosures continues, CoinDesk has now <a href=\"https:\/\/www.scribd.com\/document\/551025476\/Stipulation-and-Proposed-Order-Tether-Petition\" data-v-f87c67ca=\"\">formally joined<\/a> the legal proceedings, arguing for the denial of Tether's petition to block access to the documents. Parties may \"intervene\" in a case if they are not originally named but have stake in the outcome of that case. It allows them to present their own arguments within the case.","In CoinDesk's <a href=\"https:\/\/www.scribd.com\/document\/551025260\/Memorandum-of-Law-by-CoinDesk-in-Tether-Petition\" data-v-f87c67ca=\"\">memorandum<\/a>, the news outlet claimed Tether's petition should be denied, firstly because the firm has not met its burden to claim an exemption, but more importantly because the public interest outweighs any competitive interest Tether might claim.&nbsp;","\"Petitioners have expressly committed to the OAG and the public to be transparent as to the extent to which Tether is backed by reserves and the composition of such reserves, on which they have a documented history of misleading the public,\" said the filing.","It went on: \"Yet Petitioners continue to treat the public with disdain, and this is now extended to CoinDesk, the OAG and this proceeding, as one of TOL's top executives recently tweeted a crude, juvenile meme mocking CoinDesk's Request. Petitioners' evasion of public accountability must end.\"","The Block had filed FOIL requests similar to CoinDesk's, to which a FOIL officer responded that the requests could be exempt from the disclosure allowances based on a law that allows an agency to deny access to information disclosed to a public agency if that information contains \"trade secrets.\" Tether contends that the requested information would compromise its investment strategy, which it considers a trade secret. Additionally, it claims information in the documents could compromise partner relationships.&nbsp;","For its part, CoinDesk has said that it is only interested in the documents detailing the breakdown of Tether's reserves, which wouldn't compromise the trade secrets or relationships Tether is referencing. Additionally, Tether has already committed to making the reserve breakdown public, argues CoinDesk.&nbsp;","In a <a href=\"https:\/\/tether.to\/tether-asks-court-to-protect-confidential-information-of-private-companies\/\" data-v-f87c67ca=\"\">response<\/a> to CoinDesk's intervention, Tether pointed out that the FOIL officer initially agreed with its request to block the release, and argued that the appeal overturning that decision occurred \"without any meaningful explanation.\"","It also pointed out that CoinDesk shares an investor, Digital Currency Group, with issuer of the USDC stablecoin, Circle. Tether claims that Circle constitutes a competitor to Tether, and that CoinDesk's coverage does not disclose DCG's investment to readers.&nbsp;","\"Weaponizing the media does a disservice to the ecosystem,\" Tether said in a statement. \"Tether welcomes healthy competition in the space but not when others do so without truth, honour, and respect.\"","Today, CoinDesk <a href=\"https:\/\/www.coindesk.com\/policy\/2022\/01\/04\/coindesk-joins-court-case-seeking-access-to-nyag-tether-documents\/\" data-v-f87c67ca=\"\">updated<\/a> its Jan. 4 article on its intervention in the legal case with an \"automatic disclosure\" of DCG's investment."],"hashtag":["TETHER"]}