{"summary":"Pepe Coin Price Prediction as PEPE Hits New All-Time High – Can PEPE 100x From Here?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pepe-coin-price-prediction-as-pepe-hits-new-all-time-high-can-pepe-100x-from-here.htm","publishDate":"2024-05-14T11:41:28","id":17433,"type":null,"title":"Pepe Coin Price Prediction as PEPE Hits New All-Time High – Can PEPE 100x From Here?","category":["Price Predictions "],"content":["PEPE has hit a new all-time high in the past couple of hours, with the Pepe Coin price currently sitting at $0.00001039 and enjoying a 19% gain today.","The meme token’s current price also represents a 23% gain in a week and a hefty 92% increase in a month, with its price benefitting from the return of legendary meme-stock trader Roaring Kitty to X.","pic.twitter.com\/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","And with PEPE also up by 440% in a year, it has strong enough momentum to continue rising for the foreseeable future.","It could potentially continue breaking its current ATH over the next few days, particularly if Roaring Kitty’s return does instigate a big bull run for meme tokens.","PEPE’s indicators are definitely looking bullish right now, with its 30-day average (orange) racing ahead of its 200-day (blue).","Its relative strength index (purple) also shot above 80 yesterday evening, and while it has declined a little, its position remains high.","In other words, the momentum is still there, with PEPE’s rising resistance (red) and support (green) levels also pointing towards further gains in the near term.","What’s particularly bullish is that whales have been buying the meme coin in the past day, indicating an expectation that PEPE will continue to build on its gains.","As the tweet below shows, PEPE has seen big purchases during its current run, which is encouraging insofar as you’d expect the whales concerned to hold onto the token for a little while longer at least.","This guy spent 1.86M $USDC to buy 195B $PEPE 12 hours ago and has now made an unrealized profit of $236K.https:\/\/t.co\/TSngBKN2yC pic.twitter.com\/Oszxx3nIO2","— Lookonchain (@lookonchain) May 14, 2024","","Also positive is the aforementioned return of Keith Gill, who under the alias Roaring Kitty led the infamous 2021 GameStop rally and helped spearhead the whole meme-stocks movement.","His return may indicate a renewed impetus for that movement, something that could help meme tokens such as PEPE continue to climb to new heights.","However, retail investors should be cautious that Gill’s return doesn’t necessarily mean we’re going to have a new GameStops phenomenon in the coming months.","Roaring Kitty, aka as Keith Gill, who posted extensively before and during GameStop, $GME's run in 2020-2021, tweeted 11 times yesterday.","— unusual_whales (@unusual_whales) May 14, 2024","","Also, with PEPE reaching a new all-time high today, traders should also be wary that it may correct a little before it rises again.","As such, they may prefer to hold off from buying PEPE today and wait for a dip, since the coin has actually declined by 3% in the past hour.","Yet once this minor correction has ended, the Pepe Coin price could reach $0.000011 or $0.000012 in the next week or so.","While PEPE is probably the strongest major meme token in the market at the moment, there are numerous newer meme coins that could outperform it in the coming weeks.","This includes various presale tokens that have been attracting investors as they prepare to launch, with Sealana (SEAL) – a Solana-based meme token – being one of the most promising.","It has raised more than $750,000 in its token offering and is on course to hit $1 million soon, such is the growing investor interest in the token.","#Sealana's throwing a raging frat party for the OG $SEAL Alphas as the #Presale cruises towards the $1m mark. 🦭🚀","The bros are there, the beers are cold, and the babes are en route.🇺🇸🍻","Missed the invite?📩 Looks like you haven’t bagged enough $SEAL to make the cut.💰 Join the… pic.twitter.com\/riLSZCqfkB","— Sealana (@Sealana_Token) May 13, 2024","","It’s clear that the market’s appetite for meme coins – particularly Solana-based coins – remains very strong and that SEAL is benefitting from this.","It has chosen a distinct meme for itself, adopting a bumbling seal as its mascot, who represents the widespread desire among retail traders to make a quick buck via crypto.","One other bullish feature of SEAL is that it has recently announced an Ethereum version of its token, making it a multi-chain meme coin.","This should help boost demand for the coin, with investors able to join its sale by visiting the official Sealana website.","They can buy SEAL by sending SOL to the following address: DJ15ZYXqUNMYJ3hL7z4ciSaSFAw5cbos3YjGpdvwmF6c.","The token is available at an exchange rate of 1 SOL for 6,900 SEAL, which converts to $0.021.","","Given that meme tokens look ready to continue outperforming the market for the foreseeable future, SEAL is likely to eclipse such a price once it lists.","Buy SEAL Today",""],"entity":[{"type":"Keith Gill","content":"PERSON"},{"type":"92%","content":"PERCENT"},{"type":"Today","content":"DATE"},{"type":"$SEAL","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"Pepe Coin","content":"PERSON"},{"type":"$0.000012","content":"MONEY"},{"type":"GME","content":"ORGANIZATION"},{"type":"$1m mark","content":"MONEY"},{"type":"$0.000011","content":"MONEY"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"$USDC","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"$0.021","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"$0.00001039","content":"MONEY"},{"type":"$PEPE","content":"MONEY"},{"type":"$236K","content":"MONEY"},{"type":"80 yesterday evening","content":"TIME"},{"type":"440%","content":"PERCENT"},{"type":"Gill","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"May 13, 2024","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$750,000","content":"MONEY"}],"hashtag":["Meme Coins","Pepe","Price Prediction"],"authors":["Simon Chandler"]}