{"summary":"LayerZero Airdrop Snapshot Completed: ZRO Token Coming Soon","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/layerzero-airdrop-snapshot-completed-zro-token-coming-soon.htm","publishDate":"2024-05-03T22:15:42","id":17430,"type":null,"title":"LayerZero Airdrop Snapshot Completed: ZRO Token Coming Soon","category":["Altcoin News "],"content":["In a major step towards launching its native token, ZRO, cross-chain interoperability protocol LayerZero successfully completed its first airdrop snapshot on May 1. The snapshot marks a crucial stage in the protocol’s development and has generated considerable excitement within the DeFi community.","LayerZero Labs confirmed the completion of the airdrop snapshot via an X post on May 2. The snapshot will determine the allocation of ZRO tokens to eligible participants upon the official launch, expected to occur in the first half of 2024.","More information coming soon. pic.twitter.com\/NyMpJFVg9S","— LayerZero Labs (@LayerZero_Labs) May 2, 2024","","“LayerZero will have a native token within the protocol, and its distribution is expected to happen in the first half of 2024,” the announcement read.","Anticipation for the ZRO token launch is already evident, particularly on decentralized exchanges. On Hyperliquid, the world’s largest perps DEX, a perpetual futures contract for ZRO is currently trading at $8.4. This suggests a fully diluted valuation of approximately $17 billion for the forthcoming token.","While the LayerZero airdrop presents an opportunity for the protocol and its community, it raises concerns about the potential impact of Sybil users. These individuals claim airdrops with multiple cryptocurrency wallets solely to sell the rewards without any intention of long-term engagement with the protocol. This practice can lead to a sharp decline in the price of the newly airdropped token following its launch.","Several past airdrops have been affected by airdrop hunters. In February, it was revealed that the eligibility list for Starknet’s airdrop was predominantly composed of Sybil users, with 701,544 addresses out of 1.3 million linked to their activity. Similarly, in March 2023, 1,496 wallets belonging to airdrop hunters accumulated over $3.3 million worth of tokens from the Arbitrum (ARB) airdrop, contributing to a subsequent price decline."],"entity":[{"type":"May 1","content":"DATE"},{"type":"May 2, 2024","content":"DATE"},{"type":"$3.3 million","content":"MONEY"},{"type":"May 2","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$17 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"the first half of 2024","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"$8.4","content":"MONEY"}],"hashtag":["Brian Pellegrino","DeFi","LayerZero"],"authors":["Thomas Musgrave"]}