{"summary":"The plaintiff sued Bitcoin Market, LLC, in late 2018, claiming he was owed 75 BTC in damages\nBitcoin Market, LLC, never answered or moved to dismiss, triggering a default judgment\nWhile usually this would trigger a decision in the plaintiff’s favor, the Court ruled the  plaintiff wasn’t entitled to damages for lack of access to his bitcoin because that wasn’t foreseeable at the time of contracting","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33547\/bitcoin-default-judgment-benefits-from-bull-market-worth-more-today-than-in-march","publishDate":"2019-07-28T09:30:31","id":1744,"type":null,"title":"Bitcoin default judgment benefits from bull market, worth more today than in March","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] <\/strong><strong class=\"jj ka\" data-v-f87c67ca=\"\">Smoak v. 1 Bitcoin Mkt., 2019 U.S. Dist. LEXIS 123336 (D.W.D.Ok., CIV-18–1096-PRW, 7\/24\/2019) [SDP]<\/strong><\/em>","If you get sued and legally served with process, the Court will enter something called a default judgment against you. The idea is that you have sufficient notice of claims and can’t be bothered to defend against them, you’ll be found liable and you’ll end up with a judgment against you. While liability is one thing, damages are another, and as this case shows, the plaintiff doesn’t always get everything they want.","Plaintiff sued Bitcoin Market, LLC, and Dustin and Tiffany Dollar in late 2018. They never answered or moved to dismiss. Plaintiff says he is owed damages in the amount of 75 bitcoin, “the value of his lack of access to his bitcoin, $1,000 and his attorneys’ fees and costs.”","The Court held an evidentiary hearing on plaintiff’s default judgment and held that he is entitled to damages “in the amount of $723,143.50. This award is based on the following calculations: (1) the value of 75 bitcoin as of the date of entry of judgment (75 x $9,628.5810); plus (2) $1,000.00 representing the amount Plaintiff transferred to be held in his Bitcoin Market account.” To determine the value of bitcoin on that date, the Court averaged prices from CEX-IO and Coinbase, which were $9,627.70 and $9,629.46, respectively.","The Court said that plaintiff wasn’t entitled to damages for lack of access to his bitcoin because that wasn’t foreseeable at the time of contracting. Also, plaintiff wasn’t entitled to attorneys fees and costs because there’s no statutory right to them and plaintiff didn’t identify a contract provision that established this entitlement. (As a general rule, the prevailing party in U.S. litigation doesn’t get reimbursed for attorney’s fees absent a statute or contract that awards ’em — this is known, fittingly, as “the American Rule.”)","It’s kind of interesting that the Court selected the date of the default judgment as the date to fix damages. I suppose it’s good fortune that the default and damages were calculated in July of this year instead of March.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}