{"summary":"Metamask Amasses 1M Active Monthly Users & Enters Altcoin Swaping Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/metamask-amasses-1m-active-monthly-users-enters-altcoin-swap-7907.htm","publishDate":"2020-10-06T16:00:00","id":17444,"type":null,"title":"Metamask Amasses 1M Active Monthly Users & Enters Altcoin Swaping Market","category":["Ethereum News "],"content":["Major Ethereum (ETH) wallet and Web 3.0 browser MetaMask has announced a new token swap feature as the wallet just surpassed the 1 million monthly active users milestone.","The ConsenSys-owned wallet\/browser has revealed their MetaMask Swaps, a feature that enables users to compare and swap tokens directly within MetaMask – rather than navigating a series of decentralized exchanges or aggregators, which offer different sets of tokens at different prices, said the emailed press release.","The feature is available only to users of the MetaMask extension on the Firefox browser for now, but the team said it “will be rolled out soon” to other browsers and MetaMask Mobile as well.","“The feature fetches quotes across multiple decentralized liquidity sources,” they added. “Since each aggregator interacts with a number of different liquidity sources, each source holds a limited amount of liquidity. By fetching orders from multiple aggregators, such as Uniswap, Airswap, Kyber, 0x API, 1inch.exchange, dex.ag, Paraswap, Totle, and private market makers, MetaMask will access the most liquidity across the DeFi ecosystem,” it claimed.","Additionally, this “ensures that every MetaMask user has access to all available tokens in DeFi,” and is further meant to bring lower fees and fewer approvals.","To integrate these decentralized exchanges (DEXs) and DEX aggregators, MetaMask collaborated with ConsenSys Codefi (a blockchain application suite).","Meanwhile, MetaMask said that it is now “supporting over one million monthly active users across our desktop and mobile apps,” which is more than 400% compared to May of 2019. The chart below indicates that the growth curve accelerated approximately in June this year.","This number is probably the best measure we have of real and non-duplicate users of the Ethereum chain, according to Anthony Sassano, SetProtocol product marketing manager and author of the Ethereum-focused newsletter The Daily Gwei.","“Though, it’s actually very difficult to measure the real user numbers since a user can have multiple addresses that they use to interact with apps on-chain (and many do). That’s why MetaMask’s numbers are so important – the number of people who would have duplicate MetaMask accounts that they are actively using each month is probably very low. On top of this, even if we say that a user is actively using both the desktop and mobile versions of MetaMask, we would still get a number of 500,000 monthly active users,” he wrote in his newsletter today.","As for the reasons behind this growth, the team highlighted: the recent launch of MetaMask Mobile; their integration with decentralized products that allow investing, selling, lending, and borrowing; and a “significant growth” in the adoption of decentralized autonomous organizations, Web 3.0 games, and decentralized finance (DeFi) products and services in the past twelve months.","Furthermore, said the announcement, “this 2020 curve parallels the trend in DeFi adoption, indicating that new users are coming to MetaMask specifically to participate in the decentralized finance revolution.”","Indeed, DeFi Pulse shows that the total value locked (TVL) in DeFi growth curve accelerated in June this year, with TVL rising 850% since June 15, to the current USD 10.68bn. However, as reported, this number should be taken with a grain of salt.","As reported, MetaMask launched its new mobile version on the iOS and Android operating systems this September. This latest announcement said that the top four countries in volume of mobile users are: USA, India, Nigeria, and the Philippines."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"MetaMask","content":"PERSON"},{"type":"June this year","content":"DATE"},{"type":"USA","content":"ORGANIZATION"},{"type":"Firefox","content":"ORGANIZATION"},{"type":"MetaMask Mobile","content":"ORGANIZATION"},{"type":"ConsenSys Codefi","content":"ORGANIZATION"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"850%","content":"PERCENT"},{"type":"Totle","content":"LOCATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"400%","content":"PERCENT"},{"type":"the Philippines","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"May of 2019","content":"DATE"},{"type":"Airswap","content":"LOCATION"},{"type":"Paraswap","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"June 15","content":"DATE"},{"type":"2020","content":"DATE"}],"hashtag":["Altcoins","ConsenSys","Decentralized Exchange","DeFi","Ethereum","MetaMask","Trading","Wallet"],"authors":["Sead Fadilpašić"]}