{"summary":"Is the Hype Over for Ethena? ENA Price Falls 35% While This Fresh Bitcoin Venture Starts to Capture Market Interest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-the-hype-over-for-ethena-ena-price-falls-35-while-this-fresh-bitcoin-venture-starts-to-capture-market-interest.htm","publishDate":"2024-04-24T16:29:49","id":17466,"type":null,"title":"Is the Hype Over for Ethena? ENA Price Falls 35% While This Fresh Bitcoin Venture Starts to Capture Market Interest","category":["Industry Talk "],"content":["The governance token for synthetic dollar protocol Ethena (ENA) has shed 35% over the last fortnight to trade at $0.919 as of Wednesday, April 24, 2024.","That makes for some of the heaviest losses for a top 100 cryptocurrency in the last fortnight. Losses look set to continue, too, as ENA shed about 9% in the last 24 hours.","These figures reflect a token that’s having a rougher ride than market leaders Bitcoin (BTC) and Ethereum (ETH).","Bitcoin only declined by 3.4% over the fortnight. Ethereum fared worse, shedding about 7% over the fortnight, but both have appreciated a little bit in the last week.","","ENA began trading on April 2 at around 79 cents and it rallied almost consistently over the next 9 days to set a high of $1.52 on April 11.","Today’s price represents a 39% pullback and there are signs that it could continue.","ENA is trading a little short of its 30-day moving average and its Relative Strength Index (RSI) is 35 and falling. Should it fall below 30, ENA will be oversold.","The CryptoQuant report warning of a potential USDe de-pegging recalls the fate of the so-called algorithmic stablecoin UST.","Once one of the largest cryptocurrencies in the world, the dollar-pegged stablecoin slipped its peg in May 2022 when a bank run caused many to exit their positions too quickly, sending the algorithm into a hyper-inflationary tailspin that quickly drained billions from the ecosystem and send the industry into a year-long recession. ","In the post-mortem analysis, many highlighted that analysts had previously warned of the possibility of an exponentially catastrophic de-pegging. However, the early warnings had fallen on mostly deaf ears.","Crypto is a different field in 2024. Because of the heavy lessons learned over the last two years, there is arguably a greater awareness of potential problems than there ever has been.","Thanks to the cryptoverse’s lively community of journalists and influencers, retail investors are far more savvy than they’ve ever been on issues of security and protocol stability.","Still, it could be better. With USDe, for example, few understand the risks in spite of the fact that it is one of the fastest growing stablecoins.","So, everyone agrees on the fact that education is compulsory. That’s why a new protocol hopes to incentivize more people to learn about crypto through paying them crypto.","99Bitcoins is a heritage platform that brings with it a long-established community of 700,000 YouTube subscribers alongside 2 million registered users for its crypto courses. ","Interested in learning to trade and read signals? 📈","Our upcoming #99Bitcoins platform features expert crypto trading signals and a vibrant community eager to share their insights. 🙌","Learn more: https:\/\/t.co\/NXD7DAamqr#Presale #Bitcoin #LearnToEarn pic.twitter.com\/eTvz6rNq41","— 99Bitcoins (@99BitcoinsHQ) April 24, 2024","","Through its revolutionary Learn-to-Earn model, 99Bitcoins uses a blend of gamification and a leaderboard reward system to make users feel like their learning is bearing spendable benefits.","Interested?","Visit the secure presale website today to Buy 99Bitcoins. ",""],"entity":[{"type":"7%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"April 24, 2024","content":"DATE"},{"type":"April 2","content":"DATE"},{"type":"Wednesday, April 24, 2024","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 11","content":"DATE"},{"type":"3.4%","content":"PERCENT"},{"type":"79 cents","content":"MONEY"},{"type":"$1.52","content":"MONEY"},{"type":"$0.919","content":"MONEY"},{"type":"last two years","content":"DATE"},{"type":"Ethena (ENA","content":"ORGANIZATION"},{"type":"ENA","content":"ORGANIZATION"},{"type":"39%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["99bitcoins","ena","Ethena"],"authors":["Tim Hakki"]}