{"summary":"Power-starved Abkhazians Face Internet Restrictions in Crypto Mining Crisis","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/power-starved-abkhazians-face-internet-restrictions-in-crypt-8769.htm","publishDate":"2020-12-31T01:00:00","id":17476,"type":null,"title":"Power-starved Abkhazians Face Internet Restrictions in Crypto Mining Crisis","category":["Bitcoin News "],"content":["After months of power shortages leading to blackouts, brownouts, planned multi-hour electricity shutdowns and a blazing inferno at a power substation, citizens in Abkhazia are now set to be restricted in their internet activities as the government wages a confused war against crypto mining.","After a series of seemingly mind-boggling u-turns and law changes, the government of the de facto South Caucus state has issued a temporary ban on crypto mining, which has gained massive popularity in Abkhazia.","And as the power grid reels, the government has asked the police to intervene. Officers said they have torn out the plug on well over 2,400 mining rigs, closing down multiple crypto mining “farms” in the process. However, police have been frustrated in their quest to identify miners, as it claims that the biggest offenders are not large-scale miners. Instead, they have blamed a huge preponderance of small-scale operators running as few as five and no more than 10 rigs in home-based setups.","In a Facebook post, the government announced it had already issued instructions to all of Abkhazia’s telecom operators, instructing them to “take the necessary technical measures to block domain names, sites, network addresses” and more in any and all sites the government thinks could have links to crypto mining, including mining resources, mining data and quite possibly more.","The list will be compiled by the State Committee for Communications and will stay in place until at least June 1, 2021, when the “temporary ban” will be lifted and crypto mining is slated to become legal again, per the government.","Earlier, the parliamentary speaker warned of lawless uprisings that have seen crypto miners effectively chased out of town by angry residents frustrated at being left for days on end with little or no power.\n___\nLearn more:\nPolish Crypto Miner Prepares Its Services For South Korean Gamers\nBillionaire Turns to Bitcoin Mining To Help His Troubled Business\nVenezuelan Army Engineers Start Mining Bitcoin\nHenry Ford’s Energy Standard: A 100-Year Old Bitcoin Prediction\nThis is How Institutional Players Help Bitcoin Mining Industry Grow\nBitcoin Miners Are Using New Strategies to Hedge Risks"],"entity":[{"type":"Army Engineers Start Mining Bitcoin\nHenry Ford","content":"ORGANIZATION"},{"type":"Abkhazia","content":"LOCATION"},{"type":"Polish Crypto Miner Prepares Its Services For South Korean Gamers\nBillionaire Turns","content":"ORGANIZATION"},{"type":"facto South Caucus","content":"ORGANIZATION"},{"type":"June 1, 2021","content":"DATE"},{"type":"How Institutional Players Help Bitcoin Mining Industry Grow\nBitcoin Miners","content":"ORGANIZATION"},{"type":"State Committee for Communications","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Mining","Regulation"],"authors":["Tim Alper"]}