{"summary":"BitMEX, one of the most active trading platforms for bitcoin, has accounts shut down in U.S. and Quebec since the company was not registered with AMF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7391\/one-of-the-largest-crypto-exchanges-is-shutting-down-u-s-and-canadian-accounts-at-a-clip-says-report","publishDate":"2019-01-14T23:50:55","id":1747,"type":null,"title":"Autorité Des Marchés Financiers (AMF) cracks down on BitMEX","category":["EXCHANGES"],"content":["BitMEX, one of the most active trading platforms for bitcoin, is being squeezed out of North American crypto markets, a recent report says.","The exchange platform, which facilitates trading for futures contracts tied to bitcoin, has been closing accounts out of the Unites States and Canada's Quebec region, according to a report by <a href=\"https:\/\/www.scmp.com\/business\/money\/wealth\/article\/2182043\/hong-kong-based-digital-currency-exchange-bitmex-ditches\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">South China Morning Post<\/em>.<\/a> \"BitMEX’s move to bar Quebec traders comes after the province’s financial regulator, the Autorité des marchés financiers (AMF), sent a letter to the exchange in early 2018 asking it to close all accounts linked to Quebecois, saying the exchange was not authorised to provide trading services,\" the report said. BitMEX is the largest marketplace for bitcoin, according to data provided by CoinMarketCap.&nbsp;","Quebec's regulator has \"been shutting down client trading accounts in the US and the Canadian province of Quebec, as global regulators intensify their crack down on unlicensed cryptocurrency trading platform,\" the report added. The agency confirmed to this publication that the company's \"activities were illegal.\"","“BitMEX is not registered with the AMF and is therefore not authorised to have activities in the province of Quebec,” AMF’s director of media relations told <em data-v-f87c67ca=\"\">SCMP.&nbsp;<\/em>To be clear, the firm states on its website that it doesn't accept clients from the U.S. and Quebec.","","","A spokesperson for BitMEX did not respond to a request for comment. Still, the exchange saw close to a billion dollars worth of crypto trade hands on its venue over the last 24-hours, according to <a href=\"https:\/\/coinmarketcap.com\/exchanges\/bitmex\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a>. The SMCP article claims that federal agencies pushed back against the firm's operations in the U.S.&nbsp;","<em data-v-f87c67ca=\"\">Update: reached by email, a BitMEX spokesperson disputed the characterization in the original SCMP article.<\/em>","<span id=\"m_8092701504745653907gmail-docs-internal-guid-ea8e7ae3-7fff-1659-88fd-41dc9b1dbba9\" data-v-f87c67ca=\"\">\"The SCMP article sensationalized what went on with the Authorite des Marches Financiers (AMF). The AMF reached out to BitMEX with a request to assist Quebec regulators in identifying and closing accounts from Quebec. Throughout the execution, we kept the AMF updated on progress. And upon completion, the AMF informed us that they were satisfied with the expeditious completion of the request.<\/span>\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Authorite des Marches Financiers (AMF","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"last 24","content":"DATE"},{"type":"Unites States","content":"LOCATION"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"SCMP","content":"ORGANIZATION"},{"type":"Quebecois","content":"LOCATION"},{"type":"Quebec","content":"LOCATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"AMF","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}