{"summary":"Plant a Tree In-Game, You Plant It IRL: New Metaverse, NFT Game Where Real-World Actions Mirror Digital Ones Launches in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/plant-a-tree-in-game-you-plant-it-irl-new-metaverse-nft-game-where-real-world-actions-mirror-digital-ones-launches-in-2023.htm","publishDate":"2022-08-25T20:00:00","id":17479,"type":null,"title":"Plant a Tree In-Game, You Plant It IRL: New Metaverse, NFT Game Where Real-World Actions Mirror Digital Ones Launches in 2023","category":["News "],"content":[" ","Blockchain company Alóki has bought 750 acres of land in Costa Rica and is building a new play-to-own metaverse which is nearing its launch.","As awareness of the need to cut greenhouse gas emissions is rising across the world, Alóki is developing a project to allow users to contribute to sustainable development via a blockchain-based game in which real-world actions mirror those digital ones via non-fungible token (NFT) ownership. ","The 750-acre plot lies in a jungle located in the heart of Costa Rica, which is one of the leading countries in terms of sustainability and derives 98% of its energy from renewable sources, according to data obtained by Alóki. ","Planting a tree in the Alóki metaverse will result in a real tree being planted in the Alóki Sanctuary of Costa Rica, the company claims.","Bartek Lechowski, CEO, Co-Founder, and Marketing and Experience Design Executive at Alóki, told Cryptonews.com that 27% of Costa Rica’s landscape is protected in reserves and national parks, and the nation is on the way to becoming fully carbon-neutral. This makes Costa Rica the ideal environment for the deployment of the project, he said.","Maurycy Krzastek, Founder, Creative Officer, and Financial Systems Developer at Alóki, told Cryptonews.com that they “aim to offer users from all audiences the chance of sharing such beliefs and joining our efforts at maintaining biodiversity and preserving natural habitats,” adding: ","“We see this project as a way to attract new people with sustainable focus into the crypto space. Our intention is for this to be their first crypto project as we believe it’s important for crypto and sustainability to work together.” ","Krzastek further stated that “we believe there is not a single company nowadays that does not practice some form of corporate social responsibility and does not strive towards sustainability and green initiatives,” adding that Alóki welcomes all businesses and companies from any industry to join them.","Preliminary activities of the new metaverse are to be launched throughout the third quarter of 2022, ensuring a smooth transition toward the metaverse’s full launch, which is to take place around the second and third quarters of 2023, when Alóki will be introducing a land-based gameplay, according to the company’s CO.","According to Krzastek, ","“The game itself will be launched in the fourth quarter of 2023. Prior to that, the project will be building up its community, conducting token sales, and offering users a host of NFTs for sale and activities, such as Spirit Quests to provide a gradual introduction to the essence of the game. We will also be launching the marketplace and other modules, such as NFT avatars, user interfaces and the website prior to the metaverse release.” ","Asked about the project’s financing, Lechowski said that it will be financed through a number of key channels that rely on the use of its native Prana token. “The primary sale of NFTs and in-game items, as well as fees on transactions on the secondary market will provide steady streams of revenue,” he said. ","Aloki will also be offering staking opportunities, NFT sales, and rewards that Lechowski said will “ensure continued liquidity flows within the project and from external sources,” adding: ","“The project is self-funded at this moment, and we are bringing in USD 30 million worth of land as an important asset.”","____","Learn more: \n– New York State to Ban Carbon-Powered Bitcoin, Altcoin Mining, While Kenya Fosters Green BTC\n– LATAM’s New Crypto Mining ‘Promised Land’: Pluses & Minuses for Paraguay\n\n– Crypto’s Need for Sustainability Standard-Setting Starts Here\n–  Bitcoin Mining Efficiency Up 63% in Year, ‘Sustainable Electricity Mix’ Jumped 59% – Bitcoin Mining Council\n\n– Solana-Based Phantom Wallet Unveils ‘Burn NFTs’ to Protect Customers From Scams\n– Enter Frida Kahlo’s Red House: Decentraland is Preparing ‘Mind-Bending Installations’ for Metaverse Art Week"],"entity":[{"type":"third quarter of 2022","content":"DATE"},{"type":"While Kenya Fosters Green BTC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Bartek Lechowski","content":"PERSON"},{"type":"Protect Customers From Scams\n– Enter Frida Kahlo’s Red House","content":"ORGANIZATION"},{"type":"New York State","content":"LOCATION"},{"type":"Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Prana","content":"ORGANIZATION"},{"type":"Altcoin Mining","content":"ORGANIZATION"},{"type":"Alóki","content":"PERSON"},{"type":"27%","content":"PERCENT"},{"type":"Krzastek","content":"LOCATION"},{"type":"Alóki","content":"LOCATION"},{"type":"third quarters of 2023","content":"DATE"},{"type":"59%","content":"PERCENT"},{"type":"Lechowski","content":"PERSON"},{"type":"Financial Systems Developer","content":"ORGANIZATION"},{"type":"Costa Rica","content":"LOCATION"},{"type":"Alóki Sanctuary of Costa Rica","content":"LOCATION"},{"type":"the fourth quarter of 2023","content":"DATE"},{"type":"63%","content":"PERCENT"},{"type":"USD","content":"LOCATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["Ecology","Metaverse","NFT","Non-fungible tokens"],"authors":["Jaroslaw Adamowski"]}