{"summary":"New Blockchain Scalability Ideas: Packets and Zones","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-blockchain-scalability-ideas-packets-and-zones-5673.htm","publishDate":"2020-01-31T16:00:00","id":17487,"type":null,"title":"New Blockchain Scalability Ideas: Packets and Zones","category":["Blockchain News "],"content":["Scalability is a long-standing and oft-discussed blockchain issue, for which many Cryptoverse residents have been searching a solution. Today we look into two of the latest ideas that aim to solve the problem and make transactions faster and more efficient.","Asensys, a blockchain system created by former Microsoft lead researcher JiaPing Wang, is designed to avoid repetition in existing blockchains, namely Ethereum and Bitcoin, and surpass them both by increasing network performance. The startup says that the workload is distributed across independent zones that comprise the network. The tests, they claim, have already shown a lot more throughput and capacity.","The Asynchronous Consensus Zones have been proposed in a paper presented by Wang and Hao Wang of Ohio State University at the 2019 the USENIX Symposium on Networked Systems Design and Implementation (NSDI). It scales blockchain system linearly but reportedly without compromising decentralization or security, claim the authors, by running numerous parallel and independent zones – instances of single-chain consensus systems.","The consensus happens independently within each zone with minimized communication, which partitions the workload of the entire network and ensures a moderate burden for each individual node as the network grows.","“What we discovered through comprehensive research and analysis,” Wang says, “is that the limitations of scalability in blockchain networks are not based on the type of consensus algorithm deployed, as many would believe, but on the fact that every single node must duplicate the entire network each time a new block is added.”","Co-founder of Ethereum Vitalik Buterin and Ethereum developers are trying out sharding as a solution, where nodes process only parts of transactions, while Bitcoin developers are working on layer 2 solutions, most well-known of which is the Lightning Network, and this enables certain transactions to be processed off-chain so the network wouldn’t get clogged.","Asensys experiment showed “that performance by the Asensys protocol increases proportionately to the community size.” A test was reportedly conducted using 1,200 virtual machines across the world to support 48,000 nodes, finding that the Asensys system delivers 1,000 times the throughput and 2,000 times the capacity of the Bitcoin and Ethereum networks.","MIT researchers have co-invented a new cryptocurrency-routing scheme that they claim can boost the efficiency, and with it – profits, of certain networks that are already designed to make blockchain transactions faster. The researchers will be presenting a paper next month at NSDI, which will introduce “Spider” – a routing scheme that enables users to invest only a fraction of funds in each account and process c. four times more transactions before rebalancing on the blockchain, reports MIT news.","Spider comes with some innovations. It splits each full transaction into smaller “packets.” These are then sent across different channels at different rates. The scheme can route fractions of large payments through possibly low-funded accounts, thus making the transactions faster and each packet less likely to be rejected for its size in any account.","Also included is an algorithm that monitors data center congestion in order to find queueing delays at congested accounts, further helping to control the rate of transactions.","The article explains that compared to thousand of transactions per second processed by major credit cards, Bitcoin can process only a handful, because blockchain, despite a myriad of its benefits, takes a long time to do this. There is a new solution, called “payment channel networks” (PCNs), where blockchain has a minimal involvement in transactions, as users route payments through an interconnected network of joint accounts, which is created by pairs of PCN users who form off-blockchain escrow accounts with a dedicated amount of money. “Ultimately, the more balanced the routing of PCNs, the smaller the capacity required — meaning, overall funds across all joint accounts — for high transaction throughput.”","However, even this fast solution is slowed down by insufficient routing schemes, claim the researchers, depleting users’ balances in these accounts along the way, making them invest a lot of money in each account or frequently rebalance their accounts.","One of the authors, Vibhaalakshmi Sivaraman, a graduate student in the Computer Science and Artificial Intelligence Laboratory (CSAIL), is cited in the article as saying:","It’s important to have balanced, high-throughput routing in PCNs to ensure the money that users put into joint accounts is used efficiently. This should be efficient and a lucrative business. That means routing as many transactions as possible, with as little funds as possible, to give PCNs the best bang for their buck.","In PCN simulations, claim the authors, Spider processed 95% of all transactions using only 25% of the capacity needed in traditional schemes, and it’s able to process eight times as many off-chain transactions for each transaction on-chain, compared to twice as many off-chain transactions supported by traditional schemes.","__","Meanwhile, we reported last year that Buterin’s new Ethereum scalability solution that would include using the Bitcoin Cash (BCH) blockchain as the data layer, was met with a wave of criticism by the crypto community."],"entity":[{"type":"Artificial Intelligence Laboratory","content":"ORGANIZATION"},{"type":"Vibhaalakshmi Sivaraman","content":"PERSON"},{"type":"BCH","content":"ORGANIZATION"},{"type":"Ohio State University","content":"ORGANIZATION"},{"type":"NSDI","content":"ORGANIZATION"},{"type":"JiaPing Wang","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Wang","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Computer Science","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Hao Wang","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum Vitalik Buterin","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Blockchain","Ethereum","Scalability"],"authors":["Sead Fadilpašić"]}