{"summary":"In June 2023, Texas officials filed enforcement actions against Abra and its CEO for alleged securities fraud and operating under insolvency.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273896\/texas-securities-board-abra","publishDate":"2024-01-23T02:46:26","id":1748,"type":null,"title":"Texas State Securities Board settles with Abra, opening withdrawals","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">The Texas State Securities Board announced Monday that <\/span><a href=\"https:\/\/www.ssb.texas.gov\/news-publications\/texas-securities-board-settles-abra-over-national-sales-interest-bearing-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">it has settled in principle<\/span><\/a><span data-v-f87c67ca=\"\"> with Abra and its CEO, Bill Barhydt.<\/span>","<span data-v-f87c67ca=\"\">Abra is the common name for four affiliated companies controlled by Barhydt, which offered interest-bearing Abra Earn and Abra Boost programs.<\/span>","<span data-v-f87c67ca=\"\">The settlement made in Texas obligates Abra to notify users with balances exceeding $10 and grants them a seven-day withdrawal period. Unclaimed assets will be converted to fiat currency and sent to remaining Texas investors, the announcement said. Abra is given 30 days to fulfill its obligations.<\/span>","<span data-v-f87c67ca=\"\">On June 15, 2023, Texas officials filed an <\/span><a href=\"https:\/\/www.ssb.texas.gov\/news-publications\/abra-earn-and-abra-boost-warning\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">emergency cease and desist order<\/span><\/a><span data-v-f87c67ca=\"\"> against Abra and Barhydt, alleging that the operators committed securities fraud regarding Abra Earn and Abra Boost. The board alleged that the firms behind Abra hid financial troubles, including loan defaults and transfers to Binance, while nearing insolvency as of March 31 that year.<\/span>","<span data-v-f87c67ca=\"\">At the time of the enforcement action, Abra had around $13.6 million worth of cryptocurrencies from over 12,000 U.S. investors. Barhydt noted to the block that the balance as of settlement is less than $500,000.<\/span>","<span data-v-f87c67ca=\"\">Per the settlement in principle, the board stated that it would dismiss actions filed against Abra on or after June 15, 2023.<\/span>","<strong data-v-f87c67ca=\"\">This article and its headline have been corrected to clarify that Abra withdrawals were not frozen.<\/strong>"],"hashtag":[]}