{"summary":"PEPE BIRTHDAY Token Explodes 200x Overnight, as Lesser-Known Meme Coin Secures $5.5 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pepe-birthday-token-explodes-200x-overnight-as-lesser-known-meme-coin-secures-5-5-million.htm","publishDate":"2024-04-18T16:42:21","id":17494,"type":null,"title":"PEPE BIRTHDAY Token Explodes 200x Overnight, as Lesser-Known Meme Coin Secures $5.5 Million","category":["Industry Talk "],"content":["Ahead of the Bitcoin Halving, Solana meme coins continue to thrive.","In the most recent surge, the Pepe Birthday token (PEPEBDAY) experienced a dramatic 200x increase in price. However, with the price now receding, attention is turning to whether another coin might be poised for a similar explosion.","This article will provide an analysis of PEPEBDAY’s current price trends and look to see whether an innovative multi-chain meme coin, Dogeverse, represents a more promising investment opportunity at this time.","PEPE BIRTHDAY ENTERED SOL TRENDING AGAIN🔥","Today is a very important day for us, our party continues and we are waiting for you! In an hour PEPE will be listed on COINBASE and it's a good occasion for us.","Lets conquer the heights together!#PEPEBIRTHDAY #PEPE #LISTING #SOL… pic.twitter.com\/xaJPAx3dPr","— PEPE BIRTHDAY (@pepebirthday_) April 18, 2024","","Pepe Birthday is a celebratory meme coin, aiming to make it big in the wake of 2023’s biggest meme coin launch: Pepe coin – which was created on April 19.","As price action retreats, Pepe Birthday token is currently trading at a market price of $0.000032 (representing a 24-hour change of -90%).","This comes after PEPEBDAY launched at just 9 AM UTC on April 17, in a listing that garnered immediate attention from eagle-eyed DEX traders.","","Quickfire traction saw PEPEBDAY accelerate +14,000% to hit an all-time high at $0.0076 just 5-hours later – yet, the sudden gains appear to have been short-lived, with early-bird investors moving quick for a sell-off that has since bled-out most of Yesterday’s big gains.","Pepe Birthday token is now left trading at last-stand support above $0.00003 – with 1,220 holders risking a complete capitulation.","And despite the timely launch, and alluringly low $32k market cap – with buy pressure representing just 35% of transactions over the past hour – all might be over for this fresh-faced moonshot.","For this reason, many astute traders are shifting their attention to a viral meme coin presale.","","With Dogecoin in focus and bears pressing on, more investors are training their eyes on Dogeverse (DOGEVERSE) – which offers early-bird advantage that could unlock huge gains.","The multi-chain meme coin is rapidly gaining traction, raising over $7 million in its ongoing presale.","Another fantastic milestone in the books! 🚀#DOGEVERSE hits over $7 million! 💰#Cosmo sends a heartfelt thanks to our expanding community! 🐶🙌","What's next on the horizon – $7.5M or $8M? 🤔 pic.twitter.com\/yIiutjmR81","— DogeVerse (@The_DogeVerse) April 18, 2024","","DOGEVERSE will operate on Ethereum, Polygon, BNB Chain, Solana, Avalanche, and Base, a multichain feature that supporters will drive prices in 2024.","Moreover, holders cite DOGEVERSE’s capped supply of 200 million combined with staking as attractive attributes. These features will likely create a supply squeeze, progressively lifting prices over time.","Buy DOGEVERSE Here",""],"entity":[{"type":"$0.00003","content":"MONEY"},{"type":"-90%","content":"PERCENT"},{"type":"+14,000%","content":"PERCENT"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$0.0076","content":"MONEY"},{"type":"$7 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Dogeverse","content":"LOCATION"},{"type":"Pepe Birthday","content":"PERSON"},{"type":"$7.5","content":"MONEY"},{"type":"April 18, 2024","content":"DATE"},{"type":"April 19","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"April 17","content":"DATE"},{"type":"$8M","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$0.000032","content":"MONEY"}],"hashtag":["Meme coin","Pepe","PEPE Birthday"],"authors":["Sam Cooling"]}