{"summary":"Robert F. Kennedy Jr Wants to Move US Budget Management to the Blockchain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robert-f-kennedy-jr-wants-to-move-us-budget-to-blockchain.htm","publishDate":"2024-04-22T19:40:49","id":17497,"type":null,"title":"Robert F. Kennedy Jr Wants to Move US Budget Management to the Blockchain","category":["Blockchain News "],"content":["Presidential candidate Robert F. Kennedy Jr. is committed to transforming the US budget system by adopting blockchain technology. He revealed his plans during a campaign rally in Michigan on April 21, where he explained that the shift would enable Americans to access “every budget item anytime they want, 24 hours a day.”","During his campaign, Robert F. Kennedy Jr. emphasized the importance of providing citizens unlimited access to government budgets. He vowed to increase transparency and accountability through blockchain technology, which represents a departure from traditional budgetary practices. The goal is to allow taxpayers to track where and how every cent of their taxes are spent.","","NEW: 🇺🇸 RFK Jr. says “I’m gonna put the entire US budget on blockchain”","“Every American can look at every budget item in the entire budget, anytime they want, 24 hours a day.”","“We’re gonna have 300 million eyeballs on our budget!” pic.twitter.com\/TBpkcXt5i1","— Radar🚨 (@RadarHits) April 22, 2024","","“We’re gonna have 300 million eyeballs on our budget, and if somebody is spending $16,000 for a toilet seat, everybody’s gonna know it,” he said.","Blockchain is suitable for government budgets due to its transparency and immutability. It provides a secure and tamper-proof transaction record, averting financial misappropriation and allowing the public to verify government use of funds and ensure accountability.","Increased accountability promotes integrity in public governance and reduces corruption. According to the International Monetary Fund (IMF), 2.5% of the world’s Gross Domestic Product (GDP), estimated to be $1.4 to $2.6 trillion, is lost through corruption.","This proposed move by Kennedy has sparked online debates among US residents and crypto investors.","As is expected, many in the crypto community have praised the idea as innovative and a secure means to combat corruption.","THIS ALONE is a reason I will vote for RFKjr.","It will break my heart if Tulsi is chosen as VP with Trump, but putting the entire US budget on blockchain would be transformative.","I don’t believe in silver bullets, but this is a close as one gets to one.","Ok… I am all in… https:\/\/t.co\/Te7pEUXuxL","— Alan Myron : E Pluribus Unum 🌺 (@AlanMyron) April 22, 2024","","Some critics have raised concerns, however, suggesting that Kennedy’s blockchain plan implies support for a central bank digital currency (CBDC), which contradicts his previous decision to stop US efforts to introduce a CBDC if elected, as he noted its infringement on privacy.","In January 2024, Kennedy argued that a CBDC would allow the government to monitor every citizen’s transaction, potentially leading to blackmail, which he deemed a “calamity for human rights and civil rights.”","Dr. Joseph @Mercola and I discuss financial freedom in the 21st century. As president, I will end the efforts to move toward a CBDC. #Kennedy24 pic.twitter.com\/gao3D1HAeM","— Robert F. Kennedy Jr (@RobertKennedyJr) January 24, 2024","","Robert F. Kennedy Jr. is running as an Independent candidate in the forthcoming US presidential election scheduled for November 2024.","He is renowned for his strong advocacy of Bitcoin and blockchain technology, making him one of the few presidential candidates to endorse decentralized technology and the first to accept Bitcoin for campaign donations. If elected, he has also proposed a plan to back the US dollar with Bitcoin while hailing cryptocurrency as the best hedge against inflation.","Interestingly, Charles Hoskinson, the founder of Cardano, supported Kennedy Jr’s crypto-friendly stance on April 4.","Crypto guru and Cardano co-founder Charles Hoskinson (@IOHK_Charles) endorses RFK Jr., saying he’s the best person to back this November.","#KennedyShanahan24 pic.twitter.com\/a0taHwr0cD","— Robert F. Kennedy Jr (@RobertKennedyJr) April 17, 2024","","Hoskinson believes Kennedy is the ideal choice for voters, describing him as someone “who could make a difference regardless if he wins.”","Cardano’s founder reiterated his support following the recent announcement of Kennedy’s family to support incumbent President Joe Biden in the election.","Power is the only currency of Washington. Kennedy is viewed as a longshot but a potential spoiler. Thus, the machine drags the Kennedy family out in front of the public to endorse Biden.","I work with my dad and brother. If they ran for office, regardless of their politics, I'd… https:\/\/t.co\/pb39P8BUtM","— Charles Hoskinson (@IOHK_Charles) April 19, 2024","","While Hoskinson expressed dissatisfaction with the announcement, he described Kennedy as an underdog with the potential to disrupt the upcoming presidential race."],"entity":[{"type":"$16,000","content":"MONEY"},{"type":"$1.4","content":"MONEY"},{"type":"Hoskinson","content":"PERSON"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"Tulsi","content":"ORGANIZATION"},{"type":"21st century","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Joseph @Mercola","content":"PERSON"},{"type":"April 21","content":"DATE"},{"type":"2.5%","content":"PERCENT"},{"type":"Robert F. Kennedy Jr.","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"RFK Jr.","content":"ORGANIZATION"},{"type":"Robert F. Kennedy","content":"PERSON"},{"type":"April 22, 2024","content":"DATE"},{"type":"April 17, 2024","content":"DATE"},{"type":"April 19, 2024","content":"DATE"},{"type":"Alan Myron","content":"PERSON"},{"type":"Joe Biden","content":"PERSON"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"November 2024","content":"DATE"},{"type":"Kennedy","content":"PERSON"},{"type":"April 4","content":"DATE"},{"type":"Kennedy","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Michigan","content":"LOCATION"},{"type":"January 24, 2024","content":"DATE"},{"type":"Kennedy Jr","content":"ORGANIZATION"},{"type":"$2.6 trillion","content":"MONEY"},{"type":"Cardano","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Trump","content":"PERSON"},{"type":"RFK Jr.","content":"PERSON"},{"type":"Biden","content":"PERSON"}],"hashtag":["Cardano","United States"],"authors":["Jimmy Aki"]}