{"summary":"Pharrell Williams And Louis Vuitton Launch NFT-Linked Jacket To VIA Holders","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/louis-vuitton-pharrell-williams-web3-fashion-nft-jacket-debut.htm","publishDate":"2024-04-23T20:26:13","id":17492,"type":null,"title":"Pharrell Williams And Louis Vuitton Launch NFT-Linked Jacket To VIA Holders","category":["NFT News "],"content":["Renowned fashion house Louis Vuitton and record producer Pharrell Williams are delving further into Web3 fashion with their new VIA NFT-linked varsity jacket, according to reports on Tuesday. Their latest design was released to the company’s VIA NFT holders.","The physical western-inspired varsity jacket, made of suede buckskin and featuring the brand’s logo emblazoned across the front, debuted at Louis Vuitton’s Autumn\/Winter 2024 men’s runway show in Paris this past January. ","Holders of the luxury company’s VIA NFT project who purchase the jacket (going for an estimated $8,450) will also gain its digital twin in the form of a collectible NFT, of which only 200 pieces are available.","The piece’s market release plays on the concept of the new concept of “phygital” goods—when both digital and physical copies of a product are made and sold.","The physical varsity jacket is expected to be shipped to purchasers by November or December of this year, while its digital copy will be available immediately for purchase.","The latest digital launch from Louis Vuitton marks the French fashion house’s continued efforts to capitalize on Web3 fashion, particularly regarding exclusive NFT-based experiences.","In June 2023, the luxury brand unveiled its application-only VIA project last year, with customers able to purchase its first Web3 creation in the form of a $41,000 digitized version of its iconic LV trunk aptly named “The Treasure Trunk.”","According to a statement from Louis Vuitton at the time, the trunk was “designed for those who seek to travel through new dreams and new realities, and collect unique creations along the way.”","The project marks the second NFT-related product Williams has launched with the brand following his debut last June, featuring the company’s orange monogram Speedy 40 bag, which sold for just over $9,000.","Louis Vuitton VIA. The first VIA journey is now available. Discover the Speedy 40 VIA @Pharrell, revisiting the Maison's iconic bag crafted in 1930. Discover more at https:\/\/t.co\/FN7LgduFzK#LouisVuittonVIA #PharrellWilliams pic.twitter.com\/X2i5G7w9xQ","— Louis Vuitton (@LouisVuitton) July 17, 2023","","Additionally, Louis Vuitton’s women’s creative director, Nicolas Ghesquière, launched a $6,400 mini trunk for the brand late last year.","As the metaverse continues to expand, the Web3 fashion industry is expected to see a boom in business within the next decade. By 2031, it’s expected to reach $4.8 billion and see a compound annual growth rate of over 26%.","Louis Vuitton has long stayed ahead of the curve of emerging tech in the fashion world, most recently launching a Discord server related to its upcoming endeavors.","The luxury brand’s decision to continue leading the Web3 fashion universe could lay the foundation of what luxury style may look like in the future."],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"Paris","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Pharrell Williams","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2031","content":"DATE"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"Louis Vuitton","content":"LOCATION"},{"type":"$8,450","content":"MONEY"},{"type":"$6,400","content":"MONEY"},{"type":"Williams","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$4.8 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"last June","content":"DATE"},{"type":"1930","content":"DATE"},{"type":"Maison","content":"ORGANIZATION"},{"type":"Winter 2024","content":"DATE"},{"type":"$9,000","content":"MONEY"},{"type":"Treasure Trunk","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"July 17, 2023","content":"DATE"},{"type":"Louis Vuitton’s Autumn","content":"ORGANIZATION"},{"type":"Nicolas Ghesquière","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["Metaverse","NFT","web3 fashion"],"authors":["Julia Smith"]}