{"summary":"Blockchain.com isn’t selling any subsidiaries and hasn’t spoken to Coinbase about possible deals, a person familiar with the matter told The Block.\nEarlier, crypto news outlet Decrypt said Blockchain.com “has been attempting to sell off assets in a scramble for capital.”","author":["Christiana Loureiro","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213072\/blockchain-com-not-selling-subsidiaries-never-spoke-to-coinbase-source","publishDate":"2023-02-17T18:35:35","id":1749,"type":null,"title":"Blockchain.com not selling subsidiaries, never spoke to Coinbase: Source","category":["Deals"],"content":["Blockchain.com isn't selling any subsidiaries and hasn't spoken to Coinbase about possible deals, a person familiar with the matter told The Block.","Earlier, crypto news outlet <a href=\"https:\/\/decrypt.co\/121627\/blockchain-com-shopping-assets-to-fill-270m-hole-from-three-arrows-capital-sources\" data-v-f87c67ca=\"\">Decrypt<\/a> said Blockchain.com \"has been attempting to sell off assets in a scramble for capital\" following the collapse of hedge fund Three Arrows Capital last year, which left the company with a $270 million hole. Decrypt cited multiple sources it didn't name who told it about calls over the last two months during which executives \"shopped parts of its business, including to Coinbase.\"","Blockchain.com has sold illiquid positions to take profits and be more liquid in order to take advantage of opportunities, the person told The Block.","\"No Blockchain.com businesses are for sale,\" a company spokesperson told The Block. \"Blockchain.com is an asset buyer, not a seller.\"","Blockchain.com was one of several firms that was reportedly interested in acquiring derivatives exchanges and clearinghouse LedgerX, according to a December report from Bloomberg News.&nbsp; In October, Blockchain.com raised an undisclosed amount of additional capital in a round led by UK-based investment firm Kingsway Capital.","<em data-v-f87c67ca=\"\">(Updates with comment from company in fourth paragraph.)<\/em>"],"hashtag":[]}