{"summary":"CBDCs Banned in Florida as Governor Ron DeSantis Signs New Bill","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cbdcs-banned-florida-as-governor-ron-desantis-signs-new-bill.htm","publishDate":"2023-05-13T16:00:00","id":17498,"type":null,"title":"CBDCs Banned in Florida as Governor Ron DeSantis Signs New Bill","category":["Blockchain News "],"content":["Florida Governor Ron DeSantis has signed a new bill banning central bank digital currencies (CBDCs) in the state. ","The bill, dubbed SB-7054, bans the use of a CBDC as money within the state of Florida. It also prohibits the use of CBDCs issued by other governments and calls on other states to use their commercial codes to institute similar prohibitions.","During a recent press conference, DeSantis highlighted concerns about the potential use of CBDCs to control and surveil Americans.  ","He suggested that the government could use CBDCs to stop people from buying gas to combat global warming or track how often someone purchases firearms. ","“Anyone with their eyes open could see the danger this type of an arrangement would mean for Americans who want to exercise their financial independence and would like to be able to conduct business without having the government know every single transaction they’re making in real time.”","Florida Bans a Central Bank Digital Currency https:\/\/t.co\/S8UfWrLZyc","The bill, which amends the state’s law to exclude CBDCs from the definition of money, passed with only one vote against it during a Florida House of Representatives session. ","DeSantis also claimed that the Biden administration is studying CBDCs to eliminate other types of digital assets like cryptocurrencies. He suggested that the administration wants to “crowd out and eliminate other types of digital assets, like cryptocurrency.”","As reported, the Florida governor put forward the legislation in late March. ","At the time, he said his intention with the bill was to “protect Floridians from the Biden administration’s weaponization of the financial sector through a Central Bank Digital Currency.”","Florida’s move to ban CBDCs comes amidst increased talks and discussions on the development of CBDCs across the globe. ","Many central banks are considering launching their digital currencies to modernize their economic system and provide better financial services to their citizens. ","The People’s Bank of China has been leading the pack. Having started the development of its e-CNY in 2014, the country has launched numerous test pilots of its CBDC across various provinces. ","Most recently, the coastal province of Jiangsu promised to launch a platform that will allow citizens to pay education fees using the country’s CBDC. ","Aside from China, a number of other countries are either in the development or pilot stage. This includes South Korea, Japan, India, Russia, and more. ","However, some analysts have raised concerns over the potential impact of CBDCs on privacy and financial independence. ","Critics argue that CBDCs could provide a perfect tool for governments to control and track financial transactions, limiting people’s freedom to use their money as they wish.","Furthermore, because CBDCs would be digital and traceable, governments could monitor citizens’ transactions and even use them to determine a person’s financial history, which could potentially lead to negative consequences for certain individuals."],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"DeSantis","content":"PERSON"},{"type":"Jiangsu","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Florida House of Representatives","content":"ORGANIZATION"},{"type":"People’s Bank of China","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"7054","content":"DATE"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["CBDC","Central Bank"],"authors":["Ruholamin Haqshanas"]}