{"summary":"‘TESLA’ Token on Solana Explodes 45,398% in a Day, Anticipation Builds for New $10 Million Dog-Coin Listing","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tesla-token-on-solana-explodes-45398-in-a-day-anticipation-builds-for-new-10-million-dog-coin-listing.htm","publishDate":"2024-04-08T10:08:18","id":17490,"type":null,"title":"‘TESLA’ Token on Solana Explodes 45,398% in a Day, Anticipation Builds for New $10 Million Dog-Coin Listing","category":["Industry Talk "],"content":["Despite congestion over the weekend, the Solana meme coin markets are back with a bang this morning, as the new Tesla token explodes +45,298%.","This article will provide an analysis of TESLA’s current price trends and look to see whether a viral dog coin, Dogecoin20, represents a more promising investment opportunity at this time.","Indeed, the TESLA token has pumped at an unlikely time, as TSLA stock (below) continues to trade down on NASDAQ markets.","","(TSLAUSD)","As price action continues to pump, TESLA is currently trading at a market price of $0.085 (representing a 24 hour change of +65,504%).","This comes after the TESLA token launched out of inactivity at 14:00 UTC on April 7, in a sudden upside move that saw the price initially hammer +37,765% across 13 hours of continuous pump.","","Resistance around $0.072 triggered a minor -18.72% localized retracement. However, this was well-defended by 792 holders at support around $0.059.","And, amid strong inflows of fresh capital, the price skyrocketed further to hit a present all-time high at $0.092.","The gigantic pump has so far been triggered by just $141k in trading volume, and this leaves TESLA at a current market cap of around $8.58m.","Some overhead concern arises from multiple failed audit reports, and further commentary in the crypto community that alleged the liquidity pool was removed earlier in the project’s lifecycle back in March.","Can't sell either lol","— Danny NOSS || $LDZ (@DANNY_THE_NOSS) March 23, 2024","","As such, with TESLA’s price analysis highlighting the risk of Solana meme coin pumps, many retail investors are shifting their attention to safer alternative skyrockets like the viral Dogecoin20 presale.","\n","A new Dogecoin alternative has gone viral, amid widescale demand for the best meme coin opportunities, and with more than $10M raised at presale – Dogecoin20 – is emerging as the biggest meme coin play of April 2024.","Bolstered by a committed development team, and fuelled by the dramatic growth of the DOGE20 community, this new meme coin is poised to trigger major upsets in the meme coin rankings later this month.","🚀 #DOGE20 isn't just another Shiba Inu-inspired derivative.","Upholding Dogecoin’s ethos to Do Only Good Everyday, it offers passive rewards through on-chain staking. 🌱🌟","Embracing a greener, more sustainable future with the most widely loved #Memecoin in the world! 🐶 pic.twitter.com\/zqlONodRPB","— Dogecoin20 (@DOGE_COIN20) March 14, 2024","","Indeed, the CEX launches are expected to propel DOGECOIN20 to dramatic heights, with retail investors anticipating as much as 100x returns amid the viral market appetite for high-quality meme coin projects.","Chuck in the opportunity for high APY staking, and you’ve got a holders dream – a meme coin with proven potential in presale – heading imminently for CEX markets with billions in volume.","So don’t miss out!","Buy DOGE20 Here",""],"entity":[{"type":"April 2024","content":"DATE"},{"type":"this morning","content":"TIME"},{"type":"$0.072","content":"MONEY"},{"type":"$0.092","content":"MONEY"},{"type":"+45,298%","content":"PERCENT"},{"type":"+65,504%","content":"PERCENT"},{"type":"$8.58m.","content":"MONEY"},{"type":"Danny NOSS","content":"PERSON"},{"type":"+37,765%","content":"PERCENT"},{"type":"March 23, 2024","content":"DATE"},{"type":"$0.059","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"TSLA","content":"ORGANIZATION"},{"type":"TESLA token","content":"ORGANIZATION"},{"type":"-18.72%","content":"PERCENT"},{"type":"$0.085","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$LDZ","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"March 14, 2024","content":"DATE"},{"type":"CEX","content":"ORGANIZATION"},{"type":"$141k","content":"MONEY"},{"type":"April 7","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"$10M","content":"MONEY"}],"hashtag":["Solana meme coin","Tesla","TESLA token"],"authors":["Sam Cooling"]}