{"summary":"Decentralized exchange aggregator 1inch is introducing a new feature designed to protect against a type of frontrunning.\nIf 1inch detects that a transaction may be attacked in this way, it will send it directly to a validator.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189951\/dex-aggregator-1inch-to-protect-metamask-users-from-frontrunning","publishDate":"2022-11-25T09:00:32","id":175,"type":null,"title":"DEX aggregator 1inch to protect MetaMask users from frontrunning","category":["Crypto Ecosystems"],"content":["Decentralized exchange aggregator 1inch is introducing a feature called RabbitHole that's designed to prevent MetaMask users from getting hit by a certain form of frontrunning.","The issue at hand is sandwich attacks. This is where a trader frontruns a large buy order by buying the token first, pushing up the price. Once the buy order goes through, the token's price rises higher, at which point the trader sells at the higher price (or vice versa for the whole maneuver). It results in the victim seeing the trade executed at a worse price.","The reason this happens is because blockchain transactions are typically broadcast to the network as a whole and there is a period of time before they are included in blocks in the chain. As a result, traders who are able to get their transactions into the chain first — through a range of different methods — are able to frontrun transactions, if it's profitable enough.","RabbitHole checks for transactions that are likely to be subject to such sandwich attacks. If it determines a transaction is likely to be attacked in this way, it uses an alternative method to get the transaction into the blockchain. It submits the transaction directly to a validator, such as Flashbots, avoiding it being broadcast publicly.","RabbitHole is designed for MetaMask users and will initially be free to use. Depending on community opinion, 1nch may monetize the feature in the future."],"hashtag":["VALIDATORS","WALLETS"]}