{"summary":"Cryptic NEAR Protocol X Posts Raise Hack Suspicions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/near-protocol-recent-cryptic-x-posts-raise-hack-suspicions.htm","publishDate":"2024-05-09T12:20:26","id":17501,"type":null,"title":"Cryptic NEAR Protocol X Posts Raise Hack Suspicions","category":["Blockchain News "],"content":["Morse code, cryptic messages, and a redesign of NEAR Protocol’s X profile have left users concerned that they have been hacked.","On May 8th, NEAR Protocol’s official X handle began to post a series of cryptic tweets and messages which left the crypto community puzzled. The unusual behavior started with a 28-second-long video containing a Morse code message.","Once decoded, the message read, “Darkness is coming.”","pic.twitter.com\/jzosIuLJpI","— N̷̢̒E̶̳̎Ą̷͌R̴̳͝ (@NEARProtocol) May 8, 2024","","Two hours after the tweet, NEAR’s X account sent out four consecutive tweets using hard-to-read gothic fonts, commonly used by heavy metal bands.","The tweets contained more concerning messages like “the sun rises in the east,” “take back your thoughts,” “darkness” and “reclaim your sovereignty.”","r̴͖̳͙͂̽e̵̙̯̙͚͙̳͚̍͑́͌̓̒͘ć̵̺̯͚͛̕̕ͅl̵̻͉̱͙̰̞̹̈́̇̋͜a̸̯͂̌̓̌̕͠ȉ̷̡͇͖̖͇͖̠̺̔̊͆̃̕͝m̶̠̀͑͗ͅ ̴̠͇̹̩̬͆̾̎̔̋̇̓ͅy̵͔̬̣̋̇̒͌̕o̸̡̘̩̮̦̽̓̓̈́̔͐ͅu̶̢̙̳͓̹̮̝̓̂͆r̸̰̠̣͎͖̀ ̴̱̥̠̖̙̓̽̄͊̔̚ş̴̛͉̻̯̰̲͓̇̈͑̈́͜o̶͍͋̈͌̚͝v̵̧̡̝̘̫̍̑̈͝͠e̶̪͕̻̼̓͐r̴̬̔͛͂e̷̢̥̘̩̽̒̈́̇͛̔ȋ̸̲̼̈̋́̋̎̔ͅg̶̬̰͔͓͓̼̖̀̎̆̈̽͘n̸̠͉͊̇̎̓̈́́͝t̵͈̙̫̂̇̓͗̀̈́y̶̨̥̰̣̙͂̈","— N̷̢̒E̶̳̎Ą̷͌R̴̳͝ (@NEARProtocol) May 8, 2024","","This culminated in a complete visual redesign of NEAR’s X profile. Their banner and profile picture were changed to solid black.","Additionally, NEAR’s display name and description were also changed to match the mysterious theme of the tweets, simply reading “dark.”","","","The posts are not on-brand compared to NEAR’s past communications. Something that has prompted the crypto community on X and blockchain investigators to suspect a possible hijack.","However, a handful of the protocol’s supporters see the tweets as a sign of something bigger coming to the ecosystem. Though the post’s intended meaning is unclear, users generally agree to proceed with caution. This stems from the fear that a hack was launched with malicious intent.","In January 2024, the X account of Cryptocurrency data aggregator CoinGecko experienced a security breach and was used to run phishing scams.","The company managed to regain control of its social media account following a quick intervention. Hacks like this make it increasingly important that users are vigilant and know how to protect themselves from crypto fraud and scams.","","NEAR Foundation, the developer of NEAR Protocol, recently laid off 40% of its staff to “significantly consolidate the core Foundation team to focus on a narrower and higher-impact set of activities.”","This decision led to a loss of over 35 employees across the business development, marketing, and community teams. The company commented:","“The Foundation is well-placed to continue to support the ongoing growth, development, and further decentralization of the NEAR Protocol and ecosystem.”","The layoffs followed a review that revealed inefficiencies in the foundation’s operations.Over the next few years, the foundation intends to reduce its footprint even more as the ecosystem moves closer to true decentralization. However, this decision may have come at a cost. Some of the affected departments had direct involvement in NEAR Protocols X communications, which could have contributed to the suspected hijack of the account."],"entity":[{"type":"May 8, 2024","content":"DATE"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Morse","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"The Foundation","content":"ORGANIZATION"},{"type":"May 8th","content":"DATE"},{"type":"40%","content":"PERCENT"}],"hashtag":["Hack","NEAR protocol","Twitter Hack"],"authors":["Harvey Hunter"]}