{"summary":"‘ANSEMWIF’ Inspired by Popular Solana Meme Coin Trader Surges 28x Overnight as New Dogecoin ICO Debuts","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ansemwif-inspired-by-popular-solana-meme-coin-trader-surges-28x-overnight-as-new-dogecoin-ico-debuts.htm","publishDate":"2024-04-09T17:12:11","id":17505,"type":null,"title":"‘ANSEMWIF’ Inspired by Popular Solana Meme Coin Trader Surges 28x Overnight as New Dogecoin ICO Debuts","category":["Industry Talk "],"content":["As retail investors flock to Crypto Twitter (X), influencer Ansem has gone viral, and now the ANSEMWIF spin-off coin is the latest Solana meme coin to explode.","This article will analyze ANSEMWIF’s current price trends and examine whether an innovative new meme coin, DOGEVERSE, represents a more promising investment opportunity at this time.","We doing good $ANSEMWIF https:\/\/t.co\/sGPKVssYRg","— cryptocatbrothers.eth (@babyface_cairo) April 8, 2024","","Despite not being officially approved by Ansem, the DEX market mill never stops, and ANSEMWIF has exploded in a viral parody of Ansem’s legendary early WIF call.","As price action endures a heavy retracement move, ANSEMWIF currently trades at a market price of $0.0003 (representing a 24-hour change of -86.89%).","This comes after AnsemWifHat launched at just 3 AM UTC on April 9, in a spontaneous launch, gaining quick-fire traction as eagle-eyed traders noted its timely meme value.","Shooting up +2,950% in the first 5 hours, ANSEMWIF established support levels at $0.0011 and $0.0015, which set the stage for a further +77% price increase.","","ANSEMWIF hit an all-time high at $0.002875 at around 15:00 UTC. However, with early backers sitting atop +3,640% gains in a fleeting meme, a sell-off move was inevitable, and retracement has since set into the project.","Despite the down-shift, the ultra micro-cap at only $30k creates a substantial opportunity for late-stage retail investors, with only a small influx of capital needed to send this token to the moon.","Indeed, just one interaction from Ansem could see ANSEMWIF undertake a sensational 30x move from here in minutes – denoting this trade’s high risk: high reward opportunity.","However, for investors looking for slightly safer meme coin trades, an emerging multi-chain presale could be on the verge of viral success as it attempts to unify the DOGE universe.","Dogeverse (DOGEVERSE), is a new multi-chain dog-themed meme coin project with an active presale that has currently raised over $353k in just hours.","The meme coin is deploying its highly anticipated presale across multiple chains, including Ethereum, Avalanche, Base, and Solana.","The project’s developer said this approach democratizes access, and anyone can acquire the coin, turbocharging growth – becoming a force across the crypto market.","🚀 Explore the #DOGEVERSE, the first truly multi-chain #Doge #Token, inspired by #Cosmo's legendary journeys. 🐕","A leap forward in #Blockchain connectivity, uniting diverse #Crypto communities through Doge memes and a vision of a unified ecosystem across multiple chains! 🌐 pic.twitter.com\/8JR3yjJsK4","— DogeVerse (@The_DogeVerse) April 9, 2024","","Looking at events in the market, the in-demand Dogeverse presale will likely reap massive benefits as more users flock, searching for potent meme coins.","Supporters claim Dogeverse could be the next BONK and BOME, securing a $1 billion market cap in the coming weeks.","Don’t miss out on the next pump – follow Dogeverse on X to get the latest news and connect with the presale community on Telegram.","Join The DOGEVERSE Presale Here",""],"entity":[{"type":"$1 billion","content":"MONEY"},{"type":"April 8, 2024","content":"DATE"},{"type":"+77%","content":"PERCENT"},{"type":"$0.0011","content":"MONEY"},{"type":"$353k","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$ANSEMWIF","content":"MONEY"},{"type":"$0.0003","content":"MONEY"},{"type":"$0.0015","content":"MONEY"},{"type":"April 9, 2024","content":"DATE"},{"type":"+3,640%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$0.002875","content":"MONEY"},{"type":"April 9","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"-86.89%","content":"PERCENT"},{"type":"+2,950%","content":"PERCENT"},{"type":"$30k","content":"MONEY"}],"hashtag":["Ansem","Meme coin","Solana meme coin"],"authors":["Sam Cooling"]}