{"summary":"Discover Why Crypto Whales Are Quietly Stocking Up on This GambleFi Token for the 2024 Bull Run","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/discover-why-crypto-whales-are-quietly-stocking-up-on-this-gamblefi-token-for-the-2024-bull-run.htm","publishDate":"2024-04-19T16:09:07","id":17504,"type":null,"title":"Discover Why Crypto Whales Are Quietly Stocking Up on This GambleFi Token for the 2024 Bull Run","category":["Industry Talk "],"content":["A new ICO for Solana GambleFi token Mega Dice (DICE) started this week and it has already raised over $350,000 in just a few days of launching, according to an announcement on Mega Dice’s X account. ","","The ICO began on Wednesday, and within 24 hours it had already netted a whopping $300,000. Early support came strong because Mega Dice has already established itself pretty well in the world of GambleFi, aka crypto casinos.","It launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram.","This week’s launch of the DICE token ratchets Mega Dice’s services to a whole new level. Being the platform’s native token, players can use it as casino chips, to fund games and receive payment, with some games requiring the token.","DICE will serve as a funding and payment token on Mega Dice’s platform, with certain games requiring the token to play,","Mega Dice has a staggering array of games for the casual player. The website currently offers over 4,500 games, including classic staples like slots, roulette and blackjack, in addition to a bookmaker.","DICE has a hard supply cap of 420 million tokens, with 35% allocated to the presale, which can be accessed via the official website, where the token sells at a current fixed price of $0.069 per coin. This is the cheapest price investors can purchase it for in the ongoing presale.","The token can also be staked to earn passive income, with 10% of the total supply earmarked by its progenitors for staking rewards.","This indicates to early investors that DICE is a token from a well-established brand with strong fundamentals and utility.","It shows promise for significant near-term growth as it integrates into the casino’s loyalty program, offering more generous rewards to native token users and access to competitions for lifestyle prizes and experiences.","The casino has also announced a buyback and burn programme, which will reduce the supply, increasing scarcity and potentially pumping value.","","Finally, there will be a $2.25 million airdrop across three seasons of $750,000 each, including early bird bonuses, limited edition NFTs, and a referral program that gives people a 10% cut of the initial investment of any gamer they refer to the casino. ","The Mega Dice casino currently has around 50,000 players. Meanwhile, the sportsbook offers live streams of the most popular games in over 50 sports and esports, with average collective monthly wagers at $50 million between some 10,000 monthly active users.","So, in short, the reason why investors love Mega Dice so much at the minute is because it offers clear direction, impressive fundamentals and multiple ways to increase wealth.","Stay in touch with Mega Dice token ($DICE) news and developments on X\/Twitter and Telegram.","Don’t miss out.","Join the presale now on the website.",""],"entity":[{"type":"10%","content":"PERCENT"},{"type":"$2.25 million","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"$DICE","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"this week","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"$0.069","content":"MONEY"},{"type":"$350,000","content":"MONEY"},{"type":"Solana GambleFi","content":"ORGANIZATION"},{"type":"$750,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["dice","Gamblefi","Mega Dice"],"authors":["Tim Hakki"]}