{"summary":"LATAM’s New Crypto Mining ‘Promised Land’: Pluses & Minuses for Paraguay","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/latams-new-crypto-mining-promised-land-pluses-minuses-for-paraguay.htm","publishDate":"2022-08-23T00:00:00","id":17502,"type":null,"title":"LATAM’s New Crypto Mining ‘Promised Land’: Pluses & Minuses for Paraguay","category":["Bitcoin News "],"content":[" ","Paraguay has become a “new Latin American Mecca for cryptocurrency mining,” a new report has claimed – but not everyone seems to be happy about the fact that more miners than ever are choosing to set up shop in the nation.","As previously reported, the Paraguayan Senate last month signed off on a bill that will regulate crypto mining and trading in the nation. The bill, which has been in the pipelines since September 2021, seeks to legalize mining and ensure that miners pay taxes and declare their activities.","Many Paraguayan politicians have argued that the mining sector could be a major money-spinner for the government and power companies. The nation is home to a number of large hydroelectric power stations that periodically produce surplus power.","As this surplus power often cannot be used by Paraguayans, many advocates have called for international miners to be encouraged to set up shop near dams and power plants. While other industries have little use for irregular power supply, this is not the case for miners, whose rigs can take advantage of power when it is available and sit idle when this is not the case. Miners from as far afield as Canada and China have already been courted, with talks still ongoing with some of the parties fleeing China’s crypto crackdown of September 2021.","El Pais reported that an abundance of “very cheap electricity” has turned the nation into a “promised land for profitable Bitcoin mining,” and remarked that former “jungles” in Ciudad del Este, San Pedro, and Paraguarí have already become major mining centers.","This is also the case in “rural towns” with high populations of ethnic Germans, such as Villarrica.","The bill, which must now be approved or vetoed by President Mario Abdo Benítez, will seal the fate of the nation’s crypto mining sector.","But Luis Benítez, a university professor and long-time home crypto miner, claimed that only industrial miners stand to benefit – and that “amateur and domestic” miners stand to gain nothing from it. Benítez claimed that politicians had “only met with large mining firms” before formulating the bill, and had created legislation “very hastily, without taking into account issues pertaining to energy and tax policy.”","In fact, power companies have also expressed their concerns. A national energy provider has previously asked the government to oblige miners to pay in advance for electrical power – and to settle their bills in USD.","Other political critics have claimed that the energy should instead be donated to poorer families.","But the reality of the situation is that right now, Paraguay has little use for hydroelectric power. The media outlet explained that the country has “hardly any industry or infrastructure” that can harness the electrical energy, so “its seven million inhabitants cannot benefit from” the resource. Instead, public transport, cars, and agricultural vehicles generally make use of fossil fuels – meaning that a mere 20% of Paraguay’s hydroelectric power actually gets used in the country where it was generated.","This means that some miners have been wooed with promises that they will pay as little as USD 18 per megawatt hour for electricity. This is a huge difference from “the average price paid in South America,” which, per the former energy minister Mercedes Canese “is around USD 100 dollars per megawatt hour.”","Canese claimed that this price was too low, and claimed that energy importers are charged higher rates than miners.","Canese opined that “in the context of climate change,” it does not make sense to “dedicate so much energy to something that does not produce [anything] and does not create jobs.”","She added that many miners only agreed to set up shop in Paraguay if they were allowed to make use of subsidized rates, and bemoaned the fact that crypto mining does not “generate wealth” for the nation.","Miners, she said, were making big profits from “raw materials,” and “on top of that enjoying subsidies.”","Regardless, there is evidence that mining could provide some new opportunities for certain Paraguayans. The media outlet gave the example of the Villarrica resident and native Christian Katz, who has built a business that helps miners connect to the internet.","But there are other wrinkles that are perhaps forcing Paraguay’s hand when it comes to fast-tracking crypto mining regulation. Under a bilateral agreement with Brazil, which shares many of the rivers that are damned by Paraguayan power stations, Paraguay must donate all the electricity that it does not make use of (or sell) to its neighbor.","And in 2019, illegal crypto miners were found stealing electricity from hydroelectric power plants – perhaps highlighting the need to legalize and tax the industry before it can go underground.","____","Learn more: \n– Paraguay’s Senate Approved a Bill Regulating Crypto Mining and Trading\n– Paraguay: Bitcoin & Crypto Mining Bill Passes Senate, Heading to Lower House\n\n– Paraguayan Senate to Debate Taking Bitcoin Mining ‘Out of the Grey Area’\n– Q2 Saw Over 59% of Bitcoin Mining on Sustainable Energy Mix – Bitcoin Mining Council\n\n– ‘The Reckoning’ & ‘The Best Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n– Bitcoin & Crypto Mining in 2022: New Locations, Technologies, and Bigger Players"],"entity":[{"type":"Lower House\n\n– Paraguayan Senate to Debate Taking Bitcoin Mining","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n– Bitcoin & Crypto Mining","content":"ORGANIZATION"},{"type":"USD 100 dollars","content":"MONEY"},{"type":"Technologies","content":"ORGANIZATION"},{"type":"– Paraguay’s Senate","content":"ORGANIZATION"},{"type":"Bitcoin Mining on Sustainable Energy Mix – Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Mario Abdo Benítez","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Bill Regulating Crypto Mining","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"South America","content":"LOCATION"},{"type":"Christian Katz","content":"PERSON"},{"type":"Luis Benítez","content":"PERSON"},{"type":"Bitcoin & Crypto Mining Bill Passes Senate","content":"ORGANIZATION"},{"type":"59%","content":"PERCENT"},{"type":"Villarrica","content":"LOCATION"},{"type":"Paraguayan Senate","content":"ORGANIZATION"},{"type":"San Pedro","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Ciudad del Este","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"Grey Area","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Brazil","China","Ecology","Latin America","Mining","Politics","Regulation","Tax"],"authors":["Tim Alper"]}