{"summary":"Breaking: Judge Sentences FTX Founder Sam Bankman-Fried to 25 Years in Prison, Fined $11 Billion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sbf-gets-25-years-in-prison-11-billion-fine-as-judge-finds-perjury-in-his-testimony.htm","publishDate":"2024-03-28T16:04:17","id":17506,"type":null,"title":"Breaking: Judge Sentences FTX Founder Sam Bankman-Fried to 25 Years in Prison, Fined $11 Billion","category":["Blockchain News "],"content":["Disgraced FTX founder Sam Bankman-Fried has been sentenced to 25 years in prison and an $11.02 billion fine, Judge Lewis A. Kaplan ruled in Manhattan federal courthouse Thursday morning.","Kaplan likened Bankman-Fried’s theft of nearly $8 billion in customer funds to “a game,” where he weighed “the cost of getting caught discounted by probability or improbability, against the gain of getting away without getting caught, given the probabilities.”","“That was his game,” Kaplan said. “ It started at least as early as Jane Street and it continued to the very end. It’s his nature.”","Bankman-Fried was convicted on seven fraud charges in November 2023 after a whirlwind trial that saw the FTX founder testify in his own defense.","In Thursday morning’s ruling, Kaplan called Bankman-Fried’s defense “misleading, logically flawed, and speculative,” saying he had never seen a “performance” like his testimony throughout his entire career.","“To put it in more colloquial terms, a thief who takes his loot to Las Vegas and successfully bets the stolen money is not entitled to a discount on the sentence by using his Las Vegas winnings to pay back all or part of what he stole when if or when he gets caught,” Kaplan continued.","“He knew it was wrong,” Kaplan continued. “He knew it was criminal. He regrets making a bad bet against the likelihood of getting caught – and he’s not going to admit a thing.”","A visibly thinner Bankman-Fried was escorted into the courtroom by two security guards in a beige jumpsuit, his hair still in its signature curly mop.","“I know a lot of people feel really let down, and they were right, they were, were very let down,” Bankman-Fried told the court. “I’m sorry about that. I’m sorry about what happened at every stage, things I should have done and said, and things I shouldn’t have. I failed everyone I care about and everything I care about too.”","He went on to apologize to his FTX colleagues, his brother Gabe, and those impacted by the exchange’s collapse, claiming that it “haunts” him every day and causes him “excruciating guilt.”","However, he doubled down on his claim that the exchange “always” had enough assets to cover its losses.","Bankman-Fried’s new lawyer, Marc Mukasey, largely tried to deflect from his client’s image as a “monster” to that of a seemingly awkward math nerd who was well-meaning but ultimately flawed.","“SBF doesn’t make decisions with malice in his heart,” Mukasey said. “He makes decisions with math in his head.”","Does anybody know which politicians haven't returned the fraudulent donations received from Sam Bankman Fried? #SBF","— Carol Roth (@caroljsroth) March 28, 2024","","This logic came back to hurt his client when Kaplan claimed that the same cost-benefit mindset presented “a not trivial risk” for the crypto fraudster to execute another scheme.","He further claimed Bankman-Fried’s push for crypto regulation during his time as FTX’s CEO was “all an act,” claiming the fraudster wanted “to be a hugely, hugely politically influential figure in this country.”","Bankman-Fried was facing a total maximum penalty of 110 years in prison, with prosecutors pushing for upwards of 40 years for the former “king of crypto.”","Meanwhile, the defense requested a maximum penalty of six years in prison for their client.","Kaplan has ordered Bankman-Fried to be placed in a medium-security prison, potentially back in his home state of California. He is currently being held at the Metropolitan Detention Center in Brooklyn, NY."," "],"entity":[{"type":"Marc Mukasey","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"Mukasey","content":"PERSON"},{"type":"Kaplan","content":"PERSON"},{"type":"Jane Street","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$11.02 billion","content":"MONEY"},{"type":"Gabe","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Metropolitan Detention Center","content":"ORGANIZATION"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"March 28, 2024","content":"DATE"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Carol Roth","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","SBF"],"authors":["Julia Smith"]}