{"summary":"Flamengo, one of Brazil’s biggest sports franchises, announced on Thursday that it would launch a number of web3 products via a multi-year partnership with MoonPay.\nThe scope of the partnership could include loyalty programs, unique experiences and complimentary offers.","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175247\/flamengo-teams-up-with-moonpay-on-multi-year-web3-loyalty-scheme","publishDate":"2022-10-06T08:07:37","id":1750,"type":null,"title":"Flamengo teams up with MoonPay on multi-year web3 loyalty program","category":["NFTs"],"content":["Flamengo, one of Brazil's biggest sports franchises, announced on Thursday that it would launch a number of web3 products via a multi-year partnership with MoonPay.&nbsp;The fiat on-ramping service-turned-web3 infrastructure provider will attempt to help boost fan engagement at the football club through ticketing, marketing and merchandise, according to a release.&nbsp;","The scope of the partnership could include loyalty programs, unique experiences and complimentary offers, the company said — giving the example of personalized food and beverage options during games.","“NFTs and web3 technology have helped increase fan engagement and loyalty as well as create new revenue streams worth hundreds of millions of dollars for sports teams around the world,” said Ivan Soto-Wright, co-founder and CEO of MoonPay.&nbsp;","The pair will share the revenue, a MoonPay spokesperson told The Block when asked about the value of the deal.&nbsp;","Over the course of the pandemic, the way football clubs make money has been brought into sharp focus — with near-total shutdowns in sports, and games played in empty stadiums during lockdowns. The combined revenue of European clubs <a href=\"https:\/\/www.theguardian.com\/football\/2021\/jul\/29\/european-football-clubs-revenue-declines-by-34bn-over-pandemic\" data-v-f87c67ca=\"\">declined<\/a> by £3.4bn ($3.8bn) to £22bn ($24.7bn), according to the Deloitte Annual Review of Finance.","This is MoonPay's first foray into the sports market, and it follows brands such as Socios into the space. Socios is known for pairing up with football clubs to launch fan tokens. These have previously been <a href=\"https:\/\/theathletic.com\/2774492\/2021\/08\/18\/investigation-socios-fan-tokens-what-they-really-are-and-how-they-work\/\" data-v-f87c67ca=\"\">criticized<\/a> for being volatile, and also for being a conduit for fans to lose money through.","MoonPay <a href=\"https:\/\/www.theblock.co\/post\/153119\/moonpay-officially-launches-utility-nft-minting-service-hypermint\" data-v-f87c67ca=\"\">launched<\/a> HyperMint earlier this year – a platform that allows brands to create and mint their own utility NFTs. In September, it said it would <a href=\"https:\/\/www.theblock.co\/post\/171491\/moonpay-universal-create-an-in-person-nft-based-scavenger-hunt-with-more-than-6-million-tokens\" data-v-f87c67ca=\"\">launch<\/a> an in-person NFT scavenger hunt at Universal Studios Theme Parks.&nbsp;It has also previously had a sideline in brokering sales of expensive NFTs for celebrities through a white glove concierge service.&nbsp;","MoonPay was valued at $3.4 billion in a recent funding round.&nbsp;&nbsp;"],"hashtag":[]}