{"summary":"The creditor committee in Celsius&#x27;s Chapter 11 bankruptcy case has reached an agreement with the DOJ on its request to appoint an examiner. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168733\/creditor-representatives-support-plan-to-appoint-examiner-in-celsius-bankruptcy","publishDate":"2022-09-08T17:36:04","id":1751,"type":null,"title":"Creditor representatives support plan to appoint examiner in Celsius bankruptcy","category":["LEGAL"],"content":["The Committee of Unsecured Creditors in Celsius's Chapter 11 bankruptcy case has reached an agreement with the Department of Justice on its request to appoint an examiner to the lender.&nbsp;","If the proposed order approved, a neutral investigator would be appointed to conduct an investigation into Celsius’s storage of crypto holdings, account management for customers, status of its mining business, and taxes—issues that involved parties have continuously asked for clarity on.","Unsecured creditors in the case previously said they had concerns that the broad scope of a proposed third-party investigation could be costly to the estate and prolong the bankruptcy proceedings. Now they say they’ve reached consensus with the Justice Department’s Office of the U.S. Trustee.","\"This resolution, if approved by the court, will balance the need for transparency with the risks of significant costs\/delay. If the court orders the appointment of an examiner, we will work with that individual to ensure transparency and accountability for account holders,\" the Unsecured Creditor Committee <a href=\"https:\/\/twitter.com\/CelsiusUcc\/status\/1567944970547372039?s=20&amp;t=XQGJW-_3FhoQlRiYlSvbrg\" data-v-f87c67ca=\"\">posted<\/a> from its official Twitter account.&nbsp;","If an examiner is assigned, they will prepare and file an investigation report within 60 days of receiving approval of their investigation plan.&nbsp;","The U.S. Trustee called for an examiner last month, arguing it was necessary due to a continued lack of sufficient information. That initial <a href=\"https:\/\/www.theblock.co\/post\/164417\/us-trustee-moves-to-appoint-examiner-in-celsius-bankruptcy-case\" data-v-f87c67ca=\"\">motion<\/a> planned to include a look into allegations of \"fraud, dishonesty, incompetence, misconduct, mismanagement, or irregularity in the management of the affairs of [the Debtors] of or by current or former management of [the Debtors].\" The U.S. Trustee argued an outside examiner could provide visibility into Celsius's business model and balance sheet in addition to fostering public trust.","Yesterday, state securities regulators in Vermont and Texas filed their <a href=\"https:\/\/www.theblock.co\/post\/168369\/celsius-ran-a-ponzi-like-scheme-states-allege\" data-v-f87c67ca=\"\">support<\/a> for an examiner, saying Celsius' public statements were inconsistent and may have misled investors. The evidence included in the filing suggested Celsius may have been using a Ponzi-like scheme to pay yields.&nbsp;","A group of borrowers in the case also filed their support for an examiner yesterday, but proposed the appointment of a chapter 11 trustee to mitigate the expenses and time costs of an examiner.&nbsp;","The issues and order will be discussed at the upcoming Sept. 14 hearing.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vermont","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sept. 14","content":"DATE"},{"type":"Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"Celsius","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Unsecured Creditor Committee","content":"ORGANIZATION"},{"type":"U.S. Trustee","content":"ORGANIZATION"},{"type":"Ponzi","content":"LOCATION"},{"type":"Justice Department’s Office","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}