{"summary":"Coinbase has launched a new asset-recovery tool for unsupported ERC-20 tokens.\nThe feature will allow Coinbase users to recover some 4,000 mistakenly sent tokens.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195309\/coinbase-unsupported-erc20-tokens-recovery","publishDate":"2022-12-15T09:00:21","id":1752,"type":null,"title":"Coinbase now helps recover unsupported ERC-20 tokens sent by mistake","category":["Exchanges"],"content":["Crypto exchange operator Coinbase launched a new asset recovery tool for approximately 4,000 unsupported ERC-20 tokens.","If a user has mistakenly sent unsupported tokens to their Coinbase address, the company will help recover those tokens by charging a fee.","\"Our recovery tool is able to move unsupported assets directly from your inbound address to your self-custodial wallet without exposing private keys at any point,\" Coinbase said. \"We did this by using patent-pending technology to send the funds directly from your inbound address without processing the funds through our centralized exchange infrastructure.\"","Coinbase charges a 5% fee for recovering assets worth over $100, and a separate network fee applies to all recoveries. To recover their funds, customers will need to provide two details — the Ethereum transaction ID for the transaction where the asset was lost and the contract address of the lost asset — Coinbase said.","The feature is not available for Coinbase's Japan and Prime (or institutional) customers, the company said.","Coinbase rival Binance does not offer coin recoveries. Still, if a customer has suffered a \"significant loss\" due to incorrectly depositing unlisted tokens, Binance may assist them in recovering those tokens solely at its discretion, and the recovery isn't guaranteed, according to <a href=\"https:\/\/www.binance.com\/en\/support\/faq\/frequently-asked-questions-on-incorrect-deposits-115003798632\" data-v-f87c67ca=\"\">information<\/a> on its website.","Coinbase said it is the first major crypto company to offer ERC-20 recoveries at scale while preserving the security of customer deposit addresses. \"We’re reducing the points of friction and focus on improving usability to better serve and earn the trust of mass consumers,\" it added.","Earlier this week, Coinbase CEO Brian Armstrong <a href=\"https:\/\/www.theblock.co\/post\/194804\/coinbase-ceo-says-market-fear-and-volatility-are-a-moment-to-shine\" data-v-f87c67ca=\"\">told<\/a> staff in a memo that it is the company's \"moment to shine\" amid market fear and volatility. Armstrong urged employees to be \"prepared to serve\" customers amid challenging market conditions."],"hashtag":["COINBASE","ETHEREUM"]}