{"summary":"‘Buy Bitcoin’ Sign Held up During Yellen’s Testimony to Congress in 2017 Being Auctioned Off","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/buy-bitcoin-sign-held-up-during-yellens-testimony-being-auctioned-off.htm","publishDate":"2024-04-12T14:29:16","id":17521,"type":null,"title":"‘Buy Bitcoin’ Sign Held up During Yellen’s Testimony to Congress in 2017 Being Auctioned Off","category":["Bitcoin News "],"content":["In 2017, a meme of Christian Langalis went viral after he held up a “Buy Bitcoin” sign during Federal Reserve Chair Janet Yellen’s Congressional testimony. ","Langalis, also known as the “Bitcoin Sign Guy” is now auctioning off the exact same Bitcoin sign sketched on a yellow legal pad that he held up behind Yellen. ","The iconic drawing marked Bitcoin’s intrusion into the global monetary landscape. The sign has been described on the auction website as one of the few widely recognised physical Bitcoin artefacts, given Bitcoin’s virtual nature. Beloved by Bitcoin enthusiasts, the sign has spawned countless memes, derivative works, and imitation stunts. Yellen has maintained vocal criticism of Bitcoin.","Here’s an X post from 2017 showing Langalis cheekily peering over Yellen’s shoulder as she opposes audits of the Fed. Langalis looks at the camera and raises a yellow legal pad for a few seconds with the words “Buy Bitcoin” scrawled in black ink. Yellen continues her testimony unaware. ","Somebody just held up a \"Buy Bitcoin\" sign during Yellen's testimony to Congress… #Bitcoin #Yellen pic.twitter.com\/bf3e0bRRvL","— Tanzeel Akhtar (@Tanzeel_Akhtar) July 12, 2017","","After Langalis held up the sign a spokesperson for the House Financial Services committee said in a statement: “It is against the rules for people in the audience to display signs during a hearing, so they were told to leave the hearing and they did.” ","Since then Langalis has gained fame and said:","When Bitcoiners ask me about the sign, I tell them, “You’d have done the same in my seat.” Yes, only I attended the hearing, drew the sign, and flashed it for the camera. However, it was the network spirit which seized the image and fabricated the memes. The full poetry of the stunt was far beyond my devising, therefore, my attitude can only be one of post-authorship. Bitcoin was massively rupturing into the halls of institutional finance in 2017. Any Bitcoiner worth their sats would have told you so. It’s good to finally liberate this number from my sock drawer and offer it back to the Bitcoin public. The message was subversive then, but now merely obvious: Bitcoin is flowing. Control is dead.","In 2017 Bitcoin started the year trading between $1,000 and $1,200. Today Bitcoin is trading at around the $69,000 mark. Bidding for the iconic “Buy Bitcoin” sign starts on April 18th. The auction ends Wednesday, April 24, 7 pm ET."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Wednesday, April 24","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"April 18th","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"$1,200","content":"MONEY"},{"type":"Langalis","content":"PERSON"},{"type":"Tanzeel Akhtar","content":"PERSON"},{"type":"$69,000 mark","content":"MONEY"},{"type":"July 12, 2017","content":"DATE"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Bitcoiners","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Auction","Bitcoin","Janet Yellen"],"authors":["Tanzeel Akhtar"]}