{"summary":"As Pepe Price Skyrockets, Watch Out for This Emerging Meme Coin Poised for Exchange Listings — Could It Be the Next 100x?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/as-pepe-price-skyrockets-watch-out-for-this-emerging-meme-coin-poised-for-exchange-listings-could-it-be-the-next-100x.htm","publishDate":"2024-04-24T15:14:38","id":17525,"type":null,"title":"As Pepe Price Skyrockets, Watch Out for This Emerging Meme Coin Poised for Exchange Listings — Could It Be the Next 100x?","category":["Industry Talk "],"content":["Pepe the frog ($PEPE), the fourth largest meme coin by market capitalization and the fortieth largest cryptocurrency overall, has rallied 15% overnight to trade at $0.057865 as of this writing, according to data by CoinGecko. ","The gains appear to have been largely spurred on by the news last night that American crypto exchange giant Coinbase has launched PEPE perpetual futures trading.","Our 1000PEPE-PERP market is now in full-trading mode on Coinbase International Exchange and Coinbase Advanced. Limit, market, stop, and stop limit orders are all now available. pic.twitter.com\/hO32wARVFu","— Coinbase International Exchange 🛡️ (@CoinbaseIntExch) April 23, 2024","","However, PEPE isn’t the only funny token rallying sharply today. In fact, among those rallying by double-digit percentage figures, PEPE is a little behind.","DogWifHat (WIF) grew 20% over the last 24 hours to change hands at $3.37, Floki (FLOKI) added 16% to trade at $0.0001998, while BONK mushroomed a staggering 33% to hit $0.00002701 as of this writing. ","Still, meme coins are faring much better than the market leaders today.","The original and biggest cryptocurrency, Bitcoin (BTC) remains unchanged from yesterday at around $66,395. Its closest contender Ethereum (ETH), the most commercially important blockchain, added a slight 2% to trade at $3,245. ","PEPE’s trading chart outlines the rollercoaster ride that many meme coins have been on over the last three months. The end of February began a rally that saw PEPE reaching a new high watermark of $0.00001064 on March 14. Today’s price represents a 26% pullback from that. ","PEPE is currently in recovery mode.","Its value is going up, but its Relative Strength Index is 65 and falling, indicating that the latest spate of buying (prompted by the Coinbase announcement) is cooling off. Still, PEPE is not likely to lose much from this downturn in the short-term.","The token is currently hovering at a strong psychological support threshold, but should further losses occur, it could find safety at $0.000007. ","Pepe is a massively successful meme coin because, like its rivals Dogecoin, Bonk and DogWifHat, the underlying meme that inspired it has oodles of cultural capital.","However, dog coins and Pepe are beginning to feel like meme coins from a different era. Crypto has changed very rapidly over the last few months, thanks largely to pivotal market narratives such as the launch of eleven spot Bitcoin ETFs in January and Bitcoin’s fourth quadrennial halving update last weekend.","In short, the jokes around Pepe and the dog coins run the risk of getting stale.","Enter Solana’s latest meme coin sensation Slothana ($SLOTH). From the clock on the wall indicating 4:20 to his baked red-eyes and contented smirk, Slothana is clearly cut from a different cloth. ","Slothana has raised over $15 million in his ICO as traders flocked to the coin hoping to catch some of the early price booms of other Solana meme legends that have pumped recently, like Slerfs, DogWifHat and Bonk.","🚀🌕 Prepare for a moonshot as we ready the engines of the Slothship! 🌿🦥 With the launch just around the corner, our slothful crew is gearing up for an epic journey through the crypto cosmos. Buckle up and hold onto your branches, because there's just 6 days to go 🌌🌟… pic.twitter.com\/yHBrE3NP5x","— Slothana (@SlothanaCoin) April 22, 2024","","Interested investors can join the SLOTH presale today by sending SOL to this address: EnSawje2vQSQKtGbPYdXEuYKm2sHgeLKJTqCmrDErKEA or using the contribution widget on the Slothana website.","Every 1 SOL paid gets 10,000 SLOTH.","Interested investors have just under five days left to buy at this price before the presale window closes on April 29…","Visit Slothana Here",""],"entity":[{"type":"$SLOTH","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"$3,245","content":"MONEY"},{"type":"$0.00001064","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Bonk","content":"LOCATION"},{"type":"last weekend","content":"DATE"},{"type":"Bonk","content":"PERSON"},{"type":"BONK","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"last three months","content":"DATE"},{"type":"April 22, 2024","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Pepe","content":"PERSON"},{"type":"Coinbase Advanced","content":"ORGANIZATION"},{"type":"$66,395","content":"MONEY"},{"type":"last night","content":"TIME"},{"type":"$0.0001998","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Slothana","content":"LOCATION"},{"type":"33%","content":"PERCENT"},{"type":"$PEPE","content":"MONEY"},{"type":"$0.00002701","content":"MONEY"},{"type":"March 14","content":"DATE"},{"type":"American crypto","content":"ORGANIZATION"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"Slothana","content":"PERSON"},{"type":"April 29…","content":"DATE"},{"type":"$0.057865","content":"MONEY"},{"type":"$3.37","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"$15 million","content":"MONEY"},{"type":"26%","content":"PERCENT"},{"type":"$0.000007","content":"MONEY"},{"type":"April 23, 2024","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Meme Coins","Pepe","slothana"],"authors":["Tim Hakki"]}