{"summary":"Top Crypto Gainers Today on DEXScreener – SOLBET, KITTY, AMC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-crypto-gainers-today-on-dexscreener-solbet-kitty-amc.htm","publishDate":"2024-05-14T02:30:03","id":17533,"type":null,"title":"Top Crypto Gainers Today on DEXScreener – SOLBET, KITTY, AMC","category":["Altcoin News "],"content":["With major cryptocurrencies seeing tentative gains at the start of the week, with Bitcoin (BTC) rising 2.5% to $63,000 as Ether (ETH) struggled but failed to rise above $3,000, the top crypto gainers today were all to be found in the on-chain token markets.","Major cryptos remain locked within recent trading ranges ahead of a barrage of US data later in the week.","But trading activity in the meme coin space was set alight by the sudden, unexpected return of Roaring Kitty.","Legendary GameStop retail investor Roaring Kitty was a leading figure in the 2021 meme stock movement.","His return sparked calls for the return of meme season in crypto and stock markets.","Unsurprisingly, meme coins like Dogecoin (DOGE), Shiba Inu (SHIB), Pepe (PEPE) and dogwifhat (WIF) were outperformers.","But the top crypto gainers today were all new\/recently launched smaller meme coins with 2021 meme stock craze connections.","Here are some of the biggest movers, as per decentralized exchange (DEX) analytics tool DEXScreener.","","A spin on the name of the hugely popular retail trading community Wall Street Bets, which rose to fame during the 2021 meme stock craze, SOL STREET BETS is up big on Monday.","https:\/\/twitter.com\/SOL_STREET_BETS\/status\/1790032169907155010","As per DEXScreener, the Solana-based meme coin was last up 39,400% in 24 hours.","Its market cap was last still modest at just under $1 million.","SOLBET is definitely one to watch if the current meme coin explosion keeps growing.","It has $125,000 in locked liquidity and has been traded by nearly 12,000 unique wallets.","Before diving in, traders should remember that nearly all newly launched coins are either pump-and-dumps or scams of some sort.","Named after Roaring Kitty himself, Roaring Kitty (KITTY) rallied 1,000% in 24 hours on Monday. That made it one of the top crypto gainerst today.","Despite boasting no obvious use case, KITTY has been able to reach a market cap of $24.5 million.","https:\/\/twitter.com\/RoaringKSol\/status\/1790184156464603600","The token has $828,000 in locked liquidity and has been traded by nearly 13,500 individual wallets.","AMC Holdings was one of the most popular meme stocks of the 2021 craze.","Its no surprise then that an AMC-themed meme coin has exploded following Roaring Kitty’s return.","AMC first launched back in January and had faded into obscurity by April.","However, AMC sprung back into life on Monday and was last up 450%, as per DEXScreener. That made it a top crypto gainer today.","Meme Stonk Summer 🫡☀️","— AMC (@AMC0NSOL) May 14, 2024","","Its market cap was last $8.4 million, with $646,000 in locked liquidity.","The above-noted meme coins are all riding short-term hype and may quickly fade away.","Investors looking to make big gains might be better off picking a more classically themed meme coin with and exciting use case.","An exciting Shiba Inu-themed meme coin called Dogeverse (DV) could fit the bill perfectly.","Dogeverse is a multi-chain spin on Dogecoin, launching on the six most used blockchains, excluding Bitcoin, with multi-chain bridge capabilities.","There are a host of chains out there vying to be the go-to destination for meme coin launches – but Dogeverse plans to fit the bill by being present on all chains that matter.","Get on the degen train before it rides into the wrong #Wormhole!#DOGE #Memecoins #Altcoins #Solana #Base #Ethereum","— DogeVerse (@The_DogeVerse) May 6, 2024","","The exciting multi-chain meme coin is currently available in presale and has been able to raise a whopping more than $15 million so far.","Potential investors don’t have long to buy before launch. Keep in touch with developments on the project’s X\/Twitter and Telegram.","Visit Dogeverse Here",""],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"$125,000","content":"MONEY"},{"type":"1,000%","content":"PERCENT"},{"type":"$24.5 million","content":"MONEY"},{"type":"2.5%","content":"PERCENT"},{"type":"$63,000","content":"MONEY"},{"type":"Roaring Kitty","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"AMC","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$828,000","content":"MONEY"},{"type":"May 6, 2024","content":"DATE"},{"type":"Pepe (PEPE)","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$646,000","content":"MONEY"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"Roaring Kitty","content":"PERSON"},{"type":"39,400%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"AMC Holdings","content":"ORGANIZATION"},{"type":"450%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"$8.4 million","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["Meme coin","roaring kitty","Top crypto"],"authors":["Joel Frank"]}