{"summary":"‘UFC’ Token Goes Viral After Shooting Up 27,000% as New Doge-Themed Coin Attracts $4.3 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ufc-token-goes-viral-after-shooting-up-27000-as-new-doge-themed-coin-attracts-4-3-million.htm","publishDate":"2024-04-15T16:47:14","id":17547,"type":null,"title":"‘UFC’ Token Goes Viral After Shooting Up 27,000% as New Doge-Themed Coin Attracts $4.3 Million","category":["Industry Talk "],"content":["In the latest Solana meme coin pump, the new meme coin – Ultimeme Fighting Championship (UFC token) – has exploded +27,000%.","This article will provide an analysis of UFC’s current price trends and look to see whether an innovative multi-chain meme coin, Dogeverse, represents a more promising investment opportunity at this time.","Start with $UFC on solana","Ultimeme Fighting Championship awaits you.","CA – 2SS2EUeUNCs2KmtkyHK58fpiFK2US7LrvUtAVEF2yiwG pic.twitter.com\/OnOih0rFcQ","— 04444.eth (@04444E) April 15, 2024","","Ultimeme Fighting Championship was launched as part of a GameFi project that offers an interactive gaming experience connected with the $UFC token.","As price action consolidates following the aggressive move, Ultimeme Fighting Championship is currently trading at a market price of $0.0015 (representing a 24-hour change of +35,745%).","This comes after UFC launched at just 19:30 UTC on April 14, in an impressive launch that reeled in instant traction (no mean feat against a wider market drawdown!).","","The dramatic DEX listing saw UFC climb an almost unimaginable +8,000,000% in just 1.5 hours—yet, in typical fashion, this was a too-good-to-be-true move.","Retracement set in almost as quickly as the pump, and over the subsequent hours, UFC price would sink by a troubling -82% amid a wholesale sell-off by early backers.","A well-defended support zone between $0.0005 and $0.0008 has now set the stage for a potential second run.","Indeed, with under 1,000 holders and a market cap under $500k, the UFC token could represent a strong entry at current levels, with as much as 10x gains still available to entrants at this stage.","Markets are clearly taking notice, with buy pressure now standing at 52% of transactions over the past 6-hours.","But while UFC price analysis might reveal that the UFC token is poised for a second rally, smart money investors are now shifting their attention to this new Omnichain meme coin.","","Dogeverse (DOGEVERSE), is a new multi-chain dog-themed meme coin project with an active presale that has currently raised over $4,619,385 in just days.","The meme coin is deploying its highly anticipated presale across multiple chains, including Ethereum, Avalanche, Base, and Solana.","#Cosmo is buzzing with excitement this morning! 🚀#DOGEVERSE has reached another insane milestone! 🌟","Raising more than $4.5 million! 💰","Have a great week everyone and let’s get our next goal of $5M! 💫🌌 pic.twitter.com\/JLGxocKaD1","— DogeVerse (@The_DogeVerse) April 15, 2024","","The project’s developer said this approach democratizes access, and anyone can acquire the coin, turbocharging growth – becoming a force across the crypto market.","Looking at events in the market, the in-demand Dogeverse presale will likely reap massive benefits as more users flock, searching for potent meme coins.","Supporters claim Dogeverse could be the next BONK and BOME, securing a $1 billion market cap in the coming weeks.","Don’t miss out on the next pump – follow Dogeverse on X to get the latest news and connect with the presale community on Telegram.","Join The DOGEVERSE Presale Here",""],"entity":[{"type":"$0.0008","content":"MONEY"},{"type":"$0.0005","content":"MONEY"},{"type":"April 15, 2024","content":"DATE"},{"type":"-82%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"Ultimeme Fighting Championship","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$4.5 million","content":"MONEY"},{"type":"$500k","content":"MONEY"},{"type":"$0.0015","content":"MONEY"},{"type":"Dogeverse","content":"LOCATION"},{"type":"52%","content":"PERCENT"},{"type":"$4,619,385","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$UFC","content":"ORGANIZATION"},{"type":"April 14","content":"DATE"},{"type":"UFC","content":"ORGANIZATION"},{"type":"+35,745%","content":"PERCENT"},{"type":"+8,000,000%","content":"PERCENT"},{"type":"$UFC","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"+27,000%","content":"PERCENT"},{"type":"Ultimeme Fighting Championship (UFC","content":"ORGANIZATION"},{"type":"$5M","content":"MONEY"}],"hashtag":["Meme coin","Solana meme coin","UFC token"],"authors":["Sam Cooling"]}