{"summary":"Shiba Inu Investors Target New Bitcoin ICO, Aiming for 100x Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shiba-inu-investors-target-new-bitcoin-ico-aiming-for-100x-returns.htm","publishDate":"2024-05-15T00:38:29","id":17540,"type":null,"title":"Shiba Inu Investors Target New Bitcoin ICO, Aiming for 100x Returns","category":["Industry Talk "],"content":["As Shiba Inu (SHIB) consolidates within the confines of a multi-month pennant structure and risks a downside breakout, investors are instead targeting an exciting new Bitcoin ICO called 99Bitcoins (99BTC), as they aim for potential 100x returns.","Legendary GameStop retail investor Roaring Kitty’s return to social media may have ignited sentiment amongst meme stock names but has failed to result in a lasting uptick in sentiment amongst the major meme coins like Shiba Inu.","Last just under $0.000023, SHIB continues to hold above its 100DMA. However, the price continues to be squeezed by the 50DMA.","Indeed, Shiba Inu has formed a pennant structure in recent months and a breakout appears imminent.","Pennant structures can break out in either direction. Should Shiba Inu break to the upside, an imminent move back above $0.000030 could be expected.","Conversely, should Shiba Inu break to the downside, a swift drop back to $0.000018 support is likely.","Macro catalysts will be in on Wednesday, with US CPI and Retail Sales data out.","Depending on how this data impacts Fed rate cut expectations, it could be either bullish or bearish for the market.","This could be the catalyst for Shiba Inu to break its current pennant pattern.","As SHIB threatens a downside break, it’s no surprise that investors are targeting alternative investments that could offer better returns.","One crypto that is getting the team at Cryptonews very excited is new Bitcoin ICO 99Bitcoins (99BTC).","99Bitcoins is a well-established crypto education platform that has been around now for nearly a decade.","99Bitcoins’ YouTube channel has over 700,000 subscribers and its platform has over 100,000 students enrolled.","Already a household name in the crypto education space, 99Bitcoins is taking the natural next step –learn-to-earn (L2E).","99Bitcoins is launching a new L2E token (99BTC) that is designed to reward individuals for learning about cryptocurrency.","And the new Bitcoin ICO plans to integrate its token with BRC-20 to pioneer L2E directly on the Bitcoin blockchain.","99BTC is currently available in presale, and fundraising efforts have so far been a resounding success.","The new Bitcoin ICO has already been able to raise over $1.25 million.","Over $1.25 Million raised in our $99BTC #Presale! 🔥","THANK YOU to our incredible community for pushing us past this milestone! 🙌","There’s still time to get involved and secure your $99BTC before the next stage begins.","Join now! 👉 https:\/\/t.co\/NXD7DAaUfZ#99Bitcoins #BTC pic.twitter.com\/gIYSn90dDR","— 99Bitcoins (@99BitcoinsHQ) May 14, 2024","","Tokens are currently priced at $0.00105. But potential investors need to move quickly as when the presale hits $2 million, that price will jump.","Learn More Here","99Bitcoins is currently running a whopping $99,999 BTC airdrop. 99 of the project’s early supporters will be picked at random. To enter, users need to follow the instructions on the website.","Our $99,999 $BTC #Airdrop is heating up, and the clock is ticking! ⏰","Ensure you've crossed off all the steps to boost your chances of being one of the 99 lucky winners! 🔥","Get started now! 👉 https:\/\/t.co\/ZXji0s6ACe#99Bitcoins #Tether #Coinbase pic.twitter.com\/cHRJ95Tpa3","— 99Bitcoins (@99BitcoinsHQ) May 7, 2024","","Not only might investors benefit from the project’s exciting airdrop, but 99BTC is also a passive income gem.","14% of the token supply is being reserved for staking rewards. Presale investors are already raking in APYs in excess of 1,350%, as per the staking dashboard.","27.5% is being reserved for project funds, 23% for marketing, 8% for liquidity and 17% for community rewards.","99Bitcoins’ new token has all the makings of a crypto that could do very very well.","99Bitcoins is already a leader in crypto education and will likely quickly be a leader in L2E.","The exciting airdrop and staking APY will also attract a lot of attention. 99BTC could well be a 100x gem.","Readers can learn more about $99BTC by checking out the whitepaper.","Buy 99BTC Here",""],"entity":[{"type":"$99BTC","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$0.00105","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"27.5%","content":"PERCENT"},{"type":"17%","content":"PERCENT"},{"type":"$0.000018","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$1.25 million","content":"MONEY"},{"type":"$99,999 $BTC","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$0.000030","content":"MONEY"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Bitcoin ICO","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"1,350%","content":"PERCENT"},{"type":"$2 million","content":"MONEY"},{"type":"23%","content":"PERCENT"},{"type":"US CPI","content":"ORGANIZATION"},{"type":"$99,999","content":"MONEY"},{"type":"$1.25 Million","content":"MONEY"},{"type":"14%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"$0.000023","content":"MONEY"},{"type":"May 7, 2024","content":"DATE"}],"hashtag":["L2E","SHIB","Shiba inu"],"authors":["Joel Frank"]}