{"summary":"Neon Labs, which is building a Solana EVM, has raised $40 million in a private token sale round.\nThe EVM will allow Ethereum-based dApps such as Aave to deploy on Solana more easily.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123744\/neon-labs-developer-of-ethereum-virtual-machine-on-solana-raises-40-million","publishDate":"2021-11-09T06:00:19","id":1754,"type":null,"title":"Neon Labs, developer of EVM on Solana, raises $40 million","category":["Venture Capital"],"content":["Neon Labs, a crypto startup building an Ethereum virtual machine (EVM) on Solana, has raised $40 million in a private token sale round.","Jump Capital led the round, with Three Arrows Capital, Solana Capital, Rockaway Blockchain Fund, Ethereal Ventures, IDEO CoLab Ventures, and others participating.","With fresh capital at hand, Neon Labs plans to scale its current team of 15 to over 30 in the next few months, CEO Marina Guryeva told The Block. The firm is looking for developers as well as marketing and business development talent to continue building its offerings.","Neon Labs' EVM is currently live on Solana testnet and devnet and will be launched on mainnet \"soon,\" said Guryeva. It will allow Ethereum-based decentralized applications (dApps) to deploy on Solana more easily.","\"Sushi, Aave and several more dApps have confirmed their interest in deploying on Neon EVM,\" said Guryeva. \"But they need us to enable integrations with the infrastructure providers to be able to do so. This is our first priority in parallel to the mainnet launch.\"","Aave and other dApps will be able to deploy on Solana through Neon EVM without needing to know Solana's Rust programming language. \"The ability to finally use Solidity [Ethereum's programming language] smart contracts to access the Solana ecosystem is a game-changer for us, and will drastically improve time to deployment,\" said Aave founder Stani Kulechov.","Neon Labs is looking to onboard more dapps and their users through liquidity mining incentive programs, said Guryeva.","The project was founded earlier this year and raised $797,000 from the Solana Foundation via convertible notes in May, said Guryeva, adding that more funds could be raised in the near future.","Projects looking to bring EVM functionalities to different blockchains have been raising money lately. Last month, Aurora Labs, which has built an EVM on NEAR blockchain, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120620\/aurora-ethereum-compatible-near-protocol-funding\" data-v-f87c67ca=\"\">raised<\/a> $12 million."],"hashtag":["ETHEREUM","SOLANA"]}