{"summary":"Crypto Experts Are Eyeing This New GambleFi Platform — 200x Presale Opportunity?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-experts-are-eyeing-this-new-gamblefi-platform-200x-presale-opportunity.htm","publishDate":"2024-04-29T13:20:26","id":17557,"type":null,"title":"Crypto Experts Are Eyeing This New GambleFi Platform — 200x Presale Opportunity?","category":["Industry Talk "],"content":["It’s only been running for a fortnight, but the presale for Solana’s hottest new GambleFi token, Mega Dice ($DICE), has already taken $600,000 in investments, according to the token’s website.","Mega Dice launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram.","Since then, 50,000 players have signed up and helped the casino become a well-established name in GambleFi. Rival businesses have followed suit and launched competitor iGaming bots on Telegram, most notably TG Casino.","From classic staples like slots, roulette and blackjack, to a comprehensive sportsbook streaming the most popular games from a diverse selection of over 50 sports and esports, Mega Dice’s website currently offers gamers over 4,500 ways to win. ","The bookie currently collects total average monthly wagers of $50 million between around 10,000 monthly active users.","Games Night Thursdays at 5 PM UTC live on our TG channel!","We'll be starting off with a $1000 balance and whatever is won will be shared among the contributors on the call! 🤑","🔗 https:\/\/t.co\/XKI0otbK3k pic.twitter.com\/IkBfxXSitn","— Mega Dice Casino (@megadice) April 25, 2024","","So, the numbers indicate that now is the perfect time for Mega Dice’s ICO. The casino’s new crypto token, $DICE, ramps up the online casino’s services to a whole new level. As the platform’s native token, players can use $DICE to fund games and receive payment, with some games requiring the token. Doing so will net them various advantages as the rollout proceeds. ","This clear potential led early investors to pump $300,000 into Mega Dice within twenty-four hours of the token going on presale.","$DICE’s supply is hard capped at 420 million tokens. Some 35% of those are allocated to the ongoing ICO, where the token has a current fixed price of $0.069 per coin. ","After the first $1 million raised (14.7 million tokens sold), the price will get incrementally higher as the presale proceeds through the next stages.","That makes today’s $DICE price the cheapest investors can purchase it for in the presale. Once it lists on exchanges, the sky’s the limit on potential upside","It also offers some moneymaking utility for non-gamblers too. Holders can stake $DICE to generate passive income. Some 10% of the total supply is set aside by the casino for staking rewards.","$DICE has raised over $500,000 in presale so far! 🔥","Thank you to each and every one of you for being part of our journey! 🙏❤️","Next up, $1 million! 🚀 pic.twitter.com\/N94CDeHBOh","— Mega Dice Casino (@megadice) April 25, 2024","","In addition to that, Mega Dice has outlined plans to integrate the token into the casino’s loyalty program, offering more generous rewards to gamers who play with the native token. It will also unlock access to exclusive competitions and VIP experiences.","The casino has also indicated that there will be a buyback and burn program. This means that Mega Dice will periodically buy some of the tokens and send them to wallets that can only receive tokens. Doing so reduces the circulating supply, increasing scarcity and potentially pumping value.","$DICE offers an irresistible roadmap. It’s the hottest new token in the fast-growing sector of GambleFi for several reasons; it’s backed by a well-established brand, it has transparent tokenomics, strong fundamentals, and utility beyond iGaming.","","Finally, there is a $2.25 million airdrop across three seasons of $750,000 each. To participate in the season 1, players have to wager $5000 or more between now and May 3. There is a maximum airdrop win of up to $37,500 per entrant. ","Other exciting offers on the horizon include early bird bonuses, limited edition NFTs, and a referral program promising gamers a 10% cut of the initial investment of any new player who signs up on their recommendation. ","Introducing #ReferAndEarn with $DICE! 🚀💰","You can now refer users to the Mega Dice presale and earn a generous 10% commission on all referral purchases.","Here's a simple guide on how to get started: 👇 pic.twitter.com\/jbXSdljjvK","— Mega Dice Casino (@megadice) April 24, 2024","","Given the myriad ways investors can put their DICE to work, it’s obvious why GambleFi investors are stacking the Solana-based Mega Dice. It’s a strong contender for some potentially heavy gains in the mid-term. ","Keep on top of Mega Dice token and casino news on X\/Twitter and Telegram.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"Mega Dice’s ICO","content":"ORGANIZATION"},{"type":"April 25, 2024","content":"DATE"},{"type":"$600,000","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$2.25 million","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"$1000","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"$DICE","content":"MONEY"},{"type":"IkBfxXSitn","content":"ORGANIZATION"},{"type":"$37,500","content":"MONEY"},{"type":"Solana","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"$5000","content":"MONEY"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"May 3","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Mega Dice presale","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Mega Dice (","content":"ORGANIZATION"},{"type":"TG Casino","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"$0.069","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$750,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["dice","Gamblefi","Mega Dice"],"authors":["Tim Hakki"]}