{"summary":"Coinbase Sues SEC for Crypto Rulemaking Refusal, Calls for Clarity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-sues-sec-for-crypto-rulemaking-refusal.htm","publishDate":"2024-03-12T06:55:38","id":17551,"type":null,"title":"Coinbase Sues SEC for Crypto Rulemaking Refusal, Calls for Clarity","category":["Blockchain News "],"content":["Coinbase has filed a lawsuit against the Securities and Exchange Commission (SEC), seeking a court directive for the regulatory authority to establish clear guidelines for the cryptocurrency sector.","In the lawsuit detailed in their March 11 court submission, Coinbase challenged the SEC’s lack of formal rulemaking for the crypto sector, asserting that the agency’s actions hindered the industry’s development and clarity.","The filing criticized the SEC for its passive stance on crypto regulation, arguing that the absence of specific rules has left the sector navigating a regulatory gray area.","“For years the SEC indicated that it had little statutory authority over digital assets and that what authority it did have was unclear,” stated Coinbase. “Market participants responded by investing heavily in a now two-trillion-dollar industry and built their businesses in compliance with relevant agencies’ regulatory frameworks.”","The exchange argued that this ambiguity not only stifled innovation but also put companies at a disadvantage due to uncertain compliance expectations.","“For any digital assets the SEC might properly classify as securities, rulemaking is the only way for the agency to draw clear lines identifying them, to provide fair notice, and to create a workable regulatory framework that makes compliance with the securities laws possible,” the filing reads.","In July 2022, Coinbase submitted a petition for digital asset securities regulation. However, “even while accelerating its campaign of enforcement suits against digital asset … the Commission ignored that petition until forced to explain itself.”","The filing reiterated that the SEC denied its petition and only provided a single sentence stating that it disagreed with the claim that the current regulatory landscape lacked workability.","Though the SEC has made digital asset a top priority of its operation, the exchange believed that the authority has adopted a hostile perspective and pursued more aggressive enforcement tactics.","The document listed that the company is suing the SEC to determine two major issues.","The first statement of the issue is “whether the Commission’s refusal to engage in rulemaking regarding digital assets violates the Administrative Procedure Act.”","The second issue is “whether the Commission’s failure to provide a reasoned explanation for its denial of Coinbase’s rulemaking petition is arbitrary and capricious.”"],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"March 11","content":"DATE"}],"hashtag":["Coinbase","SEC","United States"],"authors":["Hongji Feng"]}