{"summary":"Intermex has said that it won’t use Ripple solutions for “core” markets like Mexico\nIntermex chairman, president and CEO Robert Lisy said: “Ripple will not be an answer for places like Mexico.”\nRipple and Intermex partnered last month","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59520\/remittance-firm-intermex-says-it-wont-use-ripple-solutions-for-core-markets-like-mexico","publishDate":"2020-03-23T06:41:17","id":1755,"type":null,"title":"Remittance firm Intermex says it won’t use Ripple solutions for ‘core’ markets like Mexico","category":["Ripple"],"content":["Nasdaq-listed remittance firm International Money Express (Intermex), which partnered with Ripple last month, has said that it won’t leverage Ripple solutions for its “core” markets like Mexico.","In the latest <a href=\"https:\/\/edge.media-server.com\/mmc\/p\/q7d8947g\" data-v-f87c67ca=\"\">earnings call<\/a>, Intermex chairman, president and CEO Robert Lisy, <a href=\"https:\/\/seekingalpha.com\/article\/4330787-international-money-express-inc-imxi-ceo-robert-lisy-on-q4-2019-results-earnings-call?part=single\" data-v-f87c67ca=\"\">said<\/a>: “Ripple will not be an answer for places like Mexico.”","This is because Intermex has already built relationships with key payers in the region, such as Bancoppel and Elektra. “We have very tight relationships that [are] strategically setting plans and objectives with those payers. And so you won’t really see us leveraging Ripple in our core markets,” said Lisy.","Intermex CFO Tony Lauro also made a similar statement. He said Ripple solutions have “more applicability for us outside of Mexico, where we’re building out our network into other corridors.”","Notably, Ripple, at the time of the <a href=\"https:\/\/www.theblockcrypto.com\/post\/54987\/ripple-inks-new-deal-with-remittance-firm-intermex-which-will-utilize-its-xrp-payments-solution\" data-v-f87c67ca=\"\">partnership<\/a> announcement, <a href=\"https:\/\/ripple.com\/insights\/enabling-faster-cross-border-payments-between-the-us-and-mexico\/\" data-v-f87c67ca=\"\">said<\/a>: “Intermex to leverage RippleNet for faster, transparent cross-border remittance services between the United States and Mexico.”","That does not appear to be the case right now. Instead, Intermex looks to utilize Ripple solutions to bring growth in “newer markets,” said Lizy.","“I think it will bring us more growth in newer markets in places where we’re exploring going into ancillary products, but probably not in our core business because those are really critical where we differentiate ourselves from others because of the kind of volume we drive and the relationships we’ve built over the years with direct relationships,” said Lizy.","Intermex partnered with Ripple to use its On-Demand Liquidity (ODL) solution, which leverages XRP to settle cross-border payments.&nbsp;","The remittance firm, however, is yet to test the solution. Lauro said the testing would begin “later this year.”","As a result, Intermex is not sure as to what extent Ripple solutions will be “viable,” either from a “rate perspective or a capital efficiency perspective.” <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIf it turns out to be viable, \"we'll expand it. But it's too early to say how much we intend to do,\" said Lauro.","Intermex was founded in 1994 and is primarily focused on remittances across the Latin American-Caribbean corridor."],"hashtag":["XRP"]}