{"summary":"KyberSwap’s CEO Says Staff Strength Reduced by 50% Following Exploit and Related Challenges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kyberswaps-ceo-says-staff-strength-reduced-by-50-following-exploit-and-related-challenges.htm","publishDate":"2023-12-27T08:56:18","id":17558,"type":null,"title":"KyberSwap’s CEO Says Staff Strength Reduced by 50% Following Exploit and Related Challenges","category":["Blockchain News "],"content":["KyberSwap’s CEO Victor Tran says the company has reduced its staff by 50% following a $48 million exploit last month stressing on keeping operations running and compensating all affected users with their assets.","In a Dec 25 post, the CEO took to X (formerly Twitter) to explain the state of affairs following the incident noting several challenges posed and a growth of business operations including other significant roadmap implementation.","In the past month, KyberSwap has faced unprecedented challenges due to the Elastic exploit. Despite this, I am grateful to say that our core business, including the Aggregator and Limit Order functions, remains robust.","Moreover, we will soon be launching our Zap API, an…","— Victor Tran (@vutran54) December 25, 2023","","Tran noted that 50% of the workforce has been cut adding that the decision was a painful one because of the skills and dedication of the team.","“Regrettably, we have also reduced our workforce by 50%. The past few days have been among the most challenging in my journey as an entrepreneur. The decision to part ways with so many of our team members was heart-wrenching.”","The talent pool and support of the employees spurred the firm to create a database to connect staff to the ever-growing possibilities in web3. To support them, the CEO called for other organizations to consider them in their workforce noting their skills.","Onchain builder OxJume wrote on X about the privilege of working for the company becoming an alumni next month and seeking to build on Solana (SOL) next year.","Despite the challenges posed by the Elastic exploit, it suffered last month, the company still steers towards its development with a roadmap and plans to reimburse all users who lost their assets.","The company has implemented the KyberSwap Elastic Exploit Treasury Grant Program to cover all user losses gaining the support of the community as the company steers ahead.","Tran mentioned changes to the business operations for sustainable development and paused the liquidity protocol initiatives and KyberAI temporarily while Core business including the aggregator and order limit functions have increased.","To sustain the platform, the Zap API will see the onboarding of decentralized applications (dApps) and wallets will soon be launched to give users more tools as they interact with the platform.","“This development underscores our commitment to not only sustaining our platform but also to continuing to contribute to the wider DeFi ecosystem.” ","Last month, the digital asset community was stunned by the announcement of a massive exploit on the platform and the hacker’s subsequent demands.","After the incident, the company urged users to withdraw their assets but much of the damage has already been done. Data from DeFiLlama shows a drop from $80 million in total value locked (TVL) to $22.23 million following the incident.","The hacker proceeded to tease the company saying that negotiations would begin in a few hours after taking a rest and releasing on-chain messages and demands including taking over executive functions of the platform.","“Is this not sweet enough? I’ll go further still. Under my management, Kyber will undergo a complete makeover. It will no longer be the 7th most popular DEX, but rather, an entirely new cryptographic project.”"],"entity":[{"type":"past month","content":"DATE"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"KyberSwap Elastic Exploit Treasury Grant Program","content":"ORGANIZATION"},{"type":"Victor Tran","content":"PERSON"},{"type":"$22.23 million","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"$48 million","content":"MONEY"},{"type":"KyberSwap","content":"ORGANIZATION"},{"type":"December 25, 2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Kyber","content":"ORGANIZATION"}],"hashtag":["Hack","KyberSwap"],"authors":["David Pokima"]}