{"summary":"Here’s How Bitcoin Miners Performed Last Month After The Halving","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-miners-after-halving.htm","publishDate":"2024-05-06T23:34:19","id":17563,"type":null,"title":"Here’s How Bitcoin Miners Performed Last Month After The Halving","category":["Bitcoin News "],"content":["The largest Bitcoin miners have published their monthly performance figures for the first time since the Bitcoin network’s fourth halving event last month.","The TLDR is that the impact of the halving on the mining industry has been small thus far but still noticeable. Here’s everything you need to know.","CleanSpark (CLSK) – the second-largest Bitcoin miner by market cap at $3.92 billion – mined 721 BTC in April compared to 806 BTC in March, its monthly investor report states.","CLSK is currently one of the best-performing Bitcoin mining stocks year to date, surging 60% while other mining stocks suffered amid pre-halving market fears.","Compared to major rivals, the firm has proven most efficient at mining more BTC with a lower energized hash rate, which reached 17 exahashes per second (EH\/s) in April.","By contrast, Marathon Digital (MARA) – the largest Bitcoin miner worth $5.64 billion – mined a comparable 850 BTC last month, even though its energized hash rate is 50% higher at 29.9 EH\/s. Marathon Digital’s April update said its “average operational hash rate” was just 21.1 EH\/s, implying that many of its mining machines were not active even though they could be.","Riot Platforms (RIOT) has proven even less efficient, mining just 375 BTC on a 12.5 EH\/s energized hash rate and an 8.8 EH\/s average hash rate. RIOT stock was one of the worst hit between early January and the Bitcoin halving on April 19 and has done little to recover post-halving, trading 30% down year to date.","Made a pure degen play on $RIOT last week with the thought that if $BTC runs they will too. Then I did some \"research\" and saw that $MARA holds twice as much #bitcoin so I switched the play. It's working out well. pic.twitter.com\/BkGnCYJvO9","— moist (@moistttttttttt) May 6, 2024","","Several Bitcoin miners saw their BTC revenue drop less than 15% month over month, despite the halving being in effect for roughly one-third of it. B.C.-based miner Iris Energy was able to mine slightly more BTC month over month, thanks to an increase in its operating hash rate over that time.","Part of their performance was due to a temporary bump in transaction fee revenue last month spurred by the Runes protocol, which was launched at the same time as the halving. Runes is a new standard for minting tokens on Bitcoin’s blockchain that temporarily drove fees to over $150 apiece as traders raced to mint the tokens on the new standard.","Marathon reported earning 16% of its revenue last month through transaction fees. CleanSpark said it earned 48.3 BTC on one day in April, roughly double its monthly average."],"entity":[{"type":"$RIOT","content":"MONEY"},{"type":"$3.92 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$MARA","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$5.64 billion","content":"MONEY"},{"type":"April 19","content":"DATE"},{"type":"March","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"miner Iris Energy","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"May 6, 2024","content":"DATE"},{"type":"April","content":"DATE"},{"type":"s. Marathon Digital","content":"ORGANIZATION"},{"type":"$150","content":"MONEY"},{"type":"Marathon Digital (MARA","content":"ORGANIZATION"}],"hashtag":["Bitcoin halving","Bitcoin Miner","Marathon Digital"],"authors":["Andrew Throuvalas"]}