{"summary":"India and US Team Up To Tackle $360M Crypto-Funded Drug Ring","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/india-and-us-tackle-360m-crypto-funded-drug-ring.htm","publishDate":"2024-04-30T14:02:31","id":17562,"type":null,"title":"India and US Team Up To Tackle $360M Crypto-Funded Drug Ring","category":["Blockchain News "],"content":["Authorities from India and the US teamed up in a search operation in Uttarakhand to uncover a $360 million crypto-funded drug ring. ","The Indian Enforcement Directorate (ED) and the Federal Bureau of Investigations (FBI) conducted a search operation in Uttarakhand. This investigation uncovered a Rs 30 billion ($360 million) cryptocurrency scam.","This marks the conclusion of a lengthy investigation that began in August 2023. The ED initiated the investigation, but the arrests were made following a tip from US authorities.","The tip cited two Indian individuals allegedly involved in a drug trafficking operation with ties to an international drug trafficking ring. ","On April 27, the ED arrested Parvinder Singh and Banmeet Singh from Haldwani, Uttarakhand, following raids conducted a day earlier.","The FBI seized Rs 150 Billion in digital currency assets linked to the operation.","Crypto Scam! How FBI and ED teamed up to bust Rs 3,000 crore fraud – Detailshttps:\/\/t.co\/Zc7a3oHmmu","— ET NOW (@ETNOWlive) April 29, 2024","","The group allegedly used freely available online advertisements and dark web vendor marketplaces to facilitate drug sales, according to the report.","This acted as a channel for an organized system of distributors and distribution cells. Cryptocurrency was the heart of the operation, used to pay for drugs and launder earnings through crypto wallets.","Exploiting cryptocurrency allowed the organization to carry out its illegal activities without intervention. It gave them anonymity and freedom from the oversight of intermediaries present in traditional payment systems. ","The individuals reportedly used the same aliases across multiple dark web marketplaces, including Silk Road 1, AlphaBay, and Hansa.","In addition, the FBI and ED have continued to collaborate closely on the matter, with the ED sharing important documents related to the investigation.","The ED carried out an additional operation on the arrested Parvinder. His residence in Haldwani was searched for electronic devices used by him such as computers, tablets, or smartphones to carry out the alleged crimes.","India is among the top countries in the world when it comes to crypto adoption, despite the lack of clear regulations.","This investigation is just one instance of a string of cryptocurrency-related organized crime in India.","Something that has proven to be a struggle for India as they grapple with regulatory Ambiguity surrounding how they are addressed, often leaving victims in the dark.","Gaurav Mehta, social activist and CEO of Dharma Life, explained how this regulatory ambiguity provides a fertile ground for criminals in a Cryptonews interview. ","“The absence of regulation further emboldens criminals, as the existing justice system and law enforcement agencies lack the focus, capacity, and competency to combat crypto-related crimes. This regulatory void leaves victims in a state of helplessness.”","This marks a significant victory as India continues to face a surge in elaborate crypto frauds as adoption rises, with authorities struggling to prosecute perpetrators. ","More than ever, regulation and education are needed in India to prevent cryptocurrency scams and the criminal world’s continued exploitation of crypto technology.","The influence and involvement of foreign jurisdictions such as the US is a key step in bringing order to how crime surrounding cryptocurrency is handled."],"entity":[{"type":"Uttarakhand","content":"LOCATION"},{"type":"August 2023","content":"DATE"},{"type":"$360 million","content":"MONEY"},{"type":"April 29, 2024","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"30 billion ($360 million","content":"MONEY"},{"type":"Hansa","content":"LOCATION"},{"type":"Haldwani","content":"LOCATION"},{"type":"Indian Enforcement Directorate (ED)","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"April 27","content":"DATE"},{"type":"Gaurav Mehta","content":"PERSON"},{"type":"Federal Bureau of Investigations (FBI","content":"ORGANIZATION"},{"type":"Parvinder Singh","content":"PERSON"},{"type":"Banmeet Singh","content":"PERSON"}],"hashtag":["Crypto crime","India","United States"],"authors":["Harvey Hunter"]}