{"summary":"Illuvium Joins Blockchain Gaming Partnership With Esports Powerhouse Team Liquid + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/illuvium-joins-blockchain-gaming-partnership-with-esports-powerhouse-team-liquid-more-news.htm","publishDate":"2023-12-01T14:00:24","id":17572,"type":null,"title":"Illuvium Joins Blockchain Gaming Partnership With Esports Powerhouse Team Liquid + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","Blockchain-based gaming platform Illuvium joined a blockchain partnership with esports organization Team Liquid to explore and limit-test Illuvium’s new auto battler game Illuvium: Arena‘s competitive modes. The integration will see eight Team Liquid streamers – specializing in Teamfight Tactics, Hearthstone, and League of Legends – play the new game.","“We’re cooking up a co-hosted tournament that will be a magnet for competitive spirits from both our communities with a $100,000+ prize pool,” the announcement said.","Kieran Warwick, Co-founder and CEO of Illuvium, emphasised the goal to reshape perceptions of blockchain gaming: “Overcoming the scepticism around blockchain games is crucial, and the way forward is by delivering exceptional gaming experiences.”","This collaboration is a milestone in showing that blockchain games, including those with NFTs, can offer engaging and deep gameplay experiences on par with traditional games, Warwick said.","Per the press release, Illuvium unveiled the Early Access release of their Auto Battler and Overworld game following a three-year development journey and a $60 million investment.","Popular blockchain data analytics platform Nansen announced the launch of Nansen 2. It’s described as a significant upgrade to its tool suite. The free version of the suite now includes access to Nansen’s popular features along with selected Nansen 2 features.","Nansen 2 is a faster and smarter platform designed to change how investors use blockchain data, it said. The update brings upgrades to its existing features, especially its wallet and token analytics tools.","These enhancements improve functionality, offering users comprehensive insights into multichain perspectives of any wallet or entity. They also provide a deeper understanding of specific on-chain token movements.","The new features in Nansen 2 allow users to label Ethereum wallets automatically based on their own criteria. This allows them to quickly identify, track, and monitor wallet addresses. These features also provide a detailed view of the holdings and activity within the chosen addresses.","Additionally, Nansen 2 also incorporates AI more extensively, enhancing user experience, it said New features like Smart Search and Signals enable users to search for data and find relevant dashboards using natural language queries.","Signals also highlight unusual volume or activity changes across tokens and NFTs. In the future, it will provide personalized insights based on user preferences.","ERC-4337 infrastructure provider Pimlico has integrated smart wallet infrastructure provider Safe’s accounts via Safe’s newly launched ERC-4337 module.","Per the announcement, by integrating Safe’s module, Pimlico enhanced its infrastructure offering and enabled its clients to build Ethereum-based products more seamlessly and with greater UX options.","The Ethereum standard ERC-4337 was deployed on the Ethereum mainnet in March 2023. Its aim is to usher in more user-friendly crypto wallet designs.","Safe’s module enables developers to turn the Safe smart account standard into an ERC-4337 smart account. Developers and users can easily opt in or opt out of ERC-4337 without changing the account.","Also, the module will allow non-Web3 developers to offer Web3 functionalities in their Web2 consumer applications easily. Appealing to both Web2 and Web3 developers, Safe said, “it marks the first smart contract module that will be used massively in production.”","In addition to Safe’s early backing and investment in Pimlico, the crypto startup recently closed a $4.2 million seed funding round led by a16z crypto.","Global identity verification platform Trulioo announced its partnership with Public, a US investing platform for stocks, ETFs, crypto, Treasury bills, and alternative assets, allowing UK investors access to US stocks.","The companies said that Public chose Trulioo Person Match identity verification “to achieve the highest onboarding assurance” and meet Anti-Money Laundering (AML) and know-your-customer (KYC) compliance requirements for its UK launch.","Trulioo customizable onboarding workflows provide intelligent routing that directs users to optimal data matching, heightened performance, and compliance.","Person Match has flexible identity verification workflows built on a foundation of micro and macro data sources. It delivers automated address verification that streamlines user onboarding and reduces the need for manual uploads, among other features.","Web3 trading wallet Bitget Wallet (formerly known as BitKeep) now supports TON (The Open Network).","According to the press release, the integration allows users to add the TON network with a single click. They can manage assets and perform on-chain transactions.","Looking ahead, Bitget Wallet plans to expand its services further to include support for TON ecosystem dapps, token trading, and candlestick chart features.","It is also set to launch innovative products and services based on TON and Telegram, such as the Telegram Red Packet feature.","TON is a Layer 1 blockchain initially designed by the Telegram team and later advanced by the community.","Galxe, the platform for building Web3 communities with over 13 million active users and 4,000 partners, announced that the Galxe App is now on the Google Play store and iOS TestFlight.","Per the announcement, Galxe developed the Galxe Mobile App to simplify the Web3 experience for users. The app extends the ease of use from desktop to mobile, it said, enabling users to manage their profiles, engage in campaigns, and claim rewards anytime and anywhere.","The Galxe App is designed to be exactly like galxe.com but adapted to deliver a better mobile experience. It offers “a seamless, intuitive onboarding process for newcomers to Web3, counteracting the notion that blockchain tech and Web3 are only for the tech-savvy.”","The platform said that by integrating features such as WalletConnect and social logins, alongside a user-friendly interface, the app significantly lowers the barriers to entry into the Web3 space.","Bitcoin miner CleanSpark reported financial results for its fiscal year ended September 30.","According to the press release, revenues for the year grew to $168.4 million, an increase of $36.9 million, or 28% from $131.5 million in the prior year.","The company saw a net loss of $136.6 million, an increase of 138% compared to $57.3 million in the prior year. Adjusted EBITDA decreased to $25 million, a decrease of $31.1 million or 55% from $56.1 million in the year before.","CleanSpark had combined cash and bitcoin holdings of $85 million and $16 million of debt as of September 30. As of November 30, the company has combined cash and bitcoin holdings of approximately $168 million and $14.8 million of debt.","Total outstanding shares were 160.2 million by September 30 and 184.7 million as of November 30.","Aragon has deployed its modular Aragon OSx DAO framework and no-code Aragon App on Arbitrum, enabling DAOs to interact with protocols, applications, and assets.","According to the press release, “Arbitrum’s rollup technology serves as a gateway to the largest Layer 1 ecosystem—Ethereum—and Aragon’s user-friendly tech stack unlocks the mass adoption of DAO technology.”","By launching on Arbitrum, DAOs can benefit from lower gas costs, allowing them to conserve DAO resources and drive increased voter turnout, it added. Building custom DAOs on Arbitrum is simple because developers can take advantage of full EVM equivalence that streamlines the deployment of custom integrations.","Additionally, Arbitrum communities can launch a DAO in under 10 minutes. With the accessibility of its no-code solutions, over 7,000 DAOs have been launched with Aragon across Ethereum L1 and L2s, the announcement said."],"entity":[{"type":"4337","content":"DATE"},{"type":"Illuvium","content":"LOCATION"},{"type":"Galxe App","content":"ORGANIZATION"},{"type":"Pimlico","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"$85 million","content":"MONEY"},{"type":"Bitget Wallet","content":"ORGANIZATION"},{"type":"138%","content":"PERCENT"},{"type":"$136.6 million","content":"MONEY"},{"type":"Nansen","content":"PERSON"},{"type":"September 30","content":"DATE"},{"type":"Warwick","content":"PERSON"},{"type":"$14.8 million","content":"MONEY"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Aragon App","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"Aragon","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Early Access","content":"ORGANIZATION"},{"type":"Hearthstone","content":"LOCATION"},{"type":"$4.2 million","content":"MONEY"},{"type":"Galxe App","content":"PERSON"},{"type":"$36.9 million","content":"MONEY"},{"type":"Kieran Warwick","content":"PERSON"},{"type":"$168 million","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"$56.1 million","content":"MONEY"},{"type":"March 2023","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"$31.1 million","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"$131.5 million","content":"MONEY"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$57.3 million","content":"MONEY"},{"type":"November 30","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Safe","content":"PERSON"},{"type":"Trulioo Person Match","content":"ORGANIZATION"},{"type":"$168.4 million","content":"MONEY"},{"type":"$16 million","content":"MONEY"}],"hashtag":["Bitcoin","Bitget","Blockchain","DAO","Ethereum","Gaming","Mining","UK","USA","Wallet"],"authors":["Sead Fadilpašić"]}