{"summary":"Sullivan & Cromwell used “deceptive tactics” to get control of FTX from its former CEO Sam Bankman-Fried, a pair of law professors said in a paper published last week. \nThe academics said it’s possible that Sam Bankman-Fried could have secured new funding if S&C had waited a few more days to file Chapter 11. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284049\/research-paper-makes-further-allegations-regarding-ftxs-bankruptcy-lawyers-conflicts-of-interest","publishDate":"2024-03-21T15:54:21","id":1757,"type":null,"title":"Research paper makes further allegations regarding FTX&#x27;s bankruptcy lawyers conflicts of interest","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">FTX's bankruptcy law firm Sullivan and Cromwell LLP is coming under a microscope amid allegations of potential conflicts of interest and bad ethics.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">S&amp;C used \"deceptive tactics\" to get control of FTX from its former CEO Sam Bankman-Fried, said Temple University law professor Jonathan Lipson and University of Pennsylvania law professor David Skeel, in a <a href=\"https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=4760736\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">paper<\/span><\/a> published last week titled \"FTX'd: Conflicting Public and Private Interest in Chapter 11.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"This Article has shown that, in relinquishing control of his companies at the behest of lawyers who appear to have been motivated by their own concerns, he was also 'FTX’d up,''' the professors said in the paper. \"While we do not challenge the jury’s verdict or the company’s need to use chapter 11, we worry about BigLaw attorneys who marshal and manipulate arguments about the 'public interest' in order to advance or protect their own interests.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">FTX <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">filed<\/span><\/a> for bankruptcy protection in November 2022. Its former CEO, Sam Bankman-Fried, was convicted of defrauding FTX users and investors in November 2023 and is currently awaiting sentencing, set for next week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bankruptcy itself has endured disagreements over S&amp;C's role. FTX creditors <a href=\"https:\/\/www.theblock.co\/post\/277936\/ftx-creditors-file-class-action-against-bankruptcy-lawyers-over-ties-to-ftx-prior-to-its-collapse\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">filed<\/span><\/a> a class action against S&amp;C last month and alleged that the firm gained knowledge of the exchange's workings and ultimately supported it in its fraudulent behavior. Bankman-Fried has also said that the law firm pressured the exchange into bankruptcy and strong-armed him into naming John Ray lll as CEO.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"S&amp;C may have violated ethical duties of confidentiality, candor, and loyalty by reporting allegations of these crimes to prosecutors without client consent and by duping Bankman-Fried into giving control of FTX to Ray (whom S&amp;C chose) with promises that Bankman-Fried would play a significant role in the reorganization— promises S&amp;C surely knew were false,\" the professors said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The professors said it's possible that if S&amp;C had waited a few more days to file Chapter 11, Bankman-Fried could have secured new funding.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A spokesperson for S&amp;C pushed back on the paper and referred The Block to a statement from the FTX debtors.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“In an effort to support Mr. Bankman-Fried at the expense of his victims and the dedicated professionals who have worked tirelessly to rectify the harm he caused, certain academics and others have parroted, in obvious coordination, his false narratives in an attempt to elevate his standing and image before the court that is about to sentence him,\" the statement said. \"In fact, but for the work of a large team of committed advisors, including Sullivan &amp; Cromwell and others who have been unfairly maligned as part of Mr. Bankman-Fried’s defense strategy, billions of additional dollars would have been lost or stolen, and the recoveries to customers would be a fraction of what we can now expect. It’s time to put blame where it rightfully belongs.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In a court <a href=\"https:\/\/www.theblock.co\/post\/283847\/ftx-sam-bankman-fried-claim-reckless-and-false\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">filing<\/span><\/a> on Wednesday, FTX CEO Ray said he and other board members were not connected to FTX, Bankman-Fried, or any other FTX Group leaders. He also called Bankman-Fried's past statements about no harm to customers \"reckless\" and \"false.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Shortly after the exchange filed for bankruptcy, U.S. Trustee Andrew R. Vara asked a bankruptcy judge to appoint an outside examiner who could investigate the crypto exchange's collapse independently from the current FTX CEO John Ray III. Ray had previously opposed that and said the probe he was leading was sufficient. However, an appeals court later ruled in <a href=\"https:\/\/www.theblock.co\/post\/273614\/ftx-must-be-investigated-by-independent-examiner-court-rules\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">January<\/span><\/a> that an independent examiner had to be put in place.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">On Wednesday, U.S. Bankruptcy Judge John Dorsey appointed former Unabomber prosecutor Robert Cleary as examiner.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"An examiner may yet shed light, but S&amp;C’s resistance to that intervention means that much of the damage cannot be undone,\" the professors said in the paper.&nbsp;<\/span>","&nbsp;","&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction: March 21, 21:21 UTC<\/strong>: The statement from the FTX debtors was initially attributed to a spokesperson for <span class=\"s1\" data-v-f87c67ca=\"\">Sullivan and Cromwell LLP. Instead, the spokesperson forwarded the statement as part of a response.&nbsp;<\/span><\/em>"],"hashtag":["COURT HEARINGS","FTX"]}