{"summary":"Bonk Price Is Up 13.4%, But Experts Say New Dog-Themed ICO Can Offer 1,026% Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bonk-price-is-up-13-4-but-experts-say-new-dog-themed-ico-can-offer-1026-returns.htm","publishDate":"2024-05-03T10:53:23","id":17583,"type":null,"title":"Bonk Price Is Up 13.4%, But Experts Say New Dog-Themed ICO Can Offer 1,026% Returns","category":["Industry Talk "],"content":["The Bonk ($BONK) meme coin is one of today’s biggest rallies, with the BONK price skyrocketing 13.4% in 24 hours.","The Solamna meme coin currently trades for $0.00002611. Its overnight gains are the highest of any top 100 currency, except Arweave (AR) which blew up 19.5% to trade at $34.98.","That also makes it the fastest appreciating meme coin among the seven largest by market capitalization. Sector leader Dogecoin ($DOGE) only added 3.4% overnight and trades at $0.1327 at the start of the weekend. ","BONK’s trading chart shows an asset that rose in step with the rest of the market during the early March rally. However, where Bitcoin peaked in the middle of the month, BONK peaked very early on; on March 4 it posted a new all-time high of $0.00004547, though it has since fallen back by 42.5%. ","BONK is currently trading slightly against the grain of the rest of the market. The token’s price is currently valued higher than its 30-day moving average, as seen in the respective green and blue lines. With a Relative Strength Index (RSI) of 67 and climbing, investors appear to be pumping the token, however this momentum is likely to die down quickly.","Market leaders Bitcoin ($BTC) and Ethereum ($ETH) had more muted recoveries. The world’s favorite cryptocurrency added 2.5% to trade at $59,305 on Friday morning, UTC. Its number one contender added 1.3% and sells at $2,976 as of this writing. ","Markets were rocked on Tuesday by news that Binance’s founder and former CEO Changpeng “CZ” Zhao received a four-month prison sentence for charges related to money laundering. Prosecutors argued that Binance’s previously lax approach to KYC and AML enabled multiple criminal actors to launder money through the exchange.","Wednesday threw up another reason for investors to become risk-averse. Further market-wide price depreciation followed news that the US Federal Reserve plans to keep interest rates higher for longer to help stem rampant inflation.","Bonk’s rally comes as small cap token fans eagerly stack another canine-themed meme coin in an ongoing presale. This one actually comes in handy.","WienerAI ($WAI) is the brand new meme token and AI companion that may yield some potentially eye-watering rallies once word gets out about its underlying utility.","Touted as a “Revolutionary AI Trading partner”, WienerAI is a digital companion that offers his owners user-friendly AI-enhanced trading advice, seamless swap functionality and zero fees. ","The WienerAI smart contract was audited by Coinsult, a blockchain security platform that conducts security checks on various crypto and blockchain platforms. ","Around 20% of $WAI’s supply is for staking. WienerAI’s website encourages buyers to stake during the presale, in order to take advantage of the lucrative yield, which is currently 1,026% APY . ","How it feels to Stake $WAI. pic.twitter.com\/IpkkxWHh8J","— WienerAI (@WienerDogAI) May 1, 2024","","Mysterious he may be, but it’s no mystery why investors have channeled $900,000 into WienerAI’s new presale. Everybody wants a tokenized piece of crypto’s most advanced beginner-friendly AI trading companion yet.","Stay informed of WienerAI news over on X\/Twitter and Telegram. ","Join the presale now over on the WienerAI website.",""],"entity":[{"type":"$0.00002611","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"1,026%","content":"PERCENT"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Coinsult","content":"ORGANIZATION"},{"type":"$WAI","content":"MONEY"},{"type":"$900,000","content":"MONEY"},{"type":"3.4%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"13.4%","content":"PERCENT"},{"type":"BONK","content":"ORGANIZATION"},{"type":"$DOGE","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$59,305","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"March 4","content":"DATE"},{"type":"$0.1327","content":"MONEY"},{"type":"$0.00004547","content":"MONEY"},{"type":"42.5%","content":"PERCENT"},{"type":"May 1, 2024","content":"DATE"},{"type":"19.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"1.3%","content":"PERCENT"},{"type":"$34.98","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$BONK","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"$2,976","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bonk","Meme Coins","wienerai"],"authors":["Tim Hakki"]}