{"summary":"Russian Energy Firms Prepares to ‘Hunt’ Private Crypto Miners","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russian-energy-firms-prepares-to-hunt-private-crypto-miners.htm","publishDate":"2024-05-12T23:30:42","id":17584,"type":null,"title":"Russian Energy Firms Prepares to ‘Hunt’ Private Crypto Miners","category":["Blockchain News "],"content":["Russian energy firms are preparing to “hunt down” private crypto miners and crack down on people mining cryptoassets at home, a report claimed on May 12.","The media outlet Izvestia said the Russian Government Expert Council was preparing to send fresh mining-related proposals to the Cabinet.","Lawmakers want to bundle the proposed measures in a new package of crypto laws. These laws also aim to legalize industrial crypto mining and ban most domestic exchanges.","⚡️ Russian Government Crypto Chief: Mining Regulation Is Our Priority","The Russian government’s crypto working group chairman believes Bitcoin (BTC) mining regulation is now a priority for Moscow.#CryptoNews #newshttps:\/\/t.co\/Gqdg4vwnZB","— Cryptonews.com (@cryptonews) April 9, 2024","","The media outlet noted that the council will send written proposals, which its reporters have already seen, to the Cabinet on May 16.","The documents propose using electricity meter technology to identify suspected miners. Data analysts will “compare declared readings with actual electricity usage” using “remote checking solutions.”","The document also explains how power firms will fine “illegal” miners. The document proposes allowing power companies to charge home-based offenders at “higher rates.”","These rates are typically reserved for “industrial enterprises.”","US Treasury’s Office of Foreign Assets Control (OFAC) sanctioned the developer of a Russian Drone, OKO Design Bureau. What happens next?#OFAC #USA #Russiohttps:\/\/t.co\/7Bs0KuoPw1","— Cryptonews.com (@cryptonews) May 2, 2024","","Dmitry Tortev, of the Federal Antimonopoly Service of Russia, told the media outlet that the move would allow power providers to act without the need to go through the legal system. He said:","“At present, electricity suppliers need to provide proof of crypto mining-related violations in court. That wastes these companies’ time and money. However, if a unified system for fines is developed at the federal level, this will speed up and intensify the fight against [illegal crypto mining].”","Crypto mining remains extremely popular in Russia. But as the activity currently has no legal status, mining coins is currently neither illegal nor legal.","Private mining is not illegal either, and at present, Russian power firms can only step in if they suspect individuals are stealing power from local grids.","The documents reportedly lament that the Russian energy system is “overloaded” in many areas.","The authors say that this is resulting in “interruptions in the supply of electricity to consumers.” The document reportedly claims:","“In some regions, there has been a significant increase in electrical energy consumption, [often] due to an increase in mining loads. This has led to […] local deficits in the south-eastern part of […] Siberia.”","The documents’ authors also said shortages had been reported in “the Irkutsk-Cheremkhovo district of the Irkutsk region, the southern part of Buryatia, and certain parts of the Trans-Baikal region.”","These are known crypto mining hotspots, popular for their low power rates and cold winters.","Irkutsk in particular has become a hub for mining, both legal and illegal, in recent years. This has led the region to develop a somewhat complicated relationship with mining.","Izvestia also quoted the Deputy Minister of Energy Pavel Snikkars as saying energy tariffs for miners should “increase in such a way as to encourage them to move away from energy-deficient areas.”","The same ministry has previously floated proposals aimed at reducing the strain on overloaded networks.","One included forcing industrial miners to shut off their rigs for certain fixed portions of the year.","While these have been met with dismay by most miners, most industrial miners want Moscow to “hurry up” and legalize their sector.","Bitcoin mining has been going on for a long time, but is becoming less profitable due to the design. It’s fascinating to see the big Bitcoin mining companies diversifying their investments into AI. | Bitcoin miners get into AI to survive halving https:\/\/t.co\/U3YA8TS9iv","— Scott C. Lemon (@humancell) April 22, 2024","","While this would mean they would have to begin paying taxes on their earnings, the biggest firms want legal clarity from Moscow before they make more data center-related investments.","Sergei Bezdelov, the head of the Industrial Mining Association, said:","“We have a positive attitude towards any measures aimed at creating conditions for the development of industrial mining in this country. We would be happy to invite inspections by power providers if that would be desirable. This will help bring this sector legitimacy in Russia”",""],"entity":[{"type":"Cheremkhovo","content":"LOCATION"},{"type":"Sergei Bezdelov","content":"PERSON"},{"type":"Izvestia","content":"ORGANIZATION"},{"type":"May 2, 2024","content":"DATE"},{"type":"May 16","content":"DATE"},{"type":"Irkutsk","content":"LOCATION"},{"type":"Dmitry Tortev","content":"PERSON"},{"type":"Deputy Minister of Energy Pavel Snikkars","content":"ORGANIZATION"},{"type":"Federal Antimonopoly Service","content":"ORGANIZATION"},{"type":"April 9, 2024","content":"DATE"},{"type":"US Treasury’s Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"the Industrial Mining Association","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Buryatia","content":"LOCATION"},{"type":"Moscow","content":"LOCATION"},{"type":"April 22, 2024","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Scott C. Lemon","content":"PERSON"},{"type":"OKO Design Bureau","content":"ORGANIZATION"},{"type":"Russian Government Expert Council","content":"ORGANIZATION"},{"type":"Baikal","content":"LOCATION"},{"type":"Siberia","content":"LOCATION"},{"type":"May 12","content":"DATE"}],"hashtag":["Crypto Mining","Russia"],"authors":["Tim Alper"]}