{"summary":"Cardano’s Charles Hoskinson Dispels Rumors of Abandoning Hydra Scaling Project","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-charles-hoskinson-dispels-rumors-of-abandoning-hydra-scaling-project.htm","publishDate":"2024-03-18T12:57:34","id":17586,"type":null,"title":"Cardano’s Charles Hoskinson Dispels Rumors of Abandoning Hydra Scaling Project","category":["Blockchain News "],"content":["Charles Hoskinson, CEO of Cardano, took to X to address rumors of Hydra’s abandonment as “just pure FUD” (fear, uncertainty, and doubt) surrounding Cardano’s latest project.","I'm seeing some videos claiming that Hydra has been abandoned. It is just pure FUD. The team has never been more productive and motivated, there is great community engagement and new papers on the way for enhancements to the protocol. If you are ever curious about the project go…","— Charles Hoskinson (@IOHK_Charles) March 16, 2024","","In his post, Hoskinson reassured the community that the Hydra protocol is not abandoned. Instead, he emphasized that the development team is highly productive and motivated, with ongoing progress and significant enhancements to the protocol. Hoskinson’s message aimed to dispel any doubts and reaffirm the commitment to advancing Hydra with strong community engagement.","The Cardano-based protocol Hydra, launched in May 2023, aims to enhance transaction processing capacity and reduce costs on the Cardano blockchain, aligning with Cardano’s “Basho” roadmap focused on scaling. However, recent discussions and videos on platforms like YouTube have raised concerns about Hydra’s status and the blockchain’s scalability efforts.","","A video by The Cryptoviser on March 17 suggested that Cardano had shifted focus away from Hydra due to Charles Hoskinson announcing an integration with Hyperledger Firefly, another scaling solution, on March 13. The video highlighted tweets from Vanessa Harris, expressing community sentiments about accountability and the need for progress in delivering scalability promises.","Imagine actually holding folks in charge accountable. pic.twitter.com\/ORSUx5Bc6f","— Vanessa Harris (@technologypoet) March 11, 2024","","Harris argued that holding Cardano accountable for its progress is not the same as assigning blame. She pointed out the lack of substantial deliverables on scaling, despite promises made several years ago.","Vanessa emphasized the importance of holding accountable those responsible for delivering on promises, especially regarding scalability initiatives. The Cryptoviser echoed concerns about accountability within the Cardano ecosystem, pointing out instances of substantial ADA funds allocated to projects with limited tangible outcomes.","Time for some nerd candy related to our Hydra work!","Below is the first end to end test of our Hydra Streaming work: A Hydra node streams events to AWS Kinesis using the pluggable architecture we've added, and then those events are read by an AWS Lambda written in Go. pic.twitter.com\/DAquBYX2sK","— Sundae Labs 🍨 (@SundaeSwap) March 7, 2024","","Despite community discussions and concerns, Sundae Labs and other members of the Cardano community have indicated ongoing work on Hydra and expressed optimism about its progress. Also, Charles Hoskinson himself addressed the rumors on social media, asserting that the Cardano team remains dedicated to Hydra’s development. He emphasized the team’s productivity, strong community engagement, and upcoming research papers focused on protocol improvements.","However, concerns persist. The Cryptoviser pointed out the lack of recent updates on the Hydra project website, with the latest report dating back to November 2023. This inactivity raises questions about the project’s development pace.","Furthermore, the role of Hyperledger Firefly remains to be determined. Cardano hasn’t provided any official guidance on whether it will complement Hydra, replace it, or be pursued as a separate initiative.","Charles Hoskinson has been proactive in defending the project against what he calls “FUD” (fear, uncertainty, and doubt), especially concerning the Hydra scaling solution. In past instances, he has addressed criticism regarding Cardano’s transaction throughput, emphasizing that Cardano is not solely focused on transactions per second (TPS) but rather on transaction-per-transaction processing.","In October, Hoskinson highlighted Hydra’s capabilities as a scaling solution and mentioned its development of middleware for building decentralized applications (DApps) on Cardano. He reiterated these points on March 18, responding to a new wave of FUD regarding Cardano’s collaboration with World Mobile and its overall scaling roadmap.","Despite facing skepticism, Cardano has seen growth in decentralized finance (DeFi) total value locked (TVL), reaching an all-time high of $520 million on March 14. However, it still lags behind competitors like Ethereum, Tron, BNB Smart Chain, and Solana, which collectively have a TVL of $72 billion.","Notably, the Cardano community has raised questions about the project’s progress in delivering on its ambitious roadmap. Hoskinson has responded to inquiries about various aspects, including the ERC20 converter, partnerships in Africa and Mongolia, and the successful launch of SingularityNET on Cardano. He also mentioned ongoing efforts such as RealFi initiatives in Africa and developer training programs in Mongolia, showcasing notable achievements despite ongoing scrutiny."],"entity":[{"type":"Vanessa Harris","content":"PERSON"},{"type":"Hoskinson","content":"PERSON"},{"type":"Mongolia","content":"LOCATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"March 16, 2024","content":"DATE"},{"type":"Harris","content":"PERSON"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"FUD","content":"ORGANIZATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Hyperledger Firefly","content":"PERSON"},{"type":"AWS","content":"ORGANIZATION"},{"type":"$520 million","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"AWS Kinesis","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Cardano","content":"LOCATION"},{"type":"March 18","content":"DATE"},{"type":"March 17","content":"DATE"},{"type":"$72 billion","content":"MONEY"},{"type":"March 7, 2024","content":"DATE"},{"type":"March 14","content":"DATE"},{"type":"March 13","content":"DATE"},{"type":"Hydra","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Africa","content":"LOCATION"},{"type":"Sundae Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Cardano","FUD","Scalability"],"authors":["Hassan Shittu"]}