{"summary":"Crypto-Fuelled Gambling Sites Streaming Just Got Banned on Twitch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-fuelled-gambling-sites-streaming-just-got-banned-on-twitch.htm","publishDate":"2022-09-22T17:00:00","id":17597,"type":null,"title":"Crypto-Fuelled Gambling Sites Streaming Just Got Banned on Twitch","category":["Blockchain News "],"content":["Twitch, an interactive live streaming platform popular with gamers, has announced a ban on the sharing referral and promo codes of gambling sites that support placing bets in cryptocurrency. ","In a statement shared on Twitter, the U.S.-based company said that the ban which will take effect on October 18 will apply to gambling sites that include slots, roulette, or dice games that are not licensed either in the U.S. or “other jurisdictions that provide sufficient consumer protection.” ","“While we prohibit sharing links or referral codes to all sites that include slots, roulette, or dice games, we’ve seen some people circumvent those rules and expose our community to potential harm.”","The statement does not specifically mention a ban on crypto betting. However, it called out sites that fall into the category of not being licensed in recognized jurisdictions including Stake.com, Rollbit.com, Duelbits.com, and Roobet.com. These are all sites that have drawn popular streamers on the platform who gamble using cryptocurrencies like Bitcoin (BTC) and Ether (ETH).  ","The statement added that more such sites will be added to the list as time passes and also publish a more comprehensive gambling policy soon. Meanwhile, the ban does not affect websites that focus on sports betting, fantasy sports, and poker. ","The statement is coming on the back of a series of events on the video game streaming platform. Fortune reports that several Twitch premium streamers have been threatening to go on strike if rules are not put in place to prohibit gambling following a revelation that a popular streamer had been scamming others to fund his gambling addiction. ","The protesting streamers have stated that their grouse is particularly against luck-based gambling as it could be “objectively harmful to the website and its users.” This has been highlighted by the fact that virtual slots is currently the 10th most popular Twitch streaming category while users have watched about 244 million hours of gambling streams in the first six months of 2022. ","Before the streamers’ protest, Twitch had told Bloomberg that it is looking into the gambling boom that is drawing users into “crypto casinos” and fueling a gambling addiction trend. ","Similarly, crypto gambling has also been gaining notoriety on other video game streaming platforms such as YouTube games. Facebook Gaming and other smaller streaming platforms are also in the mix and looking for solutions to the growing problem. ","Check out our list of the best crypto Twitch streamers. "],"entity":[{"type":"Twitter","content":"DATE"},{"type":"October 18","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"the first six months of 2022","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["Gambling"],"authors":["Ruholamin Haqshanas"]}