{"summary":"dYdX Community Likely to Approve Foundation’s $30 Million Funding Proposal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dydx-community-likely-to-approve-foundations-30-million-funding-proposal.htm","publishDate":"2024-01-30T09:04:15","id":17598,"type":null,"title":"dYdX Community Likely to Approve Foundation’s $30 Million Funding Proposal","category":["Altcoin News "],"content":["The dYdX tokenholders are voting on the $30 million fundraising request proposed by the dYdX Foundation, which is likely to get approved.","The Foundation published a blog on Jan. 25 detailing its fundraising proposal.","This proposal, if approved, will grant the Foundation $30 million in DYDX tokens from the decentralized autonomous organization (DAO) treasury.","According to the blog, this funding is aimed at supporting a range of strategic initiatives for the next three years, including enhancing the governance velocity of the dYdX Chain, fostering DAO enablement, and scaling the adoption of the dYdX Chain.","“The dYdX Foundation does not charge fees or have a profit-making purpose, and does not seek any profits in general,” wrote the proposal.","“The funds will be used to hire and retain the best talent, to help scale the adoption of the dYdX Chain, and to continue further decentralizing the dYdX ecosystem such that it can propel itself forward.”","The Foundation elaborated on the history of the community, the construction of its up-to-date ecosystem, its missions, responsibilities, and the role played advancing DAO forward.","After the Foundation published the blog, numerous community members have voiced their support for the fundraising, and the response has been overwhelmingly positive.","“We are in support of this proposal,” said a member of the chain validator Chorus One. “Since the announcement of dYdX v4, the foundation has played a very key role in managing relationships and communication with all DYDX stakeholders.”","“Our experience with the foundation has been incredibly positive and inspiring where we have witnessed the positive impact of their initiatives,” said another validator Imperator.co.","“The transparency and accountability demonstrated by the dYdX Foundation in its operations and financial management are commendable,” said Imperator.co.","The community’s vote on the proposal just kicked off on Jan. 29, and 96.4% of the tokenholders voted “YES” for the funding grant, with 3.6% choosing “Abstain” and less than 0.1% voting “NO.”","The vote will remain open until February 2 and will be considered valid only if it reaches the required quorum of 33.4%. As of this writing, the turnout has already reached 25.3% within the first 24 hours of voting."],"entity":[{"type":"Jan. 29","content":"DATE"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"3.6%","content":"PERCENT"},{"type":"96.4%","content":"PERCENT"},{"type":"February 2","content":"DATE"},{"type":"25.3%","content":"PERCENT"},{"type":"33.4%","content":"PERCENT"},{"type":"Jan. 25","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"0.1%","content":"PERCENT"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":["DAO","dydx"],"authors":["Hongji Feng"]}