{"summary":"P2P ether trading platform LocalEthereum has changed its name to LocalCryptos to support more cryptocurrencies, including bitcoin \nWith the move, LocalCryptos aims to take on rival LocalBitcoins with its non-custodial pitch \nMichael Foster, CEO of LocalCryptos, told The Block: “Unlike LocalBitcoins, LocalCryptos is non-custodial, end-to-end encrypted, and completely private”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47500\/p2p-trading-platform-localethereum-renames-to-support-bitcoin-looking-to-take-on-rival-localbitcoins-with-its-non-custodial-pitch","publishDate":"2019-11-19T02:02:08","id":1759,"type":null,"title":"LocalEthereum renames to support bitcoin; looking to take on rival LocalBitcoins","category":["Bitcoin"],"content":["LocalEthereum, a peer-to-peer (P2P) trading platform for ether (ETH), has rechristened to LocalCryptos to support more cryptocurrencies, starting with bitcoin (BTC).","Announced Tuesday, LocalCryptos said it aims to become “the new leader” in P2P fiat-to-crypto trading. In other words, it is looking to take on rival LocalBitcoins with its non-custodial pitch. “Unlike LocalBitcoins, LocalCryptos is non-custodial, end-to-end encrypted, and completely private,” Michael Foster, CEO of LocalCryptos, told The Block.","A non-custodial platform doesn’t hold users’ private keys, making it “impossible” for LocalCryptos or any hacker to freeze or seize users’ crypto, said the firm, adding:","“Platforms like LocalBitcoins are centralized, custodial, and a far cry from private. These platforms are vulnerable to hacks and thefts like a centralized exchange. Hackers have stolen several <a href=\"https:\/\/www.theblockcrypto.com\/post\/46408\/little-known-asian-crypto-exchange-vindax-got-hacked-lost-half-a-million-usd-worth-of-tokens\" data-v-f87c67ca=\"\">billion dollars<\/a> from centralized crypto platforms. At least two of those heists took from LocalBitcoins traders.”","But non-custodial platforms come at a cost. For instance, if users lose their wallet password, these platforms can’t help recover. LocalCryptos said it wants to put users in complete control.&nbsp;","“Crypto was born out of the desire for eliminating the role of middlemen and legacy institutions in otherwise person-to-person interactions. We developed LocalCryptos based on this idea of users remaining in control at all times—not us,” said Foster.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Largest non-custodial P2P platform?&nbsp;<\/strong>","Australia-based LocalEthereum began in 2017 and now boasts of having over 100,000 registered users, 1,500 daily active users and 450 trades each day. “That makes it the largest non-custodial P2P Bitcoin platform on day one, in front of HodlHodl and Bisq,” Foster told The Block.","In terms of trading volumes, the platform has seen $3 million worth of fiat-to-crypto trades per month, from 139 countries, per the announcement.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLocalCryptos is also chasing rival Finland-based<a href=\"https:\/\/www.theblockcrypto.com\/tag\/localbitcoins\" data-v-f87c67ca=\"\"> LocalBitcoins<\/a>’ users, saying that they can import their “earned reputation” directly on to its platform. It means long-time P2P LocalBitcoins traders won’t need to start over on LocalCryptos.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We want to make it as easy as possible to migrate,” Foster told The Block, adding: “We aren’t subject to the same regulations as LocalBitcoins (which recently implemented a mandatory verification process, resulting in a dramatic drop in volume — <a href=\"https:\/\/decrypt.co\/10680\/localbitcoins-btc-trading-volume-dropped-30-percent-last-month\" data-v-f87c67ca=\"\">down 30% last month<\/a>.”","Looking ahead, LocalCryptos said it plans to support more cryptocurrencies soon, including ERC20 tokens. “We’ll develop a new smart contract to handle ERC20s, and, in the more distant future, ERC721s.”","The firm is focused to serve the underbanked and unbanked communities. “Our eyes are set on Venezuela, where LocalCryptos helps free people from hyperinflation.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Growing P2P space&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/strong>P2P crypto trading platforms are seeing increased interest in general. Last month, Paxful <a href=\"https:\/\/www.theblockcrypto.com\/post\/44475\/p2p-bitcoin-trading-platform-paxful-adds-800k-wallets-in-the-past-12-months-driven-by-growth-in-africa\" data-v-f87c67ca=\"\">said<\/a> it hit a “major growth milestone,” adding over 800,000 wallets during the past 12 months and now services a total of 3 million wallets. Paxful has seen rising volumes from users in Nigeria, Ghana, Kenya, U.S. and India during the period.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAnother decentralized P2P platform, SIBEX AG, is looking to serve institutional investors. Last month, the firm raised around<a href=\"https:\/\/www.theblockcrypto.com\/post\/44557\/decentralized-p2p-crypto-trading-platform-sibex-raises-1-8m-aiming-to-drive-institutional-participation\" data-v-f87c67ca=\"\"> $1.8 million<\/a> in a seed funding round to expand its offerings.&nbsp;<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong>"],"hashtag":["TOKENS"]}