{"summary":"CryptoPunks Top Sales Volume Charts – Top NFT News Today – 23 January","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-nft-news-today-23-january.htm","publishDate":"2024-01-23T11:50:00","id":17606,"type":null,"title":"CryptoPunks Top Sales Volume Charts – Top NFT News Today – 23 January","category":["NFT News "],"content":["The non-fungible token (NFT) market is up 12.5% over the past 24 hours. It now stands at $39,251,556.","Buyers and sellers are both up around 2%, while transactions are down 10%.","Among the top 10 collections by sales volume, CryptoPunks made the NFT news rounds and took the first spot with over $3.5 million.","The second-placed Ordinals are up 101% to $2,175,912, according to CryptoSlam.","And despite this massive rise, Ordinals are not the day’s best performers. Magic Ticket: Normie is up 690% to $620,961. GBTS BRC-20 NFTs and Doodles are up 567% and 392%, respectively.","Froganas and Gas Heroes Common Heroes are making NFT news rounds in red, dropping 6% and 3%, respectively.","Today in NFT news, read about the Magic Eden-backed Non-Fungible DAO, CryptoPunks relaunching its CryptoPunks721 wrapper, and iSHANG and Earth Exchange’s NFT staking program for environmental sustainability.","Non-Fungible DAO (Decentralized Autonomous Organization) introduced itself on Monday. It said that would be a community-owned, decentralized organization.","Its mission: to develop and drive adoption of the protocols that will power the future of NFT commerce.","While digital asset adoption is still in its early phases, the future will see most of the world interacting with NFTs every day, argued the team.","Non-Fungible DAO owns and governs open-source technologies for NFTs across major chains. This includes smart contracts originally developed by the Magic Eden marketplace on four chains: Solana, Bitcoin, Ethereum, and Polygon.","Magic Eden commented, saying it would be open-sourcing and contributing its trading and minting protocols to the DAO.","Decentralization is essential to the global adoption of NFTs. Magic Eden will be open-sourcing and contributing all of its NFT trading and minting protocols to Non-Fungible DAO. https:\/\/t.co\/5gUzwqdDnh","— Magic Eden 🪄 (@MagicEden) January 22, 2024","","Per the DAO, each NFT token holder will be able to vote on governance and the use of the ecosystem funds.","Most of the NFT token supply will be allocated to the community. Community members who use the protocols owned by the Non-Fungible DAO can earn the token.","As for “WEN NFT,” the team said “SOON.”","The token is still not deployed, they said, and there are no airdrops yet. MagicEden CEO Jack Lu also commented on the news:","At @MagicEden, our mission is to make digital ownership universal. That mission will take many years.","And to fulfill this mission, we know we have to draw on the heart of Web 3: community & openness.","NFTs is already one of the most vibrant sectors in Web3. We support over 70K… https:\/\/t.co\/uXINWMvoZw","— Jack Lu (@0xLeoInRio) January 23, 2024","","The popular CryptoPunks collection has taken the first spot per sales volume today. According to CryptoSlam, it is up 12% over the last 24 hours, currently standing at $3,550,498.","Its buyers are up 56%, sellers 25%, and transactions 29%.","Meanwhile, the CryptoPunks team initially released CryptoPunks721 in December. They encountered some issues, having to fix those and relaunch on Thursday.","Punks, thanks for your patience. The team has identified and fixed the issue with the Stash contract, and CryptoPunks721 has been relaunched.","The goal of CryptoPunks721 is to create a safer and healthier eco-system for the Punk community – with a more efficient, officially… pic.twitter.com\/no5vUn7tLv","— CryptoPunks (@cryptopunksnfts) January 18, 2024","","Per the website, CryptoPunks721 is the official CryptoPunks smart contract for converting CryptoPunk tokens into ERC-721 tokens by “wrapping” them.","ERC-721 is a data standard on Ethereum on which most NFT collections are built. However, CryptoPunks predates the creation of the ERC-721 standard. Therefore, to work smoothly with certain protocols, it must be converted.","“The conversion process is called “wrapping” and creates a CryptoPunks721 wrapped CryptoPunk,” the team said.","Wrapping enables owners to use their NFTs on platforms or in ecosystems that primarily support fungible tokens. This includes NFT marketplaces and decentralized finance (DeFi) applications.","CryptoPunks can also be unwraped at any time.","The wrapper contract is gas-optimized, said the team, using about half of the gas as the third-party contract for wrapping, unwrapping, and transferring CryptoPunks.","For more information about the CryptoPunks721 wrapper visit https:\/\/t.co\/uNeRSrotVV","Listen to the replay of our Twitter spaces where we discuss the launch 👇https:\/\/t.co\/JxOm9IelXr pic.twitter.com\/t7uBKB3zgl","— CryptoPunks (@cryptopunksnfts) January 22, 2024","","Earth Exchange and iSHANG, the Web3 arm of Coinstreet Group, revealed their NFT Staking Program in response to the 2023 COP28 climate conference recently held in UAE.","Per the press release, the joint initiative introduces the NFT staking program for earning carbon rewards exchangeable for the LCD (Lowest Carbon Denominator) Token.","The LCD-NFT staking program features four levels: Advocate, Activist, Ambassador, and Warrior. These enable participants to actively contribute to environmental awareness and sustainability by minting collectible NFTs.","Breaking New Ground: iSHANG and Earth Exchange Unveil Revolutionary NFT Staking Program for Environmental Sustainability in Response to the COP28 Climate Conference🌎","For press release & program details: https:\/\/t.co\/A6tFkP5OEY#EarthExchange #iSHANG #Web3 #NFT #sustainability pic.twitter.com\/eTar3V6Ggg","— iSHANG (@iSHANG_Web3) January 23, 2024","","Per the partners, “at its core, this joint endeavour revolves around introducing an innovative NFT staking program that not only upholds the integrity of carbon offsets but also scales voluntary carbon markets, contributing significantly to a more sustainable future.”"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Non-Fungible DAO","content":"ORGANIZATION"},{"type":"WEN NFT","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"Warrior","content":"ORGANIZATION"},{"type":"DAO (Decentralized Autonomous Organization)","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"56%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"12.5%","content":"PERCENT"},{"type":"$620,961","content":"MONEY"},{"type":"29%","content":"PERCENT"},{"type":"Coinstreet Group","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"January 23, 2024","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Earth Exchange Unveil Revolutionary NFT","content":"ORGANIZATION"},{"type":"392%","content":"PERCENT"},{"type":"Gas Heroes Common Heroes","content":"ORGANIZATION"},{"type":"$3,550,498","content":"MONEY"},{"type":"LCD (Lowest Carbon Denominator) Token","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"Jack Lu","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"567%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"101%","content":"PERCENT"},{"type":"January 18, 2024","content":"DATE"},{"type":"$2,175,912","content":"MONEY"},{"type":"ERC","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"690%","content":"PERCENT"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$39,251,556","content":"MONEY"},{"type":"January 22, 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Earth Exchange","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["CryptoPunks","DAO","NFT"],"authors":["Sead Fadilpašić"]}