{"summary":"Organizations Aim to Shape NFT Regulations as Digital Assets Gain Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/organizations-aim-to-shape-nft-regulations-as-digital-assets-gain-adoption.htm","publishDate":"2024-02-02T02:05:10","id":17605,"type":null,"title":"Organizations Aim to Shape NFT Regulations as Digital Assets Gain Adoption","category":["NFT News "],"content":["With the explosive growth of non-fungible tokens (NFTs) raising legal concerns, NFT regulations have become a top priority as governments and industry organizations worldwide grapple to find the right balance between innovation and consumer protection.","NFTs gained popularity in 2021, generating over $23 billion in trading volume that year. In addition to impressive market growth, many celebrities, major brands, and sports teams launched their own NFTs that year.","Unfortunately, the NFT industry saw a major decline following the collapse of the crypto exchange FTX and a major market downturn.  According to a 2023 industry report from DappRadar, NFTs became much less valuable throughout 2023, resulting in a trading volume of only $12.6 billion.","Interestingly, the DappRadar report also points out that an impressive 60 million NFTs were sold last year – a 445% increase from previous years. Given this, industry experts are predicting that NFTs are going to play a major role in the digital asset industry in 2024.","Cody Carbone, policy lead for The Chamber of Digital Commerce – a United States organization promoting the use of digital assets and blockchain – told Cryptonews that the industry will likely start to see more NFT use cases arise this year.","“I think we will see NFTs being used for consumer products in real estate, entertainment, healthcare, and more,” Carbone said. “We may not see popularity from a market perspective, but NFTs will likely become leveraged within various industries for real-world use cases.”","To put this in perspective, The Chamber of Digital Commerce recently published an NFT impact report that explains how NFTs can be used in consumer products in many sectors.","Yet, while it’s notable that NFTs may see increased adoption this year, understanding how NFTs should be regulated has now become a top priority.","Andrew Rossow, attorney and CEO of AR Media Consulting, told Cryptonews that there is currently no specific federal legislation in the U.S. that directly speaks to NFTs, their governance, and their classification.","Given this, industry experts and organizations are looking to shape regulatory frameworks around NFTs. For example, The Chamber of Digital Commerce NFT impact report states that “NFTs are by and large consumer products that should not be regulated in the same manner as the early, financial applications of blockchain such as cryptocurrencies.”","U.S. lawmakers seem to have a differing opinion, however. For example, The United States Securities and Exchange Commission (SEC) charged media and entertainment company Impact Theory with conducting an unregistered offering of crypto asset securities in the form of NFTs in August last year.","“This raised alarm bells for everyone,” Carbone said. “There are now concerns that the SEC will get involved and start to regulate NFTs as securities.”","To ease these concerns, Carbone shared that The Chamber of Digital Commerce hosted its first-ever “NFT Education Day” on Jan. 31. According to Carbone, the purpose of the event was to bring NFT subject matter experts to Capitol Hill to educate both the SEC and Congress on non-fungible tokens.","Specifically, Carbone mentioned that industry experts met with SEC Commissioner Hester Peirce, along with several House Representatives. According to him, there was an overall general receptiveness to NFTs and their use cases beyond digital collectibles.","“There was agreement across the board that NFTs should not be securities and should be treated as consumer goods,” he told Cryptonews. “There was an appetite to pass specific legislation to exempt consumptive NFTs from securities laws, but not add it to anything that already exists.”","Carbone added that throughout the event industry leaders were told several times that engagement with other committees outside of financial services is crucial for new regulations around NFTs to form.","The Chamber of Digital Commerce founder and CEO Perianne Boring told Cryptonews that The Chamber is not advocating for specific regulations tailored exclusively to NFTs, noting that proposing they prematurely could overlook the complexities and evolving nature of the industry.","“As the technology and its applications continue to develop, we advocate for a measured and comprehensive approach to regulation that considers the unique characteristics and potential implications of NFTs within existing legal frameworks,” Boring said. “Our stance prioritizes thorough analysis and dialogue among stakeholders to ensure that any regulatory measures regarding NFTs are informed, balanced, and conducive to fostering innovation while safeguarding consumer protection.”","While this perspective comes from a U.S. based organization, Yat Siu, co-founder and executive chairman of gaming software and venture capital company Animoca Brands, told Cryptonews that most countries in Asia do not have specific or advanced regulations for NFTs.","“Many jurisdictions are looking to self-governing bodies or associations to help regulate NFTs, or they are waiting for the NFT market to evolve further in order to assess the need for regulation,” he said, adding that he believes NFTs should be treated similarly to how real-world assets are treated. “For instance, there shouldn’t be regulation, but more consumer protection.”","According to Siu, due to the versatile nature of NFTs, coupled with the fact that these digital assets can represent many different things, a regulatory framework must be flexible enough to account for this diversity.","“Context is crucial – it’s not just about regulating NFTs for being NFTs, but rather understanding what those NFTs represent on a case-by-case basis,” he added. “For example, selling an NFT is not the same as selling a security, but selling fractional ownership of an NFT may be categorized by regulations as selling a security.”","Industry experts in Europe are also looking to create regulatory clarity around NFTs. Tokenization platform Brickken’s head of legal, Elisenda Fabrega, told Cryptonews that in the European Union (EU), the regulatory scenario for NFTs is intricate, mainly due to the lack of specific regulations.","It’s also important to note that while The European Union’s Markets in Crypto Assets regulation – also known as MiCA – is due to take effect at the end of this year, the commission will likely report on NFTs laws in 2025.","In the meantime, Fabrega believes that the characteristics of NFTs can give rise to specific rights and obligations, necessitating the application of different legal frameworks.","“For example, in contexts where NFTs serve as contracts or embody contractual rights, the significance of contract law is magnified,” Fabrega said. “Yet an NFT resembling traditional financial instruments could be classified as a ‘security token,’ subject to European and national financial regulations, such as MiFID II.”","Fabrega further explained that a key focus for NFT regulation in the EU is around consumer protection.","“As more consumers engage with NFTs, the EU has placed increasing emphasis on safeguarding their interests,” she explained to Cryptonews. “This includes ensuring transparency in transactions, providing clear information about the rights and limitations associated with NFT purchases, and protecting against deceptive practices.”","While it’s notable that organizations want to help implement regulatory frameworks for NFTs, confusion around these digital assets persists.","For instance, Carbone mentioned that the best advice he received during NFT Education Day was to refrain from using the term “NFTs” due to its association with cryptocurrency.","“We need to find a new name for NFTs moving forward,” he said.","Siu further shared that while there are NFT whitepapers present in regions like Japan, this doesn’t mean that NFTs are being regulated according to those documents.","“In my view, it is unlikely that NFTs themselves will ever be regulated,” Siu remarked.","Yet the diverse and multifaceted nature of non-fungible tokens might be the biggest challenge to consider when it comes to establishing a regulatory framework for these assets. According to Fabrega, the wide-ranging use cases of NFTs creates a formidable obstacle for the implementation of a uniform regulatory framework.","“This diversity requires a careful and tailored approach to regulation, as different categories of NFTs intersect with various legal domains, encompassing intellectual property law, contract law, and financial regulation,” she said.","To accommodate for this, Fabrega believes that a well-structured regulatory approach is instrumental for maintaining a trustworthy and sustainable market for NFTs.","“This will encourage innovation while diligently safeguarding the interests of all stakeholders involved.”"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"AR Media Consulting","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Jan. 31","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"445%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Carbone","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Andrew Rossow","content":"PERSON"},{"type":"MiCA –","content":"ORGANIZATION"},{"type":"$12.6 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"Digital Commerce","content":"ORGANIZATION"},{"type":"The Chamber of Digital Commerce NFT","content":"ORGANIZATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"The Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$23 billion","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Cody Carbone","content":"PERSON"},{"type":"House Representatives","content":"ORGANIZATION"},{"type":"Crypto Assets","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Yat Siu","content":"PERSON"},{"type":"August last year","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Fabrega","content":"PERSON"},{"type":"Fabrega","content":"LOCATION"},{"type":"Elisenda Fabrega","content":"PERSON"},{"type":"Siu","content":"ORGANIZATION"}],"hashtag":["NFT","Regulations","United States"],"authors":["Rachel Wolfson"]}