{"summary":"Binance Slapped With $4.3 Million Fine By Canada’s FINTRAC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-slapped-wth-fine-by-fintrac-canadian-regulator.htm","publishDate":"2024-05-09T20:28:06","id":17614,"type":null,"title":"Binance Slapped With $4.3 Million Fine By Canada’s FINTRAC","category":["Blockchain News "],"content":["Crypto exchange Binance is facing a $4.3 million USD fine by the Financial Transactions and Reports Analysis Centre of Canada (FINTRAC) for violating terrorist financing and money laundering laws, the Canadian regulator announced Thursday.According to a  press release, Binance will have to pay $6,002,000 CAD in administrative monetary penalties for failing to register with FINTRAC as a foreign money services business as well as failing to report cryptocurrency transactions of $10,000 or more within a single payment.","","The regulator added that between June 1, 2021, and July 19, 2023, Binance did not report single transactions over $10,000 on 5,902 occasions.","FINTRAC further claimed the crypto exchange had “several opportunities” as a foreign money services business but failed to do so by the regulator’s provided deadlines.","#FINTRAC has imposed an administrative monetary penalty of $6,002,000 on Binance Holdings Limited, a foreign money services business. For more information, consult the Centre’s website: https:\/\/t.co\/x7KF5M3s2v pic.twitter.com\/slFic4gJWo","— FINTRAC_Canada (@FINTRAC_Canada) May 9, 2024","","“Canada’s Anti-Money Laundering and Anti-Terrorist Financing Regime is in place to protect the safety of Canadians and the security of Canada’s economy,” said Sarah Paquet, Director and CEO of FINTRAC. “FINTRAC will continue to work with businesses to help them understand and comply with their obligations under the Act.”\n","Binance has been at the heart of several major cryptocurrency regulatory actions in recent months. Just over a week ago, former CEO Changpeng ‘CZ’ Zhao was sentenced to four months in federal prison after pleading guilty to money laundering charges.“Our industry has entered a new phase,” Zhao posted to X shortly amidst news of his sentencing. “Compliance is super important.”Binance formally announced the rescission of all Canadian services in May of last year, citing the country’s stablecoin guidance and limits to crypto exchange investors.In March, the crypto exchange shuttered operations in Nigeria after two Binance executives were arrested for the company’s digital asset operations within the African nation.Nigerian officials have alleged that Binance manipulated the country’s currency, naira, causing their economy to crash.","''in the case of Binance, In the last one year, 26 billion dollars has passed through Binance Nigeria from sources and users who we cannot adequately identify.''","CBN Governor, Olayemi Cardoso pic.twitter.com\/A6O2wlsY5M","— Channels Television (@channelstv) February 27, 2024","","Earlier this year, Central Bank of Nigeria Governor Olayemi Cardoso claimed that $26 billion had moved through the country via Binance in 2023 alone “from sources and users we cannot adequately identify.”","In addition to the crypto company’s case in Nigeria and Zhao’s legal issues in the U.S., news of Canada’s charges against Binance could signal increasing international regulatory pressure in light of a string of high-profile enforcement actions."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"June 1, 2021","content":"DATE"},{"type":"Binance Holdings Limited","content":"ORGANIZATION"},{"type":"Sarah Paquet","content":"PERSON"},{"type":"May 9, 2024","content":"DATE"},{"type":"Binance Nigeria","content":"LOCATION"},{"type":"Canada’s Anti-Money Laundering","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$4.3 million","content":"MONEY"},{"type":"February 27, 2024","content":"DATE"},{"type":"$26 billion","content":"MONEY"},{"type":"26 billion dollars","content":"MONEY"},{"type":"July 19, 2023","content":"DATE"},{"type":"Financial Transactions","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"Central Bank of Nigeria Governor Olayemi Cardoso","content":"ORGANIZATION"},{"type":"May of last year","content":"DATE"},{"type":"Anti-Terrorist Financing Regime","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$6,002,000","content":"MONEY"}],"hashtag":["Binance","Canada","CZ"],"authors":["Julia Smith"]}