{"summary":"Galactic Group Launch AAA Web3 Play-to-Own Game Publisher With World-Class Talent","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/galactic-group-launch-aaa-web3-game-publisher.htm","publishDate":"2024-04-19T15:18:47","id":17619,"type":null,"title":"Galactic Group Launch AAA Web3 Play-to-Own Game Publisher With World-Class Talent","category":["Blockchain News "],"content":["Galactic Group to launch AAA Web3 game publisher in the United Arab Emirates (UAE) with the backing of world-class talent from Hollywood and the gaming industry.","The recently established business, known as Galactic Entertainment Publishing, is the first division of parent company Galactic Group.","It is the brainchild of industry visionary Loren Roosendaal, who intends to redefine the gaming space as one of the world’s first play-to-own publishers, elevating Web3 gaming to Triple-A status.","A goal that is not without support, bringing together renowned talent from the gaming and movie industry, including co-founder and former Head of Disney’s AAA Studios Mark Meyers.","The first installment in this vision, Planet Quest, has been in development since 2022 – and has already drawn in a crowd with an invested fanbase.","“PlanetQuest passport holders account for over 300,000 connected wallets, over 200,000 of which hold one or more PlanetQuest NFTs.”","The team behind it draws from the experience of former employees of Epic, Disney, Warner Bros., and Activision-Blizzard. Their credits represent a range of franchises, spanning AAA games like Fortnite, Call of Duty, and Star Wars: Jedi Survivor to films like The Batman, Avengers, and Blade Runner.","However, the team went far beyond the studio, with the involvement of the game’s fanbase having a significant impact on its development.","Over 250,000 fans have co-created the storyline and lore of the Star Wars-esque franchise, culminating in an accompanying trilogy of books, comics, and another game to be revealed later, according to a report from VentureBeat.","This has resulted in a real community with genuine investment in the product, born out of their shared passion, rewarded with in-game assets for their engagement.","“Naturally no first attempt at something new is perfect, but it’s been amazing getting to create a sci-fi universe with the fans in a way that’s never been attempted before. I’ve gotten to fulfill a lot of my childhood dreams, working on Star Wars, Blade Runner and Marvel movies to name a few, but there’s little that compares to being able to interact and build with the fans from day one,” comments Chief Creative Officer Jon McCoy.","Play-to-own titles leverage blockchain technology and develop non-fungible tokens (NFTs) to provide users with full ownership of in-game assets, such as characters, items, or land.","Something that Co-Founder Mark Meyers has attributed to the community built behind the project.","“Involving the community early on and rewarding them for their participation with in-game goods that they actually own benefits publishers, developers and players, by reducing publisher ad spend, providing the feedback developers need and getting the players better games,” said Meyers.","Cracks are emerging in the dominant Free-to-Play model of today. The publishing costs of games are increased by spending tens of billions of dollars on advertising to draw in new players. These costs are then passed on to players through progressively more costly in-game purchases.","Something Roosendaal seeks to correct, saying “It’s crazy to think that players are spending over $100 billion and 100’s of hours of their spare time each year, gathering in-game items they don’t actually own.”","This may just be what the gaming community needs. Increasingly present monetization has caused the gaming industry to stray away from consumer engagement in favor of profits. ","Dominant publishers are churning out products designed to rinse players of their money and be discarded with annual releases, forcing those committed to the franchise into a worthless gameplay loop.","Play-to-earn is the solution; community-driven decisions and ownership will become the new standard for global entertainment, establishing a transactional relationship between the publisher and the player rather than a parasitic one. "],"entity":[{"type":"Hollywood","content":"LOCATION"},{"type":"Mark Meyers","content":"PERSON"},{"type":"Loren Roosendaal","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Marvel","content":"ORGANIZATION"},{"type":"United Arab Emirates (UAE","content":"ORGANIZATION"},{"type":"Star Wars","content":"ORGANIZATION"},{"type":"Activision","content":"ORGANIZATION"},{"type":"Avengers","content":"ORGANIZATION"},{"type":"Warner Bros.","content":"ORGANIZATION"},{"type":"Disney’s AAA Studios Mark Meyers","content":"ORGANIZATION"},{"type":"Jon McCoy","content":"PERSON"},{"type":"Galactic Entertainment Publishing","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Galactic Group","content":"ORGANIZATION"},{"type":"Meyers","content":"PERSON"},{"type":"tens of billions of dollars","content":"MONEY"},{"type":"Disney","content":"ORGANIZATION"}],"hashtag":["Gaming","NFTs"],"authors":["Harvey Hunter"]}