{"summary":"Silvergate Capital shares dropped following the company’s earnings announcement early Tuesday.\nThe crypto-focused bank reported earnings per share (EPS) of $1.28 compared with analysts’ estimate of $1.41.\nThe company reported net income of $43.3 million, $40.6 million of which was available to common shareholders.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178001\/silvergate-capital-stock-falls-on-q3-earnings-report","publishDate":"2022-10-18T14:59:58","id":1762,"type":null,"title":"Silvergate Capital stock falls on Q3 earnings report","category":["Blockchain"],"content":["<span data-v-f87c67ca=\"\">Silvergate Capital's shares fell after the company released its third-quarter earnings statement Tuesday and reported earnings per share (EPS) below analyst estimates.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Silvergate shares were <\/span><a href=\"https:\/\/www.cnbc.com\/quotes\/SI\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">down<\/span><\/a><span data-v-f87c67ca=\"\"> about 20% Tuesday afternoon after the company discussed its results during a conference call. Silvergate reported EPS of $1.28 in its third-quarter earnings presentation, compared with analysts’ consensus estimate of $1.41 via S&amp;P Capital IQ.<\/span>","<span data-v-f87c67ca=\"\">The La Jolla, Calif.-based crypto bank reported net income of $43.3 million, up from $38.6 million in the previous quarter and $23.5 million in the same<\/span><span data-v-f87c67ca=\"\"> three-month period of 2021. Net income available to common shareholders in the third quarter came in at a record $40.6 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Transfers via Silvergate’s real-time settlement network totaled $112.6 billion in the third quarter, which represents a 41% decrease compared with the previous three-month period and a 30% decline from the third quarter of 2021.<\/span>","<span data-v-f87c67ca=\"\">“While volumes on the Silvergate Exchange Network (SEN) decreased this quarter compared to the overall industry, we remain confident in the power of our platform and the opportunities for expansion within the network,” Silvergate CEO Alan Lane said in a statement. “We continued to see demand for our SEN Leverage product and growth in our new customer pipeline, a testament to the strength of our platform against a challenging backdrop in the broader digital asset industry.”<\/span>","Silvergate reported a 35% <a href=\"https:\/\/www.theblock.co\/linked\/142496\/silvergate-says-its-crypto-customer-base-grew-to-more-than-1500-in-2022s-first-quarter\" data-v-f87c67ca=\"\">decline<\/a> in transfers on its payment network in the first quarter compared with the previous three-month period. Activity picked up again in the second quarter, with transfers increasing 34% quarter over quarter.","&nbsp;"],"hashtag":["EARNINGS"]}