{"summary":"Robinhood Reports 224% Surge in Crypto Trading Volumes in Q1","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robinhood-reports-224-surge-in-crypto-trading-volumes-in-q1.htm","publishDate":"2024-05-09T06:28:13","id":17623,"type":null,"title":"Robinhood Reports 224% Surge in Crypto Trading Volumes in Q1","category":["Altcoin News "],"content":["Popular trading platform Robinhood has experienced a substantial increase in crypto trading volumes during the first quarter, with a surge of 224% to reach $36 billion.","The growth played a significant role in driving the company’s transaction-based revenue up 59% year-over-year to $329 million, with crypto-related revenue alone witnessing a substantial 232% rise to $126 million, according to Robinhood’s recent report.","The surge in crypto trading volumes on Robinhood’s platform comes as no surprise, as other publicly traded crypto peers such as Coinbase have also reported impressive first-quarter performances due to the improving conditions in the crypto market.","","In addition to the surge in trading volumes, Robinhood announced that it held $26.2 billion in users’ crypto assets under custody as of March 31, marking a notable 78% increase from the end of 2023.","These figures demonstrate the growing interest and participation in cryptocurrencies among Robinhood’s user base.","The positive performance in crypto trading significantly contributed to Robinhood’s overall financial success for the first quarter.","The company exceeded expectations, reporting $618 million in revenue, surpassing analyst estimates of $552.7 million.","Additionally, Robinhood’s earnings for the quarter stood at $0.18 per share, exceeding the average analyst expectation of $0.06.","Following the release of these impressive financial results, shares of Robinhood saw a post-market trading increase of approximately 7%, while Coinbase shares experienced a slight decline.","Year-to-date, Robinhood’s stock has risen by about 40%, while Coinbase has gained 22%.","","However, amidst the positive news, Robinhood recently disclosed that it has received a Wells Notice from the U.S. Securities and Exchange Commission (SEC) regarding its crypto unit.","A Wells Notice informs recipient that the regulator has concluded investigation against them and plans to file an enforcement action.","The company’s CFO, Jason Warnick, said he was disappointed to receive the notice but emphasized that it would not impact customer accounts or affect the operations of the crypto arm.","“We’ve been very conservative in our approach in terms of points listed and services offered,” Warnick added.","“And we’re a highly regulated company and have applied the same legal and compliance standards we use for our brokerage to the way we run our crypto. So it’s disappointing to see more regulation by enforcement.”","As reported, crypto trade association Digital Chamber has slammed the SEC for issuing a Wells Notice to Robinhood Crypto, calling it an “alarming development.”","The Digital Chamber called this as yet another instance of the regulator’s “unchecked regulatory overreach,” similar to previous ones.","The SEC has previously issued Wells Notice to major industry players like Uniswap and Consensys.","Other top legal experts in the crypto industry have raised concerns over the SEC’s several Wells Notices.","For instance, Jake Chervinsky, Variant Fund’s Chief Legal Officer, took to X (Twitter), expressing his dismay over the SEC’s enforcement intentions."],"entity":[{"type":"$329 million","content":"MONEY"},{"type":"$618 million","content":"MONEY"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"78%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"$126 million","content":"MONEY"},{"type":"59%","content":"PERCENT"},{"type":"Jason Warnick","content":"PERSON"},{"type":"$0.18","content":"MONEY"},{"type":"$36 billion","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"Digital Chamber","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$26.2 billion","content":"MONEY"},{"type":"224%","content":"PERCENT"},{"type":"$552.7 million","content":"MONEY"},{"type":"Warnick","content":"PERSON"},{"type":"232%","content":"PERCENT"},{"type":"March 31","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wells Notices","content":"ORGANIZATION"},{"type":"$0.06","content":"MONEY"}],"hashtag":["Crypto Trading","Robinhood"],"authors":["Ruholamin Haqshanas"]}