{"summary":"Coinbase CEO: Adopting Bitcoin Is A Return To The Gold Standard","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-ceo-bitcoin-is-a-return-to-the-gold-standard.htm","publishDate":"2024-03-13T18:36:53","id":17622,"type":null,"title":"Coinbase CEO: Adopting Bitcoin Is A Return To The Gold Standard","category":["Bitcoin News "],"content":["Coinbase CEO Brian Armstrong suggested on March 12 that widespread Bitcoin adoption could mirror a return to the gold standard, potentially stabilizing the U.S. economy in the face of escalating national debt.","In a post on X, Armstrong noted the potential of Bitcoin as a financial tool that could curb excessive government spending in the United States. This insight was shared in response to concerns raised by CFO Robert Sterling about the escalating national debt.","The CFO pointed out the alarming rate at which the debt is accumulating. Worryingly, the analyst said “trillion-dollar increments” were being added at an increasingly rapid pace. Sterling said the rate of money printing transcends political affiliations and demands “urgent attention.”","Armstrong pointed out the unique attributes of Bitcoin that could help curb unchecked money printing. For example, unlike the USD, which the Federal Reserve can print at will, Bitcoin has a finite supply of 21 million BTC. ","This is (in part) why Bitcoin matters. It’s a return to the gold standard that we left fully in 1971. A return to financial discipline.","Bitcoin will be an important check and balance on excessive deficit spending which is essential to the U.S. and the dollar remaining strong. https:\/\/t.co\/u4mN5SgPTX","— Brian Armstrong 🛡️ (@brian_armstrong) March 12, 2024","","In addition to its limited supply, BTC is deflationary. The network automatically halves miner rewards every four years or 240,000 blocks. In the current epoch, a successful miner receives 6.125 BTC. This figure which will drop by 50% when the halving happens by mid-April 2024. ","This deflationary nature means Bitcoin, while acting as a substitute for the USD as a medium of exchange, can also be a store of value like gold. Bitcoin has the advantage of being digital as well, which facilitates seamless value transfer, staying true to its original design as electronic cash and offering an alternative to the USD’s infinite supply.","Armstrong believes that widespread adoption of Bitcoin could be akin to returning to the “gold standard.” In this scenario, Bitcoin could help stabilize prices and bolster the USD by counterbalancing unrestrained government spending.","Coinbase continues to play a crucial role in crypto and trading. By creating a ramp where users can trade, among other cryptocurrencies, Bitcoin, the platform helps drive adoption.","The exchange recently announced plans to raise $1 billion using a convertible debt offering. This is the same strategy MicroStrategy has used with great success. "],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"1971","content":"DATE"},{"type":"CFO Robert Sterling","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"mid-April 2024","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"March 12, 2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"March 12","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Coinbase","United States"],"authors":["Dalmas Ngetich"]}