{"summary":"Castle Funds’ COO Exclusive: Just Because Bitcoin ETFs Are Allowed Doesn’t Mean They’ll Succeed","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/castle-fund-just-because-bitcoin-etfs-are-allowed-doesnt-mean-theyll-succeed.htm","publishDate":"2024-01-22T16:07:03","id":17629,"type":null,"title":"Castle Funds’ COO Exclusive: Just Because Bitcoin ETFs Are Allowed Doesn’t Mean They’ll Succeed","category":["Bitcoin News "],"content":["In an insightful interview with Cryptonews, Dan Hoover, the Chief Operating Officer and Chief Compliance Officer at investment firm Castle Funds, discussed several Bitcoin ETF-related topics.","These include how valuable Bitcoin ETF trading volume information really is, what it takes for ETFs to succeed, why TradFi market minutiae are “very foreign” to most crypto market participants, and much more.","This is what he had to say.","The spot Bitcoin ETFs’ initial trading volumes suggest that the supporting players in any successful exchange-traded product (ETP) launch are not yet up and running in volume, Hoover told Cryptonews. (Note: ETFs are a subset of ETPs as a broader category.)","Therefore, he said,","“Trading volume is only powerful information if it results in creation of new ETP shares (assets in the Trust that the sponsor can charge a fee on).”","Otherwise, it just shows that the same shares are changing hands repeatedly.","Typically, this means that:","As an investor in the bitcoin markets, said Hoover, he would prefer that the BTC held in an ETP be purchased in the market and belong only to the fund or Trust, instead of being borrowed from another party that keeps a claim on the coins.","Spot Bitcoin ETFs come with a set of benefits. These include fewer access challenges for investors and a competitor for the poorly-performing futures-based Bitcoin ETFs, Hoover argued.","Over the next few months, the launch issues “will ease a bit.” There will be an opportunity for the market participants – APs, broker-dealers, and options market-makers – to resell ETPs to individual investors, Hoover said.","Long-term, however, while ETPs are “a reasonable solution” to the regulatory ambiguity constraining access for most US investors,","“I believe that the ETP technology (with its additional liquidity sources, price discovery functions, etc.) is a poor solution to digital-asset market access problems.”","Nonetheless, it took nearly three decades for ETFs to become fully regulated in the USA, so Hoover finds it unlikely that “the current suite of products will lose their regulatory reasons to exist any time soon.”","Furthermore, the COO explained that the Bitcoin markets are “understandably very concerned” about several large market participants trading BTC on a continuous market – while the supply and demand are constrained to a single specific point in time five days a week.","Meanwhile, Shane Rodgers, the Chairman and Co-founder of the PDX platform, argued that there aren’t downsides to the Bitcoin ETFs. The only thing is that, in the short term, investors continue to be “overly exposed to the vagaries of unsophisticated small money in the spot retail space.”","On the other hand, said Rodgers,","“[There are] tremendous benefits to the upside in terms of prices and valuations, as well as, especially, increasing mass acceptance and adoption of BTC, and of crypto assets generally.”","Issuing is one thing, but whether an ETP, including the spot Bitcoin ETF, will actually succeed is another. Hoover noted that success depends on several key questions. These include:","Rodgers opined that the only real differentiating factor so far in the approved BTC spot ETFs are the fees.","Additionally, crypto is still a speculative and volatile asset class. “The fact you can participate via an ETF does not mitigate the safety or volatility of the underlying spot asset,” he said.","According to the #Grayscale website, #Grayscale currently holds 566,973 $BTC($23.21B), decreasing ~52,227 $BTC ($2.14B) since the ETF was passed.","And iShares(Blackrock) holds 33,431 $BTC($1.37B), Fidelity holds 24,857 $BTC($1.02B), Bitwise holds 10,152 $BTC($415.6M). pic.twitter.com\/fx2Kj3WpSB","— Lookonchain (@lookonchain) January 22, 2024","","Hoover noted that it is essential to understand how demand for “exposure” to Bitcoin through an ETP actually impacts the “flows” or value of assets within that ETP.","He explained that the ETPs have several layers of separation between “demand for Bitcoin by investors” and additional shares.","Importantly,","“These market minutiae are very foreign to most participants in the digital asset markets, and the idea that there are so many layers between market demand for the ETP and demand for the underlying asset can be difficult to connect with the expectations of ‘massive flows’.”","Hoover gave an example of an investor who wants to purchase ETP shares. They place the order with their broker. Then, the order could be filled from any or several sources.","Here are four scenarios, and only one results in ETP seeing additional assets under management (AUM):","All this said, there are reasons for hedgers not to choose the new Bitcoin ETF. “Orderly trading in ETP shares is dependent on cheap, accurate hedging,” the expert said. It is driven by the availability of good substitutes for the asset the ETP seeks to track.","However, given the costs of hedging in the futures market and the regulatory difficulties when it comes to broker-dealers owning spot BTC themselves, Hoover said he wouldn’t find it surprising if some hedgers choose the Grayscale product, shares of mining companies, or MicroStrategy as better accessible BTC substitutes than the spot BTC.","Hoover also commented on the initial selling pressure in spot BTC, saying “there are some reasonable explanations” there.","There was some “sell the news” pressure, but also what he described as the release of pent-up demand to close out the GBTC arbitrage trade carried by certain participants for years.","The CEO mentioned that the broader pressure on the markets was likely related to the early stages of setting up efficient hedging operations to keep market-making profitable and the trading costs reasonable.","He again noted the differences between trading these product shares and trading digital assets 24\/7.","First, he said, there is the above-discussed “long path” between market demand for ETP shares and flows measured by new ETP shares being issued.","Then, Hoover said,","“The SEC approved the first trades on Thursday before a three-day weekend in the US markets, which contributed to the delay.”","A trade creating new ETP shares (“flow”) on Thursday would not need to be paid for with cash until next Tuesday. Therefore, there is no efficient hedging of any price action until Tuesday morning.","Bitcoin settles with each block or approximately every 10-15 minutes. However, the Bitcoin ETF shares settle on T+2 New York business days. It does not include weekends and holidays.","“This timing difference, compounded by the fact that the ETP needs to price at the 4:00 pm New York close of the equity markets, creates a potential for manipulative activity in the Bitcoin market similar to that seen in the foreign-exchange markets in the early 2010s, for which a cartel of 15 banks paid more than $2.3billion to settle ligitation.”","The APs who bought the new Trust shares on Thursday and Friday, said Hoover, had a responsibility to manage their exposure to the price of BTC while the equity markets and the banks do not work.","Hence, BlackRock, for example, was obligated to help its customers (the APs) meet that responsibility.","Per Hoover, agreeing to issue new shares of the iShares IBIT trust on Friday, lock in an amount of BTC due in exchange for those shares based on the Friday 4:00p price in New York, and then wait to buy in the BTC until the following Wednesday when the shares were issued and settled – would have been “very irresponsible.”","Narrow net inflows, as all other providers slightly beat the GBTC outflow in day 6 pic.twitter.com\/1fMws3e5yl","— BitMEX Research (@BitMEXResearch) January 20, 2024","","Lastly, Hoover explained that the market for ETP shares is ultimately an institutional market. All ETPs are institutional products by definition.","The US Securities and Exchange Commission (SEC) requires companies to issue new shares of these products in expensive blocks. iShares IBIT, for example, is targeting a block size of $1 million, said Hoover.","BlackRock and the other Bitcoin ETF sponsors have consistently marketed their products to the “advisor” and “buy-side” markets.","This includes managers of model portfolios (e.g., Edelman Financial Engines), “robo-advisors” (such as Schwab’s Intelligent Portfolios product), and professional asset managers (hedge funds, mutual funds, pension funds, and the like).","“If an individual investor can’t place an order for ETP shares directly with the fund or trust via a transfer agent, and be guaranteed that their shares will be purchased at net asset value of the fund or trust on that day, the product is not a retail product.”","There are regulatory restrictions, but also the margins on ETP fees “simply aren’t large enough to support the massive cost of mass-marketing to retail investors.”","The business relies on economies of scale, Hoover said. A few flagship products provide enough fees to support marketing the sponsor’s brand across all of the products on the platform.","____","Read more: Expert Opinions: Massive Inflows to Follow Spot Bitcoin ETF Approval, Bull Market Questionable"],"entity":[{"type":"January 20, 2024","content":"DATE"},{"type":"Shane Rodgers","content":"PERSON"},{"type":"COO","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USA","content":"ORGANIZATION"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"Schwab","content":"LOCATION"},{"type":"Hoover","content":"PERSON"},{"type":"$2.3billion","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"$2.14","content":"MONEY"},{"type":"day weekend","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Dan Hoover","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$BTC($23.21","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"$BTC($1.02","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Bull Market Questionable","content":"ORGANIZATION"},{"type":"$BTC($415.6","content":"MONEY"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Rodgers","content":"PERSON"},{"type":"Castle Funds","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Edelman Financial Engines","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"US","content":"LOCATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"ETP","content":"ORGANIZATION"},{"type":"$BTC($1.37","content":"MONEY"},{"type":"January 22, 2024","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"2010s","content":"DATE"}],"hashtag":["Bitcoin ETF","ETF","Market"],"authors":["Sead Fadilpašić"]}