{"summary":"K-pop Giant SM Entertainment Eyes Crypto and Blockchain Expansion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/k-pop-giant-sm-entertainment-eyes-crypto-and-blockchain-expa-4583.htm","publishDate":"2019-09-05T05:02:28","id":17638,"type":null,"title":"K-pop Giant SM Entertainment Eyes Crypto and Blockchain Expansion","category":["Blockchain News "],"content":["SM Entertainment, South Korea’s largest talent agency, says it wants to launch its own blockchain platform – and could potentially use a cryptocurrency of its own to power business growth.","The company, which raked in USD 518 million in revenues in 2018, is the home of some of the biggest names in K-pop – including groups EXO, NCT, Super Junior, Red Velvet and Girls Generation.","SM made its blockchain announcement at the Upbit Developer Conference. Per a report from newspaper Chosun Ilbo, Joo Sang-sik, the head of SM’s Industry 4.0 division, stated that the company plans to “launch its own blockchain-powered mainnet” – and has no plans to use an existing platform.","SM said it intended to pursue private and public blockchain initiatives and said that it is also currently in talks with a number of partners regarding the “construction” of its “forthcoming blockchain business.”","Chosun also states that Joo “responded positively” to questions about the possibility of launching an SM token, but refused to give a concrete answer on the matter.","SM also hinted that a “token economy built using cryptocurrency” would allow artists to create higher-quality content, powered by fan contributions.","And Joo stated that SM sees blockchain as a “long-term” plan, and that fans could expect to see it develop “in stages, according to priority.”","As previously reported, several smaller South Korean companies have been attempting to link the increasingly lucrative world of K-pop to cryptocurrencies for some time – with decidedly mixed results.","However, SM’s move would be the first time a major South Korean entertainment company has attempted to move into the cryptoverse in earnest.","The company has previously hinted at blockchain interest, and earlier this year joined Sony and several South Korean entertainment providers on an initiative named snowM.","The companies plan to create a blockchain-powered fan community, and will make use of Dunamu’s Lambda256 blockchain platform.","The four biggest entertainment companies in the country bring in a combined USD 1 billion a year, per government figures released in 2018, with the combined industry thought to be worth well in excess of USD 5 billion."],"entity":[{"type":"5 billion","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"Upbit Developer Conference","content":"ORGANIZATION"},{"type":"NCT","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"earnest","content":"LOCATION"},{"type":"Sony","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"EXO","content":"ORGANIZATION"}],"hashtag":["Blockchain","Entertainment","Music"],"authors":["Tim Alper"]}