{"summary":"Bonk Token on BASE Takes Off as This Other Dog Coin Raises $1 Million in 48 Hours","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bonk-token-on-ethereum-takes-off-as-this-other-dog-coin-raises-1-million-in-48-hours.htm","publishDate":"2024-04-11T12:54:37","id":17632,"type":null,"title":"Bonk Token on BASE Takes Off as This Other Dog Coin Raises $1 Million in 48 Hours","category":["Industry Talk "],"content":["Dog-themed tokens remain meme coin market favorites, and in the latest Dog-themed pump, a new BONK on BASE has exploded as part of a new trend for multichain meme coins – but does BONK price analysis spotlight another contender?","This article will analyze BONK’s current price trends and examine whether the multichain trend could propel new contender, Dogeverse, to 100x returns during the 2024 bull run.","$BONK on #BaseChain is PUMPINNNN pic.twitter.com\/y5vSnPYsO4","— 👑BITKING 👑 (@BITKING_ETH) April 10, 2024","","The rise of multichain Dogcoins seems a logical evolution of the well-established dog-themed token trade; with omnichain functionality coveted as a major narrative this year.","With the surging popularity of Coinbase’s Ethereum layer-2 scaling solution Base chain, the arrival of one of Solana’s biggest meme coins on BASE seemed inevitable – and it has taken off with a bang – hitting Hot #8 on DEXTools.","As price action surges back to retest local resistance, BONK on Base is currently trading at a market price of $0.0000000125 (representing a 24-hour change of -16.7%).","This comes after BONK launched at just 4 AM UTC on April 10, in a dramatic listing that garnered near-immediate traction.","Initial price action saw BONK climb aggressively for roughly 13 hours, with a brief stop-off at $0.0000000036 setting the stage for the all-time high at $0.000000028.","","Yet, a retracement was inevitable with early backers sitting atop over 50,000% gains. This set in at 11 PM on April 10 – with technical structure collapsing, sending price down by -76% to lower support.","A strong display by 1,850 loyal holders has seen a defense of the support zone at $0.0000000036 – with upside movements over the past few hours suggesting an imminent retest of resistance at $0.000000015.","Indeed, with BONK on Base now sat with a more alluring entry around a $1m market cap – late-stage retail investors could be appetized by the allure of potential 10x returns from these levels.","","Dogeverse (DOGEVERSE), is a new multi-chain dog-themed meme coin project with an active presale that has currently raised almost $1M in just 48 hours.","","The meme coin is deploying its highly anticipated presale across multiple chains, including Ethereum, Avalanche, Base, and Solana.","The project’s developer said this approach democratizes access, and anyone can acquire the coin, turbocharging growth – becoming a force across the crypto market","","Looking at events in the market, the in-demand Dogeverse presale will likely reap massive benefits as more users flock, searching for potent meme coins.","Supporters claim Dogeverse could be the next BONK and BOME, securing a $1 billion market cap in the coming weeks.","Follow Dogeverse on X to get the latest news and connect with the presale community on Telegram.","Buy Dogeverse Here",""],"entity":[{"type":"$1m","content":"MONEY"},{"type":"$1M","content":"MONEY"},{"type":"April 10, 2024","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"-76%","content":"PERCENT"},{"type":"Dogeverse","content":"LOCATION"},{"type":"BONK","content":"ORGANIZATION"},{"type":"$BONK","content":"MONEY"},{"type":"$0.000000028","content":"MONEY"},{"type":"-16.7%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"50,000%","content":"PERCENT"},{"type":"$0.0000000036","content":"MONEY"},{"type":"$0.000000015","content":"MONEY"},{"type":"$0.0000000125","content":"MONEY"}],"hashtag":["Bonk","dogcoin","MultiChain"],"authors":["Sam Cooling"]}