{"summary":"Ethereum Scalability Solution is Coming ‘Soon,’ says Vitalik Buterin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-scalability-solution-is-coming-soon-says-vitalik-bu-5962.htm","publishDate":"2020-03-06T10:40:00","id":17630,"type":null,"title":"Ethereum Scalability Solution is Coming ‘Soon,’ says Vitalik Buterin","category":["Ethereum News "],"content":["Ethereum (ETH) has a plan to fix its well-known scaling issue, and co-founder Vitalik Buterin says the solutions will start rolling out soon.","In an interview with BLOCKTV this week, he said that scaling, a major Ethereum problem that’s been pointed out many times, is something the team will be dealing with in the short term. There’s already a lot of progress accomplished in this area, “the spec there is almost done,” and “it’s mostly an implementation challenge now,” he claims.","What Ethereum team seems particularly excited about is another scaling research that Buterin says is making progress and is coming soon: Rollups.","Buterin explains in simple terms that a Rollup is a scaling technique that keeps transaction data on-chain, in a compressed form, but the computation is pushed off-chain. Instead of verifying computation, such as signature verification, contract execution, zero-knowledge (ZK) proof execution, etc., directly on-chain, it’s verified either in:","Both of these are “amazing” techniques, Buterin claims, adding that he expects them to make “a huge difference over the next year or so.” For example, Loopring recently launched a ZK-Rollup exchange, which can theoretically accomplish 2,500 transactions per second (TPS) if all Ethereum users were to become their users. Furthermore, Optimism and Arbitrum are two teams he names as making major progress in the area of Optimistic Rollups. These are not just scaling payments, he says, but are “scaling something that is equivalent to the Ethereum virtual machine.”","A lot of “quiet work” has been happening in the past month, he adds, in making zero-knowledge proofs for general computation possible, which will be “great” for any ZK rollup, as well as for the growth of privacy, claims Buterin.","Furthermore, the scaling solutions are expected to lead to a variety of benefits. On a public chain, one can do a maximum of 15 TPS, says Buterin, a Rollup brings that up to 2,500-3,000 TPS, with sharding it’s 2,000-10,000 TPS, and it’s even higher with a Rollup on top of sharding. “Scalability of doing things on public blockchains is going to be very soon good enough for many kinds of mainstream enterprise applications,” and “it’ll lead to the change of focus for a lot of people.”","As for the longer-term plans, Buterin says that the work on Ethereum 2.0 will be ongoing this year and likely the next two years or so, but that we should expect Phase 0 to launch “at some point in the summer.” This phase will launch the Beacon Chain, an independent proof-of-stake chain. It’s currently in the “very late” stage of development and has already undergone a lot of testing. “That’s something we’re very excited about,” says Buterin. “Proof-of-stake is finally going to be real.” This phase will be followed by Phase 1 that’ll bring sharding of data.","Meanwhile, many others have been trying to find the solution to this blockchain issue, such as those by Asensys and MIT we recently talked about.","ETH is currently (09:49 UTC) trading at USD 236, having appreciated 2% in 24 hours and 7% in seven days.","{no_ads}"],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"7%","content":"PERCENT"},{"type":"Rollup","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"USD","content":"ORGANIZATION"}],"hashtag":["Blockchain","Ethereum","Scalability","Vitalik Buterin"],"authors":["Sead Fadilpašić"]}