{"summary":"MetaMask ‘Does Not Collect Taxes On Crypto Transactions’ Says ConsenSys in Push Back","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/metamask-does-not-collect-taxes-crypto-transactions-says-consensys-pushback.htm","publishDate":"2023-05-22T09:48:00","id":17641,"type":null,"title":"MetaMask ‘Does Not Collect Taxes On Crypto Transactions’ Says ConsenSys in Push Back","category":["DeFi News "],"content":["ConsenSys, the company behind the popular self-custodial crypto wallet MetaMask, has denied allegations that it collects taxes from users.","In a Saturday tweet, the company clarified that the rumors were based on ”inaccurate information” drawn from a misreading of MetaMask’s terms of service.","“Let’s clarify one thing upfront: MetaMask does NOT collect taxes on crypto transactions and we have not made any changes to our terms to do so,” the company said, adding that the claim is “false.”","At ConsenSys, our goal is to make web3 universally easy to use, access, and build upon through our suite of products.\n\nIt's important to note that the terms referenced are not new. They apply to our products that are subject to sales tax.","The misunderstanding allegedly stemmed from a circulated screenshot of MetaMask terms and conditions that said the company reserves “the right to withhold taxes where required.”","The blockchain company said the section exclusively referred to products and paid plans offered by ConsenSys, such as credit card developer subscriptions by Infura, which include sales tax.","“Legal terminology can be complex, but it’s crucial to emphasize that this section does not apply to MetaMask or any other products that don’t involve sales tax,” the company said. ","“MetaMask does not collect taxes on crypto transactions and we have not made any changes to our terms to do so.”","The misinformation spread like wildfire after it was posted on the r\/CryptoCurrency subreddit, where it has gathered more than 500 upvotes and 600 comments. ","A number of crypto influencers also picked up the news, further contributing to the spread of the misinformation. ","🚨 BREAKING 🚨\n\nMETAMASK NEW UPDATE IN TERMS AND POLICY WILL WITHHOLD YOUR TAXES. DECENTRALIZATION IS DYING pic.twitter.com\/wqpwAd2BQh","The backlash from the community came as ConsenSys had previously added some concerning changes to its privacy policy. ","Back in November, the company revealed that it will start collecting certain user-provided data, such as identity information (name, username, gender, date of birth, etc.), profile information (including username and password), contact, financial and transaction information, among others.","At the time, ConsenSys said its other product, Infura, will collect users’ IP addresses whenever they send a transaction. ","The update was met with criticism from crypto community members who expressed concern about their on-chain privacy. ","“The update ignited a variety of public and internal conversations around how we could better prioritize the privacy of MetaMask and Infura users,” ConsenSys said in a subsequent announcement. ","The company also revised its data retention, reducing the amount of time it will keep user data such as wallet addresses and IP addresses to seven days. ","While MetaMask won’t collect taxes from users, crypto traders are expected to start paying more taxes.","As reported, US President Joe Biden has said he is not willing to ink a debt ceiling agreement that would benefit crypto traders.","“I’m not going to agree to a deal that protects wealth tax cheats and crypto traders while putting food assistance at risk for nearly 1 million Americans.”","The alleged protections for crypto traders refer to tax-loss harvesting, a tax planning strategy that involves selling cryptocurrencies that have experienced a decline in value in order to offset capital gains taxes on other investments. "],"entity":[{"type":"Infura","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Infura","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"ConsenSys","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":["ConsenSys","MetaMask","Tax"],"authors":["Ruholamin Haqshanas"]}