{"summary":"Influential UK MPs Push for Crypto Trading to be Classified as Gambling","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/influential-uk-mps-push-for-crypto-trading-classified-as-gambling.htm","publishDate":"2023-05-17T13:00:00","id":17646,"type":null,"title":"Influential UK MPs Push for Crypto Trading to be Classified as Gambling","category":["Altcoin News "],"content":["The UK Treasury Select Committee has suggested the country regulate cryptocurrency trading as a form of gambling rather than a financial service.","On Wednesday, MPs said digital currencies such as Bitcoin and Ether have “no intrinsic value and no useful social purpose,” claiming that they resemble gambling more than financial services, as reported by British media outlet Sky News. ","The influential panel of MPs said cryptocurrency trading and investing could be addictive, like gambling. ","While acknowledging that the underlying blockchain technology could benefit the wider financial services industry, they said the process of betting on the volatile price of unbacked cryptocurrencies could lead consumers to lose life-changing sums of cash.","“Effective regulation is clearly needed to protect consumers from harm, as well as to support productive innovation in the UK’s financial services industry,” the Conservative MP and Treasury committee chair, Harriett Baldwin, said. ","“However, with no intrinsic value, huge price volatility, and no discernible social good, consumer trading of cryptocurrencies like bitcoin more closely resembles gambling than a financial service, and should be regulated as such.”","The announcement comes after the UK Treasury said earlier this year it is set to deliver “ambitious plans to robustly regulate cryptoasset activities” on a par with traditional finance.","“Under plans set out by the government today (1 February), it will seek to regulate a broad suite of cryptoasset activities, consistent with its approach to traditional finance,” the UK government said at the time. ","However, MPs said a better approach would be to recognize that crypto assets “more closely resembles gambling than a financial service.” They recommended applying safeguarding rules that oversee the likes of lotteries, betting firms, and casinos to crypto firms. ","MPs said they were concerned that bringing the industry under financial service regulation “will create a ‘halo’ effect that leads consumers to believe that this activity is safer than it is, or protected when it is not”.","They said that regulating cryptocurrencies as gambling would be consistent with the government’s policy of “same risk, same regulatory outcome.”","The Treasury Select Committee is appointed by the House of Commons to examine the expenditure, administration, and policy of the U.K. treasury, but it doesn’t have the power to set government policy.","Some crypto associations and bodies have hit back against the recent report by the Select Committee.","Ian Taylor, the board advisor at CryptoUK, the UK’s self-regulatory trade association representing the crypto asset sector, said the claims are “unhelpful, false, fundamentally flawed and unsubstantiated.”","“Professional investment managers see Bitcoin and other cryptoassets as a new alternative investment class – not as a form of gambling – and institutional adoption of unbacked crypto assets has increased significantly.”","The crypto guru also mentioned that the UK rakes in tens of millions of pounds in tax income from digital assets. But the government could lose this income if it regulates crypto as gambling since the latter is exempt from capital gains tax. "],"entity":[{"type":"Ian Taylor","content":"PERSON"},{"type":"UK Treasury Select Committee","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Treasury Select Committee","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"House of Commons","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Harriett Baldwin","content":"PERSON"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Select Committee","content":"ORGANIZATION"}],"hashtag":["Crypto Regulation","Gambling","Regulation","UK"],"authors":["Ruholamin Haqshanas"]}