{"summary":"Animoca Brands to Build the ‘Largest Web3 Ecosystem’ on Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/animoca-brands-to-build-the-largest-web3-ecosystem-on-bitcoin.htm","publishDate":"2024-04-30T22:46:07","id":17640,"type":null,"title":"Animoca Brands to Build the ‘Largest Web3 Ecosystem’ on Bitcoin","category":["Bitcoin News "],"content":["Animoca Brands, a Hong Kong-based game software company, is entering the Bitcoin ecosystem with the Opal Foundation, using the Opal Protocol to build the Largest Web3 Ecosystem.","On April 30 Animoca Brands announced their plans to “come to Bitcoin.” ","The plan will see a diverse ecosystem of gaming, entertainment, Defi, education, and culture, built on Bitcoin.","Animoca Brands is coming to #Bitcoin!","Bitcoin is ready for Web3. OPAL Protocol (@OpalBTC), powered by $BLIF and initiated by @darewise & @animocabrands, is slated to become the largest #Web3 ecosystem of #gaming, entertainment, #Defi, education, and culture, built on Bitcoin.\nA… pic.twitter.com\/WcJ65vMHfB","— Animoca Brands (@animocabrands) April 30, 2024","","Animoca and the metaverse technology platform Darewise initiated the move, citing the Opal Protocol and the BLIF token, the Opal Protocol Runes token, as the foundation for the ecosystem.","Animoca Brands’ executive chairman and co-founder Yat Siu cited ordinals as the catalyst for Bitcoin’s giant leap from simply being a store of value to a “store of culture” for the Web3 age. He added:","“Building up our presence on the Bitcoin chain through the exciting work of the OPAL Protocol will help to advance our vision of an open metaverse in which all people have the opportunity to enjoy digital property rights and benefit from the power of network effects,” Siu said.","In a thread following the announcement, the company added that six of Animoca Brands’ portfolio companies have already joined as Genesis members. ","Although the company seeks to lead the charge, they extended an arm to the competition. They preached that any company interested in joining the movement should apply to become an OPAL member and build with BLIF.","Animoca Brands wants to lead the next step in Bitcoin’s evolution. Ordinals facilitated the launch of NFTs on Bitcoin, a feature that opened doors to a whole suite of use cases.","Initiated in 2024, the Opal protocol positions itself as a “decentralized ecosystem protocol on Bitcoin, powered by BLIF.”","“Over the next decade, OPAL envisions a transformative shift: from today’s disjointed ecosystem to a harmonized, globally accessible digital realm where finance, entertainment, education, and decentralized governance converge seamlessly,” Opal protocol’s litepaper reads.","According to representatives for Opal’s official Telegram group, the launch date of the Opal protocol and a BLIF airdrop will be revealed later.","The Opal Foundation has already amassed a cult following before its launch, with over 276,000 followers on Twitter.","“We are proud to have Animoca Brands as our first strategic launch partner, as the Opal Foundation will help to bridge their vision to establish the open Opal protocol into Bitcoin and ordinals,” the company stated."],"entity":[{"type":"OPAL Protocol","content":"ORGANIZATION"},{"type":"Defi","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Opal Protocol","content":"ORGANIZATION"},{"type":"April 30","content":"DATE"},{"type":"$BLIF","content":"MONEY"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"Siu","content":"PERSON"},{"type":"Opal Foundation","content":"ORGANIZATION"},{"type":"Opal Protocol Runes","content":"ORGANIZATION"},{"type":"Animoca Brands’","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Gaming","Web3"],"authors":["Harvey Hunter"]}