{"summary":"ENS and Manifold Finance Reach Settlement Over eth.link Domain Dispute","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ens-and-manifold-finance-reach-settlement-over-eth-link-domain-dispute.htm","publishDate":"2024-02-27T05:33:31","id":17643,"type":null,"title":"ENS and Manifold Finance Reach Settlement Over eth.link Domain Dispute","category":["Altcoin News "],"content":["Ethereum Name Service (ENS) developer has agreed to settle with Manifold Finance over the ownership of the eth.link domain. ","The decentralized autonomous organization (DAO) of ENS approved a settlement of $300,000 to be paid to Manifold, while also securing the rights to retain the domain name, according to a vote ending Monday.","Additionally, ENS Labs’ legal costs of $750,000 will be reimbursed, as confirmed by an ENS DAO vote on February 26.","This settlement brings an end to an 18-month legal battle that saw ENS Labs file a lawsuit against Manifold and domain registrars GoDaddy and Dynadot in an Arizona District Court. ","ENS Labs had successfully obtained a court order to prevent the transfer of the domain away from their ownership. ","The settlement terms proposed by Manifold demanded a payment of $300,000 from ENS Labs, along with confidentiality and non-disparagement clauses. ","In exchange, an all-parties settlement would be reached, leading to the dismissal of the case and allowing ENS Labs to retain control of the eth.link domain name.","ENS, an equivalent of the traditional Domain Name System (DNS) on the blockchain, facilitates the translation of domain names, into IP addresses for easier accessibility by browsers. ","As the two systems are not directly compatible, ENS utilizes the eth.link domain to enable .eth ENS-based domains to function properly.","The eth.link domain had previously been owned by Virgil Griffith, an early contributor to ENS. ","However, due to his incarceration for assisting North Korea in evading sanctions, the domain’s ownership expired in July 2022. ","GoDaddy, the registrar of eth.link, allowed it to expire, leading to Manifold acquiring the domain through an auction on Dynadot in September 2022.","Following months of legal arguments, in July 2023, Arizona District Judge John Tuchi ordered Dynadot to unlock eth.link, enabling ENS to regain ownership. ","ENS and GoDaddy have now reconciled and recently formed a partnership. ","As part of this collaboration, .eth ENS domain holders can link their domains with traditional domains free of charge.","Meanwhile, Nick Johnson, the founder of ENS, has raised serious concerns regarding Unstoppable Domains’ patent filings related to blockchain domain names. ","In an open letter addressed to Unstoppable Domains in November last year, Johnson accused the company of appropriating ENS’ open source developments through these patent applications.","An Open Letter RE: Blockchain Domain Name Patents","Since its founding in 2017, ENS has been a consistent and outspoken advocate of open source, open standards, and the importance of governing the global namespace as a public good.","— nick.eth (@nicksdjohnson) November 16, 2023","","“All of our work is licensed under open-source licenses, and all our standards are publicly available for anyone to implement,” Johnson wrote.","“As a result of our commitment to these values, we have not pursued patents on our work. By contrast, Unstoppable Domains has begun doing so, despite stating it supports open innovation.”","One specific patent, numbered US11558344 and titled “Resolving Blockchain Domains,” was granted to Unstoppable Domains earlier this year.","Johnson said that this patent is entirely based on innovations developed by ENS and does not introduce any novel concepts. ","He noted that Unstoppable Domains has continued to pursue additional patents, including an application for reserving names similar to the “Sunrise Phase” commonly used in the DNS world for years."],"entity":[{"type":"2017","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Arizona District Court","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"November 16, 2023","content":"DATE"},{"type":"February 26","content":"DATE"},{"type":"DNS","content":"ORGANIZATION"},{"type":"John Tuchi","content":"PERSON"},{"type":"Nick Johnson","content":"PERSON"},{"type":"GoDaddy","content":"ORGANIZATION"},{"type":"Virgil Griffith","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Arizona","content":"LOCATION"},{"type":"Unstoppable Domains","content":"ORGANIZATION"},{"type":"Manifold Finance","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"Blockchain Domain Name Patents","content":"ORGANIZATION"},{"type":"Manifold","content":"LOCATION"},{"type":"July 2022","content":"DATE"},{"type":"$750,000","content":"MONEY"},{"type":"July 2023","content":"DATE"}],"hashtag":["DAO","ENS domain","etherem"],"authors":["Ruholamin Haqshanas"]}