{"summary":"The SEC voted to adopt rules that require market participants who have significant liquidity-providing roles to comply with its laws.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276283\/sec-adopts-rule-to-have-stricter-oversight-over-dealers-looping-in-crypto-and-defi","publishDate":"2024-02-06T13:17:57","id":1765,"type":null,"title":"SEC adopts rule to have stricter oversight over dealers, looping in crypto and DeFi ","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission voted to adopt rules that require market participants who have significant liquidity-providing roles to comply with federal securities laws, looping in cryptocurrency to the mix.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC voted 3-2 to adopt that rulemaking in a meeting on Tuesday, which in its proposed 194-page form included one mention of crypto in a footnote. The 247-page rule adopted on Tuesday will apply to people transacting in crypto assets that meet the definition of securities or government securities, with the exception of having assets less than $50 million. The rules would affect decentralized finance, according to the adopted rule.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"If a person’s trading activities in crypto asset securities, including products, structures and activities involved in the so-called DeFi market, meet the definition of 'as part of a regular business' as set forth in the final rules (i.e., the person engages in a regular pattern of buying and selling crypto asset securities that has the effect of providing liquidity to other market participants as stated in the qualitative standard), and no exception or exclusion applies, that person would be required to register as a dealer or government securities dealer,\" according to the rule.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry pushed back on the rule in comment letters to the SEC after the rulemaking was first proposed in March 2022. Some commenters said the rule was unreasonable for DeFi products because they do not have a central controlling body and are just software.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The DeFi Education Fund delved into the role of automated market makers in its comment letter, calling it an \"execution protocol.\" Automated market makers, or AMMs, implement a liquidity pool of crypto and other digital assets and lock them in a smart contract that then facilitates trading, according to the fund.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The DeFi Education Fund called the adopted rulemaking on Tuesday \"misguided and unworkable.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While the SEC acknowledged receiving comments discussing DeFi, including our concerns, the SEC not only failed to confront the substance of our concerns but also failed altogether to articulate any discernible path to compliance for DeFi market participants,\" CEO <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Miller Whitehouse-Levine said in an emailed statement. \"I<\/span><span class=\"s1\" data-v-f87c67ca=\"\">mposing obligations on entities in the DeFi ecosystem that cannot be complied with is wrong, impractical, and hostile to innovation.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;Cody Carbone, vice president of policy for the Chamber of Digital Commerce, called Tuesday's vote \"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">another example of the SEC’s continued hostility towards the digital asset industry.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We’re asking additional market participants to register as dealers, abandoning decades of precedent to apply impossible rules on digital asset market participants,\" Carbone said in a statement. \"The SEC did not want the digital asset industry’s perspective on this rule, despite its impact, as the 200-page proposed rule only mentioned digital assets in a footnote.\"&nbsp;<\/span>","The crypto industry tried to address the SEC's concerns to update the definition of a dealer, said M<span class=\"s1\" data-v-f87c67ca=\"\">arisa Coppel, the Blockchain Association's head of legal, in a statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Unfortunately, the final rule does little to engage constructively with industry concerns, cementing an unworkable rule that overturns an established framework in favor of an amorphous focus on whether a person acts as a 'de facto' market maker,\" Coppel said. \"The revised 'dealer' definition imposes impossible requirements onto DeFi projects, provides no clarity to market participants, and could lead to withering innovation across the digital asset ecosystem.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Republican Commissioner Hester Peirce, who voted against the rule, pushed back against some aspects of the rule during Tuesday's meeting.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The release doesn't spend a lot of time talking about crypto, but does explain that an automated market maker might have to register as a dealer under the final rules,\" Peirce said. \"An AMM is, as I understand, is just a software protocol, so how does it register as a dealer?\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">An SEC official, in response to Peirce, said an AMM is more than software.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After some back and forth, Peirce then asked how many people who are posting liquidity in AMM pools would be looped into the rule.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"This is a market that's not transparent or compliant, so we don't really have great data unfortunately,\" the SEC official said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I mean, I think one of the reasons they're not compliant is because they can't figure out what our rules are and they can't even figure out when we think that something is a security,\" Peirce said in response.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler noted the $50 million exception cap, and said there is demand in both the crypto and non-crypto space.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Earlier, in opening statements, Gensler said the rule as a whole is needed to protect investors and noted that markets have evolved to become faster with the advent of electronification and algorithmic trading. He said that firms are acting as \"de facto market makers\" and have not registered with the SEC as dealers, which would require them to report data and keep books and records.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"These measures to me are just common sense,\" Gensler said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Congress did not intend for registration and regulatory requirements to apply to some dealers and not to others. Absent an exemption or exception, if anyone trades in a manner consistent with de facto market making, it must register as a dealer — that is consistent with Congress’s intent but is also sort of competitively makes it fair and level,\" Gensler added.&nbsp;<\/span>","The final rules will become effect 60 days after being published in the Federal Register. The compliance date will be one year after the effective date of the final rules.&nbsp;","<em data-v-f87c67ca=\"\">Updated at 1:15 p.m. on Feb. 7 to include comments&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Peirce","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"AMM","content":"ORGANIZATION"},{"type":"Feb. 7","content":"DATE"},{"type":"Levine","content":"PERSON"},{"type":"Miller Whitehouse","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"arisa Coppel","content":"PERSON"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"1:15 p.m.","content":"TIME"},{"type":"$50 million","content":"MONEY"},{"type":"Coppel","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}