{"summary":"Ethereum’s Vitalik Buterin Now a Billionaire as ETH Prices Surge","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-s-vitalik-buterin-now-a-billionaire-as-eth-prices-s-10139.htm","publishDate":"2021-05-03T08:44:50","id":17651,"type":null,"title":"Ethereum’s Vitalik Buterin Now a Billionaire as ETH Prices Surge","category":["Ethereum News "],"content":["The Ethereum (ETH) co-founder Vitalik Buterin appears to have become a billionaire – as the latest ETH price surge saw the token reach a new all-time high, pushing the value of his crypto holdings well over the USD 1 bn mark.","And in addition to a main account that now holds over USD 1bn worth of ETH, it appears that his second account contains ETH tokens worth a further USD 2.8m.","And Buterin’s crypto wealth does not end there. During an ask-me-anything session on the Ethereum subreddit back in 2020, Buterin revealed the extent of his non-ETH crypto holdings, explaining that he held smaller positions in “non-ethereum-ecosystem tokens” including bitcoin cash (BCH), bitcoin (BTC), dogecoin (DOGE), zcash (ZEC) and omisego (OMG). He also owns shares in some of the companies he has invested in.","Ethereum’s fate – and that of its co-founder – have turned around spectacularly since the dark days of the last crypto winter, when ETH prices plunged, leading to Buterin “losing more than USD 460 million” – and leading sarcastic Redditors to offer to donate him funds.","Indeed, the worth of his holdings shrunk to a mere USD 40m in November 2018. And although his main wallet now holds less ETH than it used to, its worth has skyrocketed.","After busting through the key USD 3,000 mark earlier, the coin is still moving upwards at a rate of knots. At 08:37 UTC, ETH trades at USD 3,184 and is up by 11% in a day and 38% in a week. The price rallied by 49% in a month and 1,388% in a year.","Sarcasm was in very short order on Reddit today, with most congratulating Buterin on doing what many crypto enthusiasts have only dreamed of – and accomplishing it all by the tender age of 27.","One wrote that Buterin “definitely deserves it,” while others in the same thread called him a “legend” and a “genius.”","On another thread, a poster pointed out that Buterin was now the “second-youngest self-made billionaire” on the planet, and remarked,","“What a chad. The chaddest of chads.”","___\nLearn more:\n– Vitalik Buterin and Brian Armstrong Weigh in on NFTs\n– Ethereum’s Buterin Says Tether Is Bitcoin’s ‘Ticking Time Bomb Demon’","– Social Recovery Wallet is Better For Your Cryptoassets – Buterin\n– ‘Dumb’ Blockchains Keep Gaining Adoption, Gold Is ‘Lame’ – Vitalik Buterin","– Ethereum King Buterin Loses Live Showdown to Twitch Chess Queen\n– After Bashing Yield Farming, Buterin Offers a ‘Billion Dollar’ DeFi Idea"],"entity":[{"type":"Brian Armstrong Weigh","content":"ORGANIZATION"},{"type":"BCH","content":"ORGANIZATION"},{"type":"1,388%","content":"PERCENT"},{"type":"Reddit","content":"LOCATION"},{"type":"November 2018","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"38%","content":"PERCENT"},{"type":"49%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Ethereum King Buterin Loses Live Showdown to Twitch Chess Queen\n– After Bashing Yield Farming","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"}],"hashtag":["Ethereum","Vitalik Buterin"],"authors":["Tim Alper"]}