{"summary":"IRS Investigation Chief Anticipates Increase in Crypto Tax Evasion Cases This Year","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/irs-anticipates-increase-in-crypto-tax-evasion-cases-this-year.htm","publishDate":"2024-04-15T07:03:21","id":17667,"type":null,"title":"IRS Investigation Chief Anticipates Increase in Crypto Tax Evasion Cases This Year","category":["Blockchain News "],"content":["Guy Ficco, the Criminal Investigation Chief at Internal Revenue Service (IRS), has indicated the agency is bracing for a significant increase in cases of crypto-related tax evasion this tax season.","In an interview with CNBC at the Chainalysis Links event in New York, Ficco expressed concerns about the rising number of digital asset and crypto related tax crimes. Ficco also stated that the IRS is fully prepared to tackle tax evasions.","According to Ficco, crypto and virtual currencies have been involved in IRS investigations for years, typically as components of larger fraud cases, including scams, embezzlements, and money laundering.","“What we’re seeing more of now and more in our current inventory is more of the pure crypto tax crimes,” said Ficco. “And these would be Title 26, which is federal income tax violations, specifically involving crypto.”","“This could be purely not reporting income generated from crypto sales. It could be hiding the true basis or shielding the true basis in crypto,” said Ficco. “That’s an area that we’ve seen an uptick and I anticipate we’re going to see more of…Title 26 crypto cases in this year and going forward.”","The Criminal Investigation Chief also indicated that the IRS is utilizing its partnership with Chainalysis and other tech firms to enhance investigations into crypto tax evasion.","Highlighted at the Chainalysis Links event, this collaboration provided essential tools for analyzing complex crypto transactions, forming a key part of the agency’s strategy to trace financial flows.","IRS agents would employ Chainalysis tools to address the opacity of crypto ownership, uncovering crucial details for investigations. This technology aids in detecting and addressing tax violations more efficiently.","Check out this #IRS reminder before the filing season ends: Filing electronically is easy, safe and the most accurate way to file taxes. Avoid unnecessary paper processing delays: https:\/\/t.co\/MyEyXuAj57 pic.twitter.com\/8XGO2r6Kp7","— IRSnews (@IRSnews) April 14, 2024","","Ficco also added that crypto has been involved in some of the largest seizures ever conducted by the United States government, with the IRS Criminal Investigation division leading these efforts in recent years.","The tax returns for 2023 are due on April 15 (today)."],"entity":[{"type":"2023","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"IRS Criminal Investigation","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Ficco","content":"LOCATION"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"April 14, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Ficco","content":"PERSON"},{"type":"April 15 (today","content":"DATE"}],"hashtag":["IRS","Tax","United States"],"authors":["Hongji Feng"]}