{"summary":"Mango Markets $100 Million Exploiter Reveals Identity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mango-markets-100-million-exploiter-reveals-identity.htm","publishDate":"2022-10-16T11:49:00","id":17670,"type":null,"title":"Mango Markets $100 Million Exploiter Reveals Identity","category":["Blockchain News "],"content":["The exploiter of Solana-based DeFi lending platform Mango Markets has revealed his identity, referring to his actions as “a highly profitable trading strategy.”","Avraham Eisenberg, who calls himself a “digital art dealer,” has revealed that he was behind the $100 million exploit that hit Mango Markets earlier last week. “I was involved with a team that operated a highly profitable trading strategy last week,” he said in a Saturday tweet. ","In his admission, Eisenberg argued that their “actions were legal open market actions, using the protocol as designed, even if the development team did not fully anticipate all the consequences of setting parameters the way they are.”","I believe all of our actions were legal open market actions, using the protocol as designed, even if the development team did not fully anticipate all the consequences of setting parameters the way they are.","However, as a result of the exploit, Mango Markets became insolvent, Eisenberg noted, adding that the insurance fund was also insufficient to cover all liquidations. This led to the loss of over $100 million in user funds. ","“To remedy the situation, I helped negotiate a settlement agreement with the insurance fund with the goal of making all users whole as soon as possible as well as recapitalizing the exchange,” he said. ","Eisenberg compared the process to how auto deleveraging works on exchanges, which is a risk management mechanism used when a position is closed with negative equity and claws back some profits from profitable traders in order to ensure all users funds are protected.","Mango Markets is a decentralized exchange (DEX) on the Solana blockchain. MNGO, the protocol’s governance token, is a relatively little-known token with a market capitalization of just over $26.8 million. ","As reported, the exploiter funded an account with the stablecoin USDC, and later took what was described as an “outsized position” on the Mango token perpetual futures market (MNGO-PERP).","Within a few minutes, the price of the MNGO rose by 5x to 10x on a number on external exchanges, which Mango’s price oracles used as its reference for the MNGO-PERP price. The increased unrealized profit on the account then meant that the same user could borrow and withdraw approximately $100m worth of BTC, USDT, SOL, mSOL and USDC, the team said.","At the time, the Mango team revealed that they plan to seek a solution directly with the group behind the exploit. “We believe the most constructive way to approach this is to continue communicating with those responsible for the incident,” they said. ","Notably, Eisenberg was previously accused of stealing treasury funds from Fortress DAO, a fork of Olympus DAO running on the Avalanche blockchain, where he was a lead developer. "],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"$100m","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"$26.8 million","content":"MONEY"},{"type":"Fortress DAO","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Olympus DAO","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["Hack","Solana"],"authors":["Ruholamin Haqshanas"]}