{"summary":"Dogecoin Wannabes Flood The Market With Pumps & Dumps","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dogecoin-wannabes-flood-the-market-with-pumps-dumps-11117.htm","publishDate":"2021-07-19T13:41:00","id":17678,"type":null,"title":"Dogecoin Wannabes Flood The Market With Pumps & Dumps","category":["Altcoin News "],"content":["Inspired by the dogecoin (DOGE) rally this year, dozens of meme coin opportunists tried to onboard this dog-themed altcoin bandwagon. And now, despite a few exceptions, most of these altdoges are standing with tucked tails while the value of these copies keeps going down.","Source: Adobe\/New Africa","Ever since the world’s most famous meme coin, the first of all the doge coins, dogecoin (DOGE), entered the scene, catching fire among the regular crypto folk and the social media folk alike, numerous variants of it popped up, and indeed continue to pop up as well.","By this point, the ever-present crypto dogs and dog-related coins have taken over the Cryptosphere with their dog-relatedness, implied cuteness, and buyers’ subjective hope that the one they’ve bet on will be that eluding dog that does indeed go to the moon.","Cryptonews.com looked into the randomly selected 25 of many such coins, focusing on their prices at 9:20 UTC Monday morning, their trading volumes, and the changes in the past day, week, and 30 days.","Notably, for the majority of these coins, the 30-day data is not even available. (Data for all but two coins is taken from Coingecko.com. DOGET and DOG from Coinmarketcap.com.)","The first finding in this quick research is rather obvious: the names. Many have the word ‘doge’ itself in the name, such as doge token (DOGET), or playing on that term to sound as similar to the original as possible, such as cogecoin (COGE).","Others have branched off into a family tree, so we have all sorts of relations on the list, such as mommydoge, daddydoge, uncledoge (UDOGE), baby doge coin (BABYDOGE) (which is another coin Tesla chief Elon Musk got his Twitter hands on), baby doge inu (BABYDOGEINU), and even minidoge and minibabydoge.","As for food, this family has BONE, as well as bone shibaswap (BONE).","Not all coins on our list have the word ‘doge’ or ‘dog’ on the list – some are more species-oriented, such as shiba inu (SHIB) – which had made a blast entering the space, floki inu (FLOKI), floki shiba (FSHIB), an astronaut called spacecorgi (SCORGI), kishu inu (KISHU), and the celebrity keanu inu (KEANU).","Another celebrity on the list is snoop doge (SNOGE), while we also have blockchain- and decentralized finance (DeFi)-related doggy entrants, including RENDOGE (a one-for-one representation on Ethereum (ETH)), DOGEFI, dogeswap (DOGES), and polkadog (PDOG).","Last but not least are the new-age-metal-band-sounding DOGIRA and underdog (DOG).","Let’s look at the price and trade volume changes. Keep in mind, this is a category of coins that don’t play with zeros – often having between 6 and 11 of them at the beginning of their price.","Out of the 25, only three are marked as green based on their positive price and trading volume change between April 19 or the first available data and July 19. The winner is DADDYDOGE, which has appreciated 617% since July 7. Its trading volume was USD 1.37m on that day, while it’s USD 1.76m today.","The next one is Shiba Inu, which trades at USD 0.00000649, having gone up 251% in three months, while its trading volume is up from USD 175m to USD 259m in the same amount of time.","Dogeswap is up 43% in the last three months. Its trading volume was recorded to be USD 7,793 on April 19, and it’s USD 8,410 today. DogeSwap is also a new decentralized exchange (DEX), which allows users to stake DOGES to farm for PUPPY (and I wish I could go just 5 years in the past and tweet this sentence).","Five more coins on the list have seen only one of these two metrics increase in the available time periods:","However, this also means that seven of the 25 coins we looked into have appreciated in the last 3 months, or since the first available data, while eighteen are down between 23% (MINIDOGE) – 96% (MINIBABYDOGE).","Meanwhile, in the past day, eight coins are up, ranging between almost 1% (SNOGE) and 76% (DOGES).","Now looking in the past seven days, only three coins have appreciated, led by daddydoge’s 383%. DOGES is behind it with 54%, followed by UDOGE with 19%. The last two are the only coins on the list that have appreciated in all three time frames.","Meanwhile, dogecoin has dropped in all three time frames: 6% in a day, 16% in a week, and 43% in three months. Its trading volume today is USD 1.53bn, compared to USD 23.75bn, recorded on April 19.","Recently, its co-founder Jackson Palmer embarked on a Twitter tirade about the crypto industry, branding the sector “an inherently right-wing, hyper-capitalistic technology.”","Meanwhile, a proposal regarding a new fee structure and policy for Dogecoin core was released on GitHub at the end of June, receiving the support of Elon Musk. Speaking of which, most recently Musk changed his Twitter profile picture to him wearing aviators with the reflection of the Shiba Inu dog that represents dogecoin.","Also, Axe, a well-known deodorant brand for men, seems to be taking advantage of the popularity of DOGE, hinting in a tweet that it may launch a scent called Dogecan, inspired by Dogecoin.","07.20.21 #dogecan pic.twitter.com\/ALpW8CSpey","Let’s wait until they discover that there is the cat-themed catecoin (CATE) too. If it’s still alive by then as its price has crashed by 98% since May.\n____\nLearn more:\n– This Is Why Robinhood Doesn’t Allow You to Withdraw Bitcoin, DOGE & Co.\n– ‘DOGE Killer’ Shiba Inu Clogs Ethereum While Musk Lifts Dogecoin Again","– Goldman Executive Quits After Reportedly Making ‘Millions’ Off Dogecoin\n– Dogecoin Needs 3 Conditions Fulfilled to Move Beyond USD 1","– Are GameStop-Style Surges In Crypto Any Different From Old Pumps & Dumps?\n– ‘The Most Honest Sh*tcoin,’ Dogecoin, Will Survive Alongside Bitcoin – Analysts"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"KEANU)","content":"PERSON"},{"type":"617%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"76%","content":"PERCENT"},{"type":"54%","content":"PERCENT"},{"type":"98%","content":"PERCENT"},{"type":"Goldman Executive Quits After Reportedly Making ‘Millions’ Off Dogecoin\n– Dogecoin Needs 3 Conditions Fulfilled to Move Beyond USD 1","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"96%","content":"PERCENT"},{"type":"251%","content":"PERCENT"},{"type":"19%","content":"PERCENT"},{"type":"July 19","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Elon Musk","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"Withdraw Bitcoin, DOGE & Co.","content":"ORGANIZATION"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"July 7","content":"DATE"},{"type":"USD 0.00000649","content":"ORGANIZATION"},{"type":"Crypto Any Different From Old Pumps & Dumps","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"New Africa","content":"LOCATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Shiba Inu Clogs Ethereum While Musk Lifts Dogecoin Again","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"383%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"9:20 UTC Monday morning","content":"TIME"},{"type":"1%","content":"PERCENT"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Altcoins","Dogecoin","Elon Musk","Ethereum","Market"],"authors":["Sead Fadilpašić"]}