{"summary":"‘Buy Bitcoin’ Sign Held up During Yellen’s Testimony to Congress in 2017 Sells For $1M","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/buy-bitcoin-sign-held-up-during-yellens-testimony-to-congress-in-2017-sells-for-1m.htm","publishDate":"2024-04-26T03:21:30","id":17675,"type":null,"title":"‘Buy Bitcoin’ Sign Held up During Yellen’s Testimony to Congress in 2017 Sells For $1M","category":["Bitcoin News "],"content":["The infamous “Buy Bitcoin” sign held up by Christian Langalis during Federal Reserve Chair Janet Yellen’s Congressional testimony in 2017 has been sold for a staggering $1 million. ","Langalis, also known as the “Bitcoin Sign Guy” auctioned off the Bitcoin sign sketched on a yellow legal pad between April 18-24, 7 pm ET. The final bid closed at 16 Bitcoin approximate value of $1,027,150.72, according to Scarce City, an online marketplace for Bitcoin goods and Bitcoin non-fungible tokens. The sign was sold to an unknown buyer. ","And that's a wrap on one of the most ICONIC pieces of Bitcoin history. 🏆🍾","Made a little history of our own … meet the official new https:\/\/t.co\/rNz9DWL5WE record. 🏅 pic.twitter.com\/3ixQmEHbd0","— Scarce.City (@scarcedotcity) April 24, 2024","","The iconic drawing marked Bitcoin’s intrusion into the global monetary landscape. The sign has been described on the auction website as one of the few widely recognised physical Bitcoin artefacts, given Bitcoin’s virtual nature. Beloved by Bitcoin enthusiasts, the sign has spawned countless memes, derivative works, and imitation stunts. Yellen has maintained vocal criticism of Bitcoin.","Somebody just held up a \"Buy Bitcoin\" sign during Yellen's testimony to Congress… #Bitcoin #Yellen pic.twitter.com\/bf3e0bRRvL","— Tanzeel Akhtar (@Tanzeel_Akhtar) July 12, 2017","","Here’s an X post from 2017 showing Langalis cheekily peering over Yellen’s shoulder as she opposes audits of the Fed. Langalis looks at the camera and raises a yellow legal pad for a few seconds with the words “Buy Bitcoin” scrawled in black ink. Yellen continues her testimony unaware. ","After Langalis held up the sign a spokesperson for the House Financial Services committee said in a statement: “It is against the rules for people in the audience to display signs during a hearing, so they were told to leave the hearing and they did.” ","Commenting on the sign Langalis has said:","When Bitcoiners ask me about the sign, I tell them, “You’d have done the same in my seat.” Yes, only I attended the hearing, drew the sign, and flashed it for the camera. However, it was the network spirit which seized the image and fabricated the memes. The full poetry of the stunt was far beyond my devising, therefore, my attitude can only be one of post-authorship. Bitcoin was massively rupturing into the halls of institutional finance in 2017. Any Bitcoiner worth their sats would have told you so. It’s good to finally liberate this number from my sock drawer and offer it back to the Bitcoin public. The message was subversive then, but now merely obvious: Bitcoin is flowing. Control is dead."," "],"entity":[{"type":"April 24, 2024","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"$1,027,150.72","content":"MONEY"},{"type":"24","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Scarce City","content":"ORGANIZATION"},{"type":"Christian Langalis during Federal Reserve","content":"ORGANIZATION"},{"type":"Langalis","content":"PERSON"},{"type":"April 18","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Tanzeel Akhtar","content":"PERSON"},{"type":"July 12, 2017","content":"DATE"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Bitcoiners","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Auction","Bitcoin","Janet Yellen"],"authors":["Tanzeel Akhtar"]}