{"summary":"UK FCA Plans to Implement Market Abuse Regime for Crypto in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-fca-plans-to-implement-market-abuse-regime-for-crypto-in-2024.htm","publishDate":"2024-03-19T21:50:53","id":17683,"type":null,"title":"UK FCA Plans to Implement Market Abuse Regime for Crypto in 2024","category":["Blockchain News "],"content":["The Financial Conduct Authority (FCA) of the United Kingdom has announced its intention to introduce a market abuse regime for cryptocurrencies within the current year, as outlined in its business strategy released on Tuesday.","The regime would apply to anyone committing market abuse on a crypto asset that is trading on a UK exchange, regardless of where they are based.","The FCA of the United Kingdom has outlined its plans to bolster its capabilities in detecting and combating market abuse within the cryptocurrency sector over the next 12 months.","The business plan outlines the FCA’s agenda to safeguard consumers, ensure market integrity, and promote international competitiveness. This includes developing advanced analytics capabilities, such as network analysis and cross-asset class visualizations, to identify suspicious activities better.","UK regulator to tighten measures against crypto market abuse :\nThe United Kingdom’s financial watchdog said it will improve its market monitoring abilities and develop advanced analytics systems.\nThe U.K.'s Financial Conduct Authority (FCA) will focus on increasing its… pic.twitter.com\/7TUBkHRqKv","— TOBTC (@_TOBTC) March 19, 2024","","Last year, the UK government issued a consultation paper that included proposals for establishing a market abuse regime specifically tailored for crypto assets.","According to the government’s response to the crypto consultation in October, the market abuse offenses would encompass all individuals engaging in market abuse activities related to a crypto asset admitted to trading on a UK crypto asset trading venue. This would apply regardless of the individual’s location or where the trading occurs.","Under the proposed regime, crypto exchanges would be required to detect and prevent market abuse behaviors, enhancing market integrity and investor protection within the crypto space.","Additionally, the FCA intends to contribute to developing a proportionate market abuse regime specifically tailored for crypto assets and the Private Intermittent Share and Capital Exchange Service (PISCES) facility. Despite the additional regulatory requirements for crypto companies, the FCA wants to develop a framework that supports innovation while reducing industry costs.","In addition to monitoring market abuse, the FCA will continue its supervision of financial promotions published by crypto firms. The regulator plans to enhance its technological capabilities to identify promotional material that may pose risks to investors.","In its strategy for the period of 2024 to 2025, the UK FCA also stated its intention to recover costs associated with the new regulation of stablecoins and the broader regulatory framework, aiming to recoup GBP 6.2 million ($7.9 million) and GBP 200,000, respectively. However, the specific mechanisms for cost recovery need to be detailed in the strategy document.","As the primary regulatory authority overseeing crypto activities in the UK, the FCA has already implemented a promotion regime for cryptocurrencies. This regime includes measures such as incorporating risk warnings and imposing a 24-hour cooling-off period for first-time crypto buyers. Additionally, the FCA has been consulting on the establishment of a regulatory framework for stablecoins.","Additionally, the FCA intends to expand its consumer awareness campaigns to educate investors about potential scams prevalent in the crypto space.","The FCA’s efforts to regulate crypto-related marketing have been ongoing, with new rules implemented in October 2023. In November, the regulator released guidance for UK-based crypto firms on compliance with these rules, aligning them with existing regulations for other high-risk investments.","Despite the FCA’s efforts to provide guidance on marketing rules for crypto-related activities, many firms in the industry continue to violate advertising regulations. In 2023 alone, the FCA issued 450 alerts for illegal crypto ads and has reiterated its commitment to taking action against companies that breach the rules, highlighting its ongoing efforts to enforce regulatory compliance within the crypto sector."],"entity":[{"type":"2025","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"$7.9 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"October 2023","content":"DATE"},{"type":"November","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"March 19, 2024","content":"DATE"},{"type":"UK FCA","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Capital Exchange Service","content":"ORGANIZATION"}],"hashtag":["2024 crypto","FCA","UK"],"authors":["Hassan Shittu"]}