{"summary":"The fault means MetaMask users are unable to complete transactions on the Ethereum blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143047\/metamask-stops-working-as-infura-suffers-another-service-outage","publishDate":"2022-04-22T10:55:10","id":1768,"type":null,"title":"MetaMask stops working as Infura suffers another service outage","category":["ETHEREUM"],"content":["<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update 12:30 pm ET:<\/strong> Infura has announced that the problem has been solved with full functionality returning to its RPC services.<\/em>","Crypto web wallet MetaMask is currently not working for users due to a service outage on Infura, an Ethereum infrastructure provider.","“We are aware of an outage of some of our ETH1, Palm, Optimism, Polygon, Filecoin and Arbitrum API endpoints. At the moment, the outage is limited to the listed components, which are temporarily unavailable. We are currently investigating to pinpoint a root cause and remediate,” according to an update on Infura's status <a href=\"https:\/\/status.infura.io\/\" data-v-f87c67ca=\"\">page<\/a> on Friday.&nbsp;","Further updates on the status page show that Infura developers have identified the root cause and are working on a fix.","Infura is MetaMask’s default remote procedure call (RPC) provider. In the crypto space, RPC providers serve as an interface for the likes of MetaMask to interact with the blockchain, which in this case is Ethereum.","Ethereum gas fees have fallen rapidly as a result of the Infura outage. <a href=\"https:\/\/www.gasprice.io\/\" data-v-f87c67ca=\"\">Data<\/a> from gasprice.io shows transaction fees tumbling from about 100 gwei ($6) to about 20 gwei for instant transactions since the issue became known.","Other RPC providers like Alchemy and Pocket Network have not reported any outages as of the time of writing.","Infura <a href=\"https:\/\/www.theblockcrypto.com\/post\/84232\/ethereum-infrastructure-provider-infura-is-down\" data-v-f87c67ca=\"\">suffered an outage<\/a> in November that had an even wider impact, forcing crypto exchanges to temporarily pause ether withdrawals.","<em data-v-f87c67ca=\"\">This story has been updated with Infura announcing a fix to the problem.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$6","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Infura","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Palm","content":"LOCATION"},{"type":"Filecoin","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}