{"summary":"Venture capital firm Accel led the fundraise, with participation from a16z and Tiger Global. \nThe investment comes less than six months on from Nansen’s $12 million Series A raise.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127747\/data-startup-nansen-secures-fresh-funding-at-750-million-valuation","publishDate":"2021-12-16T08:48:01","id":1769,"type":null,"title":"Data startup Nansen secures fresh funding at $750 million valuation","category":["Data"],"content":["Crypto analytics startup Nansen has secured its next fundraise at a $750 million valuation, in a round led by Accel, according to several investors close to the deal.","The news was&nbsp;<a href=\"https:\/\/www.reuters.com\/article\/idUSL4N2T0450\" data-v-f87c67ca=\"\">announced earlier today<\/a>, with reports stating that Nansen had secured $75 million in a round featuring existing backer a16z and Tiger Global alongside Accel. But those reports did not specify a valuation.&nbsp;","The deal comes less than six months on from the Singapore-based startup’s <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109959\/blockchain-data-nansen-12-million-series-a-a16z\" data-v-f87c67ca=\"\">$12 million Series A raise<\/a> — which was led by a16z.","Nansen was contacted for comment but did not respond by press time.&nbsp;","Accel, one of the world’s foremost venture capital firms, has backed a number of blockchain-based businesses — including monitoring startup Tenderly, gaming firm Sky Mavis, and FalconX, the trading platform.","Besides a16z, other earlier backers of Nansen include Skyfall Ventures, Coinbase Ventures, imToken Ventures, Mechanism Capital and QCP Capital.","Launched in 2020, Nansen is an analytics platform that pairs blockchain data with ‘millions of wallet labels,’ according to its website. It is known for its ability to track what high-value investors are doing on-chain. Investors use the platform to assess opportunities and to stay on top of their portfolios with real-time alerts.","In a blog post after its Series A raise in June, the company said it had seen revenues increase over 1,000 times from a low base of a few hundred dollars when it first launched. At that time, the business employed 30 people.","Nansen planned to use the $12 million raised in June to offer more personalization for users; for hiring and acquisitions; and to add support for additional blockchains and layer 2 solutions, such as Polygon. Up to now, it has focused on Ethereum data.","Crypto analytics companies have been popular with investors lately, with Kaiko, Messari, Coin Metrics, CryptoCompare, Dune Analytics and DappRadar all raising in recent months.","The types of investors leading these rounds is also eye-catching. Goldman Sachs led Coin Metrics’ $15 million Series B in May, while Steven Cohen’s Point72 Ventures led Messari’s $21 million round in August."],"hashtag":["ETHEREUM"]}