{"summary":"Savitar Crypto Exchange: Simple, transparent and competitive","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/savitar-crypto-exchange-simple-transparent-and-competitive-3719.htm","publishDate":"2019-04-18T03:03:00","id":17698,"type":null,"title":"Savitar Crypto Exchange: Simple, transparent and competitive","category":["News "],"content":["Disclaimer: The text below is a sponsored article that was not written by Cryptonews.com.\n_________","Although it is now much easier to buy and sell cryptocurrencies than a few years ago, it is still not a “child’s play” and there is still a lot of work to do. It is precisely with this desire for simplification that Savitar (https:\/\/savitar.io) has designed its cryptocurrency trading platform. Through a clear and easy-to-use interface, it is possible to buy, sell or store cryptocurrencies. “We believe that buying, owning and reselling digital currencies needs to be simplified to boost its development and make them more accessible and intuitive for everyone”, said Pierre Lavarague, founder and CEO of Savitar.","Accepting fiat\nIt is while noticing that many cryptos exchanges, including the most important ones, do not integrate fiduciary currencies like the euro, that the founders of Savitar decided to integrate these currencies into the platform. “These exchanges are not suitable for people wishing to invest for the first time in this market, or for people who already own digital currencies wishing to convert them into fiat money, explains Pierre Lavarague. Bridges linking the current monetary system to that of cryptocurrencies are essential to enable its adoption on a large scale”. Thanks to its partners, Savitar makes it possible to offer SEPA credit transfers, and payments by credit card are coming soon, which makes the conversion of local currencies into cryptocurrency very easy.","Savitar and Savitar Pro\nNot everyone has the same investor profile, therefore Savitar offers two distinct interfaces to meet different needs. Savitar will be suitable for first-time investors who will be able to buy and\/or sell cryptocurrencies at the market price. The Savitar Pro platform is a more complete interface that is perfect for users looking for more advanced features and more complex risk tracking and management tools to implement trading strategies.","No unpleasant surprise fees\nSavitar and Savitar Pro users will not have any unpleasant surprises with transaction fees as both offer the lowest transaction fees in the market and are capped at a maximum of 0.10 % of the transaction amount. It should be noted that these fees will be reduced for high-volume investors and for those using the Savitar Token (SVT), the native cryptocurrency of the platform.","Decisions made by the community\nWith the goal of providing a seamless service to its users, Savitar has chosen to place its community at the heart of crucial decisions like adding new currencies. In addition, owners of Savitar Token (SVT) can also submit projects to validate and vote on those who have been selected. The smart distribution program will evenly distribute the SVT among users.","A regulated platform\nSavitar is established in Paris and scrupulously respects French and European regulations to ensure the safety and durability of the platform. “We will work hand in hand with the financial authorities and especially the authority of the financial markets (AMF), to develop a responsible and sustainable service, explains Pierre Lavarague. We are taking the necessary steps to respect the current and future legislative framework”.","Start trading!\nIf you want to start trading, it’s easy, just create an account and go through the simplified verification process (KYC). As soon as your account is validated, you will receive some SVT and can begin to easily convert your euros into cryptocurrency at low cost.\nhttps:\/\/savitar.io\/signin",""],"entity":[{"type":"Savitar","content":"ORGANIZATION"},{"type":"Pierre Lavarague","content":"PERSON"},{"type":"Savitar","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"SVT","content":"ORGANIZATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Savitar Pro\nNot","content":"ORGANIZATION"},{"type":"0.10 %","content":"PERCENT"},{"type":"AMF","content":"ORGANIZATION"}],"hashtag":["Exchange"],"authors":["Savitar"]}