{"summary":"Ethereum Price Prediction as Bulls Hold $2,200 Level – Next Leg Up Starting Soon?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-prediction-as-bulls-hold-2200-level-next-leg-up-starting-soon.htm","publishDate":"2024-01-01T20:28:52","id":17699,"type":null,"title":"Ethereum Price Prediction as Bulls Hold $2,200 Level – Next Leg Up Starting Soon?","category":["Price Predictions "],"content":["Ether (ETH), the native cryptocurrency of the layer-1 smart contract-enabled Ethereum blockchain, is pushing higher on the first day of 2024, up around 2% in the past 24 hours and trading in the mid-$2,300s, as per CoinMarketCap.","In recent days, Ether has been able to hold to the north of its 21DMA, which has acted as solid near-term support in the mid-$2,200s.","The past few days has also seen subdued trading volumes, with many major market participants absent given Christmas\/New Year’s celebrations – less than $7 billion in ETH\/USD changed hands on Monday as per data presented by Yahoo Finance.","But these volumes are expected to significantly pick up as the week continues and traders return.","They will be monitoring various upcoming key market events, such as the potential approval this week of spot Bitcoin ETFs (which would open the door to spot Ethereum ETFs), fresh news on the upcoming Ethereum Dencun upgrade and macro data, including the widely anticipated US jobs report on Friday.","Ether remains very much in a medium-term uptrend, with the latest bounce from its 21DMA further strengthening this notion.","Whilst some have been warning of a “sell the news” event across crypto markets once the spot Bitcoin ETFs gain approval, price risks remain tilted to the upside following ETH’s bounce from the key long-term support level in the $2,100s in December.","The next major bullish target for the coming months is long-term support-turned-resistance in the $3,500s, an area that hasn’t been tested going all the way back to April 2022.","ETH gained “only” around 100% in 2023, well below Bitcoin’s 160% gain.","2024 could well be a year of catch-up for Ether versus Bitcoin, and a 50% rally to the $3,500s in the next few months could be the first stage in Ether’s catch-up play.","The next major leg up in the cryptocurrency may well have already started.","Sponge V2 ($SPONGEV2) is the reincarnation of the legendary Spongebob Squarepants-themed $SPONGE token, which reached a market cap of nearly $100 million earlier in 2023 and delivered gains to its earlier investors in the region of 100x.","$SPONGE token holders will be able to stake their tokens to receive an equivalent amount of $SPONGEV2 tokens, as well as to start earning staking rewards (paid out in $SPONGEV2) with a minimum APY of 40%.","$SPONGEV2’s main advantage over $SPONGE is that it will power a new play-to-earn game, the details of which are yet to be released.","But we do know that there will be a free version and paid version of the game.","Visit Sponge V2 Here","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"April 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"$SPONGEV2","content":"MONEY"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$3,500","content":"MONEY"},{"type":"$SPONGE","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"$2,300","content":"MONEY"},{"type":"Spongebob Squarepants","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$2,100","content":"MONEY"},{"type":"$2,200","content":"MONEY"},{"type":"ETH\/USD","content":"ORGANIZATION"},{"type":"160%","content":"PERCENT"},{"type":"1","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Ethereum Dencun","content":"PERSON"}],"hashtag":["ETH","Ether","Ethereum"],"authors":["Joel Frank"]}