{"summary":"USDC Grows In Non-US Markets as Market Cap Taps $28 Billion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/usdc-grows-in-non-us-markets-as-market-cap-taps-28-billion.htm","publishDate":"2024-02-27T09:31:45","id":17691,"type":null,"title":"USDC Grows In Non-US Markets as Market Cap Taps $28 Billion","category":["Blockchain News "],"content":["The market capitalization of Circle’s USDC moved past $28 billion with a gradual increase from Q4 2023 amid wider institutional investments.","A new Coinbase report shows a resurgence in the USDC market following the general market upturn and growth in non-U.S markets.","The market cap for stablecoins is rising… and USDC is outperforming – up over 14% since December. Learn why this may mark a new resurgence in USDC in our new stablecoin deep dive: https:\/\/t.co\/RD8X8RD7Pr pic.twitter.com\/RqMRwvEG75","— Coinbase Institutional 🛡️📞 (@CoinbaseInsto) February 27, 2024","","According to the report, USDC stablecoin has gained $3.5 billion, over 14% since December 1, 2023. This sharp growth boosted the market capitalization of the asset above $28 billion.","At press time, the total market cap of the asset stands at $28.5 billion with trading volumes of $8.6 billion, a 144% increase in the last 24 hours.","The narrative around USDC is shifting slightly after it dropped in the first three quarters of 2023 before finding its feet in the last quarter.","These events were linked to the asset losing its dollar peg following revelations of a $3.3 billion exposure to Silicon Valley Bank (SVB) in March.","USDC slumped as low as 87 cents with about 8% of its reserve in SVB before regaining its dollar peg. New inflows into the markets have kept the lifted spiked activities around the asset.","Per the report, the stablecoin’s presence has surged outside the United States amid increasing derivatives activities on some exchanges.","“That’s starting to change, as USDC is gaining a greater presence in non-US markets. Since the start of 2023, USDC’s share of spot and derivatives activity has increased by almost 5x, albeit to a still-low 4% of total CEX volumes globally.” ","The launch of Coinbase International Exchange and a market maker incentive program boosted USDC adoption in international markets. Coinbase Market Maker Program provided liquidity and depth for a wide range of trading pairs in spot and perpetual offerings.","Furthermore, USDC re-listing on Binance, the largest centralized cryptocurrency exchange by volume added momentum to the stablecoin’s growth.","In December, the asset’s market share on centralized exchanges recorded a 10% increase as Coinbase raised interest rates on the asset. This led to crypto users holding the assets for longer periods.","Circle, USDC’s issuer, also entered into multiple partnerships with financial institutions in Japan and Singapore.","USDC’s rise in recent months has outpaced USDT, the largest stablecoin by market capitalization. While USDC recorded a 14% growth, USDT posted an 8.7% increase from Dec 1.","Nevertheless, USDT remains the stablecoin leader with a 71% market dominance and $97 billion market share.","“USDT’s role in settling crypto derivatives like perpetual futures (which are almost exclusively traded outside of the US) partly explains the breadth of USDT’s reach. Indeed, around 83% of total centralized exchange volumes globally (both spot and futures) currently utilize USDT as the base currency.” ","The stablecoin market cap hit $140 billion for the first time since 2022 as investments trickle into digital assets following spot Bitcoin (BTC) ETF approval."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"8.7%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"144%","content":"PERCENT"},{"type":"87 cents","content":"MONEY"},{"type":"$28.5 billion","content":"MONEY"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$140 billion","content":"MONEY"},{"type":"$97 billion","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"Silicon Valley Bank (SVB","content":"ORGANIZATION"},{"type":"$3.5 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$8.6 billion","content":"MONEY"},{"type":"the first three quarters of 2023","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February 27, 2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"December 1, 2023","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"14%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$28 billion","content":"MONEY"}],"hashtag":["Coinbase","Stablecoin","USDC"],"authors":["David Pokima"]}