{"summary":"Beam to Help Litecoin Explore Mimblewimble","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/beam-to-help-litecoin-explore-mimblewimble-3331.htm","publishDate":"2019-02-07T11:27:00","id":17702,"type":null,"title":"Beam to Help Litecoin Explore Mimblewimble","category":["Altcoin News "],"content":["Teams behind major cryptocurrency Litecoin (LTC) and new privacy coin Beam have started collaboration as Litecoin aims to add more privacy focused features.","“We have started exploration towards adding privacy and fungibility to Litecoin by allowing on-chain conversion of regular LTC into a Mimblewimble variant of LTC and vice versa. Upon such conversion, it will be possible to transact with Mimblewimble LTC in complete confidentiality. It is our joint intention to publish any and all the work done as part of the project under a permissive open source license to let the community benefit from it,” Beam confirmed today.","The founder of Litecoin, Charlie Lee, has already tweeted about the possibility of a cooperation yesterday, February 6th. “Team has been chatting with the [Guy Corem, Beam advisor] and @beamprivacy team about MimbleWimble on Litecoin with Extension [Blocks]. Pleasantly surprised that Beam has already implemented switch-commitments w\/ ElGamal [digital encryption system]. It’s a safety switch to protect against quantum computing breaking [confidential transaction] soundness,” he tweeted.","While the company has affirmed that talks are happening, this is far from a confirmation that LTC will use the privacy technology. Also, it will not use it in the same way as Beam, which implemented Switch and ElGamal commitments, while LTC is thinking about using a bulletproof version of MimbleWimble with extension blocks.","Litecoin has previously announced their intent to focus on privacy and fungibility of their cryptocurrency next. “Fungibility is the only property of sound money that is missing from Bitcoin & Litecoin. Now that the scaling debate is behind us, the next battleground will be on fungibility and privacy. I am now focused on making Litecoin more fungible by adding Confidential Transactions,” Lee said, later adding that it might happen “sometime in 2019.”","MimbleWimble is a privacy protocol that allows the user to encrypt all data associated with any transaction of cryptocurrency using blinding factors, thereby adding an extra layer of security to all transactions. Additionally, the MimbleWimble protocol uses an innovation called CoinJoin, a mechanism that combines multiple payment info to form a single chain of the transaction, making it very difficult for any outside party to find out which payment came from which user and was meant for whom.","The price of Litecoin has increased by 2.52% in the past 24 hours, and the coin now trades for USD 33.54 (UTC 11:18 AM.)",""],"entity":[{"type":"UTC 11:18 AM","content":"ORGANIZATION"},{"type":"Charlie Lee","content":"PERSON"},{"type":"” Lee","content":"PERSON"},{"type":"Mimblewimble LTC","content":"ORGANIZATION"},{"type":"2.52%","content":"PERCENT"},{"type":"Beam","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"February 6th","content":"DATE"},{"type":"Litecoin","content":"PERSON"},{"type":"Bitcoin & Litecoin","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Litecoin","content":"LOCATION"}],"hashtag":["Litecoin"],"authors":["Sead Fadilpašić"]}