{"summary":"How Artificial Intelligence Could Start To Boost Crypto Crime: Chainalysis","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/how-artificial-intelligence-ai-could-start-to-boost-crypto-crime-chainalysis.htm","publishDate":"2024-03-15T21:28:08","id":17708,"type":null,"title":"How Artificial Intelligence Could Start To Boost Crypto Crime: Chainalysis","category":["Blockchain News "],"content":["Artificial intelligence (AI) could breed a dangerous new category of crypto-based crime in the coming years, according to blockchain intelligence platform Chainalysis.","During a private video webinar viewed by Cryptonews on Thursday, Chainalysis Cybercrimes Research Lead Eric Jardine summarized growing and shrinking trends in illicit blockchain activity in 2023, and predicted what sorts of tactics criminals will adopt next.","We’re excited to announce that our 2024 Crypto Crime Report is now available! You can download your copy here. Want a preview first? Keep reading this thread for one key takeaway from each chapter. https:\/\/t.co\/t8wgHJZ8he pic.twitter.com\/MhY00Hw0yM","— Chainalysis (@chainalysis) February 29, 2024","","The expert said internal discussions are already underway about how rising technologies could impact blockchain crime – especially large language models (LLMs).","“I think that there’s ways in which they will affect different categories of crime,” said Jardine. “You could imagine an AI model that does code audits being used to improve the security of DeFi… conversely the same models could be used by illicit actors to find vulnerabilities in smart contracts.”","The DeFi sector is disproportionately targeted by cryptocurrency theft, with hackers exploiting flaws in code, obtaining private keys, and using price manipulation to steal assets.","Formal audits have become something of a blockchain industry standard, though their success at preventing hacks is far from foolproof. With AI, however, there’s no telling whether it will strengthen smart contacts or their attackers the most, and the balance of its benefits may oscillate over time.","The absolute volume of stolen DeFi funds dropped from $3.1 billion in 2022 to $1.1 billion in 2023, with the number of incidents also falling from 273 to 172.","Beyond its impact on DeFi, artificial intelligence could have worrying implications for romance scams, also known as “pig butchering” scams. These scams begin with seemingly innocent contact, evolving into a fabricated relationship that the scammer then exploits for financial gain.","“That is an area where a large language model that has infinite patience and is quite creative could be used to devastating effect by illicit actors,” Jardine noted.","Romance scammers in crypto nearly doubled their revenue last year compared to 2022, despite a decline in total scam volume from $6.5 billion to $4.6 billion. The average size of a romance payment is $4,593, though the average victim likely paid far more since such scams often involve multiple payments.","As a share of all crypto transactions, illicit activity fell to just 0.34% of blockchain activity in 2023."],"entity":[{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"0.34%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"Jardine","content":"PERSON"},{"type":"$3.1 billion","content":"MONEY"},{"type":"$6.5 billion","content":"MONEY"},{"type":"Chainalysis Cybercrimes Research","content":"ORGANIZATION"},{"type":"Eric Jardine","content":"PERSON"},{"type":"February 29, 2024","content":"DATE"},{"type":"$4,593","content":"MONEY"},{"type":"$4.6 billion","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"}],"hashtag":["AI","Artificial Intelligence","crypto scams"],"authors":["Andrew Throuvalas"]}