{"summary":"Babylon released its testnet as a first step to providing a new type of security for Cosmos chains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215662\/babylon-to-bring-bitcoin-security-to-chains-in-the-cosmos-ecosystem","publishDate":"2023-03-02T15:01:02","id":1770,"type":null,"title":"Babylon to bring Bitcoin security to chains in the Cosmos ecosystem","category":["CRYPTO ECOSYSTEMS"],"content":["Babylon released its testnet today, a starting point in its journey to enable blockchains in the Cosmos ecosystem to use the security of the Bitcoin blockchain. In the summer, it’ll launch a second testnet before a mainnet launch toward the end of the year.","The project has seen support from the wider community. It received $8 million of funding over the last year, through a SAFE plus token warrent round led by IDG and Breyer Capital, which has not been previously disclosed. EigenLayer founder Sreeram Kannan has backed the project, which also touts Zaki Manian, co-founder of Sommelier Protocol, as an advisor. Plus, it’s seemingly <a href=\"https:\/\/twitter.com\/osmosiszone\/status\/1629880975739207682\" data-v-f87c67ca=\"\">gained traction<\/a> with Osmosis, one of the leading Cosmos chains.","But why has the project found support — especially with its plan of linking very different types of chains together? Well, it comes down to tackling one of the biggest problems in the Cosmos ecosystem: a lack of security.","Unlike most blockchain platforms, the Cosmos ecosystem lets every application have its own blockchain. That means instead of one set of validators securing a network that supports many applications, each application has to have its own set of validators.","This poses a challenge, particularly for smaller blockchains. They need to create enough economic incentives for validators to support their chains and act in the network’s best interest. Typically this is paid through token inflation in combination with transaction fees —&nbsp;something that can become very expensive. Osmosis, for example, is currently giving out $47 million of rewards to stakers per year.","As a result, there has been a lot of discussion around blockchains bolstering their security by relying on security from other blockchains.&nbsp;","“In general, security is a very hot topic in the app-chain world,” said David Tse, founder of Babylon and professor at Stanford University. He noted that a number of projects have proposed shared security models, from Osmosis Labs co-founder Sunny Aggarwal’s mesh security to the Cosmos Hub’s replicated security.","Babylon’s solution is a little different because it looks outside of the Cosmos ecosystem for the solution. Its reasoning is that the Bitcoin network has the greatest level of security because it has the most hash power.","The project works by acting as a go-between between chains that need extra security and Bitcoin. Bablyon takes block headers — identifying a recently confirmed block — from chains using its services and writes these headers into the Bitcoin blockchain. That means anyone can check Bitcoin and see that the block was confirmed there, providing extra security that the transactions within the block have happened.","The idea behind Babylon isn’t to necessarily replace the chain’s security but to augment it. Since Bitcoin’s block times are much slower than most (if not all) Cosmos chains, it will be a lagging measure of security. However, it may still be important for large transactions to wait until the block has gone through this extra security confirmation through Babylon to know that their transaction has gone through.","The side benefit for chains that use Babylon is they might not need to spend so much money on network security, since they have this extra layer of security that kicks in between 10 minutes to an hour later. Since Babylon only needs to make two Bitcoin transactions for all of the chains that use it, it’s a relatively cheap service.","“We’re really hoping to get hundreds of chains using this service. Exchanges will be interacting with these chains in a very secure way. It could also be used to help secure bridges,” he said, noting that the project is working with the IBC project — the technology that Cosmos blockchains use to communicate and swap assets.","How does Babylon secure its own chain? Validators who run Babylon get paid in the native tokens of chains that are using Babylon. Plus, they’ll get paid in Babylon's native token too.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zaki Manian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"IDG","content":"ORGANIZATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Breyer Capital","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Cosmos","content":"LOCATION"},{"type":"Babylon","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"$47 million","content":"MONEY"},{"type":"Cosmos Hub’s","content":"ORGANIZATION"},{"type":"David Tse","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","COSMOS","CROSS-CHAIN SWAPS"],"authors":["Tim Copeland","The Block"]}