{"summary":"Berlin’s TV Tower Lights Up with Giant Bitcoin Logo and This Twitter User Just Claimed Responsibility","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/berlins-tv-tower-lights-up-with-giant-bitcoin-logo-twitter-user-just-claimed-responsibility.htm","publishDate":"2023-01-23T10:40:00","id":17701,"type":null,"title":"Berlin’s TV Tower Lights Up with Giant Bitcoin Logo and This Twitter User Just Claimed Responsibility","category":["Bitcoin News "],"content":["The famous Berliner Fernsehturm tower in Germany‘s capital was on Saturday decorated with the Bitcoin (BTC) logo – and it wasn’t the only iconic monument to be dressed in ₿.","The Berliner Fernsehturm (or Berlin Television Tower) is a 368m-tall tower in the Marien quarter (Marienviertel), close to the megapopular Alexanderplatz square. It was opened in 1969 by the government of East Germany as a symbol, not just of the city, but also of Communist power. It remains a significant landmark, the tallest structure in Germany, and the third-tallest in the European Union. ","And this landmark was chosen as the canvas for the Bitcoin logo.","The #bitcoin logo is on the Berliner Fernsehturm tower in Berlin right now pic.twitter.com\/Wn2b3koWUH","It is unclear who the individual or the group behind the project is, however, one Twitter user seems to have inside knowledge about this series of BTC promotions around Berlin. ","Tilo Neumann shared a video of the logo projected on the tower:","pic.twitter.com\/oZ1YFr2RDG","Sharing yet another video of the projector in action, Neumann spoke briefly about the reason behind this project. He invited people to come to Alexanderplatz on January 21, saying that it may get media attention. Replying to a commenter who argued that people of Berlin cannot invest in BTC as they no longer have money, Neumann said that,","“Berlin is definitely not rich, that’s probably true. Nevertheless, “we” want to draw attention to Bitcoin. After all, it is about our financial future. Some people sit down on the street and stick to it, “we” have decided to do it differently.”","This wasn’t the first attempt to promote Bitcoin on the tower, however. Neumann noted that there had been an earlier attempt to do so, but that the “projector wasn’t strong enough to conquer” the tower. ","As to where they got the projector from in the first place, he said that it is “from our own stock.” He went on to say that they “bought a DIY\/beamer and downloaded HD Bitcoin pictures.”","In November, the projector was taken to the sight of another world-known iconic site: the Berlin Wall. The wall was a concrete barrier raised to separate West and East Germany from 1961 to 1989. ","Neumann wrote that,","“Nothing in Berlin is as steeped in history as the Berlin Wall. That’s why we carried out our campaign here this time. This place represents endless suffering. In contrast, Bitcoin stands for hope, the hope for a fair and free world.”","A post earlier in January this year argued that the world has had the fiat standard for long enough and that it’s time for a change, while another said that wars could be prevented if they could no longer be financed with new fiat.","“I think we’ve done a lot to make bitcoin more visible to the general public,” Neumann said, adding: “Bitcoin is the future.”","Tilo Neumann describes himself as a Bitcoiner, investor, and CEO. The link on his Twitter page leads to ‘The Best of Blockchain’ website, a conference that will be held on October 5-7, 2023 in Berlin. ","____","Learn more: \n– Crypto Billionaire Arthur Hayes Says Bitcoin May ‘Crash Back Down’ If This Happens – Here’s What You Need to Know\n– Germany’s N26 Bank Bucks the Trend, Seeks to Expand its Crypto Trading Offering to More Countries\n\n– UK Ad Regulator Sends ‘Enforcement Notice’ to Crypto Promoters\n– Spending on US Crypto TV Ads Shrunk From USD 85M to USD 36K in 5 Months – Report"],"entity":[{"type":"Neumann","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"1961","content":"DATE"},{"type":"East Germany","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1989","content":"DATE"},{"type":"October 5","content":"DATE"},{"type":"Crypto Promoters\n– Spending on US Crypto TV Ads Shrunk From USD","content":"ORGANIZATION"},{"type":"1969","content":"DATE"},{"type":"Marien","content":"PERSON"},{"type":"January 21","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Berlin","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"January this year","content":"DATE"},{"type":"N26 Bank Bucks the Trend","content":"ORGANIZATION"},{"type":"Tilo Neumann","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"7, 2023","content":"DATE"},{"type":"Saturday","content":"DATE"}],"hashtag":["Adoption","advertising","Bitcoin","Germany","Investing"],"authors":["Sead Fadilpašić"]}