{"summary":"4.85m French Crypto Holders ‘Fail to Declare Their Holdings’ as Gov’t ‘Takes Aim’ at Offenders","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/4-85m-french-crypto-holders-fail-to-declare-their-holdings-as-govt-takes-aim-at-offenders.htm","publishDate":"2024-05-07T03:00:05","id":17715,"type":null,"title":"4.85m French Crypto Holders ‘Fail to Declare Their Holdings’ as Gov’t ‘Takes Aim’ at Offenders","category":["Blockchain News "],"content":["Only a small fraction of French crypto holders have declared their coins to the state, a report claimed – with the government set to take action.","Per the French IT magazine Clubic, the Ministry of Public Action and Accounts and the nation’s tax bodies are preparing to act.","They have been spurred into action after just 150,000 French residents “correctly declared their cryptoassets” at the end of the past financial year.","According to European Central Bank (ECB) estimates, “some 5 million French people hold cryptoassets including Bitcoin (BTC).”","Bitcoin has failed to become a global decentralised digital currency, instead falling victim to fraud and manipulation.","The recent approval of an ETF doesn’t change the fact that Bitcoin is costly, slow and inconvenient, argues #TheECBBloghttps:\/\/t.co\/e9Ek01Dism pic.twitter.com\/ddBFsv4g0w","— European Central Bank (@ecb) February 22, 2024","","The media outlet said tax officials “suspect” many taxpayers of “under-declaring their assets.”","And the ministry is preparing to respond by rolling out new legislation. It is working in conjunction with the nation’s Economy Ministry.","The new legislation will contain a “large arsenal of measures.” These will “force crypto holders to toe to the government’s line,” ministry officials believe.","The legislation will be bundled with a range of other anti-fraud rules, the ministry confirmed.","And the media outlet said that these measures would come as a “rude awakening” for French “cryptocurrency enthusiasts.”","Failing to declare crypto holding on tax returns is punishable by fines in France. These can rise to 40% of the coins’ total worth.","In the case of professional crypto traders who fail to declare coins, this amount can be doubled to a whopping 80%.","The new proposals “could be discussed in the coming weeks” by both lawmakers and senators.","If it faces no opposition in parliament, the bill “could see the light of day” before the end of fall 2024.","And this means the new rules could be in place before the end of FY2024, the ministry said.","The Ministry of Public Accounts also wants to give the tax body new powers over citizens’ overseas assets and holdings.","This would help tax officials crack down on French crypto holders who attempt to hide their tokens on overseas-based wallets and crypto exchange platforms.","In March, a major French media outlet reported that 15% of people aged 18-24 have bought crypto.","The same outlet said that 9% of French citizens have bought crypto at some point in their lives."],"entity":[{"type":"fall 2024","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"Clubic","content":"PERSON"},{"type":"France","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"24","content":"DATE"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"’s Economy Ministry","content":"ORGANIZATION"},{"type":"February 22, 2024","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"the end of FY2024","content":"DATE"},{"type":"Ministry of Public Accounts","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"European Central Bank (","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"the Ministry of Public Action","content":"ORGANIZATION"}],"hashtag":["crypto tax","France"],"authors":["Tim Alper"]}