{"summary":"Is Internet Computer Going to Zero? ICP Price Drops 2.3%, Investors Rush Into This New GambleFi Token","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-internet-computer-going-to-zero-icp-price-drops-2-3-investors-rush-into-this-new-gamblefi-token.htm","publishDate":"2024-05-03T22:56:21","id":17718,"type":null,"title":"Is Internet Computer Going to Zero? ICP Price Drops 2.3%, Investors Rush Into This New GambleFi Token","category":["Industry Talk "],"content":["Investors are concerned that promising cryptocurrency Internet Computer (ICP) could be headed to zero, with its rally since late 2024 looking at the risk of petering out, and are instead turning to a promising new GambleFi token called Mega Dice (DICE).","ICP was last trading at $13.64 and is attempting to push back above its 21DMA.","The cryptocurrency has been probing an uptrend that has been in play since late 2023.","Should this uptrend snap, a quick fall back to $10 is in the cards.","Internet Computer is a decentralized blockchain network that is attempting to realize the vision of a functional global computing network.","Despite launching in May 2021, ICP has failed to achieve adoption.","According to DeFiLlama, the blockchain has only around $95 million in cryptocurrency locked in smart contracts – a negligible amount compared to Ethereum, which has $134 billion.","Unsurprisingly, some investors fear that ICP will never gain real-world traction and will eventually plummet in value.","ICP is a highly speculative coin and has been subject to abrupt rallies as risk appetite picks up.","But ICP may never return to its 2021 highs near $350.","With ICP at risk of dropping back below $10, it’s no wonder that investors are checking out this new GambleFi token called Mega Dice (DICE).","Crypto investors looking for investments with greater upside potential than ICP should check out presale investing.","Web3 projects and protocols often sell their native tokens at a discount to early investors to raise funds for development.","If presale investors can find a good project that gains traction in the market, they can book exponential gains.","One project that analysts at Cryptonews are a big fan of is Mega Dice Casino.","This already well-established crypto casino has launched a presale of its utility token, DICE.","DICE holders get big cashback benefits on their wagers and can generate passive income via DICE staking.","The crypto casino is also running a $750,000 airdrop to reward early presale investors.","We’ve just crossed $700K in our presale & hit 8k Telegram members – to celebrate, we’re giving away $4000 in SOL! 🚀","Don't miss out on the opportunity to win BIG with Mega Dice Casino! 💰","Take part here ⤵️https:\/\/t.co\/wSxiRnIHlz pic.twitter.com\/NDMbxQLawK","— Mega Dice Casino (@megadice) May 3, 2024","","The project has already raised $700,000. Potential investors may want to move quickly, as the DICE price will rise when the $1 million milestone is hit.","Check Out Mega Dice Casino’s Presale",""],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"$95 million","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Mega Dice Casino’s Presale","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"Mega Dice Casino!","content":"ORGANIZATION"},{"type":"$700K","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$134 billion","content":"MONEY"},{"type":"$4000","content":"MONEY"},{"type":"late 2023","content":"DATE"},{"type":"May 3, 2024","content":"DATE"},{"type":"$13.64","content":"MONEY"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"$700,000","content":"MONEY"},{"type":"$750,000","content":"MONEY"},{"type":"ICP","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$350","content":"MONEY"}],"hashtag":["ICP","Internet Computer"],"authors":["Joel Frank"]}