{"summary":"Last Chance to Buy Solana’s Greatest Multichain Meme Coin, $DOGEVERSE, In $17 Million Presale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/last-chance-to-buy-solanas-greatest-multichain-meme-coin-dogeverse-in-17-million-presale.htm","publishDate":"2024-05-08T17:15:06","id":17719,"type":null,"title":"Last Chance to Buy Solana’s Greatest Multichain Meme Coin, $DOGEVERSE, In $17 Million Presale","category":["Industry Talk "],"content":["Wednesday, May 08, 2024 – There’s not long left now to buy Solana’s greatest multichain good boy Dogeverse before his month-long presale concludes.","The $DOGEVERSE token has already taken in well over $13 million toward its $17 million presale target.","Crypto’s latest Shiba Inu-inspired Solana meme coin has pricked the ears of meme fans, degens and crypto evangelists alike, who see Dogeverse’s hyper-jumping cross-chain capabilities as a hint of tomorrow’s meme coin capabilities.","SOL fans were the most recent addition to the Dogeverse family.","At the end of last month, Dogeverse rolled out its sixth native chain, Solana, joining a digital economy that is home to $4.078 billion in total value locked (TVL), with 1.14 million active users transacting daily and over 2,500 monthly active developers.","Since Dogeverse exists on multiple chains, it can be purchased by anyone on Ethereum ($ETH), BNB Smart Chain ($BNB), Polygon ($MATIC), Avalanche ($AVAX), Base ($BASE) and Solana ($SOL).","It's now or never! 🚀","Buy some $DOGEVERSE before the #DEX launch kicks off!#Memecoins #Altcoins #Solana#Ethereum #DOGE","— DogeVerse (@The_DogeVerse) May 5, 2024","","Currently priced at $0.00031, $DOGEVERSE is at its last fixed price before launch. This means that when the coin hits the open market through exchanges, there’s a very real chance it won’t ever be this low again.","The sky’s the limit on the potential upside, though.","Dogeverse sold out its initial soft cap allocation of 200 billion tokens after trending virally when the presale launched at the beginning of April.","A tidy $1 million flooded the project barely 48 hours into its ICO. The team had sold out of tokens allocated to the first two presale rounds and far exceeded initial expectations of a 6-day first round.","Dogeverse moved onto the second half of its ICO a day ahead of schedule. A further 200 billion tokens have now almost entirely been sold to the public.","Initially, the ICO’s conclusion was scheduled for June 11, however, due to the immense demand, it’s likely to conclude substantially earlier.","The funds from these additional tokens would have been sold on decentralized (DEX) or centralized (CEX) exchanges after the claim.","Now, they will be used to bolster liquidity to ensure high-volume trading and capital for buy-back funds.","Token holders can also stake their $DOGEVERSE on Ethereum to earn passive rewards.","The team is currently working towards smoothing the way for CoinGecko and CoinMarketCap listing applications after the presale sells out, while later DEX and CEX listings form part of the project roadmap.","🐶 📣:\n\"A bit higher, guys\" pic.twitter.com\/OHV19ENomD","— DogeVerse (@The_DogeVerse) May 6, 2024","","The market’s appetite for canine-themed coins began with Dogecoin (DOGE) back at the end of 2013.","Dogecoin didn’t need much of a sales pitch because it was based on a viral meme that virtually anyone with social media has seen before.","(Wow! Such meme! Very crypto!)","Since then, many celebrities have professed their love for the OG meme coin, including Tesla CEO Elon Musk, American entrepreneur Mark Cuban, and musicians Gene Simmons and Snoop Dogg.","Fun as it may be, Dogecoin has its problems.","Since Dogecoin is its own proprietary blockchain based on Bitcoin, it utilizes an outdated consensus mechanism called Proof-of-Work (PoW) to validate transactions.","This means that the miners with the most computation and power mine the most Dogecoin. Like Bitcoin, mining $DOGE consumes a lot of energy.","Dogecoin was followed by Shiba Inu (SHIB), Floki (FLOKI), Bonk (BONK), and DogWifHat (WIF).","All of them reference original viral doge memes involving adorable Shiba Inus in some way, but all of them either come from the most commercially important blockchain, Ethereum, or its nearest rival, Solana, both of which use less energy than Bitcoin and Dogecoin.","To date, none of them have seriously challenged the original’s dominance.","Dogeverse hopes to change that.","At the center of the Dogeverse is our four-legged friend Cosmo.","Born in a supernova, Cosmo discovered he had a unique ability: the power to hyper-jump across universes.","Now, he exists on a multichain network spanning six chains, none of which deploy the PoW consensus mechanism, making him cleaner and greener than his inspiration.","","The meme coin category often exaggerates broader market movements.","In other words, meme coins can pump hard when Bitcoin and Ethereum are rallying.","Conversely they crash harder when the market leaders are dipping.","They’re also in pole position to gain from two recent events: Bitcoin’s just-completed supply halving and the potential later this month for US-approved spot Ethereum ETFs to add billions more value into the market.","With staking capabilities, seamless multi-chain exposure and a potentially catalytic crypto news cycle in the coming months, what’s not to love about crypto’s new hyper-jumping upper?","Join the presale over on the Dogeverse website before the price rises.","Social Channels: Twitter | Telegram",""],"entity":[{"type":"$4.078 billion","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"Bonk (BONK)","content":"PERSON"},{"type":"$BNB","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"$13 million","content":"MONEY"},{"type":"$AVAX","content":"MONEY"},{"type":"Cosmo","content":"ORGANIZATION"},{"type":"Dogeverse","content":"PERSON"},{"type":"$DOGE","content":"MONEY"},{"type":"200 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"last month","content":"DATE"},{"type":"$SOL","content":"MONEY"},{"type":"May 6, 2024","content":"DATE"},{"type":"Elon Musk","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$DOGEVERSE","content":"MONEY"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"Dogecoin","content":"PERSON"},{"type":"$BASE","content":"MONEY"},{"type":"Gene Simmons","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"May 5, 2024","content":"DATE"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"May 08, 2024","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"$MATIC","content":"MONEY"},{"type":"$17 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"June 11","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"$0.00031","content":"MONEY"},{"type":"Shiba Inus","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Dogeverse","Meme coin"],"authors":["Tim Hakki"]}