{"summary":"Spot Bitcoin ETF Issuers in Fee War Ahead of Possible SEC Approval","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spot-bitcoin-etf-issuers-in-fee-war-ahead-of-possible-sec-approval.htm","publishDate":"2024-01-09T07:54:52","id":17716,"type":null,"title":"Spot Bitcoin ETF Issuers in Fee War Ahead of Possible SEC Approval","category":["Bitcoin News "],"content":["Spot Bitcoin exchange-traded fund (ETF) fee war has commenced before the US Securities and Exchange Commission (SEC) has even approved the product.","Spot Bitcoin ETF fees are as follows:  Ark is charging: 0.25%, Bitwise fees: 0.24%, BlackRock iShares is keeping its fees high at: 0.30%, VanEck at 0.25%, WisdomTree at 0.5%and 21Shares at 0.25%.","James Seyffart, ETF Research Analyst with Bloomberg Intelligence, highlights the, “lowest long term fee is Bitwise at 0.24% followed closely by VanEck at 0.25%. But we also have fee waivers on 3 for 6 months down to 0.0%. Plus BlackRock waiver to 0.20%”","WOW: This morning was wild for #Bitcoin ETF filers. Here's the state of play on the fee war front. Lowest long term fee is @BitwiseInvest at 0.24% followed closely by @vaneck_us at 0.25%. But we also have fee waivers on 3 for 6 months down to 0.0%. Plus BlackRock waiver to 0.20% pic.twitter.com\/8bfhtFHOfH","— James Seyffart (@JSeyff) January 8, 2024","","This is a highly anticipated event which is expected to impact the price of Bitcoin.","It seems approval of a spot Bitcoin (BTC) ETF in the United States appears to be imminent, writes Aditya Das, market analyst at Brave New Coin, in his newsletter. Adding that the final deadline for at least one major ETF application, the Ark 21 Shares application, is January 10th. But analysts have suggested that the SEC may, for convenience’s sake, approve multiple applications on this date.","“In the last day, exchanges where the spot Bitcoin ETFs have applied for trading listed amended documents related to the applications. Market observers have suggested that this means the exchanges expect the US Securities and Exchange Commission (SEC) to approve the ETF applications in the coming days,” adds Das.","Bloomberg ETF analyst Seyffart said during a recent webinar that the SEC has been backed into a corner and may be forced into approving a spot Bitcoin ETF.","“The SEC is either going to have to come up with a new reason….Because you’ve been denying these ETFs for all these reasons. Courts said those reasons don’t matter anymore, and now you’re coming out with new reasons,” said Seyffart.","So far, two issuers, WisdomTree and VanEck, have successfully listed their ETFs on the Depository Trust & Clearing Corporation (DTCC). The latest Bitcoin ETF ticker listing happened just 2 days before SEC’s deadline to announce its decision on the Ark 21Shares Bitcoin ETF filing.","“The US market is witnessing a fierce competition among ETF issuers to offer the lowest fees for bitcoin ETFs, which are expected to attract what is said to be ‘huge’  inflows from US investors seeking exposure to the leading cryptocurrency,” said says Laurent Kssis, a crypto expert on trading and ETFs at CEC Capital.","“The break-even point for launching a bitcoin ETF is estimated to be at least $2 billion per product, which means only the most efficient and reputable issuers can survive in the long run,” explains Kssis. ","However, Kssis warns that not everyone stands to benefit from a Bitcoin ETF launch. The custodians and service providers who support the ETF issuers may not see much revenue growth from their low-margin businesses.","“According to some estimates, the 13 issuers who have filed for a bitcoin ETF would only generate $30 million in custody fees and $200 million in additional trading revenue from the cash creation process in 2024. Coinbase, the leading crypto exchange and custodian in the US, may have an edge over its competitors due to its dominant position and existing relationships with many ETF issuers, but it also faces legal risks from a pending lawsuit that could affect its operations,” said Kssis.","To put this in perspective, a $1 billion inflow into a Bitcoin ETF with a 0.25% fee would only produce $2.5 million in annual revenue for the issuer, adds Kssis.","Johnny Lyu, CEO of KuCoin, said “If Bitcoin spot ETF is successfully approved, more and more regulatory agencies will recognize the importance of Bitcoin and the crypto market. This will become a monumental event leading to clearer regulatory measures and more comprehensive investor protection, allowing more traditional institutions, professional and retail investors to enter crypto market easily.”","Lyu believes this may bring crypto adoption to another level. “According to our survey on multiple markets, over 60% of users believe that crypto is the future of finance. In view of this trend, we believe there is a high probability that the Bitcoin spot ETF will be approved,” adds Lyu.\n","Meanwhile, the price of Bitcoin (BTC) experienced a notable surge, breaching the $47,000 mark on Monday and recording an 8% gain in the last 24 hours. This upward movement is attributed to optimistic sentiments surrounding the potential approval of the ETFs. The current value marks the highest trading point for the leading cryptocurrency in the past year, and speculations arise that an ETF approval could trigger a further bullish trend."," "],"entity":[{"type":"0.20%","content":"PERCENT"},{"type":"0.30%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"0.24%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"0.5%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Kssis","content":"PERSON"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"This morning","content":"TIME"},{"type":"$47,000","content":"MONEY"},{"type":"CEC Capital","content":"ORGANIZATION"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"January 10th","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Johnny Lyu","content":"PERSON"},{"type":"January 8, 2024","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"Depository Trust & Clearing Corporation (DTCC","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Laurent Kssis","content":"PERSON"},{"type":"last day","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"0.0%","content":"PERCENT"},{"type":"VanEck","content":"PERSON"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Seyffart","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"ETF Research Analyst","content":"ORGANIZATION"},{"type":"Brave New Coin","content":"ORGANIZATION"}],"hashtag":["Blackrock","ETFs","Securities and Exchange Commission"],"authors":["Tanzeel Akhtar"]}