{"summary":"Do Kwon’s Extradition to South Korea Challenged by Montenegro’s Top Prosecutor","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/do-kwons-extradition-to-south-korea-challenged-by-montenegros-top-prosecutor.htm","publishDate":"2024-03-22T05:15:05","id":17723,"type":null,"title":"Do Kwon’s Extradition to South Korea Challenged by Montenegro’s Top Prosecutor","category":["Blockchain News "],"content":["Terraform Labs co-founder Do Kwon’s recent ruling mandating his extradition to South Korea is now being challenged by Montenegro’s top prosecutor. ","The Supreme State Prosecutor’s Office in Montenegro is escalating the case to the Supreme Court for review claiming errors were made. ","Following a high court ruling in Podgorica, Kwon was set to be extradited to South Korea as he faces charges related to the collapse of Terra in May 2022. His partner, Han Chang-joon has already been extradited to South Korea.","Both South Korea and the U.S. had appealed to extradite Kwon, however, Montenegro’s minister of justice gave preference to South Korea. This decison is now being challenged by Montenegro’s top prosecutor.  ","This latest developments in Montenegro now puts Do Kwon’s extradition plans to South Korea in limbo and he may end up being extradited to the US which is the preferred location by Montenegro’s government.","Do Kwon was arrested in Montenegro in March 2023 after being caught using a fake Costa Rican passport traveling to Dubai, United Arab Emirates.","Do Kwon is the architect behind the failed crypto project TerraUSD stablecoin, launched in 2022. As a stablecoin designed to be a utility token on the blockchain, Terra USD was pegged algorithmically 1:1 to the U.S. dollar.","The stablecoin lost its pegging, however, resulting in its collapse alongside LUNA, the Terra sister token. The United States and South Korean authorities went after Kwon, who escaped to Singapore to avoid South Korean prosecutors from opening his fraud charges.","Kwon was later apprehended in Montenegro and sentenced to four months imprisonment after he was caught trying to escape using a forged Costa Rican passport.","As it stands, South Korean authorities are escalating efforts to ensure Kwon faces prosecution for his alleged fraud cases and tax evasion.","Kwon, who denied the charges, claimed that the $40 billion implosion of the Terra ecosystem resulted from market forces and doesn’t indicate any criminal action."],"entity":[{"type":"Han Chang","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"The Supreme State Prosecutor’s Office","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Podgorica","content":"LOCATION"},{"type":"March 2023","content":"DATE"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Terra USD","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Montenegro","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Do Kwon","Montenegro Court","South Korea"],"authors":["Tanzeel Akhtar"]}