{"summary":"Deutsche Börse Launches Spot Crypto Platform for Institutional Clients","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/deutsche-borse-launches-spot-crypto-platform.htm","publishDate":"2024-03-05T12:33:48","id":17725,"type":null,"title":"Deutsche Börse Launches Spot Crypto Platform for Institutional Clients","category":["Bitcoin News "],"content":["Deutsche Börse, one of Europe’s biggest exchange operators, has launched a new regulated spot platform for crypto assets targeting institutional clients.","In an announcement on Tuesday, the German stock exchange said the platform dubbed the Deutsche Börse Digital Exchange (DBDX) offers a fully regulated ecosystem for the trading, settlement and custody of crypto assets.","“Our new solution is a game changer for digital ecosystems. We aim to provide trusted market operations for crypto assets, ensuring transparency, security, and regulatory compliance for institutional clients in Europe,” said Carlo Kölzer, head of FX and DBDX, in a press release.","Trading on the DBDX platform will take place on a Request for Quote (RfQ) basis, followed by multilateral trading. Deutsche Börse will operate the trading venue and Crypto Finance will provide settlement and custody services.","In January BaFin, Germany’s financial regulator, issued four licenses to Crypto Finance, a firm operated by Deutsche Börse. The licenses allow Crypto Finance to carry out regulated digital asset trading, settlement, and custody services in Germany. The Swiss Financial Market Supervisory Authority (FINMA), already regulates the company. Crypto Finance is targeting institutional investors and aims to strengthen its position within the crypto ecosystem through licenses.","In 2023, Deutsche Borse gave an insight into its plans for growth, investment, and onboarding institutional investors as it looks towards 2026. The exchange said it plans a continued 7% growth until 2026 and the acquisition of new firms to boost its growth ratio. Furthermore, it plans a new capital management scheme and shares buybacks with 300 million euros as it grows.","In February, it emerged DZ Bank, the second largest bank in Germany, is reportedly planning to begin a retail crypto trading trial this year. The service will be available for private customers who have access to cryptocurrencies independently without seeking financial advice.","DZ Bank, which possesses $627 billion in assets under management, unveiled a blockchain-based digital custody platform last year."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2026","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Deutsche Borse","content":"ORGANIZATION"},{"type":"Carlo Kölzer","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"$627 billion","content":"MONEY"},{"type":"Swiss Financial Market Supervisory Authority","content":"ORGANIZATION"},{"type":"BaFin","content":"ORGANIZATION"},{"type":"Deutsche Börse","content":"ORGANIZATION"},{"type":"Deutsche Börse Digital Exchange","content":"ORGANIZATION"},{"type":"Crypto Finance","content":"ORGANIZATION"}],"hashtag":["Crypto Trading","Deutsche Börse","Germany"],"authors":["Tanzeel Akhtar"]}