{"summary":"Blockchain Security Firm Peckshield Identifies Strange Transactions in Crypto Casino Stake Wallet – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-security-firm-peckshield-identifies-strange-transactions-crypto-casino-stake-wallet-whats-going-on.htm","publishDate":"2023-09-04T15:06:00","id":17726,"type":null,"title":"Blockchain Security Firm Peckshield Identifies Strange Transactions in Crypto Casino Stake Wallet – What’s Going On?","category":["Blockchain News "],"content":["Blockchain security firms Peckshield and Cyvers have detected multiple suspected transactions with wallets linked to crypto casino, Stake. ","Etherscan data shows that wallet 0x3130662aece32F05753D00A7B95C0444150BCd3C received about $16 million worth of different cryptocurrencies before it was distributed to multiple addresses. ","🚨ALERT🚨Our AI-powered system has detected multiple suspicious transactions with @Stake.https:\/\/t.co\/0ZoMITOyF5 address received about $16M in $ETH $USDC $USDT and $DAI\n\nAll the stable coins are converted to $ETH and distributed to different EOAs.\n\nFYI: @tayvano_ @zachxbt pic.twitter.com\/CSGwRHEiVm","Within the last couple of hours, the wallet received several transactions including a single transfer of 6000ETH. The total assets ($16 million) were sent in various cryptocurrencies including 6,000 DAI, 3.9 million USDT, 900,000 DAI, and 1.1 million USDC.","At press time, assets have been distributed to several wallets with some holding over $6,000,000 in crypto. ","This recent activity has sparked wide concerns across the digital asset community with many calling it the latest rugpull in the market amid plunging prices.","The Stake-owned wallet under scrutiny currently holds $340,000 worth of ETH and over $2.1 of other cryptocurrencies after the incident.","Although the company has not released an official statement, several crypto users have called for an investigation as another potential big name is on the verge of confirming a major exploit. ","Stake.com is a global crypto betting platform with multiple sponsorship deals in sports across multiple jurisdictions. The platform also entered into a partnership with Canadian rapper Drake, a deal believed to have attracted multiple users to the platform. ","“We share the same love for crypto, gambling, and community and are like-minded fans of the technology and culture at the forefront of this movement,” Ed Craven, the co-founder of Stake.com noted as he disclosed the partnership. ","Several crypto users have projected the potential damage on the industry with some calling it a huge setback in the wake of looming spot BTC ETF approvals and other regulatory hurdles.","As institutions renew their interest in the market, many fear that a major hack of over 9,000 ETH will have damaging effects, especially with the global reach of Stake.com.","The company has endorsement deals with football club Everton in the UK, Argentine football star Sergio Aguero, etc. ","Last year, an alarming $3.7 billion was lost to crypto hacks and scams as bad actors ran riot in the market leading to calls for a change in global regulations.","Although this year has witnessed reduced numbers, and a 70% drop in scams, a huge incident of this nature could lead to reduced DeFi activity as investors pull out funds. ","As users mull over alternatives, it will be worthy to cite options reported earlier this year as options to Stake Casino. See the list of the top 10 alternatives to Stake Casino here"],"entity":[{"type":"$ETH $USDC $USDT","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"$2.1","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ed Craven","content":"PERSON"},{"type":"Everton","content":"LOCATION"},{"type":"Sergio Aguero","content":"PERSON"},{"type":"$340,000","content":"MONEY"},{"type":"$16M","content":"MONEY"},{"type":"UK","content":"ORGANIZATION"},{"type":"Drake","content":"PERSON"},{"type":"$3.7 billion","content":"MONEY"},{"type":"Stake Casino","content":"ORGANIZATION"},{"type":"$DAI","content":"MONEY"},{"type":"$6,000,000","content":"MONEY"},{"type":"$16 million","content":"MONEY"}],"hashtag":["CRYPTO","Hack"],"authors":["David Pokima"]}