{"summary":"Dalio doesn&#x27;t like stablecoins either, because of the way they are linked to the fiat central banks around the world are continuing to print in excess.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208592\/ray-dalio-still-doesnt-like-bitcoin-but-thinks-inflation-beating-coin-could-work","publishDate":"2023-02-03T15:31:55","id":1773,"type":null,"title":"Ray Dalio still doesn&#x27;t like Bitcoin but thinks inflation-beating coin could work","category":["MARKETS"],"content":["Ray Dalio, the billionaire hedge fund investor and founder of Bridgewater Associates,&nbsp;has long been <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-04-07\/dalio-still-thinks-cash-is-trash-as-printing-presses-roll\" data-v-f87c67ca=\"\">critical<\/a> of excess money printing and written detailed explainers on the value of money. He still doesn't like Bitcoin, though.","\"It's not going to be an effective money. It's not an effective store hold of wealth. It's not an effective medium of exchange,\" Dalio <a href=\"https:\/\/twitter.com\/bitcoinhorseman\/status\/1621213507709718528?s=46&amp;t=LePGURG9v9eaQB9wU5jK-g\" data-v-f87c67ca=\"\">said Thursday<\/a> on CNBC, pointing to the cryptocurrency's high volatility and arguing that it \"has no relation to anything.\" \"But we are in a world in which money as we know it is in jeopardy.\"","Dalio doesn't like stablecoins either, because of the way they are linked to the fiat central banks around the world are continuing to print in excess. He did offer up one idea for a cryptocurrency he said would be useful — some kind of an inflation-linked coin.","\"Every individual, what do they want? They want to secure their buying power,\" Dalio said, without providing details on how the tokenomics of such a coin would work other than to say it could be similar to an inflation-indexed bond. \"If you created a coin that says 'this is buying power that I know I can save in, and put my money in over a period of time and then I can transact in anywhere,' I think that that would be a good coin.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dalio","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ray Dalio","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Bridgewater Associates","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}