{"summary":"Crypto Exchange Mango Dealing with Surging Legal Costs, a Year After $100 Million Market Manipulation Exploit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-mango-dealing-with-surging-legal-costs-year-after-100-million-market-manipulation-exploit.htm","publishDate":"2023-08-08T13:49:00","id":17746,"type":null,"title":"Crypto Exchange Mango Dealing with Surging Legal Costs, a Year After $100 Million Market Manipulation Exploit","category":["Blockchain News "],"content":["A year after the alleged $100 million crypto market exploit by Avi Eisenberg, Mango Markets, a blockchain-based trading protocol, finds itself grappling with mounting legal expenses, prompting internal conflicts among its stakeholders. ","The platform’s financial strain has intensified as Mango Labs, the company driving the Solana blockchain-based exchange, struggles to cope with unexpected budget depletion.","With legal expenses growing and regulatory inquiries looming, Mango Labs approached members of Mango DAO (Decentralized Autonomous Organization) to secure approval for an additional $2 million to cover legal costs.","Voting rights for the decision are determined by the possession of Mango DAO’s MNGO tokens.","However, the proposal faced resistance from Mango DAO voters. ","The initial funding request from Mango Labs founder Daffy Durairaj was rejected by the DAO members last week.","Several members voiced concerns about the perceived lack of transparency in the company’s budget management.","Mango Labs has undertaken substantial legal actions, including a civil suit against Avi Eisenberg for his alleged theft of $110 million in cryptocurrencies. Simultaneously, the company is involved in federal regulatory and criminal cases linked to the incident. ","These legal efforts have significantly depleted a significant portion of the DAO’s stablecoin treasury, which was originally valued at $15 million.","While Mango DAO’s treasury holds around $89 million, most of these funds are in the form of MNGO tokens, which can not be easily liquidated. ","The primary source of potential funding for the legal expenses would likely come from a stash of dollar-linked stablecoins worth $15.3 million within the DAO’s treasury, predominantly denominated in USDC.","Daffy Durairaj, the founder of Mango Labs, said that the additional funding is crucial to managing the legal costs associated with regulatory inquiries, cooperation with law enforcement, and pursuing claims against Avi Eisenberg to recover the DAO’s funds. ","Despite facing pushback and the initial vote approaching rejection, Durairaj has initiated a second identical funding proposal.","It remains to be seen how the situation will unfold, as Mango Markets attempts to navigate both the financial implications of the alleged exploit and the evolving landscape of crypto regulations. ","As the Mango DAO stakeholders grapple with these challenges, the broader crypto community watches closely, recognizing the significance of these events in shaping the future of decentralized financial platforms and their governance structures."],"entity":[{"type":"Mango DAO (Decentralized Autonomous Organization","content":"ORGANIZATION"},{"type":"$89 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"$15.3 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Durairaj","content":"PERSON"},{"type":"Daffy Durairaj","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Mango DAO","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Avi Eisenberg","content":"PERSON"},{"type":"Mango Labs","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"}],"hashtag":["DAO","Hack"],"authors":["Jai Pratap"]}