{"summary":"Norway’s New Data Center Law Raises Concerns for BTC Miners","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/norways-new-data-center-law-raises-concerns-for-btc-miners.htm","publishDate":"2024-04-15T22:30:45","id":17763,"type":null,"title":"Norway’s New Data Center Law Raises Concerns for BTC Miners","category":["Bitcoin News "],"content":["Norway is introducing a new legislation to regulate data centers nationwide and provide oversight on the activities of BTC miners, according to local Monday reports.","The law mandates that all data centres register with the appropriate authorities and provide detailed information on services and ownership structure.","As reported by local media outlet VG, Norway’s ministries of digitalization and energy have drafted what they claim to be the first legislation in Europe to regulate the country’s ever-growing data center industry.","JUST IN: Norway's new data center legislation suggests heightened scrutiny for Bitcoin miners, indicating potential regulatory challenges ahead. 🇳🇴 #Bitcoin #Regulation","— Breaking Whale (@BreakingWhale) April 15, 2024","","The country’s Energy Minister Terje Aasland disclosed the government’s position, stating that cryptocurrency-related data center businesses are not desired in Norway.","“They are not welcome in Norway,” he said. “We want serious actors who are important to society, and the society-serving computer industry is important to us.”","Aasland further noted that Northern Norway, known for its relatively inexpensive electricity, has seen a rise in data centers established for Bitcoin mining.","This latest development from the Norwegian authorities aligns with a 2023 report by Dagsavisen, which indicated that crypto mining operations in Northern Norway consume nearly as much electricity as the entire district of Lofoten, estimated to be home to 24,500 residents.","The minister reiterated the role of data centers in Norway’s societal framework, particularly in securing storage for images and communication, which he considers integral to Norway’s development.","Miners are attracted to Norway due to its abundance of hydropower. The Nordic region generates the second-highest amount of electricity per capita globally, with 100% of its energy coming from renewables.","The country also offers low energy prices, averaging $10 and $50 per MWh (megawatt-hour) from 2013 to 2020.","Aasland expressed disapproval of actors solely seeking to capitalize on cheap electricity in the region, as he stressed the importance of responsible energy use.","If the legislation passes, it could increase scrutiny and regulatory challenges for BTC miners in the country as their electricity consumption may be regulated, similar to what’s been reported in the British Columbia Province in Canada. Those seeking to establish new mining operations or expand existing ones may face difficulties obtaining the necessary permits.","Norway’s recent legislative focus on data centers coincides with growing concerns surrounding Bitcoin mining. These concerns were increased following a warning by 10x Research that BTC miners could liquidate up to $5 billion following the upcoming halving event.","#Bitcoin Might Trade Sideways for 6 months As Miners Could Sell $5bn of BTC -> Here is why: https:\/\/t.co\/gLRgs8yyGg pic.twitter.com\/zBLdV95MAl","— 10x Research (@10x_Research) April 13, 2024","","With Bitcoin halving scheduled for April 20, 10x Research Head of Research Markus Thielen suggests that the crypto markets may not witness any upward trajectory until October 2024.","Conversely, Coincodex projects an optimistic market sentiment leading up to and post-halving with predictions that Bitcoin could experience a minor retracement about a month after the 2024 halving. This would be followed by a 14-month-long rally, however, culminating in a new all-time high of approximately $179,000 in August 2025."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"April 15, 2024","content":"DATE"},{"type":"$50","content":"MONEY"},{"type":"$10","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$5bn","content":"MONEY"},{"type":"10x Research Head of Research Markus Thielen","content":"ORGANIZATION"},{"type":"Lofoten","content":"LOCATION"},{"type":"October 2024","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Terje Aasland","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"British Columbia Province","content":"ORGANIZATION"},{"type":"August 2025","content":"DATE"},{"type":"Norway","content":"LOCATION"},{"type":"$179,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Northern Norway","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"April 13, 2024","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Dagsavisen","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin halving","BTC miners","Norway"],"authors":["Jimmy Aki"]}