{"summary":"MetaMask Partners with Robinhood to Simplify Crypto Transactions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/metamask-partners-with-robinhood-to-simplify-crypto-transactions.htm","publishDate":"2024-02-07T05:59:29","id":17765,"type":null,"title":"MetaMask Partners with Robinhood to Simplify Crypto Transactions","category":["Blockchain News "],"content":["MetaMask has collaborated with Robinhood to enable direct crypto purchases for users, according to a press release shared with Cryptonews on Feb.7.","MetaMask’s developer Consensys and Robinhood Markets, Inc. have jointly facilitated the integration of Robinhood Connect with the MetaMask wallet. This partnership allows users in the U.S. to buy cryptocurrencies through Robinhood’s trading platform directly from MetaMask’s interface.","The collaboration aims to simplify the crypto transaction experience, leveraging Robinhood’s low-cost order engine to provide MetaMask users with an efficient, secure pathway to engage with digital assets.","Hello @RobinhoodApp customers 👋! We’re happy to announce that US users will now be able to buy and transfer crypto on MetaMask with Robinhood Connect.","Click below to read more about the integration: https:\/\/t.co\/A5FoL9EBrq","— MetaMask 🦊🫰 (@MetaMask) February 6, 2024","","“The integration between MetaMask and Robinhood is an exciting step in our shared commitment to reduce friction for users seeking access to a self-custodial option,” said Consensys Senior Product Manager Lorenzo Santos.","“We know that crypto and internet users want greater control and ownership,” said Santos. “This will help more people access crypto in a seamless and self-custodial manner, by offering more buying options with service providers they already use and trust.”","A survey conducted by Consensys in partnership with YouGov uncovered a shift in how internet users wish to interact with and control their digital presence.","The findings, drawn from responses of over 15,000 participants, revealed a preference for more autonomy online, with 79% expressing the desire for greater control over their internet identity. Additionally, the survey demonstrated a strong sentiment towards ownership of digital content, with 67% of respondents believing they should retain rights to what they create online.","Despite this enthusiasm for more active participation and ownership, about one-third of those surveyed identified the complexity of web3 technology as a major barrier to entering the crypto space.","“At Robinhood it’s our mission to reduce friction wherever possible to increase adoption of web3,” said Robinhood Crypto Head of product Seong Lee.","“Robinhood Connect provides a seamless experience for existing Robinhood customers to fund their self-custody wallet via debit, bank transfer, or Robinhood buying power,” said Lee. “This feature allows users to start using their crypto right away.”"],"entity":[{"type":"Robinhood Connect","content":"ORGANIZATION"},{"type":"February 6, 2024","content":"DATE"},{"type":"Lee","content":"PERSON"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Robinhood Markets, Inc.","content":"ORGANIZATION"},{"type":"67%","content":"PERCENT"},{"type":"Santos","content":"PERSON"},{"type":"79%","content":"PERCENT"},{"type":"Robinhood Crypto Head of product Seong Lee","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Feb.7","content":"DATE"},{"type":"Consensys Senior Product Manager Lorenzo Santos","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["MetaMask","Robinhood","Wallet"],"authors":["Hongji Feng"]}