{"summary":"EU Securities Watchdog Considers Including Crypto in Investment Products, Expanding Market Access","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/eu-securities-watchdog-considers-including-crypto-in-investment-products-expanding-market-access.htm","publishDate":"2024-05-09T10:12:13","id":17764,"type":null,"title":"EU Securities Watchdog Considers Including Crypto in Investment Products, Expanding Market Access","category":["Altcoin News "],"content":["The European Union (EU) securities watchdog, the European Securities and Markets Authority (ESMA), is seeking input from stakeholders on the potential inclusion of crypto assets in investment products.","The move has the potential to open up a vast market for cryptocurrencies, surpassing the scope of spot Bitcoin exchange-traded funds (ETFs).","ESMA’s call for input is intended to expand the assets eligible for Undertakings for Collective Investment in Transferable Securities (UCITS), a market valued at €12 trillion.","","The approval of crypto assets for the EU’s UCITS would offer broader access to cryptocurrencies within the €12 trillion market.","In the US, funds managed by major players like BlackRock and Grayscale have already attracted approximately $18 billion since the beginning of the year, playing a significant role in driving the Bitcoin rally in the first quarter of 2024.","However, approval is not guaranteed, and ESMA is seeking stakeholder input until August 7 to gather perspectives and insights.","The EU’s securities watchdog is asking stakeholders whether it should include crypto assets into investment products. The move opens the door to broader access to cryptocurrencies via UCITS, a €12 trillion market. DLNEWS https:\/\/t.co\/FrH1os32wc","— Wu Blockchain (@WuBlockchain) May 9, 2024","","Andrea Pantaleo, a lawyer specializing in crypto regulation and litigation at DLA Piper, believes the impact would be more substantial than that of US ETFs, as multiple fund compartments could express interest in investing small percentages of liquidity in crypto assets.","One advantage of accessing UCITS for the crypto industry is its diverse investment categories.","UCITS investments encompass various funds with different asset allocations based on their risk profiles.","This framework could also benefit market liquidity, as authorization would not be required for each individual investment in crypto assets, unlike in the US, where ETFs are based on single assets that require regulatory authorization.","","While there are potential benefits, there are still obstacles to overcome before crypto assets can be included in the UCITS framework.","One significant challenge is custody, as regulations for depository banks need to be coordinated with the custody of crypto assets.","The EU is in the process of implementing the Markets in Crypto-Assets regulation (MiCA), which includes rules for safekeeping and segregation of assets for custodians.","Crypto assets involved in UCITS would likely need to comply with these rules.","ESMA is specifically seeking feedback on how the inclusion of specific cryptocurrencies in the UCITS framework would be affected by MiCA.","However, the process of updating the UCITS eligible assets rules is expected to be time-consuming and subject to negotiation.","It will likely be a long road before a definitive decision is made on whether crypto assets will be allowed in UCITS.","Last month, the EU formally passed an anti-money laundering regulation (AMLR), applicable to all crypto-asset service providers (CASPs).","The laws would provide more powers to Financial Intelligence Units (FIUs) to detect and combat money laundering and terrorist financing.","As reported, Western Europe has emerged as a leading region in global crypto adoption, attracting a substantial number of daily traders, ranging from 1.2 million to 1.5 million individuals.","Another recent survey has revealed that nearly 50% of European cryptocurrency holders owned Bitcoin in February."],"entity":[{"type":"Western Europe","content":"LOCATION"},{"type":"$18 billion","content":"MONEY"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"August 7","content":"DATE"},{"type":"Undertakings for Collective Investment","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Andrea Pantaleo","content":"PERSON"},{"type":"ESMA","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Transferable Securities","content":"ORGANIZATION"},{"type":"European Union (EU","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"DLA Piper","content":"ORGANIZATION"},{"type":"May 9, 2024","content":"DATE"},{"type":"UCITS","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"European Securities","content":"ORGANIZATION"},{"type":"Financial Intelligence Units","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Crypto Regulation","European Union"],"authors":["Ruholamin Haqshanas"]}