{"summary":"As an engineering leader with strong business acumen, Kraken CTO Vishnu Patankar has repeatedly helped build innovative and scalable decentralized technologies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237607\/the-rise-of-ai-an-interview-with-kraken-cto-vishnu-patankar","publishDate":"2023-07-05T09:00:58","id":1777,"type":null,"title":"The rise of AI: An interview with Kraken CTO Vishnu Patankar","category":["SPONSORED"],"content":["As an engineering leader with strong business acumen, Kraken CTO Vishnu Patankar has repeatedly helped build innovative and scalable decentralized technologies.","With a focus on driving the development of products and infrastructure, Vishnu’s expertise has helped to service millions of clients around the world. Before joining <a href=\"https:\/\/www.kraken.com\/\" data-v-f87c67ca=\"\">Kraken<\/a> in April, he was CTO at StockX where he played an integral part in facilitating the company’s growth and launching its NFT offering.","In recent weeks, Vishnu has been thinking about crypto’s place within the rise of large language models and neural networks. We sat down with him to talk about the future of AI in our industry.","<strong data-v-f87c67ca=\"\">From a CTO’s perspective, what do you think of generative AI in general? Is it useful? Dangerous?<\/strong>","<strong data-v-f87c67ca=\"\">Vishnu Patankar<\/strong>: From a Kraken perspective, it could be more useful than dangerous. Whether it is enterprise search, chatbots, code assistance, event log mining, security, personalization, fraud prevention or brand marketing, each has the potential for innovation within Kraken.","However, in the context of the wider tech industry, it is a different story if left unchecked. A self-aware intelligent machine could design its own improvements faster than any group of scientists. Growing up, watching Skynet in <em data-v-f87c67ca=\"\">The Terminator<\/em>, it seemed fictional. But now that situation seems closer than I had imagined. AI’s growth is akin to Moore’s law applied to self-learning computer software instead of computer hardware.","<strong data-v-f87c67ca=\"\">From a crypto perspective, where does AI fit in the current marketplace?<\/strong>","<strong data-v-f87c67ca=\"\">VP<\/strong>: It’s hard to ignore the power of AI large-language models. It will be interesting to see what business models survive through the initial hype cycle and journey to product-market fit, revenue, and EBITDA.","AI and cryptography are both probabilistic disciplines, albeit in different ways. So, for example, it might be okay to have a 90% correct answer from an AI chatbot, but there’s less use for a password that is 90% correct. Separately, there is early research on using AI to generate random numbers that can be used in cryptography, although pseudorandom number generators still dominate.","More broadly, AI applied to customer experiences around crypto are in their infancy – for example, generative AI and personalization applied to <a href=\"https:\/\/www.kraken.com\/learn\/what-are-non-fungible-tokens-nft\" data-v-f87c67ca=\"\">non-fungible tokens (NFTs<\/a><a href=\"https:\/\/www.kraken.com\/learn\/what-are-non-fungible-tokens-nft\" data-v-f87c67ca=\"\">)<\/a>. Other symbiotic areas between AI and crypto are cybersecurity and fraud prevention.","Beyond these, both AI and crypto utilize large amounts of data through massive computational power. There are areas in computer science and physics that could lead to further breakthroughs in other fields over the next couple of decades. One area I’m excited by is quantum computing and its interplay with factorization of large numbers.","<strong data-v-f87c67ca=\"\">When AI becomes smart enough to trade on our behalf (if it isn’t already), what happens to human traders?<\/strong>","<strong data-v-f87c67ca=\"\">VP<\/strong>: An analogous way to think about the AI spectrum in trading is self-driving technology, which has multiple levels. The most sophisticated of these levels is Full Driving Automation which no model has achieved… yet. There are more advances in reasoning that large models need to achieve in order to reach a similar level in trading.","Although with successive large models and hardware making progress with reasoning and latency each year, this future may not be as far away as previously thought. Until then, human traders will have their hands on the wheel and nudge algorithmic parameters to account for gaps regarding Artificial General Intelligence.","Societally, I don’t think we are prepared for the displacement of jobs to come. It’ll be interesting to see how regulation in AI will evolve to allow for innovation, yet preserve humanity.","<strong data-v-f87c67ca=\"\">What is an interesting AI implementation you’ve seen?<\/strong>","<strong data-v-f87c67ca=\"\">VP<\/strong>: One of the meaningful applications of generative AI I’ve seen is in healthcare. Specifically, not just efficiency within the doctor’s office but also prediction of candidate drugs to cure diseases. For example, acceleration of drug candidates for FDA approvals to treat real diseases using <a href=\"https:\/\/alphafold.ebi.ac.uk\/\" data-v-f87c67ca=\"\">AlphaFold’s<\/a> <em data-v-f87c67ca=\"\">in silico<\/em> methods.","<strong data-v-f87c67ca=\"\">What will it take to get you to go all in on AI-generated code and other quantitative data?<\/strong>","<strong data-v-f87c67ca=\"\">VP<\/strong>: For AI-generated code, it will be code provenance, security and correctness. Currently, the technology works for boilerplate net new code and algorithms, but it’s not yet great for re-factoring and building on legacy code – which constitutes a majority of software development roadmaps.","Adoption of quantitative data is already high – with the right golden prompts, spreadsheets today can be auto-generated 60% of the time. We’re already seeing higher levels of reasoning and accuracy – like the difference between ChatGPT3 and ChatGPT4 – and that will give traders more leverage.","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Kraken<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>"],"entity":[{"type":"Moore","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"Artificial General Intelligence","content":"ORGANIZATION"},{"type":"FDA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Vishnu","content":"ORGANIZATION"},{"type":"EBITDA","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Kraken CTO Vishnu Patankar","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Skynet","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}