{"summary":"Marathon Digital Chooses StanChart-Backed Zodia Custody as Crypto Custodian","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/marathon-digital-chooses-zodia-custody-crypto-custodian.htm","publishDate":"2024-04-30T05:22:34","id":17787,"type":null,"title":"Marathon Digital Chooses StanChart-Backed Zodia Custody as Crypto Custodian","category":["Blockchain News "],"content":["Marathon Digital has selected Standard Chartered-backed digital asset custodian Zodia Custody to safeguard its crypto holdings.","Zodia Custody will offer secure, institutional-grade custody solutions for Marathon’s crypto holdings located outside the United States, Monday’s announcement said.","The need for secure and reliable storage of digital assets is driving crypto companies to seek out crypto custodians. These specialized institutions offer a comprehensive solution, safeguarding assets from theft, loss, or misuse.","Crypto custodians wield advanced security measures to achieve this protection. These safeguards include multi-signature wallets, requiring multiple approvals for any transaction. They also offer cold storage, which keeps the majority of assets offline and out of reach of online hackers.","Marathon is expanding its risk management strategy by choosing Zodia Custody as its fourth custodian. This partnership strengthens Marathon’s security posture by providing additional assurances like secure cold wallet storage that’s accessible 24\/7 and protection against custodian insolvency.","“As Marathon’s fourth custodian, we bring in greater diversification, and risk management – exactly what the ecosystem needs,” said Julian Sawyer, CEO of Zodia Custody.","The company already counts Anchorage Digital, Fidelity Digital, and another unnamed provider as custodians. This strategy ensures its Bitcoin treasury is spread across multiple custodians for increased security and risk management.","Zodia Custody is incubated by Standard Chartered and Northern Trust, two established financial institutions. By combining their experience with a startup’s flexibility, Zodia Custody aims to be a leader in the digital asset custody industry. It offers secure wallets for institutions to trade digital assets, as well as services to help clients earn rewards on their holdings.","Marathon Digital CEO Fred Thiel issued a warning last month. According to him, smaller Bitcoin miners are in for financial trouble after the recent halving event. Thiel spoke to CNBC about the uneven playing field in the mining industry. Larger miners have been able to secure funding, while smaller miners are struggling to grow because they can’t get the financing they need, he said.","“Post halving I think you’ll see the smaller miners come under financial stress, which will enable the bigger miners to consolidate the industry,” he said."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Standard Chartered and Northern Trust","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Julian Sawyer","content":"PERSON"},{"type":"Zodia Custody","content":"LOCATION"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Fidelity Digital","content":"ORGANIZATION"}],"hashtag":["Crypto Custody","Marathon Digital","Standard Chartered"],"authors":["Shalini Nagarajan"]}