{"summary":"Robinhood CEO Criticizes ‘Regulatory Onslaught’ on Crypto US, Pledges to Challenge SEC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robinhood-ceo-criticizes-regulatory-onslaught-on-crypto-us-pledges-to-challenge-sec.htm","publishDate":"2024-05-08T00:24:10","id":17792,"type":null,"title":"Robinhood CEO Criticizes ‘Regulatory Onslaught’ on Crypto US, Pledges to Challenge SEC","category":["Blockchain News "],"content":["Robinhood Markets, a prominent retail trading platform, announced its intention on May 7 to challenge the US Securities and Exchange Commission (SEC) in court following allegations of securities violations. ","The firm disclosed that its Robinhood Crypto had received a Wells Notice from the SEC over the weekend, indicating that charges could be levied against Robinhood upon the conclusion of an investigation. CEO and co-founder Vlad Tenev revealed the company’s stance shortly after receiving a Wells Notice from the securities regulator.","Expressing his discontent, Tenev took to X on Monday to denounce the SEC’s “continued attack on crypto.” He characterized the regulatory actions as part of a broader “regulatory onslaught” that, in his view, stifles innovation and handicaps American firms and investors.","According to the filing, the SEC’s investigation into Robinhood’s crypto business, including its cryptocurrency listings, custody, and platform operations, has prompted concerns about possible violations of Sections 15(a) and 17A of the Securities Exchange Act of 1934.","The potential enforcement action against Robinhood could involve civil injunctive measures, public administrative proceedings, and cease-and-desist proceedings, seeking remedies such as injunctions, disgorgement, civil money penalties, and activity limitations.","Over the last three years, we’ve reached a state of regulatory onslaught that is harmful to American companies and consumers. The SEC’s continued attack on crypto, coupled with recent rule proposals like the one related to predictive data analytics, mark yet another improper…","— Vlad Tenev (@vladtenev) May 6, 2024","","Following the SEC’s lawsuits against Binance and Coinbase last year, Robinhood Crypto took further steps to comply with regulatory scrutiny. It ceased support for tokens that the SEC deemed to be securities, resulting in the loss of trading access for its U.S. users to altcoins such as Cardano (ADA), Polygon (MATIC), and Solana (SOL) within a few weeks.","Dan Gallagher, Robinhood’s chief legal, compliance, and corporate affairs officer, expressed disappointment with the SEC’s decision.","“After years of good faith attempts to work with the SEC for regulatory clarity, including our well-known attempt to ‘come in and register,’ we are disappointed that the agency has decided to issue a Wells Notice related to our U.S. crypto business,” said Gallagher. “We firmly believe that the assets listed on our platform are not securities, and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be based on both the facts and the law.”","While we strive to maintain positive and productive relationships with our regulators, if necessary we will use our resources to contest this matter in the courts, with the intent of both defending our crypto business and establishing regulatory clarity in the United States for…","— Vlad Tenev (@vladtenev) May 6, 2024","","Tenev said Robinhood Crypto isn’t afraid of a court battle to contest the matter with the SEC.","The SEC’s scrutiny of Robinhood Crypto comes amidst a broader crackdown on the crypto industry, with notable warnings issued to other prominent players like Consensys and Uniswap Labs.","In an April announcement, Uniswap’s founder, Hayden Adams, criticized the SEC’s approach.","“It’s been clear for a while that rather than working to create clear, informed rules, the SEC has decided to focus on attacking long-time good actors like Uniswap and Coinbase,” said Adams.","Consensys, on the other hand, opted to take legal action against the SEC, expressing concerns that regulating ether as a security would harm the U.S.’s ability to utilize Ethereum and other blockchain technologies. ","Robinhood Crypto has faced regulatory challenges, including a $30 million settlement with the New York Department of Financial Services in 2022 over compliance failures related to cybersecurity and transaction monitoring. ","Additionally, the company agreed to pay $65 million in 2020 to settle SEC charges of misleading statements to investors and a $70 million fine from the Financial Industry Regulatory Authority in 2021 for customer harm, marking its largest-ever financial penalty."],"entity":[{"type":"Vlad Tenev","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"$70 million","content":"MONEY"},{"type":"Tenev","content":"PERSON"},{"type":"Hayden Adams","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"May 6, 2024","content":"DATE"},{"type":"Gallagher","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"$65 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"1934","content":"DATE"},{"type":"Adams","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Securities Exchange","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Dan Gallagher","content":"PERSON"}],"hashtag":["Robinhood","US SEC","Wells notice"],"authors":["Hassan Shittu"]}