{"summary":"Exodus Approved for NYSE Listing, Trading Begins on May 9","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/exodus-approved-for-nyse-listing-trading-begins-on-may-9.htm","publishDate":"2024-05-07T10:46:59","id":17797,"type":null,"title":"Exodus Approved for NYSE Listing, Trading Begins on May 9","category":["Blockchain News "],"content":["Crypto wallet developer Exodus Movement has received approval to list its common stock on the NYSE under the ticker EXOD.","Trading for the stock will commence on the platform on May 9, the company announced on Monday. ","“Trading on the NYSE American will allow Exodus to create greater long-term value for our stockholders by increasing our presence within the investor community and, in turn, increase liquidity,” Exodus CEO and Co-founder JP Richardson said. ","“We believe the uplisting will broaden the awareness of Exodus.”","NYSE American, formerly known as the American Stock Exchange (AMEX), focuses on companies with smaller market capitalization compared to the main NYSE. ","By moving to the NYSE American, Exodus aims to enhance its market presence and attract more investors.","The EXOD stock is already listed on the OTCQX market, and the recent approval paves the way for Exodus’ stocks to be “uplisted” to the NYSE. ","Big news!","Exodus stock $EXOD starts trading on the NYSE American this Thursday, May 9th.","This significant milestone paves the way to creating long-term value for our investors by expanding our global shareholder base and boosting stock liquidity.","LFG!","— JP (Exodus) (@jprichardson) May 6, 2024","","The company told existing stockholders that no action was required prior to the NYSE American listing.","Founded in 2015, Exodus Movement specializes in developing self-custodial wallet services for cryptocurrencies such as Bitcoin, Ether, and other digital assets. ","Notably, the company has tokenized its EXOD security tokens, which represent Class A EXOD common shares, on the Algorand blockchain. These tokens can be managed using Exodus wallets. ","Exodus claims to be the only U.S.-based company that has its common stock tokenized on the blockchain.","According to Exodus’ preliminary review for the first quarter of 2024, the company achieved a revenue of $29.1 million, marking a significant 118% increase compared to the same period last year. ","Additionally, Exodus reported having approximately 1.69 million monthly active users during the first quarter.","Exodus’ move to list its common stock on the NYSE American comes as ACINQ’s Phoenix Wallet and zkSNACKs’ Wasabi Wallet have discontinued their services for customers in the United States. ","The move came as a response to the recent crackdown on self-custodial cryptocurrency wallet providers by regulatory agencies. ","Both companies have expressed concerns about the classification of self-custodial wallet providers as legitimate money service businesses following actions taken against Consensys, the creator of Metamask, and crypto mixer Samourai Wallet.","The recent regulatory focus on self-custodial wallets stems from concerns that they may facilitate illicit activities such as money laundering. ","Consensys, the creator of MetaMask, received a Wells notice from the SEC on April 10, which warned of potential enforcement actions related to its MetaMask Swaps and MetaMask Staking products. ","In another incident, the co-founders of Samourai Wallet, a cryptocurrency mixer, were arrested on charges of money laundering brought by the U.S. Justice Department and other agencies. ","Samourai Wallet CEO Keonne Rodriguez and chief technology officer William Hill are facing charges of conspiracy to commit money laundering and conspiracy to operate an unlicensed money transmitting business."],"entity":[{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"JP Richardson","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"118%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"William Hill","content":"PERSON"},{"type":"NYSE American","content":"ORGANIZATION"},{"type":"May 6, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"crypto mixer Samourai Wallet","content":"ORGANIZATION"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Keonne Rodriguez","content":"PERSON"},{"type":"April 10","content":"DATE"},{"type":"$29.1 million","content":"MONEY"},{"type":"Phoenix Wallet","content":"LOCATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"U.S. Justice Department","content":"ORGANIZATION"},{"type":"$EXOD","content":"MONEY"},{"type":"Exodus Movement","content":"ORGANIZATION"},{"type":"May 9","content":"DATE"},{"type":"American Stock Exchange","content":"ORGANIZATION"},{"type":"May 9th","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["crypto adoption","crypto wallet"],"authors":["Ruholamin Haqshanas"]}