{"summary":"UK Law Enforcement Can Seize Crypto More Easily With New Powers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-law-enforcement-can-now-seize-crypto-more-easily.htm","publishDate":"2024-04-26T15:10:13","id":17793,"type":null,"title":"UK Law Enforcement Can Seize Crypto More Easily With New Powers","category":["Blockchain News "],"content":["New powers that will make it easier for UK law enforcement agencies to seize crypto come into effect on Friday.","This comes after the UK Parliament passed new legislation last year, dubbed the ‘Economic Crime and Corporate Transparency Act.’ This Act expanded the authority of local law enforcement and laid the foundations for crypto to be seized more quickly.","The bill is now taking effect with new powers being implemented on Friday, the UK Home Office said in a press release. UK Law enforcement will now be able to seize funds before making arrests.","“This will make it easier to take assets which are known to have been criminally obtained, even if sophisticated criminals are able to protect their anonymity or are based overseas.”","The police have deployed crypto tactical advisors nationwide and have already seized hundreds of millions of pounds in cryptocurrency.","In January, the National Crime Agency collaborated with the United States Drug Enforcement Administration to investigate a drug ring, seizing $150 million in cash and cryptocurrency.","The change has been crucial in combating the use of cryptocurrency in organized crime, exploiting decentralization to prevent intervention. Adrian Foster, the Chief Crown Prosecutor, said:","“It is vital that investigators and prosecutors have the capability and agility to keep pace with this changing nature of crime which these new measures will greatly assist our ability to restrain, freeze, or eliminate crypto assets from illegal enterprise”","These powers also give UK law enforcement agencies the power to manage seized funds. Assets can now be transferred into a wallet controlled by law enforcement agencies.","From there, a decision is made whether to destroy the currency or reintroduce it into circulation “if returning it to circulation is not conducive to the public good.”","The press release mentioned privacy coins as an example in which seized coins could be destroyed. Privacy coins are cryptocurrencies designed to boost anonymity and reduce traceability. Home Secretary James cited privacy coins as a means to threaten national security, which the new laws aim to prevent:","“Terrorist organizations like Daesh are known to raise funds through crypto transactions and these updated powers will enable our agencies to more easily strip them of their assets.”","Although there are benefits to the laws, it has left the crypto community divided. Some believe it goes against the underlying purpose of cryptocurrency – freedom from centralized control and intermediaries.","Opposing community members cite the powers as a selfish act and a means of control, with concerns they may be exploited and have their assets seized without proper grounds.","Booooo","Suppression, control, misinformation.","This is all the government are good at doing. As the days, weeks, months and years go by they lose more and more control, soon we will all be free 💪","— CryptoJones (@CryptoJones2011) April 26, 2024","",""],"entity":[{"type":"UK Parliament","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"April 26, 2024","content":"DATE"},{"type":"United States Drug Enforcement Administration","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"UK Home Office","content":"ORGANIZATION"},{"type":"National Crime Agency","content":"ORGANIZATION"},{"type":"Adrian Foster","content":"PERSON"},{"type":"James","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"Daesh","content":"PERSON"}],"hashtag":["Crypto crime","Crypto Law","UK"],"authors":["Harvey Hunter"]}