{"summary":"dYdX Investigates Block Production Halt During Scheduled Upgrade","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dydx-investigates-block-production-halt-during-scheduled-upgrade.htm","publishDate":"2024-04-08T21:36:24","id":17806,"type":null,"title":"dYdX Investigates Block Production Halt During Scheduled Upgrade","category":["DeFi News "],"content":["Decentralized finance (DeFi) protocol dYdX is currently investigating an unexpected halt in block production following a scheduled upgrade of its chain on April 8.","dYdX has confirmed the outage on its mainnet and noted that ecosystem engineers are currently debugging the issue. According to an incident report, the outage has been ongoing since 6:50 a.m. UTC, and no fix is expected for several hours.","","🚨 Update on the dYdX Chain Protocol v4.0 Software Upgrade.","The upgrade is now expected to happen between 7:00-8:00 AM (UTC)","👀 Monitor the targeted block height page since time may vary.","🧊 Block Height: https:\/\/t.co\/RwNnjsVFRS https:\/\/t.co\/KS8uEm0YZW","— dYdX Ops subDAO (@dydx_ops_subdao) April 7, 2024","","On April 8, at 5:30 am UTC, dYdX issued a status report informing users about the ongoing scheduled protocol upgrade and cautioning about potential disruptions in dYdX Chain functionalities.","🚨 Update #2","The dYdX Chain is halted due to the v4.0.0 software upgrade, the issue is currently being investigated.","💡We are hoping to get it sorted in the next few hours.","We'll keep you updated, thank you for your patience https:\/\/t.co\/6oUGHHyhXx","— dYdX Ops subDAO (@dydx_ops_subdao) April 8, 2024","","Despite the completion of the scheduled maintenance, block production on the chain failed to resume. ","As of the latest update, blockchain explorer platform Nodes Guru indicates that the dYdX mainnet has not produced any new blocks since the time of the scheduled upgrade, which occurred five hours prior.","The dYdX Chain is halted due to the v4.0.0 software upgrade, the issue is currently being investigated 🚨","You can view the dYdX Chain status page. https:\/\/t.co\/eBh7NCZ2rR https:\/\/t.co\/dQqbOHROku","— dYdX (@dYdX) April 8, 2024","","The investigation is ongoing, with the team indicating that a resolution may not be reached until later. dYdX mentioned convening with validators around 3 pm UTC to discuss potential solutions without risking validator penalization for being offline during the chain restart.","“The issue continues to be investigated. It’s been agreed to reconvene with the validators around 15:00 UTC. This means that the devs won’t suggest a workaround or a fix until then so that the validators won’t get jailed for not being online when the chain restarts. When a validator is “jailed,” it means it’s been temporarily suspended from participating in the network activities.”","The incident represents the first major outage for the protocol since dYdX version 4 and its standalone Cosmos blockchain launched on the mainnet in October, according to its status page. ","Initially suggested on February 21, the proposed protocol upgrade sought to introduce several advancements, including order book features, risk and safety improvements, and enhancements related to Cosmos integration.","dYdX launched its dYdX Chain in October 2023, enabling DYDX token holders to transfer funds from the Ethereum network to the new platform, expanding its utility. Data from DefiLlama shows dYdX total value locked on-chain at $509.71 million at the time of writing. The network generated over $48.59 million in fees over the past twelve months.","The project unveiled its decision to migrate from Ethereum in early 2022, citing concerns over the network’s scalability issues. The incident does not appear to have impacted the price of dYdX’s token, which is up over 4% during the past 24 hours, according to CoinMarketCap.","On April 6, the dYdX community voted to authorize the staking of $61 million in treasury tokens on the liquid staking protocol known as Stride. This move comes in response to the increasing trading activity within the protocol, as highlighted by dYdX."],"entity":[{"type":"$48.59 million","content":"MONEY"},{"type":"February 21","content":"DATE"},{"type":"$509.71 million","content":"MONEY"},{"type":"April 8, 2024","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"April 6","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"5:30","content":"TIME"},{"type":"October 2023","content":"DATE"},{"type":"$61 million","content":"MONEY"},{"type":"early 2022","content":"DATE"},{"type":"Stride","content":"LOCATION"},{"type":"April 8","content":"DATE"},{"type":"6:50 a.m.","content":"TIME"},{"type":"October","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"April 7, 2024","content":"DATE"}],"hashtag":["Blockchain scalability","DeFi","dydx"],"authors":["Hassan Shittu"]}