{"summary":"Philippines Central Bank Approves Trials for National Stablecoin Tied to Local Peso","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/philippines-central-bank-approves-national-stablecoin-tied-to-local-peso-to-start-trials.htm","publishDate":"2024-05-13T09:51:45","id":17808,"type":null,"title":"Philippines Central Bank Approves Trials for National Stablecoin Tied to Local Peso","category":["Altcoin News "],"content":["The Philippines central bank, Bangko Sentral ng Pilipinas (BSP), has given the green light for controlled trials of a national stablecoin that will be pegged 1:1 to the local peso.","The move comes as the BSP, in collaboration with crypto wallet provider Coins.ph, aims to explore the potential of a digital currency tied to the country’s fiat currency, according to a recent announcement. ","The pilot project for the Philippine peso-backed stablecoin, known as PHPC, has been approved under the BSP’s Regulatory Sandbox Framework.","#ICYMI: #CoinsPH has been granted @bangkosentral (BSP) approval to pilot PHPC, a Philippine Peso stablecoin 🇵🇭","Learn more about this milestone and the pilot here: https:\/\/t.co\/zpQQvr7Pv9 pic.twitter.com\/a2jWB8mSeJ","— Coins.ph (@coinsph) May 9, 2024","","Coins.ph, a well-known player in the Philippines’ crypto space, will be responsible for maintaining cash reserves in pesos equivalent to the circulating supply of the PHPC stablecoin within the sandbox environment.","The primary objective of pegging the stablecoin to the local currency is to facilitate a seamless transition between PHPC and physical fiat currencies.","The upcoming sandbox testing phase will serve as a real-world trial of the PHPC stablecoin and its impact on the local fiat ecosystem.","PHPC is anticipated to have various potential applications, including domestic and cross-border payments, trading with other virtual assets, hedging against market volatility, and providing collateral and liquidity in decentralized finance (DeFi) applications.","The results of the trials will play a crucial role in determining the stablecoin’s readiness for broader adoption.","However, it is important to note that a formal public deployment of PHPC will be subject to final evaluations and approvals by the central bank.","According to local regulations, the duration of the testing phase can range from three to 12 months, depending on the complexity of the project.","Although an official deadline for the stablecoin experiment has not been disclosed, the BSP is committed to ensuring a thorough evaluation process.","The initiative is not the first of its kind in the Philippines.","UnionBank, a local commercial bank, introduced a payments-focused stablecoin called PHX in July 2019.","The launch of PHX was part of UnionBank’s efforts to promote financial inclusion and support the BSP’s digital financial inclusion agenda.","PHX, like PHPC, offers seamless redemption for pesos, which are then credited back to users’ UnionBank accounts.","The stablecoin has been integrated into UnionBank’s i2i platform, which enables secure transactions between individuals, institutions, and across different islands.","As reported, the Philippines’ securities regulator is set to unveil a regulatory framework for crypto assets and trading by the latter half of 2024.","The upcoming cryptocurrency guidelines target regulating trading within the Philippines, prioritizing investor protection.","Last month, the SEC pursued removing Binance-linked applications from Apple and Google app stores in the Philippines.","“The SEC has identified [Binance] and concluded that the public’s continued access to these websites\/apps poses a threat to the security of the funds of investing Filipinos,” SEC Chair Emilio Aquino said in letters to the companies."],"entity":[{"type":"July 2019","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BSP’s Regulatory Sandbox Framework","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Philippines","content":"LOCATION"},{"type":"May 9, 2024","content":"DATE"},{"type":"Emilio Aquino","content":"PERSON"},{"type":"UnionBank","content":"ORGANIZATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"BSP","content":"ORGANIZATION"},{"type":"Bangko Sentral ng Pilipinas (BSP","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["philippines","Stablecoin"],"authors":["Ruholamin Haqshanas"]}