{"summary":"Coinbase thinks proposed tax regulations will impose &quot;unprecedented, unchecked, and unlimited tracking on the daily lives of Americans.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256239\/coinbase-tells-irs-it-has-serious-concerns-about-proposed-tax-rules","publishDate":"2023-10-12T17:00:02","id":1780,"type":null,"title":"Coinbase tells IRS it has &#x27;serious concerns&#x27; about proposed tax rules","category":["COMPANIES"],"content":["Coinbase used a 14-page letter to the Internal Revenue Service on Thursday to detail what it said are serious concerns about the \"nature and scope\" of <a href=\"https:\/\/www.federalregister.gov\/documents\/2023\/08\/29\/2023-17565\/gross-proceeds-and-basis-reporting-by-brokers-and-determination-of-amount-realized-and-basis-for\" data-v-f87c67ca=\"\">proposed<\/a> tax regulations related to gross proceeds and basis reporting for digital asset transactions.&nbsp;","\"We have long advocated for a tax system that treats digital assets the same way it treats assets in traditional finance,\" the crypto exchange told the U.S. tax authority. \"The proposed regulations, as written, would impose an unprecedented, unchecked, and unlimited tracking on the daily lives of Americans. They would enable government surveillance of the choices Americans make about their most private health care decisions, or even when they purchase a cup of coffee.\"","Coinbase, which was writing about rules proposed by the IRS in August, said the requirements would establish an \"incomprehensible and unduly burdensome set of new reporting requirements.\" It also argued that they're \"overly broad in ways that are not warranted or implementable.\"&nbsp;","The crypto exchange listed what it said were six overarching observations connected to its objections: lack of parity with financial services, duplicative and burdensome reporting, invasion of privacy, violation of tech neutrality, unrealistic compliance timeline, and missed opportunity to leverage blockchain to ensure taxpayer compliance.&nbsp;","\"This overbreadth will counterproductively make it harder for the IRS to enforce the tax laws on cryptocurrency transactions involving U.S. persons,\" Coinbase wrote.&nbsp;","A group of&nbsp;Democratic senators, meanwhile, is&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/256033\/democratic-senators-tell-irs-to-speed-up-crypto-tax-reporting-rules\" data-v-f87c67ca=\"\">pushing<\/a>&nbsp;the IRS to advance&nbsp;tax reporting requirements for crypto brokers \"as rapidly as possible.\"","\"Limiting any further delay in the implementation of the Administration’s proposed rule would combat industry efforts to evade regulation, provide clarity to law-abiding taxpayers, and generate billions in tax revenue from a chronically tax-avoidant industry,\"&nbsp;Sen. Elizabeth Warren, D-Mass, and others said in a letter dated Oct. 10.","The tax authority will continue to accept comments until Oct. 30, and a public hearing has been set for Nov. 7. Coinbase said it intends to provide more detailed observations and technical comments in an additional letter it plans to send.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Oct. 30","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Oct. 10","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Administration","content":"ORGANIZATION"},{"type":"Nov. 7","content":"DATE"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Nathan Crooks","The Block"]}