{"summary":"Ethereum Price Prediction With Ether ETFs Unlikely to Gain Approval in May – Where Next for ETH?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-prediction-with-ether-etfs-unlikely-to-gain-approval-in-may-where-next-for-eth.htm","publishDate":"2024-03-19T22:31:12","id":17813,"type":null,"title":"Ethereum Price Prediction With Ether ETFs Unlikely to Gain Approval in May – Where Next for ETH?","category":["Price Predictions "],"content":["The Ethereum (ETH) price is consolidating either side of the $3,300 level, down roughly 6.5% on the day as investors take profit following the crypto’s recent run higher, and amid chatter that Ether ETFs are unlikely to gain approval in May.","“We now believe these will ultimately be denied May 23rd,” Bloomberg’s ETF analyst James Seyffart said in a tweet. “The SEC hasn’t engaged with issuers on Ethereum specifics,” he explained.","My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round. The SEC hasn't engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall. https:\/\/t.co\/TyAzAOrAC5","— James Seyffart (@JSeyff) March 19, 2024","","Profit-taking has overwhelmed the crypto market since Bitcoin hit new record highs above $73,000 last week.","But the Ethereum price has seen an even steeper decline than other major cryptos, as ETF optimism is priced out.","While Bitcoin is down 10% in seven days, the Ethereum price is down 17%.","Solana, meanwhile, is up 17%, as the blockchain continues to flex is potential superiority versus Ethereum amid its ongoing meme coin trading boom.","At its current price just below $3,300, the Ether price is now down 20% from its recent highs at $4,100.","That’s equal in magnitude to the pullback seen in January this year following spot Bitcoin ETF approvals.","That pullback saw the ETH price drop below its 50DMA. Last around $3,100, there is still a little way to go for Ether to fall under this key moving average.","That implies that this pullback may have a little further to run. And if the Ethereum price does dip slightly below its 50DMA, that could be a very attractive re-entry level for many investors.","If its to be believed that the broader crypto market remains in a bullish phase, then investors should be looking to buy dips to attractive levels.","If Bitcoin pushes towards $100,000 this year, even without an Ether ETF, this should lift ETH back to record highs.","That means getting in as Ether approaches $3,000, ETH could potentially be becoming very attractive.",""],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"$3,100","content":"MONEY"},{"type":"fall","content":"DATE"},{"type":"$3,300","content":"MONEY"},{"type":"$73,000","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"6.5%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"May 23rd","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"January this year","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"$100,000","content":"MONEY"},{"type":"$4,100","content":"MONEY"},{"type":"March 19, 2024","content":"DATE"}],"hashtag":["ETH","Ether","Ethereum"],"authors":["Joel Frank"]}