{"summary":"The Beanstalk stablecoin hopes to raise $77 million in an over-the-counter loan from private investors.\nThe team is aiming to recover from a large exploit in April that drained millions in funds.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146068\/hacked-stablecoin-beanstalk-seeks-to-borrow-77-million-to-revive-itself","publishDate":"2022-05-10T11:40:58","id":1781,"type":null,"title":"Hacked stablecoin Beanstalk seeks to borrow $77 million to revive itself","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">The team behind the stablecoin Beanstalk is raising $77 million in an over-the-counter loan from private investors as it seeks to revive the project following a major hack last month.<\/span>","On May 7, the Beanstalk DAO — the decentralized autonomous organization that oversees the project – approved a <a href=\"https:\/\/snapshot.org\/#\/beanstalkfarms.eth\/proposal\/0x54fa850db378e89e78308d082230ca5c9cce921c892008c0d34fcc4c20b535f3\" data-v-f87c67ca=\"\">governance vote<\/a> that enables the core team to borrow funds and use them to replenish the project. This will lead to the issuance of a new stablecoin token and, over time, the project will seek to pay back investors affected by the April 17 hack through the issuance of yet another token.","According to the proposal, the team plans to issue a new token to OTC lenders, claiming that it will pay out a 500% yield until the loan is fully repaid. It's unclear who might lend money to Beanstalk.&nbsp;","The project’s founder Publius <a href=\"https:\/\/anchor.fm\/beanstalk-farms\/episodes\/Beanstalk---The-Path-Forward-AMA-4---05082022-e1i9686\" data-v-f87c67ca=\"\">said<\/a> in a Monday ask-me-anything announcement that the debt capital will go to whoever was affected by last month’s attack, which saw <a href=\"https:\/\/www.theblockcrypto.com\/linked\/142272\/ethereum-based-stablecoin-protocol-beanstalk-loses-more-than-80-million-to-exploit\" data-v-f87c67ca=\"\">$182 million<\/a> in various crypto assets stolen. After freezing and burning all of their own hacked stablecoins, the Beanstalk team has <a href=\"https:\/\/bean.money\/blog\/beanstalk-governance-exploit\" data-v-f87c67ca=\"\">calculated<\/a> it needs $77 million to reimburse losses incurred by investors.&nbsp;","The attempted fundraising comes as woes at Terra’s algorithmic stablecoin, TerraUSD (UST), drew attention to the market. UST <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145974\/ust-stablecoin-regains-some-ground-as-crypto-sentiment-improves\" data-v-f87c67ca=\"\">lost its peg<\/a> to the dollar on Monday, dropping as low as $0.61 before recovering to $0.90 as of the time of writing.&nbsp;","As opposed to algorithmic stablecoins or those that rely on collateral, Beanstalk used loans to back its value and investors would invest in Beanstalk debt assets known as “pods.” The pods function like time-vested bonds paying a high annual interest in Beanstalk's native stablecoin Bean.","Beanstalk didn't immediately respond to a request for comment.&nbsp;"],"hashtag":[]}