{"summary":"Terraform Labs Pushes Back Against SEC Over Special Counsel Payment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terraform-labs-pushes-back-against-sec-over-special-counsel-payment.htm","publishDate":"2024-03-05T17:24:25","id":17818,"type":null,"title":"Terraform Labs Pushes Back Against SEC Over Special Counsel Payment","category":["Blockchain News "],"content":["Crypto firm Terraform Labs filed a lawsuit against the US Securities and Exchange Commission on March 3, addressing the regulator’s recent objection over a $166M retainer paid to special litigation counsel Dentons.","The SEC previously argued that the crypto firm’s hefty payment constituted an attempt to avoid paying creditors. Terraform Labs refuted this claim, arguing in its court filing that the SEC’s objection amounts to “government overreach. They believe it seeks to distract and create a disadvantage for them.","Terraform Labs has a series of court cases to defend itself against, including a civil enforcement action and a grand jury investigation in the Southern District of New York (SDNY).","“The relief sought in the Motion will allow the Debtor to develop legal strategies, elicit testimony, and gather important facts from the Employees who are knowledgeable witnesses and have access to key information necessary to the Debtor’s defense of the SEC Enforcement Action,” the filing read.","The defunct crypto firm is now awaiting permission from the court to overrule the SEC’s objection and settle its legal fees. It claimed the objection threatens its daily business operations.","Dentons claimed Terraform Labs’ ability to defend itself would be severely affected if the court failed to overrule the objection.","While these concerns seem genuine, the SEC believes the crypto firm should not be allowed to settle attorneys or afford to pay millions of dollars during its bankruptcy.","More specifically, the SEC revealed that Terraform Labs paid $122M into the Dentons Advance Payment Retainer within 90 days before its bankruptcy filing.","According to the financial regulator, both parties have a potential conflict of interest. As such, the major law firm should only represent Terraform Labs if it returns the funds to the retainer account.","Founder Do Kwon's SEC Trial to Start\nWithout Him Amid Extradition Delay\nDo Kwon, co-founder of Terraform Labs, is expected to miss the beginning of his US Securities and Exchange Commission (SEC) trial on fraud charges due to delays in his extradition from Montenegro. The trial pic.twitter.com\/93GYU1TMls","— bitcoin trader (@someassp) March 5, 2024","","Terraform had initially asked the bankruptcy court for permission to hire outside counsel. The crypto firm also requested $6.3M to be set aside for employees and outside partners for legal bills.","Terraform Labs, known for developing the algorithmic stablecoin TerraUSD (UST) and LUNA cryptocurrencies, faced a cataclysmic turn of events in 2022 when both stablecoins crashed in a death spiral. The company and its founder, Do Kwon, faced challenges following the implosion of UST.","The collapse of the UST led to a crypto market crash and a contagion that ultimately led to the shutdown of other firms, including FTX.","Do Kwon and Terraform Labs’ former CFO Chang-joon Han are currently serving a four-month jail sentence in a Montenegro prison for possessing forged travel documents.","While the pair are wanted for their role in the collapse of the LUNA ecosystem across continents on fraud charges, Do Kwon is embroiled in an extradition case between the US and Montenegro.","Recently, Kwon won his extradition appeal after a Montenegro court overturned the previous ruling. The case is to be retried following the decision of the Appellate Court of Montenegro, which quashed an earlier verdict from the High Court. Han was extradited to South Korea last month."],"entity":[{"type":"Southern District of New York (SDNY","content":"ORGANIZATION"},{"type":"$6.3M","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"High Court","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the Appellate Court of Montenegro","content":"ORGANIZATION"},{"type":"$166M","content":"MONEY"},{"type":"$122M","content":"MONEY"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Montenegro","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"SEC Enforcement Action","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Chang","content":"PERSON"},{"type":"March 3","content":"DATE"},{"type":"March 5, 2024","content":"DATE"}],"hashtag":["Do Kwon","SEC vs Crypto","Terraform Labs"],"authors":["Jimmy Aki"]}