{"summary":"Crypto Exchange Trading Volume Declines in April as Bitcoin Retreats from Record High","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-trading-volume-declines-in-april-as-bitcoin-retreats-from-record-high.htm","publishDate":"2024-05-10T19:35:48","id":17812,"type":null,"title":"Crypto Exchange Trading Volume Declines in April as Bitcoin Retreats from Record High","category":["Altcoin News "],"content":["Trading volume on major cryptocurrency exchanges has experienced a significant decline in April, coinciding with Bitcoin’s retreat from its all-time high.","Spot trading volume on centralized exchanges like Coinbase Global, Binance, and Kraken dropped by 32.6% to $2 trillion last month, as reported by research firm CCData.","Additionally, derivatives trading volume saw its first decrease in seven months, falling by 26.1% to $4.57 trillion.","The surge in trading volume witnessed earlier in the year, following the introduction of US exchange-traded funds investing in Bitcoin, waned due to the tightening of financial conditions in the United States.","The Federal Reserve’s efforts to address persistent inflation challenges contributed to this shift.","Prior to the April 19 Bitcoin halving event, which reduced the supply of new coins by half, there was anticipation and excitement within the market.","Jacob Joseph, a research analyst at CCData, told Bloomberg that the decline in trading activity on centralized exchanges after the Bitcoin halving event aligns with patterns observed in previous cycles.","","He further explained that the release of higher-than-expected Consumer Price Index (CPI) inflation data and escalating geopolitical tensions in the Middle East injected uncertainty and fear into the market.","These factors and negative net flows from spot Bitcoin ETFs led to major crypto assets reaching their range lows.","The decline in trading volumes also affected the spot market share of Binance, the world’s largest crypto exchange.","For the first time since September 2023, Binance’s spot market share dropped by almost 4% to 33.8%, reaching its lowest level since January, according to CCData.","","The CME Group, a prominent derivatives marketplace, also experienced a decline in crypto trading volume for the first time in seven months.","In April, its derivatives trading volume decreased by nearly 20% to $124 billion, as reported by CCData.","Despite the decline, Jacob Joseph mentioned that trading activity on centralized exchanges, while slower compared to its peak in March, remains at an elevated level compared to previous months.","Centralized cryptocurrency exchanges (CEXs) like Binance experienced a large surge in trading volumes between October 2023 and March 2024, according to Bybit’s 2024 Institutional Industry Report released on April 18.","Notably, OKX saw a 278% increase in 30-day volumes since October, followed closely by Binance, which saw a 239% surge.","Bybit exchange also demonstrated impressive growth, adding 264% to its trading volumes during the same period.","As confirmed by a spokesperson for Bybit, these exchanges have outpaced the industry’s average growth rate of 255%.","The U.S.-based exchange Coinbase also witnessed growth, albeit slightly trailing behind with a 193% increase in trading volume.","The CEX growth hasn’t surpassed the even more rapid expansion of decentralized exchanges (DEXs), however.","Leading DEX Uniswap v3, for instance, saw a 320% increase in volumes during the same period, as highlighted in Bybit’s data.","Uniswap has surpassed $2 trillion in lifetime trading volume."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Coinbase Global","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"239%","content":"PERCENT"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"32.6%","content":"PERCENT"},{"type":"$124 billion","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"255%","content":"PERCENT"},{"type":"320%","content":"PERCENT"},{"type":"$4.57 trillion","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Middle East","content":"LOCATION"},{"type":"$2 trillion","content":"MONEY"},{"type":"33.8%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"278%","content":"PERCENT"},{"type":"April 19","content":"DATE"},{"type":"264%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"April 18","content":"DATE"},{"type":"March 2024","content":"DATE"},{"type":"DEX Uniswap v3","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"193%","content":"PERCENT"},{"type":"26.1%","content":"PERCENT"},{"type":"September 2023","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Jacob Joseph","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crypto Trading","Trading Volume"],"authors":["Ruholamin Haqshanas"]}