{"summary":"A new form of tokenized bitcoin, &quot;PolkaBTC,&quot; is set to be released onto the Polkadot blockchain network in Q1 2021.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81179\/new-tokenized-bitcoin-polkabtc-polkadot","publishDate":"2020-10-15T08:40:44","id":1782,"type":null,"title":"A new tokenized bitcoin is coming onto Polkadot in Q1 2021 — &#x27;PolkaBTC&#x27;","category":["BITCOIN"],"content":["A new form of tokenized bitcoin, \"PolkaBTC,\" is set to be released onto the Polkadot blockchain network in Q1 2021.","Blockchain startup <a href=\"https:\/\/polkadot.network\/bitcoin-is-coming-to-polkadot\/\" data-v-f87c67ca=\"\">Interlay will launch<\/a> PolkaBTC, backed 1:1 by bitcoin (BTC). Interlay is funded by the Web3 Foundation, which oversees the development of Polkadot.","PolkaBTC could be seen as an alternative for popular <a href=\"https:\/\/www.theblockcrypto.com\/post\/80925\/coinlist-wbtc-token-largest-mint\" data-v-f87c67ca=\"\">WBTC<\/a> or <a href=\"https:\/\/www.theblockcrypto.com\/post\/63176\/tbtc-a-bitcoin-pegged-token-on-ethereum-has-begun-its-launch-with-makerdao-and-compound-support\" data-v-f87c67ca=\"\">tBTC<\/a>, which are built on the Ethereum blockchain. Interlay said what makes PolkaBTC unique is its \"strict dedication to being trustless and open,\" meaning that it would have no central authority and be permissionless like the bitcoin system.","\"Right from the start, the BTC-Parachain will be run by a decentralized network of individuals, community members, and companies,\" said Interlay. \"You do not need permission or any additional token to become a maintainer and start earning fees.\"","Polkadot's native DOT token would be used as collateral for minting PolkaBTC. \"Any user can become a Vault by simply locking DOT collateral. The only requirements are (1) a Bitcoin wallet, (2) a Polkadot wallet, and (3) some DOTs,\" said Interlay.","Users would then be able to transfer minted PolkaBTC to other users or decentralized applications built on Polkadot.","To redeem PolkaBTC for the equivalent amount of BTC, they would need to burn PolkaBTC tokens on the BTC-Parachain. \"PolkaBTC can remain on Polkadot indefinitely (no expiry date) and can be redeemed for BTC at any point in time,\" said Interlay.","A first Alpha testnet for PolkaBTC is scheduled for November 2020, and a feature-ready Beta testnet is expected to launch in January 2021. The mainnet launch is scheduled for Q1 2021.","Interlay said PolkaBTC would be integrated with projects building on Polkadot, including Equilibrium, Moonbeam, Polkaswap, and others.","Besides PolkaBTC, the Interlay team is also working on \"XOpts\" — the non-custodial platform for cross-chain bitcoin options. \"Our vision for XOpts is to become the equivalent of Uniswap for options and other derivative products,\" said the team. \"XOpts also functions as a decentralized exchange for BTC (physical settlement of options), enabling cross-chain trading against stablecoins and DeFi tokens — without price oracles or wrapped BTC.\"","XOpts' launch is planned for Q1 2021 on Ethereum, followed by expansion to Polkadot and other blockchains later in the year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Interlay","content":"PERSON"},{"type":"Interlay","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Polkaswap","content":"LOCATION"},{"type":"Interlay","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"January 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Parachain","content":"LOCATION"},{"type":"Moonbeam","content":"LOCATION"},{"type":"November 2020","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}