{"summary":"Amazon Web Services VP Sandy Carter has joined Web3 startup Unstoppable Domains.\nIn her role as senior VP of business development, Carter will expand the company’s partnerships globally.","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126581\/sandy-carter-unstoppable-domains","publishDate":"2021-12-08T09:00:41","id":1782,"type":null,"title":"AWS VP Sandy Carter joins Unstoppable Domains","category":["Web3"],"content":["<span data-v-f87c67ca=\"\">Amazon Web Services (AWS) VP Sandy Carter has jumped aboard the Web3 train, joining Unstoppable Domains as senior VP of business development.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Launched in 2018, the startup sees itself as a gateway to the decentralized web — selling NFT domain names linked to the Ethereum blockchain that offer a more accessible alternative to alphanumeric wallet addresses.<\/span>","<span data-v-f87c67ca=\"\">Carter said she views Unstoppable as a challenger to social media giants because individual users, rather than a centralized network, have control over the content they share. Whilst Unstoppable Domains’ current main focus is on NFT domain names, she thinks that this form of digital identity could be applied to fields ranging from gaming to education and even to healthcare records.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The whole point of decentralization is that no longer does another company hold your information but instead you own it, you control it, you decide when you want to sell it, and when you want to keep it,” she said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Carter will join the company after close to five years at AWS and will be in charge of the company’s business partnerships, with the goal of getting more developers using Unstoppable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company will set up headquarters in APAC, Europe and the Middle East but Carter says she'd like to establish a presence in Africa too. <\/span><span data-v-f87c67ca=\"\">“By 2035, there'll be more developers in Africa than any other region in the entire world,” she says. “And so we have to be there as well.”<\/span>","<span data-v-f87c67ca=\"\">Carter is also looking at a possible partnership with Girls in Tech, which she is on the board of, to create a “Women of Web3” organization.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“One of the very first things I talked to [CEO Matthew Gould] about was: how can we form more groups to encourage more women in Web3?” she said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As part of her hiring package, Carter will receive her first NFT, a Lazy Lion. However, she laments the lack of women participating in the space and wants her presence to be a signal to women to take part in this new economy. An ArtTactic report recently revealed that women only account <\/span><a href=\"https:\/\/www.theartnewspaper.com\/2021\/11\/03\/not-so-metadiverse-women-account-for-just-16percent-of-nft-art-market\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">for 16% of the NFT market.<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I just put out a tweet, I think it was this past weekend about where are all the women-owned NFTs?” she said.&nbsp;<\/span><span data-v-f87c67ca=\"\">“Had I known that [there were so few] maybe I wouldn't have asked for a Lazy Lion.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Carter's appointment comes with startups at the forefront of Web3 development gathering steam. On Monday, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/126512\/a16z-invests-36-million-in-a-web3-infrastructure-startup-founded-by-four-ex-meta-employees\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a16z invested $36 million<\/span><\/a><span data-v-f87c67ca=\"\"> into a Web3 infrastructure startup setup by ex-Meta employees. Last month, ConsenSys, primarily known for its MetaMask and Infura products, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/124615\/consensys-raise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">closed a $200 million raise,<\/span><\/a><span data-v-f87c67ca=\"\"> valuing the company at $3.2 billion.&nbsp;<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":[]}