{"summary":"Tether Responds to UN Report Alleging Involvement in Illicit Activity, Disputes Claims","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-responds-to-un-report-alleging-involvement-in-illicit-activity-disputes-claims.htm","publishDate":"2024-01-16T12:07:32","id":17831,"type":null,"title":"Tether Responds to UN Report Alleging Involvement in Illicit Activity, Disputes Claims","category":["Altcoin News "],"content":["Major stablecoin firm Tether has responded to the United Nations (UN) report highlighting the alleged involvement of the Tether stablecoin USDT in illicit activity.","Tether Challenges UN Report and Calls for Blockchain Education","Read more ⬇️https:\/\/t.co\/RM474wIiqo","— Tether (@Tether_to) January 15, 2024","","On January 15, the UN Office for Drugs and Crime (UNODC) released a report titled “Casinos, Money Laundering, Underground Banking, and Transnational Organized Crime in East and Southeast Asia: A Hidden, Accelerating Threat.”","The report emphasized the increasing prevalence of USDT on illegal online gambling platforms, especially on the Tron blockchain, making it a favored choice for cryptocurrency-based money launderers.","The UN report indicates that Tether’s digital token, a stablecoin pegged to the US dollar, has become a preferred choice for regional cyber fraud operations and money launderers due to its stability, ease of use, anonymity, and low transaction fees. The report points to the rapid growth of sophisticated, high-speed money laundering teams specializing in underground tethering.","Also, online gambling platforms, particularly those operating illegally, have become popular vehicles for cryptocurrency-based money launderers in the region, with Tether playing a significant role. The report suggests that the evolution of cryptocurrency, along with technological developments, has empowered organized crime gangs in Southeast Asia to create a parallel banking system using new technologies.","The UN report specifically mentioned Tether’s involvement in various fraudulent activities, including the notorious “pig butchering” romantic scams. However, Tether had previously acknowledged assisting the US Department of Justice in freezing $225 million in USDT linked to an international human trafficking group responsible for such scams in Southeast Asia.","Law enforcement agencies have reportedly disrupted multiple money laundering networks dealing with illicit Tether funds in recent years. An operation conducted by Singaporean authorities in August led to the dismantling of one such network, resulting in the recovery of approximately $735 million in both cash and cryptocurrency.","Jeremy Douglas of the UN’s Office on Drugs and Crime noted, “Organized crime has effectively created a parallel banking system using new technologies, and the proliferation of loosely or entirely unregulated online casinos together with crypto has supercharged the region’s criminal ecosystem.”","In response, Tether challenged the UN’s findings in a statement today, emphasizing that the analysis “ignored the traceability” of USDT and neglected its proven record of collaboration with law enforcement globally. Tether argued that the UN should also acknowledge how centralized stablecoins can contribute to anti-financial crime efforts.","Tether argues that its collaboration with global law enforcement, including the Department of Justice (DOJ), the Federal Bureau of Investigation (FBI), and the United States Secret Service (USSS), has resulted in unparalleled monitoring capabilities, surpassing traditional banking systems. The recent onboarding of USSS onto the Tether platform is highlighted as a testament to their commitment to combating the criminal use of cryptocurrencies.","The company points out that USDT tokens, which operate on public blockchains, allow for meticulous tracking of every transaction, making it impractical for illicit activities. Tether claims to have frozen over US$300 million in the past few months as part of its commitment to combating criminal activities.","The stablecoin issuer further emphasizes its dedication to community protection by implementing security measures, including its collaboration with Chainalysis to develop tools for monitoring secondary markets. Tether urged the UN to acknowledge these industry-leading security measures and its track record of collaboration with law enforcement agencies.","What’s more, Tether called for global cooperation and expanded awareness of blockchain technology to better address financial crimes. The stablecoin firm invited the UN to engage in collaborative dialogue and expressed its dedication to promoting transparency and accountability in digital currencies.","The company reiterates its commitment to transparency and accountability in digital currencies. It expresses the belief that a proactive learning approach regarding blockchain technology is essential for a more informed and productive environment.","This news comes after Tether’s CEO, Paolo Ardoino, recently stated in a letter to US legislators that the company had onboarded the US Secret Service and the Federal Bureau of Investigation onto its platform in December. Throughout 2023, Tether’s share of the global stablecoin supply reportedly grew from 50% to 71%."],"entity":[{"type":"January 15","content":"DATE"},{"type":"United States Secret Service","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"US Secret Service","content":"ORGANIZATION"},{"type":"Federal Bureau of Investigation","content":"ORGANIZATION"},{"type":"US Department of Justice","content":"ORGANIZATION"},{"type":"Jeremy Douglas","content":"PERSON"},{"type":"East","content":"LOCATION"},{"type":"UN Office for Drugs","content":"ORGANIZATION"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$735 million","content":"MONEY"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Blockchain Education","content":"ORGANIZATION"},{"type":"Transnational Organized Crime","content":"ORGANIZATION"},{"type":"Money Laundering","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"71%","content":"PERCENT"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Underground Banking","content":"ORGANIZATION"},{"type":"$225 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"UN’s Office","content":"ORGANIZATION"},{"type":"January 15, 2024","content":"DATE"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"US$300 million","content":"MONEY"}],"hashtag":["Stablecoin","Tether","USDT"],"authors":["Hassan Shittu"]}