{"summary":"Ethereum Price Prediction as Dencun Upgrade Successfully Goes Live – Where Next for ETH?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-prediction-as-dencun-upgrade-successfully-goes-live-where-next-for-eth.htm","publishDate":"2024-03-13T16:41:53","id":17830,"type":null,"title":"Ethereum Price Prediction as Dencun Upgrade Successfully Goes Live – Where Next for ETH?","category":["Price Predictions "],"content":["The Ethereum (ETH) price is consolidating just below $4,000 and close to multi-year highs in wake of the successful implementation of the Dencun upgrade, that, amongst other things, is set to deliver a major boost to the Ethereum ecosystem via delivering a significant reduction in Ethereum layer-2 blockchain transaction fees.","The upgrade also paves the way for protodank sharding in the future, which will finally lower Ethereum’s high layer-1 fees.","BREAKING: Ethereum just had a hard fork! (Dencun)","this upgrade lowers layer 2 fee's by around 98% which is expected to indirectly reduce layer 1 fees as well","it also paves the way for protodank sharding in future upgrades, which will eventually make eth layer 1 a lot cheaper…","— Crypto Tea (@CryptoTea_) March 13, 2024","","Assuming the latest upgrade does result in a drastic drop in layer-2 fees, blockchains such as Arbitrum and Optimism could attract significant amounts of new capital and users.","This is a clear positive for ETH. More layer-2 use translates into greater demand for Ethereum’s layer-1 blockchain as a settlement layer.","So why has the Ethereum price not been able to break out to fresh highs above $4,000?","Bitcoin (BTC) was able to print fresh record highs above $73,000 on Wednesday, after all.","The market has been becoming more bearish on spot Ethereum ETF approval in recent weeks.","Bloomberg’s ETF analysts recently stated they think the Ethereum ETFs only have a 35% chance of receiving approval by May.","Yeah our odds of eth ETF approval by May deadline are down to 35%. I get all the reasons they SHOULD approve it (and we personally believe they should) but all the signs\/sources that were making us bullish 2.5mo out for btc spot are not there this time. Note: 35% isn't 0%, still… https:\/\/t.co\/QWQOGZjDC5","— Eric Balchunas (@EricBalchunas) March 11, 2024","","A lack of meaningful engagement between the SEC and applicants is the most cited reason for the pessimism.","But its also worth noting that the SEC has been reluctant to clarify its stance on Ethereum as to whether it’s a security or a commodity.","The SEC’s prior approval of Ether futures ETFs last year suggests it favors the latter view. But SEC Chair Gary Gensler, prior to assuming his role with the SEC, is a well-known proponent of the view that Ethereum is a security.","Either way, confusion and uncertainty over whether Ether is about to get spot ETF approvals is hanging over market sentiment.","This pessimism isn’t just reflected in Ethereum’s failure to break above $4,000, but also in options markets.","As per The Block, the 25% delta skew of ETH options expiring in 7, 30 and 60 days recently fell below 0.","","That means that, all of a sudden, options buyers are paying a premium for puts versus equivalent calls.","Investors buy put options to bet on\/protect against price downside. Meanwhile, they buy call options to bet on\/protect against price upside.","The Ethereum price looks at risk of a short-term dip back to long-term support around $3,570.","However, the 25% delta skew of ETH options expiring in 180 days remains well above zero.","That’s consistent with the view that, despite short-term dips, Ethereum is likely to continue to rally alongside the broader crypto market.","Moreover, the general consensus remains that it’s a question of when, not if, Ethereum spot ETFs finally get approved.","And all the while, network upgrades are expected to continue to power adoption of the network.",""],"entity":[{"type":"$73,000","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$3,570","content":"MONEY"},{"type":"March 11, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"$4,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"0%","content":"PERCENT"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETH","Ether","Ethereum"],"authors":["Joel Frank"]}