{"summary":"Base Chain Ecosystem Sees 3x Rise In TVL As This New Base Crypto Presale Raises $450,000","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/base-chain-ecosystem-sees-3x-rise-in-tvl-as-this-new-base-crypto-presale-raises-450000.htm","publishDate":"2024-04-09T17:40:16","id":17845,"type":null,"title":"Base Chain Ecosystem Sees 3x Rise In TVL As This New Base Crypto Presale Raises $450,000","category":["Industry Talk "],"content":["Ethereum layer-2 scaling blockchain Base, which was launched by Coinbase last year, is enjoying explosive growth this year amid a meme coin craze, with a new Base crypto presale called Dogeverse recently surging past $450,000 in funds raised.","Since the start of 2024, the value locked (TVL) in Base smart contracts has tripled to $1.775 billion from $518.53 million on December 31, according to DeFi Llama.","The surge in TVL follows explosive growth in Base meme coins like Brett (BRETT) and Degen (DEGEN).","BRETT has amassed a market cap of nearly $700 million, while DEGEN’s market cap is just under $500 million.","The rise in Base meme coins has resulted in an explosion of Base trading activity. In early 2024, the volume on Base was between $20-50 million per day, but it has since exploded to hundreds of millions of dollars per day.","With the stunning rise of the Base chain ecosystem, investors are diving into new Base crypto presales.","One meme coin presale with huge promise is Dogeverse, which has already raised over $450,000, indicating that it could be the next meme coin to explode on the scene.","Dogeverse is attracting hype on social media in the run-up to Doge Day on 20 April, which coincides with the Bitcoin halving.","That’s because Dogeverse isn’t just launching on Base. It’s launching on the six most used blockchains, excluding Bitcoin, with multi-chain bridge capabilities.","There are a host of chains out there vying to be the go-to destination for meme coin launches–but Dogeverse plans to fit the bill by being present on all chains that matter.","Dogeverse is already live on Ethereum, BNB Smart Chain, and Polygon but has Solana, Base, and Avalanche in the works for launch day. This multi-bridge utility is a massive expansion to the power of the Doge universe.","Dogeverse is doing something no other meme coin has attempted. There are multi-chains already, but none are as expansive and interconnected as Dogeverse plans to be.","The new crypto presale Dogeverse is inserting itself into the narrative of the quickly growing opportunity of meme coins being spun up on multiple chains.","Keep in touch with developments on the project’s X\/Twitter and Telegram.","Visit Dogeverse Here",""],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"50 million","content":"MONEY"},{"type":"$518.53 million","content":"MONEY"},{"type":"December 31","content":"DATE"},{"type":"Base","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"$450,000","content":"MONEY"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Dogeverse","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"$1.775 billion","content":"MONEY"},{"type":"Brett (BRETT)","content":"PERSON"},{"type":"$700 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Degen (DEGEN","content":"PERSON"}],"hashtag":["Base","Crypto Presale","Dogeverse"],"authors":["Joel Frank"]}