{"summary":"Instagram Influencer ‘Jay Mazini’ Sentenced to 7 Years in Prison for Multi-Million Dollar Crypto Ponzi Scheme","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/instagram-influencer-jay-mazini-sentenced-to-7-years-in-prison-for-multi-million-dollar-crypto-ponzi-scheme.htm","publishDate":"2024-04-25T12:18:58","id":17844,"type":null,"title":"Instagram Influencer ‘Jay Mazini’ Sentenced to 7 Years in Prison for Multi-Million Dollar Crypto Ponzi Scheme","category":["Altcoin News "],"content":["Instagram influencer Jebara Igbara, known as “Jay Mazini,” has been sentenced to seven years in prison for orchestrating a multi-million dollar crypto Ponzi scheme.","Igbara, a 28-year-old from New Jersey, pleaded guilty to fraud charges, confessing to running a Ponzi scheme that involved cryptocurrency fraud and resulted in approximately $8 million in illicit gains, according to an official press release. ","The money was used to fund an extravagant lifestyle, including luxury cars and excessive gambling.","Taking advantage of the economic turmoil caused by the COVID-19 pandemic, Igbara exploited his connections within the Muslim community to solicit investments for his company, Hallal Capital LLC. ","He claimed that the investments would generate returns through stock trading and the resale of electronics and personal protective equipment. ","“The prosecution of Igbara unmasked him as a fraudster who used his social media popularity to con investors out of millions of dollars,” Breon Peace, the U.S. Attorney for the Eastern District of New York, said. ","“Shamefully, he targeted his own religious community, taking advantage of their trust in him so he could spend and gamble their hard-earned money.”","How it started vs How it’s going pic.twitter.com\/Go8jU0NO3H","— Coffeezilla (@coffeebreak_YT) April 25, 2024","","Igbara bolstered his online persona by building a substantial following of approximately 1 million Instagram users.","He gained popularity by filming cash giveaways, often distributing money to fast food workers and ordinary individuals at Walmart. ","In one video, he even shared the spotlight with rapper 50 Cent. ","His seemingly prosperous lifestyle led viewers to believe that he could afford to give away money, further increasing their trust in him.","In 2020, online investigators began accusing Igbara of fraud, and public sentiment turned against him. ","The situation escalated when he was arrested in 2021 on kidnapping charges, to which he later pleaded guilty. ","Despite facing criticism and legal troubles, some victims of his fraud turned to the FBI for assistance. ","Court documents revealed that at least four individuals reported sending over $100,000 in Bitcoin, expecting cash wire transfers that never materialized. ","One victim claimed to have been scammed out of 50 Bitcoin, as Igbara initially faked a $2.56 million wire transfer and later provided explanations for its failure to arrive.","During his sentencing in a Brooklyn federal court, Igbara expressed remorse to his victims. ","Attorney Jeffrey Lichtman stated that Igbara apologized profusely for his actions. ","In addition to his seven-year fraud sentence, Igbara received a concurrent five-year prison term for the kidnapping charges. ","The sentence includes credit for time served since 2021. ","Furthermore, he was ordered to pay $10 million in restitution to his victims.","As reported, the first quarter of this year has seen $336 million lost to Web3 hackers and fraud, with nearly half of the capital stolen in January alone. ","Nonetheless, the number represents a 23% decrease compared to the first quarter of 2023.","It is also worth noting that $73,885,000 has been recovered from stolen Web3 capital in 7 specific situations."],"entity":[{"type":"Jebara Igbara","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"April 25, 2024","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Breon Peace","content":"PERSON"},{"type":"multi-million dollar","content":"MONEY"},{"type":"Hallal Capital LLC","content":"ORGANIZATION"},{"type":"$2.56 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Jeffrey Lichtman","content":"PERSON"},{"type":"$336 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Jay Mazini","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"January","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"$8 million","content":"MONEY"},{"type":"FBI","content":"ORGANIZATION"},{"type":"first quarter of 2023","content":"DATE"},{"type":"first quarter","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Eastern District of New York","content":"ORGANIZATION"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$73,885,000","content":"MONEY"},{"type":"Igbara","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Scam","crypto scam"],"authors":["Ruholamin Haqshanas"]}