{"summary":"Manchester City Teams Up with Quidd to Launch Digital Collectibles and Fan Experiences","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/manchester-city-quidd-launch-digital-collectibles-fan-experiences.htm","publishDate":"2024-04-25T14:38:32","id":17843,"type":null,"title":"Manchester City Teams Up with Quidd to Launch Digital Collectibles and Fan Experiences","category":["News "],"content":["Manchester City has embarked on a groundbreaking journey into NFTs and digital collectibles through its newly announced partnership with Quidd, a leading digital collectible platform. ","This multi-year collaboration is set to unveil a collection of Manchester City-themed non-fungible token (NFT) trading cards. This exclusive offering is said to immerse fans in a unique and innovative experience with football memorabilia. ","","👀 Big News! @Quidd has officially partnered with @ManCity and the new collection drops on 2 May!","Get ready to collect some of the best players in the game 👉 https:\/\/t.co\/Y3cYAjPHWZ pic.twitter.com\/l9hjBkl1pc","— Quidd👾 (@quidd) April 24, 2024","","Quidd will be the exclusive platform for fans to acquire these one-of-a-kind digital assets, unlocking a host of special benefits, including merchandise, hospitality tickets, and unforgettable experiences, all designed to make our fans feel genuinely valued.","Quidd chief executive Michael Bramlage expresses the significance of the partnership, stating; ","“This partnership signals our intent to revolutionize the world of sport collectibles, so it makes sense for Quidd to align with Manchester City, the most forward-thinking and progressive soccer club on Earth.”","Tom Boyle, Vice-President of global partnerships marketing and operations at City Football Group, expressed his excitement about the collaboration’s potential to transform the traditional football pastime of collecting cards and memorabilia in the fast-growing tech world. ","Boyle added,","“We’re excited to help transform the traditional football pastime of cards and collectibles in a new digital age alongside Quidd, enabling us to further connect with our fans across the globe.”","The partnership’s inaugural offering will feature over 200 bespoke player cards, which will be released on May 2 through the state-of-the-art Quidd marketplace.","To commemorate the launch, the first 10,000 Cityzens, the affectionate term for Manchester City fans, will receive two free packs and exclusive access to additional “For The Fans” packs within 72 hours of release.","Cityzens who unlock digital rewards through the Quidd packs will also have the opportunity to participate in real-world events and purchase opportunities, including official Manchester City merchandise and hospitality tickets, as well as winning “money-can’t-buy experiences,” such as an exclusive opportunity to watch a first team training session at the City Football Academy.","This initiative engages fans in a novel digital collecting experience and rewards their loyalty with exclusive perks and privileges.","This partnership with Quidd marks Manchester City’s latest foray into the NFT space. It builds upon previous initiatives that garnered much attention in the sports or crypto space.","From commemorating historic moments in the club’s illustrious history to celebrating women’s football and empowering fans to participate in exclusive NFT drops, Manchester City continues to push the boundaries of innovation and strategic partnership in the sports industry.","Manchester City has been actively exploring the NFT space, with recent initiatives including the launch of its “Unseen City Shirts” NFT collection on the OKX blockchain on April 22. ","This collection features limited NFTs tied to physical, limited-edition jerseys featuring hand-painted artwork. Moreover, the club partnered with Sony in 2022 to develop a virtual version of Etihad Stadium, making it reportedly the first officially licensed football stadium built in the metaverse.","Furthermore, Quidd’s partnership with Manchester City adds to the club’s impressive roster of global sponsors, including top-line partners such as airline Etihad Airways and sportswear manufacturer Puma. These partnerships have significantly contributed to the club’s record revenue during the 2022–23 Premier League season.","Notably, this collaboration represents Quidd’s second partnership with a professional football team for the release of themed trading cards. Last month, Quidd secured a similar multi-year partnership with Newcastle United, marking the football club’s first venture into digital collectibles. ","Manchester City’s presence in the NFT space is already established, with previous initiatives such as partnering with PUMA to release an NFT drop commemorating the tenth anniversary of its first Premier League triumph and launching the “Same City, Same Passion” NFT collection celebrating women’s football. ","Additionally, OKX is collectively trying to position itself at the forefront of mass adoption. Last year, OKX signed a $70 million deal to become Manchester City’s official sleeve sponsor, which is evidence of this. ","Manchester City also uses all these to position itself at the forefront of innovation, creating new avenues for fan interaction, revenues, and engagement."],"entity":[{"type":"Earth","content":"LOCATION"},{"type":"Newcastle United","content":"ORGANIZATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"May 2","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"April 22","content":"DATE"},{"type":"Etihad Stadium","content":"ORGANIZATION"},{"type":"Tom Boyle","content":"PERSON"},{"type":"Sony","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"Manchester City","content":"ORGANIZATION"},{"type":"Michael Bramlage","content":"PERSON"},{"type":"Manchester City","content":"LOCATION"},{"type":"May!","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Big News!","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"City Football Group","content":"ORGANIZATION"},{"type":"Same City","content":"LOCATION"},{"type":"City Football Academy","content":"ORGANIZATION"},{"type":"Etihad Airways","content":"ORGANIZATION"},{"type":"Puma","content":"ORGANIZATION"},{"type":"PUMA","content":"ORGANIZATION"}],"hashtag":["Manchester City","NFTs","Quidd"],"authors":["Hassan Shittu"]}