{"summary":"Uniswap Integrates Robinhood Connect for Crypto Purchasing","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uniswap-integrates-robinhood-connect-for-crypto-purchasing.htm","publishDate":"2024-05-01T06:07:48","id":17842,"type":null,"title":"Uniswap Integrates Robinhood Connect for Crypto Purchasing","category":["Blockchain News "],"content":["Uniswap has integrated Robinhood Connect to enable crypto purchasing on mobile app.","According to a recent announcement by the decentralized exchange Uniswap, the integration with Robinhood Connect allowed users in the United States to buy cryptocurrencies using funds from their Robinhood accounts, debit cards, or bank transfers.","For first-time Robinhood Connect customers, a special promotion would provide $10 in USDC when they purchase a minimum of $10 of crypto via the Uniswap app. This offer is specifically designed to welcome new users to the platform.","To purchase crypto with Robinhood Connect on the Uniswap mobile app, users first select the buy icon. They then choose the crypto they wish to purchase and enter the amount.","After selecting “Continue,” users would be presented with a list of available providers based on their region, with Robinhood Connect accessible only in the United States.","Users may complete the transaction by selecting Robinhood Connect as their provider to finalize their purchase.","Uniswap Labs also raised its trading fees to 0.25% from 0.15%. This increase applied to most transactions on the mainnet and Layer 2 networks, though swaps involving stablecoins and transactions between Ethereum and Wrapped Ethereum were exempt.","To avoid higher fees, users could use alternative interfaces to access the Uniswap protocol and complete the transactions.","Meanwhile, Uniswap faced heightened regulatory scrutiny. The company’s founder Hayden Adams announced the receipt of a Wells Notice from the SEC, suggesting possible legal action for operating as an unlicensed exchange.","Adams clarified that Uniswap Labs primarily serves as a software development shop and plays a central role in the ongoing development of the Uniswap protocol.","In March 2024, the community voted against a governance proposal designed to alter the platform’s fee structure, which would have enabled revenue sharing among UNI token holders.","The proposal sought to empower the decentralized autonomous organization (DAO) to adjust the fee mechanism, paving the way for the potential activation of the long-awaited “fee-switch” feature."],"entity":[{"type":"Robinhood Connect","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"$10","content":"MONEY"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Hayden Adams","content":"PERSON"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"March 2024","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"0.15%","content":"PERCENT"},{"type":"United States","content":"LOCATION"}],"hashtag":["Robinhood","Uniswap"],"authors":["Hongji Feng"]}