{"summary":"Ripple Partners with HashKey DX to Introduce XRPL-Based Solutions in Japan through SBI Group","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ripple-partners-with-hashkey-dx-to-introduce-xrpl-based-solutions-in-japan-through-sbi-group.htm","publishDate":"2024-04-30T13:35:17","id":17847,"type":null,"title":"Ripple Partners with HashKey DX to Introduce XRPL-Based Solutions in Japan through SBI Group","category":["Blockchain News "],"content":["Ripple’s XRPL-based enterprise solutions announced today their strategic partnership set to significantly impact Japan following a strategic collaboration with HashKey DX, a Tokyo-based consulting firm. ","This partnership aims to introduce cutting-edge blockchain-powered supply chain finance solutions to the Japanese market, leveraging the robust capabilities of the XRP Ledger (XRPL). HashKey Group, known for its successful blockchain-enabled supply chain finance solutions in mainland China, brings a wealth of experience.","","We’re excited to announce a partnership between @Ripple, @HashKeyGroup, and SBI Group ushering in #XRPL-powered solutions, starting with supply chain finance, to Japan's enterprise landscape. 🇯🇵","Learn more about this innovative partnership: https:\/\/t.co\/GFUNdu1ci2","— Ripple (@Ripple) April 30, 2024","","With over 4,000 registered companies, including 23 banks and 4,300 suppliers, utilizing its platform, HashKey DX is well-positioned to extend its reach to Japanese businesses. HashKey Group’s solutions currently facilitate more than $7 billion in trade, with financing transactions nearing $3 billion.","Andy Dan, CEO of HashKey DX, expressed confidence in XRPL’s ability to drive meaningful transformation in Japan’s market. He said,","“The XRPL was the ideal blockchain infrastructure for us to build our proven supply chain finance solution, with its proven enterprise track record and unmatched performance metrics, including rapid settlement speeds, low costs, and scalability, and we are confident in our ability to drive meaningful transformation and introduce innovative, cutting-edge solutions for businesses in Japan.”","The collaboration also involves SBI Group, a prominent player in Japan’s financial sector. SBI Group companies will be among the first to leverage XRPL-powered supply chain finance solutions. This collaboration marks a significant milestone in Ripple’s expansion into Japan.","With HashKey DX and SBI Group on board, Ripple aims to explore additional enterprise blockchain use cases, leveraging XRPL’s capabilities to drive innovation and efficiency across various sectors.","Japan’s financial market has historically been receptive to digital assets and cryptocurrencies. Recent developments include the Government Pension Investment Fund (GPIF) announcing plans to explore various investment opportunities, including Bitcoin, gold, forests, and farmland. This favorable environment creates a conducive landscape for Ripple’s XRPL solutions to gain traction.","Notably, traditional finance players increasingly embrace blockchain networks like XRPL, Stellar, and Ethereum to bring financial assets on-chain and address pain points in various value chains. Advanced conversations with financial institutions are ongoing, and tokenization projects are being explored to issue assets on the XRP ledger.","Ripple is set to enter the stablecoin market with its USD-pegged stablecoin, slated for release later this year. The stablecoin, fully collateralized by US dollar deposits and short-term US government treasuries, aims to provide stability and reliability to users. Ripple plans to ensure transparency and accountability by subjecting its reserve assets to regular audits by a third-party accounting firm, with monthly attestations published for public scrutiny.","Brad Garlinghouse, CEO of Ripple, also recently projected a substantial growth trajectory for the cryptocurrency market, envisioning its market capitalization surpassing $5 trillion by the end of the year. In an interview with CNBC, Garlinghouse attributed this anticipated surge to various macroeconomic factors. The factors include the launch of US spot Bitcoin exchange-traded funds (ETFs) and the upcoming Bitcoin halving event.","Currently, the combined market capitalization of the crypto market stands at $2.7 trillion, with Bitcoin’s price hovering around $70,000. Garlinghouse’s forecast implies a potential doubling of the market cap, culminating in a total valuation of $5.2 trillion.","Notably, Ripple has recently taken a decisive stance against the SEC’s insistence on imposing $2 billion in penalties, filing an opposition motion that contests the regulatory body’s proposed exorbitant fines. The detailed motion, released publicly by Ripple’s defense attorney, James Filan, rebuts the SEC’s penalties as excessively punitive, advocating for a far more modest $10 million penalty."],"entity":[{"type":"Tokyo","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"$5 trillion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$2.7 trillion","content":"MONEY"},{"type":"Garlinghouse","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Andy Dan","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"SBI Group","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"$5.2 trillion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"HashKey Group","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"},{"type":"James Filan","content":"PERSON"}],"hashtag":["HashKey","Ripple","SBI Group"],"authors":["Hassan Shittu"]}