{"summary":"Crypto.com, PayPal and Paxos Partner for PayPal USD Integration – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cryptocom-paypal-paxos-partner-for-paypal-usd-integration-heres-what-you-need-know.htm","publishDate":"2023-09-28T09:55:00","id":17859,"type":null,"title":"Crypto.com, PayPal and Paxos Partner for PayPal USD Integration – Here’s What You Need to Know","category":["Blockchain News "],"content":["Payments and cryptocurrency exchange Crypto.com is integrating PayPal USD (PYUSD) establishing it as a ‘preferred’ exchange for the stablecoin.","The exchange announced Thursday, a partnership with payments giant PayPal and blockchain infrastructure company Paxos to further “the global adoption of crypto,” Crypto.com CEO Kris Marszalek said in a post.","Thrilled to partner on driving the global adoption of crypto together with @PayPal & @Paxos 🤝 https:\/\/t.co\/Hjf9AhbUeg","Crypto.com announced in August that it has listed PYUSD for both retail and institutional users. The stablecoin is an ERC-20 token issued by Paxos Trust Company on the Ethereum blockchain network. It is backed by U.S. dollar deposits, short-term U.S. Treasury bonds, and other cash equivalents.","The exchange confirmed Thursday that the platform asserts “deepest liquidity” for PYUSD trading pairs globally.","“Connecting our more than 80 million users to the latest crypto innovations, as well as supporting PayPal’s global network of consumers and merchants, will be pivotal in our continued pursuit of crypto to every wallet,” Joe Anzures, global head of payment partnerships at Crypto.com, said.","The announcement noted that the strategic collaboration builds on the initial integrations between PayPal and Crypto.com, including enabling the use of PayPal to top up Crypto.com Visa Cards.","“Moving forward, PayPal and Crypto.com will continue to explore bringing more connected top up and commerce capabilities to market in the future.”","Along with Crypto.com, PayPal’s stablecoin is also available on a few other selected exchanges, including Bitstamp, Coinbase, and Kraken. The payments behemoth recently announced that its peer-to-peer mobile payments platform Venmo has begun rolling out PYUSD to selected users, starting September 20.","Following the launch of PYUSD in August, several criticisms spurred across the crypto ecosystem, noting that there was a lack of demand from crypto users for the stablecoin.","A recent report from blockchain analytics platform Nansen suggested that PayPal USD is facing challenges in gaining traction, pointing out that roughly 90% of PYUSD tokens are currently held in stablecoin issuer Paxos Trust’s wallets. Parallelly, the uptake among “smart money” investors – well-informed or professional investors – were fairly negligible."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Crypto.com Visa Cards","content":"ORGANIZATION"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Joe Anzures","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"20","content":"DATE"},{"type":"Nansen","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"September 20","content":"DATE"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["Crypto.com","PayPal","Stablecoin"],"authors":["Sujha Sundararajan"]}