{"summary":"Bitfinex’s Tokenized Bond Falls Short of Investment Target, Raises Only $1.5M of Expected $10M","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitfinexs-tokenized-bond-falls-short-of-investment-target-raises-only-1-5m-of-expected-10m.htm","publishDate":"2023-11-29T06:04:55","id":17857,"type":null,"title":"Bitfinex’s Tokenized Bond Falls Short of Investment Target, Raises Only $1.5M of Expected $10M","category":["Altcoin News "],"content":["Bitfinex’s recently-launched tokenized bond have fallen short of expectations, raising only $1.5 million of its initial target of $10 million.","Bitfinex Securities, the branch responsible for listing tokenized real-world assets, introduced the ALT2611 Tokenized Bond in October, with the product going live on November 15. ","However, after a two-week offer period, the official website reported that only $1.5 million had been raised, representing a mere 15% of the target.","ALT2611 is a 36-month bond denominated in USDT (Tether) and issued by Alternative, a securitization fund based in Luxembourg and managed by Mikro Kapital. ","Bitfinex launched the bond through its platform called ALT2611 Tokenized Bond, and was touted as a groundbreaking opportunity for capital raises.","“We always knew it would take time for products that are inherently more stable and less speculative than crypto altcoins to gain market share in a crypto industry that is heavily focused on quick gains,” Paolo Ardoino, Chief Technology Officer at Bitfinex, said in a comment to Cryptonews.com.","“But we also know that such an approach is not sustainable. Security tokens will be the future of capital raising for real world assets. At Bitfinex we are not worried about hard work, education and pursuing a long term strategy. Looking at this from a short term perspective is myopic.”","Tokenized bonds like ALT2611 are digital representations of traditional bonds issued on the blockchain, offering advantages such as liquidity, accessibility, security, transparency, and round-the-clock trading.","The minimum initial purchase size for the ALT2611 bond was set at 125,000 USDT, with subsequent trading available in denominations of 100 USDT.","It is important to note that the bond is not available to American citizens or individuals present in the United States.","The underwhelming response to Bitfinex’s tokenized bond has garnered criticism from the crypto community. ","Novacula Occami, a prominent crypto trader, remarked, “Bitfinex’s first USDT bond issue is a flop,” suggesting that the USDT stablecoin is unlikely to dominate capital markets.","Meanwhile, Bitfinex’s first USDT bond issue is a flop. After a 15 day offer period only $1.5mm of $10mm was raised. Sorry Paolo, USDT ain’t going to dominate capital markets. BitFinex Securities Kazakhstan isn’t keeping investment bankers up at night. https:\/\/t.co\/RsIhxAdIiI pic.twitter.com\/yNJzJsf9ux","— Novacula Occami (@OccamiCrypto) November 28, 2023","","Bitfinex had high hopes for the tokenized bond, with Paolo Ardoino, the Chief Technology Officer of Tether, labeling it as a “new era for capital raises” that would establish USDT as the underlying denomination asset in the emerging financial system. ","The bond was issued on the Liquid Network, a Bitcoin sidechain known for its high throughput capabilities.","Bitfinex Securities obtained a Digital Asset Service Provider license in El Salvador earlier this year, a country that has been exploring the issuance of its own Bitcoin bonds. ","El Salvador’s sovereign dollar bonds have been performing well, delivering a 70% return in 2023.","Tether and Bitfinex have agreed to settle their dispute regarding a Freedom of Information Law (FOIL) request filed by a group of journalists, including Zeke Faux from Bloomberg Businessweek. ","While Tether and Bitfinex have emphasized their commitment to transparency, they clarified that this does not mean a complete release of all their documents. ","The companies stated that a wholesale release of all their documents would not align with standard business practices. ","Tether’s USDT is currently the largest stablecoin in the world, with a value of approximately $88.5 billion. ","Tether Limited is owned by the Hong Kong-based company iFinex, which also owns the Bitfinex cryptocurrency exchange."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"$1.5","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"El Salvador","content":"LOCATION"},{"type":"Mikro Kapital","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"November 28, 2023","content":"DATE"},{"type":"November 15","content":"DATE"},{"type":"Bloomberg Businessweek","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Bitfinex Securities","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Digital Asset Service","content":"ORGANIZATION"},{"type":"Securities Kazakhstan","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$88.5 billion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["Bitfinex"],"authors":["Ruholamin Haqshanas"]}