{"summary":"Stablecoin issuer Tether has revealed a breakdown of its reserves, providing specific percentages for each category.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104780\/tether-usdt-reserves-breakdown-first-time-since-launch","publishDate":"2021-05-13T08:00:09","id":1786,"type":null,"title":"Tether reveals a breakdown of its reserves for first time since 2014 launch","category":["TETHER"],"content":["Stablecoin issuer Tether, for the first time since its launch in 2014, has revealed a breakdown of its reserves.","The breakdown, shared with The Block on Thursday, is dated as of March 31, 2021. It shows that Tether held nearly 76% of its reserves in cash and cash equivalents and other short-term deposits and commercial paper.","Commercial paper, in fact, formed the majority of its cash and cash equivalents category, with a 65% share. Fiduciary deposits formed 24% of the category, reverse repo notes 3.60%, treasury bills about 3%, and actual cash only 3.87%.","","","When asked why actual cash formed only a tiny part of the total reserves, Tether's general counsel Stuart Hoegner told The Block that it is \"misleading to focus exclusively on cash\" within the cash and cash equivalents category. \"Readers should not confuse items not in 'actual cash' with a lack of liquidity,\" he said.","As for commercial paper details, Hoegner declined to share the names of counterparties \"in line with standard commercial practice.\"","The rest of the reserves were divided across three categories: Secured loans — of which none is to affiliated entities — forming 12.55% of the total reserves; corporate bonds, funds, and precious metals forming nearly 10% and other investments, including digital tokens, comprising 1.64%.","The secured loans are issued by Tether, Hoegner told The Block. As for the bonds, funds, and precious metals category, he declined to share further details, and as for digital tokens, Hoegner said that refers exclusively to bitcoin.","\"We have seen BTC become an important component of the balance sheets of several large corporations in both the public and private markets. This serves to diversify risk,\" Hoegner told The Block. \"Tether's use of BTC and other forms of investment is in line with this practice.\"","Tether's market cap as of March 31 was $42.35 billion, according to data compiled by The Block.","When Tether launched, it originally claimed each tether (USDT) was backed 1:1 with US dollars. In March 2019, it updated its website to state that \"all Tether tokens are backed 100% by Tether's reserves.\" It later created a <a href=\"https:\/\/wallet.tether.to\/transparency?__cf_chl_jschl_tk__=156c564356f4cd3616e1c09c698603a6fabc93da-1620905339-0-ARKDPhmkyNAIYxmE79B372NE-BH6ZykC1hfmpDAyYCfUgMHVpAVntaoMrLc8iuAN3LL0oJxovs5-cMtdX4-K3l3-03MILCNGaVSoa84NLQ3d_drZf7gG7v5k1K3UDq_PKY7f5aKlK1kvpiWmTWUDqDvIX0bfyDklh7sRrTxpd3xgcvhTq_h6HqhQJDedmsbn7Fbwgz6LcSnVJGwS7en6RGJ2EcjgOp1JNNephOcyVIwWmWJ2h4ZBp2HabEg8iOJce4IYptbWBrx9f10RjpgSg64G2aIVsK9FkNhvfNgs-ZbqlM6bpif8rpt46epWuppusdZCsqfNpj0SZlOiMkEipUR0vvKTrpPWo-XtNj5sc9z23QG2UwB6DHYGvt3z7s2eH23y1tpunIj-RNAa7hcDxJ-OLo8e5pspgzVgdnB6GRMr\" data-v-f87c67ca=\"\">transparency page<\/a> outlining the company's assets and liabilities measured in three currencies and gold. But until now, it had not given a detailed breakdown of these reserves.","The breakdown of Tether's reserves comes nearly three months after the company <a href=\"https:\/\/www.theblockcrypto.com\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">settled with the New York Attorney General's office<\/a> with an $18.5 million fine.","\"Tether proposed ongoing publication of the reserve breakdown as part of our settlement agreement with the New York Attorney General's Office, and we committed to make that information available to both the Attorney General's office and the public,\" said Hoegner. \"Today's publication reflects our ongoing dedication to transparency and setting the standard in our industry.\"","Tether's usage has surged in recent months. Its current market capitalization stands at nearly $58 billion, according to data compiled by The Block.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Last week, Tether's adjusted on-chain volume <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103901\/tether-usdt-stablecoin-on-chain-volume-1-trillion-first-time\" data-v-f87c67ca=\"\">surpassed the $1 trillion mark<\/a> on a yearly basis for the first time. On-chain transaction volume is any value transfer within a blockchain network, including buys, sells, and remittances.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"$1 trillion mark","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"76%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"3.87%","content":"PERCENT"},{"type":"$18.5 million","content":"MONEY"},{"type":"US dollars","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Tether","content":"ORGANIZATION"},{"type":"1.64%","content":"PERCENT"},{"type":"March 2019","content":"DATE"},{"type":"3.60%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"12.55%","content":"PERCENT"},{"type":"New York Attorney General's Office","content":"ORGANIZATION"},{"type":"Stuart Hoegner","content":"PERSON"},{"type":"March 31","content":"DATE"},{"type":"$42.35 billion","content":"MONEY"},{"type":"24%","content":"PERCENT"},{"type":"March 31, 2021","content":"DATE"},{"type":"Hoegner","content":"PERSON"},{"type":"$58 billion","content":"MONEY"}],"hashtag":["BITCOIN","TETHER"],"authors":["Yogita Khatri","The Block"]}