{"summary":"Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: Reuters","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mango-markets-hacker-guilty-in-110m-theft-faces-20-years.htm","publishDate":"2024-04-19T18:40:29","id":17860,"type":null,"title":"Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: Reuters","category":["Blockchain News "],"content":["The Mango Markets hacker, Avraham Eisenberg, was found guilty on Thursday in a Manhattan federal court for orchestrating a scheme that resulted in the theft of approximately $110 million from the Solana-based DeFi platform.","Prosecutors argued that Eisenberg orchestrated a complex exploit on the platform, leading to substantial financial losses. Eisenberg, who has been in custody since January 2023, could face a maximum sentence of 20 years in prison.","As reported by Reuters, On April 18, a federal jury in New York found Eisenberg guilty of commodities fraud, commodities manipulation, and wire fraud in connection with the exploit, which involved manipulating Mango Markets’ native token, $MNGO.","The decision followed hours of deliberations after closing arguments on April 17.","Trader convicted of Mango Markets fraud in first US crypto manipulation case https:\/\/t.co\/6nBaMGNZGQ pic.twitter.com\/ywsFEj73B8","— Reuters (@Reuters) April 19, 2024","","The trial began on April 9 and lasted a little over a week. Eisenberg was arrested in December 2022 in Puerto Rico.","During the closing arguments on April 17, Eisenberg’s legal team contended that he had not committed any criminal acts but rather orchestrated a “successful and legal trading strategy,” resulting in approximately $110 million in gains.","In contrast, prosecutors argued that Eisenberg “had to lie” to facilitate the withdrawal of funds from Mango Markets, suggesting fraudulent intent.","Eisenberg's lawyer: Ladies and gentlemen, Avraham Eisenberg did not commit any crimes. He engaged in a successful and legal trading strategy. He put his own money at risk. They talked about a con man. But you know that's not the case","— Inner City Press (@innercitypress) April 17, 2024","","Eisenberg’s lawyer, Brian Klein, asserted that his client fully adhered to Mango Markets’ smart contracts and withdrew his capital without borrowing.","Additionally, Eisenberg returned $67 million worth of cryptocurrency to Mango Markets following the exploit, claiming he had legally obtained the remainder of the funds.","Klein expressed disappointment at the verdict but affirmed their intention to continue fighting for their client.","“We’re obviously disappointed, but we will keep fighting for our client,” he stated, indicating plans to file post-trial motions.","On October 11, 2022, Mango Markets was the victim of an attack in which approximately $110 million was drained from its treasury. ","Shortly after the attack, Avraham Eisenberg came forward as the perpetrator, asserting that the exploit was merely a “highly profitable trading strategy” and claiming it was conducted within the bounds of legality and the protocol’s intended design.","According to prosecutors, Eisenberg utilized two accounts to engage in manipulative trading involving futures contracts tied to the values of Mango’s token MNGO and the stablecoin USD Coin.","These trades purportedly inflated the value of his contracts by 1,300% within 20 minutes, allowing him to borrow against his holdings and withdraw $110 million in various cryptocurrencies.","Subsequently, Eisenberg agreed to return $67 million in exchange for other token holders refraining from pursuing legal action or freezing his assets.","He was arrested on December 26, 2022, in San Juan, Puerto Rico, where he resided, and has remained in custody since then, deemed a flight risk by prosecutors.","NEWS: Today, the CFTC charged Avraham Eisenberg with a manipulative and deceptive scheme to misappropriate more than $110 million from Mango Markets, a digital asset exchange. Read the details: https:\/\/t.co\/Rj5FKu5hgn","— CFTC (@CFTC) January 10, 2023","","On January 9, the Commodity Futures Trading Commission (CFTC) supplemented the FBI’s charges, levying two counts of market manipulation against Eisenberg.","The legal ramifications continued to mount for Eisenberg as the U.S. Securities and Exchange Commission (SEC) filed charges on January 20, alleging violations of anti-fraud and market manipulation provisions of U.S. securities laws.","A lawsuit filed by Mango Labs characterized Eisenberg as a “notorious online personality” with a history of attacking multiple cryptocurrency platforms and manipulating cryptocurrency markets.","Eisenberg’s scheduled July 29 sentencing carries a potential maximum sentence of 20 years in prison, although the actual sentence is expected to be less severe.","This verdict comes shortly after the sentencing of Sam Bankman-Fried, founder of the now-defunct FTX cryptocurrency exchange, to 25 years in prison for embezzling $8 billion from customers, highlighting increasing scrutiny and enforcement within the cryptocurrency industry."],"entity":[{"type":"January 10, 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Today","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"$MNGO","content":"MONEY"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"April 17, 2024","content":"DATE"},{"type":"April 19, 2024","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Klein","content":"PERSON"},{"type":"Mango Labs","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"},{"type":"December 26, 2022","content":"DATE"},{"type":"1,300%","content":"PERCENT"},{"type":"January 20","content":"DATE"},{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"October 11, 2022","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"$67 million","content":"MONEY"},{"type":"January 9","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"April 18","content":"DATE"},{"type":"San Juan","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"April 17","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"July 29","content":"DATE"},{"type":"April 9","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Brian Klein","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["DeFi","Defi Hack","Mango Market"],"authors":["Hassan Shittu"]}