{"summary":"UK Watchdog Clarifies Rules for Memes and Finfluencers in Social Media Promotions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-fca-issues-rules-memes-finfluencers-social-media-promotions.htm","publishDate":"2024-03-28T07:36:27","id":17872,"type":null,"title":"UK Watchdog Clarifies Rules for Memes and Finfluencers in Social Media Promotions","category":["Altcoin News "],"content":["The UK’s Financial Conduct Authority (FCA) on Tuesday issued new guidelines for financial services promotions on social media. These apply to formats like memes, reels, and gaming streams, highlighting the need for fairness and avoiding any misleading information.","In a press release, the regulator said that companies are responsible for all their promotional content, including that created by influencers.","Promoting a financial product without the requisite authorization from a duly qualified FCA-authorized person constitutes a potential criminal offense, it warned.","“Consumers need to be alert to dubious adverts and scams online, but it is important that influencers ensure they’re on the right side of the rules and consider what would happen to their own reputations if they’re found to promote products illegally,” the watchdog said.","Whether it’s a meme, reel or TikTok, firms are responsible for all their promotions, even if they’re working with influencers. Read more about our new finalised guidance on financial promotions on social media: https:\/\/t.co\/N6ipxZ34Rp #FinancialPromotions #FinancialServices pic.twitter.com\/vjfn2evrHP","— Financial Conduct Authority (@TheFCA) March 26, 2024","","“Promotions aren’t just about the likes, they’re about the law,” said Lucy Castledine, director of consumer investments at the FCA. “We will take action against those touting financial products illegally.”","The financial regulator has intensified its oversight of financial promotions. Last year, it removed a higher number of misleading advertisements compared to 2022.","This increased scrutiny follows the implementation of stricter rules for advertising high-risk investments, including crypto. In July 2023, the FCA issued specific guidelines on how companies must disclose information about crypto-related products across various online platforms.","The regulations extend to crypto businesses operating internationally, provided their advertising reaches UK residents. Non-compliance can lead to severe penalties, including imprisonment for up to two years and potentially unlimited fines.","Further, the FCA recently outlined plans to strengthen its ability to identify and address crypto market abuse over the next year. Its business plan prioritizes consumer protection and market integrity. It also aims to foster international competitiveness within the financial sector.","This initiative comes as the UK establishes itself as a major player in the global crypto space. FCA research indicates a doubling of digital asset ownership within the country between 2021 and 2022.","The watchdog has faced challenges in enforcing its crypto advertising regulations. Despite issuing guidance and removing a significant number of non-compliant ads (450 alerts issued in 2023 alone), it acknowledged persistent violations by some in the industry.","Still, it remains committed to upholding regulatory compliance will continue taking action against those who breach the rules."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"March 26, 2024","content":"DATE"},{"type":"Lucy Castledine","content":"PERSON"},{"type":"July 2023","content":"DATE"},{"type":"UK’s Financial Conduct Authority (FCA","content":"ORGANIZATION"}],"hashtag":["advertising","Financial Conduct Authority","UK"],"authors":["Shalini Nagarajan"]}