{"summary":"Andreessen Horowitz Supports Crypto Startup EigenLayer With $100 Million Investment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/andreessen-horowitz-supports-crypto-startup-eigenlayer-with-100-million-investment.htm","publishDate":"2024-02-22T15:07:44","id":17878,"type":null,"title":"Andreessen Horowitz Supports Crypto Startup EigenLayer With $100 Million Investment","category":["Blockchain News "],"content":["Venture Capital firm Andreessen Horowitz has invested $100 million in crypto restating startup EigenLayer after its latest funding round.","A new Bloomberg report shows the company backed the startup with a $100 million investment as it gains popularity with its restaking model.","Venture firm Andreessen Horowitz invested $100 million in crypto startup EigenLayer, suggesting that some of the industry’s top backers are still betting on blockchain https:\/\/t.co\/IphqmLd9br","— Bloomberg (@business) February 22, 2024","","EigenLayer’s retaking plan allows Ethereum stakers to earn more yield by providing security to other projects with the same ETH  stake. Essentially, it is a reuse of ETH stakes for multiple platforms on the network.","The platform has gained traction this year from digital asset users and, more recently, from institutions following this funding round. Sreeram Kanaan, a former associate professor at the University of Washington and the founder of the company in a recent interview summarized the model of the company.","“The idea is that when you stake on Ethereum, you are promising that you’re going to run the Ethereum network nodes correctly,” Kannan said in an interview.","“With restaking, you are taking the same Ether and making additional promises that you will also validate other networks correctly.”","Kanaan revealed that the agreement will be disclosed on Thursday adding that the firm raised $50 million in March but did not disclose the valuation of the company.","Although the company runs on a points system for users who restake building community integration, he added that there are currently no plans to launch a native EigenLayer token.","Similarly, Ali Yahya, a partner at Andreessen Horowitz, hailed EigenLayer’s importance in the market. According to him, users will gain rewards from staking assets on new services on EigenLayer.","“It will enable all sorts of new kinds of applications to be built. People will stake capital to gain rewards from new services that get spun up on top of EigenLayer.”  ","Yahya added that though there are no plans for an EigenLayer token yet, there could be other methods of monetization, including a traditional business model. On regulation, Kanaan suggests the model isn’t included in the Securities and Exchange Commission’s (SEC) staking regulatory scrutiny.","He stressed that the firm primarily offers a market for users looking to restake, not the initial staking process that is under the regulator’s view. Finally, he added that the SEC, and specifically Gary Gensler, would greatly like them if he understood what they are building.","Over the years, Andreessen Horowitz has been a significant investor in multiple crypto startups, raising $4.5 billion in funding for firms in 2022.","A report by PitchBook shows VC investments in crypto startups grew 2.5% in Q4 2023, the first uptick since Q2 2022. In 2022, broader macroeconomic factors and industry-wide collapses led to reduced investor sentiment, triggering lower asset prices.","This led to reduced VC funding, weakened markets, and miner downturns, as most companies recorded losses.","However, the recent surge in the market on the heels of a spot ETF approval by the SEC led to increased investor appetite and more project funding."],"entity":[{"type":"Kanaan","content":"PERSON"},{"type":"Ali Yahya","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"PitchBook","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"February 22, 2024","content":"DATE"},{"type":"Kannan","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"University of Washington","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Sreeram Kanaan","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Andreessen","eigenlayer","funding"],"authors":["David Pokima"]}