{"summary":"El Salvador Launches Bitcoin Treasury Website For its $360 Million BTC Reserves","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/el-salvador-bitcoin-treasury-website-for-360-million-btc-reserves.htm","publishDate":"2024-05-13T14:07:18","id":17876,"type":null,"title":"El Salvador Launches Bitcoin Treasury Website For its $360 Million BTC Reserves","category":["Bitcoin News "],"content":["El Salvador, renowned for its move to adopt Bitcoin as legal tender in September 2021, has now introduced a cutting-edge online platform for tracking the country’s Bitcoin Treasury.","The initiative, spearheaded by The Bitcoin Office, a Salvadoran government agency dedicated to overseeing Bitcoin-related projects, aims to offer public access to data on the country’s BTC investments through a specialized mempool.","","El Salvador now has its own @mempool space where anyone can check out our #bitcoin treasury holdings.","See details in the next post. pic.twitter.com\/PEpVemHoFO","— The Bitcoin Office (@bitcoinofficesv) May 12, 2024","","The official announcement from the Bitcoin Office stated,","“EL SALVADOR NOW HAS ITS @MEMPOOL WHERE ANYONE CAN CHECK OUR BITCOIN TREASURY HOLDINGS.”","The introduction of this platform signifies a significant step towards enhancing the financial transparency of government operations in El Salvador. The newly launched website, akin to a mempool, offers public access to data regarding El Salvador’s BTC investments.","According to the website, the country holds 5,748.76 BTC, valued at over $352.8 million. The platform also reveals that the Salvadoran government acquired an additional 31 BTC in the past month and 7 BTC in the previous week.","The recent addition to its BTC reserves aligns with President Nayib Bukele’s visionary strategy, announced in November 2022, in which El Salvador aims to accumulate “1 bitcoin per day.” By actively increasing its Bitcoin reserves, El Salvador continues to position itself as a leader in Bitcoin and blockchain technology.","With the launch of this new website, El Salvador continues to lead the way in embracing Bitcoin and blockchain technology. Some proponents speculate that these strategic initiatives could position El Salvador as one of the wealthiest and most innovative nations globally within the next few decades, fueled by Bitcoin adoption.","El Salvador made headlines in September 2021 by becoming the first country to adopt Bitcoin as legal tender. The move aimed to foster financial inclusion, streamline remittance payments, and promote financial innovation.","President Nayib Bukele’s decision faced criticism, particularly after Bitcoin’s price plunged from its all-time high of $69,000 in November 2021. Despite volatility, El Salvador has remained steadfast in its Bitcoin strategy, dollar-cost-averaging into the cryptocurrency since 2021, with an average buying price of $43,097 per BTC.","With Bitcoin currently trading above $62,000, El Salvador’s holdings have yielded an unrealized profit exceeding $57.4 million, per the Nayib Bukele Portfolio Tracker website.","In a recent commentary, Bukele, who secured reelection in February, has aimed at mainstream media narratives surrounding the government’s economic policies. He criticized the media’s focus on El Salvador’s Bitcoin holdings, highlighting the contrast in coverage between periods of low and high Bitcoin market prices.","Bukele emphasized the significant increase in Bitcoin’s market value, suggesting that if El Salvador were to sell its holdings now, it would realize a profit of over 40%. He reiterated the government’s stance of holding onto Bitcoin, emphasizing that “1 BTC = 1 BTC” regardless of market fluctuations. Bukele pointed out the silence of media critics who previously highlighted potential losses during lower Bitcoin prices.","Despite the attention garnered by El Salvador’s embrace of Bitcoin, it stands as a singular example among nation-states in adopting a “Bitcoin standard.” While rumors circulate about other countries potentially following suit, no official announcements have been made.","However, there are speculations that if Bitcoin reaches $100,000, El Salvador could pay off its loans to the International Monetary Fund, paving the way for financial independence."],"entity":[{"type":"The Bitcoin Office","content":"ORGANIZATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"$43,097","content":"MONEY"},{"type":"September 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bukele","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"May 12, 2024","content":"DATE"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"Nayib Bukele Portfolio Tracker website","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Bitcoin Treasury","content":"ORGANIZATION"},{"type":"El Salvador’s BTC","content":"ORGANIZATION"},{"type":"$57.4 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$352.8 million","content":"MONEY"},{"type":"Bitcoin Office","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"$62,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Treasury","El Salvador","Nayib Bukele"],"authors":["Hassan Shittu"]}