{"summary":"Fraud Victims Call on China to Assist in Recovering $4.3B Bitcoin Seized by UK Police","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fraud-victims-call-on-china-to-recover-bitcoin-seized-by-uk.htm","publishDate":"2024-04-12T16:45:06","id":17886,"type":null,"title":"Fraud Victims Call on China to Assist in Recovering $4.3B Bitcoin Seized by UK Police","category":["Blockchain News "],"content":["The victims of an investment fraud scheme have called on China to negotiate with the UK government to recover 61,000 Bitcoin seized in a money laundering investigation, valued at $4.3 billion at the time of publication.","This Bitcoin is the result of a $6.2 Billion wealth management fraud conducted between 2014 and 2017, fronted by Chinese company Tianjin Lantian Gerui Electronic Technology.","In which, more than 128,000 people were defrauded.","The UK government became aware of the situation after ex-restaurant worker Jian Wen attempted to launder funds by purchasing a $30 million property with Bitcoin.","However, the transaction could not be completed since Wen was unable to explain the source of the funds.","","This prompted an investigation, which culminated in a raid on a property rented by “front person” Wen and her boss Zhimin Qian, the suspected mastermind of the operation. During the raid, investigators seized 61,000 Bitcoins, worth $1.7 billion at the time.","Under pressure to explain the damning situation, Wen initially claimed that Bitcoin was mined.","She eventually changed her story, stating it was a “love present” from Qian, who fled the country after the raid.","Jian Wen was ultimately put on trial for assisting Qian in converting Bitcoin into cash, jewellery, and property.","While Wen denied all charges, Southwark Crown Court convicted her guilty of three counts of money laundering on March 20th.","Following the conviction, a group representing the scam victims set out to reclaim the Bitcoin purchased with their money, now worth $4.3 billion.","The group reportedly submitted a letter to China’s Ministry of Foreign Affairs, urging them to negotiate with the UK government for the return of the “huge amount” of seized Bitcoin. ","They also contacted China’s Ministry of Public Security, claiming to have the backing of almost 2,500 signatures from the victims, and want to submit them to both ministries.","The letter requests that the Chinese government and the UK judicial departments work together to submit evidence proving their status as “legitimate owners.” The group said:","“We do not want, and will never accept, a situation where Bitcoins are confiscated by the UK and not returned to us.”","At the time of writing, the UK government had not issued a statement on how it intends to deal with the Bitcoin it holds, and Qian is still at large.","However, if the UK government evaluates that no one else was entitled to the asset, it would typically be divided and distributed to the police and Home Office.","However, the victims who “suffered extremely serious economic losses, resulting in family breakdown, separation from their children, indebtedness, and no money for medical treatment,” have not gone without aid.","Four victims who lost money in the scam claim that, since last May, victims who enrolled with Chinese police have received two pay-outs from a task group on the fraud, headed by Tianjin authorities.","They stated that 8% and 5% of their investment capital had been returned with assets recovered from Lantian Gerui and its former employees. ","Additionally, a local branch of the Industrial and Commercial Bank of China, the country’s largest lender, has committed to assisting with the return process and has estimated that 207,000 people invested in the fraudulent scheme."],"entity":[{"type":"2014","content":"DATE"},{"type":"China’s Ministry of Public Security","content":"ORGANIZATION"},{"type":"March 20th","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"$6.2 Billion","content":"MONEY"},{"type":"last May","content":"DATE"},{"type":"Tianjin","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"Zhimin Qian","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Lantian Gerui","content":"PERSON"},{"type":"China’s Ministry of Foreign Affairs","content":"ORGANIZATION"},{"type":"Bitcoins","content":"PERSON"},{"type":"Tianjin Lantian Gerui Electronic Technology","content":"ORGANIZATION"},{"type":"Home Office","content":"ORGANIZATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Southwark Crown Court","content":"ORGANIZATION"},{"type":"the Industrial and Commercial Bank of China","content":"ORGANIZATION"},{"type":"Jian Wen","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","China","UK"],"authors":["Harvey Hunter"]}