{"summary":"Chinese Authority Warns of Fake Digital Yuan App Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chinese-authority-warns-of-fake-digital-yuan-app-scam.htm","publishDate":"2024-02-26T07:34:10","id":17882,"type":null,"title":"Chinese Authority Warns of Fake Digital Yuan App Scam","category":["Blockchain News "],"content":["The Chinese Ministry of Industry and Information Technology (MIIT) has issued a warning about new fraudulent schemes involving counterfeit digital yuan applications.","According to a recent social media post by the MIIT, these fake apps are designed to look like the official digital yuan platform, deceiving users into downloading and interacting with them by offering various “promotions.”","The counterfeit app, named “Digital Yuan Test Version,” has a logo similar to the official app’s and a slightly different user interface. However, one can differentiate the forged from the authentic by checking its package name, the version, or the MD5 message-digest algorithm.","For example, the official app’ package name is cn.gov.pbc.dcep, while the “Test Version” excludes the governmental elements and presents as com.ecny.ecny2.","With the logo, UI, and slogans comparable to the original, the fake apps often resemble pyramid schemes and claim to offer “dividends” for the users that share the software. The scammers misused the e-CNY promotions and simulated “national welfare” distributions.","After users are lured to download the forged apps, they would be required to fill out detailed personal information for the “eligibility verification,” creating a false sense of legal compliance.","The apps may even ask if the users have previously participated in similar programs and received funds in digital yuan, intentionally extending the waiting period to bait the trap.","Eventually, the fake apps have customer service pages set up for the users while they may find no deposits in their wallets or fail to withdraw the “funds” sent by the scammers.","To resolve the “technical issue,” the users must download messaging apps other than the commonly used ones and fall into the quagmire. The “customer service” would end up asking for money instead of giving out the “welfare.”","Though users can avoid such scams by only downloading apps from the verified platforms, criminal activities still increased as popularity of China’s central bank digital currency (CBDC) grew.","In January, the Yangpu District People’s Court of Shanghai issued the verdict for the first instance of money laundering using digital yuan and cryptocurrency. In the meantime, China is looking to deploy more real-world e-CNY applications."],"entity":[{"type":"the Yangpu District People’s Court of Shanghai","content":"ORGANIZATION"},{"type":"Chinese Ministry of Industry and Information Technology (MIIT","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["CBDC","China","Digital Yuan"],"authors":["Hongji Feng"]}