{"summary":"Defiance ETFs Files For 2X Leveraged ETH Futures ETF","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/defiance-etfs-eth-futures-etf.htm","publishDate":"2024-04-09T18:32:32","id":17885,"type":null,"title":"Defiance ETFs Files For 2X Leveraged ETH Futures ETF","category":["Ethereum News "],"content":["Defiance ETFs applied for yet another leveraged crypto ETF on Monday – this time centered around Ethereum (ETH), rather than Bitcoin (BTC).","Per a Monday filing with the U.S. Securities and Exchange Commission (SEC), the Defiance 2X Ether Strategy ETF is an ETH Futures ETF that seeks to double the daily performance of the rolling CME Ether Futures Index. That means exaggerated gains on Ether’s strong days, but pronounced losses during selloffs.","“Because the Fund seeks daily leveraged investment results, it is very different from most other exchange-traded funds,” reads the fund’s prospectus. “It is also riskier than alternatives that do not use leverage.”","Defiance ETFs just filed for a 2x leveraged #ethereum futures ETF. Will potentially trade under the ticker $ETHL pic.twitter.com\/9Z6M6tcQ3V","— James Seyffart (@JSeyff) April 8, 2024","","Leveraged ETFs are risky not only because of their volatility but also because they naturally underperform against the assets they track over longer periods. Defiance noted that its fund will lose money if Ether futures trade flat or even if they modestly rise over a period longer than a day.","“The Fund is not intended to be used by, and is not appropriate for, investors who do not intend to actively monitor and manage their portfolios,” the company wrote.","Earlier this week, Defiance also filed for its 2X Short MSTR ETF – a leveraged short play on the Bitcoin development company MicroStrategy, which investors say is a leveraged play on Bitcoin (BTC). Blockstream CEO Adam Back blasted the ETF as a “terrible product” that would get investors “rekt.”","On Tuesday, ProShares followed Defiance with filings for its own 2X and -2X spot Ether ETFs.","The filing comes after the SEC approved Ether futures ETFs for public trading in October. Roughly a dozen asset managers flooded the SEC’s mailbox with applications after the agency approved the first 2X Bitcoin futures ETF from Volatility Shares in late June.","That fund – which trades under the ticker BITX—is up 91% year to date, compared to Bitcoin’s 55% gains.","The logic was that if the SEC was willing to approve such a risky product, it may finally be open to Ether futures ETFs – the second largest crypto which historically had higher beta than BTC.","Though the first Ether ETFs pulled mediocre volume next to their Bitcoin counterparts, their approval signaled a potential change in how the SEC might treat crypto ETFs going forward. Three months later, Bitcoin spot ETFs hit the market, pulling $12.3 billion in net inflows since going live.","Investors now wait for the SEC to approve the ETH spot ETFs, though experts doubt they’ll be approved soon."],"entity":[{"type":"James Seyffart","content":"PERSON"},{"type":"91%","content":"PERCENT"},{"type":"Volatility Shares","content":"ORGANIZATION"},{"type":"$12.3 billion","content":"MONEY"},{"type":"$ETHL","content":"MONEY"},{"type":"April 8, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"late June","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Adam Back","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Defiance","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Ethereum","Ethereum ETF"],"authors":["Andrew Throuvalas"]}