{"summary":"Solana Meme Coins Outperform SOL Price, Slothana Presale Raises $10 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-meme-coins-outperform-sol-price-slothana-presale-raises-10-million.htm","publishDate":"2024-04-08T13:16:54","id":17893,"type":null,"title":"Solana Meme Coins Outperform SOL Price, Slothana Presale Raises $10 Million","category":["Industry Talk "],"content":["Solana meme coins are posting some of the chunkiest gains in today’s market-wide rally, according to data by CoinGecko.","For context, crypto is broadly rallying today as market leaders Bitcoin (BTC) and Ethereum (ETH) both posted respective gains of around 4% and 7% over the last 24 hours.","On the other hand, Solana has only added about 1.7% to its value overnight. In the last hour, SOL has fallen 0.4% to $183 and is currently getting outpaced by virtually all the leading meme coins on Solana.","In the top spot, DogWifHat (WIF) is up 15% overnight to change hands at $4.09.","The other leading Solana meme coins posted intraday gains of around 5%, including Bonk (BONK), BOOK OF MEME (MEME), and Jeo Boden (BODEN).","","Among the ten largest Solana meme coins by market capitalization, the biggest grower was Popcat’s POPCAT token, which ballooned 36% to trade at $0.3245 at the time of writing. ","This makes the Solana meme coin category one of the most successful classes of cryptocurrency today. More established\/larger market cap projects like Dogecoin (DOGE), Shiba Inu (SHIB), FLOKI (FLOKI) and PEPE (PEPE) all posted more sober overnight gains of around 10% or lower.","Over on SOL’s trading chart, the candles indicate fairly typical price movements for any cryptocurrency in the last three months. Prices climbed sharp and volatile in the first half of March and crossed the $200 threshold both in the middle of the month and on the first of April.","With a Solana gold rush likely imminent, keen-eyed meme coin traders are looking at the hottest new projects to support from the start.","Slothana, the new red-eyed sloth who lives on Slothana, has raised an eye-watering $10 million barely two weeks into an ongoing ICO for his new SLOTH token.","It seems investors are scrambling to try and recapture some of the early upside potentials of established Solana funny tokens like Slerfs, DogWifHat and Bonk.","Slothana’s persona is simple: he’s a lazy critter who lives and works on the blockchain.","But with his permanently hazed red eyes, he can’t hide the fact that he really doesn’t want to work; he’s eyeing the clock because he wants to go from 420 to $420 million.","Behold! 🌟 Slothana, the prophesied lord and saviour of crypto, has risen today with a divine purpose: to bestow gains and lambos upon the worthy. Rejoice as he blesses you all with his benevolence, and bask in the glory that is our Lord Slothana. 🦥💰 #CryptoSavior #Slothana pic.twitter.com\/ppagkKJPkx","— Slothana (@SlothanaCoin) April 4, 2024","","Word on the grapevine is Slothana is by the same team that launched Smog (SMOG), which rallied strongly after ending its presale and listing.","Details are scarce at present, but interested investors can join the presale by sending SOL to this address: EnSawje2vQSQKtGbPYdXEuYKm2sHgeLKJTqCmrDErKEA","Buy Slothana Here",""],"entity":[{"type":"SOL","content":"ORGANIZATION"},{"type":"$420 million","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"April 4, 2024","content":"DATE"},{"type":"Bonk","content":"LOCATION"},{"type":"Slothana","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"the first half of March","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$183","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"1.7%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"Jeo Boden (BODEN","content":"PERSON"},{"type":"Slothana","content":"LOCATION"},{"type":"0.4%","content":"PERCENT"},{"type":"$0.3245","content":"MONEY"},{"type":"36%","content":"PERCENT"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$4.09","content":"MONEY"}],"hashtag":["Meme Coins","slothana","Solana"],"authors":["Tim Hakki"]}