{"summary":"B2C2 is now officially registered with Luxembourg’s financial regulator and will start providing OTC deals on the local market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276332\/b2c2-expands-to-luxembourg-with-local-vasp-registration","publishDate":"2024-02-07T03:00:04","id":1789,"type":null,"title":"B2C2 expands to Luxembourg with local VASP registration","category":["FINANCE FIRMS"],"content":["<span data-v-f87c67ca=\"\">B2C2, a major crypto trading firm based in the UK, announced it's expanding into Luxembourg by acquiring a local virtual asset registration.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">B2C2 has become the 12th officially licensed crypto firm in the country, according to the <\/span><a href=\"https:\/\/edesk.apps.cssf.lu\/search-entities\/search?&amp;st=advanced&amp;entType=VAP\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\"> of the Commission de Surveillance du Secteur Financier register. It joins Bitstamp, PayPal, Zodia Custody and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The registration will allow B2C2 to offer over-the-counter spot crypto trading to institutional clients and work with local crypto services and traditional financial institutions, the company said in a press release on Wednesday. As a part of its expansion in Europe, B2C2 recently acquired French crypto liquidity provider Woorton.<\/span>","<span data-v-f87c67ca=\"\">The Luxembourg branch will be led by Denzel Walters, previously business manager in B2C2’s London office, the firm said. Before B2C2, Walters had worked at the Bank of England, the Prudential Regulatory Authority and Optima Partners.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In line with our operations in the UK, US and Asia-Pacific, our office in Luxembourg will remain committed to providing unparalleled liquidity and exceptional service to our clients,” Walters said in his statement.<\/span>","<span data-v-f87c67ca=\"\">\"As B2C2 prepares for MiCA regulation to come to force, obtaining VASP registration in Luxembourg is a further milestone for B2C2, as Luxembourg is home to a rapidly expanding virtual asset community,” B2C2 CEO Thomas Restout said.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Optima Partners","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Walters","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Prudential Regulatory Authority","content":"ORGANIZATION"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"Pacific","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Thomas Restout","content":"PERSON"},{"type":"Denzel Walters","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Commission de Surveillance du Secteur Financier","content":"ORGANIZATION"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":[],"authors":["Anna Baydakova","The Block"]}