{"summary":"The Monetary Authority of Singapore (MAS), the country&#x27;s central bank, is ready to integrate its blockchain-based payment network with commercial applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71351\/singapore-central-banks-blockchain-payment-network-is-ready-for-commercial-adoption","publishDate":"2020-07-13T07:45:30","id":179,"type":null,"title":"Singapore central bank&#x27;s blockchain payment network is ready for &#x27;commercial adoption&#x27;","category":["LAYER 1S"],"content":["The Monetary Authority of Singapore (MAS), the country's central bank, is ready to integrate its blockchain-based payment network with commercial applications.","The central bank has <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2020\/project-ubin-fifth-and-final-phase-highlights-commercial-potential-paving-way-towards-live-adoption\" data-v-f87c67ca=\"\">completed<\/a> its fifth and final phase of <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/MAS\/ProjectUbin\/Project-Ubin-Phase-5-Enabling-Broad-Ecosystem-Opportunities.pdf?la=en&amp;hash=91091CAD39265C03FF7A4253E70FBEE6D1177714\" data-v-f87c67ca=\"\">Project Ubin<\/a>, which started in 2016, to explore the use of blockchain technology in clearing and settlement of payments and securities.","Now that the project's experimentation stage is over, it is ready for \"commercial adoption,\" said Sopnendu Mohanty, chief fintech officer of the central bank. \"Following the successful experimentation over five phases, we look forward to greater adoption and live deployment of blockchain technology.\"","The first two phases of Project Ubin focused on building technology capabilities in the context of a domestic payments network. The next two phases focused on the interoperability of blockchain-based networks for Delivery-versus-Payment (DvP) and cross-border Payment-versus-Payment (PvP). These four phases proved the technical viability of the project. Hence, the final phase focused on proving value, including how to improve settlement efficiencies, and it went successful.","\"The multi-currency payments network prototype developed under Project Ubin Phase 5 successfully settled payments in different currencies on the same network,\" said the central bank. \"An international settlement network, modelled after this payments network prototype, could enable faster and cheaper transactions than conventional cross-border payments channels.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">JPMorgan tech&nbsp;<\/strong><\/span>","The prototype has been developed in collaboration with Temasek, an investment firm owned by the government of Singapore, and JPMorgan. It uses JP Morgan's Quorum blockchain protocol as the base infrastructure, and interacts with its Interbank Information Network (IIN) and JPM Coin.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Accenture, which was commissioned to publish the <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/MAS\/ProjectUbin\/Project-Ubin-Phase-5-Enabling-Broad-Ecosystem-Opportunities.pdf?la=en&amp;hash=91091CAD39265C03FF7A4253E70FBEE6D1177714\" data-v-f87c67ca=\"\">report of the fifth phase<\/a>, examined several use cases across industries and selected 16 projects that could benefit from integrating with the Ubin payments network. These use cases were broadly categorized into four areas: Capital markets, trade and supply chain finance, insurance, and beyond financial services.","The selected projects were 1exchange, iSTOX, STACS, iLex &amp; IHS Markit, Allinfra and Sygnum (for capital markets); Digital Ventures (Siam Cement), Invictus, Marco Polo, essDOCS and Crediti (for trade and supply chain finance); Digital Asset and Immediate (for insurance); and Aqilliz for advertising and Octomate + Adecco for salary payments.","\"It is unclear at this stage which of the projects will be successful, or whether there will be a second wave of projects that could capture the market better due to improvements in technology or other business factors,\" said the central bank.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Invictus","content":"LOCATION"},{"type":"Octomate + Adecco","content":"ORGANIZATION"},{"type":"Marco Polo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"iLex &amp; IHS Markit","content":"ORGANIZATION"},{"type":"Digital Ventures (Siam Cement)","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Allinfra","content":"PERSON"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Interbank Information Network","content":"ORGANIZATION"},{"type":"Sopnendu Mohanty","content":"PERSON"}],"hashtag":["JPMORGAN"],"authors":["Yogita Khatri","The Block"]}