{"summary":"Decentraland’s Virtual World Makes History by Streaming SpaceX Launch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/decentraland-s-virtual-world-makes-history-by-streaming-spac-6699.htm","publishDate":"2020-06-01T11:59:00","id":17915,"type":null,"title":"Decentraland’s Virtual World Makes History by Streaming SpaceX Launch","category":["Blockchain News "],"content":["In addition to being the first commercial human space mission, SpaceX’s latest launch of its Falcon 9 rocket with a manned Crew Dragon space capsule also made history in the virtual world this weekend as it was streamed live for players inside crypto’s best-known virtual reality game.","A SpaceX Falcon 9 rocket carrying the company’s Crew Dragon spacecraft is launched from Launch Complex 39A on NASA’s SpaceX Demo-2 mission to the International Space Station. Source: NASA","Starting at 18:00 UTC time on Saturday, the live stream was shown inside of “Genesis Plaza” in the virtual world created by Decentraland (MANA), where players could join in to watch the historic event unfold.","The team behind Decentraland first notified users that it would live stream the launch with a tweet posted earlier the same day, before the game developers at Decentral Games later shared a video of the event with their followers on Twitter:","@SpaceX launch in @decentraland Genesis Plaza! pic.twitter.com\/qqc8udYMFk","Woahhh we watched the @SpaceX launch in @decentraland and then moments after the #Decentraland team launched their own rocket!😱#SpaceX #SpaceForce #NASA @elonmusk pic.twitter.com\/WBJAHl4QEo","Decentraland is a virtual reality platform built on Ethereum (ETH) that lets users buy plots of land and construct buildings inside of its virtual world, as well as create, experience and monetize content and applications using the platform’s token MANA.","In addition to being shown live for players on Decentraland, the SpaceX launch was also viewed by more than 17 million people on NASA’s own YouTube channel, which provided extensive live coverage of the historic event.","However, the space launch was not the first time Decentraland has offered live events inside of its virtual world. Back in March this year, the game platform also hosted the annual Coinfest Conference on its platform, which made the move to the virtual world thanks to the COVID-19 lockdowns across the world.","Originally launched through an initial coin offering (ICO) in 2017, Decentraland’s virtual world officially opened in February this year, after years of development. As of now, however, the platform has over 12,000 users and comprises 90,000 parcels of virtual land that players can buy and sell.","At pixel time (11:50 UTC), MANA trades at USD 0.04 and is down by 3% in a day, trimming its weekly gains to 5%. The price is up by 10.5% in a month and down by 34% in a year.\n____","Learn more: \nVR and Crypto – a Match Made In Reality"],"entity":[{"type":"Coinfest Conference","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"weekend","content":"DATE"},{"type":"Decentral Games","content":"ORGANIZATION"},{"type":"10.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"34%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"February this year","content":"DATE"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"NASA","content":"ORGANIZATION"},{"type":"Dragon","content":"ORGANIZATION"},{"type":"MANA)","content":"PERSON"},{"type":"Decentraland","content":"LOCATION"},{"type":"International Space Station","content":"ORGANIZATION"},{"type":"March this year","content":"DATE"},{"type":"Saturday","content":"DATE"}],"hashtag":["Adoption","Blockchain","Gaming"],"authors":["Fredrik Vold"]}