{"summary":"Ripple CEO Brad Garlinghouse laid out his answers to what he felt were “five key questions” surrounding Ripple’s ongoing case with the Securities and Exchange Commission.\nThat included a comment about pursuing the possibility of settlement with a new administration.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90437\/ripple-ceo-garlinghouse-questions-sec-lawsuit-twitter","publishDate":"2021-01-07T16:47:27","id":1792,"type":null,"title":"Ripple CEO Brad Garlinghouse responds to questions surrounding the SEC&#x27;s lawsuit","category":["Legal"],"content":["Ripple CEO Brad Garlinghouse says the firm tried to settle with the Securities and Exchange Commission (SEC) and plans to continue settlement discussions into the new administration.","In&nbsp;<a href=\"https:\/\/twitter.com\/bgarlinghouse\/status\/1347275356638638080?s=20\" data-v-f87c67ca=\"\">threads of tweets<\/a>&nbsp;on Thursday, the CEO and his general counsel Stuart Alderoty addressed questions surrounding the SEC's unregistered securities <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">lawsuit<\/a>&nbsp;filed against the firm last month.","Both said things are happening behind the scenes, and that Ripple and those named in the suit are moving forward even if they've been relatively silent.&nbsp;","\"Our full legal team will announce themselves shortly and we'll be filing our initial response to the SEC's unproven allegations within weeks,\" said Alderoty in a tweet.","\"No one is being silent, nor will we give up this fight,\" wrote Garlinghouse in his thread.","In his thread, Garlinghouse responded to what he felt were five key questions related to the case, touching on the lack of settlement and whether Ripple paid entities to list and use XRP. On the first count, Garlinghouse indicated that Ripple is still pursuing the settlement route.","\"Can't get into specifics, but know we tried — and will continue to try with the new administration — to resolve this in a way so the XRP community can continue innovating, consumers are protected and orderly markets are preserved,\" he tweeted.","As for exchanges, he did not clarify whether or not Ripple incentivized venues to list XRP,&nbsp; but said because XRP is decentralized, Ripple has no power over which venues list or delist the asset. In the days since the SEC suit was made public, many venues have halted transactions or delisted XRP.","On the consumer side, he said Ripple lawfully incentivized some customers and first movers to use the network, which according to Garlinghouse is \"building a payments network 101.\"","Garlinghouse also touched on the recent <a href=\"https:\/\/www.theblockcrypto.com\/post\/90135\/ripple-series-c-lead-investor-tetragon-sues-the-company\" data-v-f87c67ca=\"\">lawsuit<\/a> from Ripple investor Tetragon, which led the firm's Series C round. Tetragon has filed to require Ripple to redeem its Series C preferred stock.&nbsp;","\"We're disappointed that Tetragon (who owns 1.5% of Ripple) is seeking to unfairly advantage itself through the SEC's allegations,\" said Garlinghouse.","Meanwhile, the SEC's case against Ripple will move forward in February, when both parties meet for a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89634\/sec-ripple-case-initial-pretrial-conference-february-22-xrp\" data-v-f87c67ca=\"\">pretrial conference<\/a> on Feb. 22. Their joint letter describing the facts of the case is due Feb. 15.&nbsp;","&nbsp;"],"hashtag":["XRP"]}