{"summary":"UK FCA Dedicated 30% of Financial Crime Personnel to Monitor Crypto Companies in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-fca-allocates-30-to-crypto-oversight-in-2023.htm","publishDate":"2024-05-02T06:03:31","id":17923,"type":null,"title":"UK FCA Dedicated 30% of Financial Crime Personnel to Monitor Crypto Companies in 2023","category":["News "],"content":["The UK’s financial watchdog dedicated nearly a third (30%) of its financial crime specialists to overseeing crypto asset businesses in 2023, according to a report released on May 1.","The Financial Conduct Authority (FCA) said it conducted risk assessments across various sectors and identified retail banking, wholesale banking, wealth management, and crypto-asset firms as especially susceptible to financial crime in 2023. These sectors were deemed the most at risk of being misused for money laundering activities.","In its fight against financial crime, the FCA’s team of specialists conducted a significant number of reviews. This included 231 in-depth analyses (desk-based reviews) and seven on-site visits. Additionally, other supervisory teams within the FCA identified 375 potential cases, with 95 specifically linked to crypto assets.","Also, the regulator extended a key survey – called REP CRIM – to crypto businesses in April 2022. This comprehensive survey gathers information on anti-money laundering (AML) controls implemented by these firms.","Data obtained through REP-CRIM, along with other intelligence reports, allows the regulator to pinpoint risks more effectively and tailor their supervisory actions accordingly.","Since Jan. 2020, the FCA has been the AML watchdog for UK crypto businesses like exchanges and custodians. It implemented a rigorous evaluation process for new registrations, uncovering major shortcomings in firms’ anti-money laundering controls. This resulted in many applications being withdrawn, rejected, or refused by the FCA.","The FCA’s March business plan highlights its commitment to consumer protection and ensuring a fair crypto market. This includes a focus on strengthening its ability to identify and address crypto market abuse over the next year. Additionally, the FCA aims to promote a competitive UK financial sector within the global landscape.","Since intensifying its oversight of financial promotions, the watchdog removed a higher number of misleading advertisements last year compared to 2022.","This increased scrutiny follows stricter advertising rules for high-risk investments, implemented in July 2023. These rules include specific guidelines for companies to disclose critical information about crypto products across various online platforms.","Further tightening its grip, the FCA issued new guidelines in March this year, targeting financial promotions on social media. This applies to formats like memes, reels, and even gaming streams. The focus is on ensuring fair and accurate information, with no room for misleading content."],"entity":[{"type":"May 1","content":"DATE"},{"type":"March","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Jan. 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"CRIM","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"July 2023","content":"DATE"},{"type":"March this year","content":"DATE"}],"hashtag":["FCA","UK"],"authors":["Shalini Nagarajan"]}