{"summary":"Move Over, Jack Dorsey – Elon Musk Is Crypto’s New Superstar","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/move-over-jack-dorsey-elon-musk-is-crypto-s-new-superstar-3631.htm","publishDate":"2019-04-03T08:49:20","id":17930,"type":null,"title":"Move Over, Jack Dorsey – Elon Musk Is Crypto’s New Superstar","category":["Altcoin News "],"content":["The cryptoverse just got a new superhero, and it’s Elon Musk, founder of space exploration company SpaceX and electric car manufacturer Tesla, among others. Musk is now openly showing his support for so-called joke cryptocurrency Dogecoin, which grew much larger than anyone had initially expected, and the team behind the coin bestowed the honorary title “CEO of Dogecoin” upon him – at least for a while.","The star entrepreneur seems to be swayed by the perks of cryptocurrencies: only a year ago, he was saying that he owned “zero cryptocurrency” after his persona was copied to fake accounts which tried to scam people out of money. He’s been taking a more favorable stance towards crypto in the coming months, and he notably said that “the Bitcoin structure is quite brilliant” and crypto is a far better way to transfer value.","Two days ago, presumably as part of an April Fools joke, Dogecoin’s official Twitter account started a poll: “We have listened to your concerns. We have decided that Dogecoin does need a CEO. Someone who can lead us into the future while maintaining the core values of what we are. Below are the candidates, vote wisely.” Among the options were smart contract platform Ethereum co-founder Vitalik Buterin, cryptocurrency Litecoin founder Charlie Lee, Marshall Hayes, CEO and co-founder of payments processing platform Metal, and Musk himself.","As Musk took the majority of the votes, people brought the tweet to his attention, to which he replied, “Dogecoin might be my fav cryptocurrency. It’s pretty cool,” which, expectedly, generated a lot of hype in the community. Dogecoin’s official Twitter account immediately replied, “Looks like you’re the CEO now [Elon Musk], DM us where to email the access codes :-D”","Musk’s position as CEO lasted just long enough for him to potentially update his CV with the new experience, which is to say, around half an hour. Right now, the bio on his official account reads “former CEO of Dogecoin,” so the position seems to be vacant again. If you’re looking for a new job, maybe think about applying – but being a tech superhero with multiple groundbreaking projects will probably help more than any college degree.","As of the time of writing, Dogecoin is trading at USD 0.003140, having jumped by 24.5% in the past 24 hours with USD 79 million in daily trading volume. DOGE price is also up by almost 60% in the past month.","DOGE price chart:","_____","Still, while this has moved Twitter CEO Jack Dorsey slightly into the background, it can safely be assumed that this is not where Dorsey intends to stay. After all, his endeavors in boosting crypto adoption still speak for themselves. The cryptoverse still loves you, Dorsey. Don’t leave us."],"entity":[{"type":"USD 79 million","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"Charlie Lee","content":"PERSON"},{"type":"Tesla","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Elon Musk]","content":"ORGANIZATION"},{"type":"Marshall Hayes","content":"PERSON"},{"type":"Elon Musk","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"24.5%","content":"PERCENT"},{"type":"April","content":"DATE"}],"hashtag":["Community","Dogecoin","Elon Musk"],"authors":["Sead Fadilpašić"]}