{"summary":"Litecoin Price Prediction as LTC Rallies 5% in a Week – Where is LTC Heading Now?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/litecoin-price-prediction-as-ltc-rallies-5-week-where-ltc-heading-now.htm","publishDate":"2023-06-05T17:59:00","id":17937,"type":null,"title":"Litecoin Price Prediction as LTC Rallies 5% in a Week – Where is LTC Heading Now?","category":["Altcoin News "],"content":["Litecoin (LTC) has seen a sharp intraday drop in tandem with the broader cryptocurrency market on Monday, with sell pressure triggered by news that the SEC is suing Binance, Binance.US and the exchange’s founder Changpeng Zhou (CZ) over offering unregistered securities to the general public in the US, as well as a host of other charges.","LTC, the cryptocurrency that powers the payments-focused Litecoin blockchain, was last changing hands in the $88 area, down close to 7% on the day.","While still trading substantially lower on the day and now around 10% lower versus weekend highs in the $97s per token, Litecoin has seen a decent 5% bounce from its intra-day lows in the $83s.","Buyers appear to have been waiting to pounce when LTC retested its 200-Day Moving Average around $85.","While the SEC named a number of major blue-chip cryptocurrencies as securities in its latest lawsuit against Binance, including heavy hitters like BNB, Cardano (ADA), Solana (SOL) and Polygon (MATIC), it did not mention Litecoin.","Despite its big drop on Monday, Litecoin is still looking bullish on the charts and, as such, price predictions remain bullish.","The strong rebound from the 200DMA is a good sign, and Litecoin continues to trade strongly above its uptrend from the November 2022 lows.","Continued optimism ahead of the August halving, which will see the LTC inflation rate half, is likely to keep buyers eager.","And with the cryptocurrency currently still in the process of carving out a bullish ascending triangle pattern, a run higher into the mid-$100s sometime later this year remains a strong likelihood.","While Litecoin could be a fantastic investment for those willing to hold it for a few years, investors should always be on the lookout to diversify their crypto holdings.","One high-risk-high-reward investment strategy that some investors might want to consider is getting involved in crypto presales.","This is where investors buy the tokens of up-start crypto projects to help fund their development.","These tokens are nearly always sold very cheap and there is a long history of presales delivering huge exponential gains to early investors.","Many of these projects have fantastic teams behind them and a great vision to deliver a revolutionary crypto application\/platform.","If an investor can identify such projects, the risk\/reward of their presale investment is very good.","The team at Cryptonews spends a lot of time combing through presale projects to help investors out.","One such project that the team has identified as having a very strong potential is yPredict.","A ground-breaking new AI-powered crypto trading and market intelligence platform called yPredict is building a first-of-its-kind, institutional-grade crypto price prediction system.","🚀Our incredible team at @ypredict_ai is working tirelessly to revolutionize the world of crypto predictions. Stay tuned for groundbreaking updates and cutting-edge features that will empower you to make informed investment decisions. Get ready to predict, prosper, and join the… pic.twitter.com\/32TxlHoBy0","According to observers, the tool, which is powered by yPredict’s in-house deep data analysis, will help crypto investors discover the next explosive crypto with ease.","The best part, yPredict’s crypto price prediction system will remain free and open for all users to access – the price predictions will be made publicly available and require no login to see, the project’s Whitepaper explains.","But yPredict offers investors much more than just crypto price predictions.","The project is “building a cutting-edge crypto research and trading platform that provides traders and investors access to dozens of AI-powered signals, breakouts, pattern recognition, and social\/news sentiment features”, the start-up says in its Litepaper.","The platform’s technology was designed using state-of-art predictive models and data insights built by top 1% AI developers and quants.","Meanwhile, “the ypredict.ai marketplace will enable experts to earn recurring revenue by offering their model predictions or data research as trading signals, which traders and investors can subscribe to”.","To fund the development of its revolutionary AI-powered crypto trading and market intelligence platform, yPredict is running a presale of the native $YPRED token that will power its platform.","The presale is absolutely flying and just hit the massive $2 million milestone.","The project’s presale is in its sixth stage, with $YPRED tokens selling for $0.09.","However, there’s still plenty of upside for new investors, as the token will list across major exchanges for $0.12 later this year, for paper gains of 33%.","But the pace at which yPredict’s $YPRED token continues to fly off the shelves means that investors need to be careful not to miss out before the presale sells out.","yPredict has a presale hard cap of $6.5 million, which could be hit in a couple of weeks if the presale continues to gain pace like it has in recent days.","The 33% gains that investors who get in now can secure could pale in comparison with the upside $YPRED could enjoy in the long run.","Buy yPredict Here"],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$0.12","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$100s","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"MATIC)","content":"PERSON"},{"type":"$83s","content":"MONEY"},{"type":"$85","content":"MONEY"},{"type":"$88","content":"MONEY"},{"type":"$97s","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"$2 million","content":"MONEY"},{"type":"$YPRED","content":"MONEY"},{"type":"33%","content":"PERCENT"},{"type":"$6.5 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Litecoin","content":"PERSON"},{"type":"$0.09","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"LTC","content":"ORGANIZATION"}],"hashtag":["Crypto Presale","Litecoin","Price Prediction","YPRED","yPredict"],"authors":["Joel Frank"]}