{"summary":"New Initiative Rewards Artists For Bitcoin Street Art","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-initiative-rewards-artists-for-bitcoin-street-art-7847.htm","publishDate":"2020-09-29T19:00:00","id":17948,"type":null,"title":"New Initiative Rewards Artists For Bitcoin Street Art","category":["Bitcoin News "],"content":["The Bitcoin Awareness Game is the latest initiative to foster increased use of cryptocurrency-related street art worldwide, with artists rewarded with satoshis (sats, smallest units of bitcoin) from sharing their contributions to spreading the crypto message. (Updated on September 30, 13:30 UTC. Updates are in bold.)","The Munich-based collective Ideas Are Like Flames is behind the game, and they have a dedicated account that is used to share the art pieces that have begun to flourish around the world in a bid to promote the cryptocurrency. Artists paint graffiti, make stickers, posters, murals, and also share other forms of artwork.","The Bitcoin Awareness Game encourages crypto aficionados to spread the collective’s messages on stickers which are available in 19 designs. They can be purchased or downloaded from the group’s website which also includes the initiative’s manifesto.","According to the collective,","“Most people haven’t heard of Bitcoin and most of those who once did either think it’s dead, for criminals, will never work or [ENTER MISCONCEPTION OF YOUR CHOICE]. When these misconceptions come up, there’s no Bitcoin spokesperson to refute them. There’s only knowledgable Bitcoiners to set the record straight.”","Though the collective started the project with discussions with local Bitcoiners, and those they knew in other countries, their Telegram channel now has contributors from across the world, said for Cryptonews.com Pretyflaco, the person who initiated the project in 2016, still contributing to it on a regular basis, adding: “As a collective, ideasarelikeflames is open to like minded Bitcoiners and their ideas on how to spread the word about Bitcoin. Any person, who wants to contribute to this particular cause in creative ways is welcome.”","Per the manifesto, the group printed the designs and started offering them in their shop at the beginning of June 2020. “In a short period of time,” it said, “Bitcoiners from all around the world purchased sticker packs and started to send photos of stickers they applied in public places. Coincidentally, at the same time the Twitter account Bitcoin Street Art started to tweet out crowdsourced photos of Bitcoin themed graffiti, stencils and stickers and we submitted some photos of our designs that had been sent to us.”","In the beginning of the initiative, the group pledged to pay out 615 sats (USD 0.066) from its own assets for every photo of a Bitcoin sticker up to a total of 615,000 sats (USD 66). However, the initiative’s popularity pushed the Bitcoin Awareness Game to boost the available bounty.","According to the website, more than 1.4 million satoshis have been awarded to contributors from various countries that include the US, Germany, New Zealand, and Romania, among others.","","Pretyflaco told Cryptonews.com that to date, 1.6m satoshis have been paid out. These payouts are crowdfunded by Bitcoiners. “It’s not really a donation in a charitable sense, rather a quid pro quo,” said the initiator, adding that, by chipping in some Satoshis, what Bitcoiners are doing is “buying awareness for Bitcoin – as they are directly incentivizing the creation of Bitcoin Street Art.”","Pretyflaco said that,","“Currently, there are a little over 1.7 Million Satoshis in the bounty pool. It’s amazing and overwhelming how much Bitcoin street art and awareness has already been created at such a small cost. This is only possible due to Bitcoin, the technology that comes with it and the many amazing Bitcoiners around the globe. A great project such as this one is facilitated by smart people and sound money.”","Participants in the initiative can secure their rewards in satoshis through microlancer.io, or BTCStreetArt’s Telegram channel.","The current payout for one-time contributions is 2,100 satoshis on Microlancer, said Pretyflaco, while for regular or multiple contributions, they pay out 615 satoshis on their Telegram Bot. The recently launched bot version comes with options to submit a photo, get stickers, donate to bounty pool, and apply for bounty.","While many of the featured messages are designed to propagate bitcoin in English, numerous street artists opt for transmitting their crypto messages in languages such as German, Spanish and Portuguese, among others, often directing the ire of their criticism against the world’s financial establishment. The initiative now extends well beyond the Western hemisphere, with crypto artwork blooming in Lahore in Pakistan, and in Russia’s Sankt Petersburg.","","Though it’s not possible to know with certainty where the contributors are located, Pretyflaco said that have received pictures from 27 countries across the world, with only Australia and Antarctica yet to submit.","“All contributors of the Bitcoin Awareness Game are happy with the results so far,” said Pretyflaco for Cryptonews.com. “It shouldn’t go unmentioned that they are extremely motivated to push the game further. There is no shortage of incredible ideas and enormous skill to execute. Therefore, I believe that I can say this with confidence: There is a lot more to come. The number of contributors is growing constantly and several exciting projects are in preparation,” Pretyflaco concluded by saying.","Check out the collective’s video:",""],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"June 2020","content":"DATE"},{"type":"Pakistan","content":"LOCATION"},{"type":"Bitcoiners","content":"PERSON"},{"type":"Satoshis","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Antarctica","content":"LOCATION"},{"type":"September 30","content":"DATE"},{"type":"Lahore","content":"LOCATION"},{"type":"Munich","content":"LOCATION"},{"type":"Romania","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Germany","content":"LOCATION"},{"type":"Pretyflaco","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"Bitcoin Awareness Game","content":"ORGANIZATION"},{"type":"Telegram Bot","content":"ORGANIZATION"},{"type":"Bitcoiners","content":"ORGANIZATION"},{"type":"Sankt Petersburg","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Adoption","Art","Bitcoin","Community"],"authors":["Jaroslaw Adamowski"]}