{"summary":"FIFA Enters NFT Arena, Offering Fans Digital Collectibles and World Cup Tickets","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fifa-enters-nft-arena-offering-fans-digital-collectibles-and-world-cup-tickets.htm","publishDate":"2023-12-12T11:40:14","id":17947,"type":null,"title":"FIFA Enters NFT Arena, Offering Fans Digital Collectibles and World Cup Tickets","category":["NFT News "],"content":["FIFA, the famous international governing body for football, has announced a new digital collectible collection in its first collaboration with tech firm Modex – with some notable perks.","‘FIFA+ Collect’ will be dropping the “dual digital collectible” for the FIFA Club World Cup Saudi Arabia 2023, the press release said.","The first drop of 100 digital collectibles will be available on December 15. It will feature “the rarest collectibles that offer the chance to secure FIFA World Cup 26 final tickets.”","Modex CEO Francesco Abbate commented that,","“The FIFA Club World Cup promises to be an exciting 10 days and with the release of collectibles that can secure actual FIFA match items and FIFA World Cup 26 final access, there’s an added incentive for fans to participate.”","More collectibles will launch on the FIFA+ Collect platform during the FIFA Club World Cup, which begins today in Jeddah, Saudi Arabia. They will showcase major moments from the tournament.","Notably, FIFA initially used Algorand as the official blockchain platform. However, this time, it will use the Polygon network to mint its non-fungible tokens (NFTs).","Modex is proud to be part of this great project alongside @FIFA! As firm believers of the uniqueness of each moment, we’d like to take digital collectibles to the next level. We’re excited for the upcoming drop on the @opensea platform powered by @0xPolygonLabs ! https:\/\/t.co\/kXQLhCfmPN","— Modex Tech (@modex_tech) December 11, 2023","","FIFA said that a total of 900 digital collectibles would be issued on Polygon on December 19. The NFTs will also be available on the OpenSea marketplace.","FIFA Chief Business Officer Romy Gai said that since its launch, FIFA+ Collect has been “immensely” popular globally. Fans worldwide have been given the opportunity “to own a piece of football history.”","Gai further indicated that the association has plans for future digital collectibles.","“These new launches, both this year and beyond, will provide football fans with a unique and innovative way to connect with the sport, while also contributing to the growth of the digital collectibles market.”","Per the FAQ page, FIFA has noticed that the football fandom is changing. Fans are now seeking to engage with the most popular game in the world in “new and exciting ways.”","Therefore, the association created the platform to make FIFA digital collectibles available to all football fans, it said. With it, the organization argued, it is providing an “accessible opportunity” for fans to engage with the game and “democratising the ability” to own a part of the World Cup.","As for the platform, FIFA+ Collect is described as an affordable and inclusive marketplace for digital collectibles. While there is currently no secondary marketplace, “it will be opening soon,” the FAQ said.","Meanwhile, besides FIFA World Cup, FIFA+ Collect offers digital collectibles featuring memorable moments in FIFA Women’s World Cup history.","Previously, FIFA announced Crypto.com as the exclusive cryptocurrency trading platform sponsor of the FIFA World Cup Qatar 2022.","____","Learn more: ",""],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"FIFA Club","content":"ORGANIZATION"},{"type":"December 11, 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Francesco Abbate","content":"PERSON"},{"type":"Romy Gai","content":"PERSON"},{"type":"Jeddah","content":"LOCATION"},{"type":"FIFA World Cup Qatar 2022","content":"ORGANIZATION"},{"type":"FAQ","content":"ORGANIZATION"},{"type":"Modex Tech","content":"ORGANIZATION"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"December 15","content":"DATE"},{"type":"December 19","content":"DATE"}],"hashtag":["Algorand","NFT","Non-fungible tokens","Polygon","Sport"],"authors":["Sead Fadilpašić"]}