{"summary":"The creators of the Yield Protocol say it will introduce fixed-rate borrowing and lending to Ethereum\nThe first application will be yDAI, an ERC20 token for the issuance of tokenized zero-coupon bonds","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64416\/yield-startup-fix-rate-ethereum","publishDate":"2020-05-07T15:58:36","id":1794,"type":null,"title":"A new startup called Yield is trying to bring fixed-rate borrowing and lending to Ethereum","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">In traditional finance, a zero-coupon bond is a debt instrument that trades at a discount to its face value, only paying its holder at maturity. This means that you can buy it at one price, and if you hold it until it expires, you are guaranteed the opportunity to redeem it at a higher one.<\/span>","<span data-v-f87c67ca=\"\">The same thing is needed in <a href=\"https:\/\/www.theblockcrypto.com\/post\/53609\/set-protocol-launches-social-trading-platform-on-ethereum-to-connect-users-and-expert-traders\" data-v-f87c67ca=\"\">Ethereum's<\/a> borrowing and lending scene, argues Allan Niemerg, CEO of <a href=\"https:\/\/yield.is\/\" data-v-f87c67ca=\"\">Yield<\/a>, a startup that's developing a protocol for the issuance of tokenized zero-coupon bonds.<\/span>","<span data-v-f87c67ca=\"\">Yield's technology will introduce <a href=\"https:\/\/www.theblockcrypto.com\/post\/55064\/nimbus-runs-its-ethereum-2-0-testnet-on-smartphones\" data-v-f87c67ca=\"\">Ethereum-based<\/a> \"fixed-term, fixed-rate lending,\" he says, adding that it can be seen as a novel primitive — or \"Lego brick\" — that can be incorporated into other systems.<\/span>","<span data-v-f87c67ca=\"\">Protocols like MakerDAO, which rely on <a href=\"https:\/\/www.theblockcrypto.com\/post\/54217\/0x-developers-release-liquidity-aggregation-tool-for-ethereum-based-exchange-protocol\" data-v-f87c67ca=\"\">Ethereum<\/a> smart contracts to let users borrow stablecoins by depositing cryptocurrency-denominated collateral, are a \"very powerful new thing\" with an array of potential use cases for traders and investors, says Niemerg. But people who take out loans using MakerDAO must pay a variable annual interest rate that has shown a propensity to be volatile: Last summer, the MakerDAO stability fee peaked at 20.5%, having started the year at 0.5%.<\/span><span data-v-f87c67ca=\"\"> \"What we really need here is a way to borrow and lend at a fixed rate,\" says Niemerg.<\/span>","<span data-v-f87c67ca=\"\">People want to borrow with confidence that the interest rate won't change, Niemerg says, so that they can make confident projections about their future cost of capital. <\/span>","<span data-v-f87c67ca=\"\">Enter the Yield Protocol. As Niemerg and Dan Robinson, a research partner at the blockchain-focused investment fund Paradigm, describe in a <a href=\"http:\/\/research.paradigm.xyz\/Yield.pdf\" data-v-f87c67ca=\"\">new white paper<\/a>, it is \"a standard for a token that settles based on the value of a target asset on a specified future date, and which is backed by some quantity of a collateral asset.\"<\/span>","<span data-v-f87c67ca=\"\">Yield is the first company that Paradigm has incubated. Today it announced new seed funding for the venture, which Niemerg's team will use to build the initial version of the product.<\/span>","<span data-v-f87c67ca=\"\">The first application will be ERC20 tokens called yTokens: essentially Ethereum-based zero-coupon bonds. Once a contract for a given yToken exists, anyone can deposit collateral into a \"vault\" (a term borrowed from MakerDAO) to mint yTokens, which will be fungible and trade at a floating price.<\/span>","<span data-v-f87c67ca=\"\">To start off, the protocol will let users deposit ETH as collateral to mint \"yDAI.\" Borrowers can issue yDAI tokens that are redeemable at different times – for instance, within a week, month, or a year. Interest rates over these distinct maturities can be used to create an on-chain interest rate curve, which could then be instructive for MakerDAO's monetary policy decisions, since it indicates future demand for leverage.<\/span>","<span data-v-f87c67ca=\"\">When a yDAI token expires, the ETH collateral in the Yield vault is automatically transferred to a MakerDAO vault, and DAI is issued against it. The outstanding yDAI tokens will be redeemable for that newly-issued DAI, while the borrower gets to maintain their debt position, albeit now at a variable rate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Niemerg says Yield is still developing the mechanism for liquidating vaults that become undercollateralized, for instance, due to a drop in the price of the underlying collateral. With respect to design questions related to liquidation and the price feed oracle, \"we're sort of taking our cues from MakerDAO,\" he said, adding that the goal is for the system to be a \"smooth extension\" of the popular stablecoin protocol.<\/span>"],"hashtag":["ETHEREUM"]}