{"summary":"Litecoin Price Prediction as Halving 70 Days Away – Can LTC Hit $1,000 in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/litecoin-price-prediction-as-halving-70-days-away-can-ltc-hit-1000-in-2023.htm","publishDate":"2023-05-23T20:21:00","id":17954,"type":null,"title":"Litecoin Price Prediction as Halving 70 Days Away – Can LTC Hit $1,000 in 2023?","category":["Altcoin News "],"content":["Litecoin (LTC), the cryptocurrency that powers the payments-focused Litecoin blockchain, is consolidating in the $91 area, just above its 50 and 100-Day Moving Averages, both of which reside around $89.50.","Litecoin traders continue to count down for the upcoming halving event, which is now just 70 days away.","Litecoinblockhalf.com explains that, “as part of Litecoin’s coin issuance, miners are rewarded a certain amount of litecoins whenever a block is produced (approximately every 2.5 minutes)”.","“When Litecoin first started, 50 litecoins per block were given as a reward to miners… (and) after every 840,000 blocks are mined (approximately every 4 years), the block reward halves and will keep on halving until the block reward per block becomes 0 (approximately by year 2142)”.","Right now, the block reward is 12.5 LTC, which will soon decrease to 6.25 LTC.","Whilst Litecoin’s prior halvings haven’t necessarily been as bullish events as halving have been for Bitcoin, a slowing of the LTC inflation rate should nonetheless prove to be a positive for LTC in the long-run.","Out of a total 84 million LTC tokens that can ever exist, just under 73 million have been mined, which is around 86.7% of the supply.","That means the upcoming halving event will see LTC’s inflation rate drop from around 3.67% to around 1.8%.","Litecoin’s technical set-up is looking good for a continuation of short to medium-term upside.","LTC’s second recovery from below its 200DMA this year earlier this month suggests investors remain keen to buy the dip and the recovery from earlier monthly lows also confirmed a long-term uptrend from the November lows.","Meanwhile, with Litecoin having also managed to get back above its other major moving averages, a retest of annual highs to the north of $100 per token appears to be on the cards.","Litecoin has been able to shrug off macro headwinds (a rising US dollar and US yields) that have weighed Bitcoin and other cryptocurrencies so far this month as a result of strong US data pushing back against US recession bets and Fed policymakers pushing back against rate cut expectations.","Time will tell if further hype regarding the upcoming halving events and technical buying continues to support the Litecoin price, but that does seem like a good likelihood, with futures open interest in the cryptocurrency recently hitting its highest level since late 2021.","With cryptocurrency markets seemingly having entered the early stages of a new bull market, investors are thinking about what upside price levels they should be targeting for the years ahead.","Some Litecoin bulls might be hoping for the cryptocurrency to join the $1,000 per token or above club in 2023 – at the moment, only two cryptocurrencies are in this exclusive club, Bitcoin and Ether.","However, that would require Litecoin to 10x from current levels in the space of only around seven and a half months.","That shouldn’t be ruled out as impossible.","Between November 2020 and May 2021, Litecoin posted near 8x gains to jump from around $55 to above $410 per token.","But that coincided with a massive run-up in broader crypto prices, driven by zero interest rates, massive fiscal stimulus and a rapid reopening-fuelled economic rebound, as well as a sudden surge in institutional interest into crypto as an asset class.","While it can be strongly argued that the trend towards greater societal and institutional investor adoption of crypto technology and crypto as an asset class has continued, those other economic conditions likely won’t be in play for 2023.","Yes, the Fed is likely to pause its interest rate hikes and may do some rate cutting this year, meaning macro should no longer be the massive headwind that it was in 2022 when the Fed was aggressively hiking interest rates to get inflation under control.","But Litecoin bulls should temper their optimism about hitting $1,000 this year."],"entity":[{"type":"86.7%","content":"PERCENT"},{"type":"May 2021","content":"DATE"},{"type":"$89.50","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$410","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$55","content":"MONEY"},{"type":"1.8%","content":"PERCENT"},{"type":"$1,000","content":"MONEY"},{"type":"3.67%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Litecoin","content":"PERSON"},{"type":"$100","content":"MONEY"},{"type":"200DMA this year earlier this month","content":"DATE"},{"type":"LTC","content":"ORGANIZATION"},{"type":"$91","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"November 2020","content":"DATE"}],"hashtag":["Litecoin","Price Prediction"],"authors":["Joel Frank"]}