{"summary":"HARIBO Token Skyrockets 11,000%, Leading a Meme Coin Resurgence as a Rival Coin Nabs $9 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/haribo-token-skyrockets-11000-leading-a-meme-coin-resurgence-as-a-rival-coin-nabs-9-million.htm","publishDate":"2024-04-23T12:29:51","id":17962,"type":null,"title":"HARIBO Token Skyrockets 11,000%, Leading a Meme Coin Resurgence as a Rival Coin Nabs $9 Million","category":["Industry Talk "],"content":["Solana meme coin markets show no sign of slowing down post-halving amid a wave of 4\/20-inspired confectionary meme coins that have exploded over the weekend and HARIBO price is leading the pack.","This article explores how Haribo’s price hammered 11,000% gains and uncovers the next big meme coin set to skyrocket in the macro Summer.","$Haribo careful!\nDev put 100% of supply to LP and then immediately used a different wallet to buy over 66% of the total supply. Then used those to spread between many wallets.\nBasically you are getting soft rugged by over 66% of supply. Do what you want with that. More details in… pic.twitter.com\/bdapsq7FTT","— Kakashi (@kkashi_yt) April 21, 2024","","Yet, despite the impressive gains, Solana meme coin analysts on Crypto X have been raising the alarm, warning of a potential soft-rug pull by the developer.","As price action re-tests upside resistance, HARIBO is currently trading at a market price of $0.05098 (representing a 24-hour change of +35.95%).","This comes after HARIBO launched at 13:00 UTC on April 21, in a move that gained instant traction amid a breakout trend for candy-themed cryptocurrencies.","Frenzied volume saw HARIBO price shoot up +11,000% in just 3 hours of trading, with price rallying to hit an all-time high at $0.1244 around 15:00.","","The hours since saw early backers take profit, fuelling a -90% retracement move – further exacerbated by added sell-pressure from the malevolent developer.","Yet, after an impressive display of consolidation above the bottom support level at $0.0068, recent hours have seen upside momentum resume – with HARIBO price so far climbing +515% to retest resistance at $0.07.","A successful break-high here could leave HARIBO with a bullish panhandled technical pattern, suggesting a bullish structure for the day ahead.","Furthermore, with an alluring market cap of just $449k, late-stage investors could still earn as much as 10x returns.","Retail investors are defying slow rug risk to participate, with buy-pressure representing 51% of transactions over the past hour.","Yet, with red flags in developer behavior, smart money traders are shifting their attention to a better play – the DOGEVERSE presale.","","While HARIBO price risks a slow-rug, DOGEVERSE is continuing to snowball with viral traction, as the fastest growing meme coin presale surges past $9m raised.","But what’s got retail investors so excited about this new cryptocurrency presale?","The answer is simple: the unification of DOGE across all major blockchains.","You heard that right – whilst the original Dogecoin has inspired a huge family of spin-off tokens – no DOGE-linked meme coin has ever delivered multi-chain trading.","#Cosmo, the pioneer of multichain meme utility, strives to unite the #Crypto meme community.🌟","As the first #Doge #Memecoin on six #Blockchains, Cosmo's wants to shine on every #DEX, #CEX, and meme haven.✨","With interstellar convergence, Cosmo redefines trending on #DEXTools.🚀 pic.twitter.com\/rkM4fVcFVW","— DogeVerse (@The_DogeVerse) April 22, 2024","","DOGEVERSE is here to fill that huge void in the year of Omnichain cryptocurrency.","DOGEVERSE will operate on Ethereum, Polygon, BNB Chain, Solana, Avalanche, and Base, a multichain feature that supporters will drive prices in 2024.","Moreover, holders cite DOGEVERSE’s capped supply of 200 million combined with staking as attractive attributes.","These features will likely create a supply squeeze, progressively lifting prices over time.","Buy DOGEVERSE Here",""],"entity":[{"type":"Summer","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"April 21","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"Cosmo","content":"ORGANIZATION"},{"type":"$Haribo","content":"MONEY"},{"type":"$0.0068","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"April 22, 2024","content":"DATE"},{"type":"+11,000%","content":"PERCENT"},{"type":"$0.05098","content":"MONEY"},{"type":"$449k","content":"MONEY"},{"type":"-90%","content":"PERCENT"},{"type":"LP","content":"ORGANIZATION"},{"type":"11,000%","content":"PERCENT"},{"type":"Dogecoin","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"April 21, 2024","content":"DATE"},{"type":"$0.1244","content":"MONEY"},{"type":"51%","content":"PERCENT"},{"type":"+515%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"+35.95%","content":"PERCENT"},{"type":"$9m","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$0.07","content":"MONEY"}],"hashtag":["HARIBO","Meme coin","Solana meme coin"],"authors":["Sam Cooling"]}