{"summary":"Crypto Community Fears Rug Pull as Safereum Faces Drastic Liquidity Drain Post $600,000 Fundraising","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-community-fears-rug-pull-as-safereum-faces-drastic-liquidity-drain-post-600000-fundraising.htm","publishDate":"2023-10-24T17:18:00","id":17977,"type":null,"title":"Crypto Community Fears Rug Pull as Safereum Faces Drastic Liquidity Drain Post $600,000 Fundraising","category":["Blockchain News "],"content":["The cryptocurrency community is fearing a rug pull after Safereum saw huge sums of liquidity drained, making off with around $1.3 million worth of funds, according to blockchain security experts.","On October 23, the blockchain security firm CertiK and other analysts alerted users that the developers of Safereum had conducted an exit scam after unlocking the token supply and selling more than 600 ETH worth of holdings worth $1.3 million. This caused the price of the Safereum (SAFEREUM) token to plunge more than 94%.","The report also added that the developer utilized the token deployment address “safereum.eth” to unlock the token supply, dumped more than 600 Ether (ETH), and deposited the stolen fund across multiple wallets.","A rug pull is a type of scam in which the developers of a cryptocurrency project abandon the project and take all of the investors’ money with them. This is typically done by draining the project’s liquidity pool, which is a pool of funds that is used to facilitate trading of the project’s token.","To confirm that the team’s developers were behind the event, Safereum’s official X account has also been deleted.","The rug pull came after the team completed fundraising of approximately $600,000 for a derivative token called “Safepad.” These funds are believed to be a significant portion of the total amount stolen, which amounted to around 720 ETH, equivalent to $1.27 million based on current market prices.","At the time of writing, according to CoinMarketCap, SAFEREUM is trading at $0.0000008, marking a 94.1% decrease from its previous trading value of $0.000014 before the alleged exit scam.","Safereum was launched earlier this month on the Ethereum blockchain and was largely marketed as a meme-based cryptocurrency with “guaranteed security.” Prior to the rug, Safereum promised to bring the crypto space back to its roots and revive the essence of decentralized memecoins.","Safereum also promised to simplify things, refocusing on the core principles of crypto and guiding the industry back to its original path.","In a press release issued at the time of its launch, the team claimed that five different companies had audited the project’s smart contracts.","Meanwhile, several so-called crypto influencers on X have been called out for their alleged roles in promoting the Safereum project. They were alleged to have used their so-called influence to encourage unsuspecting users to deposit their funds with the platform.","One of those users promoting the project was “@Shiaholic_ETH,” who now stands accused of funding the developer wallet behind the project. His account was deleted on X following the scam.","Also, the onchain-sleuth ZachXBT pointed specifically to a pseudonymous user known as “ProTheDoge” for their role as an official promoter of the scam project, noting that this wasn’t the first time that the user in question had done little in the way of due diligence.","Meme cryptocurrencies can be a minefield for investors, but one way to invest in meme coins is to select projects with a public founder and developers.","One new meme coin project CryptoNews recently reviewed – Meme Kombat ($MK) – has a doxxed project lead. Matt Whiteman’s professional background and LinkedIn are available to read on the website.",""],"entity":[{"type":"$MK","content":"MONEY"},{"type":"$1.27 million","content":"MONEY"},{"type":"94.1%","content":"PERCENT"},{"type":"$0.0000008","content":"MONEY"},{"type":"Safereum","content":"PERSON"},{"type":"$1.3 million","content":"MONEY"},{"type":"$600,000","content":"MONEY"},{"type":"$0.000014","content":"MONEY"},{"type":"October 23","content":"DATE"},{"type":"94%","content":"PERCENT"},{"type":"Matt Whiteman","content":"PERSON"}],"hashtag":["Scam"],"authors":["Hassan Shittu"]}