{"summary":"EigenLayer’s Mainnet Draws Support from Coinbase and Google Cloud","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/eigenlayers-mainnet-draws-support-from-coinbase-and-google-cloud.htm","publishDate":"2024-04-10T19:11:29","id":17972,"type":null,"title":"EigenLayer’s Mainnet Draws Support from Coinbase and Google Cloud","category":["Blockchain News "],"content":["The cloud divisions of Coinbase and Google became node operators for EigenLayer alongside other industry players on April 9, shortly after the network’s mainnet went live.","Coinbase Cloud disclosed in a short thread post on X that they are “proud to be among the protocol’s first operators,” as their collaboration would add an extra security layer to projects building on EigenLayer’s mainnet, dubbed as Actively Validated Services (AVSs).","Operators are live on @eigenlayer! Congrats to EigenLabs on fueling innovation with Ethereum's first restaking protocol.","Coinbase Cloud is proud to be among the protocol's first Operators, ready to serve as a trusted partner for your restaked ETH or LSTs.https:\/\/t.co\/GUQiueJ6FK","— Coinbase Developer Platform🛡️ (@CoinbaseDev) April 9, 2024","","The cloud platform also outlined intentions to onboard its experienced team to EigenLayer’s mainnet and utilize reliable standards, which have successfully powered the company’s validators across over 19 networks without slashing incidents.","Slashing incidents in blockchain networks are penalties imposed on validators or stakers for violating network rules. These violations can include double-signing transactions or attempts to manipulate the network.","Meanwhile, Google Cloud has actively participated in EigenLayer’s testnet since November 2023. This move strengthens Google’s presence in the Web3 infrastructure space, where they offer services like validator management and node hosting for many blockchains.","The EigenLayer protocol leverages the substantial amount of Ethereum (ETH) tokens staked on the Ethereum network to enhance security.","Stakers can “restake” their assets, securing not only Ethereum but also other networks within the EigenLayer ecosystem. This extends the security benefits of Ethereum to a broader range of services and networks.","Industry-leading cloud providers, including Coinbase Cloud and Google Cloud, have joined the EigenLayer ecosystem alongside other notable firms. As the blockchain ecosystem continues to evolve, EigenLayer’s ability to attract such operators is expected to increase.","💥 Andreessen Horowitz Supports Crypto Startup EigenLayer With $100 Million Investment","Venture Capital firm Andreessen Horowitz has invested $100 million in crypto restating startup EigenLayer after its latest funding round.#CryptoNews #newshttps:\/\/t.co\/HwVY21eoBG","— Cryptonews.com (@cryptonews) February 22, 2024","","Recent developments include a $100 million investment from Andreessen Horowitz and the launch of EigenLayer’s mainnet and data availability layer, EigenDA. Operators participating in EigenLayer’s mainnet can provide services and process transactions for rewards.","The protocol has expressed optimism about the high operator turnover among the top 200 active sets of operators, indicating changes in the composition of the network’s active participants.","Google Cloud’s involvement in running a node for blockchain projects is not new. The tech giant has been active in the industry since establishing a blockchain division in early 2022.","In 2022, Google Cloud launched the Blockchain Node Engine, fully initiated to manage node-hosting for Web3 development.","Google Cloud has also been collaborating with other protocols. Recall that Polygon announced a partnership with Google Cloud in April 2023 to provide developer tools and infrastructure to accelerate the growth of its protocols.","This partnership specifically allows Google Cloud to utilize its Blockchain Node Engine to help developers scale through the time-intensive processes and costly overhead associated with maintaining and operating Polygon’s PoS nodes."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"February 22, 2024","content":"DATE"},{"type":"Blockchain Node Engine","content":"ORGANIZATION"},{"type":"Actively Validated Services","content":"ORGANIZATION"},{"type":"April 9, 2024","content":"DATE"},{"type":"$100 Million","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"April 9","content":"DATE"}],"hashtag":["Coinbase cloud","eigenlayer","Ethereum network"],"authors":["Jimmy Aki"]}