{"summary":"KyberSwap Hacked for $48 Million, Hackers Suggest Negotiations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kyberswap-hacked-for-48-million-hackers-suggest-negotiations.htm","publishDate":"2023-11-23T08:24:04","id":17989,"type":null,"title":"KyberSwap Hacked for $48 Million, Hackers Suggest Negotiations","category":["Blockchain News "],"content":["KyberSwap, a decentralized exchange, has been compromised in a hack resulting in the theft of $48 million, prompting the platform to advise users to withdraw their funds while the attackers hint at entering negotiations.","On-chain data indicates that the hack on KyberSwap resulted in significant losses of $48 million across several blockchain networks, including 20 million from Arbitrum, $15 million from Optimism and $7 million from Ethereum.","The stolen funds were primarily deposited in Ethereum (ETH), Wrapped Ethereum (wETH), and USD Coin (USDC). The analysis of the incident indicates a direct attack on the exchange’s liquidity pools instead of a vulnerability in the platform’s code.","Kyber Network has sent out notifications to advise users to withdraw their funds. “We regret to inform you that KyberSwap Elastic has experienced a security incident,” said Kyber Network. “As a precautionary measure, we strongly advise all users to promptly withdraw their funds. Our team is diligently investigating the situation, and we commit to keeping you informed with regular updates.”","🚨Urgent🚨","Dear KyberSwap Elastic Users,\nWe regret to inform you that KyberSwap Elastic has experienced a security incident.","As a precautionary measure, we strongly advise all users to promptly withdraw their funds. Our team is diligently investigating the situation, and we…","— Kyber Network (@KyberNetwork) November 22, 2023","","The hackers left an on-chain message, suggesting potential negotiations, “Negotiations will start in a few hours when I am fully rested. Thank you.”","The company stated that KyberSwap’s aggregator is “not impacted” and is “operating fully as normal.” In the meantime, Kyber Network reminds the investors of potential scams and not to click any phishing links or respond to direct messages.","In addition to being a decentralized exchange (DEX), KyberSwap is also an automated market maker (AMM) with liquidity protocols and concentrated liquidity. Instead of using traditional order books like a conventional exchange, an AMM like KyberSwap uses liquidity pools that allow assets to be traded automatically.","The hackers have recently been rampantly exploiting exchanges for profits. On Nov. 22, the cryptocurrency exchange HTX and blockchain protocol Heco Chain were hacked for $97 million worth of digital tokens. Earlier on Nov. 19, Kronos Research was also breached with $26 million stolen."],"entity":[{"type":"Nov. 19","content":"DATE"},{"type":"$26 million","content":"MONEY"},{"type":"$7 million","content":"MONEY"},{"type":"KyberSwap Elastic","content":"ORGANIZATION"},{"type":"Kyber Network","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Kronos Research","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"$97 million","content":"MONEY"},{"type":"$48 million","content":"MONEY"},{"type":"KyberSwap Elastic Users","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"USD Coin (USDC","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"November 22, 2023","content":"DATE"}],"hashtag":["Ethereum","Hack"],"authors":["Hongji Feng"]}