{"summary":"‘Largest Collaboration of Crypto Artists in History’ is Set for Launch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/largest-collaboration-of-crypto-artists-in-history-is-set-t-7476.htm","publishDate":"2020-08-21T00:00:00","id":17981,"type":null,"title":"‘Largest Collaboration of Crypto Artists in History’ is Set for Launch","category":["Blockchain News "],"content":["A major art collaboration between a number of crypto digital artists and a plot in Ethereum (ETH)-powered virtual reality world Cryptovoxels, called Pranksyland, is set to go live on August 25.","Game designer Pranksy bought a plot in the Cryptovoxel virtual world, and will now make it a gallery for a number of crypto artists to showcase their work to a wider Non-Fungible Token (NFT), cryptocurrency and artistic community. This will go down through an incentivized launching event that will be hosted by influencers in the NFT world. Pransky called it “the largest collaboration of Crypto based digital artists in history.”","As a reminder, NFTs are a class of crypto-assets made possible by blockchain networks that support the creation of decentralized apps (dapps) through the deployment of smart contracts. They are unique tokens which may or may not represent a real-world asset deployed on the blockchain.","Drawing on the uniqueness of NFTs, Cryptovoxels offers the sale of virtual lands for which crypto-artists can build stores and art galleries, drawing on each artist’s creativity to build a diverse range of unique products that can be bought and sold.","Cryptonews had a chat with Pranksy, the brain behind the upcoming Pranksyland project, a game developer without “a prior crypto experience” who forayed into the NFT metaverse through Cryptokitties back in 2017.","“I’m a game designer as a day job so game and collectible economies within NFTs enticed me,” said Pranksy, adding: “I spent a lot of time in my teens flipping diablo weapons and FIFA ultimate team cards, So the introduction of NFTs has been a whole new world to me.”","Wanting to establish a landmark in a whole new world, Pranksy got inspiration from other crypto artists (notably Alotta) to turn his acquired plot of land on Cryptovoxel into a hub for like-minded NFT artists to come showcase and monetize their digital creations.","NFTs and their associated products have not seen as large of an adoption when compared to other blockchain applications like decentralized lending. Furthermore, there have been some concerns expressed by the industry insiders over the state of NFTs and the market since the COVID-19 pandemic has started.","For example, Aleksander Larsen, COO Axie Infinity, a game (dapp) that runs on the Ethereum blockchain, said back in April that the “market has dried up considerably after the recent situation with COVID-19.”","Nonetheless, Pranksy expects the highly anticipated launch of Pranksyland will:","“have the largest turnout for any virtual event yet held, potentially hundreds of attendees on the night – I think the crypto voxel servers are at threat.”","At the launch, twenty renowned crypto NFT artists, including Coldie, Hackatao, and Bryan Brinkman to mention just a few, will be showcasing their unique designs. These designs are expected to sell out fast per Pranksy, who believes that the set prices will be fair, some matching the raw value of the plot on Cryptovoxel.","While Pranksyland aims to redefine the NFT artistry and the entire ecosystem, its model is uncommon – but with a “small but hardcore bunch” of teammates, Pranksy stated that his virtual estate will usher in a new artistic world order.","____","Learn more:\nNFT Devs Build While Users Follow Ethereum Price & Wait For Better Products\nTop 10 NFTs by All-time Trading Volume\nBlockchain Deals: Virtual Car for USD 100K and Digital Dress for 9.5K"],"entity":[{"type":"Hackatao","content":"LOCATION"},{"type":"Cryptovoxel","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Bryan Brinkman","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"August 25","content":"DATE"},{"type":"COO Axie Infinity","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"Pranksy","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"NFT Devs Build While Users Follow Ethereum Price & Wait For Better Products","content":"ORGANIZATION"},{"type":"Digital Dress","content":"ORGANIZATION"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"Aleksander Larsen","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"voxel","content":"ORGANIZATION"}],"hashtag":["Art","Blockchain","Ethereum"],"authors":["Godfrey Benjamin"]}