{"summary":"Chile Edging Closer to CBDC Launch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chile-edging-closer-to-cbdc-launch.htm","publishDate":"2024-04-23T03:00:37","id":17980,"type":null,"title":"Chile Edging Closer to CBDC Launch","category":["Altcoin News "],"content":["Chile is tentatively moving toward the launch of a CBDC, with the public seemingly firmly behind the central bank’s plans.","Per the media outlet Criptonoticias, the Central Bank of Chile (BCCh) is yet to commit to a CBDC launch.","However, a digital peso rollout is looking increasingly likely, with the BCCh announcing it is set to commence Proof-of-Concept (PoC) testing.","The central bank also conducted a survey. It said that it asked “the general public and representatives of the public and private sectors” for their CBDC-related opinions.","The BCCh said almost 90% of survey respondents had “a favorable attitude toward CBDC” pilots.","The bank said that “the main objective of the PoC” tests will be “gaining experience with technologies related to digital currencies.”","BCCh officials said initial tests would be conducted internally, without private sector support.","The bank added that it would only seek “external support” when it was ready to start real-world tests or roll out the coin.","Alberto Naudon, an advisor to the central bank, said that it was unlikely that a Chilean CBDC would face much competition from “so-called cryptocurrencies.”","Naudon said there was a very small probability that Bitcoin (BTC) or other tokens could be “used as money or a means of payment on a massive scale.”","Instead, he said that a digital peso would likely face more competition from stablecoins, some of which are “backed by large companies.”","Naudon said that “due to their characteristics,” stablecoins “clearly have the potential” to achieve “significant mass adoption.”","The media outlet noted that “in many countries” in the Latin American region, people use USD-pegged coins “more widely than BTC.”","The bank appears, like many of its international counterparts, to have made something of a U-turn on CBDC policy.","Chile’s central bank President Rosanna Costa said plans to extend one of the world’s biggest rate-cutting cycles remain intact as policymakers have already incorporated new global risks into their outlook https:\/\/t.co\/0KJTua1Qiu","— Bloomberg Economics (@economics) April 20, 2024","","Back in 2022, the BCCh began and then abandoned a CBDC project, unsure that it would benefit the nation to press ahead with a digital peso rollout.","But the bank appears to have changed its tune in 2024, claiming that the response to its survey had convinced it to try again with the CBDC project.","The bank said it was moving “in line with the majority of the world’s central banks.”","Scores of nations worldwide, including most major countries in the LATAM region, are either set to roll out CBDCs or are actively researching digital fiat projects."],"entity":[{"type":"Criptonoticias","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"Central Bank of Chile (","content":"ORGANIZATION"},{"type":"Bloomberg Economics","content":"ORGANIZATION"},{"type":"Chile","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"April 20, 2024","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Alberto Naudon","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Rosanna Costa","content":"PERSON"},{"type":"Naudon","content":"PERSON"}],"hashtag":["CBDC","Latin America"],"authors":["Tim Alper"]}