{"summary":"Stablecoin Tether Receives ‘Constrained’ Rating from S&P Global","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/stablecoins-tether-receives-constrained-rating-from-sp-global.htm","publishDate":"2023-12-13T07:17:25","id":17991,"type":null,"title":"Stablecoin Tether Receives ‘Constrained’ Rating from S&P Global","category":["Altcoin News "],"content":["American credit ratings firm S&P Global Inc. said it has started assessing the ability of Tether (USDT) to maintain its peg to the U.S. dollar marking it at a ‘constrained’ rating of 4.","Stablecoins are a cryptocurrency whose value is usually pegged to a fiat currency or commodity. Tether has been under scrutiny for years – the stable coin was issued in 2014 and is the longest-standing stablecoin with the largest volume in circulation. Its price has remained relatively stable in recent years and particularly over the past 12 months, notes the S&P.","The risk assessment is between 1 to 5 – with 5 being ranked weak. Tether has been scored weak due to the lack of information disclosed.","“Our asset assessment of 4 (constrained) reflects a lack of information on entities that are custodians, counterparties, or bank account providers of USDT’s reserves. This is not withstanding that a large share of USDT’s reserves comprise short-term U.S. treasury bills and other U.S. dollar cash equivalents. There is also significant exposure to higher-risk assets with limited disclosure. Such assets could be subject to credit, market, interest rate, or foreign currency risks.” said the S&P in a note.","However, the S&P notes that the stablecoin stability assessment could improve if there is increased disclosure of the underlying assets and on the creditworthiness of the custodians, counterparties, and bank account providers.","“Regulation or supervision of USDT’s issuance and management by an authoritative body could also support a stronger assessment. The stablecoin stability assessment could worsen if there is a shift to higher-risk assets, such as cryptocurrencies,” adds the S&P.","J.P. Koning, a CoinDesk columnist, worked as an equity researcher at a Canadian brokerage firm and a financial writer at a large Canadian bank tweeted:","S&P's criticisms of Tether are quite serious.","In no particular order, Tether…","1) doesn't segregate assets\n2) fails to disclose its custodians\/bank account providers\n3) isn't licensed under a regulatory framework\n4) invests in high-risk assets with limited disclosure","con't…","— John Paul Koning (@jp_koning) December 12, 2023","","Earlier this month, Tether froze a number of wallets of individuals sanctioned by the U.S. Office of Foreign Asset Controls (OFAC).  In the announcement, Tether said it aims to prevent potential misuse of its tokens and enhance security measures by aligning with global law enforcement and regulators.","Since the Terra Luna collapse last year, when LUNA failed to maintain its peg against the U.S. dollar and plummeted causing investors to lose billions the stablecoin market has been under scrutiny."],"entity":[{"type":"2014","content":"DATE"},{"type":"John Paul Koning","content":"PERSON"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Terra Luna","content":"ORGANIZATION"},{"type":"J.P. Koning","content":"PERSON"},{"type":"Tether","content":"PERSON"},{"type":"December 12, 2023","content":"DATE"},{"type":"S&P Global Inc.","content":"ORGANIZATION"},{"type":"U.S. Office of Foreign Asset Controls (OFAC","content":"ORGANIZATION"}],"hashtag":["Tether"],"authors":["Tanzeel Akhtar"]}