{"summary":"Litecoin’s Strong Performance Before ‘Halvening’ Fuels Optimism for Bitcoin Rally","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/litecoins-strong-performance-before-halvening-fuels-optimism-for-bitcoin-rally.htm","publishDate":"2023-07-11T09:20:00","id":17998,"type":null,"title":"Litecoin’s Strong Performance Before ‘Halvening’ Fuels Optimism for Bitcoin Rally","category":["Altcoin News "],"content":["Bitcoin (BTC) investors are closely watching the performance of Litecoin (LTC), another proof-of-work token, as the flagship cryptocurrency gears up for its upcoming “halvening” event. ","The term “halvening” refers to the protocol-backed reduction in rewards for miners who successfully solve puzzles and add blocks to proof-of-work tokens like Litecoin and Bitcoin. ","The Litecoin blockchain is poised to go through the halvening process in another 21 days, which is scheduled for August 1, 2023. ","This reduction is designed to limit the number of tokens issued and has already caused a surge in Litecoin’s price.","Over the past month, the price of Litecoin has risen by 22%, while its 12-month performance shows an impressive 81% increase. ","This performance has bolstered the confidence of Bitcoin investors who believe that the upcoming halvening event for Bitcoin, scheduled for April 2024, will have a similarly positive impact on the price of the leading cryptocurrency. ","Bitcoin has historically experienced price increases following its halvenings, which occur every four years. ","The reason for this trend lies in the fundamental principles of supply and demand. ","With fewer new coins being minted, the existing supply becomes scarce. And as demand from investors and users continues to grow, this scarcity drives the price higher.","The first halvening in 2012 saw Bitcoin’s price rise from around $12 to over $260 within a year. ","Similarly, the second halvening in 2016 witnessed a surge from $650 to almost $20,000 by the end of 2017. ","The most recent halvening occurred in May 2020 when the reward per block was reduced from 12.5 to 6.25 Bitcoins. While the immediate impact on the price was not as dramatic as previous halvenings, Bitcoin started an upward trend shortly after, reaching new all-time highs in 2021.","Bitcoin has also performed well since the start of the year. ","At the beginning of this year, Bitcoin was trading at around $16,000. It has nearly doubled since then, recently hovering around $30,000. ","The cryptocurrency hit a 52-week high last month after BlackRock, the world’s largest asset manager, filed an application to create a spot Bitcoin ETF. ","The filing by the world’s largest asset manager also spurred a surge in ETF applications, with other firms, such as Fidelity, Valkyrie, and Invesco, submitting applications.","Both Bitcoin and Litecoin received a significant boost when EDX Markets, a new crypto exchange backed by Citadel Securities, Fidelity, and Charles Schwab, announced that it would include them among the four tokens available to its customers at launch.","Nevertheless, as the countdown to Bitcoin’s halvening in 2024 begins, industry watchers will be closely monitoring Litecoin as an indicator of what may lie ahead for the world’s most popular cryptocurrency."," "],"entity":[{"type":"April 2024","content":"DATE"},{"type":"$16,000","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"$12","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"$260 within","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"August 1, 2023","content":"DATE"},{"type":"Charles Schwab","content":"PERSON"},{"type":"81%","content":"PERCENT"},{"type":"May 2020","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Valkyrie","content":"LOCATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"$650","content":"MONEY"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Litecoin"],"authors":["Ruholamin Haqshanas"]}