{"summary":"Bitcoin’s third-ever block halving is set to take place next month\nBut from a network perspective, what exactly happens? ","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63593\/what-actually-happens-during-a-bitcoin-halving-technically-speaking-not-much","publishDate":"2020-04-30T11:51:50","id":1799,"type":null,"title":"What actually happens during a bitcoin halving? Technically speaking, not much","category":["Bitcoin"],"content":["The cryptocurrency world is abuzz with speculation about the potential impact of next month's bitcoin halving, when for the third time in the network's history, the reward for mining a block will be divided by two.","Much of the discussion revolves around what will happen to the price. But we'll have to wait until after <a href=\"https:\/\/www.theblockcrypto.com\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">the thing<\/a> actually happens - around May 12 - to know that. In the meantime, let's explore a different question: What exactly changes under the hood during the halving?","Technically, the answer is nothing unexpected, or at least, nothing new. When the network hits its 630,000th block – the amount will drop from 12.5 BTC to 6.25 BTC per block.","But while that may sound boring, it's also crucial to the system. Bitcoin's virtually unchangeable block reward schedule, which Satoshi Nakamoto baked into the protocol from the beginning, is one of its signature features.","Satoshi didn't prescribe the schedule in the <a href=\"https:\/\/bitcoin.org\/bitcoin.pdf\" data-v-f87c67ca=\"\">bitcoin white paper<\/a>. But it appeared soon afterward, as part of the currency's original codebase. On January 9, 2009, just a few months after sending the white paper to a cryptography mailing list, Nakamoto sent <a href=\"https:\/\/www.mail-archive.com\/cryptography@metzdowd.com\/msg10142.html\" data-v-f87c67ca=\"\">another message<\/a> that spelled out bitcoin's monetary policy. \"Total circulation will be 21,000,000 coins,\" it read. \"It'll be distributed to network nodes when they make blocks, with the amount cut in half every 4 years.\" The message explained that 10.5 million total coins would be issued to miners in the first four years, 5.25 million in the next four, and so on until there are no more left to dole out. (After that point, miners will have to get by on transaction fees only.)","Nakamoto set the system up to follow the schedule automatically, avoiding the need for any human influence over it. In the event of a halving, \"no changes are made to the system in the sense that no human action by anyone is involved (or even possible),\" Core developer <a href=\"https:\/\/twitter.com\/pwuille\" data-v-f87c67ca=\"\">Pieter Wuille<\/a> told The Block in an email.","This aspect of bitcoin is one of the most important things that sets it apart from popular networks like Ethereum, which currently has neither a cap on its monetary supply nor a set schedule for adjusting its block reward.","Cutting the bitcoin mining reward from 12.5 BTC to 6.25 BTC will certainly have big economic implications for the people whose business depends on mining bitcoin. But the computers themselves won't really be affected, says core developer <a href=\"https:\/\/twitter.com\/amizi\" data-v-f87c67ca=\"\">Amiti Uttarwar<\/a>. \"In terms of what functionally changes in the software … not much.\" A single number changes, and that's it.","\"The code's been the same forever – it doesn't change the code,\" says <a href=\"https:\/\/dci.mit.edu\/thaddeus-dryja-tadge\" data-v-f87c67ca=\"\">Tadge Dryja<\/a>, a research scientist at MIT's Digital Currency Initiative.","That doesn't mean the network won't experience some degree of disruption, though. Some worry that the change will lead to slower block times because so many miners, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/63101\/smaller-bitcoin-miners-likely-wont-survive-after-the-halving\" data-v-f87c67ca=\"\">particularly smaller players<\/a>, will no longer be able to cover their costs and have to go out of business.","\"Yeah, that could be disruptive,\" says Dryja. \"But no matter what it's going to be temporary.\"","In the worst-case scenario, he says, after a couple of weeks, the mining difficulty would drop in response. At that point, he says, \"You're sort of back where you started.\""],"hashtag":["BITCOIN"]}