{"summary":"While the Pandora team describes ERC-404 as a “Frankenstein’s monster,” it claims there’s method in its madness.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276477\/these-developers-are-mashing-erc-20-tokens-and-nfts-together-will-it-work","publishDate":"2024-02-07T09:59:52","id":18,"type":null,"title":"These developers are mashing ERC-20 tokens and NFTs together: Will it work?","category":["CRYPTO ECOSYSTEMS"],"content":["It was around 9 AM in Toronto, Canada, on Feb. 1 when a designer and crypto trader who goes by <a href=\"https:\/\/twitter.com\/maybectrlfreak\" data-v-f87c67ca=\"\">ctrl on X<\/a> — his real name is Arya Khalaj — thought he had stumbled onto something brilliant.","The project was called Emerald and it claimed to combine ERC-20 tokens with NFTs in a way that could solve NFT liquidity issues for good. It appeared to be the solution for a lot of issues ctrl had come across while working with different crypto projects.&nbsp;","He went all in. While chatting online with a friend known pseudonymously as Searn, they started throwing in clips of ether. During this time, the chart just kept going up. Once they ran out of ether, they dipped into their investments in other projects and were soon in to the tune of around $60,000 each.&nbsp;","Then, without warning, the project was exploited and the bottom fell out of the chart.","Ctrl — who was holed up in a small Airbnb as his lease had expired during a three-month trip to Tokyo — was devastated. “We were sitting there, in total shock, and we were like, what just happened?” he told The Block in an interview.","The two crypto traders spoke with a friend and former Coinbase engineer known pseudonymously as Acme about the situation. They reached out to the developer of Emerald and asked if they could help fix the project and bring it back to life. Yet the developer seemed uninterested in getting any help, they said, and planned to relaunch anyway with a quick patch. Acme took a look at the code, said it was barely designed to work at all anyway and would require a full rewrite.","So that’s what they did.","“We'd been up all night,” said ctrl. “We stayed up for the next 26 hours or so after that. So we've been up for two days at this point, just building this thing in a single sprint.”","At the end of it, they had built a working implementation of a token standard that combines ERC-20 tokens and NFTs. They called it ERC-404, named after the common website error message.&nbsp;","“We thought it was a fitting name because the whole thing was so experimental and we knew it would confuse many protocols and dapps when we launched it because it has mixed ERC-721 and ERC-20 functions,” said ctrl.","While ERC-20 tokens are fungible tokens that can be replaced by any other token, NFTs are unique tokens that are non-fungible, and can’t be switched like-for-like. ERC-404 combines both ideas to create what the team calls a semi-fungible token.","The team acknowledged that this creates some sort of Frankenstein’s monster. “It's just a matter of actually understanding how to mix two things that have never been mixed and weren’t designed to be mixed together — and are actually conflicting,” ctrl said.","In practice, it looks like this: a project can offer 100 tokens and 100 NFTs, for example, where each token is linked to an NFT. If someone buys less than a whole token, the NFT is burned and they just have a fraction of a token. If they combine this with more fractions of a token, an NFT is minted back into their wallet.","The core idea is that it allows people to buy and sell NFTs, as well as parts of an NFT, where the parts are represented as tokens. Since two halves of a token can be combined to create an NFT, the tokens should, in theory, retain the value of the underlying NFT potential — even when it's temporarily gone. Two half tokens will be worth half of a whole token and NFT combo because they can be combined at will to create the whole token with the corresponding NFT.","The only issue is that combining two tokens won't return the same NFT, so its value might be a bit variable — but this will also depend on the specific project in question as each project can implement the token standard in its own way; choosing how many NFTs they want per token and how the NFTs are regenerated. For instance, a project might generate new NFTs every time they’re minted, or they might have all NFTs look the same.","With NFTs getting constantly minted and burned, this raises the question of whether the token design will result in a lot of costly transaction fees. A developer known as quit on X <a href=\"https:\/\/twitter.com\/0xQuit\/status\/1754853920500052314\" data-v-f87c67ca=\"\">noted<\/a> that the current system is more expensive than current NFT projects. The team acknowledged that this is a potential issue but said they have been focused on optimizing it.&nbsp;","The team of four — comprising ctrl, <a href=\"https:\/\/twitter.com\/searnseele\" data-v-f87c67ca=\"\">Searn<\/a>, <a href=\"https:\/\/twitter.com\/0xacme\" data-v-f87c67ca=\"\">Acme<\/a> and another individual known as Hohenheim —&nbsp;named their project <a href=\"https:\/\/twitter.com\/Pandora_ERC404\" data-v-f87c67ca=\"\">Pandora<\/a> and created the first token under the ERC-404 token standard on Feb. 2. It’s worth noting that while they have done some tests, it’s still unaudited and carries some risk.","Pandora created 10,000 NFTs called Replicants that are bound to 10,000 Pandora tokens. The NFTs are in the form of boxes with five different colors — each with <a href=\"https:\/\/www.blocmates.com\/research-reports\/erc404-everything-we-know-about-pandora-so-far\" data-v-f87c67ca=\"\">varying levels of rarity<\/a> — that may later reveal different artwork.&nbsp;","Anyone who buys a token will get an NFT — and, if they spend half of that token, the NFT is destroyed. When new NFTs are minted, they are randomized, meaning that the distribution and rarity can change over time. This means users need to be careful they don’t accidentally destroy their own rare NFTs, which could get replaced with more common ones.","“[ERC-404] allows you to do things that were never possible with ERC-721. And because of that, there are a lot of different implementations, a lot of different ways you could approach the concepts. We obviously had to just choose one,” said ctrl. “But people are already doing their own things.”","At launch, 7% of the supply was allocated to the team and early contributors. Upon launch, the team purchased 23% of the total supply to be used to provide extra liquidity through market makers or for token listings.&nbsp;","So far, the project has seen <a href=\"https:\/\/dune.com\/hashed_official\/pandora\" data-v-f87c67ca=\"\">$100 million of trading volume<\/a> on decentralized exchanges. The token has reached a price of around $12,800, giving the project a fully diluted valuation of $125 million, while the NFTs have reached a similar floor price.","Since launch, a few projects have started experimenting with the Pandora token. On-chain index project Peopods Finance has added the Pandora token so it can be wrapped and used to generate yield. Lending platform Teller has added it so it can be used as collateral for loans. Furthermore, trading platform Wasabi Protocol has listed it, enabling perpetual trading of the token.","In the near term, the team is planning to propose an Ethereum Improvement Proposal — something that, if accepted, would make Ethereum better designed to support this sort of token standard. Hohenheim said the team didn’t want to give a hard timeline but that it’s talking about a number of days, not weeks, before doing so.","The team is also preparing to launch a protocol very soon that could speed up the adoption of ERC-404 tokens, ctrl said. It would provide creators and developers with the tools and infrastructure for building products involving ERC-404 tokens.","“What we're doing now is we are focused less on the usual NFT gimmicks and more on building, like actual functional, usable, user-facing products, that also integrate with our collection and that make people want to hold our collection because of the incentives that they get,” he said.","While understanding how ERC-20 tokens and NFTs can be combined together is one thing, another question is why anyone would want to do so.","The Pandora team said there were two main reasons why this makes sense. The first is that it could help with liquidity for NFTs. Ctrl said that any NFT built on the ERC-404 standard would have liquidity as long as there’s a liquidity pool. This means any NFT can be sold at any time without needing to find a buyer counterparty.&nbsp;","“People get mad when people floor 40 [NFTs] at a time. Well, now you effectively have a token price that reflects a floor price in real-time, and there's no such thing as a thick or third floor because there is actual native liquidity,” he said.","The second reason is that it can provide native fractionalization of NFTs. Right now, to fractionalize an NFT, you need to lock it up and create a number of tokens that represent the overall NFT — something that is tricky to unwind and piece back together.&nbsp;","By providing native fractionalization, the idea is that ERC-404 tokens could offer a better user experience. “That's why native fractionalization is such a big deal, I think, because it's actually a feature built in,” said ctrl. “People don't need to feel like they have to go and do some weird four-step process and get this kind of legitimate NFT that's a derivative.”","Ctrl also noted that NFTs using the ERC-404 token standard could be applied in the gaming industry, particularly when it comes to the gamification of destroying and reminting NFTs with a randomization factor. If successful, this would incentivize more trading of these tokens, something that could spur wider adoption.","Although that's assuming people will be able to get their heads around semi-fungibility of course.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Feb. 1","content":"DATE"},{"type":"$12,800","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Toronto","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Pandora","content":"PERSON"},{"type":"Pandora token","content":"ORGANIZATION"},{"type":"$125 million","content":"MONEY"},{"type":"Peopods Finance","content":"ORGANIZATION"},{"type":"Feb. 2","content":"DATE"},{"type":"Wasabi Protocol","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"$60,000","content":"MONEY"},{"type":"Tokyo","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Searn","content":"LOCATION"},{"type":"23%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Airbnb","content":"PERSON"},{"type":"sprint","content":"ORGANIZATION"},{"type":"Acme","content":"ORGANIZATION"}],"hashtag":["ASSETS","CRYPTO","DECENTRALIZED INFRASTRUCTURE","DEXS","TOKENIZATION"],"authors":["Tim Copeland","The Block"]}