{"summary":"Crypto asset investment products witnessed $6.5 million in net outflows last week, breaking a four-week inflow streak totaling $742 million.\nEther bucked the trend, notching $6.6 million in inflows, while XRP also showed signs of investor confidence.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241094\/bitcoin-fund-outflows-ether-xrp-inflows","publishDate":"2023-07-24T08:50:14","id":180,"type":null,"title":"Bitcoin funds see $13 million in outflows while ether, XRP buck the trend","category":["Markets"],"content":["Digital asset investment products experienced a $6.5 million net weekly outflow, bucking a trend that saw $742 million pour in over the prior four weeks.&nbsp;","Bitcoin, the usual frontrunner, experienced outflows to the tune of $13 million. Ether proved to be an exception, drawing in $6.6 million of inflows last week, hinting at a slow sentiment shift for the crypto asset, according to CoinShares’ latest <a href=\"https:\/\/blog.coinshares.com\/volume-141-digital-asset-fund-flows-weekly-report-38255b443eae\" data-v-f87c67ca=\"\">report<\/a>.","Meanwhile, XRP also showed signs of investor confidence, CoinShares said. Following Ripple’s <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">partial victory<\/a> in its legal battle with the Securities and Exchange Commission, XRP products saw another $2.6 million in inflows over the last week, now accounting for 8% of current assets under management at providers such as Grayscale, Bitwise and ProShares. Solana, Uniswap and Polygon also attracted minor inflows.","Short bitcoin investment products continued a 13-week outflow streak with $5.5 million in outflows last week. The short bitcoin share of total bitcoin investment products under management fell to its lowest level in over a year at 0.4%.","Trading volumes fell below the weekly average to $1.2 billion, compared to $2.4 billion the week before.","Regionally, the North American market was the primary contributor to overall outflows, accounting for nearly 99% ($21 million). However, this was partially offset by $12 million of inflows into Switzerland and $1.9 million into Germany.","The overall reversal in flows comes as bitcoin dropped to its lowest level in a month today, currently trading at <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">$29,177<\/a>, down 2.4% over the last 24 hours, according to CoinGecko data. Ether fell 1.4% to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ethereum\" data-v-f87c67ca=\"\">$1,848<\/a> during the same period."],"hashtag":["BITCOIN","ETHEREUM","INVESTMENT FIRMS","XRP"]}