{"summary":"Infamous Hacker Denis Katana Linked to Bitcoin Money Laundering for Russian Crime Ring","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/infamous-hacker-denis-katana-linked-bitcoin-money-laundering-for-russian-crime-ring.htm","publishDate":"2023-10-25T10:51:00","id":18000,"type":null,"title":"Infamous Hacker Denis Katana Linked to Bitcoin Money Laundering for Russian Crime Ring","category":["Altcoin News "],"content":["A judge in Spain has linked notorious hacker Denis Tokarenko, also known as Denis Katana, to a Russian organized crime ring involved in money laundering through Bitcoin (BTC). ","According to a report by El Español, the criminal organization, which operated in the southeastern Spanish province of Alicante, chose to use digital currency due to its perceived “lack of state control.”","The Pandora Papers leak, a collection of 12 million documents exposing offshore financial activities of global leaders, celebrities, and billionaires, previously hinted at Tokarenko’s involvement as the “Bitcoin czar.” ","The documents were released in 2021 by the International Consortium of Investigative Journalists, revealing various illicit activities such as tax evasion, money laundering, and hidden wealth.","Local authorities have said that Maxim Khakimov, a Russian entrepreneur responsible for laundering money for the crime syndicate, recruited Tokarenko. ","Khakimov employed sophisticated financial engineering tactics to transfer and receive funds from Russian clients in Spain. ","The judge presiding over the case said that Tokarenko, acting as a “cyber associate,” provided guidance to Khakimov on purchasing Bitcoin and using it to obscure the organization’s financial transactions.","Beyond their illicit activities, Tokarenko and Khakimov were reportedly closely connected, forming a relationship that extended beyond criminal endeavors. ","Spanish authorities claim that when Tokarenko was initially arrested in 2018, Khakimov, along with his lawyer, assisted in transferring money to him while he was behind bars. ","Additionally, they allegedly aided the cybercriminal in managing his investments and even hired hitmen to settle debts accumulated over the years.","Katana has gained become well-known as a cybercriminal.","In 2018, he was first apprehended for his involvement in a sophisticated computer program designed to attack ATMs worldwide. ","At the time, Katana was able to infect ATMs from his home, causing them to dispense cash to accomplices known as “mules.” ","The funds obtained were subsequently laundered through various means, including Bitcoin.","Katana’s association with Bitcoin is further evident through his connection to multiple Bitcoin wallets, reportedly amassing a fortune exceeding 15,000 Bitcoin. ","However, the judge’s recent statements focused on a single digital wallet containing 5,000 Bitcoin, valued at approximately 55 million euros during the period of the criminal operations.","The crypto space has been plagued by a series of hacks and scams since the start of the year, particularly in the third quarter of 2023. ","According to a report by blockchain security platform Immunefi, there were 76 hacks on crypto and Web3 projects and firms in Q3 2023, a significant increase compared to the 30 hacks reported in the same period in 2022.","In total, approximately $332 million has been lost to various exploits, hacks, and scams throughout September, marking a record-high month for crypto exploits. "],"entity":[{"type":"Maxim Khakimov","content":"PERSON"},{"type":"Katana","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"International Consortium of Investigative Journalists","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"El Español","content":"ORGANIZATION"},{"type":"Khakimov","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Pandora Papers","content":"ORGANIZATION"},{"type":"55 million euros","content":"MONEY"},{"type":"$332 million","content":"MONEY"},{"type":"Tokarenko","content":"PERSON"},{"type":"Denis Tokarenko","content":"PERSON"},{"type":"Denis Katana","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Spain","content":"LOCATION"},{"type":"Alicante","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Hack","Scam","Spain"],"authors":["Ruholamin Haqshanas"]}