{"summary":"SEC Argues for Injunctions in Final Response of Ripple XRP Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-argues-for-injunctions-in-final-response-in-ripple-xrp-case.htm","publishDate":"2024-05-08T13:00:30","id":18006,"type":null,"title":"SEC Argues for Injunctions in Final Response of Ripple XRP Case","category":["Blockchain News "],"content":["Ripple Labs and the United States Securities and Exchange Commission (SEC) have made significant progress in their ongoing legal battle as the SEC filed its final reply in the lawsuit’s remedies stage. ","In its recent response to the remedies brief, the SEC challenged Ripple’s assertion that the blockchain startup acted without recklessness and that there should be no “widespread uncertainty” about XRP’s legal status, despite the court previously rejecting this “fair notice” defense. The SEC also maintains its stance on the likelihood of Ripple engaging in similar actions in the future.","","The remedies brief states that Ripple has tried to minimize its liability while highlighting its cooperation with the SEC since the 2013 XRP initial coin offering. However, the SEC has stressed that, per the law, another breach remains possible even if Ripple has abstained from violations since 2020.","The SEC asserts that Ripple’s pledges to alter its conduct following the lawsuit do not warrant the avoidance of injunctions. It argues that Ripple doesn’t understand the court order and fails to acknowledge its ramifications for compliance.","And just when you think the SEC can’t sink any lower, if you are a financial regulator outside the U.S. and have done the hard work of establishing comprehensive crypto licensing frameworks, know that the SEC has no respect for you and thinks you are handing out the equivalent of… pic.twitter.com\/7qZQIkyrH4","— Stuart Alderoty (@s_alderoty) May 7, 2024","","The SEC’s response challenges Ripple’s assertions regarding sales conducted outside the United States and to accredited investors. In response to the SEC’s arguments in the remedies brief, Ripple’s chief legal officer, Stuart Alderoty, spoke on the SEC’s declining reputation. ","“If you are a financial regulator outside the U.S. and have done the hard work of establishing comprehensive crypto licensing frameworks, know that the SEC has no respect for you and thinks you are handing out the equivalent of fishing licenses.”","He pointed out that international financial regulators with robust crypto licensing frameworks might find the SEC’s efforts surprising, likening them to issuing fishing licenses. Alderoty criticized the commission for its inconsistent application of the law and expressed optimism about resolving the XRP lawsuit.Despite Ripple’s claims of acting without recklessness and minimizing uncertainty about XRP’s legal status, the SEC maintains its position and questions the likelihood of Ripple engaging in similar actions.","Ripple recently opposed the Securities and Exchange Commission (SEC)’s request for a $2 billion penalty, arguing that the proposed fines are disproportionate and punitive. Through its defense lawyer, James Filan, the company filed a detailed motion disputing the SEC’s penalty demands, suggesting a much lower penalty of $10 million instead.The opposition emphasizes that the SEC’s proposed penalties are not in line with the actual circumstances of the case. Ripple contends that no allegations or findings of reckless behavior or fraudulent activity would justify such severe financial penalties. Additionally, Ripple asserts that its XRP sales were conducted transparently and with knowledgeable institutional investors who were fully informed about the transactions.Ripple highlights its significant legal victories throughout the litigation, suggesting that the SEC’s penalty demands are inconsistent with the court’s findings. The company argues that the SEC’s request is evidence of ongoing intimidation against the crypto industry in the United States, particularly considering the lack of allegations of recklessness or fraud in the case.Ripple proposes a much lower penalty of $10 million, which is more appropriate given the nature of the alleged violations and the company’s conduct. Ripple contends that this amount would adequately serve the legal interests without being disproportionately punitive.According to analysts, the case is expected to reach a final judgment around September. The court will decide on penalties, and Ripple expresses confidence in the judge’s fair approach to the final remedies phase."],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Stuart Alderoty","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"May 7, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"James Filan","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Ripple","SEC","SEC Vs XRP"],"authors":["Hassan Shittu"]}