{"summary":"DeFi Exchange CrowdSwap Launches Decentralized Crypto ETF","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/defi-exchange-crowdswap-launches-decentralized-crypto-etf.htm","publishDate":"2024-04-03T08:35:19","id":18002,"type":null,"title":"DeFi Exchange CrowdSwap Launches Decentralized Crypto ETF","category":["Altcoin News "],"content":["Decentralized exchange CrowdSwap has launched the first decentralized crypto exchange-traded fund (ETF), comprising several crypto assets including Bitcoin and Ethereum.","Announced Tuesday, the Bull Run dETF offers investors access to diversified portfolios within crypto ecosystem. The ETF comprise of 10 tokens including Polygon (MATIC), Chainlink (LINK), Polkadot (DOT), among others.","That said, Investors can invest in these 10 tokens using just one crypto token and can withdraw into the same single crypto. The financial instrument aims to streamline investment processes, ensuring simplicity and decentralization, the company said in a press release.","“After investment, your assets will be diversified into 10 tokens, and when it’s time to withdraw, you have the flexibility to either receive these 10 tokens or have us convert your assets back into a single token of your choice.”","CrowdSwap made your journey simple at every step. 👣","Our ETFs offer the simplest investment process in the market, allowing you to acquire all the tokens in the Bullrun ETF with any token you have with just a few clicks. 🖱️➡️🎯","But CrowdSwap doesn’t stop there; after… pic.twitter.com\/jZuxz4hhfJ","— CrowdSwap (@CrowdSwap_App) April 2, 2024","","CrowdSwap’s Bull Run dETF comprise of 35% of BTC and ETF together and 10% each of large-cap altcoins like MATIC, AVAX, LINK, and DOT, the fund noted in its website.","Further, CrowdSwap conducts thorough evaluations of each asset, the release noted. During evaluations, the fund looks into key metrics including potential return on investment, risk analysis, and alignment with investor preferences.","“This meticulous approach ensures that the ETF is strategically positioned to capitalize on market opportunities while managing potential risks effectively,” it added.","Per historic data, the Bull Run dETF’s cryptoassets have shown a remarkable performance with yearly gains of more than 206%. As a result, the increase has fueled CrowdSwap’s optimism about the fund’s growth trajectory.","Additionally, the recent surge in Bitcoin ETFs has proved mainstream acceptance of cryptos as investment assets. Moving forward, CrowdSwap aims to focus on technical innovation and strategic preparation for future growth.","This includes introducing a seedless smart wallet, a Telegram DeFi bot, more decentralized ETFs, and transitioning into a DAO."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"April 2, 2024","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Telegram DeFi bot","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"206%","content":"PERCENT"},{"type":"CrowdSwap","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["CrowdSwap","ETFs"],"authors":["Sujha Sundararajan"]}