{"summary":"Robinhood Wallet Launches Exclusive NFT Giveaway From Notable.art","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robinhood-launches-exclusive-nft-giveaway-from-notable-art.htm","publishDate":"2024-02-27T14:18:26","id":18003,"type":null,"title":"Robinhood Wallet Launches Exclusive NFT Giveaway From Notable.art","category":["NFT News "],"content":["US online trading platform Robinhood has announced an exclusive non-fungible token (NFT) giveaway.","Robinhood Wallet users can now participate in the new giveaway from Notable.art, a new fine-art-centric platform bridging digital and physical art.","Specifically, they can acquire exclusive digital sketches from prominent American artist Hunt Slonem.","The campaign will consist of four total NFT giveaways happening once every two weeks. Each of these will feature different artwork by Slonem.","According to the press release shared with Cryptonews, the NFTs will be accessible via the Web3 tab in the Robinhood Wallet app on iOS.","They will be minted on Notable and delivered directly to users’ wallets.","Moreover, Notable will cover the network fees associated with minting up to the first 10,000 giveaway participants. After that, “giveaway participants will be responsible for any network fees associated with minting,” the announcement said.","The giveaway will consist of four NFT mints on February 27, March 12, March 26, and April 9.","Also, US participants who collect all four pieces can buy a physical print of one of those four sketches.","Notably, physical prints will be limited to 400 total prints: 100 prints of each NFT. Prints will be available April 23 through May 6 or until they sell out.","Meanwhile, NFTs cost $ 1,500 each.","Notable CEO Zain Talyarkhan commented that,","“Notable seeks to break down the relatively high barriers to entry in fine art collecting.”","Therefore, the platform partners with renowned visual artists to offer unique digital artworks complemented by 1-of-1 museum-quality prints “sold at accessible price points.”","According to Johann Kerbrat, Crypto General Manager at Robinhood, the company sees an opportunity to increase access to Web3. Robinhood Wallet, he added, is “breaking down barriers and making it easier for people to access web3 and explore new projects or initiatives they might not have otherwise.”","Slonem is a famous colorist known for his Neo-Expressionist style. Its “striking fauvist color palette [is] often used to emphasize his lifelong fascination with animals and exotic locations,” the announcement noted.","“Art is a way to inspect our lives and think beyond our ordinary experiences,” said Slonem. Commenting on the dive into the world of NFTs, he explained that,","“Through my work, I strive to capture not just the vividness of nature, but the essence that animates it. The union between art and life — and now technology — extends my practice beyond the brush. I’m looking forward to showing my work in a fresh context and engaging new audiences in a fun and spirited way.”","Moreover, Slonem’s physical artworks individually cost at least tens of thousands of dollars. His pieces have been featured in more than 350 international exhibitions at prestigious galleries and cultural institutions. These include the Metropolitan Museum of Art, the Solomon R. Guggenheim Museum, and the Whitney Museum of American Art in New York City, USA.","Meanwhile, earlier in February, Robinhood reported that its transactions-based revenues in Q4 2023 rose 8% compared to the same quarter the preceding year.","Its increased profit-taking was “primarily driven by cryptocurrencies revenue of $43 million, up 10%,” it added.",""],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"tens of thousands of dollars","content":"MONEY"},{"type":"$43 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"USA","content":"ORGANIZATION"},{"type":"March 26","content":"DATE"},{"type":"April 23","content":"DATE"},{"type":"Crypto General Manager","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Whitney Museum of American Art","content":"ORGANIZATION"},{"type":"Solomon R. Guggenheim Museum","content":"ORGANIZATION"},{"type":"Zain Talyarkhan","content":"PERSON"},{"type":"February 27","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"March 12","content":"DATE"},{"type":"Slonem","content":"PERSON"},{"type":"Johann Kerbrat","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"April 9","content":"DATE"},{"type":"$ 1,500","content":"MONEY"}],"hashtag":["Art","NFT","Robinhood"],"authors":["Sead Fadilpašić"]}