{"summary":"Crypto Lending Crisis – Gemini and Genesis Charged by US SEC With Selling Unregistered Securities","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-lending-crisis-gemini-and-genesis-charged-by-us-sec-with-selling-unregistered-securities.htm","publishDate":"2023-01-13T12:05:00","id":18016,"type":null,"title":"Crypto Lending Crisis – Gemini and Genesis Charged by US SEC With Selling Unregistered Securities","category":["Altcoin News "],"content":["The US Securities and Exchange Commission (SEC) brought charges against major crypto exchange Gemini and the troubled crypto lending and trading firm Genesis. ","Per the press release issued by the regulator on January 12,","“The [SEC] today charged Genesis Global Capital, LLC and Gemini Trust Company, LLC for the unregistered offer and sale of securities to retail investors through the Gemini Earn crypto asset lending program.” ","The regulator alleged that through this unregistered offering, the two companies raised “billions of dollars” worth of crypto assets from “hundreds of thousands of investors.” ","The complaint seeks permanent injunctive relief, disgorgement of ill-gotten gains and prejudgment interest, as well as civil penalties.","We @SECGov charged Genesis & Gemini for the unregistered offer & sale of crypto asset securities through Gemini Earn.\n\nCrypto intermediaries need to comply with our securities laws. This protects investors. It promotes trust in markets. It’s not optional. It’s the law.","The SEC’s complaint alleges that the Gemini Earn program constitutes an offer and sale of securities and that it should have been registered with the regulator. According to the SEC Chair Gary Gensler,","“We allege that Genesis and Gemini offered unregistered securities to the public, bypassing disclosure requirements designed to protect investors. Today’s charges build on previous actions to make clear to the marketplace and the investing public that crypto lending platforms and other intermediaries need to comply with our time-tested securities laws.”","As a reminder, back in December 2020, Genesis, the parent company of which is Barry Silbert’s Digital Currency Group (DCG), partnered with Gemini, founded by the Winklevoss twins, to enable the exchange’s customers to loan their crypto to Genesis in exchange for interest. ","In February 2021, Genesis and Gemini launched the Gemini Earn program to retail investors, where Gemini deducted an agent fee from the returns Genesis paid to Gemini Earn investors. “As alleged in the complaint, Genesis then exercised its discretion in how to use investors’ crypto assets to generate revenue and pay interest to Gemini Earn investors,” said the press release.","In November 2022, Genesis said Gemini Earn investors could no longer withdraw their crypto due to a lack of sufficient liquid assets as a result of the market volatility. Per the complaint, Genesis at the time held some $900 million in assets from 340,000 Gemini Earn investors. ","Gemini ended the Gemini Earn program days ago, but “as of today, the Gemini Earn retail investors have still not been able to withdraw their crypto assets,” the SEC said.","Gemini’s Earn program, supported by Genesis’ lending activities, met the SEC’s definition by including both an investment contract and a note, as the two features are part of how the SEC assesses whether an offering is a security, CNBC reported.","Per this report, citing the Commission, in the first three months of 2022, Gemini made around $2.7 million in agent fees off Earn, and over the same period, Genesis paid out $166.2 million in interest to clients, including Gemini, on $169.8 million of interest income.","In a tweet, Tyler Winklevoss called the SEC’s actions “counterproductive” and claimed that Gemini has been in discussions with the SEC over the Earn program for months.","He wrote that,","“Despite these ongoing conversations, the SEC chose to announce their lawsuit to the press before notifying us. Super lame. It’s unfortunate that they’re optimizing for political points instead of helping us advance the cause of 340,000 Earn users and other creditors. […]  We look forward to defending ourselves against this manufactured parking ticket.”","2\/ As a matter of background, the Earn program was regulated by the @NYDFS and we’ve been in discussions with the SEC about the Earn program for more than 17 months. They never raised the prospect of any enforcement action until AFTER Genesis paused withdrawals on November 16th."," ","Meanwhile, CNBC reported that, per the SEC officials, the possibility of a DCG or Genesis bankruptcy had no bearing on deciding whether to pursue a charge.","And the above seems not to be all the bad news coming the crypto industry’s way, with the SEC stating that,","“Investigations into other securities law violations and into other entities and persons relating to the alleged misconduct are ongoing.”","Gurbir S. Grewal, Director of the SEC’s Division of Enforcement, said that the recent collapse of crypto asset lending programs, as well as the suspension of Genesis’ program, show that there is a “critical need” for platforms that are offering “securities to retail investors” to comply with the federal securities laws. ","Grewal added that, ","“Our investigations in this space are very much active and ongoing and we encourage anyone with information about this matter or other possible securities law violations to come forward, including under our Whistleblower Program if applicable.”","The SEC’s Whistleblower Program was created by Congress to provide monetary incentives for individuals to report possible violations of federal securities laws. The “eligible whistleblowers” can get an award between 10% and 30% of “the monetary sanctions collected in actions brought by the SEC and related actions brought by certain other regulatory and law enforcement authorities,” said the press release.","____","Learn more: \n– Gemini Exchange Seeks to Retrieve $900 Million from Crypto Lender Genesis\n– Crypto Brokerage Genesis Global Trading Asks for More Time to Resolve Lending Issues – What is Going On?\n\n– DCG Said to be in Talks with Creditors – Will Gemini Crypto Depositors Get Their Money Back?\n– Cameron Winklevoss Calls for DCG Board to Sack Barry Silbert"],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Crypto Lender Genesis\n– Crypto Brokerage Genesis Global Trading Asks","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"DCG Board","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Genesis & Gemini","content":"ORGANIZATION"},{"type":"January 12","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"$166.2 million","content":"MONEY"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Genesis","content":"LOCATION"},{"type":"“billions of dollars","content":"MONEY"},{"type":"Gemini Trust Company","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"$900 million","content":"MONEY"},{"type":"Gemini Exchange","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"the first three months of 2022","content":"DATE"},{"type":"Gemini","content":"PERSON"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Creditors – Will Gemini Crypto Depositors","content":"ORGANIZATION"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"$169.8 million","content":"MONEY"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"November 16th","content":"DATE"},{"type":"$900 Million","content":"MONEY"},{"type":"Barry Silbert’s Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Genesis","content":"ORGANIZATION"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["Gemini","Investing","Legal","SEC","USA"],"authors":["Sead Fadilpašić"]}