{"summary":"FTX announced it has closed a new $420.69 million raise, just months after it raised over $900 million in a Series B round.\nIt will help the firm acquire companies and navigate uncertain regulatory waters.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121428\/ftx-420-million-round-69-investors-tiger-ribbit","publishDate":"2021-10-21T08:00:23","id":1801,"type":null,"title":"FTX raises $420 million in funding round backed by 69 investors","category":["Startups"],"content":["Crypto exchange group FTX announced on Thursday the close of a fundraising round that values the company at $25 billion, adding $420.69 million to its war chest to make acquisitions and launch new products.","The announcement comes just a few months after the firm — which prohibits U.S. residents from trading on its main platform — said it raised <a href=\"https:\/\/www.theblockcrypto.com\/post\/112014\/ftx-900-million-funding\" data-v-f87c67ca=\"\">more than $900 million<\/a> in a Series B round that valued the firm at $18 billion. Investors across the crypto market have been pouring into private companies, boosting valuations beyond unicorn status for firms like FalconX, TradingView, and OpenSea.&nbsp;","Per the announcement shared with The Block, FTX's new funding round included participation from 69 investors including Tiger Global, Ribbit Capital, and \"funds and accounts managed by BlackRock.\" Other participants include Lightspeed Ventures, Sequoia Capital, and Sea Capital.&nbsp;","Billionaires Alan Howard and Israel Englander backed it in its previous round.&nbsp;","The firm — which operates markets that facilitate trading in crypto derivatives and other instruments — also announced that the Singapore government-owned investment giant Temasek participated in its Series B. FTX's CEO Sam Bankman-Fried remains a majority owner of the firm.&nbsp;","Bankman-Fried said that new investors decided to join its cap table because of its recent growth. Open interest in FTX's bitcoin futures market soared to nearly $4 billion since May, when open interest stood at around $1 billion. Still, rival Binance saw futures open interest hit nearly $5.5 billion this week. Meanwhile, FTX only accounts for about 37% of Coinbase's volumes in spot crypto trading, as per The Block's Data Dashboard.&nbsp;","","","\"Market share is up substantially since the start of the first fundraise,\" Bankman-Fried said.&nbsp;","The firm has also expanded its business, launching a platform for non-fungible token trading as well as purchasing futures platform LedgerX for an undisclosed sum.&nbsp;","The fresh injection of capital could help FTX acquire more firms in the near term, according to Bankman-Fried. The billionaire California-native and former trader told The Block that acquisitions could help the firm more quickly expand its product suite in a way that mimics its purchase of LedgerX, which could allow it to offer perpetual swaps to US crypto traders.","\"I would probably guess there will be another three or so,\" Bankman-Fried said. \"Maybe two small ones ... three moderate to big ones.\"","In aggregate, those deals could top $1 billion in value, according to SBF.&nbsp;","Other new products include a potential FTX branded exchange-traded fund, Bankman-Fried said.&nbsp;","\"Whether it is a spot or futures based ETF, we'd be willing to talk about structured products with partners like BlackRock.\"","Still, FTX — like companies across the crypto landscape — has to worry about the ire of regulators. The firm, which recently moved its headquarters from Hong Kong to the Bahamas, still can not do business in New York. The firm has aspirations to offer access to clients in the empire state in the next year.&nbsp;","As for revenues, Bankman-Fried said that he expects to double FTX's revenues over the next year from $1 billion, adding \"ideally we get to 3 or 4x.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["FTX"]}