{"summary":"A  judge has ordered Ryder Ripps and Jeremy Cahen pay Yuga Labs nearly $1.6 million in damages in “copycat” NFT lawsuit.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259711\/ryder-ripps-must-pay-yuga-labs-nearly-1-6-million-over-copyright-infringement-lawsuit","publishDate":"2023-10-26T17:08:09","id":1802,"type":null,"title":"Ryder Ripps must pay Yuga Labs nearly $1.6 million over copyright infringement lawsuit","category":["Legal"],"content":["A U.S. District Court judge <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.cacd.855658\/gov.uscourts.cacd.855658.431.0.pdf\" data-v-f87c67ca=\"\">has ordered<\/a> Ryder Ripps and <span data-v-f87c67ca=\"\">Jeremy Cahen pay Yuga Labs nearly $1.6 million in damages, plus legal fees, thus bringing an end to a long-running lawsuit.<\/span>","Yuga Labs <a href=\"https:\/\/www.theblock.co\/post\/195945\/bored-ape-yuga-lab-lawsuit-ryder-ripps\" data-v-f87c67ca=\"\">sued<\/a> Ripps and <span data-v-f87c67ca=\"\">Cahen for violating its intellectual property through \"copycat\" NFTs that the company said devalued the Bored Ape Yacht Club collection. The company filed its lawsuit in June 2022.<\/span>","<span data-v-f87c67ca=\"\">Bored Ape Yacht Club, or BAYC, is arguably the most valuable non-fungible token collection on the market. <\/span>At one point, Ripps argued the lawsuit was an attack on his freedom of speech and <a href=\"https:\/\/www.theblock.co\/post\/157281\/ryder-ripps-instructs-lawyers-ahead-of-yuga-labs-court-case-will-only-settle-for-100-billion\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> that he would settle the case for no less than $100 billion.","The verdict will likely be a considered a victory for NFT creators concerned about protecting the intellectual property rights of the collections they create and sell.","\"The strength of Yuga’s litigating position makes this case exceptional in comparison to the majority of other trademark infringement cases. This case is dramatically different than most trademark infringement cases because it involves Defendants who are using the cover of satire and parody to justify their use of Yuga’s BAYC Marks without Yuga’s consent,\" the court order read.","\"Defendants’ conduct during the pendency of this litigation warrants a finding that this is an exceptional case. Defendants were obstructive and evasive throughout their depositions and during their trial testimony, which unnecessarily complicated these proceedings,\" it continued."],"hashtag":["BAYC"]}