{"summary":"Animoca Brands, a web3 investor focused on gaming and metaverse, invested an undisclosed amount in EthSign, a decentralized electronic signature platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213231\/animoca-brands-ethsign-investment-tokentable","publishDate":"2023-02-20T09:00:40","id":1802,"type":null,"title":"Animoca Brands invests in EthSign to back its new product TokenTable","category":["DEALS"],"content":["Animoca Brands, a web3 investor focused on gaming and metaverse, invested an undisclosed amount in EthSign, a decentralized electronic signature platform.","The investment will help EthSign continue building its token management platform called TokenTable and launch it publicly, EthSign said Monday. TokenTable is currently live in beta and allows users to manage the issuance and distribution of tokens.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">While the investment amount wasn't disclosed, EthSign co-founder Potter Li told The Block that the firm's total funding to date now stands at $14 million. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Since EthSign has <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/136806\/ethsign-crypto-funding-sequoia-capital-all-three-units\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">previously raised<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> $12.65 million in two funding rounds, that would suggest Animoca invested $1.35 million in the company. <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/199352\/animoca-halves-fundraising-target-for-web3-fund-to-1-billion-bloomberg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Animoca Brands<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> declined to comment on the size of the investment.<\/span>","EthSign's TokenTable <a href=\"https:\/\/medium.com\/ethsign\/tokentable-beta-launch-35277a3bddf\" data-v-f87c67ca=\"\">went live<\/a> last week in beta. It lets web3 founders, investors and employees manage token holdings on chain.","The current token management process is tedious, according to EthSign. Founders have to manually distribute and track token allocations, while investors and employees have to keep track of dates of token unlocks, it said. TokenTable, on the other hand, leverages blockchain technology for record-keeping, fund transfer and agreement enforcement, EthSign said.","\"TokenTable puts terms of legal agreements into the smart contract, thereby ensuring that the investment terms of every agreement signed on the platform are executed — this is a major step in bolstering the rule of law with the rule of code,\" according to EthSign.","Animoca Brands itself seeks to benefit from TokenTable, being an investor in more than 380 firms and a frequent recipient of token allocations.","\"Many projects use excel spreadsheets to calculate and track token allocation and unlocking, which is inefficient, not secure, and highly inconvenient,\" Yat Siu, co-founder and chairman of Animoca Brands, said in a statement. \"EthSign's TokenTable addresses these challenges to enable a new standard of operational efficiency for web3 businesses.\"","TokenTable currently supports Ethereum and Polygon and has plans to expand to other Ethereum virtual machine-compatible chains and Layer 2 networks in the future, said Li.","EthSign was founded in 2019 in Singapore. Its first product, Signatures, is seen as a decentralized version of DocuSign. It allows users to sign and manage agreements on-chain via crypto wallets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"$1.35 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Potter Li","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"$14 million","content":"MONEY"},{"type":"$12.65 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"EthSign","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS"],"authors":["Yogita Khatri","The Block"]}