{"summary":"‘BBL Drizzy’ Coin Surges Amid Drake and Kendrick Lamar Feud as Another Coin Secures $13 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bbl-drizzy-coin-surges-amid-drake-and-kendrick-lamar-feud-as-another-coin-secures-13-million.htm","publishDate":"2024-05-10T16:21:45","id":18039,"type":null,"title":"‘BBL Drizzy’ Coin Surges Amid Drake and Kendrick Lamar Feud as Another Coin Secures $13 Million","category":["Industry Talk "],"content":["Hip Hop is back with a bang in 2024, as industry legends Kendrick Lamar and Drake duke it out for the crown in an increasingly hostile rap battle – and Solana meme coin markets haven’t missed a beat, with new OVHoe (BBL DRIZZY) token skyrocketing.","This article will provide an analysis of BBL DRIZZY’s current price trends in the Solana meme coin market and look to see whether an innovative new meme coin, DOGEVERSE, represents a more promising investment opportunity at this time.","THAT #BBLDRIZZY 🎶🎶🎶$OVHOE READY TO TAKEOVER ON $SOL#bbldrizzybeatgiveaway","2XVM8tGgbSkf6myELvtHsEwN9mZux8T5kKw2vaximEzK pic.twitter.com\/ZAYTNfTxf3","— BBL DRIZZY (@ovozempic) May 9, 2024","","BBL DRIZZY undertook an exceptional rally as retail investors flocked to the meme value surrounding Drake’s tumultuous exchange with Kendrick – which has so far seen Drizzy branded as a sexual predator, ‘deadbeat’ Dad, master manipulator, and target for physical shootings.","As price action attempts to consolidate down at lower support, BBL DRIZZY is currently trading at a market price of $0.000709 (representing a 24-hour change of -31%).","This comes after OVHOE undertook an exceptional Solana meme coin launch at 20:00 UTC on May 9, in a listing that gained instant traction with the price exploding a whopping +13,500% in the first 4 hours.","Hitting an all-time high at $0.0034, the following hours have seen a major retracement move grip the chart – with price action so far down -78%.","","However, with consolidation now risking a second re-test of lower support at $0.0074, OVHOE is in a make-or-break position which could see the token sink-or-swim.","Yet, there remain tangible reasons to be optimistic about BBL DRIZZY price action, with OVHOE’s market cap still alluring retail investors enamored by the Kendrick Lamar – Drake beef at $70k.","Indeed, despite not being officially affiliated with the duo, there is potential that the release of further diss tracks could lead to bullish action returning to the coin.","Although, as ever with meme coins, that is pure speculation.","Meanwhile, an emerging crypto presale has unlocked viral success, having raised over $13M in a matter of weeks and there is still time to get involved","","While SOL presents a market-leading opportunity, the most significant gains are often found in presale investments, which allow investors to get in early and potentially secure the majority of a project’s growth.","Just imagine investing in BBL DRIZZY before it hit the market and skyrocketed 30,000%.","One such opportunity in the SOL ecosystem is the DOGEVERSE presale – which has unlocked viral success over the last month to hit $13M raised in the ongoing presale.","Shit! Wormholed to the wrong place again!","Definitely NOT going there! 🏝️#Memecoins #Ethereum #DOGE #Crypto #MemeCoinSeason2024 pic.twitter.com\/vRgssnVJdd","— DogeVerse (@The_DogeVerse) May 10, 2024","","Aiming to be the first multi-chain incarnation of DOGE, DOGEVERSE is positioned to grow rapidly as market participants race to grab a piece of the pie.","DOGEVERSE is still raising funds at the presale stage and will start preparing for exchange listings very soon.","Buy DOGEVERSE Here",""],"entity":[{"type":"Kendrick –","content":"PERSON"},{"type":"$OVHOE","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"-31%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$0.0074","content":"MONEY"},{"type":"-78%","content":"PERCENT"},{"type":"May 10, 2024","content":"DATE"},{"type":"May 9, 2024","content":"DATE"},{"type":"$0.000709","content":"MONEY"},{"type":"$0.0034","content":"MONEY"},{"type":"Kendrick Lamar – Drake","content":"PERSON"},{"type":"+13,500%","content":"PERCENT"},{"type":"30,000%","content":"PERCENT"},{"type":"Drake","content":"PERSON"},{"type":"$SOL","content":"MONEY"},{"type":"May 9","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Kendrick Lamar","content":"PERSON"},{"type":"$70k","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$13M","content":"MONEY"},{"type":"Solana","content":"LOCATION"}],"hashtag":["BBL Drizzy","Drake","Kendrick Lamar"],"authors":["Sam Cooling"]}