{"summary":"US Lawmakers Introduce New Bill For Clarification on Taxation of Staking Rewards","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-lawmakers-introduce-new-bills-for-clarification-on-taxation-of-staking-rewards.htm","publishDate":"2024-05-02T03:30:58","id":18034,"type":null,"title":"US Lawmakers Introduce New Bill For Clarification on Taxation of Staking Rewards","category":["Blockchain News "],"content":["Two bipartisan U.S. lawmakers, Representatives Drew Ferguson and Wiley Nickel, have proposed the Providing Tax Clarity for Digital Assets Act to address taxation issues related to block rewards earned by crypto miners. ","The bill aims to clarify the tax treatment of staking rewards, proposing that they should only be taxed at the time of their sale rather than upon acquisition. This move seeks to prevent double taxation and provide much-needed clarity for investors and businesses in the digital asset industry.","","Representative Ferguson emphasized the complexity of the current tax treatment of digital asset rewards, highlighting the confusion it causes among investors and the potential for American businesses to relocate overseas due to regulatory uncertainty.","“The United States has long been the leader in innovation and technology yet is falling behind our foreign counterparts in providing tax clarity for the emerging digital asset industry. The United States’ treatment of digital asset rewards is overly complex – leading to confusion by investors, double taxation, and American businesses relocating overseas,” said Ferguson.","The proposed legislation aims to establish clear tax guidelines for block rewards from proof-of-work and proof-of-stake networks, aligning taxation with the sale or spending of these rewards rather than their acquisition.","I’m proud to introduce the Providing Tax Clarity for Digital Assets Act with @RepDrewFerguson to ensure clear guidance on the taxation of digital assets.","This is a critical step that will spur innovation, strengthen investor confidence & discourage business from moving overseas. https:\/\/t.co\/rDpvvEhIBI","— Rep. Wiley Nickel (@RepWileyNickel) April 30, 2024","","The move comes in response to recent IRS rulings and the landscape of digital assets taxation. The bill seeks to provide much-needed clarity and fairness in tax treatment, ensuring that block rewards are taxed only once, at the time of their sale or exchange. ","This initiative reflects growing bipartisan efforts to address regulatory challenges in the digital asset space and foster innovation within the United States. Even Sheila Warren, CEO of the Crypto Council for Innovation, called the legislation “right on point” for providing adequate guidance.","Grateful to @RepDrewFerguson and @RepWileyNickel for their leadership regarding digital asset taxation through this thoughtful bipartisan bill. Among other things, the Providing Tax Clarity for Digital Assets Act will provide needed clarity when it comes to staking, mining, and… https:\/\/t.co\/zLvnjN06hj","— Sheila Warren (@sheila_warren) May 1, 2024","","According to a Democratic aide on Capitol Hill, proposed stablecoin legislation is unlikely to be attached to the Federal Aviation Administration’s (FAA) reauthorization bill. Despite efforts by Representatives Maxine Waters and Patrick McHenry, leaders in both the Senate and the House of Representatives are hesitant to merge stablecoin legislation with the FAA bill, which is considered a must-pass piece of legislation.","While combining the two bills would be unprecedented in financial services policy, lawmakers typically add less popular legislation to larger bills to garner bipartisan support.","The Digital Chamber’s chief policy officer, Cody Carbone, expressed scepticism about the likelihood of stablecoin legislation passing before the U.S. presidential election, giving it only a 35% chance. Carbone highlighted the ongoing debate surrounding key issues such as regulatory oversight and state-level regulation, which have hindered the progress of stablecoin bills like Representative Patrick McHenry’s Clarity for Payment Stablecoins Act and the Lummis-Gillibrand Payment Stablecoin Act. "],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"FAA","content":"ORGANIZATION"},{"type":"Gillibrand","content":"ORGANIZATION"},{"type":"Sheila Warren","content":"PERSON"},{"type":"May 1, 2024","content":"DATE"},{"type":"Digital Chamber’s","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Federal Aviation Administration","content":"ORGANIZATION"},{"type":"Wiley Nickel","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Ferguson","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"Representatives Maxine Waters","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"April 30, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Crypto Regulations","Staking","USA"],"authors":["Hassan Shittu"]}