{"summary":"Hong Kong Government Seeks Public Input on Legislation for Stablecoin Supervision","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-government-seeks-public-input-on-legislation-for-stablecoin-supervision.htm","publishDate":"2023-12-27T11:06:33","id":18046,"type":null,"title":"Hong Kong Government Seeks Public Input on Legislation for Stablecoin Supervision","category":["Blockchain News "],"content":["The Financial Services and the Treasury Bureau (FSTB), and the Hong Kong Monetary Authority (HKMA) have jointly introduced a public consultation paper outlining a legislative proposal to regulate issuers of stablecoins. This move is prompted by the increasing prominence of stablecoins within the Web3 and virtual asset (VA) ecosystems, coupled with the growing interconnection between traditional financial systems and VA markets.","The public consultation period for the proposed legislative measures commenced on December 27, 2023, and will run until February 29, 2024. Throughout this period, industry participants and the general public are encouraged to provide comments on the regulatory proposal.","The primary objective of the proposed regulatory regime is to address potential monetary and financial stability risks associated with stablecoins while establishing appropriate guidelines for the expanding virtual asset landscape.","Key features of the proposed legislative framework include the introduction of a new piece of legislation to implement a licensing regime. Under this regime, all issuers of fiat-referenced stablecoins (FRS) meeting specific conditions will be required to obtain a license from the Monetary Authority (MA).","The consultation paper outlines that only specified licensed entities will be permitted to offer FRS, and such stablecoins licensed by the MA can be provided to retail investors. The proposal further restricts the advertising of FRS issuance by unlicensed entities or non-specified licensed entities offering FRS.","The regulatory framework equips authorities with the necessary powers to adjust stablecoin parameters and activities in response to the rapid evolution of the virtual asset market. Additionally, it introduces a transitional arrangement to facilitate the smooth implementation of the regulatory regime.","The Secretary for Financial Services and the Treasury, Mr Christopher Hui, said,","“With the implementation of the licensing regime for VA trading platforms from June this year, the legislative proposal to regulate FRS is another important measure facilitating Web3 ecosystem development in Hong Kong.”","The Hong Kong Monetary Authority (HKMA) has put forth a proposal for regulating stablecoins and concurrently introduced a sandbox arrangement to convey supervisory expectations and compliance guidance. The sandbox initiative aims to solicit feedback on the proposed regulatory requirements and provide a space for entities interested in issuing stablecoins in Hong Kong to test their operations within a controlled environment.","This regulatory development is part of Hong Kong’s broader efforts to establish a comprehensive framework for virtual assets and stablecoins. In 2023, Hong Kong took significant steps in crypto regulation, distinguishing itself with a more proactive approach compared to many Western counterparts. The HKMA implemented a licensing regime for virtual asset trading platforms earlier in the year, ensuring strict compliance with Anti-Money Laundering regulations.","The discussions on stablecoin regulations in Hong Kong began in January 2022, involving the presentation of policy-related questions and outlining potential regulatory outcomes, including scenarios ranging from no action to a blanket ban.","In October, Hong Kong regulators announced restrictions on the trading of certain stablecoins, including Tether and USD Coin, for retail investors due to associated risks. They emphasized that retail trading of stablecoins would not be permitted until they were officially regulated.","The HKMA’s proposal for stablecoin regulation aligns with the jurisdiction’s commitment to fostering a regulated and secure environment for virtual assets. The sandbox initiative offers a collaborative space for industry participants to provide feedback and engage with regulators, contributing to the formulation of effective and balanced regulatory measures."],"entity":[{"type":"Mr Christopher Hui","content":"PERSON"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"June this year","content":"DATE"},{"type":"December 27, 2023","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"VA","content":"ORGANIZATION"},{"type":"Monetary Authority (MA)","content":"ORGANIZATION"},{"type":"February 29, 2024","content":"DATE"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Secretary for Financial Services","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["HKMA","Hong Kong","Stablecoin"],"authors":["Hassan Shittu"]}