{"summary":"South Korean Prosecutor Jailed for Leaking Info in Crypto Fraud Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-prosecutor-jailed-for-leaking-info-in-crypto-fraud-case.htm","publishDate":"2024-04-25T23:30:40","id":18057,"type":null,"title":"South Korean Prosecutor Jailed for Leaking Info in Crypto Fraud Case","category":["Blockchain News "],"content":["A South Korean prosecutor was jailed for leaking sensitive information in a high-profile crypto fraud case, domestic media outlets reported on April 25.","Per Segye Ilbo, Gwangju District Court’s Criminal Division sentenced an unnamed prosecution investigator (aged 56) in the city of Mokpo to a year in prison.","The court heard that the prosecutor took a bribe in exchange for disclosing information about an active prosecution and police probe into altcoin-related fraud.","The case has captivated the public attention in South Korea. Investigators think that a suspected fraudster (aged 45) hired a “broker” to bribe several public officials.","A total of 15 prosecutors and police officials are currently facing trial on suspicion of corruption – all related to the same broker.","The broker (aged 63) tried to derail the investigation into the suspected fraudster by paying cash bribes to the prosecutor (referred to as A).","In addition, the broker also paid for A’s “entertainment” – in the form of meals and golf course fees.","In total, the court heard, the broker spent almost $10,000 trying to convince the prosecutor to halt the probe.","Prosecution officials explained that A leaked confidential information to the broker “between December 2020 and March 2021.”","💀 North Korea’s state-sponsored hacking collective Lazarus group is reportedly targeting LinkedIn users in the digital asset industry as part of its latest crypto hacking malware attempt.#CryptoNews #Lazarushttps:\/\/t.co\/Xh8y1rRKAF","— Cryptonews.com (@cryptonews) April 24, 2024","","The broker, the court heard, was a well-known individual who had “formed close relationships with high-ranking prosecutors and police officers.”","A also gave the suspected fraudster legal advice and helped the latter write a statement, prosecution officials said.","The media outlet explained that A initially “denied all charges,” but started making certain confessions “mid-trial.”","A began by saying that they had indeed played on golf courses and eaten meals in restaurants, with the broker footing the bill."," ","But A started to insist that they had “never provided information” about the active investigation.","However, the court ruled that A was not telling the truth, accepting the prosecution’s evidence about bribes.","The suspected fraudster also appears to have given a statement indicating that A did indeed pass on confidential information.","The presiding judge noted that it was clear that A had received “money and valuables” on three occasions.","The judge ruled that A was “guilty of receiving money,” adding:","“[A] has undermined the public’s trust in investigative agencies, and the amount of money [A] received is not insignificant.”","However, the judge added that the court had been clement as A had “admitted to some crimes, albeit belatedly, and has faithfully served as a public official for over 30 years.”","South Korea is at the heart of the global cryptocurrency resurgence, and one exchange dominates the local market https:\/\/t.co\/yjzpZYFBU0","— Bloomberg (@business) April 25, 2024","","The broker, meanwhile, has already been convicted of bribery and attempting to divert the course of a police investigation.","A court sentenced the broker to three years and six months in prison, and fined him over $1.2 million. It is not yet clear if the broker intends to appeal this verdict.","The same court heard that the suspected crypto fraudster gave the broker “money and valuables worth over $1.1 million” with which to bribe police and prosecutors.","The valuables “included several imported cars,” prosecution officials said.","Police think the suspected fraudster cheated over a dozen crypto-keen victims out of approximately $2.1 million.","Officers think the man duped investors into paying him to “buy a [crypto] trading firm.”","They also think he pretended to make NFT and Ethereum (ETH) investments on his “victim’s” behalf."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"April 25, 2024","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Gwangju District Court’s Criminal Division","content":"ORGANIZATION"},{"type":"$1.2 million","content":"MONEY"},{"type":"$2.1 million","content":"MONEY"},{"type":"Segye Ilbo","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.1 million","content":"MONEY"},{"type":"April 25","content":"DATE"}],"hashtag":["Legal","South Korea"],"authors":["Tim Alper"]}