{"summary":"Hackers Take Over Crypto Hardware Wallet Trezor’s X Account – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hackers-take-over-crypto-hardware-wallet-trezors-x-account-whats-going-on.htm","publishDate":"2024-03-20T15:56:37","id":18069,"type":null,"title":"Hackers Take Over Crypto Hardware Wallet Trezor’s X Account – What’s Going On?","category":["Blockchain News "],"content":["Crypto hardware wallet Trezor’s X account fell in the hands of hackers on Tuesday, sounding alarm to its 528,000 followers.","The security breach is suspected to be a SIM-swap attack and according to reports, the compromised account began promoting a fake token sale. The fake ad post was however removed later.","Community alert: Trezor X\/Twitter account is currently compromised pic.twitter.com\/hNm2OUjEgE","— ZachXBT (@zachxbt) March 19, 2024","","The series of fraudulent messages promoted the presale of “$TRZR” tokens on the Solana Network. The nefarious posts also shared links to “wallet drainer” contracts that potentially drains digital assets of users who interacted with them.","Online crypto sleuth ZachXBT and crypto security firm Scam Sniffer identified the hack first, preventing large-scale losses.","Additionally, ZachXBT wrote that the perpetrators managed to steal $8.1K from Trezor’s Zapper account (including 25% drainer fee).","One of the posts from the hackers mentioned a new memecoin dubbed Slerf on Solana blockchain. According to crypto analyst John Holmquist the incident is a major breach from a security company.","He slammed Trezor adding, “Good time to mention you can use a Trezor as a security key for 2FA to secure your Twitter account?”","Trezor is not having a presale.","Trezor's account is compromised…","Good time to mention you can use a Trezor as a security key for 2FA to secure your Twitter account?","Absolutely major L from a security company, please take account security more seriously. pic.twitter.com\/ZQtgqdRx6G","— Jon_HQ (@Jon_HQ) March 19, 2024","","The security firm has sold over 2 million crypto hardware wallets worldwide since its inception in 2012. As a result, the incident marks a major blow on the firm’s reputation.","Several users took to X (Twitter) questioning the safety of the wallet. One user named Pledditor criticized the company, being a security firm itself, failing to secure its own social media account.",".@Trezor's account is hacked","There's some deep irony that these hardware wallet companies can't even secure their own twitter accounts pic.twitter.com\/z4j7gVHJey","— Pledditor (@Pledditor) March 19, 2024","","Another user DigitalHustlerX called the incident as “hard, funny and shameful.”","“Its, hard, funny and shameful at the same damn time that they don’t even practice what they or take their own advice.”"],"entity":[{"type":"2 million","content":"MONEY"},{"type":"John Holmquist","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Solana Network","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"2012","content":"DATE"},{"type":"March 19, 2024","content":"DATE"},{"type":"$8.1","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$TRZR","content":"MONEY"}],"hashtag":["Hack","zachxbt"],"authors":["Sujha Sundararajan"]}