{"summary":"South Korean Gaming Giant WeMade Must Pay $41M ‘Crypto Tax’ Bill","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-gaming-giant-wemade-must-pay-41m-crypto-tax-bill.htm","publishDate":"2024-01-03T23:30:05","id":18066,"type":null,"title":"South Korean Gaming Giant WeMade Must Pay $41M ‘Crypto Tax’ Bill","category":["Blockchain News "],"content":["The South Korean gaming firm WeMade has been hit with a $41 million tax bill for its crypto-related activities.","Yonhap reported that the National Tax Service (NTS) issued the bill following an investigation into the firm’s historic crypto business operations.","The NTS said it had issued the bill “as a result of the Central Regional Tax Office’s integrated corporate tax investigation” into the firm “for the period 2019 to 2022.”","The tax body said WeMade’s payment deadline was February 29, adding that the surcharge to equity ratio was 10.05%.","WeMade is one of the nation’s keenest blockchain gaming proponents. The company created a blockchain and crypto-focused subsidiary named Wemade Tree in 20218.","WeMade initially spun this firm off, but in February last year, reabsorbed it into its parent company.","The firm also launched a cryptoasset named WEMIX. The coin has experienced mixed fortunes, running into a circulation data-related controversy that resulted in multiple domestic delistings in late 2022.","The company launched an unsuccessful legal bid to reverse the delisting decision in the summer of last year.","However, the coin enjoyed something of a resurgence in 2023, re-listing on many of the same platforms.","🇰🇷 South Korean Crypto Exchanges Scrap for Survival as Upbit Dominance Wanes","A “tectonic rift” is threatening to separate the South Korean crypto exchange @Official_Upbit from its rivals, as tensions begin to fray between domestic platforms.#CryptoNewshttps:\/\/t.co\/22cs4kPLe0","— Cryptonews.com (@cryptonews) December 18, 2023","","WeMade also made history last year when it sponsored the season-ending KLPGA Tour (women’s pro golf) event.","The firm gave the winning golfer, Lee Ye-won, WEMIX tokens in place of a fiat prize.","The NTS said that it had “decided to impose a surcharge” on the firm following a “tax investigation into WEMIX.","WeMade said it would not contest the bill, but suggested that “clearer” tax rules for crypto firms would help the sector. A WeMade spokesperson said:","“We plan to pay the tax bill in good faith. As the [somewhat vague] taxation of cryptoassets becomes clearer, stability will increase for businesses.”",""],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"NTS","content":"ORGANIZATION"},{"type":"South Korean","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Lee Ye","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"10.05%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"February 29","content":"DATE"},{"type":"South Korean Crypto Exchanges Scrap for Survival as Upbit Dominance Wanes","content":"ORGANIZATION"},{"type":"WeMade","content":"ORGANIZATION"},{"type":"December 18, 2023","content":"DATE"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"February last year","content":"DATE"}],"hashtag":["Gaming","South Korea"],"authors":["Tim Alper"]}