{"summary":"Merit Circle is burning 200 million tokens to reduce the circulating supply of its native token.\nAlmost all voters were in support of the move to burn the tokens.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179903\/merit-circle-burning-147-million-of-native-tokens-to-get-it-over-with","publishDate":"2022-10-26T06:05:44","id":1808,"type":null,"title":"Merit Circle burning $147 million of native tokens to &#x27;get it over with&#x27;","category":["Governance"],"content":["Gaming DAO Merit Circle has <a href=\"https:\/\/vote.meritcircle.io\/#\/proposal\/0xb304e099072121a40183e0ce30371ce927a0d3dfd9eb912c876bb934230b9223\" data-v-f87c67ca=\"\">voted<\/a> to burn 200 million of its native MC tokens, worth $147 million, in order to speed up its token burning process.","<a href=\"https:\/\/www.theblock.co\/post\/152064\/yield-guild-games-walks-away-from-merit-circle-with-10-times-its-investment-following-ouster\" data-v-f87c67ca=\"\">Merit Circle<\/a> has a total supply of 1 billion tokens, with a third of them dedicated to the community incentive wallet. So far, the only thing that's happened to these tokens is that they've been burned on a regular basis, with 130 million of the 330 million tokens destroyed. While the community could have waited to watch the remaining 200 million tokens burn slowly over the following years, it has decided to accelerate the process.","\"We believe it is in the DAO’s best interest to 'get it over with' and burn these 200 million MC tokens immediately rather than waiting for 75% to eventually be burned through MIP-7,\" said the <a href=\"https:\/\/gov.meritcircle.io\/t\/mip-20-a-200-million-merit-circle-token-burn\/671\" data-v-f87c67ca=\"\">proposal<\/a>.","The vote ended with almost unanimous support for the motion. Data from SnapShot shows that participants with a total of 12 million MC tokens supported the move. This amounted to over 99% of the total votes cast during the two-day process.","These tokens have no utility, according to the governance <a href=\"https:\/\/gov.meritcircle.io\/t\/mip-20-a-200-million-merit-circle-token-burn\/671\" data-v-f87c67ca=\"\">proposal<\/a> that necessitated today’s concluded vote. But it claimed there could be benefits to getting rid of them swiftly.","“Burning these (currently purposeless) tokens will significantly reduce the total supply of Merit Circle and will bring the fully diluted valuation more in line with the circulating market capitalization,” the proposal stated. “Likewise it will remove any doubt from outsiders about upcoming token unlocks and whether these tokens will be hitting the market.”"],"hashtag":[]}