{"summary":"Analyst: Spot Bitcoin ETFs Anticipated to Attract $220 Billion in Three Years","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/analyst-spot-bitcoin-etfs-anticipated-to-attract-220-billion-in-three-years.htm","publishDate":"2024-03-14T12:01:11","id":18092,"type":null,"title":"Analyst: Spot Bitcoin ETFs Anticipated to Attract $220 Billion in Three Years","category":["Bitcoin News "],"content":["Spot Bitcoin (BTC) exchange-traded funds (ETFs) could witness an influx of $220 billion over the next three years. ","According to a research report by broker JMP Securities, this surge in capital could potentially drive BTC’s price up fourfold to $280,000, considering the multiplier effect on new investments.","JMP analysts highlighted that if their estimates regarding inflows prove accurate, crypto exchange Coinbase (COIN) would be in a favorable position. ","The broker raised its price target for Coinbase stock to $300 from $220, the highest among Wall Street analysts, while maintaining a market outperform rating. ","Currently, Coinbase shares are trading 2.6% higher at $262.92.","Despite already surpassing expectations with $10 billion in inflows just two months after their launch, JMP believes that the current activity and flows in spot bitcoin ETFs are merely scratching the surface. ","They anticipate that flows will continue to increase significantly as ETF approval represents just the initial stage in a more extensive process of capital allocation.","“We estimate $220 billion of incremental flows will come into the ETFs over the next three years, which could also be quite impactful to bitcoin’s price given the multiplier on capital.” ","The analysts led by Devin Ryan further explained that if their estimated net ETF inflows of $220 billion are accurate and considering the current capital multiplier of approximately 25X, this alone could result in a $5.5 trillion increase in bitcoin’s market capitalization, equivalent to $280,000 per bitcoin.","In a remarkable daily record, spot bitcoin ETFs witnessed net inflows of 14,706 Bitcoins, valued at over $1 billion, on Tuesday.","The milestone sets a new record for the highest single-day net inflow since the inception of Bitcoin spot ETF trading, representing an impressive 56% increase compared to the net inflow of $673 million recorded on February 28.","Separately, JPMorgan conducted an analysis indicating that the bitcoin spot ETF market could grow to approximately $62 billion within the next two to three years, as stated in a report released by the bank last week.","Bitcoin ETFs have experienced the most successful launch in the history of ETFs.","These products accumulated over 30,000 BTC in the previous week alone, currently holding close to $30 billion.","In fact, if the trend of institutional inflows into Bitcoin continues, it could create a new phenomenon where the demand for Bitcoin surpasses the available supply, effectively creating a Bitcoin ETF liquidity crisis. ","That’s according to Ki Young Ju, CEO of on-chain analytics platform CryptoQuant, who predicted a watershed moment in BTC supply within the next six months.","Ki emphasized that as long as spot Bitcoin ETF inflows persist, the bears in the market will struggle to gain the upper hand. ","A sell-side liquidity crisis would limit the availability of sellers and result in a thinner order book, potentially leading to a higher cyclical top for the cryptocurrency."],"entity":[{"type":"$220 billion","content":"MONEY"},{"type":"February 28","content":"DATE"},{"type":"$62 billion","content":"MONEY"},{"type":"$300","content":"MONEY"},{"type":"JMP Securities","content":"ORGANIZATION"},{"type":"$280,000","content":"MONEY"},{"type":"2.6%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"56%","content":"PERCENT"},{"type":"$10 billion","content":"MONEY"},{"type":"JMP","content":"ORGANIZATION"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Devin Ryan","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$5.5 trillion","content":"MONEY"},{"type":"$673 million","content":"MONEY"},{"type":"$220","content":"MONEY"},{"type":"$262.92","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Bitcoin","inflow","spot ETF"],"authors":["Ruholamin Haqshanas"]}