{"summary":"Super-Majority of Bitcoin Holders Are Now Back in Profit + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/super-majority-of-bitcoin-holders-are-now-back-in-profit-more-news.htm","publishDate":"2023-12-06T14:00:48","id":18093,"type":null,"title":"Super-Majority of Bitcoin Holders Are Now Back in Profit + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","Bitcoin (BTC) has broken above the psychological $40,000 level, it appreciated over 140% year-to-date, it has more than doubled relative to gold, and it still dominates against the rest of the digital asset industry, according to on-chain analysis firm Glassnode.","Compared to previous cycles, the BTC return profile is “eerily similar” to the 2015-17 and 2018-22 cycles in terms of recovery duration and drawdown since the all-time high, it said, and added:","“With such strong performance, the super-majority of Bitcoin holders are now back in profit, with a small proportion of them realizing those gains.”","Several on-chain metrics suggest the recent rally is pushing the market out of a ‘transitional recovery zone.’ It now more closely resembles an ‘enthusiastic bull market.’","According to Mathieu Ziaei, Portfolio Manager and Risk Officer at Swiss regulated digital asset investment manager Criptonite Asset Management, after the Binance and US DOJ settlement, there is hype around the market’s belief that a spot BTC exchange-traded fund (ETF) would be approved in January 2024 and that the ETF will bring significant cash inflows to BTC – increasing prices across the crypto market.","Ziaei said in an email that,","“My personal opinion is that traders are going to front run the ETF with the current price action of Bitcoin. I think that around $48,000 should be the local top for bitcoin on the short term. It’s been a long time since the planets have been aligned this perfectly. With the ETF hype, end of the financial cycle and most of the risks have been eliminated, this leaves room for bitcoin to rally freely.”","There are also rumors of “financial easing.”","Given the shift in market dynamics, traders or fund managers holding a short position in digital assets would not be in a good position, Ziaei said in an email. “I would find it hard for anyone to justify having a short position on bitcoin now with all the positive news,” he added.","Black Swan events such as FTX, Luna, and Three Arrows have acted as a cleansing force, creating a bearish sentiment – which may reverse once even more euphoria kicks in, likely driven by the approval of a spot Bitcoin ETF in the US.","However, there is also a high probability of the “buy the rumor, sell the fact” move in early 2024, leading to a sharp move to the downside.","Web3 game development platform Immutable Games announced that in-game content for its flagship trading card game (TCG) Gods Unchained is now available to Amazon Prime Gaming members.","Per the press release, as part of this collaboration, Prime Gaming members who connect their in-game accounts will gain monthly access to exclusive in-game items.","This announcement coincides with the Season 2 launch of Gods Unchained, named “Far Horizons.”","“We are thrilled to announce our collaboration with Amazon Prime Gaming. Season 2 offers a new chapter in the game’s ever-evolving story that will introduce sweeping changes to the meta and players’ strategies,” said Daniel Paez, VP and Executive Producer of Gods Unchained.","The new experience will be accompanied by Tides of Fate, the company’s first major card expansion set since Mortal Judgement over a year ago.","The Tides of Fate set includes 142 collectible cards and nine in-game-only “chained” cards, which are linked to the effects of other cards.","Going forward, Gods Unchained is gearing up for its full launch on mobile devices, the announcement said.","Bitrefill, a digital marketplace for gift cards that can be purchased with crypto, launched an NFT campaign with Web3 wallet Suku. According to the announcement, the campaign enables anyone to mint a “Secret Code” cashback NFT by posting a tweet.","Any Twitter user can mint by tweeting bitrefill and sukuthis, which automatically generates a unique Bitrefill NFT containing a one-time-use code that redeems cashback on any gift card in the Bitrefill marketplace.","There is also a gamified component to the mints, with people having the chance to earn anywhere from 10% to 50% cashback NFTs.","After posting the Tweet, the user receives an NFT in their automatically-created Suku wallet, which abstracts away complicated seed phrases and private keys, the companies said, enabling an easy onramp into Web3."],"entity":[{"type":"2015","content":"DATE"},{"type":"Ziaei","content":"PERSON"},{"type":"17","content":"DATE"},{"type":"$48,000","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Criptonite Asset Management","content":"ORGANIZATION"},{"type":"US DOJ","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Luna","content":"LOCATION"},{"type":"Daniel Paez","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Gods Unchained","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Amazon Prime Gaming","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Bitrefill NFT","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"140%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"$40,000","content":"MONEY"},{"type":"TCG","content":"ORGANIZATION"},{"type":"Mathieu Ziaei","content":"PERSON"}],"hashtag":["Bitcoin","btc","ETF","Gaming","Market","NFT","Twitter","USA"],"authors":["Sead Fadilpašić"]}