{"summary":"FTX Transfers $8.3M a Day Before Amended Proposal Deadline for Restructuring Plan","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ftx-transfers-8-3m-a-day-before-amended-proposal-deadline-for-restructuring-plan.htm","publishDate":"2024-05-06T23:21:53","id":18096,"type":null,"title":"FTX Transfers $8.3M a Day Before Amended Proposal Deadline for Restructuring Plan","category":["Blockchain News "],"content":["A May 6 transfer of $8.3 million associated with the now-bankrupt FTX exchange and its sister trading firm, Alameda Research, has raised questions about the future of creditors awaiting compensation.","The transfer occurred just a day before FTX debtors were scheduled to release an amended restructuring plan for the exchange, adding a layer of intrigue to an already complex situation.","","#PeckShieldAlert #Alameda\/#FTX-labeled addresses transferred ~2K $ETH (worth ~$6.3m) out & 860 $XAUT (worth ~$2m) to #wintermute pic.twitter.com\/2ndnnGhAj2","— PeckShieldAlert (@PeckShieldAlert) May 6, 2024","","According to PeckShield alerts, two wallets linked to FTX and Alameda Research conducted the transfers. The FTX-associated wallet moved 860 Tether Gold (XAUT) tokens, valued at over $2 million, to algorithmic trading firm Wintermute. ","Meanwhile, an Alameda-related wallet transferred 2,027 Ether, worth more than $6.3 million, to two undisclosed addresses. While the exact motive behind these transactions is unclear, they coincide with a critical juncture in FTX’s bankruptcy proceedings.","The impending deadline for FTX debtors to submit an amended version of the “Plan and Disclosure Statement” on May 7 has left creditors eagerly anticipating insights into how they will be compensated for their losses. ","The amended restructuring plan promises to offer creditors more clarity regarding their path to recovery. Concerns loom large among some creditors who fear that the revised plan may not adequately address their interests, however.","One such voice of caution is Sunil, an FTX Customer Ad-Hoc Committee member representing over 1,500 FTX creditors. Sunil has urged users to scrutinize the upcoming plan, warning that it may favor debtors at the expense of creditors.","“S&C [Sullivan & Cromwell] likely include clauses to absolve their liability for crimes,” said Sunil in a May 5 X post. “S&C puppet John Ray secures a position for himself. Property rights not recognized [for creditors].”","Sunil highlighted potential issues, such as clauses to absolve liability for crimes and the lack of recognition of creditors’ property rights. ","FTX voting block","FTX plan due to filed on 7 May\n1) S&C likely include clauses to absolve their liability for crimes\n2) S&C puppet John Ray secure position for himself\n3) Property rights not recognised","1500 members we are the largest voting block vs. Eversheds (40 claim buyer… pic.twitter.com\/lXpcpvbL7n","— Sunil (FTX Creditor Champion) (@sunil_trades) May 5, 2024","","Ongoing legal battles, including lawsuits against bankruptcy firm Sullivan & Cromwell (S&C), add to the complexity. ","“S&C knew of FTX US and FTX Trading Ltd.’s omissions, untruthful and fraudulent conduct, and misappropriation of Class Members’ funds,” claimed FTX creditors in a February 16 court filing. “Despite this knowledge, S&C stood to gain financially from the FTX Group’s misconduct and agreed, at least impliedly, to assist that unlawful conduct for its own gain.”","These legal disputes further prolong the resolution process, potentially delaying creditors’ access to compensation. With over $490 million worth of claims already sold through 507 transactions, the path to resolution appears fraught with challenges.","FTX, amidst bankruptcy proceedings, recently agreed to sell the majority of its shares in AI startup Anthropic for $884 million. The deal awaits final approval from Judge John Dorsey, who oversees FTX’s bankruptcy proceedings. If approved, it would represent nearly two-thirds of FTX’s total shares in Anthropic."],"entity":[{"type":"John Dorsey","content":"PERSON"},{"type":"$ETH","content":"MONEY"},{"type":"February 16","content":"DATE"},{"type":"$XAUT","content":"MONEY"},{"type":"$6.3","content":"MONEY"},{"type":"FTX Trading Ltd.","content":"ORGANIZATION"},{"type":"S&C [Sullivan & Cromwell","content":"ORGANIZATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"May 6, 2024","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Sullivan & Cromwell (S&C)","content":"ORGANIZATION"},{"type":"Hoc Committee","content":"ORGANIZATION"},{"type":"$2m","content":"MONEY"},{"type":"May 5","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"$884 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"$6.3 million","content":"MONEY"},{"type":"$490 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"May 5, 2024","content":"DATE"},{"type":"May\n1","content":"DATE"},{"type":"Sunil","content":"PERSON"},{"type":"John Ray","content":"PERSON"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"$8.3 million","content":"MONEY"},{"type":"Sunil (FTX","content":"ORGANIZATION"}],"hashtag":["Alameda Research","FTX","FTX Bankruptcy"],"authors":["Hassan Shittu"]}