{"summary":"Pornhub first introduced cryptocurrency payments in April 2018 and now supports a variety of coins including Verge, Horizen, Tron, Tether, Tether, and PumaPay\nAccording to Pornhub vice president Corey Price, around 10% of model payments are now paid in crypto, while the percentage of subscription payments made in crypto has not seen significant growth since 2018\nThe company has recruited a designated staff member on the business development team who focuses entirely on crypto and is exploring new ways to integrate with crypto tech.  ","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58561\/pornhub-says-10-of-models-on-its-platform-opt-for-crypto-payouts","publishDate":"2020-03-12T15:07:15","id":181,"type":null,"title":"Pornhub says 10% of models on its platform opt for crypto payouts","category":["Cryptocurrency"],"content":["Around 10% of performers on adult entertainment giant Pornhub's platform are opting to be paid out in crypto, according to one of its executives.","<span data-v-f87c67ca=\"\">Pornhub has been exploring cryptocurrency payment since April 2018 when it first introduced premium subscription via privacy-oriented coin <\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/the-future-has-come-pornhub-now-accepts-verge-cryptocurrency-to-keep-current-with-its-communitys-payment-preferences-300631288.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Verge (XVG)<\/span><\/a><span data-v-f87c67ca=\"\"> on its platform. Since then, it has added support for <a href=\"https:\/\/www.horizen.global\/\" data-v-f87c67ca=\"\">Horizen<\/a> (ZEN) and <a href=\"https:\/\/tron.network\/\" data-v-f87c67ca=\"\">Tron<\/a> (TRX) as crypto payment options.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Jan. 2020, Pornhub <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/53826\/pornhub-adds-tether-to-its-payment-options-via-tron-wallet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">added<\/span><\/a><span data-v-f87c67ca=\"\"> Tether (USDT) stablecoin to its payment options using the TRONLink wallet following PayPal's abrupt decision to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/47173\/paypal-stops-processing-pornhub-payments-for-models\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">withdraw<\/span><\/a><span data-v-f87c67ca=\"\"> its service to Pornhub in Nov. 2019. TRON CEO Justin Sun previously said that Pornhub's integration with TRON is \"a brilliant way to support the victims of centralized payment platforms like PayPal.\"<\/span>","<span data-v-f87c67ca=\"\">Most recently, the platform last week began accepting <a href=\"https:\/\/pumapay.io\/\" data-v-f87c67ca=\"\">PumaPay<\/a> (PMA) tokens after first announcing the partnership in Aug. 2019. As part of the initiative, Pornhub has also integrated with PumaPay's crypto billing solution, the PullPayment Protocol.<\/span>","<span data-v-f87c67ca=\"\">The percentage of subscription payments made in cryptocurrency has not seen significant growth in the past two years, according to Pornhub vice president Corey Price. The Next Web&nbsp;<\/span><a href=\"https:\/\/thenextweb.com\/hardfork\/2018\/09\/28\/pornhub-cryptocurrency-tron-verge\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> in Sep. 2018 that cryptocurrencies accounted for less than 1% of purchases made on the platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"When we first introduced Verge in 2018, adoption just wasn't there and the number of transactions was low, relative to other forms of payments on our site,\" Price told The Block. \"The number of users paying for Premium subscriptions in crypto has remained fairly steady since we introduced it as a payment option.\"<\/span>","<span data-v-f87c67ca=\"\">But notably, around 10% of adult performers enrolled in Pornhub's Model Payment Program, <\/span><a href=\"https:\/\/www.modelhub.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Modelhub<\/span><\/a><span data-v-f87c67ca=\"\">, are now choosing to be paid in cryptocurrency.<\/span>","<span data-v-f87c67ca=\"\">\"There are many reasons why cryptocurrencies are viable in the adult entertainment industry,\"&nbsp;<\/span><span data-v-f87c67ca=\"\">he said. \"We've found that the high speed and low cost of transactions, combined with the anonymity benefits, make it especially appealing to models over traditional tender.\"<\/span>","<span data-v-f87c67ca=\"\">According to the company's <\/span><a href=\"https:\/\/www.pornhub.com\/insights\/2019-year-in-review\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2019 year in review<\/span><\/a><span data-v-f87c67ca=\"\">, Pornhub saw a total of 42 billion visits and more than 39 billion searches performed last year. <\/span>","<span data-v-f87c67ca=\"\">When reached for comments, the company did not share the number of its users who pay for the premium service or the percentage of subscriptions paid in cryptocurrency. Yet&nbsp;<\/span><span data-v-f87c67ca=\"\">Pornhub's recent moves to support a variety of coins suggest cryptocurrency's growing strategic relevance for the adult entertainment platform.<\/span>","<span data-v-f87c67ca=\"\">In fact, Pornhub has recruited a cryptocurrency expert for its business development team who \"focuses entirely on crypto,\" Price revealed. PornHub declined to make this person available for an interview.<\/span>","<span data-v-f87c67ca=\"\">Looking back on Pornhub's decision-making process regarding which coins to support, Price told The Block that Pornhub, first and foremost, \"looks for cryptocurrencies that put user privacy and security at the forefront.\"<\/span>","<span data-v-f87c67ca=\"\">Verge was the first coin added on the platform because it allows for flexible billing practices, high speed and low cost of transactions, as well as the much-needed anonymity feature – all of which are particularly important for the adult entertainment industry, Price said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Verge allows for the flexible billing practices and scenarios popular within the adult entertainment industry today, namely recurring payments and pay-per-use, while securing the anonymity of users, as well as the high speed and low cost of transactions,\" Price said. \"It allows for anonymous transactions by obfuscating the IP address and geolocation of its users so that they are untraceable.\"<\/span>","<span data-v-f87c67ca=\"\">The company also sees considerable potential in stablecoins, which was why it recently added support for USDT.<\/span>","<span data-v-f87c67ca=\"\">\"We recently added Tether because it is stable and backed by traditional fiat currency, which is the first crypto of this type we are offering to our models, as a part of a larger goal to offer numerous and flexible payment options,\" Price said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Price, Pornhub plans to integrate more cryptocurrencies, potentially supporting popular coins like bitcoin and ether, to \"provide its users with as many user-friendly and convenient payment options as possible.\"<\/span>","<span data-v-f87c67ca=\"\">Beyond adding digital coins as payment options, Pornhub is also considering deeper integration with blockchain tech. Given that the platform is dealing with open-source tech, Pornhub is also willing to explore communicating directly with teams working on the protocols it supports, Price said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We are continually exploring a wide range of options to cater to what works best for our models and fans,\" he told The Block. \"As for the rest, you’ll just have to wait and see!\"<\/span>"],"hashtag":[]}