{"summary":"Solana Meme Coin Hits a $328T Market Cap Using a Scam Method","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-meme-coin-hits-a-328t-market-cap-using-a-scam-method.htm","publishDate":"2024-04-30T19:55:04","id":18101,"type":null,"title":"Solana Meme Coin Hits a $328T Market Cap Using a Scam Method","category":["Altcoin News "],"content":["Cryptocurrency investors continue pouring funds into a suspected Solana meme coin honeypot scam despite clear warnings that they may be unable to withdraw their investments.","BONKKILLER’s astronomical market cap of $328 trillion was achieved through a manipulative tactic of freezing token holders’ accounts and preventing sales called honeypot scam, according to Solana ecosystem news platform Solana-Floor’s April 29 X post.","Launched on April 29, the BONKKILLER Solana meme coin quickly amassed approximately $4.6 million in trading volume within 24 hours. Lurking beneath the surface of this seemingly lucrative opportunity was a deceptive scheme.","Birdeye data revealed that 90% of BONKKILLER tokens are concentrated in the hands of its creator. Investors who flocked to this new meme coin soon came to realize that they were unable to move their assets due to a freeze authority implemented by the developers, effectively trapping their investments and rendering them worthless.","🚨 LATEST: @solana Memecoin (BONKKILLER), a scam and honeypot token, surpasses $100 trillion Market Cap following developer action to freeze token holders' accounts and prevent token sales. pic.twitter.com\/JrigH74Ffn","— SolanaFloor | Powered by Step Finance (@SolanaFloor) April 29, 2024","","NFT trader “thirt13n” aptly pointed out the fallacy of the inflated market cap, stating, “Bullsh*t metrics, if you are unable to sell, it’s worth $0”.","Despite numerous platforms raising red flags and highlighting the characteristics of a classic honeypot scam, traders continue to invest in BONKKILLER, as indicated by Birdeye. On-chain data reveals that the creator has already accumulated $1.62 million from unsuspecting victims through just 11 transactions.","Unfortunately, BONKKILLER has become another instance of a memecoin rug pull or honeypot scam that preys on novice traders.","Many meme coins – six out of ten on the Ethereum layer-2 scaling solution Base – exhibit scam-like characteristics or are outright scams, while 91% have various vulnerabilities, according to Cointelegraph.","$BONKKILLER is a $SCAM token, dont buy it. You can't sell them due to freeze. Again don't buy it. pic.twitter.com\/1wclQeWIqS","— metadev (@metadev5) April 29, 2024","","While some may argue that such instances reflect a creator’s limited understanding of meme coin development and security protocols, particularly when coins are launched as jokes or industry satire, the financial and emotional damage inflicted upon unsuspecting individuals is a serious concern.","To mitigate risks and avoid falling prey to such schemes, investors should prioritize thorough research and utilize tools to detect potential honeypot scams before engaging with any Solana meme coin or similar projects. Being informed and taking proactive measures is crucial for safeguarding one’s investments in the industry."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"91%","content":"PERCENT"},{"type":"$SCAM","content":"MONEY"},{"type":"April 29, 2024","content":"DATE"},{"type":"$1.62 million","content":"MONEY"},{"type":"Step Finance","content":"ORGANIZATION"},{"type":"$0","content":"MONEY"},{"type":"April 29","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$328 trillion","content":"MONEY"},{"type":"$100 trillion","content":"MONEY"},{"type":"$BONKKILLER","content":"MONEY"},{"type":"$4.6 million","content":"MONEY"},{"type":"Cointelegraph","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"BONKKILLER Solana","content":"PERSON"},{"type":"BONKKILLER","content":"LOCATION"}],"hashtag":["crypto scam","Solana meme coin"],"authors":["Thomas Musgrave"]}