{"summary":"Microsoft’s VR and AR teams bore the brunt of job cuts announced last week.\nIt appears that Microsoft will channel its VR energies into Microsoft Mesh, a “collaboration” platform which utilizes a range of VR and AR tech.","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204535\/while-apple-and-meta-forge-ahead-microsoft-sunsets-some-vr-products","publishDate":"2023-01-23T06:03:56","id":1810,"type":null,"title":"While Apple and Meta forge ahead, Microsoft sunsets some VR products","category":["Metaverse &amp; NFT"],"content":["Microsoft's virtual reality and mixed reality products have reportedly born the brunt of the tech giant's latest layoffs, with entire teams cut from the organization.&nbsp;","The layoffs, which overall affected 10,000 workers at Microsoft, claimed the entire team at AltSpaceVR. AltSpaceVR was <a href=\"https:\/\/techcrunch.com\/2017\/10\/03\/microsoft-acquires-social-virtual-reality-app-altspacevr\/\" data-v-f87c67ca=\"\">bought out<\/a> by the computer company in 2017 under undisclosed terms. It will shutter completely in March, according to a <a href=\"https:\/\/altvr.com\/sunset\/\" data-v-f87c67ca=\"\">blog post<\/a> by the company.","It appears that Microsoft will channel its VR energies into Microsoft Mesh, a \"collaboration\" platform which utilizes a range of VR and AR tech.","The team behind MRTK — or the Mixed Reality Toolkit — is also facing cuts, with the entire team in jeopardy, according to industry publication <a href=\"https:\/\/www.windowscentral.com\/microsoft\/microsoft-has-laid-off-entire-teams-behind-virtual-mixed-reality-and-hololens\" data-v-f87c67ca=\"\">Windows Central<\/a>.","Meanwhile HoloLens, the unit producing Microsoft's headset, faces an uncertain future, according to Windows Central.&nbsp;","Microsoft seems to be scaling back on VR at a time when investors and companies&nbsp;are pouring billions of dollars into technologies eager to construct a more immersive digital landscape that includes both virtual and augmented reality (VR and AR) experiences.","With a new VR-AR device set to be hitting shelves later this year, Apple has pitted itself against Meta, the leading producer of VR headsets. Whichever company is more successful will likely gain an advantage colonizing the metaverse.","Microsoft did not respond to a request for comment.&nbsp;","<em data-v-f87c67ca=\"\">Read more: <a href=\"https:\/\/www.theblock.co\/post\/203164\/in-apple-and-metas-fight-for-vr-ar-dominance-an-open-metaverse-may-be-collateral-damage\" data-v-f87c67ca=\"\">In Apple and Meta's fight for VR-AR dominance, an open metaverse may be collateral damage<\/a><\/em>"],"hashtag":["AR","VR"]}