{"summary":"Ethereum DeFi Protocol BarnBridge Faces SEC Action and Fines, Opens Token-Holder Voting","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-defi-protocol-barnbridge-faces-sec-action-and-fines-opens-token-holder-voting.htm","publishDate":"2023-10-12T07:43:00","id":18104,"type":null,"title":"Ethereum DeFi Protocol BarnBridge Faces SEC Action and Fines, Opens Token-Holder Voting","category":["DeFi News "],"content":["Decentralized finance (DeFi) lending project BarnBridge has announced a token-holder voting to tackle the legal charges that the project is facing from the US Securities and Exchange Commission (SEC), along with fines.","BarnBridge confirmed in July that is it facing a probe from the US regulators and halted “all work” related to the project in order to “reduce potential further legal liability.” However, the firm did not reveal the reasons behind the investigation.","In an update on Tuesday, the project has opened voting for token holders on how the firm can respond to the regulator’s charges. The move appears to be the first to formally engage its community on how to react to the SEC’s probe.","BarnBridge community can vote in favor of its founders Tyler Ward and Troy Murray, to comply with the regulator’s orders against the firm. They can also vote in favor for the BarnBridge Treasury to pay all “disgorgement” amounts or fines required by the SEC order.","BarnBridge products are powered by Ethereum, focusing on tokenizing risk exposure. They provide users new ways to hedge their positions.","Holders can also vote to authorize Douglas Park, the legal counsel to BarnBridge, to sign the final version of the SEC order on behalf of the DeFi protocol, the snapshot post read.","In July, the protocol’s token holders were asked to vote on a proposal whether to retain the law firm Douglas Park for the DAO “for various legal work.”","This came after Douglas Park posted on the platform’s Discord channel in July, revealing that the platform and individuals have come under the eyes of the SEC investigation. Park suggested “all work” on BarnBridge-related products including liquidity pools should halt in order to “reduce potential further legal liability.”","Some decentralized autonomous organization (DAO) members raised suspicions over the announcement made by Douglas Park. However, co-founder Tyler Ward shortly after confirmed Park’s message was true regarding the regulator’s probe on BarnBridge."],"entity":[{"type":"Tyler Ward","content":"PERSON"},{"type":"BarnBridge Treasury","content":"ORGANIZATION"},{"type":"Troy Murray","content":"PERSON"},{"type":"Douglas","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Douglas Park","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Douglas Park","content":"ORGANIZATION"}],"hashtag":["DAO","DeFi","Securities and Exchange Commission"],"authors":["Sujha Sundararajan"]}