{"summary":"Art + Crypto Tale Takes New Twist as Artist Tokenizes His Output","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/art-crypto-tale-takes-new-twist-as-artist-tokenizes-his-outp-6364.htm","publishDate":"2020-04-22T14:15:07","id":18108,"type":null,"title":"Art + Crypto Tale Takes New Twist as Artist Tokenizes His Output","category":["Altcoin News "],"content":["Artists are increasingly turning to crypto-powered solutions to fundraising – and a future whereby both artists and their output are tokenized may not be far off.","In a glimpse of what might be ahead – and a brand-new development in blockchain-powered art – Paris-based artist Ben Elliot has announced that he is launching what he says will be the world’s first-ever personal crypto token to be tied to the market value of his creations.","Per his own website for the token, Elliot says his Ben Elliot token (BET) will allow investors “to profit by trading and selling the coin in the form of virtual artworks.” The token is slated for launch on the Stellar (XLM) blockchain network in 2021.","The notion behind the token is that its value will rise (and presumably fall) in tune with the market value of the artist’s handiwork.","Elliot stated,","“BET is a tangible asset that can be directly converted into artwork. As the internet and social network rise, money, business, creativity & the ways one manages them are shifting. Creatives and influencers monetizing their personal content and data have now become more valuable than some traditional industries.”","According to the artist, his practice addresses contemporary subjects such as influence marketing, high-speed media channels and contemporary devices.","The development comes just over a month after another individual announced news of a “self-tokenization” of sorts – a “human IPO” of Ethereum-powered tokens in a cryptocurrency entrepreneur, a project that, per Etherscan data, appears to be relatively active.","Elliot’s move is just the latest in a long line of blockchain and crypto-powered business-technology-art collaborations that is already starting to bear fruit.","Earlier this year, Cryptonews.com reported that a Dutch company exhibiting at CES claimed that it had won EU regulatory approval for a platform that will allow artists and collectors to convert the ownership of art into digital certificates.","And last year Cryptonews.com reported that in Japan, an art-meets-blockchain startup named StartBahn that allows artists to register and sell their work had received investment boosts from financial group SBI’s art trading subsidiary SBI Art Auction.","Efforts to build a cross-industry, cross-media blockchain arts platform are also in development in Japan, where manga and anime-themed artwork has been available via blockchain and crypto platforms for several years."],"entity":[{"type":"2021","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"CES","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Elliot","content":"PERSON"},{"type":"Ben Elliot","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Adoption","Art","Blockchain","Tokenization"],"authors":["Tim Alper"]}