{"summary":"Ark Invest Sells Another $1.4M Shares of Coinbase, Increases Exposure to Robinhood Amid Crypto Rally","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ark-invest-sells-another-1-4m-shares-of-coinbase-increases-exposure-to-robinhood.htm","publishDate":"2023-12-05T09:14:09","id":18119,"type":null,"title":"Ark Invest Sells Another $1.4M Shares of Coinbase, Increases Exposure to Robinhood Amid Crypto Rally","category":["News "],"content":["Ark Invest, led by Cathie Wood, has once again reshaped its portfolio by selling over $1.4 million worth of Coinbase Global Inc shares. This decision, following a pattern of recent sell-offs, unfolds during a buoyant period in the cryptocurrency space, notably with Bitcoin trading above the crucial $40,000 threshold.","The recent shift in Ark Invest’s cryptocurrency holdings involved the offloading of 10,218 Coinbase shares through its flagship ARK Innovation ETF and Ark Fintech Innovation ETF.","The sell off happened during a broader rally in cryptocurrencies amid pending decisions on spot Bitcoin ETFs.","Cathie Wood and Ark Invest's trade activity from today 12\/4 pic.twitter.com\/M560DWhaHn","— Ark Invest Daily (@ArkkDaily) December 5, 2023","","Coinbase shares, which closed nearly 5.5% higher at $141.09 on Monday, have been subject to Ark’s strategic adjustments.","This is not the first time Ark Invest has trimmed its Coinbase holdings. On November 28, the firm offloaded 43,956 Coinbase shares valued at $5.3 million as the stock reached $119.77, marking its highest point since April 2021.","The strategic move coincided with Coinbase’s impressive 55% surge in share price throughout November, reflecting an improved sentiment in the crypto market.","Ark’s latest Coinbase selling spree follows its significant divestment in July, when the firm sold over $100 million worth of Coinbase shares as prices hovered around $90.","Cathie Wood’s firm has been dynamic in adjusting its exposure to Coinbase, showcasing an ability to capitalize on favorable market conditions while mitigating potential risks.","Simultaneously with the Coinbase sell-off, Ark Invest increased its stake in Robinhood Markets Inc. On Monday, Ark Invest bought 14,704 shares of Robinhood. The purchase comes at the same time the stock and crypto trading platform announced a 75% increase in crypto trading on its platform in November compared to October"],"entity":[{"type":"December 5, 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"5.5%","content":"PERCENT"},{"type":"April 2021","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Fintech Innovation ETF","content":"ORGANIZATION"},{"type":"Robinhood Markets Inc","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"75%","content":"PERCENT"},{"type":"$5.3 million","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"November 28","content":"DATE"},{"type":"Coinbase Global Inc","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$119.77","content":"MONEY"},{"type":"$141.09","content":"MONEY"},{"type":"$1.4 million","content":"MONEY"},{"type":"Ark Invest","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"$90","content":"MONEY"}],"hashtag":["ARK Invest","Cathie Wood","Coinbase","Robinhood"],"authors":["Jai Pratap"]}