{"summary":"Arbitrum Seeks DAO Approval for $400 Million Gaming Ecosystem Fund","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/arbitrum-seeks-dao-approval-for-400-million-gaming-ecosystem-fund.htm","publishDate":"2024-03-15T06:38:09","id":18120,"type":null,"title":"Arbitrum Seeks DAO Approval for $400 Million Gaming Ecosystem Fund","category":["DeFi News "],"content":["The Arbitrum Foundation has unveiled a proposal for a $400 million Gaming Catalyst Fund, targeting the expansion and enhancement of its blockchain gaming sector.","In a detailed proposal published on the community forum, the Arbitrum Foundation outlined its vision for the fund. The initiative, designed to enrich Arbitrum’s gaming landscape, is currently seeking endorsement from the Decentralized Autonomous Organization (DAO) to roll out over a span of two years.","Arbitrum’s endeavors in decentralized finance contrast with its emerging presence in gaming, trailing behind competitors in terms of games and player engagement. The Gaming Catalyst Program (GCP) is believed to effectively attract builders and retain talent.","“The GCP aims to provide support and resources to game developers interested in building on the Arbitrum network,” the proposal reads. “This includes access to funding, mentorship, and other forms of assistance to expedite the development process.”","The program is set to use the platform’s resources to support experienced professionals and high-potential gaming projects. This approach would encourage the development of quality games within the ecosystem.","To participate in the program, the developers must be approved and included in the whitelist by a community council. The approved projects will be “subject to a robust set of checks and balances.”","The requested $400 million fund, or 200 million ARB, will be distributed for builder onboarding and growth (160 million ARB) and infrastructure bounties (40 million ARB).","The proposal also detailed that goals for the initiative encompass receiving 200-300 applications from game developers interested in building on the network.","Success measures include achieving a 20% share of all new web3 games on Arbitrum, leading net migrations from other Layer 2 platforms, and facilitating the launch of over 25 Orbit projects.","The proposal was drafted by Daniel “Djinn” Peng, co-founder of Vela Exchange, and Karel Vuong, co-founder of Treasure.","The initiative will get a snapshot vote on March 15 for general delegate agreement and feedback with the tally vote and ratification scheduled in April 2024. The community will then proceed with council member elections, venture team formation, and roll out grant applications till May."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"Daniel “Djinn” Peng","content":"PERSON"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"GCP","content":"ORGANIZATION"},{"type":"Karel Vuong","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Decentralized Autonomous Organization (DAO","content":"ORGANIZATION"},{"type":"Treasure","content":"ORGANIZATION"},{"type":"March 15","content":"DATE"},{"type":"Vela Exchange","content":"ORGANIZATION"}],"hashtag":["Arbitrum","DeFi","Gaming"],"authors":["Hongji Feng"]}