{"summary":"Web3 is the future and it is here. All industries need to be ready for this technological revolution. Those who refuse to innovate and grow with Web3 will be left in the dust and many are nervous about the impact such a fundamental transition may have on their business.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223894\/web3-and-the-financial-services-industry-the-first-in-a-three-part-exploration-on-how-this-industry-will-transform","publishDate":"2023-03-30T08:50:03","id":1813,"type":null,"title":"Web3 and the Financial Services Industry- the First in a Three Part Exploration On How This Industry Will Transform","category":["SPONSORED"],"content":["<span class=\"TextRun SCXW70856733 BCX4\" lang=\"EN\" xml:lang=\"EN\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\">Web3 is the <\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\">future<\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\"> and it is here. All industries need to be ready for this technological revolution. Those who refuse to innovate and grow with Web3 will be left in the dust and many are nervous about the impact such a fundamental transition may have on t<\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\">heir business. In particular, the notoriously outdated financial services industry can benefit immensely from this disruption. To explore <\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\">this<\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\"> we first dive into Web3, give a brief overview of the pitfalls of the traditional banking industry, see how Web3 <\/span><span class=\"NormalTextRun SCXW70856733 BCX4\" data-v-f87c67ca=\"\">can be of benefit and lastly examine a business case study which has already shattered the status-quo.&nbsp;<\/span><\/span><span class=\"EOP SCXW70856733 BCX4\" data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Web2 vs Web3 - LO 2.0<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Web2 is the current iteration of the internet as we know it. Starting in the late ‘90s, Web2 is characterized by the development of dynamic web pages, social networking and the rise of user-generated content. It is limited by its centralization and lack of transparency, which can lead to issues such as data privacy concerns and the risk of censorship.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Web3, also known as the decentralized web, is the next iteration, built on distributed ledger technologies (DLT) and peer-to-peer (P2P) networks. Web3 is designed to offer a more open, transparent and democratic internet that is not controlled by a centralized authority. It is built on top of decentralized systems that allow users to interact directly with each other without the need for intermediaries. Major differentiators include decentralization, trustless transactions, cryptographic security and tokenization. It has the potential to transform industries such as finance, healthcare, education and supply chain management for all by enabling new levels of security, efficiency and innovation.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Current issues with financial services industry&nbsp;<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">There are several inefficiencies in the current banking mortgage industry, including slow processing times, high transaction cost, humans, lack of transparency and limited access to credit. The current mortgage process can be slow and time-consuming, with lenders often requiring extensive documentation and paperwork, which can delay the process for borrowers. Additionally, the mortgage industry can be costly for borrowers, with fees for appraisals, title searches and other services adding up quickly. Traditional mortgage lenders often have strict underwriting standards, which can limit access to credit for some borrowers, more so those with lower credit scores or less income. However, Web3 technologies such as smart contracts, zero-knowledge proofs and decentralized networks can potentially address some of these inefficiencies by reducing transaction costs, increasing efficiency and enhancing transparency and access to credit.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">How Web3 will revolutionize the financial services industry&nbsp;<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Web3 has the ability to tackle every problem discussed earlier. Web3 is especially useful when integrated with artificial intelligence technology. These come together to bring transparency, security and speed to financial transactions. In the last ten years there have been over 400 ‘extinction level’ hacks against financial institutions. There were over 22 billion private records exposed in hacks against databases in 2021. Additionally, databases are not suitable for holding value because information within them can be easily mishandled, manipulated, lost and deleted. Web3 solves all these security problems as it also allows for decentralized computing. AI can benefit from this decentralized nature by using it to distribute processing power across multiple nodes. This can increase the efficiency of AI systems and make them more resilient.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Layer 1 (L1)&amp; AI nodes together; increase processing and transaction speed and document availability for borrowers. When applying for a loan, it can take days for documents to be reviewed and accepted which can delay the process and cause buyers to miss out on homes that sell faster than their loan is approved. With an L1, data can be accessed and reviewed near instantaneously. The secure and transparent nature of Web3 can be used to verifiably protect and retrieve sensitive data and automate decision-making and maintain contextual awareness.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">There are several parties at play in the financial services industry, such as non-banking financial institutions like mortgage companies, institutional banks and the banking customers. All these parties connect and it is easy to leave a door open for a hacker to steal data. For example, ABC Mortgage connects with and does business with countless different banks at any one time. They are transferring data from each one to the other and it's easy to leave a door open. Also because banks are only transmitting partial data at one time, they can end up creating a lot of cross checks and manual validations. “But in a Web3 approach, the database is distributed, everyone is synced on the same data all the time.Thus, we can achieve two things: security and efficiency. If the network of financial service providers are on a Web3 network, they're peer to peer and are interlocked with each other. This creates a very hard to hack security mechanism.” Pavan Agarwal, CEO of Celligence, Inc. and Sun West Mortgage company explained. It also increases reliability and trust between the parties because everyone is in control of the data and has a full copy of everything being transmitted.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Case study: Celligence<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Celligence, Inc. is an emerging FinTech disruptor that has brought AI and Web3 together to scale new heights in transparency, security and inter financial institution competition. Their technology is already helping countless clients buy homes and is embedded with a secure non-custodial wallet to hold financial documents and assets. Celligence launched an AI personal assistant called MORGAN&nbsp; which is integrated directly into the Celligence DLT network. “MORGAN as a scalar utilizes the network’s document availability and verification abilities along with its own system access, to communicate empathetically and effectuate governance and configurations autonomously across regulated financial industry node-hosts.” explained Celligence CTO Thomas Smith.&nbsp; As one of, if not the only, successful example of wrapped AI &amp; Web3 direct action implementations in the financial services industry, Celligence is thriving amidst the chaos currently unfolding in the financial markets.&nbsp;&nbsp; <\/span><span data-ccp-props=\"{&quot;134245418&quot;:false,&quot;134245529&quot;:false,&quot;201341983&quot;:0,&quot;335559738&quot;:160,&quot;335559739&quot;:160,&quot;335559740&quot;:288}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">About Celligence<\/span><\/b><span data-ccp-props=\"{&quot;134245418&quot;:false,&quot;134245529&quot;:false,&quot;201341983&quot;:0,&quot;335559738&quot;:160,&quot;335559739&quot;:160,&quot;335559740&quot;:288}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Celligence is an affiliate of Sun West Mortgage Company, Inc. (Sun West), one of the largest independent, privately owned financial services companies. As one of the fastest growing fin-tech companies, Celligence provides exceptional service, technology, and product innovation.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559738&quot;:220,&quot;335559739&quot;:220,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">At Celligence, a team of brilliant engineers are continuously filing new patents and expanding the boundaries of the financial services industry through innovations in mobile applications, customer acquisition and retention algorithms, and AI based process automation.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559738&quot;:220,&quot;335559739&quot;:220,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">About Sun West Mortgage Company (NMLS ID 3277)<\/span><\/b><span data-ccp-props=\"{&quot;134245418&quot;:false,&quot;134245529&quot;:false,&quot;201341983&quot;:0,&quot;335559738&quot;:160,&quot;335559739&quot;:160,&quot;335559740&quot;:288}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">At Sun West Mortgage Company, Inc. we dedicate ourselves to offering an amazing experience to our customers. To accomplish this, we empower our loan officers so that they can find great rates and provide the most fitting loan options for each customer – at amazing speed. Our focus on technology has given us an edge in the mortgage industry to offer exceptional turn times so the customers can get into the home of their dreams sooner!<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559738&quot;:220,&quot;335559739&quot;:220,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">We are committed to our core values of people, experience, technology, and product. Sun West was founded in 1980 with the perspective of “customers first” and the desire to make the mortgage process easy and stress-free for prospective homeowners. Since then, Sun West has been servicing a multi-billion-dollar loan portfolio and is licensed in 49 states, the District of Columbia, Puerto Rico, and the US Virgin Islands. Our 42 years of experience has been passed down to everyone here at Sun West through excellent leadership and capabilities.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559738&quot;:220,&quot;335559739&quot;:220,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">For licensing information, go to: www.nmlsconsumeraccess.org. Visit http:\/\/www.swmc.com\/swmc\/disclaimer.php for the full list of license information. Please refer to https:\/\/www.swmc.com\/TXdis.php to view Texas Complaint Notice and Servicing Disclosure. In all jurisdictions, the principal (main) licensed location of Sun West Mortgage Company, Inc. is 6131 Orangethorpe Avenue, Suite 500, Buena Park, CA 90620, Phone: (800) 453-7884.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559738&quot;:220,&quot;335559739&quot;:220,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Sun West and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FinTech","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Pavan Agarwal","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1980","content":"DATE"},{"type":"Celligence CTO","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Texas Complaint Notice and Servicing Disclosure","content":"ORGANIZATION"},{"type":"Celligence, Inc.","content":"ORGANIZATION"},{"type":"Celligence","content":"ORGANIZATION"},{"type":"District of Columbia","content":"LOCATION"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"US Virgin Islands","content":"LOCATION"},{"type":"Buena Park","content":"LOCATION"},{"type":"last ten years","content":"DATE"},{"type":"Sun West Mortgage Company, Inc.","content":"ORGANIZATION"},{"type":"Sun West","content":"LOCATION"},{"type":"Thomas Smith","content":"PERSON"},{"type":"ABC Mortgage","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}