{"summary":"Crypto firm Paxos has received conditional approval for a bank charter from the OCC.\nThe approved application is for Paxos to set up a new national trust in addition to its New York-regulated entity.\nThe two separate trusts will both be managed by the Paxos team.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102711\/paxos-occ-national-trust-bitlicense-charter","publishDate":"2021-04-23T13:06:48","id":1813,"type":null,"title":"Paxos gets OCC nod to operate national trust — in addition to its NY entity","category":["Regulation"],"content":["Crypto firm Paxos has received conditional approval for a bank charter from the U.S. Office of the Comptroller of the Currency (OCC), giving it the green light to split its operations between two entities: one regulated on a national level and one maintaining its current regulatory structure.","Paxos isn't the first crypto firm <a href=\"https:\/\/www.occ.gov\/news-issuances\/news-releases\/2021\/nr-occ-2021-49.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">to receive conditional approval<\/a> from the OCC; Anchorage and Protego both garnered approvals from the bank regulator earlier this year. It is, however, the first to receive acceptance for a so-called \"de novo\" application, which allows it to set up an entirely new bank.","Ultimately, Paxos plans to operate two trusts by the end of next year — one under a national bank charter, one under a New York BitLicense.","When <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91071\/crypto-custodian-anchorage-nabs-national-bank-charter-from-occ\" data-v-f87c67ca=\"\">Anchorage<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93928\/occ-grants-conditional-charter-blockchain-bank\" data-v-f87c67ca=\"\">Protego<\/a> applied for bank status, they sought to convert their state-regulated entity to a federally regulated entity, giving up their previous structure as a state trust. But Paxos' de novo application means it will set up an entirely new bank in addition to its current trust, which has a BitLicense from the New York Department of Financial Services (NYDFS).","Once the national trust is up and running, which Paxos can take up to 18 months to fulfill according to the terms of the conditional charter, there will be two distinct Paxos trusts.","According to Daniel Burstein, chief compliance officer at Paxos, they will be \"entirely different entities,\" but will rely on a common set of people at Paxos rather than having two separate teams.","Paxos was an early obtainer of the BitLicense, and therefore has long enjoyed a top-tier nod of compliance. An NYDFS seal of approval may just be a state license, but because New York's framework is so stringent, acceptance often extends beyond New York's borders.","So with that in mind, why be a bank?","With a nod from the OCC, Paxos has \"clear nationwide authority to operate,\" according to Burstein. This means freedom to custody dollars and crypto alike, offer its stablecoin services across the country and run an exchange on the national level if it so chooses.","The firm could have gone the route of obtaining money transmitter licenses across the country, but that wouldn't afford the same oversight as a bank regulator, according to Burstein. A banking charter has a higher level of capital and audit requirements, and Paxos wants to be seen as the most trustworthy in the digital asset space.","\"There's definitely a lot of other routes we could have gone, but they don't offer the kind of reliability that we're seeking and project to the market the kind of trustworthiness that we're seeking,\" said Burstein.","Money transmitter licenses also don't allow for the custody of assets, and Paxos remains committed to being a custodian. When its national trust charter takes effect, it will give up most of its money transmitter licenses – but not its BitLicense.","To fulfill its conditional approval, Paxos has to execute the business plan submitted to the OCC over the next 18 months. The regulator will then examine the bank to make sure it fulfilled the parameters set out in its submission, and then it'll have no further need of its individual money transmitter licenses.&nbsp;","But Paxos is keeping its BitLicense. Given that Paxos has long enjoyed a beneficial relationship with the NYDFS, there's no need to throw away the regulatory infrastructure Paxos has already built over six years in New York, according to Burstein.","It also gives clients options. They can decide whether they want to take advantage of Paxos' BitLicense framework or bank charter framework, especially customers of its brokerage service, known as Paxos Crypto Brokerage.","One client that's facing this particular choice is PayPal, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/81794\/paypal-to-enable-crypto-purchases-with-the-help-of-paxos\" data-v-f87c67ca=\"\">partnered<\/a> with Paxos to roll out crypto features on its platform and subsidiary Venmo's platform through a conditional BitLicense. As a full BitLicense holder, Paxos handles the purchase and custody of crypto for PayPal. It's unclear whether PayPal will opt to continue the relationship through its conditional BitLicense or migrate the relationship to the national trust when it's up and running.","\"There is definitely value to having both and to have sort of a regulatory stack upon which we can really build our business,\" said Burstein."],"hashtag":["OCC"]}