{"summary":"Bitcoin Mining Not A Threat to Public Safety – Rep Emmer Criticizes OMB’s Abuse of Power","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-mining-not-a-threat-to-public-safety.htm","publishDate":"2024-02-23T10:04:30","id":18131,"type":null,"title":"Bitcoin Mining Not A Threat to Public Safety – Rep Emmer Criticizes OMB’s Abuse of Power","category":["Bitcoin News "],"content":["United States lawmaker Tom Emmer has criticized the Office of Management and Budget’s (OMB) decision to approve the Energy Information Administration (EIA) request to collect data on Bitcoin (BTC) mining firms.","In a Feb 22 letter to the OMB, he expressed his displeasure with recent events, backing Bitcoin and miners’ freedom to protect the network.","Texas Blockchain Counsil and Bitcoin miner Riot Platforms have sued EIA over the same bitcoin mining data order.","Bitcoin mining is not a threat to public safety. Period.","The OMB's abuse of its emergency powers to attack Bitcoin miners demands an explanation.","Read my letter to the OMB below.https:\/\/t.co\/zojJqpRqiK","— Tom Emmer (@GOPMajorityWhip) February 22, 2024","","On Jan 24, the OMB approved the EIA’s request to subject Bitcoin miners to a “new, mandatory information collection regime.” ","According to the lawmaker, the agency’s use of energy power only comes in if there is a threat to public safety, adding that Bitcoin miners do not pose a threat.","The letter to the OMB was supported by the cryptocurrency community who also asked for explanations of the Department’s actions.","The United States House Majority Whip backed the industry and its freedom in a recent letter to the delight of industry participants.","He argued that Bitcoin miners play a critical role in securing the entire network, describing it as portraying American values. This is because of the open and permissionless model on which the blockchain operates.","“To its core, this technology embodies American values, but regardless, technology policy must be politically neutral. Bitcoin miners are simply computers that use electricity, a majority derived from sustainable sources across the United States, to validate and settle transactions on the blockchain.”","The EIA’s claims of being a politically neutral agency were also in question as this move seemed to enforce the Biden Administration’s policy against energy consumption.","Last year, the White House attempted to introduce a 30% power tax for Bitcoin miners arguing that they must pay their fair share.","Furthermore, the EIA added that an increase in Bitcoin’s price will increase mining activity and power consumption while trying to “prove” its threat to public safety. The lawmaker raised concerns about the scope of the survey as it covered 82 crypto mining firms on electricity usage, sources, chip types, etc.","Rep Emmer stated that the EIA wants to create a new standard for cryptocurrency miners but the major concern is the procedure.","The letter requests a response to his office on the reasons why normal clearance measures were not taken between the OMB and EIA. Stressing the procedural requirements, the lawmakers demanded the criteria used to determine the degree of emergency that led to the status quo.","Similarly, the agency has to explain if this procedure was used in other previous cases and how it plans to protect the data collected.","“This is a mandatory survey and failure to comply with the request for information could carry criminal charges. Has the OMB ever approved an emergency request for information collection in the past that has carried criminal penalties for failure to respond? If so please describe those requests,” he wrote."],"entity":[{"type":"Tom Emmer","content":"PERSON"},{"type":"Emmer","content":"PERSON"},{"type":"Texas Blockchain Counsil","content":"ORGANIZATION"},{"type":"United States House","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"OMB","content":"ORGANIZATION"},{"type":"February 22, 2024","content":"DATE"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"Energy Information Administration (EIA","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Jan 24","content":"DATE"},{"type":"Office of Management and Budget’s (OMB","content":"ORGANIZATION"},{"type":"Bitcoin miner Riot Platforms","content":"ORGANIZATION"},{"type":"Department","content":"ORGANIZATION"},{"type":"EIA","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin Mining","USA"],"authors":["David Pokima"]}