{"summary":"Ground-breaking Project in Finland Uses Bitcoin Mining to Heat Homes","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/project-in-finland-uses-bitcoin-mining-to-heat-homes.htm","publishDate":"2024-04-23T15:57:12","id":18142,"type":null,"title":"Ground-breaking Project in Finland Uses Bitcoin Mining to Heat Homes","category":["Bitcoin News "],"content":["A new project in Finland is turning energy from Bitcoin mining into energy to heat homes.","Hashlabs Mining, a Bitcoin mining infrastructure firm, has pioneered a ground-breaking project that allows heat to be generated using specially designed Bitcoin mining devices.","The project exploits hydro-cooled WhatsMiner M63S, an ASIC mining device, which produces hot water at ~70°C in the cooling process.","Using the Finnish district heating system, a network of insulated pipes connects this hot water source to multiple buildings to provide them with heating. This allows households to benefit from industrial BTC mining.","A district heating system provides heat to multiple buildings from a single source.","Heat is generated in plants as hot water, which flows through underground pipes to individual buildings connected to the system. pic.twitter.com\/TOjDDrXe5w","— Jaran Mellerud 🟧⛏️ (@JMellerud) April 23, 2024","","This is yet another tool to aid Finland in adopting carbon-neutral and renewable energy sources, moving away from environmentally damaging means.","According to data from Statistics Finland, As of 2021, Finland relied heavily on non-renewable sources with 69% of their total consumption coming directly from them. ","These sources included wood (30%), oil (19%), coal (6%), natural gas (5%), and peat (3%).","","Considering this, there is a clear opportunity for growth in the pursuit of a fully sustainable energy economy.","Although “the Finns have developed one of the world’s most advanced clusters of district heating systems,” Hashlabs Mining co-founder Jaran Mellerud claims that Bitcoin mining is far more reliable than current infrastructure. Mellerud stated:","“The best provider of reliable, high-temperature water for district heating is Bitcoin mining.”","A local partner of Hashlabs has already integrated two Bitcoin mines with district heating facilities and is currently integrating a third one, Mellerud said. This represents a positive indication of the future adoption of this energy source.","On April 20, Bitcoin mining saw its per-block Bitcoin (BTC) emissions cut in half. The event that occurs once every 4 years, known as the Bitcoin Halving, saw mining rewards cut from 6.25 BTC to 3.125 BTC.","This had a significant impact on miners’ incomes, increasing the bottom line for miners to maintain financial stability.","As per experts, Bitcoin miners would face more challenges in the halving, given the high electricity costs and debt burden.","“Nearly half of the miners will suffer given they have less efficient mining operations with higher costs,” Jaran Mellerud, crypto-mining analyst at Hashrate Index, told Bloomberg.","So far, Bitcoin miners have been making up for the loss of mining rewards following past halvings through technological advancements that have improved mining efficiency.","However, the 2024 halving and future halvings will see these efforts being stretched thin as reward reductions exceed cost-saving innovations, leaving mining operations unsustainable.","As a result, they must adapt, and this project provides the ideal solution. Monetizing the coolant water as an energy source would provide miners with an additional source of income, reducing their reliance on mining rewards.","Ultimately, future-proofing mining operations by providing them with the financial stability they need to resist future halvings."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Jaran Mellerud","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"Hashlabs Mining","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Hashrate Index","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"69%","content":"PERCENT"},{"type":"April 23, 2024","content":"DATE"},{"type":"Mellerud","content":"PERSON"},{"type":"Nearly half","content":"DATE"},{"type":"Finland","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Statistics Finland","content":"ORGANIZATION"}],"hashtag":["Bitcoin Mining","Energy","Finland"],"authors":["Harvey Hunter"]}