{"summary":"Digital Asset Investment Products Experience Second Consecutive Week of Outflows, Totaling $206M","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/digital-asset-investment-products-experience-second-consecutive-week-of-outflows-totaling-206m.htm","publishDate":"2024-04-22T10:48:46","id":18147,"type":null,"title":"Digital Asset Investment Products Experience Second Consecutive Week of Outflows, Totaling $206M","category":["Altcoin News "],"content":["Digital asset investment products have faced another week of outflows, marking the second consecutive week of declining investor interest. ","The outflows amounted to a total of $206 million, while trading volumes in Exchange Traded Products (ETPs) experienced a slight dip, reaching $18 billion, according to a report from CoinShares. ","Bitcoin investment products witnessed outflows of $192 million,","However, the report mentioned that few investors viewed this as an opportunity for short-selling, with short-Bitcoin strategies experiencing outflows of $0.3 million.","The trading volumes in ETPs accounted for a smaller percentage of total bitcoin volumes, standing at 28%. ","This figure represents a significant decrease from the 55% recorded just a month ago. ","The data indicates a diminishing appetite among ETP\/ETF investors, possibly due to expectations of prolonged high interest rates by the Federal Reserve (FED).","The negative sentiment surrounding digital asset investment products was primarily observed in US ETFs, which saw outflows amounting to $244 million. ","The outflows were primarily focused on the existing ETFs, while newly issued ETFs continued to receive inflows, albeit at lower levels compared to previous weeks. ","In contrast, Canada and Switzerland experienced inflows of $30 million and $8 million, respectively, while Germany saw minor outflows of $8 million.","CoinShares: Digital asset investment products saw outflows for the second consecutive week totalling US$206m, with trading volumes in ETPs dipping slightly at US$18bn. Ethereum saw US$34m outflows, marking its 6th consecutive week. https:\/\/t.co\/ZGL8bl5URM","— Wu Blockchain (@WuBlockchain) April 22, 2024","","Meanwhile, Ethereum faced outflows of $34 million for the sixth consecutive week. ","On the other hand, multi-asset products saw improved sentiment, attracting inflows of $9 million during the previous week. ","Additionally, Litecoin and Chainlink saw inflows of $3.2 million and $1.7 million, respectively.","In the realm of blockchain equities, concerns over the impact of halving continued to weigh on investor sentiment. ","Consequently, blockchain equities experienced their eleventh consecutive week of outflows, amounting to $9 million.","While Bitcoin did not immediately react to the much-anticipated halving event, the leading cryptocurrency has since registered some gains. ","As of now, Bitcoin is trading at $66,266, up by almost 2% over the past day, according to data from CoinMarketCap.","While some analysts, including JPMorgan, have cautioned about a potential further price slide following this quadrennial event, the overall consensus remains bullish in the long term.","Just recently, Bitwise said that while the month immediately following the halving typically sees a modest drop in price, the subsequent year often witnesses exponential gains. ","The asset manager noted that following the 2012 halving, Bitcoin experienced a meager 9% increase in the month post-halving, only to skyrocket by a staggering 8,839% over the following year. ","Similar patterns were observed after the 2016 and 2020 halvings, with Bitcoin’s price surging significantly in the year following each event.","Likewise, Crypto.com CEO Kris Marszalek has recently said that Bitcoin may experience some selling pressure in the lead-up to the highly anticipated halving event, but the long-term outlook remains bullish. "],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"Canada","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"8,839%","content":"PERCENT"},{"type":"$192 million","content":"MONEY"},{"type":"$1.7 million","content":"MONEY"},{"type":"US$18bn","content":"MONEY"},{"type":"April 22, 2024","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$34 million","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"$244 million","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"$0.3 million","content":"MONEY"},{"type":"$8 million","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"$9 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Litecoin","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Federal Reserve (FED","content":"ORGANIZATION"},{"type":"$3.2 million","content":"MONEY"},{"type":"$206 million","content":"MONEY"},{"type":"$66,266","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["Crypto investing","Digital Asset"],"authors":["Ruholamin Haqshanas"]}