{"summary":"VanEck expects a long-awaited U.S. recession to finally arrive in 2024, but still anticipates spot bitcoin ETF approvals and the halving event spurring bitcoin to all-time highs by Q4.\nNo ether “flippening,” solana outperformance, a significant rebound in NFT activity and Binance losing its spot trading throne are also among the investment manager’s predictions for the year ahead.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266758\/recession-wont-keep-bitcoin-from-reaching-new-highs-in-2024-vaneck-predicts-in-yearly-crypto-forecast","publishDate":"2023-12-08T11:12:17","id":1814,"type":null,"title":"Recession won&#x27;t keep bitcoin from reaching new highs in 2024, VanEck predicts in yearly crypto forecast","category":["Companies"],"content":["Despite anticipating a long-forecast U.S. recession will finally hit next year, investment manager VanEck still sees expected spot ETF approvals and the upcoming halving event leading to new all-time highs for bitcoin by the fourth quarter, according to a new <a href=\"https:\/\/www.vaneck.com\/us\/en\/blogs\/digital-assets\/matthew-sigel-vanecks-15-crypto-predictions-for-2024\/\" data-v-f87c67ca=\"\">report<\/a>.","VanEck analysts Matthew Sigel and Patrick Bush expect the U.S. economy to succumb to a recession in the first half of 2024 as slowing economic momentum and cooling inflation leave it more vulnerable to shocks. However, the analysts also expect more than $2.4 billion will flow into U.S. spot bitcoin ETFs in Q1 and keep prices elevated, if they're approved.","VanEck believes the spot bitcoin ETFs would trade at around 0.1% spreads, with zero commission at many brokerages, catalyzing demand.","The Securities and Exchange Commission has yet to approve a spot bitcoin ETF in the U.S., having previously <a href=\"https:\/\/www.theblock.co\/linked\/120956\/proshares-announces-tuesday-listing-of-bitcoin-futures-etf-bito\" data-v-f87c67ca=\"\">approved<\/a> futures-based funds in 2021. The next deadlines for the SEC’s decision to approve, reject or delay applications from firms including VanEck as well as BlackRock, Bitwise, WisdomTree, Invesco, Fidelity and Valkyrie are expected to fall in mid-January. Bloomberg analyst James Seyffart recently <a href=\"https:\/\/x.com\/JSeyff\/status\/1730327792066195501?s=20\" data-v-f87c67ca=\"\">said<\/a> the window for potential spot bitcoin ETF approval was looking like it would fall between Jan. 5 and Jan. 10.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.27%\n    <\/span><\/a> <!----><\/span><\/span>’s fourth halving — when the block reward gets cut in half — is expected to fall in April and is another potential catalyst, with prior halvings preceding significant run-ups for the cryptocurrency in 2016-2017 and 2020-2021. The VanEck analysts expect the event to pass with \"minimal drama,\" with bitcoin rising above $48,000 post-halving and miners seeing little distress thanks to much-improved balance sheets.<\/span>","The analysts then expect bitcoin to climb a \"Presidential-sized wall of worry\" in the U.S. election year to reach an all-time high by November and an ultimate cycle peak of up to $160,000. “If bitcoin reaches $100,000 by December, we make a long-shot call that Satoshi Nakamoto will be named Time Magazine's 'Man of the Year,'\" they added.","Bitcoin currently trades at $44,006, up 165% year-to-date, according to The Block's price data.","Sigel and Bush said ether won’t flip bitcoin’s market cap in 2024, particularly with bitcoin's more apparent regulatory status, but it will outperform mega-cap tech stocks. Like past cycles, VanEck expects bitcoin to lead the rally next year, with ether not beginning to outperform until after the halving. But there will be no \"flippening,\" they said.","<span data-v-f87c67ca=\"\">The <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +2.55%\n    <\/span><\/a> <!----><\/span>:BTC price ratio is currently near its lowest level since July 2022 at around 0.05.<\/span>","<span data-v-f87c67ca=\"\">The analysts argued that ether will also lose market share to other smart contract platforms with less uncertainty surrounding scalability, such as <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.17%\n    <\/span><\/a> <!----><\/span><\/span>. They also expect Ethereum Layer 2s, such as Polygon, Arbitrum and Optimism, to consolidate toward two or three dominant players by value and usage — with one achieving higher monthly DEX volume and Total Value Locked than Ethereum for the first time.&nbsp;<\/span>","VanEck anticipates solana becoming a top three cryptocurrency by market cap in 2024, behind bitcoin and ether, fueled by a rise in DeFi activity on the blockchain to join the \"spot ETF wars\" with the top two digital assets.","The VanEck analysts also expect Binance to lose its throne as the top crypto exchange by spot trading volume in 2024 after the company’s <a href=\"https:\/\/www.theblock.co\/post\/264010\/justice-department-set-to-announce-settlement-with-binance-bloomberg\" data-v-f87c67ca=\"\">$4.3 billion settlement<\/a>&nbsp;with U.S. authorities and a year of <a href=\"https:\/\/www.theblock.co\/post\/251553\/sec-sees-urgent-need-to-inspect-binance-us-and-its-custody-of-customer-assets\" data-v-f87c67ca=\"\">regulatory issues<\/a> for the platform.","The analysts argued one of OKX, Bybit or Coinbase would grab the top spot, though they also expect the decentralized exchange share of spot market trading volume compared to centralized exchanges to reach new all-time highs.","Additionally, Sigel and Bush anticipate a rebound in NFT activity to reach all-time highs next year as speculators gravitate toward top collections on Ethereum and new Bitcoin-based offerings. They also expect a breakout blockchain game to finally arrive.","Among VanEck's other expectations for the year ahead, its analysts saw the stablecoin market cap reaching a new all-time high as USDC reverses its market share losses this year and the DeFi industry reconciling with the idea of Know-Your-Customer (KYC) functionality on their front-ends.","It should be noted that VanEck may hold positions in any digital assets it mentions."],"hashtag":["BITCOIN","ETHEREUM","INVESTMENT FIRMS","SOLANA"]}