{"summary":"Pepe Investors Shift to New Bitcoin Project, Targeting 976% Gains Within Months","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pepe-investors-shift-to-new-bitcoin-project-targeting-976-gains-within-months.htm","publishDate":"2024-05-09T23:08:26","id":18156,"type":null,"title":"Pepe Investors Shift to New Bitcoin Project, Targeting 976% Gains Within Months","category":["Industry Talk "],"content":["As the Pepe Coin (PEPE) price pushes up and eyes a rally back to March highs beyond $0.000010, investors are shifting to an exciting new Bitcoin project as they target potential gains of as much as 976% within months.","Pepe rallied 9% on Thursday and, last at $0.0000086, is eyeing a retest of recent highs above $0.000009.","The cryptocurrency has been trading bullishly since bouncing at its 100DMA in mid-April.","The meme coin then proceeded to break above a downtrend in late-April and has been trending higher ever since.","And as the cryptocurrency rallies, its investors will be taking profits and looking for new high-potential investment opportunities.","One crypto that has the team at Cryptonews very excited is a new Bitcoin project called 99Bitcoins.","","New Bitcoin project 99Bitcoins produces courses to help investors make their first steps into the crypto space. It currently has over 100,000 enrolled students.","Moreover, 99Bitcoin’s YouTube channel has over 700,000 subscribers and mailing list has nearly 3 million members. Already a household name in the crypto education space, 99Bitcoins is taking its web3 involvement to the next level.","99Bitcoins is launching a new L2E token ($99BTC) that is designed to reward individuals for learning about cryptocurrency.","https:\/\/twitter.com\/99BitcoinsHQ\/status\/1778062722652860797","The classic 99Bitcoins platform is integrating with BRC-20 to pioneer the L2E model on the Bitcoin blockchain.","$99BTC is currently available in an exciting presale that has already raised more than $1.1 million in under one month.","99Bitcoins is making 10.5% of the supply of its $99BTC token available to early investors in the presale.","Tokens are currently up for grabs for $0.00101, giving the token a current market cap of under $100 million.","Given 99Bitcoins’ huge community and potential to become a leader in the fast-growing L2E space, that could be a bargain.","Crypto experts are already coming out of the woodwork as early birds in this project ahead of a potential listing.","Jacob Crypto Bury thinks the innovative L2E token could present a 10x investment opportunity.","","","99Bitcoins is currently running a massive airdrop of $99,999 worth of Bitcoin (BTC). This will go to 99 early supporters who follow the instructions on the official website.","Our $99,999 $BTC #Airdrop is heating up, and the clock is ticking! ⏰","Ensure you've crossed off all the steps to boost your chances of being one of the 99 lucky winners! 🔥","Get started now! 👉 https:\/\/t.co\/ZXji0s6ACe#99Bitcoins #Tether #Coinbase pic.twitter.com\/cHRJ95Tpa3","— 99Bitcoins (@99BitcoinsHQ) May 7, 2024","","14% of the token supply is being reserved for staking rewards. That means that early $99BTC investors not only have the opportunity to benefit from price appreciation, but also passive income.","APYs for presale investors are currently sat at an insane 4,000%, according to 99Bitcoins’ official X account.","27.5% is being reserved for project funds, 23% for marketing, 8% for liquidity and 17% for community rewards.","Readers can learn more about $99BTC by checking out the whitepaper.","Buy 99BTC Here",""],"entity":[{"type":"$99BTC","content":"MONEY"},{"type":"4,000%","content":"PERCENT"},{"type":"$0.00101","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"$100 million","content":"MONEY"},{"type":"10.5%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"976%","content":"PERCENT"},{"type":"27.5%","content":"PERCENT"},{"type":"17%","content":"PERCENT"},{"type":"$1.1 million","content":"MONEY"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$99,999 $BTC","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$0.000010","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"Jacob Crypto Bury","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"mid-April","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"$99,999","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$0.000009","content":"MONEY"},{"type":"14%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"May 7, 2024","content":"DATE"},{"type":"$0.0000086","content":"MONEY"}],"hashtag":["99bitcoins","Bitcoin project","Pepe"],"authors":["Joel Frank"]}