{"summary":"Shaun Heng left Spartan Labs after joining the venture studio early last year.\nThe studio has yet to launch a project but will debut its first this month, according to Spartan Group managing partner Kelvin Koh.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201891\/head-of-100-million-venture-studio-spartan-labs-departs","publishDate":"2023-01-12T22:19:30","id":1815,"type":null,"title":"Head of $100 million venture studio Spartan Labs departs","category":["Deals"],"content":["The head of Singapore-based Spartan Group’s $100 million venture studio has&nbsp;quietly left after less than a year in the role. It remains unclear what motivated the departure.","<a href=\"https:\/\/www.linkedin.com\/in\/shaunheng\/\" data-v-f87c67ca=\"\">Shaun Heng<\/a>, who was appointed to head of Spartan Labs in March 2022, parted ways with the business, said Kelvin Koh, co-founder and managing partner at Spartan Group, who added that Adrian Lai, previously Spartan Labs’ creative and design lead, is now heading up the venture studio.","Heng's departure was confirmed by&nbsp;two people familiar with the matter, who added that he left in December. Heng did not respond to a request for comment.","Spartan Labs was set up by crypto investment and advisory firm Spartan Group last year to “co-build with the most successful web3 projects and teams,” its website says.","The same sources who said that Heng had left Spartan Labs claimed the studio hasn’t been funding any new initiatives. Spartan Labs has yet to roll out a project, but Koh said it will launch its first this month and added that a few more are “in early stages,” without providing more details.","Spartan Labs initially aimed to develop and launch six or seven projects a year, and to arm them with access to advice, talent, customers and capital, according to a <a href=\"https:\/\/medium.com\/the-spartan-group\/introducing-spartan-labs-b693f3aa2e31\" data-v-f87c67ca=\"\">blog post<\/a> published by Heng at the time of his appointment. The studio began with $100 million in dedicated capital. Heng joined Spartan Labs from data provider CoinMarketCap, where he was vice president of growth and operations.","In addition to the venture studio, Spartan Group manages three separate investment funds: A liquid token fund, a $110 million DeFi vehicle launched in June 2021, and a $200 million metaverse and gaming venture fund that it <a href=\"https:\/\/www.theblock.co\/post\/136993\/spartan-group-announces-200-million-metaverse-fund-with-an-emphasis-on-digital-ownership\" data-v-f87c67ca=\"\">unveiled<\/a> in March last year.","Like all crypto investors, Spartan Group spent last year navigating torrid market conditions.","The company’s $91 million Global Blockchain Opportunities Fund — its liquid token fund — was down 54% as of October 2022, according to a document obtained by The Block that was distributed to investors. At the time, the fund had delivered a net return since inception of 490%, according to the document.","Spartan Group’s $110 million DeFi venture fund held up better, according to a separate third-quarter report sent to investors and obtained by The Block. <a href=\"https:\/\/www.theblock.co\/linked\/107576\/spartan-group-100-million-defi-fund\" data-v-f87c67ca=\"\">Launched in June 2021<\/a>, the DeFi fund valued its assets at $143 million as of Sept. 30. Its year-to-date return at that time stood at 4.5%, compared with an inception-to-date return of 42.8%, the note said.","It should be noted that the Spartan Group’s return calculation for the DeFi fund factors in unrealized gains in the form of locked tokens and tokens that are not yet available to the public. Koh said that is standard for early-stage investments.","The DeFi fund deployed $7 million across seven investments in the third quarter, bringing the total number of projects it had backed to 108. As of Sept. 30, less than half of those projects had floated their tokens on crypto exchanges — in line with <a href=\"https:\/\/www.theblock.co\/post\/199734\/crypto-vc-token-bets-delayed?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">a broader market trend<\/a>."],"hashtag":["STARTUP ACCELERATORS"]}