{"summary":"Three-fourths of Marathon’s active mining fleet is offline due to damages from a storm that hit the town of  Hardin, Montana earlier this month.\nThe company said the machines might come online at a reduced capacity as early as the first week of July. ","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154660\/montana-storm-knocks-75-of-marathons-active-crypto-mining-fleet-offline","publishDate":"2022-06-28T17:58:13","id":1816,"type":null,"title":"Montana storm knocks 75% of Marathon&#x27;s active crypto mining fleet offline","category":["Mining"],"content":["A storm that passed through Montana earlier this month powered down about 75% of Marathon's active mining fleet.","The storm hit the town of Hardin on June 11 and damaged the power generating facility supplying Marathon's operations, according to a <a href=\"https:\/\/finance.yahoo.com\/news\/marathon-digital-holdings-provides-bitcoin-200500343.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a> from the company issued Tuesday.","\"Prior to the storm, the 30,000 miners Marathon had deployed in Montana represented over 75% of the Company’s active fleet. With these miners offline, Marathon’s bitcoin production is expected to be significantly reduced until repairs to the power generating facility in Montana can be completed or until the miners can be relocated to new facilities,\" the firm said.","Those 30,000 machines are expected to remain offline until the power infrastructure can be repaired. Marathon said that miners may be able to come online at a reduced capacity as early as the first week in July.","According to damage assessment findings, the machines themselves were likely not damaged by the storm.","As of now, the company's hash rate is 0.6 exahash per second (EH\/s). While repairs are ongoing, Marathon will move some machines from its own mining pool, MaraPool, to a third-party mining pool, \"in order to increase the probability of earning bitcoin.\"","\"With these miners offline, Marathon’s bitcoin production is expected to be significantly reduced until repairs to the power generating facility in Montana can be completed or until the miners can be relocated to new facilities,\" said the statement from Marathon.","The company had already planned to move miners from the Montana facility \"to more sustainable sources of power\" in the third quarter of 2022. However, it is now considering fast-tracking that project.","“The severe storm in Montana unexpectedly decreased our hash rate in June and presented us with a new challenge that we are actively working to overcome,” said Marathon’s chairman and CEO Fred Thiel."],"hashtag":[]}