{"summary":"Arca Hedge Fund Calls for Aragon to Conduct ANT Token Buybacks – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/arca-hedge-fund-calls-for-aragon-conduct-ant-token-buybacks-whats-going-on.htm","publishDate":"2023-05-10T13:09:00","id":18161,"type":null,"title":"Arca Hedge Fund Calls for Aragon to Conduct ANT Token Buybacks – What’s Going On?","category":["Blockchain News "],"content":["Crypto hedge fund Arca has called on the DAO-focused developer Aragon to buy back its own ANT token, citing a discrepancy between the value of ANT and the size of Aragon’s treasury.","The call from the hedge fund came in an open letter published on Tuesday, with Arca saying that it plans to “work with other token holders to propose that Aragon continue the buybacks to return ANT to book value.”","The letter was signed by Arca research analyst Alex Woodard, and came after a period of tension between Aragon and a group of activist investors who demanded changes to Aragon’s leadership.","The fight between the two camps escalated last week when Aragon suspended several users from its Discord chat server for repeated “spamming” with questions about the project’s finances.","Aragon, which itself is partially organized as a Decentralized Autonomous Organization (DAO) and partially as a Swiss non-profit, develops tools for other DAOs to use in their operations.","The Aragon team has in the past issued ANT as a governance token for its community, and the team controls a multimillion-dollar treasury.","The price of the ANT token has been volatile since the fighting between the two groups started, and on Monday this week reached its lowest level in more than a month.","In his letter this week, Arca’s Woodard said suspending critical members of the community from Aragon’s Discord server “strikes me as a massive step in the wrong direction.”","“However, these actions have become a common pattern for Aragon. We would not be surprised if similar transparency issues led to members of the team resigning in 2021,” Woodard added, while noting that the financial value of the Aragon project should be recognized by the project’s leadership.","“A [token] buyback is the best course of action to achieve everyone’s goals and provide all forms of value,” the research analyst wrote."],"entity":[{"type":"Aragon","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Aragon’s Discord","content":"ORGANIZATION"},{"type":"Aragon","content":"PERSON"},{"type":"Alex Woodard","content":"PERSON"},{"type":"Decentralized Autonomous Organization (DAO","content":"ORGANIZATION"},{"type":"Woodard","content":"PERSON"},{"type":"Monday this week","content":"DATE"}],"hashtag":["DAO"],"authors":["Fredrik Vold"]}