{"summary":"Grayscale Files For Privacy ETF With SEC, Zcash Part of Offering","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/grayscale-files-for-privacy-etf-with-sec-zcash-part-of-offering.htm","publishDate":"2024-02-22T07:21:26","id":18164,"type":null,"title":"Grayscale Files For Privacy ETF With SEC, Zcash Part of Offering","category":["News "],"content":["Crypto-focused asset manager Grayscale filed for a privacy-focused exchange-traded fund (ETF) with the US Securities and Exchange Commission on Tuesday.","The Grayscale Privacy ETF seeks to mirror the performance of five sub-categories in what would be an industry-first fund.","These include companies engaged in data security and safeguarding, data privacy, and cybersecurity services. Products incorporating blockchain, artificial intelligence, and edge computing solutions are also included, according to an SEC filing submitted by David LaValle, Grayscale’s global head of ETFs.","Grayscale files for Privacy ETF…","Index-based & would track cos involved in data security & protection, cybersecurity products & services incl blockchain-based technology solutions, etc.","Would also hold Grayscale Zcash Trust.","IMO, smart move for Grayscale to expand ETF lineup. pic.twitter.com\/sS0cjDuh7U","— Nate Geraci (@NateGeraci) February 22, 2024","","Additionally, the ETF monitors the performance of digital assets focused on enhancing user privacy through cryptographic methods.","Currently, this category includes Grayscale Zcash Trust (ZCSH), the filing showed. It also stated that the index aims to dedicate 10% to the privacy-preserving protocol sub-theme.","Currently, the timeline for the SEC’s decision on approval is uncertain.","Zcash is a digital asset designed to prioritize privacy and anonymity. It enables users to conduct transactions without disclosing sensitive details like sender and recipient addresses, or the amount transferred.","ZCSH passively invests in Zcash, the filing said. Its purpose is to offer investors a convenient way to access investment opportunities in Zcash, avoiding complexities associated with purchasing, storing, and securing Zcash directly.","So, how will companies be selected for inclusion? The filing noted that investment products within the privacy-preserving protocol category must offer publicly traded securities in the US.","Furthermore, firms considered for inclusion must be publicly traded on either US, non-US developed markets, or emerging market stock exchanges. They also need to possess a market capitalization of at least $250m and fulfill specific liquidity criteria, the filing indicated.","Grayscale’s filing is significant as it is among the most prominent cryptoasset management firms, with an estimated $27b in assets under management as of Jan. 2024. It is also seen as a trailblazer in helping facilitate the approval of Bitcoin ETFs.","Last year, Grayscale won approval to convert its Grayscale Bitcoin Trust (GBTC) into an ETF, leading to the establishment of the world’s largest bitcoin ETF. It went on to amass about $23b in assets under management, according to the website."],"entity":[{"type":"Jan. 2024","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Zcash","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"David LaValle","content":"PERSON"},{"type":"$23b","content":"MONEY"},{"type":"February 22, 2024","content":"DATE"},{"type":"$27b","content":"MONEY"},{"type":"$250m","content":"MONEY"},{"type":"Nate Geraci","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Grayscale Zcash Trust","content":"ORGANIZATION"}],"hashtag":["ETFs","Grayscale","privacy coins"],"authors":["Shalini Nagarajan"]}