{"summary":"Core Scientific Records $211 Million Net Income in Q1 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/core-scientific-records-211-million-net-income-in-q1-2024.htm","publishDate":"2024-05-09T08:45:57","id":18169,"type":null,"title":"Core Scientific Records $211 Million Net Income in Q1 2024","category":["Bitcoin News "],"content":["Core Scientific announced its financial results for the first quarter of 2024, highlighting a significant recovery with a net income of $211 million.","According to its latest press release, Core Scientific’s performance this quarter marked a notable improvement from the previous year’s figures. The company attributed this turnaround to an increase in revenue generated from both Bitcoin mining and hosting services.","","Core Scientific reported a substantial rise in net income, achieving $210.7 million, compared to a net loss of $0.4 million in the same period last year. It produced an adjusted EBITDA of $88 million.","The company mined 2,825 bitcoins during the quarter, leveraging expanded mining capacity and operational efficiencies to boost production.","This increase in mining capability contributed significantly to the revenue, which totaled $179.3 million, marking a 49% rise from the previous year’s first quarter. The revenue from bitcoin mining alone accounted for $150 million, supplemented by $29 million from hosting services.","The release stated that Core Scientific self-mined more Bitcoin than any other publicly listed miner in North America during Q1.","Additionally, the company owns and manages approximately 745 megawatts of infrastructure, making it the largest owned infrastructure footprint among publicly listed miners in the region.","","Core Scientific previously secured a contract with CoreWeave to provide high-performance compute hosting at a new 16-megawatt data center in Austin, which was completed and delivered more than 30 days ahead of schedule.","“We delivered outstanding results in the first quarter…strengthening our balance sheet by paying down debt and improving our cash position, and improving our fleet efficiency with the deployment of new generation miners,” said Core Scientific CEO Adam Sullivan.","“By taking full advantage of favorable market fundamentals and by focusing on productivity and efficiency, we generated strong financial performance that demonstrates our ability to create value for our shareholders,” stated Sullivan."],"entity":[{"type":"first quarter of 2024","content":"DATE"},{"type":"$88 million","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"$29 million","content":"MONEY"},{"type":"Austin","content":"LOCATION"},{"type":"$0.4 million","content":"MONEY"},{"type":"Sullivan","content":"PERSON"},{"type":"first quarter","content":"DATE"},{"type":"$179.3 million","content":"MONEY"},{"type":"Adam Sullivan","content":"PERSON"},{"type":"$210.7 million","content":"MONEY"},{"type":"$211 million","content":"MONEY"},{"type":"49%","content":"PERCENT"},{"type":"$150 million","content":"MONEY"}],"hashtag":["Bitcoin","Core Scientific","Mining"],"authors":["Hongji Feng"]}