{"summary":"Four Arrested in an Alleged $1.5 Million Gold Coast Crypto Investment Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/four-arrested-in-an-alleged-1-5-million-gold-coast-cryptocurrency-investment-scam.htm","publishDate":"2024-04-29T13:43:46","id":18166,"type":null,"title":"Four Arrested in an Alleged $1.5 Million Gold Coast Crypto Investment Scam","category":["Altcoin News "],"content":["Queensland Police have taken action against an alleged crypto investment fraud operating on the Gold Coast, resulting in the arrest and charging of four individuals. ","The investigation, led by the Financial and Cyber Crime Group Money Laundering Unit, began in July 2022, according to a report from Australian news outlet 9News. ","The search focused on companies including Crypto Advisers Australia, Strategic Capital, Active Marketing Solutions, and Alternative Capital, which were suspected of engaging in fraud and money laundering activities.","The breakthrough in the case came on March 11 and 12, when police apprehended two men and two women tied to the scam.","Prior to the arrests, search warrants were executed at multiple locations across the Gold Coast. ","Following a thorough investigation, a 46-year-old man from North Brisbane was charged with four counts of fraud and one count of knowingly participating in money laundering. ","He made his initial appearance at Brisbane Magistrates Court on March 25 and is expected to return on May 27.","Additionally, a 36-year-old man from the Gold Coast, along with two women aged 37 and 63, were each charged with one count of money laundering. ","All three individuals are scheduled to appear before Southport Magistrates Court on April 29.","A Gold Coast crypto company has been raided after encouraging clients to put their superannuation into crypto coins. #9News pic.twitter.com\/7vFbYcGAh6","— 9News Gold Coast (@9NewsGoldCoast) April 28, 2024","","According to authorities, the group orchestrated a Ponzi scheme, defrauding approximately 30 victims between 2018 and 2021. ","The scam relied in part on cold calls to unsuspecting individuals. ","Police claim that the perpetrators laundered over $1.5 million through various means, including cryptocurrencies, precious metals, luxury vehicles, and real estate, in an attempt to conceal the illicit origins of the funds.","“People should seek professional advice from a registered financial planner to understand the legitimacy of the investment, what their expected returns are, and the risk involved,” Detective Acting Inspector Steve Paskin.","It is worth noting that crypto has been under increasing scrutiny in Australia.","In May last year, cryptocurrency exchange Binance Australia told customers they would lose access to Australian dollar deposits and withdrawals due to a decision by its third-party service provider.","In July, officials from the Australian Securities and Investments Commission (ASIC) even conducted searches at Binance Australia‘s offices.","Moreover, in March, Australia’s prudential regulator instructed banks to report their exposures to crypto firms and startups following the collapse of the Silicon Valley Bank and the resulting turmoil in the banking sector.","The APRA asked local banks to improve their reports on crypto assets and provide daily updates to the regulator to gain more insight into potential vulnerabilities in the system.","In October, the Australian government also unveiled a proposal intended to subject digital asset platforms to the same laws that govern other financial services providers.","As part of the plan, crypto platform operators will be required to obtain a financial services license, as well as continuous monitoring and routine audits of customer funds.","In response to increasing restrictions on crypto payments, Blockchain Australia, an industry body representing the Blockchain and digital currency industry in Australia, has launched new initiatives to tackle the issue of crypto scams and frauds."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"May 27","content":"DATE"},{"type":"Southport Magistrates Court","content":"ORGANIZATION"},{"type":"Gold Coast crypto","content":"ORGANIZATION"},{"type":"Australian Securities and Investments Commission","content":"ORGANIZATION"},{"type":"Active Marketing Solutions","content":"ORGANIZATION"},{"type":"Gold Coast","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"March 25","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Financial","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"April 29","content":"DATE"},{"type":"Binance Australia","content":"LOCATION"},{"type":"North Brisbane","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"May last year","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Blockchain Australia","content":"LOCATION"},{"type":"March 11","content":"DATE"},{"type":"Steve Paskin","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Cyber Crime Group Money Laundering","content":"ORGANIZATION"},{"type":"Brisbane Magistrates Court","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"April 28, 2024","content":"DATE"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Australia","crypto scam"],"authors":["Ruholamin Haqshanas"]}