{"summary":"Jeremy Allaire, co-founder and CEO of Circle, said the FTX insolvency crisis, which has thrown the crypto market into turmoil, may not affect the stablecoin his company issues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184503\/circle-ceo-allaire-calls-ftx-crisis-cryptos-lehman-brothers-moment","publishDate":"2022-11-08T19:33:05","id":1817,"type":null,"title":"Circle CEO Allaire calls FTX crisis crypto&#x27;s &#x27;Lehman Brothers&#x27; moment","category":["COMPANIES"],"content":["Jeremy Allaire, co-founder and CEO of Circle, said the FTX insolvency crisis, which has thrown the crypto market into turmoil, is the \"Lehman Brothers\" moment for crypto.","\"Finally, as someone who's been involved in this industry for 10 years, it is disappointing that a technology that was spawned in reaction to the Lehman Bros. moment of 2008 has given rise to its own version of the same,\" <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1590112507632685056?s=20&amp;t=i09F6KbzflTKCnc8UBqUOg\" data-v-f87c67ca=\"\">he said<\/a>. Lehman Brothers, of course, helped set off the 2008 global financial crisis.","Allaire said Circle's USDC is not impacted by the crisis. USDC is among the largest stablecoins in the market, and any contagion that could negatively affect it would be catastrophic. But Allaire emphasized that Circle has been regulated across many parts of the world since 2014, and USDC is fully backed by government treasury bonds and cash. He went on to tweet that USDC has \"detailed transparency\" and is trusted by many of the top asset managers and custodians around the world.","Circle's focus as a company is to \"increase the utility value of money, and build a financial system that is more open, inclusive, transparent and accessible to all,\" <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1590112494437425153?s=20&amp;t=i09F6KbzflTKCnc8UBqUOg\" data-v-f87c67ca=\"\">he tweeted<\/a>.","Allaire's comments come on the heels of the news that Binance will buy FTX.com following the collapse of its native token, FTT, which is down 80% since Binance's CEO said Sunday that his exchange would sell its FTT token, setting the whole chaotic situation in motion.","Allaire highlighted this past bull market gave rise to value that was&nbsp; \"entirely speculative in nature,\" and that the utility of protocols was \"entirely nonexistent.\"&nbsp;","The current market downturn has highlighted the deep issues the crypto industry faces around transparency, counter-party visibility, and non-transparent companies holding balance sheets with speculative tokens.&nbsp;","Allaire urged the industry to move on from this type of speculation into what he termed \"the utility value phase,\" which is dependent on having better transparency. He believes the infrastructure foundations and public blockchains for this to occur are in place.","Allaire also agreed with Coinbase CEO Brian Armstrong that the lack of regulatory guidelines in the U.S. has encouraged the rise of a risky, speculative environment that caused many companies to operate offshore.&nbsp;","This created \"offshore regulatory arbitrage\" that gave rise to \"global hydra companies\" without a known location, which often avoided any repercussions for malicious acts.","Allaire wants to see accountability for these types of companies, as well as for manipulation and any anti-competitive market conduct in the crypto space.","Outside of regulation, Allaire believes on-chain identity and privacy technology are <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1590112499721940992?s=20&amp;t=i09F6KbzflTKCnc8UBqUOg\" data-v-f87c67ca=\"\">two areas<\/a> that need to vastly improve to ensure decentralized finance and other on chain products grow their activity.","<em data-v-f87c67ca=\"\">Correction: This story has been corrected to reflect that USDC is among the largest stablecoins in the market.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"Sunday","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"Lehman Bros.","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Allaire","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Lehman Brothers\"","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}