{"summary":"DeFi Protocol Tranchess, Scroll, and StakeStone Launch New Yield Product, Queen Stone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tranchess-scroll-and-stakestone-launch-new-yield-product-queen-stone.htm","publishDate":"2024-04-17T14:00:36","id":18182,"type":null,"title":"DeFi Protocol Tranchess, Scroll, and StakeStone Launch New Yield Product, Queen Stone","category":["Blockchain News "],"content":["Tranchess, a decentralized protocol specializing in risk-adjusted yield solutions for digital assets, has collaborated with StakeStone, and Scroll to launch a new yield product, Queen Stone (stoneQUEEN).","In an announcement, Tranchess, Scroll, and StakeStone said they are addressing the recent surge in demand for DeFi products and services by offering users the opportunity to explore multiple DeFi protocols.","Queen Stone will use Scroll’s zero knowledge (ZK) technology. Tranchess will provide its expertise in yield optimisation and risk management combined with StakeStone’s staking solutions offering additional avenues for yield generation","“This integration introduces a complex, layered approach to yield optimisation, providing users with multiple sources of yield through native staking rewards, Stone points, Scroll marks, and Tranchess airdrops, along with additional earnings from LP pools,” said says Danny Chong, CEO and Co-Founder of Tranchess in a press release.","“As such, Tranchess StakeStone Fund deployed on Scroll empowers investors to explore multiple yield sources across DeFi protocols, enabling them to access diverse yield generation avenues,” adds Chong.","According to Tranchess a month into the Dencun upgrade, the DeFi community has been watching to see how prominent L2s will deliver cheaper transactions. There has been a surge in demand for DeFi products. DeFi’s TVL surged to a record-breaking high of plus $86 billion. This indicates a growing need to make DeFi more accessible to a broader audience.","Ethereum’s much-anticipated Dencun upgrade was scheduled for a mainnet launch on March 13, following successful testnet launches in February. The upgrade marked a significant milestone in Ethereum’s evolution and had an impact on the wider market.","In January, Tranchess, announced the launch of two new staking products. The products, dubbed “staYETH” and “turYETH,” aim to provide investors with diversified options for earning yield on their staked Ether (ETH).","Back then Tranchess said there is rising institutional demand for sophisticated DeFi products and positioned staYETH and turYETH as catering to both new and existing users seeking refined solutions."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"$86 billion","content":"MONEY"},{"type":"Tranchess","content":"ORGANIZATION"},{"type":"Queen Stone","content":"ORGANIZATION"},{"type":"Chong","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"StakeStone","content":"PERSON"},{"type":"March 13","content":"DATE"},{"type":"Danny Chong","content":"PERSON"}],"hashtag":["Blockchain","DeFi"],"authors":["Tanzeel Akhtar"]}