{"summary":"Tokenize Xchange Secures $11.5 Million in Series A Funding to Expand in Singapore","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tokenize-xchange-secures-11-5-million-in-series-a-funding-to-expand-in-singapore.htm","publishDate":"2024-03-19T08:06:30","id":18183,"type":null,"title":"Tokenize Xchange Secures $11.5 Million in Series A Funding to Expand in Singapore","category":["Blockchain News "],"content":["Tokenize Xchange, a crypto exchange founded in 2017, has successfully raised $11.5 million in a latest funding round for expansion in Singapore.","According to a recent report by The Straits Times, the Series A, Phase 2 funding round was led by the local venture capital firm Trive with other participants including high-net-worth individuals.","Tokenize Xchange is set to expand its team in Singapore, targeting an increase from 20 to 100 staff members over the next 18 months. This growth would particularly focus on enhancing the team’s compliance and operational capabilities.","With the recent addition of $11.5 million in Series A funding, the total raised now has reached $23 million. Besides, the company sets its goal to achieve $33 million by the end of 2024.","Trive had previously invested $11.5 million in the first phase of the Series A round in 2022, as this second phase reiterated its confidence in the exchange.","The exchange stated that expanding its operations will allow it to navigate the intricate regulatory environments throughout Southeast Asia more effectively.","In April 2020, it secured its position as one of the initial trio of digital asset exchanges to gain complete authorization from the Securities Commission Malaysia, making it the country’s second-biggest platform for digital assets.","Currently operating under an exemption, the company has also submitted an application for a digital payment token license in Singapore.","Coinbase Singapore’s Country Director Hassan Ahmed recently shared his insights regarding the digital asset legislative landscape in the city-state, acknowledging the government’s endeavors.","“As a financial hub, Singapore continues to provide a high level of regulatory clarity,” said Ahmed. “The Monetary Authority of Singapore (MAS) is among the most sophisticated regulators we work with globally.”","According to Ahmed, Singapore is at the forefront of digital finance discussions, setting up an ecosystem where crypto ventures can succeed and work with various regulatory frameworks."],"entity":[{"type":"Southeast Asia","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Xchange","content":"ORGANIZATION"},{"type":"April 2020","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$11.5 million","content":"MONEY"},{"type":"Ahmed","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"The Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"Securities Commission Malaysia","content":"ORGANIZATION"},{"type":"$23 million","content":"MONEY"},{"type":"$33 million","content":"MONEY"}],"hashtag":["Exchange","funding","Singapore"],"authors":["Hongji Feng"]}