{"summary":"Europe’s Biggest Nuclear Station Might Give Electricity to Bitcoin Miners","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/europe-s-biggest-nuclear-station-might-give-electricity-to-c-6478.htm","publishDate":"2020-05-06T08:48:00","id":18194,"type":null,"title":"Europe’s Biggest Nuclear Station Might Give Electricity to Bitcoin Miners","category":["Bitcoin News "],"content":["Ukraine’s plan to offset the financial chaos of the coronavirus pandemic might involve nuclear-powered cryptocurrency mining, says its energy ministry.","Yesterday, the country’s Ministry of Energy and Environmental Protection announced that it wanted the country’s four nuclear power plants to look into ways to “integrate crypto mining initiatives.”","The ministry said it was working on the initiative with Energoatom, the state agency that manages the nation’s four nuclear power plants. The nuclear power plants have a combined 15 reactors that provide 13.9 GWe of electricity, the seventh-highest nuclear power generation rate in the world.","The ministry stated that “implementing cryptocurrency mining projects” could “provide additional markets for atomic electricity,” would “boost the reliability and efficiency of Ukrainian nuclear power plants” and address surplus energy-related matters.","However, in a Facebook post made in the early hours of May 6, the ministry went on to clarify that one nuclear power plant will initiate the “first phase” of the pilot with a “data center” near its Zaporizhzhia Nuclear Power Station – the biggest nuclear plant in Europe.","The ministry says that its pilot, conducted with Energoatom, could eventually “connect consumers of [data centers] with a capacity of up to 1000MW,” while the initial Zaporizhia project will see 30MW provided to mining initiatives.","A spokesperson of the ministry told Cryptonews.com that this is only a suggestion. We’ll update the article should the ministry provide more details about the project.","Meanwhile, in the post, the ministry stated that the initiative was part of a move away from “Soviet” economic models, and wrote,","“One modern way to use excess electricity is to direct it into cryptocurrencies. This not only allows you to maintain a guaranteed load for nuclear power plants, but it also gives enterprises the opportunity to raise additional funds.”","The ministry says that the stimulus measures will initially involve government support, but eventually aims to ensure that nuclear power-reliant “data centers” become self-sufficient."],"entity":[{"type":"’s Ministry of Energy and Environmental Protection","content":"ORGANIZATION"},{"type":"Energoatom","content":"PERSON"},{"type":"Zaporizhia","content":"LOCATION"},{"type":"May 6","content":"DATE"},{"type":"Ukraine","content":"LOCATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["Adoption","Bitcoin","Cryptocurrency","Energy","Mining","Ukraine"],"authors":["Tim Alper"]}