{"summary":"This is the second edition in a weekly take on current events in the crypto space and other musings by The Block’s Editor-In-Chief.\nToday’s topics include Sam Bankman-Fried’s sentence, FTX’s sales of locked solana and upcoming Hong Kong-based Bitcoin ETFs.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285499\/the-pulse-the-world-is-moving-beyond-sam-bankman-fried","publishDate":"2024-03-30T06:18:02","id":1819,"type":null,"title":"The Pulse: The world is moving beyond Sam Bankman-Fried","category":["People"],"content":["It was the Sequoia Capital profile that really summed up Sam Bankman-Fried.&nbsp;","The investment powerhouse published a fawning article (now deleted) on its website that set out Bankman-Fried’s founder story. It highlighted how Sequoia’s partners became starry-eyed when the former FTX CEO told them on a call that the exchange would become a super app, with comments in the chat reading “I love this founder.” All while Bankman-Fried was playing League of Legends.","The profile showed how Bankman-Fried was able to convince anyone that he was a mad genius with crazy hair who drove a Toyota Corolla and slept on a beanbag. With this, he built up star power within the industry, culminating in a visit to the White House and an event where he shared the stage with former Presidents and Prime Ministers.","Yet behind the curtain, it was all smoke and mirrors.&nbsp;","“Man all the dumb shit I said,” he told <a href=\"https:\/\/www.vox.com\/future-perfect\/23462333\/sam-bankman-fried-ftx-cryptocurrency-effective-altruism-crypto-bahamas-philanthropy\" data-v-f87c67ca=\"\">Vox reporter Kelsey Piper<\/a> over messages on X, referring to his previous comments on being ethical. “It’s not true, not really.”","In this conversation, Bankman-Fried revealed his real intentions, completely unaware that the person on the other side was intending to publish any of it. He explained that he was good at talking about ethics because he had to say the right things to be liked. Another comment read “Fuck regulators” — something that the judge <a href=\"https:\/\/twitter.com\/innercitypress\/status\/1773373059736506458\" data-v-f87c67ca=\"\">mentioned<\/a>&nbsp;during his sentencing.","Former Alameda co-CEO Caroline Ellison added to this when she asserted that Bankman-Fried grew his hair long in a deliberate ploy. \"He said ever since Jane Street, he thought he had gotten higher bonuses because of his hair and that it was an important part of FTX's narrative and image,” <a href=\"https:\/\/www.theblock.co\/post\/256061\/inside-sbfs-trial-the-corruption-of-caroline-ellison\" data-v-f87c67ca=\"\">Ellison testified<\/a>.","It all finally caught up with him in a hammer blow on March 28. Bankman-Fried was <a href=\"https:\/\/www.theblock.co\/post\/285356\/live-sam-bankman-fried-gets-sentenced-in-ftx-case\" data-v-f87c67ca=\"\">sentenced to 24.25 years<\/a> in prison and ordered to forfeit $11.02 billion, meaning he will be held liable if FTX customers are not made whole.&nbsp;","At the same time, the FTX bankruptcy proceedings are moving swiftly. The estate has been rapidly offloading assets, with strong demand for its large stash of locked solana making things easier. It’s already looking at 100% recovery in dollar terms, with the potential for this to be higher when interest payments and the <a href=\"https:\/\/www.theblock.co\/post\/284201\/the-pulse-ftx-recovery-may-include-recent-prices-ethereums-missing-canary\" data-v-f87c67ca=\"\">possibility of more recoveries<\/a> are included. It seems everyone involved in the process is trying to wrap things up as quickly as possible.","The idea of FTX 2.0 has also been largely scrapped. While this was officially due to a lack of concrete buyers, it seems more likely that it was an unnecessary risk, given the estimated recovery. Again, everything to get things done and dusted.","This means that, within a few years, there will be no restarted FTX. The exchange will have been dead for a long time, and Bankman-Fried will be quietly squirreled away in a medium-security prison. The SBF and FTX saga will live on in memes across ‘Crypto Twitter’ and elsewhere, but the world will have moved on.","<i data-v-f87c67ca=\"\">A look at a selection of stories that caught my attention this week.<\/i>","As mentioned, the FTX estate’s sales of locked solana have <a href=\"https:\/\/www.theblock.co\/post\/285269\/galaxy-locked-sol-sale-ftx-estate\" data-v-f87c67ca=\"\">found favor among investors<\/a>. I spoke to multiple people who had either invested or were provided details of potential investments related to the locked tokens. It appears that a few funds are taking big shares of the allocation, including Galaxy Trading. However, some investors noted they were cut down by 13% when the deals closed.&nbsp;","Venture Smart Financial Holdings Ltd., a Hong Kong-based financial services firm, has submitted its application for a spot bitcoin exchange-traded fund and aims to launch the ETF as early as May, <a href=\"https:\/\/www.theblock.co\/post\/285263\/hong-kong-vsfg-spot-bitcoin-etf-may\" data-v-f87c67ca=\"\">Timmy Shen writes<\/a>. Brian Chan, VSFG's group head of investment and products, told The Block on Thursday that the team is hoping for a May launch “if all goes smoothly.”","The Department of Justice <a href=\"https:\/\/www.theblock.co\/post\/284814\/crypto-exchange-kucoin-laundered-9b-flouted-anti-money-laundering-laws-doj-indictment\" data-v-f87c67ca=\"\">lodged charges against crypto exchange KuCoin<\/a> and two of its founders, alleging they violated anti-money laundering laws. The indictment said that KuCoin deliberately avoided U.S. AML and KYC regulations by \"falsely representing that it had no U.S. customers when, in truth, KuCoin had a substantial U.S. customer base.\" The government claims KuCoin allowed its platform to be used for laundering over $9 billion. The founders are still at large.","As for Ripple Labs, the Securities and Exchange Commission wants it to pay $1.95 billion in fines, and it has asked a New York court to weigh the \"severity\" of the firm's misconduct. The SEC's proposed final judgment concerns direct sales to institutional investors. The SEC says Ripple received almost $1 billion from \"its illegal sales of XRP.\"","Not only are FTX’s bankruptcy lawyers dealing with the complex mess left over from its collapse, but they’re also having to do so while <a href=\"https:\/\/www.theblock.co\/post\/285269\/galaxy-locked-sol-sale-ftx-estate\" data-v-f87c67ca=\"\">fending off scrutiny<\/a>&nbsp;over their&nbsp;own dealings with FTX prior to its collapse.&nbsp;","Matthew Gold, partner at Kleinberg Kaplan, explains that this is quite a unique situation because such challenges to a debtor’s counsel are usually heard early in the case. “In FTX, because the bankruptcy judge denied the appointment of an examiner, and the appeal of that ruling took time, the result is that the examiner is beginning his work more than a year and a half after the case began. That is very unusual,” he said.","Currently, the law firm is dealing with a class action lawsuit, an internal probe into its potential conflicts of interest, and a paper by two law professors that makes a number of similar claims. The law firm claims all of these parties are simply parroting the words of former FTX CEO Sam Bankman-Fried.&nbsp;"],"hashtag":["SAM BANKMAN-FRIED"]}