{"summary":"The latest update to the EOS public network will sever any ties with the former custodian of the network’s code.\n\nThe update is non-backward-compatible, and node operators who do not update their systems will fall out of sync with the network.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171611\/eos-antelope-protocol-update-severs-networks-ties-to-block-one-and-bullish","publishDate":"2022-09-21T09:01:16","id":182,"type":null,"title":"EOS Antelope Protocol update severs network’s ties to Block.one and Bullish","category":["Layer 1s"],"content":["The EOS Network Foundation (ENF) today announced the release of the Antelope Leap 3.1 consensus update.","“With the hardfork now activated, we will continue iterating with the community to optimize the user and developer experiences to best leverage the new features and functionality that Leap 3.1 enables,” ENF CEO Yves La Rose told The Block.","Details on the foundation’s decision to move away from an EOS codebase managed by Block.one were provided to The Block during an interview with ENF director of communications Zack Gall.","The changeover to Antelope Leap 3.1 will see EOS block producers who operate the public network formally adopt code solely developed under the helm of the ENF. Formerly, the code for the EOSIO public network was maintained by Block.one, later acquired by digital asset exchange Bullish.","The non-backward-compatible fork will prompt node operators to update systems or fall out of sync with the network.","A developmental effort led by EOS community engineers and spearheaded by the ENF, the Antelope protocol is a new codebase comprising updated code forked from the EOSIO 2.0 repository.","The <a href=\"https:\/\/eosnetwork.com\/blog\/leap-v3-1-release-features\/\" data-v-f87c67ca=\"\">update<\/a> reintroduces backported elements as well as several new features such as transaction lifecycle improvements, upgraded crypto primitives that power EVM-related cryptography functions, and others, according to the announcement.","Gall offered perspective on the events leading up to the EOS public blockchain’s transition away from reliance on code maintained by Block.one.","“It was undeniable that Block.one was pivoting away from EOSIO,” said Gall, who pointed out that the community was signaled by events such as the <a href=\"https:\/\/www.theblock.co\/linked\/90686\/block-one-cto-daniel-larimer-announces-resignation\" data-v-f87c67ca=\"\">resignation<\/a> of Dan Larimer, the company’s loss of core engineers, a short-lived EOSIO for Business campaign, and the switch of any remaining engineers from EOSIO to Bullish related development.","In August 2021, the ENF was formed. The group was spearheaded by La Rose, existing EOS members, and block producers. The foundation found a leader in La Rose, who formerly ran the EOS Nation block producer and played a significant role in rallying the EOS community.","The ENF took action on December 8th, 2021, days after Block.one announced that it had given or sold Helios, a foundation set up by Block.one co-founder Brock Pierce, 45 million EOS tokens, of which 37 million remained unvested. The foundation formed a supermajority among block producers running the EOS public blockchain, who opted to change a single line of the network’s code and <a href=\"https:\/\/www.theblock.co\/post\/126801\/eos-community-halts-payments-worth-250-million-in-eos-to-block-one-and-brock-pierce\" data-v-f87c67ca=\"\">halt<\/a> ongoing fund transfers to Block.one.","“The line in the sand was drawn. The tokens that hadn’t been vested yet, over the 10-year schedule, those belonged to the network,” said Gall.","Before building out its own team, the ENF attempted a partnership with Larimer to fork the EOSIO code base — but the goals of the foundation, EOS token holders, and the developer would soon fall out of alignment, according to Gall.","In January 2022 the foundation went on a “hiring spree,” picking up former Block.one and Bullish team members such as current ENF COO Ted Cahall, ENF CMO Patty Fisher, ENF Principal Engineer Bucky Kittinger, and ENF Director of Engineering Areg Harapetain.","“We basically poached all the best engineering talent because they were working on an exchange product that they had no interest in building, they wanted to build the underlying technology for web3, they wanted to build EOS essentially, so we gave them an opportunity,” said Gall.","In addition to building out its own development team, ENF formed a partnership with OCI, a development studio-for-hire that had previously worked with Block.one in order to rapidly scale engineering efforts and deliver system updates like the Antelope code fork.","In what he described as the cutting of the final ties to Block.one, Gall said the updates will mean that the code behind EOS will now be community driven, closing a chapter on what he called a complicated history.","By adopting a community-led codebase, the network is aligning incentives across EOS stakeholders, La Rose told The Block. “No longer is the network reliant on a corporate entity for survival.”","La Rose said ENF developers will put efforts toward upcoming features for Antelope protocol, including upgraded crypto primitives and encryption libraries to improve EOS EVM performance and lay the groundwork for the integration privacy enabling zero-knowledge proofs (zk-Snarks).","“Another exciting new feature coming soon is Antelope inter-blockchain communication (IBC) which is currently running on testnets with plans to deploy it into production in Q4,\" said La Rose."],"hashtag":[]}