{"summary":"Serenity Shield Token Fell Victim to Hack: $5.6 Million Worth SERSH Stolen","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/serenity-shield-token-fell-victim-to-hack-5-6-million-worth-sersh-stolen.htm","publishDate":"2024-02-28T09:03:45","id":18208,"type":null,"title":"Serenity Shield Token Fell Victim to Hack: $5.6 Million Worth SERSH Stolen","category":["Blockchain News "],"content":["Serenity Shield project, a multi-chain data storage startup, fell victim to a theft on Tuesday that compromised its MetaMask wallet.","“Today, a MetaMask wallet related to our project was compromised. Consequently, we’re taking immediate steps to address this and support our community,” the company said in a post on X (Twitter).","🚨 Security Alert & Serenity Shield's Response 🚨","Today, a MetaMask wallet related to our project was compromised. Consequently, we're taking immediate steps to address this and support our community:","✋ Stop Trading on PancakeSwap: As previously communicated, please halt all…","— Serenity Shield (@SerenityShield_) February 27, 2024","","Per investigations by pseudonymous blockchain investigator ZachXBT, the hack took place on one of Serenity’s wallets on BSC. Perpetrators stole around 6.9 million native SERSH tokens worth $5.6 million at the time of hack, the investigation revealed.","“Interestingly it is connected on-chain to the recent OKX DEX & Concentric hacks as well,” ZachXBT said in a Telegram update.","The blockchain platform has asked users to halt all SERSH trading on PancakeSwap. “CEX trading on http:\/\/Gate.io and MEXC is also suspended,” the update read.","The exploit took place at 9:11 am UTC on Feb. 27, transferring 6.9 million SERSH tokens priced at $0.82. The hackers transferred the tokens to an unidentified third-party wallet, data from BSCScan noted.","Following the hack, several users took to X (Twitter), accusing the project for storing tokens on a MetaMask hot wallet.","“If holders safety was a priority, you wouldn’t use a Metamask hot wallet for securing vested tokens,” wrote one user, calling it an “irreparable damage to the coin’s reputation.”","If holders safety was a priority, you wouldn't use a Metamask hot wallet for securing vested tokens.","Anyway, $SERSH is basically dead, the fundamental of the project is based on safety but they can't ensure their own safety.","Irreparable damage to coin's reputation and a…","— Hamster Altcoins (@HamsterAltcoins) February 27, 2024","","The user questioned the security of the compromised coin. “A fragile coin that can’t even protect itself, how can them provide security to anyone?”","A coin that was created to provide security was ''compromised''. And if you talk about it on their Telegram will you be muted.","Not a rug-pull but a fragile coin that can't even protect itself, how can them provide security to anyone?","— Hamster Altcoins (@HamsterAltcoins) February 27, 2024","","The exploit took a toll on the price of the native token, dragging SERSH from $0.565 to $0.009, a nearly 99% plunge, according to CoinGecko data.","The token has slightly recovered on Wednesday and is currently trading at $0.151 at press time.","As a result of near-zero slump, Serenity is planning to launch a new SERSH token “through a robust smart contract.”","“Our team is actively addressing the situation, and further details will be provided as soon as they are available. Rest assured, we are deploying all necessary safety measures to ensure a foolproof system.”","For affected SERSH holders, the project has promised a token replacement on a 1:1 basis. Additionally, Serenity Shield noted that it is working with CEXs (centralized exchanges) to determine the replacement process."],"entity":[{"type":"Serenity Shield","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"February 27, 2024","content":"DATE"},{"type":"$0.151","content":"MONEY"},{"type":"Feb. 27","content":"DATE"},{"type":"Security Alert & Serenity Shield","content":"ORGANIZATION"},{"type":"9:11","content":"TIME"},{"type":"$0.82","content":"MONEY"},{"type":"DEX & Concentric","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"MEXC","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"$5.6 million","content":"MONEY"},{"type":"$SERSH","content":"MONEY"},{"type":"$0.009","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$0.565","content":"MONEY"}],"hashtag":["Hack","Serenity Shield","zachxbt"],"authors":["Sujha Sundararajan"]}