{"summary":"Are Hackers Two Steps Ahead of Security in a Cat-and-Mouse Game? Experts Answer","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/are-hackers-two-steps-ahead-of-security-in-a-cat-and-mouse-game-experts-answer.htm","publishDate":"2023-12-17T10:00:27","id":18200,"type":null,"title":"Are Hackers Two Steps Ahead of Security in a Cat-and-Mouse Game? Experts Answer","category":["Blockchain News "],"content":["Talking with Cryptonews, Raz Niv, co-founder and CTO at the Web3 security company Blockaid, and Kate Kurbanova, co-founder of risk management firm Apostro, discussed the evolution and high adaptability of crypto thieves, the “ingenious” methods attackers employ to empty our crypto wallets, what we can do to protect our own money, and steps to take if we do fall victim to theft.","This is what the experts told us.","Blockaid’s Raz Niv opined that hackers are not necessarily always a couple of steps ahead of security. Rather, attackers are highly adaptable.","Niv said,","“The relationship between security measures and cyber threats is more akin to a continuous cat-and-mouse game, particularly in our rapidly evolving industry. Attackers possess the ability to identify vulnerabilities in current infrastructure and exploit them for their benefit.”","This ability is evident in the evolution of attack methods, he said. It went from direct Ethereum transfers to approvals, then to offline signatures, and recently, to malicious airdrops.","Bad actors will observe the innovations in the ecosystem closely. And they will adapt by skillfully incorporating these innovations in ways that serve their own interests.","However, Niv remarked,","“The dynamic nature of this field means that as technology develops, security measures also advance to counteract emerging threats.”","Apostro’s Kate Kurbanova noted an “unfortunate lack of awareness” often exhibited by the average crypto user. It “frequently results in vulnerabilities that fraudsters are all too happy to exploit.”","A vital factor for ensuring the security of users’ finances is the crypto industry spreading knowledge and awareness of how to download and manage crypto apps correctly, Kurbanova said.","There are four “ingenious” methods hackers commonly employ to empty crypto wallets, Blockaid found.","These are:","Kurbanova, too, warned about counterfeit websites. Scammers often fabricate platforms that mirror legitimate decentralized finance (DeFi) protocols to trick unsuspecting users into divulging sensitive information or transferring their valuable assets to malicious addresses.","Therefore, verifying the authenticity of websites before engaging in any transactions is crucial.","Niv also noted an emerging attack vector: inbound malicious tokens. These are the “spammy” non-fungible tokens (NFTs) that appear in users’ wallets or the random spam tokens that may look similar to a legitimate project. However, these will attempt to trigger users’ actions that ultimately have them sign a malicious transaction.","The most used methods, added Niv, are to wash-rinse-and-repeat the same attack type by impersonating different individuals or entities hoping to scam an unsuspecting user.","Kurbanova further warned against conducting any transactions via or connecting your wallets to public Wi-Fi. She stated that,","“Hackers can infect or even clone a public network and gain access to the personal information of unaware users. Use mobile internet if you absolutely have to in order to minimize the risk.”","Similarly, do not use USB ports in public areas, as you can become a victim of what is known as ‘juice hacking.’ Criminals use corrupted ports to upload malware to devices and steal personal data and passwords.","As crypto holders, we can’t settle for half-measures but must take security practices very seriously, Kurbanova says. And though it may seem daunting, there are some basic, simple measures each of us – newbie and veteran alike – should take.","Kurbanova warns against storing funds in crypto apps, saying:","“Better to only keep an amount you intend to spend immediately or can afford to lose.”","Ideally, she said, you should get a cold wallet and separate your crypto into several different wallets with different private keys.","Furthermore, do not use an app for any crypto operation before you’ve done in-depth research. Check when the app appeared on the market, its development history, the team behind it, and user feedback.","If something comes even close to your money, you must know it well.","Never use the same password for more – or even worse, all – of your apps. Also, change your passwords regularly. “Once per month should do it,” Kurbanova advised.","Employ two-factor authentication (2FA) whenever possible. As said, stay away from public Wi-Fi and USB ports.","Finally, make sure all your apps are updated with the latest security patches. Update your device’s operating system regularly as well.","Kurbanova warned there is no such thing as a completely foolproof method of safeguarding against attacks. Attackers may find a way to get to your funds.","If you suspect this has happened, first, don’t panic. Move all remaining funds to a new wallet.","Refresh\/relaunch the app and check for updates in the settings. Change all your passwords and reinforce security.","Check the wallet’s website and social media for hacker alerts and security-related information.","You can also check their wallets through a token tracker like Etherscan to see whether their coins are accounted for. If there are unauthorized transactions, report them to the wallet provider.","If (some) funds are missing, Kurbanova also suggests seeking out the services of cybersecurity firms that specialize in monitoring suspicious blockchain addresses and transactions. These can track digital assets, she said, adding:","“It is likely that the trail of your stolen funds can be traced back to the criminals and their wallets.”","Unfortunately, as we know from numerous theft stories, the success of fund retrieval varies from case to case – and you should probably let the police take over.","However, let’s do the best we can to protect our own assets so that this scenario (hopefully) never happens.","____","Learn more: This is How You Protect Crypto in Your Wallet, According to Expert Mark Venables"],"entity":[{"type":"Niv","content":"ORGANIZATION"},{"type":"Kate Kurbanova","content":"PERSON"},{"type":"Kurbanova","content":"PERSON"},{"type":"Raz Niv","content":"ORGANIZATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"Mark Venables","content":"PERSON"},{"type":"USB","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["Fraud","Hack","Security","Wallet"],"authors":["Sead Fadilpašić"]}