{"summary":"Why MicroStrategy Could Flood The Market With 1.6 Million Shares Of MSTR","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/microstrategy-shares-mstr.htm","publishDate":"2024-04-09T22:48:22","id":18202,"type":null,"title":"Why MicroStrategy Could Flood The Market With 1.6 Million Shares Of MSTR","category":["Finance News "],"content":["Bitcoin (BTC) development company MicroStrategy may be planning to dilute shareholder value after the price of its stock and convertible bonds skyrocketed in recent months.","Since January 1, MSTR has surged 110% to $1440 per share. Meanwhile, its convertible bonds – issued in late 2020 to raise $650 million – now trade for over three times their par value, which is based on their conversion price of $397.99.","A “convertible bond” is a debt instrument that acts like a regular bond with a fixed interest rate, but can also be paid back by the issuer in new shares if the value of their stock rises high enough.","They are often issued and used by firms to raise capital at lower than market rates without necessarily diluting shareholder value right away by issuing new stock. Given that standard interest rates are now at decade-highs, they’re an especially attractive option for MSTR, which seeks to raise money fast to buy as much BTC as possible.","According to MicroStrategy’s December 2020 press release, the bonds carry a meager 0.75% interest rate and are due for maturity in December 2025.","Thus, MicroStrategy is presented with two choices: retire the convertible bond and pay back investors with cash for $2.5 billion, or allow them to mature in 2025, convert to shares, and flood the market with 1.63 million shares.","Michael Youngworth, Bank of America Corp.’s head of global convertibles and preferreds strategy, said the following to Bloomberg:","“It’s more likely that a deep in-the-money convertible bond is ultimately converted into shares rather than being bought back by the issuer.”","MicroStrategy’s plan to deal with the debt remains uncertain, but a simple cash payout appears unlikely. A late 2023 filing showed that the firm only held $46.8 million of cash and cash equivalents on its balance sheet.","The vast majority of the company’s wealth is held in Bitcoin (BTC), now numbering 214,245 BTC worth $14.9 billion. The firm’s executive chairman Michael Saylor has made clear that MicroStrategy has no plans to sell any of its coins, potentially holding for over 100 years.","Last month, MicroStrategy completed two separate convertible note sales totaling $1.4 billion. All proceeds from the sale were used to buy more Bitcoin."],"entity":[{"type":"2025","content":"DATE"},{"type":"0.75%","content":"PERCENT"},{"type":"$1.4 billion","content":"MONEY"},{"type":"$397.99","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"MSTR","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"110%","content":"PERCENT"},{"type":"December 2020","content":"DATE"},{"type":"$1440","content":"MONEY"},{"type":"$46.8 million","content":"MONEY"},{"type":"December 2025","content":"DATE"},{"type":"January 1","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$650 million","content":"MONEY"},{"type":"$14.9 billion","content":"MONEY"},{"type":"Bank of America Corp.","content":"ORGANIZATION"},{"type":"Michael Youngworth","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["MicroStrategy"],"authors":["Andrew Throuvalas"]}