{"summary":"Is The Bitcoin Bull Run Losing Steam? Indicator Signals Potential Slowdown","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-bull-run-losing-steam-indicator-signals-potential-slowdown.htm","publishDate":"2024-04-10T12:27:48","id":18213,"type":null,"title":"Is The Bitcoin Bull Run Losing Steam? Indicator Signals Potential Slowdown","category":["Altcoin News "],"content":["Bitcoin’s on-chain momentum may be showing signs of a potential slowdown with the Value Days Destroyed (VDD) Multiple indicator surging above 4.0 pre halving, leading to speculation among crypto traders about the end of the current bull run.","The VDD Multiple is a popular indicator that identifies instances where the price of Bitcoin may be overheating and approaching its peak during major market cycles. ","A higher reading on the VDD Multiple suggests a significant influx of Bitcoin sales in the market. ","It is calculated by multiplying the Coin Days Destroyed metric by the current Bitcoin price. The indicator effectively analyzes spending velocity over time.","Currently standing at 3.03, with a brief spike to 4.21 on March 28, the VDD Multiple has doubled since the beginning of the year when it hovered around 2.04 on January 1, according to data from GlassNode. ","The last time the VDD Multiple exceeded 4 was in January 2021 when Bitcoin was priced at $40,257.","However, it’s worth noting that the previous peak before a cooldown did not result in a market downturn. ","Bitcoin’s price promptly surged, with a 52.2% increase to $61,283 just two months later in March 2021.","With the Bitcoin halving just nine days away, the current VDD Multiple levels have surpassed those observed before previous halving events. ","Before the 2016 halving, the VDD Multiple stood at 0.419. For the 2020 halving, it reached 1.606 ten days prior.","A senior researcher at GlassNode, known as CryptoVizArt, attributed the recent surge in the VDD Multiple to substantial outflows from Grayscale’s Bitcoin Trust (GBTC). ","Volume and age of greyscale coins moving since 10th of January, push VDD to new highs.","— CryptoVizArt.₿ | ZiCast 🎙 (@CryptoVizArt) April 9, 2024","","Since the approval of spot Bitcoin ETFs for trading by the U.S. SEC, GBTC has experienced significant outflows. The trust shed a total of $15.96 billion in assets.","Bitcoin has seen a 56% surge since the beginning of the year. It rose from $44,172 to its current price of $69,260 at the time of publication.","Bitcoin’s halving event may already be partially factored into the market, according to the CEO of Marathon Digital Holdings Inc., the largest cryptocurrency miner in the United States.","In a recent interview, Marathon CEO Fred Thiel expressed his perspective on the potential impact of the ETF approval: ","“I think the ETF approval, which has been a huge success, has attracted capital into the market and essentially brought forward what could have been the price appreciation we typically would have seen three to six months post halving. So I think we are seeing part of that now already, and that has put forward some of the demand.”","As reported, Billionaire Arthur Hayes has expressed a cautious view regarding the upcoming Bitcoin halving. To him, the effects it will have on the price of the asset can go in either direction."," ","While many experts anticipate a significant rally for Bitcoin following the halving event, Hayes believes that the price action before and after the event could actually be negative. "," "],"entity":[{"type":"U.S. SEC","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Hayes","content":"PERSON"},{"type":"January 2021","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"56%","content":"PERCENT"},{"type":"Marathon Digital Holdings Inc.","content":"ORGANIZATION"},{"type":"52.2%","content":"PERCENT"},{"type":"VDD Multiple","content":"ORGANIZATION"},{"type":"April 9, 2024","content":"DATE"},{"type":"$15.96 billion","content":"MONEY"},{"type":"$40,257","content":"MONEY"},{"type":"Value Days Destroyed","content":"ORGANIZATION"},{"type":"$44,172","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"GlassNode","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$69,260","content":"MONEY"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"March 2021","content":"DATE"},{"type":"$61,283","content":"MONEY"},{"type":"ETF","content":"ORGANIZATION"},{"type":"January 1","content":"DATE"},{"type":"two months later","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Bitcoin halving","spot ETF"],"authors":["Ruholamin Haqshanas"]}