{"summary":"Honeyminer, a cryptocurrency mining startup, is launching its services for MacOS users. The launch was the result of a nine-month development process by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22603\/honeyminer-launches-crypto-mining-service-for-macos","publishDate":"2019-05-09T08:59:39","id":1821,"type":null,"title":"Honeyminer launches crypto-mining service for MacOS","category":["MINING"],"content":["<a href=\"https:\/\/honeyminer.com\/\" data-v-f87c67ca=\"\">Honeyminer<\/a>, a cryptocurrency mining startup, is launching its services for MacOS users. The launch was the result of a nine-month development process by the Honeyminer team and was in response to demand from its users. Previously, the service was only available for Windows users.","Honeyminer allows users to leverage their computer’s GPU and CPU to mine altcoins in a dynamic mining pool. This service auto-converts these altcoins to bitcoins for payouts. The firm’s software is set up in a way that automatically mines the most profitable coin based on a variety of factors including a user’s GPU\/CPU processing power, an altcoin’s difficulty, and an altcoin’s price.&nbsp;","<span data-v-f87c67ca=\"\">Honeyminer's MacOS app in action<\/span>","Currently, Honeyminer’s software supports three-dozen cryptocurrencies including monero, dash, and ether.&nbsp;","Since launching in mid-2018, Honeyminer has garnered a large userbase. According to CEO Noah Jessop, its user count is already in the six-figure range spread across 167 countries. “It’s entirely organic,” Jessop tells The Block.&nbsp;","While Honeyminer is seeing initial success, other similar crypto-mining services haven't been so lucky. In February, Coinhive, the in-browser monero mining service, <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinhive-will-shut-down-its-cryptomining-service-in-march\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinhive-will-shut-down-its-cryptomining-service-in-march\/\" data-v-f87c67ca=\"\">announced<\/a> it was discontinuing its services due to monero's price cratering.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Honeyminer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Coinhive","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Noah Jessop","content":"PERSON"},{"type":"Jessop","content":"PERSON"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}