{"summary":"Ethereum Gas Fees Surge to 8-Month High As ERC-404 Tokens Take Off","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-gas-fees-surge-to-8-month-high-due-to-high-demand-for-erc-404-tokens.htm","publishDate":"2024-02-12T15:49:36","id":18227,"type":null,"title":"Ethereum Gas Fees Surge to 8-Month High As ERC-404 Tokens Take Off","category":["Ethereum News "],"content":["Gas fees on the Ethereum network have soared to levels not seen since March 2023, driven by the growing interest in a new experimental token standard known as ERC-404.","On February 9, Ethereum gas prices soared to an average peak of 70 gwei, equivalent to $60 for a standard transaction. Peak gas costs even reached as high as 377 gwei, a level not seen since May 12, 2023.","Several factors contribute to the heightened gas fees, but the primary catalyst has been the hype surrounding the ERC-404 token standard. This excitement has led to a substantial increase in trading activities, particularly those highlighted by projects such as Pandora and DeFrogs.","These ERC-404 initiatives, among others, have generated over $600 million in trading volume in the past week alone, as reported by crypto data aggregator Birdeye. Since its launch, Pandora has seen remarkable growth, with an over 6,100% increase in value and a trading volume exceeding $474 million.","ERC-404 aims to link ERC-721 non-fungible tokens (NFTs) with ERC-20 tokens, enabling the creation of fractionalized NFTs. This allows multiple users to collectively own a single NFT and utilize their share for trading or collateralizing loans.","ERC404 – token standard not found.","This new \"standard\" has opened up a Pandora's box on crypto twitter over the last couple of days.","Is it an NFT, a fungible token, or both?","Here's a simple explanation of what ERC404 tokens really are 🧵: pic.twitter.com\/tl48QrIx8k","— cygaar (@0xCygaar) February 8, 2024","","This unofficial decentralized architecture seeks to combine characteristics from both sectors, allowing developers to mint fractionalized NFT collections that users can trade in open markets like Uniswap.","While the standard is currently unofficial, meaning the Ethereum foundations do not yet recognize it, there are rumors of a proposal to address this and unlock extra utility such as staking.","Despite being unofficial, the standard has garnered significant attention within the crypto community. The developers behind Pandora are actively working on optimizing gas costs associated with ERC-404 transactions.","“We’re trying to optimize for gas because that’s a big part of adoption and protocols wanting to integrate… So in certain cases, we’re able to potentially reduce gas fees by like 300% to 400%.”","According to PopPunk, co-founder of Gaslite, an ERC-404 token consumes approximately three times more gas than an average NFT transaction.","An average ERC404 transfer is 125,000 gas units.","More than 3x the gas of an average ERC721A transfer.","This is nightmare fuel.","Gaslite could either:\n1) build a more optimized (and more compliant version of this standard)\n2) ignore it and let it fade into the ether","— Pop Punk (@PopPunkOnChain) February 6, 2024","","On February 9, the Ethereum network experienced a surge in activity, largely driven by increased usage of the decentralized exchange protocol Uniswap.","Data indicates that a significant portion of the Ethereum burned during this period resulted from activities on Uniswap.","This heightened activity on Uniswap can be attributed to substantial trading volumes generated by projects such as Pandora and DeFrogs, along with other ERC-404 projects.","According to data from crypto aggregator Birdeye, these projects collectively recorded a trading volume exceeding $600 million in the past week.","Notably, during a Reddit ask-me-anything (AMA) organized by the Ethereum Foundation’s research team on January 10, Ethereum co-founder Vitalik Buterin highlighted that the gas limit had not been increased for nearly three years, marking the longest period without an increase in the protocol’s history.","Buterin expressed his opinion that a modest gas limit increase was reasonable even at that time.","He suggested that such an increase could lead to a limit of around 40 million. Notably, the average gas limit shortly after Ethereum’s genesis in 2015 was around 3 million, but it has increased over time alongside network usage and adoption."],"entity":[{"type":"2015","content":"DATE"},{"type":"PopPunk","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"February 6, 2024","content":"DATE"},{"type":"February 8, 2024","content":"DATE"},{"type":"$600 million","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"300%","content":"PERCENT"},{"type":"January 10","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"6,100%","content":"PERCENT"},{"type":"AMA","content":"ORGANIZATION"},{"type":"May 12, 2023","content":"DATE"},{"type":"$60","content":"MONEY"},{"type":"3 million","content":"MONEY"},{"type":"$474 million","content":"MONEY"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"400%","content":"PERCENT"},{"type":"February 9","content":"DATE"},{"type":"ERC","content":"ORGANIZATION"}],"hashtag":["ETH","Ethereum","Gas Fees"],"authors":["Hassan Shittu"]}