{"summary":"Ethereum Price Prediction as ETH Sees $18 Billion Daily Trading Volume – Can ETH Overtake BTC?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-prediction-as-eth-sees-18-billion-daily-trading-volume-can-eth-overtake-btc.htm","publishDate":"2024-04-10T16:11:56","id":18222,"type":null,"title":"Ethereum Price Prediction as ETH Sees $18 Billion Daily Trading Volume – Can ETH Overtake BTC?","category":["Price Predictions "],"content":["ETH has dropped by 3% in the past 24 hours, with the Ethereum price slipping to $3,524 on a day when the crypto market as a whole has fallen by 2.5%.","This means that Ethereum has now gained by 5% in a week but lost 12.5% in a month, although the market’s biggest alt is still up by 89% in the past year.","The past couple of days have witnessed an encouraging lift in trading volume, with ETH’s moving from about $8.6 billion on Sunday to nearly $18 billion today.","This suggests that the coin may be preparing for a big move in the coming days, potentially coinciding with the approach of the Bitcoin halving.","ETH’s chart gives the impression that it’s pretty close to recovering, with its indicators showing some improvements today.","After dropping hard yesterday, the 30-day average (orange) has slowed its descent and may be close to flattening out (and returning to growth).","Similarly, ETH’s relative strength index (purple) has risen from 30 yesterday to around 45 today, suggesting that the coin is regaining the kind of momentum that could help launch it upwards again.","What’s encouraging in this respect is that the coin’s support level (green) has recovered over the past week, suggesting that it may have already entered a period of recovery.","This is also what we can take from the aforementioned trading volume, which has more than doubled in a couple of days.","🚨 🚨 🚨 🚨 22,959 #ETH (80,690,914 USD) transferred from unknown wallet to Coinbase Institutionalhttps:\/\/t.co\/yIoH8Qo23U","— Whale Alert (@whale_alert) April 10, 2024","","Having said that, this is mostly because large traders are selling, although it’s encouraging that ETH can take a relatively big jump in selling without its price falling too hard.","And looking to the near and more distant future, Ethereum’s situation looks good.","Not only will it benefit from the post-Bitcoin halving rally, but there remains the possibility of spot-based Ethereum ETFs.","If approved, such ETFs would push the Ethereum price hard, in the same way Bitcoin ETFs pushed BTC.","When combined with Ethereum’s strong fundamentals – it still accounts for more than half of the market in terms of TVL – this is likely to see ETH rally big.","It could reach $4,000 in the next few weeks, and $5,000 by the second half of the year.","As the second-biggest token in the market, Ethereum may be a little too established for some tastes, less likely to rally dramatically.","For the biggest gains, traders may consider diversifying some of their portfolios into small-cap alts, including new tokens that are holding their presales.","Such presales coins can often generate lots of momentum on their way to listing on exchanges, where they can rally enviably.","One coin likely to do this is 5th Scape (5SCAPE), an upcoming decentralized VR gaming platform.","5th Scape opened its presale a couple of weeks ago, and encouragingly it has already raised more than $4.5 million.","🚀 Our presale has surged past stage 3!","🌐 Join us now and delve into a world of virtual reality with our multi-utility token.","🎉 Don't miss out on being part of our vibrant community! #cryptocrash #cryptocrash #Wormhole #cryptocurrency #5thScape #Presale #4thstage 🌟 pic.twitter.com\/QeznEVAvFJ","— 5th Scape (@5th_scape) April 4, 2024","","5th Scape is distinct in the area of presale coins insofar as it has underlying utility and some very strong fundamentals.","Its Ethereum-based platform is ready to launch in the next few weeks, and will feature an interesting variety of games.","These include online fighting game Cage Conquest, racer Thrust Hunter, and the footballing title Immersive Kickoff.","These games will all be multiplayer, with 5th Scape releasing its own VR headset as part of its launch.","Within its ecosystem, native token 5SCAPE will serve as the means of entering 5th Scape’s platform and paying for various services and products.","It will have a total supply of 5.21 billion tokens, with its presale aiming to raise $15 million.","🌟 Introducing the VR Ambassador Program! 🚀","World of virtual reality with the 5th SCAPE VR Ambassador Program! 💫","Join as an \"Early Whales\" member and enjoy exclusive perks! 💎","Method\n1️⃣ Invest $10K+ in $5SCAPE & amplify our voice online\n2️⃣ Engage actively on social media… pic.twitter.com\/cgIryEPsiT","— 5th Scape (@5th_scape) April 1, 2024","","Investors can enter the sale by visiting the official 5th Scape website, where 1 5SCAPE token costs $0.00285.","Once tokens are claimed after the sale ends, holders will be able to stake the coin, earning themselves a passive income in the process.","It could therefore enjoy one of the biggest launches of the year, with its coin making some big gains for early investors.","Buy 5SCAPE Now",""],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"April 10, 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 4, 2024","content":"DATE"},{"type":"2.5%","content":"PERCENT"},{"type":"12.5%","content":"PERCENT"},{"type":"$3,524","content":"MONEY"},{"type":"Cage Conquest","content":"ORGANIZATION"},{"type":"Whale Alert","content":"ORGANIZATION"},{"type":"$0.00285","content":"MONEY"},{"type":"$8.6 billion","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"$5,000","content":"MONEY"},{"type":"April 1, 2024","content":"DATE"},{"type":"89%","content":"PERCENT"},{"type":"$4.5 million","content":"MONEY"},{"type":"second half of the year","content":"DATE"},{"type":"Hunter","content":"PERSON"},{"type":"5th Scape","content":"ORGANIZATION"},{"type":"$5SCAPE","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"$4,000","content":"MONEY"},{"type":"5.21 billion","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"$10K","content":"MONEY"}],"hashtag":["ETH","Ethereum","Price Prediction"],"authors":["Simon Chandler"]}