{"summary":"Ledn Co-Founder Anticipates Future ETFs to Include Bitcoin-Ether Mix","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-ether-etfs-spot-future-predictions-ledn-co-founder.htm","publishDate":"2024-02-16T10:12:49","id":18233,"type":null,"title":"Ledn Co-Founder Anticipates Future ETFs to Include Bitcoin-Ether Mix","category":["News "],"content":["The traditional structure of Spot Bitcoin ETFs may be reaching its peak.","Mauricio Di Bartolomeo, co-founder and Chief Strategy Officer at Ledn, anticipates a shift beyond vanilla ETFs. He expects these to incorporate a wider range of crypto assets within single investment vehicles in the coming year.","The Ledn executive said he sees a clear regulatory path for ETFs, legitimizing crypto through their presence. The involvement of established institutions like BlackRock is especially significant as they hold sway in financial markets and have a vested interest in the success of their products, he said.","In an interview with Cryptonews on Thursday, Bartolomeo suggested Ethereum will be the last single-asset crypto deemed “ETF-worthy” by traditional institutions due to a lack of credibility in others — for now.","However, he predicted several new ETF variations to emerge, outlining the order of their expected arrival.","“To me it goes: Bitcoin Spot ETFs, Ethereum [spot] ETFs… and then you’re going to start seeing 2x Bitcoin ETFs, Short Bitcoin ETFs, 3x Ethereum ETFs, Bitcoin plus Ethereum ETFs. All types of combinations of these things,” he said. He believes these new ETF variations will take center stage before any other cryptocurrency qualifies for a single-asset ETF.","He explained that the success of spot-based ETFs will cause an explosion of multiple hybrid ETFs. The cryptocurrency’s price recently exceeded $52,000, supported by its regained trillion-dollar market cap and consistent inflows into existing spot ETFs.","Notably, BlackRock’s iShares Bitcoin Trust boasts impressive momentum, adding further fuel to optimism about Wall Street’s embrace of these financial vehicles.","“As an issuer, this is a blockbuster success,” Bartolomeo said. “You have nine issuers, and like four of them have over a billion in assets. Any one of those launches on its own would have been considered the best launch of the year. And now you have five ETFs doing the same thing and they’re all winning.”","“Are they gonna stop? Probably not. They’re probably already filing for their 2x Bitcoin ETF.”","The Bitcoin ETFs are even bigger than most bulls thought they would be. Ethereum ETFs are next. The difference is that ETH is smaller and more centralized. Blackrock and the banks are going to get total control of Ethereum imminently. Only BTC is sufficiently decentralized.","— Mike Alfred (@mikealfred) February 16, 2024","","ETF issuers like ProShares and Bitwise have already joined the race. Both filed applications with the US SEC last year for an ETF focused on Bitcoin and Ether called the Bitcoin and Ether Equal Weight Strategy ETF.","According to Proshares, the ETF will measure “the performance of holding long positions in the nearest maturing monthly bitcoin and ether futures contracts.”"],"entity":[{"type":"Ether Equal Weight Strategy ETF","content":"ORGANIZATION"},{"type":"Mauricio Di Bartolomeo","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Mike Alfred (","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Short Bitcoin","content":"PERSON"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"February 16, 2024","content":"DATE"},{"type":"$52,000","content":"MONEY"},{"type":"Bartolomeo","content":"PERSON"},{"type":"Cryptonews","content":"PERSON"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin ETF","ETFs","spot Bitcoin ETF"],"authors":["Shalini Nagarajan"]}