{"summary":"Democratic Senators Urge SEC Chair Gensler Against Crypto ETF Approvals, Cite “Significant” Risks","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/democratic-senators-urge-sec-chair-gensler-against-crypto-etf-approvals-cite-significant-risks.htm","publishDate":"2024-03-15T19:56:44","id":18238,"type":null,"title":"Democratic Senators Urge SEC Chair Gensler Against Crypto ETF Approvals, Cite “Significant” Risks","category":["Blockchain News "],"content":["Democratic Senators Laphonza Butler (D-CA) and Jack Reed (D-RI) pushed United States Securities and Exchange Commission (SEC) Chair Gary Gensler to “strictly limit” the approval of crypto-based ETFs, in a March 11 letter addressed to Gensler.","In the letter, Butler and Reed claimed cryptocurrencies pose “significant and unique risks” to the American people.","“The SEC’s approvals have provided a green light for Wall Street to sell volatile cryptocurrency investments to ordinary Americans through their brokerage and retirement accounts,” the letter reads.","The democratic senators also cited the January 2024 report from the Financial Industry Regulatory Authority (FINRA) showing that an estimated 70% of brokers’ communications to retail investors regarding cryptocurrencies violated fair disclosure rules.","“These alarming deficiencies raise significant concerns that brokers and advisers may now provide incomplete or deceptive information about bitcoin ETPs to retail investors,” Reed and Butler stated.","Reed and Butler’s letter follows the SEC’s January approval of several spot bitcoin ETFs, which caused bitcoin’s price to surge. Earlier this week, the token’s price soared to over $73,000 to mark an all-time high.","The cryptocurrency’s rally coincides with rising discussions regarding the potential SEC approval of a spot Ethereum ETF, with experts putting the estimated chances of approval in May at just 35%.","The blockbuster success of the Bitcoin ETF is upsetting to high ranking Dems. Buyer’s remorse. This is part of why we are pessimistic re spot Eth etf approval chances. https:\/\/t.co\/SGEAkGQGyD","— Eric Balchunas (@EricBalchunas) March 14, 2024","","“The blockbuster success of the Bitcoin ETF is upsetting to high-ranking Dems,” wrote Bloomberg Senior ETF Analyst, Eric Balchunas. “Buyer’s remorse. This is part of why we are pessimistic re spot Eth etf approval chances.”","Meanwhile, the senators alleged that Bitcoin ETFs should be referred to as exchange-traded products (ETPs) due to the lack of “restrictions on harmful practices that apply to most investment funds marketed to retail investors,” including limits on leverage, custody requirements, and examination by the SEC.","“Although it may seem like a small distinction, this purposeful confusion of terminology is troubling because bitcoin ETPs are different in critical ways from mutual funds and ETFs,” the senators stated.","The letter then requested Gensler to closely monitor communications from brokers and advisors regarding ETFs as well as to ensure Bitcoin ETFs “do not use inappropriate and confusing naming conventions” in official filings.","“These steps would help protect investors from fraud and abuse, which may be enabled by the current light-touch regulatory regime applicable to Bitcoin ETPs,” the letter concluded.","As of time of publication, Gensler has yet to publicly reply to the letter."],"entity":[{"type":"Jack Reed","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"$73,000","content":"MONEY"},{"type":"Butler","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Laphonza Butler","content":"PERSON"},{"type":"Financial Industry Regulatory Authority (FINRA","content":"ORGANIZATION"},{"type":"March 11","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"March 14, 2024","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Reed","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin ETF","Crypto Regulation","SEC"],"authors":["Julia Smith"]}