{"summary":"Bakkt is eyeing a Q3 launch pending approval from the NYDFS, according to sources close to the situation\nA leaked version of the exchange’s initial plans shows a guaranty fund that some say is too low to cover positions at risk","author":["Aislinn Keely","Frank Chaparro","Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33668\/bakkt-is-eyeing-a-launch-in-q3-but-part-of-its-plan-is-risky-sources-say","publishDate":"2019-07-26T15:22:20","id":1823,"type":null,"title":"Bakkt is eyeing a launch in Q3, but part of its plan is risky, sources say","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Bakkt is gearing up to announce a Q3 launch date, a source close to the upcoming exchange has told The Block, but leaked plans about its <\/span>initial<span data-v-f87c67ca=\"\"> product structure have raised questions.<\/span>","<span data-v-f87c67ca=\"\">As per a slide-deck obtained by The Block, the Intercontinental Exchange-backed project is still waiting on approval from the New York Department of Financial Services to operate its so-called Bakkt Warehouse, which would allow Bakkt to operate as a limited-purpose trust company.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bakkt Warehouse, if approved, would serve as a qualified custodian for the bitcoin that underpins its physically delivered futures.&nbsp;<\/span>","\"The future is different from the warehouse, but the product depends on the warehouse,\" a trading executive, who requested anonymity, told The Block in a message.&nbsp;","In May, Bakkt said it would not launch its one-day contract and monthly contract until it the firm acquires its <a href=\"https:\/\/www.theice.com\/publicdocs\/regulatory_filings\/19-160_Listing_Bitcoin_Daily_Futures_Contract.pdf\" data-v-f87c67ca=\"\">trust<\/a>.","<span data-v-f87c67ca=\"\">The company claims it has provided the regulated infrastructure for traders to deliver and receive bitcoin for dollars in standardized settlement cycles. The futures contracts will be cleared by ICE Clear U.S., and will be compliant with CFTC regulations.<\/span>","\"Bakkt’s infrastructure creates the first end-to-end regulated environment for traders to deliver&nbsp;and receive bitcoin in exchange for USD in standardized settlement cycles,\" the document read.","<b data-v-f87c67ca=\"\">Product plan under scrutiny<\/b>","<span data-v-f87c67ca=\"\">An early launch will come as good news to clients out of state, but multiple industry sources who have seen Bakkt’s pitch deck say parts of its launch plan assume too much risk.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Firstly, they note that Bakkt’s guaranty fund is arguably too small to cover positions at risk. ICE will contribute $35 million to Bakkt’s existing guaranty fund specifically for losses related to bitcoin contracts. Guaranty funds are usually required and administered by a state as a safeguard for if insurers are unable to pay policyholders.<\/span>","<span data-v-f87c67ca=\"\">“This is not a normal practice in the clearing risk management system,” says Ricky Li, co-founder of trading firm Altonomy.<\/span>","<span data-v-f87c67ca=\"\">He took issue with the size of Bakkt’s funds, which would have around $400 million in open positions at risk compared to the $35 million guaranty fund. Bakkt itself seems to acknowledge the inflated risk, with the materials provided by ICE explaining there are plans to increase the guaranty fund over time, after the launch.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the co-founder of a New Jersey crypto hedge fund agreed that it was low, but not “alarmingly” so.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Overall, the source added, the plan is still good enough to attract traders like themselves. By comparison, Li also said that other popular exchanges like BMX have minimal transparency for their consumer protections.<\/span>","<span data-v-f87c67ca=\"\"><a title=\"View Bakkt Document - The Block on Scribd\" href=\"https:\/\/www.scribd.com\/document\/419860547\/Bakkt-Document-The-Block#from_embed\" data-v-f87c67ca=\"\">Bakkt Document - The Block<\/a> by <a title=\"View Steven's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/469524215\/Steven#from_embed\" data-v-f87c67ca=\"\">Steven<\/a> on Scribd<\/span>","<iframe id=\"doc_32524\" class=\"scribd_iframe_embed\" title=\"Bakkt Document - The Block\" src=\"https:\/\/www.scribd.com\/embeds\/419860547\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-A5tW00XuBhOGGnImhkbh&amp;show_recommendations=true\" width=\"110%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;"],"hashtag":[]}