{"summary":"Litecoin Price Pumps to Over $6 Billion Market Cap – Analysts Tip This Utility Coin for Gains Next","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/litecoin-price-pumps-to-over-6-billion-market-cap-analysts-tip-this-utility-coin-for-gains-next.htm","publishDate":"2023-06-08T13:46:00","id":18243,"type":null,"title":"Litecoin Price Pumps to Over $6 Billion Market Cap – Analysts Tip This Utility Coin for Gains Next","category":["Altcoin News "],"content":["Despite not having been named by the US Securities and Exchange Commission (SEC) as a crypto security in the agency’s double whammy of lawsuits against Binance and Coinbase announced earlier this week, the Litecoin (LTC) price is struggling. ","LTC\/USD was last changing hands in the $87 area, down close to 7% on the week and down around 10% from the multi-week highs the coin printed over the weekend in the $97 area.","Still, Litecoin has managed to hold onto a market capitalization of over $6 billion.","The cryptocurrency’s market cap was last at around $6.45 billion.","LTC bulls will take solace from the fact that Litecoin found support once again earlier in the week at its 200-Day Moving Average (DMA).","But bearish mid-week price action, with LTC having been unable to break back above its 21DMA on Wednesday and down more than 1% already on Thursday, a retest of the 200DMA looks to be on the cards.","But bulls fear not (not yet at least, anyway).","Litecoin continues to carve out a bullish long-term chart pattern that, coupled with important upcoming fundamental developments, could propel the cryptocurrency higher later this year.","Since last November, LTC has been in the process of forming a bullish ascending triangle pattern, with support coming in the form of an uptrend from last November’s sub-$50 lows and resistance coming in the form of early yearly highs in the $103-105 area.","Such formations typically form ahead of a major bullish breakout, hence why technical analysts are talking about the possibility that LTC can pump 50-60% from current levels to test major 2022 resistance points in the $135 to $145 area.","And the fundamentals appear to be there to support such a move.","As per a nicehash.com dashboard, the block reward for Litecoin miners is set to halve in just 54 days from 12.5 LTC per block to 6.25, meaning a halving of the cryptocurrencies inflation rate.","This has been touted by analysts as a major potential bullish catalyst.","Meanwhile, Litecoin continues to demonstrate its strong use case as a secure, decentralized payments blockchain.","When transaction fees spiked on the congestion-prone Bitcoin and Ethereum blockchains early last month as a result of a resurgence in meme token speculation and a surge in popularity of the Bitcoin blockchain-based Ordinals protocol, Litecoin also saw a surge in network activity.","According to data presented by Glassnode, the 7-day moving average of daily transactions hit a record high of nearly 500,000 on the 14th of May, before falling back to around 220,000 as of Wednesday, still double early 2023 levels.","But rather than sending transaction prices higher, they actually dropped substantially.","As per Glassnode data, fees dropped from around 0.00013 LTC in mid-April to record lows of around 0.00004 LTC by mid-May and haven’t risen much from these levels.","Litecoin is likely to experience continued adoption as a means of payment thanks to its fast transaction times and low fees, as is already evident in cryptocurrency’s growing usage on crypto payments platform Bitpay.","Litecoin ⚡ transactions with the world's largest #crypto payments processor @Bitpay just hit their highest ever: Over 28% last month!!\n\nMore and more people are choosing to #PayWithLITECOIN pic.twitter.com\/F8ROfPOnlw","Investors might want to consider diversifying their crypto portfolio into projects with a better chance of delivering near-term gains.","One high-risk-high-reward investment strategy that some investors might want to consider is getting involved in crypto presales.","This is where investors buy the tokens of up-start crypto projects to help fund their development.","These tokens are nearly always sold very cheap and there is a long history of presales delivering huge exponential gains to early investors.","Many of these projects have fantastic teams behind them and a great vision to deliver a revolutionary crypto application\/platform.","If an investor can identify such projects, the risk\/reward of their presale investment is very good.","The team at Cryptonews.com spends a lot of time combing through presale projects to help investors out.","One such project that the team has identified as having a very strong potential is DeeLance.","An innovative new web3 project called DeeLance is building a crypto and NFT-powered metaverse that, in an industry first, puts the jobs market on the blockchain.","The project, which is touted as one of 2023’s hottest crypto start-ups, is building a metaverse to unite freelancers and employers and promises to overhaul remote working forever, as well as the $761 billion-dollar recruitment sector.","Using the decentralization and transparency of the blockchain, DeeLance wants to remove overly powerful middlemen like Fiverr and Upwork that have been abusing freelance workers and employers alike for the last decade.","DeeLance is already generating huge hype in web3 circles and some observers think could upend the still very web2 platform-centric freelance\/gig work economy.","The project has already raised a whopping near $1.29 million in just a few weeks since the launch of its $DLANCE token presale.","DeeLance also recently secured a huge $1.12 million strategic investment from top venture capital firm Bitgert Ventures, a sign that institutions are increasingly taking note of the project’s potential.","📢 @bitgertbrise investment arm @Bitgertventures has made an strategic investment of $1.12M USD in @deelance_com, a freelance platform!\n\nThis investment will help #Deelance expand its services & provide more opportunities for freelancers around the world\n#BRISE $BRISE #Bitgert pic.twitter.com\/7rjl14bVWU","Investors are encouraged to move quickly to secure tokens, as when the presale hits $1.7 million, the price will rise from its current super-cheap $0.038 level.","Given that DLANCE will debut on major cryptocurrency exchanges later this year at $0.57, investors who get in now can be sat on gains of around 50%.","Adding to the excitement is a massive $500K $DLANCE token giveaway competition that DeeLance is conducting.","The top five wallets that buy the most $DLANCE between now and the end of presale stage four will be rewarded with a share of $500K worth of $DLANCE tokens.  ","$DLANCE can be bought using ETH, BNB and USDT (the ERC-20 and BEP-20 variants).","Buy DLANCE Here"],"entity":[{"type":"$97","content":"MONEY"},{"type":"$761 billion","content":"MONEY"},{"type":"$50","content":"MONEY"},{"type":"$103","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$DLANCE","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$1.7 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$500K","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"LTC\/USD","content":"ORGANIZATION"},{"type":"$1.29 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"DMA","content":"ORGANIZATION"},{"type":"$BRISE","content":"MONEY"},{"type":"$0.57","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"DeeLance","content":"ORGANIZATION"},{"type":"$145","content":"MONEY"},{"type":"$1.12 million","content":"MONEY"},{"type":"$0.038","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"$135","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$87","content":"MONEY"},{"type":"mid-April","content":"DATE"},{"type":"$6.45 billion","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"$500K $DLANCE","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Bitgert Ventures","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"mid-May","content":"DATE"},{"type":"$1.12","content":"MONEY"},{"type":"Litecoin","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Glassnode","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["Binance","Coinbase","Litecoin","Price Prediction","SEC"],"authors":["Joel Frank"]}