{"summary":"UK Financial Watchdog Limits UK Crypto ETNs to Professional Investors Only","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-financial-watchdog-limits-uk-crypto-etns-to-professional-investors-only.htm","publishDate":"2024-03-11T09:00:47","id":18244,"type":null,"title":"UK Financial Watchdog Limits UK Crypto ETNs to Professional Investors Only","category":["News "],"content":["The UK’s financial regulator will allow recognized exchanges to launch crypto asset exchange-traded notes (cETNs).","Only professional investors, like investment firms and authorized credit institutions, will have access to these products, the Financial Conduct Authority said Monday.","However, exchanges need to have controls in place to ensure trading runs smoothly and protect professional investors. Also, the cETNs must meet all the requirements of the UK Listing Regime in prospectuses and disclosures.","The regulator’s decision to allow cETN applications follows US approval of Spot Bitcoin exchange-traded funds (ETFs), which has led to significant success and a surge in Bitcoin prices.","Also on Monday, the London Stock Exchange said it would accept applications for Bitcoin and Ethereum ETNs in the second quarter of 2024.","The country has been reluctant to approve retail access to these products, leaving it somewhat isolated compared to other major global markets.","In 2020, the FCA banned UK firms from offering or selling crypto derivatives and ETNs over reasons including market volatility. It maintains that these carry significant risks for retail consumers, leading to potential harm. Consequently, their sale remains prohibited.","“The FCA continues to remind people that cryptoassets are high risk and largely unregulated. Those who invest should be prepared to lose all their money,” the regulator warned.","In its regulatory efforts concerning crypto, the UK has adopted a two-part strategy.","In October, the Treasury unveiled comprehensive proposals aimed at regulating fiat-backed stablecoins, particularly focusing on their use in payment systems.","This initial step represents the beginning of their regulatory agenda, with future plans to extend regulatory oversight to the wider cryptocurrency sector, which will be detailed in separate policy documents."],"entity":[{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"fiat","content":"ORGANIZATION"},{"type":"the London Stock Exchange","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"UK Listing Regime","content":"ORGANIZATION"},{"type":"second quarter of 2024","content":"DATE"}],"hashtag":["ETFs","FCA","UK"],"authors":["Shalini Nagarajan"]}