{"summary":"Immutable Eliminates Fees in zkEVM Gaming Solution + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/immutable-eliminates-fees-in-zkevm-gaming-solution-more-news.htm","publishDate":"2023-12-14T14:00:39","id":18242,"type":null,"title":"Immutable Eliminates Fees in zkEVM Gaming Solution + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","Gaming company Immutable announced that more than 40 decentralized games have pivoted to Immutable zkEVM, a next-gen Zero-Knowledge (ZK) proof-based scaling platform developed in collaboration with Polygon Labs.","According to the press release, Immutable zkEVM is a gaming-focused chain that offers full compatibility with the Ethereum Virtual Machine and which will enable game developers to “eliminate the very concept of gas fees, making them not only invisible but essentially non-existent for players.”","This will make trying out new games significantly more affordable by removing the industry’s most challenging user experience barriers, it said.","By leveraging Immutable zkEVM, game developers can sponsor gas fees for any Immutable Passport user, thus enabling frictionless onboarding and increased transaction conversion rates.","When the Immutable zkEVM mainnet goes live early next year, the company plans to sponsor gas fees for all games in its ecosystem for a limited time to ensure a smooth transition.","The cost to game studios will be negligible, it said, approximately $500-$1,000 for every 100,000 users.","“Ultimately, Immutable zkEVM and Immutable Passport will allow developers to not only abstract gas fees away from their player experience but also potentially pave the way for a new monetization model in the gaming industry,” Immutable said.","By treating the cost of gas sponsorship like traditional server or infrastructure costs, games will be able to introduce digital asset ownership in a way that benefits both players and game studios.","Immutable has more than 200 games currently building in its ecosystem overall, not just on zkEVM.","Miles & More, the loyalty program of the second-largest European airline, Lufthansa Group, has partnered with qiibee, a blockchain-based B2B marketplace for customer loyalty, enabling SMEs to easily join the program.","According to the press release, for Miles & More members, this expansion grants access to a wider and more diverse range of partners, including those at a regional level, where they can earn and redeem miles throughout the entire travel chain and in everyday life.","Partners include luxury fashion platform fashionette.de, VIP Hospitality marketplace DAIMANI, and Swiss-based digital asset wallet SwissFortress.","Meanwhile, qiibee will create customized marketing packages for SMEs within the Miles & More program. Through their platform, prospective enterprises can effortlessly initiate a collaboration.","Compared to traditional loyalty-reward programs, this technological integration removes the reconciliation costs between partners, generating an enhanced connection between enterprise and customer.","Also, qiibee will oversee these partnerships’ contractual, commercial, technical, and promotional management.","US-headquartered Bitcoin (BTC) ATM provider CoinFlip, with over 4,500 kiosks worldwide, announced the official expansion of its Order Desk services to the Canadian market.","According to the press release, CoinFlip already has a presence in Canada with over 200 kiosks and has continued to experience significant user growth.","The Order Desk provides an easy on-ramp for investors who want to add or increase their exposure to cryptocurrency, it said.","Each customer is paired with a personal Client Manager based on their experience and crypto knowledge.","From there, customers can set up phone calls or video meetings to discuss the market, ask questions, and confidently buy and sell cryptocurrencies.","All conversations with CoinFlip Client Managers are free of charge, with a single service fee applied when an order is placed through the Order Desk.","Web3 domain names and digital identity provider Unstoppable Domains announced partnerships with twelve all-new registrars to help accelerate the mass adoption of web3 domains in South America and Southeast Asia.","Most recent partners include NoNameMonster, Entorno, DominiosWeb3, EndlessDomains, and DotNames.","Per the press release, thanks to the addition of these new registrars, Unstoppable will be able to offer their customers globally a wide array of the company’s other Web3 domains, including .x, .crypto, .nft, .wallet, .polygon, .dao, .888, .zil, .go, .blockchain, .bitcoin, .eth, and others.","DominiosWeb3 has become Unstoppable’s first registrar partner in South America, allowing the Spanish and Portuguese-speaking community to buy, sell, and manage Web3 domains “in the most convenient and frictionless way possible via a comprehensive and easy-to-use platform.”","Demand is steadily increasing for Web3 domains, Unstoppable Domains said. The provider has sold over 3.9 million since 2018, and that number continues to grow."],"entity":[{"type":"CoinFlip Client Managers","content":"ORGANIZATION"},{"type":"South America","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"Lufthansa Group","content":"ORGANIZATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"$500","content":"MONEY"},{"type":"Unstoppable Domains","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Entorno","content":"LOCATION"}],"hashtag":["Adoption","Asia","ATM","Blockchain","Canada","Europe","Fees","Gaming","Latin America"],"authors":["Sead Fadilpašić"]}