{"summary":"Revolut Suspends Crypto Services for UK Business Clients Due to New FCA Rules","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/revolut-suspends-crypto-services-for-uk-business-clients-due-to-new-fca-rules.htm","publishDate":"2023-12-18T19:46:43","id":18250,"type":null,"title":"Revolut Suspends Crypto Services for UK Business Clients Due to New FCA Rules","category":["Blockchain News "],"content":["London-based digital bank Revolut announced on Monday that it will be suspending the ability for Revolut Business users to purchase cryptocurrencies starting in 2024. The move comes in response to new crypto regulations enacted by the United Kingdom’s Financial Conduct Authority (FCA) to protect investors from risky crypto investments.","According to an email reviewed by City A.M., Revolut informed UK business clients that it will no longer allow them to buy cryptocurrencies like Bitcoin and Ethereum via Revolut Business beginning January 3, 2024. While holdings can still be sold or transferred out, the popular trading feature will be revoked.","Revolut initially enabled cryptocurrency trading for UK customers in September 2022 after registering with the FCA. Tough new rules imposed by the regulator are forcing the company and others to withdraw services, however.","The FCA’s crypto asset promotions policy took effect in October to curb misleading advertising and ensure appropriate risk disclosures. Stringent requirements include a 24-hour cooling-off period following deposits, bold risk warnings across communications, and a ban on incentives such as “refer a friend” bonuses.","","To comply, Revolut and other major platforms like crypto exchange Bybit and PayPal have decided to limit the availability of crypto buying and trading specifically for UK customers. PayPal withdrew its crypto service for British users in August amid the changing crypto regulations.","Some critics argued the FCA’s stringent regulations could prove counterproductive.","“As history tells us, this has the exact opposite effect & simply moves people further away from the financial system,” Bitcoin mining company RenewaBlox COO Jason Deane tweeted. “Fortunately with Bitcoin, the entire network can operate outside of the existing financial system if required without being even remotely affected by that.”","While the loss of direct purchase functionality will impact Revolut’s UK business user base, the company maintained it’s working to meet the FCA requirements.","“These requirements aim to enhance the customer journey and provide additional protection for new and existing investors of crypto assets,” Revolut said in the email. “As a result, we’ll need to adjust our current Business crypto offering to make sure all of the new requirements are met.”","For now, Revolut’s crypto functions will remain intact for UK retail investors. The change solely affects business account holders, who will need to use other platforms for crypto buying starting in 2024."],"entity":[{"type":"United Kingdom’s Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Revolut","content":"PERSON"},{"type":"Revolut","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"City A.M.","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"January 3, 2024","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Jason Deane","content":"PERSON"}],"hashtag":["Crypto Regulation"],"authors":["Trent Alan"]}