{"summary":"Why buy NFTs when you can buy real items as NFTs? Decentralized marketplace platform Boson Protocol believes tokenization is the future of online commerce.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182691\/boson-protocol-revamps-redeemable-nft-marketplace","publishDate":"2022-11-04T05:27:10","id":1825,"type":null,"title":"Boson Protocol revamps redeemable NFT marketplace","category":["NFTS"],"content":["Boson Protocol launched a revamped version of its NFT platform that allows people to sell real items — in the form of nonfungible tokens — that can be burned and redeemed for the actual product within a certain time period, it announced at NFT.London.","The idea is that buyers can then trade, gift and transfer these NFTs without actually ever possessing the physical item — similar to a forward contract for a physical thing programmed within smart contracts.&nbsp;“Rather than tokenizing physical assets themselves, redeemable NFTs tokenize the right to receive a physical asset within a given time period,” Boson Protocol explained on its website.","The platform will be geared towards luxury goods.\"We've got a number of projects where they're tokenizing luxury wine and luxury whiskey,\" explained co-founder Justin Banon. \"Someone will get a redeemable NFT that they can hold or trade for five or 10 years while the whiskey matures,\" he continued, adding that \"those sort of items would create a commodities market for luxury whiskey.\"","Banon also sees NFTs as a way to bundle together different products, including digital twins — real-life items that have a twin in the metaverse, such as a physical t-shirt that is also a metaverse wearable.&nbsp;“You could go to a football game and have the ticket, a redeemable shirt and a token that enables you to access a digital download of the game,\" he provided as an example. \"It’s a kind of solution for creating bundles of digital, physical and experiential things,” he added.","Promoters of redeemable NFTs argue that they have the potential to give more control to consumers. For example, if your one-year gym membership was an NFT and you decided you no longer wanted to use it, you could sell it to someone else who could use the remaining time left on it — rather than you being locked into a contract.","The downside is that this can lead to price increases. In August, BarrelDAO <a href=\"https:\/\/www.theblock.co\/post\/166199\/barreldao-sells-out-nft-linked-solana-summer-shandy-beer\" data-v-f87c67ca=\"\">launched<\/a> a collection of 333 NFTs redeemable for a limited edition 16-pack of Solana-themed beer. It quickly sold out. The original NFTs sold for 1.35 SOL (then $45) each, but the ones listed on Magic Eden had a floor price of 2.49 SOL (then $79.61).","For e-commerce, this creates an issue in cases where sellers don't actually deliver a product.&nbsp;\"Let's say someone tokenizes a $1,000 pair of sneakers and then they go out and sell that token on an NFT website for $5,000,\" Banon noted, explaining that \"there's a challenge here — if the seller doesn't deliver, the second buyer has paid $5,000 for something, and there's only $1,000 in the protocol that they will get back in the case of the thing not being delivered.\"&nbsp;","Boson Protocol has called its solution for this \"sequential commit\" — where, instead of the exchange of the redeemable NFT happening outside of the protocol, subsequent buyers will actually pay their money into the protocol.&nbsp;\"The protocol will custody that money and, therefore, protect subsequent buyers from this kind of partial rug pool,\" said Banon.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Banon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Justin Banon","content":"PERSON"},{"type":"$45","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$79.61","content":"MONEY"},{"type":"” Boson Protocol","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}