{"summary":"UK Regulatory Framework Will Embrace Coexistence of Stablecoins and CBDCs, Aligned with EU Standards","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-regulatory-framework-will-embrace-coexistence-of-stablecoins-and-cbdcs-aligned-with-eu-standards.htm","publishDate":"2024-03-06T17:31:46","id":18257,"type":null,"title":"UK Regulatory Framework Will Embrace Coexistence of Stablecoins and CBDCs, Aligned with EU Standards","category":["Blockchain News "],"content":["To align with EU standards, the United Kingdom unveiled plans on March 6 to integrate both stablecoins and central bank digital currencies (CBDCs) into its regulatory structure.","Former Bank of England (BoE) official Varun Paul detailed the UK’s effort to catch up with the rest of the European Union in crypto regulation in a report by Coin Telegraph.","Talks regarding stablecoins and CBDCs have always been debated between crypto natives and traditional finance.","The UK treasury released a proposal in 2023 to regulate the crypto industry, requiring Virtual Asset Providers (VASPs) to obtain authorization from the Financial Conduct Authority (FCA).","Despite concerns about CBDCs contradicting decentralization, Paul believes the UK’s regulatory structure would benefit from this integration.","UK regulations embracing coexistence of stablecoins & CBDCs is a bold move forward. But sike, too late – we've already got the ticker $CBDC For the people,By the people, putting power in the hands of the people. @Cointelegraph @bankofengland #CBDC #Stablecoins…","— Central Bank Digital Currency (@SolanaCBDC) March 6, 2024","","Paul, now a senior director for CBDCs and financial market infrastructure at Fireblocks, said that the U.K. would benefit from the nature of its financial regulatory structure.","He highlighted that Joint regulatory frameworks that facilitate the FCA, Treasury, and BoE to collaborate without friction have always been key to seamless financial innovation and regulation in the UK.","As Paul revealed, the regulatory bodies would be saddled with different duties. The FCA would oversee stablecoins, while the BoE focuses on “systematically impatient” operators.","Stablecoins like Tether (USDT) and USD coin (USDC) have become key utilities in the crypto industry.","USDT, the most widely used stablecoin, with over 100 billion market capitalization, currently claims the third spot among global crypto assets.","In his whitepaper published by Fireblocks in November 2023, Paul proposed a system where Central banks issue CBDCs as a base asset backed by banknotes. This would increase people’s trust in such digital assets.","“Europe and the U.K. are saying we need to have a form of money denominated in euros and sterling, and we have the opportunity to say what that looks like,” according to the white paper.","He cited concerns regarding Tether reserves transparency, a popular case in which USDT founders entered a legal battle with the New York Supreme Court in 2021.","UK lawmakers are considering providing a safe tokenized asset backed by central reserves instead of a stablecoin that mirrors the U.S. dollar.","The whitepaper concluded that stablecoins and CBDCs should be made to co-exist.","According to Paul, this can be made possible with programmable contracts allowing central banks to issue a CBDC to facilitate e-payment and serve as a utility on the blockchain.","He further emphasized the need for a uniform currency in fiat and digital forms to ease transactions and coordinate financial processes. Consequently, people can choose between a CBDC or existing stablecoins.","Crypto investors, who are mostly GenZ, might be inclined towards stablecoins, while the older generations would want to opt for a digital currency issued by the central bank.","Invariably, stablecoins and CBDCs should be made to co-exist as they serve specific needs and offer versatility in usage.","UK lawmakers affirmed that work is ongoing to create a regulatory bill to facilitate the creation and usage of CBDCs and stablecoins before the end of 2024."],"entity":[{"type":"United Kingdom","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 6, 2024","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Coin Telegraph","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Former Bank of England (BoE","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Paul","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"March 6","content":"DATE"},{"type":"Varun Paul","content":"ORGANIZATION"},{"type":"New York Supreme Court","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"$CBDC","content":"MONEY"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"}],"hashtag":["CBDC","Stablecoins","UK"],"authors":["Jimmy Aki"]}