{"summary":"The Sui blockchain-based Ethos Wallet raised a $4.2 million seed round led by Boldstart Ventures and Gumi Cryptos Capital. \nIn July, the consumer-focused crypto wallet, became the first application to go live on the Sui developer network.","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205795\/sui-based-wallet-raises-4-2-million-led-by-gumi-cryptos-and-boldstart","publishDate":"2023-01-26T09:00:20","id":1825,"type":null,"title":"Sui-based wallet raises $4.2 million led by Gumi Cryptos and Boldstart","category":["Deals"],"content":["Ethos Wallet, based on the yet-to-launch Sui blockchain, raised a $4.2 million seed round led by Boldstart Ventures and Gumi Cryptos Capital.&nbsp;","The round for the wallet also featured participation from Tribe Capital, Matrix Port and AllianceDAO. Notably, Mysten Labs, the creator of Sui, also poured capital into the startup.","Mysten is led by founder and CEO Evan Cheng, who was head of research at Meta's crypto wallet Novi Financial. Sui is a new Layer 1 chain that utilizes a version of the Move program language initially intended for Meta's ill-fated blockchain project Diem.&nbsp;","In July, Ethos, a consumer-focused crypto wallet, became the first application to go live on the Sui developer network. Developer networks, or Devnets, let developers build and experiment with projects without the higher stakes of using live cryptocurrencies.&nbsp;","\"Even compared to Move as used by other blockchains, Sui Move is significantly easier to read and reason about,\" explained Sui founder and CEO Nadia Eldeib in a written interview with The Block. \"This is important because it means it is easier for developers to build creatively and iteratively, and do more while writing less code.\"","In particular, Eldeib said that this particularly lends itself to developing consumer wallets such as Ethos. In addition to acting as a crypto wallet where users can store and trade crypto on Sui, the Ethos team built Sui 1892, an interactive gaming NFT that's playable on the app.","Eldeib said that the game is fully on-chain, with Ethos players safely pre-approving transactions to make it fast and easy to play.&nbsp;","The consumer focus on aspects such as gaming is part of a larger plan to make the wallet a \"home base for your digital life\".&nbsp;","\"We imagine a future where people are waking up and checking their Ethos wallet because it is where the most vibrant and interesting parts of their digital lives exist (rather than waking up and checking social media on your phone today),\" continued Eldeib.&nbsp;","The company plans to use the funding to continue the development of its wallet, developer infrastructure, and apps to further expand its capabilities.&nbsp;","The funding follows previous fundraises for crypto wallet applications. Earlier this month, Aptos-based multisig wallet Msafe <a href=\"https:\/\/www.theblock.co\/post\/199359\/aptos-based-multisig-wallet-msafe-raises-5-million-led-by-jump-capital\" data-v-f87c67ca=\"\">raised<\/a> $5 million in funding led by Jump Crypto. Last week, startup accelerator Y Combinator <a href=\"https:\/\/www.theblock.co\/post\/203711\/y-combinator-multichain-wallet-cypher\" data-v-f87c67ca=\"\">led<\/a> a $4.3 million round into multichain wallet Cypher."],"hashtag":["SEED &AMP; PRE-SEED","SUI"]}