{"summary":"Marathon Digital Reports Facing ‘Operational Challenges’ in Q1 Earnings","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/marathon-digital-reports-facing-operational-challenges-in-q1-earnings.htm","publishDate":"2024-05-10T04:01:32","id":18259,"type":null,"title":"Marathon Digital Reports Facing ‘Operational Challenges’ in Q1 Earnings","category":["Bitcoin News "],"content":["Bitcoin mining firm Marathon Digital reportedly battled against “operational challenges” to produce record financial results in the first quarter of 2024.","In its first-quarter earnings report, the firm reported producing 2,811 Bitcoins during the first quarter of 2024, compared to 4,242 in the last quarter of 2023, a decline of 33.73%.","Marathon Digital reported revenues increased 223% to $165.2 million in the first quarter of 2024 from $51.1 million in the first quarter of 2023. The firms’ energized hash rate which measures the computational power of a blockchain network, increased 142% to 27.8 EH\/s in the first quarter of 2024 from 11.5 EH\/s in the first quarter of 2023.","Marathon Digital shared trading under the ticker “MARA” were down 2.19% at $19.56 at market close on Thursday.","“During the first quarter of 2024, we doubled the size of our portfolio of digital asset compute, launched our first products and services to support the Bitcoin ecosystem, and we battled against operational challenges to produce record financial results,” said Fred Thiel, Marathon’s chairman and chief executive officer, a press release.","Thiel explained in less than four months the mining firm initiated, closed, and integrated the acquisitions of its first three sites. Due to this, the firm doubled the size of its portfolio to 1.1 gigawatts of capacity, 54% of which is directly owned and operated by Marathon Digital.","The firm said it had secured its first paying customers for MARA firmware and began building a sales pipeline for its two-phase immersion system.","","“Despite the operational challenges we faced in the first quarter, we were able to leverage our agility to redistribute equipment to newly acquired sites amidst ongoing repairs,” said Thiel. “When combined with our HODL strategy, these actions allowed us to capitalize on Bitcoin’s positive momentum and produce record financial results for the quarter,” added Thiel.","The firm went on to grow its topline to $165.2 million, improved net income to a record $337.2 million, and generated adjusted EBITDA of $528.8 million.","","Earlier this year, several public mining companies reported decreases in Bitcoin production ranging from 6% to 12% for April following the halving event. Major Bitcoin miners, including Bitfarms, Cipher, CleanSpark, Core Scientific, Riot, and Terawulf, were all affected, according to a report from The Miner Mag.","However, the report said that the robust Bitcoin fee market briefly mitigated the impact of the halving on these companies. Hut 8, one of the prominent Bitcoin mining companies in North America, has reported a significant decline in its proprietary production for April. In their monthly update released on Monday, Hut 8 disclosed that they mined 148 BTC with their proprietary mining fleet during April, marking a 36% decrease compared to March."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"54%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"223%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"142%","content":"PERCENT"},{"type":"During the first quarter of 2024","content":"DATE"},{"type":"$51.1 million","content":"MONEY"},{"type":"$528.8 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"last quarter of 2023","content":"DATE"},{"type":"the first quarter of 2023","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"33.73%","content":"PERCENT"},{"type":"first quarter of 2024","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$337.2 million","content":"MONEY"},{"type":"The Miner Mag","content":"ORGANIZATION"},{"type":"Fred Thiel","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"36%","content":"PERCENT"},{"type":"$165.2 million","content":"MONEY"},{"type":"$19.56","content":"MONEY"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"2.19%","content":"PERCENT"}],"hashtag":["Bitcoin Mining","earnings","Marathon Digital"],"authors":["Tanzeel Akhtar"]}