{"summary":"Solana Meme Project Slothana Raises $10m in ICO, Launches 14-Day Last Chance To Buy Timer Ahead of 420","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-meme-project-slothana-raises-10m-in-ico-launches-14-day-last-chance-to-buy-timer-ahead-of-420.htm","publishDate":"2024-04-16T16:27:05","id":18268,"type":null,"title":"Solana Meme Project Slothana Raises $10m in ICO, Launches 14-Day Last Chance To Buy Timer Ahead of 420","category":["Industry Talk "],"content":["Solana’s sensational new multimillion-dollar 420-friendly meme coin project Slothana ($SLOTH) has added a timer to its website counting down to the end of the project’s ICO phase on April 29, giving Slothana fans only 13 days left to join the presale. ","The launch will follow another seminal Slothana date: Bitcoin’s fourth quadrennial halving and international stoner day on April 20.","The timer comes three weeks into an ICO that has already raised well over $10 million, according to the project’s landing page. ","When the clock runs down, there will be an airdrop date announcement. However, the team is keeping this and other details close to its chest as it cultivates an air of mystery in a bid to catalyze some potentially explosive buying activity in the coming weeks.","Confused as to what it’s all about? It’s simple, really: it’s all about timing. ","Bitcoin’s halving and international stoner day coincidentally both fall on the same day during $SLOTH’s ongoing presale: April 20, a day that will be a canon event for fans of Slothana, meme coins, and crypto in general. ","To start with, a cursory glance at Slothana’s landing page tells readers all they need to know about the symbolic significance of 4\/20. From the clock on the wall, to his baked red-eyes and contented smirk, Slothana reeks of the stuff. ","April 20 was also selected by the Dogecoin community (the self-styled “Doge Army”) to commemorate Doge Day. That means meme coins in general — but canine and stoner-related memes in particular — will be a popular novelty purchase on the day. ","Beyond the countercultural narrative, April 20 is the day when Bitcoin’s code will halve BTC mining rewards in an event known as the halving. ","Analysts are banking on the fact that halvings have historically always caused market-wide bull runs to suggest that potentially all reputable tokens, even funnies like Slothana and Doge, stand to gain from the halving as Bitcoin’s price appreciates in line with its bottlenecked supply. ","Additionally, Slothana’s native network, Solana, has been rising in popularity as its ecosystem expands. ","In recent months, Solana meme coins like Slerf, DogWifHat and Bonk have on good days far outpaced the gains posted by their Ethereum rivals. These recent successes set the stage for Slothana’s own $10 million presale as investors FOMO the network’s next viral meme.","🚀 Hold onto your branches, Slothana faithful! 🌿 We're gearing up to drop some major news: the official launch date is on the horizon! ⏰ Get ready to mark your calendars and set your alarms, because a countdown timer will soon grace our site. Let the hype for the Slothana…","— Slothana (@SlothanaCoin) April 14, 2024","","A string of recent outages have also negatively impacted the price of Solana and rallied the network to bounce back. ","On Monday, Solana developers announced a mainnet beta update aimed at addressing the network’s congestion problems. This could set the stage for a post-halving\/4\/20 Solana meme coin renaissance. ","Interested investors can join the SLOTH presale today by sending SOL to this address: EnSawje2vQSQKtGbPYdXEuYKm2sHgeLKJTqCmrDErKEA or using the contribution widget on the Slothana website.","Visit Slothana Here"],"entity":[{"type":"$SLOTH","content":"MONEY"},{"type":"April 29","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Doge Army","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Slothana","content":"LOCATION"},{"type":"April 14, 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Slothana","content":"PERSON"},{"type":"April 20","content":"DATE"},{"type":"Bonk","content":"ORGANIZATION"}],"hashtag":["sloth","slothana","Solana"],"authors":["Tim Hakki"]}