{"summary":"Bitwise President Explains Why He’s Curious About Ethena","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitwise-president-explains-why-hes-curious-about-ethena.htm","publishDate":"2024-04-11T21:04:19","id":18265,"type":null,"title":"Bitwise President Explains Why He’s Curious About Ethena","category":["Blockchain News "],"content":["The latest stablecoin hype train is underway in the form of Ethena (USDe), and Bitwise President Teddy Fusaro is taking an interest.","In an April 10 Twitter thread reviewing the protocol’s mechanics, Fusaro noted that USDe “may be the fastest-growing USD-denominated asset in the history of crypto.”","“USDe operates v similarly to an ETF,” he wrote.","Bitwise itself owns many crypto funds, including a new and popular Bitcoin spot ETF, though it has no investments in Ethena.","On Amtrak to Boston. Had a min to look at Ethena & USDe which may be the fastest-growing USD-denominated asset in the history of crypto.","I'm tweeting about structure\/mechanics here as I personally understand it. Not a Bitwise or personal investment.https:\/\/t.co\/xNQHvyIBZd","— Teddy Fusaro (@teddyfuse) April 10, 2024","","“There’s a ‘fund’ (protocol) that accepts contributions from ‘APs’ & then issues ‘units’ (or USDe tokens),” Fusaro continued. “The protocol then invests in a pre-determined portfolio.”","Ethena’s portfolio fundamentally consists of four assets: Bitcoin (BTC), Ethereum (ETH), ETH liquid staking tokens, and Tether USDT. Those reserves are counterbalanced by equally weighted short perpetual futures exposure, creating a “delta neutral” portfolio that maintains the same dollar-denominated value over time.","But there’s a catch: The reserves generate yield through their staked ETH and futures interest—and that yield is paid out to all holders of USDe. Then, holders can stake their USDe themselves to receive sUSDe and receive even more yield.","“At scale, this interest can be massive.” Fusaro wrote. “It is a gargantuan total addressable market.”","By comparison, traditional stablecoins like USDT and USDC are backed by centralized reserves primarily consisting of cash and U.S. Treasury bills. The T-bills produce a hefty profit, but the companies backing them entirely retain their gains and do not distribute them to stablecoin holders.","USDe still carries unique risks like any other asset, however. According to Fusaro, these include exchange counterparty risk, exchange hacking risk, smart contract risk, and the risk that futures funding will go negative.","Nevertheless, if the stablecoin experiences any depegs or radical unwinds, Fusaro says it won’t be in the same fashion as the Terra protocol’s TerraUSD stablecoin in May 2022. TerraUSD collapsed in a downward spiral alongside the network’s LUNA token due to internal algorithms that caused the latter token’s supply to hyperinflate.","“Is [USDe] going to work? Honestly, I do not know,” wrote Fusaro. “But the rapid growth and immediate success are wild and the support that they have is obviously significant.”","USDe now boasts a $2.36 billion market cap, compared to less than $1 billion exactly one month ago. According to Stablecoin Stats, this would make it the fourth-largest stablecoin in circulation."],"entity":[{"type":"delta","content":"ORGANIZATION"},{"type":"$2.36 billion","content":"MONEY"},{"type":"Ethena & USDe","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Ethena","content":"LOCATION"},{"type":"April 10, 2024","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tether USDT","content":"ORGANIZATION"},{"type":"April 10 Twitter","content":"DATE"},{"type":"Fusaro","content":"PERSON"},{"type":"Stablecoin Stats","content":"ORGANIZATION"},{"type":"Bitwise President Teddy Fusaro","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"Amtrak","content":"ORGANIZATION"}],"hashtag":["Bitwise","Ethena"],"authors":["Andrew Throuvalas"]}