{"summary":"Marathon CEO Says Bitcoin’s Upcoming Halving Event is Already Partially Priced In","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/marathon-ceo-says-bitcoins-upcoming-halving-event-is-already-partially-priced-in.htm","publishDate":"2024-04-10T08:49:39","id":18266,"type":null,"title":"Marathon CEO Says Bitcoin’s Upcoming Halving Event is Already Partially Priced In","category":["Bitcoin News "],"content":["Bitcoin’s highly anticipated “halving” event may already be partially factored into the market, according to the CEO of Marathon Digital Holdings Inc., the largest cryptocurrency miner in the United States.","In an interview with Bloomberg TV on Tuesday, Marathon CEO Fred Thiel expressed his perspective on the potential impact of the ETF approval on Bitcoin’s price performance. ","“I think the ETF approval, which has been a huge success, has attracted capital into the market and essentially brought forward what could have been the price appreciation we typically would have seen three to six months post halving,” he said. ","“So I think we are seeing part of that now already, and that has put forward some of the demand.”","Based in Fort Lauderdale, Florida, Marathon operates multiple mining facilities across the United States, including in Texas. ","Bitcoin mining is an energy-intensive process where specialized computers validate transactions on the blockchain and miners earn rewards in the form of tokens.","The halving event, scheduled for late April, will reduce the reward for miners by half, impacting their primary revenue source.","“The halving event will reduce the supply of Bitcoin by about 450 a day, which would have some small impact on prices probably,” Thiel commented on the anticipated effects of the halving.","“But as miners, we are very excited to go into a halving, where for once prices have not declined prior to the halving; rather, prices have gone up, so everybody is obviously maximizing to that.”","The CEO of Marathon, the largest Bitcoin mining company, said that the market may have anticipated the Bitcoin halving to a certain extent. After the halving, this mining company can maintain profitability at $46,000 per Bitcoin. https:\/\/t.co\/lqJO6oal6b","— Wu Blockchain (@WuBlockchain) April 10, 2024","","Bitcoin has seen a remarkable rally of over 60% since the beginning of this year, largely fueled by optimistic sentiments surrounding the record demand for US exchange-traded funds (ETFs) directly holding the cryptocurrency.","The leading cryptocurrency experienced a 4% drop on Tuesday, marking the first decline in four trading sessions, with its price reaching $68,773. ","Since its record high of $73,797 on March 14, the digital asset has decreased by approximately 7%.","Thiel estimated that Marathon’s break-even rate following the halving would be around $46,000 per Bitcoin in order to remain profitable. ","As reported, Billionaire Arthur Hayes has expressed a cautious view regarding the upcoming Bitcoin halving and the effects it will have on the price of the asset. ","While many experts anticipate a significant rally for Bitcoin following the halving event, Hayes believes that the price action before and after the event could actually be negative. ","Despite billionaire Arthur Hayes’ cautions view, other industry executives, such as Ripple CEO Brad Garlinghouse, remain optimistic. ","Garlinghouse predicts that the total market value of cryptocurrencies will double this year, largely driven by spot ETFs and Bitcoin halving.","He believes that the introduction of real institutional money through ETFs is a significant factor contributing to this positive outlook.","“I’m very optimistic. I think the macro trends, the big picture things like the ETFs, they’re driving for the first time real institutional money,” he told CNBC on April 7."],"entity":[{"type":"Hayes","content":"PERSON"},{"type":"April 10, 2024","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"$46,000","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"Marathon Digital Holdings Inc.","content":"ORGANIZATION"},{"type":"$73,797","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"Florida","content":"LOCATION"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Garlinghouse","content":"PERSON"},{"type":"March 14","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"ETF","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"late April","content":"DATE"},{"type":"April 7","content":"DATE"},{"type":"$68,773","content":"MONEY"},{"type":"Fort Lauderdale","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin halving","Marathon Digital"],"authors":["Ruholamin Haqshanas"]}