{"summary":"Solana Releases Update to Address Network Congestion Issues","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-releases-update-to-address-network-congestion-issues.htm","publishDate":"2024-04-15T10:17:20","id":18272,"type":null,"title":"Solana Releases Update to Address Network Congestion Issues","category":["Blockchain News "],"content":["Solana developers on Monday announced a mainnet beta update, version 1.17.31, aimed at addressing the network’s recent congestion problems.","This update specifically tackles issues caused by spam transactions, which have significantly slowed processing times and caused frequent transaction failures. In addition to alleviating network congestion, it is expected to stabilize issues related to recent open interest spikes.","Solana developer Anza encouraged validators to upgrade their nodes when the delinquent stake falls below 5%. Upgrading should be done during a window where monitoring is possible, and any issues encountered should be reported to the mb-validators channel on Discord, it added.","The v1.17.31 release is now recommended for general use by MainnetBeta validators. This release contains enhancements which will help alleviate the ongoing congestion on the Solana Network.","— Solana Status (@SolanaStatus) April 15, 2024","","On the Solana network, validators are considered delinquent if they become inactive. The delinquent stake percentage reflects the total amount of SOL staked by currently offline validators. Therefore, Solana developers recommend that validators only upgrade their nodes when the delinquent stake dips below 5%. This ensures network stability during the upgrade process.","The update comes after a period of significant congestion on Solana, which resulted in roughly 75% of non-voting transactions failing. This congestion caused disruption to many developers, forcing them to pause project deployments on the platform.","While the update was under development, Solana attributed the issue to a bug, emphasizing it was not a fundamental flaw within the network itself.","The Solana Foundation acknowledges that multiple factors contributed to the congestion. These included a surge in demand for Solana block space, as well as delays in implementing patches designed to address network-related problems.","Over the past month, SOL has been trading within a narrow range of $160 and $200. For Solana to resume its upward price trend, bulls will need to push the price above the $200 resistance level.","Notably, Monday’s mainnet beta update represents the first step in a series of planned improvements. Further enhancements are expected to be included in the next version."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"April 15, 2024","content":"DATE"},{"type":"Solana Network","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"$200","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$160","content":"MONEY"},{"type":"MainnetBeta validators","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Solana","Solana Developers"],"authors":["Shalini Nagarajan"]}