{"summary":"Gevulot, a Layer 1 blockchain focused on zero-knowledge proofs, has completed a $6 million seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274791\/gevulot-seed-round","publishDate":"2024-01-29T10:00:06","id":1827,"type":null,"title":"Gevulot raises $6 million in seed funding for blockchain focused on ZKPs","category":["VENTURE CAPITAL"],"content":["Gevulot, a blockchain focused on zero-knowledge proofs, has completed a $6 million seed funding round. The round was led by Variant and featured participation from RockawayX, Volt Capital, and Staking Facilities, as well as individual backers, such as Polygon Labs CEO Marc Boiron and Manta Network founder Shumo Chu. Gevulot did not disclose its valuation.","Gevulot plans to allocate the capital toward the rollout of its Layer 1 blockchain, which enables developers to harness <a href=\"https:\/\/www.theblock.co\/post\/195341\/zero-knowledge-proof-cbdc-privacy\" data-v-f87c67ca=\"\">ZK proofs<\/a> and delegate computing tasks to an advanced network of hardware operators. This functionality creates new opportunities for scalable applications.","ZK proofs have gained significant traction in recent years, offering the scalability of blockchain apps through the efficient verification of data.","<a href=\"https:\/\/www.gevulot.com\/introducing-gevulot\/\" data-v-f87c67ca=\"\">Gevulot<\/a> is gearing up to launch its developer-focused network (or devnet), a type of restricted test network. This network is being brought to life in collaboration with staking validator firms such as P2P.org, Supranational, Staking Facilities and RockawayX Infrastructure.","On Gevulot, deployed programs will execute to generate proofs—which are subsequently verified by the network. Upon verification, these proofs are integrated into blocks. Notably, the blocks on Gevulot’s blockchain primarily consist of proofs, deviating from the conventional smart contract state transitions observed in other <a href=\"https:\/\/www.theblock.co\/learn\/245723\/what-are-smart-contracts-and-how-do-they-work\" data-v-f87c67ca=\"\">Layer 1 blockchains<\/a>.","\"Built as a layer-one general-purpose proof network, Gevulot enables anyone to deploy a prover or a verifier on-chain. It’s low-lift and simple: deploying these programs is largely akin to deploying or interacting with a smart contract,\" <a href=\"https:\/\/www.theblock.co\/post\/160041\/variant-raises-450-million-for-two-new-venture-funds\" data-v-f87c67ca=\"\">Variant<\/a>, the lead investor in the seed round, said in a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Staking Facilities","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Volt Capital","content":"ORGANIZATION"},{"type":"Supranational","content":"ORGANIZATION"},{"type":"Shumo Chu","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Manta Network","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"}],"hashtag":["PROTOCOLS","SEED &AMP; PRE-SEED"],"authors":["Vishal Chawla","The Block"]}