{"summary":"Bitcoin Traders Target Test of $53,000 Support as BTC Price Predictions Remains Bearish Following Fed Meeting","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-traders-target-test-of-53000-support-as-btc-price-predictions-remains-bearish-following-fed-meeting.htm","publishDate":"2024-05-01T22:16:49","id":18284,"type":null,"title":"Bitcoin Traders Target Test of $53,000 Support as BTC Price Predictions Remains Bearish Following Fed Meeting","category":["Bitcoin News "],"content":["The Bitcoin (BTC) price is consolidating in the mid-$57,000s, down roughly 5% on the day, though up around 1.5% or $1,000 from earlier session lows as traders weigh the outlook for Fed rate cuts this year in wake of the latest policy announcement from the US central bank.","As anticipated, the Fed left interest rates at multi-decade high levels of 5.25-5.5% and slowed its balance sheet run-off.","The central bank will now allow its portfolio of assets to shrink by only $25 billion per month. Before, the central bank had been allowing its balance sheet to shrink by $60 billion per month.","That reduction was a little larger than some investors appeared to anticipate and could explain the dovish market reaction to the initial policy announcement.","Bitcoin briefly pushed all the way to the mid-$59,000s, and US stocks pumped, though these moves quickly reversed.","Currently, Bitcoin is trading hands roughly in line with where it was before the Fed’s announcement.","As expected, Fed Chair Jerome Powell noted recent higher-than-expected inflation data readings so far this year.","POWELL: INFLATION DATA RECEIVED THIS YEAR HAVE BEEN HIGHER THAN EXPECTED","— *Walter Bloomberg (@DeItaone) May 1, 2024","","He commented that gaining confidence to cut interest rates will take longer than expected.","POWELL: GAINING CONFIDENCE TO CUT WILL TAKE LONGER THAN THOUGHT","— *Walter Bloomberg (@DeItaone) May 1, 2024","","According to CME data, the money market-implied odds that the Fed will have cut interest rates by 25 bps by September rose to 54% from 46% one day ago.","Meanwhile, the probability of no rate cuts this year dropped to 16% from 27% one day ago.","Ultimately, the market interpreted the Fed meeting as slightly more dovish than expected, explaining the Bitcoin price bounce from lows.","While Bitcoin may have recovered from earlier session lows, recent technical developments suggest more downside is coming.","Prior to Wednesday’s Fed meeting, Bitcoin had dropped nearly 5% from just below $61,000.","That drop came after it fell 5% from near $65,000 on Tuesday.","The decrease from earlier weekly highs comes as US economic data points to sticky inflation pressures and accelerated ETF outflows.","According to data presented by The Block, US Bitcoin ETFs have seen outflows for five days straight.","Importantly, Wednesday’s dip saw Bitcoin break to the south of its two-month $60,000-$74,000ish range.","The next major level of support for Bitcoin isn’t until the mid-February highs at $53,000.","Many analysts are now predicting that BTC will hit the low $50,000s.","Bitcoin will drop 13% to $50,000 after falling below a key support level as macro drivers slow, Standard Chartered says\nBitcoin has fallen past the ETF purchase price of around $58,000, putting over half of ETF positions underwater, Standard Chartered wrote.","— Ajay Bagga (@Ajay_Bagga) May 1, 2024","","A few analysts mentioned that the average entry price of US Bitcoin ETF buyers at $57,300 is important to watch.","“There might have been lots of ‘TradFi’ tourists in crypto pushing longs into the halving,” 10x CEO Markus Thielen wrote.  “This time is now over. We expect more unwinding as… Bitcoin trades below $57,300. This will likely lower prices to… a -25% to -29% correction from the $73,000 top. That explains our price target of $52,000\/$55,000 during the last three weeks.”",""],"entity":[{"type":"$59,000","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"54%","content":"PERCENT"},{"type":"$50,000","content":"MONEY"},{"type":"Walter Bloomberg","content":"PERSON"},{"type":"Ajay Bagga","content":"PERSON"},{"type":"Markus Thielen","content":"PERSON"},{"type":"-25%","content":"PERCENT"},{"type":"-29%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"’s Fed","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"27%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$65,000","content":"MONEY"},{"type":"$25 billion","content":"MONEY"},{"type":"$60,000","content":"MONEY"},{"type":"$57,300","content":"MONEY"},{"type":"$57,000","content":"MONEY"},{"type":"May 1, 2024","content":"DATE"},{"type":"$73,000","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"US Bitcoin","content":"LOCATION"},{"type":"5.5%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"$74,000","content":"MONEY"},{"type":"$1,000","content":"MONEY"},{"type":"$53,000","content":"MONEY"},{"type":"$58,000","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"$61,000","content":"MONEY"},{"type":"$52,000\/$55,000","content":"MONEY"},{"type":"46%","content":"PERCENT"},{"type":"US Bitcoin ETF","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"16%","content":"PERCENT"},{"type":"$60 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin Price","btc"],"authors":["Joel Frank"]}