{"summary":"Mark Cuban Says Crypto Is a Store of Value & Redditors Right to ‘Kick Wall St. Ass’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mark-cuban-says-crypto-is-a-store-of-value-redditors-right-t-9087.htm","publishDate":"2021-02-01T15:26:28","id":18289,"type":null,"title":"Mark Cuban Says Crypto Is a Store of Value & Redditors Right to ‘Kick Wall St. Ass’","category":["Bitcoin News "],"content":["Shark Tank star and Dallas Mavericks supremo Mark Cuban appears to be growing increasingly bullish on all things crypto-related, claiming that “blockchain-driven assets have now legitimately become stores of value.”","Adding to the mainstream narrative that while crypto appears to be unfit as a means of exchange, it appears to have carved a niche for itself as an inflation-proof store of value, Cuban waxed lyrical about tokens in a recent blog post.","He opined that when it comes to cryptoassets, they are “all are stores of value.”","“It has long included cryptocurrencies (cryptoassets is what they should be called, they are rarely used as currency), like Bitcoin, Ethereum and so many others, along with the tokens being created to support DeFi and other value-creating derivatives of cryptoassets. They all are Stores of Value with market cap leader Bitcoin having a decade-plus long history of transactions and wealth generation,” Cuban said, adding that “there are a growing number of investors and traders who think that the digital goods and cryptoasset marketplaces are better than old school physical markets and the stock market and most of them are young.”","“They love the fact that NO ONE has power over them,” according to the billionaire.","These statements come at the time when Cuban stepping up his own crypto-related activities. Last week, he minted his first Ethereum-based non-fungible tokens (NFTs) on the Rarible platform, and also spoke out about his “shitcoin” collection.","One of the tokens features a dancing Cuban, fully decked out in Mavericks merchandise, and has already attracted a bid of over USD 13,000 for eight editions.","And now, as the National Basketball Association (NBA) has entered the business of trading digital NBA collectibles on blockchain, the owner of a basketball club claims that a store of a value is “something that some number of people assign value to and are willing to pay for and then hold on to, hoping that circumstances increase the value of that item.”","However, another fellow billionaire, Mike Novogratz, might not agree with Cuban. According to Novogratz, very few cryptoassets will stand the test of time and become lasting stores of value outside of BTC.","In either case, according to Cuban, conventional traders appear to be nonplussed by the remarkable rise of crypto.","He wrote,","“This generation doesn’t care what Old School Wall Street thinks or says about valuations. They don’t care about Price Earnings Ratios, or NPV of future cash flows, or what the analysts say [about] the earnings per share this quarter. [They] don’t care at all. They have learned from their experiences watching Wall Street go up and down and making people who aren’t them a ton of money; that it’s a game designed to reward the people with the most money.”","The conclusion that “all these narratives are just sales pitches designed to sell stocks” has driven younger investors to “want to change the game and kick [Wall St.’s] ass,” something that “they should and have every right to,” Cuban wrote.","He also poured scorn on those who would seek to ridicule the Reddit-based movement that has seen members of a number of subreddits initiate price drive campaigns that have sent Wall Street into meltdown.","Cuban opined that “there is zero difference between” investors “following advice from Reddit or someone on CNBC or Bloomberg.”","He added,","“They also know that the more they work together, the less power Wall Street has. They know that fat and happy Wall Street has become slow, stale and set in their ways, which makes [it] an easier target than anyone would expect.”","___\nLearn more:\nGameStop: How Redditors Played Funds For Billions (And What Might Come Next)\nNon-Fungible 2021: Prepare Your NFTs For DeFi, Staking, and Sharing\nBridgewater’s Ray Dalio Sends Stronger Bitcoin Signal\nFew Tokens Besides Bitcoin To Become SoV, Ethereum To Reshape Finance – Novogratz\nElon Musk Sees ‘Broad Acceptance’ For Bitcoin"],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Dallas Mavericks","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"this quarter","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Sharing\nBridgewater’s Ray Dalio Sends Stronger Bitcoin Signal\nFew Tokens","content":"ORGANIZATION"},{"type":"Novogratz","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"the National Basketball Association (NBA","content":"ORGANIZATION"},{"type":"Ethereum To Reshape Finance – Novogratz\nElon Musk","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Ethereum","Investing","Non-fungible tokens"],"authors":["Tim Alper"]}