{"summary":"South Korean Police Capture Fraudsters Who Stole $4.1 Million in Crypto Investment Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-police-capture-fraudsters-who-stole-4-1-million-in-crypto-investment-scam.htm","publishDate":"2024-03-26T12:19:57","id":18288,"type":null,"title":"South Korean Police Capture Fraudsters Who Stole $4.1 Million in Crypto Investment Scam","category":["Blockchain News "],"content":["The Haeundae Police Station in Busan, South Korea, has caught a pair of fraudsters who stole $4.1 million from a senior citizen with the promise of profitable crypto investments.","“If you invest in virtual currency, you will see a 70% return in 4 weeks,” said the two individuals in their 20s and 30s who deceived a senior citizen and stole billions of South Korean won spread across multiple transactions.","A 60-year-old victim fell prey to a fraudulent cryptocurrency investment scheme between September and December 2022, as reported by a local source. The scammers lured the victim with promises of significant returns, offering a 70% profit on a monthly investment of 1 billion won. They assured the victim that investing 1 billion won would yield a repayment of 1.7 billion won within a month.","On the 25th, the Busan Haeundae Police Station announced the arrest of one of the fraudsters, a man in his 20s, on fraud charges. The second individual involved, in his 30s, was booked without detention for aiding and abetting fraud. The scheme involved these individuals approaching the victim during the specified period, capitalizing on the bullish market trend in virtual currency investments.","The accused fraudsters allegedly defrauded the victim of 5.5 billion won on six occasions. Despite their minimal holdings, they used forged balance certificate files to falsely present themselves as possessing 20 billion won worth of virtual currency.","Additionally, they fabricated a contract claiming that a 30-year-old accomplice, described as a wealthy real estate agent in Gangnam, had committed to investing 4 billion won. These deceptive tactics resulted in substantial financial losses for the 60-year-old victim.","Investigations into the scam revealed its intricate nature. The perpetrators employed fraudulent documents and enticing promises to lure victims into investing large sums of money in cryptocurrency schemes that ultimately failed to deliver the promised returns. Notably, details regarding the recovery of funds defrauded from the victim have not been disclosed to the public.","Do Kwon, the co-founder of Terraform Labs and a prominent figure in South Korea’s cryptocurrency scene, was reportedly released from prison in Montenegro on March 23 amid extradition requests from both the United States and South Korea. Kwon gained notoriety for his involvement in the failed crypto project TerraUSD stablecoin, launched in 2022.","TerraUSD was initially designed as a stablecoin pegged algorithmically 1:1 to the U.S. dollar, intended to serve as a utility token on the blockchain. However, the stablecoin experienced a loss of its pegging, leading to its collapse along with LUNA, the Terra sister token.","Following the collapse of TerraUSD and LUNA, United States and South Korean authorities pursued legal action against Kwon, who attempted to evade South Korean prosecutors by fleeing to Singapore. He was subsequently apprehended in Montenegro and sentenced to four months in prison after being caught using a forged Costa Rican passport in an attempt to escape.","Despite denying the charges against him, Kwon faces allegations of fraud and tax evasion related to the $40 billion implosion of the Terra ecosystem. South Korean authorities are intensifying their efforts to ensure Kwon faces prosecution for these alleged offenses.","The SEC's trial against Terraform Labs founder Do Kwon is set to begin in Manhattan federal court Monday, though the former crypto tycoon will not be present.https:\/\/t.co\/d0FHDHlPNm","— Cryptonews.com (@cryptonews) March 25, 2024","","The United States Securities and Exchange Commission (SEC) is also involved in the case. A trial against Do Kwon is scheduled to begin in Manhattan federal court. However, Kwon will not be present at the trial as he remains under close watch, with officials taking measures to prevent him from leaving the country."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"South Korean","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"March 23","content":"DATE"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Busan","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"Terra ecosystem","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"March 25, 2024","content":"DATE"},{"type":"$4.1 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Busan Haeundae Police Station","content":"ORGANIZATION"},{"type":"Haeundae Police Station","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Gangnam","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Crypto fraud","Investment Scam","South Korea"],"authors":["Hassan Shittu"]}