{"summary":"Turbo Trump Meme Coin Soars 22,589%, Eco-Friendly Bitcoin ICO Hits $3M Milestone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/turbo-trump-meme-coin-soars-22589-eco-friendly-bitcoin-ico-hits-3m-milestone.htm","publishDate":"2024-03-11T14:26:21","id":18292,"type":null,"title":"Turbo Trump Meme Coin Soars 22,589%, Eco-Friendly Bitcoin ICO Hits $3M Milestone","category":["Industry Talk "],"content":["The new Turbo Trump meme coin has rocketed by over 20,000% in the past 24 hours, with the Base blockchain-based token listing on SushiSwap yesterday.","Meant to tie in with the upcoming presidential election and piggyback on Donald Trump’s popularity\/notoriety, Turbo Trump (PRESI) is the latest in a long line of meme coins to have appeared in recent months.","However, it’s not clear how much longevity the token will have, with its existence as a “fan version of the original Turbo Trump” coin suggesting that it doesn’t have an experience and professional team behind it.","Nonetheless, there are fundamentally stronger alternatives in the market right now, with the new Green Bitcoin (GBTC) cryptocurrency raising over $3 million in its increasingly popular presale","PRESI has already gone through a few ups and downs despite listing only a day ago.","It experienced a little surge upon listing, as do most new meme coins, and while it has declined on numerous occasions since then, it has largely held onto its initial gains.","However, it’s very hard to say what will happen from here on out, with the coin’s volume drying up in recent hours.","In fact, DEXTools data shows that the coin has only 101 holders, with a 24-hour liquidity of only $60,000.","This makes it an extremely tiny meme token, and suggests that it could dump suddenly in the not-too distant future.","Its online footprint also doesn’t inspire much in the way of confidence, with its X account revealing it’s a “fan version” of an earlier Turbo Trump coin.","It currently has 125 followers on X, also indicating its very small stature.","In light of all this, the Turbo Trump meme coin is likely to suffer a steady and terminal decline at some point in the near future, even with the ongoing bull market.","Traders would most likely be better off avoiding it, unless they want to run the risk of losing money.","While PRESI may be a very risky token, there are other new alts in the market that offer actual fundamentals and promise more longevity.","One of the best and most recent examples of this comes from Green Bitcoin (GBTC), an Ethereum-based version of BTC that recently launched its presale.","$3 MILLION RAISED!","A massive milestone for the Green Bitcoin community. Green Bitcoin is still in presale–Get yours now! pic.twitter.com\/46Jj7r0PDU","— GreenBitcoin (@GreenBTCtoken) March 10, 2024","","Aside from styling itself as a greener version of BTC, what’s interesting about GBTC is that it offers a novel and bullish predict-to-earn platform.","As a predict-to-earn platform, users of Green Bitcoin can predict future BTC prices in order to earn greater staking rewards.","Users can make such predictions on a daily basis, a mechanism that fosters a higher level of engagement in Green Bitcoin and its ecosystem.","At the other end of the spectrum, users are also encouraged to stake for longer periods, with those who lock up tokens for weekly, monthly or semi-yearly periods earning bonus rewards.","Again, this will encourage long-term holding and greater participation, with GBTC having a max supply of 21 million tokens, just like Bitcoin itself.","Introducing Green Bitcoin: A Revolutionary Predict-To-Earn Token.","Join us on our Gamified Green Staking Platform, where your predictions can turn into profits!","Website: https:\/\/t.co\/dG5cEeCtRs\nTelegram: https:\/\/t.co\/bWanoe0vHv pic.twitter.com\/eXuGQBkxio","— GreenBitcoin (@GreenBTCtoken) December 3, 2023","","50% of this supply is going to the presale, with 20% going to staking rewards, 12.5% to marketing, 10% to community rewards, and 7.5% to exchange liquidity.","This makes GBTC a highly distributed token, and combined with its novel predict-to-earn staking system, it could experience a strong surge in demand once it lists.","Investors can buy it now by participating in its presale, which has already raised just over $3.1 million.","They can join by going to the official Green Bitcoin website, where 1 GBTC token costs $0.8022.","This price will rise in just under five days, although it could rise much higher once the sale ends.","Visit Green Bitcoin Now",""],"entity":[{"type":"7.5%","content":"PERCENT"},{"type":"$60,000","content":"MONEY"},{"type":"Green Bitcoin","content":"LOCATION"},{"type":"Earn Token","content":"LOCATION"},{"type":"December 3, 2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$3.1 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$3 million","content":"MONEY"},{"type":"Green Bitcoin","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"12.5%","content":"PERCENT"},{"type":"Green Bitcoin (GBTC","content":"ORGANIZATION"},{"type":"20,000%","content":"PERCENT"},{"type":"Donald Trump","content":"PERSON"},{"type":"Green Bitcoin website","content":"ORGANIZATION"},{"type":"$0.8022","content":"MONEY"},{"type":"Turbo Trump meme","content":"ORGANIZATION"},{"type":"$3 MILLION","content":"MONEY"},{"type":"March 10, 2024","content":"DATE"},{"type":"Turbo Trump coin","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Meme Coins","Price Prediction","Trump"],"authors":["Simon Chandler"]}