{"summary":"Crypto Wallet Provider SafePal Invests in Swiss Bank to Enable Banking Services for Crypto Users","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-wallet-provider-safepal-invests-in-swiss-bank-to-enable-banking-services-for-crypto-users.htm","publishDate":"2024-03-07T22:31:29","id":18291,"type":null,"title":"Crypto Wallet Provider SafePal Invests in Swiss Bank to Enable Banking Services for Crypto Users","category":["Blockchain News "],"content":["SafePal, a crypto hardware wallet provider, has made a strategic investment in Swiss bank Fiat24, aiming to provide users with a banking gateway to pay for expenses using digital assets and transfer funds to compliant banks.","The new offering aims to accelerate the bridging of crypto to real-world utilities. Users can create individually owned, fully compliant bank accounts and use USDC stablecoin as the default deposit currency.","","Unlock crypto-friendly living via @arbitrum with the #SafePal banking gateway & #Visa card powered by @Fiat24Account!🔥","Enjoy banking with affordable gas fees & fast network speeds!","💳Get started: https:\/\/t.co\/1ETXNKHqb0\n🏦Learn more: https:\/\/t.co\/3tWkFLQJfz pic.twitter.com\/ymbDBEUS5w","— SafePal – Crypto Wallet (@iSafePal) March 7, 2024","","According to the announcement revealed on March 7, SafePal and Fiat24 have collaborated to introduce a crypto-focused Visa card and in-app banking services. The default deposit currency for these services is the dollar-pegged stablecoin USD Coin (USDC), which users can acquire by swapping their coin holdings via Arbitrum. The stored USDC can then be converted into USD, EUR, and CHF for transactions and expenses.","Users can establish individually owned, fully compliant bank accounts within the SafePal mobile wallet app after completing the KYC and onboarding process conducted by Fiat24 without incurring any account creation or management fees.","Additionally, users can swap crypto across more than 40 blockchains into their bank accounts and use fiat currencies like the U.S. dollar, euro, or Swiss Franc for transactions and expenses. The feature will be available on SafePal mobile wallet version 4.5.0, pending approval from Apple’s App Store and Google Play.","Veronica Wong, CEO and co-founder of SafePal, emphasized the importance of addressing the accessibility issues faced by crypto users to enhance onboarding and adoption. Wong stated that this initiative would offer the first genuinely crypto-friendly banking experience for retail users, eliminating the excessive scrutiny and restrictions imposed by traditional banks.","Wong said,","“This will be the first truly crypto-friendly banking experience for retail users that eliminates the excessive scrutiny and restriction of traditional banks, as the accounts created via the mobile wallet will support transfers to accounts in other banks under their name in a seamless and compliant manner.”","Upon creation, the bank account credentials in the SafePal mobile wallet are minted as NFTs on Arbitrum, an Ethereum Layer 2 rollup, ensuring transparent and secure recording of all related transactions on-chain.","Additionally, the crypto Visa cards issued through this partnership are compatible with third-party payment platforms such as Paypal, Google Pay, Apple Pay, and Samsung Pay, enhancing users’ convenience. The Visa card will initially be available in selected European regions before expanding to the rest of the continent. At the same time, the in-app banking gateway will be accessible outside the United States and to all non-U.S.-sanctioned countries.","CoinGecko data shows that SafePal’s SFP tokens are up 1.3% in the past 24 hours. SafePal currently serves as a self-custody wallet and claims to have approximately 10 million users worldwide.","Following the crypto winter of 2021-2022, SafePal’s CEO, Veronica Wong, highlighted the importance of decentralized solutions, stating that “the malpractice of centralized platforms has indeed catalyzed the adoption of self-custody solutions. This should not just be a temporary surge of interest but a key impetus to strengthen the adoption of self-management for assets.”","The rise in popularity of self-custody wallets has been evident since the collapse of centralized finance entities such as FTX and Celsius. Major players like Jack Dorsey’s Block and cross-chain wallet BitKeep have made significant strides in this space, reflecting the growing demand for decentralized asset management solutions."],"entity":[{"type":"winter of 2021","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"SafePal – Crypto Wallet","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"EUR","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"1.3%","content":"PERCENT"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"March 7, 2024","content":"DATE"},{"type":"crypto Visa","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Wong","content":"PERSON"},{"type":"March 7","content":"DATE"},{"type":"Veronica Wong","content":"PERSON"},{"type":"euro","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Fiat24","Investment","SafePal"],"authors":["Hassan Shittu"]}