{"summary":"Hong Kong Set To Release Consultation on Regulatory Framework for OTC Crypto Platforms","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-set-to-release-consultation-on-regulatory-framework-for-otc-crypto-platforms.htm","publishDate":"2024-02-02T18:35:49","id":18293,"type":null,"title":"Hong Kong Set To Release Consultation on Regulatory Framework for OTC Crypto Platforms","category":["Blockchain News "],"content":["Hong Kong will publish a consultation on a proposed regulatory framework for over-the-counter crypto trading platforms “very soon,” according to a February 2 blog post.","Secretary for Financial Services and the Treasury Christopher Hui warned the public of the risks of over-the-counter venues, given their accessibility and involvement in fraud cases.","As the transitional period for the #VirtualAsset Service Providers licensing system enters its final stage, we are gradually enhancing measures on virtual asset regulation to facilitate market development #ChristopherHui https:\/\/t.co\/SZCYooCwWK","— Hong Kong SAR Government News (@newsgovhk) February 2, 2024","","“OTC venues have played a certain role in some of the fraud cases involving some unlicensed VA trading platforms last year, having misled investors to channel funds to these unlicensed platforms,” Hui wrote. “Therefore, we believe that it is necessary to bring OTC venues under regulation, and we will launch a consultation very soon on the proposed regulatory framework.”","In June 2023, Hong Kong formally launched its crypto licensing framework for virtual asset trading platforms, permitting licensed exchanges to provide retail trading services. Two platforms, HashKey and OSL, have received licenses under this regime so far.","The government provided a transition period for virtual asset service providers already operating in Hong Kong before the licensing system took effect, mandating them to submit license applications by February 29.","The Securities and Futures Commission (SFC) will assess whether applicants fulfill the regulatory requirements and had substantial operations in Hong Kong before the initiation of the licensing system.","This evaluation will determine whether existing service providers can be considered as licensed from June 1 this year until a final decision is reached on their license applications.","Hui cautioned that as the deadline nears, the SFC is gearing up for enforcement activities and will intensify publicity initiatives.\n","In December 2023, the Hong Kong Monetary Authority (HKMA), in collaboration with the Financial Services and the Treasury Bureau, stated in a joint consultation paper that a stablecoin issuer would need to acquire a license from the authorities “if it issues a stablecoin that references the value of one or more fiat currencies in Hong Kong.”","The two-month consultation period is scheduled to conclude at the end of this month.","Hui added that the HKMA intends to establish a sandbox for the exploration of stablecoin issuance, which will include collaboration with key industry players in the region."],"entity":[{"type":"#VirtualAsset Service Providers","content":"ORGANIZATION"},{"type":"Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"end of this month","content":"DATE"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"February 29","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Hong Kong SAR Government News","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"February 2","content":"DATE"},{"type":"February 2, 2024","content":"DATE"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"June 1 this year","content":"DATE"},{"type":"Christopher Hui","content":"PERSON"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Crypto fraud","HKMA","Hong Kong crypto"],"authors":["Brian Yue"]}