{"summary":"Tether and Bitfinex Settle Dispute, Will Share Information Under FOIL Request – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-and-bitfinex-settle-dispute-will-share-information-under-foil-request-heres-what-you-need-to-know.htm","publishDate":"2023-11-25T16:00:51","id":18301,"type":null,"title":"Tether and Bitfinex Settle Dispute, Will Share Information Under FOIL Request – Here’s What You Need to Know","category":["Altcoin News "],"content":["Tether and Bitfinex have agreed to settle their dispute regarding a Freedom of Information Law (FOIL) request filed by a group of journalists, including Zeke Faux from Bloomberg Businessweek. ","In a recent announcement, Tether hailed the move as a step towards greater transparency in the industry.","While Tether and Bitfinex have emphasized their commitment to transparency, they clarified that this does not mean a complete release of all their documents. ","The companies stated that a wholesale release of all their documents would not align with standard business practices. ","Nonetheless, their decision to drop opposition to the FOIL request shows a willingness to share information within certain boundaries.","This is not the first time Tether has faced a FOIL request. ","In June 2021, CoinDesk filed a similar request pertaining to documents related to Tether’s reserves during the New York Attorney General’s inquiry. ","Tether attempted to block the release of these documents but lost in court. CoinDesk joined the case to advocate for the documents’ release, arguing that it was in the public interest. ","Tether opposed CoinDesk’s involvement, but a New York judge dismissed their opposition.","In their recent statement, Tether and Bitfinex expressed their willingness to engage constructively with journalists and regulatory authorities who adhere to ethical reporting standards and respect data privacy boundaries. ","“We remain open to constructive engagement with journalists and regulatory authorities who adhere to ethical reporting standards and respect data privacy boundaries.”","Tether’s USDT is currently the largest stablecoin in the world, with a value of approximately $88.5 billion. ","It plays a crucial role in the cryptocurrency ecosystem by facilitating the movement of funds globally. ","However, concerns have been raised about the use of USDT in illicit activities. ","Zeke Faux, in his book “Number Goes Up,” highlighted instances of USDT being involved in scams, including “pig butchering” scams. ","It is worth noting that Tether and the U.S. Department of Justice recently announced the freezing of funds associated with such scams.","Furthermore, there has been some controvery surrounding the backing of Tether’s USDT stablecoin.","USDT is a type of stablecoin that is pegged to the value of the U.S. dollar, with the intention of providing stability and reliability in the volatile world of cryptocurrencies. ","However, questions have arisen regarding the extent to which USDT is actually backed by reserves.","Tether has claimed that each USDT token is backed on a one-to-one basis by U.S. dollars held in reserve. ","However, the lack of a transparent audit or regulatory oversight has fueled skepticism and led to accusations that Tether does not have sufficient reserves to fully back all the USDT in circulation."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"June 2021","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"$88.5 billion","content":"MONEY"},{"type":"Bloomberg Businessweek","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"}],"hashtag":["Bitfinex","Tether"],"authors":["Ruholamin Haqshanas"]}