{"summary":"Bitcoin Development Platform Tap Protocol Secures $4.2 Million in Funding","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-development-platform-tap-protocol-secures-4-2-million-in-funding.htm","publishDate":"2023-12-18T11:20:15","id":18312,"type":null,"title":"Bitcoin Development Platform Tap Protocol Secures $4.2 Million in Funding","category":["Bitcoin News "],"content":["Bitcoin Ordinals-based development platform Tap Protocol has raised over $4 million in an oversubscribed round, promising more “big” news to come.","“We are happy to announce our successful fund raise of $4.2m which was oversubscribed by $13m+,” Tap Protocol said on Twitter.","The round was led by Sora Ventures, with participation from Rw3, Cypher Capital, Kosmos Ventures, Oak Grove Capital, Petrock Capital, New Tribe Capital, Cogitent Ventures, Compute Ventures, MSA Novo, and Skry Labs.","It also included angel investments from executives at Animoca Brands and Quantstamp.","Oak Grove commented that “Tap Protocol’s innovative approach, combined with Trac Systems’ impressive growth, aligns with our vision for driving forward the evolution of the blockchain ecosystem.”","We are happy to announce our successful fund raise of $4.2m which was oversubscribed by $13m+.","Big thanks to our incubator @Skrylabs throughout as well as lead investor @sora_ventures for their support.","With this, we open a new chapter on further development and look forward… pic.twitter.com\/2oiGtbEKkK","— Tap Protocol (@tap_protocol) December 16, 2023","","According to the protocol, “with this, we open a new chapter on further development and look forward everything new to be added to TAP and TRAC.”","However, it also noted that more “big announcements” would arrive in the coming days and weeks.","German-based company Trac Systems is the parent company of Tap Protocol. It stated it would utilize the raised money to develop Bitcoin capabilities as a developer platform leveraging the Ordinals system.","The plans reach into decentralized finance (DeFi), tokenization, and gamification.","Benny the Dev, CEO of Trac Systems, was quoted as saying that,","“Now that the fundraise has successfully closed, Trac Systems is well-positioned to develop on top of Bitcoin and utilize it as a platform for tokenization, gamification, and DeFi.”","The company also aims to expand its operations and hire skilled developers to advance the protocol.","Trac Systems noted that Ordinals through Tap Protocol have enabled a number of applications already. These include fractionalizing art on the Ordinals platform and integrating token functions for gaming applications.","In late November, Tap Protocol stated that,","“Everything is moving smoothly behind the scenes. TAP adoption and interest is sky rocketing already.”","A recent announcement described Tap Protocol as “the ultimate in flexible metaprotocols for Ordinals.”","That particular announcement revealed Trac Systems’s new website.","🚀 Exciting news from Trac Systems! Today sees the launch of our brand new website (https:\/\/t.co\/wyBCc2v9it), as we continue to push the boundaries of blockchain technology.","🔍 Trac Core, the first-ever decentralized indexing tool and oracle for Bitcoin.","💡 Tap Protocol – the…","— Trac (@trac_btc) December 16, 2023",""," ","The company further stated that its enterprise support packages will be available in early 2024.","Per the website, Trac aims to enable decentralized tracking of Ordinals metaprotocols. It notes that the existing trackers are heavily centralized – against the decentralized nature of crypto, including Bitcoin.","It claims that,","“Trac solves this problem by providing a decentralized network that allows anyone to connect, utilize, and earn from it.”","Its products include Trac Core, Tap Protocol, and Pipe.","TAP is an OrdFi-enabling protocol designed to find and track Ordinals.","It allows for the secure and accessible development on the Bitcoin blockchain, its parent company said.","Furthermore, the protocol has more than 50,000 users onboarded, said the website."],"entity":[{"type":"$4.2","content":"MONEY"},{"type":"Trac Systems","content":"ORGANIZATION"},{"type":"December 16, 2023","content":"DATE"},{"type":"MSA Novo","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Kosmos Ventures","content":"ORGANIZATION"},{"type":"Cogitent Ventures","content":"ORGANIZATION"},{"type":"New Tribe Capital","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Oak Grove Capital","content":"ORGANIZATION"},{"type":"Sora Ventures","content":"ORGANIZATION"},{"type":"Skry Labs","content":"ORGANIZATION"},{"type":"$13m","content":"MONEY"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"Compute Ventures","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","DeFi","Investment","Tokenization"],"authors":["Sead Fadilpašić"]}