{"summary":"Fake OMNI Token Rug Pulls $400k as Real Token Price Crashes Over 55%","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fake-omni-token-rug-pulls-400k-as-real-token-price-crashes-over-55.htm","publishDate":"2024-04-18T11:27:58","id":18325,"type":null,"title":"Fake OMNI Token Rug Pulls $400k as Real Token Price Crashes Over 55%","category":["Blockchain News "],"content":["The launch of Omni Network’s OMNI token on April 17 marked a significant milestone for the Layer-1 testnet blockchain, which aims to enhance Ethereum rollup interoperability. ","The airdrop of 3 million OMNI tokens, constituting 3% of the total token supply, attracted considerable attention from early test network users, developers, and community participants.","However, the fraudulent activity of a fake OMNI token overshadowed the event.","Despite the initial excitement surrounding the real OMNI token’s launch, its value experienced a drastic decline of over 55% within hours of the airdrop. This sharp downturn, from $53.80 to below $24, raised concerns among investors and stakeholders about the token’s stability.","Omni Network was founded by Harvard graduates and built by a team of industry veterans from places like the Ethereum Foundation. Omni is an Ethereum-native interoperability protocol that establishes low-latency communications between all Ethereum rollups. ","With a total token supply of 100 million OMNI tokens, the project aims to balance community engagement, ecosystem development, and investor incentives.","Following the token launch at 14:00 on April 17, the network distributed 3 million OMNI tokens, equivalent to 3% of the total token supply of 100 million, to eligible users during the airdrop event. At the onset, OMNI boasted a market value of $560 million.","However, within just half an hour of its release, OMNI witnessed a sharp decline in its price, dropping by about 30% from $53.80 to below $39. This initial price drop triggered significant market volatility, leading to a continued downward trajectory for OMNI’s value. The token’s price plummeted further, falling below $24, representing a staggering drop of over 55% from its initial valuation.","Furthermore, the rug pull scam involving a fraudulent OMNI token with the same name likely contributed to the market’s instability and investor uncertainty—the sudden emergence of the fake token, coupled with its subsequent price dump of 100%.","Peck Shield identified a fraudulent move involving a fake OMNI token, resulting in a $398,000 rug pull scam. The perpetrators exploited the token’s launch to perpetrate the scam, capitalising on investor enthusiasm and market speculation.","#PeckShieldAlert Fake Omni Network $OMNI on #Ethereum has dropped -100%.\nThe deployer 0x2100A5…7bA3 has dumped 1,769,800,761,000,000 $OMNI for ~132.08 $WETH (worth ~$398K).\n*Note*: The #rugpull token shares the same name as the legitimate one pic.twitter.com\/uHPMH6Sn6b","— PeckShieldAlert (@PeckShieldAlert) April 18, 2024","","The fraudulent token, bearing the same name as the legitimate OMNI token, deceived unsuspecting investors and sowed confusion within the cryptocurrency community.","Recent incidents of rug pull in the cryptocurrency market have shown the persistent threat of fraudulent activities and their potential ramifications on investor trust and regulatory oversight.","In one case, a notorious MEV-bot engineer, Robert Robb, known as “pokerbrat” online, was arrested by U.S. law enforcement on March 20 in connection with a $1.2 million rug pull scam. Robb’s arrest shed light on his alleged involvement in illicit crypto activities, including misappropriating investor funds to build automated trading bots. ","Similarly, the rug pull involving the Lena Network’s Candy, following the token’s launch, its value plummeted dramatically after the liquidity protocol seemingly rug-pulled the project, raising concerns about the lack of accountability and transparency in token offerings."],"entity":[{"type":"$WETH","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"-100%","content":"PERCENT"},{"type":"Robert Robb","content":"PERSON"},{"type":"$39","content":"MONEY"},{"type":"$398K","content":"MONEY"},{"type":"$398,000","content":"MONEY"},{"type":"$1.2 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$53.80","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"March 20","content":"DATE"},{"type":"1","content":"DATE"},{"type":"$OMNI","content":"MONEY"},{"type":"Harvard","content":"ORGANIZATION"},{"type":"Lena Network’s Candy","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"$24","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"$560 million","content":"MONEY"},{"type":"April 18, 2024","content":"DATE"},{"type":"April 17","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Omni Network","content":"ORGANIZATION"}],"hashtag":["Ethereum","OMNI Token","rug pull"],"authors":["Hassan Shittu"]}