{"summary":"On Monday, three major US government entities issued a joint alert on cyber threats faced by companies working in the blockchain sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142478\/us-government-warns-that-north-korea-is-targeting-crypto-firms","publishDate":"2022-04-19T08:05:58","id":1832,"type":null,"title":"US government warns that North Korea is targeting crypto firms","category":["SECURITY"],"content":["The US government has publicly cautioned crypto firms to be wary of North Korean hackers.","<span data-v-f87c67ca=\"\">On Monday, three major US government entities<\/span> <span data-v-f87c67ca=\"\">issued a joint alert on cyber threats faced by companies working in the blockchain and cryptocurrency sector. These entities were the Federal Bureau of Investigation, the Cybersecurity and Infrastructure Security Agency (CISA), and the US Treasury Department.<\/span>","<span data-v-f87c67ca=\"\">The public announcement, referred to as a ‘cybersecurity advisory’ was <\/span><a href=\"https:\/\/www.cisa.gov\/uscert\/ncas\/alerts\/aa22-108a\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">posted<\/span><\/a><span data-v-f87c67ca=\"\"> on CISA’s official website. CISA is a federal agency under the US Department of Homeland Security tasked to improve the country's cybersecurity, and routinely puts out alerts regarding threats.<\/span>","<span data-v-f87c67ca=\"\">The alert said the US government has observed that hacking groups,<\/span> <span data-v-f87c67ca=\"\">believed to be sponsored by the North Korean regime,<\/span><span data-v-f87c67ca=\"\"> are targeting crypto companies. The groups mentioned in the report — Lazarus Group, APT38, BlueNoroff, and Stardust Chollima — present what’s dubbed as an advanced persistent threat (APT). This means a cybersecurity threat actor that can gain unauthorized access to computer systems and remain undetected for long periods.<\/span>","<span data-v-f87c67ca=\"\">Per the announcement, crypto exchanges, decentralized finance protocols, play-to-earn games, venture capital firms and trading firms are being targeted by hackers to steal and launder crypto assets that will support the North Korean regime. Furthermore, the alert added that large individual investors are also at risk of being attacked.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Moreover, it explained that hacking groups have been actively trying to steal crypto assets from various crypto companies using a variety of techniques. These include phishing campaigns and social engineering, with the goal of deploying malicious applications, containing Trojan malware. These malicious applications have been dubbed \"TraderTraitor\" and infect computer systems to try and steal assets stored in crypto wallets, the alert said. The applications are typically executed through phishing emails sent to employees working in crypto firms by luring them via high-paying job offers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The latest announcement stressed that crypto firms need to be careful against cyber threats and use strategies to mitigate them. It listed mitigation procedures like patching software, employing multi-factor authentication (MFA) and educating employees on phishing attacks.<\/span>","<span data-v-f87c67ca=\"\">The groups mentioned in the alert have already stolen large sums of funds from cryptocurrency-related projects. Last week, the US government <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">named<\/span><\/a><span data-v-f87c67ca=\"\"> Lazarus as the main perpetrator behind the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$600 million hack<\/span><\/a><span data-v-f87c67ca=\"\"> on Ronin — the blockchain used for the play-to-earn game called Axie Infinity. But the group has been stealing from crypto players for some years now. In a January 2022 <\/span><a href=\"https:\/\/blog.chainalysis.com\/reports\/north-korean-hackers-have-prolific-year-as-their-total-unlaundered-cryptocurrency-holdings-reach-all-time-high\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\">, blockchain analytics firm Chainalysis noted that Lazarus Group was involved in a hack against Kucoin crypto exchange in 2020 and another undisclosed exchange in 2018. The two attacks net Lazarus more than $500 million in total from the two events.<\/span>","The alert matches observations from prominent crypto individuals. DeFiance Capital Arthur Cheong posted a <a href=\"https:\/\/twitter.com\/Arthur_0x\/status\/1514890456596840449\" data-v-f87c67ca=\"\">tweet thread<\/a> on April 15 about this issue. He said, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Based on our research and conversation with leading cyber security experts, we believe BlueNorOff are running an organized campaign to target all the prominent organizations in the crypto space.<\/span>\"","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">It is critical that this industry is highly aware that we are being actively targeted by a state-sponsored cyber crime organization that is extremely resourceful and sophisticated,\" he added.<\/span>","Cheong recently fell foul to a phishing attack, losing $1.7 million in NFTs and crypto from his own wallet. In addition, the firm lost a further $720,000 from a separate wallet due to the same attack and <a href=\"https:\/\/www.theblockcrypto.com\/post\/139162\/defiance-capital-rescues-13-3-million-at-risk-of-being-stolen\" data-v-f87c67ca=\"\">narrowly avoided<\/a> losing $13.3 million more.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"North Korean","content":"LOCATION"},{"type":"Lazarus","content":"PERSON"},{"type":"MFA","content":"ORGANIZATION"},{"type":"US Department of Homeland Security","content":"ORGANIZATION"},{"type":"January 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Kucoin crypto","content":"ORGANIZATION"},{"type":"$13.3 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"$1.7 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Federal Bureau of Investigation","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"April 15","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"US Treasury Department","content":"ORGANIZATION"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"$720,000","content":"MONEY"},{"type":"2020","content":"DATE"}],"hashtag":["CRYPTO"],"authors":["Vishal Chawla","The Block"]}