{"summary":"YouTuber KSI Accused of Pump-and-Dumps + More NFT News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/youtuber-ksi-accused-of-pump-and-dumps-more-nft-news.htm","publishDate":"2024-02-15T14:13:09","id":18332,"type":null,"title":"YouTuber KSI Accused of Pump-and-Dumps + More NFT News","category":["NFT News "],"content":["Top NFT news today, February 15, 2024: ZachXBT and Coffeezilla accuse KSI of pump-and-dumps, Pandora’s sales volume over the month is nearly double that of Ordinals, and Pudgy Penguins floor price flies high.","The non-fungible token (NFT) market sales volume is just slightly down today compared to yesterday. It dropped less than 1% to $34,816,770, according to CryptoSlam.","NFT buyers are up 2% over the past day. Sellers are down 8% and transactions 11%.","Only two of the top ten collections per sales volume have decreased over the past 24 hours. The popular, ERC404-based Pandora fell 30% to 4.2 million, while DMarket dropped 5% to $757,178.","Meanwhile, Art Blocks has had another good day. The collection is the day’s bigger gainer: its sales volume is up 588% to $774,173.","Moonbirds, with a rise of 304% to $690,352, is the second-best performer. The increase led it into the top ten collections, now sitting in 10th place.","Popular crypto investigators ZachXBT and Coffeezilla have accused YouTuber Olajide Olayinka Williams Olatunji, aka KSI, of conducting several pump-and-dump schemes.","KSI reopened his crypto-related Twitter account on Tuesday. He posted his first tweet on this account since November 2022.","And this wasn’t exactly welcomed news, based on the comments.","And one investigator was waiting. ZachXBT commented that KSI will share “garbage again.”","","","ZachXBT went on to share projects the YouTuber had posted on his account, including XCAD Network (XCAD) and the NFT-focused Ethernity Chain (ERN).","After ‘praising’ a project, he’d sell the coins within hours or days. For example, hours after tweeting that he was bullish on EARN, he sold $349,571 of it.","KSI posts on 3-20-21 at 12:08 PM UTC saying","“2 NFT coins I'm VERY bullish on SUPER ERN”","Just hours after that post KSI proceeds to sell ~$349K worth of ERN","0xdd7a79dadf3ac202c2caa13e7cdd7e48153189b0f7be332c1a3c8686a9f10803… pic.twitter.com\/odGfiqROc9","— ZachXBT (@zachxbt) February 14, 2024",""," ","When contacted by Coffeezilla, KSI replied that he is still “HODL gang” for those coins – meaning, somebody who does not sell. But as to why he did sell XCAD, for example, KSI said that he wanted to make more money elsewhere to buy more XCAD, but failed.","KSI went on to say that he “didn’t have any malicious intent in trying to scam etc” and that he wished “he was an evil genius that would pump and dump at the right time etc,” suggesting that he wasn’t clever but bad at investing.","Called out for inconsistencies, KSI claimed that he thought he was being “trolled.” Every time he’d tweet something, the opposite would happen. Hence, he said, he decided to “tweet the opposite” of what he “was actually doing.”","","In other NFT news, the famous ERC-404 token Pandora launched on February 2. In less than two weeks since its launch, it has hit $86,778,798, according to CryptoSlam.","This is a notable rise. For context, Uncategorized Ordinals are in second place per sales volume in the past 30 days with $44,045,731.","This means that Pandora has nearly doubled that number in less than double that time.","Other metrics are a different story, though. Uncategorized Ordinals have significantly more transactions, buyers, and sellers, despite the drop in numbers.","Meanwhile, as reported, the popular ERC-404 token recorded $190 million in trading volume just a week after its launch.","Notably, 50% of these NFTs were retained in the wallets since the initial purchase without selling. Blockchain analytics firm Nansen.ai described this as a “quite impressive” rate for a new project.","But zooming out to the all-time best performers, Pandora still has ways to go.","The top ten group is populated with some of the world-famous collections, including Axie Infinity and Yuga Labs’ collections.","Pandora is currently in the 80th place.","Pudgy Penguins is an 8,888-piece strong, Ethereum-based NFT collection first launched in July 2021. It has been rising in popularity since.","Its total volume is 293,837 ETH, according to the OpenSea marketplace.","Meanwhile, the current floor price is 20.899 ETH. The floor price has been increasing for a while now. Over the past 90 days, it has gone up 257.3%.","In mid-November, the price stood at 5.85 ETH. Following a relatively steady period within the 10-11 ETH range, it jumped from 11 ETH to nearly 20 ETH within a week in mid-January.","Subsequently, the floor price reached 22 ETH on February 11 and again on February 12.","Though the price has dropped 5% since, it has nonetheless reached notable heights.","Pudgy Penguins, floor price, 90 days:","As for related collections, Lil Pudgys’ floor price is 2.02 ETH. This collection, too, has seen a significant increase over the past 90 days. The floor price is up 349% from 0.45 ETH recorded on November 17.","It, too, jumped in mid-January, from 0.875 ETH to 1.9655 ETH, then to 2.39 ETH on February 11.","Its total volume is 52,872 ETH.","Lil Pudgys, floor price, 90 days:","Meanwhile, Pudgy Rod’s floor price is 0.6169 ETH. Over the past three months, it has gone up 95% from 0.316 ETH. Its highest point was 1 ETH on January 27.","The collection’s total volume is 15,338 ETH."],"entity":[{"type":"$190 million","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"February 11","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"$349,571","content":"MONEY"},{"type":"February 12","content":"DATE"},{"type":"304%","content":"PERCENT"},{"type":"Pudgy Rod","content":"ORGANIZATION"},{"type":"YouTuber Olajide Olayinka Williams Olatunji","content":"PERSON"},{"type":"$44,045,731","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"November 17","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"588%","content":"PERCENT"},{"type":"Coffeezilla","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"February 15, 2024","content":"DATE"},{"type":"KSI","content":"ORGANIZATION"},{"type":"mid-November","content":"DATE"},{"type":"mid-January","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"$774,173","content":"MONEY"},{"type":"$86,778,798","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"257.3%","content":"PERCENT"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Uncategorized Ordinals","content":"ORGANIZATION"},{"type":"January 27","content":"DATE"},{"type":"$34,816,770","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"349%","content":"PERCENT"},{"type":"$757,178","content":"MONEY"},{"type":"$349K","content":"MONEY"},{"type":"11","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"February 14, 2024","content":"DATE"},{"type":"$690,352","content":"MONEY"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"ERN","content":"ORGANIZATION"},{"type":"February 2","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"Lil Pudgys","content":"LOCATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["NFT","Pudgy Penguins","Scam"],"authors":["Sead Fadilpašić"]}