{"summary":"South Korea’s KODA Sees 248% Growth in Crypto Assets Under Custody in Second Half of 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-koreas-koda-sees-248-growth-in-crypto-assets-under-custody-in-second-half-of-2023.htm","publishDate":"2024-02-22T12:48:29","id":18330,"type":null,"title":"South Korea’s KODA Sees 248% Growth in Crypto Assets Under Custody in Second Half of 2023","category":["Altcoin News "],"content":["Korea Digital Asset (KODA), the largest institutional crypto custody service in South Korea, has seen a remarkable growth in crypto assets under its custody. ","The company revealed that the value of these crypto assets under its custody expanded by nearly 248% in the second half of 2023.","KODA, which was established through a collaboration between major Korean bank KB Bank, crypto venture capital firm Hashed, and blockchain tech firm Haechi Labs, said that the value of these assets reached approximately 8 trillion Korean won ($6 billion) by the end of last year. ","This was a substantial increase from the 2.3 trillion won recorded at the end of June 2023.","Currently, South Korea imposes restrictions on institutions and corporations, preventing them from directly investing in crypto through exchanges. ","However, crypto custodians have been offering institutional investors a regulated avenue for managing crypto assets.","According to KODA, their market share in the local crypto asset custody sector reached 80% by the end of June 2023.","The company stated that it currently serves approximately 50 corporate clients, managing over 200 wallets.","KODA claimed that the demand for crypto custody services is expected to continue rising in the future. ","This statement comes in light of recent announcements by both the ruling and opposition parties in South Korea, pledging to launch local spot Bitcoin exchange-traded funds (ETF) as part of their election promises ahead of the general election on April 10. ","Lee Bok-hyun, South Korea’s head of the Financial Supervisory Service, also aims to visit the United States later and discuss the crypto industry with U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler.","Specifically, the official is set to speak with Gensler regarding spot Bitcoin ETFs.","Both parties have also vowed to lift the ban restricting institutional investments in crypto.","FACTBLOCK: Both the ruling and opposition parties in South Korea are proposing poll promises favorable to the crypto market as part of their campaign for the upcoming general election in April. The implementation of these favorable poll promises would have a positive impact on… pic.twitter.com\/xO8u4WsW27","— Wu Blockchain (@WuBlockchain) February 21, 2024","","More recently, South Korea’s ruling People Power Party has asked for a two-year postponement of the taxation on gains from cryptocurrency investments as a potential campaign promise.","The party aims to prioritize establishing a comprehensive regulatory framework for cryptocurrencies before implementing taxation measures.","As part of its election campaign strategy, the ruling party is considering introducing a bill that encompasses essential elements for potential crypto regulations.","These regulations may include requirements for crypto custody providers and guidelines for token listing.","If implemented, these regulations would supplement South Korea’s initial set of crypto regulations set to become effective in July.","Currently, the tax plan imposes a 22% tax rate on crypto gains exceeding 2.5 million Korean won (approximately $1,875).","In contrast, gains from stocks are only taxed when they surpass 50 million won.","In December last year, South Korea announced that high-ranking public officials would be required to disclose their cryptocurrency holdings starting next year."],"entity":[{"type":"$1,875","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"December last year","content":"DATE"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"April 10","content":"DATE"},{"type":"248%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"February 21, 2024","content":"DATE"},{"type":"Haechi Labs","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"KODA","content":"ORGANIZATION"},{"type":"Lee Bok","content":"PERSON"},{"type":"People Power Party","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"second half of 2023","content":"DATE"},{"type":"KB Bank","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Crypto Regulation","South Korea"],"authors":["Ruholamin Haqshanas"]}