{"summary":"Activate, a token platform developed by ConsenSys Codefi allowing users to participate in token sales, has selected SKALE as its first launch partner\nThe token launch is expected to take place in Q2 2020\nThe platform adopts “Proof of Use” to deter speculation and ensure that participants of the token sale will actively utilize their tokens on the network.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55511\/consensys-codefis-activate-chooses-skale-as-the-first-project-to-launch-a-token-on-its-platform","publishDate":"2020-02-11T11:01:02","id":1833,"type":null,"title":"Blockchain scaling network SKALE chosen as launch partner for ConsenSys Codefi&#x27;s Activate token platform","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">Activate – a platform developed by ConsenSys Codefi to enable user participation in token sales – has chosen the blockchain scalability initiative SKALE as the first project to release a token through its system.<\/span>","<span data-v-f87c67ca=\"\">Announced in Oct. 2019, Activate aims to assist protocols that wish to put out their own decentralize token networks among participants who will actively participate. Users who want to be part of a token launch can in turn purchase, manage, and earn rewards via staking on the platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Activate team estimates that SKALE’s token sale will take place in Q2. Before that, users can pre-register for the token launch as SKALE’s development team continues its testing efforts.<\/span>","<span data-v-f87c67ca=\"\">In selecting potential launch partners, Activate aims to choose projects that have already reached a mature stage of development and are prepared for mainnet launch, Collin Myers from ConsenSys’ Global DeFi Product Strategy told The Block. <\/span>","<span data-v-f87c67ca=\"\">Other considerations include whether the project has adequate token design, the level of transparency in the development work, and whether their governance mechanisms are decentralized.<\/span>","<span data-v-f87c67ca=\"\">“We are very limited to the projects that we can work with due to many factors, the primary one being maturity of the technology,” Myers said. “We're not going to support a project who's not going to mainnet soon... We'd like to work with mature projects that are focused on participation, distribution, and strengthening and bootstrapping the network from the beginning.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There are two main reasons why Activate decided to partner with SKALE, according to Myers. First, the team believes that SKALE is a fairly mature project. Second,&nbsp; SKALE’s layer-2 scaling solution fits Activate’s mission to support projects conducive to the Ethereum ecosystem as a whole.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Right now, many of the excuses of people not building applications on Ethereum has to do with low speeds, low transaction throughput, or not having the scalability that they desire,” Myers said. \"SKALE is a project that needs support.”<\/span>","<span data-v-f87c67ca=\"\">On the utilization side of the platform, Activate adopts the “Proof of Use” mechanism to make sure that users who wish to participate in token launches intend to use the tokens rather than speculate on them, said Activate co-lead Ejaaz Ahamadeen.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If you successfully go through all the pre-requirements to register for the SKALE launch, for example, and you end up purchasing a thousand SKALE tokens, you will then be required to utilize at least 50 percent of those tokens to delegate to a validator to validate transactions on the SKALE network,” Ahamadeen said.<\/span>"],"hashtag":[]}