{"summary":"South Korea Imposes Stricter Punishments For Crypto Trading Offenses","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korea-imposes-stricter-punishments-for-crypto-trading-offenses.htm","publishDate":"2024-02-07T10:36:21","id":18341,"type":null,"title":"South Korea Imposes Stricter Punishments For Crypto Trading Offenses","category":["Blockchain News "],"content":["South Korea’s financial regulators have slated July 19 for the implementation of the Virtual Asset User Protection Act and the Virtual Asset Industry Supervision Regulations.","According to local media outlets, The Financial Service Commission (FSC) disclosed on Feb 7 the date for both regulations to swing into effect after conducting a legislative notice on the Enforcement Decree on Jan 22.","South Korea will implement the \"Virtual Asset User Protection Act\" on July 19, which clearly prohibits market manipulation, illegal transactions and the use of undisclosed important information. Violators will face imprisonment of not less than one year. If the illegal benefit…","— Wu Blockchain (@WuBlockchain) February 7, 2024","","Both regulations outline offenses related to digital asset trading in the country, imposing harsher penalties to deter market participants.","Actions like market manipulation and the use of undisclosed information to get an unfair advantage, as well as illegal transactions are expressly prohibited and carry criminal liabilities.","Per the new regulations, violations can attract a one-year imprisonment period or more and a fine not less than three times the value involved but not more than five times the value of the “illegal profit.” ","However, if illegal profits exceed 5 billion won, penalties could be twice the sum and attract a maximum of life imprisonment as part of efforts to reduce the incidents of illegal trading in the country.","On the part of digital asset exchanges institutions must ensure user assets equal to at least 5% of the value the user deposits with the platform.","However, this will not apply to assets held offline or to firms with accumulated reserves to cover potential risks.","The use of reserves has become a popular way to protect investors. Many firms publish periodic proof-of-reserves or similar statements to show that all assets held are fully backed, specifically in the case of stablecoins.","Furthermore, cryptocurrency firms must manage assets deposited for the purpose of trading through banks to ensure wider regulatory compliance.","Exchanges and related firms must store 80% of used assets off the internet to prevent cases of hacks that have previously resulted in millions of dollars wiped off the market.","The FSC and other regulatory bodies are to constantly supervise the compliance of digital asset firms and traders in the country. The commission is also empowered to investigate alleged defaulters of unfair practices and request necessary financial statements.","“If a violation of the law is discovered, the Financial Services Commission may take measures such as suspending business, ordering correction, filing a complaint, or notifying the investigative agency against the virtual asset business operator.” ","Fines will be imposed on erring parties after the FSC notifies the Prosecutor General of the charges and the latter also receives complete investigative reports of the person or entity alongside their deposition.","South Korea has constantly updated its rules relating to digital assets to prevent fraudulent activities in the market. This week, regulators proposed changes to the employment of digital asset executives and the renewal of licenses in the country."," "],"entity":[{"type":"Virtual Asset Industry Supervision Regulations","content":"ORGANIZATION"},{"type":"Jan 22","content":"DATE"},{"type":"February 7, 2024","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"FSC","content":"ORGANIZATION"},{"type":"The Financial Service Commission (FSC","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Financial Services Commission","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"July 19","content":"DATE"}],"hashtag":["Crypto Regulation","FSC","South Korea"],"authors":["David Pokima"]}