{"summary":"Web3 Platform Friend.tech Transforms Ownership, Shares Stake with Users","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-platform-friend-tech-transforms-ownership-shares-stake-with-users.htm","publishDate":"2024-03-24T15:15:29","id":18344,"type":null,"title":"Web3 Platform Friend.tech Transforms Ownership, Shares Stake with Users","category":["Altcoin News "],"content":["Friend.tech, a social platform leveraging Web3 technology, has proposed a new ownership model by offering its shares to its users. ","The move is intended to empower platform users, who were previously mere participants, to become investors with a vested interest in the company’s prosperity. ","This shift reflects a broader transformation in investment dynamics towards democratization within the digital realm.","Friend.tech users will now transition from being solely content creators or consumers to becoming actual investors in the platform. ","The move strengthens the bond between users and the company, fostering a stronger sense of community.","This initiative was made possible through an agreement with previous shareholders, including Paradigm, who have consented to transfer the rights of selling tokens directly to the platform’s users.","By enabling this transfer, Friend.tech takes a significant step towards a user-centric model, where users not only shape the platform’s future but also share in its success.","The shift by Friend.tech opens up new avenues for user engagement and investment within the crypto industry. ","By providing users with ownership stakes and control over tokens, the company advocates for a more inclusive and equitable approach to technology entrepreneurship and governance. ","The move challenges the status quo of venture capital financing and signals a shift towards broader user participation and investment. ","Users are now empowered to directly impact the platform’s trajectory, fostering a cooperative culture.","It is also important to note that Paradigm played a key role in the move. ","Known for investing in innovative technology ventures, the crypto VC agreed to distribute shares among users, signaling a rise in more decentralized and user-focused business models.","Friend.tech, launched on August 10, 2023, has become one of the top decentralized applications (dApps) on the Base layer, attracting over 200,000 users and facilitating a trading volume exceeding $230 million.","The platform uniquely converts user influence into tradable tokens known as “keys,” allowing users to gain access to a creator’s attention or influence.","The model has attracted not only cryptocurrency influencers but also NBA players and esports personalities, broadening its appeal beyond the crypto space.","One significant factor contributing to Friend.tech’s popularity was the hype surrounding the Base network, a Layer 2 solution associated with Coinbase.","The involvement of Paradigm, an investment firm connected to Coinbase, further increased confidence in Friend.tech’s potential.","However, the platform has also faced privacy concerns, particularly regarding the potential for user doxxing due to the link between Twitter profiles and Ethereum addresses.","Friend.tech has addressed these concerns by clarifying that the information deemed leaked was actually from their public API, showcasing the platform’s open nature while also highlighting the importance of user caution in protecting personal information.","Nevertheless, Friend.tech has seen its popularity drop as of late.","According to a Dune analytics dashboard, the project raked in more than $1 million in revenue at its peak last year.","However, its revenue has recently fallen to under $15,000 over the past couple of months."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$230 million","content":"MONEY"},{"type":"August 10, 2023","content":"DATE"},{"type":"$15,000","content":"MONEY"}],"hashtag":["Decentralization","Web3"],"authors":["Ruholamin Haqshanas"]}