{"summary":"Bitcoin ETF Approval Has Failed Investors, Says Bloomberg + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etf-approval-has-failed-investors-says-bloomberg-more-crypto-news.htm","publishDate":"2024-01-18T15:06:59","id":18340,"type":null,"title":"Bitcoin ETF Approval Has Failed Investors, Says Bloomberg + More Crypto News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","“The fact is, cryptocurrency markets are a mess,” and the US Securities and Exchange Commission (SEC) Chair Gary Gensler has failed investors by approving spot Bitcoin (BTC) exchange-traded funds (ETFs), the Bloomberg Editorial Board argued on Wednesday.","Per the authors,","“The SEC should have tried harder to reform the unregulated spot trading markets.”","After approving the new ETFs, Gensler warned investors to “remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto.”","But at the same time, the approval suggested to investors that “the SEC is comfortable with a new asset class that more than doubled in value last year and that’s sure to be aggressively marketed to them as a sexy alternative to stocks and bonds and mutual funds,” the authors said, adding:","“[Gensler] could have served them better.”","The SEC’s decision in 2021 to approve ETFs based on Bitcoin futures boxed it in, they argued. They may have appeared safer, as they trade on the CME Group’s regulated futures exchange. But they derive their value from spot prices established on crypto exchanges.","This is why a US Court of Appeals overturned the regulator’s denial of a spot Bitcoin ETF application.","“Even so, Gensler should’ve tried to use this opportunity to force some investor protections on the spot trading platforms,” the editors said.","The SEC could’ve made approval conditional on the ETFs deriving prices from platforms that meet the standards of regulated securities exchanges.","That way, “for all their resistance to regulation,” trading platforms would have had an economic incentive and pressure from the ETF sponsors “to adopt much-needed reforms,” they wrote.","Crypto traders could have tripled their funds by basing their investments on Reddit mentions. More precisely, they’d need to have checked whether the number of posts mentioning a crypto was greater than the day before, New Scientist reported.","The trading technique was uncovered by Emiliano De Cristofaro, a Professor at the University of California, Riverside, and his colleagues, the report said.","They analyzed over 130 million posts on 122 subreddits between 1 June 2005 and 31 August 2022. Then, they tracked the price of 30 cryptocurrencies mentioned in the posts.","“The researchers discovered a strong correlation for most cryptocurrencies between the level of conversation on Reddit, compared with the previous day, and a subsequent price increase. Similarly, decreases in the volume of posts about a cryptocurrency can foreshadow dropping prices.”","Subsequently, they conducted a retrospective analysis. It revealed that if someone traded a crypto based on whether the number of posts rose, they could have made three times more than the invested sum.","Different cryptocurrencies saw different lags (time between increased mentions and increased price), the report noted. It was eleven days for Bitcoin and five days for Ethereum.","However, per co-author Jeremy Blackburn at Binghamton University in New York,","“This probably isn’t the best trading scenario.”","An average investor is unlikely to be able to track numerous posts made about a crypto across multiple subreddits.","Furthermore, the past correlation doesn’t guarantee that the same trends will repeat.","Blackburn also commented on the nature of this link. He noted that cryptocurrency investors are more likely to interact on online platforms than offline.","Digital assets infrastructure provider Aquanow and crypto exchange Gate.io announced that they’ve entered into a partnership to build global liquidity for the next wave of blockchain projects.","The partnership will help increase access to crypto markets, said Phil Sham, CEO of Aquanow. “We’re proud to partner with an organization like Gate.io who has cultivated a strong reputation amongst its 13 million users.”","Lin Han, CEO of Gate.io commented that the collaboration “is set to play a critical role in bridging the traditional and digital currency markets.” It will offer users a comprehensive and innovative solution, he added."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Emiliano De Cristofaro","content":"PERSON"},{"type":"Jeremy Blackburn","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"the University of California","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bloomberg Editorial Board","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Binghamton University","content":"ORGANIZATION"},{"type":"Lin Han","content":"PERSON"},{"type":"Phil Sham","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Riverside","content":"LOCATION"},{"type":"June 2005","content":"DATE"},{"type":"US Court of Appeals","content":"ORGANIZATION"}],"hashtag":["Bitcoin ETF","Market","reddit"],"authors":["Sead Fadilpašić"]}