{"summary":"Bloomberg: Ethereum Outpaces Bitcoin as Institutions Shift Focus to the Largest Altcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bloomberg-institutional-interest-turns-froms-bitcoin-to-ethereum.htm","publishDate":"2024-02-21T16:19:49","id":18357,"type":null,"title":"Bloomberg: Ethereum Outpaces Bitcoin as Institutions Shift Focus to the Largest Altcoin","category":["Blockchain News "],"content":["According to Bloomberg, Ethereum has recorded higher growth than Bitcoin this year, thanks to speculations regarding a possible spot Ethereum ETF.","The Bloomberg report, the leading altcoin has recorded positive traction year-to-date (YTD) with speculations on the next wave of exchange-traded funds.","The Ether token is outshining Bitcoin this year partly on speculation that the next wave of spot US crypto exchange-traded funds will focus on the second-largest digital asset https:\/\/t.co\/XM12Tps2iz","— Bloomberg (@business) February 21, 2024","","Ethereum soared 28% this year while Bitcoin has climbed 21%, unlike previous time frames, when BTC was leading in this metric. Last year, Bitcoin recorded a 158% growth based on renewed institutional inflow, while Ethereum trailed behind with an 80% increase.","At press time, Ethereum trades at $2,918, a 6% rise in the last seven days and an 18% growth compared to the previous month. The asset also breached the $3,000 mark on Feb 20 before a slight market correction in early trading hours.","The rise of the asset above $3,000 marks the highest point since April 2022, before the fall of the Terra Network and the subsequent implosion of FTX.","Industry events and broader macroeconomic factors caused the bear market with falling asset prices. In 2022, the values of Bitcoin and Ethereum slipped by more than 55%.","This year, several analysts have predicted a change in direction for Ethereum with speculations of a spot Ethereum ETF approval by the United States Securities and Exchange Commission (SEC).","This comes after the success of Bitcoin before and after the Bitcoin ETF approval. 2023 began with mild inflows into the leading cryptocurrency and skyrocketed in the second quarter.","Notably, as BlackRock and other big firms applied for a Bitcoin ETF license, there is a higher institutional drive surrounding the cryptocurrency. Q4 2023 saw BTC attract millions into investment products as it rose above $42,000 in December.","BTitcoin’s rally led to firms predicting high inflows into the asset. This year, the approval has seen $5.2 billion in net inflows and a price above $51,500.","Institutional investors have now turned their attention to an Ethereum ETF, with several firms filing applications with the SEC. Per Bloomberg:","“While some crypto fans view the funds as a precedent paving the way for Ether ETFs, others are skeptical that officials will accede to them and anticipate further legal drama.” ","Traders see Ethereum’s high potential based on its staking feature, which allows investors to earn yield. The growing smart contracts ecosystem on the chain also boosts positive sentiment towards Ethereum. Stefan von Haenisch, the head of trading at OSL SG Pte Singapore, projected Ether to outperform Bitcoin in the coming months.","“I expect Ether to continue to outperform Bitcoin in the coming months, at least until April-May when the potential ETF approval looms closer.” ","However, he noted that the SEC may not approve an Ethereum ETF because of its tough stance. Wealth management company Bernstein reported similar sentiments on institutional flows to Ethereum based on ETF applications."],"entity":[{"type":"Stefan von Haenisch","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"$2,918","content":"MONEY"},{"type":"April 2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bernstein","content":"PERSON"},{"type":"February 21, 2024","content":"DATE"},{"type":"158%","content":"PERCENT"},{"type":"$51,500","content":"MONEY"},{"type":"$42,000","content":"MONEY"},{"type":"$3,000 marks","content":"MONEY"},{"type":"$5.2 billion","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"Terra Network","content":"ORGANIZATION"},{"type":"$3,000 mark","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"OSL SG Pte","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","ETF","Ethereum"],"authors":["David Pokima"]}