{"summary":"Polygon Launches Alpha Testnet of Zero-Knowledge Rollup Solution ‘Miden’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-launches-alpha-testnet-of-zero-knowledge-rollup-solution-miden.htm","publishDate":"2024-05-07T07:27:39","id":18350,"type":null,"title":"Polygon Launches Alpha Testnet of Zero-Knowledge Rollup Solution ‘Miden’","category":["Ethereum News "],"content":["Polygon, a prominent Ethereum layer-2 developer, has introduced the alpha version testnet of its latest zero-knowledge (ZK)-rollup solution named Miden.","In a post on May 6, Polygon announced that the Polygon Miden Alpha Testnet zero-knowledge is now live, enabling developers to initiate testing. ","Miden is a ZK-rollup specifically designed to enhance the capabilities of the Ethereum blockchain.","Similar to other ZK-rollups, Polygon’s latest solution utilizes a cryptographic technique that allows data to be verified or “proved” without disclosing its contents to the rest of the network. ","Miden also incorporates client-side proving, which enables users to generate proofs for their own state transitions locally, without the need to reveal the state to the network. This approach aims to reduce the network load, enhance privacy, and improve scalability.","ever heard of client-side proving?","it means users on Miden can locally generate proofs for their own state transitions without having to disclose the state to the network. and client-side proofs lower the burden on the network—with Miden, privacy scales better.","— Polygon | Aggregated (@0xPolygon) May 6, 2024","","Additionally, Miden introduces new functionalities, including private accounts that support private tokens and transactions, where only the hash of the account is stored on the blockchain. ","The solution also leverages parallel transaction execution, allowing concurrent processing of transactions, resulting in significantly higher throughput compared to the Ethereum mainnet and reduced blockchain node state bloat.","The roadmap for Miden indicates that a builders testnet is scheduled for September, although no specific timeframe has been mentioned for the mainnet launch.","Miden enters the market in direct competition with StarkWare’s layer-2 scaling network and rollup technology stack, known as StarkNet, as well as other alternatives like Matter Labs’ zkSync Era. ","Polygon also offers zkEVM, a scaling solution equivalent to the Ethereum Virtual Machine, which enables seamless compatibility with existing smart contracts, tools, and wallets.","Despite the launch of the Miden testnet, the native token of the Polygon blockchain, also named Polygon, did not experience a significant reaction in the market. ","At the time of writing, Polygon’s token had fallen by 5% to trade at $0.704.","Last month, Polygon Labs CEO Marc Boiron lashed out at Layer 3 (L3) networks on the Ethereum blockchain, claiming they are unnecessary for scaling the network and only serve to drain value from the mainnet.","At the time, Boiron expressed his skepticism about L3 networks, stating that Polygon Labs, a prominent Layer 2 (L2) scaling network for Ethereum, does not work on L3s because they are not essential for scaling existing networks. ","“L3s exist only to take value away from Ethereum and onto the L2s on which the L3s are built,” he argued.","The L3 ecosystem includes various solutions from L2 networks such as Orbs, Xai, zkSync Hyperchains, and the recently launched Degen Chain on Arbitrum Orbit. ","Meanwhile, the Polygon Proof-of-Stake (PoS) sidechain has successfully executed the Napoli hard fork, adding support for Dencun features and making it the first network to support RIP-7212. ","EIP-1153 aims to enhance the efficiency of block space utilization, optimizing the overall performance of the network. "],"entity":[{"type":"Napoli","content":"ORGANIZATION"},{"type":"1153","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Xai","content":"PERSON"},{"type":"$0.704","content":"MONEY"},{"type":"Polygon Proof","content":"ORGANIZATION"},{"type":"Miden","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Degen Chain on Arbitrum Orbit","content":"ORGANIZATION"},{"type":"Miden","content":"LOCATION"},{"type":"7212","content":"DATE"},{"type":"May 6, 2024","content":"DATE"},{"type":"Miden","content":"ORGANIZATION"}],"hashtag":["Ethereum","Polygon"],"authors":["Ruholamin Haqshanas"]}