{"summary":"DCG Said to be in Talks with Creditors – Will Gemini Crypto Depositors Get Their Money Back?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dcg-said-to-be-in-talks-with-creditors-will-gemini-crypto-depositors-get-their-money-back.htm","publishDate":"2023-01-12T15:05:00","id":18367,"type":null,"title":"DCG Said to be in Talks with Creditors – Will Gemini Crypto Depositors Get Their Money Back?","category":["Blockchain News "],"content":["Barry Silbert’s crypto conglomerate Digital Currency Group (DCG) is “actively engaged” in talks with creditors, according to a little-known crypto exchange.","Writing in a blog post on Tuesday, the Dutch crypto exchange Bitvavo said DCG has proposed to refund at least 70% of 280m euro ($303m) in outstanding debt DCG has to the exchange. “The residual amount is still under discussion with DCG as they are only willing to repay part of it within a period acceptable to Bitvavo,” the blog post said.","It added that it had rejected the proposal because it believes DCG “has sufficient funds available for full repayment.”","In the blog post, Bitvavo also referenced the open letter to DCG that has been published by the crypto exchange Gemini, which is also a DCG creditor. Among other things, the letter called for the DCG board to sack Barry Silbert as the company’s CEO.","“Like Gemini, we share the confidence that a solution can be found to the satisfaction of all concerned,” Bitvavo wrote in reference to the letter, which has been published on Twitter by Gemini’s co-founder Cameron Winklevoss.","","Earn Update: An Open Letter to the Board of @DCGco pic.twitter.com\/eakuFjDZR2","Bitvavo added in its update that it believes payment of the outstanding amount owed by DCG can still be made even if DCG subsidiary Genesis Global files for Chapter 11 bankruptcy.","A bankruptcy has been suggested as a possibility by major media outlets like the Wall Street Journal, given the solvency issues experienced by the crypto lender. In November, Genesis had some $2.8bn in outstanding loans on its balance sheet.","Gemini relied on Genesis for its “Earn” program, and withdrawals from the program became impossible after Genesis closed redemptions for its clients back in November last year.","The Dutch crypto exchange further assured its clients that the process surrounding DCG and Genesis will have no impact on them.","“[…] the current situation regarding DCG does not impact Bitvavo’s customers, its platform and its services. Bitvavo has guaranteed the outstanding amount and thus assumed the risk on behalf of its customers,” it wrote."],"entity":[{"type":"Bitvavo","content":"PERSON"},{"type":"DCG","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Bitvavo","content":"LOCATION"},{"type":"Gemini’s","content":"ORGANIZATION"},{"type":"$303m","content":"MONEY"},{"type":"$2.8","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Barry Silbert","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Board","content":"ORGANIZATION"},{"type":"Genesis","content":"ORGANIZATION"}],"hashtag":["Gemini"],"authors":["Fredrik Vold"]}