{"summary":"Komodo CTO Exclusive: Large TradFi Players Will Be Entering Crypto This Year, DeFi Poised to Grow Once Again","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/komodo-cto-exclusive-large-tradfi-players-will-be-entering-crypto-this-year-defi-poised-to-grow-once-again.htm","publishDate":"2024-01-26T11:03:38","id":18360,"type":null,"title":"Komodo CTO Exclusive: Large TradFi Players Will Be Entering Crypto This Year, DeFi Poised to Grow Once Again","category":["DeFi News "],"content":["Kadan Stadelmann, CTO of open-source technology provider Komodo Platform, talked to Cryptonews about the current crypto investment sentiment, incoming “major” institutional investments, and the renewed rise of decentralized finance (DeFi).","The expert further shared interesting insights into major themes that will define 2024, non-fungible token (NFT) use cases leading to increased interest, the US SEC Chair’s disinterest in the crypto industry’s opinion, and more.","Read on to learn what he told us.","Investor sentiment in the cryptocurrency space is not easy to predict as it’s ever-changing. That said, Stadelmann shared that for most retail investors, enthusiasm is driven by the potential of crypto. At the same time, caution persists due to market volatility and regulatory uncertainties.","When it comes to institutional investors, he said,","“I think the approval of the first spot Bitcoin ETFs in the US has created a wave of optimism and signals growing confidence that crypto will only gain more momentum over the next few years.”","Stadelmann noted that the crypto market’s short-term trends remain tied to macroeconomic factors. These significantly influence investor sentiment.","Speaking of hard-to-predict areas: crypto market’s price trends and news events. However, Stadelmann said there are some possible themes to consider.","As said, the US Securities and Exchanges Commission (SEC) finally approved the first round of spot Bitcoin exchange-traded funds (ETFs) in January. Per the CTO,","“Although the initial hype around this news has since faded, major investments from institutions are only beginning.”","Therefore, throughout February and the rest of 2024, we’ll see more of these large players from TradFi start to enter the crypto space.","Therefore, we’ll soon see to what extent institutional investors and ETFs factor into the market’s price movement.","Finally, it is important to note the anticipation building around the next Bitcoin halving, expected in April.","Halvings typically signal the start of a new bull market cycle for BTC – but also for altcoins. It will be interesting to see, Stadelmann said, if BTC and\/or altcoins can reach new all-time highs post-halving.","Things have significantly changed for DeFi between 2022 and 2024. And the shift goes beyond crypto market prices.","The bear market of 2022 brought numerous challenges to many DeFi projects, Stadelmann said. This includes vulnerabilities, smart contract exploits, and regulatory uncertainties.","And these remain major concerns in 2024.","Also during 2022, DeFi’s total value locked (TVL) went from more than $150 billion to less than $40 billion. However, as of January 2024, TVL has rebounded to $55 billion at the time of writing.","The CTO opined,","“The space appears poised to grow once again.”","Another noteworthy shift since 2022 has been the maturation of Layer 2 (L2) blockchain networks, which has increased scalability and reduced transaction costs. DeFi applications on these networks are now usable from a cost perspective, said the expert.","Also, cross-chain interoperability developments have contributed to a more united DeFi ecosystem.","We’ve already noted the potential future movements in crypto prices, investment sentiment, and DeFi markets.","But 2024 has much more to offer. Stadelmann listed the year’s major themes. He said these will gain more importance even beyond 2024 as the crypto space matures.","First and foremost, he said, is the interoperability among different blockchain networks.","“As the blockchain space diversifies, the need for users to trade across blockchains will only continue to increase.”","In the CTO’s opinion, more users will turn to peer-to-peer (P2P) bridge solutions, like the one offered by Komodo Wallet.","Next: L2s will continue to grow and witness accelerated adoption. More users are moving into the DeFi space and are using decentralized apps (dapps) more frequently. Hence, it is critical to alleviate Layer 1 congestion and reduce transaction costs by processing a significant portion of transactions off-chain.","Stadelmann said that,","“The ongoing development and adoption of L2 solutions signify a crucial step towards achieving mainstream scalability for blockchain technology.”","The central theme for 2024, Stadelmann said, is the pursuit of regulatory clarity. And greater certainty will, hopefully, create a catalyst for accelerated market growth.","Governments and regulatory bodies globally are increasingly engaging with the crypto industry.","Speaking of which, Stadelmann recently wrote an open letter to SEC Chair Gary Gensler. Asked if Gensler is interested in hearing the crypto industry’s opinions, Stadelmann replied that he doesn’t think so.","One positive move from Gensler’s administration was the approval of new ETFs. And yet,","“After years of delays, the main factor for approval was likely political pressure from capital-rich institutions.”","Meanwhile, we have seen very little movement to protect investors or make crypto more accessible to investors, he said.","Furthermore, SEC enforcement actions against Ripple, Binance, Coinbase, and Kraken have stunted the potential growth of the crypto industry. And while the agency has clear evidence against FTX and “other industry players that have blatantly hurt investors,” argued Stadelmann, Gensler decided not to focus on these issues.","3⃣Fraudsters continue to exploit the rising popularity of crypto assets to lure retail investors into scams. These investments continue to be replete w\/ fraud- bogus coin offerings, Ponzi & pyramid schemes, & outright theft where a project promoter disappears w\/ investors’ money.","— Gary Gensler (@GaryGensler) January 8, 2024","","Finally, non-fungible tokens (NFTs), despite discussions of their decline, are here to stay.","Stadelmann said,","“I am optimistic about their future in 2024 and beyond. The NFT market has undergone a major shift in focus, expanding beyond digital art to include gaming, virtual real estate, and metaverse-related assets.”","Industries will continue to adopt NFT technology. Subsequently, use cases will diversify and lead to renewed interest.","“I predict we’ll see NFT become more integrated with real-world assets, which will provide unique experiences that go beyond simple digital ownership,” the CTO opined.","#BitcoinOrdinals Debate: : Innovation or Disruption?🤔 Bitcoin Ordinals Have Proven So Controversial It Could Tear the Bitcoin Industry in Two, writes @KomodoPlatform CTO Kadan Stadelmann. Don't miss this! #Bitcoin #BitcoinNFTs #NFTs https:\/\/t.co\/mhEvCDxnPR","— AlexaBlockchain (@AlexaBlockchain) December 30, 2023","","It’s been said for years that simplicity and ease of use are the answer to DeFi’s adoption issues. Stadelmann argues that achieving this goal has proven to be a difficult task.","The biggest obstacle is the inherent complexity of DeFi processes involving smart contracts, liquidity pools, and yield farming.","“Balancing user-friendly interfaces with the intricacies of blockchain technology presents a non-stop challenge.”","There are some potential solutions:","Komodo Wallet, for example, recently added a fiat on-ramp, lowering the barrier to DeFi market participation. Users can directly buy crypto with fiat instead of signing up for a centralized exchange account and learning how to transfer assets on-chain.","Stadelmann couldn’t share any specific Komodo’s plans for 2024, but said that it will focus on enhancing blockchain interoperability to unify the DeFi space.","“We plan to release our 2024 roadmap on Chinese New Year, which falls on February 10, 2024, as it marks the beginning of the Year of the Dragon.”","Meanwhile, in December, the platform added the above-mentioned fiat on-ramp to Komodo Wallet (web) that supports providers Ramp and Banxa, which support bank transfers, Apple Pay, Visa\/Mastercard cards, etc.","🎨🖼️ NFT wallet support is live on Komodo Wallet!","We have integrated ERC721 and ERC1155 token standards.","Supported chains include @ethereum, @BNBCHAIN, @0xPolygonLabs, @avax, and @FantomFDN.#crypto #cryptonews #DeFi #Web3 #NFT $KMD","👉 https:\/\/t.co\/Xp0MJuQDd6 pic.twitter.com\/mKvwHfjYsU","— 🦎 Komodo (@KomodoPlatform) December 26, 2023","","It also implemented the KMD burn program, and it launched an NFT feature on Komodo Wallet, which allows web app users to send, receive, and view the transaction history for their NFTs on Ethereum, Polygon, BNB Chain, Avalanche, and Fantom.","Check out an earlier insightful chat with Stadelmann on the Cryptonews Podcast:",""],"entity":[{"type":"Polygon","content":"LOCATION"},{"type":"Stadelmann","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"KMD","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Banxa","content":"LOCATION"},{"type":"$150 billion","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"January 8, 2024","content":"DATE"},{"type":"TVL","content":"ORGANIZATION"},{"type":"December 26, 2023","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"$55 billion","content":"MONEY"},{"type":"February 10, 2024","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$KMD","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"US Securities and Exchanges Commission (SEC","content":"ORGANIZATION"},{"type":"Kadan Stadelmann","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Dragon","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"December 30, 2023","content":"DATE"}],"hashtag":["DeFi","Investment","Regulation"],"authors":["Sead Fadilpašić"]}