{"summary":"Silvergate Capital Corporation is acquiring Diem, Meta’s stablecoin project.\nDiem has long faced regulatory concerns, including five Democratic senators calling a shutdown of the coin last year. ","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132532\/diem-association-confirms-sale-of-crypto-payment-network-to-silvergate","publishDate":"2022-01-31T18:22:56","id":1837,"type":null,"title":"Diem Association confirms sale of crypto payment network to Silvergate","category":["Startups"],"content":["Silvergate Capital Corporation will acquire the Diem Payment network's intellectual property and other assets, the Diem Association and Silvergate announced today.&nbsp;","The assets include development, deployment and operations infrastructure and tools for running a blockchain-based payment network. They'll also get \"proprietary software elements critical to running a regulatory-compliant stablecoin network,\" according to a statement from Silvergate.","A partnership between Diem and Silvergate, a crypto bank, was announced last May, when Diem left Switzerland for the US after two years of <a href=\"https:\/\/www.theblockcrypto.com\/post\/102456\/facebook-diem-blockchain-lobbying-washington-dc\" data-v-f87c67ca=\"\">regulatory concerns<\/a>. Silvergate hoped Diem would present opportunities for monetization in the stablecoin space, as The Block&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/112039\/silvergates-growth-continues-thanks-to-sen-but-its-looking-to-diem-for-future-expansion\" data-v-f87c67ca=\"\">reported at the time<\/a>.&nbsp;","Diem, which started as Libra in 2019, has faced a long and ongoing battle from regulators and legislators who were hesitant about a stablecoin with ties to Facebook (now called Meta). US regulators were concerned regarding the project's intentions, and Congress had brought in Diem co-creator David Marcus and Mark Zuckerberg to testify on the project.","In October, <a href=\"https:\/\/www.schatz.senate.gov\/imo\/media\/doc\/schatz_et_al_letter_to_facebook_on_diem.pdf\" data-v-f87c67ca=\"\">a letter<\/a> to CEO Mark Zuckerberg from five democratic senators, including Banking Committee, called to shutdown Diem and Novi, a crypto wallet intended to hold Diem.&nbsp;","\"Despite giving us positive substantive feedback on the design of the network, it nevertheless became clear from our dialogue with federal regulators that the project could not move ahead,\" said Stuart Levey, Diem Networks US CEO in a statement today. \"As a result, the best path forward was to sell the Diem Group's assets, as we have done today to Silvergate.\""],"hashtag":[]}