{"summary":"South Korean Golf Star Lee Ye-won Wins Crypto Prize at Tour Event","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-golf-star-lee-ye-won-wins-crypto-prize-at-tour-event.htm","publishDate":"2023-11-20T00:30:21","id":18384,"type":null,"title":"South Korean Golf Star Lee Ye-won Wins Crypto Prize at Tour Event","category":["Altcoin News "],"content":["The South Korean pro golfer Lee Ye-won has scooped a crypto prize worth over $457,000 by winning a KLPGA Tour event in Busan.","The WEMIX Championship was sponsored by the domestic gaming giant WeMade’s crypto and blockchain gaming subsidiary.","The KLPGA (Korea Ladies Professional Golf Association) tour is one of the biggest rivals to the LPGA tour, and features some of the biggest women’s golf stars.","Lee scored 67, finishing the two-day championship five under par to win – and was awarded 250,000 WEMIX tokens in place of fiat prize money.","The gaming firm provided a total of 1 million of its tokens (worth around $1,828,000 at the time of writing) as prize “money” for the tour, South Korea’s Golf Digest reported.","The firm also distributed NFTs to golfers who made the cut for the second day of the event, and issued NFT tickets.","The event was held at the Haeundae Beach Golf and Resort, a par 72 course in Busan – South Korea’s second city.","Lee, aged 20, currently sits 34th in the global golf rankings, compiled by Rolex – although her ranking may be revised upward following her recent triumph.","WeMade will likely see the event as another coup as it seeks to gain support for its token.","The coin was dealt a blow late last year when DEXA, the listings committee operated by the nation’s only five fiat-trading crypto exchanges, ordered the immediate delisting of WEMIX.","DEXA said it found irregularities in the issuer’s data about the number of WEMIX coins in circulation.","WeMade has since succeeded in “relisting” its coin, with two DEXA member exchanges this year adding WEMIX to their platforms.","The firm has also secured several overseas listings for its coin, as it seeks to restore its reputation and carve a niche for itself as the nation’s leading gaming-related token.","Crypto and golf have enjoyed a mixed relationship over the years.","In 2018, British golf clubs announced that they would accept Bitcoin (BTC) payments.","And in March this year, Grampian Online reported that a crypto community named LinksDAO had “entered into an exclusivity agreement” to buy a “historic” Scottish golf course.","But the South Korean golf world was stunned in August when prosecutors asked a court to arrest a former national golf team coach.","The coach, a former pro named Ahn Seong-hyun, was accused of bribing crypto exchange officials to list an altcoin."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Lee Ye","content":"PERSON"},{"type":"KLPGA (Korea Ladies Professional Golf Association","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$457,000","content":"MONEY"},{"type":"Haeundae Beach Golf and Resort","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Busan","content":"ORGANIZATION"},{"type":"Ahn Seong","content":"PERSON"},{"type":"$1,828,000","content":"MONEY"},{"type":"March this year","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["South Korea"],"authors":["Tim Alper"]}