{"summary":"Is BONK Price Heading to Zero? Drops 8.5% as Solana Meme Legend SEAL Raises $250,000","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-bonk-price-heading-to-zero-drops-6-as-solana-meme-legend-seal-raises-250000.htm","publishDate":"2024-05-07T10:37:40","id":18380,"type":null,"title":"Is BONK Price Heading to Zero? Drops 8.5% as Solana Meme Legend SEAL Raises $250,000","category":["Industry Talk "],"content":["Solana’s second biggest canine meme coin, Bonk ($BONK), tumbled 8.5% overnight as meme coins take some of the heaviest losses amidst a market-wide dip.","Bonk now trades at $0.00002525. At this price, it’s about 7% more expensive than it was last week.","These numbers make for a more volatile reading than those from market leaders Bitcoin ($BTC) and Ethereum ($ETH), but they are more stable than other high-market cap meme coins. ","The world’s favorite cryptocurrency with a market cap of over a trillion dollars, Bitcoin, dropped 1.4% in the last 24 hours but grew 3.8% over the seven days and now changes hands around $64,275. ","Its number one contender, the most commercially important blockchain Ethereum dropped 2.4% overnight but appreciated 1.8% over the seven days and trades at $3,124 as of this writing. ","Solana-based meme coins like BONK fared much better than their Ethereum or proprietary blockchain counterparts over the last week.","Solana projects that posted notable seven-day appreciation include DogWifHat ($WIF), which grew 30%. Book of Meme ($BOME) rallied 27% and Popcat ($POPCAT) mushroomed a staggering 45% over the week.","These gains far outdo the top performers among non-Solana meme coins. Original meme\/canine coin Dogecoin ($DOGE) only added 14.5% over the seven days while Pepe Coin ($PEPE) added 21%.","BONK’s trading chart for the last three months begins with the token setting an all-time high (ATH) of $0.00004547 on March 4, although today’s price represents a 44.5% pullback since then. ","Bonk spent the rest of March and April in gradual free fall, bottoming out around $0.000015 before turning green again.","With a relative strength index (RSI) of 45 and no clear indication of buying or selling momentum, BONK’s price could go either way by the end of the week, depending on the industry-wide or macroeconomic outlook.","Solana meme coins will likely be the target for many investors hoping to help the ecosystem develop into the so-called “Ethereum killer” it’s often touted to be.","Sealana ($SEAL) is the latest in a long line of hilarious new Solana coins vying for attention.","The hillbilly seal has already raised more than$250,000 in a hilarious new presale that’s barely a week old. ","#Sealana’s on his hog, hitting the drive-thru for his 4x Big Mac fix. But his hunger’s insatiable! Only $SOL can keep this seal chonky and ready for EPIC GAINS and LAMBO dreams. Load him up for a ride to success! 🍔💸🏎️","Send SOL to – DJ15ZYXqUNMYJ3hL7z4ciSaSFAw5cbos3YjGpdvwmF6c… pic.twitter.com\/lq8lxfR6cB","— Sealana (@Sealana_Token) May 5, 2024","","Sealana is a spin on the viral South Park character Gamer Guy, aka Fat Computer Nerd. ","Gamer Guy appeared in the hit cartoon’s side-splitting World of Warcraft episode and instantly became a viral meme all on his own for his milk-bottle glasses, screen-lit look of concentration, messy room and gravity-defying girth. ","He has symbolized anyone from the legions of disgruntled keyboard warriors writing sharp, acerbic opinions in internet comments sections, to a kind of Everyman – a symbol of the idler in everyone.","Beached at his desk and ballooning by the day, Sealana’s roving flippers reach for sustenance of chips and tinned tuna between filthy degen trades. It’s the American Dream rewritten in Web3!","For every 1 SOL, investors get 6,900 $SEAL tokens when the presale ends. This gives them some tidy booty to hoard (or HODL) to exploit some potentially explosive appreciation through the presale and beyond.","Users can pay using a widget on the website or by sending SOL from a decentralized wallet to this address: DJ15ZYXqUNMYJ3hL7z4ciSaSFAw5cbos3YjGpdvwmF6c.","Follow the latest developments on Sealana’s X account.","Buy Sealana at the official website here. ",""],"entity":[{"type":"$ETH","content":"MONEY"},{"type":"$3,124","content":"MONEY"},{"type":"14.5%","content":"PERCENT"},{"type":"3.8%","content":"PERCENT"},{"type":"$WIF","content":"MONEY"},{"type":"8.5%","content":"PERCENT"},{"type":"a trillion dollars","content":"MONEY"},{"type":"1.8%","content":"PERCENT"},{"type":"$SEAL","content":"MONEY"},{"type":"Big Mac","content":"ORGANIZATION"},{"type":"Bonk","content":"LOCATION"},{"type":"1.4%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$DOGE","content":"MONEY"},{"type":"27%","content":"PERCENT"},{"type":"$BOME","content":"MONEY"},{"type":"$SOL","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"$0.000015","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"South Park","content":"LOCATION"},{"type":"March 4","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"$250,000","content":"MONEY"},{"type":"$0.00004547","content":"MONEY"},{"type":"44.5%","content":"PERCENT"},{"type":"2.4%","content":"PERCENT"},{"type":"21%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"$0.00002525","content":"MONEY"},{"type":"$PEPE","content":"MONEY"},{"type":"$POPCAT","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$BONK","content":"MONEY"},{"type":"American Dream","content":"ORGANIZATION"},{"type":"May 5, 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$64,275","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bonk","sealana","Solana"],"authors":["Tim Hakki"]}