{"summary":"Modulus Labs has successfully raised $6.3 million in a seed round, with backing from Variant and 1kx, the firm announced on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260335\/modulus-raises-6-3-million-to-bring-crypto-security-to-ai","publishDate":"2023-11-01T12:00:02","id":1838,"type":null,"title":"Modulus raises $6.3 million to bring crypto security to AI","category":["COMPANIES"],"content":["A project aiming to combine two of the venture world's most hyped technologies has successfully raised $6.3 million in a seed round, with backing from Variant and 1kx, the firm announced on Wednesday.","The project, known as Modulus Labs, traces its origins, like many startups, to Stanford University's prestigious halls. Co-founder Daniel Shorr — like many 20-somethings during the pandemic — couldn't resist the allure of the crypto space, and this led to the inception of Modulus. But unlike many of the punters drawn to trading screens, Shorr and his co-founders were diving through crypto whitepapers, with a specific focus on zero-knowledge cryptography.","\"We found ourselves in a position to marry the two,\" Shorr told The Block from a tight WeWork office surrounded by pink sticky notes.&nbsp;","The concept behind Modulus was to utilize <a href=\"https:\/\/ethereum.org\/en\/zero-knowledge-proofs\/\" data-v-f87c67ca=\"\">zero-knowledge proofs<\/a>, which offer a cryptography technique that enables the validation of something's integrity without exposing any additional underlying raw information. Co-founder Shorr draws a parallel, likening this approach to a \"blue checkmark\" for artificial intelligence systems, reminiscent of X (formerly known as Twitter).&nbsp;","Indeed, Modulus is establishing its presence in the market as the boundary between what is real and generative artificial intelligence becomes increasingly blurred, with recent headlines highlighting the use of deepfakes to influence public opinion on the <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-10-31\/-emotive-deepfakes-in-israeli-war-further-cloud-what-s-real\" data-v-f87c67ca=\"\">ongoing war<\/a> in the Middle East between Israel and Hamas. Modulus, in particular, will harness ZK-proofs — specifically zkML — to offer users assurance that AI queries remain unaltered or tampered with, thereby paving the way for a broader range of web3 applications to incorporate AI.","As described by Variant General Partner Jesse Walden, the project is bridging a gap between the opaqueness of machine language models operating on servers and the transparency of the blockchain thus allowing \"more advanced decentralized protocols by minimizing the need for human governance over complex, dynamic functions.\"","So what does that mean in practice? The project has spilled much ink on the potential implications.&nbsp;","\"It brings dApps closer to parity in terms of features to their centralized counterparts, bringing recommendation and matching algorithms to Web3,\" the project wrote in a recent Medium post.&nbsp;","\"It can be used for NFT marketplaces to better cater to the individual wallet owner, based on the NFTs they currently own,\" the blog added. \"It can be used as an automated, trusted Oracle, for verifying off-chain data. And most exciting to us, it can enable new use cases that would have been impossible without on-chain AI support.\"","There are also opportunities to improve tokenomics \"such as improving the quality of a model on-chain and being paid in tokens for the improvements.\"","Additionally, there are more unconventional prospects, such as the possibility of operating a decentralized autonomous organization driven by AI, a concept that, given the challenges often associated with governance, might not be a far-fetched idea.","Walden points to the potential impact on the decentralized lending market, which can leverage artificial intelligence to manage loan collateralization ratios rather than really on human decision-making, which has historically been subpar in crypto lending.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Middle East","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Jesse Walden","content":"PERSON"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$6.3 million","content":"MONEY"},{"type":"Shorr","content":"PERSON"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Daniel Shorr","content":"PERSON"},{"type":"Hamas","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}