{"summary":"Avalanche’s Banff upgrade has given subnet creators more customization and control over their own ecosystems.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177901\/avalanche-subnets-can-now-let-validators-stake-using-the-subnets-token","publishDate":"2022-10-18T13:16:18","id":1839,"type":null,"title":"Avalanche subnets can now let validators stake using the subnet&#x27;s token","category":["BLOCKCHAIN"],"content":["Avalanche subnets can now let validators stake and earn rewards with the subnet’s own native token, due to the implementation of the Banff <a href=\"https:\/\/twitter.com\/_patrickogrady\/status\/1575491088399278080\" data-v-f87c67ca=\"\">upgrade<\/a> today.","The upgrade provides subnet creators with more customization and control over their ecosystems. Subnets are application-specific blockchains within the wider Avalanche ecosystem. Each subnet can have its own purpose, its own set of validators and its own level of security. Subnet validators must also validate the main Avalanche blockchain.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Elastic subnets are the biggest feature to come to Avalanche since the launch of the network in 2020. When transforming their subnet into an elastic subnet, creators open staking up to anyone that has their subnet's token and reward them directly for providing additional security,\" Ava Labs Head of Engineering Patrick O'Grady told The Block.<br data-v-f87c67ca=\"\">\n<\/span>","The key difference following Banff is that if subnet validators — for participating subnets — choose to stake the subnet's native tokens, they will be able to earn rewards in the tokens. Validators will still need to stake AVAX tokens too, which will be required for the <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">upcoming native cross-subnet messaging feature<\/span>, said O'Grady.","This change won’t immediately apply to all subnets. In order for a subnet to operate in this way, the subnet creator has to change it into an elastic subnet — a one-time transformation that forces the creator to relinquish the ability to modify the subnet in the future.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Teams that still want to manage the curation of a Subnet's validator set do not need to enable Elastic Validation. This flexibility is very important for regulated financial institutions looking to launch their own blockchain (which often need validators to comply with various KYC\/AML requirements),\" O'Grady added.<\/span>","The Banff upgrade is a hard fork. Validators will need to upgrade to the latest version or face being marked as offline and see diminishing rewards.","The upgrade also gives subnet creators the ability to remove validators from a subnet before their staking period ends.","<em data-v-f87c67ca=\"\">Update: This article has been updated to clarify that validators will still need to stake AVAX tokens and to provide commentary from O'Grady.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Banff","content":"LOCATION"},{"type":"\" Ava Labs Head of Engineering Patrick O'Grady","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"O'Grady","content":"PERSON"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["AVALANCHE"],"authors":["Tim Copeland","The Block"]}