{"summary":"Curve Finance Plans to Increase AMM Fee, But For Good Reasons","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/curve-finance-plans-to-increase-amm-fee.htm","publishDate":"2024-03-11T12:07:32","id":18396,"type":null,"title":"Curve Finance Plans to Increase AMM Fee, But For Good Reasons","category":["DeFi News "],"content":["There is a new proposal to raise the Automated Market Maker (AMM) fee in LLAMMa (crvUSD), a liquidity pool, on Curve Finance, a leading decentralized exchange (DEX) popular for stablecoin swaps.","A Curve team member suggests a fee increase from 0.6% to 1.9%. If the community accepts this, borrowers leveraging the protocol will benefit. This increase will mitigate ‘soft liquidation losses’ during Ethereum gas fee spikes, enhancing the overall user experience. ","Like other public ledgers, Ethereum relies on a community of validators to approve transactions and secure the network. These validators charge a fee, payable in ETH, which varies based on the level of demand. Gas fees tend to rise whenever there’s a surge in prices and on-chain activity.","According to YCharts data, the average gas fee on Ethereum was 63.68 GWei as of March 11, an increase from around 22 GWei in early January. ","With Ethereum prices approaching $4,000 and the total value locked (TVL) in decentralized finance (DeFi) nearly $100 billion, gas fees will likely expand further. ","This situation will directly affect user experience and potentially lead to more soft liquidations for LLAMMa borrowers.","In the proposal, increasing the fee would create a buffer. Subsequently, this will reduce losses posted by arbitrage traders who must pay high gas fees to execute their trades.","It is not immediately clear if the proposal will be adopted and later executed. Voting is currently open and will close on March 16.","DeFiLlama data on March 11 shows that Curve Finance is one of the largest DeFi giants. It manages over $2.9 billion of assets and is the 13th largest, trailing others like Uniswap and EigenLayer. While most are on Ethereum, a significant portion is managed on Arbitrum, a layer-2 scaling platform."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"1.9%","content":"PERCENT"},{"type":"$4,000","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"0.6%","content":"PERCENT"},{"type":"March 16","content":"DATE"},{"type":"$2.9 billion","content":"MONEY"},{"type":"March 11","content":"DATE"}],"hashtag":["Curve","DeFi","Ethereum"],"authors":["Dalmas Ngetich"]}