{"summary":"U.S. District Court of Central California denied a motion in favor of Bored Ape NFT creators in their lawsuit against artist Ryder Ripps and Jeremy Cahen.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195945\/bored-ape-yuga-lab-lawsuit-ryder-ripps","publishDate":"2022-12-17T09:40:36","id":1839,"type":null,"title":"Yuga Labs advances in lawsuit accusing artist of copying Bored Ape NFTs","category":["Legal"],"content":["<span data-v-f87c67ca=\"\">An ongoing legal tiff between NFT developers Yuga Labs and an artist and his NFT business partner continues as a U.S. federal court denied a motion to dismiss opposition from the Bored Ape Yacht Club creators, according to a <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.cacd.855658\/gov.uscourts.cacd.855658.62.0.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;on Friday.<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs first <\/span><a href=\"https:\/\/www.theblock.co\/linked\/154206\/yuga-labs-sues-artist-in-bored-ape-yacht-club-nft-case\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed<\/span><\/a><span data-v-f87c67ca=\"\"> the lawsuit in June against California-based artist Ryder Ripps and the founder of NFT marketplace Not Larva Labs, Jeremy Cahen, accusing them of copying and selling NFT collections and devaluing the original Bored Ape products.<\/span>","<span data-v-f87c67ca=\"\">Defendants Ripps and Cahen filed a motion to dismiss opposition from Yuga Labs in October, together with an anti-strategic lawsuit against public participation (SLAPP) motion. The District Court of Central California has now denied these motions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Our lawsuit to hold Ripps and Cahen accountable for their obvious and blatant theft of Yuga Labs’ trademarks rightfully moves forward with this ruling,” a Yuga Labs spokesperson wrote in a statement sent to The Block, accusing the pair of profiting off of Yuga’s intellectual property.&nbsp;<\/span><span data-v-f87c67ca=\"\">“We will continue to prove these facts as the case progresses,\" the spokesperson wrote.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ripps <\/span><span data-v-f87c67ca=\"\">has portrayed the lawsuit as an attack on his freedom of speech, and previously<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/www.theblock.co\/post\/157281\/ryder-ripps-instructs-lawyers-ahead-of-yuga-labs-court-case-will-only-settle-for-100-billion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that he would only agree to settle the case for a payout of at least $100 billion.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The court granted the defendants the possibility to re-file a motion in the future against Yuga Lab's claim that the duo was benefiting at Yuga's expense.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Editor's note: This story has been updated to include a quote from Ryder Ripps.<\/em><\/span>"],"hashtag":["LAWSUITS","YUGA LABS"]}