{"summary":"Monero Flips Tron, Cardano, Tezos, Breaks Into the Top 10","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/monero-flips-tron-cardano-tezos-breaks-into-the-top-10-5483.htm","publishDate":"2020-01-09T13:46:39","id":18394,"type":null,"title":"Monero Flips Tron, Cardano, Tezos, Breaks Into the Top 10","category":["Altcoin News "],"content":["After jumping by 27% in a week, Monero (XMR), the most popular privacy coin, has broken into the list of the 10 largest coins.","The 10th largest coin with a market capitalization of more than USD 1 billion has now surpassed networks such as Cardano (ADA), Tron (TRX), Tezos (XTZ), and Stellar (XLM). A week ago, XMR was still 16th.","At pixel time (13:15 UTC), XMR is changing hands at c. USD 59 and is up by 0.7% in a day. Meanwhile, its weekly jump is the biggest among the top 70 coins. Versus BTC, XMR price has added 15% in the past 7 days.","XMR price chart:","In comparison, the second-largest privacy-focused coin, Zcash (ZEC) (31st by market capitalization) is up by 15% in a week.","While its price stabilizes in the past 24 hours, XMR has maintained an upward trajectory since bottoming in December 2019. Then, the coin touched USD 45 before rallying.","Nonetheless, there are no specific fundamental events or news that analysts can pin on to justify XMR rally. However, comments from influential figures, and the general change in sentiment, and recovery in digital asset prices across the board seem to benefit the privacy-focused coin. Moreover, Monero’s hash rate, or the computing power of the network, is at an all-time high.","Meanwhile, Brian Armstrong, CEO of major crypto exchange Coinbase, predicted recently that an unnamed privacy coin or a blockchain with built-in privacy features will eventually get mainstream adoption in 2020."],"entity":[{"type":"XMR","content":"ORGANIZATION"},{"type":"USD 1 billion","content":"MONEY"},{"type":"27%","content":"PERCENT"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"0.7%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"}],"hashtag":["Market","Monero","Privacy"],"authors":["Dalmas Ngetich"]}