{"summary":"Coinbase Uses Lightspark for Bitcoin Lightning Transactions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-uses-lightspark-for-bitcoin-lightning-transactions.htm","publishDate":"2024-04-04T05:40:06","id":18404,"type":null,"title":"Coinbase Uses Lightspark for Bitcoin Lightning Transactions","category":["Bitcoin News "],"content":["Coinbase Global has announced it will be using Lightspark to bring the Bitcoin Lightning Network to its network for faster and cheaper payment transfers.","In an announcement, Lightspark said it is working with the Coinbase team on technical integration. Coinbase will be using Lightspark’s “remote-key signing implementation.” ","The Lightning signing keys will be entirely held by Coinbase, while Lightspark will host their Lightning node. By integrating Lightspark will allow more liquidity to be converted in and out of Bitcoin from fiat and cryptocurrencies. ","Has been great working with @lightspark on our Lightning integration which should be launching soon 🙏 https:\/\/t.co\/KP2CRWZBRw","— Brian Armstrong (@brian_armstrong) April 3, 2024",""," ","“Coinbase is committed to making the global financial system faster and more efficient,” said Shan Aggarwal, Coinbase VP of Corporate and Business Development in an announcement. “We’re excited to partner with Lightspark to eliminate payment barriers and enable faster and cheaper Bitcoin transactions through support for the Bitcoin Lightning Network.”","Back in 2023, Coinbase explored the possibility of integrating the Bitcoin Lightning Network into its platform. Coinbase CEO Brian Armstrong first mentioned implementing the network through a social media platform post in a discussion with users exploring a new scaling solution. ","The Bitcoin Lightning Network offers several benefits for Bitcoin users, including instant payments. This means transactions on the Lightning Network are almost instant, allowing users to send and receive payments in seconds rather than waiting for confirmation times on the Bitcoin blockchain.","Another perk of the network is scalability. By moving a significant portion of transactions off-chain, the Lightning Network helps alleviate congestion on the Bitcoin blockchain, increasing the overall scalability of the network.","Lower fees is another benefit. Since transactions on the Lightning Network occur off-chain, they typically incur lower fees compared to on-chain transactions, making micropayments and small transactions more feasible.","Lightning Network transactions are private by default, as they do not appear on the public blockchain. This can offer users greater privacy compared to on-chain transactions."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"April 3, 2024","content":"DATE"},{"type":"Coinbase VP of Corporate and Business Development","content":"ORGANIZATION"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Coinbase Global","content":"ORGANIZATION"},{"type":"Lightspark","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Shan Aggarwal","content":"PERSON"}],"hashtag":["Bitcoin","Coinbase"],"authors":["Tanzeel Akhtar"]}