{"summary":"Jack Dorsey’s Block Expands Bitcoin Mining Ambitions, Develops 3nm Mining Chip","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/jack-dorsey-block-bitcoin-mining-ambitions-develops-3nm-mining-chip.htm","publishDate":"2024-04-24T12:11:43","id":18406,"type":null,"title":"Jack Dorsey’s Block Expands Bitcoin Mining Ambitions, Develops 3nm Mining Chip","category":["Bitcoin News "],"content":["Jack Dorsey’s payments company Block has shifted its focus from designing chips to developing a full Bitcoin mining system.","In a recent blog post, Block unveiled its accomplishment of designing a standalone three-nanometer (3nm) Bitcoin mining chip and disclosed that it is currently collaborating with a leading global semiconductor foundry to finalize the chip’s design. ","However, the company’s mining project doesn’t stop at chip development. It plans to expand its efforts to include system design as well.","“We’ve spent a significant amount of time talking to a wide variety of Bitcoin miners to identify the challenges faced by mining operators,” the announcement reads.","“Building on these insights and pursuant to our goal of supporting mining decentralization, we plan to offer both a standalone mining chip as well as a full mining system of our own design.”","Concerns over network stability and hardware vulnerabilities have long plagued the Bitcoin community. ","The ASIC chips used in mining rigs are predominantly manufactured in China, a country that has exhibited hostility towards the cryptocurrency sector. ","Jack Dorsey’s Block initiative aims to decentralize the supply of mining hardware and the distribution of hashrate, which serves as a measure of industry competition and mining difficulty.","One major obstacle that Block seeks to overcome is the limited availability and high cost of mining rigs. ","Additionally, the company aims to improve the user experience and reliability of mining operations, addressing common issues such as heat dissipation and noise production.","While specific details regarding the mining system are scarce in the announcement, Dorsey had previously mentioned the possibility of a “Bitcoin mining system based on custom silicon.” ","He also emphasized the need for more vertical integration and diversification in silicon design, which he believes is currently concentrated among a few companies.","The latest development comes shortly after the most recent Bitcoin halving, which occurred recently and reduced the issuance of new Bitcoin by half. ","Dorsey’s vision of accessible mining extends beyond generating new Bitcoin. ","“Mining needs to be more distributed. The more decentralized this is, the more resilient the bitcoin network becomes.”","Square is considering building a Bitcoin mining system based on custom silicon and open source for individuals and businesses worldwide. If we do this, we’d follow our hardware wallet model: build in the open in collaboration with the community. First some thoughts and questions.","— jack (@jack) October 15, 2021","","Block’s venture arm has also backed Gridless, a company operating Bitcoin mines powered by renewable energy sources in Kenya, Malawi, and Zambia. ","As reported, Gridless has found an innovative way to power its operations and bring electricity to rural homes. ","Located near Hell’s Gate National Park, it has set up shop at the site of an extinct volcano, where the company utilizes a mobile container equipped with solar power and energy from a nearby geothermal site. ","Gridless operates six mines across Kenya, Malawi, and Zambia, all powered by a combination of renewable energy sources. ","Bitcoin mining has faced criticism due to its energy consumption. However, when coupled with renewable energy sources, it can help unlock trapped renewable power and incentivize increased production.","Bitcoin miners act as energy buyers, utilizing excess power from renewable sources and providing financial incentives for further development."],"entity":[{"type":"October 15, 2021","content":"DATE"},{"type":"Kenya","content":"LOCATION"},{"type":"Dorsey","content":"PERSON"},{"type":"Zambia","content":"LOCATION"},{"type":"Malawi","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Gridless","content":"PERSON"},{"type":"Hell’s Gate National Park","content":"LOCATION"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["Bitcoin Mining","Block","Jack Dorsey"],"authors":["Ruholamin Haqshanas"]}