{"summary":"Sam Bankman-Fried Files Notice Of Appeal For FTX Trial, Requests To Stay In Brooklyn Federal Jail","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ftx-founder-sam-bankman-fried-files-notice-of-appeal-for-ftx-trial.htm","publishDate":"2024-04-11T20:17:32","id":18402,"type":null,"title":"Sam Bankman-Fried Files Notice Of Appeal For FTX Trial, Requests To Stay In Brooklyn Federal Jail","category":["Blockchain News "],"content":["Disgraced FTX founder Sam Bankman-Fried officially filed his notice of appeal for his FTX trial on April 11 and is requesting to stay in a Brooklyn, New York prison to be closer to his legal team.","In the court filing, lawyers for Bankman-Fried formally filed to appeal his 25-year prison sentence following the FTX fraudster’s grueling landmark fraud trial last fall.","Meanwhile, in an additional court filing, attorneys for the FTX founder requested that Judge Lewis A. Kaplan keep Bankman-Fried at the Metropolitan Detention Center in Brooklyn to “facilitate access to his appellate counsel” as he works to overturn his sentence.","In addition to SBF’s 25-year prison sentence, Judge Kaplan, who originally suggested that the former “king of crypto” could be placed in a medium-security prison in his home state of California, ordered Bankman-Fried to pay an estimated $11 billion forfeiture.","Following his guilty verdict in November 2023, Bankman-Fried vowed to “vigorously” fight the charges brought against him.","During his sentencing, lawyers for Bankman-Fried called the Metropolitan Detention Center “the worst federal jail in the country,” with prisoners having experienced issues such as lack of access to water and poor electricity.","According to the FTX founder’s lawyers, he has struggled to find food that works for his vegan diet in prison – relying solely on water, peanut butter, and bread for sustenance.","First photo of Sam Bankman-Fried in jail at MDC Brooklyn. (December 17, 2023) pic.twitter.com\/QlENjjmeQG","— Tiffany Fong (@TiffanyFong_) February 20, 2024","","Conditions of Bankman-Fried’s life in prison were largely used in his defense prior to his sentencing, with a February court filing alleging that the FTX founder was “uniquely vulnerable” in prison due to his diagnosis of Autism Spectrum Disorder (ASD).","“Because individuals with ASD may have difficulty responding to certain social cues and contexts, they are at risk from both other inmates and prison guards who may view their failure to respond “appropriately” to social cues as disrespectful or disobedient,” the court filing read.","Lawyers for Bankman-Fried have also claimed the FTX founder never intended to harm anyone and “would dedicate his post-prison life to charitable works, finding the best ways to help others…consistent with his commitment to effective altruism.”","Meanwhile, former FTX CEO, Ryan Salame, will be the first of SBF’s co-conspirators to face legal punishment for his role in the crypto scandal when he is sentenced on May 28.","It’s so powerful learning who your friends are! Very excited to grow with them in the long term. It’s not hard to genuinely figure out who cares about customers and who doesn’t if you look past the insanity","— Ryan Salame (@rsalame7926) November 7, 2022","","Currently, Salame is out on a $1 million bond after pleading guilty in September 2023 to violating campaign finance laws and operating an unlicensed money-transmitting business.","The latest legal move by Bankman-Fried’s camp signifies the formal start of what is sure to be a lengthy appeal process for the FTX founder.","At the time of publication, it is unclear when SBF will next appear in court."],"entity":[{"type":"Salame","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"February 20, 2024","content":"DATE"},{"type":"November 7, 2022","content":"DATE"},{"type":"May 28","content":"DATE"},{"type":"Ryan Salame","content":"PERSON"},{"type":"April 11","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"December 17, 2023","content":"DATE"},{"type":"MDC","content":"ORGANIZATION"},{"type":"Tiffany Fong","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Metropolitan Detention Center","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"ASD","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"Brooklyn","content":"LOCATION"}],"hashtag":["Alameda Research","FTX","SBF"],"authors":["Julia Smith"]}