{"summary":"SBF Requests 63-78 Month Sentence in FTX Fraud, Citing Lack of Criminal History, Young Age","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sbf-requests-63-78-month-sentence-in-ftx-fraud.htm","publishDate":"2024-02-28T05:47:47","id":18400,"type":null,"title":"SBF Requests 63-78 Month Sentence in FTX Fraud, Citing Lack of Criminal History, Young Age","category":["Altcoin News "],"content":["Lawyers for FTX founder Sam Bankman-Fried have proposed a sentence of 63 to 78 months in prison for their client, citing his charitable work and young age. Bankman-Fried was found guilty on multiple charges, including defrauding FTX customers of $8 billion.","The sentencing for SBF in FTX fraud is scheduled for March 28.","The sentencing recommendation, filed on Tuesday, argues for leniency due to Bankman-Fried’s lack of prior criminal history, his young age (31), and his expressed commitment to making amends for the damage caused by FTX’s collapse. SBF also emphasized on his intention to appeal the convictions and the possibility of full compensation for defrauded customers.","SBF’s lawyer wrote to judge Lewis Kaplan presiding over the case:","“When the factors are considered, including Sam’s charitable works and demonstrated commitment to others, a sentence that returns Sam promptly to a productive role in society would be sufficient, but not greater than necessary, to comply with the purposes of sentencing.”","The 98 page long filing cited several sources and interviews to establish SBF’s personality and his intentions. The filing concluded:","“The appropriate method of arriving at a just sentence would be to consider the Adjusted Offense Level (Subtotal) of 56, reduced by 30 levels based on zero loss, which yields an advisory Guidelines range of 63-78 months.”","Earlier, the US Probation and Pretrial Services System (PSR) recommended a 100-year sentence in the FTX fraud. Bankman-Fried’s defense team strongly criticized the PSR’s recommendation, calling it “grotesque” and “barbaric.” They argued that such extreme sentences are reserved for exceptional cases involving violent crimes, which they claim Bankman-Fried’s case does not represent."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"US Probation","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"Sam’s","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SBF","USA"],"authors":["Jai Pratap"]}