{"summary":"Gensler Hesitates on Ethereum ETFs, Cites Court Loss as Reason for Bitcoin ETF Approval","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gensler-hesitates-on-ethereum-etfs-cites-court-loss-as-reason-for-bitcoin-etf-approval.htm","publishDate":"2024-02-15T10:47:47","id":18410,"type":null,"title":"Gensler Hesitates on Ethereum ETFs, Cites Court Loss as Reason for Bitcoin ETF Approval","category":["Ethereum News "],"content":["Securities and Exchange Commission (SEC) Chair Gary Gensler has remained tight-lipped regarding spot Ethereum (ETH) exchange-traded funds (ETFs).","When questioned about the possibility of a decision and the timeline for approval, Gensler said that the process would follow the same approach as Bitcoin (BTC) ETFs. Still, he refrained from providing any specific details or a potential timeframe.","On February 6, the SEC postponed its decision on the Invesco Galaxy Ethereum ETF, which followed a delay in December concerning Invesco’s ETF application.","The SEC has also deferred decisions on other Ethereum ETF applications, including those from prominent firms like Grayscale, Fidelity, and BlackRock, the largest asset management company globally.","Notably, other firms such as VanEck and Hashdex are also seeking Ethereum ETF approvals, with Franklin Templeton becoming the latest asset manager to file a spot Ethereum ETF application. ","During the interview, Gensler also expressed caution when discussing the approval of Bitcoin ETFs by his agency.","He reiterated that the approval did not reflect a change in the SEC’s view on the risks associated with Bitcoin but was rather a response to a court decision in the Grayscale v. SEC case.","The court ruling stated that the SEC had “failed to reasonably explain” why it had previously approved Bitcoin futures products but not spot ETFs. Gensler added:","“While we had denied two dozen of these, a court in Washington said we did not get that right, and it got remanded to us. The most sustainable thing to do is to approve these given the court ruling.”","However, he voiced concerns about Bitcoin’s association with illicit activities and the lack of oversight faced by many crypto exchanges.","During the interview, Gensler highlighted the prevalence of fraud and manipulation within the crypto industry and the numerous bankruptcies that have occurred.","He contrasted this with government-issued currencies, acknowledging that they can also be used illegally but play a significant role in supporting established economies.","Absolutely bizarre Gary Gensler doesn't understand #Bitcoin $BTC yet. 'Not decentralised'? Feels like @JoeSquawk is even holding back here.","Also at 3.36 note GG sidesteps the #ETH spot ETF question. Bullish.https:\/\/t.co\/K0p4x6ypR7","— Moondrops Crypto Screener (@moondropsapp) February 15, 2024","","Gensler maintained that the SEC remains impartial and “merit neutral” as long as entities comply with the law.","The Ethereum network is experiencing a surge in the number of validators seeking to stake their ETH.","As reported, the validator entry queue currently stands at 7,045, representing over 225,000 Ether (equivalent to $562 million), its highest level since October 2023.","It is estimated that the backlog will be cleared in slightly over 48 hours.","Due to Ethereum’s limitations on the number of new validators that can join the network per epoch, a backlog occurs as more entities seek to participate.","An Ethereum epoch lasts approximately 6.4 minutes.","Validators are entities that stake a minimum of 32 Ether in the network, enabling them to participate in running Ethereum’s proof-of-stake consensus blockchain.","In return for staking their Ether, validators receive a steady rate of return similar to interest income from fixed-income instruments like bonds."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Invesco Galaxy Ethereum ETF","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Moondrops Crypto Screener","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Grayscale v. SEC","content":"ORGANIZATION"},{"type":"$562 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"February 6","content":"DATE"},{"type":"February 15, 2024","content":"DATE"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["etherem","Securities and Exchange Commission","spot ETF"],"authors":["Ruholamin Haqshanas"]}