{"summary":"Vitalik Buterin Advocates for Modest Gas Limit Increase in Ethereum Network","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vitalik-buterin-advocates-for-modest-gas-limit-increase-in-ethereum-network.htm","publishDate":"2024-01-11T10:40:35","id":18419,"type":null,"title":"Vitalik Buterin Advocates for Modest Gas Limit Increase in Ethereum Network","category":["Blockchain News "],"content":["Ethereum co-founder Vitalik Buterin has recommended a “modest” increase in the gas limit to enhance the potential throughput of the Ethereum network. During a Reddit ask-me-anything (AMA) organized by the Ethereum Foundation’s research team, Buterin emphasized that the gas limit has not been raised for nearly three years, marking the longest duration without an increase in the protocol’s history.","In response to a question during the AMA, Buterin expressed his view, stating, “Honestly, I think doing a modest gas limit increase even today is reasonable.” He highlighted the historical context, noting that the last increase occurred around late 2021 with the implementation of EIP-1559, which effectively doubled the gas limit but resulted in only a roughly 9% increase in actual average usage.","Buterin went on to propose a potential gas limit of around 40 million, suggesting a 33% increase from the current 30 million gas limit reported by Etherscan. He explained that allocating the gains from Moore’s law post-2021 between increased capacity and enhanced ease of syncing and verification would justify such an increase.","The Ethereum gas limit, a crucial parameter that influences the network’s capacity for processing transactions and executing smart contracts, has evolved. Buterin’s suggestion aims to strike a balance between accommodating the growing demand on the Ethereum network and ensuring efficient syncing and verification processes.","As Ethereum continues to advance and undergo network upgrades, decisions regarding parameters like the gas limit play a crucial role in maintaining a healthy and scalable blockchain ecosystem. The proposal for a modest increase aligns with ongoing efforts to optimize Ethereum’s performance and adapt to changing demands.","The cost of transacting on the Ethereum network, measured by gas prices, has seen a surge, currently averaging around 35 gwei, or $1.89, according to Etherscan. This increase has been notable since the beginning of 2024, with higher fees observed for complex smart contract operations.","Ethereum gas fees reached a peak of 150 gwei in May 2023 during the NFT craze. The scalability debate was reignited in November 2023 as fees surged amid another wave of NFT-related activity. Data from Ycharts indicates a 141% increase in Ethereum gas fees over the past year, reaching a current fee of 0.9084 USD\/tx.","The rising fees on Ethereum have led users to explore alternative solutions, with layer-2 solutions like Arbitrum gaining popularity due to their promise of faster and cheaper transactions. Ethereum’s modular approach to scalability may take time to materialize fully, prompting users to seek more immediate alternatives.","One potential solution to address high fees is the EIP-4844 upgrade, designed to make it cost-effective to send layer-2 data to the mainnet using blobs. The EIP-4844 upgrade is expected to go live in the first half of 2024.","From a price perspective, Ethereum recently surpassed the $2,130 resistance level that had held for over a year. However, the momentum has slowed, and the price is currently consolidating below the $2,600 level."],"entity":[{"type":"Moore","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"4844","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"the first half of 2024","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"1559","content":"DATE"},{"type":"Buterin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"141%","content":"PERCENT"},{"type":"AMA","content":"ORGANIZATION"},{"type":"$1.89","content":"MONEY"},{"type":"$2,130","content":"MONEY"},{"type":"$2,600","content":"MONEY"}],"hashtag":["Ethereum","Ethereum Gas Limit","Vitalik Buterin"],"authors":["Hassan Shittu"]}