{"summary":"U.S. Banks Push SEC For Key Changes In Crypto Regulation Following Spot-Bitcoin ETF Exclusion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/u-s-banks-push-sec-for-key-changes-in-crypto-regulation-following-spot-bitcoin-etf-exclusion.htm","publishDate":"2024-02-16T20:01:20","id":18415,"type":null,"title":"U.S. Banks Push SEC For Key Changes In Crypto Regulation Following Spot-Bitcoin ETF Exclusion","category":["Bitcoin News "],"content":["U.S. Banks are pushing for the United States Securities and Exchange Commission (SEC) to change its controversial Staff Accounting Bulletin 121 (SAB 121) after they were excluded from serving as asset custodians for spot-Bitcoin exchange-traded funds (ETFs), according to a February 14th letter from a trade group coalition to the U.S. regulator.","Consisting of the American Bankers Association, the Financial Services Forum, the Bank Policy Institute, and the Securities Industry and Financial Markets Association, the trade group coalition argued that guidance set in place by SAB 121 in which banks are not allowed to be listed as asset custodians for spot-Bitcoin ETFs may pose “important questions about the safety and stability of this ecosystem.”","“We believe that this result could raise concentration risk, as one nonbank entity now serves as the custodian for the majority of these ETPs,” the letter read. “That risk can be mitigated if prudentially regulated banking organizations have the same ability to provide custodial services for Commission regulated ETPs as qualified nonbank asset custodians.”","Equally important, the trade group coalition requested the SEC to modify its definition of what constitutes a crypto-asset, which may exclude certain use cases such as spot-bitcoin ETFs and tokenized deposits if approved.","“SAB 121 makes no distinction between asset types and use cases, but instead generally states that crypto-assets pose certain technological, legal, and regulatory risks requiring on-balance sheet treatment,” the letter continued. “However, there are significant differences between a cryptocurrency like Bitcoin that exists on a public, permissionless network versus a traditional financial instrument that is recorded on a blockchain network where access is controlled and transactions can be cancelled, corrected, or amended.”","US banks, left off key bitcoin ETF roles, are pushing SEC to tweak guidance around holding digital assets. A bank trade gp coalition sent SEC letter asking them exclude ETFs from broad crypto umbrella. They want a piece of the action. I don't blame them, it isn't fair.… pic.twitter.com\/advPa94nK2","— Eric Balchunas (@EricBalchunas) February 15, 2024","","Following the news of the letter’s publication, several key players in the crypto space shared their opinions on X.","“If you were wondering if bitcoin ETFs were going to change the tone around crypto regulation in Washington, here’s your answer,” BitWise Invest CEO Matt Hougan tweeted.","“They want a piece of the action,” Bloomberg’s Senior ETF analyst Eric Balchunas posted to X. “I don’t blame them, it isn’t fair.”","Should the SEC go through with the letter’s demands, U.S. banks would have a greater role in the overall handling of digital assets.","“If regulated banking organizations are effectively precluded from providing digital asset safeguarding services at scale, investors and customers, and ultimately the financial system, will be worse off, with the market limited to custody providers that do not afford their customers the legal and supervisory protections provided by federally-regulated banking organizations,” the letter stated."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Matt Hougan","content":"PERSON"},{"type":"Financial Services Forum","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"February 15, 2024","content":"DATE"},{"type":"American Bankers Association","content":"ORGANIZATION"},{"type":"Securities Industry and Financial Markets Association","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"BitWise Invest","content":"ORGANIZATION"},{"type":"Bank Policy Institute","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Btcoin ETF","Crypto Regulation","SEC"],"authors":["Julia Smith"]}