{"summary":"PEPEJump Pumps Up 70,179% in 24 Hours as New Dogecoin Project Raises $3 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pepejump-pumps-up-70179-in-24-hours-as-new-dogecoin-project-raises-3-million.htm","publishDate":"2024-03-20T17:59:45","id":18427,"type":null,"title":"PEPEJump Pumps Up 70,179% in 24 Hours as New Dogecoin Project Raises $3 Million","category":["Industry Talk "],"content":["As meme coin markets remain supercharged hives of activity, a new ERC-20 meme coin – PEPEJump has skyrocketed +70,179%.","This article will provide an analysis of PEPEJump’s current price trends and look to see whether a new meme coin presale, Dogecoin20, represents a more promising investment opportunity at this time.","🏆 TOP 10 TRENDING PROJECTS on #PinkSale","🥇 $CART – @Cartpay_Sol\n🥈 $HOOD – @Hoodm0ney\n🥉 $BOJACK – @BoJackSolana\n4️⃣ $PIXELDOGE – @Pixeldoge_sol\n5⃣ $BUBBLE – @TeamBubblebot\n6⃣ $EGGY – @EGGY_BSC\n7⃣ $LTEX – @LtexToken\n8⃣ $CANDY – @Candyswap\n9⃣ $PEPEJUMP – @Pepejumpsol\n🔟 $FRGST -… pic.twitter.com\/vWoIFcCJNO","— Sadeeq Ullah (@Sarimkh202022) March 17, 2024","","PEPEJump launched in an exclusive IDO with an initial market cap of just 20k USDT on Uniswap, and now traders are in an exceptional breakout pattern following an aggressive climb on the daily. Uniquely, this comes as traders shift attention to ERC-20 from red-hot Solana meme coin markets.","As price action stalls under tough overhead resistance, PEPEJump is currently trading at a market price of $0.006 (representing a 24-hour change of +73,422%).","This comes after PEPEJump launched at 2:00AM (UTC) on March 20, in a DEX launch that gained almost immediate traction, as PEPEJUMP surged +8,212% in its opening hour.","Brief consolidation following this opening candle saw a lower support zone established between $0.002 and $0.003, and this set the stage for a further +165% move to the current all-time high at $0.006125.","","With early backers sitting atop 73,422% gains, retracement risk is growing, especially as PEPEJump’s market cap pushes up to $2.56m amid inflows of more than $590k in trading volume since launch.","Buy-pressure remains strong representing 71% of transactions since launch, suggesting that the ranks of more than 270 holders have strong faith in JUMPPepe as a strategic meme coin hodl.","And, better still, the project has been increasing PEPEJump liquidity to a current $263k – suggesting a committed developer is behind the pump.","Yet, with market cap already at a loft $2.5m it seems unlikely that PEPEJump will be able to mount more than a 4x gain from here, with very limited traction on X after a project account suspension.","For this reason, many smart money investors are shifting their attention to a more poised play – with greater market recognition: the viral Dogecoin20 presale – which has hammered up to $3.8m raised in less than 48-hours.","Markets are in awe as a new meme coin on ERC-20 explodes at presale after viral traction fuelled a sudden $3.8m flood of funding from excited retail investors.","With the presale still climbing, witness the birth of a new era in cryptocurrency as Dogecoin20 appears poised to be the next major skyrocket in the meme coin sector.","In a copy-cat play on the biggest meme coin in the space – Dogecoin (DOGE), investors are betting big on the opportunity to buy the next DOGE at just 0.0001% of Dogecoin’s market cap.","Indeed, if DOGECOIN20 replicates just 1% of Dogecoin’s success, and hits a $192M market cap – investors could be sat atop a 50x return.","Thought #DOGE20 was cute? You thought wrong… 😏#Memecoins #Altcoins #PEPE #Memes pic.twitter.com\/sFfsM69w29","— Dogecoin20 (@DOGE_COIN20) March 20, 2024","","Revolutionizing Meme Coins: Say hello to Dogecoin20, the fresh face in the crypto scene that’s already making headlines. With over $3.8m raised in its first 2 days of presale, this innovative token pays homage to the OG meme coin while blazing its own trail of innovation and utility.","","Innovative Tokenomics: Dogecoin20 isn’t just another meme coin; it’s a powerhouse of innovation. Featuring a capped supply and an ingenious staking mechanism, this token rewards active participation and shields against inflation, setting a new standard for meme coins everywhere.","","Mission & Roadmap: More than just a token, Dogecoin20 embodies the ethos of “Do Only Good Everyday.” With a roadmap focused on charity, community support, and real-world impact, this project aims to redefine the crypto landscape and pave the way for a brighter, more inclusive future.","Join the Revolution: Be part of something special. Follow Dogecoin20’s journey on X or join their Telegram for the latest updates. Ready to dive in? Visit their website to acquire and stake tokens today!","Don’t miss out on the next big thing in crypto—join the Dogecoin20 revolution now!","Buy DOGE20 Here",""],"entity":[{"type":"$LTEX","content":"MONEY"},{"type":"$2.5","content":"MONEY"},{"type":"+165%","content":"PERCENT"},{"type":"2:00","content":"TIME"},{"type":"+70,179%","content":"PERCENT"},{"type":"$FRGST","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"+73,422%","content":"PERCENT"},{"type":"$PIXELDOGE","content":"MONEY"},{"type":"0.0001%","content":"PERCENT"},{"type":"$3.8","content":"MONEY"},{"type":"OG","content":"ORGANIZATION"},{"type":"March 20","content":"DATE"},{"type":"73,422%","content":"PERCENT"},{"type":"$590k","content":"MONEY"},{"type":"$263k","content":"MONEY"},{"type":"$2.56","content":"MONEY"},{"type":"$CART","content":"MONEY"},{"type":"March 20, 2024","content":"DATE"},{"type":"$HOOD","content":"MONEY"},{"type":"$CANDY","content":"MONEY"},{"type":"March 17, 2024","content":"DATE"},{"type":"+8,212%","content":"PERCENT"},{"type":"$EGGY","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"$BOJACK","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$0.003","content":"MONEY"},{"type":"$0.002","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"$PEPEJUMP","content":"MONEY"},{"type":"Sadeeq Ullah","content":"PERSON"},{"type":"$192M","content":"MONEY"},{"type":"$BUBBLE","content":"MONEY"},{"type":"$0.006","content":"MONEY"},{"type":"$0.006125","content":"MONEY"}],"hashtag":["erc-20 meme coin","Meme coin","PEPEJump"],"authors":["Sam Cooling"]}