{"summary":"Switzerland-based cryptocurrency bank SEBA is now fully operational\nSEBA CEO Guido Buhler said clients can get into digital assets “without having to sacrifice security”\nThe bank is currently supporting five coins – BTC, ETH, XLM, LTC and ETC \nSEBA has plans to extend services to select foreign jurisdictions in December ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46766\/swiss-crypto-bank-seba-goes-live-after-finma-greenlight","publishDate":"2019-11-12T06:00:53","id":1842,"type":null,"title":"Swiss crypto bank SEBA goes live after FINMA greenlight","category":["Cryptocurrency"],"content":["Switzerland-based cryptocurrency bank SEBA is now fully operational.","In a statement shared with The Block on Tuesday, SEBA Bank AG (formerly SEBA Crypto AG) said that Swiss clients, including corporates, asset managers and professional private investors, can now open an account with it. The bank has plans to onboard clients from selected foreign jurisdictions in December.&nbsp;&nbsp;","SEBA was set up in April 2018 and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37883\/after-switzerland-crypto-firm-sygnum-now-seeks-banking-license-in-singapore\" data-v-f87c67ca=\"\">received a banking license<\/a> from the Swiss Financial Market Supervisory Authority (FINMA) in August of this year. “We are proud to have founded a bank within 18 months, raised CHF 100 million [$100.5 million] in capital from investors and obtained a banking and securities dealer license from FINMA,” said SEBA CEO Guido Buhler.","He added that the bank’s customers should be able to take full advantage of digital assets “without having to sacrifice security.”","SEBA said secure custody of digital assets is its \"critical\" success factor and that customers can invest in both traditional and digital assets, store them, trade them and take out loans – via an integrated interface. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Wallets and cards<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe bank is offering SEBAwallet app, e-banking, and SEBA card facilities, through which customers can manage five cryptocurrencies - bitcoin (BTC), ether (ETH), Stellar (XLM), litecoin (LTC) and ether classic (ETC), and convert them into traditional currencies and vice versa online, per the announcement.","SEBA cards, on the other hand, can be used at 42 million points of sale worldwide. “The SEBA Card represents an important step towards the mass introduction of cryptocurrencies,” said Buhler.","SEBA is also providing corporate accounts to Swiss blockchain companies and their employees, per the statement. \"They will be able to have accounts and custody for fiat and digital assets and tokenize assets according to their needs. This is a new and an extremely important step for the Blockchain and digital asset economy,\" Buhler told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLast August, SEBA rival <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37883\/after-switzerland-crypto-firm-sygnum-now-seeks-banking-license-in-singapore\" data-v-f87c67ca=\"\">Sygnum also got<\/a> a banking license in Switzerland and <a href=\"https:\/\/www.insights.sygnum.com\/post\/sygnum-world-s-first-digital-asset-bank-onboards-first-customers-and-achieves-operational-status\" data-v-f87c67ca=\"\">went live<\/a> in September. Just last month, Sygnum also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/45302\/crypto-bank-sygnum-wins-a-license-in-singapore-to-offer-asset-management-services-in-the-country\" data-v-f87c67ca=\"\">received<\/a> a capital markets services license in Singapore, allowing it to provide asset management services in the Asian country. The firm will initially offer a multi-manager fund, which will allocate investments across a portfolio of managers that tap into the global digital asset opportunity using “different and uncorrelated” investment strategies."],"hashtag":["CRYPTO BANKS AND LENDERS","TRADFI BANKS"]}