{"summary":"Arthur Cheong&#x27;s DeFiance Capital is arguing that its funds should be treated outside of the Three Arrows Capital estate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244914\/defiance-capital-3ac-singapore","publishDate":"2023-08-15T06:05:00","id":1842,"type":null,"title":"DeFiance Capital’s $140 million dispute with 3AC liquidators will be heard in Singapore","category":["COMPANIES"],"content":["A $140 million dispute between DeFiance Capital and Teneo, the liquidators for the Three Arrows Capital estate, will be heard in Singapore — against the liquidators’ wishes.","The dispute is over the assets that were managed by DeFiance Capital, a fund that was run independently from 3AC but part of its corporate structure. The liquidators claim the funds should be held as part of the 3AC estate and distributed to creditors, while DeFiance Capital claims the funds should be treated separately and returned to its own investors, according to court documents seen by The Block.&nbsp;","While the liquidators denied that the case should be held at all — calling it a clear afterthought — they said that any trial should take place in the British Virgin Islands, where the fund structure was based. DeFiance Capital argued it should be held in Singapore, where its founder Arthur Cheong and the fund’s investors are located.","Singapore Judge Chua Lee Ming decided the case should be heard and that the more appropriate venue would be Singapore, according to court notes from a hearing on August 8.&nbsp;","The judge gave two main reasons, including that the crypto in DeFiance Capital’s possession is held in Singapore —&nbsp;despite the liquidators arguing that cryptocurrencies don’t exist in any particular location — and that the trust was substantially created there. He also said evidence such as the extent of Cheong’s control over the fund raises serious questions that should be heard at trial.","“We are definitely feeling very positive about the decision by the Singapore judge because this has vindicated our position to a very big extent,” DeFiance Capital Founder Arthur Cheong told The Block. “We are pretty happy that we can finally move to the next stage, which is really about the substance of our disagreement.”","“We welcome the decision by the Singapore Court as it will ensure that important evidence located in Singapore would be available for the purposes of resolving the dispute in a just and efficient manner,” added Blossom Hing, lawyer at Drew and Napier, which is representing DeFiance Capital.","Teneo did not respond to a request for comment.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">As the current acting liquidator for TACL, we believe Teneo is repeatedly overreaching in their attempt to seize other investors’ funds,\" <a href=\"https:\/\/twitter.com\/zhusu\/status\/1692058678218957270\" data-v-f87c67ca=\"\">said<\/a> 3AC co-founder Su Zhu, who is not directly involved in the dispute, on X (formerly Twitter). \"We expect in the due process of law that both DeFiance Capital and Starry Night Capital investors should retain ownership of their respective assets.\"<\/span>","The same dispute is also being discussed in the BVI, according to court documents seen by The Block, but a judgment there has not yet been made. If it’s found that the case should be heard in the BVI, then the proceedings will take place in parallel and could lead to two different judgments on the same issue.&nbsp;","The disputed assets include $115 million of cryptocurrencies and NFTs, which are held in DeFiance Capital’s possession. It also includes 69 SAFE\/SAFT agreements — for future equity or tokens — signed in 3AC’s name. Liquidators say the total amount is $141 million, while DeFiance Capital estimates it at more like $120 million. Cheong said their estimates differ because such agreements are hard to value.","DeFiance Capital was launched in August 2020 within the 3AC structure, albeit with a different share class, Cheong claims in a document seen by The Block that was submitted in the case. The fund had its own offices and employees, and Cheong had autonomy over the investment decisions. DeFiance Capital paid a portion of its management fees to 3AC as part of the agreement.","In February 2022, 3AC founders Kyle Davies and Zhu told Cheong they intended to move to Dubai and asked if he would join them, according to comments by Cheong in the documents. He declined and instigated moving DeFiance Capital out of the 3AC structure. This resulted in the creation of two Singapore-based companies in May.&nbsp;","In May 2022, DeFiance Capital made a $35 million loan in the stablecoin USDC to 3AC. The fund will be a regular creditor with respect to these funds, which are separate from those disputed in this legal matter.","In June, 3AC’s founders signed over certain legal rights in relation to DeFiance Capital to its newly created companies. 3AC also transferred DeFiance Capital’s cryptocurrency and NFT assets — excluding the loaned funds — into one of the companies outside of the 3AC structure. Only the migration was not fully completed before 3AC filed for bankruptcy.","Over the last year, Cheong has been getting back in the game. He <a href=\"https:\/\/www.theblock.co\/post\/219264\/defiance-capital-completes-first-close-of-100-million-liquid-token-fund\" data-v-f87c67ca=\"\">raised<\/a> at least $20 million for a new fund called the DeFiance Liquid Venture Fund, according to a source familiar with the matter, which involves separate entities from those in the legal cases. It began investing in liquid tokens earlier this year.","<em data-v-f87c67ca=\"\">Updated with comment from 3AC co-founder Su Zhu.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$115 million","content":"MONEY"},{"type":"Cheong","content":"ORGANIZATION"},{"type":"Napier","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"August 2020","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Chua Lee Ming","content":"PERSON"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"$141 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$140 million","content":"MONEY"},{"type":"February 2022","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"August 8","content":"DATE"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Kyle Davies","content":"PERSON"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Starry Night Capital","content":"ORGANIZATION"},{"type":"DeFiance Liquid Venture Fund","content":"ORGANIZATION"},{"type":"Su Zhu","content":"PERSON"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"BVI","content":"ORGANIZATION"},{"type":"Singapore Court","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Blossom Hing","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}