{"summary":"Researchers at SonicWall recorded a drop in global ransomware attacks in the first half of 2022. \nThe researchers said a slump in crypto prices drove cybercriminals away from ransomware, among other factors.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159620\/frequency-of-ransomware-attacks-fell-with-bitcoin-price-drop-sonicwall","publishDate":"2022-07-26T08:36:01","id":1843,"type":null,"title":"Frequency of ransomware attacks fell with bitcoin price drop: SonicWall","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">The number of ransomware attacks have trended down globally in the first half of 2022, according to a report by US-based cybersecurity firm SonicWall.<\/span>","<span data-v-f87c67ca=\"\">In the 2022<\/span> <a href=\"https:\/\/www.sonicwall.com\/2022-cyber-threat-report\/?elqCampaignId=15400&amp;sfc=7015d000002k7FCAAY\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cyber Threat Report<\/span><\/a><span data-v-f87c67ca=\"\">, researchers at SonicWall recorded 236.1 million ransomware attempts in the first half of 2022, representing a 23% year-on-year drop.<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/57174\/victims-have-paid-144m-in-bitcoin-as-ransom-over-last-six-years-says-fbi-agent\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ransomware<\/span><\/a><span data-v-f87c67ca=\"\"> is a type of security attack in which a hacker gains unauthorized access to a computer network and encrypts all the data while blocking access to it. The hackers then demand payments, usually in the form of a cryptocurrency like bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The researchers said a slump in crypto prices drove cybercriminals away from ransomware, among other factors. Between January and June 2022, bitcoin's price tumbled from $48,000 to $20,000 amid weakening global macro-economic trends and rising inflation.<\/span>","<span data-v-f87c67ca=\"\">A spokesperson from SonicWall told The Block that bitcoin prices serve as an early indicator to frequency of ransomware attacks, even though there is not a direct correlation between the two. Besides tumbling crypto markets, SonicWall researchers tied other factors to the drop in ransomware events, including security standards at companies and an increase in law-enforcement efforts.<\/span>","<span data-v-f87c67ca=\"\">“There are too many variables in the first half of 2022 to make a direct correlation. However, over the years ebbs and flows of popular cryptocurrency like bitcoin have often served as an early indicator of shifts in overall ransomware volume,” the spokesperson said.<\/span>","<span data-v-f87c67ca=\"\">Per SonicWall researchers, ransomware incidents peaked in 2021 with a record-breaking number of events. During the year, there were some high-profile attacks targeting organizations like<\/span> <a href=\"https:\/\/www.wsj.com\/articles\/jbs-paid-11-million-to-resolve-ransomware-attack-11623280781\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">JBS Foods<\/span><\/a><span data-v-f87c67ca=\"\"> and<\/span> <a href=\"https:\/\/www.theblock.co\/linked\/107496\/us-official-says-majority-of-bitcoin-paid-by-colonial-pipeline-after-ransomware-attack-has-been-recovered\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Colonial Pipeline<\/span><\/a><span data-v-f87c67ca=\"\">, both of which paid millions of dollars worth of bitcoin to hackers.<\/span>","<span data-v-f87c67ca=\"\">As ransomware attacks started to make more news headlines, it prompted governmental efforts to control the issue. For instance, in February 2022, the US Federal Bureau of Investigation<\/span> <a href=\"https:\/\/www.theblock.co\/linked\/134627\/us-doj-names-crypto-enforcement-director-reveals-new-fbi-group-focused-on-blockchain-analysis-and-asset-seizure\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> the Virtual Asset Exploitation Team to track ransomware and profits made from such attacks.<\/span>","<span data-v-f87c67ca=\"\">Ransomware is only one part of the overall cybersecurity story. While ransomware volumes have dipped globally, general malware incidents have increased. SonicWall researchers reported 2.8 billion malware attacks in the first half of 2022, which is an 11% hike from last year.<\/span>"],"hashtag":["HACKS"]}