{"summary":"BOJAK, PNUT, SHREK Coins Soar 100x, New Dog Meme Coin Primed for Launch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bojak-pnut-shrek-coins-soar-100x-new-dog-meme-coin-primed-for-launch.htm","publishDate":"2024-03-22T18:43:51","id":18439,"type":null,"title":"BOJAK, PNUT, SHREK Coins Soar 100x, New Dog Meme Coin Primed for Launch","category":["Industry Talk "],"content":["Meme Coin markets have become the fastest-growing opportunity in finance this month, and retail investors are now scrambling to find new meme coins to secure big profits.","The frenzied meme coin season was triggered early in 2024, when the now iconic Solana meme coin DogWifHat (WIF) token exploded onto a multi-billion dollar market cap.","In the weeks since crypto markets have gone parabolic as millions of investors around the world race to find new meme coins to make it big.","Nearly 800k $SOL was raised in presales, representing $168M at peak prices.","Analyzing the 2,793 coins launched in the last 24 hours:","– Just 385 coins, or 12%, were profitable buys (above 0% return).","– A substantial 78% of these coins were unprofitable buys (less than 0%… pic.twitter.com\/plvKwB13xr","— Bread & Butter (@breadnbutter247) March 20, 2024","","However, with the statistics showing that the majority of Solana meme coin launches lose investors money – is this a smart money game for schmucks? Let’s unpack some of today’s biggest rug pulls.","","In a return to classic ERC-20 meme coin architecture, BOJAK is an intrepid meme coin setting out to make it big in a double-edged play on 2023’s memorable WOJAK token – rebirthed (at least in name) into the BASE blockchain trend.","However, despite a massive influx of $1.14m in 24-hour trading volume, and surging up a whopping +53,687% at its peak – BOJAK has almost completely bled out over the afternoon – leaving more than 2,000 holders in despair.","","Next up, a new Solana meme coin called PNUT – a ticker play on the word peanut – briefly exploded on Raydium DEX markets with a +145,228% rally to an all-time high suckering in almost 2,000 traders.","Yet, a near-complete retracement has seen the majority of PNUT holders left underwater, with prices collapsing -97.5%, leaving PNUT market cap low at $332k.","","Last but not least, another Solana meme coin that witnessed a seismic rug pull today is the Shrek token – a light-hearted play on everyone’s favorite Ogre.","Amid impressive $2.3m trading volumes, SHREK shot up an initial +62,482% – to reach lofty heights around $0.034 – before falling victim to a tumultuous -98.75% drop that has left 1,190 holders short-changed.","Then look no further than the viral Dogecoin20 presale, which has exploded in just three days to hit a jaw-dropping $6M raised.","With DOGE20 hitting terminal velocity throughout today, the Dogecoin20 presale looks poised for an explosive weekend ahead as investors rush to position for early-bird advantage in the fastest-growing meme coin presale.","A replica play on the biggest meme coin, Dogecoin (DOGE), the real appeal of Dogecoin20 lies in the opportunity to buy the next DOGE at just 0.0001% of Dogecoin’s market cap.","Stop a second to imagine the possibilities – if DOGECOIN20 replicates just 1% of Dogecoin’s success, and hits a $192M market cap – investors could be walking away with life-changing 50x returns – all without the overhead risk of a rug pull as seen in straight to DEX launches.","Wow! 🎉","No words to describe this amazing achievement! 🚀#Dogecoin20 reaches $6 million raised! 💰","Massive thanks to the #Crypto Community! 🙌#DOGE20 wishes you a great weekend! 🌟🐶 pic.twitter.com\/PaAyohkpB7","— Dogecoin20 (@DOGE_COIN20) March 22, 2024","","Viral Success Amongst Meme Coins: Dogecoin20, is making waves across crypto as the explosive growth of the presale accelerates towards $7.5m in its first week. In what could be a sell-out play, this innovative token pays respect to the biggest meme coin while onboarding a new generation of moonboys.","","Skyrocket Tokenomics: Dogecoin20 is an upgrade on your usual token; with tailor-designed tokenomics driven by a powerhouse of innovation. Features such as a capped supply and an ingenious super high yield staking mechanism hint at the skill of the development team.","","Mission & Roadmap: Dogecoin20 embodies the ethos of “Do Only Good Everyday.” With a supercharged roadmap focused on philanthropy, community building, and tangible real-world impact, this project aims to redefine the crypto landscape and pave the way for a brighter, more inclusive future.","Join the Revolution: Be part of something special. Follow Dogecoin20’s journey on X or join their Telegram for the latest updates. Ready to dive in? Visit their website to acquire and stake tokens today!","Don’t miss out on the next big thing in crypto—join the Dogecoin20 revolution now!","Buy DOGE20 Here",""],"entity":[{"type":"$2.3","content":"MONEY"},{"type":"$168M","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"78%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"0.0001%","content":"PERCENT"},{"type":"$7.5","content":"MONEY"},{"type":"$SOL","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"$0.034","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"March 20, 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$332k","content":"MONEY"},{"type":"March 22, 2024","content":"DATE"},{"type":"$1.14","content":"MONEY"},{"type":"-98.75%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"+145,228%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"+62,482%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"+53,687%","content":"PERCENT"},{"type":"$192M","content":"MONEY"},{"type":"-97.5%","content":"PERCENT"},{"type":"$6M","content":"MONEY"}],"hashtag":["Bojak","PNUT","Shrek"],"authors":["Sam Cooling"]}