{"summary":"South Korean Altcoin Issuer Arrested on $16.1m Fraud Charges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-altcoin-issuer-arrested-on-16-1m-fraud-charges.htm","publishDate":"2024-03-20T03:00:55","id":18442,"type":null,"title":"South Korean Altcoin Issuer Arrested on $16.1m Fraud Charges","category":["Blockchain News "],"content":["A South Korean altcoin issuer has been arrested on fraud charges. Prosecutors in the country have accused him of duping investors out of $16.1 million.","Per Newsis, the Seoul Southern District Prosecutors’ Office’s Virtual Asset Crime Joint Investigation Team arrested the unnamed individual on March 19.","The arrest follows a crypto market maker’s dramatic and ultimately unsuccessful sea escape in December last year.","On December 20, 2023, Coast Guard officials intercepted a boat carrying the market maker, surnamed Park (42) and nicknamed Jon Bur Kim.","Under this alias, Park also built up a sizeable social media following, where he frequently posted pictures of his collection of luxury sports cars.","Park had boarded a fishing boat in the port of Jindo, hoping to escape to China after police started to probe allegations of token manipulation.","But a storm thwarted the escape attempt, and the Coast Guard eventually forced the boat to dock at Mokpo.","Prosecutors think Park and the unnamed token issuer worked together from February 2021 to April 2022. They said the duo plotted “to issue and list so-called scam coins.”","Officials say the token issuer used “methods such as false data disclosure and market manipulation” to trick investors into thinking his coins were legitimate.","Park is currently being detained and tried at the Haenam Branch of the Gwangju District Court.","Prosecution officials have indicted him on charges of “illegally manipulating coin transaction prices.”","Officials said that Park had helped artificially spike prices by providing bribes to crypto exchange employees.","They think Park and the unnamed man may have enlisted the help of a “coin listing broker” to help get the coins listed.","The prosecution service thinks the accused received huge windfalls when the coins were listed. The listing led to a rapid surge in prices.","At this point, officials think, that the accused sold coins, making massive profits. A prosecution official said officers would “continue to investigate Mr. Park’s alleged complicity in [the unnamed suspect’s] crimes.”","Media outlets have reported that the case also involves former high-ranking executives from the crypto exchange Coinone.","South Korean altcoin issuers have found themselves under increasing scrutiny in recent months.","Many think that so-called “scam coins” have become widespread in South Korea. In some cases, celebrities have been drawn into low-cap altcoin-related controversies.","South Korean financial institutions have pledged to provide $313 billion through the end of the decade for projects aimed at helping the country meet its climate goals https:\/\/t.co\/H5SWcj97q3","— Bloomberg (@business) March 19, 2024","","A pro golfer has also been charged with helping bribe officials to list a South Korean altcoin on a major trading platform."],"entity":[{"type":"$16.1 million","content":"MONEY"},{"type":"Coast Guard","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Haenam Branch of the Gwangju District Court","content":"ORGANIZATION"},{"type":"December last year","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"$313 billion","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Jindo","content":"ORGANIZATION"},{"type":"Newsis","content":"PERSON"},{"type":"February 2021","content":"DATE"},{"type":"Seoul Southern District Prosecutors’ Office’s Virtual Asset Crime Joint Investigation Team","content":"ORGANIZATION"},{"type":"Jon Bur Kim","content":"PERSON"},{"type":"Park","content":"PERSON"},{"type":"Mokpo","content":"LOCATION"},{"type":"March 19, 2024","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"December 20, 2023","content":"DATE"}],"hashtag":["Police","South Korea"],"authors":["Tim Alper"]}