{"summary":"Bitcoin and Ethereum Drives Cryptocurrency Market Higher","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-drives-cryptocurrency-market-higher-1236.htm","publishDate":"2018-02-19T10:18:00","id":18449,"type":null,"title":"Bitcoin and Ethereum Drives Cryptocurrency Market Higher","category":["Ethereum News "],"content":["Bitcoin price remains in a bullish trend and is currently trading above USD 10,700. Cryptocurrency market is back in the green zone with decent gains across the board. Polymath outperformed other altcoins and moved up by 40% to USD 1.56.","There were slow and steady gains in bitcoin, Ethereum, bitcoin cash, ripple and other cryptocurrencies. The market traded with a positive bias and downside corrections remained well bid. It seems like the market has digested the last major decline and is slowly recovering.","Bitcoin\nBitcoin gained momentum during the past few sessions and remained above the USD 10,000 support level. BTC\/USD is currently trading 5.3% higher from today’s low of USD 10,080.\nThe USD 10,000 level is a major support zone and it could act as a pivot level this week. On the upside, an initial resistance is at USD 11,000. Above the mentioned USD 11,000, the price may rise towards the next major resistance at USD 11,400.\nOn the downside, an initial support is at USD 10,500, followed by USD 10,250 and 10,100. The most significant support remains USD 10,000.","Ethereum\nEthereum declined recently, but it managed to stay above the USD 900 support. The ETH\/USD pair is currently trading 3.5% higher at USD 943.\nLooking at the charts, the price is struggling to move above the USD 950 and 960 resistance levels. However, the key resistance is at USD 1,000. In the short term, the price may trade in a range before it makes the next move above USD 950.","Bitcoin Cash and Ripple\nBitcoin cash continues to perform exceedingly well and today its price is trading 8% higher to USD 1,510. BCH\/USD is trading with a solid bullish bias and since it is above USD 1,500, there are chances of more gains toward USD 1,600 and 1,620.\nRipple is also gaining upside momentum today and is trading 7.4% higher to USD 1.125. XRP\/USD recently failed to move above USD 1.20, but looking at the current price structure, it seems like buyers could make another attempt to break USD 1.20.","Other Altcoins Market Today\nToday’s best performer was Polymath, which is trading around 40% higher. The current price is USD 1.56, with technical indicators pointing overbought levels. There was an announcement that the Canadian Securities Exchange will sponsor at POLYCON18, a crypto event dedicated to securities tokens, which resulted in an increase in buying interest.\nEthereum Classic also traded substantially higher and gained 24% to USD 38.0. There were positive developments from the ETC community, which helped the price in attracting buyers."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"5.3%","content":"PERCENT"},{"type":"3.5%","content":"PERCENT"},{"type":"7.4%","content":"PERCENT"},{"type":"Today\nToday","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"USD 1,500","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"ETC","content":"ORGANIZATION"},{"type":"Canadian Securities Exchange","content":"ORGANIZATION"},{"type":"Ripple\nBitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Cash","Ethereum","Ethereum Classic","Markets","Ripple"],"authors":["Aayush Jindal"]}