{"summary":"5 Things To Expect From Ethereum’s Upcoming Dencun Upgrade","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-dencun-upgrade-what-to-expect.htm","publishDate":"2024-03-01T11:03:11","id":18455,"type":null,"title":"5 Things To Expect From Ethereum’s Upcoming Dencun Upgrade","category":["News "],"content":["Ethereum’s much-anticipated Dencun upgrade is scheduled for a mainnet launch on March 13, following successful testnet launches in February.","This upgrade marks a significant milestone in Ethereum’s evolution, and is expected to have a considerable impact on the wider market.","The Dencun hard fork will involve implementing several Ethereum Improvement Proposals (EIPs). Of these, EIP-4844, commonly called proto-danksharding, is attracting significant attention.","Ethereum investors are eagerly awaiting to see the changes and benefits this upgrade will bring to the network.","EIP-4844 is set to be a game changer for Ethereum’s efficiency, particularly for Layer-2 scaling solutions like rollups. Currently, these rollups enhance transaction speed and reduce costs by temporarily holding a copy of Ethereum’s ledger and history.","This setup helps in verifying the accuracy of transactions. But it relies on using “calldata” for data storage, which is quite expensive – costing about $1000 per megabyte. This high cost can be a major hurdle, especially when there’s a surge in demand.","EIP-4844 aims to resolve this issue by introducing a new concept called “blob” transactions. These are designed as a temporary data storage solution specifically tailored for Ethereum’s rollup needs. Unlike the current approach, blobs can store large amounts of data more efficiently and cost-effectively.","By providing a more cost-effective way of storing large amounts of data, this upgrade will make it cheaper and more efficient to operate on Ethereum.","Blobs are also expected to expand the data submission capacity for Layer-2 solutions when interacting with the Ethereum mainnet. This enhancement has the potential to dramatically increase the number of transactions the network can handle per second.","Overall, users can expect a more scalable, efficient, and cost-effective Ethereum network following this upgrade.","It’s anticipated that there will be a surge in the use of Ethereum for various applications after the Duncan upgrade. So, it is poised to positively shift investor sentiment towards Ether. This demand pressure, combined with the improved functionality of the network, could potentially drive Ether’s prices higher.","Investors are also likely to view the upgrade as a positive step towards resolving some of the longstanding issues with Ethereum, potentially increasing their confidence and interest in investing in Ether.","This could attract more retail investors and boost DeFi app usage on Ethereum, potentially driving Ether prices beyond $5,000 by year-end, according to Gracy Chen, managing director of Bitget.","ETH last traded around $3,432 as of Friday, and is up 46% in the last month.","The Dencun upgrade, with its Proto-Danksharding feature, aims to greatly improve Ethereum’s user experience by achieving a balance between scalability, decentralization, and network performance.","Andrey Kuznetsov, co-founder of blockchain network HAQQ, said the result is an environment conducive to innovative applications in various fields, from social finance to gaming, facilitating cost-effective transactions for users and allowing developers to create more sustainable solutions without worrying about high transaction costs for end-users.","Bitget’s Chen said that if Dencun is successful, it could boost the ongoing rally in Ethereum’s price by positively impacting market sentiment.","Conversely, if the upgrade fails to deliver as expected, it could lead to disappointment among users, potentially triggering a significant drop in Ethereum’s price and possibly causing a user exodus that might be difficult to reverse in the short term.","The crypto market’s reaction to the Dencun Upgrade’s outcome will likely cause considerable volatility in Ethereum’s value.","“The Ethereum Dencun Upgrade aligns with the network’s vision to nurture a cheap and scalable network,” Bitget’s Chen said.","This, according to her, will position Ethereum to effectively compete with other blockchain networks like Binance Smart Chain and Avalanche."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"$3,432","content":"MONEY"},{"type":"The Ethereum Dencun Upgrade","content":"ORGANIZATION"},{"type":"Gracy Chen","content":"PERSON"},{"type":"Andrey Kuznetsov","content":"PERSON"},{"type":"$5,000","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Proto","content":"PERSON"},{"type":"March 13","content":"DATE"},{"type":"$1000","content":"MONEY"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"Dencun","content":"ORGANIZATION"},{"type":"Dencun Upgrade","content":"ORGANIZATION"}],"hashtag":["Dencun","Ethereum","Ethereum Upgrade"],"authors":["Shalini Nagarajan"]}