{"summary":"Identity Verification in Crypto: Addressing the Clash Between Blockchain Anonymity and KYC Compliance","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/identity-verification-crypto-addressing-clash-between-blockchain-anonymity-kyc-compliance.htm","publishDate":"2023-08-08T18:00:00","id":18457,"type":null,"title":"Identity Verification in Crypto: Addressing the Clash Between Blockchain Anonymity and KYC Compliance","category":["Blockchain News "],"content":["Financial privacy and anonymity online have been among the key principles of blockchains since Satoshi Nakamoto first unveiled the Bitcoin white paper, but recent actions from regulators have put this principle under pressure.","To better understand regulatory actions, listening to what regulators are actually saying can be useful.","For instance, Christy Goldsmith Romero, a commissioner at the US Commodity Futures Trading Commission (CFTC), was cited in a Reuters article from earlier this year as calling fraud “a hallmark of the digital asset markets,” adding that the human toll of this “may be overlooked.”","“It’s essential for governments and particularly the industry to address that which makes crypto so attractive to illicit finance, and that is the allure of anonymity,” she said.","The same comments were also brought up in a Cointelegraph report from this week written by Vinay Tripathi, a director of product at identity verification provider Trulioo. The report focused on how crypto trading and custody platforms are complying with know-your-customer (KYC) regulations that are imposed by governments.","According to the report, comprehensive compliance systems are needed for companies such as crypto exchanges for them to handle the complexities of differing regulations and ID verification procedures around the world.","To better handle this, specialized platforms offered by identity verification providers have gained a foothold in the crypto industry, the report said, while explaining that these often make used of automation and artificial intelligence (AI)-driven technology.","All in all, it’s clear that the crypto industry has delivered many benefits, including the promise of decentralized finance (DeFi) to be an open financial system for all.","However, the industry also faces significant challenges in the area of KYC and anti-money laundering (AML), and dealing with these issues in the right way will be critical in order for the industry to flourish going forward, the report argued.","It went on to finally pitch newer third-party ID verification platforms as the solution:","“A comprehensive identity verification platform can help companies overcome those challenges and meet user expectations for fast, convenient onboarding experiences,” Tripathi’s article concluded by saying."],"entity":[{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"},{"type":"US Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Vinay Tripathi","content":"PERSON"},{"type":"Tripathi","content":"PERSON"}],"hashtag":["Privacy"],"authors":["Fredrik Vold"]}