{"summary":"Bitcoin ETF Approval Frenzy Begins As SEC Approves First Spot Bitcoin Funds – BTC Indifferent So Far As ETH Rises","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etf-approval-frenzy-begins-as-sec-finally-approves-first-spot-bitcoin-funds-bitcoin-remains-unresponsive.htm","publishDate":"2024-01-10T21:16:04","id":18454,"type":null,"title":"Bitcoin ETF Approval Frenzy Begins As SEC Approves First Spot Bitcoin Funds – BTC Indifferent So Far As ETH Rises","category":["Bitcoin News "],"content":["The SEC has finally approved the first spot Bitcoin exchange-traded funds (ETFs) in the US. This monumental decision opens the floodgates for 11 Bitcoin spot ETF issuers who have been patiently waiting in the wings, marking the beginning of a new era for cryptocurrency investing. Surprisingly Bitcoin’s price barely budged, only gaining about 1% in the hours after the news broke.","There was some initial uncertainty around the legitimacy of the approvals when the SEC website went down shortly after the announcement. This doubt was further fueled by the fact that just yesterday, the SEC’s official Twitter account had been hacked. However, the website came back up and was running within a few minutes, confirming that the approval for the spot Bitcoin ETFs was, in fact, real.","Breaking from SEC- All 11 $BTC #Bitcoin Spot ETF's approved. CBOE says Spot Bitcoin will begin trading tomorrow https:\/\/t.co\/oDxRvYPHuz","— Mark Newton CMT (@MarkNewtonCMT) January 10, 2024","","With the Bitcoin ETF approval cemented after years of anticipation, these new spot funds are set to dramatically expand access to Bitcoin investing for millions of investors who prefer the familiar ETF wrapper. Investors can now get Bitcoin exposure in their regular brokerage accounts without being restricted to buying it directly or via futures-based funds.","","The dam has burst open and set off a frenzy of activity, with various US ETF issuers scrambling to offer the most attractive fee structures to appeal to investors. Major names like ARK Invest, Bitwise, Grayscale, Invesco, and more are trying to undercut each other with slashed fees, free periods, and other benefits.","ARK Invest, partnering with 21Shares, announced zero fees for the first 6 months. Bitwise and Invesco joined the fee war with identical 0% offers for their first $5 billion in assets. With almost a dozen competitors, this price battle is just beginning.","LOWER: BlackRock has just cut the fee on its spot Bitcoin ETF to 0.25% (and 0.12% for the first $5b). They really going for the jugular here, looking to crush the others bf they even born, just brutal. ARK has also cut to 0.21%. Bitwise curr low at 0.20%. Terrordome life. pic.twitter.com\/PtSrvAinbW","— Eric Balchunas (@EricBalchunas) January 10, 2024","","","Unlike Bitcoin’s price, which has hardly moved, Ethereum reacted more strongly to the Bitcoin ETF approval news as some had anticipated. Ethereum’s price has surged over 3.5% since the SEC announcement, crossing the $2,500 mark and outperforming Bitcoin.","The strong investor interest in Ethereum appears to be driven by the belief that if Bitcoin ETFs could get approved, Ethereum ETFs have a good chance as well. There is also a strong “sell the news” narrative that could be holding BTC’s price back, while Ethereum’s ETF approval remains as a “buy the rumour” narrative.","Ethereum. pic.twitter.com\/vo0YkfFZiR","— Awawat (@Awawat_Trades) January 10, 2024","","","The launch of spot Bitcoin ETFs opens crypto investing to the masses in the US by removing barriers like wallets and exchanges. Investors can simply buy shares through normal brokerage accounts. But how the funds will track Bitcoin itself has yet to be seen.","According to ProShares’ Simeon Hyman, Bitcoin futures ETFs have tracked the price “fairly well” so far. Whether spot ETFs can replicate this close correlation is the big question.","Nonetheless, experts are optimistic about the impact. Past Bitcoin ETF-related events have already demonstrated potential impact. When ProShares launched the first Bitcoin futures ETF in October 2021, Bitcoin surged from ~$10k to over $40k within months.","This time, the long-awaited spot ETFs are predicted to unleash even greater inflows. According to GTS co-global head of ETF trading and sales Reggie Brown, the combined capital inflows could reach up to $20 billion in the first year.","Samson Mow of JAN3 predicts Bitcoin could reach $160,000 or even $1 million following the launches. Anthony Scaramucci also sees rapid gains, estimating Bitcoin could hit $330,000 with the approval.","With the seal of approval cemented at last, it’s clear the SEC is comfortable with the maturing crypto industry and Bitcoin market structure. Their thumbs-up will likely prompt even more institutional investors to embrace digital assets. For cryptocurrency advocates, this regulatory green light of a Bitcoin ETF approval represents a validation years in the making."],"entity":[{"type":"0.20%","content":"PERCENT"},{"type":"Simeon Hyman","content":"PERSON"},{"type":"January 10, 2024","content":"DATE"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"0.12%","content":"PERCENT"},{"type":"Ethereum ETFs","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"October 2021","content":"DATE"},{"type":"$160,000","content":"MONEY"},{"type":"CBOE","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"$40k","content":"MONEY"},{"type":"All 11","content":"DATE"},{"type":"0%","content":"PERCENT"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$10k","content":"MONEY"},{"type":"$2,500","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"US ETF","content":"ORGANIZATION"},{"type":"0.21%","content":"PERCENT"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"0.25%","content":"PERCENT"},{"type":"Reggie Brown","content":"PERSON"},{"type":"3.5%","content":"PERCENT"},{"type":"Mark Newton CMT","content":"ORGANIZATION"},{"type":"Samson Mow of JAN3","content":"ORGANIZATION"},{"type":"$5b","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"$330,000","content":"MONEY"},{"type":"Ethereum’s ETF","content":"ORGANIZATION"}],"hashtag":["Bitcoin ETF approval","Bitcoin Price","SEC ETF"],"authors":["Trent Alan"]}