{"summary":"Unveiling the Dark Web: How Privacy Coins Fuel the Trade of Criminal Material Online","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/unveiling-the-dark-web-how-privacy-coins-fuel-the-trade-of-criminal-material-online.htm","publishDate":"2024-03-01T17:18:20","id":18451,"type":null,"title":"Unveiling the Dark Web: How Privacy Coins Fuel the Trade of Criminal Material Online","category":["Blockchain News "],"content":["Privacy coins are fuelling the proliferation of child sexual abuse material (CSAM), according to Chainalysis’s 2024 Crypto Crime Report.","The report highlights crypto’s growing role as tender among dark web vendors of CSAM.","Like other things listed on the dark web, CSAM is often bought and sold with Bitcoin.","However, the privacy coin Monero (XMR) now plays a growing role in the criminal economy.","According to the report, many CSAM vendors have adopted Monero, although data suggests the coin is more prevalent in the money laundering process after vendors have collected their earnings, rather than in the actual purchases.","The use of Monero-friendly instant exchangers by CSAM vendors has grown noticeably in recent years.","Instant exchangers are non-custodial tools for quickly trading one crypto for another that obscure the transactions they make.","Coupled with the lack of KYC requirements, instant exchangers are easy laundering tools and platforms for vendors to obtain Monero, a privacy coin that obscures the money’s destination wallet.","Typically, CEXes make up the largest recipient of illicit crypto funds from any criminals, but among CSAM vendors, the easy use of instant exchangers for converting their Bitcoin hauls into Monero is closing the gap.","","Earlier this month, Monero crashed 40% intraday on news that Binance would delist it.","In recent years, regulators have pressured exchanges to delist privacy coins because of their lack of KYC guardrails.","Binance itself is treading on thin. The company is currently fielding multiple lawsuits and probes by the Department of Justice, the Internal Revenue Service, the US Treasury, the Securities and Exchange Commission and the Commodity Futures Trading Commission.","The different government agencies all more or less say the same thing: Binance’s lack of KYC and AML guardrails enables laundering and amounts to criminal conduct.","On the flipside, crypto’s transparent blockchain has actually helped fight crime.","In 2019, law enforcement officials used Chainalysis software and analysis to bring about the shutdown of the largest CSAM website by volume of material stored, alongside the arrests of the owner and operator.","Chainalysis’s recent crime report gives an example in which New York law enforcement officers trained in blockchain analysis identified the administrator of a large CSAM dark web retailer, made two arrests, and rescued a 12-year-old victim.",""],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Monero","content":"PERSON"},{"type":"Monero","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"CSAM","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Chainalysis","Monero","xrm"],"authors":["Tim Hakki"]}