{"summary":"Startup Founder Sells USD 20,000 of Personal Tokens in a ‘Human IPO’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/startup-founder-sells-usd-20-000-of-personal-tokens-in-a-hum-6286.htm","publishDate":"2020-04-14T10:12:16","id":18456,"type":null,"title":"Startup Founder Sells USD 20,000 of Personal Tokens in a ‘Human IPO’","category":["Altcoin News "],"content":["A crypto entrepreneur has completed the sale of his personal tokens on the Ethereum (ETH) blockchain, raising over USD 20,000 to invest in his future business endeavors.","Alex Masmej is a startup founder in his 20s who launched a for-profit DAO (decentralized autonomous organization) offering loans against digital items (NFTs) called Rocket, and is a founding member of the Consensys-backed Marketing DAO. However, in order to raise funds for his move to San Francisco and “a mainstream-focused crypto startup” – which he told Cryptonews.com will be “savings account most likely” – he decided to sell personal ALEX tokens. Upon the initial ALEX offering’s completion, Masmej announced on Sunday that he managed to raise USD 20,000 in 123 hours from 29 participants since the coin offering’s announcement via a blog post, selling a million of his tokens.","To create his personal token, he partnered up with Roll, a blockchain infrastructure provider for personal tokens. The announcement of this sale first came in early March during the Ethereum Community Conference (EthCC) in Paris.","As to what this token is, Masmej describes it in the blog post as “a blend between a small Income Sharing Agreement and a human IPO.” He explains that he decided to sell 1 million ALEX, or 10% of the total supply relative to stakeholders’ share of the raise. “For example, if someone invests USD 2,000, they will get 100,000 ALEX,” he adds.","Shareholders will be given back 15% of all the income, promises Masmej, distributed quarterly in DAI or an equivalent stablecoin for the next three years, capped at USD 100,000. He adds that ALEX is liquid and holders can exit earlier by selling some on Uniswap, a protocol for automated token exchange on Ethereum.","Among the utility aspects to his personal token, Masmej lists: voting on some of his personal decisions, social media signaling via his Twitter account, exclusive sessions, 1:1 office hours on crypto, startups, Ethereum, etc.","“With ALEX,” writes its creator, “I aim to be a trendsetter in what these tokens can be used for, largely taking feedback from my backers and the larger community on what that looks like.” Masmej seems to have great faith in this type of tokens. He told Cryptonews.com that in the next three years, “both me (hopefully) and the personal token space (certainly) will explode.”","Just today Masmej finished the airdrop of ALEX tokens. Meanwhile, he had stated that this coin offering is experimental, and both in the blog post and on twitter, Masmej admitted that he could indeed just run away with the money – but that he won’t. “Although it’ll hurt my reputation, I could run away with the money. Great founders fail all the time,” the blog post says. Where he does plan to go is San Francisco’s Silicon Valley though, and he told Cryptonews.com that he’ll move when the lockdown is over, likely in the next four-five months.","Watch Masmej’s ALEX announcement below:",""],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Sunday","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"Income Sharing Agreement","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Masmej","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"San Francisco’s Silicon Valley","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Alex Masmej","content":"PERSON"},{"type":"ALEX","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Masmej","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"ALEX","content":"ORGANIZATION"},{"type":"Ethereum Community Conference","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Adoption","Ethereum","Tokenization"],"authors":["Sead Fadilpašić"]}