{"summary":"Steve Wozniak Labels Bitcoin ‘Safe, Stable, and Conservative’ Amid Growing Legacy Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/steve-wozniak-labels-bitcoin-safe-stable-and-conservative-amid-growing-legacy-adoption.htm","publishDate":"2024-02-06T21:42:08","id":18453,"type":null,"title":"Steve Wozniak Labels Bitcoin ‘Safe, Stable, and Conservative’ Amid Growing Legacy Adoption","category":["Blockchain News "],"content":["In line with the rising trend of the legacy tech and finance industries’ adoption of the top cryptocurrency, Apple co-founder Steve Wozniak labeled Bitcoin as a safe bet in a February 6 podcast.","Speaking in the Wildride podcast posted on X (formerly Twitter), the Apple co-founder echoed sentiments shared by several other industry leaders, praising the crypto asset’s stability and reliability.","The tech mogul said Bitcoin stands out from other crypto assets as it is the ‘big elephant on the block.’ He also noted that unlike other blockchain-based assets, such as non-fungible tokens (NFTs), whose value is largely influenced by mass appeal, Bitcoin was ‘safe, stable, and conservative.’","Wozniak predicted that the major cryptocurrency could hit $100,000 soon.","Apple co-founder Steve Wozniak says,\n\"#Bitcoin is safe, stable, and conservative”pic.twitter.com\/BcRDYG8L3d","— Documenting ₿itcoin 📄 (@DocumentingBTC) February 6, 2024","","According to the Apple co-founder, this is principally based on the growing adoption of crypto in which Bitcoin controls more than half of the developing ecosystem.","Wozniak also pointed out that Bitcoin’s stability makes it a ‘safe-haven’ for investors interested in digitally storing value. When asked whether he owned Bitcoin assets, he admitted buying some digital currency earlier.","He said the purchase was solely for experimenting with its use case. Its subsequent rise to fame led him to sell his BTC stash due to his mental health, however.","Bitcoin captured widespread attention last month, primarily attributed to the January 11 approval of spot Bitcoin exchange-traded fund (ETF) filings by the US Securities and Exchange Commission (SEC).","According to CoinShares, total inflows for digital asset investment products have exceeded $7.7 billion thus far. Bitcoin has continued to lead the pack, with $703 million in inflows recorded last week alone, a trend that has become customary.","🟢 Digital asset investment products saw large inflows totalling US$708m last week!","📈 This brings year-to-date inflows to US$1.6bn and total global assets under management to US$53bn.","📉 Trading volumes in ETPs fell to US$8.2bn (compared to US$10.6bn the prior week), but… pic.twitter.com\/phsy5zjnTf","— CoinShares (@CoinSharesCo) February 5, 2024","","Other crypto assets like Solana averaged $13 million in total inflows last week, while Ethereum and Avalanche pulled in $6.4 million and $1.3 million, respectively.","The underlying idea behind Bitcoin’s creation in 2009 was to become the default means of transferring value.","The digital asset’s permissionless nature meant that centralized entities like banks and other legacy institutions could not control or authorize the movement of assets, as no intermediary was involved.","While many believe this might be possible in the long run, Wozniak clearly offered a contrary opinion. According to him, Bitcoin cannot outrightly usurp state-backed fiat currencies.","He explained that this is because fiat currency has been crucial throughout history. Instead of replacing fiat entirely, Bitcoin can coexist alongside it as a secondary means of value exchange.","Wozniak’s views align with many industry experts who believe Bitcoin can become a secondary value exchange medium. A few, like MicroStrategy’s Michael Saylor, however, have encouraged people to ditch fiat and keep value solely in Bitcoin.","If you're not worried, you don't need #Bitcoin.pic.twitter.com\/a6TDQALaEc","— Michael Saylor⚡️ (@saylor) February 5, 2024","","Sharing a post on X, Saylor wrote, “If you’re not worried, you don’t need Bitcoin” on a video showing Federal Reserve Chair Jerome Powell revealing his worries about the United State’s debt profile."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"February 6, 2024","content":"DATE"},{"type":"US$8.2","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"$1.3 million","content":"MONEY"},{"type":"January 11","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US$53bn","content":"MONEY"},{"type":"Wozniak","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"},{"type":"United State","content":"ORGANIZATION"},{"type":"Steve Wozniak","content":"PERSON"},{"type":"$703 million","content":"MONEY"},{"type":"February 5, 2024","content":"DATE"},{"type":"2009","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"February 6","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"$6.4 million","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"$7.7 billion","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Apple","Bitcoin ETF","state-backed fiat"],"authors":["Jimmy Aki"]}