{"summary":"Do Kwon Wins Appeal as Montenegro Court Overturns Extradition","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/do-kwon-wins-appeal-as-montenegro-court-overturns-extradition.htm","publishDate":"2024-02-08T17:13:33","id":18464,"type":null,"title":"Do Kwon Wins Appeal as Montenegro Court Overturns Extradition","category":["Blockchain News "],"content":["The Montenegro Court of Appeal has set aside the decision to extradite the co-founder of Terraform Labs Do Kwon saying the original order was “affected by significant violations.” ","The court decided to revoke the extradition after hearing Kwon’s appeal in a session on Feb 7, per an official court statement on the matter.","Do Kwon was initially slated for extradition following a ruling by the High Court of Podgorica in December. He was arrested for forged documentation.","The decision was appealed by Do Kwon’s legal team weeks after the judgment with the embattled former CEO allowed to stay in the country pending the determination of the suit.","Do Kwon Granted Appeal By Montenegro Court, Extradition Revoked","— Fofty Pawlow (@FoftyPawlow) February 8, 2024","","According to court documents, the extradition was set aside on several grounds including the fact that it was made amid significant violations of criminal procedure.","“because the wording of the decision is incomprehensible, the decisions have no reason for decisive facts, and the reasons given are unclear,” the document reads.","Furthermore, the judgement of the High Court ignored the proper order of extradition adding that South Korea was first to seek such an order before another country.","This decision returns the case for retrial in the High Court and allows Do Kwon to remain in the country as extradition requests from South Korea and the United States increase.","In December, the Wall Street Journal, citing sources familiar with the matter, reported that plans were in motion to extradite Do Kwon to the United States rather than South Korea.","South Korea has maintained a position as the best country to bring justice to Do Kwon and his alleged accomplices, adding that he might face a longer sentence in the country if found guilty.","This week, Han Chang-joon the former Chief Financial Officer of Terraform Labs was extradited to South Korea by the Montenegrin police.","“J.C.H was today handed over to the competent judicial and police authorities of South Korea by NCB Interpol Podgorica officers and the Special Police Unit, for the purpose of conducting criminal proceedings for several criminal offenses related to fraud.”","Chang-joon was arrested alongside Do Kwon in the country and sentenced to four months of jail time for falsifying documents following a global manhunt for Do Kwon.","This marks another major point in Do Kwon’s case. Kwon and several others are accused of bad policies that led to the collapse of the Terra Network in 2022 wiping out billions from the market.","Terra’s stablecoin fiasco led to heightened regulatory pressure on the wider market across multiple jurisdictions, leading to bottleneck regulations throughout the bear market."],"entity":[{"type":"Han Chang","content":"PERSON"},{"type":"Montenegro Court of Appeal","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Special Police Unit","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"NCB Interpol Podgorica","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"Terra Network","content":"ORGANIZATION"},{"type":"February 8, 2024","content":"DATE"},{"type":"High Court","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Chief Financial Officer of Terraform Labs","content":"ORGANIZATION"},{"type":"High Court of Podgorica","content":"ORGANIZATION"},{"type":"Kwon Granted Appeal By Montenegro Court","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Chang","content":"PERSON"}],"hashtag":["Appeal","Do Kwon","Extradition"],"authors":["David Pokima"]}