{"summary":"Verida to Transform Digital Privacy Through Partnerships and Technology: Interview with Chris Were","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/verida-to-transform-digital-privacy-through-partnerships-and-technology-interview-with-chris-were.htm","publishDate":"2023-12-25T05:23:29","id":18469,"type":null,"title":"Verida to Transform Digital Privacy Through Partnerships and Technology: Interview with Chris Were","category":["Blockchain News "],"content":["Decentralized digital identity provider, Verida has rolled out several products and features including its recent partnership with zkPass, a private data protocol to secure user identity while verifying their identities on websites.","In an exclusive interview with Cryptonews, Chris Were, the CEO and co-founder of Verida explained the recent partnerships to secure user privacy, the roadmap and drive of the company amid the desire of users to control their data.","The partnership with zkPass helps users verify their identity on government and private websites without compromising privacy. This could mean verification of financials and credit facilities on several institutions, social platforms, and more.","📢 We're thrilled to announce an exciting collaboration between @Verida_io and @zkPass to bring us towards a future where users have control over their personal information.","1\/9 pic.twitter.com\/E5OCAHCfUL","— Verida 💜 (@Verida_io) November 28, 2023","","Use cases on the zero-knowledge proof set could extend to citizens verifying credentials on government platforms like citizenship or residency over a certain period and verifying that they possess a stipulated amount of money in a bank.","“The magic happens directly on the user’s local device, where zkPass generates verifiable proofs. Once a proof is created, it is seamlessly sent to the user’s Verida Wallet, ensuring a secure and private storage solution on the Verida Network. The proof, represented as a Polygon ID zero-knowledge proof, can then be leveraged both on and off-chain.”","After the announcement of the partnership, some users on social media spaces described the platform as the new stage of digital authentication which is essential to the firm’s short-term growth.","Verida’s objective over the next five years is to integrate new technologies to improve user experience and provide decentralized data storage infrastructure to support its development, Were added.","The main aim of setting this in motion is to help users handle their data and identity while interacting with multiple products and services. According to the chief executive, the Verida wallet integrates use cases and technologies into a single application incorporating data protection computation and multiple marketplace algorithms.","Advocating for users’ access to their data and proper off-chain storage, a challenge for a user becomes creating data structures to represent all sets, a problem it seeks to solve with partnerships and its wallet.","This year, users showed significant interest in data privacy, especially as countries ramped up the development of Central Bank Digital Currencies (CBDCs).","Were stated that while Zkproof technology is in its early stages, a lot of progress has been recorded for innovation to solve real-life cases adding that the tech technology enjoys a level of public acceptance but due to its complexity, there’s a need for more user education in the sector.","For the company’s technology updates and roadmap, it deployed videos for all levels of users especially entry-level content for beginners including mission campaigns to bridge the gap between customers.","The level of public scrutiny on the current CBDC models concerning user privacy became mainstream in recent months as European data agencies flagged potential data breaches and other factors.","Although authorities have dismissed these fears stressing implementing models that will secure user data across all platforms, fears still echo in several jurisdictions.","According to Were, a balance must be struck between private transactions and users while being a regulatory complaint. He pitched an EVM-compatible blockchain as a solution considering technology integration and interoperability.","“Interacting with a smart contract or conducting a financial transaction with a real-world business typically requires citizens to provide some type of identification or personal data. Here it’s critical that the underlying infrastructure supporting a CBDC also caters for the appropriate transfer of user data to meet these business requirements.” ","Verida is collaborating with Redbelly Network including other tools to ensure a smooth transition to a privacy-endured CBDC economy."],"entity":[{"type":"Redbelly Network","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"Chris Were","content":"PERSON"},{"type":"November 28, 2023","content":"DATE"},{"type":"Verida Network","content":"LOCATION"},{"type":"Verida","content":"LOCATION"},{"type":"Verida","content":"PERSON"}],"hashtag":["Privacy","Verida","zkproof"],"authors":["David Pokima"]}