{"summary":"Bitcoin Goes Sidechain and Becomes More Liquid","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-goes-sidechain-and-becomes-more-liquid-2754.htm","publishDate":"2018-10-11T11:11:00","id":18465,"type":null,"title":"Bitcoin Goes Sidechain and Becomes More Liquid","category":["Bitcoin News "],"content":["It looks like Bitcoin just reached another important milestone on the way to mass adoption. It’s called the Liquid Network and it’s live now.","This is a sidechain built on the Bitcoin network by San Francisco startup Blockstream. A sidechain is a separate blockchain that is linked to the main blockchain through what is referred to as two-way pegging, which enables digital assets to be interchangeable between the two chains without jeopardizing their performance or speed.","“The Liquid Network provides fast, secure, and confidential transactions to address the needs of exchanges, brokers, market makers, and financial institutions around the world,” Blockstream CSO Samson Mow said in a blog post.","According to him, the launch of the network after three years of development marks “the beginning of a new era of digital asset issuance and transacting by enabling the tokenization of fiat, gold, securities, and even other new crypto assets – all with Bitcoin at the center.”","The startup claims that Liquid has these benefits:","However, the biggest problem most bitcoin fans have with Liquid is that it is a “federated sidechain,” relying on a group of companies to collectively manage the sidechain, making it centralized. “Following a federated consensus approach was the easiest way to deploy Liquid, but its consensus could change in the future,” tweeted Lucas Nuzzi, bitcoin researcher.","Moreover, the startup claims that “no single party, including Blockstream, can control the Liquid network, and furthermore, no single entity is in control of more than a single Liquid functionary server.”","Other than just facilitating faster trade, Liquid lets partners launch tokens on the platform, representing financial instruments, fiat currencies or crypto assets. The startup even claims that the sidechain works better than the smart contract blockchain Ethereum for launching tokens. Additionally, Blockstream will be deploying a wallet specifically for Liquid transactions, while hardware wallets Ledger and Trezor have unveiled plans to adopt the technology as well. Also, there is an undisclosed monthly subscription fee for users of this new network.","The sidechain has become another important development for Bitcoin alongside the Lightning Network. In comparison, while the Liquid sidechain is purpose-built to cater for the needs of exchanges, brokers and traders, the the Lightning Network is designed to enable the near-instant transfer of small or micro value payments between linked channel members and merchants.","Meanwhile, there is always that part of the community that doesn’t care about the technology too much. Twitter user WhalePanda, a famous crypto enthusiast, ironically tweeted referring to the recent drop in the market:",""],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Blockstream","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Blockstream CSO Samson Mow","content":"ORGANIZATION"},{"type":"Lucas Nuzzi","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Liquid Network","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","Blockstream","Technology"],"authors":["Sead Fadilpašić"]}