{"summary":"GameStop Decides to Shut Down NFT Wallet Citing Regulatory Uncertainty","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gamestop-decides-shut-down-nft-wallet-citing-regulatory-uncertainty.htm","publishDate":"2023-08-02T16:09:00","id":18461,"type":null,"title":"GameStop Decides to Shut Down NFT Wallet Citing Regulatory Uncertainty","category":["News "],"content":["Popular video game retailer GameStop has announced plans to shut down its NFT wallet due to regulatory uncertainty in the crypto space. ","According to a pop-up message on its NFT marketplace, GameStop would cease support for the wallet starting November 1. ","“Due to the regulatory uncertainty of the crypto space, GameStop has decided to remove its iOS and Chrome Extension wallets from the market on November 1, 2023,” the pop-up message reads. ","The video game retailer asked customers to make sure they have access to their Secret Passphrase by October. ","“Any customer with access to their Secret Passphrase has the ability to recover their account in any compatible wallet,” the company added.","The move marks a U-turn in GameStop’s plans to support crypto games and launch its own marketplace. ","The development also comes shortly after the video game retailer fired CEO Matt Furlong, who had been in charge during the launch of the wallet and marketplace. ","Furlong had previously said that GameStop was distancing itself from NFTs and crypto, stating during an earnings call in December 2022 that the company would not risk significant shareholder capital in the crypto industry.","GameStop’s decision to shut down its NFT wallet is another sign of its shifting focus away from the digital assets space.","The company has faced several rounds of layoffs in recent years as the video game industry moves toward digital delivery. ","It is worth noting that GameStop still operates over 4,400 physical stores worldwide and remains a significant player in the video game industry. ","The regulatory uncertainty cited by GameStop is a familiar explanation for the drawdown or cancellation of digital assets initiatives.","The company’s decision reflects recent developments in the crypto industry, particularly the increase in enforcement actions by the United States Securities and Exchange Commission (SEC) under the leadership of Chair Gary Gensler. ","Back in June, the commission sued both Binance, the world’s largest cryptocurrency exchange, and Coinbase, the largest US-based cryptocurrency exchange. ","The SEC has also taken enforcement action against crypto exchanges Kraken and Bittrex, as well as crypto lending platform Nexo so far this year. ","More recently, Gensler voiced concern regarding the prevalence of fraud in the crypto market, claiming that there are “far too many” bad actors. ","He said that crypto investors should not assume that they are getting the protections of the securities laws even as these laws apply to many of the cryptocurrencies. ","“US investors are not getting full, fair, and truthful disclosures. And the platforms, the intermediaries are doing things that we would never allow or think the New York Stock or Nasdaq would do.”"," "," "],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"November 1","content":"DATE"},{"type":"Matt Furlong","content":"PERSON"},{"type":"New York Stock","content":"ORGANIZATION"},{"type":"November 1, 2023","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["NFT","NFTs","Regulation"],"authors":["Ruholamin Haqshanas"]}