{"summary":"In what’s looking like a relatively quiet week for scheduled crypto news, ongoing restructuring hearings are likely to hit the headlines.\nExpect developments for Voyager Digital, Compute North and CoinFlex. ","author":["Andrew Rummer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172705\/week-ahead-biggest-cryptocurrency-stories-sept-25","publishDate":"2022-09-25T07:41:26","id":1847,"type":null,"title":"The week ahead&#x27;s three biggest cryptocurrency stories","category":["Companies"],"content":["In what’s looking like a relatively quiet week for scheduled crypto news, ongoing restructuring hearings are likely to hit the headlines.","The auction of Voyager Digital’s assets is due to conclude on Thursday.","The law firm Kirkland &amp; Ellis has been hosting rounds of bids from interested parties since the crypto lending platform filed for Chapter 11 bankruptcy in July.","Bidders may submit a variety of types of proposals, from a simple purchase of Voyager's assets to an attempted restructuring and resuscitation of the firm. The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/171533\/binance-and-ftx-lead-voyager-auction-wsj\" data-v-f87c67ca=\"\">reported<\/a> last week that exchange giants FTX and Binance are leading the bidding.","Voyager filed for bankruptcy amid a broad crypto market downturn that began in May with the collapse of the Terra blockchain — a market shock that wiped out $40 billion in investor value in a matter of days.","Before that, on Monday, a firm from a totally different part of the crypto industry will hold bankruptcy proceedings of its own.","Compute North, which builds facilities and physical infrastructure for mining firms, <a href=\"https:\/\/www.theblock.co\/post\/172246\/compute-north-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy last week.&nbsp;A hearing to discuss the filing of a list of creditors and the operation of the firm's cash management system is due to take place on Sept. 26.","Compute North has between $100 million and $500 million in both estimated liabilities and estimated assets, according to last week's filing. It provides services for some of the biggest bitcoin mining companies, including Marathon, which recently started energization at a colocated 280-megawatt bitcoin mining facility in West Texas.","Tuesday will see yet more developments at an insolvent crypto firm, this time the Seychelles-based exchange CoinFlex.","Creditors have until Sept. 27 to vote on a <a href=\"https:\/\/www.theblock.co\/post\/171933\/coinflex-reveals-restructuring-proposal\" data-v-f87c67ca=\"\">restructuring proposal<\/a> that will give them ownership of 65% of the company. Voting began at 8 a.m. UTC today and is due to end at 4 a.m. UTC on Tuesday. After about three hours of voting today, tokens representing more than 99% of creditor assets had <a href=\"https:\/\/snapshot.org\/#\/coinflexvote.eth\/proposal\/0x7e28e921369007b8b508d01c04d84a99dcbc5eac6b44cfe01d995ce933401d4e\" data-v-f87c67ca=\"\">agreed<\/a> to the proposed restructuring.","CoinFlex is another victim of this year’s crypto market slump. The exchange suspended withdrawals in June, citing “extreme market conditions and continued uncertainty involving a counterparty.” Several days later, CoinFlex’s CEO accused prominent crypto investor Roger Ver of defaulting on a loan agreement worth $47 million in USDC. Ver, however, denied the accusation, saying he was the one owed money."],"hashtag":[]}