{"summary":"The developers at Polygon PoS blockchain have proposed to launch a network hard fork on Jan. 17.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201554\/polygon-eyes-a-hard-fork-in-january-to-address-reorgs-and-gas-fee-issues-exclusive","publishDate":"2023-01-12T11:30:24","id":1847,"type":null,"title":"Polygon eyes hard fork in January to address reorgs and gas fee spikes: Exclusive","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The developers at Polygon PoS blockchain proposed the launch of a hard fork software upgrade to address gas spikes and enhance the security of blocks on the sidechain network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The upgrade, proposed by the developers at Polygon Labs, is planned to take place on Jan. 17, according to a note shared with The Block. If approved by the community, the hard fork will aim to reduce the impact of transaction fee spikes and chain reorganizations, thereby claiming to improve Polygon's performance and security. The upgrade has been <a href=\"https:\/\/forum.polygon.technology\/t\/pre-pip-discussion-addressing-reorgs-and-gas-spikes\/10623\/25\" data-v-f87c67ca=\"\">discussed<\/a> by the Polygon community for some time on the governance forum.<\/span>","<span data-v-f87c67ca=\"\">The upgrade is part of a broader initiative to improve the technical capabilities of the Polygon side chain, including parallelization and Polygon zkEVM. <\/span><span data-v-f87c67ca=\"\">Polygon PoS runs parallel to Ethereum and hosts some of the biggest Web3 projects like Uniswap and Aave as well as major companies like Robinhood, Adobe and Stripe.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The first goal of the hard fork is to make Polygon more secure against reorganization. A chain reorganization, also known as a \"<a href=\"https:\/\/forum.polygon.technology\/t\/investigating-reorg-and-rpc-issues-on-polygon-pos\/2190\" data-v-f87c67ca=\"\">reorg<\/a>,\" occurs when a new version of the blockchain is temporarily created by diverging from the previous version. The Polygon PoS chain is prone to reorgs, when blocks may overwrite previous ones due to different nodes reaching consensus at different times. This can lead to confusion when trying to verify if a transaction has been completed successfully or not.<\/span>","<span data-v-f87c67ca=\"\">To address this issue, developers plan to implement measures to help reduce the amount of time it takes for block finality with regards to verifying successful transactions. <\/span><span data-v-f87c67ca=\"\">The upgrade proposes to decrease the sprint length that will lower the chances of a secondary or tertiary validator kicking in to produce blocks, resulting in fewer reorgs overall. <\/span>","<span data-v-f87c67ca=\"\">In the context of the Polygon PoS chain, a sprint length refers to the number of blocks that a validator can produce consecutively. By reducing the sprint length to 16 blocks from 64, it means that a single block producer will be able to produce blocks continuously for a shorter period of time (approximately 32 seconds, as opposed to the current 128 seconds), which developers said should reduce reorgs on the chain.<\/span>","<span data-v-f87c67ca=\"\">The upgrade will reduce the severity of gas spikes by changing the \"BaseFeeChangeDenominator\" to 16 from 8 to smooth out the rate of change of the base fee. <\/span><span data-v-f87c67ca=\"\">BaseFeeChangeDenominator is a parameter that inversely determines the rate at which the base fee for a transaction changes, depending on the current demand for block space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The current value of BaseFeeChangeDenominator on Polygon is 8, and the proposal is to change it to 16. The goal of this change is to smooth out the rate of change of the base fee, reducing severe fluctuations in gas prices during high demand periods on the Polygon network.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jan. 17","content":"DATE"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"sprint","content":"ORGANIZATION"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}