{"summary":"Senator Cynthia Lummis Slams SEC for its “Ruling by Enforcement” Approach Following Kraken Lawsuit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/senator-cynthia-lummis-slams-sec-for-its-ruling-by-enforcement-approach-following-kraken-lawsuit.htm","publishDate":"2023-11-21T08:20:09","id":18470,"type":null,"title":"Senator Cynthia Lummis Slams SEC for its “Ruling by Enforcement” Approach Following Kraken Lawsuit","category":["Altcoin News "],"content":["Senator Cynthia Lummis has criticized the Securities and Exchange Commission (SEC) for its current approach to cryptocurrency regulation.","In a recent post on X (formerly Twitter), the senator accused the agency of relying on a “ruling by enforcement” strategy, highlighting that crypto asset companies seeking guidance from the SEC often face enforcement actions that lack clear justification and ultimately harm consumers.","“The SEC cannot continue ruling by enforcement. Crypto asset companies have repeatedly tried to get guidance from the SEC only to be hit with enforcement actions, causing unnecessary harm to consumers,” she said. ","Lummis added that it is Congress’s responsibility to develop a comprehensive regulatory framework that provides clarity on what constitutes a security and what qualifies as a commodity in the crypto industry.","The SEC cannot continue ruling by enforcement. My statement on the Kraken lawsuit below: pic.twitter.com\/J3qhzU624N","— Senator Cynthia Lummis (@SenLummis) November 21, 2023","","Lummis’s remarks come in the wake of a recent lawsuit filed by the SEC against popular cryptocurrency exchange Kraken. ","The federal regulator alleged that Kraken operated as an unregistered broker, clearing agency, and dealer while commingling customer and corporate funds. ","According to the SEC, this violated federal securities laws and created significant risks for customers, with up to $33 billion in customer crypto assets mixed with the exchange’s own corporate assets.","“Similarly, Kraken has held at times more than $5 billion worth of its customers’ cash, and it also commingles some of its customers’ cash with some of its own,” the suit said. ","“In fact, Kraken has at times paid operational expenses directly from bank accounts that hold customer cash.”","The SEC’s lawsuit against Kraken follows similar actions taken against other crypto trading platforms, including Binance and Coinbase. ","The agency seeks a permanent ban on Kraken operating as an unregistered exchange, along with fines and the return of any ill-gotten gains. ","The latest comments from Senator Lummis come as she has been a vocal critic of the SEC. ","Just earlier this month, she expressed her concerns about the regulatory agency’s actions and vowed to block one of its controversial new crypto policies.","“I think the SEC is overreaching,” she said.","The SEC has been pursuing aggressive measures, including lawsuits against major players like Coinbase and Binance.","One particular policy issued by the SEC in March 2022, known as “Staff Accounting Bulletin 121,” has caught Lummis’ attention.","The policy requires financial firms holding customers’ crypto assets to include them on their balance sheets while also warning investors about the risks involved in safeguarding those assets.","Lummis is actively working on multiple fronts to provide the crypto industry with more regulatory clarity in Washington.","She has co-sponsored a comprehensive piece of crypto legislation with Senator Kirsten Gillibrand (D-N.Y.), which aims to outline the sector’s regulatory framework.","In recent weeks, a portion of Lummis’ bill addressing terrorist financing was included in the Senate’s defense spending package, known as the National Defense Authorization Act.","The senator has also expressed support for the House Financial Services Committee’s crypto framework, led by Committee Chair Patrick McHenry (R-N.C.)."],"entity":[{"type":"N.Y.","content":"LOCATION"},{"type":"earlier this month","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Committee Chair Patrick McHenry (R-N.C","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$33 billion","content":"MONEY"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"November 21, 2023","content":"DATE"},{"type":"National Defense","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Kraken","Securities and Exchange Commission"],"authors":["Ruholamin Haqshanas"]}