{"summary":"South Korean Crypto Exchange Bithumb Still Aiming for IPO Despite ‘Deep’ Troubles","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-crypto-exchange-bithumb-still-aiming-for-ipo-despite-deep-troubles.htm","publishDate":"2023-11-16T05:00:57","id":18478,"type":null,"title":"South Korean Crypto Exchange Bithumb Still Aiming for IPO Despite ‘Deep’ Troubles","category":["Blockchain News "],"content":["The South Korean crypto exchange Bithumb has effectively confirmed reports that it is hoping to launch an initial public offering (IPO), but may be hampered by financial issues and ongoing legal problems.","Per the South Korean media outlets Economist and Decenter, Bithumb wants to become the first crypto exchange in the nation to go public.","A Bithumb official confirmed the firm’s interest in launching an IPO, stating:","“This IPO will help us to increase transparency and allow us to have our internal control operations verified externally.”","Rumors of rival trading platform Upbit and its operator Dunamu launching an IPO on the New York Stock Exchange circulated in 2021.","However, talk on this front has cooled quickly following the onset of a long crypto winter.","But Bithumb is reportedly hoping to gazump its rival by floating on the Korea Stock Exchange.","The media outlet noted that Bithumb selected Samsung Securities as its underwriter “at the end of last month” and has already “begun” its “IPO work.”","The media outlet claimed that the company is yet to determine an exact listing timeline or fix a target corporate value.","But the firm reportedly hopes to complete its listing by “the second half of 2025.”","And the exchange is reportedly “also considering the possibility” of changing its listing “to the KOSPI market in the future.”","The KOSPI (Korea Composite Stock Price Index) is the nation’s equivalent to the United States’ S&P 500 index.","However, the IPO news arguably could not have come at a worse time for Bithumb.","Decenter also reported that Bithumb posted operating losses of almost half a million USD in the third quarter of the financial year.","Sales also fell by more than 53% compared to the same period last year, with the firm posting a deficit for two consecutive quarters.","The firm’s executives and suspected owners have also been dogged with legal issues.","Lee Sang-jun, the CEO of Bithumb Holdings, has been embroiled in a coin listing controversy that also involves a famous golf star.","The company was also rocked by a controversial failed takeover that also involved a hotly disputed token listing-related controversy.","Lee has recently resigned from the firm’s board of directors, as part of a greater Bithumb boardroom reshuffle.","Lee has recently been acquitted of fraud charges, but his case has now progressed to the High Court.","Question marks also remain over the firm’s complicated ownership model.","Claims that a shadowy businessman named Kang Jong-hyun is the “true” owner of Bithumb have rocked the exchange.","Kang is also currently being tried on charges of breach of trust, embezzlement, and stock market manipulation.","Unnamed industry insiders said Bithumb sees an IPO as “a strategy” that would help it “secure public trust” and “reduce the gap” between itself and Upbit.","Upbit has cornered over 80% of the domestic crypto market, with Bithumb accounting for some 15%.","“Accordingly,” Economist wrote, “Bithumb has recently taken extreme measures to increase transaction volume and expand market share.”","These include a “0% commission policy” aimed at making transaction prices more competitive.","Journalist Lee Seung-hoon wrote:","“It will not be easy [for Bithumb] to catch up with Upbit. […] It is thought that the nature of Bithumb’s sales structure, which mostly revolves around transaction fees, may cause profitability to take a back seat.”","Industry insiders argued that it was “urgent” that Bithumb improves its “management structure” and “boosts transparency for a successful IPO.”","Legal experts pointed out another potential wrinkle as parliamentarians look to impose new IPO regulations.","These draft regulations could see stock market officials given the power to examine the criminal records of not only IPO candidate firms’ CEOs and executives, but also owners and anyone with over a 10% stake in the firm in question."],"entity":[{"type":"Lee Seung","content":"PERSON"},{"type":"Bithumb Holdings","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"53%","content":"PERCENT"},{"type":"High Court","content":"ORGANIZATION"},{"type":"Kang Jong","content":"PERSON"},{"type":"Bithumb","content":"PERSON"},{"type":"Bithumb","content":"ORGANIZATION"},{"type":"Korea Stock Exchange","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"South Korean crypto exchange Bithumb","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"second half of 2025","content":"DATE"},{"type":"Upbit","content":"ORGANIZATION"},{"type":"Samsung Securities","content":"ORGANIZATION"},{"type":"United States’ S&P","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"0%","content":"PERCENT"}],"hashtag":["Bithumb","South Korea"],"authors":["Tim Alper"]}