{"summary":"AI Tokens to Democratize Access To Artificial Intelligence Models","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ai-tokens-to-democratize-access-to-artificial-intelligence-models.htm","publishDate":"2024-03-02T00:25:16","id":18480,"type":null,"title":"AI Tokens to Democratize Access To Artificial Intelligence Models","category":["Altcoin News "],"content":["Artificial Intelligence (AI) is set to be one of the most transformative technologies of the century. A new report from ResearchAndMarket.com projects the global AI Market is expected to be valued at around $1,057.47 billion by 2030.","Unsurprisingly, this potential has fueled immense growth in AI-related stocks, including microchip giant Nvidia, whose shares have soared by nearly 1,900% over the past five years.","Nvidia $NVDA just closed the trading day above a $2 Trillion market cap for the first time in its history pic.twitter.com\/FHGIa5E0TP","— Evan (@StockMKTNewz) March 1, 2024","","Despite these advancements, industry experts have pointed out that AI continues to behighly centralized, with an extremely complex underlying infrastructure.","Dan Thomson, CEO and Founder of Sensay – a blockchain-based AI project – told Cryptonews that the current AI landscape is marked by high entry barriers, including the need for substantial computational resources, specialized knowledge, and data privacy concerns.","“These challenges limit the ability of individuals and smaller entities to leverage AI technology,” he said. “Moreover, the concentration of AI development in the hands of a few major corporations raises concerns about monopoly, bias, and lack of diversity in AI applications.”","Thomson explained that decentralized AI solutions that incorporate cryptocurrency are needed to solve these challenges.","“AI tokens present a pathway to democratize access to AI technology, fostering innovation and inclusivity in its development and application,” said Thomson.","According to Thomson, AI tokens are assets that are tied to AI services or platforms. He said these cryptocurrencies are often used to facilitate transactions, access services, or incentivize behaviors within AI-driven ecosystems.","To put this in perspective, Thomson explained that Sensay’s AI token will allow users to access the Sensay platform, pay for services, and act as incentivization mechanisms to further the development of Sensay’s AI models.","Thomson noted that Sensay is using blockchain technology with an AI data layer to create human-like replicas to help dementia and terminally ill people.","“This offers a deeply personal and therapeutic tool for those facing challenging conditions,” he said. “We then aim to expand our technology to enable individuals, especially those with significant social media audiences, to monetize their digital presence effectively.”","Unlike centralized AI models, Thomson explained that Sensay token holders will have a say in the future development directions of the platform.","“The token is a means of accruing value from both interacting with Sensay replicas and enabling the replicas to act on your behalf and benefit from their productivity,” said Thomson. “The Sensay ecosystem is democratically driven and community-focused.”","John Arrow, Co-Founder of FreedomGPT – an app store for artificial intelligence projects – told Cryptonews that AI tokens also act as utility tokens to reward users for advancing AI ecosystems.","“This could range from activities like incentivizing users to provide Real Life Human Feedback (RLHF) for a new LLM, to rewarding users who make their computer available for running AI inference,” said Arrow.","He elaborated that FreedomGPT’s token – known as the “freedom network token” – will help the platform run on a completely decentralized computing network.","“FreedomGPT previously had its centralized web hosting canceled due to some of our AI models giving unbiased answers,” said Arrow.","To solve this challenge, Arrow noted that FreedomGPT needed to establish an entirely decentralized computing network that pays users for their computing power with a token. He shared that there are already 2 million users leveraging FreedomGPT and that the platform has reached over 7 million desktop downloads.","“These millions of machines contain a lot of computing power, so the freedom network token allows users to be paid for letting us access that power for the decentralized network. We use the token to reward those node operators,” Arrow explained.","He added that FreedomGPT chose to use a cryptocurrency rather than fiat to reward users in order to ensure anonymity.","“Also, most of our node providers are in other countries, so crypto makes it easier to do these micro-transactions,” he added.","As AI projects increase in popularity, Arrow believes that more AI tokens will come into development.","“It’s our prediction that as AI continues to advance, the traditional finance ecosystem will be pressured into allowing payments for most censor-free and private AI companies,” he said.","In the meantime, some crypto exchanges are reporting noteworthy increases in trading volume for AI tokens.","For example, Bitget reported a 361% increase in weekly trading volume for its listed AI tokens, along with a 136% increase in the number of participants.","OpenAI CEO Sam Altman’s Worldcoin (WLD) has also seen impressive gains over the past month. However, WLD also quickly decreased following wider market trends among AI tokens.","Greg Osuri, Founder and CEO of Akash Network –a decentralized compute marketplace – told Cryptonews that AI tokens with fundamental utility will likely grow the fastest in terms of adoption and usage.","Echoing this, Thomson noted that he believes there is a lot of synergy between AI and blockchain technology.","“It seems logical for fast, cheap transactions to enable AI to achieve its goals faster and easier with a global transactional layer, and therefore AI projects can easily be represented by tokens, or linked to a token’s value,” he said.","Given this, Thomson also envisions a future where AI tokens facilitate decentralized AI markets, enabling all individuals and businesses to buy, sell, or trade AI services and data securely and transparently.","“I expect AI tokens to evolve and move faster than any other type of token currently available in the market,” he said. “The landscape will change so fast in the coming months that I don’t even think the top five AI tokens in the market today will still be in the top five in a year.”","Yet Arrow pointed out that in order for AI tokens to fully evolve, these models will likely have to replace the economic role of advertisers.","“Right now if you are using a service for free it’s because someone is trying to sell you something,” he said.","Moreover, regulatory concerns around AI and crypto projects may hamper adoption. Most recently, United States Senator Elizabeth Warren emphasized the need for a legal “level playing field” in the cryptocurrency and AI industries.","However, as more users express concerns about current AI models, Arrow noted there is a good chance that AI tokens will eventually provide a mechanism to pay for AI services without compromising the privacy or objectivity of certain AI models."],"entity":[{"type":"Thomson","content":"ORGANIZATION"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"136%","content":"PERCENT"},{"type":"1,900%","content":"PERCENT"},{"type":"John Arrow","content":"PERSON"},{"type":"361%","content":"PERCENT"},{"type":"Dan Thomson","content":"PERSON"},{"type":"Evan (","content":"PERSON"},{"type":"Greg Osuri","content":"PERSON"},{"type":"$1,057.47 billion","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Sensay","content":"PERSON"},{"type":"$2 Trillion","content":"MONEY"},{"type":"March 1, 2024","content":"DATE"},{"type":"Nvidia $NVDA","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Sam Altman’s Worldcoin","content":"PERSON"}],"hashtag":["AI token","Artificial Intelligence","Decentralization"],"authors":["Rachel Wolfson"]}