{"summary":"Ethereum Merge Could Trigger Surge of interest in Staking and Entice Institutional Buyers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-merge-could-trigger-surge-of-interest-staking-entice-institutional-buyers.htm","publishDate":"2022-09-08T11:45:00","id":18488,"type":null,"title":"Ethereum Merge Could Trigger Surge of interest in Staking and Entice Institutional Buyers","category":["Ethereum News "],"content":["Ethereum is in the final stages of preparations to switch from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS). This event, which is referred to as the Merge, is expected to have several benefits for Ether (ETH) – the native token of the Ethereum blockchain. ","According to a Chainalysis report, one of these benefits is that the Merge could trigger renewed interest in Ether (ETH) staking. This builds up on the fact that ETH staking is already highly popular. Over USD 30bn worth of ETH is already staked in Ethereum 2, making it the biggest blockchain by staked volume even before moving to PoS. ","When PoS is introduced fully, staking is expected to become more attractive as users across the entire Ethereum ecosystem become more comfortable with leaving PoW behind and embracing the more environmentally friendly PoS. ","Additionally, upgrades expected after the merge will enable stakers to withdraw their staked ETH at will as opposed to having to lock up their assets. This, in addition to an expected APY of 10-15%, will mean more liquidity for stakers. ","These prospects, especially the climate impact reduction and anticipated return on investment from staking, are also expected to attract institutional investors according to the blockchain analytics services provider. On-chain data already indicates that institutional buyers (wallets staking more than $1 million worth of ETH) have been increasing steadily. ","“Taken together, these changes, starting with The Merge, should make Ether a more attractive asset to hold, and therefore to stake as well… In addition to increased staking overall, we’ll also be on the lookout for institutional investors specifically to begin or ramp up their Ethereum staking activity,” the report said. ","While these benefits are expected, the crypto community is also wary of the risks that the Merge could throw up for ETH. The possibility of a miners’ rebellion that could lead to a split of the Ethereum blockchain, as well as the fact that dApps that hold more than $50 billion in users’ funds could be in danger if the merge goes wrong are some of the risks that have been talked off. ","However, Joe Lubin, a co-founder of Ethereum and the founder of the blockchain company Consensys, has downplayed these risks. Speaking with Time, Lubin said that even if a hardfork happens it will only be temporary and that he expects the upgrade to go through without a glitch. ","“I think at least a temporary fork is likely: there’s an opportunity to make a quick Ether, and there are a lot of opportunists out there. But I can’t imagine wanting to build anything, or put anything of significant value, on a chain that has so many things that are fundamentally broken and abandoned,” Lubin told the magazine. ","The merge, which has kicked off with the Bellatrix upgrade, is expected to be fully complete between September 13 and September 15, 2022. "],"entity":[{"type":"Bellatrix","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"September 13","content":"DATE"},{"type":"Time","content":"ORGANIZATION"},{"type":"Joe Lubin","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Lubin","content":"PERSON"},{"type":"$50 billion","content":"MONEY"},{"type":"September 15, 2022","content":"DATE"}],"hashtag":["Ethereum","Mining","Proof-of-stake","Proof-of-work"],"authors":["Ruholamin Haqshanas"]}