{"summary":"Cardano exchanges MinSwap and MuesliSwap will support the upcoming Djed stablecoin.\nDjed is a crypto-backed stablecoin developed by Coti, in collaboration with Cardano’s lead developer Input Output.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206107\/cardano-based-exchanges-confirm-djed-listings-ahead-of-stablecoin-launch","publishDate":"2023-01-27T06:27:15","id":1848,"type":null,"title":"Cardano-based exchanges confirm Djed listings ahead of stablecoin launch","category":["Crypto Ecosystems"],"content":["Decentralized exchanges MinSwap and MuesliSwap, both based on the Cardano blockchain, have announced their support for the upcoming Djed stablecoin and its accompanying governance token, Shen. The stablecoin, which is <a href=\"https:\/\/cotinetwork.medium.com\/djed-is-scheduled-to-launch-next-week-b9a4667710c3\" data-v-f87c67ca=\"\">planned<\/a> to go live on the Cardano network next week, will be offered as part of the liquidity pools on these exchanges.","MinSwap, the largest decentralized exchange on Cardano, <a href=\"https:\/\/twitter.com\/MinswapDEX\/status\/1617955612465434624\" data-v-f87c67ca=\"\">revealed<\/a> that Djed and Shen will be paired against the ADA cryptocurrency in a liquidity pool. With over $30 million in liquid tokens locked on the exchange, this presents a significant opportunity for Djed to gain traction in the <a href=\"https:\/\/www.theblock.co\/post\/131070\/inside-the-cardano-ecosystem-with-charles-hoskinson\" data-v-f87c67ca=\"\">Cardano ecosystem<\/a>.","MuesliSwap, another crypto exchange on Cardano, with roughly $6.6 million in value locked, also <a href=\"https:\/\/twitter.com\/MuesliSwapTeam\/status\/1618564415795740672\" data-v-f87c67ca=\"\">announced<\/a> its support for the upcoming stablecoin.","<a href=\"https:\/\/www.theblock.co\/post\/188772\/cardano-based-decentralized-stablecoin-djed-will-hit-mainnet-in-january\" data-v-f87c67ca=\"\">Djed<\/a> has been developed by crypto firm Coti, in collaboration with Cardano's lead developer Input Output. It is designed to be one of the first crypto-backed stablecoin in the Cardano ecosystem, and has been in development for over a year.","Once launched, Cardano users will be able to take ADA, the native cryptocurrency of the Cardano network, and use it as collateral to mint Djed. The stablecoin will be overcollateralized, meaning that it is backed by excess collateral in the form of cryptocurrency held in a reserve. This is a similar design used by <a href=\"https:\/\/www.theblock.co\/post\/85850\/dai-compound-dydx-liquidations-defi\" data-v-f87c67ca=\"\">dai<\/a>, the most popular decentralized stablecoin in the Ethereum ecosystem. Each Djed will require more than 400% in collateral value to be minted."],"hashtag":["DEXS"]}