{"summary":"Crypto Trading Firm Arbelos Markets Raises $28 Million in Oversubscribed Investment Round","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-trading-firm-arbelos-markets-raises-28-million-in-oversubscribed-investment-round.htm","publishDate":"2024-05-08T18:32:58","id":18494,"type":null,"title":"Crypto Trading Firm Arbelos Markets Raises $28 Million in Oversubscribed Investment Round","category":["Altcoin News "],"content":["Crypto principal trading firm Arbelos Markets announced on Wednesday the successful raise of $28 million in an investment round that was significantly oversubscribed.","The company, co-founded by digital asset derivatives veterans Joshua Lim and Shiliang Tang, said the fundraising campaign encompassed seed equity and debt financing, with leading participation from crypto venture capital firm Dragonfly Capital.","A diverse range of investors also joined the round, including investment firms Room40 Ventures, Selini Capital, and Breed VC, as well as corporate partners FalconX, Circle Ventures, Paxos, P2 Ventures (previously Polygon Ventures), Deribit, Chorus One, StarkWare, and Immutable.","Angel investors from Aevo, Cega, Talos, Amberdata, and Framework also contributed to the investment.","","The investment comes at a time when the digital asset industry is recovering from the aftermath of the crypto credit crisis in 2022, which led to the downfall of several companies such as BlockFi, Celsius, and Three Arrows Capital.","As the asset class matures, more sophisticated and traditional players are entering the market, transforming it from its earlier retail-driven beginnings into a market resembling traditional financial markets.","We're seeking partners across the ecosystem who share our enthusiasm for creating new financial products and building towards a sustainable crypto derivatives market – please reach out!","— Arbelos Markets (@Arbelosxyz) May 8, 2024","","Arbelos, headquartered in the British Virgin Islands, seeks to fill the void left by the previous market turmoil, catering to sophisticated investors’ liquidity and hedging requirements through crypto derivatives and options.","Prior to establishing Arbelos in late 2023, Shiliang Tang served as the chief investment officer at quantitative digital asset investment firm LedgerPrime.","Meanwhile, Joshua Lim held positions as head of trading strategy at Galaxy and head of derivatives at the now-defunct crypto lender Genesis, which also succumbed to the credit crisis.","","Lim identified the lack of transparency as a crucial factor contributing to the crypto credit crisis, with some firms presenting outdated or fabricated financial reports, concealing the true risks from their creditors.","Arbelos wants to address the issue through a “transparency engine” that enables clients to independently verify the company’s risk profile, balance sheet, and counterparty exposure in real-time.","“Our key tenet at Arbelos was how we could prevent what happened in the last cycle,” Lim emphasized.","Arbelos actively operates in centralized and on-chain derivatives and options marketplaces as one of the largest options block liquidity providers.","Since its inception, the firm has achieved a derivatives trading volume exceeding $25 billion in notional value within the initial six months.","Crypto venture capital funding has exceeded the $1 billion mark for the second month in a row, highlighting continued investor interest in the industry.","The total amount invested and the number of projects receiving VC funding have greatly increased since Q4 2023.","In total, Web3 startups managed to secure just under $1.9 billion in funding across 346 deals in the first quarter of 2024. "],"entity":[{"type":"Shiliang Tang","content":"PERSON"},{"type":"May 8, 2024","content":"DATE"},{"type":"$25 billion","content":"MONEY"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"Arbelos Markets","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Paxos","content":"LOCATION"},{"type":"Talos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Polygon Ventures)","content":"ORGANIZATION"},{"type":"$28 million","content":"MONEY"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"Deribit","content":"LOCATION"},{"type":"Cega","content":"LOCATION"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"$1 billion mark","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Amberdata","content":"LOCATION"},{"type":"$1.9 billion","content":"MONEY"},{"type":"Selini Capital","content":"ORGANIZATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Joshua Lim","content":"PERSON"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":["Crypto Trading","funding"],"authors":["Ruholamin Haqshanas"]}