{"summary":"ARK Invest Sells Another $35 Million Worth of Coinbase Shares as Stock Gains Over 50% YTD","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ark-invest-sells-35-million-in-coinbase-shares-as-stock-gains-over-50-ytd.htm","publishDate":"2024-03-22T12:47:04","id":18493,"type":null,"title":"ARK Invest Sells Another $35 Million Worth of Coinbase Shares as Stock Gains Over 50% YTD","category":["Altcoin News "],"content":["ARK Invest, known for its involvement in the spot Bitcoin exchange-traded fund (ETF) market, has decided to cash in on its Coinbase shares as the price per share climbed above $270. ","On March 21, ARK Invest sold a total of 199,526 Coinbase (COIN) shares from its ETFs as the exchange’s stock surged above $260. ","The investment firm, founded by Cathie Wood, divested 133,533 COIN shares from the ARK Innovation ETF (ARKK), amounting to roughly $35 million based on Coinbase’s closing price of $262 on March 21.","Additionally, ARK sold 59,215 shares from the ARK Next Generation Internet ETF (ARKW) and 6,778 shares from the ARK Fintech Innovation ETF (ARKF), bringing the total sale to $52.3 million based on the closing price.","The move by ARK comes amidst Coinbase’s stock experiencing steady growth, surpassing $270 for the first time since December 2021. ","On March 21, COIN briefly reached a high of $276, according to TradingView data.","As of now, Coinbase shares have surged nearly 250% over the past six months and are up by more than 50% year-to-date (YTD).","ARK’s recent sale of Coinbase shares marks one of the most significant sell-offs in 2024. ","The previous notable sale occurred on March 11, when the firm sold 270,365 Coinbase shares. ","On February 16, ARK executed its largest Coinbase sale of the year so far, divesting 499,149 COIN shares across its three ETFs. At that time, Coinbase shares traded around $190, representing a 37% decrease compared to the current price.","ARK has been actively reducing its holdings of Coinbase shares since 2023 and early 2024. ","The firm had initially accumulated a substantial number of COIN shares following the stock’s debut in 2021.","In addition to Coinbase, ARK has also been trimming its shares of Square (SQ), a Bitcoin-focused fintech company co-founded by Twitter’s Jack Dorsey. ","On March 21, ARK sold an additional 188,519 Square shares from its ARKK fund, generating $15.8 million in proceeds.","Furthermore, ARK unloaded 93,002 shares of Robinhood (HOOD), valued at approximately $2 million, from the ARKW ETF. ","This decision was made to comply with Rule 12d3-1, as the fund’s HOOD holdings approached 5% of the portfolio’s total weight. ","Rule 12d3-1 prohibits ETFs from acquiring securities from a registered investment adviser, broker, dealer, or underwriter that exceed 5% of the fund’s total assets.","ARK has been adhering to Rule 12d3-1 by selling Robinhood shares for some time. ","On March 14, the firm also disposed of 583,563 HOOD shares from the ARKK fund without explicitly citing Rule 12d3-1 compliance.","Cathie Wood, known for her bullish stance on Bitcoin and other cryptocurrencies, has been a prominent figure in the crypto space.","It is worth noting that Wood holds a highly optimistic long-term outlook on digital assets like Bitcoin, emphasizing its ability to thrive in market volatility and regulatory uncertainty. ","In 2020, Wood made headlines with an infamous prediction that Bitcoin would hit $500,000 by 2030. ","Last year, she reiterated that she expects Bitcoin to hit $500,000. "," "],"entity":[{"type":"February 16","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"March 21","content":"DATE"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"1","content":"DATE"},{"type":"2030","content":"DATE"},{"type":"$260","content":"MONEY"},{"type":"$262","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"$52.3 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"March 14","content":"DATE"},{"type":"$15.8 million","content":"MONEY"},{"type":"March 11","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"$190","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"250%","content":"PERCENT"},{"type":"Cathie Wood","content":"ORGANIZATION"},{"type":"Coinbase, ARK","content":"ORGANIZATION"},{"type":"$276","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$270","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"ARK","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ARK Invest","Coinbase"],"authors":["Ruholamin Haqshanas"]}