{"summary":"Coinbase to Add Worldcoin and Perpetual Futures Products for the Ordinals Next Week","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-to-add-worldcoin-and-perpetual-futures-products-for-ordinals.htm","publishDate":"2024-04-05T07:46:28","id":18504,"type":null,"title":"Coinbase to Add Worldcoin and Perpetual Futures Products for the Ordinals Next Week","category":["Altcoin News "],"content":["Coinbase International Exchange has announced that it plans to list Worldcoin and Ordinals perpetual futures products on April 11. ","Coinbase exchange provides institutional clients with access to over 30 perpetual futures and spot markets and will add the perpetual futures, also known as perpetual swaps a type of derivative contracts. The Ordinals perpetual futures will begin trading under ORDI-PERP and Worldcoin trading under WLD-PERP. ","@CoinbaseIntExch will add support for Ordinals and Worldcoin perpetual futures on Coinbase International Exchange and Coinbase Advanced. The opening of our ORDI-PERP and WLD-PERP markets will begin on or after 9:30am UTC on 11 APR 2024. pic.twitter.com\/GYHPBTGBJG","— Coinbase International Exchange 🛡️ (@CoinbaseIntExch) April 4, 2024","","Worldcoin is designed to become the world’s largest privacy-preserving human identity and financial network, giving ownership to everyone. Founded by Sam Altman, Max Novendstern and Alex Blania in 2019 Worldcoin. Its native token WLD is designed as a utility token with governance properties, allowing users to have a say over the future of the protocol. ","ORDI is a cryptocurrency that runs on the Bitcoin protocol and presents information such as text and images as NFTs and tokens. The Ordinals protocol writes information to each Satoshi, such as text, pictures, audio and video — the majority of ORDI tokens have been airdropped to users.","Perpetual futures, also known as perpetual swaps or perpetual contracts, are a type of derivative financial instrument commonly traded on cryptocurrency exchanges. Unlike traditional futures contracts, perpetual futures do not have an expiration date. This means that traders can hold their positions indefinitely, as long as they maintain the required margin and meet other exchange requirements.","Perpetual futures also mimic the price of the underlying asset, typically a cryptocurrency like Bitcoin or Ethereum, and they settle periodically to the spot price of the asset.","To stop the perpetual futures price from deviating too far from the spot price,  funding is used. Funding payments are made between long and short positions to help keep the perpetual futures price in line with the spot price.","Traders use perpetual futures for various purposes, including speculation, hedging, and arbitrage. It’s important to note that trading perpetual futures carries huge risks, including volatility and the potential for liquidation if margin requirements are not maintained."],"entity":[{"type":"Alex Blania","content":"PERSON"},{"type":"Max Novendstern","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"April 11","content":"DATE"},{"type":"April 4, 2024","content":"DATE"},{"type":"Coinbase Advanced","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"9:30","content":"TIME"}],"hashtag":["Coinbase","Ordinals","Worldcoin"],"authors":["Tanzeel Akhtar"]}