{"summary":"April Records Lowest Crypto Hack and Scam Losses Since 2021: CertiK","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/april-records-lowest-crypto-hack-and-scam-losses-since-2021-certik.htm","publishDate":"2024-04-30T22:56:38","id":18501,"type":null,"title":"April Records Lowest Crypto Hack and Scam Losses Since 2021: CertiK","category":["Blockchain News "],"content":["As April concludes, the cryptocurrency industry experienced a major downturn in combined losses from hacks and scams, reaching the lowest recorded figure, as highlighted by security firm CertiK.","The month saw the lowest combined losses from crypto-related hacks and scams, with CertiK reporting approximately $25.7 million lost to exploits, hacks, and scams. The latest figure marks the lowest recorded since CertiK began tracking such incidents in 2021, as flash loan attacks and private critical hacks decreased.","","#CertiKStatsAlert 🚨","Combining all the incidents in April we’ve confirmed ~$25.7m lost to exploits, hacks and scams.","The lowest figure we’ve recorded, dating back to 2021.","A 141% decrease from March","Exit scams: ~$4.3m\nFlash loans: ~$129k\nExploits: ~$21m","More details below pic.twitter.com\/zfSh8mabzJ","— CertiK Alert (@CertiKAlert) April 30, 2024","","According to the report, only $25.7 million was lost in attacks throughout the month, marking the lowest amount since CertiK began tracking such data in 2021.","The firm highlighted that April’s total losses represented a 141% decrease from the previous month. Breaking down the figures, CertiK reported that approximately $21 million was attributed to exploits, with only three breaches exceeding $1 million in damages.","Flash loan attacks accounted for $129,000 in losses, with the largest incident causing $55,000 in damages. This marked the lowest incidence of flash loan attacks since February 2022, and $4.3 million was lost to exit scams.","The decline was primarily attributed to a reduction in private vital compromises. In March, 11 attacks against protocols via private key compromises were reported, whereas April witnessed only 3 such incidents.","Despite the overall positive trend, several major hacks and scams still occurred during the month, resulting in substantial losses. For instance, memecoin CondomSol’s presale address on the Solana network was exploited, causing approximately $933,000 in losses for unsuspecting users.","Among the bigger incidents, the attack on the FixedFloat project stood out as the most prominent. It marked the second breach by the same attackers who compromised the project in February 2024.","Exit scams ranked as the second most financially damaging exploit, with losses totaling $4.3 million. Instant loans followed, accounting for $129,000 in compromised funds.","CertiK clarified that the suspected rug pull by crypto casino ZKasino was not included in the report due to unconfirmed details. Although not yet labeled as a scam by CertiK, the platform noted that it would update its figures if ZKasino’s nefarious actions were confirmed.","ZKasino transferred funds to the Lido protocol on April 22, sparking outrage among its users. It is estimated that approximately $32 million has been lost in this suspected scam, however, with the ZKasino team allegedly collecting 10,515 ETH during the ZKAS token presale.","⚠️ Hackers have successfully exploited the smart contracts of the now-defunct DeFi lending protocol Yield Protocol, draining crypto assets amounting to approximately $181,000.#YieldProtocol #Exploithttps:\/\/t.co\/9VepY77KNs","— Cryptonews.com (@cryptonews) April 30, 2024","","Shortly after the issuance of CertiK’s report, the decentralized finance app Yield Protocol fell victim to an exploit, resulting in $181,000 in losses. Despite the developer’s official closure of Yield Protocol, some users could still interact with its smart contracts due to their immutable nature.","Looking at broader trends, Immunefi reported that the cryptocurrency industry lost $336 million to hacks and fraud in the first quarter of 2024. This figure reflects a huge decrease compared to previous years, as in 2023, hackers stole an estimated $1.8 billion, half of the $4 billion recorded in 2022.","Data from DefiLlama revealed that as of April 1, total losses from cryptocurrency hacks surpassed $7.7 billion, despite a 23% decline in incidents during the first quarter of 2024 compared to the previous year. Defi protocols have borne the brunt of these losses since 2016, with hackers absconding $5.8 billion from Defi platforms over seven years."],"entity":[{"type":"$4.3","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"$5.8 billion","content":"MONEY"},{"type":"April 22","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"$129k","content":"MONEY"},{"type":"$129,000","content":"MONEY"},{"type":"$1.8 billion","content":"MONEY"},{"type":"February 2022","content":"DATE"},{"type":"$55,000","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$181,000","content":"MONEY"},{"type":"$933,000","content":"MONEY"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"$25.7 million","content":"MONEY"},{"type":"$336 million","content":"MONEY"},{"type":"April 1","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$25.7","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$4.3 million","content":"MONEY"},{"type":"23%","content":"PERCENT"},{"type":"$21 million","content":"MONEY"},{"type":"Immunefi","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"141%","content":"PERCENT"},{"type":"$1 million","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"$32 million","content":"MONEY"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$7.7 billion","content":"MONEY"},{"type":"$21m","content":"MONEY"}],"hashtag":["Crypto hack","crypto scam","Defi Hack"],"authors":["Hassan Shittu"]}