{"summary":"Terraform Officials Banned from Leaving South Korea as Do Kwon ‘May Apply for Singaporean Citizenship’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terraform-officials-banned-from-leaving-south-korea-as-do-kwon-may-apply-for-singaporean-citizenship.htm","publishDate":"2022-06-20T20:00:00","id":18505,"type":null,"title":"Terraform Officials Banned from Leaving South Korea as Do Kwon ‘May Apply for Singaporean Citizenship’","category":["Altcoin News "],"content":[" ","South Korean prosecutors have banned an unspecified number of current and\/or former Terraform Labs officials, including developers, from leaving the country.","KBS, the South Korean state broadcaster, reported that the identity of two of the number had been confirmed – and that both were former high-ranking officials at the company or its affiliates.","Prosecutors – including the recently reformed Yeouido Grim Reaper financial crimes investigation unit – have been investigating Terraform on suspicions of financial irregularities following last month’s UST\/LUNAC crash.","Terraform was founded in Singapore in 2018.","The report said that South Korean officials appear to be concerned that certain individuals may look to flee the country.","It explained that Do Kwon, the Terraform co-founder, could seek to obtain Singaporean citizenship. Singaporean law stipulates that the foreign owners of certain firms can apply for citizenship if they meet a number of criteria. These include living in Singapore for a period of two or more years – a criterion Kwon has seemingly already fulfilled.","Applicants must also contribute a certain amount of money to Singaporean national funds.","The same report quoted an unnamed “former Terra network developer” as claiming that Kwon was indeed currently “trying to acquire Singaporean citizenship.” The same developer claimed that they were one of those who had been told to remain in South Korea until the investigation had been completed.","The report stated that the ban does not apply to Kwon. South Korean officials claim Kwon is currently residing in Singapore.","But more travel bans could be in the pipelines – the unnamed developer reportedly stated that “since several developers worked together” on the Terra network, “more employees” will likely be “banned from leaving the country” in the coming days.","The same developer, KBS reported, was “in charge of designing and developing core projects” such as the Anchor lending and borrowing protocol.","The Anchor lending protocol housed the majority of UST’s circulating supply, and it was used as a key incentive mechanism for users to hold the UST stablecoin with its high yields of 20%.","However, the report noted that prosecutors have thus far made “no significant progress” in their investigation of Kwon.","MBC, another national broadcaster, reported that the United States regulatory Securities and Exchange Commission (SEC) interviewed Kwon for four and a half hours as part of its investigation into the Terra network’s Mirror Protocol in July last year. The SEC followed up by serving Kwon with a subpoena in September 2021.","The same report added that the SEC had asked Kwon to provide answers on 27 points, and conducted its interview via video link.\n____\nLearn more:\n– How Tokenomics Might Change in the Wake of the Terra Collapse\n– New Luna Token Down Almost 90% From Its All-Time High and Keeps Trending Lower","– Big Wallets Exited Anchor\/UST While Smaller Fish Continued to Invest – Jump Crypto\n– ‘Speculative’ Luna Classic Best Seen as a Meme Coin","– After Terra’s Collapse, Cryptoverse Reflects on ‘Ponzi-like Assets’, Role of VCs, and ‘Ignorant’ Crypto People\n– A Curious Coincidence – Major Terra Backers Break Silence on Same Day"],"entity":[{"type":"90%","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"Terra’s Collapse","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Big Wallets Exited Anchor","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"July last year","content":"DATE"},{"type":"Time High","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"‘Ignorant’ Crypto People\n– A Curious Coincidence – Major Terra Backers Break Silence","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"KBS","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"How Tokenomics Might Change","content":"ORGANIZATION"}],"hashtag":["Do Kwon","Legal","Singapore","South Korea","Terra"],"authors":["Tim Alper"]}