{"summary":"Financial Advisors Reluctant to Discuss Crypto with Clients Due to Legal Concerns, Survey Finds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/financial-advisors-reluctant-to-discuss-cryptocurrency-with-clients-due-to-legal-concerns-survey-finds.htm","publishDate":"2024-05-13T13:11:34","id":18506,"type":null,"title":"Financial Advisors Reluctant to Discuss Crypto with Clients Due to Legal Concerns, Survey Finds","category":["Altcoin News "],"content":["A mere 1% of financial advisors frequently engage in discussions about crypto with their clients due to concerns about potential legal liabilities and associated expenses if the investment goes awry.","According to CoreData’s “Australia’s Crypto Investors” report, a staggering 89% of financial advisers stated that they have never provided advice on cryptocurrency.","“One of the most prominent reasons why advisers are not talking about cryptocurrency is due to concerns around not being covered by professional indemnity insurance (PI),” the report says.","“Without PI cover, advisers risk heavy legal expenses if clients claim their advice led to financial loss or harm.”","Several other factors contribute to advisers’ hesitance, including the prevalence of scams within the cryptocurrency space, the limited information compared to traditional assets, the absence of historical performance data, and the lack of clear regulations.","“Unlike traditional assets, cryptocurrency currently lacks research house ratings and clear advice from governing bodies. While historical data exists on the blockchain, cryptocurrency’s history is relatively short, and its future uncertain.”","However, CoreData believes that the majority of advisers’ reluctance to explore the cryptocurrency market presents an opportunity for advisory firms to specialize in or enhance their understanding of this emerging asset class.","Financial advisers are beginning to allocate to $BTC, around 3.5% of a client’s portfolio. If this practice becomes widely adopted, the inflows into crypto will be staggering, in the $trillions.","Beyond that, managed funds are also now able to expose themselves to crypto by…","— Sam (@SamCKx) March 19, 2024","","Interestingly, the survey revealed that 67% of crypto holders expressed interest in receiving professional advice on the subject.","The highest demand for advice came from individuals who hold cryptocurrency due to their belief in its potential for value appreciation or concerns about inflation.","“For advisers seeking to develop their skills in the area, crypto-assets represent an opportunity to build a unique offering for their business,” the survey said.","“Practices that put in the effort to develop competency in the area will have the chance to increase their assets under management among cohorts of crypto-curious investors, as well as seasoned crypto holders who have built wealth via blockchain,” it added.","As younger generations, who are digitally savvy, become a larger part of the market, the demand for digital assets, including cryptocurrencies and tokenized real-world assets, is expected to rise.","Consequently, building expertise in blockchain-based assets becomes a crucial consideration for future-proofing advisory practices in Australia.","As reported, Morgan Stanley, one of the leading financial institutions, is exploring the possibility of expanding its sales of Bitcoin ETFs by allowing its approximately 15,000 brokers to actively recommend these products to customers.","Currently, Morgan Stanley offers Bitcoin ETFs on an unsolicited basis, meaning that customers must approach their advisors independently to express interest in investing.","By enabling advisors to actively recommend these products, the firm could potentially broaden its customer base, although it would also expose itself to additional liability.","Some financial institutions, like Raymond James Financial and Vanguard, have chosen not to offer cryptocurrency products, citing concerns about their suitability for long-term portfolios.","LPL Financial, the largest independent brokerage with over 22,000 brokers, announced plans in February to evaluate which Bitcoin funds it could offer to customers."],"entity":[{"type":"CoreData’s “Australia’s Crypto Investors","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"PERSON"},{"type":"CoreData","content":"ORGANIZATION"},{"type":"3.5%","content":"PERCENT"},{"type":"Sam (","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"89%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"LPL Financial","content":"ORGANIZATION"},{"type":"$trillions","content":"MONEY"},{"type":"Australia","content":"LOCATION"},{"type":"March 19, 2024","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"$BTC","content":"MONEY"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Raymond James Financial","content":"ORGANIZATION"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":["Cryptocurrency","Financial Advice"],"authors":["Ruholamin Haqshanas"]}