{"summary":"Sam Bankman-Fried Issues First Statement Since Sentencing: “I Never Thought What I Was Doing Was Illegal,” ABC News Reports","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sam-bankman-fried-issues-first-statement-since-sentencing-i-never-thought-what-i-was-doing-was-illegal-abc-news-reports.htm","publishDate":"2024-04-02T18:49:32","id":18509,"type":null,"title":"Sam Bankman-Fried Issues First Statement Since Sentencing: “I Never Thought What I Was Doing Was Illegal,” ABC News Reports","category":["Blockchain News "],"content":["Former “king of crypto” Sam Bankman-Fried is speaking out following his sentencing last week that saw the FTX founder nab 25 years in prison, telling ABC News in an April 1 interview that he “never thought” his actions were criminal.","“I’m haunted everyday by what was lost,” Bankman-Fried told ABC News. “I never intended to hurt anyone or take anyone’s money. But I was the CEO of FTX, I was responsible for what happened to the company, and when you’re responsible it doesn’t matter why it goes bad.”","During his March 28 sentencing, Bankman-Fried was additionally ordered by Judge Lewis A. Kaplan to pay $11 billion in forfeiture for his role in the crypto exchange’s collapse that drained customers of over $8 billion in funds.","“I never thought what I was doing was illegal,” Bankman-Fried continued. “But I tried to hold myself to a high standard, and I certainly didn’t meet that standard.”","The catastrophic losses created by the implosion of FTX itself has left behind a wake of economic disaster for the exchange’s former clients, with prosecutors allegedly receiving over 200 victim impact statements caused by the catastrophe. ","“My family and I lost a significant portion of our family savings, which we had planned to use for our children’s education and purchasing our first home in the United States,” one such statement read in part. “We are in a worse position than we ever thought we would be.”","SBF Victims Speak Out — And Their Stories Are Heart-Breaking","Per dozens of court-filed “Victim Impact Statements,” customers of Sam Bankman-Fried and FTX are struggling with financial insecurity, skimping on expenses including food, forced to eating ketchup as a meal and living… pic.twitter.com\/w0JWbBMdYB","— John Reed Stark (@JohnReedStark) March 20, 2024","","“Within days, the FTX US exchange disappeared, leaving me feeling shattered and my hard-earned life savings gone,” wrote another.","Meanwhile, the FTX bankruptcy estate has shouldered the lengthy legal process of attempting to make FTX customers whole, with the crypto exchange’s current CEO, attorney John J. Ray III calling the situation “unprecedented.”","According to recent reports, FTX creditors may see repayments come to fruition as early as the end of 2024.","“I’d give anything to be able to help repair even part of the damage,” Bankman-Fried said of customer losses. “I’m doing what I can from prison, but it’s deeply frustrating not to be able to do more.”","The FTX founder’s latest comments follow his remarks given at last week’s sentencing, wherein he alleged his company “always” had enough assets to cover its losses. ","However, Judge Kaplan pushed back against much of Bankman-Fried’s defense, claiming he lacked remorse for his actions.","The FTX founder denied this sentiment in his latest interview, claiming that he is “of course” remorseful.","“I’ve heard and seen the despair, frustration, and sense of betrayal from thousands of customers; they deserved to be paid in full, at current price,” he told ABC News. “That could and should have happened in November 2022, and it could and should happen today. It’s excruciating to see them wait day after day.”"],"entity":[{"type":"April 1","content":"DATE"},{"type":"ABC News","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"$11 billion","content":"MONEY"},{"type":"John Reed Stark","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"March 20, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"November 2022","content":"DATE"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX Bankruptcy","SBF"],"authors":["Julia Smith"]}