{"summary":"Crypto Betting App CoinPoker Follows Rollbit With Zero Withdrawal Fees Trend","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-betting-app-coinpoker-follows-rollbit-with-zero-withdrawal-fees-trend.htm","publishDate":"2024-04-24T12:01:24","id":18500,"type":null,"title":"Crypto Betting App CoinPoker Follows Rollbit With Zero Withdrawal Fees Trend","category":["Blockchain News "],"content":["Crypto betting app CoinPoker has announced it has removed all withdrawal fees on its platform, with only blockchain network fees now applying when users cash out their winnings.","This puts CoinPoker in line with other online gambling sites, such as Rollbit, and it could end up being something that helps the newer site gain more market share over time.","This is particularly the case when CoinPoker offers many of the features provided by sites such as Rollbit, while also adding several more unique propositions, such as poker games against human opponents.","And given that the removal of withdrawal fees comes at a time when gambling coins such as Rollbit (RLB) have been performing well, its implementation could help CoinPoker’s own CHP token post some gains.","Announcing the new policy yesterday, CoinPoker’s official X account explained that “all cashout fees have been eliminated on CoinPoker” and that only “the standard network transaction fees will apply” to customer withdrawals.","📢 We are pleased to inform you that all cashout fees have been eliminated on CoinPoker.","👉 Only the standard network transaction fees will apply to your withdrawals.","ℹ️ If you have questions or need help, contact our support team at [email protected].","😎 Let's play!… pic.twitter.com\/6dkKphLbwb","— CoinPoker (@CoinPoker_OFF) April 23, 2024","","CoinPoker had previously applied “nominal fees” to withdrawals, in order to help fund the stability and security of its site.","However, it’s now able to ensure security without taking withdrawal fees, a move that’s likely to help the site grow its already expanding user base.","SimilarWeb currently ranks it 90th globally in the poker category, with the site having risen 14 places between February and March.","It could continue rising up the rankings following this announcement, with CoinPoker arguably providing a stronger user experience than many of its rivals.","For instance, while it offers an online casino much like rivals such as Rollbit, its poker section also covers games against other human players.","This has particularly come to the fore in its Crypto Series of Poker (CSOP) tournament, which it launched this month and which is offering a guaranteed prize pool of at least $1 million.","This tournament saw celebrity poker player Tony G win just over $300,000 in a single game over the weekend, while it also saw the same player win the largest ever prize pot recorded in online poker in February 2022, at $7.7 million.","Combined with the new removal of withdrawal fees, CoinPoker’s status as the best place on the Internet for crypto-friendly poker should help it bite into the market share of sites such as Rollbit.","In turn, it should also boost the price of CoinPoker’s native token, CHP.","The latter is up by 1% in the past 24 hours, with buyers likely responding to yesterday’s news.","At $0.05848, it has gained by 5% in the past fortnight, although it remains down by 43% in a year.","Yet this decline means that the coin is now trading at a good discount, and with CoinPoker expanding consistently, it may only be a matter of time before CHP posts some strong gains.","It could end up following in the footsteps of Rollbit’s own coin, RLB, which has recorded a 670% increase in the last 12 months.","Visit CoinPoker Now",""],"entity":[{"type":"$0.05848","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"43%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"$7.7 million","content":"MONEY"},{"type":"CHP","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"670%","content":"PERCENT"},{"type":"$1 million","content":"MONEY"},{"type":"February 2022","content":"DATE"},{"type":"Rollbit","content":"LOCATION"},{"type":"April 23, 2024","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"1%","content":"PERCENT"}],"hashtag":["crypto poker","Fees","Gambling"],"authors":["Simon Chandler"]}