{"summary":"Former Celsius CEO Mashinsky Waives Conflict of Interest, Proceeds with SBF Lawyers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/former-celsius-ceo-mashinsky-waives-right-to-conflict-of-interest-concerns-proceeds-with-sbf-lawyers.htm","publishDate":"2024-02-21T11:18:07","id":18507,"type":null,"title":"Former Celsius CEO Mashinsky Waives Conflict of Interest, Proceeds with SBF Lawyers","category":["Blockchain News "],"content":["Former Celsius Network’s CEO Alex Mashinsky has waived any potential conflicts of interest that may arise from choosing similar legal representation as Sam Bankman-Fried.","In a Feb 20 court hearing, Mashinsky told a United States Federal Judge his decision to be represented by Marc Mukasey and Torrey Young, Bloomberg reported.","Former Celsius CEO Alex Mashinsky said he was comfortable using the same lawyers as FTX founder Samuel Bankman-Fried to defend him against charges that he pumped up the price of his firm’s cryptocurrency https:\/\/t.co\/Bl9EP6LOh3","— Bloomberg (@business) February 20, 2024","","The issue arises based on the lawyers’ decision to represent former FTX CEO Sam Bankman-Fried at his sentencing following conviction.","Both embattled former Chief Executives are charged following the collapse of their firms in 2022, leading to widespread losses in the market.","While Bankman-Fried was charged with commingling and stealing consumer assets, Mashinsky was charged with misrepresenting the health of his company before it later filed for bankruptcy.","Slammed with fraud-related charges, Mashinsky turned to the services of both lawyers and instead went ahead with the move.","“We can’t foresee the future. I assume that his sentencing will be completed before my trial but it may not be.”","Mashinsky said that he understands the potential conflict of interests involved even though he does not think one exists, stressing that he is investing significant time and money in his lawyers.","The embattled former CEO disclosed that he consulted with an independent attorney on conflict of interest concerns.","The United States prosecutors raised concerns regarding conflict of interests arising from both criminal cases on Feb 6. In a court filing, prosecutors highlighted their fears to the judge, requesting a Curcio hearing to determine pending issues.","In such hearings, the court determines the extent of the flagged conflict of interest and orders a change of attorneys if a conflict exists. This aims to ensure a client gets the best legal representation without loyalty to someone else if cases can be linked.","In the pending cases, prosecutors say both parties had a history of business relationships before the collapse of the firms.","Mashinsky has previously admitted lending funds to Alameda Research, a subsidiary and sister company of FTX.","Mashinsky has also partially blamed Celsius’s collapse on Alameda Research’s actions before the FTX bankruptcy. Furthermore, prosecutors pointed to the talks about Bankman-Fried buying Celsius with plans to replace Mashinsky as CEO as potential conflict areas.","However, the government noted that the issues raised do not impact his rights and can be waived with his express consent. The judge adjourned the matter to hear from an attorney appointed to represent defendants on potential conflict cases under the Criminal Justice Act.","In another development, Bankman-Fried is expected in court tomorrow before District Judge Lewis Kaplan on similar issues."],"entity":[{"type":"United States Federal Judge","content":"ORGANIZATION"},{"type":"Marc Mukasey","content":"PERSON"},{"type":"February 20, 2024","content":"DATE"},{"type":"Torrey Young","content":"ORGANIZATION"},{"type":"Criminal Justice","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Samuel Bankman","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Mashinsky","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Celsius","FTX","Mashinsky"],"authors":["David Pokima"]}