{"summary":"Satoshi-era Bitcoin Whales Transfer $230 Million Worth Of Assets- Here’s What You Need To Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/satoshi-era-bitcoin-whales-transfer-230-million-worth-of-assets-heres-what-you-need-to-know.htm","publishDate":"2023-11-02T16:00:24","id":18513,"type":null,"title":"Satoshi-era Bitcoin Whales Transfer $230 Million Worth Of Assets- Here’s What You Need To Know","category":["Bitcoin News "],"content":["Three Satoshi-era Bitcoin wallets have transferred about $230 million worth of assets to new addresses after almost six years in the dark.","On-chain data from BitInfoCharts on Nov 2 show three Bitcoin (BTC) whales moved 6,500 BTC sparking trading concerns among the crypto community as this year continues to resurrect large numbers of ancient addresses.","The first wallet transferred 2,000 BTC worth approximately $71 million while the second whale moved 2,550 BTC worth around $90 million. The last wallet sent out 1,950 BTC worth $69 million raising the total to $230 million.","Aside from the huge asset movements, the profits raked in which can be seen in the profits from “price change” has had many talking assuming it was a sale.","Per the data, these ancient holders would rake in $68.9 million, $54.1 million, and $52.7 million respectively at the present market where the asset’s price trades above $34,000.","At press time, bitcoin exchanges hands at $34,827.","Satoshi-era addresses are linked to wallets created over a decade ago. At the same time, whales are characterized by their crypto portfolio usually exceeding 1000 BTC, and can swing the asset price depending on the transaction volume.","Other categories of Bitcoin holders include sharks (holds between 500- 1000 BTC), Crabs (holds 1-10 BTC), and shrimps who make up the bulk of the community with less than 1 BTC.","Although it is not known whether the three transactions are related to one entity, the movements appear similar because of the time assets were transferred and their last activity since 2017.","With the last transactions happening in 2017, the whales remained silent throughout the bull run of 2021 that saw bitcoin price soar over $64,000. The price of the asset took a sharp decline the following year losing over 55% of its value due to the wider macroeconomic factors and the collapse of the Terra Network and FTX.","This year, the price of BTC has recovered nearly 77% with an increasing price on the back of a potential spot BTC ETF approval. The new price surge has raised speculations that renewed activity in the market has sparked a sale of the assets.","As assets continue to recover, Satoshi-era accounts continue to spring up periodically moving assets worth millions.","In February, a BTC address moved $9.6 million worth of assets after 11 years recording a staggering 120,000% profits as the assets were worth only $8.","In April, a similar situation occurred when an ancient account transferred $10 million worth of assets bought about twelve years ago. In July, another whale moved assets worth $37 million for coins bought for $5,107 at the time.","A BTC whale that has been dormant for 11 years transferred all 1,037.42 $BTC($37.8M) to a new address\"bc1qtl\" an hour ago.","The whale received 1,037.42 $BTC($5,107 at that time) on Apr 11, 2012, when the price was $4.92.https:\/\/t.co\/k8ZmO5vc8X pic.twitter.com\/xBaw2dQfY8","— Lookonchain (@lookonchain) July 22, 2023","","Aside from Bitcoin, other assets have also recorded ancient whale activities as the market recovers."],"entity":[{"type":"$71 million","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"1000","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$34,827","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"$BTC($37.8","content":"MONEY"},{"type":"$69 million","content":"MONEY"},{"type":"$90 million","content":"MONEY"},{"type":"$52.7 million","content":"MONEY"},{"type":"$34,000","content":"MONEY"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$8","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$64,000","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"$9.6 million","content":"MONEY"},{"type":"Apr 11, 2012","content":"DATE"},{"type":"July 22, 2023","content":"DATE"},{"type":"$68.9 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$230 million","content":"MONEY"},{"type":"$54.1 million","content":"MONEY"},{"type":"Terra Network","content":"ORGANIZATION"},{"type":"120,000%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"$37 million","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"77%","content":"PERCENT"},{"type":"$4.92","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$5,107","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin"],"authors":["David Pokima"]}