{"summary":"PlayDapp Suffers Security Breach with $32 Million PLA Token Exploited","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/playdapp-suffers-security-breach-with-32-million-pla-token-exploited.htm","publishDate":"2024-02-12T09:10:04","id":18515,"type":null,"title":"PlayDapp Suffers Security Breach with $32 Million PLA Token Exploited","category":["Blockchain News "],"content":["The web3 gaming platform PlayDapp has suffered a major security breach, resulting in the unauthorized issue of 200 million PLA tokens.","The blockchain security and analytics firm PeckShield Inc. spotted the breach on Feb. 10 and alerted PlayDapp about the exploit in a social media post.","“New 200m $PLA tokens were just freshly minted,” said PeckShield. “It seems to be a private key leak and the new minter was just added in the following tx.”","Hi @playdapp_io, you may want to take a look.","New 200m $PLA tokens were just freshly minted. It seems to be a private key leak and the new minter was just added in the following tx: https:\/\/t.co\/tyxDksNwSt pic.twitter.com\/SkjZsTjtdQ","— PeckShield Inc. (@peckshield) February 9, 2024","","PlayDapp confirmed the hack on the same day following the breakout and acted to reinstate the security, saying, “We are writing to inform you of a critical security incident involving the PLA token contract. The PLA token contract has been hacked and additional PLA tokens have been issued.”","The platform also published an announcement for PLA wallet transfer. PlayDapp took a protective measure to transfer all PlayDapp-held PLA, encompassing both locked and unlocked assets, to a newly secured wallet.","To resolve the exigent issue, PlayDapp has reached out to the hacker via an on-chain message, proposing a reward for the prompt return of all stolen contracts and assets.","“Failure to accept this offer will prompt us to quickly work with the FBI and law enforcement agencies in the pursuit of the hacker,” declared the company. “We will publicly announce a bounty and seek assistance from a WEB3 security provider.”","However, the community do not endorse the platform’s reactions. A user replied to PlayDapp’s post, saying, “The hacker has already sold most of the coins through Hotcoin, Huobi and Gate, it has been hacked, you don’t know about it for 5-6 hours.”","The hacker has already sold most of the coins through Hotcoin, Huobi and Gate, it has been hacked, you don’t know about it for 5-6 hours.","— CryptoCastiel (@CryptoCastiel) February 10, 2024","","In the meantime, the PLA token has taken a significant dive post the exploit from $0.1829 on Feb. 9 to 0.1532 on Feb. 10, marking a 16% decline within 24 hours according to CoinMarketCap. In addition, it is trading 0.1504 at the time of writing, 13.89% down from a week ago."],"entity":[{"type":"Feb. 10","content":"DATE"},{"type":"February 10, 2024","content":"DATE"},{"type":"PLA","content":"ORGANIZATION"},{"type":"February 9, 2024","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$PLA","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"$0.1829","content":"MONEY"},{"type":"PeckShield Inc.","content":"ORGANIZATION"},{"type":"Feb. 9","content":"DATE"},{"type":"Hotcoin","content":"PERSON"},{"type":"Huobi","content":"PERSON"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"13.89%","content":"PERCENT"}],"hashtag":["Hack","Security"],"authors":["Hongji Feng"]}