{"summary":"China Launches New Blockchain Infrastructure Platform Led by Conflux","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chinese-government-launches-new-blockchain-infrastructure-platform-led-by-conflux.htm","publishDate":"2024-04-01T17:49:32","id":18518,"type":null,"title":"China Launches New Blockchain Infrastructure Platform Led by Conflux","category":["Blockchain News "],"content":["On April 1, the China announced a groundbreaking initiative led by Conflux Network – the “Ultra-Large Scale Blockchain Infrastructure Platform for the Belt and Road Initiative.”","The announcement, shared in an X post by Conflux Network, signifies a significant step towards China leveraging blockchain technology to facilitate seamless and secure cross-border transactions.","","The main focus of the project is to create a public blockchain infrastructure platform. This platform will be able to support the implementation of cross-border cooperation projects along the Belt and Road Initiative. It will provide the base for developing applications that… https:\/\/t.co\/MkWgRY2G8A","— Conflux Network Official (@Conflux_Network) April 1, 2024","","According to a local source, on March 30, the Shanghai Tree Graph Blockchain Research Institute hosted the launch and implementation plan demonstration meeting for the national critical research and development project titled “Ultra-large-scale Blockchain Basic Platform for the ‘Belt and Road,'” launched on Conflux Network.","This initiative, led by the Shanghai Shutu Blockchain Research Institute, saw active participation from prestigious institutions such as the China Academy of Information and Communications Technology, Shanghai Jiao Tong University, Fudan University, Shanghai Maritime University, and other important units.","The meeting attracted expert leaders from prominent entities, including the Industrial Development Promotion Center of the Ministry of Industry and Information Technology and the Shanghai Science and Technology Commission, alongside members of the project consulting expert group, the project leading unit, and various project participants.","According to the report, the primary objective of this initiative is to address the unique characteristics and requirements of the “Belt and Road” transnational cooperation scenario.","The project seeks to develop an advanced blockchain primary platform capable of supporting multi-country deployment and facilitating collaborative supervision across multiple subjects. Additionally, it intends to leverage this platform as a foundation for demonstrating applications of cross-border cooperation in economic, trade, and cultural domains.","In March, multichain blockchain ecosystem Conflux Network, operated by the Conflux Foundation (Shanghai Tree-Graph Blockchain Research Institute), played a crucial role in successfully beta-testing the Hong Kong Dollar (HKD)-backed stablecoin, AxHKD.","This stablecoin, built by local fintech company AnchorX, is set to be launched initially on Conflux Network, followed by Ethereum. Conflux Network is recognized as the only regulatory-compliant public blockchain in China.","","CHINESE INVESTORS TURN TO CRYPTO AMID ECONOMIC DOWNTURN","As China faces an economic downturn, investors turn to Bitcoin for safety and returns.","Crypto trading is banned in mainland China, but investors use creative methods such as using bank cards from rural banks and overseas… pic.twitter.com\/iloqwFa0ga","— Crypto Town Hall (@Crypto_TownHall) January 25, 2024","","Despite mainland China’s stringent stance against cryptocurrencies, including past crackdowns on the crypto industry in 2017 and 2021, the government’s newly launched blockchain initiative showcases the country’s interest in blockchain technology while maintaining a hostile attitude toward cryptocurrencies.","However, despite these regulatory measures, Chinese investors increasingly turn to the crypto market as a safer alternative amid economic downturns and a sluggish stock market. This has led to a thriving underground crypto industry, with mainland investors finding new ways to participate in crypto trading.","According to a Reuters report, mainland investors can access cryptocurrencies like Bitcoin through centralized platforms such as OKX and Binance and engage in over-the-counter transactions. Some investors are also leveraging their $50,000 annual forex purchase quotas to move funds into cryptocurrency accounts in Hong Kong, capitalizing on the territory’s favorable stance towards digital assets.","As a result of these developments, the Chinese crypto market has witnessed a surge in activity, reflected in its global ranking in peer-to-peer trade volume, jumping from 144th place in 2022 to 13th place in 2023, as reported by crypto data platform Chainalysis.","Despite the ban, Chinese tech giants like Tencent and Huawei are making strides in the Web3 space, leveraging their computing resources to support web3 startups, despite China’s ban on cryptocurrency trading."],"entity":[{"type":"2017","content":"DATE"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"Shanghai Maritime University","content":"ORGANIZATION"},{"type":"Shanghai Shutu Blockchain Research Institute","content":"ORGANIZATION"},{"type":"Industrial Development Promotion Center of the Ministry of Industry and Information Technology","content":"ORGANIZATION"},{"type":"Crypto Town Hall","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Conflux Foundation (Shanghai Tree","content":"ORGANIZATION"},{"type":"Shanghai Jiao Tong University","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Huawei","content":"ORGANIZATION"},{"type":"April 1, 2024","content":"DATE"},{"type":"Shanghai Tree Graph Blockchain Research Institute","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Shanghai Science and Technology Commission","content":"ORGANIZATION"},{"type":"Graph Blockchain Research Institute)","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"March 30","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Fudan University","content":"ORGANIZATION"},{"type":"January 25, 2024","content":"DATE"},{"type":"Conflux Network Official (","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"China Academy of Information and Communications Technology","content":"ORGANIZATION"}],"hashtag":["China","Conflux Network","Hong Kong crypto"],"authors":["Hassan Shittu"]}