{"summary":"Render Network’s RNDR Token Outperforms Broader Crypto Market, Mirrors Tech Stocks as NVIDIA Hits $1 Trillion Market Cap","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/render-networks-rndr-token-outperforms-broader-crypto-market-mirrors-tech-stocks-as-nvidia-hits-1-trillion-market-cap.htm","publishDate":"2023-05-31T18:00:00","id":18510,"type":null,"title":"Render Network’s RNDR Token Outperforms Broader Crypto Market, Mirrors Tech Stocks as NVIDIA Hits $1 Trillion Market Cap","category":["Blockchain News "],"content":["The decentralized GPU-based rendering solutions provider Render Network’s native RNDR token has seen a wave of interest over the past month as the narrative around artificial intelligence (AI) continues to strengthen.","In the past 30 days, the token has outperformed the broader crypto market, instead following tech stocks such as Nvidia higher as major cryptos like Bitcoin (BTC) and Ether (ETH) have seen falling or stagnant prices.","Since the beginning of May, RNDR is now up close to 5% to a price of $2.5.","Over the same time period, Nvidia’s stock – which recently hit a $1 trillion market cap – is up nearly 44%, fueled by high expectations related to AI chips that the company produces, including chips used by services like the AI chat robot ChatGPT.","Meanwhile, the tech-focused Nasdaq index is up close to 9% during the month.","Like for Nvidia, it is the current buzz surrounding AI that is the driver behind much of the interest in RNDR.","According to the popular crypto analyst Jason Choi, more chatter about Render Network can now be heard in the crypto community given that it is among the crypto projects that most closely align with the current AI narrative.","🧐 https:\/\/t.co\/NLlOQVOzVb pic.twitter.com\/3fi4IwAw9L","Notably, Render Networks’s potential was also addressed in an update from Choi’s crypto newsletter Blockcrunch last week, which hinted at a connection between the network and  Apple’s upcoming augmented and virtual reality (AR\/VR) headset.","Apple is expected to officially reveal its new headset at its developer’s conference starting June 5, with some, including popular crypto media personality Raoul Pal, predicting that the event “will show us the future of the Metaverse.”","June 5th mark your calender!$rndr & #apple set to make history 🔥🔥🔥 https:\/\/t.co\/DkOXvjic4D pic.twitter.com\/BHDL57RHT8",""],"entity":[{"type":"$2.5","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"past 30 days","content":"DATE"},{"type":"May","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Jason Choi","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"Render Networks","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"June 5","content":"DATE"},{"type":"Raoul Pal","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["AI"],"authors":["Fredrik Vold"]}