{"summary":"Cryptocurrency custodian Kingdom Trust just filed a lawsuit against BitGo and Bitcoin IRA for allegedly misappropriating the trade secrets they obtained to deceive Kingdom Trust clients\nKingdom Trust clients were solicited directly by Bitcoin IRA to transfer their funds from Kingdom Trust to BitGo\nIn 2018, Kingdom Trust also disclosed confidential information to BitGo under a merger agreement; the merger was terminated, however, and BitGo launched its own custody services soon after ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37816\/kingdom-trust-sues-competitor-bitgo-and-bitcoin-ira-for-allegedly-using-its-trade-secrets-to-steal-clients","publishDate":"2019-08-27T18:45:50","id":1851,"type":null,"title":"Kingdom Trust sues competitor BitGo and Bitcoin IRA for allegedly using its trade secrets to steal clients","category":["Custody"],"content":["<span data-v-f87c67ca=\"\">Bitcoin IRA allegedly conspired with cryptocurrency custodian BitGo to obtain its competitor Kingdom Trust’s trade secrets and use them to deceive Kingdom Trust clients, according to a lawsuit filed recently.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kingdom Trust, the older cryptocurrency custodian, is suing Bitcoin IRA and the younger firm BitGo for misleading Kingdom Trust customers into transferring their funds from Kingdom Trust to BitGo, after obtaining Kingdom Trust’s customer lists and other trade secrets. Bitcoin IRA and BitGo had formed a partnership in May 2019 that was previously unknown to Kingdom Trust.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitcoin IRA likely acquired Kingdom Trust’s proprietary information through an agreement between the two companies that referred Bitcoin IRA clients to the custodian. This partnership gave Bitcoin IRA access to Kingdom Trust’s client and account information, states the suit. The document also claims that Bitcoin IRA shared these trade secrets with BitGo.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In June 2019, the Kingdom Trust client portal hosted by Bitcoin IRA started to display a link inviting clients to upgrade their accounts. This link in fact directed clients to sign an asset transfer request to move their funds from Kingdom Trust to BitGo, according to the suit.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitcoin IRA also allegedly sent emails and letters directly to Kingdom Trust clients and encouraged them to file complaints to banking regulators against Kingdom Trust for delaying transferring their digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the suit, this is not the first time Kingdom Trust’s confidential information was disclosed to BitGo. In 2018, the two companies entered into an agreement in preparation for a potential merger. However, after Kingdom Trust shared “extensive proprietary information” with BitGo, the merger was terminated in May 2018, per the suit. However, in the same month, BitGo <\/span><a href=\"https:\/\/blog.bitgo.com\/bitgo-building-first-qualified-custodian-built-specifically-for-digital-currencies-8045a636e770\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced publicly<\/span><\/a><span data-v-f87c67ca=\"\"> that it launched its own digital asset custodian independent of Kingdom Trust.&nbsp;<\/span>","\"We do not comment on pending litigation. However, we are confident that when the facts come to light through the judicial process it will be clear that BitGo has committed absolutely no wrongdoing,\" said a BitGo spokesperson in an email to The Block.&nbsp;","Following Kingdom Trust's lawsuit, Digital IRA, the parent company of Bitcoin IRA, filed a countersuit against the custodian. The suit accused Kingdom Trust of thwarting customers' requests to transfer their cryptocurrencies to competing custodians.&nbsp;","Regarding the referral program between Bitcoin IRA and Kingdom Trust, Bitcoin IRA claims that the custodian abused the program and employed \"unfair\" and \"deceptive\" tactics when some customers asked to move their accounts to another custodian, per Digital IRA's complaint.&nbsp;","<em data-v-f87c67ca=\"\">The story has been updated with a comment from BitGo and the complaint from Digital IRA.&nbsp;<\/em>"],"hashtag":[]}