{"summary":"Kraken is moving ahead with plans to launch its own bank despite a challenging regulatory environment, Marco Santori, Kraken’s chief legal officer, told The Block’s Frank Chaparro on The Scoop podcast.\nKraken’s banking relationships are secure, Santori added. ","author":["Nathan Crooks","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217177\/kraken-is-on-track-to-launch-bank-very-soon-despite-regulatory-weird-place","publishDate":"2023-03-06T05:00:08","id":1852,"type":null,"title":"Kraken is on track to launch bank &#x27;very soon&#x27; despite regulatory &#x27;weird place&#x27;","category":["Companies"],"content":["Kraken is moving ahead with plans to launch its own bank despite a challenging regulatory environment and the recent shuttering of its on-chain staking services for U.S. clients to settle U.S. Securities and Exchange Commission charges that it violated securities laws.&nbsp;","\"Kraken Bank is very much on track to launch, very soon,\" Kraken's chief legal officer Marco Santori told The Block’s Frank Chaparro on <a href=\"https:\/\/www.theblock.co\/post\/217294\/krakens-chief-legal-officer-banks-are-shying-away-from-taking-on-crypto-customers\" data-v-f87c67ca=\"\">The Scoop podcast<\/a>. \"We're going to have those pens with the little ball chains. We're going to order thousands of them and attach them to the to the desks of Wall Street banks everywhere. With our logo.\"","A new bank born from the crypto sector would come at a tumultuous time for an industry still dealing with the widespread fallout from the collapse of FTX. There have been multiple enforcement actions over the past several weeks and rising uncertainty on the regulatory front. SEC Chair Gary Gensler said last month that the Kraken settlement, which included $30 million in fines, should \"put everyone on notice in this marketplace.\"","Santori declined to discuss the SEC settlement in detail, but said that staking had been a small percentage of Kraken's revenue. Kraken neither admits nor denies any of the allegations in the complaint, he added.","\"It does of course affect pretty dramatically our product mix in the U.S.,\" he said, adding that the SEC moev will push American clients who want staking services offshore to far riskier exchanges.","\"It's really indicative of a pretty unfortunate situation here stateside,\" he said. \"We've got a regulatory environment that is essentially forcing users off to use offshore exchanges that will gladly accept their business with so little as a VPN.\"","With crypto-friendly bank Silvergate shutting down its widely-used Silvergate Exchange Network amid <a href=\"https:\/\/www.theblock.co\/post\/216548\/silvergates-network-unravels-leaving-crypto-industry-in-search-of-new-partners\" data-v-f87c67ca=\"\">capitalization troubles<\/a>, Santori said that Kraken's banking relationships were secure and that the exchange had a \"diversified group of banks all around the world.\"","He did warn that increased caution on the banking front could stifle innovation in the sector.&nbsp;&nbsp;","\"We're returning to an era where banks are going to be very cautious as to what accounts they open,\" he said. \"Wall Street is going to be fine. Kraken and Coinbase are going to be okay. But the guy or gal who has a new idea about how to provide infrastructure to the crypto economy, it's going to be a really tough road over the next few years for them. No question.\"","Santori said he didn't think there was a conspiratorial crackdown on the crypto sector in the U.S. Nonetheless, he said the issue could become electoral fodder as the presidential race kicks off in the country.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"There's definitely not some anti-crypto group that meets every week in some shadowy room in D.C.,\" he said. \"But there are a group of regulators who happen to all feel roughly the same way about crypto ... I think they just believe basically in one fundamental thing, that what crypto is today is what's important, and what it will be or could be in the future is really not.\""],"hashtag":[]}