{"summary":"Hong Kong Retail Investors More Interested in Crypto Than Ever Before, Reveals SFC Survey","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-retail-investors-more-interested-crypto-than-ever-before-reveals-sfc-survey.htm","publishDate":"2023-10-12T06:07:00","id":18528,"type":null,"title":"Hong Kong Retail Investors More Interested in Crypto Than Ever Before, Reveals SFC Survey","category":["Altcoin News "],"content":["Hong Kong’s retail investors’ interest in cryptocurrencies has recorded a significant surge this year, according to a recent survey by the Investor and Financial Education Council (IFEC), a subsidiary of the Securities and Futures Commission (SFC), Hong Kong’s securities regulator.","The survey, conducted between June and July 2023, included responses from 1,000 individuals aged 18 to 69, revealing a significant rise in retail investors’ interest in crypto. ","The study uncovered that a significant eight percent of retail investors in Hong Kong invested in some sort of crypto asset in 2023, a significant increase from a mere one percent in 2019. ","While all the surveyed virtual asset retail investors reported holding cryptocurrencies, a smaller proportion, six percent, dabbled in non-fungible tokens (NFTs), and just two percent ventured into stablecoins. ","In terms of future expectations, the IFEC report highlights a growing trend, with 11 percent of the surveyed investors expressing an intention to invest in virtual assets or related products within the next 12 months. ","This finding suggests that the trend of increased interest in virtual assets may continue to gain momentum in the coming year.","The survey’s timing coincided with the unraveling of the $200 million JPEX scandal. ","The report also unveils a significant trend among retail crypto investors in Hong Kong, where 75 percent cited their pursuit of short-term returns as a primary motivation for their investments. ","A similar number, 74 percent, believe that virtual assets represent an ongoing investment trend, while 73 percent expressed concerns about missing out on popular investment opportunities. This phenomenon signals a potential need for enhanced investor education and awareness in the region.","Hong Kong’s evolving interest in virtual assets reflects the broader global trend of cryptocurrency adoption among retail investors, who are attracted to the potential for quick profits and the increasing recognition of virtual assets as a legitimate investment class. "],"entity":[{"type":"Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"Financial Education Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"eight percent","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"75 percent","content":"PERCENT"},{"type":"one percent","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"74 percent","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"73 percent","content":"PERCENT"},{"type":"July 2023","content":"DATE"},{"type":"11 percent","content":"PERCENT"}],"hashtag":["Hong Kong"],"authors":["Jai Pratap"]}