{"summary":"Hong Kong SFC Warns of Websites Impersonating Regulated Crypto Exchanges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-warns-of-websites-impersonating-osl-and-hashkey.htm","publishDate":"2024-03-04T06:48:11","id":18531,"type":null,"title":"Hong Kong SFC Warns of Websites Impersonating Regulated Crypto Exchanges","category":["Blockchain News "],"content":["The Hong Kong Securities and Futures Commission (SFC) issued a public warning today, urging investors to be cautious of suspicious websites impersonating legitimate virtual asset trading platforms. Two specific platforms were identified: HSKEX, impersonating Hash Blockchain Limited, operating these urls – www.hskexpro.com, www.hskex.com, www.hskexs.com and www.hskexit.com. www.oslexu.com and www.oslint.com were found impersonating OSL Digital Securities Limited.","According to the SFC, these websites mimic the branding and appearance of the licensed platforms, potentially misleading investors into believing they are interacting with legitimate entities.","The warning comes after reports of victims experiencing difficulties withdrawing funds from these impersonating websites, and being pressured to pay excessive “fees and taxes” to unlock their assets.","HashKey and OSL are the only two licensed crypto exchanges operating in Hong Kong.","The SFC has taken action to combat these fraudulent activities. Following reports received, the commission added both sets of impersonating websites to their Suspicious Virtual Asset Trading Platforms Alert List on March 4th, 2024.","Additionally, they have requested and successfully collaborated with the Hong Kong Police Force to block access to the websites impersonating Hash Blockchain Limited.","The SFC emphasized the importance of investor vigilance and due diligence before engaging in any virtual asset transactions.","The commission encourages investors to verify the legitimacy of a platform through official channels, such as the SFC’s Public Register of Licensed Persons and Registered Institutions, and the List of licensed virtual asset trading platforms.","Additionally, they advise investors to avoid sending money or engaging in transactions before thoroughly verifying the counterparty’s identity.","Hong Kong SFC has received over 22 applications seeking a license to operate a crypto exchange in the region. OKX, Bybit, Bullish, Crypto.com, Huobi HK, Matrixport HK and Gate.HK are some of the applicants seeking SFC’s approval for operating a crypto exchange.","The deadline to submit the license application ended on 29 Feb. As per the SFC website, crypto platforms operating in Hong Kong that failed to submit license applications will need to cease business by the end of the month."],"entity":[{"type":"Bybit","content":"LOCATION"},{"type":"Hong Kong Police Force","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"Feb","content":"DATE"},{"type":"Hong Kong SFC","content":"ORGANIZATION"},{"type":"OSL Digital Securities Limited","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"March 4th, 2024","content":"DATE"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Hong Kong Securities and Futures Commission (SFC","content":"ORGANIZATION"}],"hashtag":["Crypto Exchange","Crypto Regulation","Hong Kong"],"authors":["Jai Pratap"]}