{"summary":"Ethereum Transaction Fees Dip to Lowest Since December 2020, Bitcoin Fees Relatively Stable","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-transaction-fees-dip-to-lowest-since-december-2020-bitcoin-fees-relatively-stable.htm","publishDate":"2022-07-05T18:00:00","id":18537,"type":null,"title":"Ethereum Transaction Fees Dip to Lowest Since December 2020, Bitcoin Fees Relatively Stable","category":["Ethereum News "],"content":[" ","The depressed state of the crypto market has also taken its toll on transaction fees, with Ethereum (ETH) fees now finally coming down to lows not seen since December 2020 — while Bitcoin (BTC) fees remained around the same low level they have been at for the past year.","The low on Ethereum’s side was reached last Sunday, when the median transaction fee dropped to USD 0.87, before rising slightly to USD 1.142 by Tuesday. The last time Ethereum transaction fees were lower than they were this week was on December 6 of 2020, when they dipped to USD 0.66 per transaction.","The currently low transaction fees come after the Ethereum network for the first half of the year and much of 2021 had struggled with skyrocketing fees, making some users complain that the network had priced out certain activities.","The all-time high in Ethereum transaction fees was reached on May 12 last year, when the median fee level hit USD 37.89. The sky-high fees back then were largely fueled by a craze in non-fungible token (NFT) trading, with traders willingly paying up to get their hands on exclusive digital art pieces.","Along with the falling fee level, there has also been a decline in the number of transactions per day on Ethereum. From a high of 1.717m transactions on May 9 last year, the transaction count stood at 1.152m on Monday this week.","Meanwhile, Bitcoin transaction fees have managed to stay fairly low and stable between USD 0.3 and USD 1 for the past 12 months. This comes after a steep drop in the median fee level in April last year, bringing the median fee down from a peak of USD 28.39 on April 21 to just USD 0.23 on July 24 the same year.","On Sunday, the median transaction fee on Bitcoin dipped to USD 0.33, before rising slightly to USD 0.4 on Monday this week.","Like Ethereum, Bitcoin has also seen a decline in the number of transactions processed per day. From a high of 397,207 in January 2021, the count dropped to 240,242 as of Monday this week.","The stark difference in transaction fees on Bitcoin and Ethereum shows that demand for Ethereum block space has remained high through much of the current bear market. Notably, that demand has persisted despite the emergence of more Layer-2 networks like Optimism and Arbitrum, which help alleviate congestion on Ethereum’s main blockchain.","It’s worth noting that the USD fee level on any crypto network tends to drop as crypto prices drop, given that the fee is priced in each network’s native cryptocurrency.","At 10:31 UTC, ETH is trading at USD 1,128, up 5% in a day and down 5.5% in a week. At the same time, BTC is up 1.6% in a day and down 4.7% in a week, currently changing hands at USD 19,768.","____","Learn more: \n– Cautious Bullishness in Bitcoin & Crypto Amid Warnings of Further Downsides\n– Coin Race: Top Winners\/Losers of June, Q2, and H1; Bitcoin Sees Worst Month Ever\n\n– Bitcoin Funds See Largest Outflows on Record ‘By a Wide Margin’ – CoinShares\n– Don’t Fear the Reaper: Why the Market Downtrend Is Good for Crypto\n\n– How The Ethereum Merge Could Impact Staking Yields\n– ApeCoin Community Narrowly Wins Vote to Stay on Ethereum"],"entity":[{"type":"4.7%","content":"PERCENT"},{"type":"July 24","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 21","content":"DATE"},{"type":"1.6%","content":"PERCENT"},{"type":"USD 19,768","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"last Sunday","content":"DATE"},{"type":"Monday this week","content":"DATE"},{"type":"Bitcoin & Crypto Amid Warnings of Further Downsides","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"December 6 of 2020","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Sunday","content":"DATE"},{"type":"Crypto\n\n– How The Ethereum Merge Could Impact Staking Yields\n– ApeCoin Community Narrowly Wins Vote","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"April last year","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"5.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"May 12 last year","content":"DATE"},{"type":"December 2020","content":"DATE"},{"type":"May 9 last year","content":"DATE"},{"type":"June","content":"DATE"},{"type":"USD 1","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Ethereum","Fees"],"authors":["Fredrik Vold"]}