{"summary":"VERTU Introduces METAVERTU2, a Revolutionary Web3 and AI Smartphone – How Does It Work?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vertu-introduces-metavertu2-a-revolutionary-web3-and-ai-smartphone-how-does-it-work.htm","publishDate":"2023-11-03T12:00:30","id":18535,"type":null,"title":"VERTU Introduces METAVERTU2, a Revolutionary Web3 and AI Smartphone – How Does It Work?","category":["Blockchain News "],"content":["Manufacturer of luxury handmade mobile phones VERTU has revealed its METAVERTU2: a “highly secure” Web3 smartphone with extensive storage capacity, AI model tagging data, and AI agents managing tasks. It is described as an AI companion called “One More Brain.”","The device is made with imported rare leather materials equivalent to Birkin bags, and 316L surgical stainless steel comparable to Swiss luxury watches, according to the press release.","The smartphone is available in four variants: one carbon fiber and three crocodile leather editions.","Clients can get the carbon fiber edition for $5,100 and the leather edition for $8,100.","There are also more options for “enthusiast,” including various premium leathers, rare metals, and precious gemstones, “allowing endless customization possibilities.”","Besides being a phone, METAVERTU2 is a luxurious fashion accessory that allows owners to show their taste and uniqueness, VERTU said.","The company states that the new phone seamlessly integrates decentralized Web3 and AI technologies to create a “highly private AI phone.”","The phone uses blockchain technology as a security foundation, VERTU said. Dual AI models run in parallel and a fusion of large and small models to ensure a balance between user experience and privacy protection.","The device simplifies tasks and analyzes problems from the user’s perspective, while it conceals thoughts akin to a biological brain, the company claims.","“By integrating global knowledge with personal data, METAVERTU2 creates a learned “Second Brain” that resonates with human thought patterns.”","METAVERTU2, claim its creators, comes with intellectual expansion and capability upgrades, compared to its predecessor – as well as “emotional companionship,”","It creates a customized virtual companion for each user, and it has an AI assistant to help with everyday tasks, including shopping and planning various events.","The device offers private and personalized AI experiences, “bringing the sci-fi concept of a personal AI assistant from movies into reality,” VERTU said.","The company argued that,","“This advancement redefines the relationship between users and smart devices, injecting new vitality into the mobile phone industry. Soon, everyone might have their own omnipotent butler in the form of an AI phone.”","VERTU announced this new device in September, stating that it was building on the success of last year’s METAVERTU.","VERTU’s encrypted system, METASPACE, has been improved to allow distinct fingerprint locks for different systems in METAVERTU2. This enables individual privacy systems to be created for storing personal information, the company said.","The phone has incorporated TEE and SE chips and core hardware encryption for protection.","It further comes with the distributed encrypted blockchain private key backup technology KEYBOX.","The device has the existing point-to-point encrypted calls, as well as the novel point-to-point privacy storage VBOX.","For additional (personalized) security, the phone has extra features such as one-click destruction and timed restoration.","As for specs, METAVERTU2 comes with the Snapdragon 8 Gen2 chip, a 4233mm2 synthetic VC, a 5100mAh ultra-large-capacity battery, and 65W ultra-fast charging."],"entity":[{"type":"$8,100","content":"MONEY"},{"type":"$5,100","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"VERTU","content":"PERSON"},{"type":"Birkin","content":"LOCATION"}],"hashtag":["Blockchain","Privacy","Security","Web3"],"authors":["Sead Fadilpašić"]}