{"summary":"The head of the Association for Digital Asset Markets (ADAM) Michelle Bond launched her campaign for a seat in Congress representing New York’s 1st district.\nBond is running as a Republican and positioning herself as a businesswoman, in line with some of former President Donald Trump’s policies.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152774\/crypto-trade-organization-ceo-michelle-bond-anounces-run-for-congress","publishDate":"2022-06-17T18:22:50","id":1853,"type":null,"title":"Crypto trade organization CEO Michelle Bond announces run for Congress","category":["Policy"],"content":["The CEO of crypto trade association ADAM Michelle Bond announced Thursday she is running for a US House seat representing New York's 1st district.","The native Long Islander has her sights set on the GOP ticket for that district, where Republican incumbent Lee Zeldin has left a clear path open by opting to run for governor instead.","Bond has positioned herself as a pro-life, pro-Trump businesswoman, standing against \"career politicians\" and the current administration's economic policies, which she blames for high inflation levels and gas prices.","Prior to helming ADAM (which stands for Association for Digital Asset Markets), Bond was the global head of policy and regulatory affairs at two fintech companies.","Bond is no stranger to Capitol Hill, having also served as international counsel for the Securities and Exchange Commission (SEC) and as a subject matter expert on the US Senate Committee on Banking, Housing, and Urban Affairs — specifically for the Dodd-Frank Act, which tightened up regulation around the swaps market in the aftermath of the 2008 financial crisis.","At ADAM, Bond has tried to carry out the main mission of the organization, which is to encourage market integrity by setting a code of conduct for companies to follow. In other words, to promote self-regulation in crypto.","Per the Republican candidate, the group is often cited by regulators and legislators alike.","More recently, the group engaged with Senator Cynthia Lummis, who has recently introduced a <a href=\"https:\/\/www.theblock.co\/post\/151352\/after-months-of-hype-lummis-gillibrand-crypto-bill-is-more-media-event-than-law\" data-v-f87c67ca=\"\">long-awaited bill<\/a> (the Responsible Financial Innovation Act) clarifying a number of parameters regarding crypto regulation, including how much oversight different federal agencies should have. Notably, it states that \"digital assets that meet the definition of a commodity, such as bitcoin or ether,\" fall under the purview of the Commodity Futures Trading Commission (CFTC).","As the crypto industry deals with the fallout from events like the Terra crash and Celsius' freeze on all transfers, Bond commented on possible regulatory implications that might arise from these events.","\"I think stablecoins are sort of the low-hanging fruit. I expect that there is going to be a lot of policy-making that happens,\" she said. \"Disclosure is really like the key thing that people have been pointing to(...) Disclosure is not sporadic tweets.\"","To be clear, Bond said crypto is not the priority on her agenda as it pertains to her ambitions to take a seat in Congress. Instead, she is focused on representing what she believes are the interests of the people from her district (Suffolk), which skew mainly toward the economy.","\"My job in Congress would be very different actually from the job I have now. I would use my experience from the business world to inform my decisions,\" she said. \"(Crypto is) obviously a hot policy area. I think we're gonna see continued focus from Capitol Hill on that debate,\" she said."],"hashtag":["CONGRESS","SEC"]}