{"summary":"GoFundMe Delists Tornado Cash Legal Crowdfunding Campaign – Here’s More","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gofundme-delists-tornado-cash-legal-crowdfunding-campaign-heres-more.htm","publishDate":"2024-02-16T15:45:07","id":18546,"type":null,"title":"GoFundMe Delists Tornado Cash Legal Crowdfunding Campaign – Here’s More","category":["Blockchain News "],"content":["Popular crowdfunding network GoFundMe has pulled down the legal aid fundraiser for Tornado Cash co-founder and developer, citing a breach.","In a Feb 15 X (formerly Twitter) post, Ryan Adams, an investor in Bankless Ventures alerted the digital asset community of the recent developments in the campaign.","He noted that GoFundMe shut down the campaign and canceled the money sent to Alexey Pertsev and Roman Storm.","On Feb 14, GoFundMe shut down the campaign for an alleged breach of its rules and returned funds to donors.","The money we sent to @rstormsf was cancelled by @gofundme – they shut it down.","I thought this might happen but am still surprised.","Good thing we have an uncensorable money system so we can still fund civil liberties like the right to a fair trial.","Resending $10k with crypto. https:\/\/t.co\/5Ud4ELiaK5 pic.twitter.com\/glRXwtXPBw","— RYAN SΞAN ADAMS – rsa.eth (@RyanSAdams) February 15, 2024","","The platform cited a breach of Term 22 to include any activity that GoFundMe in its discretion be objectionable, restrict others from using the facility, or expose the platform, users, or employees to any form of liability.","The X campaign account for both men wrote to users, adding that Term 22 can simply imply that they do not like the campaign.","“Important campaign update. Yesterday, @gofundme notified the campaign organizers that the fundraiser for @rstormsf’s legal defense was canceled. They cite Term 22 of their terms of service, which can be interpreted to mean they simply didn’t like the fundraiser.”","Adams noted that he suspected these events might happen, but crypto alternatives to donate to the campaign are available.","He disclosed the team’s decision to resend the $10,000 previously donated to the cause. “Good thing we have an uncensorable money system so we can fund civil liberties like that right to a fair trial,” he added.","Cryptocurrency users criticized the platform’s decision to bring down the donations without a concrete reason.","Some users described it as impeding freedoms, while others pointed to the dangers of centralization, hoping for more decentralized donation optoions.","The United States Department of Justice (DOJ) filed charges against Storm, alleging the facilitation of money laundering.","The SEC claims Tornado Cash facilitated the infamous Lazarus Group in their activities to bypass US sanctions. Pertsev was arrested in the Netherlands on charges related to money laundering in 2022 and was released from prison awaiting trial.","Last month, Storm posted a video on X soliciting support from the crypto community to fund legal fees against the DOJ.","“2024 is the year that will define the rest of my life. Honestly, I’m scared. But also hopeful that this community cares with a passion. Please donate towards my legal defense.”","Storm and Pertsev sought to raise $1.5 million but raked in only $30,000 before GoFundMe ended the campaign. Digital asset crowdfunding platform JuiceBox is now used to raise funds towards the goal.","In Canada, protesters turned to Bitcoin (BTC) in 2022 after GoFundMe took down their campaign as they challenged Covid 19 restrictions.","GoFundMe announced it would return $9 million to donors who raised funds for the Freedom Convoy Campaign."],"entity":[{"type":"RYAN SΞAN ADAMS","content":"PERSON"},{"type":"$1.5 million","content":"MONEY"},{"type":"Canada","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"the Netherlands","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Bankless Ventures","content":"ORGANIZATION"},{"type":"Freedom Convoy Campaign","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Ryan Adams","content":"PERSON"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"February 15, 2024","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"Feb 15","content":"DATE"},{"type":"United States Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"$10k","content":"MONEY"},{"type":"Pertsev","content":"PERSON"}],"hashtag":["Bitcoin","GoFundMe","tornado cash"],"authors":["David Pokima"]}