{"summary":"Isle of Man Seeks Public Input in Effort To Tighten Crypto Assets Regulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/isle-of-man-seeks-public-input-in-effort-to-tighten-crypto-assets-regulation.htm","publishDate":"2024-02-13T16:23:27","id":18548,"type":null,"title":"Isle of Man Seeks Public Input in Effort To Tighten Crypto Assets Regulation","category":["Blockchain News "],"content":["The Isle of Man has rolled out a public consultation on possible crypto assets regulation to protect investors in the jurisdiction.","In a Feb 13 release, financial authorities in the self-governing British Crown dependency sought models to expand its laws on crypto assets in line with global standards.","The 22-page document highlights the status quo of virtual assets regulation on the island while mapping out plans to meet global standards.","A significant purpose of the discussion paper is for stakeholders to view the Financial Services Act (2008) and make contributions through public consultation.","“Open dialogue With stakeholders is an essential element for successful development of authority proposals. Constructive feedback will help the authority reach an informed decision on the contents of the proposals and manner of implementation.”","Per the press release, the National Risk Assessment identified certain activities of crypto actors posing money laundering and terror financing risks.","Furthermore, these risks extend to individual users with the high volatility of crypto assets, and industry collapses in the sector.","The paper flags some non-fungible tokens (NFTs) and Initial Coin Offerings (ICOs) that ended badly for several investors. Notably, the recent FTX implosion, which saw billions wiped out of the market, and the MT Gox debacle were attributed to regulatory failures.","Although most persons engaged in crypto-related activities are registered and regulated within the island’s AML\/CFT framework, certain activities remain unregulated by the authority.","In February 2022, the Isle of Man Authority made similar moves to get responses from stakeholders. All nine responses affirmed that crypto-related companies should be regulated, although the degree varied.","Crypto executives feel broader regulations would give the sector the needed credibility to drive adoption like its counterparts in traditional finance.","A recurring theme by executives was the demand for regulations to be purpose-built rather than a strict framework similar to other jurisdictions.","Financial regulators on the Island have proposed five possible pathways it can follow for a more refined cryptocurrency market.","First, it lists maintaining the current approach and simply complying with the Financial Action Task Force Recommendations with companies operating under the same rules.","Secondly, authorities proffer extending the definition of “investment” to include crypto assets. This aims to prevent regulatory arbitrage by removing ambiguity regarding tokens covered by the definition.","This suggestion falls short because the nature of crypto assets isn’t similar to traditional businesses, and placing them in that category would require more qualifications.","“For example, most businesses engaged in crypto asset activity in the Isle of Man would need to demonstrate and establish a track record in investment business to obtain a Class 2 (Investment Business) license under the FSA08.”","Other options include a new framework for issuing stablecoins, advising in crypto assets, and operating as a crypto asset service provider."],"entity":[{"type":"February 2022","content":"DATE"},{"type":"Island","content":"LOCATION"},{"type":"National Risk Assessment","content":"ORGANIZATION"},{"type":"Isle of Man Authority","content":"ORGANIZATION"},{"type":"CFT","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Crypto Assets","Isle of Man","Regulation"],"authors":["David Pokima"]}