{"summary":"BlackRock’s IBIT Reports Another $320M in Inflows, Larry Fink Hails it as “Fastest-Growing ETF Ever”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blackrocks-ibit-reports-another-320m-in-inflows.htm","publishDate":"2024-03-28T06:45:23","id":18543,"type":null,"title":"BlackRock’s IBIT Reports Another $320M in Inflows, Larry Fink Hails it as “Fastest-Growing ETF Ever”","category":["Bitcoin News "],"content":["BlackRock’s iShares Bitcoin Trust (IBIT) continues to gain traction in the cryptocurrency market, with recent data revealing a significant influx of $320 million in new investments. ","This surge in inflows comes as BlackRock CEO Larry Fink has praised IBIT as the “fastest-growing ETF in the history of ETFs.”","In a recent interview with Fox Business, Fink expressed his surprise and satisfaction with IBIT’s performance.","“Nothing has gained assets as fast as IBIT in the history of ETFs.” ","He emphasized that the trust’s success surpassed his expectations, particularly during its first 11 weeks of trading.","Since its launch, IBIT has captured the attention of investors, accumulating a total of $13.5 billion in inflows within the first 11 weeks. ","Notably, on March 12, the trust reached a daily high of $849 million in flows. ","On average, IBIT receives over $260 million in daily inflows, contributing to its remarkable growth.","Fink acknowledged the significance of this achievement, highlighting the positive impact of IBIT on the market. ","He emphasized that the trust has enhanced liquidity and transparency, creating a more robust ecosystem for Bitcoin investments. ","Fink also expressed his bullish outlook on Bitcoin’s long-term viability and the increasing demand from retail investors.","Currently, IBIT holds a substantial $17.1 billion worth of Bitcoin, according to BitMEX Research. ","Impressively, it took only two months for the trust to surpass the $10 billion mark, a milestone that the first gold ETF took two years to achieve. ","Among the approved ETFs, IBIT ranks second in terms of Bitcoin holdings, trailing behind the Grayscale Bitcoin Trust, which holds $23.6 billion in BTC.","On March 27, spot Bitcoin ETFs collectively received net inflows of $243 million. ","According to data from SoSoValue, BlackRock ETF IBIT had a single-day net inflow of $323 million, while Ark Invest’s ARKB recorded a single-day net inflow of $200 million.","Conversely, Grayscale’s GBTC experienced a single-day net outflow of $299 million.","According to SoSoValue, Bitcoin spot ETFs saw total net inflows of $243 million on March 27. Grayscale ETF GBTC had a single-day net outflow of $299 million, BlackRock ETF IBIT had a single-day net inflow of $323 million, Ark Invest & 21Shares ETF ARKB had a single-day net inflow… pic.twitter.com\/xB752KhK4f","— Wu Blockchain (@WuBlockchain) March 28, 2024","","The price of Bitcoin has maintained the $70,000 mark amid the news that the London Stock Exchange plans to introduce Exchange-Traded Notes (ETNs) for BTC and ETH in May.","The decision follows the exchange’s previous announcement that it would accept applications for crypto ETNs during the second quarter of this year.","In a recent note, crypto asset trading firm QCP Capital also revealed that asset managers continue to add Bitcoin allocations as a “portfolio diversifier.”","Additionally, requests for structured products such as Accumulators and FCNs have flooded in, revealing a strong appetite for diversifying investment portfolios with BTC, the Singapore-based crypto firm wrote. ","⁠”Anecdotally, wealth desks at major banks have been pleasantly shocked at the tremendous demand from clients for BTC spot ETFs, along with requests for structured products like Accumulators and FCNs.”","QCP even said it expects the leading cryptocurrency to maintain momentum, breaking all-time highs and potentially reaching the coveted $100,000 mark. "],"entity":[{"type":"$23.6 billion","content":"MONEY"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"$299 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"March 27","content":"DATE"},{"type":"IBIT","content":"ORGANIZATION"},{"type":"$849 million","content":"MONEY"},{"type":"Fink","content":"PERSON"},{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"Fox Business","content":"ORGANIZATION"},{"type":"$10 billion mark","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"March 28, 2024","content":"DATE"},{"type":"$323 million","content":"MONEY"},{"type":"$320 million","content":"MONEY"},{"type":"second quarter of this year","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"SoSoValue","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"$243 million","content":"MONEY"},{"type":"$260 million","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$70,000","content":"MONEY"},{"type":"$17.1 billion","content":"MONEY"},{"type":"$13.5 billion","content":"MONEY"},{"type":"BitMEX Research","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Blackrock","Blackrock ETF","IBIT"],"authors":["Ruholamin Haqshanas"]}