{"summary":"Bitcoin and Ethereum on their Way to Mass Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-on-their-way-to-mass-market-1649.htm","publishDate":"2018-01-03T05:26:00","id":18550,"type":null,"title":"Bitcoin and Ethereum on their Way to Mass Market","category":["Bitcoin News "],"content":["According to all data, 2017 is the year of the cryptocurrency – which is when it saw the largest spike in search traffic, transactions, public interest and of course prices. Those saying that Bitcoin, but also other cryptocurrencies, are a bubble come a dime a dozen.","Although crypto aficionados will vehemently deny the possibility of a bubble, it remains hard to know. There is, after all, only one way for cryptocurrencies to not pop: mass adoption. Luckily for the industry, most of our popular coins, led by Bitcoin and Ethereum, are already on the right path. Bitcoinsaltcoins.com points out the proof to this through four distinct trends.","Steady traffic growth","A total market cap of USD 150 billion in the case of Bitcoin and USD 69 billion for Ethereum vouch for this trend. Google Trends data also proves people’s interest in the young industry, given that everybody wants to learn more about it through googling. There was a significant correlation between search traffic and prices, although correlation does not always equal causation.","In short, after a while, the network size of Bitcoin may become too big to fail – there will always be somebody interested in it, at least in terms of a speculative asset. This may not be the endgame for most early investors who would like to see Bitcoin grow into an accepted currency, but at least it is a guarantee against failure.","Consumer-friendly applications","Following the ever-increasing wave of initial coin offerings (ICOs), new features, mostly on the blockchain, are also trying to find a place in the industry. What’s possibly the best feature of ICOs and the projects they are representing is the fact that they are getting increasingly more user-friendly. Growth from developer-oriented apps and tokens towards people without as much understanding of even computer sciences, let alone anything else, may be the shift needed for mass adoption.","Many of these projects are looking for ways to create an often decentralized environment (unless specified differently) for what they want to do. Some projects are looking for ways to bring more gender equality into this glaringly male-dominated field; others are simply creating a place for game developers to make games, eliminating the bias of centralized market places and fundraising platforms.","Increased public awareness","How many people do you know that haven’t heard the term Bitcoin? It has swiftly grown from a niche field to a household name. Although increased public awareness is not an exact, measurable metric, it can be intuitively observed – not very many people are going to look at you bewildered when you mention crypto.","Educating people is also an important aspect of awareness, as this is a new frontier that everyone is naturally scared of. However, the rapid development of technology within the past few decades has already taught people to be more accepting of new things – for example, the internet wasn’t so bad after all, right? Educating people about blockchain and cryptocurrency is the only surefire way to have them look for possibilities rather than weaknesses in the industry.","Industry-wide growth","There is a term in the world of forecasting called “cone of uncertainty,” used by experts to determine a project’s chances of reaching a milestone based on previously accomplished milestones. Most of Bitcoin’s future milestones are based on continued growth, while Ether and other tokens will likely follow Bitcoin’s expansion pattern. This has already been proven to be the case: whenever Bitcoin rose, so did the others – and the same was true for the prices falling.","These metrics are far from being conclusive, but are doing a good enough job of it. As the industry grows, it continues to establish the model for cryptocurrencies and indicates a greater likelihood of reaching the final milestone of mass adoption.","Although the general consensus of cryptocurrencies being volatile still stands (as does the old, “don’t invest more than you can afford to lose”), the industry is moving into mass adoption territory quickly and with few hiccups – other than the general confusion regarding potential regulation. But as Jim Rohn, an American entrepreneur, author and motivational speaker, would put it, “If you are not willing to risk the usual, you will have to settle for the ordinary.”"],"entity":[{"type":"2017","content":"DATE"},{"type":"USD 69 billion","content":"MONEY"},{"type":"Jim Rohn","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Google Trends","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","Cryptocurrency","Ethereum"],"authors":["Sead Fadilpašić"]}