{"summary":"Is DogWifHat Dead? Crypto Expert Tweets $1 Price Target, New Meme Coin WienerAI Raises $1.4 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-dogwifhat-dead-crypto-expert-tweets-1-price-target-new-meme-coin-wienerai-raises-1-4-million.htm","publishDate":"2024-05-10T12:45:16","id":18559,"type":null,"title":"Is DogWifHat Dead? Crypto Expert Tweets $1 Price Target, New Meme Coin WienerAI Raises $1.4 Million","category":["Industry Talk "],"content":["A top crypto influencer on X believes the popular Solana meme coin DogWifHat ($WIF) could tumble all the way down to a dollar from its current price of $3.17. ","In a recent tweet, Bluntz Capital (@Bluntz_Capital) cautioned, “price action on this bounce over the last 3 weeks has been slow, overlapping, and corrective looking.”","Bluntz further argues that WIF’s current gains could be a brief wobble before the token crashes and bottoms out at a dollar. ","i thought the abc might be done on $WIF, but since that wick into $1.8 the ensuing price action on this bounce over the last 3 weeks has been slow, overlapping, and corrective looking.","am now leaning towards this move up being the (B) or (x) wave and a C wave down to $1 still… https:\/\/t.co\/p5HhwIZz0t pic.twitter.com\/bHFmNGY4NT","— Bluntz (@Bluntz_Capital) May 7, 2024","","Since Bluntz joined the ByBit copy trading platform a year ago, he has been ranked as one of the top influencers, meaning he has consistently made money for his followers.","Still, DogWifHat’s current price performance does not reflect a decline.","WIF is up 12% in the last 24 hours and 15% in the last week. It’s moving broadly in line with the rest of the market, where most leading projects are up today.","The project with the second largest gains among the top five meme coins by market capitalization is Pepe Coin.","PEPE rose 6.8% to change hands at $0.05862 as of this writing. It is also up 13% in the last seven days. ","Both meme coins outdid market leaders Bitcoin ($BTC) and Ethereum ($ETH). Bitcoin, the world’s largest cryptocurrency, grew 3.5% overnight to trade at $63,176, while Ethereum added 2.2% to hit $3,037.","Like the market leaders, WIF rallied throughout March. However, it diverged a little at the end when the meme coin continued rallying strongly and actually rose to set a new all-time high of $4.83 on March 31. Today’s price represents a 34.2% decline since then. ","DogWifHat currently has a Relative Strength Index (RSI) of 57. This has been climbing since midweek, indicating buying momentum. If it doesn’t cool off, investors may well see the beginning of the correction described by Bluntz. ","Bluntz’s prediction may prove to be prophetic for WIF holders in the mid-term. Should the currency rebound from a dollar, which he implies, then there will be no damage done. However, meme coins highlight the inherently volatile nature of crypto.","A new generation of meme coins is cropping up though which bring bundles of utility along with laughs.","One of the finest representatives of this new generation of coins is WienerAI. $WAI is a brand new meme token and AI companion that may yield some potentially eye-watering rallies once word gets out about its core offering.","How staking your $WAI feels.https:\/\/t.co\/g0LrikQz90 pic.twitter.com\/3VneRo9wTq","— WienerAI (@WienerDogAI) May 9, 2024","","The presale is not even a month old and it has already quietly taken in $1.4 million.","Touted as a “Revolutionary AI Trading partner”, WienerAI ($WAI) is a digital companion that gives its owners user-friendly AI-enhanced trading advice, seamless swap functionality and zero fees.","The WienerAI smart contract was audited by Coinsult, a blockchain security platform that conducts security checks on various crypto and blockchain platforms. Around 20% of $WAI’s supply is for staking. WienerAI’s website encourages ","buyers to stake during the presale, in order to take advantage of the lucrative yield, which is currently 660% APY. ","Stay on top of WienerAI news over on X and Telegram. ","Join the presale now over on the WienerAI website.",""],"entity":[{"type":"$ETH","content":"MONEY"},{"type":"Coinsult","content":"ORGANIZATION"},{"type":"$WIF","content":"MONEY"},{"type":"$WAI","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$1.8","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$4.83","content":"MONEY"},{"type":"34.2%","content":"PERCENT"},{"type":"May 9, 2024","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Pepe Coin","content":"PERSON"},{"type":"$BTC","content":"MONEY"},{"type":"6.8%","content":"PERCENT"},{"type":"3.5%","content":"PERCENT"},{"type":"$63,176","content":"MONEY"},{"type":"2.2%","content":"PERCENT"},{"type":"$3,037","content":"MONEY"},{"type":"$3.17","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"660%","content":"PERCENT"},{"type":"Bluntz","content":"PERSON"},{"type":"$0.05862","content":"MONEY"},{"type":"WIF","content":"ORGANIZATION"},{"type":"$1.4 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"May 7, 2024","content":"DATE"}],"hashtag":["DogWifHat","wai","wienerai"],"authors":["Tim Hakki"]}