{"summary":"Ethereum’s Growth Could Spike With Increased Institutional Investments In First Half of 2024: Coinbase","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereums-growth-could-spike-with-increased-institutional-investment-in-first-half-of-2024-coinbase.htm","publishDate":"2024-02-09T19:54:03","id":18558,"type":null,"title":"Ethereum’s Growth Could Spike With Increased Institutional Investments In First Half of 2024: Coinbase","category":["Altcoin News "],"content":["With a fresh analysis released on February 8, Coinbase’s research division shed light on the anticipated growth in Ethereum’s trading dynamics during the initial six months of 2024.","Coinbase analysts highlighted growth points after the approval of spot Bitcoin (BTC) ETFs in decentralized finance (DeFi) and the wider crypto market.","According to the report, Ethereum has moved slowly in recent months as Bitcoin continues to attract more institutional investments.","Despite Ethereum’s slow growth compared to others, analysts project institutional investments in the first half of the year have the potential to change the narrative.","“…we believe there’s room for ETH to play catch up to its peers in 1H24. Although there was some rotation into ETH after the launch of spot bitcoin ETFs, the momentum was arrested by liquidations from a large defunct crypto lender alongside pressure from the sale of ETH options.”","The anticipation of growth largely banks on the potential approval of spot Ethereum ETFs, mirroring the market acceptance Bitcoin has enjoyed. Such a move could open up new windows of opportunity for Ethereum.","","ETH gained over 80% in 2023 and recorded increasing DeFi numbers and institutional fund investment despite playing second fiddle to Bitcoin’s soaring ETF narratives.","Bitcoin led the pack with over 158% gains in 2023 as institutional funds trickled in from BlackRock’s ETF application wiping out losses from the horrid crypto winter in 2022.","Ethereum’s growth on the institutional front was also overshadowed by Solana (SOL) which recorded a string of inflows into investment funds earning the description as an institutional investor favorite.","This year, the approval of spot Bitcoin ETFs has seen flows into the market leader and altcoins but the momentum of Ethereum is still below the mark projected by most analysts.","Last year, a group of wealth managers projected Ether as having the highest growth potential among top crypto assets despite figures at the time.","The firms looked at the activities around decentralized applications (dApps) on the Ethereum Network and their performance during a bull run to make their predictions.","Additionally, the staking mechanism on the blockchain after it transitioned to a Proof-of-Stake (POS) model can attract new users who want to earn staking rewards.","Similarly, a publication by Grayscale noted the underperformance of Ethereum in 2023 as its smart contract growth was relatively more than other networks along with other metrics.","“Ether produced strong returns in 2023 but underperformed Bitcoin as well as certain other smart contract blockchain tokens. We think this reflects Bitcoin-specific positives this year and a slower recovery in Ethereum’s on-chain activity.”"],"entity":[{"type":"80%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"158%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"February 8","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Ethereum Network","content":"ORGANIZATION"},{"type":"Solana (SOL","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Coinbase","ETF","Ethereum"],"authors":["David Pokima"]}