{"summary":"U.S. House Financial Services Committee Chair Patrick McHenry Blasts Gary Gensler, SEC Over ETH Security Stance","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/patrick-mchenry-blasts-gary-gensler-over-eth-as-a-security.htm","publishDate":"2024-04-30T22:01:25","id":18565,"type":null,"title":"U.S. House Financial Services Committee Chair Patrick McHenry Blasts Gary Gensler, SEC Over ETH Security Stance","category":["Ethereum News "],"content":["House Financial Service Committee Chair Patrick McHenry took to X on April 30 to claim United States Securities and Exchange Commission (SEC) Chair Gary Gensler “knowingly misled Congress when pressed on the classification” of Ethereum (ETH) in his testimony to the Financial Services Committee last April.","McHenry’s allegation comes just a day after unredacted court documents filed by Consensys Software Inc. in its case against the SEC revealed that Gensler and the federal agency appeared to believe ETH was a security for a little more than a year.","The Consensys filing shows that the SEC Director of Enforcement, Gurbir S. Grewal, launched an investigation on March 28 of last year over the “possible offers and sales, since at least 2018, of ‘certain securities, including, but not limited to ETH.’”","#ICYMI: New court filings indicate that @SECGov Chair Gary Gensler knowingly misled Congress when pressed on the classification of #ETH at a @FinancialCmte hearing to conduct oversight of his agency.","📖 Read my full statement 👇 pic.twitter.com\/8osMpbY6Iu","— Patrick McHenry (@PatrickMcHenry) April 30, 2024","","On April 18, 2023, Gensler played coy over whether or not ETH could be classified as a security while dodging questions from U.S. lawmakers.","“New court filings show this was an intentional attempt to misrepresent the Commission’s position,” McHenry stated. “Classifying Ether as a security contradicts previous statements of the SEC and Chair Gensler – yet another example of the arbitrary and capricious nature of the agency’s regulation by enforcement approach to digital assets.”","Several crypto community members replied to McHenry on X to express their frustration over congressional inaction regarding the SEC’s handling of cryptocurrency regulation.","“Good work! I’m sure Gensler is shaking in his boots knowing another strongly worded letter may be coming his way,” one such user wrote.","“Words, words, words, when will Gary be held accountable for my (our) losses,” said another.","The SEC has long been scrutinized for its heavy-handed regulatory approach to crypto. Earlier this month, the commission sent a Wells notice to Consensys, warning the ETH developer of an upcoming enforcement action.","Consensys has since filed back with its own litigation, citing regulatory overreach by the SEC.","“The U.S. Securities and Exchange Commission (the “SEC” or the “Commission”) seeks to regulate ETH as a security, even though ETH bears none of the attributes of a security — and even though the SEC has previously told the world that ETH is not a security, and not within the SEC’s statutory jurisdiction,” the lawsuit stated.","McHenry used his statement condemning Genlser to further push the Financial Innovation for Technology for the 21st Century Act (FIT21), which House Republicans introduced last summer.","We have launched a Resources page for advocates to learn about the two important crypto-related bills working their way through congress right now:","1. FIT21 (Market Structure Bill)\n2. Clarity for Stablecoin Act","Get educated and get ready.https:\/\/t.co\/0dCTMMd7d7","— Stand With Crypto🛡️ (@standwithcrypto) January 10, 2024","","If approved, FIT21 would establish a regulatory framework for players in the crypto industry, potentially warding off additional enforcement actions by the SEC."],"entity":[{"type":"House Financial Service Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"January 10, 2024","content":"DATE"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"last April","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"April 30","content":"DATE"},{"type":"House","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Consensys Software Inc.","content":"ORGANIZATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"March 28 of last year","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"April 18, 2023","content":"DATE"}],"hashtag":["ETH","Gensler","SEC"],"authors":["Julia Smith"]}