{"summary":"Bitcoin Miner Core Scientific Announces Post-Bankruptcy Comeback to Return to Nasdaq","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-miner-core-scientific-announces-post-bankruptcy-comeback-to-return-to-nasdaq.htm","publishDate":"2024-01-24T07:17:08","id":18573,"type":null,"title":"Bitcoin Miner Core Scientific Announces Post-Bankruptcy Comeback to Return to Nasdaq","category":["Bitcoin News "],"content":["Core Scientific has announced its return to the Nasdaq following a comprehensive reorganization post-bankruptcy.","According to Core Scientific’s recent release, the Bitcoin miner has emerged from its Chapter 11 bankruptcy with a significantly strengthened financial position. The reorganization process has enabled the company to reduce its debt by $400 million through the conversion of equipment lender and convertible note holder debt into equity.","This step is part of a broader plan designed to further improve the company’s balance sheet, potentially including the conversion of remaining convertible debt and the utilization of cash for debt reduction.","The company plans to “commence the listing of its common stock, tranche 1 warrants and tranche 2 warrants on the Nasdaq Global Select Market” with the symbols CORZ, CORZW and CORZZ on Jan. 24.","“Core Scientific is positioned as one of the largest bitcoin miners in North America, with specialized data centers in five U.S. states operating 724 megawatts of power,” the release reads.","“In addition to operating 16.9 exahash of energized hash rate for its bitcoin mining business as of Dec. 31, 2023,” said the company. “Core Scientific also operated 6.3 exahash for its hosting business for a total of 23.2 exahash.”","“This week marks an important step forward for us as we emerge, re-list and now focus all our energy on the exciting opportunities ahead of us,” said Core Scientific CEO Adam Sullivan. “Throughout the reorganization process, the Company has maintained its position as one of the largest and most consequential bitcoin miners in North America.”","“We are poised to execute our pragmatic growth plan, continue preparing for the coming halving and create value by transforming energy into high value compute for bitcoin mining and other potential applications,” said Sullivan.","The detailed reorganization plan stated that the company is set to deploy more Bitcoin miners and increase its capacity by more than 50% over the next four years with the developed data infrastructure.","The company also announced its new Board of Directors, aiming to bring their expertise to contribute to the restructuring operation."," "],"entity":[{"type":"Adam Sullivan","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"Nasdaq Global Select Market","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Dec. 31, 2023","content":"DATE"},{"type":"Board of Directors","content":"ORGANIZATION"},{"type":"Sullivan","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Jan. 24","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Bitcoin miner","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin Mining","Nasdaq"],"authors":["Hongji Feng"]}