{"summary":"Taiwanese Crypto Exchange ACE Founder, Employees Arrested Over Fraud Allegations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/taiwanese-crypto-exchange-ace-founder-employees-arrested-over-fraud-allegations.htm","publishDate":"2024-01-05T08:49:03","id":18570,"type":null,"title":"Taiwanese Crypto Exchange ACE Founder, Employees Arrested Over Fraud Allegations","category":["Altcoin News "],"content":["Taiwan’s leading crypto exchange ACE and its masterminds have been accused of making false claims around speculative token listings to defraud investors.","The local city police on Wednesday conducted multiple raids, arresting ACE founder David Pan, and co-conspirator Lin Nan. A total of 14 more employees at 15 locations across various cities were arrested.","Per a local news report, the New Taipei City Criminal Police Brigade investigated the fraud and seized crypto assets worth at least NT$200 million ($6.4 million).","According to the allegations, Pan and Lin, along with their team used social media platforms to promote sham offerings tied to “worthless” cryptos including MOCT.","“The police said that Lin Nan and Pan Nan cooperated and used fake advertisements to deceive more than 100 investors into investing in worthless virtual currencies in the past three years,” the report read.","The fraudsters allegedly created fear of missing out (FOMO) around these speculative assets, promising quick riches. ACE exchange claimed that digital assets are the latest technology and bragged that some cryptos are extremely bullish in the future.","The remuneration was set high and the operation was led by a professional team, the report added.","The police have booked cases under the Criminal Law, the Money Laundering Prevention Act, and the Banking Act. Lin and Pan however did not cooperate with the police during the enquiry and denied the charges against them.","ACE’s website responded to the allegations and media reports, stating that none of the employees were involved in the case.","“ACE employees are fully cooperating with the prosecutor’s investigation as witnesses. Some media reported that our company’s employees were involved in the case, which is not true,” Wang Chenhuan, President of ACE Exchange, noted.","In yet another update on Friday, ACE announced the delisting of MOCT\/TWD trading pair, starting Monday. The exchange assured that all pending orders will be automatically removed following the delisting.","“Regarding disputes and violations involving specific project parties, ACE has fully cooperated with the investigation and has not had any impact on ACE’s operations.”","It confirmed that the media reports on ACE, is due to the fact that some currencies listed in 2019 were involved in illegal activities."],"entity":[{"type":"NT$200 million ($6.4 million","content":"MONEY"},{"type":"Wang Chenhuan","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Lin Nan","content":"PERSON"},{"type":"New Taipei City Criminal Police Brigade","content":"ORGANIZATION"},{"type":"ACE Exchange","content":"ORGANIZATION"},{"type":"TWD","content":"ORGANIZATION"},{"type":"David Pan","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Pan Nan","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":["ACE Exchange","Crypto fraud","Taiwan"],"authors":["Sujha Sundararajan"]}