{"summary":"TRON Blockchain Accounted for 45% of Illicit Crypto Volume in 2023: TRM Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tron-blockchain-accounted-for-45-of-illicit-crypto-volume-in-2023-trm-report.htm","publishDate":"2024-03-29T08:10:30","id":18576,"type":null,"title":"TRON Blockchain Accounted for 45% of Illicit Crypto Volume in 2023: TRM Report","category":["Blockchain News "],"content":["TRM Labs data revealed that 2023 saw illicit crypto volumes drop by a third from $49.5 billion in 2022 to $34.8 billion. However, of all crypto frauds in 2023, TRON blockchain hosted 45%, up from 41% in 2022.","A new report from TRM’s blockchain intelligence team highlighted key trends in crypto illicit transactions through 2023.","Criminals have handled over $34 billion worth of cryptocurrencies, despite 9% decrease in year-on-year total illicit crypto funds from 2022-2023.","The report titled “The Illicit Crypto Economy,” also noted that almost half of all illicit crypto volume (45% in 2023) occurred on the TRON blockchain. This was followed by Ethereum blockchain at 24% and Bitcoin blockchain with 18%.","Further, Tether (USDT) stablecoin has seen the largest illicit volume last year, at $19.3 billion. “Approximately 1.63% of Tether volume was linked by TRM to illicit activity, compared to 0.05% of USDC,” it noted.","When asked about the factors that make TRON blockchain a potential hotbed for perpetrators, Angela Ang, senior policy advisor at TRM told Cryptonews that “one of the reasons for TRON’s popularity could be its low transaction fees and high speed.” This makes it cheap and quick to launder funds, she added.","“The availability of stablecoins like USDT on TRON could be another factor. For example, we know that USDT on TRON is the currency of choice for terrorist financing entities.”","While the damage on TRON blockchain was massive, 2023 witnessed a significant decline in the volume of illicit funds. There was a 30% decrease than the $49.5 billion recorded in 2022.","Also, sanctions volume was the largest driver of the overall decline last year. Crypto value linked to sanctioned entities fell 30% from $25.4 billion in 2022 to $16.2 billion in 2023."," ","Additionally, crypto hacks and exploits saw a dramatic 50% reduction to $1.8 billion in 2023 from $3.7 billion in 2022. On an average, every hack in 2023 saw $10 million compromised, against $21 million in 2022, it added.","“Many factors are likely to have contributed to the dent in crypto crime over 2023, including increased vigilance from businesses, fraud awareness among the general public, and pure chance,” the report read."],"entity":[{"type":"$25.4 billion","content":"MONEY"},{"type":"Illicit Crypto Economy","content":"ORGANIZATION"},{"type":"$34 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Angela Ang","content":"PERSON"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Tether (USDT","content":"ORGANIZATION"},{"type":"$3.7 billion","content":"MONEY"},{"type":"$16.2 billion","content":"MONEY"},{"type":"$19.3 billion","content":"MONEY"},{"type":"$49.5 billion","content":"MONEY"},{"type":"0.05%","content":"PERCENT"},{"type":"$34.8 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"TRM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"$21 million","content":"MONEY"},{"type":"41%","content":"PERCENT"},{"type":"18%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"1.63%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Cryptonews","content":"PERSON"}],"hashtag":["Crypto fraud","TRM Labs","Tron"],"authors":["Sujha Sundararajan"]}