{"summary":"Crypto Brokerage Genesis Global Trading Asks for More Time to Resolve Lending Issues – What is Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-brokerage-genesis-global-trading-asks-for-more-time-resolve-lending-issues-what-going-on.htm","publishDate":"2023-01-05T11:53:00","id":18583,"type":null,"title":"Crypto Brokerage Genesis Global Trading Asks for More Time to Resolve Lending Issues – What is Going On?","category":["Blockchain News "],"content":["Derar Islim, the interim CEO of crypto brokerage Genesis Global Trading, has told clients that they need more time to resolve the financial crisis plaguing its lending business.","In a statement on Wednesday, Islim claimed that they will be able to sort out the current tough financial position but they need some more time. He said:","“While we are committed to moving as quickly as possible, this is a very complex process that will take some additional time. We believe we can arrive at a solution.”","Islim claimed that Genesis’ derivatives and spot trading services still remain fully operational. “We remain focused on finding a solution for our borrowing and lending intermediation business and reaching the best outcome for all affected clients,” he added. ","In the wake of FTX’s collapse, Genesis Global Capital, the lending arm of Genesis which is also owned by Digital Currency Group (DCG), announced that it is temporarily suspending redemptions and new loan originations. In a statement on Twitter, Genesis says the “abnormal withdrawal requests” have exceeded its “current liquidity.”","Genesis has also revealed that it has $175 million locked in on its FTX trading account. While the company initially claimed they are not much affected by the loss, reports about Genesis Global Capital seeking to raise $1 billion and hiring restructuring advisors painted a different picture. ","In late November, DCG founder Barry Silbert told shareholders that the company owes $575 million to Genesis Global Capital. The loan, due in May 2023, was reportedly issued after Digital Currency Group took over Genesis’ exposure from the Three Arrows Capital default. ","The withdrawal freeze has also impacted other players in the crypto industry. For one, Gemini Trust Earn, a program that offered high-interest accounts thanks to a partnership with Genesis Global, also halted redemptions in mid-November. Reportedly, around $900 million of Gemini’s customer funds are locked in Genesis. ","As reported, some crypto investors have filed a class-action complaint against founders of the Gemini cryptocurrency exchange, Tyler and Cameron Winklevoss, accusing the twins and their exchange of fraud and violations of the Exchange Act. ","Meanwhile, the twins have lashed out at Silbert in a public letter. The duo accused Silbert of “bad faith” business practices, alleging that he owes the crypto exchange and its customers around $1 billion. They wrote:","“For the past six weeks, we have done everything we can to engage with you in a good faith and collaborative manner in order for you to pay back the $900 million that you owe. However, it is now becoming clear that you have been engaging in bad faith stall tactics.”",""],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"DCG","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"Silbert","content":"PERSON"},{"type":"$175 million","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Genesis Global","content":"ORGANIZATION"},{"type":"Tyler","content":"PERSON"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Genesis","content":"PERSON"},{"type":"mid-November","content":"DATE"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$575 million","content":"MONEY"},{"type":"Gemini Trust Earn","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Ruholamin Haqshanas"]}