{"summary":"US Spot Bitcoin ETFs See $217M Net Inflows as GBTC Posts Second Consecutive Positive Day","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-spot-bitcoin-etfs-see-217m-net-inflows.htm","publishDate":"2024-05-07T05:13:51","id":18582,"type":null,"title":"US Spot Bitcoin ETFs See $217M Net Inflows as GBTC Posts Second Consecutive Positive Day","category":["Bitcoin News "],"content":["US spot Bitcoin ETFs saw a net inflow of $217 million on May 6th, according to data from SoSoValue. This surge comes after a period of massive outflows, with Grayscale’s GBTC trust still experiencing a historical net outflow of $17.4 billion since its inception.","Grayscale’s GBTC did manage a modest single-day inflow of $3.9 million, marking its second consecutive positive day after recording $63 million inflows on Friday for the first time since the US SEC approved 10 new ETFs in January 2024. GBTC share price also witnessed an uptick after positive inflows.","Fidelity’s FBTC ETF led the charge with a massive $99.2 million single-day inflow, bringing its total historical net inflow to $8.1 billion. Ark Invest and 21Shares’ ARKB ETF also saw significant interest, attracting $75.6 million in a single day, pushing its total net inflow to $2.2 billion.","With a combined net asset value of $52.2 billion, these ETFs now represent 4.19% of the total Bitcoin market value. The total historical net inflow for all spot Bitcoin ETFs sits at $11.8 billion, highlighting a significant shift in investor sentiment.","In a bid to compete with lower-cost rivals, Grayscale announced plans in March to spin off a “Bitcoin Mini Trust” from GBTC. This new vehicle would hold a portion of GBTC’s assets, but details regarding its exact fee structure remain under wraps by the company.","Bitcoin’s 200-day moving average reached an all-time high of $50,178 on Monday. This key technical indicator suggests a long-term bullish trend for the world’s leading cryptocurrency.","This positive signal comes after a temporary dip following the Bitcoin network’s block reward halving on April 20th. The price briefly dropped to nearly $57,000, but the recent surge in the 200-day moving average indicates a potential for sustained growth.","Bitcoin's 200 day moving average just hit a new all-time high.","GBTC saw the first day of inflows in 78 days.","Don't get lulled to sleep by bitcoin going sideways. The long-term thesis is as strong as ever.","Here is my segment on @SquawkCNBC this morning. pic.twitter.com\/BG6GkzqVIi","— Pomp 🌪 (@APompliano) May 6, 2024","",""],"entity":[{"type":"this morning","content":"TIME"},{"type":"$99.2 million","content":"MONEY"},{"type":"4.19%","content":"PERCENT"},{"type":"$63 million","content":"MONEY"},{"type":"$75.6 million","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"$57,000","content":"MONEY"},{"type":"$2.2 billion","content":"MONEY"},{"type":"$217 million","content":"MONEY"},{"type":"January 2024","content":"DATE"},{"type":"$11.8 billion","content":"MONEY"},{"type":"$50,178","content":"MONEY"},{"type":"$52.2 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"April 20th","content":"DATE"},{"type":"$8.1 billion","content":"MONEY"},{"type":"$17.4 billion","content":"MONEY"},{"type":"May 6th","content":"DATE"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"May 6, 2024","content":"DATE"},{"type":"$3.9 million","content":"MONEY"}],"hashtag":["Bitcoin Spot ETF","GBTC","USA"],"authors":["Jai Pratap"]}