{"summary":"Gaming Giant WeMade’s ‘Controversy-hit’ Token ‘Relisted’ in South Korea","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gaming-giant-wemades-controversy-hit-token-relisted-in-south-korea.htm","publishDate":"2023-11-09T00:30:54","id":18598,"type":null,"title":"Gaming Giant WeMade’s ‘Controversy-hit’ Token ‘Relisted’ in South Korea","category":["Blockchain News "],"content":["The South Korean gaming behemoth WeMade has scored a success by securing a new domestic crypto exchange listing for its WEMIX coin.","Per Chosun Ilbo, the Gopax exchange began trading in WEMIX pairs from 5pm KST on November 8.","Controversy struck for the coin and its issuer in November last year, with a self-regulating committee comprising the nation’s five fiat won trading exchanges later announcing the token’s unilateral delisting.","The committee, officially known as the Digital Asset Exchange Alliance (DAXA), consists of the market-leading exchange Upbit, as well as rivals Bithumb, Coinone, Korbit, and Gopax.","It launched in mid-2022 in response to government pressure, and in the wake of the Terra\/LUNC “crisis” of May the same year.","Ministers had complained that listing and delisting decisions were made arbitrarily by individual exchanges, and called for exchanges to streamline their policies.","Gopax has not previously listed WEMIX, but Upbit, Bithumb, Coinone, and Korbit all simultaneously withdrew support for the coin on December 8 last year.","DEXA said at the time that it was responding to misreported circulation data from WeMade.","The body claimed that there was a discrepancy between the number of WEMIX coins in circulation and the number of tokens disclosed by the firm.","The game maker disputed the claims, and was successful in securing several overseas listings for WEMIX.","In February this year, the game maker scored a victory when Coinone decided to relist WEMIX, leading to a surge in prices.","WeMade will hope Gopax’s decision can help sway Upbit and Bithumb, the nation’s largest trading platforms.","The gaming firm’s share prices were buoyed by the news, with WeMade’s Korea Exchange share prices rising by just short of 23% after Gopax’s official announcement.","The company’s Korea Exchange-listed affiliate firms also saw share price rises of around 23%.","Meanwhile, WEMIX saw more modest climbs, returning briefly to the $2 mark.","The coin’s all-time high of just under $25 was recorded in late 2021, with prices falling shortly after and remaining relatively stagnant from 2022 onward.","WeMade is most famous for its Legend of Mir MMORPG series, but in recent years has attempted to reposition itself as a major force in East Asian blockchain gaming."],"entity":[{"type":"Upbit","content":"LOCATION"},{"type":"Coinone","content":"LOCATION"},{"type":"Korbit","content":"LOCATION"},{"type":"November 8","content":"DATE"},{"type":"Bithumb","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"Digital Asset Exchange Alliance","content":"ORGANIZATION"},{"type":"Korea Exchange","content":"ORGANIZATION"},{"type":"$2 mark","content":"MONEY"},{"type":"$25","content":"MONEY"},{"type":"Bithumb","content":"PERSON"},{"type":"November last year","content":"DATE"},{"type":"February this year","content":"DATE"},{"type":"WeMade’s Korea Exchange","content":"ORGANIZATION"},{"type":"Chosun Ilbo","content":"ORGANIZATION"},{"type":"December 8 last year","content":"DATE"},{"type":"Gopax","content":"ORGANIZATION"}],"hashtag":["Gaming"],"authors":["Tim Alper"]}