{"summary":"Tribe Capital-Backed Nibiru Chain Allocates Over $15M in Developer Grants","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kraken-backed-nibiru-chain-allocates-15m-to-developer-grants.htm","publishDate":"2024-04-18T14:00:29","id":18592,"type":null,"title":"Tribe Capital-Backed Nibiru Chain Allocates Over $15M in Developer Grants","category":["Blockchain News "],"content":["HashKey, Kraken Ventures, Tribe Capital-backed Nibiru Chain is launching a $15 million grant program to support developers with a focus on the Asian market.","According to a press release shared with CryptoNews, “Nibiru Builder Grants” initiative is part of a strategic effort to enhance its blockchain platform’s capabilities. Nibiru Chain is a smart contract platform supported by investors including HashKey, Kraken Ventures, and Tribe Capital.","The long-term grants, totaling over $15 million, will be distributed in the form of tokens (NIBI) equivalent to approximately 2.5% of the supply among innovative developers.","“The Nibiru ecosystem is excited to stand behind the passionate developer community, empowering builders to become catalysts for positive Web3 transformation,” said Ecosystem Lead Erick Pinos.","“The grants initiative will supplement ongoing aid in partnership pairings and access to mentors, industry experts, and experienced developers,” said Pinos. “This initiative also allows Nibiru to actively elevate the visibility of ecosystem projects through dedicated marketing support.”","A dedicated allocation of $5 million in grants is included in the initiative specifically targeted at projects in Asia.","“We’re thrilled to unveil the long-term initiative to bolster the developer ecosystem with a $5 million sleeve specifically for the Asia region,” stated Head of Growth Brandon Suzuki.","Suzuki noted that engaging Asia-based developers in growth and community efforts is a key focus, underlining the region’s importance to the initiative.","“With KPI-based milestones to provide aligned interest between the broader network and the grant recipients, the grants initiative will further fuel for acceleration,” said Suzuki.","The network will also hold regular hackathons, which feature prize pools up to $100,000. These events are designed to foster innovation across various dApp categories, including tokenization of real-world assets, web3 gaming, DeFi, and SocialFi.","In addition, Nibiru is implementing a new reward mechanism that allows developers to earn a share of transaction fees each time their smart contracts are executed while setting up a bounty system for developers who fulfill protocol request for proposals (RFPs)."],"entity":[{"type":"Suzuki","content":"PERSON"},{"type":"Erick Pinos","content":"PERSON"},{"type":"KPI","content":"ORGANIZATION"},{"type":"Brandon Suzuki","content":"PERSON"},{"type":"Tribe Capital","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Nibiru","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Nibiru Chain","content":"ORGANIZATION"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["Blockchain","Kraken"],"authors":["Hongji Feng"]}