{"summary":"Degen Chain, Layer-3 Blockchain on Base Network, Sees $100 Million Transaction Volume in 24 Hours","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/degen-chain-layer-3-blockchain-on-base-network-sees-100-million-transaction-volume-in-24-hours.htm","publishDate":"2024-04-01T11:50:59","id":18591,"type":null,"title":"Degen Chain, Layer-3 Blockchain on Base Network, Sees $100 Million Transaction Volume in 24 Hours","category":["Blockchain News "],"content":["Degen Chain, a layer-3 blockchain running on top of the Base network, has quickly garnered attention from investors and traders, with a surge in transactional volumes reaching nearly $100 million in just 24 hours. The network commenced operations just four days ago and has seen over 272,000 unique transactions.","On-chain analysts have noted that Degen Chain has witnessed the creation of over 7,500 contracts and 2,300 tokens since its launch. However, it’s important to highlight that many of these tokens are associated with rug pulls or scams, reflecting the speculative and risky nature of the current cryptocurrency landscape.","","On March 27th it had 8 active accounts\nOn March 28th it had 1,270 active accounts\nOn March 29th it had 25,236 active accounts\nOn March 30th it had 91,261 active accounts","Astonishing growth pic.twitter.com\/uBgUa96lml","— Shual (@0xShual) March 31, 2024","","The Degen Chain is a layer 3 blockchain explicitly designed for the DEGEN token. A layer-3 blockchain is a customizable and application-specific blockchain built on top of layer-2 protocols, networks that settle transactions faster and more affordably than the underlying layer-1 blockchain, such as Ethereum or Solana.","The purpose of a layer-3 network is to efficiently complete a specific set of tasks, such as payments, gaming transactions, and other targeted functionalities. The DEGEN token serves as the native gas token for fee payments within the chain. The developers of Degen Chain highlight that it enables various experiments, including tipping, community rewards, payments, gaming, and more.","One of the prominent tokens on the Degen Chain is Degen Swap (DSWAP), an exchange native to the network with a valuation exceeding $14 million. Additionally, Degen Easter Eggs (DEE) is another token on the chain valued at $3.5 million, although it is primarily a meme coin with speculative value.","While numerous tokens on the network have market capitalizations under $1 million, they mainly serve as speculative investments as many of these tokens are being rugged. Currently, Degen Chain does not support stablecoins, and transactions or trading can only be conducted using the native DEGEN tokens. The value of DEGEN has surged significantly, reaching 6 cents on the 31st of March compared to Thursday’s 1 cent, marking a more than 500% increase. At the time of writing, DEGEN is trading at 4 cents.","Despite the rapid growth of Degen Chain and its massive user adoption, some critics argue that layer-3 networks are unnecessary for scaling Ethereum and may drain value from the mainnet. This viewpoint reflects ongoing debates within the blockchain community regarding the optimal strategies for blockchain scalability and application development.","","I’ll say the quiet part out loud: L3s exist only to take value away from Ethereum and onto the L2s on which the L3s are built.","*You do not need L3s to scale*","And this is why Polygon Labs does not work on L3s.","— Marc Boiron (@0xMarcB) March 31, 2024","","The debate over layer-3 networks (L3s) and their role in scaling Ethereum has been sparked by comments from Polygon CEO Marc Boiron, who argued that L3s are not necessary for scaling existing networks like Ethereum and only serve to divert value away from the mainnet.","Boiron’s statements were met with some disagreement, with one respondent pointing out that Layer 2s (L2s) on Ethereum represent value on the mainnet. Boiron partially agreed but emphasized that L2 value is not necessarily Ethereum’s value, as too many L3s settling to one L2 could diminish Ethereum’s value and security.","I agree that L2s are Ethereum. I disagree that L2 value is Ethereum value. Just take this to the extreme. If all L3s settled to one L2, then Ethereum would capture basically no value and, thus, Ethereum security would be at risk.","— Marc Boiron (@0xMarcB) March 31, 2024","","Boiron clarified that Polygon focuses on scaling Ethereum and ensuring a fair value distribution between L2s and Ethereum. He argued that L3s are not aligned with this mission.","However, others in the crypto community see benefits in L3s that are independent of Ethereum’s value. Benefits include low-cost native bridging from L2s, efficient on-chain proofing, custom gas tokens, and specialized state transition functions.","While Boiron’s perspective challenges the necessity of L3s, others, like Ethereum co-founder Vitalik Buterin, see them as potentially offering unique functionalities that complement L2s rather than competing with them directly.",""],"entity":[{"type":"March 30th","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"March 31, 2024","content":"DATE"},{"type":"DEGEN","content":"ORGANIZATION"},{"type":"$3.5 million","content":"MONEY"},{"type":"$14 million","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"500%","content":"PERCENT"},{"type":"Degen","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"DEGEN","content":"PERSON"},{"type":"4 cents","content":"MONEY"},{"type":"Degen Chain","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"March 29th","content":"DATE"},{"type":"March 28th","content":"DATE"},{"type":"1 cent","content":"MONEY"},{"type":"March 27th","content":"DATE"},{"type":"March","content":"DATE"},{"type":"6 cents","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":["Base","DEGEN Chain","Layer-3 Network"],"authors":["Hassan Shittu"]}