{"summary":"Deutsche Telekom Becomes Validator of Privacy-Focused Aleph Zero, More to Come","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/deutsche-telekom-becomes-validator-of-privacy-focused-aleph-zero-more-to-come.htm","publishDate":"2023-11-02T13:00:08","id":18595,"type":null,"title":"Deutsche Telekom Becomes Validator of Privacy-Focused Aleph Zero, More to Come","category":["Blockchain News "],"content":["Privacy-enhancing layer-1 blockchain Aleph Zero has announced Deutsche Telekom’s wholly-owned subsidiary, Deutsche Telekom MMS, as its newest validator.","Talking to Cryptonews, execs from the two companies discussed the relevance of supporting blockchains, what it means when a major company does so, what kind of privacy-focused blockchain can lead to wider institutional adoption, and what obstacles stand in the way of traditional companies joining the Web3 realm.","","According to the press release shared with Cryptonews, by establishing a validator node on both the mainnet and testnet, Deutsche Telekom MMS is now providing its infrastructure and contributing to the security, governance, and decentralization of Aleph Zero.","The subsidiary not only expanded its portfolio, but per the announcement,","“This the first instance of Deutsche Telekom partnering with a privacy-focused network.”","And Aleph Zero is growing, too. Its co-founder, Antoni Zolciak, told Cryptonews that the team is expanding the validator network on three fronts: community, academia, and enterprises, adding:","“With ~130 validators, most of them are operated by various network participants, such as various Aleph Zero supporters (groups, individuals, venture capital funds) as well as institutions like the University of Nicosia.”","Dirk Röder, Head of the Web3 Infrastructure and Solutions Team at Deutsche Telekom MMS, opined that the importance of Web3 security, privacy, and decentralization is evident by incidents such as hacks and security leaks.","Aleph Zero, said the announcement, offers the benefits of blockchain transparency in combination with privacy options for specific communications, transactions, and records of individuals and organizations.","Its layer-1 blockchain is based on an original consensus protocol AlephBFT, ink! smart contracts built by the team behind Polkadot, and the WASM code.","Furthermore, its privacy technology is based on a combination of zero-knowledge proofs (ZK-SNARKs) and secure Multi-Party Computation (sMPC).","","Deutsche Telekom is a telecommunications giant with 245 million customers worldwide.","It supports eight blockchains with more than 200 validators, with Röder stating in June that over 60 million euros of assets from Chainlink, Ethereum, Celo, Q, Flow, Polkadot, Polygon, and Energy Web” were on the company’s infrastructure.","And Deutsche Telekom is far from done. Röder said that there is more news and developments in the pipeline, as the company is committed to keeping pace with the evolving digital landscape.","“Deutsche Telekom is actively exploring and working on additional initiatives and partnerships within the blockchain and web3 space.”","Deutsche Telekom, he told Cryptonews, supports blockchains because it’s an infrastructure provider for mobile and internet services. It is actively expanding its services into Web3 infrastructure to stay at the forefront of technological advancements and provide innovative solutions to customers.","And Aleph Zero was chosen for a reason, said Röder.","“It is a highly scalable blockchain and prioritizes data privacy. The former is important in the light of growing volume of transactions and the latter appeals to institutional users. Aleph Zero most likely enables institutional adoption within the blockchain ecosystem.”","Aleph Zero’s Zolciak argued that the involvement of established companies like Deutsche Telekom indicates a wider acceptance and validation of blockchain in the traditional tech world, increasing the potential of such networks in creating a decentralized and secure Web3 infrastructure.","“When a household brand like Deutsche Telekom trusts and supports a blockchain network, it signals the reliability of that network, essentially bridging the gap between legacy systems and the emerging, more decentralized future.”","What’s more, Zolciak said, this major company decided to support a privacy-focused blockchain, signifying that transparency is not enough – it needs to be merged with the protection of sensitive information.","","Both Zolciak and Röder told us that traditional companies often face challenges when entering the blockchain and Web3 spaces – both naming regulatory uncertainties as a major issue.","Zolciak also noted the technological learning curve, as well as concerns about security and scalability as obstacles.","Solutions that offer robust security features, scalability, and privacy – all on one – can act as “catalysts for traditional enterprises,” Zolciak said and added:","“Once these companies observe the tangible benefits and reliability that blockchain provides, coupled with partnerships like Deutsche Telekom, we expect a significant influx of traditional companies into the space!”","Röder, too, noted that several obstacles must be addressed for broader adoption: Europe now has the Markets in Crypto-Assets (MiCA) regulation, but other jurisdictions still lack regulatory clarity.","And without it, the companies will continue to face the challenge of integrating and adopting blockchain and token economics into their internal processes.","He added that,","“Last but not least user experience must go a long way until mainstream.”","Once the challenges are addressed, Röder said, it is likely that more companies will enter the blockchain and Web3 space in the near future."],"entity":[{"type":"Polygon","content":"LOCATION"},{"type":"Zolciak","content":"PERSON"},{"type":"Dirk Röder","content":"PERSON"},{"type":"60 million euros","content":"MONEY"},{"type":"Röder","content":"PERSON"},{"type":"Celo","content":"PERSON"},{"type":"Deutsche Telekom MMS","content":"ORGANIZATION"},{"type":"University of Nicosia","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Antoni Zolciak","content":"PERSON"},{"type":"Deutsche Telekom","content":"ORGANIZATION"},{"type":"Polkadot","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Blockchain","Decentralization","Privacy","Regulation","Security","Web3"],"authors":["Sead Fadilpašić"]}