{"summary":"The Terra\/Luna issuer was the first to cite the recent Ripple decision in its defense against an SEC enforcement action.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs","publishDate":"2023-07-31T17:23:48","id":186,"type":null,"title":"Judge slams Ripple decision in SEC&#x27;s case against Terraform Labs","category":["POLICY"],"content":["A federal judge rejected an effort to dismiss the enforcement case brought by the Securities and Exchange Commission against Terraform Labs and founder Do Kwon.","Terraform had argued that the recent split decision in the SEC’s case against <a href=\"https:\/\/www.theblock.co\/post\/241027\/sec-lawyers-preview-likely-ripple-appeal-in-case-against-do-kwon\" data-v-f87c67ca=\"\">Ripple Labs<\/a> invalidated the agency’s case against the stablecoin issuer, but Judge Jed Rakoff of the U.S. District Court for the Southern District of New York rejected Terraform and Kwon’s arguments, saying the civil case could move forward.","\"It may also be mentioned that the Court declines to draw a distinction between these coins based on their manner of sale, such that coins sold directly to institutional investors are considered securities and those sold through secondary market transactions to retail investors are not. In doing so, the Court rejects the approach recently adopted by another judge of this District in a similar case,\" Rakoff wrote, directly citing the <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\">Ripple decision<\/a>.&nbsp;","Rakoff, who presides in the same district court as where the Ripple case was heard and partially decided, also rejected other attempts by Terraform and Kwon to quash the SEC’s case against them.","Terrform’s lawyers also cited the major questions doctrine, a legal argument that’s gaining popularity around the industry, as cause to dismiss the SEC’s case. The doctrine essentially says that regulatory agencies cannot act in areas of major economic or political significance unless Congress weighs in.","Rakoff rejected that argument as well.","“Because the doctrine is reserved for the most extraordinary cases where the agency claims broad regulatory authority and the area to be regulated is one invested with particular economic and political significance, it has been rarely invoked,” Rakoff writes in his decision on the motion to dismiss, issued Monday. “With this standard in mind, the crypto-currency industry – though certainly important – falls far short of being a ‘portion of the American economy’ bearing ‘vast economic and political significance.’”","Rakoff added that restricting the SEC to only regulating investment products that labels themselves as securities would be, “the exact opposite of what Congress intended,” in passing securities laws currently on the books.","In sum, there is no indication that Congress intended to hamstring the SEC’s ability to resolve new and difficult questions posed by emerging technologies where these technologies impact markets that on their face appear to resemble securities markets,” Rakoff concluded.&nbsp; Defendants cannot wield a doctrine intended to be applied in exceptional circumstances as a tool to disrupt the routine work that Congress expected the SEC and other administrative agencies to perform.”","&nbsp;Rakoff also said that the SEC has made plausible arguments that Terraform’s digital assets and the sales of them are securities offerings, and agreed that the SEC had jurisdiction to bring the case.","Still, lawyers for Terraform won a minor victory in a separate court on Monday. A federal bankruptcy judge <a href=\"https:\/\/www.theblock.co\/post\/242374\/terraform-allowed-to-subpoena-ftx-over-terra-luna-short-sellers\" data-v-f87c67ca=\"\">allowed a subpoena of wallets and account information from FTX<\/a>, relating to possible short sellers of Terra\/Luna, to move forward. Terraform says that information, which lawyers for FTX have also agreed to provide, will aid their defense against an SEC claim that Terraform conspired with Jump Trading to prop up the price of UST in 2021, a year before its collapse. ","<em data-v-f87c67ca=\"\">UPDATED with additional information from the judge's rejection of Terraform's motion to dismiss, and additional context from the FTX bankruptcy. <\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Rakoff","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Jed Rakoff","content":"PERSON"}],"hashtag":["COURT HEARINGS","FTX","SAM BANKMAN-FRIED","SEC"],"authors":["Colin Wilhelm","The Block"]}