{"summary":"Bitcoin monthly spot trading volume has fallen to levels not seen since October 2020, according to a report.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249120\/bitcoin-languishing-in-extremely-low-volume-and-liquidity-environment-report","publishDate":"2023-09-05T12:23:37","id":1860,"type":null,"title":"Bitcoin languishing in &#x27;extremely low volume and liquidity&#x27; environment: report","category":["Markets"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.33%\n    <\/span><\/a> <!----><\/span><\/span> spot trading volume on centralized crypto exchanges in August hit its lowest monthly level since October 2020, according to Tuesday's Bitfinex<\/span><\/span> <a href=\"https:\/\/blog.bitfinex.com\/wp-content\/uploads\/2023\/09\/Bitfinex-Alpha-70.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report.<\/span><\/a>","<span data-v-f87c67ca=\"\">The report cited data from The Block that showed crypto spot monthly trading volume was less than $423 billion for the month of August, the lowest since October 2020.<\/span>","<span data-v-f87c67ca=\"\">“Spot volume by assets have reached historically low values and spot volumes have been decreasing consistently across the board for several months now,” the report added. Analysts at Bitfinex said this indicator signals, “that bitcoin and the broader crypto asset sector are seeing a fall in confidence.”<\/span>","<span data-v-f87c67ca=\"\">The Bitfinex report emphasized the market is currently experiencing extremely low volume and liquidity. This low liquidity environment is making the crypto-market susceptible to sizable price fluctuations, even with modest trading volume. <\/span>","<span data-v-f87c67ca=\"\">The report cited a build-up of trading volume on derivatives exchanges in mid-August, corresponding with the liquidation of over $1 billion worth of<\/span> <a href=\"https:\/\/www.theblock.co\/post\/245422\/bitcoin-price-declines-as-nervous-market-turns-attention-to-grayscale\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">leveraged positions<\/span><\/a><span data-v-f87c67ca=\"\"> on August 17. Bitfinex said derivatives have been the driving force in the current market environment.<\/span>","It also pointed to data showing spot trading volume has retracted further than derivatives volume. Referring to data from Monday, the Bitfinex report stated, \"Yesterday’s figures recorded that the derivatives volume was 20 times spot volume across major exchanges.\"","In a note sent to The Block, Bitfinex analysts said market pessimism was on the rise. Last Tuesday's brief moment of optimism after <a href=\"https:\/\/www.theblock.co\/post\/248247\/grayscale-ceo-spot-bitcoin-etf-refiling\" data-v-f87c67ca=\"\">news<\/a> Grayscale had notched a legal win against the SEC has faded. Since then bitcoin has back tracked on all gains made, after seeing a recent high of $28,100.&nbsp;","On Thursday, August 31, <a href=\"https:\/\/www.theblock.co\/post\/248595\/sec-moves-to-delay-decisions-on-spot-bitcoin-etfs-from-wisdomtree-invesco-and-valkyrie\" data-v-f87c67ca=\"\">the SEC<\/a> extended its decision deadline on seven ETF filings by 45 days, further testing investor enthusiasm. \"There is a growing consensus the U.S. rollout of a bitcoin spot-based ETF may face further postponements,\" Bitfinex analysts added.","<span data-v-f87c67ca=\"\">The report added that the data suggests it could take longer than earlier anticipated to get a bullish catalyst for the market. After the SEC recently extended its decision deadlines for spot bitcoin ETF filings, Bitfinex analysts said they see ETFs as having \"a less pronounced effect on actual market prices across crypto assets.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, the report saw a positive sign in macroeconomic data emerging from the U.S. \"Wage growth is slowing in the U.S., signaling an easing of inflationary pressure and supporting our view that rates will be left on hold at the next FOMC,\" the report concluded.<\/span>","<span data-v-f87c67ca=\"\">Both spot and derivatives trading volume data signal this lack of optimism. CryptoQuant data offers some perspective on the size of the drop in trading volume since March of this year.<\/span>","<span data-v-f87c67ca=\"\">CryptoQuant data shows a fall in both spot and derivative exchange volume for bitcoin, since a year-to-date high was reached on March 14. On that day spot exchange volume was $831,000, and derivatives volume was $2.7 million. On Monday of this week, the data showed spot trading volume had diminished to $20,000, and derivatives volume was $355,000. Selecting data from March 14 and September 4, this represents a fall of 98% and 87% respectively.<\/span>","<span data-v-f87c67ca=\"\">Trading volume for digital asset investment products has also diminished. \"Trading volume for these investment vehicles has declined to $1.3 billion in total for this week, 16 percent lower than the yearly average,\" Bitfinex analysts said.<\/span>","<span data-v-f87c67ca=\"\">Considering the dearth of trading activity, Blackfridge Exchange CEO Mike Crosbie perceives \"a market structure that doesn’t inspire much confidence.\" Crosbie told The Block that, \"as long as the $28,000 level remains lost, around $23,800 likely beckons for bitcoin.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The world's largest cryptocurrency by market capitalization fell 0.5% over the past 24 hours to $25,701 at 11:00 a.m. ET, according to<\/span> <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CoinGecko<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>"],"hashtag":["CRYPTO MOVERS"]}