{"summary":"Billionaire Michael Saylor Sells $800 Million Convertible Notes to Buy More Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/billionaire-michael-saylor-sells-800-million-convertible-notes-to-buy-more-bitcoin.htm","publishDate":"2024-03-11T17:27:56","id":18606,"type":null,"title":"Billionaire Michael Saylor Sells $800 Million Convertible Notes to Buy More Bitcoin","category":["Bitcoin News "],"content":["MicroStrategy’s billionaire executive chairman, founder and former CEO Michael Saylor has just sold $800 million in convertible senior notes to add to his company’s ~ $13 billion Bitcoin war chest.","Saylor made the announcement in a tweet on his X profile.","MicroStrategy Completes $800 Million Offering of Convertible Notes at 0.625% Coupon and 42.5% Conversion Premium $MSTR https:\/\/t.co\/c9TEzMqQHq","— Michael Saylor⚡️ (@saylor) March 11, 2024","","According to MicroStrategy’s official press release, the cloud software company sold the unsecured bonds, which will mature in 2030, to institutional buyers on March 8 this year at a rate of 0.625%.","The sale of the notes generated approximately $782.0 million, after deductions. The company also confirmed that it used the net proceeds “to obtain additional bitcoins.”","It also “expects to grant to the initial purchasers of the notes an option to purchase, within a 13-day period beginning on, and including, the date on which the notes are first issued, up to an additional $90 million aggregate principal amount of the notes,” the company said.","MicroStrategy shares rallied sharply today. They’re currently up 13% to $1,550. Since MicroStrategy made buying Bitcoin part of its corporate strategy, many have viewed MicroStrategy shares as a proxy for Bitcoin, since the two tend to rise in tandem.","MicroStrategy is easily the largest corporate holder of Bitcoin.","Bitcoin maxis are happy today as the world’s favorite cryptocurrency trades at an all-time high of around $72,000. The last time the industry looked this healthy was back in late 2021, when Bitcoin set a former ATH of around $69,000.","The fever pitch around Bitcoin is really concentrated on two overarching narratives that are really helping to drive prices: ETFs and the halving.","See Bitcoin is popular, but it’s also very volatile and unregulated. Naturally, for investors in more traditional financial products, it can seem like a risky prospect.","Enter exchange-traded funds (ETFs). An ETF is essentially a Bitcoin fund, meaning it’s an entity that directly buys and stores Bitcoin and uses the asset to create shares, which it then sells on exchanges.","These shares track the price of the underlying asset, but thanks to their regulated status, they have more guardrails to help build confidence in crypto among investors from traditional finance backgrounds.","Many crypto advocates had been pining for a Bitcoin ETF for the last decade. The oldest and most senior Bitcoin Trust, Grayscale, started with an eye to eventually converting to an ETF but the SEC knocked it back last year.","Grayscale took the SEC’s rejection to an appeals court, where a judge ruled in Grayscale’s favor, calling the rejection “arbitrary and capricious”.","The move forced the SEC to approve eleven spot Bitcoin ETF applications earlier this year. They’ve already been some of the most hyped and successful ETF launches in history.","Finally, the market is also looking towards Bitcoin’s upcoming halving on April 19 to potentially drive prices beyond $100,000.","On that date, Bitcoin mining block rewards get cut in half, thus “halving” the issuance of new Bitcoin. If the current demand for Bitcoin sustains itself till then, the laws of supply and demand could catalyze some very roomy price rises.","It looks like billionaire Saylor believes there’s a lot more rally left."],"entity":[{"type":"March 11, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$1,550","content":"MONEY"},{"type":"March 8 this year","content":"DATE"},{"type":"$90 million","content":"MONEY"},{"type":"13%","content":"PERCENT"},{"type":"$800 Million","content":"MONEY"},{"type":"$72,000","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Michael Saylor","content":"PERSON"},{"type":"42.5%","content":"PERCENT"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"$MSTR","content":"MONEY"},{"type":"$69,000","content":"MONEY"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"0.625%","content":"PERCENT"},{"type":"$100,000","content":"MONEY"},{"type":"$782.0 million","content":"MONEY"},{"type":"$800 million","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"$13 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Michael Saylor","MicroStrategy"],"authors":["Tim Hakki"]}