{"summary":"Russia’s Sberbank Launches Digital Assets, NFT Offerings for Retail Investors","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russia-sberbank-launches-digital-assets-nft-offerings-for-retail-investors.htm","publishDate":"2024-02-04T23:30:57","id":18601,"type":null,"title":"Russia’s Sberbank Launches Digital Assets, NFT Offerings for Retail Investors","category":["Altcoin News "],"content":["Sberbank, Russia’s biggest bank, announced the launch of a digital financial asset and NFT trading platform.","On February 2, Sberbank explained that its “digital financial assets (DFAs) platform” was open to “all individuals.”","The bank added that “qualified investors” can also invest in a blockchain-powered “asset” pegged to the average cost of residential real estate in Moscow.","This token will track the value of the Sberbank Digital Square Meter Index (SBERDSMI), hosted on the Sberbank CIB Index portal.","The bank explained that it would offer access to this coin until February 15, and that it was “scheduled to mature between December 11 to December 16, 2026.”","While the Sberbank “real estate” digital asset is not a cryptoasset in name, it appears to come pretty close in nature.","It may be closer, however, to a form of blockchain-powered digital bond or security. Sberbank explained that “investors” would “have the opportunity to sell the DFA to the issuer before maturity.”","A spokesperson reminded the public that Sberbank has a Central Bank permit “for the issuance, accounting, and circulation of digital financial assets.”","In recent times, the Russian term “DFAs” has been used to describe a wide range of blockchain-powered coins.","The term in its most modern usage usually excludes decentralized protocols like Bitcoin and Ethereum.","However, the official Sberbank DFA platform landing page contains materials that appear to tease the launch of NFT trading offerings.","As most conventional NFTs make use of decentralized networks like Ethereum, Sberbank’s offerings could be built on private protocols.","Given Moscow’s general skepticism on crypto-related matters, this appears the most likely scenario.","However, the bank made no mention of its NFT operations in its press release, which focused almost entirely on the real estate-pegged coin.","Sberbank, Russia’s most bullish bank on blockchain-related matters, also teased the launch of “Hybrid DFAs.”","The bank noted that this service was “coming soon.” Sberbank wrote that this would combine “[conventional] monetary” aspects with digital property.","Russia is facing a widespread internet outage that’s affected users across the country, with access to websites on the local .ru domain down https:\/\/t.co\/ApAYGXAj72","— Bloomberg Technology (@technology) January 30, 2024","","Anatoly Popov, Deputy Chairman of the Board at Sberbank, said the bank had piloted its coin with “a limited number of investors” last month. He added:","“The new […] DFA will help our clients diversify their portfolio and become part of the fast-growing high-tech DFA market in Russia.”","Sberbank, Russia’s biggest asset holder, is majority state-owned and has also become a major tech player in recent years.","Last week, the Central Bank announced that Sberbank and 16 other commercial banks would join the second phase of the Russian digital ruble pilot.","Big developments could well be in the pipeline for Sberbank, Russia’s other major banking groups, and its IT firms.","Earlier this month, the nation’s biggest banking group announced the launch of a “digital assets” council.","And Nornikel, the country’s most prominent metal miner, announced plans to become the first Russian firm to pay its employees dividends using digital tokens."],"entity":[{"type":"February 15","content":"DATE"},{"type":"Nornikel","content":"PERSON"},{"type":"January 30, 2024","content":"DATE"},{"type":"Sberbank DFA","content":"ORGANIZATION"},{"type":"Sberbank CIB","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"December 11","content":"DATE"},{"type":"Bloomberg Technology","content":"ORGANIZATION"},{"type":"December 16, 2026","content":"DATE"},{"type":"Sberbank","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Anatoly Popov","content":"PERSON"},{"type":"Board","content":"ORGANIZATION"},{"type":"February 2","content":"DATE"},{"type":"DFA","content":"ORGANIZATION"},{"type":"Sberbank Digital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bank","Russia"],"authors":["Tim Alper"]}