{"summary":"FRIEND Is Down 6.3%, But Experts Say New Dog-Themed Crypto ICO Can Offer 1,763% Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/friend-is-down-6-3-but-experts-say-new-dog-themed-ico-can-offer-1763-returns.htm","publishDate":"2024-05-06T14:59:29","id":18619,"type":null,"title":"FRIEND Is Down 6.3%, But Experts Say New Dog-Themed Crypto ICO Can Offer 1,763% Returns","category":["Industry Talk "],"content":["The crypto token for exclusive new decentralized social media platform Friend.tech has taken a sudden hit of 4.3% in the last hour as various other leading cryptocurrencies also begin posting red candles.","Friend.tech’s $FRIEND launched token, which crashed 50% on its debut last Friday when its largest whale did a spot of profit-taking, has suddenly dropped 4.3% after the lunch hour UTC on Tuesday.","At today’s price of $2.69, FRIEND is about 6.3% less valuable than it was this time yesterday. ","Taken together these metrics spell a volatile launch period for FRIEND holders. The news should come as no surprise given the speculative nature of crypto in general and crypto launches in particular, amidst a risk-averse macro outlook and cooling enthusiasm for Bitcoin ETFs.","Still, since launching as a decentralized on-chain social network last August, the protocol has ratcheted some significant milestones before the turn of the year, including $1 million in 24-hour fees (surpassing Uniswap and Bitcoin), and taking in tens of millions in fees.","Unfortunately all the attention brought opportunists along too. Friend.tech was targeted by a spate of SIM swapping attacks and a massive data leak.","Still since launching yesterday the FRIEND token has found its home quickly within the $2.40 to $3.20 range. Although it’s still early days yet, it looks like the holders who wanted to cash out at launch have done so. This means that FRIEND is likely to now track price movements in the wider market.","And those movements are looking optimistic after a recent bearish spell that sank the price of Bitcoin to under $60k last week. The world’s favorite cryptocurrency is back trading at $64,090, which is roughly the same price it was this time last week, but a gain of 3.4% from seven days ago. ","","Friend.tech has an intriguing premise and plenty of celebrities backing it, including the NBA’s Grayson Allen, and crypto influencers Cobie and Gainzy and RookieXBT","However one presale that has quietly taken in $1.1 million so far offers a different kind of friendship. WienerAI ($WAI) is the brand new meme token and AI companion that may yield some potentially eye-watering rallies on listing thanks to its core offering.","Touted as a “Revolutionary AI Trading partner”, WienerAI is a digital companion that gives his owners user-friendly AI-enhanced trading advice, seamless swap functionality and zero fees. ","The WienerAI smart contract was audited by Coinsult, a blockchain security platform that conducts security checks on various crypto and blockchain platforms. ","Pls don't miss out.","PRICE GOES UP IN ONE DAY!","The time is NOW 🌭🌭🌭 pic.twitter.com\/J0FyqI0hAX","— WienerAI (@WienerDogAI) May 6, 2024","","Around 20% of $WAI’s supply is for staking. WienerAI’s website encourages buyers to stake during the presale, in order to take advantage of the lucrative yield, which is currently 831% APY . ","Stay informed of WienerAI news over on X\/Twitter and Telegram. ","Join the presale now over on the WienerAI website."],"entity":[{"type":"Cobie","content":"PERSON"},{"type":"Coinsult","content":"ORGANIZATION"},{"type":"$64,090","content":"MONEY"},{"type":"6.3%","content":"PERCENT"},{"type":"last August","content":"DATE"},{"type":"$2.40","content":"MONEY"},{"type":"$WAI","content":"MONEY"},{"type":"3.4%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"4.3%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"831%","content":"PERCENT"},{"type":"Twitter","content":"DATE"},{"type":"$1.1 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$60k","content":"MONEY"},{"type":"May 6, 2024","content":"DATE"},{"type":"Grayson Allen","content":"PERSON"},{"type":"NBA","content":"ORGANIZATION"},{"type":"$3.20","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$2.69","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"SIM","content":"ORGANIZATION"},{"type":"$FRIEND","content":"MONEY"}],"hashtag":["friend","wienerai"],"authors":["Tim Hakki"]}