{"summary":"Sui To Host New Tool From Greek Stock Exchange, ATHEX","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sui-greek-stock-exchange-new-tool.htm","publishDate":"2024-03-08T06:37:38","id":18618,"type":null,"title":"Sui To Host New Tool From Greek Stock Exchange, ATHEX","category":["Blockchain News "],"content":["The Athens Stock Exchange (ATHEX) plans to deploy a new tool, the Electronic Book Building (EBB), on the Sui blockchain. ","In a blog post on March 6, Sui said the partnership marks the first time a stock exchange is developing such a solution on a public blockchain. ","The EBB will likely shape how businesses list transferable securities on the exchange. It will be a digital platform for companies to present their securities to interested investors.","Athens Exchange Group, the team behind ATHEX, is collaborating with Mysten Labs to develop this tool.\n","EBB is currently in the evaluation phase. Sui notes in the press release that its deployment will depend on ATHEX’s willingness to release it on the blockchain.","Even so, should EBB go live, enterprises will easily attract investors and boost the liquidity of their proposals. The tool will operate as a “meta-layer” on top of the exchange’s trading system. ","On its part, the network would host ATHEX securities minted as digital certificates on its ledger. Since they exist as tokens, compliant with Sui standards, they will be in a secure environment, safeguarded by the Sui web of validators. Beyond security, there is an element of transparency. Accordingly, it will be easier for investors to instantaneously verify ownership.","Beyond security, Sui offers scalability and parallel transaction processing. These characteristics mean the network can handle higher transaction volumes as expected from ATHEX. ","Unlike Ethereum, the legacy chain, it employs a modular design, translating to higher scalability and relatively low trading fees. ","As a result, EBB can operate efficiently on the blockchain without hitches or reliability concerns. With decentralized nodes securing the blockchain, ATHEX users relying on the tool will get uninterrupted service.","On March 5, Sui introduced the Request for Proposals program to enhance its grant allocation process. In a post, Sui said the program will better support developers by offering a ” structured framework for development, strategic alignment, and collaboration.”"],"entity":[{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"Athens Exchange Group","content":"ORGANIZATION"},{"type":"Athens Stock Exchange","content":"ORGANIZATION"},{"type":"March 6","content":"DATE"},{"type":"March 5","content":"DATE"},{"type":"Sui","content":"PERSON"}],"hashtag":["ATHEX","Sui Network","Trading"],"authors":["Dalmas Ngetich"]}