{"summary":"Bitcoin and Ethereum Networks See Heightened Fees as Crypto Usage Soars","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-networks-see-heightened-fees-as-crypto-usage-soars.htm","publishDate":"2023-11-20T06:50:15","id":18627,"type":null,"title":"Bitcoin and Ethereum Networks See Heightened Fees as Crypto Usage Soars","category":["Altcoin News "],"content":["Bitcoin (BTC) and Ethereum (ETH) networks have experienced a dramatic surge in transaction fees amid soaring crypto usage. ","According to data by BitInfoCharts, the average BTC transaction fee currently stands at around $10, up by more than 500% compared to less than $2 earlier this month. ","Notably, the average BTC fees reached as high as $18 on October 16 and 18, which coincided with a surge in the leading cryptocurrency and rising trading volume. ","Likewise, Ethereum gas fees has spiked to over 100 gwei, according to data by EtherScan. ","As of now, it costs a user more than $60 to make a swap across the Ethereum network, around $110 to sell an NFT, and $20 to bridge assets. ","Furthermore, CryptoFees data shows that Bitcoin’s daily fees averaged $10.65 million from November 16 to November 18, surpassing Ethereum’s average fee of $6.9 million for the same period.","Some market analysts have attributed the recent surge in BTC transaction fees to the revival of Ordinal Inscriptions.","These digital assets, akin to NFTs but on BTC’s smallest denomination, satoshis, gained traction earlier this year, signaling Bitcoin’s venture into the NFT sector.","While interest waned as the market evolved, a resurgence occurred as these assets expanded to other blockchain networks like Polygon and Litecoin.","BREAKING: Ordinals inscriptions made up 57% of Bitcoin transactions in the past 24 hours driving up fees to a 5 month high of 205 sat\/vB.","Ordinals are the #1 use case on Bitcoin right now. pic.twitter.com\/lVvNZIG2uV","— Leonidas (@LeonidasNFT) November 9, 2023","","Back in May, the rising Ordinals popularity cuased a network congestion that led to an overwhelming 500,000 unconfirmed transactions and sent the average transaction fee through the roof. ","Following the incident, some Bitcoin developers even suggested releasing an upgrade to kill Ordinals. ","In a Bitcoin developer forum, Bitcoin core developer Ali Sherief suggested introducing a runtime option to delete all non-standard Taproot transactions, including Ordinals and BRC-20 tokens. ","The recent surge in BTC transaction fee comes amid growing adoption of the leading cryptocurrency. ","According to a report from IntoTheBlock, Bitcoin adoption has reached 67.62%, a new yearly high.","This uptick signifies a rise in newly created active addresses, indicating an influx of new market participants. ","Furthermore, the volume of BTC held by long-term investors hit an all-time high, with over 1 million addresses owning more than 1 unit of Bitcoin.","Blockchain analytics firm Santiment has also supported these findings, noting an increase in smaller wallets with less than 1 BTC.","“Bitcoin’s wallets have fluctuated during this major market-wide surge. Tons of new smaller wallets with less than 1 BTC have flooded the network. Meanwhile, the 1-100 tier has flattened out, and the 100+ tier may be in the midst of some profit-taking.”",""],"entity":[{"type":"October 16","content":"DATE"},{"type":"$10.65 million","content":"MONEY"},{"type":"$6.9 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$2","content":"MONEY"},{"type":"500%","content":"PERCENT"},{"type":"$18","content":"MONEY"},{"type":"EtherScan","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ali Sherief","content":"PERSON"},{"type":"67.62%","content":"PERCENT"},{"type":"57%","content":"PERCENT"},{"type":"November 16 to November 18","content":"DATE"},{"type":"$60","content":"MONEY"},{"type":"$20","content":"MONEY"},{"type":"earlier this month","content":"DATE"},{"type":"November 9, 2023","content":"DATE"},{"type":"Santiment","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"$110","content":"MONEY"},{"type":"IntoTheBlock","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Ethereum","Fees"],"authors":["Ruholamin Haqshanas"]}