{"summary":"Ethena Price Prediction as ENA Closes In On $1 – Is It Time To Buy?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethena-price-prediction-as-ena-closes-in-on-1-is-it-time-to-buy.htm","publishDate":"2024-05-06T12:42:56","id":18623,"type":null,"title":"Ethena Price Prediction as ENA Closes In On $1 – Is It Time To Buy?","category":["Price Predictions "],"content":["The Ethena price has rallied by 13% today, reaching $0.9165 as the cryptocurrency market rises by 1% in the past 24 hours.","ENA – which is the governance token of the Ethena synthetic dollar protocol – is now up by 16.5% in a week, but down by roughly the same percentage in a month.","However, it’s also up by just over 70% since listing at the beginning of April, with several players in the market – including Delphi Ventures – prredicting that Ethena could become one of the biggest presences in the DeFi sector.","This puts ENA on track to reach $1 in the next few weeks, with later months potentially seeing it rise even higher.","ENA’s indicators are in very bullish positions at the moment, and while they are close to overbought territory, there still seems to be some space for further gains in the near term.","Its relative strength index (purple) rose to 80 earlier this morning, and while this could be a dangerous level, it has begun rising again after dipping just below 70 in the past couple of hours.","Also bullish is ENA’s 30-day average (orange), which has today crossed over the 200-day (blue), signalling that the coin is in the middle of a breakout phase.","The coin’s 24-hour trading volume has also risen slightly today at $400 million, although this is still some way off the levels – of around $3 billion – witnessed in early April, when it listed.","What’s particularly encouraging right now is that whales appear to still be accumulating ENA, implying that it likely has more gains in store in the coming days and weeks.","In the past hour, whale 0x5ab withdrew 6.26M $ENA ($5.31M) from #Binance at ~$0.848 for the first time.","Before ENA, the whale had only accumulated $ETH and currently stakes 2,000 $ETH (now $6.26M) with Pendle Finance at an unrealized loss of $584K (-8.5%).","The $ENA price has… pic.twitter.com\/BcIvd5PAEG","— Spot On Chain (@spotonchain) May 6, 2024","","On top of this, analysts have been predicting big things for ENA in the medium- and long-term, with Delphi recently predicting that Ethena will “become the highest revenue generating project in all of crypto.”","These are strong words, yet Ethena does seem to have good prospects.","It launched early last month as an Ethereum-based stablecoin project, with its protocol issuing a dollar-pegged stablecoin – USDe – that offers high yields to stakers.","USDe has already attained a market cap of roughly $2.3 billion, with investors able to generate new USDe tokens by depositing other stablecoins, such as USDT and USDC.","$ENA is live! @ethena_labs is one of our highest conviction bets this cycle both @delphi_ventures and personally","I believe:","– sUSDe will offer the highest dollar yield in crypto at scale\n– USDe will become the largest stablecoin outside of USDC\/USDT in 2024\n– Ethena will become…","— José Maria Macedo (@ZeMariaMacedo) April 2, 2024","","So far, its initial growth period has gone pretty well, raising the possibility of further gains for the Ethena price.","The latter could reach $1 in the next week or so, before returning to $1.50 by the end of the summer.","ENA isn’t the only new token in the market with the potential to rally big in the near future, with various new meme coins also looking very promising.","Probably the best of the bunch is Dogeverse (DOGEVERSE), a multi-chain cryptocurrency that has raised more than $13 million in its soon-to-be-ending presale.","It's now or never! 🚀","Buy some $DOGEVERSE before the #DEX launch kicks off!#Memecoins #Altcoins #Solana#Ethereum #DOGE","— DogeVerse (@The_DogeVerse) May 5, 2024","","What’s exciting about DOGEVERSE is that it’s the market first ever Doge-themed multichain cryptocurrency, with the coin running on Ethereum, Polygon, BNB Chain, Solana, Avalanche and Base.","This is bullish insofar as it means it’s accessible to a much wider pool of potential users and buyers, while it could also gain traction on a much bigger number of dapps and platforms.","In other words, it’s likely to experience greater demand than if it were a single-chain coin, with another exciting feature also being the fact that it has a hard cap of 120 million tokens.","It could therefore become a deflationary token over time, with the ability to stake the coin also likely to squeeze its circulating supply.","Never underestimate the power of flexibility and choice! 💪 🏋️‍♀️","$DOGEVERSE offers something uniquely different to others…offering yourself a preferred #Blockchain. 🌍","Whether it’s #ETH, #SOL, #BNB Chain, #BASE, #MATIC or #AVAX, align with YOUR needs for speed and cost!","— DogeVerse (@The_DogeVerse) May 2, 2024","","This explains why its presale has been so successful in such a short space of time, with the offering ending in the next couple of weeks.","Latecomers can still join by heading over to the official Dogeverse website, where 1 DOGEVERSE costs $0.00031.","Given its tokenomics and multi-chain utility, such a price is likely to seem very cheap very soon.","",""],"entity":[{"type":"16.5%","content":"PERCENT"},{"type":"$ENA","content":"MONEY"},{"type":"May 2, 2024","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"$ETH","content":"MONEY"},{"type":"$2.3 billion","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"April 2, 2024","content":"DATE"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"USDC\/USDT","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"8.5%","content":"PERCENT"},{"type":"$584K","content":"MONEY"},{"type":"$1.50","content":"MONEY"},{"type":"$13 million","content":"MONEY"},{"type":"$5.31","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"Pendle Finance","content":"ORGANIZATION"},{"type":"$0.9165","content":"MONEY"},{"type":"13%","content":"PERCENT"},{"type":"$400 million","content":"MONEY"},{"type":"Dogeverse website","content":"ORGANIZATION"},{"type":"May 6, 2024","content":"DATE"},{"type":"April","content":"DATE"},{"type":"earlier this morning","content":"TIME"},{"type":"José Maria Macedo","content":"PERSON"},{"type":"$DOGEVERSE","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"$0.848","content":"MONEY"},{"type":"ENA","content":"ORGANIZATION"},{"type":"May 5, 2024","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Delphi Ventures","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$6.26","content":"MONEY"},{"type":"Delphi","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$0.00031","content":"MONEY"}],"hashtag":["Altcoins","Cryptocurrencies","Ethena"],"authors":["Simon Chandler"]}