{"summary":"Humanity Protocol Secures Funding From Top Crypto VCs for Web3 ID Solution","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/humanity-protocol-secures-funding-from-top-crypto-vcs.htm","publishDate":"2024-02-28T07:00:45","id":18626,"type":null,"title":"Humanity Protocol Secures Funding From Top Crypto VCs for Web3 ID Solution","category":["Blockchain News "],"content":["Polygon-backed Humanity Protocol has secured strategic investments from over 20 crypto venture capital firms for its privacy-centric Web3 identity solution. Hashed, CMCC, Cypher Capital, Foresight Ventures, and Mechanism Capital are among the few crypto VCs that invested in Humanity Protocol, as per a press release shared with CryptoNews.","The funding is intended to support the development and deployment of Humanity Protocol’s technology, which aims to establish “Proof of Humanity” within Web3 applications.","The firm did not disclose the total amount raised in strategic funding from these crypto VCs.","Humanity Protocol is building on utilizing palm recognition technology alongside zero-knowledge proofs, aiming to provide a user-friendly and privacy-preserving approach to digital identity verification.","Humanity Protocol believes its privacy-centric digital ID solutions will have a significant impact on how individuals interact with digital services, particularly in the context of growing concerns around artificial intelligence and data security.","Terence Kwok, Founder of Humanity Protocol, stated:","“Our core belief is that technology should empower humans, not restrict them. With the support of these leading investors, we are not just building an ecosystem; we are fostering a movement towards a secure and inclusive digital future for everyone. This funding marks a critical step in our journey to bring our human-centric blockchain to the world, offering individuals control over their digital identity and prioritizing privacy.”","The secured funds will be used to accelerate the development and adoption of Humanity Protocol, focusing on scalability, efficiency, and user accessibility. This includes preparing for the launch of their testnet, allowing users worldwide to experience the technology firsthand.","Notably, the fundraise also saw participation from crypto veterans, including Yat Siu and Sandeep Nailwal."],"entity":[{"type":"Humanity Protocol","content":"ORGANIZATION"},{"type":"Terence Kwok","content":"PERSON"},{"type":"Yat Siu","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"Sandeep Nailwal","content":"PERSON"}],"hashtag":["Blockchain","Web3"],"authors":["Jai Pratap"]}