{"summary":"The move follows GRIID’s merger with special purpose acquisition company Adit EdTech Acquisition Corp. earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274875\/bitcoin-mining-griid-nasdaq","publishDate":"2024-01-29T10:26:11","id":1862,"type":null,"title":"Bitcoin mining company GRIID begins trading on Nasdaq","category":["EQUITIES"],"content":["Bitcoin mining firm GRIID began trading on the Nasdaq stock exchange today under the ticker symbol \"GRDI.\"","\"Today marks a significant milestone for GRIID as we begin to trade in the U.S. market,\" GRIID CEO Trey Kelly said in a statement. \"We believe that our listing on Nasdaq will enhance our visibility, liquidity, and broaden our investor base as we continue to strengthen our market position and reinforce our commitment to delivering shareholder value.\"","The listing follows GRIID’s <a href=\"https:\/\/www.globenewswire.com\/en\/news-release\/2024\/01\/02\/2802568\/0\/en\/GRIID-Common-Stock-Listed-on-Cboe-Canada-after-Completion-of-Business-Combination-with-Adit-EdTech-Acquisition-Corp.html\" data-v-f87c67ca=\"\">merger<\/a> with special purpose acquisition company Adit EdTech Acquisition Corp. on Jan. 2, over two years since the initial <a href=\"https:\/\/www.theblock.co\/linked\/125845\/bitcoin-mining-firm-griid-set-to-go-public-via-3-3-billion-spac-deal\" data-v-f87c67ca=\"\">proposal.<\/a>","GRIID was listed on Cboe Canada upon completion of the merger and will continue to trade on the Canadian exchange under the same ticker.","In a SPAC deal, an acquiring company — formed with the purpose of acquiring a private firm — brings a private firm public.","Headquartered in Cincinnati, GRIID has operated bitcoin mining facilities since 2019, focused on securing affordable, reliable and environmentally responsible power. The company currently operates four U.S. mining facilities in Watertown, New York and Limestone, Maynardville and Lenoir City, Tennessee.","GRIID joins other bitcoin mining companies, such as Riot Platforms and Marathon Digital, to be listed on the Nasdaq.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Today marks","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maynardville","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Cincinnati","content":"LOCATION"},{"type":"Lenoir City","content":"LOCATION"},{"type":"Watertown","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Tennessee","content":"LOCATION"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Jan. 2","content":"DATE"},{"type":"Adit EdTech Acquisition Corp.","content":"ORGANIZATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Trey Kelly","content":"PERSON"},{"type":"Cboe Canada","content":"ORGANIZATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}