{"summary":"Hong Kong SFC Blacklists Two Crypto Websites Suspected of Fraud","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-sfc-warns-of-suspected-crypto-frauds.htm","publishDate":"2023-12-06T10:06:14","id":18628,"type":null,"title":"Hong Kong SFC Blacklists Two Crypto Websites Suspected of Fraud","category":["News "],"content":["Hong Kong Securities and Futures Commission (SFC) has issued a warning to the public about potential virtual asset-related frauds involving “HongKongDAO” and “BitCuped.”","Collaborating with the Hong Kong Police Force, the SFC has taken decisive action to block access to the websites associated with HongKongDAO and BitCuped, signaling a proactive stance against suspected fraudulent activities.","HongKongDAO, a particular focus of the warning, has introduced a token named “HKD” or “HongKongDAO” (HKD Token) available for purchase on its platform.","The SFC suspects that HongKongDAO may be disseminating false and misleading information through online channels.","An online article affiliated with HongKongDAO falsely claims that the entity holds licenses from the SFC for regulated activities and is actively bidding for a “Hong Kong Digital Currency Exchange Licence.”","These deceptive claims could mislead individuals into acquiring or subscribing to the HKD Token, posing significant risks to unsuspecting investors.","The SFC has highlighted discrepancies related to another crypto platform as well – BitCuped. The entity, according to the SFC, falsely represents “Laura Cha” as its Chairman and “Nicolas Aguzin” as its Chief Executive Officer. However, neither individual has any affiliations with BitCuped.","The commission urges the public to exercise caution when encountering investment opportunities and advice on social media platforms and instant messaging apps.","This cautionary note comes amid a global push by regulatory bodies to safeguard investors from the increasing threats within the cryptocurrency and virtual asset space.","The SFC reiterates the importance of vigilance and prudence, particularly when making investment decisions, in order to mitigate the risks associated with potential fraudulent schemes. Investors are advised to conduct thorough due diligence and verify the legitimacy of entities before engaging in any financial transactions.","Earlier, Hong Kong witnessed a massive crypto fraud when law enforcement agencies discovered the JPEX scandal that ballooned up to $200 million."],"entity":[{"type":"Hong Kong Police Force","content":"ORGANIZATION"},{"type":"Hong Kong Digital Currency Exchange Licence","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"Laura Cha","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Nicolas Aguzin","content":"PERSON"},{"type":"HKD Token","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Hong Kong Securities and Futures Commission (SFC","content":"ORGANIZATION"}],"hashtag":["Hong Kong"],"authors":["Jai Pratap"]}