{"summary":"South African crypto prime broker OVEX has raised $4 million from Alameda Research.\nOVEX is looking to raise a further $14 million in the near future, CEO Jonathan Ovadia told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99956\/crypto-prime-broker-ovex-raises-4-million-alameda","publishDate":"2021-03-31T07:15:35","id":1862,"type":null,"title":"Crypto prime broker OVEX raises $4 million from Alameda Research","category":["Venture Capital"],"content":["South African crypto prime broker OVEX has raised $4 million from Alameda Research in a strategic funding round.","Sharing the news exclusively with The Block on Wednesday, OVEX said it is looking to expand internationally with fresh capital at hand. OVEX has identified five markets for expansion: the U.K., the U.A.E, Canada, Kenya, and Nigeria.","OVEX CEO Jonathan Ovadia told The Block that these markets are \"underserved\" while still having \"significant\" cryptocurrency volumes.","Specifically, in Dubai, OVEX is setting up a proprietary trading desk, said Ovadia. \"The rest of the markets will likely be operated from inside South Africa,\" he said.","To that end, OVEX is looking to grow its current team of 15 people to more than 35 by July, said Ovadia. OVEX is specifically looking to add people to its engineering and customer success teams.","Founded in 2017, OVEX primarily serves high-net-worth individuals and institutional clients. It also has some retail-oriented products, such as crypto trading services and interest-bearing crypto accounts.","Ovadia said OVEX is already \"exceptionally profitable,\" with profits growing 30% month-to-month for the last 18 months. \"We expect this growth to continue for the foreseeable future,\" he said, adding that the fresh capital will allow OVEX to reach critical mass in new markets quickly.","This is the first external raise of OVEX, said Ovadia, adding that <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-alameda-researchs-portfolio-85109\" data-v-f87c67ca=\"\">Alameda<\/a> is more of a strategic investor. OVEX is looking for more such strategic investors to raise a further $14 million in the near future, Ovadia told The Block.","\"We're keeping the equity round very exclusive and want to make sure any investor we bring on will add value and help us achieve our goal,\" he said. \"Alameda has been an incredible investor in this regard and has been able to assist with infrastructure and guidance in this short period of time.\"","OVEX is raising further funds at a valuation of $122 million, said Ovadia."],"hashtag":[]}