{"summary":"Bithumb IPO Plans ‘Accelerate’ as South Korean Crypto Exchange Eyes Public Listing","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bithumb-ipo-plans-accelerate-as-south-korean-crypto-exchange-eyes-public-listing.htm","publishDate":"2024-03-24T23:30:13","id":18624,"type":null,"title":"Bithumb IPO Plans ‘Accelerate’ as South Korean Crypto Exchange Eyes Public Listing","category":["Blockchain News "],"content":["The South Korean exchange Bithumb is looking to step up its IPO plans – and could look to launch a fast-tracked initial public offering as the crypto bull market continues.","Per Hanguk Kyungjae, Bithumb is looking to “accelerate” its proposed KOSPI listing.","The media outlet reported that Bithumb announced that the exchange will spin off its holdings operations into a separate company. It is tentatively naming this firm Bithumb Investment.","The firm published a regulatory filing document on March 22 detailing its plans.","The new firm will take control of Bithumb’s holdings, investments, and real estate operations.","Meanwhile, the entity currently known as Bithumb Korea will focus on operating the crypto trading platform.","The company plans to divide shares in Bithumb using a 6:4 ratio. It will put the plan before a meeting of shareholders on May 10.","If the shareholders approve, Bithumb Investment will officially launch on June 13, the media outlet reported.","Shareholders will reportedly be told they will “receive new shares in the new corporation in proportion to their existing shares.”","The firm made no mention of ongoing court cases, including a probe into alleged market manipulation supposedly conducted by the mysterious “real” owner of Bithumb.","Instead, it appears the firm wants to distance itself from such matters. It seems to want the IPO’s success or otherwise to stem from its core exchange business.","Foreign investors have extended their buying streak, acquiring a net purchase of 14.401 trillion won in #KOSPI #stocks so far this year, according to the #Korea Exchange. This figure far exceeds last year’s total net purchases of 11.424 trillion won.https:\/\/t.co\/LiPQxxVfCW","— The Chosun Daily (@EnglishChosun) March 24, 2024","","Bithumb-related business has boomed in recent months. The firm was, until recently, offering commission-free trading in a bid to claw back market share from its biggest rival Upbit.","A retail Bitcoin (BTC) trading renaissance has also seen trading volumes rise in South Korea. The nation is famously crypto-keen. But it has a tiny pool of platforms that have fiat-crypto trading licenses.","The exchange hopes that the spinoff will “further increase the possibility of IPO launch” by creating an entity that is “centered on the exchange business,” the media outlet noted. It added:","“New businesses outside core exchange operations will be pursued with speed through new corporations – without being restricted by the Bithumb IPO bid.”","A Bithumb spokesperson said the move would “promote efficiency.” The official added that it would also “boost the growth” of “exchange operations” with “separate ownership” models.","Bithumb has previously said it is eyeing a 2025 KOSPI debut. The new move could potentially see the exchange fast-track its listing.","Regardless of the timing, however, the exchange is likely to win its bid to become the first South Korean trading platform to go public.","🇰🇷 South Korea’s Crypto-keen K Bank Aims for IPO Amid BTC Boom","K Bank, a South Korean neobank that has seen rapid growth thanks largely to its crypto operations, is set to make an initial public offering (IPO) bid.#CryptoNews #newshttps:\/\/t.co\/C0HqMWCHSL","— Cryptonews.com (@cryptonews) March 11, 2024","","Upbit’s operator Dunamu is considered “too large” to debut on the KOSPI. Talk of a Coinbase-inspired NYSE Dunamu listing went cold during the 2022 bear market.","However, another Upbit-related firm is also looking to launch its own IPO bid, namely the neobank K Bank.","K Bank provides fiat on\/off ramp-style banking services to Upbit customers. The partnership has seen K the Bank user base grow exponentially over the past few years, and could also see the bank launch on the KOSPI in the near future."],"entity":[{"type":"2025","content":"DATE"},{"type":"IPO","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Bithumb","content":"LOCATION"},{"type":"Upbit","content":"PERSON"},{"type":"Hanguk Kyungjae","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"#Korea Exchange","content":"ORGANIZATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"K Bank","content":"ORGANIZATION"},{"type":"Bithumb","content":"PERSON"},{"type":"March 22","content":"DATE"},{"type":"March 24, 2024","content":"DATE"},{"type":"Bithumb IPO","content":"ORGANIZATION"},{"type":"Bithumb Korea","content":"LOCATION"},{"type":"Bithumb Investment","content":"ORGANIZATION"},{"type":"Bithumb spokesperson","content":"ORGANIZATION"},{"type":"Bank","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"June 13","content":"DATE"},{"type":"Dunamu","content":"ORGANIZATION"}],"hashtag":["Bithumb","South Korea"],"authors":["Tim Alper"]}