{"summary":"World Mobile expects to deploy cheaper, blockchain-based internet access to California, New Mexico, Nevada and Utah later this year. ","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239419\/following-bidens-universal-internet-initiative-blockchain-powered-provider-world-mobile-secures-u-s-expansion","publishDate":"2023-07-13T09:46:09","id":1863,"type":null,"title":"Blockchain-powered provider World Mobile secures U.S. expansion","category":["Companies"],"content":["World Mobile, a decentralized internet provider, said it has secured authorization to bring its “affordable” service to parts of the United States.","Utilizing blockchain technology, combined with “aerial and terrestrial infrastructure,” the company said it can provide internet access at a rate considerably lower than traditional providers. It will roll out its service in the U.S. initially in California, New Mexico, Nevada and Utah, World Mobile said in a statement.","“We are signaling our intent to revolutionize the connectivity landscape in the United States,” World Mobile CEO Micky Watkins said in a statement.","World Mobile’s move follows U.S. President Joe Biden’s 2021 infrastructure bill which <a href=\"https:\/\/www.reuters.com\/world\/us\/biden-detail-plans-42-billion-investment-us-internet-access-2023-06-26\/\" data-v-f87c67ca=\"\">includes $42 billion<\/a> to make high-speed broadband universal by 2030. The company said it secured 20MHz of “licensed spectrum” and expects to deploy its service in the U.S. later this year.","The company launched in Tanzania and has held field tests in Kenya, Nigeria and Mozambique, it said in a statement.","On its website World Mobile states that “unlike traditional mobile networks” it is “based on blockchain and the sharing economy” and that users in “unconnected regions can operate affordable nodes” on its network in order to help provide internet access to those that do not currently have it.&nbsp;"],"hashtag":["INTERNET"]}