{"summary":"Company rolls out no-fee promotion in an attempt to attract high-volume crypto traders that utilize services offered by rival platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275609\/coinbase-targets-vip-crypto-traders-at-rival-exchanges-with-no-fee-promo","publishDate":"2024-02-01T09:33:22","id":1863,"type":null,"title":"Coinbase targets &#x27;VIP&#x27; crypto traders at rival exchanges with no-fee promo","category":["EXCHANGES"],"content":["Coinbase has announced a new promotion aimed at luring high-volume traders away from rival cryptocurrency trading platforms.","\"<span data-v-f87c67ca=\"\">We’re making it possible for high volume traders from other exchanges with over $500,000 in monthly trading volume to <\/span><span data-v-f87c67ca=\"\">fast-track to <\/span><span data-v-f87c67ca=\"\">lower<\/span><span data-v-f87c67ca=\"\"> fee tiers<\/span><span data-v-f87c67ca=\"\"> and pay as low as 0.0% maker fees on spot trades on Coinbase Advanced,\" the company said in a <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-advanced-now-offers-a-fee-upgrade-program-for-high-volume-traders\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;<\/span>","Coinbase's move comes as the U.S.-based cryptocurrency exchange is slated to announce, later this month, its fourth-quarter earnings for 2023. Last year, Coinbase confronted <a href=\"https:\/\/www.theblock.co\/post\/261218\/coinbase-beats-q3-estimates-usdc-interest-income-rebounds-to-172-million\" data-v-f87c67ca=\"\">declining transaction<\/a> revenue as a result of lower trading volumes. The company has already flagged that transaction revenue for last year's fourth quarter will likely be similar to previous quarters.","\"<span data-v-f87c67ca=\"\">We know that fees are one of the most important factors when it comes to selecting and trading on a crypto exchange,\" the company also said. \"VIP and high volume traders who use other crypto exchanges can now get upgraded to lower fee tiers by providing proof of their trading volume, allowing them to trade with lower fees on Coinbase Advanced from the start.\"<\/span>","Coinbase said the no-fees, promotional period for qualified traders who open an account with the platform will last 60 days. After which, \"<span data-v-f87c67ca=\"\">monthly trading volume on Coinbase will determine their ongoing fee tier. For example, traders with between $1 million and $15 million of trading volume may qualify for maker fees of .07%,\" the company said.<\/span>","Earlier this week, Coinbase <a href=\"https:\/\/www.theblock.co\/post\/274986\/coinbase-to-charge-fees-on-usdc-to-usd-conversions-over-75-million\" data-v-f87c67ca=\"\">announced<\/a> it will begin charging a fee of 0.1% when institutional clients make USDC to USD net conversions in excess of $75 million.","Coinbase, which does the vast majority of its business in the U.S., has also been pursuing an international expansion. The company <a href=\"https:\/\/www.theblock.co\/post\/275324\/coinbase-george-osborne\" data-v-f87c67ca=\"\">recently secured<\/a> licenses in France, Spain, Singapore and Bermuda, and has expanded access to its products to over 20 African nations.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"France","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"last year's fourth quarter","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"0.1%","content":"PERCENT"},{"type":"$500,000","content":"MONEY"},{"type":"0.0%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":".07%","content":"PERCENT"},{"type":"$75 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"Spain","content":"LOCATION"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}