{"summary":"Crypto Council Files New Amicus Brief Supporting Coinbase’s Legal Battle With SEC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-council-files-amicus-brief-favoring-coinbase-against-sec.htm","publishDate":"2024-03-19T07:20:53","id":18638,"type":null,"title":"Crypto Council Files New Amicus Brief Supporting Coinbase’s Legal Battle With SEC","category":["Bitcoin News "],"content":["The Crypto Council for Innovation (CCI) has filed an amicus brief on March 18 in support of Coinbase challenging the Securities and Exchange Commission (SEC) denial of its rulemaking petition.","In December 2023, the SEC denied Coinbase’s petition for rulemaking. Coinbase has argued that the SEC has acted arbitrarily.","An amicus curiae are briefs written by individuals or groups who are not directly involved in a legal case. The brief is a written submission to a court in which an amicus curiae – literally a “friend of the court” a person or organization which is not party to the proceedings can set out legal arguments and recommendations in a given case.","The CCI is made up of members spanning the crypto ecosystem and share the goal of encouraging responsible global regulation.","“The SEC’s pursuit of its flawed interpretation of securities laws through regulation by enforcement while refusing to engage in rulemaking is a violation of the Administrative Procedure Act (APA) and will continue to cause significant harm to the digital assets industry,” said Ji Kim, General Counsel and Head of Global Policy of the Crypto Council for Innovation, in an emailed statement.","“As further detailed in our amicus brief, the SEC has attempted to enshrine an arbitrary and baseless enforcement policy without giving interested parties an opportunity to contribute meaningfully to the rules the SEC now claims governs their actions,” adds Kim.","In March, Coinbase filed a lawsuit against the SEC seeking a court directive for the regulatory authority to establish clear guidelines for the cryptocurrency sector.","In the lawsuit detailed in their March 11 court submission, Coinbase challenged the SEC’s lack of formal rulemaking for the crypto sector, asserting that the agency’s actions hindered the industry’s development and clarity.","The CCI went on to add that the SEC’s refusal to engage in substantive rulemaking perpetuates an unworkable regulatory blackhole, which fails to provide a viable path to compliance for the crypto industry.","“Industry participants are fleeing abroad to countries that offer the needed regulatory guidance. And the U.S. is losing its role as a leader in the global digital assets financial system, unfortunately taking a back seat as other countries embark toward the technological frontier. This will deprive American consumers of access to digital assets, their diversification, decentralization, and manifold benefits,” adds Kim.","CCI said its brief also details the fact that the SEC, in its order denying the rulemaking request, wrote a single sentence regarding the alleged “effectiveness” of the current system. This statement was devoid of any meaningful detail or reasoning.","“Such failure to engage is arbitrary and capricious and constitutes a violation of the APA, which requires much more,” adds Kim.","The CCI adds that the first Chair of the SEC made a promise: “If a business does the right thing, it will be protected and given a chance to live, make profits and grow. . . Honest business needs nothing more; the [SEC] promises nothing less.” When it comes to digital assets, the SEC has unfortunately failed in that promise."],"entity":[{"type":"CCI","content":"ORGANIZATION"},{"type":"Ji Kim","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"March 18","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"March 11","content":"DATE"},{"type":"March","content":"DATE"},{"type":"December 2023","content":"DATE"},{"type":"APA","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation (CCI","content":"ORGANIZATION"},{"type":"Head of Global Policy of the Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"General Counsel","content":"ORGANIZATION"}],"hashtag":["Coinbase","SEC","USA"],"authors":["Tanzeel Akhtar"]}