{"summary":"Binance Removes Nigerian Naira from P2P Service Amid Devaluation Concerns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-removes-nigerian-naira-from-p2p-service-amid-devaluation-concerns.htm","publishDate":"2024-03-01T13:36:07","id":18641,"type":null,"title":"Binance Removes Nigerian Naira from P2P Service Amid Devaluation Concerns","category":["Blockchain News "],"content":["Cryptocurrency trading platform Binance has made the decision to remove the Nigerian currency, the naira, from its peer-to-peer (P2P) service, prompting discontent and concern among Binance users in Nigeria.","This development coincides with reports that two Binance executives have been detained in Nigeria, with their passports confiscated. The executives had traveled to Nigeria to address the country’s ban on crypto exchange websites.","","Binance has officially delisted NGN from the P2P market. pic.twitter.com\/t13ko4ouXQ","— Ade₿ayo (@juwon_adebayo) February 28, 2024","","The removal of the naira from Binance’s P2P market follows claims by Nigerian authorities that the platform contributed to the devaluation of the naira. Presidential adviser Bayo Onanuga expressed concern that Binance’s operations could harm the Nigerian economy due to its purported role in fixing foreign exchange rates.","In response, Binance and other crypto exchanges have highlighted that exchange rates on peer-to-peer markets are determined by individuals participating in trades and are not controlled by the exchanges themselves. These rates fluctuate based on market conditions and typically exceed interbank rates.","The P2P feature, which enables direct trading between buyers and sellers without intermediaries, gained popularity in Nigeria in 2021 following the government’s ban on the country’s crypto industry during former President Muhammadu Buhari’s administration.","Nigeria boasts the highest peer-to-peer volume globally, driven by extensive adoption within the country. However, regulatory concerns surrounding Binance’s role in Nigeria’s foreign exchange challenges have escalated.","The Nigerian government’s attention has shifted towards platforms offering cryptocurrency services amid the rapid decline of the naira and the country’s nearly three-decade-high inflation rate of 29.9%. Cryptocurrency exchange platforms have become significant in determining informal values for the naira.","The Nigerian Securities and Exchange Commission (SEC) declared Binance’s operations illegal in 2023 due to its lack of registration in the country. Last week, the Nigerian government restricted access to the online platforms of various crypto firms, including Binance and OctaFX, citing concerns about ongoing manipulation of the foreign exchange market and illicit fund movements.","Binance also imposed a limit on the selling price of Tether tokens on its P2P platform, restricting traders from selling USDT above 1,802 naira per USDT. Binance clarified that this price peg was due to an automatic system pause, refuting speculation within the local crypto community.","Recent allegations from Olayemi Cardoso, the governor of Nigeria’s Central Bank, claimed that Binance Nigeria facilitated the transfer of $26 billion from unidentified sources last year. Cardoso emphasized the authorities’ determination to curb foreign exchange rate distortions and prevent market manipulation by collaborating across federal agencies.","Binance is facing heightened scrutiny in Nigeria, with the Central Bank of Nigeria (CBN) expressing concerns about suspicious fund flows through Binance Nigeria in 2023. The CBN reported that $26 billion had passed through Nigeria via Binance in 2023 from unidentified sources and users.","Cardoso stated that the authorities’ determination to curb foreign exchange rate distortions and prevent market manipulation by collaborating across federal agencies.","“[The authorities] are determined to do everything it takes to ensure that we take charge of our market or put it differently to not allow others to manipulate our markets in a way that ends us distortionary and sub-optimizes for all Nigerians. There’s a lot that is going on now as a result of collaboration between the different agencies, which includes EFCC [Economic and Financial Crimes Commission], the police, and of course, the office of the NSA [National Security Adviser].”","Despite regulatory challenges, Nigeria’s young and tech-savvy population continues to express strong interest in cryptocurrencies.","Local crypto analysts have criticized the government’s approach to cryptocurrency regulation, viewing it as unfriendly and counterproductive to resolving the country’s foreign exchange challenges. They argue that Nigeria should focus on promoting manufacturing and exporting instead of antagonizing cryptocurrencies.","Despite the government’s previous ban on banks engaging in crypto transactions, the CBN lifted the ban in December and issued guidelines for regulating virtual asset service providers."],"entity":[{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Central Bank of Nigeria (CBN","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bayo Onanuga","content":"PERSON"},{"type":"$26 billion","content":"MONEY"},{"type":"29.9%","content":"PERCENT"},{"type":"CBN","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Binance Nigeria","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"February 28, 2024","content":"DATE"},{"type":"Muhammadu Buhari","content":"PERSON"},{"type":"EFCC [Economic and Financial Crimes Commission","content":"ORGANIZATION"},{"type":"Nigerian Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"NSA [National Security","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["Binance","Naira","Nigeria"],"authors":["Hassan Shittu"]}