{"summary":"Eminence.Finance, the unfinished DeFi protocol by YFI founder Andre Cronje, was exploited Monday night.\nThe attacker drained $15 million from Eminence and then returned $8 million to YFI.\nHere’s what went wrong. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79061\/yfi-eminence-defi-protocol-exploited","publishDate":"2020-09-29T05:50:42","id":1864,"type":null,"title":"YFI founder&#x27;s incomplete DeFi protocol Eminence exploited, attacker drained $15M and then returned $8M","category":["DeFi"],"content":["Eminence.Finance, the unfinished decentralized finance (DeFi) protocol by Yearn.Finance (YFI) founder Andre Cronje, was exploited Monday night.","<a href=\"https:\/\/etherscan.io\/address\/0x223034edbe95823c1160c16f26e3000315171ca9#tokentxns\" data-v-f87c67ca=\"\">The attacker drained<\/a> $15 million from Eminence, deposited by users or so-called \"yield farmers,\" and <a href=\"https:\/\/etherscan.io\/tx\/0x7bc97357364222207f1f011b22ad98ba78fcd3c25d3398346caa3928cdf4a4dd\" data-v-f87c67ca=\"\">then returned<\/a> $8 million to YFI.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt is not clear why the attacker return funds. \"Only the attacker would know the answer to that question,\" Cronje told The Block.","The exploit occurred within a few hours of <a href=\"https:\/\/twitter.com\/eminencefi\" data-v-f87c67ca=\"\">Eminence's Twitter page launch<\/a> and <a href=\"https:\/\/twitter.com\/eminencefi\/status\/1310749870349840385?s=20\" data-v-f87c67ca=\"\">retweets by Cronje<\/a>. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">What went wrong?<\/strong><\/span>","Eminence is a card gaming protocol being developed by Cronje, who built the viral DeFi project YFI. YFI popularized the concept of yield aggregation — farming yield from different lending protocols and optimizing for the maximum yield. YFI then returns the collected yield to depositors.","Within days of its launch, YFI became famous and the price of its native governance token shot up. Its market capitalization has <a href=\"https:\/\/www.coingecko.com\/en\/coins\/yearn-finance\" data-v-f87c67ca=\"\">surged to $787 million<\/a> at the time of writing, according to CoinGecko.&nbsp;","So when Cronje disclosed his another project Eminence, via retweets, yield farmers didn't seem to want to miss an opportunity and ended up depositing $15 million in the unfinished protocol.","\"Just aped into $EMN,\" <a href=\"https:\/\/twitter.com\/ChainLinkGod\/status\/1310748693235073025\" data-v-f87c67ca=\"\">tweeted @ChainLinkGod<\/a>, for instance. \"I still have no idea what it does or what its purpose actually is, but hey if @AndreCronjeTech is involved, I'll degen in any day of the week.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Unfinished business&nbsp;<\/strong><\/span>","Cronje <a href=\"https:\/\/twitter.com\/AndreCronjeTech\/status\/1310763506170499072\" data-v-f87c67ca=\"\">said<\/a> Eminence is at least three weeks away, which he disclosed only after the exploit took place. \"Yesterday we finished the concept behind our new economy for a gaming multiverse. Eminence. As per my usual methodology, I deployed our staging contracts on ETH so we can continue developing on it,\" he said.","Cronje deployed smart contracts for Eminence, with \"burn\" and \"mint\" possibilities, meaning users could deposit funds and mint Eminence's native EMN token.","\"Almost [$]15m was deposited into the contracts,\" <a href=\"https:\/\/twitter.com\/AndreCronjeTech\/status\/1310763506170499072\" data-v-f87c67ca=\"\">said<\/a> Cronje. \"The contracts were exploited for the full [$]15m and [$]8m was sent to my yearn: deployer account.\"","Cronje termed the exploit as a \"very simple one\" — \"mint a lot of EMN at the tight curve, burn the EMN for one of the other currencies, sell the currency for EMN.\"","One trader, for instance, <a href=\"https:\/\/twitter.com\/fomosaurus\/status\/1310761830353186816\" data-v-f87c67ca=\"\">lost<\/a> $130,000 in one hour by depositing funds in Eminence. Here's how EMN tank:<br data-v-f87c67ca=\"\">\n","","While traders are ultimately responsible for any loss of funds deposited into unfinished and unaudited protocols, Cronje's actions, i.e., teasing about and retweeting Eminence's project before it is completed, could be held responsible, according to some members of the DeFi community.","\"Andre deployed these contracts from the main 'Yearn Deployer' address. People watch his every move, every transaction. Why didn't he use an alternative, non-followed address to deploy\/test if these were indeed just 'staging' contracts?,\" <a href=\"https:\/\/twitter.com\/mickhagen\/status\/1310832743744323584\" data-v-f87c67ca=\"\">asked Mick Hagen<\/a>, founder of Genesis Block.","\"Just after he deploys the contracts, he starts RTing [re-tweeting] mysterious, FOMO [fear of missing out]-inducing teasers. The domain is theirs,\" said Hagen. \"It all checks out. The hype is building. This train is leaving the station. No turning back. Anything Andre touches turns to gold. Degen mode activated.\"","Hagen said the situation could have been mitigated if Cronje didn't induce FOMO by retweeting teasers of his new gaming protocol.","Some other members of the crypto community shared similar thoughts, including <a href=\"https:\/\/twitter.com\/krugermacro\/status\/1310828969399390208\" data-v-f87c67ca=\"\">Alex Krüger<\/a> and \"<a href=\"https:\/\/twitter.com\/CryptoMessiah\/status\/1310803248874500102\" data-v-f87c67ca=\"\">@CryptoMessiah.<\/a>\"","\"Given some of the responses, let me be clear, do not use random contracts I deploy unless I reference it in a medium article,\" <a href=\"https:\/\/twitter.com\/andrecronjetech\/status\/1310804039425306624?s=21\" data-v-f87c67ca=\"\">said<\/a> Cronje. \"The contracts I deployed yesterday were purely for myself to engage with.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen asked whether Eminence would issue new tokens to depositors who lost money, Cronje told The Block: \"I don't have a comment on that at this time.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAccording to a <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1310885097252556801\" data-v-f87c67ca=\"\">blockchain analyst<\/a>, the attacker used an address that has interacted with centralized exchanges such as Huobi in the past. This could help recover the lost funds if third parties cooperate."],"hashtag":[]}