{"summary":"What’s Happening In Crypto Today? Daily Crypto News Digest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-news-today.htm","publishDate":"2024-05-14T11:00:21","id":18645,"type":null,"title":"What’s Happening In Crypto Today? Daily Crypto News Digest","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news today – investigating the stories flying under the radar of today’s news.","","In crypto news today:","","__________","The global cryptocurrency market capitalization is up 1% over the past 24 hours.","It currently totals $2.39 trillion. Most coins in the top 100 category, however, remain red. Worldcoin (WLD)recorded the highest drop. It’s down 11.3% to $5.25.","Ethena (ENA) and THORChain (RUNE) follow with falls of 9.3% and 9.1% to $0.7521 and $5.54, respectively. The rest decreased below 9%. At the same time, only 15 out of the 100 are green.","The best performer by far is PEPE. Its price increased by 22% over the past day, now trading at $0.00001074.FLOKI is next in line, having appreciated 12% to $0.0001945.Meme coins are generally having a good day as WIF, DOGE, SHIB, and BONK are also on this list.","When it comes to the top 10 coins by market cap, the prices of three have increased over the past 24 hours. The best performer in this category is Dogecoin, with a 6.5% increase to $0.15262.","Solana (SOL) is next. Its price rose 2.2% to $146. Lastly, XRP went up 0.32%, currently trading at $0.5059.In the meantime, the drops are on the smaller side as well. Toncoin (TON) fell the most: 2.7% to $7.","Bitcoin (BTC) is down 0.5% to $62,047, while Ethereum (ETH)declined by 1.1% to $2,923.Meanwhile, VanEck’s spot Bitcoin exchange-traded fund (ETF) saw significant growth in Q1 this year.","In a recent filing with the US Securities and Exchange Commission (SEC), the HODL Bitcoin ETF recorded an increase of $109 million in net assets for the first fiscal quarter of 2024, which concluded on March 31.","In crypto news today, European fintech unicorn Bitpanda announced that it partnered with MarketVector Indexes to launch a new index for investors to diversify their crypto portfolios.","The BCI Meme Coin Leaders Index will include the six largest meme coins by market capitalization at the time of launch: PEPE, FLOKI, WIF, BONK, DOGE, and SHIB.","“This highly popular category of cryptocurrencies is increasingly of interest to investors looking to diversify their portfolios outside of more established coins,” the press release said.","Furthermore, the index will be part of the Bitpanda Crypto Index range originally launched in 2020. It enables users to invest in the market as a whole, rather than individual assets.","When the market changes, the Index automatically adjusts the portfolio composition in a process called “rebalancing,” it added. MarketVector calculates and reviews the monthly adjustments. Also, Indices behave like other digital assets, so Bitpanda users can buy, sell, or swap all assets in their Index portfolios in a matter of seconds.","Meme coins have become a staple of our industry, mixing light-hearted fun with explosive growth potential.","With the Bitpanda Meme Coin Leaders Index, you can now gain exposure to the top meme coins around, in the same care-free rebalancing package you know and love.","BCIMEME… pic.twitter.com\/d0b2CU2fzC","— Bitpanda (@Bitpanda_global) May 13, 2024","","According to Bitpanda CEO and co-founder Eric Demuth, the demand from users to have a simple way to invest in meme coins “has been huge.”","“For all the investors that love crypto, dogs, and memes – such index, much wow,” he added.","Also, Martin Leinweber, Digital Asset Product Strategist at MarketVector, said that the partnership between the two companies over the past four years “has been instrumental in developing various indices that resonate with the broad interests of crypto investors.”","The stablecoin sector showed “robust growth,” despite a moderated market sentiment, found KuCoin’s latest monthly research report.","Notably, the issuance of major stablecoins like USDT and USDC increased by $6 billion and $868 million, respectively. The total financing scale reached 1.024 billion, “maintaining a relatively high level.”","This signals “steady capital inflows and sustained investor interest in the crypto sector,” the press release said.","Additionally, the report found that, despite a net outflow from Bitcoin spot ETFs, “funds from other channels were willing to enter the crypto market through stablecoins, with USDT playing a significant role.”","Also, PYUSD recovered from a drop in issuance seen in March, growing by $129 million in April.","USDe issuance continued to rise with the BTC price in early April. It hit a peak of $2.39 billion in mid-April, then declined with the BTC price drop. Nonetheless, the overall issuance level remained around $2.34 billion.","In other crypto news today, embedded finance and Banking-as-a-Service (BaaS) platform OpenPayd announced its partnership with Web3 money app Wirex to provide named virtual IBANs to its customers across the UK and European Economic Area (EEA).","According to the press release, OpenPayd will issue virtual IBANs to Wirex customers in more than 30 countries. They will get a unique IBAN, enabling them to seamlessly transfer EUR and GBP between their Wirex and bank accounts.","Customers will have access to the Faster Payments network in the UK and Single Euro Payments Area (SEPA) Instant payments for Euro-denominated deposits and withdrawals.","This will significantly improve customer experience, given that payments across OpenPayd’s SEPA Instant and Faster Payments rails take place in real-time, all day, every day.","Furthermore, the service will be fully embedded into Wirex’s infrastructure via OpenPayd’s single API, the announcement said.","In our latest video, our team talks through what OpenPayd brings to businesses all over the world and why it matters.","Here's everything you need to know about the OpenPayd product in 2024, in 2.04 minutes 🎥https:\/\/t.co\/CToc6gqqtg","— OpenPayd (@OpenPayd) May 3, 2024","","Wirex CEO Pavel Matveev said that named IBANs offer customers an improved user experience and a more personalized service. “They also enable our teams to completely automate back office account reconciliation,” he added.","OpenPayd CEO Iana Dimitrova commented that “high-growth digital assets businesses need reliable, scalable banking and payments partners to deliver a seamless user experience without incurring delays or prohibitive fees.”","__________","For the latest crypto news updates, bookmark this page and subscribe to our newsletter!"],"entity":[{"type":"$146","content":"MONEY"},{"type":"2.7%","content":"PERCENT"},{"type":"EUR","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Single Euro","content":"ORGANIZATION"},{"type":"0.5%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"$0.15262","content":"MONEY"},{"type":"BONK","content":"ORGANIZATION"},{"type":"$0.5059","content":"MONEY"},{"type":"Eric Demuth","content":"PERSON"},{"type":"$2.39 trillion","content":"MONEY"},{"type":"$5.25","content":"MONEY"},{"type":"May 3, 2024","content":"DATE"},{"type":"$868 million","content":"MONEY"},{"type":"$2,923","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"9.3%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"mid-April","content":"DATE"},{"type":"$0.7521","content":"MONEY"},{"type":"BONK","content":"LOCATION"},{"type":"Digital Asset Product Strategist","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"ENA","content":"ORGANIZATION"},{"type":"March 31","content":"DATE"},{"type":"March","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$62,047","content":"MONEY"},{"type":"$129 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Bitpanda CEO","content":"ORGANIZATION"},{"type":"0.32%","content":"PERCENT"},{"type":"6.5%","content":"PERCENT"},{"type":"$0.0001945","content":"MONEY"},{"type":"$5.54","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Martin Leinweber","content":"PERSON"},{"type":"HODL Bitcoin ETF","content":"ORGANIZATION"},{"type":"GBP","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$7","content":"MONEY"},{"type":"$0.00001074","content":"MONEY"},{"type":"Pavel Matveev","content":"PERSON"},{"type":"$2.34 billion","content":"MONEY"},{"type":"9.1%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"Dogecoin","content":"LOCATION"},{"type":"$109 million","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"2.2%","content":"PERCENT"},{"type":"1.1%","content":"PERCENT"},{"type":"the first fiscal quarter of 2024","content":"DATE"},{"type":"Iana Dimitrova","content":"PERSON"},{"type":"11.3%","content":"PERCENT"},{"type":"$6 billion","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"May 13, 2024","content":"DATE"},{"type":"$2.39 billion","content":"MONEY"}],"hashtag":["Best Crypto","Bitcoin","Crypto News"],"authors":["Sead Fadilpašić"]}