{"summary":"Over 70% of Crypto Users Have Never Lost Assets to Phishing or Hacks: Survey","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-users-majority-never-lost-assets-phishing-hacks-survey.htm","publishDate":"2024-02-29T14:00:52","id":18647,"type":null,"title":"Over 70% of Crypto Users Have Never Lost Assets to Phishing or Hacks: Survey","category":["News "],"content":["Crypto isn’t just a playground for hackers wiping out investors’ cash.","A WalletConnect survey published Thursday found that more than 72% of crypto wallet owners in the US and UK said they’ve never experienced losses from phishing or hacks.","The anonymous survey, conducted between Jan. 23 and Feb. 6, 2024 along with YouGov, collected 299 responses from individuals aged 18 and above who possess at least one wallet.","WalletConnect’s survey segmented participants into distinct groups. These include The Newbie—individuals who established their first crypto wallet in 2023; the DeFi DeGen—those involved in DeFi activities within the last three months; the NFT Nerd—individuals who engaged in NFT buying, trading, or selling within the same timeframe; and the Cryptonaut—those who held more than two wallets and actively explored new crypto opportunities.","The largest subgroup identified was the Trader Type, comprising individuals who participated in buying, selling, and trading crypto assets within the last three months.","Less than 30% of participants reported experiencing crypto losses from malware, phishing, or wallet issues. However, this figure rose to 49% for Cryptonauts and surged to 58% for DeFi Degens.","Different subgroups display varying outlooks for the future of phishing attacks increasing, with DeFi Degens exhibiting more optimism. Meanwhile, Cryptonauts and NFT Nerds anticipate an increase in the number of attacks.","This suggests diverse sentiments within crypto user communities, presenting an opportunity for industry leaders to proactively address cybersecurity issues, according to the WalletConnect team.","Persistent cyber attacks pose an ongoing challenge for the cryptocurrency industry, contributing to regulatory skepticism worldwide. It is one of the reasons people remain skeptical of the industry’s reliability and security.","However, data indicates that hacking incidents in the cryptocurrency space are on the decline and occurring less frequently than in the past. For example, in 2023, hackers targeted cryptocurrency platforms and stole around $1.7b, marking a significant 54.3% decrease from the previous year, according to Chainalysis.","Despite funding challenges for the crypto industry last year, security companies still secured $8.2b from venture capital deals, indicating a persistent need and demand for such services.","The survey highlighted a disparity in security adoption among respondents. While over 50% expressed considerable confidence in using crypto products and services, only 27% said they consistently implement additional security measures. Additionally, 6% admitted to neglecting to add them altogether. Interestingly, there was a significant demand for “advanced security features” in wallets.","Over 50% of participants indicated a sense of security when engaging with crypto products and services. Particularly, this confidence level rose to about 70%-75% among individuals highly knowledgeable about crypto, such as DeFi Degens and NFT Nerds.","But worries arise as this drops to 39% among Newbies, showing the steep learning curve in crypto.","These findings signal potential difficulties in getting new users into crypto. To that end, the survey highlighted this as a chance for developers to boost efforts in making people feel safer."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"$1.7","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"72%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$8.2","content":"MONEY"},{"type":"Jan. 23","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"54.3%","content":"PERCENT"},{"type":"NFT Nerds","content":"ORGANIZATION"},{"type":"Feb. 6, 2024","content":"DATE"},{"type":"39%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"58%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"YouGov","content":"PERSON"},{"type":"49%","content":"PERCENT"},{"type":"27%","content":"PERCENT"}],"hashtag":["Crypto hack","Security","Survey"],"authors":["Shalini Nagarajan"]}