{"summary":"Trump Flips Stance on Bitcoin: “I’m Not Sure If I’d Want to Take it Away At This Point”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/trump-flips-stance-on-bitcoin-im-not-sure-if-id-want-to-take-it-away-at-this-point.htm","publishDate":"2024-03-11T18:07:09","id":18651,"type":null,"title":"Trump Flips Stance on Bitcoin: “I’m Not Sure If I’d Want to Take it Away At This Point”","category":["Bitcoin News "],"content":["Republican presidential frontrunner Donald Trump took to CNBC on Monday to reveal he was unsure whether he would want to get rid of Bitcoin despite criticizing it in the past, going so far as to say he has “fun” with the cryptocurrency.","“There has been a lot of use of that (bitcoin) and I’m not sure that I would want to take it away at this point,” Trump said during his appearance on CNBC’s Squawk Box.","“It’s taken [on] its own life,” he continued. “You know, I do little things for fun with it and you know make money with it—and have fun with it, too.","Trump now sounds bullish on Bitcoin. Personally, I don’t believe him. He and his administration had a shot for supporting Bitcoin. It was hard if not a full stone wall to work with them.","CNBC video recording by: @thewallstbulloz pic.twitter.com\/SFMPEIcaqC","— Gabor Gurbacs (@gaborgurbacs) March 11, 2024","","The leading GOP candidate’s praise for Bitcoin marks a shift in his stance towards cryptocurrencies in general, having previously called them “highly volatile” and “based on thin air.”","“Sometimes, we’ll let people pay with Bitcoin,” Trump said about the recently released American-themed sneaker line. “If you think of it, it’s an additional form of currency.”","The former president has previously expressed disdain for cryptocurrencies being used instead of the United States dollar, referring to himself as “not a fan”.","“We have only one real currency in the USA, and it is stronger than ever, both dependable and reliable,” Trump stated in 2019. “It is by far the most dominant currency anywhere in the World, and it will always stay that way.”","During his Monday appearance on Squawk Box, Trump doubled down on his USD-first position, stating replacing USD would be “a hit” to the country.","“I hate when countries go off the dollar,” he continued. “I would not allow countries to go off the dollar because when we lose that standard that will be like losing a revolutionary war.”","Trump’s comments come amid a feverish rally for Bitcoin, with its price surging above $72,000 on Monday morning.","Bitcoin’s latest rally follows the United States Security and Exchange Commission’s (SEC) January 2024 approval of nine spot bitcoin ETFs in a move that many feel will signal greater mainstream adoption of the cryptocurrency.","As of last week, spot bitcoin ETFs had reached cumulative net inflows of over $9.37 billion since their regulatory debut.","Bloomberg senior ETF analyst Eric Balchunas took to X Monday morning to call the rapid growth of spot bitcoin ETFs “simply absurd.”","First two months officially in the books (it's felt like six) and the ten bitcoin ETFs now have over $55b in assets with exactly double that in volume at $110b. If these were the numbers at the end of year I'd call them a success. To do it in eight weeks is simply absurd. pic.twitter.com\/8YvzQZdYyJ","— Eric Balchunas (@EricBalchunas) March 11, 2024","","Meanwhile, bitcoin’s price may continue to skyrocket in advance of its quadrennial halving event expected in April 2024."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"$110b","content":"MONEY"},{"type":"March 11, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bitcoin marks","content":"MONEY"},{"type":"January 2024","content":"DATE"},{"type":"USA","content":"ORGANIZATION"},{"type":"$55b","content":"MONEY"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"United States Security and Exchange Commission","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Squawk Box","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Trump","content":"PERSON"},{"type":"$72,000","content":"MONEY"},{"type":"$9.37 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","spot Bitcoin ETF","Trump"],"authors":["Julia Smith"]}