{"summary":"The Blockchain Association has filed to submit a brief giving further context in the Grayscale appeal for its bitcoin ETF application.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178170\/blockchain-association-files-supporting-brief-in-grayscales-bitcoin-etf-appeal","publishDate":"2022-10-18T21:03:50","id":1865,"type":null,"title":"Blockchain Association files supporting brief in Grayscale&#x27;s bitcoin ETF appeal","category":["POLICY"],"content":["The Blockchain Association has filed a brief giving further context to Grayscale's legal face-off with the Securities and Exchange Commission over its failure to approve a spot-bitcoin exchange-traded fund.","The Blockchain Association, a DC-based advocacy group focused on blockchain policy, filed an amicus brief in the Grayscale suit today. Amicus briefs allow outside parties with court approval to offer additional information or insight, though they cannot introduce new facts.","The Blockchain Association's brief supports Grayscale's argument that the SEC's <a href=\"https:\/\/www.theblock.co\/post\/154924\/sec-rejects-grayscales-bid-to-convert-gbtc-to-a-bitcoin-etf?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">denial of its application<\/a> to convert its flagship fund into an ETF violates its procedures. It began the <a href=\"https:\/\/www.theblock.co\/linked\/155000\/grayscale-files-suit-against-sec-following-rejection-of-gbtc-conversion-bid\" data-v-f87c67ca=\"\">appeal process<\/a> soon after it received its rejection.&nbsp;","\"After approving futures-based Bitcoin ETPs, the SEC has abandoned its investor protection mandate and abused its discretion by denying every application for a spot-based Bitcoin ETP, including Grayscale’s application,\" said Blockchain Association Head of Policy Jake Chervinsky in a statement.","Because futures are priced based on the underlying market, Grayscale and its supporters claim the SEC should be comfortable with a product that holds the underlying asset itself. With that line of thinking, supporters say that the SEC's approval of futures-based bitcoin ETFs starting last year should have cleared the way for a spot product. However, the SEC has rejected every application before it on the grounds that there aren't sufficient protections against manipulation in the spot market.&nbsp;","\"Continuing to deny proposals to list spot Bitcoin ETPs ignores the exchanges’ existing fraud surveillance apparatus, as well as the robust anti-fraud and antimanipulation features of the spot Bitcoin ETPs, including unique features of the Grayscale Trust,\" said the <a href=\"https:\/\/theblockchainassociation.org\/wp-content\/uploads\/2022\/10\/Grayscale-Amicus-Brief-Filing.pdf\" data-v-f87c67ca=\"\">Blockchain Association amicus brief<\/a>.","The Blockchain Association filing says denying the proposals is inconsistent with the Commission's treatment of similar products and \"cuts against SEC regulatory and policy imperatives,\" by depriving consumers of a product they contend is often more suited to certain investor demands.&nbsp;","\"The Commission’s use of a double standard to evaluate Bitcoin futures ETPs and spot ETPs is not only bad policy, but also in contravention of law,\" said the Blockchain Association filing. \"The Commission must treat like cases alike.\"","Other advocacy groups like Coin Center and the Chamber of Digital Commerce are seeking amici status in the case. Grayscale filed its <a href=\"https:\/\/www.theblock.co\/post\/176392\/grayscale-says-sec-harmed-investors-in-new-brief-appealing-etf-rejection\" data-v-f87c67ca=\"\">opening brief<\/a> in the appeal case last week, and the SEC response is due next month.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Blockchain Association Head of Policy Jake Chervinsky","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Grayscale Trust","content":"ORGANIZATION"},{"type":"Bitcoin ETP","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"ETF","content":"ORGANIZATION"},{"type":"last week","content":"DATE"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}