{"summary":"Nigerian Central Bank Introduces NFC Technology to Boost eNaira Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigerian-central-bank-introduces-nfc-technology-boost-enaira-adoption.htm","publishDate":"2023-07-24T09:17:00","id":18656,"type":null,"title":"Nigerian Central Bank Introduces NFC Technology to Boost eNaira Adoption","category":["Altcoin News "],"content":["The Central Bank of Nigeria (CBN) remains committed to the central bank digital currency (CBDC) project, despite the recent ousting of the former governor. ","In a bid to further encourage the adoption of the eNaira and enhance the CBDC mobile app, the central bank has incorporated Near Field Communication (NFC) technology, allowing for convenient and contactless payments, according to a report by local news outlet The Sun. ","Previously, the eNaira mobile app utilized QR codes for transactions.","However, the CBN has now added NFC technology to facilitate seamless interaction between mobile devices and payment terminals. ","Near-field communication (NFC) is a short-range wireless connectivity technology that uses magnetic field induction to enable communication between devices.","During an eNaira sensitization workshop at the University of Abuja, Joseph Angaye, the deputy director of the CBN’s risk management department, highlighted the importance of embracing new technology. ","He said the upgrade is expected to play a crucial role in increasing the adoption rates for the CBDC.","Angaye claimed that the eNaira has evolved and has added a number of useful features. ","“There are many benefits of the eNaira app. The world is going digital and the CBN cannot afford to lag behind. So, when there’s a new technology, we embrace it,” he said.","“We were like the second nation to launch the eNaira app. The app has many uses and advantages. It can be programmed.”","Furthermore, the eNaira app offers various programmable features that enhance its practicality and functionality. ","For example, it can be programmed to be used within specific locations or for specific items, which makes it particularly useful for executing intervention programs. ","Authorities can also ensure that funds are allocated only for the intended purposes, preventing misuse or diversion. ","“That’s the beauty of it. Speed of transaction, reduction of settlement risks have all been taken care of by the CBN’s eNaira.”","Nigeria launched the eNaira in 2021, becoming one of the very first countries in the world to offer a CBDC. ","However, initial adoption rates fell below expectations, prompting the CBN to explore various strategies to drive usage. ","For one, the central bank has introduced use cases in the transport sector and integrated USSD functionality into the eNaira offering. ","Despite these efforts, former CBN Governor Godwin Emefiele attributed the slow growth of the eNaira to commercial banks prioritizing their profitability over the CBDC’s expansion.","It is worth noting that Nigeria’s central bank had previously banned banks and financial institutions from facilitating transactions in digital currencies in 2021. ","However, despite the ban, residents in Africa’s most populous country still make up the largest volume of digital token transactions done on peer-to-peer trading platforms outside of the United States."],"entity":[{"type":"NFC","content":"ORGANIZATION"},{"type":"Joseph Angaye","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Central Bank of Nigeria (CBN","content":"ORGANIZATION"},{"type":"Godwin Emefiele","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"CBN","content":"ORGANIZATION"},{"type":"the University of Abuja","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Near Field Communication (NFC","content":"ORGANIZATION"}],"hashtag":["CBDC"],"authors":["Ruholamin Haqshanas"]}