{"summary":"OpenSea Claims Users Can Save 35% in Gas Cost Following Migration to Seaport","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/opensea-claims-users-can-save-35-in-gas-cost-following-migration-to-seaport.htm","publishDate":"2022-06-15T14:00:00","id":18666,"type":null,"title":"OpenSea Claims Users Can Save 35% in Gas Cost Following Migration to Seaport","category":["News "],"content":[" ","OpenSea, the world’s largest non-fungible token (NFT) marketplace in terms of trading volume, has announced a major migration which they say will enable users to save “an estimated 35%” in gas fees going forward.","The marketplace is migrating to a new Web 3 marketplace protocol called Seaport, which is designed to enable users to trade digital assets “safely and efficiently,” according to a recent announcement.","“Seaport is a game changer – it’s open source, inherently decentralized, and a modern foundation that will help us (and any teams using it) build and release new features more quickly,” the announcement said.","Among the more notable benefits of the new protocol is that it is well-optimized for transaction efficiency. “You’ll save an estimated 35% in gas fees for transactions using Seaport,” OpenSea claimed, adding that this would translate into over USD 460m in total savings based on last year’s data.","Moreover, with this new migration, the proxy deployment fee, a one-time setup fee new users currently have to pay in order to use OpenSea, will also be waived. This could help users save another USD 120m each year, according to OpenSea.","The new update will also allow users “to quickly build new features that were previously impossible.” This includes Collection Offers, which are offers on all items in a collection, as well as Trait Offers, offers on a group of items with specific attributes.","“We also now show the % rarity, the floor price, and the highest offer – all filtered by attribute, so you have better information to decide how much to offer,” OpenSea added.","Seaport is an open-source project by OpenSea. The marketplace announced the protocol last month and asked developers and creators to start building on top of it.","____","Learn more: \n– OpenSea’s New Marketplace Protocol Could Become ‘Uniswap Moment’ of NFTs\n– OpenSea Now Supports Solana NFTs in Beta\n\n– ‘NFTs May Be New, but This Criminal Scheme Isn’t’: Ex-OpenSea Head Arrested for NFT Insider Trading\n– Another Expensive NFT Gets Mistakenly Sold at Large Discount – How Does That Happen?\n\n– NFT Infrastructure Moves: OpenSea Acquires Dharma, Coinbase Partners With Mastercard\n– New Partnership to Give ’83M Users’ Access to .blockchain NFT Domains"],"entity":[{"type":"OpenSea’s New Marketplace Protocol Could Become ‘Uniswap Moment","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"NFT Insider Trading\n– Another Expensive NFT","content":"ORGANIZATION"},{"type":"Seaport","content":"LOCATION"},{"type":"Coinbase Partners With Mastercard","content":"ORGANIZATION"},{"type":"Trait Offers","content":"ORGANIZATION"},{"type":"the %","content":"PERCENT"},{"type":"OpenSea Acquires Dharma","content":"ORGANIZATION"}],"hashtag":["Fees","NFT","Non-fungible tokens","Opensea"],"authors":["Ruholamin Haqshanas"]}