{"summary":"dYdX said it banned user accounts with a history of using Tornado Cash.\nThe exchange also clarified that it inaccurately blocked several accounts, which it later unblocked.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162928\/dydx-confirms-blocking-user-accounts-tied-to-tornado-cash","publishDate":"2022-08-11T03:10:28","id":1866,"type":null,"title":"dYdX confirms blocking user accounts tied to Tornado Cash","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Derivatives protocol dYdX confirmed on Thursday morning that it blocked user <\/span><span data-v-f87c67ca=\"\">accounts that previously interacted with Tornado Cash, in line with new US sanctions. <\/span>","<span data-v-f87c67ca=\"\">dYdX added in <a href=\"https:\/\/dydx.exchange\/blog\/tornado-outage\" data-v-f87c67ca=\"\">a blog post<\/a>&nbsp;that it is working with a \"compliance vendor\" that flagged certain accounts that had received funds from the Tornado Cash app.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tornado Cash, a privacy and transaction mixing service on Ethereum, has been in the spotlight in recent days after the protocol was <a href=\"https:\/\/www.theblock.co\/post\/162817\/treasury-sanctions-on-tornado-cash-extend-far-beyond-the-us\" data-v-f87c67ca=\"\">sanctioned<\/a> by the US Treasury.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the blog post, dYdX wrote: \"Many accounts were blocked because a certain portion of the wallet’s funds (in many cases, even immaterial amounts) were associated at some time with Tornado Cash, which was recently added to the sanctions list by the U.S.\"<\/span>","<span data-v-f87c67ca=\"\">The exchange, though, clarified that it inaccurately banned several accounts, which had to be reversed. dYdX noted that these users hadn't directly engaged with Tornado Cash and that they may not have known the origin of the funds transferred to them.<\/span>","<span data-v-f87c67ca=\"\">\"We have made adjustments, within the limits of our compliance policies, that have unbanned certain accounts and we will continue to make efforts to limit flagging and track this issue moving forward,\" dYdX added.<\/span>","<span data-v-f87c67ca=\"\">Due to compliance needs, exchanges like dYdX may refuse to do business with users who try to bring assets to their platforms from Tornado Cash-linked accounts. However, exchanges are not the only kind of crypto firms taking action in response to Tornado getting sanctioned. In fact, t<\/span><span data-v-f87c67ca=\"\">here are broader ramifications seen in the crypto sector in relation to this development.<\/span>","<span data-v-f87c67ca=\"\">For instance, Ethereum infrastructure provider Alchemy <a href=\"https:\/\/www.theblock.co\/post\/162402\/infura-and-alchemy-blocking-access-to-tornado-cash\" data-v-f87c67ca=\"\">blocked Tornado Cash<\/a> users from accessing its nodes. In another example, GitHub <a href=\"https:\/\/decrypt.co\/107053\/it-doesnt-change-anything-says-tornado-cash-code-disappears-github\" data-v-f87c67ca=\"\">deleted accounts<\/a> of Tornado's contributors, wiping out of all of their software repositories on the platform.<\/span>"],"hashtag":[]}