{"summary":"Spanish Bank A&G Launches Crypto Investment Fund Offering","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spanish-bank-ag-launches-crypto-investment-fund-offering.htm","publishDate":"2023-07-25T06:00:00","id":18669,"type":null,"title":"Spanish Bank A&G Launches Crypto Investment Fund Offering","category":["Blockchain News "],"content":["The leading Spanish private bank A&G has launched a crypto investment fund offering, in a sign adoption is continuing to rise in the European nation.","Europa Press reported that A&G will launch an investment fund product after registering the fund’s brochure with the regulatory National Securities Market Commission (CNMV).","The fund will be the first of its kind in Spain.","The bank said investors had expressed “great interest” in crypto investment.","A&G said crypto investment “can be channeled with more efficient risk management and control, via investment products that are safer and better regulated.”","The bank also said that funds where “professionals subject to supervision are involved” represented a safe choice for crypto-keen investors.","Another bank, CACEIS, will function as the fund’s depositary, while PwC (PricewaterhouseCoopers) will serve as its auditor.","CACEIS Bank is the joint asset servicing arm of the European banking powerhouses Crédit Agricole and Santander.","Last month, CACEIS was awarded a crypto custody license by the French markets regulator.","A&G said that the exact composition of the fund had not yet been determined.","But the bank said the fund will “have between 50% and 100% exposure to cryptocurrencies, exclusively through financial instruments whose profitability is linked to [tokens].”","The fund will have exposure to both Bitcoin (BTC) and Ethereum (ETH).","It will also have a “minority” exposure to “other existing or future cryptocurrencies that have satisfactory levels of volume and liquidity.”","The brochure notes that A&G’s new fund “may not be suitable for investors who plan to withdraw their money in a period of less than four years.”","However, the brochure also includes mandatory warnings from the CNMV.","The regulator notes that the fund involves “investments in financial instruments whose profitability is linked to cryptocurrencies.”","This entails, per the regulator, “very high levels of risk due to cryptocurrencies’ extreme volatility, complexity, lack of transparency, custody, and concentration risk, which may lead to the total loss of [your] investment.”","In March, a prominent Spanish MP said he was stepping down from his role in parliament to pursue a crypto-related career.","And earlier this month, a tax firm claimed that 70% of Spanish crypto holders making tax declarations had experienced losses on their token investments in FY2022."],"entity":[{"type":"National Securities Market Commission","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"A&G","content":"ORGANIZATION"},{"type":"Spain","content":"LOCATION"},{"type":"Crédit Agricole","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"PricewaterhouseCoopers","content":"ORGANIZATION"}],"hashtag":["Bank","Spain"],"authors":["Tim Alper"]}