{"summary":"Bitcoin Transaction Fees Plummet to Single Digits After Record High of $128 on Halving Day","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-transaction-fees-plummet-to-single-digits.htm","publishDate":"2024-04-22T06:29:23","id":18660,"type":null,"title":"Bitcoin Transaction Fees Plummet to Single Digits After Record High of $128 on Halving Day","category":["Bitcoin News "],"content":["Bitcoin transaction fees experienced a significant drop just one day after reaching an all-time high average of $128 on April 20, coinciding with the fourth Bitcoin halving. ","As of April 21, the average fees for medium-priority transactions on the Bitcoin network fell to a range of $8-10, according to data from mempool.space.","The preceding day had witnessed a remarkable surge in total fees, with Bitcoin recording $78.3 million in fees, surpassing Ethereum by over 24 times, as reported by Crypto Fees. ","Notably, the Bitcoin halving block at block height 840,000 included a staggering 37.7 Bitcoin (equivalent to $2.4 million) paid to Bitcoin miner ViaBTC, making it the most coveted piece of digital real estate in the network’s 15-year history.","The demand for block 840,000 was largely driven by enthusiasts of memecoins and non-fungible tokens (NFTs) competing to inscribe and etch rare satoshis using the Runes protocol, a newly launched token standard that debuted at the halving block. ","A total of 3,050 transactions were included in that block, resulting in an average fee of slightly under $800 per user.","The elevated block fees persisted until approximately block 840,200, as per mempool.space. ","Subsequently, fees have fallen to around 1-2 Bitcoin per block. ","The substantial block fee payouts to miners during the halving day initially shielded them from the impact of the block subsidy reduction from 6.25 Bitcoin to 3.125 Bitcoin. ","However, with the average block fee now well below 3.125 Bitcoin, miners are feeling the effects of the halving.","Furthermore, Bitcoin has surpassed Ethereum in terms of fees for six consecutive days between April 15th and 20th, with the 7-day fee average standing at $17.8 million.","Interestingly, the Bitcoin halving event did not significantly impact the price of Bitcoin, which has risen by 1.5% since then, reaching $64,840, as reported by CoinGecko.","While Bitcoin did not immediately react to the much-anticipated halving event, the leading cryptocurrency has since registered some gains. ","As of now, Bitcoin is trading at $66,266, up by almost 2% over the past day, according to data from CoinMarketCap.","While some analysts, including JPMorgan, have cautioned about a potential further price slide following this quadrennial event, the overall consensus remains bullish in the long term.","Just recently, Bitwise said that while the month immediately following the halving typically sees a modest drop in price, the subsequent year often witnesses exponential gains. ","The asset manager noted that following the 2012 halving, Bitcoin experienced a meager 9% increase in the month post-halving, only to skyrocket by a staggering 8,839% over the following year. ","Similar patterns were observed after the 2016 and 2020 halvings, with Bitcoin’s price surging significantly in the year following each event.","Likewise, Crypto.com CEO Kris Marszalek has recently said that Bitcoin may experience some selling pressure in the lead-up to the highly anticipated halving event, but the long-term outlook remains bullish. "],"entity":[{"type":"$128","content":"MONEY"},{"type":"$800","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"8,839%","content":"PERCENT"},{"type":"April 21","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"$64,840","content":"MONEY"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"$8","content":"MONEY"},{"type":"$17.8 million","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin miner ViaBTC","content":"PERSON"},{"type":"$2.4 million","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"$78.3 million","content":"MONEY"},{"type":"April 15th","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"10","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"$66,266","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Transactions"],"authors":["Ruholamin Haqshanas"]}