{"summary":"DOJ Counters Tornado Cash Developer Roman Storm’s Defense, Asserting Money Transmitting Operations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/doj-counters-tornado-cash-developer-roman-storms-defense-asserting-money-transmitting-operations.htm","publishDate":"2024-04-27T17:30:15","id":18661,"type":null,"title":"DOJ Counters Tornado Cash Developer Roman Storm’s Defense, Asserting Money Transmitting Operations","category":["Altcoin News "],"content":["The US Department of Justice (DOJ) has rejected Tornado Cash developer Roman Storm’s motion to dismiss criminal charges, arguing that the defense’s filing presented disputed facts that should be weighed by a jury rather than being resolved in an early-stage motion. ","Storm, along with fellow developer Roman Semenov, was charged by the DOJ with conspiracy to commit money laundering, conspiracy to operate an unlicensed money transmitter, and conspiracy to violate sanctions laws through the creation and operation of Tornado Cash.","US authorities have alleged that Tornado Cash has been used by criminal entities, including North Korea’s Lazarus Group, for money laundering purposes.","In their motion to dismiss the indictment, Storm’s attorneys argued that Tornado Cash is not a custodial mixing service and does not meet the definition of a “financial institution.”","They also contended that Storm had no control over the service and could not prevent entities like Lazarus Group from using it. ","The defense’s position was that merely developing the code for the project does not equate to operating a money laundering entity.","However, in the DOJ’s recent filing, they disputed the defense’s characterization of Tornado Cash. ","They stated that the service was announced in 2019 as a mixer and comprised a website, user interface, a combination of smart contracts, and a network of “relayers.” ","The DOJ asserted that Storm cannot dismiss the indictment based on his own contested view of how the Tornado Cash service operated or his self-serving version of his intent.","The filing also countered Storm’s assertions regarding the functionality of the Tornado Cash interface and the control individual users had over the deposit and withdrawal process.","The DOJ provided screenshots and argued that Storm and his co-founders maintained control over the mixer, at least during the time period covered by the charging document (2019 to August 2022).","The DOJ’s filing repeatedly referenced evidence that they intend to introduce during the trial, including details about how Storm and other Tornado Cash founders built and developed the system and how people utilized the service.","Storm is scheduled to stand trial in September, while Semenov remains at large. ","Earlier this year, Storm sought support from right-to-privacy advocates in anticipation of his upcoming criminal trial.","At the time, Storm said that his legal team was preparing a strong defense for his September 2024 trial. ","“Whether you’re [a] passionate developer like me involved with Web3 or just care about software and privacy, this legal battle will affect you. This case will set a major precedent for years to come,” he said. ","In response, the Arbitrum DAO submitted a proposal that called for the allocation of approximately $1.3 million worth of Arbitrum (ARB) tokens from the community wallet to assist Storm.","However, the submitter has since removed the proposal without providing any reasons.","A crowdfunding campaign on GoFundMe, intended to collect legal fees for Storm and Pertsev, was canceled on February 16 due to a breach of the platform’s terms of service that could expose GoFundMe, its employees, or users to potential harm or liability.","As reported, the US Treasury has added Tornado Cash to its Specially Designated Nationals list, effectively banning Americans from using this mixer. "," "],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"February 16","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"$1.3 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Arbitrum DAO","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"September 2024","content":"DATE"},{"type":"Roman Semenov","content":"PERSON"},{"type":"US Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Semenov","content":"PERSON"}],"hashtag":["DOJ","tornado cash"],"authors":["Ruholamin Haqshanas"]}