{"summary":"Mango Markets Exploiter Faces Charges of Child Pornography Possession","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mango-markets-exploiter-faces-charges-of-child-pornography-possession.htm","publishDate":"2024-04-29T08:04:29","id":18678,"type":null,"title":"Mango Markets Exploiter Faces Charges of Child Pornography Possession","category":["Altcoin News "],"content":["Avraham Eisenberg, the individual recently convicted of fraud and market manipulation in connection with a $110 million heist from Mango Markets, now faces additional charges of possessing child pornography. ","Court documents, dated April 3 but released on April 26, allege that Eisenberg had images in his possession depicting prepubescent minors under the age of 12.","It is important to note that these allegations have yet to be proven in court.","Earlier court documents filed in August revealed that the material was initially discovered on Eisenberg’s cell phones and laptops during a search related to the charges of market manipulation and fraud. ","Subsequently, the government obtained a second warrant in February 2023 to expand the scope of the investigation specifically for evidence related to the possession and receipt of child pornography.","Investigative journalist Christopher Brunet was the first to report on the child pornography charges. Brunet claims to have screenshots of Eisenberg engaging in disturbing conversations about children.","The emergence of these charges marks a significant development in Eisenberg’s legal troubles, which already included the conviction for fraud and market manipulation. ","The severity of the allegations surrounding child pornography further compounds the seriousness of the case.","As reported, Eisenberg has been found guilty in a Manhattan federal court for orchestrating a scheme that resulted in the theft of approximately $110 million from the Solana-based DeFi platform.","Prosecutors argued that Eisenberg orchestrated a complex exploit on the platform, leading to substantial financial losses. ","Eisenberg, who has been in custody since January 2023, could face a maximum sentence of 20 years in prison.","On October 11, 2022, Mango Markets was the victim of an attack in which approximately $110 million was drained from its treasury. ","Shortly after the attack, Avraham Eisenberg came forward as the perpetrator, asserting that the exploit was merely a “highly profitable trading strategy” and claiming it was conducted within the bounds of legality and the protocol’s intended design.","According to prosecutors, Eisenberg utilized two accounts to engage in manipulative trading involving futures contracts tied to the values of Mango’s token MNGO and the stablecoin USD Coin.","These trades purportedly inflated the value of his contracts by 1,300% within 20 minutes, allowing him to borrow against his holdings and withdraw $110 million in various cryptocurrencies.","Subsequently, Eisenberg agreed to return $67 million in exchange for other token holders refraining from pursuing legal action or freezing his assets.","He was arrested on December 26, 2022, in San Juan, Puerto Rico, where he resided, and has remained in custody since then, deemed a flight risk by prosecutors.","On January 9, the Commodity Futures Trading Commission (CFTC) supplemented the FBI’s charges, levying two counts of market manipulation against Eisenberg.","A lawsuit filed by Mango Labs characterized Eisenberg as a “notorious online personality” with a history of attacking multiple cryptocurrency platforms and manipulating cryptocurrency markets."," "],"entity":[{"type":"December 26, 2022","content":"DATE"},{"type":"1,300%","content":"PERCENT"},{"type":"April 3","content":"DATE"},{"type":"October 11, 2022","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"$67 million","content":"MONEY"},{"type":"January 9","content":"DATE"},{"type":"Eisenberg","content":"LOCATION"},{"type":"San Juan","content":"LOCATION"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"April 26","content":"DATE"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"Christopher Brunet","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"Mango Labs","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["crypto scam","Mango Market"],"authors":["Ruholamin Haqshanas"]}