{"summary":"Project Tourbillon: CBDCs Can Meet Privacy Requirements, BIS Research Reveals","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/project-tourbillon-cbdcs-can-meet-privacy-requirements-bis-research-reveals.htm","publishDate":"2023-11-29T17:09:21","id":18674,"type":null,"title":"Project Tourbillon: CBDCs Can Meet Privacy Requirements, BIS Research Reveals","category":["Blockchain News "],"content":["The Bank for International Settlement (BIS) has released the final report on Project Tourbillion, its privacy-inclined Central Bank Digital Currency (CBDC) project.","A Nov 29 release shows a pathway to achieving privacy standards in CBDC deployment and usage with two prototypes; eCash 1.0 and eCash 2.0 alongside other features geared towards anonymity.","“Project Tourbillon introduces a new privacy paradigm that balances user needs and public policy objectives: payer anonymity. For example, a consumer who pays a merchant using CBDCs does not disclose personal information to anyone, including the merchant, banks, and the central bank.”","The project highlights privacy, security, and scalability as key components in rolling out a new model CBDC to allay the fears of the public.","Payer anonymity is central to the project as it protects the payer’s data and limited information about the payee. While the payer remains protected, the identity of the merchant is revealed to the payer but remains only disclosed to the central bank.","The Central will not see personal payment data as it monitors circulation in the applied jurisdiction. The authors noted that the move seeks to create safe digital currency with regulatory clamping down on illicit transactions without jeopardizing user privacy.","“A consumer paying a merchant with CBDCs is anonymous to all parties, including the merchant, banks, and the central bank.”","This model also integrates security features to ensure confidentiality and prevent incidents of cyber threats while projecting scalability at all times.","Scalability remains pivotal in creating cross-border payment systems as they need to adjust to different mechanisms without endangering performance, especially in peak seasons characterized by huge transactions.","The first prototype eCash 1.0 aims at unconditional payment anonymity and when deposits are made to a merchant, the Central Bank adds it to a list of spent assets to prevent double-spending and counterfeit transactions.","eCash 2.0 model stores unspent notes onboarding more security features while leaning towards privacy. Despite this, there is a requirement for users to fulfill the Know Your Customer (KYC) requirements at a chosen commercial bank to use the digital currency.","The bank remains responsible for the consumer data throughout the process as is the case with traditional finance models.","The rapid development of CBDCs has been celebrated by users across several jurisdictions although skeptics argue about loopholes in the existing models.","Privacy is the top of consumer fears in Europe with data agencies issuing statements on potential violations proposing new models for financial authorities in the region.","🇪🇺 Europe’s Data Agencies Express Concerns Over Privacy Standards with The Digital Euro","The European Union data protection agencies have flagged possible areas concerning user privacy exposures of the proposed digital euro.#CryptoNewshttps:\/\/t.co\/7ngLjFXP45","— Cryptonews.com (@cryptonews) October 18, 2023","","United Kingdom users have also expressed fears of possible privacy violations although authorities have assured that the models proposed remove associated risks."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"October 18, 2023","content":"DATE"},{"type":"Project Tourbillon","content":"ORGANIZATION"},{"type":"Bank for International Settlement (BIS","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Digital Euro","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"Europe’s Data Agencies Express","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["CBDC","Privacy"],"authors":["David Pokima"]}