{"summary":"Top Crypto Gainers Today on DEXScreener – RWIF, DUMB, GME","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-crypto-gainers-today-on-dexscreener-rwif-dumb-gme.htm","publishDate":"2024-05-15T01:42:13","id":18677,"type":null,"title":"Top Crypto Gainers Today on DEXScreener – RWIF, DUMB, GME","category":["Altcoin News "],"content":["Trading conditions were broadly bearish on Tuesday as traders focused on a hotter-than-expected US PPI report and commentary from Fed Chair Jerome Powell, with traders having to turn to the on-chain meme coin markets in the hunt for top crypto gainers today.","Bitcoin (BTC) and Ether (ETH) were both down around 2% in the past 24 hours, as per CoinMarketCap.","Focus in the market has now mostly shifted to Wednesday’s release of US CPI and Retail Sales data.","This could be a major market catalyst depending on how it impacts Fed rate cut bets.","One reason why Bitcoin and Ether, last at $61,500 and $2,880 respectively, are down substantially from earlier yearly highs is that the US economy has remained hotter than expected this year.","Please US CPI, be merciful to us sinners! pic.twitter.com\/ejX8jR99bB","— Daniel Cunha (@cunhans) May 15, 2024","","Traders will be hoping for evidence that the rise in price pressures seen in recent months is beginning to reverse.","That could come as a relief to the market. But even if a bounce is incoming, major cryptos mostly remain tightly locked within recent ranges.","Big moves are unlikely to come in anytime soon. The same can not be said for the highly illiquid on-chain crypto markets.","Indeed, these markets were set alight this week by GameStop icon Roaring Kitty’s abrupt return.","Meme coins in honour of the 2021 meme stock craze leader have been spring up left, right and center.","Here are some top crypto gainers today as per Decentralized Exchange (DEX) analytics tool DEXScreener.","","A recently launched Solana meme coin called Roaring Kitty Wif Hat (RWIF), a combination of popular meme coin dogwifhat and Roaring Kitty, is ripping higher since its launch.","As per DEXScreener, it was last up 95,000% in the past 24 hours. RWIF now has a market cap of $2.7 million.","$RWIF","9 HOURS OLD","1.3K HOLDERS","269 TG MEMBERS","ATH 2.4M","BIG NAMES FOLLOWING $RWIF","NEXT LEG UP ! ARE YOU GOING TO BE LEFT BEHIND?#GME #WIF pic.twitter.com\/RCcSfyYtfr","— Roaring Kitty WIF | $RWIF (@RWIFonSol) May 14, 2024","","Little more than 12 hours old, RWIF has 1,300 holders and over 250 Telegram members.","Before getting too excited, traders should remember that nearly all newly launched coins are scams or pump-and-dumps. Hardly any end up having any long-term value.","Another just launched Solana meme coin called DUMB MONEY (DUMB) is also pumping.","As per DEXScreener, it was last up 36,000% in 24 hours with a market cap nearing $900,000.","DUMB MONEY is likely a play on the joke that the retail investors behind the meme stock\/meme coin pump are considered “dumb money”, as opposed to “smart money” hedge funds or institutional investors.","https:\/\/twitter.com\/Dumb_Money_Sol\/status\/1790428817539895663","But the meme stock craze of 2021 is widely hailed as an instance when Dumb Money won.","DUMB has just over $100,000 in locked liquidity, but could easily just be a pump-and-dump scheme.","BNB traders are getting in on the action, with just launched meme coin named GameStop (GME).","That is, of course, borrowing its name directly from the legendary meme stock.","Up 8,900% in 24 hours as per DEXScreener, GME’s market cap was last $4.4 million.","The token has close to $1 million in unlocked liquidity, with over 1,500 unique wallets having traded it.","Again, traders must do their own due diligence and keep in mind that most newly issued tokens are scams.","Investing on newly launched meme coins is fraught with risk.","Yes, some of these coins might 100x. But the vast majority will fall flat, and investors might never be able to find the liquidity to sell.","Their fast price action tends to trigger FOMO in traders, who neglect to do the required due diligence.","A potentially better alternative to investing in just-launched meme coins is to invest in presales.","Here, traders have more time to research a project and see if it is a good fit for them.","Indeed, if a trader can reliably identify projects that end up gaining tract, they can make big gains.","Analysts at Cryptonews keep a close eye on the presale market. Here are some of their top presales for 2024.","20 Best Crypto Presales to Invest In Now",""],"entity":[{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$900,000","content":"MONEY"},{"type":"GameStop (GME","content":"ORGANIZATION"},{"type":"Daniel Cunha","content":"PERSON"},{"type":"May 15, 2024","content":"DATE"},{"type":"Cryptonews","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$2,880","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"Dumb Money","content":"ORGANIZATION"},{"type":"GME","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"Roaring Kitty Wif","content":"ORGANIZATION"},{"type":"95,000%","content":"PERCENT"},{"type":"Roaring Kitty","content":"PERSON"},{"type":"$RWIF","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$2.7 million","content":"MONEY"},{"type":"36,000%","content":"PERCENT"},{"type":"$4.4 million","content":"MONEY"},{"type":"US CPI","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$61,500","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"8,900%","content":"PERCENT"}],"hashtag":["Meme coin","Top crypto"],"authors":["Joel Frank"]}