{"summary":"Polygon Developer: Dencun Upgrade Will Hit the Zkevm Testnet in April","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-developer-dencun-will-hit-the-zkevm-testnet-in-april.htm","publishDate":"2024-03-13T18:56:36","id":18675,"type":null,"title":"Polygon Developer: Dencun Upgrade Will Hit the Zkevm Testnet in April","category":["Ethereum News "],"content":["Polygon Labs Developer Relations Engineer, Jarrod Watts, said in a March 12 X post that he believes Ethereum’s highly anticipated Dencun upgrade will offer big benefits to the Polygon zkEVM and the broader zero-knowledge Ethereum Virtual Machine (zkEVM) ecosystem.","The upcoming Dencun upgrade will vastly enhance layer-2 solutions that utilize rollup technology, such as Optimism and Arbitrum.","Of particular importance is the implementation of EIP-4844, which introduces “blobs” – essentially efficient data storage channels – to further reduce layer-2 transaction costs.","EIP-4844 is coming to Ethereum tomorrow.","What does this mean for Polygon chains?","Here’s what’s going to happen for Polygon enjoyoors:","1\/ It’s coming to zkEVM in May","While 4844 goes live on Ethereum tomorrow, it will be coming to Polygon zkEVM testnet in April, and is…","— Jarrod Watts (@jarrodWattsDev) March 13, 2024","","While Polygon is compatible with the Ethereum Virtual Machine (EVM), it functions as a sidechain rather than a true layer-2 rollup solution. As a result, Dencun’s impact on Polygon may be less pronounced.","Polygon zkEVM, however, does leverage both zero-knowledge proofs (for improved privacy) and rollups. This means it can potentially benefit from the Dencun upgrade.","Watts, an engineer working on the project, notes that roughly 80% of zkEVM fees come from call data. By switching to the more efficient “blob” storage post-Dencun, Polygon zkEVM looks to drastically reduce these fees.","Ethereum’s Dencun upgrade will bring benefits to various layer-2 platforms. These platforms will be able to offer lower transaction fees and higher throughput to their users.","Polygon zkEVM plans to integrate EIP-4844 proposals, with testing beginning on the testnet in April. The Feijoa upgrade will bring these changes to the mainnet approximately a month later.","In parallel to these scalability efforts, Polygon is also working on Polygon 2.0. A core part of this upgrade will be converting their current native token, MATIC, to POL.","This token swap intends to unify the entire Polygon ecosystem, serving as a medium of exchange and governance."],"entity":[{"type":"4844","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"POL","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"Feijoa","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Jarrod Watts","content":"PERSON"},{"type":"March 12","content":"DATE"},{"type":"MATIC","content":"LOCATION"}],"hashtag":["Dencun","Ethereum","Polygon"],"authors":["Dalmas Ngetich"]}