{"summary":"Revolut Reveals New On-Ramp in Partnership with MetaMask","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/revolut-reveals-revolut-ramp-in-partnership-with-metamask.htm","publishDate":"2024-03-06T09:23:25","id":18670,"type":null,"title":"Revolut Reveals New On-Ramp in Partnership with MetaMask","category":["Altcoin News "],"content":["Banking services provider Revolut has joined hands with the popular crypto wallet MetaMask, revealing Revolut Ramp.","According to the press release shared with Cryptonews, Revolut Ramp is the latest crypto offering available to users in the UK and European Economic Area (EEA).","With this feature, the company is “doubling down on its commitment to the world of cryptocurrency.”","The well-known UK-based fintech app stated that it has made adding crypto to a self-custody wallet easier.","Revolut Ramp enables users to on-ramp within seconds, it stated. Users can then purchase new coins directly into their MetaMask wallets.","Moreover, customers can use their fiat currency balance (in 18 currencies in their Revolut account) or pay with their Visa or Mastercard bank card.","Per the announcement,","“Revolut’s experience in processing millions of dollars\/pounds\/euros worth of fiat transactions daily, along with its popular crypto product, makes it the perfect candidate to simplify the process and enter the world of web3.”","Revolut Ramp comes with an integrated Know Your Customer (KYC) process. Non-Revolut customers can complete it “in just a few minutes,” it said.","It’s the same infrastructure used for the process of verifying the identities of 40 million Revolut users.","Meanwhile, Revolut users can skip all verification checks, given that the company can rely on existing verification from its app.","“The checkout process takes only a few seconds,” it said.","The announcement noted that when users pay directly from the Revolut account, the fiat transaction is outside of the scheme card rails.","Instead, it is entirely within Revolut’s ecosystem.","According to the company,","“This increases the success rate and allows Revolut to offer competitive prices without being burdened by additional card processing costs.”","Meanwhile, the customer can purchase more than 20 different tokens via the app or website.","Once a MetaMask user clicks the ‘Buy’ option in the wallet, the top provider offered will be Revolut, under the Debit or Credit payment methods.","When users select Revolut, they will be redirected to the company’s payment flow.","Mazen Eljundi, Global Business Head of Crypto at Revolut, commented that the on-ramp solution “ensures high success rates for transactions done within the Revolut ecosystem and low fees for all customers.”","Lorenzo Santos, Senior Product Manager at Consensys, the company behind MetaMask, stated that this partnership makes crypto “more approachable and less complicated.”","It is “really about giving our users what they want – more control over their crypto, in a straightforward way, using platforms they already know and trust. It also plays a crucial role in fostering broader crypto adoption, opening up the world of crypto to more people,” Santos concluded."],"entity":[{"type":"Mazen Eljundi","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Global Business Head of Crypto","content":"ORGANIZATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"millions of dollars\/pounds","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"}],"hashtag":["ConsenSys","MetaMask","Revolut"],"authors":["Sead Fadilpašić"]}