{"summary":"Bitcoin Whale Addresses Surge Following Spot ETF Approval: CryptoQuant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-whale-addresses-surge-following-spot-etf-approval.htm","publishDate":"2024-02-22T09:25:46","id":18680,"type":null,"title":"Bitcoin Whale Addresses Surge Following Spot ETF Approval: CryptoQuant","category":["Bitcoin News "],"content":["Bitcoin (BTC) has recorded massive growth in price amid institutional inflows this year following spot ETF approval by the United States Securities and Exchange Commission (SEC).","New data by on-chain analytics firm CryptoQuant shows bullish sentiment toward the market leader in recent weeks resulting in a price uptick.","According to the data, there is an increasing amount of Bitcoin Unspent Transaction Output (UXTO) in the market ranging from 1000 to 10,000 BTC. ","These figures have increased steadily from Q4 2023 on the heels of institutional inflows into Bitcoin as the market hoped for imminent approval by the SEC.","The inflows led to a price rally wiping out 2022 losses and ushering in a new bullish outlook on the market. In December 2023, the price of the asset hit $42,000 with several analysts pointing to a $50,000 price post-approval.","On the institutional front, inflows hitting millions were recorded in many products boosting Bitcoin’s Assets Under Management (AUM) to over $36 billion.","Although the approval of spot Bitcoin ETFs affects both institutional and retail investors, the activities of whales have spiked in the last 30 days.","“These amounts are more likely to be related by whales or institutional investors rather than individuals, and particularly since the recent approval of Bitcoin spot ETFs, they have been increasing sharply.”","Analysts at CryptoQuant pointed out that these inflows are not as significant as the highs of 2021 but it shows considerable institutional activity.","“Generally, in bull markets, after a significant influx of institutional investors, new individual investors enter the market, marking the end of the bull run,” they added.","Days after the approval, miners sent $1 billion worth of BTC reserves to exchanges with analysts pointing to the upcoming halving and the need to hedge towards larger facilities.","Subsequently, data from CryptoQuant shows almost $1 billion exiting Coinbase to other custodians, described as a holding move. This is because outflows from centralized exchanges show a bullish sentiment.","The SEC approved the long-awaited spot Bitcoin ETF on January 10 opening up a new investment window for transitional investors.","This has sparked a new surge in the market pushing up asset prices and an influx of new investors. So far, Bitcoin ETFs have attracted $5.2 billion in net inflows as over $1 billion was recorded in the last seven days.","Bitcoin AUM has also hit $48 billion due to an increase in the asset price and new inflows to the market. At press time, Bitcoin trades at $51,086, a 26% surge in the last 30 days as the wider market hits a $1.94 trillion market capitalization.","The success of spot Bitcoin ETFs has led to institutional players turning to Ethereum (ETH) ETFs in the United States. Some commentators project new inflows to ETH following ETF expectations."],"entity":[{"type":"$48 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"1000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"last seven days","content":"DATE"},{"type":"January 10","content":"DATE"},{"type":"AUM","content":"ORGANIZATION"},{"type":"$42,000","content":"MONEY"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"last 30 days","content":"DATE"},{"type":"$5.2 billion","content":"MONEY"},{"type":"26%","content":"PERCENT"},{"type":"$51,086","content":"MONEY"},{"type":"$1.94 trillion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$36 billion","content":"MONEY"}],"hashtag":["Bitcoin","ETF","Whale"],"authors":["David Pokima"]}