{"summary":"UK’s Fraud Intelligence Unit Shuts Down 43 Possible Crypto Phishing Websites","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uks-fraud-intelligence-unit-shuts-down-43-possible-crypto-phishing-websites.htm","publishDate":"2024-02-09T14:09:02","id":18683,"type":null,"title":"UK’s Fraud Intelligence Unit Shuts Down 43 Possible Crypto Phishing Websites","category":["Blockchain News "],"content":["UK authorities have announced that the National Fraud Intelligence Bureau (NFIB) blocked 43 possible crypto phishing websites.","A recent official Commissioner’s Update disclosed reports in diverse fields including potential fraudulent activities with bad actors impersonating popular blockchain-based firms.","According to the release, the NFIB identified a spoof email address used by bad actors for crypto phishing activities. The address targeted customers of blockchain.com, a digital asset services platform attempting to exploit vulnerabilities.","The agency further revealed that close investigations on the back of the report have led to the discovery of 42 additional scam websites. The addresses included “actionfraud.info” and “departmentfraud.com” adding that authorities have shut down the websites upon discovery.","Action Fraud, the UK’s national fraud combating unit wrote on X (formerly Twitter) on tactics deployed by scammers to exploit users which includes sending emails that lead directly to scam websites.","🚨Watch out for these fake emails claiming you’ve won a “36-piece Tupperware set”.🚨","⚠️The emails lead to websites designed to steal your personal information.","💻Your reports have led to the removal of 295,300 malicious websites as of December 2023.","📨If you receive a… pic.twitter.com\/S9RxQwaWF3","— Action Fraud (@actionfrauduk) February 7, 2024","","An example cited included fake emails claiming users won a 36-piece Tupperware set.","The agency also urged people who fall victim to or suspect phishing incidents to report them for further investigations. So far, reports from citizens have led to  295,300 scam websites being blocked as of December 2023.","This incident comes up as the broader digital asset market continues to battle phishing attempts from bad actors exploiting users by mimicking official accounts of Web3 firms.","Last year, data from on-chain analytics firm Chainalysis reported an increase in approval phishing scams with nearly $375 million stolen.","Approval phishing involves tactics aiming to make users sign fraudulent transactions, giving the scammers access to transact with the user’s tokens.","The platform urged Web3 firms to step up support and compliance teams to track down phishing activities in the industry and to increase user education to avoid signing transactions unless they are sure of the other party.","On Jan 23, a phishing attack that targeted web3 firms through an email campaign reportedly drained about $3.3 million worth of assets. Bad actors sent out targeted customers of WalletConnect, Token Terminal, and De.Fi sent out emails about airdrops that contained phishing links to fake community loyalty rewards programs.","It was subsequently discovered that the breach occurred due to hackers gaining access to email marketing firm MailerLite.","According to the company, a team member mistakenly granted access after clicking an image while responding to a customer service.","“The team member, responding to a customer inquiry via our support portal, clicked on an image that was deceptively linked to a fraudulent Google sign-in page. With this level of access, they were able to impersonate user accounts. The focus was exclusively on cryptocurrency-related accounts.”"],"entity":[{"type":"Commissioner’s Update","content":"ORGANIZATION"},{"type":"February 7, 2024","content":"DATE"},{"type":"$3.3 million","content":"MONEY"},{"type":"NFIB","content":"ORGANIZATION"},{"type":"$375 million","content":"MONEY"},{"type":"Token Terminal","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"National Fraud Intelligence Bureau (NFIB","content":"ORGANIZATION"},{"type":"Jan 23","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tupperware","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"MailerLite","content":"ORGANIZATION"}],"hashtag":["CRYPTO","Phishing","UK"],"authors":["David Pokima"]}