{"summary":"Shanghai Court Issues Verdict in First Digital Yuan Money Laundering Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shanghai-court-issues-verdict-in-first-digital-yuan-money-laundering-case.htm","publishDate":"2024-01-18T08:51:01","id":18689,"type":null,"title":"Shanghai Court Issues Verdict in First Digital Yuan Money Laundering Case","category":["Blockchain News "],"content":["A Shanghai court has issued a verdict for the first instance of money laundering using Chinese digital yuan and cryptocurrency, marking a significant legal precedent of crypto-related crimes in China.","According to Shanghai Securities News, the Yangpu District People’s Court of Shanghai has concluded this landmark case, which involves laundering criminal activity-related money with crypto and digital yuan.","Xiao, the leader of the money laundering group, also known as a “point racing team,” hired “racers” to launder money and profit from fees. After Xiao confirmed the amount to be laundered clean with the clients, Xiao’s racers would purchase cryptos from private traders, in this case Tether (USDT), then transfer the USDT to the clients for wallets with equivalent digital yuan.","The racers would proceed with the accounts and withdraw cash from ATMs. Eventually, they deposited the cash withdrawn from the digital yuan wallets in their own accounts and transfer the money to clients’ designated accounts, completing the money laundering.","To promote Chinese digital yuan, four types of e-CNY wallets were introduced, including Type 4, the anonymous wallets used by Xiao’s point racing team. To open a Type 4 account, users do not need to be present in a bank or provide identification documents, but only verify a mobile number.","Though Type 4 wallets retain the anonymity, it has relatively low deposit and transfer limits. The team purchased numerous phone numbers, more than 30 smartphones, and withdrew over 10 million yuan ($1.6 million) from over 900 digital yuan accounts.","In May 2023, one of the racers Wang made 30 withdrawals of 123,000 yuan ($17,200) at an ATM in Yangpu District within two hours, logging into more than 10 accounts. The frequent transactions alarmed the bank and led to the investigation and arrests.","The court found that the point racing team led by Xiao committed the crime of Disguising and Concealing Proceeds of Crime. The eight individuals were sentenced to fixed-term imprisonments ranging from seven months to four years and six months with fines.","Gong and Huang, who sold USDT to Xiao’s racers, were found guilty of Assisting with Information Network Criminal Activities and each sentenced to one year and four months of fixed-term imprisonment with fines."],"entity":[{"type":"Yangpu District","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"Yangpu District People’s Court of Shanghai","content":"ORGANIZATION"},{"type":"Information Network Criminal Activities","content":"ORGANIZATION"},{"type":"$17,200","content":"MONEY"},{"type":"Xiao","content":"PERSON"},{"type":"Huang","content":"PERSON"},{"type":"Shanghai Securities News","content":"ORGANIZATION"},{"type":"Concealing Proceeds of Crime","content":"ORGANIZATION"},{"type":"10 million yuan","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["CBDC","Digital Yuan","USDT"],"authors":["Hongji Feng"]}