{"summary":"Smaller BTC Miners Might Close Shop Post-Halving Bitfinex Warns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/smaller-btc-miners-might-close-shop-post-halving-bitfinex-warns.htm","publishDate":"2024-03-18T19:59:50","id":18699,"type":null,"title":"Smaller BTC Miners Might Close Shop Post-Halving Bitfinex Warns","category":["Bitcoin News "],"content":["Hong Kong-based crypto platform Bitfinex warned BTC miners on March 15 of a potential centralization of power post-halving in a comprehensive blog report forecasting financial pressure on small miners.","The fourth Bitcoin halving is a widely anticipated event in the crypto sector. The halving, expected around April 19, will slash the current reward in half, from 6.25 Bitcoins per block to 3.125.","Although the deflationary feature is expected to contribute to Bitcoin’s scarcity and value, new challenges are inevitable.","According to the report, the upcoming halving event could prompt small miners to exit the market, leaving the field open for larger, publicly traded mining companies and causing a high level of centralization.","Since the halving would result in a 50% slash in revenue for miners, continuing mining operations may be unprofitable unless there’s a meteoric rise in BTC’s price or a decrease in operational costs.","The trading platform noted that this high centralization of mining power goes against everything Satoshi Nakamoto outlined in the original whitepaper.","The concentration of mining power among a few entities could trigger potential censorship of transactions, for example.","Plus, the effect of reduced block rewards is an increase in transaction fees, since large mining companies will rely increasingly on transaction fees as an income source. If the demand for transaction processing scales above available block space, fees could rise further, leading to BTC’s reduced attractiveness for small transactions.","On the flip side of Bitfinex’s pessimism, the exchange still believes the halving event could trigger price appreciation. This could reduce the offset of reduced block rewards and could mitigate the emergence of centralization.","Additionally, the trading firm noted that Bitcoin-based non-fungible token (NFT) projects like Stamps and Ordinals could benefit miners. While their use cases are yet to be proven sustainable, these projects have raised revenues for miners.","While block rewards reduction is touted to have a major impact on miners, Bitfinex highlighted further security and usability implications.","The Hong Kong-based company noted that the upcoming halving may affect the security of the Bitcoin network. The hash rate could decrease if an expected number of miners shut down operations due to slashed profitability.","Bitcoin’s hash rate is the computational power that secures the network. A lower hashrate will leave the Bitcoin ecosystem more vulnerable to attacks such as the 51% attack. This entails a bad actor gaining control over most of the hash rate to manipulate the blockchain.","A continuous decrease in hash rates can undermine Bitcoin’s trust, reducing its price, and lowering adoption rates.","Bitfinex quickly pointed out that the Bitcoin network has shown resilience in the face of halving events, however. In fact, historical trends show the scale of BTC’s meteoric rise just months after previous halving events.","Another major impact the upcoming halving event may have is more stringent regulatory oversight.","The bitcoin mining industry is facing continuous scrutiny from government agencies on environmental impact already.","Concerns over mining firms’ high electricity consumption have led to stricter regulations on the industry, including President Biden’s 30% Bitcoin mining tax, as outlined in the fiscal year 2025 proposal budget.","🇺🇸The Biden administration is proposing a 30% tax on electricity used for Bitcoin mining 🧐 pic.twitter.com\/WZ4tF4FO4k","— Crypto Crib (@Crypto_Crib_) March 13, 2024","","While this regulation has yet to be enacted, its sole purpose is implementing taxes on all mining activities. If enacted, an estimated $10 billion in revenue will be generated from the tax in 2025."],"entity":[{"type":"2025","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"March 15","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$10 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"April 19","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"fiscal year 2025","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitfinex","btc"],"authors":["Jimmy Aki"]}