{"summary":"Fraudsters Partially Drain Assets from Crypto Investment Firm BlockTower’s Main Hedge Fund","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-investment-firm-blocktower-fund-partially-compromised.htm","publishDate":"2024-05-15T04:16:26","id":18696,"type":null,"title":"Fraudsters Partially Drain Assets from Crypto Investment Firm BlockTower’s Main Hedge Fund","category":["News "],"content":["Digital asset investment firm BlockTower Capital faces a major setback after fraudsters compromised its main hedge fund.","Bloomberg reported Wednesday that the stolen funds remain unrecovered, and the hackers haven’t been caught yet. BlockTower has responded, hiring blockchain forensics analysts to investigate the theft. The firm also recently notified its limited partners about the incident.","It isn’t clear yet what the exact amount stolen from BlockTower Capital’s hedge fund was. PitchBook data shows the firm manages $1.7b in total assets.","BlockTower Capital didn’t return Cryptonews’ request for comment by press time.","This isn’t the first time the firm has encountered trouble. in 2023, BlockTower lost around $1.5m in TRU tokens during a security exploit on the Dexibel decentralized exchange platform.","BlockTower Capital was established in 2017 by Matthew Goetz and Ari Paul. Based in Miami, Florida, the firm focuses on professional trading, venture investing, credit underwriting, and managing portfolios for both digital and traditional assets. BlockTower actively trades liquid crypto assets, invests in real-world credit assets, and participates in next-generation venture investing within the web3 space.","Hackers remain a major threat to the crypto industry, even though they stole less money in total during 2023 compared to 2022. This might seem like good news, but the number of hacking attempts actually went up. In 2022, there were 219 hacks, while in 2023 that number rose to 231.","Still, the total value stolen dropped by a significant 54.3%, reaching $1.7b in 2023. This decrease was mainly due to a decline in DeFi hacks. Hackers managed to steal $1.1b from DeFi platforms in 2023, a steep drop from the $3.1b they took in 2022.","Meanwhile, Web3 users lost $336m to hackers and scams in the first three months of 2024. A significant chunk, nearly half, was stolen in January. Despite the concerning losses, this actually represents a 23% improvement compared to the same period in 2023."],"entity":[{"type":"$1.7","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Florida","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"$3.1","content":"MONEY"},{"type":"Matthew Goetz","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"$336m","content":"MONEY"},{"type":"23%","content":"PERCENT"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$1.5m","content":"MONEY"},{"type":"54.3%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"the first three months of 2024","content":"DATE"},{"type":"Ari Paul","content":"PERSON"}],"hashtag":["Exploit","Hacks"],"authors":["Shalini Nagarajan"]}