{"summary":"Local Coffee Chain in DC Teams Up with Coinbase to Accept Crypto Payments","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/local-coffee-chain-in-dc-to-accept-crypto-payments.htm","publishDate":"2024-03-21T07:03:18","id":18694,"type":null,"title":"Local Coffee Chain in DC Teams Up with Coinbase to Accept Crypto Payments","category":["Altcoin News "],"content":["A local coffee chain in Washington, D.C. has partnered with Coinbase to introduce crypto payments to its customers. ","Compass Coffee, a veteran-owned brand with sixteen stores in the D.C. area, will now offer patrons the option to pay for their morning brew using USDC, a stablecoin that functions as a digital dollar.","Customers who choose to pay with USDC at Compass Coffee’s Half Street location will enjoy a substantial discount of 90% off their orders, according to a report from Fox Business. ","Additionally, they will receive a non-fungible token (NFT) that can be redeemed for a complimentary tin of coffee adorned with the logos of Coinbase and Compass. ","One of the major hurdles to widespread adoption of digital assets as a form of payment has been their practicality in everyday transactions. ","While larger companies like Starbucks, Subway, and AMC Theaters have recently started accepting Bitcoin and Ethereum payments, many smaller businesses, particularly local stores, have been hesitant to embrace cryptocurrency. ","However, the launch of eleven Bitcoin exchange-traded funds (ETFs) on Wall Street in January has sparked conversations about the long-term value and viability of cryptocurrencies.","Stablecoins, such as USDC, have gained prominence as they are typically pegged to a fixed asset like the U.S. dollar, reducing the price volatility associated with cryptocurrencies like Bitcoin.","This stability makes stablecoins more suitable for day-to-day transactions. ","USDC, the stablecoin that Compass Coffee will accept, is issued by Circle, a crypto company in which Coinbase holds a minority stake. ","Users can convert their dollars into stablecoins using digital wallets or through crypto exchanges like Coinbase or Kraken.","Coinbase hopes that its partnership with Compass Coffee will encourage other small businesses in the area to adopt stablecoin payments, thereby challenging the perception of cryptocurrencies as purely speculative investment assets among regulators and politicians in D.C. ","To convey the message of cost-saving advantages to customers, Coinbase and Compass are using coffee cups at the Half Street store to display eye-catching messages. ","The cups inform customers that an estimated $126 billion in credit card transaction fees were paid by U.S. merchants in 2022, which is 2.5 times the entire U.S. coffee shop market. ","The cups emphasize that blockchain technology could have saved over 99% of these fees.","Compass Coffee has revealed that it currently loses approximately 3.75% of its revenue to credit card companies through additional fees. ","As a small, veteran-owned business that weathered the challenges posed by the COVID-19 pandemic, Compass recognizes the value of every dollar and believes that redirecting the funds currently paid to credit card companies towards staff, rent, and suppliers could be transformative for their business and the local economy.","Although the USDC payment option will initially be available only at the Half Street store, Compass plans to expand this feature to its other eleven locations in the future. ","“Our partnership with Compass is a good pilot to show how stablecoins can simplify finance and save small businesses thousands of dollars on unnecessary credit card fees,” Coinbase’s Chief Policy Officer, Faryar Shirzad, said. "," "],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"3.75%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"January","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"Compass Coffee","content":"ORGANIZATION"},{"type":"Fox Business","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"$126 billion","content":"MONEY"},{"type":"Compass","content":"ORGANIZATION"},{"type":"Faryar Shirzad","content":"PERSON"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Adoption","Coinbase"],"authors":["Ruholamin Haqshanas"]}