{"summary":"Bitcoin Should Remain Well-Supported On Institutional Inflows For Several Months: Coinbase Research","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-should-remain-well-supported-for-3-6-months-on-institutional-inflows-coinbase-research.htm","publishDate":"2024-02-16T17:00:20","id":18704,"type":null,"title":"Bitcoin Should Remain Well-Supported On Institutional Inflows For Several Months: Coinbase Research","category":["Bitcoin News "],"content":["Coinbase research analysts project adequate support for Bitcoin (BTC) in the market for the next three to six months due to institutional inflows.","The institutional research arm of the digital asset exchange explained the trajectory of Bitcoin, Ethereum, and other on-chain data post-ETF approvals in a recent report.","In our new weekly Market Call, the team discusses where we are in the current BTC bull market cycle, why enthusiasm has been building for ETH, and what the latest inflation data mean for crypto and DeFi.","— Coinbase Institutional 🛡️📞 (@CoinbaseInsto) February 14, 2024","","Following the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission on Jan 10, events in the market have been dominated by ETF narratives.","The Bitcoin market has recorded significant inflows following the launch of ETFs, propelling the asset’s price above $52,000. Bitcoin has not traded above that range since December  2021, tapping yearly highs as market activity rebounds.","According to the report, the newly approved ETFs have raked in net inflows of $3.3 billion since launch. This has led to a surge in Assets Under Management (AUM) to $36.8 billion and the wider crypto AUM tapping $58 billion.","These figures are higher than the median expectations from institutional players before the approvals, which stood at $1 billion.","The soaring inflows and other indices led analysts to conclude that the market should remain well-supported for the next three to six months.","“We believe bitcoin in particular (and crypto more generally) should remain well-supported in the next 3-6 months, as more institutional players adjust to the new ETF reality alongside the ongoing global narrative of monetary reflation. That said, there are some negative seasonal factors in March that may serve to unsettle that path.”","Last week, CoinShares reported weekly inflows into Bitcoin institutional funds at over $1 billion, 98% of the market’s inflow.","At press time, Bitcoin is priced at $51,850, up 9.6% in the last seven days, with its market cap breaching $1 trillion.","Coinbase analysts expect more institutions to turn their attention to Ethereum in the coming months due to the success of Bitcoin ETFs.","Per the report, open interest in CME Bitcoin and Ether futures recovered in the last six days. Based on this, open interest in Ether may record upticks relative to BTC.","A potential spot Ethereum ETF would also be a game-changer for the assets whose growth has been eclipsed by Bitcoin. With the success of BTC ETFs, Ethereum is next for most institutions looking to onboard traditional investments to the market.","“Given the strong inflows into spot bitcoin ETFs, we expect more issuers to turn their attention to the second largest cryptocurrency over the next few months. Market players are watching to see if the SEC begins to actively engage with issuer applications, as that could affect their perceived odds of approval.”",""],"entity":[{"type":"9.6%","content":"PERCENT"},{"type":"$36.8 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"December  2021","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"$52,000","content":"MONEY"},{"type":"February 14, 2024","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$51,850","content":"MONEY"},{"type":"$1 trillion","content":"MONEY"},{"type":"$58 billion","content":"MONEY"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"CME Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Coinbase","ETF"],"authors":["David Pokima"]}