{"summary":"This Is Why Santander Hesitates to Use XRP","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/this-is-why-santander-hesitates-to-use-xrp-7415.htm","publishDate":"2020-08-13T11:02:57","id":18706,"type":null,"title":"This Is Why Santander Hesitates to Use XRP","category":["Altcoin News "],"content":["Despite being touted as one of Ripple’s “largest and most important customers,” the major Spanish bank Santander is still hesitant in its approach to the Ripple-affiliated XRP token.","Cedric Menager, the head of Santander’s new cross-border payments service One Pay FX, told the Financial Times that the bank’s main problem with XRP is that it’s not actively traded in enough markets yet to fully support their needs, while the company wants to the best user experience “as quickly as possible and also operate in as many currencies and corridors as possible from the beginning.”","According to an announcement from Ripple last month, One Pay FX was developed by Santander in partnership with Ripple in an effort to make international transactions “faster, cheaper and more transparent.” What the announcement did not say, however, was whether the new solution would use XRP in any way.","According to the Financial Times report, Santander will still use “some of [Ripple’s] software in the payments service,” although it did not specify how exactly Ripple is involved with the project.","The news today is not the first time Ripple has faced difficulties with getting banks to use the XRP token, with Ripple CEO Brad Garlinghouse blaming the problems partly on regulatory uncertainties in the US over whether the token will be regulated as a security or not, per the report.","Despite this, however, Garlinghouse maintained that his company remains fully committed to XRP, although he admitted that it may take “years” to get the most out of the token. “We are a capitalist, we own a lot of XRP. So, do I care about the overall XRP market? 100%,” the Ripple CEO was quoted as saying.","And while the company often reiterates that XRP is important to them, other comments from the CEO also suggested that Ripple is looking beyond the payments sector as it seeks to expand its offering in the blockchain space, comparing Ripple to ecommerce giant Amazon once again.","“Amazon started as a bookseller and just sold books. We happen to have started with payments. Two years from now, you’re going to find that Ripple is to payments as Amazon was to books,” the CEO told the Financial Times.","Among these new projects is also the content monetization platform Coil, which Ripple handed out USD 260 million to, with most of the funds earmarked as grants to attract content creators to join the platform.","Now, after a year of running Coil, the platform appears to be generating little returns, with one writer on the platform saying the payments he had been able to generate for attracting readers only made up about USD 15 since the start of the year, although he had received USD 2,250 in XRP from Coil as an incentive to keep writing on the platform.","Meanwhile, in related news, Ripple partner Flare Networks revealed this week that it is launching a new token that XRP holders can claim on a one-to-one basis. According to the announcement from Flare Networks’ CEO Hugo Philion, the new tokens, dubbed Spark, are designed to enable smart contract functionality for XRP users.","At pixel time (10:52 UTC), XRP trades at USD 0.276 and is down by 3% in a day and 8% in a week, trimming its monthly gains to less than 40%. The price is down by 6% in a year.\n___","Learn more:\nXRP Jumps As Ripple Sees Stronger Demand From Institutions\nXRP & Ripple Slammed Too as Team Bitcoin Expands Ethereum Battle"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"Amazon","content":"LOCATION"},{"type":"Garlinghouse","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Team Bitcoin Expands Ethereum Battle","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Flare Networks","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Hugo Philion","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Ripple","content":"LOCATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"}],"hashtag":["Adoption","Banking","Financial Services","Ripple","XRP"],"authors":["Fredrik Vold"]}