{"summary":"Tether Launches USDT On Celo Chain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-launches-usdt-on-celo-chain.htm","publishDate":"2024-03-12T16:30:05","id":18712,"type":null,"title":"Tether Launches USDT On Celo Chain","category":["Blockchain News "],"content":["Tether, the issuer of the world’s largest stablecoin, USDT, announced on March 11 the launch of its stablecoin on the Celo chain.","In a statement, the stablecoin issuer said the expansion marks a major milestone for the firm and Celo.\n","As of March 12, USDT is the largest stablecoin with a market cap of over $100 billion. ","Tether claims each circulating USDT token is backed by an equivalent amount in cash and other liquid assets, including treasury bills. This means users can redeem each USDT for an equal amount of USD in the secondary market.","Tether Token (USDT) to Launch on @Celo","Read more: https:\/\/t.co\/KJ5emdMmXl pic.twitter.com\/yTDkzKnhev","— Tether (@Tether_to) March 11, 2024","","The tokenization of the USD through USDT means transfers are nearly instantaneous. At the same time, transaction fees are relatively low and suitable for users without traditional bank accounts.","Celo is purposefully designed for mobile devices and caters to a broader audience while remaining compatible with Ethereum, the most active smart contract platform. ","The hope is that this can drive adoption and financial inclusion, especially in emerging markets with high mobile phone usage. ","The Celo ecosystem comprises over 1,000 projects across 150 countries. Popular Celo-based solutions include Opera MiniPay’s light wallet, which is gaining traction in Africa. Others include SocialConnect, a privacy-focused naming service; and FiatConnect, a ramp that will make it easier for users to transact using USDT.","Tether wants to take advantage of this broad base to promote the adoption of Celo solutions and see more users adopt USDT. With USDT minting on Celo now available, users can use the stablecoin transparently and in a cheap environment.","The collaboration extends beyond offering USDT on Celo. A proposal on the Celo community forum suggests using USDT to pay transaction fees. This approach could streamline transactions and enhance the efficiency of decentralized applications (dapps).","“We are committed to providing accessible and reliable digital currency solutions,” said Tether CEO Paolo Ardoino. This integration with Celo represents a significant step forward—together, we can make Tether more usable and accessible for millions.”","On March 7, Rarible, a non-fungible token (NFT) marketplace, integrated Celo. The goal is to provide developers with an advanced toolkit, including a real-time NFT indexer and aggregated order book."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"Celo","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"March 11","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Rarible","content":"PERSON"},{"type":"March 7","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"Paolo Ardoino","content":"PERSON"}],"hashtag":["Celo","Tether","USDT"],"authors":["Dalmas Ngetich"]}