{"summary":"Starknet developers on the network will receive a 10% share of all fees received by the network operator as part of the devonomics program.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267180\/starknet-fees-devonomics","publishDate":"2023-12-12T10:00:03","id":1871,"type":null,"title":"Starknet developers to receive a portion of network operator fees","category":["CRYPTO ECOSYSTEMS"],"content":["StarkWare and the Starknet Foundation plan to distribute a portion of its Layer 2 network fees to developers building on Starknet as part of what it calls the “devonomics pilot program.”","Under the program, Starknet developers on the network will receive a 10% share of all transaction operator fees accumulated since its launch in Nov. 2022 till the end of last month, totaling 1,6000 ETH (over $35 million). The distribution of rewards will be automated and paid out to developers based on the level of fees generated by each decentralized application.","After initial distributions in ether, future payments will be made in the soon-to-launch governance tokens for the network. This will happen after the upcoming Starknet upgrade to version 0.13, which will introduce fee payments in STRK.","Whenever a transaction takes place on Starknet, the operator collects fees used for various network expenses. The operator is a party providing the network with computing resources that perform the sequencing of transactions, generation of STARK proofs and long-term storage. Currently, there is only one operator and, therefore, one collector of fees: StarkWare. In the future, the network aims to be decentralized, allowing other operators to start permissionlessly taking on this role.","According to StarkWare CEO Uri Kolodny, the fee program aims to support both established and new developers in the ecosystem. “STRK came into existence to facilitate Starknet governance and operation. In the future, those who have the token will be able to vote in proportion to their holding – and also to stake too,” Kolodny said.","The allocation of operator fees is set at 10% of total collected fees, amounting to 1,600 ether ($3.5 million). Of this, 8% will go to dApp developers and 2% to core developers, resulting in 1,280 ether for dApp builders and 320 ether for core developers.&nbsp;","The devonomics payouts will be separate from Starknet Foundation’s recently announced <a href=\"https:\/\/www.theblock.co\/post\/266724\/starknet-foundation-plans-to-distribute-1-8-billion-tokens-as-rewards-transaction-rebates\" data-v-f87c67ca=\"\">plan to distribute 1.8 billion STRK tokens<\/a> in the form of user contributor rewards and rebates.","Starknet operates as a decentralized Layer 2 network on Ethereum, employing a zero-knowledge roll-up solution. This approach involves condensing multiple transactions on an off-chain layer and publishing them collectively on the Ethereum network.","StarkWare, known for inventing the Stark cryptographic proofs mechanism, was the original architect of Starknet and is now a contributor. The project's future development is led by the Starknet Foundation.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Nov. 2022 till the end of last month","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"$35 million","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Kolodny","content":"PERSON"},{"type":"$3.5 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"Uri Kolodny","content":"PERSON"}],"hashtag":["STARKNET"],"authors":["Vishal Chawla","The Block"]}