{"summary":"CEO of Collapsed Crypto Fund HyperVerse Seems to Not Exist At All + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ceo-of-collapsed-crypto-fund-hyperverse-seems-to-not-exist-at-all-more-news.htm","publishDate":"2024-01-04T14:00:45","id":18726,"type":null,"title":"CEO of Collapsed Crypto Fund HyperVerse Seems to Not Exist At All + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","The man introduced as the chief executive officer of HyperVerse, Steven Reece Lewis, appears not to exist – at least not as the man with a long and impressive list of credentials the company cited. No organization on that list could find any record of him, the Guardian reported.","Last month’s Guardian Australia investigation found that thousands of people lost millions of dollars to the HyperVerse crypto scheme, linked to a previous scheme called HyperFund, under the umbrella organization the HyperTech group.","The Australian entrepreneur Sam Lee and his business partner Ryan Xu promoted the company. The duo were the founders of the collapsed Australian bitcoin company Blockchain Global.","Per the Guardian, Lee has denied both HyperVerse was a scam and being its founder. Xu could not be reached for comment.","Meanwhile, a man named Steven Reece Lewis was introduced as the HyperVerse CEO at an online global launch event in December 2021. The introduction featured video messages of support from celebrities, including the Apple co-founder Steve Wozniak and actor Chuck Norris.","Promotional materials and career summaries said Reece Lewis was a graduate of the University of Leeds and held a master’s degree from the University of Cambridge, that he had worked for Goldman Sachs, sold a web development company to Adobe, and launched an IT start-up firm.","“Reece Lewis’s identity could not be verified by the Guardian, nor could he be contacted for comment.”","Guardian Australia contacted all the above-cited institutions and has confirmed that none has any record of someone by that name on their databases.","Reece Lewis also had no internet presence other than HyperVerse promotional material. A Twitter account was set up a month before his December 2021 introduction. It was active only until June 2022.","The Klaytn Foundation, established to build and decentralize the ecosystem of Layer 1 blockchain Klaytn, announced that the Klaytn Governance Council (GC) member CREDER has launched GPC (Gold-Pegged Coin), a digital asset pegged to the real-time market price of gold, and Goldstation, a decentralized finance (DeFi) platform for GPC.","Per the press release, GPC marks two firsts in the real-world asset (RWA) tokenization industry. It is the first tokenized gold available on DeFi outside the Ethereum ecosystem and the first gold-pegged token that does not charge a percentage-based commission for transactions.","Goldstation is also the first gold RWA token DeFi platform powered by a public mainnet other than Ethereum.","It will commence its services on January 24. While currently only available for South Korean residents, Goldstation plans a global launch in the future.","Crypto payments platform Wirex announced an enhancement in its measures to combat Dark Web activities and money mule threats.","According to the press release, the company has incorporated US-based cybersecurity company ZeroFox’s Dark Web Monitoring tool into its system, creating a unified solution.","This way, a combination of human and artificial intelligence (AI) actively scans the Dark Web for potential dangers in real time. This includes leaked data, compromised credentials, and other sensitive information.","This is a proactive approach that allows for early detection and prompt intervention.","“Wirex benefits from ZeroFox’s advanced monitoring capabilities, utilising a sophisticated system that issues detailed alerts about potential threats, including their severity and escalation status, ensuring a quick and effective response to incidents,” the company said.","KuCoin Labs, the investment and incubation arm of the crypto exchange KuCoin, has announced its investment in ISSP. The latter is the first cross-chain inscription protocol system on the Sui network known for its high throughput and scalability.","According to the press release, this investment is aimed at supporting the development of ISSP’s inscription protocol.","More than a financial venture, it added, the investment is a strategic step towards fostering innovative solutions in the blockchain sector.","“The focus on ISSP’s inscription protocol marks a new era in blockchain technology, paving the way for more secure, efficient, and scalable blockchain applications. Both KuCoin Labs and ISSP are dedicated to pushing the envelope in blockchain technology, aiming to make a significant impact in the industry,” the teams added."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"Sam Lee","content":"PERSON"},{"type":"Lee","content":"PERSON"},{"type":"Steve Wozniak","content":"PERSON"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"KuCoin Labs","content":"ORGANIZATION"},{"type":"Chuck Norris","content":"PERSON"},{"type":"Ryan Xu","content":"PERSON"},{"type":"Steven Reece Lewis","content":"PERSON"},{"type":"ISSP","content":"ORGANIZATION"},{"type":"January 24","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"Reece Lewis","content":"PERSON"},{"type":"Blockchain Global","content":"ORGANIZATION"},{"type":"HyperVerse","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"University of Leeds","content":"ORGANIZATION"},{"type":"the University of Cambridge","content":"ORGANIZATION"},{"type":"Klaytn Foundation","content":"ORGANIZATION"},{"type":"GPC","content":"ORGANIZATION"}],"hashtag":["Australia","Blockchain","Security"],"authors":["Sead Fadilpašić"]}