{"summary":"US House Proposes Bill to Ban Cryptocurrency Mixers for Two Years","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-house-proposes-bill-to-ban-crypto-mixers-for-two-years.htm","publishDate":"2024-05-09T04:10:21","id":18724,"type":null,"title":"US House Proposes Bill to Ban Cryptocurrency Mixers for Two Years","category":["Blockchain News "],"content":["Democratic representatives have introduced the US Blockchain Integrity Act to tighten regulations in the cryptocurrency sphere. The act aims to crack down on cryptocurrency mixers, often utilized for illicit financial activities. Led by Sean Casten and supported by fellow Democrats, the proposed bill seeks to enact a two-year ban on cryptocurrency mixers.","A crypto mixer serves as a pool, enabling users to generate new addresses and withdraw funds without disclosing the connection between the depositor and withdrawal addresses. This opacity poses a significant challenge for law enforcement agencies, hindering efforts to track fund origins and destinations and creating an avenue for unlawful activities.","Cryptocurrency has been used to finance terrorist attacks around the world, made possible by digital asset mixers.","I’m introducing legislation to temporarily prohibit crypto mixers while we study this technology & how it is used for illicit purposes.https:\/\/t.co\/8JrLmipe6J","— Rep. Sean Casten (@RepCasten) May 7, 2024","","The proposed legislation aims to disrupt the flow of illicit funds and promote transparency by prohibiting financial institutions, cryptocurrency exchanges, and registered money service businesses from accepting funds processed through a mixer. Violations of this ban would incur civil penalties of up to $100,000, serving as a deterrent against facilitating mixer-related transactions.","Additionally, the bill mandates that the Treasury Department compile a comprehensive report during the ban period evaluating various aspects of mixer transactions, including involvement in illicit finance, legitimate use cases, law enforcement capabilities, and regulatory approaches in other jurisdictions."," Cryptocurrency mixers have emerged as a focal point due to their role in obscuring transaction trails and enabling user anonymity, prompting alarm among law enforcement agencies regarding their exploitation by criminals for money laundering and terrorist financing.","However, the proposed ban faces political challenges, particularly within the Republican-majority House, where its passage remains uncertain. While Democrats advocate for the initiative as a necessary measure to combat illicit finance, Republicans express concerns about stifling innovation and the need for balanced regulatory oversight.","Beyond legislative efforts, US authorities have previously taken action against cryptocurrency mixers, exemplified by the Treasury’s targeting of mixer service Tornado Cash and legal actions against mixer developers for money laundering and sanctions violations.","Moreover, lawmakers have raised apprehensions regarding offshore-issued stablecoins like Tether, citing potential links to illicit finance. Stablecoins pegged to fiat currencies and have gained traction for facilitating transactions within the cryptocurrency ecosystem, prompting scrutiny over issuer transparency and regulatory oversight.","The Poloniex hacker, notorious for the exchange’s security breach last year, recently funneled $3.4 million worth of Ethereum through the Tornado Cash mixer to launder the stolen funds. A report from blockchain intelligence firm Chainalysis reveals a surge in the popularity of crypto mixers in 2022, with these services receiving more cryptocurrency than ever before. According to the report, illicit addresses accounted for 23% of the funds sent to mixers in 2023, a significant increase from 12% in 2021. The rise in mixer usage is attributed to a doubling of the share of funds deemed illicit, which now represents the main driver for the uptick in mixer activity."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Sean Casten","content":"PERSON"},{"type":"$3.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"crypto mixer","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"May 7, 2024","content":"DATE"}],"hashtag":["Blockchain Integrity Act","Crypto mixers"],"authors":["Hassan Shittu"]}