{"summary":"Crypto traders with funds on FTX Japan will be able to withdraw their assets from tomorrow, the exchange has announced.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213317\/ftx-japan-to-resume-crypto-and-fiat-withdrawals-on-feb-21","publishDate":"2023-02-20T09:04:53","id":1872,"type":null,"title":"FTX Japan to resume crypto and fiat withdrawals on Feb. 21","category":["COMPANIES"],"content":["FTX Japan, the Japanese subsidiary of the collapsed crypto exchange FTX, will resume crypto and fiat withdrawals from Feb. 21.","Withdrawals will be processed via the Liquid Japan web platform, it said in a company <a href=\"https:\/\/help-jp.ftx.com\/hc\/ja\/articles\/15765489546393\" data-v-f87c67ca=\"\">statement<\/a>. FTX acquired Liquid in 2022.","Customers with assets on the exchange will have to confirm their balance. Users without an account on Liquid Japan will need to open one to withdraw their assets, the company added.&nbsp;","FTX Japan said that it had contacted all users with funds on the platform. The company said these users have been informed of the withdrawal procedure. FTX Japan urged users to be mindful that the process could be slow, given the volume of pending requests.","FTX Japan paused crypto and fiat withdrawals in November 2022 after the collapse of the FTX crypto exchange and its sister trading firm Alameda Research. The platform was initially asked to suspend its operations in early December 2022. FTX Japan, however, <a href=\"https:\/\/www.theblock.co\/post\/193577\/ftx-japan-extension\" data-v-f87c67ca=\"\">secured an extension<\/a> to this order until March 2023. The platform is looking to announce the resumption of other services, according to Monday’s statement.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Feb. 21","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Liquid Japan","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Osato Avan-Nomayo","The Block"]}