{"summary":"Stader Labs has raised $4 million in a seed funding round led by Pantera Capital.\nStader currently supports Terra’s LUNA token for staking and plans to add support for Solana and other blockchains.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119761\/crypto-staking-platform-stader-labs-seed-funding","publishDate":"2021-10-07T09:05:14","id":1872,"type":null,"title":"Crypto staking platform Stader Labs raises $4 million in seed funding","category":["Venture Capital"],"content":["Stader Labs, an India-based crypto staking project, has raised $4 million in a seed funding round.","The round was led by Pantera Capital, with participation from Coinbase Ventures, True Ventures, Jump Capital, Huobi Ventures, TerraForm Labs, Solana Foundation, Near Foundation, and others.","Several angel investors, including Anchorage CEO Diogo Monica, Coinbase head of crypto Nemil Dalal, Staked CEO Tim Ogilvie, Polygon CEO Jaynti Kanani, Polygon COO Sandeep Nailwal, CoinDCX CEO Sumit Gupta, and Biconomy CEO Ahmed Al Balaghi, also backed the round.","Stader Labs raised the funds via a Simple Agreement for Future Tokens (SAFT) sale, co-founder and CEO Amitej Gajjala told The Block. The fresh capital will help the firm expand its team, add support for more blockchains, and promote its platform, he said.&nbsp;","Stader currently supports Terra blockchain's LUNA token for staking in a test version of its platform. Over the next few months, it looks to add support for native tokens of Solana (SOL), Ethereum (ETH), Polkadot (DOT), Polygon (MATIC), and Near (NEAR).","Stader claims to make crypto staking easier and more profitable for users. Gajjala said staking today is \"manual and tedious,\" meaning participants have to research validators, claim rewards, and find avenues to deploy those rewards. \"Stader will curate the best staking service providers along with building automated yield optimization strategies to maximize returns,\" he said.","Gajjala declined to name the staking service providers Stader will partner with, saying that selection will depend on a provider's performance on a particular blockchain. Stader will charge a distribution fee from staking service providers and additional fees from stakers for providing high-yield strategies, Gajjala said of the firm's business model.","Stader will act more like a staking aggregator bringing staking solutions in one place, including conventional staking, liquid staking, and derivatives to hedge the price risk of staked assets. \"The staking aggregator model is our view of what the future of staking UX [user experience] will be for retail and institutions,\" Franklin Bi, director of portfolio development at Pantera Capital, told The Block.","Stader is currently focused on onboarding retail customers and plans to serve institutions in the future. It also intends to build API staking solutions for exchanges and fintech apps.","There are currently 12 people working for Stader, and Gajjala plans to recruit 15-20 more people in the next six months to meet the firm's growth plans."],"hashtag":["SOLANA"]}