{"summary":"Japanese Government Plans to Relax VC Crypto Investment Rules","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/japanese-government-plans-to-relax-vc-crypto-investment-rules.htm","publishDate":"2024-02-19T03:00:25","id":18720,"type":null,"title":"Japanese Government Plans to Relax VC Crypto Investment Rules","category":["Blockchain News "],"content":["VC crypto investment rules could be relaxed in Japan, where the government plans to allow venture capital firms to invest in Web3 companies.","Per an official release from the nation’s Ministry of Economy, Trade, and Industry, and the media outlet CoinPost, the cabinet has approved a move that could soon let VCs hold crypto.","The Japanese Cabinet wants to change laws pertaining to Limited Partnership Funds (LPS). LPSes are typically funds that invest in unlisted companies and startups.","LPS companies and funds are governed by the terms of the Limited Partnership Act of 1998. Last year, the ministry announced plans to allow LPS operators to invest in security tokens.","But it maintained at the time that it would not allow them to hold cryptoassets. However, in its latest announcement, the ministry said the government was ready to relax this rule.","The media outlet reported that the cabinet has “agreed to add cryptoassets to the list of assets that [an] LPS can acquire and hold.”","The move would potentially revolutionize the way Web3 firms raise funding in Japan. Under existing rules, startups can only offer VCs shares in their companies, as the law blocks them from giving LPS investors crypto.","On X, the Thirdverse CEO Hiro Kunimitsu pointed out that web3 projects have until now been forced to raise funds from overseas VCs.","素晴らしい〜！！㊗️","これは簡単に解説しますと、これまでの日本のルールだとVCが暗号資産に投資できなかったのです。プロジェクトによっては株式は発行せずに暗号資産の発行だけといのもあります。(AstarやOasyなど)… https:\/\/t.co\/In6iNagzXm","— 国光宏尚 元gumi (Hiro Kunimitsu) (@hkunimitsu) February 16, 2024","","This, the CEO said, throws up a “major barrier to entry.” But Kunimitsu said that the Cabinet decision could provide “a major opportunity” for Japanese Web3 startups. The CEO wrote:","“Japanese VCs could not invest in [cryptoasset-related firms]. Therefore, from the outset, these firms’ projects faced a huge hurdle that involved sourcing finance from overseas VC.”","Japan is officially in recession. How serious is it, and what does it mean for interest rates and the yen? https:\/\/t.co\/kydAjDaeWJ","— Bloomberg Economics (@economics) February 18, 2024","","News outlets claim that the move has been in the pipelines since September last year. They say that the government plans to submit a bill to parliament sometime this year.","Lawmakers would still need to approve any proposed legal amendment on the matter of VC crypto investment.","However, no piece of government-proposed crypto legislation has yet failed to receive parliamentary approval in Japan.","On February 7, the city of Kochi announced plans to create a virtual city on a metaverse platform to attract tourists and sell local products.","Also this month, the top Japanese financial regulator asked banks in the nation to increase scrutiny of crypto-related transfers, fearing a rise in token-related fraud."],"entity":[{"type":"Hiro Kunimitsu","content":"PERSON"},{"type":"Bloomberg Economics","content":"ORGANIZATION"},{"type":"February 7","content":"DATE"},{"type":"Kochi","content":"ORGANIZATION"},{"type":"’s Ministry of Economy","content":"ORGANIZATION"},{"type":"September last year","content":"DATE"},{"type":"February 16, 2024","content":"DATE"},{"type":"Kunimitsu","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"1998","content":"DATE"},{"type":"February 18, 2024","content":"DATE"}],"hashtag":["Investment","Japan"],"authors":["Tim Alper"]}