{"summary":"Bitfinex Launches First Volatility-Based Bitcoin and Ethereum Futures Contracts","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitfinex-launches-bitcoin-and-ethereum-volatility-futures-contracts.htm","publishDate":"2024-04-03T10:00:37","id":18736,"type":null,"title":"Bitfinex Launches First Volatility-Based Bitcoin and Ethereum Futures Contracts","category":["Bitcoin News "],"content":["Bitfinex Derivatives, the derivatives platform of iFinex Financial Technologies Limited, is expanding its offerings with the launch of two new volatility-focused perpetual futures contracts. These contracts, the Bitcoin Implied Volatility Index (BVIVF0:USTF0) and the Ethereum Implied Volatility Index (EVIVF0:USTF0), aim to capture the market’s sentiment regarding future price movements for the two leading cryptocurrencies.","Unlike traditional futures contracts that track the underlying asset’s price directly, these new contracts focus on implied volatility, a metric derived from options pricing. Implied volatility reflects the market’s expectation of how much an asset’s price will fluctuate within a given timeframe. In simpler terms, the BVIV and EVIV contracts allow traders to speculate on whether market participants anticipate significant price swings (high volatility) or relative stability (low volatility) for Bitcoin and Ether in the coming weeks.","The contracts leverage the Volmex Implied Volatility indices, which track the 30-day expected volatility for these cryptocurrencies. This allows traders to gain exposure to market sentiment without directly buying or selling Bitcoin or Ether.","Furthermore, Bitfinex Derivatives offers these contracts with up to 20x leverage, potentially magnifying profits (or losses) for experienced traders comfortable with such risk.","These new volatility indices provide traders with a novel way to gauge market sentiment and potentially profit from anticipated price movements in Bitcoin and Ether, the exchange noted in a press released shared with Cryptonews.","Volatility indexes are known to exhibit negative correlation with the underlying asset’s price. This means that when the price of Bitcoin or Ether experiences a significant drop, the volatility index typically rises, reflecting the market’s increased anxiety. Conversely, periods of price stability often coincide with lower volatility readings. Volatility indexes can also experience sharp spikes during unexpected events that significantly impact the market.","The BVIVF0:USTF0 and EVIVF0:USTF0 contracts become available for trading on Bitfinex Derivatives on April 3rd, 2024. Howerver, as per the exchange’s terms of services US customers are not allowed to hold a derivatives account on the crypto exchange."],"entity":[{"type":"April 3rd, 2024","content":"DATE"},{"type":"Bitfinex Derivatives","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"iFinex Financial Technologies Limited","content":"ORGANIZATION"},{"type":"Howerver","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitfinex","Ethereum"],"authors":["Jai Pratap"]}