{"summary":"Binance Denies Allegation Of Market Manipulation From DWF Labs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-denies-allegation-of-market-manipulation-from-dwf-labs.htm","publishDate":"2024-05-09T17:25:35","id":18737,"type":null,"title":"Binance Denies Allegation Of Market Manipulation From DWF Labs","category":["Blockchain News "],"content":["Binance is fighting back against the DWF Labs allegation against the platform on May 9. This follows an explosive report from the Wall Street Journal (WSJ) that revealed that Binance dismissed an employee who uncovered evidence of market manipulation by DWF Labs, a major market on the trading platform.","According to the WSJ report, the dismissed employee and his colleagues at Binance’s market surveillance team had identified instances of pump-and-dump schemes and wash trading conducted by “VIP” clients, including $300M by DWF Labs. These activities violated Binance’s terms and conditions.","","The investigators recommended removing DWF Labs from the platform, which they accused of manipulating the price of several cryptos, including the YGG token.","Instead, Binance launched an inquiry into the team’s work, claiming there was insufficient evidence of wash trading by DWF Labs. According to the WSJ, the head of surveillance was fired afterward.","*Binance Fired Head of Surveillance After He Flagged DWF's Suspected Market Manipulation, Sources Say — WSJ","— Tree News (@News_Of_Alpha) May 9, 2024","","DWF Labs, an investor in crypto projects that gained prominence in 2023, was reportedly involved in trades of over $4 billion monthly on the Binance platform.","In response to the allegations, Binance refuted the claims, asserting they do not tolerate market manipulation.","In response to WSJ, we affirm our strict market surveillance program. We do not tolerate market abuse.","Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use.","Market maker…","— Binance (@binance) May 9, 2024","","The exchange also revealed its successful record of removing high-profile traders who broke the rules. Binance claimed to have removed over 355,000 users who violated its terms of service in the past. The exchange said the ousted market makers had a combined transaction volume of $2.5 trillion.","","DWF Labs released a Telegram announcement shortly after the WSJ report, which entails the rebuttal of the report that it engaged in price drive, artificial volume, and $300 million of wash trading on Binance in 2023.","“It has come to our attention that a recent article contains many allegations that we believe to be unfounded and that do not accurately represent our ethical business practices,” the market-making firm stated. “We have always prioritized our relationship with our partners and the broader community, successfully supporting more than 700 portfolio companies in the crypto ecosystem. We take pride in being compliant, transparent, and diligent in our work.”","Last year, Binance settled charges brought forward by multiple US regulators, agreeing to pay $4.3 billion in settlement over alleged violations of operating an unregistered exchange, insufficient controls over market manipulation, and commingling of funds.","The US SEC’s litigation against Binance exchange resulted in a plea deal and a settlement of $4.3 billion for violating US anti-money laundering standards. Binance co-founder Changpeng Zhao (CZ) also stepped down as the CEO as part of the settlement. He has been sentenced to four months in prison with an additional fine of $50 million."],"entity":[{"type":"WSJ","content":"ORGANIZATION"},{"type":"Binance Fired Head of Surveillance","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$300M","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"May 9, 2024","content":"DATE"},{"type":"$2.5 trillion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"May 9","content":"DATE"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Binance","Changpeng Zhao","DWF Labs"],"authors":["Jimmy Aki"]}