{"summary":"Indian Enforcement Directorate Seize Over $10M Cryptos Linked to Online Gaming App","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/indian-enforcement-directorate-seize-over-10m-cryptos-linked-to-online-gaming-app.htm","publishDate":"2024-05-01T07:38:06","id":18745,"type":null,"title":"Indian Enforcement Directorate Seize Over $10M Cryptos Linked to Online Gaming App","category":["Blockchain News "],"content":["The Directorate of Enforcement (ED) of India, has seized a major crypto money laundering case connected to a gaming app. The authority also seized frozen crypto assets worth ₹90 crore ($10 million) in connection with the scam.","Per the department’s press release on Tuesday, the frozen cryptos were kept in 70 accounts, linked to major crypto wallets Binance, ZebPay, and WazirX.","“These crypto assets were subsequently taken into possession of ED and transferred into the crypto wallet of ED,” it added.","The app – “E-Nugget” – masqueraded as a gaming platform, reportedly enticed gamers, promising multi-fold returns on their investments. “However, this facade quickly fell apart once investments were made,” it read.","E-Nugget ceased operations abruptly, preventing users from withdrawing funds, ED reported.","Per local reports, the investigation began in 2022 after the ED discovered that part of the money obtained were invested in digital assets. The investigations further revealed that around 2,500 fake bank accounts were identified and analyzed, seizing ₹19 crore ($2.27 million).","Following the investigations, authorities arrested Amir Khan, the mastermind behind the scam, who is currently in Judicial Custody.","In November 2022, ED asked Binance to freeze 150.22 Bitcoins, valued at $2.5 million at the time, linked to E-Nugget. The total value of seized assets in the case amounted to $8.4 million, the ED said in 2022.","The seizure follows arrests of five more persons in September, from the city of Kolkata, linked to the gaming app. Khan, the kingpin, was apparently hiding outside India at the time, police noted.","The Kolkata police carried out raids and seized multiple SIM boxes at the time. More than 2000 SIM cards, around 3,000 ATM cum debit cards and laptops were held from an office in the city. India has been among the top countries with retail crypto adoption in recent years."],"entity":[{"type":"2022","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"Kolkata","content":"LOCATION"},{"type":"Directorate of Enforcement (ED","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Judicial Custody","content":"ORGANIZATION"},{"type":"$2.27 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Amir Khan","content":"PERSON"},{"type":"$8.4 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"November 2022","content":"DATE"}],"hashtag":["crypto scam","Gaming","India"],"authors":["Sujha Sundararajan"]}