{"summary":"Tether CTO Aims Dig At DCG For Doubting USDT’s Resilience","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-cto-aims-dig-at-dcg-for-doubting-usdts-resilience.htm","publishDate":"2024-03-12T16:57:32","id":18752,"type":null,"title":"Tether CTO Aims Dig At DCG For Doubting USDT’s Resilience","category":["Blockchain News "],"content":["Paolo Ardoino, the CEO of Tether, has taken a jab at Digital Currency Group (DCG), the distressed crypto firm currently facing a lawsuit from the New York Attorney General (NYAG). ","In a March 11 post on X, the CEO mocked DCG in the wake of newly revealed court documents. Filings allege that the CEO was short “400 million” USDT following rumors of its instability when the crypto hedge fund Three Arrows Capital (3AC) collapsed.","DCG and Barry Silbert feared that Tether “would blow up” and decided to hedge risks and protect the company.","Ardoino, reflecting on the events in mid-2022, said the attempt only highlighted Tether’s resilience, particularly when “almost all the rest of the crypto industry was melting down.” ","Remember when many of hedge funds shorted $USDt on secondary markets, trying to cause a bank run?","Their only result was proving Tether's resiliency while almost all the rest of the Crypto industry was melting down.\nTether was able to redeem and pay 7B USD in 48 hours and more… pic.twitter.com\/HZZXhKkr6b","— Paolo Ardoino 🍐 (@paoloardoino) March 11, 2024","","The CEO boasted that despite the deluge of redemption requests, the company was able to redeem and pay out $7 billion in two days and another $20 billion in less than a month.   ","Additionally, Ardoino maintains that each token in circulation is fully backed by cash and other cash reserves, including treasuries. Accordingly, each of the over 100 billion USDT in circulation can be redeemed for cash at any moment.","Now aware of the turn of events at DCG, and considering that the firm is now distressed and being sued by New York regulators for fraud, among other accusations, the CEO added that “shorting USDT proved to be an idea as brilliant as accepting FTT as collateral.” ","FTX, a bankrupt crypto exchange founded by Sam Bankman-Fried, issued FTT. Genesis Global, one of DCG’s subsidiaries, had exposure to FTX and it collapse has been partly attributed to its reliance on FTT as collateral. "],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"March 11","content":"DATE"},{"type":"Barry Silbert","content":"PERSON"},{"type":"100 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$7 billion","content":"MONEY"},{"type":"$USDt","content":"MONEY"},{"type":"$20 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"}],"hashtag":["DCG","Tether","USDT"],"authors":["Dalmas Ngetich"]}