{"summary":"Tencent, Huawei Make Bold Moves in Web3 Amid China’s Crypto Constraints","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tencent-huawei-make-bold-moves-in-web3-amid-chinas-crypto-constraints.htm","publishDate":"2023-11-21T10:01:25","id":18757,"type":null,"title":"Tencent, Huawei Make Bold Moves in Web3 Amid China’s Crypto Constraints","category":["Altcoin News "],"content":["Tencent and Huawei, two major Chinese tech giants, are making notable strides in the Web3 space despite the country’s stringent regulations on cryptocurrency trading.","At the Staking Summit in Istanbul, a two-day conference featuring top minds in proof-of-stake (PoS) protocols, Tencent and Huawei exhibited their booths alongside industry professionals, according to a recent report by TechCrunch.  ","Over the past year, Chinese tech giants like Alibaba, Tencent, and Huawei have been increasingly visible in various crypto events worldwide, either as official sponsors or discreet attendees. ","Although their participation lies at the intersection of Web2 and web3 due to China’s cryptocurrency ban, these companies are leveraging their computing resources to cater to web3 startups, similar to how they provide cloud services to established tech verticals.","While cloud expenses for decentralized networks are still relatively modest, Chinese cloud providers are actively venturing into the crypto space. ","“As underdogs in the global cloud market, Chinese firms are far more proactive and accommodating with customers because they lack brand recognition, especially in the West,” the report said. ","“As such, they have to compete by offering cheaper — or better services.”","In addition to providing cloud infrastructure, Chinese firms have ventured into areas beyond their core products, putting them in direct competition with crypto-native companies. ","For instance, they have been involved in building enterprise blockchains, avoiding the public blockchain realm that heavily relies on tokens due to China’s crackdown on cryptocurrencies.","Some Chinese tech giants also offer node-as-a-service businesses. ","Blockchains operate on distributed nodes, which can be expensive and complex to maintain. ","To address this, companies like Huawei provide node hosting services, enabling enterprises to build decentralized applications without requiring high technical expertise.","Tencent and Alibaba, as pioneers among Chinese tech giants in the Web3 sector, have forged partnerships with respected projects to enhance their reputation in the industry.","Tencent has collaborated with public blockchains like Sui, Avalanche, and the Ethereum-scaling solution Scroll. ","Meanwhile, Alibaba has joined forces with Aptos, a blockchain developed by former Meta employees, to increase its presence in the web3 world. ","The two companies recently announced their co-hosting of hackathons in the Asia Pacific region, utilizing the Move programming language.","Currently, Web3 has not significantly impacted the top-line revenues of Chinese tech giants. ","However, these companies recognize the immense potential of the emerging industry and understand that they cannot afford to overlook the opportunity, despite market volatility and the collapse of major players like FTX.","As reported, back in May, the Beijing Municipal Science and Technology Commission released a white paper in a bid to foster innovation and development within the Web3 industry.","Dubbed the “Web3 Innovation and Development White Paper,” the paper was unveiled at the Zhongguancun Forum by the Beijing Municipal Science and Technology Commission, also known as the Administrative Commission of Zhongguancun Science Park.","The commission aims to establish Beijing as a global innovation hub by allocating a minimum of CNY100m ($14m) annually until 2025. "],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Huawei","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Administrative Commission of Zhongguancun Science Park","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Beijing Municipal Science and Technology Commission","content":"ORGANIZATION"},{"type":"$14m","content":"MONEY"},{"type":"Istanbul","content":"LOCATION"},{"type":"Zhongguancun","content":"LOCATION"},{"type":"Asia Pacific","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["China","Telegram"],"authors":["Ruholamin Haqshanas"]}