{"summary":"BlockFi Shuts Web Platform, Partners with Coinbase for Crypto Withdrawals","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockfi-shuts-web-platform-partners-coinbase-crypto-withdrawals.htm","publishDate":"2024-05-10T04:46:03","id":18750,"type":null,"title":"BlockFi Shuts Web Platform, Partners with Coinbase for Crypto Withdrawals","category":["Blockchain News "],"content":["Embattled crypto lender BlockFi announced Thursday that it plans to close its web platform this month, and is partnering with Coinbase to distribute funds to clients.","The New Jersey-based firm said its Coinbase partnership will allow eligible BlockFi Interest Account, Retail Loan, and Private Clients to withdraw their crypto holdings.","BlockFi filed for bankruptcy in Nov. 2022 after FTX’s collapse. CEO Zac Prince, who testified as a government witness in Bankman-Fried’s criminal trial, claims the FTX founder’s actions directly caused BlockFi’s bankruptcy.","","In 2023, BlockFi announced it was shutting down and planned to return customers’ crypto holdings. The deadline for most customers to request withdrawals was April 28, 2024.","On Thursday, the lender told clients that since the deadline to withdraw their digital assets from the current estate distribution has passed, clients will receive instructions on how to set up a Coinbase account. Through this method, they can withdraw their digital assets if they have an existing or new approved Coinbase account.","The company is also giving another chance to those who missed the withdrawal deadline. They will still have the option to withdraw from BlockFi’s platform. Those who do not establish an approved Coinbase account may have their assets liquidated into cash and distributed to them accordingly.","","The plan administrator will have the power to use Coinbase for upcoming distribution rounds, which may involve distributions from recovered funds from FTX. Without this capability, the administrator would be limited to distributing cash for subsequent distributions.","BlockFi said it does not plan to collaborate with any additional providers for cryptocurrency distributions. Consequently, it cautioned investors to remain vigilant against potential scam attempts from third-party entities. BlockFi has previously been the target of fraudulent activity, where claimants received deceptive emails resembling legitimate communications, falsely promising immediate withdrawals of their remaining balances.","Customers were further encouraged to retrieve their transaction history, tax documents, and any other pertinent information from BlockFi before the shutdown occurs."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 2022","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"April 28, 2024","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BlockFi","Coinbase"],"authors":["Shalini Nagarajan"]}