{"summary":"Get Ready for New Privacy Coin – Litecoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/get-ready-for-new-privacy-coin-litecoin-3283.htm","publishDate":"2019-01-29T11:28:24","id":18759,"type":null,"title":"Get Ready for New Privacy Coin – Litecoin","category":["Altcoin News "],"content":["Litecoin founder Charlie Lee has decided to implement more changes into the protocol and enter the play field of the privacy coins such as Monero, Zcash and others.","“Fungibility is the only property of sound money that is missing from Bitcoin & Litecoin. Now that the scaling debate is behind us, the next battleground will be on fungibility and privacy. I am now focused on making Litecoin more fungible by adding Confidential Transactions,” Lee announced on Twitter, later adding that it might happen “sometime in 2019.”","It will also not necessarily mean a hard fork: “Confidential Transactions can be softforked in,” he explained. It also shouldn’t affect Lightning Network compatibility. However, the protocol they’re going to use will definitely not be MimbleWimble, as “it changes the blockchain too much and has to be a hard fork.” As for the privacy layer, it will initially be optional. Lee explains, “I think mandatory [privacy] is much stronger privacy and fungibility but it’s harder to reach consensus on doing.”","Fungibility is a feature of a commodity or a good, which, if possessed, means that the units of the particular good or commodity are interchangeable. A good example is a dollar bill: there is an extremely large amount of dollar bills in circulation, yet every single dollar bill has the same worth: one dollar. Every dollar bill is interchangeable with any other, and they will all purchase the same amount of goods.","This is not necessarily the case in with cryptocurrencies. Newly minted coins are often considered more valuable than those tainted by operations, especially if the users before you used them for illegal means. This means that “the recipient can choose not accept the transaction based on transaction history, and decide to not do business with you,” as Charlie Lee explains.","Moreover, as reported last week, a team of researchers from UK university Cambridge have found a way to track stolen bitcoins even after they’re laundered, giving law enforcement an entirely new and powerful way to track the proceeds of cryptocurrency crime for the first time.","Litecoin price chart:","Not everyone in the community thinks privacy is such a great idea. Reddit user u\/bittabet writes, “Meh, this is going to be an unpopular opinion but I actually think Satoshi was right in letting it be a public ledger and only pseudonymous. That way governments would be more likely to accept and allow adoption, until it’s so entrenched that it’s too late to stop it. Then it’d be trivial to add this kind of stuff. Adding these things now is a mistake.” But u\/Scissorhand78 counters, “Once you mold something to be palatable to world’s governments, it will become so useless and hideous that you might as well take it out back and put a match to it.”","Also, Alexander Zaidelson, CEO of the Beam project, which is currently one of the only two cryptocurrencies to integrate MimbleWimble, is not worried that privacy focused coins are not very liked among state institutions.","“There is no regulation that transaction history has to be visible at all times. I mean, cash does not have a transaction history. Current regulatory frameworks tell us that if I’m selling lemonade for cash, I have to print register slips. But if I’m paying for lemonade, I don’t have to report anything. We want to create exactly that experience in Beam,” he said in a recent interview with Cryptonews.com."],"entity":[{"type":"Beam","content":"LOCATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Monero","content":"LOCATION"},{"type":"Cambridge","content":"LOCATION"},{"type":"Alexander Zaidelson","content":"PERSON"},{"type":"Charlie Lee","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Bitcoin & Litecoin","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Lightning Network compatibility","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":["Litecoin","Privacy"],"authors":["Sead Fadilpašić"]}