{"summary":"The Aragon DAO has voted through a plan to sue its own founding team to go after funds reportedly taken by the Aragon team.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263924\/a-dao-is-funding-a-lawsuit-against-its-own-founding-team","publishDate":"2023-11-21T06:33:57","id":1876,"type":null,"title":"A DAO is funding a lawsuit against its own founding team","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Aragon <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248522\/aragon-ant-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avatar_Circle_x6.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ANT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -3.73%\n    <\/span><\/a> <!----><\/span><\/span> DAO has passed two votes supporting a lawsuit against its founding team and funding it with $300,000.<\/span>","A vote <a href=\"https:\/\/dao.aragon.org\/#\/voting\/0x5b2ae5f9f1870a7d31ab74d3313262b3210c015d\/votes\/11\" data-v-f87c67ca=\"\">approving the proposal<\/a> passed unanimously with 1.6 million governance tokens in favor, while the vote to <a href=\"https:\/\/dao.aragon.org\/#\/voting\/0x5b2ae5f9f1870a7d31ab74d3313262b3210c015d\/votes\/10\" data-v-f87c67ca=\"\">approve the funding<\/a> passed with 1.6 million tokens in favor and 1 million tokens against. In governance votes, token holders vote with their tokens — with one token equalling one vote.","The vote comes in response to a move by the Aragon Association <a href=\"https:\/\/blog.aragon.org\/a-new-chapter-for-the-aragon-project\/\" data-v-f87c67ca=\"\">to dissolve itself<\/a> and discontinue its governance token, ANT, through redemptions for ether. It chose this plan without consulting the DAO due to legal constraints, it said at the time.","“Rather than continuing down the current path, after several months of deep introspection we have concluded that the shaky foundations underlying the current structure cannot be fixed and have been holding back the project for too long. Neither the AA nor ANT are currently suited to govern the project. A fresh start is needed and nothing short of a total reset will do,” it said.","This provoked a reaction among some ANT token holders. The recent DAO proposal aims at the decision being taken without a vote and speculates that the move could see the Aragon Association keeping $50 million.","“This proposal is to decide whether or not to start a process to go after the AA's responsible members in order to make sure the money from investors is returned to investors and not taken by the Aragon Team into their new secretive company,” the <a href=\"https:\/\/ipfs.eth.aragon.network\/ipfs\/QmVGeLk8aJmaQM6tf23AjsQJ2qpTeb9ncBKzESvErbygox\" data-v-f87c67ca=\"\">proposal<\/a> states.","The $300,000 of funding will be used for Patagon Management LLC —&nbsp;which describes itself on X as an investment company — to pursue legal action and negotiations with the Aragon team, the proposal adds. It notes that Patagon, owned by Diogenes Casares, has also <a href=\"https:\/\/casetext.com\/case\/patagon-mgmt-v-wei-max-wu\" data-v-f87c67ca=\"\">sued Wei “Max” Wu<\/a> in relation to the Spartacus DAO — which had a similar restructuring that <a href=\"https:\/\/diogenescasares.medium.com\/we-sued-a-dao-but-why-91fbe109e5ba\" data-v-f87c67ca=\"\">token holders felt<\/a> left them at a loss.","The funding was sent to <a href=\"https:\/\/etherscan.io\/address\/0xD20A38dF38E542888DAf4425acDa3872EE4Dba1a#tokentxns\" data-v-f87c67ca=\"\">Patagon’s wallet<\/a> following the vote. It was paid in the stablecoin USDC.","“The Aragon team have no basis to block this, any excuses they use are hollow. This has not stopped them from indirectly threatening Patagon as the enforcer of the DAO in this case, and further shows their desperation,” <a href=\"https:\/\/twitter.com\/PatagonLLC\/status\/1726862247514009999\" data-v-f87c67ca=\"\">said Patagon on X<\/a>.","Other individuals will also be able to help finance the lawsuit and will receive their funds back plus 10% interest per year if the case is won, the proposal states. They will also share a 5% cut of the total funds to be handed back to token holders. If the case is lost, they won’t receive compensation.","The lawsuit will be monitored by an oversight committee made up of a representative from the investment firm Arca, crypto trader DCF God and other pseudonymous individuals who go by Wismerhill, Tedward, CM, Triangular and Yakitori.","The Aragon Association told The Block that a large number of Aragon token holders had redeemed their tokens, far more than were used in the vote to pass these proposals — suggesting it wasn't representitive of the Aragon community.","\"The Aragon DAO held 300,000 USDC onchain and participating wANT Holders were free to make proposals and vote on the withdrawal of funds. We are disappointed but not surprised this is how the RFV Raiders chose to use the funds in the Aragon DAO,\" the association said.","The association added that the DAO vote may get challenged in Swiss court by those that voted no.","For its part, the Aragon core team said, “The current team is not part of the Aragon Association and had no decision making power in the Aragon Association's decision. We remain committed to advancing the project’s mission by building Aragon’s tech stack.”","Individuals related to the potential lawsuit against Aragon and on its oversight committee have been involved in previous disputes and dealings with DAOs before.","In May, Aragon’s Twitter account claimed that its DAO was under attack by an informal group of crypto individuals collectively known as the RFV Raiders. Standing for “risk-free value,” the unifying idea is that the groups focus on shutting down DAOs and distributing the treasury among token holders — sometimes called a governance attack.&nbsp;","Aragon <a href=\"https:\/\/twitter.com\/AragonProject\/status\/1656028386307743748\" data-v-f87c67ca=\"\">claimed<\/a> its DAO was being attacked at the time by Arca and the RFV Raiders. It also said these members were buying up ANT tokens to use them to vote through proposals for their own purposes.","Casares told The Block that \"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">I take issue with the name RFV Raiders because it makes it seem we are robbing candy from babies or something like that, although I understand it has become a widely used term. In reality we are activist investors, protecting and fighting for the financial rights of stakeholders. Without us, many teams would be left unchecked (see Time Wonderland’s current BV scam with Sifu, or Lybra, etc).<\/span>\"","In a <a href=\"https:\/\/diogenescasares.medium.com\/crypto-value-investing-edd044114436\" data-v-f87c67ca=\"\">Medium post<\/a> at the time, Casares provided more details about the group. “While not frequently mentioned, the RFV community has broken down many DAOs, including Invictus DAO, Fei Protocol, Rome DAO, and Temple DAO. It has also partially influenced the governance of many other projects such as Redacted Cartel, Time Wonderland, and Olympus. Collectively, these protocols have Risk-Free assets in excess of $1B,” Casares said.","Aragon’s Twitter account <a href=\"https:\/\/twitter.com\/AragonProject\/status\/1656028404573958152\" data-v-f87c67ca=\"\">claimed<\/a> the Medium post stated that many of the investors involved had made millions of dollars by calling for the dissolution of such projects. This line does not currently appear in the post.","Aragon also <a href=\"https:\/\/twitter.com\/AragonProject\/status\/1656028401638023170\" data-v-f87c67ca=\"\">strongly implied<\/a> that Avraham Eisenberg, who took responsibility for the attack on Mango Markets, belonged to the group. Casares said Eisenberg was known in the activist community but was not part of the group.","The Block has reached out to Arca and DCF God for comment.","<em data-v-f87c67ca=\"\">Update: This article has been updated with comment from Casares, the Aragon Association and the Aragon team.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Olympus","content":"ORGANIZATION"},{"type":"DCF","content":"ORGANIZATION"},{"type":"Rome","content":"LOCATION"},{"type":"Wei “Max” Wu","content":"PERSON"},{"type":"Casares","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Wismerhill, Tedward","content":"ORGANIZATION"},{"type":"RFV","content":"ORGANIZATION"},{"type":"Lybra","content":"ORGANIZATION"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"$1B","content":"MONEY"},{"type":"AA","content":"ORGANIZATION"},{"type":"Aragon","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Temple DAO","content":"ORGANIZATION"},{"type":"Aragon Team","content":"ORGANIZATION"},{"type":"Patagon Management LLC","content":"ORGANIZATION"},{"type":"-3.73%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Aragon DAO","content":"ORGANIZATION"},{"type":"RFV Raiders","content":"ORGANIZATION"},{"type":"Diogenes Casares","content":"PERSON"},{"type":"Fei Protocol","content":"ORGANIZATION"},{"type":"Aragon <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248522\/aragon-ant-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avatar_Circle_x6.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ANT","content":"ORGANIZATION"},{"type":"Time Wonderland","content":"ORGANIZATION"},{"type":"Patagon","content":"PERSON"},{"type":"Aragon","content":"ORGANIZATION"},{"type":"Yakitori","content":"LOCATION"},{"type":"Aragon Association","content":"ORGANIZATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["DAOS","GOVERNANCE VOTES"],"authors":["Tim Copeland","The Block"]}