{"summary":"Institutional Investors Flock to Bitcoin Pushing Inflows Past $1 Billion in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/institutional-investors-flock-to-bitcoin-pushing-inflows-past-1-billion-in-2023.htm","publishDate":"2023-11-14T13:49:08","id":18769,"type":null,"title":"Institutional Investors Flock to Bitcoin Pushing Inflows Past $1 Billion in 2023","category":["Bitcoin News "],"content":["Total inflows into traditional investment funds backed by crypto have finally passed the $1 billion mark for the year, after last week saw investors flocking to Bitcoin.","For the week as a whole, crypto investment funds recorded inflows of $293 million, bringing the year-to-date inflows to an impressive $1.14 billion, according to the latest data from crypto research and investment firm CoinShares.","The massive yearly inflows have followed steadily higher crypto prices this year, with Bitcoin currently trading at $36,410, up by around 120% from $16,500 at the beginning of the year.","As usual, Bitcoin is the leading digital asset investors are seeking exposure to, with $240 million going to Bitcoin-backed funds alone for the week.","Year-to-date, Bitcoin funds have now seen inflows of $1.08 billion.","At the same time, short-Bitcoin funds – funds that rise in value as Bitcoin’s price falls – saw outflows of 7 million, an indication of bullish sentiment among investors towards the number one cryptocurrency.","Notably, CoinShares also said that close to 20% of the trading volume on so-called “trusted exchanges” is now made up by trading in various exchange-traded products (ETPs).","“This has rarely happened and suggests ETP investors are participating much more in this rally compared to 2020\/21,” the firm wrote.","While Bitcoin stands in a league of its own, funds backed by Ethereum’s native token Ether (ETH) also saw strong inflows last week, totaling $49 million.","According to CoinShares, the last two weeks have signified “a real turn around in sentiment” around ETH, which could be related to speculation that spot ETH exchange-traded funds (ETF) could be approved in the US.","Already, market participants are expecting that a spot BTC ETF will be approved at some point between now and January of 2024.","Among other altcoin funds, those backed by Solana’s SOL token stood out with $12.4 million in inflows, according to CoinShares’ data.",""],"entity":[{"type":"January of 2024","content":"DATE"},{"type":"$49 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$12.4 million","content":"MONEY"},{"type":"$240 million","content":"MONEY"},{"type":"$1.14 billion","content":"MONEY"},{"type":"120%","content":"PERCENT"},{"type":"$1.08 billion","content":"MONEY"},{"type":"$1 billion mark","content":"MONEY"},{"type":"$293 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$36,410","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$16,500","content":"MONEY"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","CoinShares"],"authors":["Fredrik Vold"]}