{"summary":"Ethereum Validator Queue Reaches Highest Level Since October Amid Renewed Interest in Staking","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-networks-validator-queue-reaches-highest-level-since-october-amid-renewed-interest-in-staking.htm","publishDate":"2024-02-12T10:44:16","id":18767,"type":null,"title":"Ethereum Validator Queue Reaches Highest Level Since October Amid Renewed Interest in Staking","category":["Ethereum News "],"content":["The Ethereum network is experiencing a surge in the number of validators seeking to stake their Ethereum (ETH).","According to data source ValidatorQueue, the validator entry queue currently stands at 7,045, representing over 225,000 Ether (equivalent to $562 million), its highest level since October 2023.","It is estimated that the backlog will be cleared in slightly over 48 hours.","Due to Ethereum’s limitations on the number of new validators that can join the network per epoch, a backlog occurs as more entities seek to participate.","An Ethereum epoch lasts approximately 6.4 minutes.","Validators are entities that stake a minimum of 32 Ether in the network, enabling them to participate in running Ethereum’s proof-of-stake consensus blockchain.","In return for staking their Ether, validators receive a steady rate of return similar to interest income from fixed-income instruments like bonds.","The recent surge in Ethereum staking activity is seen as an early sign of renewed vitality in the network.","David Lawant, Head of Research at institutional crypto exchange FalconX, highlighted the significance of the uptick in the activation queue.","However, Lawant noted that the annualized percentage yield on staked ether has shown little to no improvement.","A quarter of all Ethereum (ETH) in supply is now being staked, data shows. According to figures from blockchain data firm Nansen, over 30 million ETH—or about $74 billion worth of the cryptocurrency—has been locked up.&#160; Staking is the process of…","— mariangela perez (@mariangela242) February 8, 2024","","The composite Ether staking rate has remained between 3.5% and 4% for the past four months, offering a minimal premium compared to the yield of the risk-free rate on the 10-year U.S. Treasury note, currently at 4.17%.","While the number of validators seeking to join the network has experienced a notable increase, it still falls short of the figures observed after Ethereum’s Shapella upgrade in April of the previous year.","The Shapella upgrade allowed for the withdrawal of staked ether for the first time, reducing the risk associated with locking coins in exchange for rewards.","In early January, the waitlist for validators looking to exit briefly surged after failed crypto lender Celsius announced plans to unstake its entire ether holdings. ","However, despite these fluctuations, Ether’s recent price performance has been relatively modest compared to Bitcoin and the broader cryptocurrency market.","The uncertainty surrounding the potential launch of U.S.-based spot exchange-traded funds (ETFs) later this year, combined with the need for clarity regarding the Securities and Exchange Commission’s (SEC) categorization of Ether, has likely contributed to cautious trading activity in the market.","Traders eagerly await confirmation on whether ETH ETFs will be allowed to stake coins.","The upcoming amendments to the S-1 forms, such as Ark\/21Shares’ recent inclusion of a staking component, indicate the possibility of such developments.","Meanwhile, Ethereum’s NFT market has experienced a surge in trading activity, with the weekly volume hitting its highest level since February 2023.","Over the past week, NFT sales on the Ethereum network surged by around 100%, reaching a whopping $158 million.","The rise in Ethereum NFT volume coincides with the growing popularity of the Pudgy Penguins collection, currently ranked third by market capitalization."],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February 8, 2024","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Nansen","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Ethereum’s NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$158 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"4.17%","content":"PERCENT"},{"type":"mariangela perez","content":"PERSON"},{"type":"3.5%","content":"PERCENT"},{"type":"David Lawant","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"$562 million","content":"MONEY"},{"type":"Lawant","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$74 billion","content":"MONEY"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Validator"],"authors":["Ruholamin Haqshanas"]}