{"summary":"BlackRock to Launch Brazil’s First Bitcoin ETF on March 1","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blackrock-to-launch-brazils-first-bitcoin-etf.htm","publishDate":"2024-03-01T09:10:03","id":18766,"type":null,"title":"BlackRock to Launch Brazil’s First Bitcoin ETF on March 1","category":["Bitcoin News "],"content":["BlackRock is set to broaden Brazil’s cryptocurrency market with the introduction of the country’s first spot Bitcoin exchange-traded fund (ETF), the iShares Bitcoin Trust BDR (IBIT39).","Scheduled for launch on March 1 on Brazil’s main stock exchange B3, the iShares Bitcoin Trust Brazilian Depositary Receipts (BDR) will be accessible to qualified investors, with plans to extend availability to retail investors pending regulatory approval.","JUST IN 🇧🇷 – BlackRock's spot #Bitcoin ETF will begin trading tomorrow in Brazil.","Initially \"IBIT39\" will only be available to qualified investors with retail access to come in the following weeks. pic.twitter.com\/GL5IzWUQCx","— Swan Media (@Swan) February 29, 2024","","According to InfoMoney, BlackRock Brazil Country Manager Karina Saade revealed the launch and expressed the ETF‘s goal to offer investors regulated access to Bitcoin, emphasizing the strategic expansion of digital asset investments in Brazil.","“Our digital asset journey has been underpinned by the goal of providing high-quality access vehicles to investors,” said Saade. “IBIT39 is a natural progression of our efforts over many years and builds on the fundamental capabilities we have established so far in the digital asset market.”","“We believe in the potential of technology and that today it is possible for all investors, individuals, to build a portfolio solely with ETFs,” said Saade.","Saade clarified that BlackRock’s recent products in both the United States and Brazil should not be seen as an endorsement of crypto. Instead, it acknowledged the growing interest among investors for this asset class.","“Our goal is to serve our customers with safe and transparent products. We have no recommendation or any expectations regarding Bitcoin itself,” said Saade.","IBIT39 is structured to mirror the price performance of Bitcoin and features a management fee of 0.25%, which will be reduced to 0.12% for the first year on the initial $5 billion in assets under management (AUM).","“The listed crypto market started in 2021 and today we have 13 ETFs. It is a recent market, but it has assets of R$2.5 billion,” said B3’s Interest and Currency Products Superintendent Felipe Gonçalves.","“It started with strong volumes, fluctuated a little in two years and, at the end of last year, it reached R$30 million per day,” said Gonçalves."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"0.12%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"$5 billion","content":"MONEY"},{"type":"BDR","content":"ORGANIZATION"},{"type":"March 1","content":"DATE"},{"type":"BlackRock Brazil Country Manager Karina Saade","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"February 29, 2024","content":"DATE"},{"type":"Felipe Gonçalves","content":"PERSON"},{"type":"Saade","content":"PERSON"},{"type":"R$30 million","content":"MONEY"},{"type":"Gonçalves","content":"PERSON"},{"type":"Bitcoin Trust BDR","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin ETF","Brazil"],"authors":["Hongji Feng"]}