{"summary":"Is Web3 Gaming Investment Arena Overcorrecting? Possibly, WAX Exec Says","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-web3-gaming-investment-arena-overcorrecting-possibly-wax-exec-says.htm","publishDate":"2023-11-30T20:10:32","id":18771,"type":null,"title":"Is Web3 Gaming Investment Arena Overcorrecting? Possibly, WAX Exec Says","category":["Blockchain News "],"content":["In a recent chat with Cryptonews, Michael Rubinelli, industry veteran and Chief Gaming Officer at Web3 ecosystem for gaming WAX, discussed how macroeconomic trends affect the gaming industry, what is happening in the gaming investment arena, and the positive future awaiting blockchain-based games.","Rubinelli stated that he may not be an expert on how global macroeconomic trends affect gaming investment, but they “undoubtedly exert a considerable influence on the world of venture capital.”","He noted the reaction to the performance of major games like Axie Infinity. Per Rubinelli, there was an initial overreaction to the success of such games.","Rubinelli argued that,","“When a potential ‘Northstar’ opportunity in a relatively unexplored market segment is identified, it often triggers a rush of investment driven by the fear of missing out (FOMO).”","At the time, many funding pitches revolved around the premise of being ‘like Axie, but better.’ There is no need for a deep understanding of the underlying complexities, so this can be a persuasive strategy to secure investments. That’s especially the case in a rapidly trending sector.","As a result, “substantial amounts of capital” were given to projects that may not have undergone due diligence.","Rubinelli opined that,","“Unfortunately, the subsequent crypto-winter brought about a series of failures among gaming studios and broad investments in Web3, leading to a necessary correction.”","Therefore, a question arises, he said. Are we witnessing an overcorrection in the gaming investment landscape?","“It’s a possibility,” Rubinelli said when talking to Cryptonews in late October.","He noted, however, that venture capitalists in general have been growing increasingly risk-averse.","“Until a more robust and innovative Web3 approach\/business is developed, a significant portion of capital may remain in reserve as investors seek more secure opportunities.”","The conclusion is that the gaming industry is not insulated from the broader macroeconomic trends. The experiences with ‘hot’ gaming investments serve as a valuable lesson, Rubinelli said.","Caution is a natural response to the recent market dynamics. But the executive opined that the industry will “adapt and continue to offer promising opportunities for investors as it matures and refines its investment models.”","Per WAX’s Chief Gaming Officer, there is no doubt that we will continue to see the growth of “the harmonious coexistence of blockchain-enabled games alongside traditional non-Web3 titles” on popular platforms. This includes Google Play, the App Store, Epic Games Store, Humble Bundle, and eventually Steam, he said.","Looking into the future, Rubinelli stated that,","“I firmly believe that in the next 3 to 5 years, a substantial majority, exceeding 75%, of newly launched games will incorporate a mechanism enabling players to sell the digital assets they own.”","Game publishers and developers must strike “a delicate balance” between generating sufficient revenue to sustain their operations and ensuring that players do not feel restricted by in-game purchases.","That said,","“The current landscape of blockchain gaming stands at a pivotal crossroads, on the cusp of achieving mainstream acceptance.”","So far, a major challenge has been that non-game developers tried creating games that “essentially amounted to the gamification of decentralized finance websites.” It lacked the true essence of gaming, Rubinelli argued. This approach proved unsustainable and ineffective.","But 2021’s bull run brought a significant development.","Many renowned AAA game developers secured funding to create authentic gaming experiences where players could genuinely own assets acquired through purchase, in-game crafting, or other means.","It’s crucial to note here that producing a high-quality game typically requires 18 to 36 months of meticulous work, Rubinelli said.","Therefore,","“We are on the brink of witnessing the release of remarkable and enjoyable games that are set to revolutionize the blockchain gaming sphere.”","This shift is instrumental in countering the prevailing skepticism and misconceptions surrounding Web3 gaming, Rubinelli added.","In mid-October, WAX’s dedicated gaming studio, Tyranno Studios, led by Rubinelli, announced that its blockchain-based, wrestling-themed non-fungible token (NFT) game Brawlers launched on the major digital distribution platform Epic Games Store — becoming available to more than 230 million PC gamers worldwide.","There are numerous benefits and no drawbacks of blockchain games featuring on traditional platforms, per Rubinelli.","Content acceptance, adoption, and consumption are fueled by distribution. Without omnipresent channels of distribution, none of that matters.","He added that,","“Achieving widespread adoption in the mass market hinges on effectively communicating the essence of the gaming experience to both our current and potential audience.”","Brawlers’s primary objection is to position itself in a way that resonates with all players. It has to offer familiar elements within a game that’s “undeniably enjoyable.”","The team behind ‘Brawlers’ never considered itself in direct competition with other Web3 titles, said Rubinelli.","“Instead, we see ourselves vying for attention not just against traditional games but also against the various entertainment options people have in their daily lives.”","This line of thinking made the team’s goal clear. They aim to ensure that players’ time in the game feels like a well-justified choice.","“This, undoubtedly, is our most challenging endeavor,” Rubinelli admitted.","____","Learn more: William Quigley, Co-Founder of Tether and WAX, on Founding Companies, Crypto Investing, and The Future of Crypto Regulation | Ep. 218"],"entity":[{"type":"Crypto Investing","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Tyranno Studios","content":"ORGANIZATION"},{"type":"Rubinelli","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Rubinelli","content":"ORGANIZATION"},{"type":"mid-October","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"William Quigley","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Michael Rubinelli","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Northstar","content":"ORGANIZATION"}],"hashtag":["Blockchain","Gaming","Investment","Web3"],"authors":["Sead Fadilpašić"]}