{"summary":"MakerDAO Considers $600 Million DAI Allocation into USDe and sUSDe","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/makerdao-considers-600-million-dai-allocation-into-usde-and-susde.htm","publishDate":"2024-04-02T05:09:37","id":18777,"type":null,"title":"MakerDAO Considers $600 Million DAI Allocation into USDe and sUSDe","category":["DeFi News "],"content":["MakerDAO is currently reviewing a proposal to invest $600 million in DAI into USDe and its staked version sUSDe.","According to a community forum post by MonetSupply from Block Analitica, a risk intelligence firm for decentralized finance (DeFi), the proposed investment seeks to leverage the DeFi lending protocol Morpho Labs.","Not a joke: @MakerDAO considering allocating up to $600m DAI into sUSDe and USDe via @MorphoLabs with possibility to go up to $1 billion","Ethena TVL growth is on track with internal expectationshttps:\/\/t.co\/kKEhPoDwQm pic.twitter.com\/F1QP1xPBFW","— Seraphim (@MacroMate8) April 1, 2024","","The allocation aims to capitalize on the advanced lending capabilities of Morpho Labs, aligning with MakerDAO’s investment diversification goals and its commitment to fostering a more robust and resilient DeFi ecosystem through targeted support of Ethena Labs’ stablecoins.","The post suggested that the users indicated a preference for certain types of financial products and leverages within the DeFi space. “Users showed a strong preference for USDe over sUSDe pools, and also showed a preference for higher over lower leverage,” said MonetSupply.","The proposal also breaks down the financial and strategic benefits of the allocation, saying, “There will still be significant incentives for using USDe and sUSDe collateral on Morpho.”","Allocating to USDe would also reduce liquidity risk through immediate redemption and boosts Ethena’s insurance fund revenue, enhancing MakerDAO’s investment security over time.","As the DeFi landscape evolves, MonetSupply argued that Ethena’s position and future development, including the revised points program (‘sats’ program), would “continue to favor USDe over sUSDe.”","Finally, the proposal emphasized the broader implications of the investment for the DeFi ecosystem, stating, “Allocation to USDe also allows Ethena to retain a greater share of revenue for their insurance fund, which over time can improve the risk profile of Maker’s Ethena allocation.”","The proposed initial recommendation set MakerDAO’s USDe exposure limit at $600 million, a figure that may increase as Ethena’s platform grows.","The post advocated that the investment should not only cover MakerDAO’s operational costs and projected losses from USDe but also stay within a secure investment limit of up to $800 million to protect against substantial losses and ensure financial stability.","“We recommend limiting allocations to a maximum of 600 million DAI total for the time being,” said the analyst.","“However, we recommend setting the DDM line parameter to 1 billion DAI, to reduce the amount of governance overhead required to increase exposure in the future if relevant constraints change,” MonetSupply concluded."],"entity":[{"type":"Block Analitica","content":"LOCATION"},{"type":"Morpho Labs","content":"ORGANIZATION"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"1 billion","content":"MONEY"},{"type":"April 1, 2024","content":"DATE"},{"type":"Morpho","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"$600m","content":"MONEY"},{"type":"$800 million","content":"MONEY"}],"hashtag":["DAO","DeFi"],"authors":["Hongji Feng"]}