{"summary":"Canadian Crypto Custody Firm Balance Sees Assets Reach $2 Billion Amid Market Recovery","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/canadian-crypto-custody-firm-balance-sees-assets-reach-2-billion-amid-market-recovery.htm","publishDate":"2024-02-23T14:07:06","id":18788,"type":null,"title":"Canadian Crypto Custody Firm Balance Sees Assets Reach $2 Billion Amid Market Recovery","category":["Altcoin News "],"content":["Balance, a digital asset custodian based in Canada, has revealed that it has once again achieved $2 billion in assets under custody (AUC) amid the recent recovery in crypto markets. ","With Bitcoin’s (BTC) value more than doubling over the past year and crossing $1 trillion in market cap, Balance has seen a resurgence in its crypto assets, with clients now exploring new products and offerings, the company said in a recent press release. ","George Bordianu, the CEO of Balance, acknowledged the challenges faced during the bear market of 2022, which caused the company’s AUC to drop from a peak of $2.5 billion to a low of $500 million. ","“I’m grateful our team was up to the challenge, and rebuilding to $2 billion in AUC is a testament to their hard work and unwavering commitment to our clients,” he added. ","Established in 2017, Balance claims to be the oldest and largest digital asset custodian in Canada. ","The company provides storage services for crypto assets to various entities across Canada, as well as in some US states, the British Virgin Islands, and the Cayman Islands. ","Its clientele includes crypto exchanges, neobanks, and private funds.",". @balance_canada surpasses $2B of assets under custody.","\"Our focus since day one has been to build a world-class custodian for companies working with digital assets. We rejected vending ready-made solutions and instead built our offline and warm infrastructure entirely… pic.twitter.com\/UHz5Cb0k55","— Balance (@balance_canada) February 22, 2024","","During the 2022 market crash, Balance underwent a Systems and Organization Controls (SOC) 2 Type I audit, which is considered a crucial industry benchmark in the crypto space. ","The audit, conducted amid market downturn, enabled Balance to serve investment dealers, mutual fund dealers, and portfolio and investment fund managers.","In January, Balance relocated its headquarters from Toronto to Calgary, citing Alberta’s regulatory framework as a compelling reason for the move. ","Bordianu said Alberta’s regulatory environment offers the necessary structure for Balance to become a qualified custodian without being burdened by regulatory requirements unrelated to its operations, such as deposit-taking.","Aside from Balance, other digital asset custody firms have also seen a spike in their assets under custody. ","For one, Korea Digital Asset (KODA), the largest institutional crypto custody service in South Korea, has seen a remarkable growth in crypto assets under its custody. ","Just recently, the company revealed that the value of these crypto assets under its custody expanded by nearly 248% in the second half of 2023.","KODA, which was established through a collaboration between major Korean bank KB Bank, crypto venture capital firm Hashed, and blockchain tech firm Haechi Labs, said that the value of these assets reached approximately 8 trillion Korean won ($6 billion) by the end of last year. ","This was a substantial increase from the 2.3 trillion won recorded at the end of June 2023.","Meanwhile, institutional investors in the US have turned to spot Bitcoin ETFs in order to get exposure to the booming crypto sector. ","Earlier this week, daily spot Bitcoin ETF trading volume amounted to nearly $2 billion, the highest level since the first day of trading on January 11.","As reported earlier, spot Bitcoin ETFs witnessed a substantial influx of approximately $2.3 billion last week, nearly doubling the previous week’s inflow of $1.2 billion."," "],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"George Bordianu","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 11","content":"DATE"},{"type":"Haechi Labs","content":"ORGANIZATION"},{"type":"Toronto","content":"LOCATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"Calgary","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"},{"type":"second half of 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"AUC","content":"ORGANIZATION"},{"type":"248%","content":"PERCENT"},{"type":"February 22, 2024","content":"DATE"},{"type":"Alberta","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"$6 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$2B","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Balance","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"KB Bank","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Adoption","Canada","Custody"],"authors":["Ruholamin Haqshanas"]}