{"summary":"Bitcoin ETFs See Record $1B Inflows as BTC Price Remains at All-Time Highs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etfs-see-record-1b-inflows-as-btc-price-remains-at-all-time-highs.htm","publishDate":"2024-03-13T09:31:35","id":18785,"type":null,"title":"Bitcoin ETFs See Record $1B Inflows as BTC Price Remains at All-Time Highs","category":["Bitcoin News "],"content":["Bitcoin (BTC) exchange-traded funds (ETFs) experienced a staggering $1.05 billion in net inflows on March 12, according to data from SoSoValue. ","The milestone sets a new record for the highest single-day net inflow since the inception of Bitcoin spot ETF trading, representing an impressive 56% increase compared to the net inflow of $673 million recorded on February 28.","The surge in net inflows into Bitcoin ETFs aligns with the ongoing surge in the price of Bitcoin, which has been scaling new heights recently. ","As of now, the world’s leading cryptocurrency is trading at $73,517.03, around all-time highs. ","According to data from CoinMarketCap, Bitcoin registered an ATH of $73,637 earlier today. ","According to SoSoValue data, on March 12, the total net inflow into Bitcoin spot ETFs reached $1.05 billion, setting a new record for the highest single-day net inflow since the first trading day of the ETF, representing an increase of approximately 56% compared to the net inflow… pic.twitter.com\/om83JbhG0r","— Wu Blockchain (@WuBlockchain) March 13, 2024","","As Bitcoin continues to exhibit strong performance, investors are increasingly seeking exposure to the digital asset through regulated investment vehicles like ETFs.","Bitcoin ETFs offer investors an opportunity to gain indirect exposure to Bitcoin without having to directly hold or manage the underlying asset. ","These investment products track the price of Bitcoin and allow investors to trade its shares on traditional stock exchanges. ","This accessibility and convenience have propelled the popularity of Bitcoin ETFs, attracting significant capital inflows.","The record-breaking net inflows into Bitcoin ETFs highlight the growing demand for regulated investment vehicles in the cryptocurrency market. ","In fact, Bitcoin ETFs have experienced the most successful launch in the history of ETFs.","These products accumulated over 30,000 BTC in the previous week alone, currently holding close to $30 billion.","If the trend of institutional inflows into Bitcoin continues, it could create a new phenomenon where the demand for Bitcoin surpasses the available supply, effectively creating a Bitcoin ETF liquidity crisis. ","That’s according to Ki Young Ju, CEO of on-chain analytics platform CryptoQuant, who predicted a watershed moment in BTC supply within the next six months.","Ki emphasized that as long as spot Bitcoin ETF inflows persist, the bears in the market will struggle to gain the upper hand. ","This scenario would create a scarcity of Bitcoin available for sale, he said. ","The Grayscale Bitcoin Trust (GBTC) is also bucking the trend, experiencing daily outflows of around $500 million. ","Despite these outflows, the value of GBTC’s BTC holdings has remained relatively stable due to Bitcoin’s price appreciation since the ETF launch in January.","When the tipping point of ETF demand is reached, Ki predicts that the impact on Bitcoin’s price may exceed market expectations. ","A sell-side liquidity crisis would limit the availability of sellers and result in a thinner order book, potentially leading to a higher cyclical top for the cryptocurrency.","Ki also highlighted the ongoing uptrend in BTC held by “accumulation addresses,” which are wallets that receive only inbound transactions. ","However, these holdings would need to double before the crisis sets in, as Bitcoin’s recent surge to new all-time highs has caused accumulation address holdings to cool off."],"entity":[{"type":"February 28","content":"DATE"},{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"March 13, 2024","content":"DATE"},{"type":"56%","content":"PERCENT"},{"type":"March 12","content":"DATE"},{"type":"$73,637","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"$73,517.03","content":"MONEY"},{"type":"$673 million","content":"MONEY"},{"type":"$1.05 billion","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Bitcoin","spot ETF"],"authors":["Ruholamin Haqshanas"]}