{"summary":"Former Boston Celtics basketball player Paul Pierce was charged by the SEC for unlawfully touting EMAX tokens, which were offered and sold by EthereumMax. \nPierce agreed to settle the charges.\nThe case has similarities to one brought by the watchdog against Kim Kardashian last year.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212937\/sec-warns-celebrities-after-charging-nba-hall-of-famer-over-crypto-promotion","publishDate":"2023-02-17T11:30:13","id":1879,"type":null,"title":"SEC warns celebrities after charging NBA Hall of Famer over crypto promotion","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">NBA Hall of Famer Paul Pierce settled charges brought by the U.S. Securities and Exchange Commission for unlawfully touting tokens sold by EthereumMax. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency said Pierce, who played for the Boston Celtics, promoted the token called EMAX without disclosing that he had been paid. He agreed to settle the charges and pay $1.4 million in penalties, disgorgement and interest, according to a statement. Pierce did not admit or deny the SEC’s findings and also agreed to not promote any “crypto asset securities” for three years. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Pierce was paid more than $244,000 worth of EMAX tokens to promote them on Twitter, the SEC said, alleging he also tweeted misleading statements relating to EMAX. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“This case is yet another reminder to celebrities: The law requires you to disclose to the public from whom and how much you are getting paid to promote investment in securities, and you can’t lie to investors when you tout a security,” SEC Chair Gary Gensler said in the statement. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The case is similar to one brought against Kim Kardashian last year when the SEC said she did not disclose the payment received for promoting the EthereumMax token. Kardashian agreed to pay $1.26 million in penalties and said she would work with the SEC on its ongoing investigation. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Investors are entitled to know whether a promotor of a security is unbiased, and Mr. Pierce failed to disclose this information,” said Gurbir S. Grewal, director of the SEC’s Division of Enforcement.&nbsp;<\/span>"],"hashtag":[]}