{"summary":"S Korean City of Incheon Seizes $375,000 Worth of Crypto from ‘Tax Dodgers’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/s-korean-city-of-incheon-seizes-375000-worth-of-crypto-from-tax-dodgers.htm","publishDate":"2024-01-04T03:00:11","id":18797,"type":null,"title":"S Korean City of Incheon Seizes $375,000 Worth of Crypto from ‘Tax Dodgers’","category":["Blockchain News "],"content":["South Korea’s Incheon says it has confiscated $375,000 worth of cryptoassets from “tax-evading” residents who tried to hide their earnings in token wallets.","Per the media outlet Newsis, the city collected the combined sum from 298 people.","The media outlet noted that the city “confiscated virtual currencies such as Bitcoin (BTC).”","Citizens will likely be given the choice of paying tax bills and associated fines or seeing their coins liquidated and sold off.","The move is part of an ongoing, region-by-region crackdown on crypto-holding tax “dodgers” involving both central and local tax agencies.","The National Tax Service (NTS) has added a range of new crypto monitoring tools to its arsenal in the past few years, as has the customs service.","Incheon’s tax service also confiscated a range of other assets, including bonds, bank safety deposit boxes, and “hidden financial assets at secondary financial institutions.”","In total, the city raised over $43.6 million from tax evaders living in Incheon in FY 2023.","Kim Sang-gil, Incheon City’s financial planning chief, said:","“In the future, we plan to carry out further, rigid [tax] collection operations against unscrupulous, chronic, and malicious tax evaders. We will continue to add new collection techniques to […] boost the city’s finances and implement tax justice.”","Since 2021, Incheon has launched two dedicated tax evasion-related teams of investigators.","The city has also added a suite of “seven” new high-tech tools to help it detect tax evaders.","These include some crypto-related solutions as Incheon seeks to create a “tighter collection network.”","In September 2022, South Korean tax officials said they had seized a total of $186 million worth of cryptoassets.","In December 2022, tax bodies said they had seized coins from almost 6,000 citizens since the start of the crackdown."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Incheon City","content":"LOCATION"},{"type":"South Korean","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"gil","content":"PERSON"},{"type":"$43.6 million","content":"MONEY"},{"type":"Newsis","content":"PERSON"},{"type":"FY 2023","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"$375,000","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"Incheon","content":"LOCATION"},{"type":"$186 million","content":"MONEY"},{"type":"National Tax Service","content":"ORGANIZATION"}],"hashtag":["South Korea","Tax"],"authors":["Tim Alper"]}