{"summary":"Bitcoin Whales Move $1 Billion Worth of Assets From Coinbase – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-whales-move-1-billion-worth-of-assets-from-coinbase-whats-going-on.htm","publishDate":"2024-02-20T15:36:35","id":18798,"type":null,"title":"Bitcoin Whales Move $1 Billion Worth of Assets From Coinbase – What’s Going On?","category":["Bitcoin News "],"content":["The amount of Bitcoin (BTC) held on Coinbase has plummeted by almost $1 billion worth of assets as whales move their holdings.","New data from on-chain analytics firm CryptoQuant shows a significant amount of assets moved off the cryptocurrency exchange with analysts suggesting many possibilities.","Per the data, Bitcoin whales have earned over 18,000 BTC from the exchange in the past few days, with figures between $45 million and $171 million.","These recent outflows bring Coinbase’s Bitcoin holdings to the lowest point since 2017. This comes as a worrying move for some, but others see positives.","Bitcoin holdings on Coinbase now stand at 394,000 BTC, which is worth approximately $20.5 billion at the time of writing.","Bitcoin enthusiast Kyle Chasse wrote on X (formerly Twitter) that while the amount of Bitcoin on Coinbase is at its lowest point since 2015, the majority of withdrawals were used as liquidity for OTC desks.","🚨BREAKING: #Bitcoin Holdings On Coinbase Reach The Lowest Level Since 2015!","The exchange now has approximately… pic.twitter.com\/gqKFcNO2gw","— Kyle Chassé (@kyle_chasse) February 19, 2024","","In response, X user @DAzaraf shared his opinion on the development, signaling at a possible supply shock.","“Supply shock incoming. There’s no better place to go for an understanding of Bitcoin’s superior supply schedule than the whitepaper. Fortunately, I’ve written Satoshi’s Testament – an explainer that makes the whitepaper accessible to all.","Whale Bitcoin withdrawals from exchanges often suggest bullish sentiment in the broader market. Centralized exchanges have been associated with the sale of digital assets, making outflow signify bullish sentiments.","On the flip side, movements into centralized exchanges have been interpreted to indicate possible sell-offs taking profits or simply bearish sentiments.","However, some analysts say that traders are in fact moving their Bitcoin holdings to a different custodian, suggesting that the number of assets could go much lower. Bulls tend to believe that holders could create a supply shock with the upcoming halving in anticipation of a price surge.","Last week, data from CryptoQuant showed an inflow of Bitcoin from miners’ reserves to centralized exchanges after the approval of spot Bitcoin ETFs.","Exchange inflows hit $1 billion in just over 24 hours, with many analysts pointing to the possible sale of assets to take profits. Others noted that miners could be hedging assets to improve capacity ahead of the next Bitcoin halving.","The Bitcoin price plunged immediately after the Bitcoin ETF approval by the Securities and Exchange Commission (SEC) on Jan 10 before rebounding.","At press time, weekly net inflows into Bitcoin investment products are above $5 billion, and Assets Under Management is at $49.7 billion. Bitcoin recorded massive inflows, taking its valuation to December 2021 highs."],"entity":[{"type":"2015","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Kyle Chasse","content":"PERSON"},{"type":"$49.7 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$20.5 billion","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$45 million","content":"MONEY"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"February 19, 2024","content":"DATE"},{"type":"$171 million","content":"MONEY"},{"type":"Kyle Chassé","content":"PERSON"},{"type":"Assets Under Management","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Bitcoin","centralized exchanges","inflow"],"authors":["David Pokima"]}