{"summary":"San Diego State University researchers uncovered 95,111 scam lists created from 87,617 accounts on X (formerly Twitter) over one year — resulting in estimated financial losses of $870,000.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244588\/twitter-lists-crypto-scams","publishDate":"2023-08-12T07:47:18","id":1880,"type":null,"title":"Twitter Lists crypto scams led to $870k in losses in one year: researchers","category":["Security"],"content":["San Diego State University researchers developed a fully automated scam detection system — dubbed GiveawayScamHunter — that uncovered 95,111 scam lists created from 87,617 accounts on X (formerly Twitter) between June 2022 and June 2023.","Twitter Lists are a function of the social media platform that lets users customize, organize and prioritize the posts they see in their timelines. Users may add other users to lists without permission, and <a href=\"https:\/\/help.twitter.com\/en\/using-twitter\/twitter-lists#:~:text=Twitter%20Lists%20allow%20you%20to,by%20group%2C%20topic%20or%20interest.\" data-v-f87c67ca=\"\">the only way<\/a> to remove oneself from a list is to block the creator — a dynamic that creates a vector for scams.","According to a research paper <a href=\"https:\/\/arxiv.org\/pdf\/2306.10634.pdf\" data-v-f87c67ca=\"\">published<\/a> on Aug 10, \"over 365 victims have been attacked by the [free cryptocurrency giveaway] scam, resulting in an estimated financial loss of $870,000\" — and the problem hasn't been entirely solved. The team concluded that nearly 44% of the spam accounts remained active at the time of the results' writing, though it reported its results and the accounts' information to X.","\"Our work sheds light on the dissemination strategies and behaviors of the scammers on Twitter, as well as the scale of scam victims and financial loss, emphasizing the urgent need to prevent the dissemination of scams on social networks and protect users from falling into such a fraudulent activity,\" the team concluded."],"hashtag":["SOCIAL MEDIA","TWITTER"]}