{"summary":"Crypto Bank Savior New York Community Bancorp Sees 40% Drop in Shares","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-bank-savior-new-york-community-bancorp-sees-40-drop-in-shares.htm","publishDate":"2024-02-01T14:53:07","id":18800,"type":null,"title":"Crypto Bank Savior New York Community Bancorp Sees 40% Drop in Shares","category":["Finance News "],"content":["New York Community Bancorp (NYCB), the savior of failed Signature Bank, has witnessed a sharp decline of 40% in its shares.","The bank’s shares took a hit on Wednesdau after the decision to cut dividend to strengthen its capital and the announcement of an unexpected loss, according to a report by the Financial Times. ","NYCB has been regarded as one of the success stories amidst the regional banking turmoil of 2023 that saw the downfall of Signature Bank, Silicon Valley Bank, and First Republic.","Signature bank was one of the major crypto banks that offered fiat and banking services to crypto startups.","The lender was shut down on March 12, 2023, after depositors withdrew large sums of money on the heels of the collapse of Silicon Valley Bank (SVB).","At the time, NYCB, based in suburban New York, acquired a significant portion of Signature Bank’s assets, including deposits and loans, totaling nearly $13 billion.","This move initially garnered positive investor sentiment, boosting NYCB’s stock prices.","However, the bank’s fourth-quarter results, announced recently, shattered these optimistic expectations.","During the final quarter of 2023, NYCB reported a loss of $260 million, a stark contrast to the $164 million gain in the same period the previous year.","🇺🇸🏦🚨Shares of one of the largest US banks, the New York Community Bancorp collapsed by 37,5%, trading in the bank's securities on New York Stock Exchange has been stopped","This reaction was caused by a sudden loss (-$ 260 million) in latest quarter and a 70% cut in dividends. https:\/\/t.co\/QOINeTqINq pic.twitter.com\/3GsSF4fmnu","— Hawkeye1812Z (@Hawkeye1745) January 31, 2024","","The unexpected loss was primarily attributed to a rise in anticipated loan losses, particularly associated with loans connected to office buildings. Bank executives highlighted the impact of challenging conditions in the office real estate market.","Thomas Cangemi, the CEO of NYCB, explained during an analyst call that the bank had reduced its dividend to comply with banking regulations triggered by the Signature acquisition. ","This acquisition pushed NYCB’s assets over $100 billion, subjecting it to stricter capital requirements.","Consequently, the bank experienced a significant decline in share prices, with a closing drop of 38% and an earlier dip of up to 46%.","The KBW Regional Bank index also saw a decline of 6%, affecting other smaller banks in the sector.","The unexpected losses prompted NYCB to conduct rigorous stress-testing of its commercial real estate loan portfolio, including the portion acquired from Signature Bank.","As a result, the bank revised its estimate of expected losses on office loans, taking into account nationwide weaknesses in the office market and potential shocks from payment and interest rate fluctuations.","Alexander Yokum, an analyst at CFRA, downgraded NYCB’s shares to a “hold” rating, expressing reduced confidence in management’s ability to efficiently integrate recent acquisitions.","“Our diminished view reflects falling confidence in management’s ability to integrate its recent acquisitions in an efficient manner.”","NYCB also reported a decrease of nearly half a percentage point in its net interest margin, attributed to the need to raise additional funds and liquid assets to meet heightened regulatory obligations.","Furthermore, the bank admitted that the integration of the Signature acquisition would likely take longer than initially expected, possibly extending into the next year.","Despite this delay, Cangemi reassured analysts that the acquisition was progressing well and praised the performance of the teams involved."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"KBW Regional Bank","content":"ORGANIZATION"},{"type":"37,5%","content":"PERCENT"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"New York Community Bancorp","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Cangemi","content":"PERSON"},{"type":"January 31, 2024","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Silicon Valley Bank (SVB","content":"ORGANIZATION"},{"type":"final quarter of 2023","content":"DATE"},{"type":"$ 260 million","content":"MONEY"},{"type":"First Republic","content":"ORGANIZATION"},{"type":"Alexander Yokum","content":"PERSON"},{"type":"NYCB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 12, 2023","content":"DATE"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"$260 million","content":"MONEY"},{"type":"46%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"38%","content":"PERCENT"},{"type":"CFRA","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Thomas Cangemi","content":"PERSON"},{"type":"$13 billion","content":"MONEY"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"$164 million","content":"MONEY"}],"hashtag":["Bank","New York"],"authors":["Ruholamin Haqshanas"]}