{"summary":"Cathie Wood Lashes Out at Gary Gensler Over Criticism of Crypto Space after Approving Spot Bitcoin ETFs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cathie-wood-lashes-out-at-gary-gensler-over-criticism-of-crypto-space-after-approving-spot-bitcoin-etfs.htm","publishDate":"2024-01-11T04:27:12","id":18808,"type":null,"title":"Cathie Wood Lashes Out at Gary Gensler Over Criticism of Crypto Space after Approving Spot Bitcoin ETFs","category":["Altcoin News "],"content":["","Ark Invest CEO Cathie Wood has expressed disappointment at the statement made by SEC Chair Gary Gensler shortly after the agency approved a dozen exchange-traded funds (ETFs) that directly hold Bitcoin.","“He just denigrated the whole crypto space. I couldn’t believe it,” she said in an interview with Bloomberg Radio.","Wood said that Gensler’s comments are typical of the resistance faced by disruptive innovations.","Gensler, who has previously expressed his skepticism towards cryptocurrencies, reiterated in a statement that the SEC does not endorse digital assets. ","This statement came after a 3-2 vote by SEC commissioners, including Gensler, in favor of allowing spot Bitcoin ETFs. ","The SEC’s decision was expected following a legal setback in a related case in the previous year.","“While we approved the listing and trading of certain spot Bitcoin ETP shares today, we did not approve or endorse Bitcoin,” Gensler said in his statement.","He also advised investors to remain cautious about the risks associated with Bitcoin and crypto-related products.","Wood criticized Gensler’s stance, describing it as “the old DNA basically bashing the new DNA.” ","She highlighted that there is a significant level of curiosity among many individuals regarding cryptocurrencies. ","Ark’s joint application with 21Shares was among the spot Bitcoin ETFs given the green light by the SEC to begin trading.","The SEC’s decision marks a notable shift in its stance on spot Bitcoin ETFs, which it had opposed for over a decade. ","Wood sees this as the start of a new chapter for Bitcoin and expressed optimism about Ark becoming one of the top providers through the Bitcoin ETF.","However, she acknowledged that institutions will need to navigate the new regulatory framework with caution due to the SEC’s initial hesitancy. ","She emphasized the importance of thorough diligence in this evolving landscape.","In a highly anticipated decision, the SEC announced on Wednesday that it has approved rule changes allowing the creation of Bitcoin ETFs in the United States. ","The SEC’s decision is expected to have far-reaching implications, including the transformation of the Grayscale Bitcoin Trust, which currently holds approximately $29 billion worth of bitcoin, into an ETF. ","Additionally, major issuers like BlackRock’s iShares and Fidelity are preparing to launch their own competing funds, with trading set to commence as early as Thursday.","This approval has the potential to be a groundbreaking development in the wider acceptance of cryptocurrency within mainstream finance. ","The ETF structure offers institutional investors and financial advisors a familiar and regulated avenue to gain exposure to Bitcoin, a digital asset that has experienced both significant growth and skepticism.","The SEC’s decision comes shortly after an official social media account of the regulatory body erroneously announced on Tuesday that Bitcoin ETFs had already been approved. ","The SEC clarified that the account had been compromised, emphasizing the importance of accurate information dissemination."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Bloomberg Radio","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Bitcoin ETP","content":"ORGANIZATION"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$29 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Cathie Wood","Spot ETFs"],"authors":["Ruholamin Haqshanas"]}