{"summary":"Bitcoin and Ethereum Holding Key Supports","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-holding-key-supports-1554.htm","publishDate":"2018-04-11T09:23:00","id":18814,"type":null,"title":"Bitcoin and Ethereum Holding Key Supports","category":["Ethereum News "],"content":["Bitcoin price succeeded in staying above the USD 6,600 support, which is a positive sign. Ethereum is gaining upside momentum and is currently up 5.5% to USD 415. ReddCoin, Golem and Wanchain are trading higher and surged by 31%, 22% and 18% respectivel","After yesterday’s decline, bitcoin and altcoins held the ground and started trading in a range. Later, there was an increase in buying interest, which resulted in an upside reaction in almost all major cryptocurrencies. Among the top five cryptocurrencies, ETH performed very well and gained by more than 5% to trade above the USD 400 resistance.","Bitcoin\nBitcoin price found a strong buying interest around the USD 6,700 level. BTC\/USD is currently trading in a range with a minor bullish angle toward the USD 7,000 level.\nIt is currently up 1.9% to USD 6,850, with an immediate resistance near the USD 7,000 level. A break above the mentioned USD 7,000 level is needed for further gains toward USD 7,200 in the near term.\nOn the downside, the USD 6,700 and USD 6,600 levels are important supports. The price must hold the stated levels to avoid a decline to USD 6,000.","Ethereum\nEthereum performed really well with many bullish signals from the USD 385 low. ETH\/USD soared by more than 5% to break an important resistance at USD 400.\nThe pair is now facing another crucial resistance at USD 420, above which the price could rally towards the USD 450 level. On the downside, the broken resistance at USD 400 may perhaps act as a support if the price corrects lower.","Bitcoin Cash and Ripple\nBitcoin cash is slowly grinding higher from the USD 625 swing low. BCH\/USD is currently testing the USD 650 resistance and it looks set for a push towards the USD 675 level. An initial support sits at USD 630 followed by the USD 625 low.\nRipple is still struggling to settle above USD 0.50. There can be an extended consolidation near the stated USD 0.50 level before XRP\/USD makes the next move in the near term.","Other Altcoins Market Today\nThe past few hours were positive as many altcoins posted solid gains. ReddCoin, Golem, Wanchain, ELF, Bytom, Ontology, Chainlink, Bytecoin and Dogecoin gained more than 10%. The best performer was ReddCoin, which is currently trading 31% higher and broke the USD 0.005 resistance.","Overall, the crypto market is slowly moving back in the green zone. However, a break above the USD 7,000 level in BTC\/USD is needed for an upside acceleration."],"entity":[{"type":"Golem","content":"LOCATION"},{"type":"1.9%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"5.5%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"31%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"18%","content":"PERCENT"},{"type":"Wanchain","content":"LOCATION"},{"type":"Bytom","content":"ORGANIZATION"},{"type":"Ripple\nBitcoin","content":"PERSON"},{"type":"ELF","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin Cash","ChainLink","Dogecoin","Ethereum","Markets","Ripple"],"authors":["Aayush Jindal"]}