{"summary":"Binance Exec Staged Elaborate Escape, May Have Evaded Flights: Nigerian Official","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-exec-may-have-evaded-flights-nigerian-official.htm","publishDate":"2024-04-01T10:50:14","id":18811,"type":null,"title":"Binance Exec Staged Elaborate Escape, May Have Evaded Flights: Nigerian Official","category":["Altcoin News "],"content":["Binance executive Nadeem Anjarwalla absconded from Nigerian custody in February after his arrest. At the time, he was detained along with American colleague Tigran Gambaryan on accusations of misconduct related to the exchange.","In a Sunday interview with a local media outlet, a retired Nigerian official characterized Anjarwalla’s escape as “embarrassing.” He further deemed the incident as indicative of systemic shortcomings within the country’s security personnel.","Dr. Seyi Adetayo, a retired Principal Staff Officer from the Department of State Services, attributed the security lapse to the presence of individuals with potentially fraudulent or criminal intent within the department. He emphasized a critical need to prevent a similar incident from occurring again.","Both the executives were apprehended in Nigeria and had their passports seized during a broader government crackdown on crypto exchanges. They are now seeking legal recourse from two authorities, alleging violations of their fundamental human rights.","Authorities accused Binance of non-compliance with local tax regulations, citing a lack of proper documentation. They also claimed the exchange impeded their ability to collect user taxes. Previously, officials alleged that Anjarwalla used a “smuggled passport” to escape the country. But a family source reportedly countered that his departure was conducted through “lawful means.”","The Office of the National Security Adviser (ONSA) is reportedly collaborating with Interpol to secure an international arrest warrant for Anjarwalla.","Binance didn’t return Cryptonews’ request for comment by press time.","Adetayo elaborated on the escape, characterizing it as a “well-planned operation.” He insisted it was likely financed and coordinated by an intelligence asset based in Nigeria. This asset is believed to be affiliated with either a private contractor or a foreign government intelligence agency. He said it likely aimed to facilitate the executive’s departure from the country.","He suspects that Nigerian security personnel might be susceptible to manipulation through financial incentives or religious influence. Compromising an officer’s loyalty through either method could have facilitated control and ultimately enabled Anjarwalla’s escape, he said.","The retired official also said Anjarwalla may have been taken from custody to a mosque and then transported to the airport.","“I have it on authority that he actually bought the ticket that he flew with at the Nnamdi Azikwe International Airport on that same day,” he said. “For him to make such smooth movement, somebody must have planned it, worked out the details to ensure that the guy passed through the airport using the same name undetected.”","He raised concerns about potential shortcomings in security protocols. He also suggested that Anjarwalla’s name might not have been placed on a departure watchlist. This oversight could have facilitated his escape on a less rigorously monitored airline.","He further criticized the ONSA, suggesting a lapse in its responsibility to ensure secure detention. Even in the absence of a watchlist placement, the official argued that airport personnel should have been informed of the situation and been familiar with Anjarwalla’s identity.","“In the last 10 years, the quality of the personnel we are recruiting into our agencies leaves a lot to be desired,” he said. “Lots of people have found their way into agencies.”"],"entity":[{"type":"Sunday","content":"DATE"},{"type":"ONSA","content":"ORGANIZATION"},{"type":"Seyi Adetayo","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Nnamdi Azikwe International Airport","content":"ORGANIZATION"},{"type":"Interpol","content":"ORGANIZATION"},{"type":"last 10 years","content":"DATE"},{"type":"Anjarwalla","content":"PERSON"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"National Security","content":"ORGANIZATION"},{"type":"Department of State Services","content":"ORGANIZATION"}],"hashtag":["Binance","Crypto Regulations","Nigeria"],"authors":["Shalini Nagarajan"]}