{"summary":"Blocknative, a startup tracking Ethereum mempool, conducted research that counts all transactions across 24 crypto networks \nThe 24 blockchains together have powered over 3.1 billion transactions from 2009 to 2019 \nBlocknative provides APIs for Dapps to display in-app notifications of all pending incoming and outgoing transactions.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56751\/over-3-1-billion-transactions-have-been-processed-across-24-crypto-networks-researchers","publishDate":"2020-02-24T14:25:03","id":1882,"type":null,"title":"Over 3.1 billion transactions have been processed across 24 crypto networks in the past decade: researchers","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">More than 3.1 billion transactions were broadcast across two dozen cryptocurrency networks during the past ten years, a company that tracks the Ethereum transaction mempool has found.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The research, <\/span><a href=\"https:\/\/blog.blocknative.com\/blog\/one-billion-transactions?hs_preview=uvqGqHNh-25763534560\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">conducted<\/span><\/a><span data-v-f87c67ca=\"\"> by San Francisco-based <a href=\"https:\/\/www.blocknative.com\/\" data-v-f87c67ca=\"\">Blocknative<\/a>, shows that the twenty-four blockchains together have facilitated over $4.6 trillion in aggregate transfer value from 2009 to 2019, 96% of which occurred between 2017 to 2019.&nbsp;<\/span>","The public networks surveyed were: Bitcoin, Ethereum, Ripple, Litecoin, EOS, Tron, Stellar, Tether, Ethereum Classic, Bitcoin Cash, Monero, Bitcoin SV, Binance Coin, Dogecoin, Zcash, Verge, Tezos, Decred, Dash, Neo, Waves, DigiByte, Bitcoin Gold and GAS. Those networks were chosen because they have the highest transfer transaction counts, citing CoinMetrics.","According to the published data, there were 259.2 million BTC transactions in 2019 and 242.8 transactions on Ethereum during the same year. There were a total of 1.1 billion transactions across all the surveyed networks during 2019, according to the company.","<span data-v-f87c67ca=\"\">The team also expects Bitcoin and Ethereum to surpass the 1 billion transactions per year threshold in 2023. On a broader scale, they predicted that the group of networks could account for nearly 20 billion transactions over the next five years.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">I recommend taking this forecast with a big grain of salt, as our future probably will not follow any linear growth projection,\"&nbsp;<\/span><span data-v-f87c67ca=\"\">Blocknative CEO Matt Cutler cautioned in the blog post.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, these numbers remain dwarfed by those from traditional finance. For example, Visa <a href=\"https:\/\/s1.q4cdn.com\/050606653\/files\/doc_financials\/2019\/ar\/Visa-Inc.-Fiscal-2019-Annual-Report.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reported<\/a> $8.8 trillion in payments volume for the twelve months ending September 30, 2019.<\/span>","<span data-v-f87c67ca=\"\">\"If we compare it to traditional payment rails, for instance, that there's a huge amount of upside in terms of things that we could do right<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">. <\/span><\/i><span data-v-f87c67ca=\"\">I think it begs the question of where do future transactions come from? So there's all this work happening to increase throughput, but where is that going to come from?\" asked Cutler.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Cutler proposed the so-called \"net new transactions,\" or transactions that couldn’t have happened without blockchains, as one of the major driving forces of the next billion blockchain transactions. As an example, Cutler pointed to <\/span><a href=\"https:\/\/medium.com\/sablier\/introducing-sablier-continuous-payments-on-ethereum-c2bf04446d31\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sablier<\/span><\/a><span data-v-f87c67ca=\"\">, an Ethereum-based Dapp that lets employees receive incremental payments via smart contracts. This payment cadence has previously been difficult to deploy due to the burdens involved.&nbsp;<\/span>","The team at Blocknative was first prompted to conduct such a report because of its business model. The firm&nbsp;<span data-v-f87c67ca=\"\">provides APIs to Ethereum-based projects to track all inbound and outbound transactions before they are confirmed. As such, the team was initially interested in knowing the total transaction volume in the market.&nbsp;<\/span>","\"T<b data-v-f87c67ca=\"\"><\/b>he more transactions that are happening, the more opportunity there is for our infrastructure to track those transactions and add value to them. So we have the question, well, so how many transactions have happened and how many transactions are going to happen,\" said Cutler.&nbsp;","<span data-v-f87c67ca=\"\">Blocknative raised $2 million from Foundry Group in June 2018 and has mostly operated in stealth. Since its inception, the firm has worked with 40 projects, although its service is only limited to Ethereum for now.&nbsp;<\/span>"],"hashtag":["PAYMENTS"]}