{"summary":"Coinbase Boss Says Transaction Fee-based Revenue Model Won’t Work Long-term","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-boss-says-transaction-fee-based-revenue-model-wont-work-long-term.htm","publishDate":"2022-08-24T09:00:00","id":18823,"type":null,"title":"Coinbase Boss Says Transaction Fee-based Revenue Model Won’t Work Long-term","category":["Bitcoin News "],"content":[" ","The crypto exchange giant Coinbase wants to ditch its reliance on transaction fees as its main source of income – and is concerned that the fees that traders pay when they exchange tokens cannot provide a sustainable form of income.","Speaking in an interview with CNBC, the firm’s CEO Brian Armstrong stated:","“We are realizing that trading fees […] [are] still going to be a big part of our business 10 years from now. Even 20 years from now. But I’d like to get to a place where more than 50% of our revenue [comes from] subscriptions and services.”","By “subscriptions and services,” Armstrong was referring to paid Coinbase services, premium membership packages, staking, rewards programs, and the like.","As recent financial results have proved, exchanges like Coinbase rake in eye-watering profits when crypto prices rise, but it tends to get hard when prices stagnate and trading volumes drop.","As such, Coinbase no longer wants to rely so heavily on making hay when the bull market sun shines and toughing it out through prolonged crypto winters. Its CEO claimed that the firm was “investing today so much in subscription and services revenue” and added that “a number” of new services-related products were currently “in the works.”","Armstrong’s wish may be slowly coming true: while trading fee-derived income has taken a battering, Coinbase’s latest quarterly financial report did have a subscription and services-themed silver lining. This part of the firm’s income has grown in size and now represents some 18% of Coinbase’s revenue. Only a year prior, that figure was just 4%.","But the ice-cold winds of crypto winter are not the only threat to Coinbase’s dreams of success. Regulators continue to apply pressure on the company, and a legal battle with the Securities and Exchange Commission (SEC) is still a distinct possibility. The SEC may probe the firm over suspicions that many of the tokens Coinbase lists are securities. If this proves to be the case, Coinbase could find itself on the hook for enabling the sale of such tokens.","But Armstrong put a positive spin on the regulatory issue, stating:","“We’ve been […] engaging with regulators and I actually think it’s a good thing. And our overall goal is really to help drive regulatory clarity on a global scale.”","On the subject of crypto winter, he repeated his mantra that business was “never as good as it seems” and “never as bad as it seems.”","Armstrong concluded:","“I think one of the reasons Coinbase has been so successful in the last 10 years is [that] we try not to get focused on short-term ups and downs.”","Meanwhile, Coinbase has revealed that the payments provider PayPal has joined its Travel Rule compliance platform, the Travel Rule Universal Solution Technology (TRUST) network.","The Travel Rule is the brainchild of the Financial Action Task Force (FATF) and has been enshrined into law in multiple nations. It legally requires exchanges and other crypto intermediaries to relay sender data on high-value, inter-platform transactions.","____","Learn more: \n– Legal Woes: Coinbase Faces New Class Action, IRS Allowed to Investigate SFOX’ Customers, Another Objection in SEC-Ripple War\n– Another Rough Quarter Awaits in Q3, Coinbase Warns After Bruising Financial Results\n\n– Professor Warns SEC That Its Move Against Coinbase Is a ‘Serious Mistake’\n– Coinbase Layoffs ‘Part of a Larger Trend’ In The Crypto Industry\n\n– Spending on US Crypto TV Ads Shrunk From USD 85M to USD 36K in 5 Months – Report\n– 10 Traditional Companies that are Moving into Crypto Despite Market Downturn"],"entity":[{"type":"4%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coinbase Faces New Class Action","content":"ORGANIZATION"},{"type":"Coinbase Warns After Bruising Financial Results\n\n– Professor Warns SEC","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"last 10 years","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"US Crypto TV Ads Shrunk From USD","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Financial Action Task Force (FATF","content":"ORGANIZATION"},{"type":"Crypto Despite Market Downturn","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Coinbase","Exchange","Fees","PayPal","Regulation","Trading"],"authors":["Tim Alper"]}