{"summary":"VanEck Slashes Bitcoin ETF Fees to Zero","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vaneck-slashes-bitcoin-etf-fees-to-zero.htm","publishDate":"2024-03-12T04:44:30","id":18821,"type":null,"title":"VanEck Slashes Bitcoin ETF Fees to Zero","category":["Bitcoin News "],"content":["Global asset manager VanEck has slashed its fees for the HODL exchange-traded fund (ETF), the VanEck Bitcoin Trust, down to zero until March 31 next year.","VanEck posted on the social media platform X, “Because we believe in #bitcoin so much, starting tomorrow, you can invest in VanEck Bitcoin Trust (HODL) with no fees until March 31st, 2025.*","“*During the period commencing on March 12, 2024, and ending on March 31, 2025, the Sponsor will waive the entire Sponsor Fee for the first $1.5 billion of the Trust’s assets. If the Trust’s assets exceed $1.5 billion prior to March 31, 2025, the Sponsor Fee charged on assets over $1.5 billion will be 0.20%. All investors will incur the same Sponsor Fee, which is the weighted average of those fee rates. After March 31, 2025, the Sponsor Fee will be 0.20%.”","In February, VanEck slashed its fees for the HODL down to 0.20% from 0.25% according to a filing submitted to the U.S. Securities and Exchange Commission (SEC).","Around ten spot Bitcoin ETFs are competing for investor attention in a saturated market. BlackRock’s product trading under the ticker symbol “IBIT” is continuing to lead the way. BlackRock’s ETF currently holds 195,985.31272 BTC and charges a 0.25% fee. Since its launch on January 11, the ETF has seen inflows cross $10 billion.","Other issuers, such as ARK Invest, charge 0.21%, and Bitwise charges 0.20%. Spot Bitcoin ETFs are increasingly the go-to choice for mainstream investors. They address issues such as storing crypto assets and dealing with fraudulent service providers.","IMPORTANT UPDATE!","Because we believe in #bitcoin so much, starting tomorrow, you can invest in VanEck Bitcoin Trust (HODL) with no fees until March 31st, 2025.*","*During the period commencing on March 12, 2024, and ending on March 31, 2025, the Sponsor will waive the entire…","— VanEck (@vaneck_us) March 11, 2024","","Bitcoin’s market presence remains formidable, with its price hitting $72,500 on Monday, showcasing a notable 4.50% increase over the past 24 hours, reports Arslan Butt at Cryptonews. This surge brings its market capitalization to a staggering $1.425 trillion, securing its top position in the cryptocurrency arena. Currently, Bitcoin’s circulating supply is at 19,651,543 BTC, edging closer to its 21 million max supply limit.","Several applications have now been submitted for Ethereum exchange-traded funds with the SEC and the decision for approving or denying the products has been pushed back which is in line with analyst expectations.","The SEC now has until May 23 to approve or reject VanEck’s ETF application for an Ethereum ETF tracking the world’s second-largest cryptocurrency.","Many product providers are optimistic about the approval of more crypto products believing it is inevitable the SEC will eventually approve Ethereum ETFs due to the demand."],"entity":[{"type":"0.20%","content":"PERCENT"},{"type":"March 31, 2025","content":"DATE"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"VanEck Bitcoin Trust","content":"ORGANIZATION"},{"type":"January 11","content":"DATE"},{"type":"March 31st, 2025","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$72,500","content":"MONEY"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"May 23","content":"DATE"},{"type":"0.21%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"March 31 next year","content":"DATE"},{"type":"March 12, 2024","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"$1.5 billion","content":"MONEY"},{"type":"VanEck","content":"PERSON"},{"type":"4.50%","content":"PERCENT"},{"type":"ETF","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$1.425 trillion","content":"MONEY"}],"hashtag":["Fees","spot Bitcoin ETF","VanEck"],"authors":["Tanzeel Akhtar"]}