{"summary":"South Korean Customs Service Swoops on Int’l ‘USDT-Gambling Ring’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-customs-service-swoops-on-intl-usdt-gambling-ring.htm","publishDate":"2023-12-06T05:00:43","id":18828,"type":null,"title":"South Korean Customs Service Swoops on Int’l ‘USDT-Gambling Ring’","category":["Altcoin News "],"content":["South Korean law enforcers are continuing to crack down on crypto-powered crime, with customs officials shutting down a suspected international gambling ring that used USDT.","According to the broadcaster KBS, officers arrested seven people in raids, with one remanded in custody.","The Seoul Central District Prosecutors’ Office will now handle the group’s cases.","The seven people were charged with violating the Foreign Exchange Transactions Act.","But two suspected gambling ring members have reportedly fled abroad in a bid to avoid arrest.","Officers said the individual they retained in custody was the group’s unofficial leader. The search continues for the rest of the alleged gang.","The customs service held a press conference where they showed images of some of the items they seized in the raids, including KRW and USD banknotes.","Officers claimed that the ring used social media channels to find “customers” for illegal gambling sites.","The ring allegedly converted the money it received to USDT, amassing over $12 million worth of the USD-pegged stablecoin.","Customs officials said the group paid gamblers their winnings in USDT tokens.","They said the group used an “illegal gambling establishment in the Philippines” to convert fiat to USDT.","The group allegedly worked out of two “secret offices” in Seoul, South Korea, and Bonifacio Global City, near the Philippine capital.","Officers further claimed that the group’s leader “set up multiple shell companies for arbitrage crypto trading.”","Customs officials said the ring also “created fake documents to pretend to pay for imports.” Seoul-based customs officers confiscated “materials related to illegal remittances” and “cash” worth almost $182,000.","South Korean gambling laws are famously strict. Only one brick-and-mortar casino in the country has a license to admit domestic customers.","Authorities have been cracking down on online gambling sites and illegal casinos for over a decade.","Earlier this week, South Korea’s five biggest crypto exchanges said they would join financial regulators to hunt “undeclared crypto operators.”","Last month, police in South Jeolla Province arrested a group of people they suspect of duping 170 “crypto investors” by posing as crypto-issuing robot developers."],"entity":[{"type":"the Philippines","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"$12 million","content":"MONEY"},{"type":"Seoul Central District Prosecutors’ Office","content":"ORGANIZATION"},{"type":"KRW","content":"ORGANIZATION"},{"type":"Bonifacio Global City","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"KBS","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"},{"type":"South Jeolla Province","content":"LOCATION"},{"type":"$182,000","content":"MONEY"}],"hashtag":["Gambling","South Korea"],"authors":["Tim Alper"]}