{"summary":"Many negotiations remain before the new &quot;Anti-Money Laundering Authority&quot; goes live, but all signs are that it&#x27;s on the way. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163556\/the-eu-is-on-the-verge-of-creating-a-new-aml-regulator-that-will-oversee-crypto","publishDate":"2022-08-15T10:57:50","id":1883,"type":null,"title":"The EU is on the verge of creating a new AML regulator that will oversee crypto","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The European Union is poised to create a brand new regulator with direct crypto oversight.<\/span>","<span data-v-f87c67ca=\"\">While the crypto industry’s attention has been on the Markets in Crypto Assets regulation and the controversial <\/span><a href=\"https:\/\/www.theblock.co\/post\/139913\/eu-parliament-aml-law-vote-crypto-wallets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Transfer of Funds Regulation<\/span><\/a><span data-v-f87c67ca=\"\">, these are part of a broader package of EU anti-money laundering (AML) policy that will have major implications for all financial institutions.<\/span>","<span data-v-f87c67ca=\"\">The European Commission <\/span><a href=\"https:\/\/www.europarl.europa.eu\/legislative-train\/theme-an-economy-that-works-for-people\/file-6th-directive-on-amlcft-(amld6)\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> its proposal for the Sixth Directive AML\/CFT, or AMLD6, last July. The European Council released its <\/span><a href=\"https:\/\/data.consilium.europa.eu\/doc\/document\/ST-10507-2022-REV-1\/en\/pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">version<\/span><\/a><span data-v-f87c67ca=\"\"> last month. European Parliament will take it up following the ongoing August vacation. Once it passes its version of the regulation, the three bodies will enter into largely opaque negotiations called trilogues.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Central to the new legislation is the creation of an EU-wide regulator for anti-money laundering. Though the legislative bodies still need to negotiate, there seems to be minimal disagreement that such a regular is needed and that it should have direct oversight over crypto asset service providers in the EU.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the past, European Parliament has been the most aggressive of the three bodies in terms of calling for regulation of cryptocurrency. As such, the body is especially unlikely to oppose giving the future regulator direct supervision over crypto.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Dubbed “Anti-Money Laundering Authority,” or “AMLA,” the regulator will monitor at least “high-risk” crypto firms as financial servicers directly, per the Commission and Counsel versions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A parliamentary briefing shared with The Block describes the new system as follows:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“EU-level supervision consisting of a hub and spoke model – i.e. supervisor at the EU level competent for direct supervision of certain financial institutions (FIs), indirect <\/span><span data-v-f87c67ca=\"\">supervision\/coordination of the other FIs, and a coordination role for supervising the <\/span><span data-v-f87c67ca=\"\">non-financial sector as a first step.”<\/span>","<span data-v-f87c67ca=\"\">The international body will be a major shift for the EU. Previous AML directives — especially four and five, from 2015 and 2018 — established standards for member nations to collect and make available certain data, like information about beneficial ownership of corporations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Those registries are a good example of the disparate adoption of the regulations. Even among the countries that provide access to corporate information for free — which is far from all — the information available varies widely. The chart below illustrates the various kinds of information of this sort that nations make available.<\/span>","","","<span data-v-f87c67ca=\"\">Source: <\/span><a href=\"https:\/\/medium.com\/transparent-data-eng\/european-business-registers-comparison-of-registry-data-on-foreign-companies-3dda4d32061c#:~:text=The%20countries%20that%20provide%20the,%2C%20Czechia%2C%20Poland%20and%20UK.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Transparent Data<\/span><\/a><span data-v-f87c67ca=\"\"> as of 2021<\/span>","<span data-v-f87c67ca=\"\">Indeed, the opacity behind certain corporate registries allowed crypto firms like Binance to <\/span><a href=\"https:\/\/www.theblock.co\/linked\/56603\/binance-is-not-authorised-to-operate-in-malta-says-the-countrys-financial-regulator\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tout Maltese regulation for years<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">AMLD5 established that member states should treat crypto exchanges as financial institutions. But that implementation was left up to the member states. There is recourse for the EU bodies to pursue member states, but the overall reporting requirements don’t lead to a union body.<\/span>","<span data-v-f87c67ca=\"\">“If [a member] does not implement it properly, then the European Commission has the right to bring, say, Malta to the European court of justice. But another way, which is what they are trying to do, is to harmonize it through an EU regulation,” explained Tomasz Krawczyk, a director at Teneo and former official who was part of the negotiations behind AMLD4.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The timeframe for implementation will hinge upon negotiations among European Parliament as well as subsequent trilogues involving the commission. Implementation of the regulation — including staffing of AMLA —&nbsp; will take years. But there seems to be little doubt that such a regulator is indeed coming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s critical to ensure that the AMLA will have sufficiently skilled staff that can deal with state-of-the-art technologies required for interacting with decentralised networks,” the EU Crypto Initiative, a trade association, said in a message to The Block.<\/span>","<span data-v-f87c67ca=\"\">Paul Tang, a member of the European Parliament for the Netherlands and the bill’s rapporteur, did not return a request for comment as of press time.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"EU Crypto Initiative","content":"ORGANIZATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Transparent Data","content":"ORGANIZATION"},{"type":"the Netherlands","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Anti-Money Laundering Authority","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Sixth Directive AML","content":"ORGANIZATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Tomasz Krawczyk","content":"PERSON"},{"type":"Paul Tang","content":"PERSON"},{"type":"Malta","content":"LOCATION"},{"type":"European Council","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"AMLA","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Kollen Post","The Block"]}