{"summary":"290,000 S Korean Public Sector Employees Forced to Declare Crypto Holdings","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/290000-s-korean-public-sector-employees-forced-to-declare-crypto-holdings.htm","publishDate":"2024-01-03T03:00:33","id":18848,"type":null,"title":"290,000 S Korean Public Sector Employees Forced to Declare Crypto Holdings","category":["Blockchain News "],"content":["Around 290,000 South Korean public sector workers will be forced to declare their crypto holdings starting from February.","Per Maeil Kyungjae, the Ministry of Personnel Management has declared that the rule will also apply to employees’ spouses and next of kin.","The development follows a recent ministry announcement that high-ranking public officials will be required to disclose their crypto holdings starting this year.","The decrees are a direct response to the ongoing Coin Gate political scandal.","The scandal centered around a leading lawmaker on a crypto-related parliamentarily committee who allegedly traded coins using insider information.","The ministry claimed it wants to highlight possible conflicts of interest and boost integrity in the public sector.","Other public officials, including lawmakers, were told they must make public crypto declarations last year.","Staff at financial regulators have also been told they must declare their coin holdings and refrain from trading crypto.","The media outlet reported that central and local government officials, as well as “civil servants ranked level four and above,” must report their crypto holdings.","South Korea’s civil service operates a nine-grade system, whereby grade nine (entry) is the lowest and grade one is the highest.","The list includes high-ranking police, fire service, and customs officials.","Land registrars and tax officers will also need to report their crypto holdings.","Public sector workers must also disclose precious metals, stocks, cash, antiques, and real estate holdings.","However, while workers only need to declare such items if they exceed thresholds worth $4,000 to $8,000, this will not be the case for crypto. The media outlet wrote:","“All virtual assets held, regardless of amount or quantity, must be reported.”","🇰🇷 South Korean Exchange Searches for ‘Lost’ Owners of $206M Worth of Crypto","The South Korean crypto exchange Bithumb wants to find the “dormant” owners of $206 million worth of coins, including #Bitcoin, #Ethereum, and #XRP.#CryptoNewshttps:\/\/t.co\/lfLfubkD6t","— Cryptonews.com (@cryptonews) January 1, 2024","","The government will use the data it collects to create a publicly accessible, searchable database.","Citizens will be able to use this database to check on public sector workers’ crypto holdings.","Failure to make correct declarations could result in fines, dismissal, or disciplinary action, the ministry concluded."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"$8,000","content":"MONEY"},{"type":"the Ministry of Personnel Management","content":"ORGANIZATION"},{"type":"Maeil Kyungjae","content":"PERSON"},{"type":"Worth of Crypto","content":"ORGANIZATION"},{"type":"$4,000","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"January 1, 2024","content":"DATE"},{"type":"$206 million","content":"MONEY"},{"type":"$206M","content":"MONEY"}],"hashtag":["Crypto Regulation","South Korea"],"authors":["Tim Alper"]}