{"summary":"EigenLayer to Airdrop 28M More EIGEN After First Airdrop Hits Backlash","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/eigenlayer-to-airdrop-28m-more-eigen-after-backlash.htm","publishDate":"2024-05-03T12:02:45","id":18841,"type":null,"title":"EigenLayer to Airdrop 28M More EIGEN After First Airdrop Hits Backlash","category":["Altcoin News "],"content":["Restaking protocol EigenLayer is handing out an extra 100 EIGEN to 280,000 qualifying wallet addresses after criticism over its first airdrop.","On April 29th, EigenLayer announced it would allocate 15% of its total supply to the community, but some users deemed several provisions of its airdrop program as restrictive.","On May 2nd, The Eigen Foundation announced that users who interacted with the protocol before April 29th would receive an additional airdrop, including the original airdrop claimants.","Updates on the EIGEN Stakedrop pic.twitter.com\/1cwSForJnx","— Eigen Foundation (@eigenfoundation) May 2, 2024","","In a follow-up blog post, Eigen clarified that initial “season 1” claimants are set to receive a minimum of 110 EIGEN. However, the second wave of “season 2” claimants who interacted with the protocol between March 15th and April 29 will receive a minimum of 100 EIGEN","This April 29th cut-off point was an effort to prevent industry-grade Sybil farms from abusing the protocol. Hence, stopping these fake accounts from influencing or disrupting the community.","Users who felt left out of the first airdrop slammed EigenLayer’s “stakedrop” program on April 30th. A program that allowed users to stake airdropped tokens secure data availability store (EigenDA) and future Actively Validated Services (AVAs).","The bulk of the first airdrop’s backlash was due to EIGEN’s nontransferable token structure, a smaller-than-expected 15% community allocation, and “aggressive” geo-blocking and anti-VPN measures.","These measures saw users from 30 countries, including the United States, Canada, China, and Russia, barred from participating in the airdrop.","EigenLayer shared that it would look to include more of its test net users that may have been omitted from the airdrop. They wrote:","“Missed testnet user allocations will be updated as part of Phase 2 of Season 1. We will provide more details in the coming weeks” ","In its first airdrop announcement, the Eigen Foundation stated that users could claim their tokens on May 10th. However, these tokens are non-transferable until an undisclosed date","According to EigenLayer, This control was put in place to ensure that key features, including payments and slashing parameters, were “well established” before EIGEN became transferable among users.","It said private investors and team members would be subject to a full one-year lock-up after the token became transferable to the community.","“After that, they will unlock at 4% per month and finish fully unlocking three years after transferability. This ensures that the users of the protocol get transfer powers well before any core contributors can.”","Another cause for concern is EigenLayer’s shaky tokenomic structure. Only 45% of its total supply is distributed to the community, with 15% being made accessible with airdrops.","","Something that has disincentivized users, seeing minimal eigen returns compared to the Ethereum they have devoted to staking. Although, Eigen has made it clear this was intentional, saying:","“This disincentivization was a key rationale for the original Sybil-neutral distribution, but the feedback we got from real users weighed heavily on this revision!”","Regardless of their reasoning, it remains a source of concern for users, leaving a bad taste in their mouths. The lack of rewards for early supporters in EigenLayer may reflect the strength of their community. A valuable asset that has garnered investments and put Eigen in the position it is in today.","Even before tokens have entered circulation EIGEN perpetual futures contracts are currently trading for $10 on the derivatives market, per Aevo data. This places the latest airdrop at a valuation of $280 million.","This price of EIGEN could change significantly before the token’s official distribution event on May 10."],"entity":[{"type":"Eigen","content":"PERSON"},{"type":"May 2, 2024","content":"DATE"},{"type":"Canada","content":"LOCATION"},{"type":"April 29th","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$10","content":"MONEY"},{"type":"May 10th","content":"DATE"},{"type":"March 15th","content":"DATE"},{"type":"Actively Validated Services","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"EIGEN","content":"PERSON"},{"type":"April 30th","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Eigen Foundation","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"$280 million","content":"MONEY"},{"type":"The Eigen Foundation","content":"ORGANIZATION"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"Sybil","content":"PERSON"},{"type":"EIGEN Stakedrop","content":"ORGANIZATION"},{"type":"May 2nd","content":"DATE"},{"type":"May 10","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"EIGEN","content":"ORGANIZATION"}],"hashtag":["Airdrop","eigenlayer","Staking"],"authors":["Harvey Hunter"]}