{"summary":"CryptoQuant Projects $56,000 as Next Target For Bitcoin Price Following ETF Inflows","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cryptoquant-projects-56000-as-next-target-for-bitcoin-price-following-etf-inflows.htm","publishDate":"2024-02-15T19:20:31","id":18851,"type":null,"title":"CryptoQuant Projects $56,000 as Next Target For Bitcoin Price Following ETF Inflows","category":["News "],"content":["CryptoQuant analysts expect Bitcoin (BTC) to soar above $56,000 as its next significant price level after moving past $50,000.","New market research from on-chain analytics firm CryptoQuant shows massive inflows into the digital asset market in the past weeks as institutional investor confidence surged.","This year, institutional inflows were recorded around the market leader, Bitcoin with its price and investor funds hitting levels not seen in months.","As the bullish trend continues, CryptoQuant noted that the next point for BTC should be breaching the $56,000 price leveraging on the sentiment.","From a network valuation perspective, the next point is $56,000 which becomes another milestone for the asset and the wider market.","“The next price target for Bitcoin stands at $56,000 from a network valuation perspective. Valuation indicators are not flashing risks of a meaningful price correction as of Wednesday.” ","CryptoQuant analysts see ETFs as having a huge impact on the asset price adding that 75% of new investment into the market flow toward ETFs.","“We estimate over 75% Of new investments into Bitcoin are coming from these ETFs. Moreover, investments from these ETFs have increased to 2% of the total historical investments in Bitcoin in just one month as measured by the realized market capitalization.” ","A recent CoinShares Digital Asset Funds Weekly Flow report shows huge investment pouring into Bitcoin as the asset dominates 98% of inflows.","In the past week, over $1 billion trickled into investment funds on the back of newly approved ETFs. Aside from investment, spot Bitcoin ETFs have resulted in miners moving assets to centralized exchanges. Most miners are hedging assets for major capacity upgrades ahead of the next halving.","Crypto commentators point to the approval of spot Bitcoin ETFs by the Securities and Exchange Commission (SEC) as the reason for the price surge.","Last year, the market recorded high institutional inflow from the second quarter following BlackRock’s spot ETF application.","This led to a plethora of traditional firms seeking a piece of the leading to more applications and drawing speculations from industry analysts.","Notably, the price of Bitcoin traded below 55% of its value in 2022. This was due to industry collapses and macroeconomic factors before tapping $31,000 in Q2 3023.","BTC notched steady inflows and rose to $43,000 in December. This came on the heels of an imminent approval with analysts predicting huge inflows once ETFs go live.","Weeks after the approval, the price of the asset stands at $52,414. Bitcoin recorded a 15% price growth in the last seven days as the wider market cap soars above $1.9 trillion.","The market cap of Bitcoin is above the $1 trillion mark with inflows from newly approved ETFs surging in the United States. Bitcoin’s price crossed $50,000 for the first time since December 2021."],"entity":[{"type":"$52,414","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"$50,000","content":"MONEY"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$1.9 trillion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"$1 trillion","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"$43,000","content":"MONEY"},{"type":"$56,000","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"past week","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"CoinShares Digital Asset Funds Weekly Flow","content":"ORGANIZATION"},{"type":"$31,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","CryptoQuant","ETF"],"authors":["David Pokima"]}