{"summary":"Bitcoin Price Below $80,000 At Halving Could Trigger Miner Losses – Fidelity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-below-80000-at-halving-could-trigger-miner-losses-fidelity.htm","publishDate":"2024-02-16T10:30:37","id":18852,"type":null,"title":"Bitcoin Price Below $80,000 At Halving Could Trigger Miner Losses – Fidelity","category":["Bitcoin News "],"content":["Fidelity Digital Assets speculates losses for some miners if the Bitcoin price remains under $80,000 after the upcoming halving in April.","The company released its 2024 market outlook, highlighting the growth recorded so far in Bitcoin, the state of miners, and possible perspectives for the near future.","Bullish narratives have been on the rise in the past several months, as Latin American adoption is growing and the US SEC approved spot Bitcoin ETFs.","However, analysts at Fidelity suggest possible miner losses if the Bitcoin price does not soar over $80,000. The next halving expected in April will see block rewards reduced by 50%, resulting in a slash in revenues.","Still, since halvings are associated with bullish momentum around the cycle, the price of the asset is expected to soar post-halving to cover losses.","Bitcoin miners faced a turbulent season leading up to the halving year before the recent price surge. The 2022 bear market occasioned a 55% price drop that took miners underwater.","The winter led to miners selling their Bitcoin reserves, pivoting to Artificial Intelligence (AI) computing, and selling equipment to stay afloat.","In a turn of events, the institutional inflows recorded in Q2 2023 on the heels of an imminent spot BTC ETF approval led to price upticks.","Miners moved back into the green zone and are hedging assets to build capacity for the upcoming reward slash.","At present prices above $45,000, miner revenues are at $40 million, up $10 million on average. However, for present profits to remain, the Bitcoin price needs to soar to $80,000. This will maintain the status quo after the halving, preventing selling pressures from miners.","","Per Fidelity:","“In a scenario where the price does not rise to $80,000 before the halving, some miners will inevitably be mining at a loss. The mining industry is accustomed to small margins because the difficulty adjustment tends to act as a governor on margins, keeping the cost of production close to the spot price, absent of any large price movements.”","Although spot Bitcoin approvals have sparked bullish momentum, it is not the only driving force for miners.","The rise of Bitcoin Ordinals, despite the initial backlash, created a new revenue base for miners to hasten recovery.","Fidelity Digital suggests that 2024 will see more interest in Ordinals effectively elevating miner fees. Analysts added that Ordinals present a net positive for the network.","The issue of blockchain congestion remains in the spotlight because of the mempool clog last year that significantly increased transaction fees. While heightened activity is good for miners and transaction rates, critics cite its potential to hike rates.","“While its use case for transferring digital art or text may not sustain interest over the longer term, the technology itself presents new capabilities that were not previously thought possible. The additional fee revenue is most likely a welcome sight to miners as well.”",""],"entity":[{"type":"2022","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$80,000","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Q2 2023","content":"DATE"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"$45,000","content":"MONEY"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Bitcoin Ordinals","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Halving","Miners"],"authors":["David Pokima"]}