{"summary":"Pandora’s ERC-404 Standard Grabs Crypto World’s Attention + More NFT News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pandora-experimental-erc-404-standard-grabs-crypto-worlds-attention-more-nft-news.htm","publishDate":"2024-02-08T12:17:09","id":18860,"type":null,"title":"Pandora’s ERC-404 Standard Grabs Crypto World’s Attention + More NFT News","category":["NFT News "],"content":["The non-fungible token (NFT) market has seen a significant recovery over the past day.","The sales volume is up 31% to $42,969,376.","Meanwhile, buyers are down less than 1%, sellers 15% and transactions 8%.","All top 10 collections by sales volume have seen an increase in the last 24 hours, per CryptoSlam.","Pandora kept the first spot, with a volume of $14,706,818.","The best performer among the ten is PXNKAP3, with 851% to $661,791. CryptoPunks follow it with a rise of 268% to $1,151,943.","When it comes to blockchains, Solana has kept falling over the past day. It currently sits at the 10th spot per daily sales volume at just $280,062. This is down from the 2nd spot and over $7 million in a matter of days. It follows a five-hour blockchain outage on February 6.","In today’s NFT news: the crypto world is abuzz with news of an experimental ‘token+NFT’ standard, the Quantum Cats collation sells out, and X2Y2 Pro platform joins the game-optimized Oasys.","The Pandora project went live on February 2. It launched a new, experimental token standard named ERC-404.","The new standard combines the popular ERC-20 (token standard) and ERC-720 (NFT standard). It is open-sourced for creators and developers.","Per GitHub, ERC-404 is an experimental, mixed ERC20 \/ ERC721 implementation with native liquidity and fractionalization. “While these two standards are not designed to be mixed, this implementation strives to do so in as robust a manner as possible while minimizing tradeoffs,” the team said.","As a collection, Pandora comprises 10,000 so-called Replicants enabled by ERC-404. Replicants are generative avatars. Each is attached to a PANDORA token.","7\/","When a Pandora ERC404 is sold or transferred, it’s corresponding replicant is destroyed and a new one is generated in it’s place.","— Pandora (@Pandora_ERC404) February 2, 2024","","There are 5,318 Replicants on the OpenSea marketplace. The lowest price is currently 11 ETH, and the highest is 100 ETH.","As for the token, the team said that PANDORA is the first token built on the ERC-404 standard. The price of PANDORA is currently $24,626, up 135.% over the past 24 hours.","Pandora stresses that the standard is “entirely experimental and unaudited,” though they completed some testing. It later stated that an independent audit is underway.","All that said, many people still have questions about the project’s specifics, while some question the very existence of ERC-404.","erc-404 doesn't exist, stop picking a random number out of thin air https:\/\/t.co\/GK0OssDxUg","— ً (@lightclients) February 6, 2024","","Meanwhile, other collections have also started experimenting with the new standard.","Number 2 on a seemingly endless list of airdrops for Pandora holders is @FroggyFriendNFT 🐸","Excited to see more established ERC721 collections build with ERC404. 2% of the collection will be airdropped to our holders 🤍 https:\/\/t.co\/0wis2j8P2M","— Pandora (@Pandora_ERC404) February 7, 2024","","The first of many 🤝@rugged_dot_art is an experiment deployed by the team at @floorprotocol, a protocol that was early to exploring NFT liquidity solutions for ERC721s.","We're extremely excited that they're excited about ERC404. Bullish on real, experienced teams. https:\/\/t.co\/PkWpFJ0JHn","— Pandora (@Pandora_ERC404) February 7, 2024","","The team also announced a partnership with Vector Reserve.","Our inbox is on fire but we're doing our best to get back to all of the projects that are building with ERC404 without losing focus on delivering value to our holders.","If your project is planning an airdrop or any incentives for Pandora holders please make sure to let us know!","— Pandora (@Pandora_ERC404) February 7, 2024","","In other NFT news, the anticipated Taproot Wizards’ Bitcoin Ordinals NFT sale has finished without a hitch.","The team distributed Quantum Cats collection pieces to wallets, it said on February 6. It added that some cats may be available for “adoption” on the Magic Eden marketplace.","you might be able to find some Quantum Cats available for adoption on magic eden: https:\/\/t.co\/E2Gk2PiWTh","🚨🚨🚨 remember: your cat might EVOLVE at any moment. 🚨🚨🚨","if you list your cat, someone might snag it when it evolves, before you have a chance to react 🐱","— Quantum Cats (@QuantumCatsXYZ) February 6, 2024","","Furthermore, they refunded 19.3 BTC that were overpaid during the mint. These are the funds that were sent beyond users’ whitelist allocations or beyond 3,000 cats in the public phase.","Quantum Cats whitelist mint went live on February 5. At that point, 2,687 cats were minted.","On February 6, the team announced that the Quantum Cats had sold out, stating that the remaining 313 cats sold out within just 2 seconds of the public mint.","the Quantum Cats have sold out!","313 cats sold out within 2 seconds during the public mint!","distribution of the cats to wallets is planned for tomorrow, alongside refunds for any overpayment.","thank you for your incredible support this past few weeks 🧡","GMEOW pic.twitter.com\/mo0SXrNT8x","— Quantum Cats (@QuantumCatsXYZ) February 5, 2024","","Currently, Quantum Cats total volume is 299.7843 BTC ($13.4 million). The floor price is 0.299 BTC, while the most expensive pieces cost is 69.69 BTC each. There are 2,700 owners in total.","The multi-chain NFT platform X2Y2 Pro has joined the ecosystem of the game-optimized blockchain Oasys.","According to the announcement, X2Y2 Pro will now be integrated into the gaming-centric, EVM-compatible blockchain, particularly its Layer-2 Verses:","The announcement explained that Oasys’ Verse layers are similar to blockchain layers, #offering game developers versatile platforms for building.”","Furthermore, X2Y2 Pro will soon be integrated into Oasys’ Layer-1 Hub-Layer, described as an EVM sidechain for gaming.","📢The #NFT Marketplace @x2y2_pro integrates with three Verses on #Oasys!","✅GESO Verse\n✅DM2 Verse\n✅HOME Verse","With plans to support the Hub Layer and all Verses soon 🔥","With the backing of a global #NFTMarketplace, even more users can enjoy #BlockchainGaming on Oasys 🎮… pic.twitter.com\/UXbjAO6RB4","— Oasys | Blockchain for Games (@oasys_games) February 6, 2024","","The integration into the Verses will bring “numerous advantages” to gamers and developers, the teams said. The former gain enhanced capabilities to trade and lend in-game NFTs. The latter can leverage X2Y2 Pro to create more engaging and dynamic economies.","💥 X2Y2 PRO x OASYS 💥","We are thrilled to announce the release of X2Y2 Pro on OASYS!","We are beyond excited to join the fast growing @oasys_games ecosystem and look forward to helping shape a future where more users enjoy blockchain games & the potential of NFTs expand! pic.twitter.com\/Jig7ohGV54","— X2Y2 (@the_x2y2) February 6, 2024","",""],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"February 6, 2024","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"OASYS","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"851%","content":"PERCENT"},{"type":"Taproot Wizards’ Bitcoin Ordinals NFT","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$14,706,818","content":"MONEY"},{"type":"$13.4 million","content":"MONEY"},{"type":"$42,969,376","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$24,626","content":"MONEY"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"$1,151,943","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"February 2, 2024","content":"DATE"},{"type":"$661,791","content":"MONEY"},{"type":"February 7, 2024","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"31%","content":"PERCENT"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"$280,062","content":"MONEY"},{"type":"February 5, 2024","content":"DATE"},{"type":"268%","content":"PERCENT"},{"type":"GESO Verse\n✅DM2 Verse\n✅HOME Verse","content":"ORGANIZATION"},{"type":"ERC","content":"ORGANIZATION"},{"type":"February 5","content":"DATE"},{"type":"February 6","content":"DATE"},{"type":"February 2","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"PANDORA","content":"ORGANIZATION"},{"type":"Pandora ERC404","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Vector Reserve","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Ethereum","NFT"],"authors":["Sead Fadilpašić"]}