{"summary":"Telef贸nica Partners with Chainlink to Enhance Web3 Security Through GSMA Open Gateway","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/telefonica-partners-with-chainlink-to-enhance-web3-security-through-gsma-open-gateway.htm","publishDate":"2024-02-15T16:16:46","id":18865,"type":null,"title":"Telef贸nica Partners with Chainlink to Enhance Web3 Security Through GSMA Open Gateway","category":["Blockchain News "],"content":["Spanish Telco company Telefonica has announced a partnership with Chainlink to provide secure connections for web3 smart contracts.","In a recent press release, the company highlighted plans focused on GSMA Open Gateway API security with blockchain technology at the forefront.","According to the release, the partnership will secure the operations of telecommunications networks to connect any API to Polygon’s network.","“This collaboration marks a significant step in integrating Telco capabilities into the blockchain industry and demonstrates the need for secure oracle networks to deliver real-world data on-chain. This interconnected ecosystem enhances the functionality and security of Web3 applications, contributing to a more robust and verifiable digital landscape.”","Consequently, as the Telecom world moves towards increased GSMA integration in order to boost developer tools to deploy services for a range of networks, security becomes paramount.","In the digital transformation era, the Web3 ecosystem has recorded significant changes in recent months, placing efficiency and security as critical developments.","Chainlink oracles that connect blockchain data to real-world data, resulting in fully automated decisions, can be utilized by telcos to prevent fraud and secure accounts.","Telefonica highlighted Sim Swap APIs as a significant benefit of the partnership, especially as developers trust leveraging APIs to offer diverse services.","The Sim Swap APIs check and confirm the last time a mobile number was used in fraud cases and consequently helps protect accounts.","Chainlink’s Functions come into play by offering trusted avenues to verify data from various sources without compromising performance. Combining both companies’ systems will boost security in all stages of data verification.","Therefore, allowing smart contracts to seek information from APIs solves the trust problem. This also ensures that a user’s SIM card has not changed significantly.","The partnership with Chainlink addresses two-factor authentication (2FA) issues in Web3 and decentralized finance (DeFi) ecosystems.","The Telefonica and Chainlink partnership is tipped to empower developers as the ecosystem expands and asset adoption grows.","According to the statement, developers can improve the ecosystem through proper verification systems with new connectivity platforms.","If infamous incidents can be significantly reduced in Web3, adoption will grow with more traditional finance firms entering the scene.","In recent months, security threats have plagued several blockchain projects, portraying the industry in a bad light. This has led to a slowdown in the adoption of blockchain technology by TradFi companies.","Ensuring security will reduce regulatory bottlenecks in the sector and open developers to more markets. Johann Eid, the Chief Business Officer of Chainlink Labs, noted the focus on security is key for the entire ecosystem:","Bringing Telef贸nica’s OpenGateway APIs on-chain with Chainlink Functions unlocks novel use cases and greater security for our industry that ultimately better protect users and their assets. We’re excited to bring Chainlink and major telecoms like Telef贸nica together to further the vision of a verifiable web where users remain in control.",""],"entity":[{"type":"Johann Eid","content":"PERSON"},{"type":"GSMA Open Gateway API","content":"ORGANIZATION"},{"type":"Telefonica","content":"ORGANIZATION"},{"type":"Telecom","content":"ORGANIZATION"}],"hashtag":["ChainLink","Security","Telefonia"],"authors":["David Pokima"]}