{"summary":"$46.86 Million Stolen in Crypto From Scams in February: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/46-86-million-stolen-in-crypto-from-scams-in-february-report.htm","publishDate":"2024-03-11T11:21:37","id":18866,"type":null,"title":"$46.86 Million Stolen in Crypto From Scams in February: Report","category":["Altcoin News "],"content":["Web3 anti-scam solution company Scam Sniffer reported that February 2024 saw a staggering $46.86 million loss in cryptos to scams.","Per the findings, a total of over 57,000 victims fell prey to various phishing scams. “Compared to January, the number of victims who lost over $1 million decreased by 75%,” it said.","🚨 [1\/6] ScamSniffer's February Phishing Report\nIn February, about 57,000 victims lost approximately $47 million to crypto phishing scams.\nCompared to January, the number of victims who lost over $1 million decreased by 75%. pic.twitter.com\/UgZk0K91lH","— Scam Sniffer | Web3 Anti-Scam (@realScamSniffer) March 10, 2024","","Among the thefts, Ethereum mainnet accounts for more than $36.2 million, which is 78% of the total exploits throughout February. Also, Ethereum blockchain users comprise the maximum among total victims, amounting to 25,029 individuals.","Notably, February recorded 75% decrease in total number of victims who lost over $1 million, when compared to January, 2024. The trend, however, showed that more than $6.2 million in digital assets were lost in single day – February 15.","Furthermore, Scam Sniffer highlighted that Ethereum-based ERC token bore the brunt with $40 million of the stolen assets. This represented 86% of the total stolen assets.","“Most of the thefts of all ERC20 tokens were due to assets being stolen as a result of signing phishing signatures such as Permit, IncreaseAllowance, and Uniswap Permit2.”","🧵 [3\/6] Most of the thefts of all ERC20 tokens were due to assets being stolen as a result of signing phishing signatures such as Permit, IncreaseAllowance, and Uniswap Permit2. pic.twitter.com\/O5UvmSEUTT","— Scam Sniffer | Web3 Anti-Scam (@realScamSniffer) March 10, 2024","","Another latest crypto loss report from Immunefi noted that “Ethereum suffered the most individual attacks, with 12 incidents representing 85.71% of the total losses across targeted chains.”","As reported earlier by Cryptonews.com, web3 gaming platform PlayDapp suffered a major security breach on February 10. The scam resulted in cumulative losses exceeding $290 million.","The exploit seemed to have a private-key leak, resulting in the unauthorized issue of PLA tokens, PlayDapp confirmed the hack.","Another significant losses in February was due to the infamous crypto heist on the decentralized exchange FixedFloat. The hack resulted in the loss of 409 Bitcoin (valued at approximately $21.3 million) and 1700 ETH (worth around $4.9 million).","FixedFloat told Cryptonews that the attack was not internal and attributed it instead to “flaws” and “insufficient protection” in the exchange’s infrastructure."],"entity":[{"type":"February 15","content":"DATE"},{"type":"$290 million","content":"MONEY"},{"type":"February 10","content":"DATE"},{"type":"January, 2024","content":"DATE"},{"type":"$36.2 million","content":"MONEY"},{"type":"$40 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"$6.2 million","content":"MONEY"},{"type":"86%","content":"PERCENT"},{"type":"February 2024","content":"DATE"},{"type":"78%","content":"PERCENT"},{"type":"PLA","content":"ORGANIZATION"},{"type":"85.71%","content":"PERCENT"},{"type":"1700","content":"DATE"},{"type":"$21.3 million","content":"MONEY"},{"type":"Uniswap Permit2","content":"ORGANIZATION"},{"type":"$46.86 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$4.9 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"$47 million","content":"MONEY"},{"type":"March 10, 2024","content":"DATE"}],"hashtag":["crypto scam","ERC20","Ethereum"],"authors":["Sujha Sundararajan"]}