{"summary":"“AirBnB for Computers” Announces the Big Step","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/airbnb-for-computers-announces-the-big-step-1553.htm","publishDate":"2018-04-11T09:59:00","id":18867,"type":null,"title":"“AirBnB for Computers” Announces the Big Step","category":["Ethereum News "],"content":["“AirBnB for computers”, one of the earliest Initial Coin Offerings (ICOs), the Golem Project after two years of development announced yesterday that the “big step,” aka the mainnet launch, is here.","“From being one of the first crowdfunded projects, way past the challenges we had to face while navigating the uncharted territory that is building Golem, the time has come to take the big step: mainnet launch is here,” the company said in a blog post.","The main feature of the new release is the support for the Ethereum mainnet, it added.","“You can now connect Golem to the Ethereum mainnet and earn\/spend real GNT for computations,” the company explained.","While the mainnet launch is always one of the biggest step such a startup can make in early stages to show that they have a more or less working product, the question of why the public should care about this one imposes itself almost naturally.","Golem enables users and applications (requestors) to rent out cycles of other users’ (providers) machines. Any user ranging from a single PC owner to a large data center can share resources through Golem and get paid in GNT (Golem Network Tokens) by requestors. “A decentralized network powering true cloud computing,” adds their short description on Medium.","Today, such resources are supplied by centralized cloud providers which, are constrained by closed networks, proprietary payment systems, and hard-coded provisioning operations – and, well, by the fact that they are centralized, bringing to light a myriad possible problems. One of the greatest issues is the erosion of trust in the past few years, reinforced by scandals such as the Facebook privacy issue, for example.","The question of the importance of their mainnet launch has a simple answer: in their announcement, they explain, “Our decision is based on the fact that even though this new stage will expose our project to diverse risks, it is not possible (or responsible) to say a product is finalized without real users.”","“Golem is a dApp [decentralized application], and as any other, it required testing through a contained “laboratory”. But in order to progress, we need to get out of this comfort zone, and make sure the elements that we have worked hard, and continue to build, are responsive and working well on a decentralized setting,” they added.","In 2016, Golem raised ETH 820,000 ETH during their ICO.","Since the mainnet launch announcement, the GNT token has risen in price by 22.23% as of 08:44 am UTC.","Golem price chart",""],"entity":[{"type":"22.23%","content":"PERCENT"},{"type":"2016","content":"DATE"},{"type":"GNT (Golem Network Tokens","content":"ORGANIZATION"},{"type":"Golem Project","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"}],"hashtag":["Adoption","Blockchain","Decentralization","Ethereum"],"authors":["Sead Fadilpašić"]}