{"summary":"Solana Price Prediction as SOL Trading Volume Soars to $2.5 Billion – Are Whales Buying the Dip?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-price-prediction-as-sol-trading-volume-soars-to-2-5-billion-are-whales-buying-the-dip.htm","publishDate":"2024-05-13T21:34:41","id":18870,"type":null,"title":"Solana Price Prediction as SOL Trading Volume Soars to $2.5 Billion – Are Whales Buying the Dip?","category":["Price Predictions "],"content":["The Solana (SOL) price has jumped back up to test $150 from earlier session lows under $140 amid a surge in trading volumes, as traders await a barrage of upcoming US economic data releases later in the week.","As per Yahoo Finance, trading volumes on major exchanges surpassed $2.5 billion on Monday. That was the highest since last Tuesday.","The impressive price rise still leaves the Solana price lodged well within its $120-$160 range over the past month.","Wednesday’s US CPI and Retail Sales could shake things up, as traders assess the interest rate outlook.","But ahead of then, the focus is on meme coins (and meme stocks) following Roaring Kitty’s sudden return.","pic.twitter.com\/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","His return comes with gas fees very low across major blockchains like Ethereum.","wtf surely this is an all time low for $ETH gas fees? pic.twitter.com\/bVwiXhmpZB","— eztic (@eztic0) May 12, 2024","","Solana has marked itself out in 2024 as the number one meme coin blockchain.","If Roaring Kitty’s return coupled with low gas fees can start a new meme coin season, Solana could be a key beneficiary.","Bitcoin (BTC), last at $63,000, also remains stuck within multi-month ranges and isn’t likely to see a major breakout soon.","The macro backdrop remains uncertain, with traders unsure how soon and fast Fed rate cuts are coming.","Spot Bitcoin ETF flows have crawled to a halt. The April halving proved to be a sell-the-news event, with post-halving rallies typically not coming in for 4-6 months.","And we are heading into summer, typically a subdued\/bearish time for Bitcoin.","So Bitcoin could easily remain stuck within recent ranges for the foreseeable future. And that suggests that Solana might also be stuck within recent ranges.","But say meme coin season returns and Solana meme coins take center stage.","A break above $160 would open the door to a swift move back to $200.","However, should meme season fail, and the market’s broader malaise turn into a sell-off, Solana could break lower.","$120 is key long-term support. Should this level break a quick test of $100 or lower would be on the cards.","Such a sell-off would likely see short-term holders with a low tolerance for riding a drawdown, often referred to as “crypto tourists”, panic sell into the hands of higher conviction dip-buyers and whales.","Such capitulation isn’t yet obvious. But you can bet that under $100 the Solana whales will come piling in to scoop up more.","And this would be a great sign of a near-term bottom.","An exciting new Solana meme coin called Slothana (SLOTH) has seen an amazing start to life since its recent launch.","The Sloth-themed meme coin is up 550% since its May 1 launch, with a market cap now near $100 million.","🚀🦥 It's LAMBO TIME for the $SLOTH community! Let's take a look back at the past 7 days as $SLOTH presale buyers make 300% gains. 📈","💥 100m $SLOTH Tokens Burnt, totaling 5% of supply and $3m\n🔒 Liquidity locked with Streamflow Finance\n🔄 Organic listings on multiple… pic.twitter.com\/1PyFCzzSSW","— Slothana (@SlothanaCoin) May 13, 2024","","Slothana aims to supplant its Sloth-themed meme coin predecessor Slerf (SLERF), which at one point had a market cap of close to $500 million.","But Slerf has since dropped back to $145 million. Slothana could soon take the crown as the biggest Sloth meme coin.","As meme coin risk appetite returns, it could become a multi-billion-dollar coin. Slothana is a good bet to the next GME stock.",""],"entity":[{"type":"$SLOTH","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"$145 million","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$63,000","content":"MONEY"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"300%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"550%","content":"PERCENT"},{"type":"Slerf","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$120","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"GME","content":"ORGANIZATION"},{"type":"May 12, 2024","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"$160","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$140","content":"MONEY"},{"type":"May 1","content":"DATE"},{"type":"last Tuesday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"US CPI","content":"ORGANIZATION"},{"type":"Streamflow Finance\n🔄 Organic","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"May 13, 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"$3m","content":"MONEY"},{"type":"Solana (SOL","content":"ORGANIZATION"},{"type":"$150","content":"MONEY"},{"type":"Solana","content":"LOCATION"}],"hashtag":["SOL","Solana"],"authors":["Joel Frank"]}