{"summary":"Judge Denies Cristiano Ronaldo’s Motion To Dismiss NFT Lawsuit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ronaldo-nft-binance-lawsuit.htm","publishDate":"2024-05-08T20:44:40","id":18881,"type":null,"title":"Judge Denies Cristiano Ronaldo’s Motion To Dismiss NFT Lawsuit","category":["NFT News "],"content":["Football superstar Christiano Ronaldo’s motion to dismiss a $1 billion class action lawsuit was denied on May 4. The lawsuit concerns his promotion of non-fungible tokens (NFTs) on Binance.","According to Newsweek, Judge Roy Altman issued the ruling, stating, “We deny without prejudice the Defendant’s 29 motion to dismiss.”","","“Accordingly, we direct the Clerk of Court to close and stay this case until we have adjudicated the pending motions to compel arbitration in the related action,” the judge added.","Arbitration is a private form of dispute resolution in which a final decision on the case is left to a neutral, mutually accepted third party rather than going to court.","Investors sued Ronaldo in November 2023, one year after the athlete launched an NFT collection called “CR7” in collaboration with Binance.","The collection’s name represents Ronaldo’s Initials and shirt number, which he often uses to brand his products. It features digital collectibles of himself and moments from his sports career and purports to stand for “innovation, artistry, and the unparalleled thrill of fan engagement,” according to Binance’s website.","Prosecutors alleged last year that his promotion of those NFTs was “deceptive and unlawful,” however, leading them to costly and unsafe investment decisions. Since early 2022, Ethereum-based NFT mints and trading volume have dropped alongside floor prices.","","Some of Ronaldo’s promotional activities included posts on his Instagram account, including one in March where he played foosball with another athlete sponsored by the exchange.","“Had an amazing time with @binance, creating the next level of fan experience,” he wrote in January. “Thanks to my ForeverCR7 NFT collection, I got to meet and train with the holders of my rarest NFTs.”",".@KhabyLame in goal, @Cristiano Ronaldo coaching…","A unique and incredible experience for the holders of the rarest ForeverCR7 NFTs.","Get a CR7 NFT here ➡️ https:\/\/t.co\/ruFZH6NfRJ pic.twitter.com\/PL8Y5VpcEr","— Binance (@binance) January 27, 2024","","In the November lawsuit, plaintiffs asserted that Binance had only reached the heights of its “fraud” thanks to its sale of unregistered securities, which was enabled and bolstered by numerous celebrities like Ronaldo. Binance is currently fighting U.S. regulators in court as to whether the NFTs and tokens on its platform constitute investment contracts under U.S. securities law.","Plaintiffs argued that Ronaldo’s promotional efforts sent Google searches for the keyword “Binance” up 500% upon his announcement of his partnership with the exchange. His premium NFTs sold out within one week of launch."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 4","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"January 27, 2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Ronaldo’s Initials","content":"PERSON"},{"type":"Ronaldo’s","content":"PERSON"},{"type":"500%","content":"PERCENT"},{"type":"Clerk of Court","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Newsweek","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ronaldo","content":"PERSON"},{"type":"Christiano Ronaldo’s","content":"PERSON"},{"type":"Roy Altman","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Cristiano Ronaldo","Lawsuit","NFT"],"authors":["Andrew Throuvalas"]}