{"summary":"Bitcoin, Ethereum and Ripple Recovery Face Hurdles","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-ethereum-and-ripple-recovery-face-hurdles-1057.htm","publishDate":"2018-01-18T10:40:00","id":18887,"type":null,"title":"Bitcoin, Ethereum and Ripple Recovery Face Hurdles","category":["Ethereum News "],"content":["It’s been a choppy week so far for all major cryptocurrencies such as bitcoin, Ether, litecoin and bitcoin cash. Prices declined heavily and traded to new 2018 lows.","Recently, a major wallet company in China, Bixin, paused its operation for all over-the-counter (OTC), or off-exchange trading and escrow trading due to actions from Chinese regulators to tighten screws on bitcoin industry.","Similarly, South Korea’s plan to consider a potential ban caught the market attention and drove it down. All cryptocurrencies faced a lot of selling pressure during the past few days due to growing regulatory fears around the world.","It seems like the market has turned its attention to South Korea and China. As per Capital Economics, an economic research consultancy based in London, the recent decline in bitcoin points to the fact that the bubble is bursting.","Starting with bitcoin, there was a decline to well below USD 10,000 as the largest digital currency declined to USD 9035 (as per the Binance, a crypto exchange, feed). The overall cryptocurrency’s market cap was down by more than USD 25 billion in the last five sessions.","After trading as low as USD 9035, there was a decent recovery initiated and bitcoin price moved above the USD 10,000 level. The price is up by roughly 8% above USD 11,000. However, it is facing a major resistance at USD 11,500.","Ethereum’s Ether declined by more than USD 600 this month from USD 1400 to well below USD 800. A low was formed at USD 755 before a correction kicked off. Similar to bitcoin price, Ether’s price recovered by more than 8% above USD 950 and is currently struggling to settle above USD 1,050.","Furthermore, the third largest cryptocurrency, ripple was down by more than 15% to roughly USD 0.8500.","At the outset, the current recovery in all major digital currencies seems to be fading slowly. If the recent drama in South Korea does not end soon, there can be more declines. No doubt, the recent bounce during the Asian session was encouraging, but traders now await the New York session for the next move.","Bitcoin price is currently trading at USD 11,220, with resistances on the upside at USD 11,500 and USD 12,500. Ether is trading positively above USD 950 and it faces strong offers near USD 1,100.","Should bitcoin price moves past USD 12,000, it could help buyers and the overall negative sentiment may decrease slowly."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Capital Economics","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Bixin","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"USD 25 billion","content":"MONEY"},{"type":"9035","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"this month from USD 1400","content":"DATE"}],"hashtag":["Bitcoin","Crypto Trading","Ethereum","Markets","Ripple"],"authors":["Aayush Jindal"]}