{"summary":"Fee War Intensifies: Bitcoin ETF Issuers Submit Updates Lowering Rates","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fee-war-intensifies-bitcoin-etf-issuers-submit-updates-lowering-rates.htm","publishDate":"2024-01-10T06:19:45","id":18889,"type":null,"title":"Fee War Intensifies: Bitcoin ETF Issuers Submit Updates Lowering Rates","category":["Bitcoin News "],"content":["The spot Bitcoin exchange-traded fund (ETF) competition is heating up as major issuers including Fidelity submitted revisions to lower their fees.","According to Bloomberg Intelligence ETF analyst James Seyffart, Fidelity lowered their fees to 0.25% from the previous 0.39% and has offered a fee waiver to 0% through July 31.","Including Fidelity, 5 out of the 11 issuers have revised their fee structures or offered temporary waivers after they received feedback from the U.S. Securities and Exchange Commission on Jan. 8.","On a more serious note… here's all the firms doing the hard work behind the scenes. @Fidelity has lowered their fees all the way down to 25bps and is also offering a fee waiver to 0% through July 31, 2024 pic.twitter.com\/Ao0WmICBFh","— James Seyffart (@JSeyff) January 9, 2024","","With the previously lowest fee of 0.24% offered already, Bitwise reduced it to 0.20% with a waiver to 0% for 6 months or 1 billion; Wisdomtree lowered its fee of 0.50% to 0.30% also with a waiver to 0% for 6 months or 1 billion.","Invesco & Galaxy kept the waiver while reducing the 0.59% fee to 0.39%; Valkyrie made a significant adjustment to cut the fee from 0.80% to 0.49% with an additional waiver to 0% for 3 months.","As the entire crypto community nervously awaits the SEC’s final decision of the spot Bitcoin ETFs, the Commission disrupted the tension with its official social media account posting false announcement of the approval for listing and trading Bitcoin ETFs.","The @SECGov twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.","— Gary Gensler (@GaryGensler) January 9, 2024","","“The SEC twitter account was compromised, and unauthorized tweet was posted,” said SEC Chair Gary Gensler. “The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.”","The safety team at X (formerly known as Twitter) confirmed the breach after a preliminary investigation.","“Based on our investigation, the compromise was not due to any breach of X’s systems,” said X’s safety team in a post. “But rather due to an unidentified individual obtaining control over a phone number associated with the SEC account through a third party.”","“We can also confirm that the account did not have two-factor authentication enabled at the time the account was compromised,” wrote the post.","Many users have expressed their frustration and disappointment with the unprofessional operation of the SEC. Though Bitcoin price briefly touched the $48,000 mark post the false approval notice, it dropped below the $46,000 level after the clarification and is currently trading at $45,953, down by 1.8% from 24 hours ago according to CoinMarketCap."],"entity":[{"type":"Invesco & Galaxy","content":"ORGANIZATION"},{"type":"0.20%","content":"PERCENT"},{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"0.30%","content":"PERCENT"},{"type":"0.24%","content":"PERCENT"},{"type":"1 billion","content":"MONEY"},{"type":"July 31, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$46,000","content":"MONEY"},{"type":"1.8%","content":"PERCENT"},{"type":"0.50%","content":"PERCENT"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"0.80%","content":"PERCENT"},{"type":"$45,953","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"0.39%","content":"PERCENT"},{"type":"0.49%","content":"PERCENT"},{"type":"0%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"0.59%","content":"PERCENT"},{"type":"James Seyffart","content":"PERSON"},{"type":"July 31","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"$48,000","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Jan. 8","content":"DATE"},{"type":"January 9, 2024","content":"DATE"},{"type":"Wisdomtree","content":"ORGANIZATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin ETF","Fidelity"],"authors":["Hongji Feng"]}