{"summary":"Dogecoin shot up almost 14% on Monday after Twitter&#x27;s blue bird logo was changed on the website for some users to the famed meme of a Shiba Inu dog.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224621\/dogecoin-skyrockets","publishDate":"2023-04-03T14:21:39","id":1888,"type":null,"title":"Dogecoin price rises after Elon Musk changes Twitter logo for Shiba Inu","category":["COMPANIES"],"content":["Dogecoin shot up more than 27% on Monday after Twitter's blue bird logo was changed on the website for some users to the famed meme of a Shiba Inu dog.","Crypto Twitter buzzed with intrigue as to what owner and CEO Elon Musk might be doing.","\"Doge for some reason is showing up on Twitter and I can only assume this was supposed to be an April Fools joke that took 3 days to roll out because no one knows how the site works anymore,\" on Twitter <a href=\"https:\/\/twitter.com\/Win98Tech\/status\/1642944854991699968\" data-v-f87c67ca=\"\">user wrote<\/a>.","While initially silent, Musk eventually tweeted a post that referenced older tweets that joked about changing the logo.","","","Before Musk broke his silence about the logo change, the price of DOGE had shot up over 27% by 3:45 p.m. EDT to above $0.10, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/dogecoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>. That's the highest price in about four months.","","","<em data-v-f87c67ca=\"\">(Updates with Musk tweet in fourth paragraph.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Musk","content":"ORGANIZATION"},{"type":"27%","content":"PERCENT"},{"type":"$0.10","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"3:45 p.m.","content":"TIME"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"April Fools","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}