{"summary":"Bitcoin and Ethereum Struggle to Break Key Resistances","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-struggle-to-break-key-resistances-1201.htm","publishDate":"2018-02-13T10:24:00","id":18886,"type":null,"title":"Bitcoin and Ethereum Struggle to Break Key Resistances","category":["Ethereum News "],"content":["Bitcoin price struggled to break the USD 9,000 resistance and started a fresh decline. Ethereum also faced a lot of offers near USD 850 and moved down. U.CASH is again today’s top performer as it moved 23% higher to USD 0.1639.","The cryptocurrency market is showing signs of trend exhaustion since all major cryptos started a fresh downside correction. If bears gain control, then bitcoin, Ethereum, ripple and bitcoin cash could accelerate declines in the near term. There was no particular reason for the current decline, but it seems like the technical structure turned bearish short term.","Bitcoin\nBitcoin traded as high as USD 8,989 before sellers stepped in. The price formed a high and started a downside move. BTC\/USD declined and traded below the USD 8,800 and 8,600 support levels.\nAt present, the price is down 4% to USD 8,400 and is showing a few bearish signs. The next major support on the downside is near USD 8,100. Below this past, the price may perhaps test USD 8,000. On the upside, the USD 8,800 and 9,000 levels are crucial resistances.","Ethereum\nEthereum also came under renewed selling pressure from the USD 850 resistance. It declined 5.05% and is currently trading near USD 825. On the downside, the next major supports are at USD 810 and 800.\nBelow USD 800, the price may come under a lot of bearish pressure. Towards the upside, sellers are positioned near the USD 850 and 860 levels.","Bitcoin Cash and Ripple\nRipple was one of the worst performers as it fell by more than 8% to USD 0.9650. It seems like XRP\/USD was not able to hold gains above the USD 1.00 level and declined.\nThe supports to watch out on the downside could be USD 0.9200 and 0.8800. The stated USD 0.8800 support is significant and further losses may be limited.\nBitcoin cash was down 7.2% to USD 1,190. The USD 1,350 level was a crucial barrier and the price faced a lot of selling interest near the stated level. BCH\/USD could move back above the USD 1,200 level, with resistances on the topside at USD 1,300 and 1,350.","Altcoins Market Today\nU.CASH retained yesterday’s gain and it was today’s best performer with more than 20% gains. The second best performer was Revain. Its price gained traction after the company released a new roadmap for 2018. The price is currently trading near USD 3.20 and it looks set for further gains.","To sum up, the current market is short-term bearish, but any major downsides could be limited in bitcoin and Ethereum."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"7.2%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"5.05%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"XRP\/USD","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Altcoins","Bitcoin","Bitcoin Cash","Ethereum","Markets","Ripple"],"authors":["Aayush Jindal"]}