{"summary":"Bitcoin, Ethereum and Ripple Back in Red, Facing Negative Sentiment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-ethereum-and-ripple-back-in-red-facing-negative-sent-1060.htm","publishDate":"2018-01-22T12:50:00","id":18895,"type":null,"title":"Bitcoin, Ethereum and Ripple Back in Red, Facing Negative Sentiment","category":["Ethereum News "],"content":["Cryptocurrencies lost the bullish momentum today and were seen trading in the red. Bitcoin started a slow and steady decline below USD 12,000 and faced an increase in selling pressure.","The largest digital currency was down roughly 7% to trade close to the USD 11,200 level. Similarly, other major cryptocurrencies such as Ether, bitcoin cash and ripple posted declines for the second straight session.","The market was caught in the bearish zone after a Wall Street veteran, Peter Boockvar predicted a massive decline in bitcoin price. He stated to CNBC that “When something goes parabolic like this has, it typically ends up to where that parabola began”.","He believes crypto is a massive bubble and it could explode with an epic slide, wiping more than 90% value from the overall market cap of cryptocurrencies.","BTC struggled to remain above the USD 11,850 level and moved toward USD 11,000. At present, bitcoin is holding the USD 11,000 level, but it remains at a risk of more declines during the coming sessions.","Ethereum’s Ether also faced strong selling interest and was down by 6.2% to USD 1,028, according to binance. The third largest cryptocurrency, ripple declined by around 10% to USD 1.3000. XRP\/USD seems to be under a lot of bearish pressure and it could move towards the USD 1.1000 level.","ETH\/USD has a decent support at USD 1,010, but the current market sentiment is pressuring the mentioned support. If the pair breaks the USD 1,010 support, there could be more declines toward the next major support at USD 920.","Looking at the support levels for bitcoin price, an initial buy zone is at USD 11,000. A close below USD 11,000 would open the doors for a slide toward USD 10,200.","There were reports that Taiwan may take steps to keep a watch on bitcoin trading and it may include in anti-money laundering rules. Therefore, the market may find it hard to recover from the red. Having said that, if bitcoin price stabilizes above USD 11,000, it may perhaps move back in the green zone.","Its rivals such as Ether has to surpass USD 1,080 and ripple must break USD 1.4000 to move back in the positive zone during the coming sessions."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"90%","content":"PERCENT"},{"type":"6.2%","content":"PERCENT"},{"type":"Peter Boockvar","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Taiwan","content":"LOCATION"}],"hashtag":["Bitcoin","Cryptocurrency","Ethereum","Ripple"],"authors":["Aayush Jindal"]}