{"summary":"Support Mounts for Coinbase as Industry Leaders Call on SEC to Draft Clear Crypto Regulations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/support-for-coinbase-industry-leaders-call-on-sec-to-draft-clear-crypto-regulations.htm","publishDate":"2024-03-20T14:12:12","id":18905,"type":null,"title":"Support Mounts for Coinbase as Industry Leaders Call on SEC to Draft Clear Crypto Regulations","category":["Blockchain News "],"content":["Several supporters have joined Coinbase Inc. in its legal battle against the U.S. Securities and Exchange Commission (SEC) to urge the agency to reconsider its stance on crafting specific crypto regulations for the industry.","Notable backers, including Paradigm, the Crypto Council for Innovation, and others, have submitted amicus briefs to the circuit court, bolstering Coinbase’s position.","These amicus briefs were filed to support Coinbase’s appeal, which stemmed from a petition the crypto exchange filed in July 2022, urging the SEC to establish rules for tokens classified as securities. The commission rejected the petition in December 2023, approximately six months after initiating an enforcement action against Coinbase for alleged securities law violations. Coinbase appealed the decision, leading to the recent submission of amicus briefs.","In filings submitted on March 18 to the Third Circuit Court of Appeals, organizations such as the Crypto Council for Innovation (CCI), Satoshi Action Fund, Texas Blockchain Council, Paradigm, Lejilex, and the U.S. Chamber of Commerce argued that the SEC’s lack of clear guidelines creates uncertainty for market participants in the United States. They emphasized that without clear regulatory frameworks, companies may consider relocating out of the country.","The CCI’s brief criticized the SEC’s denial of Coinbase’s petition, stating that it undermines basic principles of fairness and harms consumers and innovators. Similarly, the U.S. Chamber of Commerce noted the risks of the SEC’s failure to provide clarity for the crypto industry, citing it as a case study in refusing to adapt regulation to new circumstances.","The joint filing from the Satoshi Action Fund and Texas Blockchain Council highlighted the need for clear rules rooted in congressional authority, especially when the SEC imposes adverse consequences and liability on the digital asset industry for past actions taken in good-faith reliance on the SEC’s pronouncements.","According to Paradigm, the SEC’s insistence on a centralized issuer model for registration is impractical and hampers meaningful disclosures to the public. The brief also highlighted dissent within the SEC, with Republican commissioners disagreeing with Chair Gary Gensler’s regulatory stance. ","Paradigm and CCI emphasized the necessity of predictability in compliance, criticizing the SEC’s regulatory approach for relying on ad-hoc enforcement rather than precise rules.","","We are grateful to see many amicus briefs filed today in our Third Circuit case objecting to the SEC’s denial of our rulemaking petition. Thank you to @paradigm, @LEJILEX,@SatoshiActFund, @TexasBlockchain, @USChamber and @crypto_council for sharing your perspectives with the…","— paulgrewal.eth (@iampaulgrewal) March 19, 2024","","Paul Grewal, Coinbase’s chief legal officer, expressed gratitude for the support received from various groups, including the U.S. Chamber of Commerce and the Texas Blockchain Council. Grewal stated the importance of regulatory predictability for compliance, noting that Coinbase’s petition for rulemaking seeks to establish clear guidelines for the industry.","Coinbase filed a writ of mandamus in April 2020 to compel the SEC to respond to its petition, which the SEC rejected, stating that rulemaking could take years.","In December 2023, SEC Chair Gary Gensler cited existing laws and regulations, stating that investors and issuers in crypto securities markets deserve the protection of securities laws. Gensler also noted that the timing for the proposed rulemaking is not right, as the SEC is currently seeking comments on crypto-related rules. ","While SEC Commissioners Hester Peirce and Mark Uyeda acknowledged Gensler’s points, they argued that the issues raised in Coinbase’s petition should be addressed through public roundtables and requests for comment. ","In March, Coinbase initiated legal action against the SEC, filing a lawsuit to compel the regulatory body to provide definitive guidelines for the cryptocurrency industry. Outlined in their court submission on March 11, Coinbase contested the SEC’s failure to enact formal rulemaking for the crypto sector. The exchange argued that the absence of clear regulations hindered the industry’s progress and created uncertainty.","The timeline for the appellate court’s decision on the Coinbase case remains uncertain. However, the SEC’s recent enforcement actions against various crypto firms and a U.S. district court’s imposition of sanctions on the SEC for acting in bad faith in a lawsuit against Debt Box have raised concerns about the commission’s conduct in other cases."],"entity":[{"type":"CCI","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"Lejilex","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase Inc.","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"Texas Blockchain Council","content":"ORGANIZATION"},{"type":"Third Circuit","content":"ORGANIZATION"},{"type":"Satoshi Action Fund","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"U.S. Chamber of Commerce","content":"ORGANIZATION"},{"type":"SEC Commissioners Hester Peirce","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"March 18","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"Third Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"March 11","content":"DATE"},{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Crypto Council for Innovation (CCI","content":"ORGANIZATION"},{"type":"March 19, 2024","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["Coinbase","Crypto Regulation","SEC"],"authors":["Hassan Shittu"]}