{"summary":"UK Court Freezes £6 Million of Craig Wright’s Assets to Prevent Evading Court Costs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-court-freezes-6-million-of-craig-wrights-assets-to-prevent-evading-court-costs.htm","publishDate":"2024-03-29T14:15:16","id":18900,"type":null,"title":"UK Court Freezes £6 Million of Craig Wright’s Assets to Prevent Evading Court Costs","category":["Bitcoin News "],"content":["A UK judge has taken action to prevent Craig Wright from evading court orders following a ruling stating that Wright falsely claimed to be the creator of Bitcoin. ","The judge issued a worldwide asset freezing order, effectively blocking £6 million ($7.6 million) of Craig Wright’s assets and prohibiting him from transferring them offshore, according to legal documents filed on Thursday. ","“Yesterday, I granted a worldwide freezing order (‘WFO’) in the sum of £6m, on an application brought by the Crypto Open Patent Alliance (‘COPA’) against Dr Craig Wright,” Judge James Mellor wrote in the document. ","The ruling stems from a court case initiated by the Crypto Open Patent Alliance (COPA), which challenged Wright’s claims of being Satoshi Nakamoto, the pseudonymous inventor of Bitcoin.","In a decision rendered on March 14, Judge Mellor not only debunked Wright’s assertions but also determined that he did not author the Bitcoin white paper or the initial versions of the Bitcoin software.","Shortly after the court’s ruling, Wright made a move to transfer shares of his RCJBR Holding company to DeMorgan, a Singapore-based entity. ","This action raised concerns that Wright was attempting to evade the financial consequences of the court’s decision, particularly the costs associated with the case, which amounted to approximately £6.7 million.","In the judgment, Judge Mellor highlighted Wright’s history of defaulting on payment orders and expressed a genuine apprehension that Wright may dissipate his assets to avoid meeting his financial obligations. ","The judge acknowledged COPA’s strong claim for substantial costs and concluded that there was a significant risk of asset dissipation.","“Having given careful consideration to COPA’s costs arguments and attempting to anticipate the points which could be made in response on behalf of Dr Wright, I concluded the appropriate sum for the WFO was the sum of £6m,” he wrote. ","The ruling that Craig Wright is not Satoshi came at the conclusion of closing arguments in the lawsuit brought by COPA against Wright.","COPA, an organization focused on promoting the adoption and advancement of cryptocurrency technologies while removing patents as barriers to growth and innovation, sought injunctive relief to prevent Wright from continuing to make claims of being Nakamoto. ","“One fact above all is true about cryptocurrency and digital assets, and that fact is this: Craig Wright is not Satoshi Nakamoto.”","– @iampaulgrewal on ABC News pic.twitter.com\/6E3Fqtu8JV","— hodlonaut 80 IQ 13%er 🌮⚡🔑 🐝 (@hodlonaut) March 28, 2024","","The case brought forward extensive allegations of document forgery against Wright, suggesting that he had fabricated a significant amount of evidence to support his claim of being the pseudonymous Bitcoin founder.","Furthermore, COPA’s closing submission stated that Wright had engaged in extensive deception, emphasizing that he had invented an elaborate biographical history and produced a series of forged documents to substantiate his claims. ","The evidence presented during the trial painted a picture of Wright’s alleged falsehoods on an “extraordinary scale.”","Meanwhile, in another blow to Wright’s claim that he is the mysterious Bitcoin creator, a recent investigation provided evidence to suggest that Nakamoto may actually be a collective entity. ","One piece of evidence is the usage of both “we” and “I” in the Bitcoin white paper, indicating the possibility of a team operating under a singular pseudonym."],"entity":[{"type":"Crypto Open Patent Alliance","content":"ORGANIZATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"Mellor","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"ABC News pic.twitter.com\/6E3Fqtu8JV","content":"ORGANIZATION"},{"type":"$7.6 million","content":"MONEY"},{"type":"Satoshi","content":"PERSON"},{"type":"March 14","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"James Mellor","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"WFO","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"March 28, 2024","content":"DATE"},{"type":"COPA","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Craig Wright","Satoshi Nakamoto"],"authors":["Ruholamin Haqshanas"]}