{"summary":"1inch will enable faster exits of stETH and wstETH onto Ethereum, Arbitrum, Optimism and other chains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278409\/lido-adds-1inch-for-faster-withdrawals-of-steth-and-wsteth","publishDate":"2024-02-21T11:22:25","id":1891,"type":null,"title":"Lido adds 1inch for faster withdrawals of stETH and wstETH","category":["CRYPTO ECOSYSTEMS"],"content":["Liquidity staking protocol Lido added support for decentralized exchange aggregator 1inch.&nbsp;","The addition of 1inch facilitates the swapping of stETH (staked ether) and wstETH (wrapped staked ether), as well as ETH, Ethereum's native token, when unstaking. 1inch enables faster exits onto Ethereum, Arbitrum and Optimism, according to an official <a href=\"https:\/\/help.lido.fi\/en\/articles\/7913058-swap-to-eth-using-1inch\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","\"Skip the withdrawal queues with instant swaps between stETH\/wstETH and ETH using 1inch,\" Lido Finance <a href=\"https:\/\/twitter.com\/LidoFinance\/status\/1760293170602967327\" data-v-f87c67ca=\"\">wrote<\/a> on the social media platform X. \"1inch is a DeFi aggregator optimized for Ethereum, BNB Chain, Optimism, Polygon and other chains. By aggregating prices across hundreds of DEXs, 1inch guarantee you the best rates for all trades.\"","Lido pools its users' cryptocurrency, providing a liquid utility token on a one-to-one basis for their staked asset. For example, staking one ETH gives the user 1 stETH, which is liquid and is accepted on various decentralized applications, including the digital wallet MetaMask and the automated market maker Curve, according to Lido's <a href=\"https:\/\/lido.fi\/#networks\" data-v-f87c67ca=\"\">website<\/a>. wstETH offers a stable version of stETH, as a user's balance of stETH fluctuates depending on staking rewards. Lido also supports the Polygon blockchain to offer users the staked version of the network's native token MATIC.&nbsp;","Lido remains the liquid staking protocol with the highest total value locked (TVL) in decentralized finance (DeFi). Lido's TVL climbed to $29.5 billion as of Feb. 21, data compiled by The Block show.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-in-liquid-staking\/embed\" title=\"Value Locked in Liquid Staking\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"$29.5 billion","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Feb. 21","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["LIDO FINANCE","STAKING"],"authors":["MK Manoylov","The Block"]}