{"summary":"Man Charged in ‘Cryptojacking’ Scheme for Stealing Cloud Computing to Mine $1M in Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/man-charged-for-mining-1m-crypto-in-cryptojacking-scheme.htm","publishDate":"2024-04-16T07:37:07","id":18916,"type":null,"title":"Man Charged in ‘Cryptojacking’ Scheme for Stealing Cloud Computing to Mine $1M in Crypto","category":["Altcoin News "],"content":["US prosecutors have charged a man with wire fraud and money laundering in connection with a large-scale illegal ‘cryptojacking’ operation. ","Charles O. Parks III, also known as “CP3O,” allegedly defrauded two cloud computing providers, resulting in losses of $3.5 million, while using their resources to mine cryptocurrencies worth approximately $970,000, including Ether, Litecoin, and Monero, according to an official press release. ","If convicted, Parks could face a maximum sentence of 50 years in prison.","The Brooklyn U.S. Attorney’s Office initiated the charges against Parks, who was arrested in Nebraska on April 13. ","He stands accused of wire fraud, money laundering, and engaging in unlawful monetary transactions. ","Parks is scheduled to appear before an Omaha federal court on April 16.","According to the indictment, Parks established multiple accounts with a subsidiary of “Company 1,” a cloud computing and consumer electronic device company based in Seattle, Washington, as well as “Company 2,” a firm specializing in personal computers and related services headquartered in Redmond, Washington. ","From January to August 2021, Parks allegedly employed various false identities, corporate affiliations, and email addresses, including those associated with companies he registered, such as MultiMillionaire LLC and CP3O LLC, to create accounts with these companies.","The indictment further states that Parks deceived and defrauded the cloud computing providers into granting him elevated privileges and benefits, such as increased levels of cloud computing services and deferred billing accommodations. ","When the providers began noticing suspicious data usage and unpaid subscription balances, Parks allegedly attempted to evade their inquiries.","Prosecutors claim that Parks laundered some of the mined cryptocurrencies through “Cryptocurrency Exchange 1,” a decentralized company with no headquarters, as well as a payments provider, bank accounts, and a New York City-based nonfungible token (NFT) marketplace. ","To avoid federal reporting requirements for transactions exceeding $10,000, Parks structured the payments in amounts just below that threshold. ","Investigators discovered multiple instances where he transferred $9,999 or smaller amounts from the crypto exchange to a bank account.","The proceeds from the scheme were purportedly used by Parks for extravagant purchases, including a luxury Mercedes Benz, jewelry, and first-class hotel and travel expenses. ","“This arrest illustrates the power of law enforcement joining forces with the private sector to identify and track down cybercriminals, and to put an end to their sophisticated thievery,” stated NYPD Commissioner Caban. ","“While the threat landscape in this space is growing in complexity and depth, the NYPD and our federal partners continue to ably confront malicious actors even as they adopt new tactics.”","As reported, cryptojacking has been on the rise with hackers increasingly targeting financial firms such as banks and trading houses.","Notably, it is common for cryptojackers to mine privacy cryptocurrencies such as Monero which is often used by cybercriminals. ","Due to Monero’s privacy features it has often attracted cypherpunks who are all for privacy which is not provided in other cryptocurrencies. "],"entity":[{"type":"Omaha","content":"LOCATION"},{"type":"New York City","content":"LOCATION"},{"type":"MultiMillionaire LLC","content":"ORGANIZATION"},{"type":"Caban","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Nebraska","content":"LOCATION"},{"type":"August 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"April 13","content":"DATE"},{"type":"$9,999","content":"MONEY"},{"type":"Brooklyn U.S.","content":"LOCATION"},{"type":"$10,000","content":"MONEY"},{"type":"Monero","content":"PERSON"},{"type":"CP3O LLC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$970,000","content":"MONEY"},{"type":"April 16","content":"DATE"},{"type":"Litecoin","content":"PERSON"},{"type":"Mercedes Benz","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Redmond","content":"LOCATION"},{"type":"Charles O. Parks III","content":"PERSON"}],"hashtag":["crypto scam","Cryptojacking"],"authors":["Ruholamin Haqshanas"]}