{"summary":"Another open letter is reaching the desks of Facebook execs as multiple lawmakers call for a moratorium of Libra development\nMultiple committee chairs signed the letter, which was sent today","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29986\/facebook-execs-receive-another-letter-calling-for-a-halt-in-libra-development","publishDate":"2019-07-02T19:10:09","id":1891,"type":null,"title":"Facebook execs receive another letter calling for a halt in Libra development","category":["Facebook"],"content":["<span data-v-f87c67ca=\"\">After Chair of the House Financial Services Committee U.S. Rep. Maxine Waters called for a moratorium on the development of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/29848\/non-custodial-crypto-wallet-zengo-adding-support-for-facebooks-libra-coin\" data-v-f87c67ca=\"\">Facebook's<\/a> Libra, other members of Congress are joining her. Five members, including Waters, have <a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/07.02.2019_-_fb_ltr.pdf\" data-v-f87c67ca=\"\">submitted a letter<\/a> to Facebook founder and CEO Mark Zuckerberg, calling for a halt of development.<\/span>","<span data-v-f87c67ca=\"\">Along with Waters, U.S. Rep. Carolyn Maloney (D-NY), Chair of the Investor Protection, Entrepreneurship and Capital Markets Subcommittee; U.S. Rep. William Lacy Clay (D-MO), Chairman of the Housing, Community Development and Insurance Subcommittee; U.S. Rep. Al Green (D-TX), Chairman of the Oversight and Investigations Subcommittee; and U.S. Rep. Stephen F. Lynch (D-MA), Chairman of the Task Force on Financial Technology all addressed their concerns to Zuckerberg, as well as COO Sheryl Sandberg and Calibra CEO David Marcus in an open <a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/07.02.2019_-_fb_ltr.pdf\" data-v-f87c67ca=\"\">letter<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The letter alleges the Libra system, which set up shop in Switzerland a few months ago, is intended to rival U.S. monetary policy and the dollar.<\/span>","<span data-v-f87c67ca=\"\">\"This raises serious privacy, trading, national security, and monetary policy concerns for not only <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30333\/india-not-keen-on-allowing-facebooks-libra-cryptocurrency\" data-v-f87c67ca=\"\">Facebook's<\/a> over 2 billion users, but also for investors, consumers, and the broader global economy,\" the lawmakers wrote.<\/span>","<span data-v-f87c67ca=\"\">The letter also claims the system could become \"an under-regulated platform for illicit activity and money laundering.\" These concerns arise from the lack of information contained in Libra's white paper, according to the signatories.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As justification for the concerns expressed, the letter makes reference to the Cambridge Analytica scandal, in which the political consulting firm accessed <a href=\"https:\/\/www.theblockcrypto.com\/linked\/32512\/analysis-democrats-more-negative-than-republicans-at-house-hearing-on-facebooks-libra\" data-v-f87c67ca=\"\">Facebook<\/a> user data to influence voting behavior in the 2016 election. It also claims <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30620\/facebooks-marcus-responds-to-lawmakers-concerns-about-the-social-networks-connection-to-libra\" data-v-f87c67ca=\"\">Facebook<\/a> removed 2.2 billion fake accounts in the first quarter of 2019, and presents skepticism towards crypto in general, noting that hackers stole $1 billion in the first three quarters of 2018.<\/span>","<span data-v-f87c67ca=\"\">For these reasons, lawmakers called for the moratorium, during which they said they intend to hold public hearings to find legislative solutions for the risks they feel Libra poses.<\/span>","<span data-v-f87c67ca=\"\">\"Failure to cease implementation before we can do so, risks a new Swiss-based financial system that is too big to fail,\" the letter warns.<\/span>","<span data-v-f87c67ca=\"\">Zuckerberg, Sandberg and Marcus have yet to respond to the letter. Indeed Zuckerberg has mostly remained silent when Congress previously mailed him questions on Libra – first in May when Congress asked about the possibility of a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30058\/nobel-prize-winning-economist-joseph-stiglitz-weighs-in-on-facebooks-libra\" data-v-f87c67ca=\"\">Facebook<\/a> crypto after outlets first reported rumors of the coin, and again when Waters called for the initial moratorium last month. <\/span>","<span data-v-f87c67ca=\"\">Marcus, however, is reportedly slated to testify at both Senate and House hearings on Libra, which are scheduled for July 16 and 17, respectively.<\/span>"],"hashtag":["CONGRESS"]}