{"summary":"Countdown to Ethereum Exposé: Insider Promises Proof of Vitalik Buterin’s Alleged Fraud in 48 Hours","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/countdown-to-ethereum-expose-insider-promises-proof-of-vitalik-buterins-alleged-fraud-in-48-hours.htm","publishDate":"2023-11-14T21:09:53","id":18921,"type":null,"title":"Countdown to Ethereum Exposé: Insider Promises Proof of Vitalik Buterin’s Alleged Fraud in 48 Hours","category":["Ethereum News "],"content":["","","An insider with intimate knowledge of Ethereum’s origins has promised to soon reveal alleged fraudulent activities by co-founder Vitalik Buterin. Steven Nerayoff, an early player in Ethereum’s history, announced on November 12 that he would disclose proof within the following 4-5 days concerning misconduct claims against Buterin and fellow co-founder Joe Lubin.","Nerayoff has been increasingly vocal in recent weeks regarding accusations that he says eclipse even the scandal involving crypto exchange FTX. Through posts on the social media platform X, Nerayoff revealed the imminent release of evidence supporting his long-running allegations of fraud by Ethereum’s founders.","“Should be within 48 hours hopefully less. Logistics, setting up smart NFTs, etc.,” Nerayoff stated about the impending reveal.","His online communications have focused heavily on Buterin, implying his extensive involvement in the purported misconduct.","“Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves,” Nerayoff posted.","The recording is about saving the Ethereum Foundation not directly on the fraud but it’s illuminating in many areas…Ethereum Insider Ready For Battle: ETH Founders' Fraud Proof Coming In 4-5 Days | https:\/\/t.co\/7fm1OlyQcm https:\/\/t.co\/XtSz8T8gtm","— Steven Nerayoff (@StevenNerayoff) November 12, 2023","","He went on to directly question Buterin’s innovations related to Ethereum, bluntly stating the co-founder did not actually invent anything. Nerayoff even accused Buterin and Lubin of intentionally promoting fraudulent initial coin offerings on Ethereum’s network, severely hindering the entire cryptocurrency industry.","“Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people,” Nerayoff declared.","He additionally asserted that revenue from facilitating ICOs was the primary business model early on for Lubin’s company ConsenSys.","The insider also disputed the viability of Buterin’s original Ethereum white paper, instead crediting Gavin Wood’s subsequent technical specifications for enabling Ethereum’s initial growth.","“His [Buterin’s] white paper was unworkable. Gavin fixed it in his yellow paper & he’s the reason 1.0 got out the door. Vitalik is the reason 2.0 never got out the door,” Nerayoff stated.","Should be within 48 hours hopefully less. Logistics, setting up Smart NFTs, etc.","— Steven Nerayoff (@StevenNerayoff) November 14, 2023","","Positioning himself as a whistleblower, Nerayoff wants to expose what he claims is a decade of corruption.","“I am only doing it to reveal the truth but then others will have to untangle the rest of the 10 years of corruption. I know this much, the Free Pass is going to cost somebody something,” he said.","Nerayoff also pointed to the lack of lawsuits or public denials as support for his allegations’ validity.","“If I was clean I’d simply say no,” he commented about the lack of rebuttals from Buterin and others.","With his bombshell revelations looming, Nerayoff says he has been contacted by many related parties since first speaking out.","“I made sure this story would go public & not dependent on me by giving info for major press before I came forward. Notice not a single denial or even answers to basic questions of impropriety from anyone. Makes one question how deep & wide this goes,” he stated.","The price of Ethereum’s native cryptocurrency ether has failed to break through its 2022 highs amid Nerayoff’s accusations and the impending release of his purported evidence. The crypto community awaits the latest chapter in this story, as the Ethereum insider’s promised exposé draws near."],"entity":[{"type":"November 14, 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"November 12","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Lubin","content":"PERSON"},{"type":"Nerayoff","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Buterin","content":"LOCATION"},{"type":"Buterin","content":"PERSON"},{"type":"Joe Lubin","content":"PERSON"},{"type":"Steven Nerayoff","content":"PERSON"},{"type":"November 12, 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Vitalik Buterin"],"authors":["Trent Alan"]}