{"summary":"CoinShares Report: Investors Remain Bullish on Bitcoin Despite Market Downturn","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinshares-report-investors-remain-bullish-on-bitcoin-despite-market-downturn.htm","publishDate":"2024-03-19T20:29:07","id":18920,"type":null,"title":"CoinShares Report: Investors Remain Bullish on Bitcoin Despite Market Downturn","category":["Bitcoin News "],"content":["A report by CoinShares on the performance of Bitcoin investment products sheds new light on how the recently launched spot Bitcoin ETFs, together with bullish investment, have helped the products post all-time high inflows last week.","Published yesterday, the digital asset manager’s findings indicate that last week, Bitcoin investment product inflows hit $2.9 billion, setting a new all-time high (ATH) from the preceding week, when inflows amounted to $2.7 billion.","Altogether that takes the year-to-date’s (YTD) total inflows to $13.2 billion. This is significant because barely three months  have passed and Bitcoin investment product inflows for 2024 already exceed 2021’s total of $10.6 billion.","Trading volumes hit $43 billion over the week, which is the same volume posted the preceding week. This figure comprises 47% of overall Bitcoin volumes, meaning nearly half of Bitcoin’s entire trading volume last week was due to institutional trades for investment products tracking BTC’s price.","The US accounted for virtually all of the $2.95 billion inflows last week. Relatively speaking, inflows posted by other countries are minuscule. Australia accounted for $5 million, Hong Kong saw $15 million inflows and Brazil posted $24 million.","Total outflows for the year-to-date add nuance to the picture, with $685m leaving Bitcoin investment products so far.","Bitcoin itself (as opposed to Bitcoin investment products) saw $2.86 billion of inflows last week. The world’s favorite cryptocurrency currently accounts for 97% of all crypto inflows YTD. On the other hand, cryptocurrencies attached to high-functionality smart contract protocols like Ethereum all saw outflows.","Ethereum, Solana and Polygon saw outflows of US$14m, US$2.7m and US$6.8m respectively.","It’s an exciting time to be a Bitcoin fan because the market is currently still pricing the effects of two big market narratives affecting crypto this year: ETFs and the halving.","ETFs are spot Bitcoin investment products issued by asset management companies like BlackRock and Ark Invest. They buy and store Bitcoin and use it to create shares that track Bitcoin’s price for trading on exchanges.","Crypto advocates have long said that the launch of Bitcoin ETFs is a crucial milestone on the path to global crypto adoption and early indicators show they’re at least partially right.","Thanks to ETF-related hype and trading activity, Bitcoin his a new high watermark of $73,737.94 last week on Thursday, March 14.","There’s still more room for further growth. Now Bitcoin fans are pointing to the halving on April 19 as another potential price driver.","The halving is a quadrennial event dictated by Bitcoin’s code when mining rewards get cut in half. Halvings keep Bitcoin scarce by limiting the issuance of new Bitcoin. They have historically been a cause of rallies, as demand typically remains consistent through the supply queeze.","Yesterday, American investor and entrepreneur Anthony Pompliano declared Bitcoin’s “bull market has definitely begun.”"],"entity":[{"type":"$10.6 billion","content":"MONEY"},{"type":"$73,737.94","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Australia","content":"LOCATION"},{"type":"$24 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$13.2 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$2.95 billion","content":"MONEY"},{"type":"Brazil","content":"LOCATION"},{"type":"$685m","content":"MONEY"},{"type":"97%","content":"PERCENT"},{"type":"$2.9 billion","content":"MONEY"},{"type":"March 14","content":"DATE"},{"type":"$2.7 billion","content":"MONEY"},{"type":"April 19","content":"DATE"},{"type":"$2.86 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"$43 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Blockchain","ETF"],"authors":["Tim Hakki"]}