{"summary":"Celsius, a bankrupt crypto lending platform, transferred 428,000 staked ether (stETH) worth $780 million.\nThe transfer occured right before Lido Finance’s release of a withdrawal feature, which can aid Celsius’s restructuring efforts.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230958\/celsius-moves-780-million-in-steth-as-lido-finance-enables-withdrawals","publishDate":"2023-05-16T06:43:22","id":1892,"type":null,"title":"Celsius moves $780 million in stETH as Lido Finance enables withdrawals","category":["Companies"],"content":["Bankrupt lending platform Celsius moved over <a href=\"https:\/\/etherscan.io\/tx\/0x9c5f3650f803792b71bb4be0d51cd0043982ddbdbd015cd984a8a48ae3a98e67\" data-v-f87c67ca=\"\">428,000 staked ether<\/a> (stETH) — a liquid staking derivative token — with a value exceeding $780 million on Monday. The transfer could be a part of Celsius' strategy to reclaim inaccessible ether amid ongoing bankruptcy <a href=\"https:\/\/www.theblock.co\/post\/221642\/judge-approves-celsius-custody-settlement-account-holders\" data-v-f87c67ca=\"\">proceeding<\/a>s.","This transaction coincides with the introduction of a withdrawal feature by Lido Finance, the stETH provider, for the first time. This advancement hints at Celsius devising a strategy to recover their inaccessible ether amid ongoing bankruptcy proceedings. Although the firm has not yet claimed its entire stETH, they did execute a <a href=\"https:\/\/etherscan.io\/tx\/0x933da22a331aa3a0002abf5ae210cfc938c2e63ae81820099773f1ca8a8a6b4e\" data-v-f87c67ca=\"\">withdrawal of 0.1 stETH<\/a> from Lido a few hours later likely to test it.","The <a href=\"https:\/\/www.theblock.co\/post\/230811\/lido-finance-ethereum-withdrawals-upgrade\" data-v-f87c67ca=\"\">version 2 upgrade<\/a> deployed by Lido Finance yesterday enables stETH holders to withdraw their ether at an equivalent 1:1 ratio. Since yesterday, stETH holders have been able to submit withdrawal requests.","In the past Celsius had adopted a strategy that involved staking ETH received on its centralized lending platform with Lido Finance for stETH. This stETH could subsequently serve as collateral in DeFi platforms such as <a href=\"https:\/\/www.theblock.co\/post\/157090\/celsius-takes-out-417-million-in-staked-ether-from-aave\" data-v-f87c67ca=\"\">Aave<\/a>, allowing Celsius to generate yield on customers' funds. The liquid staking service provided by Lido was a capital-efficient alternative to staking with Ethereum validators, allowing holders to earn yield while maintaining access to their capital.","In the middle of 2022 and amid major financial distress and subsequent bankruptcy filing, Celsius grappled with <a href=\"https:\/\/www.theblock.co\/post\/151624\/celsius-rivals-move-to-distance-themselves-from-its-staked-ether-woes\" data-v-f87c67ca=\"\">liquidity problems<\/a> that made it challenging to convert their stETH holdings back to ETH. This stemmed from the fact that Curve, the sole exchange supporting stETH trading didn't have sufficient funds to facilitate swaps back to ether without a high degree of slippage. This bottleneck prevented Celsius from retrieving their ether. However, the recent upgrade by Lido Finance may offer a solution to this issue. With the new withdrawal feature now released on Lido, Celsius stands a better chance of regaining their ETH, and potentially returning them for ongoing restructuring efforts.","Celsius <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for chapter 11 bankruptcy protection in July 2022. A <a href=\"https:\/\/www.theblock.co\/post\/221642\/judge-approves-celsius-custody-settlement-account-holders\" data-v-f87c67ca=\"\">restructuring plan<\/a> approved by a U.S. court is in the works. This plan would enable nearly 85% of customers to reclaim about 72.5% of the cryptocurrency they initially deposited on the platform. This legal verdict opens a window for Celsius to transform stETH back to ether and meet their restructuring commitments.","<em data-v-f87c67ca=\"\">Read more: <a href=\"https:\/\/www.theblock.co\/post\/151624\/celsius-rivals-move-to-distance-themselves-from-its-staked-ether-woes\" data-v-f87c67ca=\"\">Celsius rivals move to distance themselves from its staked ether woes<\/a><\/em>"],"hashtag":["BANKRUPTCY FILINGS"]}