{"summary":"Coinbase is making changes to its application server after an outage last week impacted its website and mobile apps functionality.\nThe outage was one of a series of technical issues the exchange has encountered in recent months. ","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91486\/coinbase-application-server-exchange-outage-january","publishDate":"2021-01-17T09:01:28","id":1893,"type":null,"title":"Coinbase to &#x27;decompose&#x27; its application server in wake of recent outage","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Coinbase says it will divide up its application server into separate services in an effort to “reduce the blast radius” following an outage last week that impacted the API used for the exchange’s website and mobile apps.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Coinbase team said Friday that by “decomposing” its application server, it could have different scaling profiles for the different functions the API serves. Thus, if one surface is affected somehow, it will only affect the APIs or functionality that the particular surface is responsible for, instead of taking down the entire system.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The outage on January 6th and 7th was triggered by record-high traffic from crypto price movement, according to Coinbase, which led to “a thundering herd of requests.”<\/span>","<span data-v-f87c67ca=\"\">“Several of our downstream services were hit with traffic that they were underprovisioned for, and client retry behavior on the application server compounded the issue, rapidly issuing retry requests to the services,” the exchange said. “This retry storm prevented some parts of our app from functioning.”<\/span>","<span data-v-f87c67ca=\"\">The issue also happened because of problems with MongoDB clusters, which are responsible for handling the exchange’s high data volumes. Essentially, the MongoDB clusters were experiencing long delays when queried, causing newer queries to be further delayed. The team triggered a failover on these “unhealthy” clusters, which momentarily returned them to a healthy state. However, the clusters would regress back to unhealthy status within ten minutes. Thus, users were only able to use their apps for short periods of time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the announcement, the Coinbase team plans to break MongoDB clusters which carry “large discrete miscellaneous collections” into separate clusters, which will also make it harder to take down the entire system in the event something like this happens again.<\/span>","<span data-v-f87c67ca=\"\">Coinbase maintains that despite the server being overwhelmed, users were still able to buy, sell, and trade cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The outage is one of several technical issues the exchange has <\/span><a href=\"https:\/\/status.coinbase.com\/history\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">faced<\/span><\/a><span data-v-f87c67ca=\"\"> in recent months, while also <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/90882\/monday-binance-coinbase-exchange-volume\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">breaking its all-time-highs for volume<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Most recently, on January 11, Coinbase Support <\/span><a href=\"https:\/\/twitter.com\/CoinbaseSupport\/status\/1348664714587369472\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> that they were investigating an issue impacting transactions on their website and mobile apps. According to crypto on-chain analyst Willy Woo, buys on the exchange were not completing. “Coinbase is $350 lower than other exchanges right now, it’s throwing off derivative indexes and likely impacting trade algos,” he <\/span><a href=\"https:\/\/twitter.com\/woonomic\/status\/1348670477477105665\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> on January 11. However, Coinbase says this issue was not connected to the January 6-7 outage.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a separate statement also published Friday, Coinbase vice president of customer experience Casper Sorensen emphasized the exchange’s commitment to its users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We know that we have let many of you down and we are doing everything in our power to turn the page,” he <\/span><a href=\"https:\/\/blog.coinbase.com\/committing-to-better-customer-service-during-this-time-of-heightened-interest-in-the-cryptoeconomy-5dc2637c4fa7\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\">. “Whether you’re a new user or have been with us since day one, we recognize this is frustrating. This is not the experience we want for you, our customers.”&nbsp;<\/span>"],"hashtag":["COINBASE"]}