{"summary":"Expert Take: Rising DeFi TVL is Silencing the Doubters","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/expert-take-defi-tvl-is-silencing-the-doubters.htm","publishDate":"2024-02-28T14:10:27","id":18933,"type":null,"title":"Expert Take: Rising DeFi TVL is Silencing the Doubters","category":["DeFi News "],"content":["As its TVL rises, industry insiders say that DeFi is seeing increasing interest once again. DeFi is robust and will continue to expand, the experts say, adding that 2024 will be an exciting year for this growing sector.","The total value locked in decentralized finance (DeFi) has surpassed $80 billion. It’s the first time it has breached this threshold since the infamous fall of the Terra stablecoin nearly two years ago.","According to DefiLlama, TVL is currently $90.113 billion. The last time it stood at this level was May 2022.","An increase can be seen starting October 2023, picking up speed in January 2024.","Between October 28, 2023, and February 28, 2024, TVL has increased by 108.3%.","Blockchain platform Swarm Markets’ co-founder Timo Lehes commented that,","“The end of the Crypto Winter has led to an increase in investor confidence, which has filtered through into the DeFi market. We expect this trend to continue, especially if the prices of well-known crypto assets continue to rise.”","He noted that the DeFi sector is susceptible to “the vagaries” of the wider market as most other sectors are.","However, the above-mentioned increase proves that the DeFi sector is also resilient.","Furthermore, DeFi projects added more than $42 billion in assets over the past few months. This fact “proves the doubters wrong,” Lehes argued.","Therefore, DeFi will only expand in numbers and size in the coming years, he concluded.","Barney Mannerings, DeFi expert and Founder of Vega Protocol, a decentralized exchange for futures and perpetuals, said that we’re witnessing a growing interest in DeFi again.","In a comment shared with Cryptonews, he argued that there is a new wave of experimentation and innovation in the sector.","This is the result of the introduction of new primitives to the network, Mannerings explained. They are primarily based around Ethereum’s staking and yield functionalities.","Also, the recent gains in the crypto market seem to be “funneled back into protocols.” We commonly see this as a bear market turns bullish, Mannerings said and added:","“The fact that ETH, which many are speculating could be packaged into a new spot exchange-traded fund (ETF), is rising so dramatically is only supercharging this trend. But, the impressive showing of Ethereum Layer-2’s (like Mantle and Gnosis) over the past week is showing that growth is happening in interesting places, too.”","As reported earlier this month, wealth management firm Bernstein suggested that Ethereum may be the only digital asset after Bitcoin to secure a spot ETF approval.","Moreover, United States investors’ activity has led to ETH price hikes in recent weeks. A significant reason is investors’ anticipation of spot Ethereum ETF approvals.","Meanwhile, the “considerable growth” of new DeFi primitives like Pendle are providing more reasons to be excited, the Founder argued.","Coupled with the arrival of modern derivatives exchanges, like Vega, “it’s looking like a very exciting time for DeFi, and it will be interesting to see what 2024 brings.”","____",""],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"October 28, 2023","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"108.3%","content":"PERCENT"},{"type":"Crypto Winter","content":"ORGANIZATION"},{"type":"Vega Protocol","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"$42 billion","content":"MONEY"},{"type":"Bernstein","content":"PERSON"},{"type":"October 2023","content":"DATE"},{"type":"$90.113 billion","content":"MONEY"},{"type":"Pendle","content":"PERSON"},{"type":"Timo Lehes","content":"PERSON"},{"type":"Mantle","content":"PERSON"},{"type":"$80 billion","content":"MONEY"},{"type":"Vega","content":"PERSON"},{"type":"Cryptonews","content":"PERSON"},{"type":"February 28, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Mannerings","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["DeFi","ETF","Ethereum"],"authors":["Sead Fadilpašić"]}