{"summary":"GameStop Retreats from Crypto Space, Shuts Down NFT Marketplace Amid Regulatory Hurdles","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gamestop-retreats-from-crypto-space-shuts-down-nft-marketplace-amid-regulatory-hurdles.htm","publishDate":"2024-01-14T09:00:25","id":18946,"type":null,"title":"GameStop Retreats from Crypto Space, Shuts Down NFT Marketplace Amid Regulatory Hurdles","category":["Altcoin News "],"content":["GameStop has decided to shut down its NFT marketplace, signaling its withdrawal from the cryptocurrency space.","The announcement, made via a statement on the platform, cites “the continuing regulatory uncertainty of the crypto space” as the primary reason behind this decision.","GameStop’s NFT marketplace was officially launched on Halloween in 2022, with a focus on gaming assets and a partnership with ImmutableX, an Ethereum layer 2 blockchain solution.","The move comes as GameStop continues its gradual exit from the cryptocurrency arena, following the discontinuation of its crypto wallet back in August. ","The company assured its customers that they will still have the option to sell their NFTs on alternative marketplaces, as these digital assets are fundamentally hosted on the blockchain and not tied exclusively to any single platform.","The closure of GameStop’s NFT marketplace may not come as a shock to industry observers, given its relatively low impact on the overall NFT trading landscape.","In fact, the marketplace’s X account had remained inactive since September of the previous year.","Nevertheless, the decision represents a noteworthy shift for GameStop, which had attempted to engage its loyal retail trader community through its venture into the world of Web3 in 2022.","","The regulatory uncertainty cited by GameStop is a familiar explanation for the drawdown or cancellation of digital assets initiatives.","The company’s decision reflects recent developments in the crypto industry, particularly the increase in enforcement actions by the United States Securities and Exchange Commission (SEC) under the leadership of Chair Gary Gensler.","Back in June, the commission sued both Binance, the world’s largest cryptocurrency exchange, and Coinbase, the largest US-based cryptocurrency exchange. ","The SEC has also taken enforcement action against crypto exchanges Kraken and Bittrex, as well as crypto lending platform Nexo last year.","Furthermore, Gensler has voiced concern regarding the prevalence of fraud in the crypto market, claiming that there are “far too many” bad actors.","He said that crypto investors should not assume that they are getting the protections of the securities laws even as these laws apply to many of the cryptocurrencies.","“US investors are not getting full, fair, and truthful disclosures. And the platforms, the intermediaries are doing things that we would never allow or think the New York Stock or Nasdaq would do.”","More recently, after a 3-2 vote by SEC commissioners, including Gensler, in favor of allowing spot Bitcoin ETFs, the SEC Chair once again hit back against cryptocurrencies.","“While we approved the listing and trading of certain spot Bitcoin ETP shares today, we did not approve or endorse Bitcoin,” Gensler said in his statement.","He also advised investors to remain cautious about the risks associated with Bitcoin and crypto-related products."],"entity":[{"type":"2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bitcoin ETP","content":"ORGANIZATION"},{"type":"New York Stock","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["GameStop","NFT"],"authors":["Ruholamin Haqshanas"]}