{"summary":"Hacking Incidents Decreased for First Time Since 2021, Still $2 Billion in Crypto Assets Stolen in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hacking-incidents-decreased-for-first-time-since-2021-still-2-billion-in-crypto-assets-stolen-in-2023.htm","publishDate":"2023-12-27T08:49:49","id":18947,"type":null,"title":"Hacking Incidents Decreased for First Time Since 2021, Still $2 Billion in Crypto Assets Stolen in 2023","category":["Altcoin News "],"content":["Despite losing around $2 billion to crypto thefts, 2023 saw a slight decline in hacking incidents targeting the cryptocurrency industry. ","According to a recent report from De.FI, a prominent web3 security firm known for its REKT database, hackers managed to pilfer $2 billion in digital assets throughout the year.","While that amount is still alarming, it marks the first decrease in crypto hacking incidents since 2021. ","The REKT database ranks the most devastating crypto hacks, ranging from the historic breach of the Ronin network in 2022, where hackers looted over $600 million in crypto, to the recent attack on Mixin Network, resulting in a haul of approximately $200 million.","“This cumulative amount of stolen funds, spread across multiple incidents, highlights the ongoing vulnerabilities and challenges within the DeFi ecosystem,” stated De.FI in its report shared with TechCrunch. ","“2023 served as a testament to both the persisting vulnerabilities and the progress made in addressing them, despite muted interest in the space during the first half of the year due to the ongoing bear market.”","Earlier in December, TRM Labs, a blockchain intelligence company, also estimated the total value of crypto stolen by hackers in 2023. ","According to their calculations, the amount reached approximately $1.7 billion by mid-December.","Among the notable crypto thefts of the year, Euler Finance suffered a devastating hack resulting in losses of nearly $200 million. ","Other major breaches targeted Multichain ($126 million), BonqDAO ($120 million), Poloniex ($114 million), and Atomic Wallet ($100 million), among countless others.","In 2022, Chainalysis, a blockchain monitoring firm, reported an all-time high of $3.8 billion stolen by cybercriminals in the crypto realm. ","Notably, North Korean government hackers, known as the Lazarus Group, accounted for $1.7 billion of that total. ","The group’s prolific activities aimed to fund the country’s nuclear weapons program in violation of international sanctions.","Back in 2021, hackers managed to seize $3.3 billion in digital assets, according to data from Chainalysis. ","In a recent interview, Raz Niv, co-founder and CTO at the Web3 security company Blockaid, and Kate Kurbanova, co-founder of risk management firm Apostro, discussed the evolution and high adaptability of crypto thieves.","He claimed that hackers are not necessarily always a couple of steps ahead of security. Rather, attackers are highly adaptable.","“The relationship between security measures and cyber threats is more akin to a continuous cat-and-mouse game, particularly in our rapidly evolving industry,” he said. ","“Attackers possess the ability to identify vulnerabilities in current infrastructure and exploit them for their benefit.”",""],"entity":[{"type":"mid-December","content":"DATE"},{"type":"Kate Kurbanova","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"$3.8 billion","content":"MONEY"},{"type":"Mixin Network","content":"ORGANIZATION"},{"type":"$114 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Chainalysis","content":"PERSON"},{"type":"$126 million","content":"MONEY"},{"type":"Raz Niv","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"Euler Finance","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Crypto hack"],"authors":["Ruholamin Haqshanas"]}