{"summary":"US Authorities Arrest and Charge Samourai Wallet Founders for Money Laundering","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-authorities-arrest-and-charge-samourai-wallet-founders-for-money-laundering.htm","publishDate":"2024-04-25T01:33:15","id":18945,"type":null,"title":"US Authorities Arrest and Charge Samourai Wallet Founders for Money Laundering","category":["Bitcoin News "],"content":["American authorities have charged crypto mixer Samourai Wallet founders for allegedly operating an unlicensed money-transmitting business.","In an announcement, U.S. authorities said Samourai Wallet founders Keonne Rodriguez and William Lonergan Hill have been found guilty of allegedly executing over $2 billion in unlawful transactions and laundering over $100 million in criminal proceeds.","The co-founders unlawfully combined multiple unique features to execute anonymous financial transactions. The Samourai Wallet offered a “privacy” service which keeps your transactions private and your identity masked. Both of the defendants knew that it was a haven for criminals to engage in large-scale money laundering and sanctions evasion, said the U.S. Department of Justice press release.","From 2015 through February 2024, both Rodriguez and Hill developed, marketed, and operated a cryptocurrency mixing service known as Samourai, which was an unlicensed money-transmitting business from which they earned millions of dollars in fees. ","According to the release, the defendants intended and knew that a substantial portion of the funds that Samourai processed were criminal proceeds passed through Samourai for purposes of concealment. ","“During the relevant period, Samourai laundered over $100 million of crime proceeds originating from, among other criminal sources, illegal dark web markets, such as Silk Road and Hydra Market; various wire fraud and computer fraud schemes, including a web-server intrusion, a spearphishing scheme, and schemes to defraud multiple decentralized finance protocols; and other illegal activities,” said the DoJ. ","The DoJ said both Rodriguez and Hill operated social media Twitter (now X) accounts that encouraged and openly invited users to launder criminal proceeds through Samourai. ","Giving an example from around June 2022, Samourai’s Twitter account which was being operated by Rodriguez — posted the following message regarding Russian oligarchs seeking to circumvent sanctions:","","The authorities said in a private message on or about August 27, 2020, Hill also using a Twitter account with the username “Samourai Dev” — discussed the use of Samourai by criminals operating in online black markets such as Silk Road in private messages with another Twitter user.","The U.S. authorities have been clamping down on cryptocurrency crime. Recently Chainalysis’ Crypto Crime Report highlighted that funds sent to mixers from illicit addresses decreased by nearly half a billion dollars last year “likely due to law enforcement and regulatory efforts.”"],"entity":[{"type":"June 2022","content":"DATE"},{"type":"a billion dollars","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"February 2024","content":"DATE"},{"type":"Samourai Wallet","content":"ORGANIZATION"},{"type":"Samourai","content":"LOCATION"},{"type":"Samourai","content":"PERSON"},{"type":"Samourai Dev","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"August 27, 2020","content":"DATE"},{"type":"Rodriguez","content":"PERSON"},{"type":"Samourai Wallet founders Keonne Rodriguez","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"DoJ","content":"ORGANIZATION"},{"type":"William Lonergan Hill","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["anti-money laundering","Crypto mixers","Samourai Wallet"],"authors":["Tanzeel Akhtar"]}