{"summary":"DeFi Protocol Tranchess Launches New Staking Products Offering Fixed and Leveraged Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tranchess-launches-new-staking-products-with-lido-finance.htm","publishDate":"2024-02-15T14:01:42","id":18940,"type":null,"title":"DeFi Protocol Tranchess Launches New Staking Products Offering Fixed and Leveraged Returns","category":["Altcoin News "],"content":["Tranchess, a decentralized protocol specializing in risk-adjusted yield solutions for digital assets, announced the launch of two new staking products . These products, dubbed “staYETH” and “turYETH,” aim to provide investors with diversified options for earning yield on their staked Ether (ETH).","Stable and Leveraged Options:","staYETH: Inspired by traditional “risk-free” investments, staYETH offers a steady, predictable return on staked ETH. This aims to attract investors seeking lower volatility and familiarity with conventional financial instruments.","turYETH: Designed for those seeking aggressive growth, turYETH utilizes leverage on yield differentials to potentially amplify returns when staking rewards increase. This caters to investors with higher risk tolerance.","The launch comes amidst growing interest in liquid staking, a DeFi segment that has shown resilience even during market downturns.","Tranchess highlights the rising institutional demand for sophisticated DeFi products and positions staYETH and turYETH as catering to both new and existing users seeking refined solutions.","The collaboration between Tranchess and Lido, one of the largest liquid staking services in DeFi, reflects a shared vision of democratizing access to staking for various investor types. Danny Chong, co-founder of Tranchess, said in a statement shared with Cryptonews,","DeFi has seen significant growth in the user base of Liquid Stakers, signaling market maturation despite the bear market. Notably, we’re witnessing a surge in institutional interest, a clear indicator that the market is evolving beyond its early stages.","Both parties anticipate the next DeFi wave to be driven by innovative and accessible products like staYETH and turYETH.","With the approval of the Spot Bitcoin ETF and the possible future of a Spot Ethereum ETF, an increased need for liquid staking solutions is expected."],"entity":[{"type":"Lido","content":"LOCATION"},{"type":"Tranchess","content":"ORGANIZATION"},{"type":"Danny Chong","content":"PERSON"}],"hashtag":["DeFi","Ethereum staking"],"authors":["Jai Pratap"]}