{"summary":"dYdX Community Votes to Stake $60 Million for Network Security Boost – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dydx-community-vote-stake-60-million-security-boost.htm","publishDate":"2024-04-08T15:47:10","id":18956,"type":null,"title":"dYdX Community Votes to Stake $60 Million for Network Security Boost – Here’s What You Need to Know","category":["Altcoin News "],"content":["The dYdX community has voted to stake 20 million dYdX tokens, worth around $60 million at the time of publication, using Stride’s staking service for Cosmos blockchains.","The decentralized exchange (DEX) platform dYdX allows users to trade perpetual futures contracts (aka perpetual contracts). In its most recent iteration (dYdX v4), it moved to launch its own fully independent blockchain dYdX chain in October 2023 built on the Cosmos blockchain.","This blockchain is completely independent of its parent company, as dYdX’s DAO oversees its governance. dYdX’s native token also doubles as its governance token. Through the DAO, dYdX holders can participate in major protocol decisions. They can also propose and vote on protocol upgrades or changes such as algorithm changes, funds managment, and chain upkeep.","This aids in dYdX ’s mission to provide users with a community-driven trading experience. ","It is the dYdx community that is responsible for the recent move to stake 20 million dYdX tokens, with Stride’s staking service for Cosmos blockchains. In a vote with 81% participation, the measure passed with 91% support.","Stride is a blockchain that provides liquidity for staked tokens. Users can liquid-stake their tokens from any Cosmos chain using Stride, earning a yield. This provides improved liquidity, allowing stakers to trade coins regardless of whether there are any buyers or sellers.","The proposal aims to boost the economic security of the network and encourage stake diversity in its community. The tokens staked in the liquidity pool will earn USDC rewards, which will be automatically compounded into more dYdX tokens as “the yield from fees generated will be continuously used via Stride to buy dYdX”, said dYdX founder, Antonio MJuliano.","The dYdX community has voted to stake part of the treasury","The yield from fees generated will be continuously used via Stride to buy DYDX which will be returned back to the treasury","— Antonio | dYdX (@AntonioMJuliano) April 7, 2024","","With its current network architecture, it is possible that a staker with just one third of the total voting power can completely halt operations. With two thirds giving them the authority to missallocate funds. ","Consequently, it’s current $456 million voting power would require an independent $912 Million stake to take control of the protocol. dYdX commented that this “ isn’t such a high barrier when we factor in that only 11.5% of the total supply of dYdX are staked.”","The proposal increases the number of stakeholders who can contribute to governance choices by evening the voting power of validators. This reinforces dYdX’s mission of decentralization and community-driven trading. Stride can boost the protocol’s resilience to network outages and voting power concentration.","The main concern is that transferring the community’s treasury to a liquid staking service will result in a lower Annual Percentage Rate (APR) for present staking users. This could make the token less appealing to new investors, which is critical for increasing the number of active traders and the token’s value for the long-term growth of dYdX. ","Additionally, reducing the APR for stakers would temporarily increase the validator’s fee, which ”does not serve the community’s best interest” as “validators should see their profits rise with the growth in transaction fees as the trader base expands substantially.” according to user eguegu on a dYdX forum discussing the proposition.","However, Stride welcomed the proposal and offered to charge fees of only 7.5%, a 2.5% discount from its usual fees of 10% – effectively reducing the impact on APR. “This [proposal] will boost the economic security of dYdX chain, while improving stake decentralization,” the firm wrote on X. ","The @dYdX proposal to liquid stake 20M DYDX with Stride has passed ✅","An overwhelming 91.7% voted yes, with less than 1% voting no. Voter turn-out was an impressive 81.6%.","This prop will boost the economic security of dYdX chain, while improving stake decentralization 👍","— Stride (@stride_zone) April 7, 2024","","",""],"entity":[{"type":"7.5%","content":"PERCENT"},{"type":"81%","content":"PERCENT"},{"type":"91%","content":"PERCENT"},{"type":"91.7%","content":"PERCENT"},{"type":"APR","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"11.5%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"$456 million","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"$912 Million","content":"MONEY"},{"type":"Stride","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"X.","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"Stride","content":"ORGANIZATION"},{"type":"81.6%","content":"PERCENT"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"April 7, 2024","content":"DATE"}],"hashtag":["Cosmos","dydx","Staking"],"authors":["Harvey Hunter"]}