{"summary":"Unpublished Tweets by Sam Bankman-Fried Offer Insights into His Mental Health","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/unpublished-tweets-by-sam-bankman-fried-offer-insights-into-his-mental-health.htm","publishDate":"2023-10-02T18:00:00","id":18960,"type":null,"title":"Unpublished Tweets by Sam Bankman-Fried Offer Insights into His Mental Health","category":["Altcoin News "],"content":["A series of unpublished tweets belonging to FTX founder Sam Bankman-Fried have revealed insights into his mental health and prescribed medication. ","The unposted tweets, obtained by CoinDesk, indicate that Bankman-Fried has been discussing his mental health struggles, including mild depression and anhedonia, the inability to experience pleasure, since at least December.","“Things are a spectrum,” Bankman-Fried wrote before his arrest last year on fraud and conspiracy charges. ","“I don’t have major depressive disorder, probably. But I do generally test positive for dysthymia [a form of mild, long-term depression], and anhedonia [the inability to feel pleasure]. My lows aren’t unusually low – but I generally don’t have highs.”","Last week, the New York Times published highlights from 250 pages of similar draft tweets, which were leaked by social media personality and Bankman-Fried’s confidante, Tiffany Fong. ","Bankman-Fried’s tweets indicate that he first became aware of his mental health issues during high school, describing a lack of happiness and an inability to comprehend the concept. ","He revealed that he had been prescribed an antidepressant called EmSam for the past decade to help manage his mental well-being. ","Bankman-Fried was an advocate for EmSam and even hired a psychiatrist as a company coach, who allegedly liberally dispensed prescriptions to FTX employees, according to Department of Justice attorneys.","While in custody at the Metropolitan Detention Center in Brooklyn, Bankman-Fried’s attorney raised concerns about his access to prescription drugs, claiming that he was not receiving his Adderall and was worried about running out of EmSam. ","Additionally, his vegan dietary restrictions were not considered, resulting in a limited diet consisting mainly of bread, water, and peanut butter.","Bankman-Fried’s unpublished tweets portray a detachment from material possessions and a lack of belief that they would bring him happiness. ","“I’ve never really been into fancy things. I’d like to think it’s because it would be selfish, but honestly a lot of it is because fancy things won’t make me happy anyway. Because nothing will,” Bankman-Fried wrote.","He also expressed remorse for what happened in the unpublished tweets and committed to providing value to FTX customers.","The Department of Justice has attempted to prevent Bankman-Fried’s attorneys from presenting a mental disease defense, arguing that they were not given proper notice before the deadline.","Last month, the agency argued that questions related to effective altruism were not only unnecessary but also an attempt to shape a defense narrative suggesting that the defendant was accumulating wealth to improve the world. ","They also deemed questions about Bankman-Fried’s ADHD and related medication as irrelevant and prejudicial, emphasizing that no notice of a mental disease or condition defense had been provided within the court’s imposed deadline.","Both Bankman-Fried and the DOJ have submitted voir dire questions, which were intended to identify if any of the possible jurors are familiar with the case, specifically with crypto or with effective altruism.","One of the suggested questions asked “If a company involved in the cryptocurrency industry or the financial industry fails, do you feel that only the owners of the company must be to blame?”"],"entity":[{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Brooklyn","content":"LOCATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Tiffany Fong","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","Legal","Sam Bankman-Fried"],"authors":["Ruholamin Haqshanas"]}