{"summary":"Binance CEO Claims Nigeria Demanded Secret Settlement From Now Detained Binance Executive In January","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/richard-teng-says-tigran-gambaryan-and-binance-employees-offered-settlement-prior-to-binance-executives-detainment.htm","publishDate":"2024-05-07T15:22:11","id":18967,"type":null,"title":"Binance CEO Claims Nigeria Demanded Secret Settlement From Now Detained Binance Executive In January","category":["Blockchain News "],"content":["Now detained Binance executive Tigran Gambaryan and representatives of the crypto exchange were allegedly pressured by a government official to accept a secret agreement to settle Nigeria’s claims against the exchange, Binance CEO Richard Teng revealed in a blog post on Tuesday.","According to Teng, Gambaryan and several Binance employees attended a meeting with members of Nigeria’s House Committee on Financial Crimes (HCFC) to discuss “the nature of the issues at hand” ahead of a pre-investigative hearing involving the crypto exchange. ","During the meeting, HCFC officials allegedly warned the Binance employees that they were prepared to issue arrest warrants against them and prevent them from leaving the country.","As Binance employees left this meeting, they were allegedly “approached by unknown persons” who promised to “make these issues go away” should they accept a secret settlement.","My friend and colleague, Tigran Gambaryan, has been unlawfully detained by the Nigerian government for more than 70 days. We're tirelessly working to #BringTigranHome.","For the first time publicly, I'm sharing the full context of this situation here. ⤵️https:\/\/t.co\/Rg3DEYJZgW","— Richard Teng (@_RichardTeng) May 7, 2024","","According to a Tuesday report by The New York Times, this “settlement” was actually a $150 million bribe from “someone in the Nigerian government.”","“Counsel reported back that he had been presented with a demand for a significant payment in cryptocurrency to be paid in secret within 48 hours to make these issues go away and that our decision was expected by the morning,” Teng wrote. “Our team grew increasingly concerned about their safety in Nigeria and immediately departed.”","Gambaryan and fellow Binance executive Nadeem Anjarwalla traveled back to Nigeria the following month for a meeting with the CEO of the Nigerian SEC, the country’s national security adviser, and the central bank’s deputy governor.","“Despite the clear risks, Tigran Gambaryan and Nadeem Anjarwalla (Head of Binance Africa) received multiple assurances that they would be granted safe passage for their meetings,” Teng said.","It was following this meeting that the duo was detained, with Anjarwalla fleeing shortly thereafter, only to be reportedly recaptured in Kenya just weeks ago.","The news of the bribe comes as Nigeria announced plans to delist the naira from peer-to-peer (P2P) platforms to prevent manipulation. Changes are set to roll out in the coming days.","The country’s government previously blamed the cryptocurrency sector for crashing the value of the nation’s currency, with inflation hitting a near 30-year high of 33.20% in March. ","Meanwhile, both Gambaryan and Anjarwalla have been charged with money laundering and tax evasion.","The two Binance executives are due back in court for a hearing on May 17."],"entity":[{"type":"33.20%","content":"PERCENT"},{"type":"Gambaryan","content":"PERSON"},{"type":"Kenya","content":"LOCATION"},{"type":"May 17","content":"DATE"},{"type":"Teng","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Nigerian SEC","content":"ORGANIZATION"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"Nadeem Anjarwalla (Head of Binance Africa","content":"ORGANIZATION"},{"type":"May 7, 2024","content":"DATE"},{"type":"Nigeria’s House Committee on Financial Crimes (HCFC","content":"ORGANIZATION"},{"type":"HCFC","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","Nigeria","richard teng"],"authors":["Julia Smith"]}