{"summary":"Breaking: Coinbase Crashes, Sparking Bitcoin Bull Run Hopes as Market Remembers Past Surges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/breaking-coinbase-crashes-sparking-bitcoin-bull-run-hopes-as-market-remembers-past-surges.htm","publishDate":"2024-02-28T18:25:46","id":18963,"type":null,"title":"Breaking: Coinbase Crashes, Sparking Bitcoin Bull Run Hopes as Market Remembers Past Surges","category":["Bitcoin News "],"content":["The popular cryptocurrency exchange Coinbase experienced a major outage today, causing a brief dip in Bitcoin’s price. Interestingly, this crash has fueled fresh speculation about a potential Bitcoin bull run. The market appears to be drawing parallels with previous Coinbase crashes, which preceded major surges in Bitcoin’s price.","Between 12:15 PM ET and 12:30 PM ET today, Bitcoin’s price experienced a drop from $64,000 to $58,200, representing a 10% swing in just 15 minutes. This volatility occurred during a period when many Coinbase users reported their accounts reflected $0 balances.","Despite the temporary setback caused by the outage, Coinbase has reassured users that their assets are safe.","“We are aware that some users may see a zero balance across their Coinbase accounts & may experience errors in buying or selling,” Coinbase tweeted. “Our team is investigating this & will provide an update shortly. Your assets are safe. You can track this incident at http:\/\/status.coinbase.com“","","In the hours leading up to the crash, Bitcoin’s price and trading volume exhibited upward momentum, echoing the market activity of 2021 when the cryptocurrency hit record highs. Bitcoin’s volume increased by 20%, reaching $66.4 billion. It briefly touched $64,000 before Coinbase went down, coming within 10% of its all-time high of $69,045 reached in November 2021.","This is absolutely insane:","The Coinbase, $COIN, crash just erased $100 BILLION of market cap in #Bitcoin in 15 minutes.","Between 12:15 PM ET and 12:30 PM ET, Bitcoin fell from $64,000 to $59,000.","This was a near 9% swing in 15 minutes right as many Coinbase users began showing… pic.twitter.com\/fUcRusrddX","— The Kobeissi Letter (@KobeissiLetter) February 28, 2024","","","The sudden price dip linked to the Coinbase crash appears to have had a counterintuitive effect on market sentiment. Many investors are interpreting this event as a catalyst for a potential Bitcoin bull run ahead of the halving event. The market’s enthusiasm appears undeterred by the crash, which some analysts estimate erased $100 billion of Bitcoin’s market capitalization in mere minutes.","“Coinbase crash literally happened like once a month last bull,” crypto trader @hash_cough tweeted. “This is your entry, not your exit.”"],"entity":[{"type":"$59,000","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"$COIN","content":"MONEY"},{"type":"$100 BILLION","content":"MONEY"},{"type":"$69,045","content":"MONEY"},{"type":"$0","content":"MONEY"},{"type":"$58,200","content":"MONEY"},{"type":"$66.4 billion","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"February 28, 2024","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"$64,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin Price","bull run","Coinbase"],"authors":["Trent Alan"]}