{"summary":"A quick recap of top stories and developments in the crypto world last week, including funding rounds, job cuts and FTX updates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206479\/weekly-wrap-up-big-funding-rounds-layoffs-and-ftx-developments","publishDate":"2023-01-28T07:01:34","id":1896,"type":null,"title":"Weekly wrap-up: Big funding rounds, layoffs and FTX developments","category":["COMPANIES"],"content":["The past week saw an interesting set of big funding announcements, although the overall market sentiment remains bearish. Several companies announced job cuts as they struggled to stay afloat with the repercussions of FTX's collapse and the so-called crypto winter. Speaking of FTX, its new creditors were revealed last week, and the company's lawyers sought answers from disgraced founder Sam Bankman Fried's immediate family.","Long-term investors continue to see value in the bear market. A number of companies announced significant funding rounds, including Blockstream and QuickNode.","QuickNode, a web3 infrastructure firm that provides blockchain development tools, <a href=\"https:\/\/www.theblock.co\/post\/205028\/quicknode-reaches-800-million-valuation-in-series-b-round\" data-v-f87c67ca=\"\">raised<\/a> $60 million in a Series B round and reached a valuation of $800 million. The lead investor was Dan Tapiero's 10T Holdings and participants included Alexis Ohanian's Seven Seven Six, Tiger Global, Protocol Labs and QED Investors.","Crypto infrastructure company Blockstream <a href=\"https:\/\/www.theblock.co\/post\/205272\/crypto-infrastructure-firm-blockstream-raises-125-million-to-expand-mining-services\" data-v-f87c67ca=\"\">raised<\/a> $125 million in convertible note and secured loan financing to expand its bitcoin mining hosting services. Kingsway Capital led the convertible note, with other investors including Fulgur Ventures. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSpatial Labs, a web3 infrastructure firm focused on improving metaverse and commerce, also <a href=\"https:\/\/www.theblock.co\/post\/205813\/spatial-labs-iddris-sandu-seed-funding\" data-v-f87c67ca=\"\">raised<\/a> a notable round — $10 million in seed funding. It was a rare slice of cash for a Black founder in the U.S., where only about 1% of venture capital funding went to startups with Black founders in 2022, according to Crunchbase data. Spatial Labs' 25-year-old founder and CEO, Iddris Sandu, says he may be the first Black founder under 30 to raise a double-digit million seed round.","Several businesses announced job cuts last week as crypto continues to grapple with challenging market conditions.","Digital Currency Group (DCG)-owned crypto exchange Luno <a href=\"https:\/\/www.theblock.co\/post\/205419\/digital-currency-groups-luno-cuts-35-of-staff\" data-v-f87c67ca=\"\">cut<\/a> 35% of its workforce, citing the \"incredibly tough year\" affecting the crypto market. Luno reportedly had a total headcount of 960, meaning more than 330 jobs were lost. DCG has come under increasing pressure over the past year as the crypto downturn intensified amid a turbulent macroeconomic backdrop. The collapse of crypto hedge fund Three Arrows Capital in June and the failure of FTX in November exacerbated the firm's underperformance.","Crypto exchange Gemini <a href=\"https:\/\/www.theblock.co\/post\/204738\/gemini-lays-off-10-of-staff-amid-troubles-at-genesis-dcg-the-information\" data-v-f87c67ca=\"\">shed<\/a> 10% of its staff in a third round since June. Gemini cut 10% of its workforce in June, followed by more layoffs the following month. As a result, its overall headcount slipped from 1,100 at the start of 2022 to about 700 people near the end of the year. Gemini halted client withdrawals for its Earn product in November as its lending partner, Genesis Global Capital (a DCG unit), paused withdrawals amid severe liquidity issues. Genesis filed for bankruptcy protection and owes more than $765 million to some 340,000 Gemini Earn customers.","Crypto services provider Matrixport, owned by billionaire entrepreneur Jihan Wu, cut 10% of its workforce, or about 30 employees. Matrixport had more than 290 employees.","Crypto tax unicorn CoinTracker <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/206106\/crypto-tax-unicorn-cointracker-lays-off-19-employees-citing-industry-gloom-over-hiring?utm_source=twitter&amp;utm_medium=social\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/206106\/crypto-tax-unicorn-cointracker-lays-off-19-employees-citing-industry-gloom-over-hiring?utm_source=twitter&amp;utm_medium=social\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">cut<\/a> about 20% of its staff, or 19 employees, citing market headwinds and “over-hiring.”","The FTX case continued to see developments after its bankruptcy protection filing in November. Last week, a new, extensive list of FTX's creditors was <a href=\"https:\/\/www.theblock.co\/post\/205859\/ftx-creditor-list-includes-star-athletes-crypto-firms-state-governments\" data-v-f87c67ca=\"\">revealed<\/a>, which includes tech giants, athletes and governments. Amazon Web Services, Apple, Meta Platforms, Twitter, Netflix, Adobe, Tom Brady, U.S. state tax, consumer affairs, and attorneys general offices are all listed as FTX creditors.","FTX bankruptcy lawyers are seeking permission to subpoena former CEO Bankman-Fried, his family and top lieutenants at the collapsed crypto exchange, new court documents <a href=\"https:\/\/www.theblock.co\/post\/205947\/ftx-seeks-permission-to-subpoena-sam-bankman-fried-family-and-insiders?utm_source=companies&amp;utm_medium=rss\" data-v-f87c67ca=\"\">showed<\/a>.","Lawyers are targeting Bankman-Fried's parents, Joseph Bankman and Barbara Fried, and his brother, Gabriel Bankman-Fried, saying the trio acted as his advisers. They also named FTX co-founders Gary Wang and Nishad Singh, former Alameda Research CEO Caroline Ellison and Constance Wang, the former chief operating officer of FTX Trading Ltd. and co-CEO of FTX Digital Markets Ltd, in the documents. Lawyers are seeking information and documents regarding FTX’s assets and business operations and the personal assets of FTX insiders, among other things.","Lawyers for Bankman-Fried, on the other hand, argued that he should be allowed access to assets and crypto held by FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.","\"Nearly three weeks have passed since the initial pretrial conference and we assume that the Government’s investigation has confirmed what Mr. Bankman-Fried has said all along; namely, that he did not access and transfer these assets,\" Bankman-Fried’s lawyer, Mark Cohen, <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.51.0.pdf\" data-v-f87c67ca=\"\">said<\/a> in a letter. \"Given that the sole basis advanced for seeking that condition has not been supported, we believe that the bail condition imposed at the conference should be removed.\"","Finally, U.S. Attorneys <a href=\"https:\/\/www.theblock.co\/post\/206462\/prosecutor-seek-to-restrict-bankman-frieds-bail-terms-after-apparent-attempts-to-influence-witnesses?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">asked<\/a> a federal judge to bar Bankman-Fried from communicating with current and former employees of FTX without a lawyer present, after prosecutors alleged that he recently contacted a potential witness in his criminal case. Prosecutors also seek to restrict Bankman-Fried’s access to encrypted messaging services.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Kingsway Capital","content":"ORGANIZATION"},{"type":"10T Holdings","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"FTX Trading Ltd.","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"$60 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"Barbara Fried","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Gary Wang","content":"PERSON"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"Gabriel Bankman","content":"PERSON"},{"type":"Matrixport","content":"LOCATION"},{"type":"Fulgur Ventures","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Meta Platforms","content":"ORGANIZATION"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"FTX Digital Markets Ltd","content":"ORGANIZATION"},{"type":"Dan Tapiero","content":"PERSON"},{"type":"Sam Bankman Fried","content":"PERSON"},{"type":"Iddris Sandu","content":"PERSON"},{"type":"$125 million","content":"MONEY"},{"type":"$765 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Constance Wang","content":"PERSON"},{"type":"Government","content":"ORGANIZATION"},{"type":"Jihan Wu","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"$800 million","content":"MONEY"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Yogita Khatri","The Block"]}