{"summary":"Web3 Games on Telegram: Inco and Privy Develop Non-Custodial Dapps on the Social Media Giant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-games-on-telegram-inco-and-privy-develop-non-custodial-dapps-on-the-social-media-giant.htm","publishDate":"2024-05-09T14:04:32","id":18961,"type":null,"title":"Web3 Games on Telegram: Inco and Privy Develop Non-Custodial Dapps on the Social Media Giant","category":["Blockchain News "],"content":["Thanks to a recent partnership, developers can build non-custodial, on-chain Web3 games and products as Telegram Mini Apps (TMAs).","Inco, developers of a universal confidentiality layer for Ethereum and other networks, has announced its partnership with Privy, an embedded wallet provider that enables crypto app developers to onboard their users easily.","Developers can now access users directly in Telegram, a mega-popular social media platform with 900 million users worldwide.","Therefore, building decentralized apps (Dapps) as TMAs allows developers to “create a consumer-friendly experience and tap into the largest pool of retail users,” the press release said.","These web apps run inside Telegram Messenger, meaning that users can access them in individual or group chats.","More specifically, users can launch “an embedded web interface with an experience similar to other popular in-app browsers,” the team said.","Launching a TMA is as simple as starting a chat conversation with an app’s Telegram handle,” it added.","As an example, the team gave a poker game running fully on-chain. Players don’t have to trust the ‘dealer.’ Instead, they can check their play thanks to the encryption technology called Fully Homomorphic Encryption (FHE).","Notably, Inco has already created “a number of demo apps,” it said. These include Slot Machine (@inco_slots_demo_bot) and Hangman (@IncoHangmanGameBot).","Both of these games utilize FHE for on-chain confidentiality and randomness.","","Inco is a confidentiality-focused Ethereum Virtual Machine (EVM) powered by FHE, the team said.","Developers can use it to build decentralized apps and mini-games that work with their wallet providers.","Shout out to the incognito community for 10k. We will exponentially grow in the coming months as we are the hegemon of enabling net new use cases of on-chain decentralized applications on your favorite L1\/2. https:\/\/t.co\/U2lrLQ8ki4","— Surag (@suragsheth) May 5, 2024","","The various game types include slot machines, card games, guessing games, prediction markets, and more.","This enables “new forms of gameplay with confidential elements,” it added.","Furthermore, while many TMAs provide their own custodial wallets, which is a security risk, “developers can now integrate Privy SDK to provision self-custodial wallets for users to securely power on-chain experiences from Telegram.”","Additionally, developers are free to access Inco’s open-source repo to start building similar experiences within Telegram.","Explaining this further, the team said that Telegram Mini Apps can be built using popular web development standards like HTML, CSS, and JavaScript \/ React.","Building a Web3 product as a Telegram Mini App provides several advantages, including:","Per Privy COO Max Segall, this partnership will help developers meet their users where they are – many of them being on Telegram.","Inco CEO Remi Gai commented that “building decentralized apps directly within Telegram will become the next trend.” What’s more, it will boost the Web3 industry development.","“Easy-to-access, share, and scalable apps represent a new wave of dapps,” Gai added."],"entity":[{"type":"Privy SDK","content":"ORGANIZATION"},{"type":"Telegram Mini App","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Max Segall","content":"PERSON"},{"type":"Remi Gai","content":"PERSON"},{"type":"May 5, 2024","content":"DATE"},{"type":"Slot Machine (","content":"ORGANIZATION"},{"type":"Inco","content":"ORGANIZATION"},{"type":"CSS","content":"ORGANIZATION"},{"type":"Telegram Mini Apps","content":"ORGANIZATION"},{"type":"TMA","content":"ORGANIZATION"}],"hashtag":["Dapp","Gaming","Telegram"],"authors":["Sead Fadilpašić"]}