{"summary":"Spot Bitcoin ETF Approval Was a Sell-the-News Event: CryptoQuant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spot-bitcoin-etf-approval-was-a-sell-the-news-event-cryptoquant.htm","publishDate":"2024-01-18T07:16:32","id":18971,"type":null,"title":"Spot Bitcoin ETF Approval Was a Sell-the-News Event: CryptoQuant","category":["Bitcoin News "],"content":["It has been a whole week since the U.S. Securities and Exchange Commission (SEC) approved Spot Bitcoin exchange-traded funds (ETFs) and unsurprisingly this has been a “sell-the-news” type of event.","Many cryptocurrency traders decided to use this event as the perfect opportunity to sell, according to South Korean data firm CryptoQuant.","The Spot Bitcoin ETF products started trading with record volumes for an ETF launch and additionally, Coinbase exchange saw record-high OTC desk transfer volumes. Most Bitcoin ETFs are trading at a premium to spot Bitcoin, reports CryptoQuant.","The data firm explains the approval of the Bitcoin ETFs would be a “sell-the-news” event, with price declining as much as 15% since January 11 from $48,70 to as low as $41,500.","During press time, Bitcoin was seeing support within the $41,000 and $43,000 range, although the possibility of a downtrend cannot be ruled out. Nonetheless, the crypto bellwether still maintains positive momentum, supported by several factors.","However, CryptoQuant notes that several on-chain metrics and indicators still suggest the price correction may not be over or at least that a new rally is still not on the cards. Short-term traders and large Bitcoin holders are still doing significant selling in a context of “risk-off” attitude.","The spot Bitcoin ETFs are seeing huge inflows having achieved a cumulative trading volume of nearly $10 billion within just three days, reports Ruholamin Haqshanas from Cryptonews.","According to Bloomberg analyst James Seyffart, the standout performer among the spot Bitcoin ETFs is Grayscale’s GBTC, which recorded an impressive three-day trading volume of $5.174 billion. BlackRock’s IBIT also saw substantial engagement, reaching $1.997 billion in trading volume, while FBTC recorded $1.479 billion during the same period. Together, these three ETFs accounted for an impressive $9.771 billion in trading volume, indicating strong investor interest in the cryptocurrency market.","Once again the social elite are gathered in Davos for the World Economic Forum (WEF) – a global event bringing together the most influential players in politics and business to discuss the upcoming trends in business. Crypto attendees are showing signs of optimism this year all due to the SEC approving the ETFs.","“The recent ETF approval symbolizes a new era and the recognition of the potential of cryptocurrency and blockchain as a technology and as digital assets that can now be invested and supported more broadly by all types of investors,” said Sebastien Borget, COO and co-founder of The Sandbox, from Davos."],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"Davos","content":"LOCATION"},{"type":"the World Economic Forum (WEF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"COO","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$43,000","content":"MONEY"},{"type":"$10 billion","content":"MONEY"},{"type":"January 11","content":"DATE"},{"type":"$41,500","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$1.479 billion","content":"MONEY"},{"type":"$9.771 billion","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$48,70","content":"MONEY"},{"type":"Sebastien Borget","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"$5.174 billion","content":"MONEY"},{"type":"$1.997 billion","content":"MONEY"}],"hashtag":["CryptoQuant","Exchange Traded Funds","Sell-the-News"],"authors":["Tanzeel Akhtar"]}