{"summary":"Beauty and Fashion Brands Use Web3 Technology To Better Engage With Consumers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/beauty-and-fashion-brands-use-web3-technology-to-better-engage-with-consumers.htm","publishDate":"2024-04-13T16:18:54","id":18973,"type":null,"title":"Beauty and Fashion Brands Use Web3 Technology To Better Engage With Consumers","category":["Blockchain News "],"content":["Before the emergence of Web3, brands primarily relied on Web2 channels, such as social media, to connect with consumers. In fact, recent statistics show that 77 percent of businesses use social media to reach customers. ","Consumer engagement strategies are evolving, however. With the maturation of new technologies like blockchain and artificial intelligence, forward-thinking brands have started incorporating these elements to better engage with consumers. ","Jana Bobosikova, Co-Founder of community commerce company KIKI World, told Cryptonews that while the internet provides a platform for brands to be seen, new technologies can ensure that online products are not just passively consumed. ","“KIKI is on a mission to empower passionate consumers,” said Bobosikova. “We founded the company with a simple vision that customers and communities should be rewarded and able to participate in the success of what they champion.” ","To ensure this, Bobosikova explained that KIKI uses blockchain infrastructure to connect its community with products that may interest them. ","Known as the “KIKI platform,” Bobosikova mentioned that this permissionless network allows creators, brands, or curious individuals to create campaigns that reward their audience for participation.","“Our blockchain infrastructure unlocks connectivity between communities, products and interests, building a composable network of data that can be used to build new experiences, connections and products,” she explained. ","Today, we're thrilled to share a staged roll-out of a permissionless community commerce platform and @a16zcrypto and @EsteeLauder Companies as our initial funding round partners.","KIKI sees the internet and the communities it connects as the engine that creates and innovates,… pic.twitter.com\/sxXgKUllox","— KIKI World (@kikiworld_) April 9, 2024","","To put this in perspective, Bobosikova shared that the KIKI platform has launched a number of “multiplayer brands” recently. ","“This refers to products that allow thousands of customers to participate in what we build next,” she said. ","For example, Bobosikova noted that in May 2023, KIKI launched a campaign that resulted in its first co-created product. ","“The ‘Pretty Nail Graffiti in Pearl’ was KIKI’s first community-created product. Since then, we’ve launched 4 additional product lines including the SDK Skin Development Kit and Play Paint Marker, which is a 3D Face and Body Paint,” said Bobosikova.","According to Bobosikova, all of these products were created through community input and voting mechanisms. She added that participants are rewarded for their actions with “KIKI points,” or digital collectibles. ","Digital collectibles are a critical part of KIKI’s infrastructure. Bobosikova explained that KIKI’s on-chain collectibles and the metadata they represent enable engagement logic around user interest.","“Coalescing on and off-chain campaign interaction data tied to user preferences and intent allows our ecosystem to build rich profiles to better understand and create products that our audience truly wants,” she said. “Our smart contracts allow for the seamless integration of abstracted on-chain intent records into easy-to-use, familiar user experiences. This means we’re able to leverage verifiable on-chain records while maximizing utility for a broader consumer base.”","Although this concept may be new for most brands, KIKI recently announced a $7 million funding round led by a16z crypto and The Estée Lauder Companies’ NIV. ","Shana Randhava, Senior Vice President at NIV, mentioned that “Consumers are at the heart of what we do at The Estée Lauder Companies.” ","“That’s why we’re excited by the KIKI team’s vision of finding new ways to put the customer first,” she added.","Near-field communication (NFC)-enabled fashion is also allowing brands to better connect with customers. ","Cathy Hackl, CEO of spatial computing and artificial intelligence company Spatial Dynamics, told Cryptonews that she believes NFC-connected fashion can provide a direct touch point and communication channel for consumers. ","Early NFC-enabled use cases have already begun demonstrating this. For example, Tom Wallace, Founder of the connected goods ecosystem CreatedBy, told Cryptonews that his brand is connecting physical goods to digital “tokenized twins.” ","“Tokenized twins are placed on a blockchain network using CreatedBy NFC tags, allowing brands to share the full story and journey of each product,” said Wallace. “This increases transparency around sourcing, production, and ethical practices.”","According to Wallace, digital twins living on blockchain networks are solving a crucial problem for brands. ","“Consumers are increasingly demanding more information and visibility into the products they purchase,” he said. “Blockchain-based authentication and storytelling capabilities directly address this need for sustainable sourcing and supply chain transparency, while also providing the ability for ongoing engagement with customers.”","Wallace explained that CreatedBy recently conducted a case study with Wonder Raw, a sustainable apparel brand that uses trace-certified organic cotton and vegan inks. ","Wallace shared that CreatedBy was able to embed Wonder Raw’s sustainable journey and validation of its sourced materials by encoding data into NFC tags affixed to individual garments. ","“The second half of this is the ongoing engagements between the brand and owner(s) with programming of activations during the lifecycle of the garment,” Wallace added. “This includes end-of-life upcycling into a ‘new’ product retaining the on-chain data from the original good.”","Wallace further pointed out that CreatedBy’s “Tech Layer” encrypts all product information and activations. He noted that physical goods can be encoded with ","affixed NFC tags – and these can be activated by any mobile phone to launch authentication, validation, brand story-telling, and product engagement experiences for consumers. ","Although platforms like KIKI and CreatedBy are enabling better consumer-brand connections, it may take time for mainstream adoption to occur. ","For instance, Hackl pointed out that many brands have paused their Web3 initiatives. ","“This has especially become the case as brands focus on their AI efforts,” she added. ","Wallace further noted that one of the biggest barriers to adoption is education. ","“This has always been an issue for many brands using Web3 technology,” he said. “I also think that Web3 has been a victim of its own hype. There’s a stigma associated with Web3 right now or anything crypto related, despite crypto making a huge comeback.”","Challenges aside, Hackl noted that major brands like Louis Vuitton remain committed to their Web3 efforts. Vogue Business reported that in September last year, Louis Vuitton opened a Discord server designed to forge connections with the brand’s online community and NFT holders. ","Hackl also mentioned that blockchain use cases for tracking provenance will likely emerge as AI develops further. ","“Once NFC-enabled fashion can communicate with the AI that is being infused into new devices, a lot of that fashion will be an early prototype and early examples of items that can truly transcend the physical and the virtual,” she said. "],"entity":[{"type":"KIKI World","content":"PERSON"},{"type":"Pearl","content":"LOCATION"},{"type":"September last year","content":"DATE"},{"type":"April 9, 2024","content":"DATE"},{"type":"Shana Randhava","content":"PERSON"},{"type":"Blockchain","content":"PERSON"},{"type":"SDK","content":"ORGANIZATION"},{"type":"KIKI","content":"ORGANIZATION"},{"type":"77 percent","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tom Wallace","content":"PERSON"},{"type":"Jana Bobosikova","content":"PERSON"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"Bobosikova","content":"LOCATION"},{"type":"Vogue Business","content":"ORGANIZATION"},{"type":"Bobosikova","content":"PERSON"},{"type":"The Estée Lauder Companies’ NIV","content":"ORGANIZATION"},{"type":"Wallace","content":"PERSON"},{"type":"May 2023","content":"DATE"},{"type":"Body Paint","content":"ORGANIZATION"},{"type":"$7 million","content":"MONEY"},{"type":"Hackl","content":"PERSON"},{"type":"Cathy Hackl","content":"PERSON"},{"type":"Spatial Dynamics","content":"ORGANIZATION"},{"type":"‘Pretty Nail Graffiti","content":"ORGANIZATION"},{"type":"NIV","content":"ORGANIZATION"},{"type":"The Estée Lauder Companies","content":"ORGANIZATION"}],"hashtag":["NFT","Web3","web3 fashion"],"authors":["Rachel Wolfson"]}