{"summary":"Stablecoin Leader Tether Approaches 100 Billion in Circulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/stablecoin-leader-tether-approaches-100-billion-in-circulation.htm","publishDate":"2024-01-15T17:40:10","id":18977,"type":null,"title":"Stablecoin Leader Tether Approaches 100 Billion in Circulation","category":["Altcoin News "],"content":["Tether, the issuer of the popular USDT stablecoin, has strengthened its dominance in the stablecoin market by approaching 100 billion tokens in circulation.","The company’s market share expanded significantly in 2023, growing from 50% at the beginning of the year to over 70% as of the end of 2023, according to data from CryptoRank.io.","The 100 billion token milestone further cements Tether’s position as the leader in the stablecoin sector.","USDT Dominance Surpasses 70%","Over the past year, #Tether regurally issued $USDT, resulting in supply growth by nearly $29 billion (+44%). Amid the problems of $USDC and $BUSD, it's dominance surged from 48.1% to 70.9%.","👉 https:\/\/t.co\/DPGQMz6xMX pic.twitter.com\/2VAkzVVDXE","— CryptoRank.io (@CryptoRank_io) January 15, 2024","","The total circulation of over 100 billion USDT tokens exceeds the gross domestic product (GDP) of several countries, including the likes of Panama, Venezuela, and Luxembourg.","Tether’s exceptional growth stands out, especially when compared to its main competitor, USD Coin (USDC), which currently has around 27 billion tokens in circulation.","USDC started 2023 with over 48 billion tokens but faced a decline in circulation throughout the year, the data showed.","Good year ❤️ https:\/\/t.co\/6wmbtPnObZ","— Paolo Ardoino 🍐 (@paoloardoino) January 11, 2024","","","Tether’s recent surge in market share and circulation comes amid a change in leadership.","Paolo Ardoino, the former Chief Technology Officer (CTO) who for a long time has also acted as the public face of the company, assumed the role of CEO in December, succeeding former CEO Jean-Louis van der Velde.","The change in leadership has brought about a shift in approach, with Ardoino actively engaging with law enforcement and regulators by for instance freezing tokens owned by sanctioned individuals.","In an anncouncement from December last year, Tether said it aims to prevent potential misuse of its tokens and enhance security measures by aligning with global law enforcement and regulators.","“This strategic decision aligns with our unwavering commitment to maintaining the highest standards of safety for our global ecosystem and expanding our close working relationship with global law enforcement and regulators” Tether CEO Paolo Ardoino said at the time."],"entity":[{"type":"Venezuela","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"January 11, 2024","content":"DATE"},{"type":"$USDC","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"Tether","content":"PERSON"},{"type":"+44%","content":"PERCENT"},{"type":"Jean","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"Panama","content":"LOCATION"},{"type":"$BUSD","content":"MONEY"},{"type":"$USDT","content":"MONEY"},{"type":"$29 billion","content":"MONEY"},{"type":"Louis","content":"LOCATION"},{"type":"January 15, 2024","content":"DATE"},{"type":"48 billion","content":"MONEY"},{"type":"70.9%","content":"PERCENT"},{"type":"48.1%","content":"PERCENT"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["Tether","USDC","USDT"],"authors":["Fredrik Vold"]}