{"summary":"Japanese Exchange Coincheck Targets Nasdaq Listing in Q3 – Crypto Adoption Rising?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coincheck-targets-nasdaq-listing-in-q3.htm","publishDate":"2024-05-08T20:27:27","id":18989,"type":null,"title":"Japanese Exchange Coincheck Targets Nasdaq Listing in Q3 – Crypto Adoption Rising?","category":["Blockchain News "],"content":["Coincheck is set to become a publicly traded company by listing on Nasdaq, as revealed by the exchange on May 8. The company is seeking to achieve this through a merger with Thunder Bridge Capital Partners IV (THCP) by the third quarter (Q3) of 2024.","According to a Coincheck press release, the approval of Thunder Bridge IV’s stockholders is one key condition for the merger to proceed.","","Certain conditions outlined in the definitive agreement between Coincheck and Thunder Bridge IV must also be met.","These requirements are typical for transactions and include the SEC declaring the registration statement effective, receiving specific regulatory approvals, and obtaining approval from the Nasdaq Stock Market to list the securities of the combined company.","Japanese cryptocurrency exchange Coincheck is expected to list on Nasdaq under the symbol \"CNCK\" via SPAC in the second or third quarter of 2024, becoming another listed major exchange after Coinbase. Coincheck has 1.98 million verified customers. https:\/\/t.co\/2WanYtRGYj","— Wu Blockchain (@WuBlockchain) May 8, 2024","","Once the merger is finalized, Coincheck Group B.V., the entity that controls Coincheck, will be renamed Coincheck Group N.V.","The new holding company will be domiciled in the Netherlands and will have Coincheck as its wholly-owned subsidiary. Coincheck Group N.V. expects to be listed on the Nasdaq stock exchange under the “CNCK” ticker, joining Coinbase (COIN) as another major exchange to be publicly traded in the US.","🚨 @coincheckjp, a Japanese cryptocurrency exchange with 1.98 million verified users, is set to list on Nasdaq via SPAC in Q2\/Q3 2024 under the ticker \" $CNCK \".","This follows #Coinbase as another major crypto exchange to go public.","— Satoshi Club (@esatoshiclub) May 8, 2024","","Coincheck will use a special purpose acquisition company (SPAC) to get listed on the Nasdaq rather than the initial public offering (IPO) path used by Coinbase.","SPAC is a publicly traded company created to acquire or merge with an existing private company and take it public without going through the traditional IPO process.","While Coincheck’s Nasdaq listing will drive greater visibility and a pathway to a broader investor base, market observers might feel concerned, given how poorly most SPACs have performed in public markets.","Bloomberg’s data reveals a sobering reality – 21 companies that went public through SPAC mergers, including WeWork Inc., declared bankruptcy this year, which led to the evaporation of over $46 billion in equity value, measured from their peak market capitalizations.","","Despite this, Coincheck exchange’s decision to list on Nasdaq signals a big milestone in the growing mainstream acceptance of cryptocurrencies and the blockchain technology that drives them.","The exchange’s public listing on a major stock exchange could potentially attract more institutional investors and pave the way for other crypto exchanges to follow suit. This could increase the visibility of influential crypto companies, driving adoption and investment in the space. One popular company making major moves is MicroStrategy. The publicly traded company is the world’s largest corporate holder of Bitcoin.","Other prominent publicly traded crypto companies include Coinbase and bitcoin mining company Riot Blockchain. Coinbase, for one, has been a standout performer in the stock market. Recently, the US exchange reported a 72% increase in Q1 revenue, smashing estimates.","In another development signifying mainstream crypto adoption, PayPal expanded the inventory of crypto products available to its 426 million customers via its integration with MoonPay. The partnership will make it easier for PayPal customers to buy a wider variety of cryptocurrencies without giving their card details to MoonPay."],"entity":[{"type":"Thunder Bridge Capital Partners IV","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"third quarter of 2024","content":"DATE"},{"type":"$46 billion","content":"MONEY"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coincheck","content":"ORGANIZATION"},{"type":"72%","content":"PERCENT"},{"type":"WeWork Inc.","content":"ORGANIZATION"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Satoshi Club","content":"ORGANIZATION"},{"type":"Nasdaq Stock Market","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"May 8, 2024","content":"DATE"},{"type":"$CNCK","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Coincheck’s Nasdaq","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"May 8","content":"DATE"},{"type":"MoonPay","content":"ORGANIZATION"},{"type":"Coincheck Group B.V.","content":"ORGANIZATION"},{"type":"Coincheck Group N.V.","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Coincheck Exchange","crypto adoption","Japan"],"authors":["Jimmy Aki"]}