{"summary":"Ripple CEO Projects Crypto Market to Double to $5T Valuation By Year’s End","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ripple-ceo-brad-garlinghouse-crypto-market-prediction-2024-end.htm","publishDate":"2024-04-08T05:07:11","id":18982,"type":null,"title":"Ripple CEO Projects Crypto Market to Double to $5T Valuation By Year’s End","category":["News "],"content":["Ripple CEO Brad Garlinghouse anticipates that the crypto market capitalization will exceed $5 trillion by the end of the current year.","According to him, the market value is poised to double. He told CNBC in an interview published Sunday that this potential growth will be driven by a confluence of macroeconomic factors. These include the launch of the US spot Bitcoin exchange-traded funds and the impending Bitcoin halving event.","The ETFs in particular, he said, are attracting significant investment from institutional players for the first time.","On Monday, the combined market cap of the crypto market stood at $2.7t, with Bitcoin’s price trading around $70,000. A hypothetical doubling of the market cap would result in a new total value of $5.2t.","Bitcoin has experienced a surge in value primarily due to two factors. Firstly, a significant influx of capital has been directed towards newly launched spot Bitcoin ETFs. Secondly, market participants anticipate an imminent interest rate reduction from the Federal Reserve. This has historically been viewed as a positive development for risk assets like Bitcoin.","Furthermore, Bitcoin’s pre-programmed halving events, occurring every four years, serve to decrease the rate at which new supply enters circulation. This reduction in supply, coupled with the ongoing mining reward halving, tends to exert upward pressure on the price of Bitcoin.","Garlinghouse identified an additional factor contributing to the potential for the crypto market to reach new highs: the prospect of positive regulatory developments in the US. Crypto proponents are optimistic that the forthcoming presidential administration will adopt a more accommodating stance towards the industry.","He pinpointed the potential for increased regulatory clarity as one of the key macroeconomic tailwinds propelling the industry forward.","“The US is still the largest economy in the world, and it’s unfortunately been one of the more hostile crypto markets,” he said. “And I think that’s going to start to change, also.”","In late 2020, the SEC sued Ripple, alleging that the firm violated securities laws by offering unregistered securities.","Ripple achieved a partial victory in that case, as US District Court Judge Analisa Torres issued a ruling that contradicted the SEC’s claim.","Recently, Ripple announced its intention to introduce a stablecoin tethered to the US dollar this year. Industry projections estimate that the global stablecoin market will surpass $2.8t by the year 2028."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$5.2t.","content":"MONEY"},{"type":"$5 trillion","content":"MONEY"},{"type":"2028","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Garlinghouse","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"$2.7","content":"MONEY"},{"type":"$2.8","content":"MONEY"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"Analisa Torres","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"US District Court","content":"ORGANIZATION"}],"hashtag":["Crypto Market","Ripple"],"authors":["Shalini Nagarajan"]}