{"summary":"South Korea’s Financial Services Commission Proposes Regulatory Approval Requirement for Crypto Executives","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-koreas-financial-services-commission-proposes-regulatory-approval-requirement-for-crypto-executives.htm","publishDate":"2024-02-05T10:22:40","id":18992,"type":null,"title":"South Korea’s Financial Services Commission Proposes Regulatory Approval Requirement for Crypto Executives","category":["Altcoin News "],"content":["South Korea’s financial regulator has put forward new amendments that would require regulatory approval for new executives joining cryptocurrency companies.","In an official announcement, the Financial Services Commission (FSC) said it aims to address the existing pain points in the current legislation governing the country’s crypto industry, potentially enhancing the authority of the financial watchdog over the local crypto sector.","If these amendments are enacted, newly appointed executives in South Korean crypto companies will have to obtain approval from the FSC before assuming their roles.","Additionally, the proposed amendments grant the FSC the power to suspend the review of a crypto company’s license registration if the company or its members are under investigation by local or international regulators.","Currently, such a requirement is not outlined in the country’s law regarding the use and reporting of financial transaction information.","According to a report by local news outlet Money Today, the amendments are expected to come into effect by the end of March.","The proposed amendments will undergo revision by the Ministry of Government Legislation and will be subject to a voting process by the FSC.","Last week, Binance, the prominent cryptocurrency exchange, revealed that it is exploring options to reduce its stake in the South Korean exchange Gopax, where it currently serves as the largest shareholder. ","The move is an attempt to address concerns raised by the FSC.","The regulatory body has delayed approving Gopax’s structural change since Binance’s acquisition, possibly due to Binance’s legal issues in the United States.","The FSC is currently seeking public feedback on these proposed amendments until March 4.","In December last year, South Korea announced that high-ranking public officials will be required to disclose their cryptocurrency holdings starting next year.","At the time, the country’s personnel ministry said this proactive approach was intended to address potential conflicts of interest and promote integrity within the public sector.","By mandating disclosure of cryptocurrency holdings, the government aims to ensure that public officials maintain the highest ethical standards and avoid any potential conflicts that may arise from their involvement in the crypto market.","The requirement would apply to high-ranking officials across various government agencies and departments.","These officials will be obligated to report their cryptocurrency holdings, including details of the assets they own and the respective amounts.","Meanwhile, Lee Bok-hyun, South Korea’s head of the Financial Supervisory Service, aims to visit the United States later and discuss the crypto industry with U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler.","Specifically, the official is set to speak with Gensler regarding spot Bitcoin ETFs. "],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"South Korean","content":"LOCATION"},{"type":"December last year","content":"DATE"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"the Ministry of Government Legislation","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"FSC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"South Korean exchange Gopax","content":"LOCATION"},{"type":"Lee Bok","content":"PERSON"},{"type":"Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"March 4","content":"DATE"}],"hashtag":["Crypto Regulation","South Korea"],"authors":["Ruholamin Haqshanas"]}