{"summary":"Europe’s first spot bitcoin ETF is set to launch later this month.\nIt will be listed as BCOIN on Euronext Amsterdam.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239496\/europes-first-spot-bitcoin-etf-to-launch-this-month","publishDate":"2023-07-13T13:16:20","id":1899,"type":null,"title":"Europe&#x27;s first spot bitcoin ETF to launch this month","category":["Finance firms"],"content":["Europe's <a href=\"https:\/\/www.theblock.co\/linked\/120856\/jacobi-asset-management-claims-it-will-launch-the-worlds-first-tier-one-bitcoin-etf\" data-v-f87c67ca=\"\">first bitcoin ETF<\/a> is set to launch later this month, listed as BCOIN on Euronext Amsterdam.","Jacobi Asset Management postponed a 2022 launch of the bitcoin ETF, citing last year's Terra Luna and FTX collapses as the reason for the delay. The firm said it is now on track to launch later in July, as \"demand has shifted.\"","Jacobi first gained approval for the ETF from the Guernsey financial regulator in October 2021.","Jacobi CEO Jamie Khurshid stressed that every other European digital asset exchange traded product is structured as an exchange traded note that offers ownership of a debt security on the asset, and not the underlying asset itself.","\"Until now, Europe has only seen exchange-traded products with various forms of debt and complex structures that do not provide transparency for investors to make informed decisions about the debt and risk exposure they are taking on,\" Khurshid added.","Referring to its ETF, Jacobi said \"there is no chance of an investment leading to any form of exposure to risky borrowers, yield platforms or Defi protocols.\" According to <a href=\"https:\/\/www.ft.com\/content\/1d1de06a-a904-4db3-9017-4c061bd6854d\" data-v-f87c67ca=\"\">The Financial Times, <\/a>Jacobi co-founder of Peter Lane said the ETF cannot be used as leverage or for derivatives, leading to “significant counterparty risk.\"&nbsp;","Jacobi Asset Management said the digital assets underlying the ETF will be independently audited and held in custody at Fidelity Digital Assets on behalf of the fund.","\"This is why we now believe the institutions can finally come and adopt digital assets as part of their diversified portfolio,\" the fund added.","(<em data-v-f87c67ca=\"\">Corrects attribution of quote in fifth paragraph. Removes quote attributed to Euronext by Jacobi, at request of Euronext.<\/em>)"],"hashtag":[]}