{"summary":"Binance Shares What Caused Backlog on Bitcoin Network, Resumes BTC Withdrawals","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-shares-what-caused-backlog-bitcoin-network-resumes-bitcoin-withdrawals.htm","publishDate":"2022-06-14T08:54:00","id":18998,"type":null,"title":"Binance Shares What Caused Backlog on Bitcoin Network, Resumes BTC Withdrawals","category":["Bitcoin News "],"content":[" ","Major crypto exchange Binance has shared that they had been repairing “minor hardware failures” yesterday, which resulted in “a stuck transaction”, which then caused a backlog on the Bitcoin (BTC) network and led to the company pausing BTC withdrawals for about three hours.","In a post-mortem, the exchange detailed that the issue arose when they were “repairing several minor hardware failures on wallet consolidation nodes […], which caused the earlier transactions that were pending to be broadcast to the network after the nodes were repaired.”","The company added that those pending consolidation transactions had a low gas fee and caused the later withdrawal transactions, “which were pointing to the pending consolidation UTXO [unspent transaction output],” to get stuck.","“To fix it we had to change the logic to only take successful UTXO from consolidation transactions or successful withdrawal transactions. This fix will also prevent the same issue from happening again,” Binance said.","The exchange repeated that during the entire time that Bitcoin withdrawals were paused on the Bitcoin network, users were able to withdraw BTC using other chains, including ERC-20 and BEP-20.","Binance CEO Changpeng Zhao (CZ) also shared the hash of one specific transaction “that got things stuck.” He then mentioned another transaction that was still stuck.","Notably, the SBI Crypto mining pool “manually prioritized and mined [the transaction] in block 740683,” according to Carson Smith, CEO of the company.","@cz_binance Your transaction is unstuck now.\n\nThe team at @SBICrypto pool decided to help @binance We manually prioritized and mined in block 740683.\n\nBlockhttps:\/\/t.co\/9ctAAxfAUN\nTxhttps:\/\/t.co\/TACog0DzAF https:\/\/t.co\/ha1Ezek6N4","While all evidence seems to support Binance’s explanation, some users still argue the exchange may be using fractional reserve systems, allowing customers to trade in “naked” Bitcoin that exists only on their internal books.","“So real btc is halted from leaving a centralized exchange so that the exchange’s “paper” btc can still move right along?” one Twitter user said.","Exchanges are using much more BTC than they actually own","Major crypto lender Celsius (CEL) also suspended withdrawals, Swaps, and transfers between accounts early Monday. This, along with Binance’s suspension of withdrawals, while unrelated, seems to have further exacerbated the general panic in the crypto market.","Bitcoin resumed its downward movement, falling to as low as USD 21,046 in the past day, according to CoinGecko. At 8:23, it’s trading at USD 22,759, down by 7.8% over the past 24 hours and 27.4% over the week.","____","Learn more: \n– Binance Pauses Bitcoin Withdrawals Due to ‘Backlog’\n– Binance Wins Day in Court, US Judge Dismisses Lawsuit\n\n– BNB Stretches Losses as Binance Fights New Regulatory and Media Battles\n– BNB Chain Launches New Roadmap as Competition With Ethereum Heats Up\n\n– Binance Claims It’s Probably The Only Crypto Exchange That Has A Responsible Trading Program\n– After Binance Secures French License, New Hires Underway, Hopes for New Permits "],"entity":[{"type":"7.8%","content":"PERCENT"},{"type":"Binance Pauses Bitcoin Withdrawals Due to ‘Backlog’\n– Binance Wins Day in Court","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"SBI Crypto","content":"ORGANIZATION"},{"type":"8:23","content":"TIME"},{"type":"20","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Carson Smith","content":"PERSON"},{"type":"New Hires Underway","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"27.4%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Binance","Bitcoin","Exchange","Trading"],"authors":["Ruholamin Haqshanas"]}