{"summary":"Largest U.S. Crypto ATM Firm Reports No Impact on Revenues Despite Bitcoin Price Volatility","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/largest-u-s-crypto-atm-firm-reports-no-impact-on-revenues-despite-bitcoin-price-volatility.htm","publishDate":"2024-04-16T11:23:42","id":18995,"type":null,"title":"Largest U.S. Crypto ATM Firm Reports No Impact on Revenues Despite Bitcoin Price Volatility","category":["Bitcoin News "],"content":["Bitcoin Depot, the largest Bitcoin ATM operator in the United States, has reported robust revenues despite the highly volatile nature of cryptocurrency prices.","In its recently filed 10-K annual report on April 15, the company revealed that its revenues in 2023 and 2022 amounted to $689 million and $647 million, respectively, showing no significant correlation with Bitcoin’s price fluctuations.","Despite cryptocurrency prices’ rollercoaster ride, Bitcoin Depot has weathered the storm with no significant impact on its revenues. Even during extreme volatility in Bitcoin prices, Bitcoin Depot’s revenues remained steady and unaffected. For instance, while Bitcoin soared by 155% in 2023, the company’s year-over-year revenue growth was a modest 6%, showcasing its resilience to market turbulence.","This resilience stems from Bitcoin Depot’s strategic approach to its services, which are predominantly used for non-speculative purposes such as money transfers, international remittances, and online purchases, as indicated by user surveys conducted by the company. Unlike some entities heavily involved in cryptocurrency trading or mining, Bitcoin Depot maintains a relatively low balance of Bitcoin, typically less than $0.8 million, at any given time.","Furthermore, Bitcoin Depot has taken proactive steps to minimize its exposure to Bitcoin’s volatility by maintaining a relatively low balance of Bitcoin, typically less than $1 million. The company’s strategy involves purchasing Bitcoin through reputable liquidity providers like Cumberland DRW or Abra rather than engaging in mining activities.","“We use a sophisticated Bitcoin management process to reduce our exposure to volatility in Bitcoin prices by maintaining a relatively low balance (typically less than $1 million) of Bitcoin at any given time,” the company stated in its filing. This approach differentiates Bitcoin Depot from its competitors and helps manage principal risk effectively.","Bitcoin Depot does not act as an agent or exchange for users in its transactions. Instead, it maintains Bitcoin balances to fulfill user demand from kiosk or BDCheckout transactions. As users receive Bitcoin, the company replenishes its balance through purchases from leading liquidity providers.","The working capital required for Bitcoin Depot’s operations comprises Bitcoin held in hot wallets to fulfill user orders and cash accumulated in Bitcoin ATM kiosks. As of December 31, 2023, cash in the BTM kiosks represented approximately 21% of the company’s average monthly revenues. This dual approach to managing Bitcoin and cash balances contributes to the stability and resilience of Bitcoin Depot’s business model.","Bitcoin Depot, a prominent player in the Bitcoin ATM (BTM) industry, has solidified its position as the largest cryptocurrency ATM operator globally. Founded in 2016, Bitcoin Depot operates a vast network of over 7,000 BTMs worldwide, allowing users to conveniently deposit and withdraw money using cash or a debit card.","In comparison, its main competitors, CoinFlip and BitStop, operate 4,800 and 2,500 machines, respectively, according to data from CoinATMRadar as of April 2024.","Despite Bitcoin Depot’s success, the overall trend in the Bitcoin ATM market witnessed a decline in installations for the first time in a decade in 2023. Coin ATM Radar data shows an 11% decrease in installed Bitcoin ATMs globally, dropping from 37,827 on January 1, 2023, to 33,622 on the same date in 2024.","This decline was particularly notable in the United States, which accounts for 82% of all Bitcoin ATMs globally. The number of Bitcoin ATMs in the US decreased from 32,672 to 27,621 throughout 2023, marking the first year-over-year decline in installed BTMs.","Bitcoin Depot’s CEO, Brandon Mintz, remains optimistic about the ATM industry’s future. He anticipates a significant rebound following the much-awaited Bitcoin halving event, which is expected to occur soon. The Bitcoin halving event, which reduces the reward for mining new blocks in the Bitcoin network, is often associated with increased market activity and interest in cryptocurrencies."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"6%","content":"PERCENT"},{"type":"2016","content":"DATE"},{"type":"January 1, 2023","content":"DATE"},{"type":"82%","content":"PERCENT"},{"type":"December 31, 2023","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin Depot","content":"ORGANIZATION"},{"type":"Brandon Mintz","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bitcoin ATM","content":"ORGANIZATION"},{"type":"$689 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"$0.8 million","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"155%","content":"PERCENT"},{"type":"April 15","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$647 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"ATM","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin ATM","Bitcoin Depot"],"authors":["Hassan Shittu"]}