{"summary":"Only1 Secures $5 Million for Solana-Based OnlyFans Clone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/only1-secures-5m-for-onlyfans-clone.htm","publishDate":"2024-04-22T13:10:09","id":18993,"type":null,"title":"Only1 Secures $5 Million for Solana-Based OnlyFans Clone","category":["Blockchain News "],"content":["Only1 has raised $5 million in investment funds to build a Web3 “OnlyFans clone” adult content platform on Solana, led by Newman Group.","This move comes to take on OnlyFans, the leading adult content platform, with a $1 billion share of the $1.6 billion industry. ","To capitalize on the platform’s dominance, creators must pay a 20% fee on their earnings, feeding billions in revenue to the business. A creator’s content, followers, and earnings are all tied to the platform, making it difficult to leave once you’ve built a following. ","The platform has been threatened multiple times in the past. In 2021, banks nearly forced OnlyFans to ban all adult content on the platform, according to its CEO. ","This is a representation of the social media space as it stands today. Creators are stuck between a rock and a hard place: they require social media to promote their work, but the platforms do not fairly compensate them for their efforts.","Creators are at the mercy of centralized companies, which can completely erase the community they have built with bans, enforced by rules that are constantly shifting.","These factors present an opportunity for crypto enthusiasts, who cite OnlyFans as a Web2 platform ripe for disruption.","Enter Only1, an exclusive content service that uses Solana as the settlement layer to solve the largest problems in the adult content platform market — low trust and payment censorship. Per Only1’s blog:","“Mixing social media, an NFT marketplace, a scalable blockchain, and the native token — $LIKE, Only1 offers fans a unique way of connecting with the creators they love. By using the Only1 platform, fans will have the ability to invest, access, and earn from the limited edition content created by the world’s largest influencers\/celebrities, all powered by NFTs.” ","This is all a part of Only1’s vision to reward participation, stating:","“We seek to reward creators and fans wholly, and proportionally embrace the creator’s economy through NFTs and DeFi.”","Only1 introduces multiple revenue streams for creators. Importantly, creators can sell passes – permanent memberships that grant access to exclusive content. Fans can choose to trade these on the platform at a higher price if there is a high demand, with creators earning a 5% royalty on every trade. ","Additionally, creators can earn 100% of the subscription fees from fans, enabled by the peer-to-peer transaction model, significantly increasing the creators’ share of earnings by bypassing traditional payment processors and banking partners.","By using the Only1 platform, fans will have the ability to invest, stake, and earn from the content created by the world’s largest influencers, all powered by NFTs.","This will be facilitated by Only1’s native token LIKE, which fans and creators are rewarded with for the value they add to the platform. Fans can also stake LIKE tokens and earn interest on their coins in influencer-specific staking pools. Both the fan and the creator split staking rewards.","This all supports Only1’s vision of creating a symbiotic relationship between the company, content creators, and fans instead of a parasitic one.","Only1 has raised $3.5 million from venture capital firms, including Animoca Brands (investor in Sandbox) and Newman Capital (lead investor in Memeland), to build the future of a decentralized creator economy. The latest $1.3 million investment brings the total to $4.8 million.","Only1 is excited to announce a $1.3M strategic round, bringing our total capital raised to $4.8M to build the OnlyFans on Solana.","AI-powered tools, ref-links, and confirmed creators with 10M+ followers collectively, here is why we are super excited for May 2024 and beyond: pic.twitter.com\/D7CFCUaKHz","— Only1 (@JoinOnly1) April 21, 2024","","These investments have already proven worthwhile, with the platform receiving huge adoption and having over 40,000 monthly active users. Something that only looks to increase, with several creators to onboard in May with collectively over 10 million followers, as teased by Only1. ","Despite spending $0 on creator acquisitions, Only1 has facilitated over $100K worth of merchandise sold through customer-to-customer trades. The top creator, Angelina, earned a net of $21,000 on the site to date, highlighting the huge financial opportunities for both creators and fans.","Although this adoption is promising, there is still hesitation among the crypto-skeptical users of established platforms. Such as professional OnlyFans content creator Lucas Moreno, who was particularly drawn in by Only1’s promised 0% fee on tips and subscriptions. However, foresaw challenges in getting his following to adopt a new platform. Moreno added:","“Even if it’s a great idea, there’s a lot of education needed and a lot of demystifying and unlearning about things that might have gone wrong in other areas in crypto that might give a bad reputation to crypto.”",""],"entity":[{"type":"$1 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$1.3","content":"MONEY"},{"type":"$1.3 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"$100K","content":"MONEY"},{"type":"Lucas Moreno","content":"PERSON"},{"type":"$4.8","content":"MONEY"},{"type":"$0","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Memeland)","content":"LOCATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"$21,000","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"Angelina","content":"LOCATION"},{"type":"$LIKE","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Newman Capital","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"May 2024","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"April 21, 2024","content":"DATE"},{"type":"Newman Group","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$4.8 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"}],"hashtag":["funding","Web3"],"authors":["Harvey Hunter"]}