{"summary":"Jack Dorsey’s Block Launches Self-Custody Bitcoin Wallet ‘Bitkey’ – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/jack-dorseys-block-launches-self-custody-bitcoin-wallet-bitkey-heres-what-you-need-to-know.htm","publishDate":"2023-12-07T22:29:02","id":18997,"type":null,"title":"Jack Dorsey’s Block Launches Self-Custody Bitcoin Wallet ‘Bitkey’ – Here’s What You Need to Know","category":["News "],"content":["Financial payment processor firm Block, co-founded by Jack Dorsey, is launching a self-custody Bitcoin wallet in more than 95 countries. ","On December 7, Block unveiled its self-custody Bitcoin wallet named “Bitkey.” With Bitkey, investors can own, manage, and securely store their Bitcoin outside of exchanges.","According to Block, Bitkey seeks to offer a user-friendly and secure self-custody solution, addressing the prevailing trend where a significant majority of Bitcoin owners store their holdings on custodial platforms or exchanges.","Block said in its announcement,","“The bitcoin decentralized payments network has the potential to create a more inclusive financial system for all, especially those who have traditionally been underserved. In the future, we believe customers will demand ownership and self-custody because it brings peace of mind, reduces dependence on any one entity, and puts individuals in control of their own bitcoin.”","According to the announcement, Bitkey’s security features involve three keys, and any two keys are required to move Bitcoin or authorize security-related actions, eliminating the need for long passwords or seed phrases.","According to Lindsey Grossman, Business Lead for Bitkey:","“With Bitkey, we wanted to build a product that helps bring everyone to self-custody, combining robust security and recovery options, with a simple customer experience that puts them in control of their money.”","Two keys are distributed directly to users: one within the mobile app for transactions and security management, and the other stored offline within a hardware device, enhancing security and serving as a recovery method if the user loses their phone. The third key, stored on the company’s server, enables seamless mobile transactions and acts as a failsafe option for wallet recovery in case of device loss.","Importantly, the wallet’s design ensures that Bitkey, holding access to only one key in the 2-of-3 multi-signature wallet, ensures that the company cannot access or move a user’s Bitcoin without explicit user consent.","Reportedly, the Bitkey package, inclusive of the app and hardware storage, is priced at $150 (excluding shipping and taxes), and pre-orders for Bitkey are available, with shipments set to commence in early 2024.","The company initially announced Bitkey in March 2022, but it underwent internal testing before opening beta access to the general public in June.","Block has partnered with Coinbase and Cash App to facilitate easy Bitcoin transfers to the hardware wallet. The ability to transfer Bitcoin from Coinbase and Cash App is available immediately, with additional features expected to be rolled out later. ","Notably, in the third quarter of 2023, Block reported $5.62 billion in revenue, driven by strong sales growth for payment processors Cash App and Square. The firm also achieved a $44 million profit on its Bitcoin investments, benefiting from BTC’s recent price recovery. ","Bitcoin transaction gross profit reached $45 million, representing a 22% year-over-year increase, with the company selling $2.42 billion worth of BTC to customers through the Cash App. The wallet is designed to empower users with control over their finances, emphasizing ownership and self-custody.","This move by Block puts it in competition with established hardware wallet startups such as Ledger and Trezor, which have been offering products to assist cryptocurrency users in securely storing their digital assets. Like Block’s Bitkey, Ledger and Trezor also support various other cryptocurrencies beyond Bitcoin.","While Ledger and Trezor also support various crypto assets beyond Bitcoin, Bitkey focuses on providing a simple and secure solution for Bitcoin self-custody."],"entity":[{"type":"Trezor","content":"ORGANIZATION"},{"type":"third quarter of 2023","content":"DATE"},{"type":"Bitkey","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"$44 million","content":"MONEY"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"March 2022","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Block","content":"ORGANIZATION"},{"type":"December 7","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$45 million","content":"MONEY"},{"type":"Lindsey Grossman","content":"PERSON"},{"type":"Bitkey","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"3","content":"DATE"},{"type":"$2.42 billion","content":"MONEY"},{"type":"$150","content":"MONEY"},{"type":"$5.62 billion","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Hardware wallet","Jack Dorsey"],"authors":["Hassan Shittu"]}