{"summary":"Bitcoin ETF Inflows Could Trigger a ‘Sell-Side Liquidity Crisis,’ Warns CryptoQuant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etf-inflows-could-trigger-a-sell-side-liquidity-crisis-warns-cryptoquant.htm","publishDate":"2024-03-12T12:13:49","id":18990,"type":null,"title":"Bitcoin ETF Inflows Could Trigger a ‘Sell-Side Liquidity Crisis,’ Warns CryptoQuant","category":["Bitcoin News "],"content":["Institutional inflows into spot Bitcoin (BTC) ETFs could lead to a “sell-side liquidity crisis” by September, according to industry analyst Ki Young Ju, CEO of on-chain analytics platform CryptoQuant. ","In a thread on X, Ki predicted a watershed moment in BTC supply within the next six months.","He said that the rise of Bitcoin as an institutional investment is just beginning, with spot Bitcoin ETFs gaining significant traction in the United States. ","Currently holding close to $30 billion, BTC ETFs have experienced the most successful launch in the history of ETFs.","However, if this trend continues, it could create a new phenomenon where the demand for Bitcoin surpasses the available supply, effectively creating a Bitcoin ETF liquidity crisis. ","Ki emphasized that as long as spot Bitcoin ETF inflows persist, the bears in the market will struggle to gain the upper hand. ","He pointed out that ETFs alone accumulated over 30,000 BTC in the previous week, while exchanges and miners hold approximately 3 million BTC, with US entities alone holding 1.5 million BTC. ","“Last week, spot ETFs saw netflows of +30K BTC. Known entities like exchanges and miners hold around 3M BTC, including 1.5M BTC by US entities,” he continued.","“At this rate, we’ll see a sell-side liquidity crisis within 6 months.”","This scenario would create a scarcity of Bitcoin available for sale. ","#Bitcoin is currently in the price discovery phase.","Once a sell-side liquidity crisis happens, its next cyclical top may exceed our expectations due to limited sell-side liquidity and thin orderbook.","This could occur once accumulation addresses reach around a total of 3M BTC. pic.twitter.com\/HgwGbHR8fL","— Ki Young Ju (@ki_young_ju) March 12, 2024","","The Grayscale Bitcoin Trust (GBTC) is also bucking the trend, experiencing daily outflows of around $500 million. ","Despite these outflows, the value of GBTC’s BTC holdings has remained relatively stable due to Bitcoin’s price appreciation since the ETF launch in January.","When the tipping point of ETF demand is reached, Ki predicts that the impact on Bitcoin’s price may exceed market expectations. ","A sell-side liquidity crisis would limit the availability of sellers and result in a thinner order book, potentially leading to a higher cyclical top for the cryptocurrency.","Ki also highlighted the ongoing uptrend in BTC held by “accumulation addresses,” which are wallets that receive only inbound transactions. ","However, these holdings would need to double before the crisis sets in, as Bitcoin’s recent surge to new all-time highs has caused accumulation address holdings to cool off.","Last week, the US Securities and Exchange Commission (SEC) delayed the decision to approve options trading on spot Bitcoin ETFs.","The agency extended the response deadline for the Cboe Exchange and the Miami International Securities Exchange, both of which filed bids to offer options on Bitcoin ETFs. ","Analysts, such as VettaFi’s Dave Nadig, predict that the introduction of BTC ETF options will attract hedge fund players who were not previously involved in the crypto ecosystem, providing them with an opportunity to participate in the market.","Multiple leveraged Bitcoin ETFs are also under consideration by the SEC, including filings from asset manager Direxion for five inverse and long spot BTC ETFs, ProShares’ five leveraged Bitcoin funds, and REX Shares’ six leveraged ETFs."],"entity":[{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Ki Young Ju (","content":"ORGANIZATION"},{"type":"March 12, 2024","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"3M BTC","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Dave Nadig","content":"PERSON"},{"type":"Cboe Exchange","content":"ORGANIZATION"},{"type":"Miami International Securities Exchange","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Direxion","content":"PERSON"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Bitcoin","spot ETF"],"authors":["Ruholamin Haqshanas"]}