{"summary":"NFT marketplace aggregator Flip has raised $6.5 million in a seed funding round.\nFlip is co-founded by UpOnly podcast host Brian Krogsgard (aka Ledger Status).","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129748\/nft-aggregator-flip-raises-6-5-million-in-seed-funding","publishDate":"2022-01-10T14:14:45","id":190,"type":null,"title":"NFT aggregator Flip raises $6.5 million in seed funding","category":["Venture Capital"],"content":["NFT marketplace aggregator Flip, co-founded by UpOnly podcast host Brian Krogsgard (aka Ledger Status), has raised $6.5 million in a seed funding round.","The round was led by co-led by Distributed Global and Chapter One, with participation from CMS Holdings, NFT artist PplPleasr (aka Emily Yang), Keyboard Monkey, DeeZe, and Larry Cermak, VP of research at The Block, among other investors.","This was an equity funding round and will help Flip expand its team and launch its platform, Krogsgard told The Block. The current headcount of Flip is seven people, and it is hiring for several engineering roles.","Flip aggregates NFT marketplaces under one roof on its platform, allowing users to easily navigate through available NFTs to buy.","Krogsgard said today OpenSea remains the largest NFT marketplace with over 95% market share, but that will change as Coinbase, FTX, and other players launch their NFT platforms and start to gain traction.","\"New users aren't going to know the right place to shop for an NFT. So what we do is pull together those global markets,\" said Krogsgard.","Flip will list NFT collections across marketplaces, their floor prices, and trading volumes, among other data and information.","The platform will also allow users to view and track their NFT portfolio in one place, which is a \"quite difficult\" task today, according to Krogsgard. Users will be able to bundle their multiple NFT wallets together to track their portfolios.","Flip will be free to use. As for its business model, Krogsgard said Flip will get a \"minor fee or referral bonus\" for transactions that initiate from the platform with partner exchange APIs.","The platform will open for the public by the end of this month or early February, said Krogsgard.","When asked if Flip will launch its own token, Krogsgard said there are no plans for it due to regulatory uncertainty in the US. \"Tokenization is a risk under uncertain US regulatory climate at the moment, and we would never force a token for the sake of short-term liquidity. We think Flip is a very valuable business as an equity play,\" he said.&nbsp;","Flip's seed round follows a pre-seed round raised last year, which was led by CMS Holdings. The startup will also look to raise a Series A round in the near future, said Krogsgard.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclosure: Members of The Block Research may, from time to time, participate in equity or token sales announced by industry startups. The Block News has no knowledge of this participation&nbsp;ahead of announcements<\/i><b data-stringify-type=\"bold\" data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">&nbsp;<\/i><\/b><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">and no special consideration is given to funding news involving members of The Block Research.<\/i>"],"hashtag":[]}