{"summary":"VSFG said it aims to submit an application for a spot Ethereum ETF in Hong Kong in Q2 if it successfully launches spot bitcoin ETF in Q1.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275718\/hong-kong-finance-firm-vsfg-targets-to-apply-for-spot-ethereum-etf-in-q2","publishDate":"2024-02-02T00:29:00","id":190,"type":null,"title":"Hong Kong finance firm VSFG targets to apply for spot Ethereum ETF in Q2","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Venture Smart Financial Holdings Ltd. (VSFG), a Hong Kong-based financial services firm, is preparing to apply for a spot Ethereum exchange-traded fund (ETF) in anticipation of potentially launching its spot bitcoin ETF in the first quarter.<\/span>","<span data-v-f87c67ca=\"\">In a Friday interview with The Block, VSFG Chairman Lawrence Chu said that the firm is in the final phase of officially submitting its application for a spot bitcoin ETF to the Hong Kong Securities and Futures Commission.<\/span>","<span data-v-f87c67ca=\"\">In Hong Kong, extensive regulatory discussions typically precede the submission of an application, according to Chu. “Submission [for application] is almost like when you're 95% there,” he added.<\/span>","<span data-v-f87c67ca=\"\">Chu noted that the company is targeting a second-quarter submission for a spot Ethereum ETF, provided its spot bitcoin ETF is approved and listed in the first quarter. “But that really depends on the conversation we have with the regulator,” he said. “We will be ready.”<\/span>","<span data-v-f87c67ca=\"\">Last month, Livio Weng, chief operating officer of Hong Kong crypto exchange HashKey, said that around <\/span><a href=\"https:\/\/www.theblock.co\/post\/271458\/hong-kong-asset-managers-spot-crypto-etf-hashkey\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">10 fund companies<\/span><\/a><span data-v-f87c67ca=\"\"> have started looking into launching potential spot crypto ETFs in the city.<\/span>","<span data-v-f87c67ca=\"\">With several fund companies in Hong Kong preparing to apply for spot bitcoin ETFs, there could be a <\/span><a href=\"https:\/\/www.theblock.co\/post\/275002\/spot-bitcoin-etf-race-heats-up-as-invesco-and-galaxy-slash-fee\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">race to lower fees<\/span><\/a><span data-v-f87c67ca=\"\"> among asset managers, similar to what has been observed in the U.S.<\/span>","<span data-v-f87c67ca=\"\">“There will be a few [ETFs] that come out,” Chu said. “Our role is slightly nuanced because I think we're also trying to help ETF issuers get into the game.”<\/span>","<span data-v-f87c67ca=\"\">Chu pointed out that U.S. ETF issuers tend to have their own digital asset teams. “In Hong Kong, there's a bit of a licensing requirement but also a knowledge gap. Most ETF issuers don't have a digital asset team.”<\/span>","<span data-v-f87c67ca=\"\">“It becomes less of a competition for us, but rather it's competition between ETF issuers on their marketing side,” Chu continued. “From that point of view, you can think of us as more of a service provider to all ETF issuers.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chu","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"the first quarter","content":"DATE"},{"type":"Smart Financial Holdings Ltd.","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chu","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"VSFG","content":"ORGANIZATION"},{"type":"Hong Kong Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Lawrence Chu","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Livio Weng","content":"PERSON"}],"hashtag":["ASIAN REGULATION","INVESTMENT FIRMS","SPOT BITCOIN ETF"],"authors":["Timmy Shen","The Block"]}