{"summary":"Candy Token Plummets 87% After Lena Network Rug Pull – Here’s What Happened","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/candy-token-plummets-87-after-lena-network-rug-pull-heres-what-happened.htm","publishDate":"2024-03-06T22:14:30","id":19008,"type":null,"title":"Candy Token Plummets 87% After Lena Network Rug Pull – Here’s What Happened","category":["Altcoin News "],"content":["The Lena Network’s newly launched Candy token lost virtually all of its value on Wednesday shortly after the liquidity protocol seemingly rug-pulled the project.","Price data from Dexscreener shows that the token traded at a daily high of $3.08 at 12:48 am UTC, before falling to just $0.38 at 5:45 am UTC.","The token crashed when on-chain data showed that the Lena Network’s deployer address had sent 753.11 ETH worth $2.9 million to an address associated with the OKX exchange. Deposits to exchanges are typically interpreted as showing an investor’s intention to sell.","The 753 ETH nearly matched the 850 ETH (worth $3.2 million) raised by Lena network in its “Candy Initial Farm Offering” (IFO) announced last month, which ended on March 3.","Mere hours before the token went live earlier today, Lena publicly renounced ownership of the Candy token contract in the name of “trust and decentralization.”","Important announcement 🚨","We've taken a significant step forward in ensuring our project's trust and decentralization – we've officially renounced ownership of our token contract.","This move is all about fostering a safer and more community-driven environment. Making things… pic.twitter.com\/hoxbpszWuR","— LENA ⚡ IFO Launching (@LENA_Network) March 6, 2024","","“This move is all about fostering a safer and more community-driven environment. Making things right the way it should be,” wrote Lena.","Hours later, Lena hosted a follow-up X Spaces to address concerns from community members believing they’d been “rug pulled” by founders. The team admitted at the time that it was “very disappointing” to see how they had handled the capital raised from its users, and that they had a “lack of experience with launching products.”","“We understand the importance of transparency and trust, especially amidst accusations of our project being a scam or facing a potential rug pull,” the team added.","Upon announcing the raise in February, Lena claimed that CANDY would “open avenues” for Web 3.0 liquidity, and give its holders a “strategic advantage.” Specifically, CANDY holders could leverage LENA’s DeFi platform for lending, borrowing, and GameFi asset auctions.","“$CANDY token holders will benefit from future conversion opportunities to $LENA, enhancing token utility, including revenue sharing,” read a press release at the time.","Data from Immunefi suggests that over $200 million in cryptocurrency has already been lost to hacks and scams in 2024. That’s a 15.4% increase compared to 2023, largely due to private key and wallet compromises.","“We expect that 2024 will likely witness the most substantial losses in Web3 ever in terms of volume of funds,” said Immunefid Comms Lead Jonah Michaels to Cryptonews."],"entity":[{"type":"15.4%","content":"PERCENT"},{"type":"March 6, 2024","content":"DATE"},{"type":"Immunefid Comms","content":"ORGANIZATION"},{"type":"Immunefi","content":"LOCATION"},{"type":"Jonah Michaels","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"IFO","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"$0.38","content":"MONEY"},{"type":"$3.08","content":"MONEY"},{"type":"March 3","content":"DATE"},{"type":"5:45","content":"TIME"},{"type":"Lena Network","content":"ORGANIZATION"},{"type":"$CANDY","content":"MONEY"},{"type":"Dexscreener","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lena","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$2.9 million","content":"MONEY"},{"type":"$LENA","content":"MONEY"},{"type":"OKX","content":"ORGANIZATION"},{"type":"$3.2 million","content":"MONEY"}],"hashtag":["crypto scam","rug pull"],"authors":["Andrew Throuvalas"]}