{"summary":"Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD 30,000 Barrier Soon","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/galaxy-digitals-novogratz-doubts-bitcoin-will-pass-usd-30000-barrier-soon.htm","publishDate":"2022-08-09T09:03:00","id":19009,"type":null,"title":"Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD 30,000 Barrier Soon","category":["Bitcoin News "],"content":[" ","Mike Novogratz, CEO of digital asset-focused financial services firm Galaxy Digital, is doubtful that bitcoin (BTC) will push through the USD 30,000 barrier anytime soon. The investor said he expects the world’s leading coin to move within its latest price range, given that lately, there have not been any significant capital injections into the industry.","“Will Bitcoin get through USD 30,000 on this move up? We will see. I’m doubtful. I think we’re going to probably be in this range now. I quite frankly would be happy if we’re in a USD 20,000, USD 22,000, or USD 30,000 range for a while,” Novogratz told Bloomberg, adding:","“We’re not seeing huge institutional flows, to be fair, but we’re not seeing a back away.” ","At 09:01 UTC, BTC trades at USD 23,838 and is down 1% in a day and up 2% in a week. BTC jumped 10% in a month, trimming its annual losses to less than 46%.","“Bitcoin’s story is very much tied to the Fed,” he said of the impact the US Federal Reserve exerts on the cryptocurrency’s price, adding that “assets are going up” and that he thinks the Fed “will stop raising [interest] rates.”","“I don’t see the mania that we saw in 2021 or 2017 reigniting,” according to Novogratz, who is skeptical there is a “soft landing” ahead of the global markets and believes the world is heading toward a recession.","Despite Galaxy Digital posting a USD 554m loss in the second quarter of 2022, Novogratz said he actually decided to purchase more stock in his company. The businessman said that, while the worst for the cryptocurrency industry is over for now in terms of price decreases, he was determined to look at crypto investments “within the three- to four-year horizon, not the three- to four-month horizon.”","Novogratz admitted that, in the early stage of the current crypto market downturn, he considered laying off some of his company’s employees.","“I looked at my business really hard, and my first instinct was: we’ve got to cut a lot,” the entrepreneur said. Yet, after “we relitigated every single one of our business lines, we ended up cutting very little and we’re actually going to end the year with probably 25%-30% more employees than we started the year with.”","","____","Learn more: \n– Bitcoin and Hard Assets Will Win as Inflation Rises, Novogratz Says and Sees BTC at USD 500K\n– Brace For ‘Really Volatile’ 6-12 Months in Crypto Regulatory Sphere – Novogratz\n\n– Majority Expects Bitcoin to Hit USD 10,000 Before Moving Higher – Survey\n– Bitcoin Could Fall to USD 13.6K This Year, Panel Says After Adjusting Predictions Once Again\n\n– MicroStrategy’s Saylor Says Stepping Down as CEO Will Let Him Focus More on Bitcoin\n– Analysts Discuss ‘Inherent Resilience’ in Bitcoin & Crypto as Rally Fades"],"entity":[{"type":"Crypto Regulatory Sphere – Novogratz\n\n– Majority Expects Bitcoin","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Bitcoin & Crypto as Rally Fades","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"second quarter of 2022","content":"DATE"},{"type":"12 Months","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Novogratz","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"46%","content":"PERCENT"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Panel Says After Adjusting Predictions Once Again\n\n– MicroStrategy","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Forecast","Galaxy Digital","Mike Novogratz"],"authors":["Jaroslaw Adamowski"]}