{"summary":"Justin Sun: Christie’s Tech Glitch Stopped Me Paying USD 70M for Beeple NFT","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/justin-sun-christie-s-tech-glitch-stopped-me-paying-usd-70m-9517.htm","publishDate":"2021-03-12T08:10:00","id":19007,"type":null,"title":"Justin Sun: Christie’s Tech Glitch Stopped Me Paying USD 70M for Beeple NFT","category":["News "],"content":["The Tron (TRX) chief Justin Sun has spoken out after it was confirmed he was thwarted in the finals seconds during his attempt to buy the first piece of digital-only art to go under the hammer at the auction house Christie’s.","Initially, it was reported that Sun had been successful with a USD 69m bid for the work, entitled “Everydays: The First 5,000 Days,” by the artist Beeple. But it later emerged that Sun had been gazumped with a last-gasp bid from an unknown buyer who is yet to come forward.","As previously reported, Christie’s Noah Davis explained that a “handful of really dogged, really serious clients” had been bidding for the non-fungible token (NFT) work, adding that “they are mostly people who are very steeped in crypto.”","Sun, however, appears incensed by the development, and took to Twitter to post a 12-part explanation of how he believes he should have become the rightful owner of the work. He alleged that an error on the Christie’s system had stopped him from submitting an 11th-hour bid of his own – for a staggering USD 70 million.","Sun wrote that he was ”outbid by another buyer in the last 20 secs by USD 250k. [The] difference was less than 0.3% of the total price,” adding that after the late (and eventually winning bid was lodged),","“I tried to update my bid to USD 70m [in] the last 30 seconds, yet my offer was somehow not accepted by Christie’s system even though there was still 20 seconds left [of the auction].”","He posted what he claimed was video proof of his bidding activity, and contacted Christie’s to ask for an explanation, with what appeared to be an email from the auction house confirming that “unfortunately” his “bid did not reach” the auction house’s “bidding system in time.”","The Tron chief said he was not prepared to bear a grudge about the matter, adding,","“I respect Christie’s rules, and it was just unfortunate that we were not familiar with these terms hence lost the bid. I believe when the leading bidder gets outbid during the last few secs, they should get at least 90 seconds [to have the] chance to place one more bid. […] My commitment and investment to art and NFT [and] to the Tron community won’t stop here. And I’m dedicated to finding the next Beeple and the next visionary digital artist!”","He also claimed that Christie’s would benefit from making use of blockchain technology to avoid issues like these in the future – and naturally offered to “help” with “incorporating blockchain technology to” the auction house’s system.","Elsewhere on Twitter, sharp-witted crypto-keen observers came up with alternative plans of action for the Tron chief.","And as for Beeple, perhaps Sun will be interested in the artist’s latest project…","____\nLearn more:\n– Justin Sun, Sina Estavi & Co Race to Buy NFT of Jack Dorsey’s First Tweet\n– Justin Sun Denies Bid to Enlist 13.6m-sub YouTuber as Tron ‘Shill’\n– Second-Hand NFT Market for NBA Top Shot Packs Appears on eBay\n– Consider These Legal Questions Before Spending Millions on NFTs\n– NFT Overtakes Litecoin, Bitcoin Cash, and XRP on Google\n– Grimes and Paris Hilton Go Full NFT – But Some Warn of Trouble Ahead\n– Check These 4 Make-Your-Own-NFT Platforms\n– Non-Fungible 2021: Prepare Your NFTs For DeFi, Staking, and Sharing\n– ‘Traditional’ Art vs. Crypto Art: How to Value It\n– NFT: Can Burning A Banksy Make It More Valuable?"],"entity":[{"type":"Christie’s","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"First Tweet\n– Justin Sun","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"gasp","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"last 30 seconds","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Beeple","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"Sina Estavi & Co Race to Buy NFT","content":"ORGANIZATION"},{"type":"Christie’s Noah Davis","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"NBA Top Shot Packs Appears","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Grimes","content":"PERSON"},{"type":"Christie","content":"ORGANIZATION"},{"type":"last 20","content":"DATE"}],"hashtag":["Art","Justin Sun","NFT","Non-fungible tokens","Tron"],"authors":["Tim Alper"]}