{"summary":"Orbit Suspends Cross-Chain Bridge Contract After $82M Exploit: Beosin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/orbit-suspends-cross-chain-bridge-contract-after-82m-exploit.htm","publishDate":"2024-01-01T05:08:24","id":19000,"type":null,"title":"Orbit Suspends Cross-Chain Bridge Contract After $82M Exploit: Beosin","category":["Blockchain News "],"content":["Just hours before welcoming the new year, hackers exploited Orbit Bridge, the cross-chain bridging service of Orbit Chain, making off with a staggering $82 million.","The project soon suspended the cross-chain bridge contract and initiated on-chain negotiations with the attackers, as reported by Beosin Alert, an on-chain analytics platform.","🚨@Orbit_Chain has been hacked for over $81M.","The project has suspended the cross-chain bridge contract and started on-chain negotiation with the attacker.","Attacker: 0x9263e7873613ddc598a701709875634819176aff","— Beosin Alert (@BeosinAlert) January 1, 2024","","Concerns about a potential exploit were first raised by pseudonymous Twitter user Kgjr on December 31, who highlighted significant outflows from the Orbit Chain Bridge protocol.","Blockchain analytics platform Arkham Intelligence revealed that the hackers orchestrated five separate transactions, transferring $30 million in Tether (USDT), $10 million in USD Coin (USDC), Ethereum (ETH), 231 Wrapped Bitcoin (WBTC), and $10 million worth of the algorithmic stablecoin DAI to fresh wallets.","Looks like orbit bridge is getting drained right now, different fresh wallets for wbtc usdt usdc and dai, test tx's showup on orbit bridge scanner but bigger ones doesnt. Wallets bellow pic.twitter.com\/zlUbT0HrO2","— Kgjr (clueless333) (@KGJRTG) December 31, 2023","","Orbit Chain, a South Korean-based multi-asset blockchain, is renowned for facilitating cross-chain transfers between various decentralized networks, particularly EVM-compatible networks and Klaytn. Notably, the protocol has strong ties to the Klaytn network, with eight of the largest assets on Klaytn being wrapped assets on the Orbit Bridge.","The native coin of Orbit Chain (ORC) dropped as much as 19% upon the news of the exploit. At the time of writing, the coin is trading at $0.0576, with the price continuing to fall, as per Coingecko data."],"entity":[{"type":"South Korean","content":"LOCATION"},{"type":"$81M","content":"MONEY"},{"type":"December 31","content":"DATE"},{"type":"Beosin Alert","content":"ORGANIZATION"},{"type":"January 1, 2024","content":"DATE"},{"type":"Klaytn","content":"PERSON"},{"type":"$0.0576","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"$82 million","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"December 31, 2023","content":"DATE"},{"type":"$10 million","content":"MONEY"}],"hashtag":["Crypto hack","DeFi"],"authors":["Jai Pratap"]}