{"summary":"Crypto winter is here; with Bitcoin falling below 20k from 69k and ETH falling below 1k from 4.9k, many are wondering, &quot;where do we go from here?&quot; Unfortunately, no one has the answer. We may continue to tumble to new lows with liquidations across the board and the looming threat of an economic crisis, or maybe we have forced out all the weak hands and begin to build up to new highs with prosperity across the ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154524\/using-on-chain-analytics-to-conquer-the-bear-market","publishDate":"2022-06-28T09:00:15","id":1900,"type":null,"title":"Using On-Chain Analytics to Conquer the Bear Market","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Crypto winter is here; with Bitcoin falling below 20k from 69k and ETH falling below 1k from 4.9k, many are wondering, \"where do we go from here?\" Unfortunately, no one has the answer. We may continue to tumble to new lows with liquidations across the board and the looming threat of an economic crisis, or maybe we have forced out all the weak hands and begin to build up to new highs with prosperity across the ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Whether we go up or down from here, everyone has the common goal of trying to hedge losses and magnify gains, and there are tools to help. On-chain analytics have been around since Bitcoin's creation in 2008. As time progresses, we learn more about on-chain activity and what to look for. Let's look at what activity we should keep an eye out for moving forward.<\/span>","<b data-v-f87c67ca=\"\">Liquidity Movements<\/b>","<span data-v-f87c67ca=\"\">Liquidity is critical when investing in any asset. You can own millions of dollars worth of a token, but if there is no liquidity, it will be impossible to ever cash out of that asset. Regarding DeFi, liquidity pools with low liquidity lead to slippage on trades and faster price movements. Imagine you are trying to cash out $1000 of an asset into a pool with only $2000 in liquidity - there is no chance you reclaim your total value, and in selling the asset, the price could fall up to 50%!<\/span>","<span data-v-f87c67ca=\"\">Watch the liquidity pools for your favorite DeFi token using the <\/span><a href=\"https:\/\/dex.guru\/token\/0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2-eth\/liquidity\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DexGuru token liquidity page<\/span><\/a><span data-v-f87c67ca=\"\">. This tool will let you see whether bots, small players or whales are moving their assets. Be wary if you start seeing significant amounts of liquidity leaving your investment pools, and have confidence if you see liquidity flowing into your asset of choice. The tool also lets you know which protocols have the most liquidity so that traders know where to focus their trading activity.<\/span>","<b data-v-f87c67ca=\"\">Watching the Whales<\/b>","<span data-v-f87c67ca=\"\">Who doesn't love to go whale watching? Retail traders and investors often see the large holders of any asset as knowledgeable and experienced (hence the reason they have a large amount of capital). This is historically true, but in the past has been challenging to track. Warren Buffett's holdings and moves are only announced quarterly, and by the time of reading, the everyday participant might have missed the ship on a trade. With crypto, this is a problem of the past as users can view whale transactions in real-time.<\/span>","<span data-v-f87c67ca=\"\">Using <\/span><a href=\"https:\/\/dex.guru\/token\/0xf4d2888d29d722226fafa5d9b24f9164c092421e-eth\/profile\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DexGuru's top token holders tool<\/span><\/a><span data-v-f87c67ca=\"\">, traders can view the top 100 holders of any DeFi token and their average entry price. You can also see whether they've been selling or adding to their bags over the past seven days. Using this tool will let you genuinely watch the whales and be the first to act if they do.<\/span>","<b data-v-f87c67ca=\"\">More About DexGuru<\/b>","<span data-v-f87c67ca=\"\">DexGuru is <\/span><b data-v-f87c67ca=\"\">a trading terminal made for traders in the DeFi era,<\/b><span data-v-f87c67ca=\"\"> leveraging on-chain analytics combined with token swap execution capabilities. They are committed to bringing retail traders all the best tools available, with more tools added every month to give them the edge they need. With a recently launched <\/span><a href=\"https:\/\/blog.dex.guru\/bootstrap\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DAO<\/span><\/a><span data-v-f87c67ca=\"\"> in the bootstrap phase, they are decentralizing data and the project itself.<\/span>","<a href=\"https:\/\/dex.guru\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DexGuru Trading Terminal<\/span><\/a>","<a href=\"https:\/\/discord.gg\/dPW8fzwzz9\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DexGuru Discord<\/span><\/a>","<a href=\"https:\/\/twitter.com\/dexguru\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DexGuru Twitter<\/span><\/a>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1000","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"DexGuru Trading Terminal","content":"ORGANIZATION"},{"type":"$2000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Warren Buffett","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"2008","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}