{"summary":"XRP Correcting Gains After Rallying on Good News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-correcting-gains-after-rallying-on-good-news-5460.htm","publishDate":"2020-01-07T10:47:15","id":19005,"type":null,"title":"XRP Correcting Gains After Rallying on Good News","category":["Altcoin News "],"content":["On Tuesday, XRP, the native token of the Ripple Ledger and the third most valuable coin by market capitalization, is correcting its gains after a strong rally on Monday, prompted by positive news.","At pixel time (10:07 UTC), XRP trades at c. USD 0.215 after almost touching USD 0.225 earlier today (UTC time). The price is still up by more than 4% in the past 24 hours and by 11.5% in a week, trimming its monthly losses to 4.6%. The coin is the best performer among the top 10 digital assets by market capitalization today.","XRP price chart:","XRP started its rally on Monday, just right before major crypto exchange Binance announced the launch of XRP\/USDT Perpetual Futures with up-to 75X leverage, prompting speculations about a possible insider trading. In either case, the derivative product is estimated to expand the XRP market.","Also, major money transfer company MoneyGram, co-owned by Ripple, announced “record-breaking” online transaction growth during the holiday shopping season from its MoneyGram-branded online platforms:","However, the company did not provide any other numbers.","As reported in December, while MoneyGram has already pushed more than USD 100 million through Ripple’s platform, the blockchain-based startup’s capability to lure more clients will be crucial to the partnership’s future, according to Alex Holmes, CEO and Chairman of MoneyGram.","Meanwhile, in related news from last week, South Korean telecoms giant SK is set to debut a new blockchain-powered donations platform it has developed using Ripple technology."],"entity":[{"type":"Monday","content":"DATE"},{"type":"South Korean","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"MoneyGram","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"4.6%","content":"PERCENT"},{"type":"11.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Alex Holmes","content":"PERSON"}],"hashtag":["Adoption","Market","Ripple","XRP"],"authors":["Dalmas Ngetich"]}