{"summary":"Visa Partners with Transak To Enable Direct Crypto-to-Fiat Transactions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/visa-partners-with-transak-to-enable-direct-crypto-to-fiat-transactions.htm","publishDate":"2024-01-30T21:59:08","id":19001,"type":null,"title":"Visa Partners with Transak To Enable Direct Crypto-to-Fiat Transactions","category":["Blockchain News "],"content":["Visa, a global payment giant, is further advancing its foray into cryptocurrency adoption by collaborating with Web3 infrastructure provider Transak. The partnership aims to introduce a new method for exchanging cryptocurrencies for fiat currencies without relying on centralized exchanges.","The integration leverages Visa Direct, enabling users to withdraw cryptocurrencies such as Bitcoin directly from a wallet like MetaMask to a Visa debit card. The solution facilitates real-time card withdrawals, allowing users to convert crypto balances into fiat currencies quickly and easily. The integration is available immediately and provides the ability to pay at more than 130 million merchant locations where Visa is accepted.","Transak’s collaboration with Visa significantly expands the options for converting cryptocurrencies into fiat currencies, marking a milestone in bridging the gap between the crypto and traditional finance worlds. Users from 145 countries can directly convert 40 cryptocurrencies to fiat through this partnership without relying on centralized exchanges. Supported countries include Cyprus, Malta, Singapore, Turkey, Portugal, and the United Arab Emirates.","Visa Direct’s program enables third-party providers, like Transak, to connect to Visa’s network, facilitating direct payments onto Visa cards. Users can now process transactions in less than 30 minutes, allowing for nearly real-time conversion of crypto into fiat. The Visa Direct platform supports over 40 major cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Solana (SOL), and Dogecoin (DOGE), and is accessible in more than 145 countries.","North America Head of Visa Direct and Global Ecosystem Readiness, Yanilsa Gonzalez-Ore, lauded the collaboration, noting that it gives crypto users the convenience to spend at over 130 million visa-powered merchant locations in real time.","“By enabling real-time card withdrawals through Visa Direct, Transak is delivering a faster, simpler, and more connected experience for its users — making it easier to convert crypto balances into fiat, which can be spent at the more than 130M merchant locations where Visa is accepted.”","Transak provides payment and onboarding services, allowing users to buy and sell crypto assets, manage the necessary know-your-customer (KYC) requirements, monitor risk, and comply with clients, including MetaMask and Coinbase Wallet. Having raised $20 million in a Series A funding round last year for global expansion, Transak’s integration with Visa Direct marks a significant step toward mainstream cryptocurrency adoption.","Transak’s marketing head and investor relations lead, Harshit Gangwar, sees the collaboration as a major step toward mainstream acceptance and utilization of cryptocurrencies. He highlighted the accessibility and convenience brought about by the integration, making it easier for users of decentralized platforms and wallets like MetaMask, Ledger, and Trust Wallet to off-ramp directly to a Visa card.","Gangwar noted that Transak’s involvement in the integration is crucial, as the platform holds licenses in multiple jurisdictions and ensures that Know-Your-Customer and Anti-Money Laundering measures are in place. This enables Transak to verify users and legally facilitate such transactions.","MetaMask’s senior product manager, Lorenzo Santos, acknowledged the significance of the collaboration, stating that it opens new horizons for MetaMask users, providing more flexibility in cryptocurrency-to-fiat conversions. MetaMask users, for instance, gain the ability to off-ramp directly from their wallets to a Visa card, enhancing the usability and practicality of their digital assets.","The partnership was announced when crypto ownership witnessed significant growth over the past year. According to crypto.com, global crypto usage increased by 34% in 2023, with the number of cryptocurrency holders or users rising from 432 million to around 580 million worldwide. Bitcoin and Ethereum (ETH) are cited as major contributors to the increase in crypto users globally."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"Portugal","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"North America Head of Visa Direct and Global Ecosystem Readiness","content":"ORGANIZATION"},{"type":"34%","content":"PERCENT"},{"type":"Cyprus","content":"LOCATION"},{"type":"Lorenzo Santos","content":"PERSON"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Transak","content":"ORGANIZATION"},{"type":"Harshit Gangwar","content":"PERSON"},{"type":"Malta","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Yanilsa Gonzalez","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":["CRYPTO","Transak","Visa"],"authors":["Hassan Shittu"]}