{"summary":"Crypto Stocks Surge as Analyst Says ‘Not The Time to Turn Bearish’ on Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-stocks-surge-as-analyst-says-not-the-time-to-turn-bearish-on-bitcoin.htm","publishDate":"2024-01-26T20:56:25","id":19010,"type":null,"title":"Crypto Stocks Surge as Analyst Says ‘Not The Time to Turn Bearish’ on Bitcoin","category":["Bitcoin News "],"content":["The crypto market experienced whiplash this week, with Bitcoin and related crypto stocks seeing a sharp selloff followed by a big rebound. After falling below $39,000 early in the week, bitcoin popped back above $42,000 on Friday, lifting crypto-focused stocks with it.","Bitcoin mining companies saw the biggest gains, with the likes of Core Scientific, Hut 8, and TeraWulf jumping 15% or more. Other crypto stocks like Coinbase and MicroStrategy, which hold Bitcoin on their balance sheet, also rallied 3-5%.","The initial catalyst for the selloff was profit-taking after the long-awaited Bitcoin ETF approval, which some saw as a “sell the news” event. Outflows from the Grayscale Bitcoin Trust and selling pressure from FTX’s bankruptcy estate added fuel to the fire.","Some analysts view the weakness as temporary, however. 10x Research head of research Markus Thielen believes macro tailwinds will support Bitcoin through 2024. He sees the U.S. election cycle prompting constructive fiscal policy that lifts asset prices.","“Even if Bitcoin ETF inflows disappoint, this is not the time to turn bearish as the macro environment will remain a tailwind in 2024, and the US election cycle will see a constructive fiscal response that will lift asset prices higher,” Thielen noted.","This morning, when #Bitcoin traded at 40,100 – we turned bullish. Our indicators signaled that Bitcoin could start to make a move higher after consolidating\/correcting for the last three weeks when we warned that #Bitcoin could decline into the 36,000\/38,000 retracement box.… pic.twitter.com\/ewGzg3pnBd","— 10x Research (@10x_Research) January 26, 2024","","It was a week of extremes for crypto exchange Coinbase, with wild share price swings after both an upgrade and downgrade from Wall Street in rapid succession.","On Tuesday, JPMorgan slapped Coinbase with an underweight rating due to disappointing flows into Bitcoin ETFs. This added pressure to an already brutal selloff, pushing Coinbase stock down nearly 10% intraday Tuesday.","But sentiment shifted Thursday after analysts from Oppenheimer upgraded Coinbase, citing the exchange’s strong fundamentals and battle-tested management team. The upgrade helped drive Coinbase shares up 7% Thursday.","Such volatility is par for the course when it comes to crypto stocks. With Coinbase heavily exposed to crypto price action, analysts warn investors should brace for continued turbulence ahead.","MicroStrategy, which holds billions in Bitcoin on its corporate balance sheet, trades in lockstep with the crypto as a de facto BTC proxy stock.","MicroStrategy is buying.\nBlackRock is buying\nEl Salvador is buying\nArk is buying\nbillion dollar companies are buying.","And you're still selling","This will be one of the biggest bullrun in crypto history. In whatever you’re buying make sure you add $ARC in the bag. Huge AI season","— Kency₿ (@KencyXBT) January 26, 2024","","This week was no exception, with MicroStrategy shares rising and falling in tandem with Bitcoin’s wild price swings. The stock shed nearly 15% during Bitcoin’s plunge below $39,000, then rebounded around 8% as BTC popped back above $42,000.","MicroStrategy’s latest Bitcoin buying spree came in late 2023—between November 30 and December 26—when the company scooped up about 14,620 more coins to grow its holdings to around 189,000 BTC.","With such a large crypto position relative to its market cap, MicroStrategy will likely continue to be affected by Bitcoin’s frequent booms and busts.","As Bitcoin leads the way, analysts say now is the time for patience and discipline rather than panic. For crypto stocks and tokens, the road ahead promises more thrills and spills. But analysts urge investors to keep their eyes on the horizon.",""],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Markus Thielen","content":"PERSON"},{"type":"Oppenheimer","content":"ORGANIZATION"},{"type":"$42,000","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"$ARC","content":"MONEY"},{"type":"January 26, 2024","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Thielen","content":"PERSON"},{"type":"$39,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November 30","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"December 26","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Mining","crypto stocks"],"authors":["Trent Alan"]}