{"summary":"Parallelized EVMs May Solve Blockchain Trilemma, But It’s Risky Business","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/parallelized-evms-may-solve-blockchain-trilemma-but-its-risky-business.htm","publishDate":"2024-03-22T18:30:04","id":19013,"type":null,"title":"Parallelized EVMs May Solve Blockchain Trilemma, But It’s Risky Business","category":["Ethereum News "],"content":["Data from Fortune Business Insights predicts that the global blockchain technology market size will reach $469.49 billion by 2030. Although the potential behind blockchain technology is huge, a number of setbacks may hamper adoption however.","For instance, the “blockchain trilemma” continues to be one of the biggest challenges for Web3 developers and users alike. ","The blockchain trilemma refers to the notion that it may be impossible to achieve everything blockchain promises – which is decentralization, security, and scalability. This is because increasing one of these elements often leads to the weakening of another. ","Blockchain trillema.","Let's educate ourselves on it to understand how it works in order to protect ourselves from any manipulation.","The blockchain trilemma is a concept coined by Vitalik Buterin that proposes a set of three main issues,decentralization, security and scalability pic.twitter.com\/6v8Vd8XrfQ","— The Crypto YoGi (🎭,🏠) (@Yogi13031997) August 20, 2023","","While the blockchain trilemma has existed for years, new solutions are being implemented to address these challenges. ","For example, parallelized Ethereum Virtual Machines (EVMs) are a recent development that seeks to fix scalability issues plaguing the Ethereum network. ","Tom McClean, Senior Researcher at decentralized exchange Vega Protocol, told Cryptonews that a traditional EVM network – such as Ethereum and many of its layer-2 networks (L2s) – requires all transactions to be processed sequentially. ","But McClean noted that processing transactions one after the other reduces hardware requirements, limits transaction throughput, and doesn’t take advantage of modern advances in multi-core processing. ","“Parallelized EVMs attempt to reduce this problem by running transactions in parallel, which can theoretically significantly increase processing speed,” said McClean. “This can lead to a generally faster blockchain.” ","Given this potential, Matt Ballensweig, Head of Go Network – a digital asset settlement solution from BitGo – told Cryptonews that parallelized EVMs have the ability to solve the blockchain trilemma. ","“Parallelized EVMs radically reduce transaction latency, allow for much lower transaction fees and create space for interoperability,” he said.","Ballensweig noted that platforms like Neon, Sei Network, and Monad are all working on parallelized EVM solutions to make networks like Solana and Ethereum interoperable and more performant. ","Sukanya Parashar, Senior Integration Engineer at Neon, told Cryptonews that Neon EVM is the first EVM live on Solana mainnet. ","According to Parashar, Neon’s parallelized EVM solution enables concurrent transaction processing without compromising the security and decentralization of the network – essentially solving the blockchain trilemma. ","Parashar explained that this is made possible by utilizing a state sharding mechanism, which splits blockchain data into partitions. ","“This solution aims to solve the scalability bottleneck, allowing for a higher transaction throughput while maintaining a decentralized consensus,” said Parashar. ","She added that the goal behind Neon EVM is to allow Ethereum-based dApps to be deployed on Solana without any code changes. This would also enable developers and users to leverage scalability and parallel processing from the Solana network. ","“Multiple dApps spanning across decentralized finance (DeFi), non-fungible tokens (NFTs), and gaming have already launched on Neon EVM,” said Parashar. “Among these dApps, some are native to Neon EVM while others are pre-existing dApps from the EVM ecosystem that have expanded to Neon EVM to leverage Solana’s liquidity and its network benefits.”","This is important, as Parashar shared that a large portion of Solana’s user base, liquidity, and community remains untapped by EVM-based dApps. ","Parashar hopes that Neon’s parallelized EVM solution can solve this, as she pointed out that Solana is the largest non-EVM ecosystem. ","“It’s the fourth largest chain by Total Value Locked, with over 20 million monthly active users and a well matured DeFi ecosystem,” she said. “In essence, we believe that Neon EVM is the easiest way to access Solana for EVM dApps.”","Startup Sei Labs has also recently introduced a parallelized EVM called “Sei V2.” A blog post describing the solution notes, “Sei V2 is Sei’s first major upgrade to become the first fully parallelized EVM.”","Head of Marketing at Sei Labs – who goes by the name of “Grover ” – told Cryptonews that Sei V2 already contains a number of unique features. ","“The first is ‘Twin Turbo Consensus,’ which allows Sei to reach the fastest time to finality of any blockchain, unlocking web2 like experiences for applications,” he said. ","90% of Ethereum transaction time is spent on consensus. Sei's twin-turbo consensus greatly enhances this process, leading to unprecedented efficiency.","Explore our recent blog on the twin-turbo consensus and its role in Sei's Web2-like UX & speed 🔴 💨","🔗 https:\/\/t.co\/4wNhxwvNiZ pic.twitter.com\/tB0NYLnr90","— Sei 🔴💨 (@SeiNetwork) March 21, 2024","","Grover added that optimistic parallelization within Sei V2 allows developers to unlock parallel processing for Ethereum applications without additional work. This means that Sei’s EVM solution is  fully interoperable. ","Grover further shared that the Sei database is a major upgrade that will eventually allow Sei to handle a much higher rate of data storage. This is critical for a high performance blockchain.","“The Sei mainnet launch will happen in quarter two of this year,” Grover remarked. ","Keone Hon, CEO and Co-Founder of Monad, told Cryptonews that “Optimistic Parallel Execution” is one of several major improvements that Monad has introduced in order to hyperscale the EVM. ","While it’s still in development, Hon pointed out that Optimistic Parallel Execution can be explained in two stages. "," “In the first stage, many transactions run in parallel as if they were all starting from the same initial state,” said Hon. “For each transaction, Monad executes bytecode, pulls dependencies from disk, and writes a pending result with a record of the input and output state variables for that transaction.”","In the second stage, Hon explained that pending results are then committed in the original order of the transactions.","“Each pending result is immediately accepted if its inputs are unchanged, or immediately re-executed if any inputs have been altered,” he said.","As a result, Hon believes that Monad is capable of achieving the same end state as if transactions were running sequentially. In other words, the feature will introduce major time savings.  ","“This ensures total backwards compatibility with Ethereum,” Hon remarked. “Performant parallel execution requires addressing the biggest bottleneck for execution, which is state access.”","Hon shared that these optimizations for the Ethereum community will be made available later this year. ","While the promise of parallelized EVMs is notable, a number of risks are involved with these solutions.","“Though parallelized EVMs have a lot of upside and are quickly evolving and integrating into the broader ecosystem, there are certain risks that need to be carefully mitigated such as increased technical complexity and potential security factors,” said Ballensweig.","Parashar explained that challenges in parallel processing stem from the inherent complexity of implementation in computing systems. ","“Multitasking and multiprocessor setups introduce more points of failure,” she said. “In blockchain networks, like Solana, parallel transaction execution increases system complexity, leading to potential bugs and outages.”","Given this, Parashar commented that ensuring accurate state updates across multiple threads is crucial to prevent invalid changes. ","She added that general issues related to parallel and concurrent computing exacerbate complexity, especially in blockchain networks that contain cryptographic elements.","Grover pointed out that the biggest challenge for Sei will be to upgrade the Sei blockchain network with the upcoming parallelized EVM features. ","“This will be like changing the wings on a plane in-flight, but Sei Labs is up to the task,” he said. ","Yet Alejo Pinto, Co-Founder and Chief Growth Officer at EVM-product development studio Pontem, expressed skepticism.","“Parallelized EVM is an iterative improvement, but relatively untested,” said Pinto. “It enables all code built with EVM to be ported over.”","Therefore, Pinto believes that alternative virtual machines, like parallelized EVMs, still need to be tested in production before developers and users will feel comfortable adopting them. "],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Vega Protocol","content":"ORGANIZATION"},{"type":"Grover ” –","content":"PERSON"},{"type":"March 21, 2024","content":"DATE"},{"type":"Tom McClean","content":"PERSON"},{"type":"Pinto","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Senior Integration Engineer","content":"ORGANIZATION"},{"type":"Neon EVM","content":"ORGANIZATION"},{"type":"Sukanya Parashar","content":"PERSON"},{"type":"McClean","content":"PERSON"},{"type":"Grover","content":"PERSON"},{"type":"Monad","content":"LOCATION"},{"type":"Monad","content":"PERSON"},{"type":"Matt Ballensweig","content":"PERSON"},{"type":"Parashar","content":"PERSON"},{"type":"Keone Hon","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"August 20, 2023","content":"DATE"},{"type":"Parashar","content":"LOCATION"},{"type":"Neon","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machines","content":"ORGANIZATION"},{"type":"Hon","content":"PERSON"},{"type":"Monad","content":"ORGANIZATION"},{"type":"$469.49 billion","content":"MONEY"},{"type":"Alejo Pinto","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Total Value Locked","content":"ORGANIZATION"},{"type":"Ballensweig","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["etherem","Parallelized EVM","Solana"],"authors":["Rachel Wolfson"]}