{"summary":"Playnance Introduces Gaming Layer-3 PlayBlock on Arbitrum Orbit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/playnance-introduces-gaming-layer-3-playblock-on-arbitrum-orbit.htm","publishDate":"2024-03-20T13:00:39","id":19015,"type":null,"title":"Playnance Introduces Gaming Layer-3 PlayBlock on Arbitrum Orbit","category":["Blockchain News "],"content":["Playnance has announced the scheduled launch of PlayBlock, a Layer-3 gaming ecosystem developed on the Arbitrum Orbit.","A press release shared with Cryptonews.com revealed that PlayBlock seeks to enhance Playnance’s offerings in the web3 gaming space and attract over 10,000 of daily active users by providing a variety of gaming options.","In collaboration with Gelato’s Rollup-as-a-Service (RaaS) Platform, PlayBlock aims to enhance web3 gaming by eliminating gas fees and challenging traditional blockchain barriers. This initiative could offer game developers broad white-labeling options and smooth platform integrations to overcome common user experience hurdles.","Roman Levi, CTO at Playnance, emphasized the platform’s design goals. “Our ambition is driven by the goal to combine the benefits of Web3 on-chain gaming with the fun and accessibility of traditional games, all without the web3 complexity,” he stated.","The chain is engineered to support a diverse range of games, from decentralized trading to sports and arcade genres, set to appeal to a broad user base.","PlayBlock also leverages Arbitrum Nitro’s rollup technology for its operations. This combination is intended to foster a more user-friendly gameplay experience on the blockchain, enhancing aspects like transparency, fairness, and ownership of in-game assets.","The integration with Arbitrum Anytrust technology further enables the network to boast a 250ms block time and near-instant transaction finality, facilitating the processing of thousands of transactions every second.","PlayBlock will also bring the PBG token, utilizing Orbit’s native gas token feature to offer a zero-gas fee environment for gamers. Moreover, the introduction of PlayBlock Layer3’s own stablecoin USDP pegged to the U.S. dollar plans to mitigate market volatility.","“Playnance approached us with a request to design an end-to-end gaming platform supporting thousands of games and millions of users,” said Gelato founder Hilmar Orth.","“We developed a gaming-first, fully-serviced, auto-scalable rollup infrastructure enabling Playnance to grow and scale at pace, whilst focusing on their core business,” Orth stated."],"entity":[{"type":"Orth","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Gelato’s Rollup","content":"ORGANIZATION"},{"type":"Playnance","content":"LOCATION"},{"type":"Arbitrum Nitro","content":"ORGANIZATION"},{"type":"Levi","content":"PERSON"},{"type":"Hilmar Orth","content":"PERSON"},{"type":"3","content":"DATE"},{"type":"CTO","content":"ORGANIZATION"},{"type":"PBG","content":"ORGANIZATION"}],"hashtag":["Arbitrum","Gaming","Web3"],"authors":["Hongji Feng"]}