{"summary":"Coinbase and Bybit gained the most market share following Binance&#x27;s recent settlement with U.S. authorities, according to Kaiko data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265703\/coinbase-bybit-main-winners-following-binance-settlement","publishDate":"2023-12-01T11:38:45","id":1902,"type":null,"title":"Coinbase and Bybit are main winners following Binance settlement: Kaiko","category":["EXCHANGES"],"content":["In the wake of Binance's $4 billion settlement with U.S. authorities last week, crypto exchange rivals Coinbase and Bybit have emerged as the main beneficiaries.","Despite registering over <a href=\"https:\/\/www.theblock.co\/post\/264204\/binance-saw-1-billion-in-net-outflows-over-the-last-24-hours\" data-v-f87c67ca=\"\">$1 billion in outflows<\/a> during the aftermath of the settlement, Binance has not shown signs of a dramatic decline in liquidity, however, with the exchange's market depth rising post-settlement, <a href=\"https:\/\/research.kaiko.com\/author\/riyad-carey\" data-v-f87c67ca=\"\">according<\/a> to Kaiko research analyst Riyad Carey.","U.S. authorities, including the Department of Justice, Department of the Treasury and the Commodity Futures Trading Commission, <a href=\"https:\/\/www.theblock.co\/post\/264010\/justice-department-set-to-announce-settlement-with-binance-bloomberg\" data-v-f87c67ca=\"\">settled<\/a> with Binance last week, concluding a criminal investigation into allegations of money laundering and sanctions violations and marking one of the largest corporate settlements in U.S. history. The settlement involved $4.3 billion in penalties and included criminal charges against former CEO Changpeng Zhao, who <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">stepped down<\/a> as part of a plea deal.","Coinbase was one beneficiary, at least in terms of its share price. Coinbase's stock was already performing well in November, with the Binance settlement adding fuel to the fire, Carey said, as COIN surged by over 75% for the month.","COIN currently trades at $130.36, up more than 250% year-to-date, reaching its highest level in 18 months, according to TradingView.","<span data-v-f87c67ca=\"\">COIN\/USD price chart. Image: <a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-COIN\/\" data-v-f87c67ca=\"\">TradingView<\/a>.<\/span>","Using bitcoin as a proxy, as it has the highest non-stablecoin volume, Bybit was the \"immediate standout winner\" in terms of market share post-settlement, Carey added, growing by more than 20% in 16 out of 24 hours following the deal. Given that Binance's dominance is so large, up to a 4% drop in its market share during certain hours caused up to a 50% gain for Bybit and up to a 34% gain for Coinbase.","Notably, Coinbase's share grew the most outside of U.S. trading hours following the settlement, while OKX gained more at the start of Western Europe's trading day. Other U.S. exchanges performed poorly across the board, Carey added.","The overall impact means Binance has ceded some market share to Coinbase in non-U.S. hours and Bybit across the board, Carey said.","<span data-v-f87c67ca=\"\">Percentage change in BTC market share. Image: <a href=\"https:\/\/research.kaiko.com\/insights\/binance-settlement\" data-v-f87c67ca=\"\">Kaiko<\/a>.<\/span>","Despite the market share loss, Binance maintained its position in terms of liquidity across crypto markets, he added, though Bybit has been closing the gap, while Coinbase still lags slightly behind in terms of spread competitiveness.","The immediate impact of Binance's settlement has been beneficial for Coinbase and Bybit, though early trends didn't look dire for Binance either, Carey said.","Despite theories suggesting Binance may continue to lose market share to competitors, enhanced compliance and AML\/KYC measures could improve trust in the exchange, Carey argued. The loyalty of users to familiar platforms, despite the availability of other exchanges, indicated a certain resilience in customer preferences and stability in liquidity and trading volumes, he added.","Earlier this week, Coinbase told some customers it had received a <a href=\"https:\/\/www.theblock.co\/post\/265009\/coinbase-tells-some-customers-it-received-subpoena-related-to-bybit\" data-v-f87c67ca=\"\">subpoena<\/a> from a U.S. regulator related to Bybit, introducing another interesting dynamic into the competition between the crypto exchange rivals, Carey said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Western Europe","content":"LOCATION"},{"type":"Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Kaiko","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"34%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Carey","content":"PERSON"},{"type":"$130.36","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Bybit","content":"LOCATION"},{"type":"250%","content":"PERCENT"},{"type":"Riyad Carey","content":"PERSON"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Bybit","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","COINBASE"],"authors":["James Hunt","The Block"]}