{"summary":"Top Miners Spend $1.2 Billion In Pre-Halving Machine Shopping Spree + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-miners-spend-1-2-billion-in-pre-halving-machine-shopping-spree-more-news.htm","publishDate":"2023-12-08T14:00:58","id":19027,"type":null,"title":"Top Miners Spend $1.2 Billion In Pre-Halving Machine Shopping Spree + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","The upcoming Bitcoin (BTC) halving and the recent market rebound from the 2022 bottom seem to have bolstered mining companies’ capital expenditure, according to the latest Miner Weekly report by BlocksBridge Consulting.","The report, citing TheMinerMag data, found that a dozen public mining companies have made purchase orders for spot and future stocks of bitcoin mining machines totaling over 70 EH\/s this year so far.","These machine purchase commitments total more than $1.2 billion year-to-date. About $750 million was signed over the past two months.","Some of those purchases have already been paid for. Others will be due in monthly batches over the next year and longer.","In total, public mining companies have spent $747 million in the first three quarters this year on property, plants, and equipment.","“Chinese miner manufacturers are set to be the biggest winners from these purchase deals,” the report said. MicroBT and Bitmain account for 56% and 42% of the $1.2 billion investment identified by TheMinerMag, respectively. Canaan accounts for the rest of it.","Even though the United Kingdom is far behind the United States in terms of revenue and the number of users, the UK crypto industry maintains a strong pace of growth. It is growing much faster than the world’s largest crypto market, according to data presented by AltIndex.com.","The UK crypto industry grossed $1.9 billion this year, or 137% more than the $800 million reported last year. The US crypto market generates most of the global crypto revenues, but it has seen smaller growth, with its revenue rising by 107% YoY to $17.9 billion.","Statista expects the UK to remain the fastest-growing among the top five crypto markets. By 2027, the UK crypto revenues are expected to double and hit $3.77 billion. The US market will see a 76% growth in the same period, with crypto revenue rising to $31.6 billion.","Furthermore, Statista expects the number of users to continue rising, seeing nearly one-third of the country’s population, or 22.3 million people, using cryptos as an investment or a payment method by 2027.","In comparison, the user penetration market in the US market, which now counts over 74 million users, will grow from 22% to 28% in this period, it said.","USDT issuer Tether has announced a collaboration with Bitkub, Thailand’s largest crypto exchange by trading volume.","According to the press release, the companies will launch a comprehensive educational program to improve blockchain literacy in Thailand. Additionally, they aim to foster stablecoin awareness.","The partners will craft educational courses, conduct awareness campaigns, introduce incentive-based learning programs, and host regular live Q&A sessions.","“Given USDT’s prominence as the most traded stablecoin on the Bitkub Exchange and within Thailand, this collaboration will be essential in driving understanding within the region,” the announcement said.","Crypto exchange BingX launched its latest initiative BingX Global Broker Program, aiming to enhance and diversify service offerings within the blockchain industry.","Per the press release, the program is open to cryptocurrency brokers globally. It offers them the chance to earn commissions through trading on BingX’s Perpetual Futures and Spot markets.","Brokers participating in the program will see a reward structure based on trading volume and fees generated on BingX. They will get additional bonuses for successful referrals. Program advantages include up to 55% in trading commissions, daily settlements, and other financial incentives, the exchange said.","BingX also offers specialized API support for individual needs, as well as support for personalized marketing plans.","To date, BingX has established partnerships with over 50 brokers, “marking the Global Broker Program as a critical step in expanding BingX’s service scope,” it said.","Parent company Meanwhile Group’s investment manager arm, Meanwhile Advisors, has announced the launch of “a first-of-its-kind” bitcoin private credit fund, Meanwhile BTC Private Credit Fund LP.","The press release stated that the private credit fund aims to attract institutional investors seeking access to BTC’s growth with an added conservative BTC-denominated yield targeting 5% during the closed fund’s term.","The fund operates under a distinctive structure to ensure tax efficiency for its investors, it said. Investors contribute USD, which is converted into BTC immediately following the fund’s single close. This means that the fund will not take any currency risk to fund the lending activities. Fees are charged in BTC.","This news comes after the company launched a life insurance company entirely denominated in crypto and on the heels of Meanwhile Group’s $20 million seed funding announcement in June, led by OpenAI founder Sam Altman, former Stripe executive Lachy Groom, and Google-affiliated Gradient Ventures.","In the coming months, Meanwhile Group aims to develop a comprehensive range of financial products denominated in crypto, including term life insurance and accidental death coverage in BTC."],"entity":[{"type":"BTC","content":"ORGANIZATION"},{"type":"76%","content":"PERCENT"},{"type":"Google","content":"ORGANIZATION"},{"type":"42%","content":"PERCENT"},{"type":"56%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"$17.9 billion","content":"MONEY"},{"type":"Meanwhile Group","content":"ORGANIZATION"},{"type":"Bitkub","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"$750 million","content":"MONEY"},{"type":"Meanwhile BTC Private Credit Fund LP","content":"ORGANIZATION"},{"type":"$1.9 billion","content":"MONEY"},{"type":"$31.6 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Lachy Groom","content":"PERSON"},{"type":"$747 million","content":"MONEY"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Statista","content":"PERSON"},{"type":"$3.77 billion","content":"MONEY"},{"type":"2027","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Bitkub Exchange","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"107%","content":"PERCENT"},{"type":"55%","content":"PERCENT"},{"type":"137%","content":"PERCENT"},{"type":"Sam Altman","content":"PERSON"},{"type":"BlocksBridge Consulting","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"Thailand","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Gradient Ventures","content":"ORGANIZATION"},{"type":"$800 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["Bitcoin","Bitmain","Investment","Market","Mining","Tether","Thailand","Trading","UK","USA","USDT"],"authors":["Sead Fadilpašić"]}