{"summary":"Enterprise Ethereum Use Cases Expected to Increase in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/enterprise-ethereum-use-cases-expected-to-increase-in-2024.htm","publishDate":"2024-03-20T19:49:49","id":19037,"type":null,"title":"Enterprise Ethereum Use Cases Expected to Increase in 2024","category":["Ethereum News "],"content":["Investors are not the only ones interested in Ethereum (ETH). An increasing number of businesses also plan to leverage Ethereum this year.","While large companies have previously dabbled in Ethereum, industry experts believe that enterprise Ethereum is finally gaining momentum. ","Data from layer-2 (L2) insights platform L2BEAT shows that transactions on the Ethereum mainnet have been steadily rising this month. "," ","Paul Brody, Enterprise Ethereum Alliance Chair and Global Blockchain Leader at EY, told Cryptonews that Ethereum had become the dominant enterprise platform. ","“All the substantive concerns around Ethereum are finally gone,” he said. “Gas fees are also very low, as The Dencun upgrade has been important in this respect since it drives fees down yet another level.”","Indeed, the Dencun upgrade that went live on March 13 readies the stage for protodank sharding. It’s been noted that this will finally lower Ethereum’s high layer-1 fees.","“This may not seem important to those who are used to paying five bucks for gas, but this is critical for enterprises that are thinking about millions or eventually hundreds of millions of transactions,” said Brody. ","According to Brody, scalability and low gas fees are essential for high volumes of business transactions. ","Additionally, he pointed out that the Ethereum L2 ecosystem is maturing.  ","“L2s are finally starting to differentiate,” he said. “For instance, L2s will start to serve more specialized purposes, which will include the specific requirements of enterprises.”","L2s focused on enterprise needs are still a developing concept. Yet, Brody noted that the L2 developed by EY  – known as “Nightfall” – has been solving a specific business problem since its inception in 2019. ","“Nightfall takes into account enterprise privacy requirements,” said Brody. “Specifically, we’ve done one important thing in this respect: an enterprise must have an ‘Enterprise Identity Certification’ in order to access the L2. This means that our L2 is not open to individuals, and that enterprise identity is disclosed when transacting to or from the network.”","This is a critical feature for businesses. For example, Brody mentioned that this ensures that an enterprise network cannot be used for anonymous money transfers. It also requires all the entities operating in the network to be legally registered and compliant.","Given these advancements, companies that have already begun using Ethereum for business have been making further developments. ","Yorke Rhodes, Co-Founder and Director of Digital Transformation for Blockchain at Microsoft, told Cryptonews that Microsoft began leveraging blockchain for supply chain management in 2019. ","While it’s notable that Microsoft used blockchain early on, Rhodes shared that it was just last year that the company completed a major internal release on this effort. ","“It takes time for enterprises to iterate on technology in a way that you don’t see in the sort of small company, open source communities,” said Rhodes. “I think Microsoft is making great progress based on the signal that I’m seeing from customers and partners as well as the recognition of the work that we’re doing internally.”","Rhodes explained that the release has allowed Microsoft to implement a financial controls layer on top of its Quorum Blockchain Service.","Quorum is designed to support multiple ledger protocols. It is built on Consensys Quorum’s Ethereum ledger using the Istanbul Byzantine Fault Tolerance (IBFT) consensus mechanism. ","“The financial controls layer release allows Microsoft to do ‘just in time payments,’ which has a massive value case associated with cost of capital,” explained Rhodes. “And because our blockchain implementation is doing traceability and financial controls specifically for high value chips which power our cloud, it’s a very large capital expenditure on a per year basis.”","Given this successful use case, Rhodes revealed that the Microsoft Edge browser team is in very early tests of a new Ethereum implementation.","“The Microsoft Edge browser already has a wallet built in the browser, which allows individuals to hold Microsoft account information and billing information with Microsoft,” he said. “The team is now adding some crypto wallet features to that, which is currently being tested in Brazil.”","Interestingly, Rhodes remarked that the code being tested has been in the browser wallet for about two years. He explained that this is finally ready to be iterated upon and tested in Brazil’s regulatory friendly environment, however.","The Enterprise Ethereum Alliance (EEA) – a global standards organization for enterprise blockchain – seeks to raise awareness for enterprise Ethereum as the blockchain ecosystem matures.","EEA Executive Director Karen Scarbrough told Cryptonews that the EEA’s mission is to serve as the credible voice of reason that enterprises can rely on for a clear understanding of Ethereum. ","ICYMI: Announced at our Momentum Event: EY’s @pbrody Paul Brody was appointed to #EEA Chairperson, Microsoft’s @thekscar Karen Scarbrough is now the EEA Executive Director and Aglaé Ventures’ @VanessaGrellet Vanessa Grellet has joined the EEA Board!! 🎉 https:\/\/t.co\/x5GE7xN8mq","— Enterprise Ethereum Alliance (@EntEthAlliance) March 20, 2024","","Scarbrough – who also serves as the Senior Technical Program Manager for Microsoft – explained that when she was in a client position at energy company BP there were opportunities to reach out to consultants to learn about private blockchains. ","Scarbrough noted that this type of enterprise readiness is not yet available within an Ethereum L2 environment, however. ","In December last year, the EEA released an “Ethereum Business Readiness Report.” According to Scarbrough, this report is intended to shed light on examples of success in the Ethereum ecosystem. ","“The report serves as a guide for when companies have questions like, ‘What do L2s look like,’” said Scarbrough. ","Scarbrough added that the EEA’s report is important because it highlights successful use cases that can be implemented within other business environments.","For example, she noted that the success of Coinbase’s L2 Base ecosystem has been impressive. ","“Coinbase has driven activity for developers there and continues to enable real world use cases on Base, which is a great data point,” she explained. “Somebody sitting in an industry outside of digital technologies – like where I was previously – that doesn’t come across your desk unless somebody from this ecosystem reaches out and ensures this kind of information is delivered.”","While enterprise Ethereum may be maturing, a number of challenges could hamper adoption.","Lucas Henning, CTO of Web3 company Suku and a former Deloitte Blockchain Architect, told Cryptonews that the biggest challenges for enterprises using Ethereum are still high transaction costs, along with scalability and security issues.","“High transaction fees on Ethereum due to network congestion and the complexity of transactions have led users to seek alternatives,” said Hennings. “However, the shift to L2s – while alleviating some costs – comes with its own challenges. It introduces increased resource demands on L2 but also requires L1 resources for settlement, like rollups.”","Echoing this, Alexander Mamasidikov, Founder and CEO of crypto payment solution provider CrossFi, told Cryptonews that L2 protocols might solve the problem with speed and gas fees, but it complicates the usability of the blockchain itself for enterprises. ","Moreover, Henning pointed out that even with enhancements like the Dencun upgrade, which is aimed at improving the efficiency of rollups, scalability on Ethereum remains constrained.","Challenges aside, Brody remains optimistic about the future growth of enterprise Ethereum. ","For instance, he noted that while the technology and market price of Ether are not connected, the price of the asset is driving enthusiasm.","“One thing that has become visible working in this space is that enterprise buyers – even though their work is oftentimes very unconnected to the price of crypto assets – show enthusiasm for the technology whenever the market price goes up,” he said. ","Moreover, Brody pointed out that enterprise Ethereum adoption will continue to thrive as regulations become more clear. ","He noted that much of this is being driven by The Markets in Crypto-Assets Regulation (MiCA) regulation that was passed in Europe last year.","“MiCA creates a very good regulatory framework and has kind of renewed a lot of the enthusiasm in the finance sector for this technology,” Brody commented. “It seems like a level of enthusiasm and the pace of enterprise adoption is picking up nicely and will only continue to do so.” "],"entity":[{"type":"‘Enterprise Identity Certification’","content":"ORGANIZATION"},{"type":"Hennings","content":"PERSON"},{"type":"Henning","content":"PERSON"},{"type":"Enterprise Ethereum Alliance Chair","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Paul Brody","content":"PERSON"},{"type":"Deloitte Blockchain Architect","content":"ORGANIZATION"},{"type":"Brody","content":"PERSON"},{"type":"Rhodes","content":"LOCATION"},{"type":"Rhodes","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"EEA","content":"ORGANIZATION"},{"type":"Aglaé Ventures’","content":"ORGANIZATION"},{"type":"March 20, 2024","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"Director of Digital Transformation for Blockchain","content":"ORGANIZATION"},{"type":"Yorke Rhodes","content":"PERSON"},{"type":"Quorum Blockchain Service","content":"ORGANIZATION"},{"type":"Vanessa Grellet","content":"PERSON"},{"type":"December last year","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Enterprise Ethereum Alliance (EEA","content":"ORGANIZATION"},{"type":"EEA Board","content":"ORGANIZATION"},{"type":"BP","content":"ORGANIZATION"},{"type":"Scarbrough","content":"PERSON"},{"type":"Lucas Henning","content":"PERSON"},{"type":"March 13","content":"DATE"},{"type":"Ethereum Business Readiness Report","content":"ORGANIZATION"},{"type":"“Nightfall” –","content":"ORGANIZATION"},{"type":"Karen Scarbrough","content":"PERSON"},{"type":"Enterprise Ethereum Alliance","content":"ORGANIZATION"},{"type":"Istanbul","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"EEA Executive Director","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Alexander Mamasidikov","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Adoption","ETH","Ethereum"],"authors":["Rachel Wolfson"]}