{"summary":"A Reminder On Bitcoin’s 13th Birthday: Why It Is Important to Self-Custody Your Keys","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/a-reminder-on-bitcoins-13th-birthday-why-it-is-important-to-self-custody-your-keys.htm","publishDate":"2022-01-03T11:56:00","id":19035,"type":null,"title":"A Reminder On Bitcoin’s 13th Birthday: Why It Is Important to Self-Custody Your Keys","category":["Bitcoin News "],"content":[" ","On January 3, 2009, the first Bitcoin (BTC) block, also known as the Genesis block, was mined by the project’s pseudonymous creator Satoshi Nakamoto. Today marks exactly thirteen years from the event, and the crypto community is celebrating Bitcoin becoming a teenager (Happy Bitcoin Birthday!).","Today is also one more thing: it is the fourth Proof of Keys Day (PoK), an event meant to examine whether Bitcoin users really own their coins or not, which is led by the famous ‘not your keys, not your coins’ adage. ","“You can consider Proof of Keys a combat readiness drill. Hopefully, it will help prevent further annoying skirmishes with those who despise individuals empowered with monetary sovereignty,” the event’s official website explains.","The event was first introduced by Trace Mayer, a Bitcoin advocate and host of the Bitcoin knowledge podcast. The idea behind this day is simple: it aims to motivate users to self-custody their private keys.","“The idea of Proof of Keys is to show to the [crypto] community that there is still control of our funds,” Mayer said in an announcement video in 2018. “Lots of new people have come into the community… I think it’s important for us to declare and redeclare our monetary sovereignty on a regular basis”.","Bitcoin private keys are randomly generated strings of numbers and letters that function as a password to a wallet. These keys grant asymmetric power to individuals by giving them utter ownership and control over data, which can be bitcoin(s) or a text message. In technical terms, it is practically impossible for a hacker to get into a Bitcoin wallet and steal its funds without keys. ","Bitcoin advocates support the event as it promotes Bitcoin’s core ethos of decentralization. If a large number of Bitcoin holders store their coins in an exchange, it can pose a risk to the Bitcoin network by endangering a large share of coins – as centralized entities are subject to hack and exploitation. ","Furthermore, Bitcoin was created as a peer-to-peer (P2P) payment system. “What is needed is an electronic payment system based on cryptographic proof instead of trust, allowing any two willing parties to transact directly with each other without the need for a trusted third party,” Nakamoto said in Bitcoin’s whitepaper. ","Therefore, allowing a third party to store someone’s private keys is against Bitcoin’s ideals of monetary sovereignty. ","Meanwhile, Hong Kong’s Bitcoin Association has been one of the first to celebrate PoK day, saying it is “a great day to withdraw your coins to a wallet you own and control.”","Happy Genesis Block day! Today, Bitcoin is 13 years old. It’s also a great day to withdraw your coins to a wallet you own and control! #ProofofKeys 🔑","Notably, Trace Mayer, the initiator of the event, has been out of sight for quite some time now after he was heavily criticized for allegedly shilling a coin in 2020.","Yes, it's true, he tried to shill it to me but I wouldn't listen and instead I told him if he's right, he should buy it & not tell anyone, because if he's wrong, he'll destroy a reputation built over a decade for a pointless scam.","____","Learn more:\n– Bitcoin and Ethereum Price Predictions for 2022\n– Crypto Adoption in 2022: What to Expect?\n\n– 7 Popular Bitcoin Lightning Network Wallets for 2022\n– Vitalik Buterin Over the Past Decade: How Right or Wrong Was He?\n\n– Web 3.0 Wars are Becoming Personal as Jack Dorsey Draws the Decentralization Line\n– I ‘Orange Pilled’ a Dozen Nocoiners in a Week: Here Are the Questions They Had About Bitcoin"],"entity":[{"type":"Hong Kong’s Bitcoin Association","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"‘Orange Pilled’ a Dozen Nocoiners","content":"ORGANIZATION"},{"type":"– Crypto Adoption","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"January 3, 2009","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Mayer","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Satoshi Nakamoto","Wallet"],"authors":["Ruholamin Haqshanas"]}