{"summary":"The OSC has called out multiple crypto exchanges as unregistered to operate in the province in its most recent investor alert.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161003\/ontario-regulator-includes-crypto-firms-in-latest-consumer-protection-alert","publishDate":"2022-08-02T13:50:09","id":1903,"type":null,"title":"Ontario regulator includes crypto firms in latest consumer protection alert","category":["REGULATION"],"content":["The Ontario Securities Commission (OSC) included a number of crypto firms in a consumer alert that called out companies not registered to deal in the Canadian province.","The OSC's investor warning encompasses possible harmful or illegal activity. The commission maintains a \"warning list\" of companies and individuals that may be putting investors at risk. In today's notice, Kucoin, PhenoFX, Crestswiftrade.com and FX-BTC Trade are listed as unregistered firms in the jurisdiction.","The crypto firms that made the list were among other firms purporting to be foreign exchange brokers or other forms of broker-dealers. Some are facing claims of scams against them.&nbsp;&nbsp;","In June, the OSC <a href=\"https:\/\/www.theblock.co\/linked\/153686\/ontario-regulator-fines-bybit-and-bars-kucoin-in-continued-fight-against-unregistered-crypto-exchanges\" data-v-f87c67ca=\"\">barred<\/a> Kucoin from operating in Ontario. The move came as part of a <a href=\"https:\/\/www.theblock.co\/post\/128831\/ontario-securities-regulator-slams-binance-after-crypto-exchange-claims-it-can-continue-operating-there\" data-v-f87c67ca=\"\">wider crackdown<\/a> on crypto exchanges following a decision from Canada's securities regulators in 2021 to treat custodial exchanges as securities exchanges regardless of whether the digital assets are securities. The OSC has since gone after unregistered exchanges, most recently settling with Bybit, which has committed to working with the OSC to register.","Earlier this month KuCoin CEO Johnny Lyu <a href=\"https:\/\/www.theblock.co\/post\/155608\/kucoin-ceo-dismisses-rumors-of-halting-withdrawals-reserves-right-to-legal-action\" data-v-f87c67ca=\"\">dispelled rumors<\/a> suggesting the company might halt withdrawals.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kucoin","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"OSC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Ontario","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ontario Securities Commission (OSC","content":"ORGANIZATION"},{"type":"Johnny Lyu","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}