{"summary":"Crypto Market Anticipates Release of $900M in Vested Tokens in February","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-market-anticipates-release-of-900m-in-vested-tokens-in-february.htm","publishDate":"2024-02-02T20:40:10","id":19034,"type":null,"title":"Crypto Market Anticipates Release of $900M in Vested Tokens in February","category":["Blockchain News "],"content":["The digital asset market is anticipating the release of approximately $900 million in vested tokens in February. Various projects, including Avalanche, Aptos, The Sandbox, Optimism (OP), and Sui (SUI), are preparing to unlock tokens.","Vesting refers to locking digital assets for a predetermined period, preventing early investors from quickly selling their tokens and incentivizing long-term commitment to the project. Generally, when a new crypto project is launched, it has a vesting period, wherein its tokens remain frozen for a certain period. However, these vesting events can impact the market as token holders gain the ability to transfer or sell their assets.","Avalanche is set to unlock the largest amount, with 9.5 million tokens expected to be released on February 22. At the current valuation, these tokens are worth approximately $320 million. The tokens are allocated to the Avalanche Foundation, strategic partners, team members, and an airdrop.","Aptos, a Layer-1 blockchain, is set to release 24.8 million crypto tokens on February 11, valued at around $233 million based on current market prices. This release will allocate $180 million in tokens to core contributors and investors, with an additional $39 million allocated for the community and foundation. Previous unlocks on January 12, 2024, and December 12, 2023, led to notable price declines of 17.94% and 14.10%, respectively.","The Sandbox, known for its metaverse project, conducts two token unlocks annually, with the first scheduled for February 14, 2024. The project is set to unlock 205.59 million SAND tokens, constituting 9.19% of the circulating supply. At the current market price, these tokens are valued at $95.47 million.","The allocation of the unlocked supply will be distributed among three beneficiaries, as company reserves will receive over $40 million worth of tokens. In contrast, the remainder will be distributed to the team and advisers.","Optimism will join the token release on February 29, unveiling 24 million OP tokens with a market value of around $70 million. These tokens will be distributed among core contributors and investors. Furthermore, Sui is set to unlock $53 million in tokens as part of its community access program on February 3.","While releasing these tokens marks a significant event in the crypto space, experts warn of potential repercussions on market prices. Tokenomics suggests that a sudden increase in the circulating supply of a token can exert downward pressure on cryptocurrency prices.","Various factors influence price action, and market participants will be observing closely to gauge the overall impact on the cryptocurrency market. Investors and analysts will closely monitor the market’s response to these token releases, anticipating potential volatility and adjusting their strategies accordingly.","In a separate development, Stride, an interchain liquid staking solution, announced a significant airdrop of 5 million STRD tokens, equivalent to $18 million, to stTIA token holders over the next 150 days.","Unlike traditional airdrops, eligibility for STRD tokens is straightforward—holders must possess stTIA tokens within the Stride protocol or exchange them on a decentralized exchange (DEX). The airdrop will initially be exclusive to stTIA and held on the Stride blockchain for the first five days, expanding to the Osmosis and Neutron blockchains after February 5 at 5 a.m. ET."],"entity":[{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"February 11","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"December 12, 2023","content":"DATE"},{"type":"5 a.m. ET","content":"TIME"},{"type":"$70 million","content":"MONEY"},{"type":"$53 million","content":"MONEY"},{"type":"Aptos","content":"LOCATION"},{"type":"$233 million","content":"MONEY"},{"type":"tokens marks","content":"MONEY"},{"type":"$39 million","content":"MONEY"},{"type":"$900 million","content":"MONEY"},{"type":"$320 million","content":"MONEY"},{"type":"$95.47 million","content":"MONEY"},{"type":"February 22","content":"DATE"},{"type":"9.19%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"February 29","content":"DATE"},{"type":"14.10%","content":"PERCENT"},{"type":"Sui","content":"PERSON"},{"type":"February 14, 2024","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"February 5","content":"DATE"},{"type":"February 3","content":"DATE"},{"type":"$180 million","content":"MONEY"},{"type":"17.94%","content":"PERCENT"},{"type":"January 12, 2024","content":"DATE"}],"hashtag":["Avalanche","Optimism","Vested Token"],"authors":["Hassan Shittu"]}