{"summary":"Could Stablecoin Ethena (USDe) Collapse Like Terra LUNA? CryptoQuant Investigates","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethena-usde-risks-cryptoquant.htm","publishDate":"2024-04-17T22:20:36","id":19036,"type":null,"title":"Could Stablecoin Ethena (USDe) Collapse Like Terra LUNA? CryptoQuant Investigates","category":["Blockchain News "],"content":["Emerging stablecoin Ethena (USDe) poses unique risks for holders compared to other dollar-denominated tokens, argued CryptoQuant in a new report on the matter.","Boasting a market cap of over $2.3 billion today, Ethena emerged in late February and quickly became the fastest-growing stablecoin in history. One of its most attractive features is that it generates yield for its holders, unlike leading stablecoins whose issuers keep all profits for themselves.","However, the same mechanism that pays holders with returns also gives the protocol’s business model a hint of risk.","“Risks arise for Ethena when cryptocurrency markets experience sharp price corrections and the funding rate becomes negative as traders liquidate their long positions and others want to open short positions,” wrote CryptoQuant to Twitter on Tuesday.","$USDe stress test:","Their reserve fund can handle prolonged negative funding rates like in 2022's FTX\/LUNA scenario as long as its market cap stays below $3B (currently $2.4B).","The protocol is robust if sufficient reserve funds relative to its market cap. pic.twitter.com\/dQLZOqo2o5","— Ki Young Ju (@ki_young_ju) April 17, 2024","","Ethena keeps its peg to the dollar by using a delta-hedging strategy. The protocol backs USDe using Bitcoin (BTC) and Ethereum (ETH), and counterbalances fluctuations in value around those investments by holding perpetual futures shorting both assets.","By contrast, traditional stablecoin issuers typically back their tokens with reserves consisting of cash and U.S. treasuries – the latter of which generates most of the firm’s profit. Compared to this model, Ethena’s reserves are far more censorship-resistant, given that many components of the system are based on-chain.","Since the Ethereum and Bitcoin futures markets have a historic bias towards long positions, shorts receive payouts regularly, giving Ethena some intrinsic revenue. Those payouts flip to penalties when funding rates go negative, which are entirely covered by Ethena’s reserve fund.","“The central question is whether Ethena’s reserve fund will be enough to absorb all negative funding rate payments, in order to avoid their short positions being liquidated,” wrote CryptoQuant.","By CryptoQuant’s analysis, Ethena’s current reserve fund of $32.7 million is only sufficient to protect USDe holders if the token’s market cap remains under $4 billion. This is based on a realistic scenario of extremely negative Ethereum funding rates, such as the period one month before and after the September 2022 Merge upgrade.","Should USDe’s market cap rise to $10 billion, Ethena’s reserve fund would need to rise to $80 million to guarantee similar safety.","“Investors should monitor if Ethena’s reserve fund is appropriate for the market capitalization of USDe in order to handle periods of extremely large negative funding rates,” concluded CryptoQuant."],"entity":[{"type":"$2.4","content":"MONEY"},{"type":"delta","content":"ORGANIZATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"Ethena","content":"LOCATION"},{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"April 17, 2024","content":"DATE"},{"type":"$3B","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"$32.7 million","content":"MONEY"}],"hashtag":["CryptoQuant","Ethena"],"authors":["Andrew Throuvalas"]}