{"summary":"Web3 Community Celebrates Women’s History Month in The Metaverse and Beyond","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-community-celebrates-womens-history-month-in-the-metaverse-and-beyond.htm","publishDate":"2024-03-15T21:52:26","id":19049,"type":null,"title":"Web3 Community Celebrates Women’s History Month in The Metaverse and Beyond","category":["Blockchain News "],"content":["March has seen several web3 initiatives to recognize and spotlight women’s achievements in celebration of Women’s History Month. This annual observance, established in 1987, emphasizes the profound contributions women have made to society.","Monica Talán, Founder and Contributor at Spanish-language web3 platform CryptoConexión, told Cryptonews that raising awareness for women in web3 is not just about achieving gender balance.","Rather, Talán believes that highlighting women in the web3 sector will expand the field’s talent pool, leading to fresh perspectives and new approaches.","“This will create more equitable economic opportunities, build inclusive communities, and ensure that the future of technology reflects and serves the needs of all,” said Talán.","This is critical, as 2023 data suggests that women hold about 26% of all jobs in the crypto industry. Statistics further show that only about 6% of the top leadership roles are held by women, with 94% of CEOs being male.","According to Talán, women make up 47% of CryptoConexión’s audience. She explained that by shifting the perspective from “believing women must adapt to web3” to “understanding that web3 must evolve to embrace women” has helped with the platform’s diversity.","Talán explained that CryptoConexión spotlighted 60 Latinas contributing to the web3 sector at the start of Women’s History Month this year.","“This list also included newcomers,” said Talán. “This effort highlights the importance of representation, aiming to inspire more Latinas to join web3 and create a more inclusive, diverse digital future.”","Sandy Carter, COO at web3 domain platform Unstoppable Domains, told Cryptonews that women in the crypto sector have indeed innovated in unique ways.","Carter shared that Unstoppable hosted a space on the X platform focused on “the power of tokenization and women” on March 8 – International Women’s Day.","“We had guests like Dr Anino Emuwa, who founded 100 Women Davos, and The Africa Women CEO Network,” she said. “We also had the Director from Boss Beauties who worked on the Mattel Barbie and Boss Beauty NFT project.”","Honored to be part of @UnstoppableWow3's initiative to empower women in #Web3 and #AI this International Women's Day.","Grab yourself a shirt to support education designed by @gianinaskarlett !!!!","Get a shirt: https:\/\/t.co\/skerRxlVnk","Logos on the back from: @_HerDAO @shefiorg… pic.twitter.com\/Kp9TAvMCJD","— Sandy.AUSTIN (@sandy_carter) March 8, 2024","","While spotlighting women may help encourage female participation in web3, in the meantime the Metaverse has become a popular platform for women-focused events.","Kim Currier, Head of Marketing at the Decentraland Foundation, told Cryptonews that from March 26-29, Decentraland will showcase the art of talented women during its second annual “Art Week” and “MESHfair.”","“MESHfair is a unique opportunity for artists to explore their creativity in a virtual environment,” said Currier.","Currier added that women artists will represent 16 of the 32 international artists selected to show new works during MESHfair.","Artist and web3 producer Bay Backner founded MESHfair. Backner told Cryptonews that MESHfair acts as a way to connect artists working in the 3D file format for virtual reality (VR) with galleries and collectors.","“Despite widespread interest in VR, works in this format are still underrepresented in both traditional art fairs and influential NFT collections,” said Backner.","Backner added that 13.7% of living artists represented by galleries in Europe and North America are women.","“Of the 100 most expensive works ever sold, none have been made by a woman,” she said. “So there is still a long way to go towards gender equality in-real life art.”","Unfortunately, Backner believes that a similar gender gap is opening within the VR sector.","This may be due to a lack of women-led Metaverse companies. According to McKinsey, only 10% of the virtual world or metaverse companies that gained funding during the 2017-2022 crypto boom were led by women.","“So unless we work on discoverability here – sharing the work of women entrepreneurs and creatives in VR – we’ll see the same tired old narratives being repeated,” remarked Backner.","With this in mind, Backner explained that MESHfair is important for discoverability.","“It supports the small, but growing community of creators in immersive web3 technology. And every artist in this space right now is making history,” she said. “They’re defining a new artistic medium. It’s therefore especially important that women artists are a documented and discoverable part of this conversation.”","A female artist by the name of “JaneDAO” told Cryptonews that displaying her work during MESHfair and Women’s History Month provides a platform to inspire through sharing and creating.","“It’s a chance to highlight the diverse creativity and insights women bring to these fields, reinforcing that art communicates universally powerful messages,” she said. “My involvement not only showcases my contributions but also shines a light on the broader impact of women in this space, sparking important conversations about our shaping role in the future of tech and art.”","Even as Women’s History Month comes to an end, women-focused initiatives will continue in hopes of encouraging women’s participation in web3.","Talán recognizes that the blockchain sector often presents a hurdle for women. She suggests focusing on simplifying web3 concepts and platforms, thus making the sector more approachable, as a key factor in changing the current dynamic.","“The technical jargon, lack of easy-to-use platforms, and fast pace can be intimidating, especially in a field historically dominated by men,” said Talán. “Despite these challenges, significant progress is being made through dedicated ongoing efforts to onboard women into web3.”","For example, Talán explained that initiatives like SheFi, Unstoppable Women of web3, HER DAO, Black Women Blockchain Council, and the Association for Women in Crypto are key in demystifying the space. Each of these platforms offers continued education, resources, and community support.","“In Latin America, ‘WAGMI LATAM’s’ collaboration with communities like Cripto Curiosas, WomenBiz, WEDAO LATAM, WARMI, Mujeres en Crypto and Metagals have shown us the importance of creating local and regional inclusive environments,” added Talán.","Backner further noted that she will be hosting upcoming projects geared toward women this year.","“My two upcoming projects are Decentraland Gaming Week (June 2024) which will support diverse creators to build interactive web3 games, and The Censored Art Show (Sept 2024) which will support digital artists impacted by censorship or shadowbanning on social media and other platforms,” she said.","Backner pointed out that censorship in particular is an issue that disproportionately affects women and minority digital artists.","“This is especially the case if artists use their own bodies within their works,” she said.","Additionally, Carter shared that Unstoppable will continue its commitment to increasing women’s involvement in web3 and tech in general.","“We plan to expand our educational initiatives, offering more workshops, courses, and mentorship programs tailored for women,” she said. “Networking events and safe spaces for discussions will continue to be a priority, ensuring women feel supported and connected.”"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"Carter","content":"PERSON"},{"type":"29","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"McKinsey","content":"ORGANIZATION"},{"type":"March 26","content":"DATE"},{"type":"94%","content":"PERCENT"},{"type":"1987","content":"DATE"},{"type":"– International Women’s Day","content":"ORGANIZATION"},{"type":"Boss Beauty NFT","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Cripto Curiosas","content":"PERSON"},{"type":"Talán","content":"PERSON"},{"type":"Talán","content":"LOCATION"},{"type":"March 8, 2024","content":"DATE"},{"type":"The Africa Women CEO Network","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Black Women Blockchain Council","content":"ORGANIZATION"},{"type":"Mattel Barbie","content":"ORGANIZATION"},{"type":"Sandy Carter","content":"PERSON"},{"type":"March 8","content":"DATE"},{"type":"Bay Backner","content":"ORGANIZATION"},{"type":"the Association for Women","content":"ORGANIZATION"},{"type":"Anino Emuwa","content":"PERSON"},{"type":"Decentraland","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Davos","content":"LOCATION"},{"type":"Backner","content":"PERSON"},{"type":"13.7%","content":"PERCENT"},{"type":"Head of Marketing","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Currier","content":"PERSON"},{"type":"Decentraland Foundation","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"Kim Currier","content":"PERSON"},{"type":"International Women","content":"ORGANIZATION"},{"type":"Women’s History Month","content":"ORGANIZATION"},{"type":"Monica Talán","content":"PERSON"},{"type":"June 2024","content":"DATE"}],"hashtag":["Metaverse","Web3","Women"],"authors":["Rachel Wolfson"]}