{"summary":"A CFTC advisory panel voted to submit a report to the commission centered on DeFi, marking a substantial step toward focusing on the space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271083\/cftc-advisory-committee-advances-recommendations-urging-a-timely-focus-on-defi","publishDate":"2024-01-08T17:54:51","id":1905,"type":null,"title":"CFTC advisory committee advances recommendations urging a timely focus on DeFi","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">An advisory committee for the Commodity Futures Trading Commission voted on Monday to submit a report to the commission calling on the government and industry to work to understand decentralized finance and \"advance its responsible and compliant development.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC's Technology Advisory Committee voted during a meeting to make recommendations, which some say is the first substantial report on DeFi by a government advisory committee.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">CFTC Commissioner Christy Goldsmith Romero, who sponsors the committee, said the report is meant to \"<\/span><span class=\"s4\" data-v-f87c67ca=\"\">to help inform ongoing policy debates in the U.S. Congress, state legislatures, and regulators including the CFTC,\" the commissioner said in a statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The report includes recommendations for policymakers such as increasing knowledge around DeFi, the enhancement of \"timeliness and effectiveness of enforcement,\" as well as assessing existing federal and state regulatory frameworks of DeFi and finding where regulations need to be expanded to address risks.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While over the last few years, policymakers around the globe have constructed regulatory frameworks for crypto assets, the focus has almost exclusively been in the context of centralized exchanges with regulators seeking information from siloed intermediaries the same way that information flowed from banks to their regulators today,\" <\/span><span class=\"s2\" data-v-f87c67ca=\"\">said Ari Redbord, head of legal and government affairs for TRM Labs. Redbord also is vice chair of the CFTC's Technology Advisory Committee.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Government officials around the world have honed in on how to regulate DeFi. In December, the International Organization of Securities Commissions, a global standard setter to securities regulators, made nine <a href=\"https:\/\/www.iosco.org\/news\/pdf\/IOSCONEWS720.pdf\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">recommendations<\/span><\/a> in December covering disclosures and cross border cooperation. Lawmakers in the U.S. have been working on bills to regulate other parts of the crypto industry, namely stablecoins, though DeFi hasn't been a major part of the discussions.&nbsp;<\/span>","<span class=\"s6\" data-v-f87c67ca=\"\">Justin Slaughter, policy director at Paradigm and a CFTC technology advisory committee member, called the report \"t<\/span><span class=\"s4\" data-v-f87c67ca=\"\">he first major report on DeFi by a government advisory committee and is arguably the most comprehensive review of DeFi by any U.S government agency thus far.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Slaughter noted that the committee's recommendations don't have the force of law, but said the report was a \"major step forward for policymaking on DeFi.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We have the first effort at surveying the opportunities DeFi promises and the risks that it could present,\" Slaughter <span class=\"s4\" data-v-f87c67ca=\"\">wrpte in a post on X following the meeting. <\/span>\"Policymakers can consider this a first cut at a map as they navigate policymaking for DeFi.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Technology Advisory Committee","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"International Organization of Securities Commissions","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Ari Redbord","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Justin Slaughter","content":"PERSON"}],"hashtag":["CFTC"],"authors":["Sarah Wynn","The Block"]}