{"summary":"Telegram Becoming ‘Crypto-powered Narcotics Department Store’ for South Koreans","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/telegram-becoming-crypto-powered-narcotics-department-store-for-south-koreans.htm","publishDate":"2024-04-29T03:00:40","id":19059,"type":null,"title":"Telegram Becoming ‘Crypto-powered Narcotics Department Store’ for South Koreans","category":["Blockchain News "],"content":["Crypto-powered narcotics gangs have turned Korean-language Telegram channels into “drugs department stores” and a “playground” for young South Koreans, media outlets reported on April 28.","Newspapers such as Seoul Kyungjae noted that it has been almost a year since South Korean President Yoon Suk-yeol called for an “all-out war” on crypto-powered drug trafficking.","Yoon’s comments came after police reported dozens of cases of narcotics trading by teenagers and people in their 20s.","However, it now appears that some Telegram channel operators know that police are monitoring their channels – and are responding by openly “taunting detectives.”","🇰🇷 South Korea ‘Blighted by Crypto-powered Drug Pollution’ – Report","Here's a summary 👇","— Cryptonews.com (@cryptonews) February 2, 2024","","Cryptonews.com has seen scores of Telegram channels that appear to openly advertise “nationwide” drug deliveries for methamphetamine (crystal meth), ecstasy, and other drugs.","And Cryptonews.com has also seen several dozen X (Twitter) Korean-language accounts that direct social media users to these Telegram channels.","All operators seemingly post with impunity, including pictures of bags of drugs and Telegram handles in their posts.","In each case, Cryptonews.com was able to find these channels and accounts with ease by searching for commonly used Korean argot terms for methamphetamine and other narcotics.","The media outlet claimed that Telegram had effectively turned into an online “department store” for young drug buyers.","It also noted that in a post on one popular channel, a drug distribution gang “taunted” police officers by writing:","“Dear detectives, If you want to be promoted faster than your colleagues, please contact us and we will help you find [people to arrest].”","The poster mocked detectives, jokingly saying they could provide police officers with “wholesale” prices.","The media outlet added that Telegram channels had become de facto job agencies for young people, advertising crypto-paying “posts” such as “dead-drop delivery person.”","Dealers typically use “dead-drop” techniques to deliver narcotics. They leave bags of drugs in public places like apartment stairwells, fire hydrants, and flower beds.","They then inform buyers about the hiding place locations when they have safely left the area.","The “recruiters” behind these “job advertisements” appear to be collecting confidential data from their “staff,” gathering social security numbers and “family certificates.”","Despite a huge rise in arrests and multiple successful police investigations into crypto-powered narcotics crime, police are privately admitting it is still “difficult to track Telegram users.”","Officers have spent millions of USD on blockchain network monitoring tools and Telegram surveillance.","This has paid dividends, with police last week announcing a major raid in Busan and the Philippines.","Officers arrested 49 people in the bust, claiming the group in question had operated 11 Telegram channels and used crypto as its payment tool.","Regardless, the majority of similar channels appear to be operational at the time of writing. The media outlet claimed that many Telegram chat rooms “seemed to have degenerated into a ‘playground’ for drug suppliers.”","Investigators have turned to yet more IT solutions as they look to turn the tide of the “war.”","Late last year, the Supreme Prosecutor’s Office launched an AI-powered drug monitoring software solution that it has since provided to 18 local prosecutors’ offices.","The solution combs images and text on the Telegram, Facebook, Tumblr, Pinterest, and Instagram apps, looking for narcotics-related content.","As most narcotics arrive in the country from Southeast Asia, South Korean law enforcement agencies have also sent agents to work abroad.","South Korea has sent officers overseas to work with Thailand’s National Narcotics Bureau. Seoul also plans to dispatch agents to work with Malaysian and Indonesian drug agencies.","The central government has also hiked the Supreme Prosecutors’ Office budget, doubling its annual allocation to almost $6 million.","However, critics have pointed out that this increase “is still insufficient,” as crypto-powered narcotics-related crimes “are increasing every year.”","Just six days before its planned retail expansion, the crypto exchange https:\/\/t.co\/1aQemhmjuy postponed its launch in South Korea so it can communicate further with regulators https:\/\/t.co\/JL9DzJk37Y","— Bloomberg (@business) April 23, 2024","","A lawyer told the media outlet that the low cost of narcotics in Southeast Asia was proving “too attractive” for many people.","Smugglers can make huge profits by selling Southeast Asia-sourced drugs in South Korea.","The lawyer concluded that “digital forensic technology” was helping police, but conceded that it still had considerable “limitations.”"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"the Supreme Prosecutor’s Office","content":"ORGANIZATION"},{"type":"Facebook","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"Thailand’s National Narcotics Bureau","content":"ORGANIZATION"},{"type":"Busan","content":"ORGANIZATION"},{"type":"Yoon Suk","content":"PERSON"},{"type":"April 28","content":"DATE"},{"type":"Pinterest","content":"LOCATION"},{"type":"April 23, 2024","content":"DATE"},{"type":"South Koreans","content":"LOCATION"},{"type":"February 2, 2024","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"the Supreme Prosecutors’ Office","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Seoul","content":"LOCATION"},{"type":"Seoul Kyungjae","content":"ORGANIZATION"}],"hashtag":["South Korea"],"authors":["Tim Alper"]}