{"summary":"FSB Reveals 2024 Roadmap for Crypto Regulations and Cross-Border Payments","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fsb-reveals-roadmap-for-crypto-regulations-and-cross-border-payments-in-2024.htm","publishDate":"2024-01-25T13:15:41","id":19055,"type":null,"title":"FSB Reveals 2024 Roadmap for Crypto Regulations and Cross-Border Payments","category":["Blockchain News "],"content":["The Financial Stability Board (FSB) has released its 2024 roadmap with plans to steer crypto regulations, cross-border payments, and broader issues in global finance.","The international financial body created by the G20 revealed its plans for the current year. The main focus revolves around digitization and harmonization to develop financial markets with special references to cryptocurrencies and tokenization.","We have published our 2024 work programme, which outlines our priorities and provides a timeline for our planned reports. Find out more:https:\/\/t.co\/Mca17lj94A pic.twitter.com\/PAfkx5b50a","— The FSB (@FinStbBoard) January 24, 2024","","Highlighting financial stability as a key component of its roadmap, the report states that vulnerabilities in financial markets continue to grow, as seen in high interest rates and a clear lack of uniformity.","This can also be seen in the crypto asset market with challenges that make global cooperation difficult.","Details from the roadmap show the organization will identify and address emerging risks in financial markets and increase monitoring vulnerabilities in new technologies and non-bank financial intermediations.","Cross-border payments dominated narratives at the G20 and FSB last year as both groups partnered on a comprehensive template and rules to achieve all objectives before 2027.","🔗 G20 Leaders Decide on Swift Implementation of Crypto Asset Reporting Framework","G20 leaders have called to swiftly implement the Crypto Asset Reporting Framework (CARF) while endorsing the synthesis paper proposed by IMF and FSB.#CryptoNews #G20https:\/\/t.co\/22tUeuHJh7","— Cryptonews.com (@cryptonews) September 11, 2023","","In partnership with the Committee on Payments and Market Infrastructure (CPMI), the FSB pledged to continue development this year to guide all market players.","“Actions led by the FSB include work on banks and non-bank supervision and work on data frameworks. The roadmap places importance on public-private sector partnerships, including the annual Payments Summit and Taskforce that were set up in 2023.”","The Board will provide progress reports on the roadmap in phases throughout the year. The updates include the preparation of an annual data report on quantitative targets.","Furthermore, it plans to issue more recommendations to support the interoperability of models facilitating cross-border payments and extend the same to wider global regulations for banks and non-banks exploring the sector.","This year, the FSB will harness the benefits of innovation around crypto markets, tokenization, Artificial Intelligence (AI), and a global stablecoin that can be deployed in many jurisdictions.","While work on most of these began in 2023, this year’s focus will be a crypto assets implementation plan and global stablecoins regulations to tighten uniformity in the industry.","As the mainstream approach to tokenizing real-world assets increases, with investments by big traditional banks deploying blockchain technology, the board is expected to analyze the financial implications for the markets.","Similar efforts will also be seen around AI solutions, cyber-attacks, reporting incidents, and the risks climate change poses to the financial market.","Last year, FSB released recommendations for crypto firms and stablecoin operations. These stated that firms should not commingle user assets with the firm’s funds. More importantly, crypto companies should disclose all necessary information to authorities.","It also emphasized stablecoins’ 1:1 reserve assets arrangement to avoid investor losses."],"entity":[{"type":"2027","content":"DATE"},{"type":"G20","content":"ORGANIZATION"},{"type":"FSB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Stability Board (FSB","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Board","content":"ORGANIZATION"},{"type":"September 11, 2023","content":"DATE"},{"type":"January 24, 2024","content":"DATE"},{"type":"G20 Leaders Decide on Swift Implementation of Crypto Asset Reporting Framework","content":"ORGANIZATION"},{"type":"Committee on Payments","content":"ORGANIZATION"}],"hashtag":["CRYPTO","FSB","Regulation"],"authors":["David Pokima"]}