{"summary":"Markets kick-off week in turmoil with major indexes in the U.S. and Europe trading lower\nThat’s despite the Federal Reserve’s move to slash interest rates\nGoldman Sachs doesn’t think the Fed’s actions are enough, noting the need for fiscal stimulus ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58826\/sp-500-plunges-10-5-as-wall-street-shrugs-off-feds-actions","publishDate":"2020-03-16T09:31:53","id":1905,"type":null,"title":"S&amp;P 500 hits circuit breaker as Wall Street shrugs off Fed&#x27;s actions","category":["Markets"],"content":["U.S. and European equities took a beating during Monday's opening trade as investors shrug off an announcement by the Federal Reserve that it would slash interest rates to near-zero in a bid to fend off the economic impact of the coronavirus.&nbsp;","At the start of the trading day on Wall Street, the Dow Jones Industrial Average fell 9.7% while the S&amp;P plunged 8.1%, triggering a level-one halt in trading.","Across the board, stocks indexes in Europe traded in the red. The FTSE shed more than 6%, while the DAX in Germany has lost 8%. Euro Stoxx 50 index, an index of Europe's bluechip stocks, was trading down 8.7%.","","","On Sunday, the Federal Reserve announced a series of measures to combat the growing threat of the spreading coronavirus on the global economy, including <a href=\"https:\/\/www.ft.com\/content\/a9a28bc0-66fb-11ea-a3c9-1fe6fedcca75\" data-v-f87c67ca=\"\">a 100 basis point rate cut<\/a>. In addition to the rate cut, the Fed unveiled a $700 billion plan to purchase Treasurys and mortgage-backed securities.","Still, the move wasn't enough to calm markets over the impact of decreased economy activity due to the coronavirus. On Sunday, New York City announced it would suspend in-person instruction at public schools as it <a href=\"https:\/\/www.nytimes.com\/2020\/03\/16\/nyregion\/coronavirus-new-york-update.html\" data-v-f87c67ca=\"\">shut restaurants and bars<\/a>.","Goldman Sachs in a note out to clients Sunday night noted that the Fed's action are likely not enough for a \"sustained rally in risk assets,\" noting the need for fiscal stimulus and a clearer picture of coronavirus' impact.","\"We think broad market risk conditions will improve when: (i) we can better understand the depth and duration of the coming economic downturn (i.e. there may eventually be a V-shaped recovery, but we cannot yet see the bottom of the “V”), (ii) policy becomes very forceful, including fiscal stimulus and measures to prevent private sector defaults, or (iii) valuations become extreme enough to encompass most downside scenarios for the economy. On all counts we think we are not quite there yet.\"","Fiscal stimulus could come. As reported by The Hill Monday the Senate are set to take up a House-passed coronavirus stimulus package and are considering <a href=\"https:\/\/thehill.com\/policy\/finance\/487531-teetering-economy-sparks-talk-of-second-stimulus-package\" data-v-f87c67ca=\"\">a second round of stimulus as well<\/a>.&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:&nbsp;<\/strong>This report and its headline has been corrected for clarity.<\/em>"],"hashtag":[]}