{"summary":"Thailand Pushes Towards Digital Asset Hub with Introduction of VAT-Free Crypto Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/thailand-pushes-towards-digital-asset-hub-with-introduction-of-vat-free-crypto-trading.htm","publishDate":"2024-02-07T06:30:10","id":19056,"type":null,"title":"Thailand Pushes Towards Digital Asset Hub with Introduction of VAT-Free Crypto Trading","category":["Altcoin News "],"content":["In a move to position Thailand as a leading digital asset hub, the country’s Finance Ministry has announced the exemption of value-added tax (VAT) on digital asset trading.","The decision aims to promote digital assets as a new alternative tool for fundraising and drive the growth of the digital asset industry in Thailand, according to a recent report by Bangkok Post. ","Paopoom Rojanasakul, the secretary to the finance minister, told the media about the ministry’s vision to leverage digital assets and their potential to fuel the country’s digital economy.","By easing tax rules, the ministry has suspended the requirement to pay 7% VAT on income derived from cryptocurrency and digital token trading.","This VAT exemption, effective since January 1, 2024, has no expiration date, providing a long-term incentive for investors and traders in the digital asset space.","It’s worth noting that the transfer of digital investment tokens to a third party has remained exempt from VAT since May 14, 2023.","This exemption, previously limited to authorized digital asset exchanges, has now been extended to brokers and dealers under the supervision of the Securities and Exchange Commission (SEC).","Finance Ministry has announced the exemption of VAT on trades in digital assets, to boost capital mobilisation through digital assets, in an attempt to make Thailand regional digital asset hub, says Paopoom Rojanasakul, secretary to Finance Minister. #ThaiPBSWorld #Thailand #VAT","— Thai PBS World (@ThaiPBSWorld) February 6, 2024","","To solidify Thailand’s position as a digital asset hub, the Finance Ministry and SEC are in the process of amending the 2019 Securities and Exchange Act.","These amendments will enable digital investment tokens to resemble securities, fostering a more regulated and secure environment for investors.","Thailand has emerged as one of the top jurisdictions for offshore digital asset investors, and these new tax policies are expected to provide a significant boost to the country’s digital asset market.","However, amidst this drive for development, Paopoom emphasized the need for the government to consider the stability of the financial system.","While harnessing the potential of digital assets, it is crucial to ensure a secure and resilient financial ecosystem.","The SEC of Thailand has updated the criteria for investing in digital tokens, easing some restrictions.","In a recent meeting, the SEC Committee approved the principles for improving investment criteria and related criteria for digital asset business operations, aiming to establish effective investor protection mechanisms while considering the risks associated with digital assets.","For one, the commission has lifted investment restrictions previously imposed on retail investors for digital tokens backed by real estate or generating real estate income streams (real estate-backed ICOs) and digital tokens with infrastructure operations or revenue streams (infra-backed ICOs).","Previously, retail investors were limited to investing a maximum of 300,000 baht per offering.","The SEC also reviewed the criteria for establishing custodial wallet provider businesses, enabling them to offer services to digital asset business operators.","Nevertheless, the SEC of Thailand has made it clear that it will not allow the trading of spot Bitcoin exchange-traded funds (ETFs) in the country.","The move came despite the approval of Bitcoin ETFs in the United States, which marks a significant shift in attitude after years of reluctance due to various risks associated with cryptocurrencies."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Finance Ministry","content":"ORGANIZATION"},{"type":"May 14, 2023","content":"DATE"},{"type":"February 6, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"the Finance Ministry","content":"ORGANIZATION"},{"type":"January 1, 2024","content":"DATE"},{"type":"’s Finance Ministry","content":"ORGANIZATION"},{"type":"Finance Minister","content":"ORGANIZATION"},{"type":"Bangkok Post","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Paopoom Rojanasakul","content":"PERSON"},{"type":"SEC Committee","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Thailand","Thailand SEC"],"authors":["Ruholamin Haqshanas"]}