{"summary":"Nigerian Government Collaborates with Interpol to Extradite Fleeing Binance Chief","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigerian-government-collaborates-to-extradite-binance-chief.htm","publishDate":"2024-04-04T01:28:21","id":19062,"type":null,"title":"Nigerian Government Collaborates with Interpol to Extradite Fleeing Binance Chief","category":["Blockchain News "],"content":["The Nigerian government and the International Criminal Police Organization (Interpol) have commenced a concerted plan to extradite Binance Chief Nadeem Anjarwalla who escaped from detention on March 22, 2024.","This collaboration was reported by a local media outlet, The Punch, on April 3, as the government continues to clamp down on Binance Holdings Limited over allegedly facilitating money laundering in the African nation.","The local media outlet stated that top Nigerian government sources exclusively confirmed on April 2 that the process of extraditing Nadeem Anjarwalla, the Binance regional manager for Africa, had begun, along with synergizing with the US Federal Bureau of Investigation (FBI) and the British and Kenyan governments.","“Mr Anjarwalla’s extradition process has begun. The Federal Government is working as did with INTERPOL to extradite the fugitive to Nigeria. He’s a fugitive that escaped from lawful custody, and his other partner is still in custody and would be arraigned on Thursday (April 4) alongside their company, Binance,” the source noted.","FG, INTERPOL in talks over Binance CEO extradition.","Anjarwalla’s extradition process has begun. The FG is working with INTERPOL to extradite the fugitive to Nigeria. He and his other partner who is still in custody would be arraigned in court on Thursday. pic.twitter.com\/YSLOPhD8XB","— Ibadan Watch (@IbadanWatch) April 3, 2024","","Meanwhile, a top security source exclusively told the news outlet that the security personnel who were assigned to monitor Anjarwalla before his escape are being questioned by special investigators.","It could be recalled that the Nigerian government, through the Office of the National Security Adviser, had, on February 28, 2024, arrested Nadeem Anjarwalla and Tigran Gambaryan, who are senior Binance executives.","The officials were arrested during their visit to Nigeria following the government’s ban on Binance and other major cryptocurrency exchanges. They were detained, and their international passports were seized.","The Central Bank of Nigeria Governor Olayemi Cardoso disclosed on February 27 that Binance had facilitated $26 billion in trades from Nigeria in the last one year, which he claimed were funds from anonymous sources and resident traders.","''in the case of Binance, In the last one year, 26 billion dollars has passed through Binance Nigeria from sources and users who we cannot adequately identify.''","CBN Governor, Olayemi Cardoso pic.twitter.com\/A6O2wlsY5M","— Channels Television (@channelstv) February 27, 2024","","As part of the investigative process, the Nigerian government wants the exchange to provide data on its top 100 traders\/investors in the country, alongside a comprehensive transaction history of every user for the past six months.","Some few days after these demands were made, Nadeem Anjarwalla reportedly fled the country under unusual circumstances.","BINANCE EXECUTIVE, NADEEM ANJARWALLA, ESCAPES FROM LAWFUL CUSTODY","The Office of the National Security Adviser [ONSA] confirms that Nadeem ANJARWALLA, a suspect in the ongoing criminal probe into the activities of Binance in Nigeria has escaped from lawful custody on Friday, 22… pic.twitter.com\/POYS09hSjT","— SecurityNewsNG (@SecurityNewsNG) March 25, 2024","","The Binance chief, who holds dual British and Kenyan citizenship, was believed to have used his Kenyan passport to board a flight to flee the West African nation. His escape has elicited criticisms in Nigeria, with some security experts expressing their embarrassment at how he fled detention despite being in the custody of personnel security.","Following the executive escape, Nigeria’s anti-graft agency, the Economic and Financial Crimes Commission (EFCC), charged Binance Holdings Limited and Gambaryan on suspicion of money laundering activities on March 28.","Meanwhile, Binance exclusively told the local media outlet on April 3 that Tigran Gambaryan, the other Binance official detained, is not part of the trading firm’s management team but serves as a law enforcement officer and does not have the power to implement decisions or release data on the profile of its top 100 traders in Nigeria.","Binance’s statement partly reads,","“Binance respectfully requests that Tigran Gambaryan, who has no decision-making power in the company, is not held responsible while current discussions are ongoing between Binance and Nigerian government officials.”"],"entity":[{"type":"National Security Adviser","content":"ORGANIZATION"},{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"Binance Holdings Limited","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"US Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Anjarwalla","content":"PERSON"},{"type":"Binance Nigeria","content":"LOCATION"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"February 28, 2024","content":"DATE"},{"type":"National Security","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"March 25, 2024","content":"DATE"},{"type":"Nadeem ANJARWALLA","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Economic and Financial Crimes Commission","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"April 3, 2024","content":"DATE"},{"type":"April 2","content":"DATE"},{"type":"INTERPOL","content":"ORGANIZATION"},{"type":"February 27","content":"DATE"},{"type":"April 3","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$26 billion","content":"MONEY"},{"type":"February 27, 2024","content":"DATE"},{"type":"Ibadan Watch","content":"ORGANIZATION"},{"type":"26 billion dollars","content":"MONEY"},{"type":"March 22, 2024","content":"DATE"},{"type":"Federal Government","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"Central Bank of Nigeria Governor Olayemi Cardoso","content":"ORGANIZATION"},{"type":"the International Criminal Police Organization (Interpol","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","Nadeem Anjarwalla","Nigeria"],"authors":["Jimmy Aki"]}