{"summary":"Uniswap Labs Hit with Wells Notice by SEC: Vows to Fight Back","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uniswap-labs-hit-wells-notice-sec-vows-fight-back.htm","publishDate":"2024-04-10T22:46:03","id":19068,"type":null,"title":"Uniswap Labs Hit with Wells Notice by SEC: Vows to Fight Back","category":["Blockchain News "],"content":["Uniswap Labs, the creator of the Uniswap decentralized exchange (DEX) protocol and the issuer of the UNI token, was hit on Wednesday with a Wells notice by the US Securities and Exchange Commission (SEC), but vowed to fight back.","A Wells notice is a notification from regulators to an individual or company that an investigation on them has been completed, infractions have been discovered, and they are about to take legal action.","News first broke that the SEC was investigating Uniswap last summer.","Now that the Wells notice is here, Uniswap Labs is “ready to fight,” the DEX developer tweeted.","Despite SEC rhetoric that \"most\" tokens are securities, the reality is that tokens are just a digital file format","The vast majority of tokens traded on Uniswap are definitively not securities, just like most paper is not stock certificates","They are stablecoins, community…","— Uniswap Labs 🦄 (@Uniswap) April 10, 2024","","“The Uniswap Protocol itself is a decentralized, autonomous set of smart contracts that run without any organization, individual, or entity behind them… not a securities exchange,” Uniswap Labs asserted.","The SEC will presumably charge Uniswap Labs for acting as an unlicensed exchange and brokering unlicensed securities.","“The SEC has decided to focus on attacking long-time good actors like Uniswap and Coinbase… while letting bad actors like FTX slip by”, Uniswap’s inventor hayden.eth tweeted.","Today @Uniswap Labs received a Wells notice from the SEC.","I’m not surprised. Just annoyed, disappointed, and ready to fight.","I am confident that the products we offer are legal and that our work is on the right side of history. But it’s been clear for a while that rather than…","— hayden.eth 🦄 (@haydenzadams) April 10, 2024","","Meanwhile, Uniswap Labs’ Chief Legal Officer Marvin Ammori accused the SEC of abusing its power.","He cited past instances where judges have ruled just that, noting that in its lawsuit versus Ripple, “a judge ruled (the SEC) didn’t act out of a faithful allegiance to the law.”","Additionally, he noted that against Grayscale, three judges ruled the SEC broke the law in denying a Bitcoin ETF, stating that the SEC had “acted arbitrarily and capriciously.“","1\/ Today’s Wells notice against @Uniswap is disappointing, but is not unexpected from this SEC","It’s another abuse of power – unsurprising from an SEC that:","Last month, a federal judge ruled committed a \"gross abuse of power\" by lying in court about a crypto project","— Marvin Ammori (@ammori) April 10, 2024","","According to hayden.eth, the SEC’s arguments against Uniswap Labs are even weaker.","“The SEC has authority only over “securities” – not any asset represented by a particular file format or technical standard,” he continued. “The Uniswap Protocol, web app, and wallet don’t meet the legal definitions of securities exchange or broker. Just weeks ago, the judge in SEC v. Coinbase dismissed the claim that crypto wallets were brokers – *even if* the tokens at issue were securities.”","Though leaders at Uniswap Labs seem confident and resolute in their fight against the SEC, UNI traders are wavering.","The Uni price dropped by around 11% on the day and is back under $10.","But these losses could be set to worsen, with UNI having just broken a key upward support level.","UNI is now probing support at $9.80. A break below this level could accelerate the token’s losses toward the next major support zone around $8.","Investors who are confident that the SEC’s lawsuit won’t be able to kill off the Uniswap Protocol might see a retest of such levels as a great opportunity to take positions in UNI.","Indeed, Uniswap is one of the leading multi-chain DEX protocols, with $2 trillion in lifetime volumes. It won’t go down easily."],"entity":[{"type":"$2 trillion","content":"MONEY"},{"type":"Wells","content":"PERSON"},{"type":"April 10, 2024","content":"DATE"},{"type":"UNI","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"Marvin Ammori","content":"PERSON"},{"type":"$9.80","content":"MONEY"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"Uniswap Protocol","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"$8","content":"MONEY"}],"hashtag":["SEC","UNI","Uniswap"],"authors":["Joel Frank"]}