{"summary":"Binance accounted for more than 55% of the spot crypto market over the last 24 hours.\nThe exchange also claimed a similarly high percentage of the derivatives crypto market.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179310\/binance-dominates-spot-derivative-crypto-trading","publishDate":"2022-10-24T05:41:03","id":1906,"type":null,"title":"Binance dominates spot and derivative crypto trading, and competition isn&#x27;t even close","category":["Exchanges"],"content":["With competition remaining fierce among major players in the centralized crypto exchange sector, it is easy to forget that Binance dominates both spot and derivatives trading volume — and its competitors aren't even close to catching up.","Over the last 24 hours, Binance garnered just over 55% of the total spot volume for cryptocurrency exchanges tracked by The Block Research. Only three crypto exchanges accounted for more than 5% — Upbit (6.1%), OKX (5.4%) and Coinbase (5.3%) — while Kucoin and FTX accounted for 4.7% and 4.5%, respectively.","Binance's U.S. exchange also beat out FTX.US, with the former garnering 1.4% of the total volume and the latter accounting for 0.6%.","The story remains the same when it comes to crypto derivatives trading — at least, as far as Binance is concerned — with the exchange laying claim to a similarly high 54.4% of the total volume over the past 24 hours.","The difference on the derivatives front comes down to Binance's competitors claiming larger pieces of the pie. OKX holds claim to the second highest derivatives volume at just over 14%, while Bybit comes in third with 10.2%. FTX, meanwhile, has 8.8%.","Binance's apparent dominance on the volume front coincides with increasing market share in the stablecoin sector. The supply share of Binance USD (BUSD) in the overall stablecoin market <a href=\"https:\/\/www.theblock.co\/post\/179199\/binances-stablecoin-clocks-in-marketshare-all-time-high-as-supply-tops-20-billion\" data-v-f87c67ca=\"\">continues<\/a> to set new all-time highs after Binance began converting other stablecoins to its own stablecoin last month.&nbsp;","Meanwhile, Binance continues to make regulatory inroads into Europe. Last Thursday, the exchange announced that Cyprus had <a href=\"https:\/\/www.theblock.co\/post\/178625\/binance-gains-fourth-european-approval-in-cyprus\" data-v-f87c67ca=\"\">approved<\/a> its registration as a&nbsp;Crypto Asset Services Provider. Previously, it gained regulatory approval in three other European countries — France, Italy and Spain. Binance also <a href=\"https:\/\/www.theblock.co\/post\/173895\/binance-secures-new-zealand-registration-opens-local-office\" data-v-f87c67ca=\"\">gained<\/a> regulatory approval in New Zealand and opened a local office earlier in October."],"hashtag":["BINANCE"]}