{"summary":"Decentraland is Going to Zero as the SEC Says MANA is a Security but This New Sustainable Crypto Could Be the Next Crypto to Explode – Here’s How it Works","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/decentraland-going-zero-as-sec-says-mana-security-but-new-sustainable-crypto-could-next-crypto-explode-heres-how-it-works.htm","publishDate":"2023-06-14T17:40:00","id":19072,"type":null,"title":"Decentraland is Going to Zero as the SEC Says MANA is a Security but This New Sustainable Crypto Could Be the Next Crypto to Explode – Here’s How it Works","category":["Altcoin News "],"content":["Analysts are warning that Decentraland’s $MANA token could be going to zero in the wake of the US Security and Exchange Commission’s (SEC) labeling of the token an unregistered security.","The US regulatory agency labeled the MANA token a security in the lawsuits brought against Coinbase and Binance last week, sending its price tumbling.","$MANA was last changing hands in the mid-$0.34s per token, down 25% for the month and 94% lower versus 2021’s high of $4.95.","$MANA is the token that powers decentralized metaverse Decentraland’s economy.","The value of $MANA is tied to the usage and adoption of Decentraland’s metaverse, but like all crypto assets is subject to speculative flows.","And in as far as Decentraland adoption traction goes, the signs are not good.","In the last 30 days, only 2,650 unique wallets interacted with Decentraland’s smart contracts (i.e. transacted on the platform), according to DappRadar.","The SEC’s determination that $MANA is a security could further dampen activity in the project’s metaverse world, as possible users and investors fear the prospect of their activities being disrupted by future higher levels of regulation.","If people all but stop using the platform, then $MANA could be headed back to zero.","To fund the development of its platform, Decentraland conducted a token presale back in 2017 that ultimately raised $25.5 million via the sale of $MANA tokens.","The SEC is likely to point to this early $MANA token distribution as an unregistered security sale.","That’s because the tokens were distributed to investors who arguably expected a profit based on the Decentraland team’s efforts to deliver on their project roadmap.","Early investors in the project have certainly profited.","According to cryptorank.com’s ICO tracker, Decentraland presale investors who bought at the price of $0.028 are still up more than 12x, despite the cryptocurrency’s sharp retracement since its 2021 highs.","The outlook is much better for a new green crypto project called ecoterra.","As outlined in the project’s whitepaper, Ecoterra is building an all-in-one $ECOTERRA-powered Web3 ecosystem, designed to encourage recycling via its first-of-its-kind Recycle-to-Earn (R2E) app. ","The platform will also facilitate trade in recycled materials and encourage individuals and businesses to offset their carbon footprint.","The project’s presale of its native $ECOTERRA token has just hit a huge milestone.","Sales have now surpassed the $5 million, a strong vote of confidence from the crypto investing community in the project’s vision.","A NEW MAJOR MILESTONE ACHIEVED 🚀\n\n🎉 $5 MILLION RAISED 🎉\n\nLet's celebrate with ecoterra and continue to participate in our #Presale. Together, we can make a positive impact and shape a better world 💚✨https:\/\/t.co\/1fYkPOsPYG pic.twitter.com\/69sK1QCaWF","And observers expect the pace of the presale to pick up now that the project is accepting invitations for users to try out a demo version of the flagship R2E application.","Nascent green Web3 projects such as ecoterra are expected to play an increasingly important role in global efforts to address climate change in the decades ahead, as crypto’s broader adoption increases.","It’s no wonder then that the crypto presale ecoterra is currently running in order to fund the development of its platform has been a resounding success.","Visit Ecoterra Here","When harnessed effectively, blockchain technology provides a unique ability to promote environmentally friendly behaviors by rewarding recycling. ","Ecoterra’s decentralized ecosystem will make it easy to offset carbon emissions and track environmental impacts by utilizing the blockchain’s transparency properties.","And ecoterra is building an all-in-one application that does all of those things and more.","Attention ecoterra community 🌱\n\nYour wait is finally over🎉 Here's a sneak peek into our mobile app📱\n\nGet ready for an immersive experience as we will unveil the app demo very soon – Sign up, scan items, and witness the power of sustainable living at your fingertips 🚀✨… pic.twitter.com\/L9Q63KNkoR","Ecoterra rewards users with the platform’s native $ECOTERRA crypto token every time they recycle.","The green Web3 start-up’s R2E app is supported in any country that uses Reverse Vending Machines (RVMs), meaning there’s a huge potential market.","The platform features a marketplace where individuals and businesses can offset their carbon footprint.","Last but not least, ecoterra allows individuals and businesses to track their environmentally friendly practices via their Impact Trackable Profile.","Observers expect this feature to be very popular amongst environmentally-conscious businesses, who can use Impact Trackable Profile to boost their brand image and bolster customer loyalty.","Vist the ecoterra website"],"entity":[{"type":"$ECOTERRA","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Impact Trackable Profile","content":"ORGANIZATION"},{"type":"94%","content":"PERCENT"},{"type":"$4.95","content":"MONEY"},{"type":"$25.5 million","content":"MONEY"},{"type":"$MANA","content":"MONEY"},{"type":"US Security and Exchange Commission","content":"ORGANIZATION"},{"type":"$0.34","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"$5 MILLION","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"last 30 days","content":"DATE"},{"type":"DappRadar","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"$0.028","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"Reverse Vending Machines","content":"ORGANIZATION"}],"hashtag":["Ecoterra","Presale","SEC"],"authors":["Joel Frank"]}