{"summary":"67% Nigerians Trust in Bitcoin for Life Savings than Traditional Methods: Research","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/67-nigerians-trust-in-bitcoin-for-life-savings-than-traditional-methods-research.htm","publishDate":"2024-04-25T15:31:27","id":19073,"type":null,"title":"67% Nigerians Trust in Bitcoin for Life Savings than Traditional Methods: Research","category":["Bitcoin News "],"content":["Web3 infrastructure company Elastos released a report, shedding light on Bitcoin use in people’s daily lives, irrespective of current valuation. Per the research findings, Nigeria and UAE have topped in the use of Bitcoin for daily transactions, compared to Germany and the UK. Around 20% of respondents from Nigeria use Bitcoin to conduct transactions “at least once a day,” a company statement read.","23% consumers in Nigeria and 20% in the UAE use Bitcoin every day, the release shared with Cryptonews, read.","That said, 67% Nigerians would have more trust in Bitcoin to project their life savings than traditional payment methods like banks or even cash.","In addition to Nigeria, respondents from other jurisdictions also showed significant trust in the world’s largest crypto by market value.","35% of consumers from Brazil and 32% of UAE respondents have more confidence in Bitcoin-based services to protect life savings. These numbers are proportionately higher compared to markets such as the UK with 20% and Germany with 22%.","The report dubbed ‘BIT Index’ indicates the role the ‘global south’ plays in Bitcoin adoption, Jonathan Hargreaves, Elasto’s global head of business development, described.","“The fact that over two-thirds of Nigerian consumers and a third of their counterparts from the UAE and Brazil would feel more confident entrusting their life savings in Bitcoin than traditional financial instruments speaks volumes about the protagonism these regions are already playing.”","Furthermore, the data revealed that 66% Nigerians and 35% from Brazil have more confidence in Bitcoin-based systems than traditional alternatives.","48% of responders from Nigeria were interested in using Bitcoin for sending and receiving money from abroad. However, only 18% and 20% were interested in cross-border Bitcoin transactions in Germany and the UK respectively.","This comes at a time when many Nigerians are turning to cryptos in recent years. According to data provider Chainalysis, Nigeria stands the second-highest adoption of crypto in the world after India.","Further, the West African nation’s soaring inflation rate hit 30% in January. In fact, the Nigerian government blamed Binance, the world’s biggest crypto exchange for crashing the currency, a WSJ report noted.","As reported earlier, Nigeria has been leading the pack, when it comes to crypto adoption rate, per Statista data. Nearly half of Nigeria’s population are crypto owners, it noted."],"entity":[{"type":"Brazil","content":"LOCATION"},{"type":"32%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"66%","content":"PERCENT"},{"type":"Jonathan Hargreaves","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Chainalysis","content":"PERSON"},{"type":"18%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"Germany","content":"LOCATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"48%","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"Elasto","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"UAE","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["crypto adoption","Nigeria","Survey"],"authors":["Sujha Sundararajan"]}