{"summary":"Top Crypto Gainers on DEXTools – DOGE2.0, RICH, BOBO","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-crypto-gainers-dextools-doge20-rich-bobo.htm","publishDate":"2023-07-05T17:21:00","id":19075,"type":null,"title":"Top Crypto Gainers on DEXTools – DOGE2.0, RICH, BOBO","category":["Altcoin News "],"content":["Crypto markets are seeing a modest pullback ahead of the release of the minutes from the US Federal Reserves’ most recent policy meeting last month.","Bitcoin ($BTC) was last changing hands under $30,500, down around 2% in the last 24 hours as per CoinGecko.","Ether ($ETH) was last trading just above $1,900, down around 2.5% over the same time period.","The upcoming Fed minutes release is the first of a bombardment of important macro events over the coming three days that could trigger crypto market volatility if Fed tightening expectations are impacted.","But for crypto degens who are on the hunt for the next small-cap meme coin gem to explode, macro fundamentals hardly matter.","Here are some of the shitcoins that have seen the biggest gains on Wednesday according to Decentralized Exchange analytics tool DEXTools.","The 2.0 play in the meme coin space continues with Doge 2.0.","2.0 versions of popular meme coins like Dogecoin that market themselves as a second chance for traders who missed the first pump have been doing well recently and Doge 2.0 is no different.","$DOGE2.0 was last trading around $0.0000000135, up over 135x versus last night’s lows I the $0.00000000010 area.","Visit Doge 2.0’s website here and the coin on DEXTools here.","$RICH, a meme coin created around the idea of making its buyers rich, saw a pump of as much of 2600% from its DEX launch price on Tuesday to its highs earlier today in the $1.07 area.","It has since retraced to around $0.23, giving it a market cap of around $230,000.","Visit $RICH’s website here and the coin on DEXTools here.","Bobo hit new all-time highs on Wednesday and impressive recovery given its past peak had been all the way back in May, showing that this meme coin has a lot more staying power than the vast majority of its competitors.","At current levels around $0.00000014, $BOBO is up an impressive 1300% from its late-June lows in the $0.00000001 area.","Visit $BOBO’s website here and the coin on DEXTools here.","Degen meme coin traders looking for the next low cap gem to explode should also consider trying to get in early on some meme coin presales.","Here are two meme coin projects selling their tokens on the cheap to early investors that the team at Cryptonews are big fans of.","Wall Street Memes, one of the internet’s hottest retail investing communities, rose to prominence in the meme stock craze of 2021 and has recently been expanding its relevance in the cryptocurrency space with the presale of its new $WSM token.","The success of the $WSM presale, which has raised more than $12.5 million in just over one month, isn’t surprising given the size of Wall Street Memes’ community.","Not only are there 523k hyper-engaged community members on its wallstbets Instagram account, there are another 214k on Twitter and more than 100k across its two other Instagram channels, wallstgonewild and wallstbullsnft.","All told, Wall Street Memes has a 1 million-strong social community of degens, which analysts think all but guarantees that the $WSM token will be listed on tier 1 crypto exchanges like Binance.","With 30% of the token supply being held back for community rewards, it can reasonably be expected that airdrops to holders will be a big part of the ecosystem.","Indeed, the first $WSM airdrop is open now. ","Analysts are already predicting big things for Wall Street Memes when it lists on exchanges and you can be a part of it.","Visit Wall Street Memes Here","Despite only launching a few days ago, brand new meme coin project Thug Life Token has already been able to raise a whopping more than $430,000 via the presale of its $THUG token.","Various industry observers have tipped $THUG to be a major success given the refreshing take it brings to the meme coin space.","$THUG is not based around out-of-fashion dog memes or short-term social media fads, like meme coins created in response to Elon Musk or Andrew Tate tweets.","Rather, $THUG is themed around the timeless Thug Life movement that was first popularized by hip hop stars such as Snoop Dogg back in the 80s.","As the word of $THUG spreads, more degenerates are expected to pile cash into the project.","That’s because Thug Life Token has all of the makings of the next 100x meme coin.","At the presale price of $0.0007 and total maximum supply of 4.2 billion, the Thug Life Token presale only values the coin at a very conservative $2.94 million fully diluted market cap.","That’s much smaller than most other comparable presale projects and the low presale market cap leaves plenty of room for explosive upside.","Meme coin degens have no time to lose when it comes to getting involved in the project early.","That’s because the $THUG presale will end once the $2.058 million mark is hit, or when the 12-day countdown runs out (whichever comes first).","After that, the only way to secure $THUG tokens will be via the project’s airdrop and community rewards campaign or at a potentially elevated price on major decentralized exchanges (DEXs).","Visit Thug Life Token Here","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"$0.0007","content":"MONEY"},{"type":"Thug Life Token","content":"ORGANIZATION"},{"type":"last 24 hours","content":"DATE"},{"type":"$ETH","content":"MONEY"},{"type":"$0.00000014","content":"MONEY"},{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"$2.058 million","content":"MONEY"},{"type":"$430,000","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"2.5%","content":"PERCENT"},{"type":"1300%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$THUG","content":"MONEY"},{"type":"$DOGE2","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$230,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Thug Life Token Here","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"$WSM","content":"MONEY"},{"type":"Elon Musk","content":"LOCATION"},{"type":"$0.00000000010","content":"MONEY"},{"type":"$1.07","content":"MONEY"},{"type":"2600%","content":"PERCENT"},{"type":"$0.00000001","content":"MONEY"},{"type":"last night","content":"TIME"},{"type":"$BOBO","content":"MONEY"},{"type":"$1,900","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"earlier today","content":"DATE"},{"type":"$RICH","content":"MONEY"},{"type":"$30,500","content":"MONEY"},{"type":"Decentralized Exchange","content":"ORGANIZATION"},{"type":"$12.5 million","content":"MONEY"},{"type":"$0.23","content":"MONEY"},{"type":"Andrew Tate","content":"PERSON"},{"type":"$2.94 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Wall Street Memes","content":"ORGANIZATION"},{"type":"US Federal Reserves","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$0.0000000135","content":"MONEY"}],"hashtag":["Bitcoin","btc","ETH","Ether","Presale","Wall Street Memes","WSM","YPRED","yPredict"],"authors":["Joel Frank"]}