{"summary":"SEC Threatens Lawsuit Against Binance BUSD Stablecoin-Issuer Paxos – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-threatens-lawsuit-against-binance-busd-stablecoin-issuer-paxos-whats-going-on.htm","publishDate":"2023-02-13T16:34:00","id":19086,"type":null,"title":"SEC Threatens Lawsuit Against Binance BUSD Stablecoin-Issuer Paxos – What’s Going On?","category":["Blockchain News "],"content":["The Securities and Exchange Commission (SEC) has said it intends to sue Paxos Trust Company, a regulated New York-based firm that issues several popular stablecoins.","The threat of a lawsuit from the SEC came in the form of a letter to Paxos. The letter is a so-called Wells notice, used by the regulator to notify companies of possible enforcement action taken against them.","Paxos issues both the Pax Dollar (USDP) and the popular Binance USD (BUSD) stablecoins and is regulated by the New York State Department of Financial Services.","According to a Wall Street Journal report that cited sources “familiar with the matter,” the notice alleged that Paxos’ dollar-pegged BUSD stablecoin is an unregistered security. The stablecoin is issued by Paxos for Binance, but it is also traded on several other crypto exchanges, including Coinbase.","The report added that it was unclear whether the notice related to the issuing of BUSD, the listing of the coin on exchanges, or both.","Paxos has so far not commented on the story, but Binance CEO Changpeng Zhao (CZ), said in a Twitter thread on Sunday that “funds are SAFU!”","According to CZ, the only thing that will change in practice, for now, is that Paxos will no longer mint new BUSD tokens.","“As a result, BUSD market cap will only decrease over time,” he wrote. The Binance CEO added that Paxos “will continue to service the product, and manage redemptions.”","Despite these reassurances, CZ admitted that users will likely migrate to other stablecoins “over time.” He said Binance will make the necessary adjustments internally, including “move away from using BUSD as the main pair for trading.”","7\/ Binance will continue to support BUSD for the foreseeable future. We do foresee users migrating to other stablecoins over time. And we will make product adjustments accordingly. eg, move away from using BUSD as the main pair for trading, etc.","BUSD currently has a market cap of close to $16 billion and ranks as the third largest stablecoin after Tether (USDT) and USD coin (USDC).","According to the Wall Street Journal, the SEC’s move is seen as part of an escalating campaign against crypto companies in the US.","Over the past few days, US regulators have acted against the crypto exchange Kraken for alleged securities violations, including offering unregistered securities to users. The action led to a settlement agreement, where Kraken agreed to pay a $30 million fine for failing to register its crypto staking-as-a-service program.","Kraken CEO Jesse Powell responded to the situation sarcastically on Twitter, saying that if it was as easy as just “fill out a form on a website” he would have done so long ago.","Oh man, all I had to do was fill out a form on a website and tell people that staking rewards come from staking? Wish I'd seen this video before paying a $30m fine and agreeing to permanently shut down the service in the US. How dumb do I look. Gosh. ⛽️💡https:\/\/t.co\/UPdQdnI6xN","Prior to that, Coinbase CEO Brian Armstrong also commented on the escalating situation, saying on Twitter that he had heard rumors that the SEC “would like to get rid of crypto staking” in the US.","“I hope that’s not the case as I believe it would be a terrible path for the U.S. if that was allowed to happen,” Armstrong said at the time, while also calling staking “a really important innovation in crypto.”","2\/ Staking is a really important innovation in crypto. It allows users to participate directly in running open crypto networks. Staking brings many positive improvements to the space, including scalability, increased security, and reduced carbon footprints.",""],"entity":[{"type":"Sunday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"Jesse Powell","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Twitter","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Paxos","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"$30m","content":"MONEY"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","SEC"],"authors":["Fredrik Vold"]}