{"summary":"Crypto Influencer BitBoy Ends YouTube Show Amid Ongoing Legal Battles","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-influencer-bitboy-ends-youtube-show-amid-ongoing-legal-battles.htm","publishDate":"2024-02-01T17:55:56","id":19089,"type":null,"title":"Crypto Influencer BitBoy Ends YouTube Show Amid Ongoing Legal Battles","category":["Blockchain News "],"content":["Renowned crypto influencer BitBoy, real name Ben Armstrong, has announced the end of his daily crypto show on January 31.","In a surprising turn of events, BitBoy bid farewell to his three-year daily crypto show. Revealed on his YouTube channel, BitBoy attributed the decision to financial challenges.","","According to him, his financial struggles have been further aggravated by his ongoing legal battles, which have seen him spend considerable time pleading his case in court.","Providing more details, BitBoy revealed that he spends as much as $25,000 weekly to create and publish his daily shows. A further $100,000 is channeled towards covering his legal fees. According to him, he has lost everything.","Good Morning Crypto 📉.","Ben \"Bitboy\" Armstrong announced he's retiring from crypto streaming, saying he has lost everything.#thursdaymorning #thursdayvibes #ThursdayMotivations #ThirstyThursday #Bitcoin pic.twitter.com\/HAyf6LwSug","— tanjiro (@tanjiroNFTs) February 1, 2024","","BitBoy’s legal issues started in mid-2023 when he created his crypto asset, the $BEN coin. Following the launch of the digital asset, the BitBoy Crypto brand did not endorse the idea.","In an announcement on X, BitBoy Crypto’s parent company, BJ Investment Holdings, stated that it would take legal action against Armstrong. Consequently, the crypto influencer was ousted from the entire BitBoy Crypto franchise business.","Yesterday, BJ Investment Holdings, the parent company of Hit network, took decisive legal action in removing Ben Armstrong from the company, and specifically the Bitboy Crypto brand. https:\/\/t.co\/e0kYLKUZ4r","— Bitboy Crypto (@Bitboy_Crypto) August 28, 2023","","In response, Armstrong filed a counter-lawsuit, but the tide of events remained irreversible. Since then, the YouTuber has reported an onslaught of legal battles emerging from everyone and everywhere.","“We’re barely making it out here, guys. We’ve got lawyers coming at me from every angle. Everyone I know is coming after me right now,” Armstrong explained in his closing YouTube presentation.","Reminiscing with his 60,000 followers on X, Armstrong said he would likely miss them after his daily show ended.","My daily crypto livestream has been my life.","We had a good run. 3 years. Every Monday through Friday without rare exception.","Holidays. Birthdays. Market crashes. Bull market tops. Epic rants. I was there with you through it all.","I’ll miss you guys.","— Ben Armstrong (@BenArmstrongsX) January 31, 2024","","Armstrong rose to prominence in 2021, captivating crypto enthusiasts with his daily insights on digital assets. Covering digital asset fundamentals, price predictions, and Web3 investment opportunities, his YouTube channel amassed more than 91,000 followers in the subsequent years.","Following his announcement, his YouTube subscribers gave him moral support. One stated that his show served as a treasure trove of information, allowing would-be investors to get first-hand knowledge since 2021. Many of his subscribers are rooting for him to make a possible comeback.","While the atmosphere is largely positive, Armstrong has not hinted at any possible comeback on his YouTube show and X handle."],"entity":[{"type":"January 31","content":"DATE"},{"type":"BJ Investment Holdings","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Ben Armstrong","content":"PERSON"},{"type":"Bitboy\" Armstrong","content":"ORGANIZATION"},{"type":"February 1, 2024","content":"DATE"},{"type":"BitBoy Crypto","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"August 28, 2023","content":"DATE"},{"type":"$25,000","content":"MONEY"},{"type":"Morning Crypto 📉","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"January 31, 2024","content":"DATE"},{"type":"$BEN","content":"MONEY"}],"hashtag":["Bitboy","CRYPTO","crypto influencers"],"authors":["Jimmy Aki"]}