{"summary":"Long-Term Bitcoin Holders Are Beginning To Sell, “Bull Market Has Definitely Begun” Pompliano Claims","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/long-term-bitcoin-holders-are-beginning-to-sell-bull-market-has-definitely-begun-pompliano-claims.htm","publishDate":"2024-03-18T21:34:25","id":19088,"type":null,"title":"Long-Term Bitcoin Holders Are Beginning To Sell, “Bull Market Has Definitely Begun” Pompliano Claims","category":["Bitcoin News "],"content":["Long-term holders of Bitcoin are starting to sell off their holdings of the cryptocurrency, signaling that the bull market has “definitely begun,” according to data released on Monday from investor and entrepreneur Anthony Pompliano.","“This shouldn’t be a surprise — as the price of Bitcoin rises, some percentage of holders are willing to sell their assets to take profit off the table,” Pompliano wrote.","“A small percentage of bitcoin (< 5%) that was previously dormant is now on the move,” he added. “The 60% year-to-date increase in price, and the 140% increase over the last 12-months, has convinced some holders to part with their Bitcoin.”","The data shows that Bitcoin holders “began to sell their Bitcoin as the bull market got kicked off” in 2013, 2017, and 2019, respectively, with the selling of Bitcoin continuing to “accelerate” as the market prices increased over time.","“So a big takeaway from this metric is that the bull market has definitely begun,” Pompliano claimed.","Pompliano’s predictions follow a brief drop in BTC’s price over the weekend, dipping to $65,000 after reaching its all-time high of over $73,000 last week.","Despite the recent sell-off, a majority of Bitcoin holders are hanging onto their investment ahead of April’s quadrennial halving event, which could see the token’s price increase much more.","“They either sold because they needed to or they felt that the current offering price was more than sufficient,” Pompliano reported. “Most of the Bitcoin holders, especially those who have been holding for at least 1 year, are not yet convinced that Bitcoin’s price is high enough to part with their digital currency.”","“Just as in past cycles, this will change in the coming months or years,” he continued. “But in order to find out where that clearing price is, Bitcoin’s price will have to continue to appreciate.”","In a Monday note to clients, Standard Chartered’s head of digital assets research, Geoff Kendrick, raised his prediction of Bitcoin’s year-end value from $100,000 to $150,000. Moreover, Kendrick claimed that the cryptocurrency could reach a cycle high of $250,000 next year.","Similarly, CoinShares reported on Monday that spot Bitcoin ETFs reached record inflows totaling $2.9 billion this week, surpassing last week’s record of $2.7 billion. The latest data brings the investment vehicle’s year-to-date total inflows to an estimated $13.2 billion, with the U.S. receiving $2.95 billion in inflows alone.","📈 Crypto investment products maintained their momentum last week, drawing in a substantial $2.9 billion.","Get the latest insights in our brand new video format, available every Monday, and find all the details in our full report: https:\/\/t.co\/jaWv5NNvVv pic.twitter.com\/f7WnBkfGCv","— CoinShares (@CoinSharesCo) March 18, 2024","","How soon Bitcoin will return to its high of $73,000 last week is unclear, but market attitudes seems to be bullish.","At the time of publication, the price of Bitcoin is hovering around $67,000."],"entity":[{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$150,000","content":"MONEY"},{"type":"March 18, 2024","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"$67,000","content":"MONEY"},{"type":"Kendrick","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"140%","content":"PERCENT"},{"type":"Geoff Kendrick","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$65,000","content":"MONEY"},{"type":"$250,000","content":"MONEY"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"$73,000","content":"MONEY"},{"type":"$13.2 billion","content":"MONEY"},{"type":"Pompliano","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"$2.95 billion","content":"MONEY"},{"type":"$2.9 billion","content":"MONEY"},{"type":"$2.7 billion","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"last 12","content":"DATE"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["btc","bull market"],"authors":["Julia Smith"]}