{"summary":"Bitcoin Gold Suffers Two 51% Attacks, BTG Rallies 20%","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-gold-suffers-two-51-attacks-btg-rallies-20-5632.htm","publishDate":"2020-01-27T10:51:01","id":19092,"type":null,"title":"Bitcoin Gold Suffers Two 51% Attacks, BTG Rallies 20%","category":["Altcoin News "],"content":["On Sunday, Bitcoin Gold (BTG), the cryptocurrency that was forked from Bitcoin (BTC) in 2017, confirmed that it once again suffered a 51% attack (two attacks on January 23rd, to be precise). However, investors do not seem worried – BTC rallied almost 20% in the past 24 hours.","At pixel time (10:31 UTC), BTG, ranked 35th by market capitalization, trades at c. USD 12 and is also up by 15% in a week and 129% in a month.","BTG price chart:","The Bitcoin Gold Organization (BGO) said yesterday that the attacks “successfully reverted deposits to an exchange.” The first attack reportedly reverted around BTG 1,900 (USD 23,200), and the second attack BTG 5,267 (USD 64,400). However, it is still unknown if the hackers managed to liquidate any of the coins at the exchange:","“We do not know if they successfully extracted any value from an exchange,” the BGO added.","The organization behind Bitcoin Gold also said that it believes “one or both attacks failed” due to risk control mechanisms in place at exchanges.","In fact, this is not the first time a 51% attack is launched on bitcoin gold. It also happened back in May of 2018, and as evident from last week’s attack.","Further, the team also defended itself by saying that they closely watch the market for hashing power:","“We watch the blockchain and hashpower market closely. The evidence shows the hashpower for these attacks came through NiceHash,” the team said.","NiceHash is an online marketplace for hashing power where people can buy a given amount of hashing power for a limited time, without having to invest in expensive hardware themselves. As such, it might be used as a tool for attackers who are plotting to launch 51% attacks, meaning they take control of at least 51% of the hashing power on a network.","Although 51% attacks may be successful on smaller and more vulnerable cryptocurrencies, they are generally considered not to be economically feasible on larger cryptocurrencies like Bitcoin and Ethereum.","According to Crypto51, a website that tracks the theoretical cost of launching 51% attacks, Bitcoin Gold is a vulnerable cryptocurrency in the sense that it is theoretically possible to buy almost all the required hashing power on services like NiceHash. Further, the cost of launching such an attack for 1 hour is estimated to be USD 765, compared with USD 675,000 in case someone would like to attack Bitcoin."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Bitcoin Gold Organization (BGO","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"129%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Bitcoin Gold","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"BGO","content":"ORGANIZATION"},{"type":"May of 2018","content":"DATE"},{"type":"BTG","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Security"],"authors":["Fredrik Vold"]}