{"summary":"Solana NFT Sales Volume Drops Below $1 Million + More NFT News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solanas-nft-sales-volume-drops-below-1-million-more-top-nft-news.htm","publishDate":"2024-02-07T12:20:28","id":19096,"type":null,"title":"Solana NFT Sales Volume Drops Below $1 Million + More NFT News","category":["NFT News "],"content":["Today, the non-fungible token (NFT) sales volume is up 7.25% to $33,596,036 over the past 24 hours.","Buyers are up 13%, sellers are up 20%, and transactions increased 1%, according to CryptoSlam.","Among the top collections per sales volume over the last 24 hours, Pandora is in first place with $6,748,549.","The best performer in this group is y00ts, with a 1,513% increase. It now stands at $953,492 in fourth place.","The second-best performer is Mutant Ape Yacht Club, rising 594% to $780,584 and to seventh place.","Only two collections among the top ten dropped over the past day: Uncategorized Ordinals (-23%) and Dokyo (-46%).","In NFT news today: Solana’s 24-hour NFT sales volume falls below $1 million, OpenTheta announces an NFT collection, and Pattern Integrity Films moves from GameStopNFT Marketplace to Theta Network.","Making waves across NFT news rounds yesterday, operations on the Solana network have resumed following a five-hour outage on Tuesday. The Solana team said it is investigating the root cause.","As previously reported, this has affected the price of the native SOL token, as well as Solana NFT sales volume.","Over the past 24 hours, Solana has dropped nearly 44% to $712,096. This has pulled it down to sixth place by NFT sales volume.","To put this massive shift into context, Solana had – for weeks – been battling Bitcoin for the second place on the list. It had managed to surpass it several times.","Its daily NFT volume would move around $7 million at that time.","Bitcoin is now in second place, behind Ethereum, with nearly $8 million. Polygon follows it with $1.3 million.","Meanwhile, looking at the weekly charts, Solana is in third place despite a 31% drop. It recorded $34.9 in NFT sales volume. This is still significantly lower than Bitcoin’s $64.3 million.","Zooming out further, over the past 30 days, Solana is down 32.5% to $212.3 million, currently in 3rd spot.","But looking at the all-time ranking, Solana follows Ethereum, though with an understandably significant difference in sales volumes.","OpenTheta, the independent decentralized NFT launchpad and marketplace on the Theta Network, has announced its own NFT project.","The collections will be called Oties.","The pieces are created in collaboration with comic artist Rob Feldman.","We’re thrilled to reveal that we’re launching our very own NFT collection – Oties! 🎨 Featuring incredible art by @itsfeldman and awesome, one-of-a-kind utility.","Stay tuned for more details and the upcoming Whitepaper! #NFTLaunch #Oties #ArtByFeldman 🌟✨ https:\/\/t.co\/JzvnhEGCQQ","— OpenTheta (@OpenTheta) February 6, 2024","","There are currently no details available. The team has announced “incoming” information and whitepaper.","OpenTheta is home to ThetaPunks, ThetaPugs, Legendary Dragons, TraderPunks, and many other collections.","The platform allows users to set up wallets on MetaMask and connect them to OpenTheta with a single click. Users can then use OpenTheta to buy NFTs from creators and receive them directly into their wallets.","Meanwhile, Rob Feldman is a comic book creator, animation producer, and Theta TV streamer. Per the website, he is best known for his print and online creations, Cyko KO and Newgrounds series, Dr. Shroud.","Cyko KO features digital comic books, animated series, an NFT collection, and Web3 games.","And speaking of Thera Network…","Following the successful launch of various NFT collections on GameStopNFT Marketplace, Pattern Integrity Films announced its transition to Theta Network native NFT Marketplace ThetaDrop and Theta Web3 Theatre.","Pattern Integrity Films is a Webby Nominated filmmaking team based in the US. They launched their collections on the GameStop NFT Marketplace in Spring 2023. The latter has recently closed.","The team’s move to Theta Network “opens possibilities for more innovative NFT collections and collaborations as well as solidifying its position in the Film3 industry, said the press release shared with Cryptonews.","Thank you @GameStop for the opportunity to develop & launch PROCESS on the @GameStopNFT Marketplace.","While the GSMP is being shuttered, it’s spirit will live on through our docuseries while we transition PROCESS minting over to @ThetaDrop 🖖🛹⚡️https:\/\/t.co\/IgyMhD3hNq pic.twitter.com\/AFE83dEcQE","— Pattern Integrity Films (@pttrn_ntgrty) February 2, 2024","","Over the years, Theta Labs has collaborated with major names in the entertainment industry, including The Squad, Bingeable, Toonstar, and CYKO KO.","Meanwhile, Pattern Integrity Films so far introduced NFT collections ‘The Pigs of Film3’ and ‘The JPiGS of Production’.","As Pattern Integrity Films transitions to Theta Network, the community can look forward to exclusive passes granting film credits and token-gated access to Theta Web3 Theatre, the team said.","\"This shift allows us to utilize Theta’s digital rights management technology and leverage Theta Theatre for film distribution, significantly enhancing our film distribution capabilities.\"","— Theta Network (@Theta_Network) February 2, 2024","",""],"entity":[{"type":"$712,096","content":"MONEY"},{"type":"7.25%","content":"PERCENT"},{"type":"NFT Marketplace ThetaDrop","content":"ORGANIZATION"},{"type":"February 6, 2024","content":"DATE"},{"type":"GSMP","content":"ORGANIZATION"},{"type":"$34.9","content":"MONEY"},{"type":"$1.3 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"1,513%","content":"PERCENT"},{"type":"$212.3 million","content":"MONEY"},{"type":"GameStop NFT Marketplace","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"$33,596,036","content":"MONEY"},{"type":"Rob Feldman","content":"PERSON"},{"type":"$953,492","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"594%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"February 2, 2024","content":"DATE"},{"type":"$64.3 million","content":"MONEY"},{"type":"Shroud","content":"PERSON"},{"type":"Spring 2023","content":"DATE"},{"type":"Bingeable","content":"LOCATION"},{"type":"Theta Labs","content":"ORGANIZATION"},{"type":"$6,748,549","content":"MONEY"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Toonstar","content":"PERSON"},{"type":"$7 million","content":"MONEY"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"31%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"32.5%","content":"PERCENT"},{"type":"$8 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"46%","content":"PERCENT"},{"type":"Theta Network","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Pattern Integrity Films","content":"ORGANIZATION"},{"type":"Webby Nominated","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"$780,584","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["GameStop","NFT","Solana"],"authors":["Sead Fadilpašić"]}