{"summary":"Hut 8 Responds to Short Seller Report Accusing Bitcoin Miner of Malpractice","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hut-8-responds-to-short-seller-report-accusing-bitcoin-miner-of-malpractice.htm","publishDate":"2024-01-21T07:17:11","id":19108,"type":null,"title":"Hut 8 Responds to Short Seller Report Accusing Bitcoin Miner of Malpractice","category":["Bitcoin News "],"content":["Bitcoin miner Hut 8 has expressed confidence in its latest partnership with USBTC following a controversial report released by JCapital Research warning investors of possible risks.","In a brief response on Jan 19, the company stated that it had read the report and would provide all necessary updates deemed appropriate amid concerns by the wider digital asset community on social media spaces.","Please see our official statement on the recent short report and the Board and management team’s confidence in our merger of equals, the strength of the Company’s balance sheet, and the future success of the organization https:\/\/t.co\/wULGdaTlv6.","— Hut 8 (@Hut8Corp) January 19, 2024","","“(Hut 8) is aware of a short report issued on January 18 by J Capital Research, which is a self-proclaimed group of biased activists who clearly disclose that they will profit if a company’s share price declines. Hut 8 is reviewing the report and will provide updates as the Company deems appropriate.”","The Canadian miners expressed full confidence in the current management team and the board of directors following the merger adding that the partnership would achieve growth for all shareholders.","Sequel to the report flagging some financial activities related to the merger, the official statement assured the community of the strength of the merger and the company’s balance sheet.","On Jan 18, the cryptocurrency market received a report accusing the miners of numerous acts that might expose investors to risks following its latest merger with USBTC.","The Bitcoin miner is accused of hiding stock ownership in a perceived pump-and-dump scheme. Per the report, the shares of the largest shareholders are disguised through an undisclosed related party.","🛠 Bitcoin Miner Hut 8 Accused of a Pump and Dump Scheme, HUT Shares Plummet","Here are the key points👇","— Cryptonews.com (@cryptonews) January 19, 2024","","To the financials, it was alleged that the company inherited a huge debt from the merger and paid over the value of the company’s assets as USBTC lost miners and its main equipment isn’t operating at optimal capacity.","Furthermore, an insider revealed that USBTC was weeks away from bankruptcy describing the merger as a “godsend” in addition to further claims of being linked with promoters that have been slapped with charges by the Securities and Exchange Commission (SEC).","“Ultimately, we strongly believe that [HUT} shareholders are likely to feel the pain of being on the wrong side of an over-levered pump-and-dump, only to be left holding the most inefficient Bitcoin miner, which is unprofitable even at a Bitcoin price of over $60,000.”  ","Consequently, the miner’s stock fell by 23.49% as traders panicked amid a pump-and-dump allegation. At press time, the asset is down 3.85% in the last 24 hours exchanging hands at $6.92.","While several crypto users panicked, others disregarded the report backing the company as it looks to expand operations ahead of the upcoming halving."],"entity":[{"type":"$60,000","content":"MONEY"},{"type":"$6.92","content":"MONEY"},{"type":"J Capital Research","content":"ORGANIZATION"},{"type":"Bitcoin Miner Hut 8","content":"ORGANIZATION"},{"type":"3.85%","content":"PERCENT"},{"type":"Jan 19","content":"DATE"},{"type":"JCapital Research","content":"ORGANIZATION"},{"type":"Jan 18","content":"DATE"},{"type":"23.49%","content":"PERCENT"},{"type":"January 19, 2024","content":"DATE"},{"type":"January 18","content":"DATE"},{"type":"Board","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Bitcoin","HUT 8","J Capital"],"authors":["David Pokima"]}