{"summary":"Grayscale and its parent company Digital Currency Group grabbed headlines for the wrong reasons in 2022.\nGrayscale’s bitcoin trust is currently trading at a discount of 48.5%. \nGBTC’s price is down 77% year-to-date, trading below $8. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197123\/grayscales-gbtcs-beating-this-year-very-likely-to-persist","publishDate":"2022-12-29T06:45:25","id":1910,"type":null,"title":"Grayscale&#x27;s GBTC&#x27;s beating this year very likely to persist","category":["Token Projects"],"content":["Grayscale's flagship product, the Grayscale Bitcoin Trust (GBTC), grabbed headlines throughout the year — typically for the wrong reasons. Grayscale foresees a limited possibility of relief over the intermediate term.","CEO Michael Sonnenshein recently <a href=\"https:\/\/www.theblock.co\/post\/196193\/grayscale-gbtc-etf-return-capital\" data-v-f87c67ca=\"\">told<\/a> shareholders that 20% of the outstanding shares in GBTC could be returned to investors if the fund's spot-based exchange traded-fund application fails. Here's what might lie ahead of the world's biggest bitcoin fund.&nbsp;","In December, Grayscale released its proposed framework for valuing crypto assets. The framework discussed, among other things, historic correlations between the growth of the crypto market and M2 money supply, ie, the total volume of currency held by the public.&nbsp;","Crypto's total market capitalization has been historically correlated to the growth of the M2 money supply, which includes physical cash, deposits and savings accounts, the framework noted. \"Bitcoin and other digital assets tend to benefit from an increase in money supply as investors look to invest in risk assets while there is more capital available,\" it said.&nbsp;","Crypto and traditional risk assets benefit from this increased supply of cash, but raising interest rate hikes have led to a drop in money supply growth, this \"has put pressure on risk assets as the Federal Reserve looks to slow the economy and tame inflation,\" it concluded","Based on these market conditions, Grayscale foresees a limited possibility of relief over the intermediate term.","The Securities and Exchange Commission (SEC) rejected several applications from Grayscale to convert GBTC to a bitcoin spot-based exchange-traded fund (ETF) in 2022, and the SEC's next response brief is due on Jan. 13 2023 before final briefs are due on Feb. 3.","Grayscale's bid to convert GBTC into a spot ETF was rejected in June <a href=\"https:\/\/www.theblock.co\/post\/154924\/sec-rejects-grayscales-bid-to-convert-gbtc-to-a-bitcoin-etf?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">based<\/a> on the regulator's conclusion that the company hadn't shown sufficient planning to prevent fraud and manipulation.","Grayscale then <a href=\"https:\/\/www.theblock.co\/linked\/155000\/grayscale-files-suit-against-sec-following-rejection-of-gbtc-conversion-bid?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">filed<\/a> a lawsuit against the SEC after its decision. The asset manager argued that since the SEC has approved bitcoin futures ETFs, that opened the door for a spot-based fund, but the regulator disagreed. Futures products are harder to manipulate as the market is smaller and based on futures prices from the CME, which is CFTC-regulated.&nbsp;","On Dec. 9, the asset manager <a href=\"https:\/\/www.theblock.co\/post\/193900\/grayscale-says-sec-filed-first-legal-brief-in-ongoing-bitcoin-futures-etf-lawsuit\" data-v-f87c67ca=\"\">said<\/a> the SEC had filed its first legal brief in the lawsuit over the rejection of its spot bitcoin ETF application. The regulator argued much the same point, saying its rejection was \"reasonable, reasonably explained, supported by substantial evidence,\" with \"no inconsistency in the Commission's disapproval of Grayscale's spot ETP despite having approved two CME bitcoin futures ETPs.\"","The SEC said its disapproval of the proposed ETF did not reflect an \"impermissible, merits-based skepticism of bitcoin as an investment.\" The asset manager reiterated its earlier arguments in response, adding that the regulator was creating an \"uneven playing field for investors\" by approving bitcoin futures-based ETFs, not spot-based.","Issues with Grayscale's parent firm, Digital Currency Group (DCG), pushed GBTC into the spotlight again at the end of November.","Concerns cropped up when DCG's Genesis Capital said it had a $175 million exposure to FTX following the exchange's collapse. Genesis was then reported to be looking to raise $1 billion or face filing for bankruptcy protection.","This led investment bank UBS to point out that DCG could tap into its GBTC investment — it holds almost 10% of shares in the fund.","The stake is worth around $600 million, 12 times greater than the three-month average of the trust's daily trading volume, Ivan Kachkovski, a strategist at UBS <a href=\"https:\/\/www.theblock.co\/post\/191776\/gbtcs-near-11-billion-assets-under-management-pose-a-risk-in-the-bear-market-ubs\" data-v-f87c67ca=\"\">wrote.<\/a> DCG also nets around $210 million from GBTC management fees per annum. The fee is levied irrespective of performance or discount to NAV.&nbsp;","Liquidating the fund would bring in about $440 million, at best. That would be a little more than two years of recurring annual income from the trust's management fees — and it would assume all bitcoin were sold at a price of around $17,000. Therefore maintaining the fund is more profitable for the asset manager in the long run.&nbsp;","Calls for Grayscale to resume redemptions don't seem likely to end anytime soon, hedge fund Fir Tree capital recently revealed plans to sue Grayscale.","The hedge fund is <a href=\"https:\/\/www.theblock.co\/post\/192682\/hedge-fund-fir-tree-files-lawsuit-against-grayscale-bloomberg\" data-v-f87c67ca=\"\">suing<\/a> the asset manager for information to investigate potential mismanagement and conflicts of interest. Fir Tree plans to use the information to push Grayscale to address the large discount it trades at relative to the bitcoin it holds by lowering fees and resuming redemptions.&nbsp;","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Grayscale launched its flagship product, GBTC, in 2013 for institutional investors looking to gain exposure to bitcoin. As of Dec. 20, it controlled about 3.2% of bitcoin's circulating supply, with over 632,000 bitcoin worth around $10.7 billion.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/aum-of-the-grayscale-bitcoin-trust\/embed\" title=\"AUM of the Grayscale Bitcoin Trust\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Grayscale issues accredited investors shares that represent ownership in GBTC. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Unlike other investment products — exchange-traded funds — the shares do not grant investors a right to underlying assets. There is no redemption program in exchange for the underlying bitcoin. <\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Redemptions ceased since the fund attempted to convert to a spot bitcoin ETF; before this, investors had to wait six months before selling their shares on the secondary market. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The lack of a redemption function means that since 2014 there has been a disparity between GBTC's trading price and its net asset value, known then as the premium. This premium flipped to a discount in early 2021. Therefore, the market price of GBTC shares is over 47% lower than the value of the bitcoin in the fund or its net asset value (NAV).<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/premium-of-gbtc\/embed\" title=\"Daily GBTC Premium\/Discount to NAV\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The fund's discount to NAV hit fresh lows throughout the year, the latest coming on Dec. 13 when it reached an all-time low of 48.89%. Shares are down around 76% year-to-date, trading below $8. <strong data-v-f87c67ca=\"\">&nbsp;<\/strong>"],"hashtag":[]}