{"summary":"Silvergate Bank Suffers Run on Deposits as $8.1 Billion is Withdrawn – Will it Go Bust?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/silvergate-bank-suffers-run-on-deposits-as-81-billion-is-withdrawn-will-it-go-bust.htm","publishDate":"2023-01-06T10:00:00","id":19103,"type":null,"title":"Silvergate Bank Suffers Run on Deposits as $8.1 Billion is Withdrawn – Will it Go Bust?","category":["Blockchain News "],"content":["Silvergate Capital, a crypto-focused bank, suffered a bank run following the collapse of cryptocurrency exchange FTX, which forced the company to sell assets at a significant loss in order to honor $8.1 billion worth of customer withdrawals.","According to a Thursday report by the Wall Street Journal, the crypto bank had to sell $5.2 billion of debt securities it was holding on its balance sheet to cover around $8.1 billion in user withdrawals. As a result, it incurred a $718 million loss, which reportedly exceeds the bank’s total profits since 2013.","Furthermore, the company’s preliminary fourth-quarter results have revealed that it also saw a steep decrease in crypto-related withdrawals, which dropped by 68% in the fourth quarter of 2022. The bank had $11.9 billion worth of deposits from digital asset customers in 2021, which declined to $3.8 billion at the end of 2022. ","Silvergate claimed that it had $4.6 billion compared to its $3.8 billion in remaining deposits at the end of Q4 2022. The crypto bank also holds around $5.6 billion in debt securities like U.S. Treasurys that could be sold quickly. Alan Lane, CEO of Silvergate, said:","“In response to the rapid changes in the digital asset industry during the fourth quarter, we took commensurate steps to ensure that we were maintaining cash liquidity in order to satisfy potential deposit outflows, and we currently maintain a cash position in excess of our digital asset related deposits.” ","As reported, Silvergate has also cut off 40% of its staff, which equals about 200 employees. Apart from this, the bank has dropped plans to launch its own digital currency, writing off the $196 million it spent buying the technology that Facebook had built in its failed attempt to start a crypto-based payments network.","Silvergate describes itself as a “leading bank for innovative businesses in fintech and cryptocurrency.” Now-bankrupt FTX was also a client of the company, which facilitated payments between the crypto hedge fund Alameda and the crypto exchange. It is also under investigation for its role in the FTX saga. ","Aside from Silvergate, some other high-profile crypto companies are also struggling amid the ongoing crypto bear market. For one, crypto brokerage Genesis Global Trading, which recently told clients that they need more time to resolve the financial crisis plaguing its lending business, is considering filing for bankruptcy.","According to a Thursday report by the Wall Street Journal, the company has laid off 30% of its staff as it is dealing with steep losses from loans it made to Bankman-Fried’s now-bankrupt Alameda hedge fund as well as Three Arrows Capital. ","Meanwhile, Alex Mashinsky, the former CEO of now-bankrupt cryptocurrency lender Celsius Networks, is being sued by the New York attorney general for allegedly defrauding hundreds of thousands of investors who deposited billions of dollars into the platform."],"entity":[{"type":"Celsius Networks","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"$3.8 billion","content":"MONEY"},{"type":"$5.6 billion","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Alan Lane","content":"PERSON"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"$5.2 billion","content":"MONEY"},{"type":"$718 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Silvergate","content":"LOCATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"$11.9 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$8.1 billion","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"$196 million","content":"MONEY"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["CRYPTO","FTX"],"authors":["Ruholamin Haqshanas"]}