{"summary":"Bitcoin ETF Applicants to File Updated S1 Form After SEC’s Comments – A Delay Signal?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etf-applicants-to-file-updated-s1-form-after-secs-comments-a-delay-signal.htm","publishDate":"2024-01-09T08:36:26","id":19109,"type":null,"title":"Bitcoin ETF Applicants to File Updated S1 Form After SEC’s Comments – A Delay Signal?","category":["Bitcoin News "],"content":["As the spot Bitcoin exchange-traded fund (ETF) issuers filed applications for their revisions to reveal previously undisclosed fee structures, the U.S. Securities and Exchange Commission (SEC) has returned comments.","The SEC’s critiques came swiftly on the heels of the updated fee disclosures, sparking speculation within the crypto community about a potential delay in the highly anticipated approvals of the Bitcoin ETFs.","🚨SPOT BITCOIN ETF UPDATE: The SEC just issued additional comments on pending applicant's S-1s. This is a delay signal.🚫 #BitcoinETF #bitcoin","— Perianne (@PerianneDC) January 9, 2024","","“SPOT BITCOIN ETF UPDATE: The SEC just issued additional comments on pending applicant’s S-1s,” stated Chamber of Digital Commerce CEO Perianne Boring in a social media post. “This is a delay signal.”","The post soon received over one million views and sparked insecurity of the crypto investors. Responding to the speculation, Bloomberg Intelligence ETF analyst James Seyffart shared his views regarding the SEC’s pending decision.","“I don’t think this is necessarily a delay signal,” said Seyffart. “Really this just shows how quickly the SEC is turning these things around.”","“Borderline unheard of to send over a document to the SEC in the morning and get comments back the same day,” added Seyffart. “If they wanted to delay — the issuers wouldn’t have gotten comments back tonight.”","Really this just shows how quickly the SEC is turning these things around. Borderline unheard of to send over a document to the SEC in the morning and get comments back the same day (I think)","If they wanted to delay — the issuers wouldn't have gotten comments back tonight","— James Seyffart (@JSeyff) January 9, 2024","","More importantly, as the submitted revisions are S-1 forms, the SEC does not need to approve them before they approve 19b-4, the spot Bitcoin ETF application forms.","“S-1s do not NEED to be complete when 19b-4s are approved,” explained finance lawyer Scott Johnsson. “Take futures ETFs in 2022. Hashdex didn’t even get initial comments until after its 19b-4 was approved.”","“More than anything, these quick comments demonstrate SEC working to push everything forward for a quick approval and launch (vs what we saw with futures),” concluded Johnsson.","Fox Business journalist Eleanor Terrett also confirmed with sources that the SEC has no intention to change the schedule, saying, “Just spoke with a couple of people who received additional comments. They say they’re not worried and the SEC hasn’t conveyed a change of plans.”","Just spoke with a couple of people who received additional comments. They say they’re not worried and the @SECGov hasn’t conveyed a change of plans.","My sense is that they’re fairly confident this is just part of the process to get everything in before January 10th. https:\/\/t.co\/B9PvuHo6yX","— Eleanor Terrett (@EleanorTerrett) January 9, 2024","","“My sense is that they’re fairly confident this is just part of the process to get everything in before Jan. 10,” said Terrett.","In the unveiled S-1 forms, Bitcoin ETF fees vary significantly among issuers. Bitwise sets a competitive tone with a fee of 0.24%, while VanEck and ARK Invest both edge slightly higher at 0.25%. Invesco notably offers a fee waiver, reducing its fee from 0.59% to zero for the first six months.","Grayscale stands out with the highest fee of 1.5%. Yet Grayscale’s Bitcoin Trust (GBTC) demonstrated significant trading volume close to half a billion dollars, surpassing the majority of ETFs on Jan. 8."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"Eleanor Terrett","content":"PERSON"},{"type":"0.25%","content":"PERCENT"},{"type":"Scott Johnsson","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"0.24%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"Jan. 8","content":"DATE"},{"type":"Chamber of Digital Commerce CEO Perianne Boring","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Seyffart","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Johnsson","content":"PERSON"},{"type":"Fox Business journalist Eleanor Terrett","content":"ORGANIZATION"},{"type":"January 9, 2024","content":"DATE"},{"type":"4","content":"DATE"},{"type":"0.59%","content":"PERCENT"},{"type":"January 10th","content":"DATE"},{"type":"Terrett","content":"PERSON"}],"hashtag":["Bitcoin","Bitcoin ETF","SEC"],"authors":["Hongji Feng"]}