{"summary":"Police in Latvia Thwart Brutal Crypto Theft and Murder Plot","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/police-in-latvia-thwart-brutal-crypto-theft-and-murder-plot-8076.htm","publishDate":"2020-10-22T10:51:00","id":19116,"type":null,"title":"Police in Latvia Thwart Brutal Crypto Theft and Murder Plot","category":["Bitcoin News "],"content":["Police in Latvia said they have intercepted a gruesome kidnap and murder attempt on two people, at least one of whom has significant cryptoasset holdings – and torture at least one victim into revealing their private keys and other details.","Per an official release from the Latvian police service, the would-be attacker, a male resident of the capital Riga who was born in 1989, had targeted an individual with almost USD 600,000 worth of crypto and fiat holdings – and had prepared a spine-chilling assortment of “tools” with which to torture the intended victim.","Police stated that after obtaining the crypto funds, the attacker intended to kill his victim – and was searching for accomplices based abroad.","The would-be perpetrator has been arrested and charged with criminal law violations. And police claimed that the man had meticulously studied his intended victims’ daily routines and had prepared a macabre venue where he would enact the torture and murders.","Police said that the suspect was arrested on October 7 by the elite OMEGA police counterterrorism unit and has made a full confession. He has previous fraud convictions, they added.","On Twitter, a prominent crypto advocate claimed that “wrench” attacks could “trend” as crypto prices continue to climb after PayPal’s recent decision to embrace bitcoin (BTC) and major altcoins.","Before you go and buy yourself a gun or install the latest security system in your home, you should know that there are cheaper and perhaps more sensible precautions that you can take.","____\nLearn more:\nBitcoin Millionaire Jumps From Window to Escape Burglar\nCrypto Community Talk Guns After Another Brutal Robbery\nNorwegian Man Stabbed to Death After In-Person Bitcoin Sale"],"entity":[{"type":"Latvia","content":"LOCATION"},{"type":"Bitcoin Millionaire Jumps From Window to Escape Burglar\nCrypto Community","content":"ORGANIZATION"},{"type":"1989","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"October 7","content":"DATE"},{"type":"OMEGA","content":"ORGANIZATION"},{"type":"Riga","content":"LOCATION"}],"hashtag":["Bitcoin","Crime","Cryptocurrency","Security"],"authors":["Tim Alper"]}