{"summary":"DCG Objects Settlement Between NY Attorney and Failed Genesis","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dcg-objects-settlement-between-ny-attorney-and-genesis.htm","publishDate":"2024-02-22T07:13:25","id":19125,"type":null,"title":"DCG Objects Settlement Between NY Attorney and Failed Genesis","category":["Blockchain News "],"content":["Crypto VC Digital Currency Group (DCG) has called the settlement between subsidiary Genesis and New York as a “subversive arrangement.”","Last week, DCG raised objections to defunct crypto lender Genesis’s plans to sell its assets amounting to around $1.6 billion. The assets included shares in Grayscale’s Bitcoin Trust (GBTC), Grayscale Ethereum Trust (ETHE), and Grayscale Ethereum Classic Trust (ETCG).","In a fresh filing on Wednesday, DCG submitted its objection to Genesis’s proposed settlement with New York attorney general office.","DCG contended that Genesis did not follow proper legal processes and the agreement falsely diverted funds to preferred creditors.","“[Genesis] cannot, under the guise of a “settlement,” take value from lower classes and redistribute it to preferred creditors in violation of absolute priority.”","Furthermore, the settlement is a “back-door attempt to circumvent U.S. bankruptcy law,” the group argued. The Genesis’s parent company stressed that the settlement had been secretly created, characterizing it as a “subversive arrangement.”","Genesis entered into a deal with the office of the attorney general in New York early this month. The beleaguered exchange said in its preliminary statement that the deal will resolve charges that it had defrauded investors.","In a separate filing on Wednesday, Jason Brown, an ex-senior federal attorney in New York, expressed support to DCG’s objection.","He asserted that the settlement in his opinion is not in the usual course to forgo discussions.","“In any case of this magnitude, I would expect the parties to have engaged in extensive merits-based assessments of the claims prior to finalization of a settlement.”","Brown worked alongside the New York Attorney General to manage the legal practice and operations of the office. During his tenure, he oversaw various aspects of the NYAG, including the negotiation of plea deals and settlements.","Genesis should have undertaken an enhanced process involving preparation and exchange of detailed analyses of potential settlement values, he added.","Genesis filed for Chapter 11 bankruptcy in October in the Southern District of New York, seeking protection from its creditors. The exchange noted that it would use $150 million of cash to fund the company in bankruptcy and repay creditors."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale Ethereum Classic Trust","content":"ORGANIZATION"},{"type":"VC Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Grayscale’s Bitcoin Trust","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Jason Brown","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Genesis","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":["Digital Currency Group","Genesis","New York"],"authors":["Sujha Sundararajan"]}