{"summary":"Solana Price Prediction as SOL Tops Altcoin Fund Inflow with $13.6 Million Last Week – Is SOL the New Investor Favorite?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-price-prediction-as-sol-tops-altcoin-fund-inflow-with-13-6-million-last-week-is-sol-the-new-investor-favorite.htm","publishDate":"2023-11-22T12:03:48","id":19124,"type":null,"title":"Solana Price Prediction as SOL Tops Altcoin Fund Inflow with $13.6 Million Last Week – Is SOL the New Investor Favorite?","category":["Price Predictions "],"content":["","The Solana price has dipped by 3% in the past 24 hours, dropping to $54.67 after Binance’s settlement with the US Department of Justice sent the entire market lower yesterday.","SOL is now down by 8.5% in the past week, yet the altcoin remains up by 26% in the past fortnight and by an impressive 84% in the last 30 days.","It has even risen by more than 400% since the beginning of the year, and with Solana continuing to top the leaderboard for altcoin fund inflows, it will likely see further gains in the coming weeks.","Compared to many other tokens today, SOL’s chart and indicators continue to look relatively healthy, even with yesterday’s slip.","Its RSI (purple) is already close to 60 again after dropping overnight, suggesting that buying pressure remains with the altcoin and is likely to continue climbing soon enough.","It’s also encouraging that SOL’s 30-day average (yellow) is still climbing above than its 200-day average (blue), a sign that the coin is likely to continue pushing towards higher levels for the foreseeable future.","There are other positive signs, including the coin’s 24-hour trading volume, which remains high at $2.5 billion.","It’s likely that much of this increased volume stems from funds, which have shown a growing demand for SOL over the past few weeks.","Indeed, SOL witnesses the highest weekly fund inflows of any altcoin, with the latest CoinShares report showing that it attracted $13.6 million in fund inflows last week.","🚀 Solana's investment products soar with a 500% increase this year, attracting $135m! Last week alone saw $13.6m inflows, outshining other altcoins as $SOL jumps 115% in 30 days. Meanwhile, Bitcoin remains dominant with $154.7m. Diversified crypto investments? Up by $7.9m.…","— BlockVoyager (@BlockVoyagerAIO) November 21, 2023","","This compares favorably to $3.3 million Ethereum received, with only Bitcoin (BTC) – at $154.7 million – beating it.","As such, SOL is likely to continue rising healthily once the market regains a more positive outlook.","At the moment, Binance’s settlement with the DoJ has dampened the mood, pulling SOL down along with most other tokens.","Yet the overall picture remains very positive for SOL, which has had an excellent 2023.","To some extent, its gains are a product of it making for a very poor 2022, during which it suffered a series of outages that damaged its reputation.","solana has flawlessly sustained 100% uptime for almost nine consecutive months","what was once a 'joke' is now hardly a valid argument","those hating on $sol will find themselves left behind as it continues to dominate in the bull market pic.twitter.com\/qZg8Onm3m3","— buckets | sandbar.io 🏝️ (@SOLbuckets) November 21, 2023","","Yet it has now enjoyed 100% uptime for close to nine consecutive months, a sign of how much updates have improved its efficiency and resilience.","Based on this, the Solana price is likely to reach $60 in the next couple of weeks and potentially end the year at around $80.","SOL isn’t the only promising alt in the market right now, with a number of newer coins – including presale tokens – looking like they could rally in the next few weeks.","One prime candidate to do this is Bitcoin Minetrix (BTCMTX), a stake-to-mine platform that has raised over $4.2 million in its ongoing presale.","#BitcoinMinetrix bringing essential news!","Over $4,200,000 raised! 🔥 pic.twitter.com\/QWHKasvilZ","— Bitcoinminetrix (@bitcoinminetrix) November 21, 2023","","This figure stands as a big vote of confidence in Bitcoin Minetrix, which will enable users to mine Bitcoin (BTC) by staking its native BTCMTX token.","Staking BTCMTX provides users with mining credits, which they can spend on actual Bitcoin mining.","Doing this enough will earn them freshly mined BTC, something which is likely to widen and democratize access to Bitcoin mining.","In addition, staking also earns users newly issued BTCMTX as well, meaning that Bitcoin Minetrix could end up being a highly lucrative platform for users.","#BitcoinMinetrix imagines a renewed cloud mining landscape that merges ownership and cloud mining.","Through transparency, independence, and safety, #BitcoinMinetrix aims to lead tokenized cloud mining, providing a reliable $BTC mining path for everyone. 🌐⚒️ pic.twitter.com\/SOETy3de0a","— Bitcoinminetrix (@bitcoinminetrix) November 21, 2023","","To join the presale, investors need simply go to the official Bitcoin Minetrix website and connect their software wallets.","The sale is currently in its penultimate stage, with 1 BTCMTX costing $0.0118.","This will move $0.0119 by the sale’s final stage, which begins in just under five days.","And once the final stage is over, BTCMTX will list on exchanges, where it could potentially rally big.","Visit Bitcoin Minetrix Now","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"8.5%","content":"PERCENT"},{"type":"SOL","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$154.7","content":"MONEY"},{"type":"$7.9","content":"MONEY"},{"type":"500%","content":"PERCENT"},{"type":"84%","content":"PERCENT"},{"type":"US Department of Justice","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"$4,200,000","content":"MONEY"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"November 21, 2023","content":"DATE"},{"type":"last 30 days","content":"DATE"},{"type":"$SOL","content":"MONEY"},{"type":"$13.6","content":"MONEY"},{"type":"$60","content":"MONEY"},{"type":"$80","content":"MONEY"},{"type":"$4.2 million","content":"MONEY"},{"type":"$0.0118","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"$154.7 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$0.0119","content":"MONEY"},{"type":"115%","content":"PERCENT"},{"type":"400%","content":"PERCENT"},{"type":"26%","content":"PERCENT"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$sol","content":"MONEY"},{"type":"$54.67","content":"MONEY"},{"type":"DoJ","content":"ORGANIZATION"},{"type":"Bitcoin Minetrix","content":"PERSON"},{"type":"$13.6 million","content":"MONEY"},{"type":"Bitcoin Minetrix","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"$135m!","content":"MONEY"}],"hashtag":["Altcoins","Solana","Technical Analysis"],"authors":["Simon Chandler"]}