{"summary":"Monad Devnet Launches with Scalability Promise – Could it Push Ethereum Technology to New Heights?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/monad-devnet-launches-with-scalability-promise-could-it-push-ethereum-technology-to-new-heights.htm","publishDate":"2024-03-14T18:54:37","id":19122,"type":null,"title":"Monad Devnet Launches with Scalability Promise – Could it Push Ethereum Technology to New Heights?","category":["DeFi News "],"content":["The highly anticipated layer 1 blockchain Monad officially launched its developer network (devnet) on March 14 after achieving an impressive 10,000 transactions per second (TPS) in internal testing environments.","This TPS statistic and Monad’s goal to optimize and improve Ethereum’s functionality signal the project’s potential to address Ethereum’s scalability issues.","“This is an important milestone for our team. Load testing will continue before the phased release of permissioned testnet and public testnet,” Monad CEO Keone told Cryptonews. “Monad is a deep engineering effort to deliver performant parallel EVM. We’re excited to share our team’s advances in parallel EVM execution and performant state access later this year.”","Monad’s impending arrival comes at a time when congestion and high fees continue to plague the network. The demand for scalable layer 1 solutions that can build on Ethereum’s solid foundations is higher than ever.","Monad Devnet is live.","10,000 real TPS achieved on the EVM. pic.twitter.com\/1bnfsi6bqU","— Monad (evm\/acc) (@monad_xyz) March 14, 2024","","At Monad’s core is a new Ethereum Virtual Machine (EVM) designed from scratch to use parallelized execution and a pipelined architecture. This allows transaction processing to occur simultaneously, rather than sequentially, enabling vastly higher throughput.","By remaining bytecode compatible, Monad promises to ensure seamless integration with the ecosystem of Ethereum-based dApps and DeFi protocols. Developers will be able to port their decentralized applications to Monad without extensive reworking.","A key benefit of Monad’s architecture is the ability to finalize blocks instantly after generation, eliminating the long confirmation times that often frustrate Ethereum users. Monad is able to achieve this by decoupling execution from consensus.","In addition, Monad implements a one-second block time to maximize throughput. This presents potential difficulties for node operators, however, as the hardware requirements are roughly twice that of Ethereum.","Venture capital firm Paradigm, a key backer of several prominent industry startups, is reportedly leading a fundraising round of over $200 million for Monad Labs. This round, which would follow a $19 million seed round in February 2023, places a $3 billion valuation on Monad Labs.","Paradigm has already committed $150 million and has been gauging interest from additional investors since late 2023. A successful raise of this magnitude would mark the largest crypto-related funding round of 2024 to date, according to Crunchbase’s Web3 Tracker.","EigenLayer got $100M from a16z, Eclipse just got a $50M round and now Monad might get $200M of which $150M comes from Paradigm goes to show VCs are definitely circling the waters now. Next stop is now massive eco fund announcements pic.twitter.com\/npX2JfOHkk","— guleid (@riddle245) March 11, 2024","","With the devnet now live, the next milestone is the launch of Monad’s public testnet, expected to go live in Q2 2024. This will enable rigorous real-world testing of the network’s performance and capabilities.","The Monad mainnet is slated to follow later in the year. The project has generated excitement and anticipation in the Ethereum community, with developers eager to leverage Monad’s scalability.","If Monad can deliver on its promise of high throughput and instant finality while retaining Ethereum’s security guarantees, it may very well offer the push that finally brings crypto to the masses."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"Monad Labs","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"March 11, 2024","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"March 14","content":"DATE"},{"type":"$19 million","content":"MONEY"},{"type":"March 14, 2024","content":"DATE"},{"type":"Crunchbase’s Web3 Tracker","content":"ORGANIZATION"},{"type":"Keone","content":"PERSON"},{"type":"$150M","content":"MONEY"},{"type":"$100M","content":"MONEY"},{"type":"Monad","content":"ORGANIZATION"},{"type":"$200M","content":"MONEY"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"late 2023","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"$50M","content":"MONEY"},{"type":"TPS","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Devnet","Ethereum","Monad"],"authors":["Trent Alan"]}