{"summary":"Apple Ends Partnership With Goldman Sachs as Tech Giant Expands into Lending","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/apple-ends-partnership-with-goldman-sachs-as-tech-giant-expands-into-lending.htm","publishDate":"2023-11-29T09:43:37","id":19139,"type":null,"title":"Apple Ends Partnership With Goldman Sachs as Tech Giant Expands into Lending","category":["Technology News "],"content":["Apple has decided to terminate its credit-card partnership with Goldman Sachs as the tech giant pushes deeper into consumer lending.","Apple recently submitted a proposal to Goldman Sachs, outlining its intention to exit the contract within the next 12 to 15 months, according to a report from The Wall Street Journal. ","The termination encompasses the entire consumer partnership, including the credit card launched in 2019 and the savings account introduced this year.","The decision marks a rapid reversal for a program that, just over a year ago, was extended until 2029 and was expected to be a cornerstone of Goldman Sachs’ foray into the mainstream consumer market. ","However, things took a turn for the worse for Goldman Sachs towards the end of last year when it incurred significant losses in its attempts to establish a comprehensive consumer operation. ","By early this year, Goldman Sachs had informed Apple of its intention to offload the partnership. ","Typically, the merchant, in this case, Apple, holds a controlling role in such collaborations.","Goldman Sachs has engaged in discussions with American Express regarding the possibility of transferring the program to the renowned card giant. ","However, American Express has raised concerns about certain aspects of the program, including its loss rates, and it remains uncertain whether these discussions have progressed further. ","Synchrony Financial, the largest issuer of store credit cards in the U.S., has also shown interest in assuming control of the credit-card program. ","Synchrony has long sought to position itself as an issuer with close ties to tech companies, boasting partnerships with industry giants such as Amazon and PayPal. ","Interestingly, Synchrony originally competed against Goldman Sachs for the Apple credit-card program.","For Apple, this development poses a setback for its services business, which has become increasingly crucial as iPhone sales plateau. ","However, it’s worth noting that the Goldman partnership likely represents only a small portion of Apple’s revenue stream. ","In the September quarter, Apple reported a negligible annual decline in overall sales, while services revenue grew by approximately 16%.","For Goldman Sachs, the partnership’s demise represents a significant step back from its failed attempt to diversify beyond serving corporate clients and the ultra-rich. The bank is now refocusing on its core clientele.","The relationship between Goldman Sachs and Apple faced challenges from the beginning. ","Apple’s advertisements stating that the card was not from a bank reportedly irritated certain Goldman executives. ","Moreover, Apple insisted on approving nearly all applicants, leading to increased loan losses for Goldman. ","Apple’s requirement to send cardholders’ bills at the beginning of the month also caused significant customer service challenges for Goldman, as most card programs stagger bill distribution to avoid overwhelming call volumes.","Some Goldman executives privately attribute regulatory scrutiny faced by the bank to its association with Apple. ","Last year, Goldman disclosed that the Consumer Financial Protection Bureau was investigating its credit card account management practices, including billing error resolutions and cardholder refunds. ","The Federal Reserve has also been examining Goldman’s broader consumer-lending business."," In response, Goldman has initiated Project Blue, an internal effort focused on addressing regulatory issues, and has been reassigning employees from consumer lending to support this endeavor."," "],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"2029","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Synchrony Financial","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"next 12","content":"DATE"},{"type":"American Express","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"Apple","content":"ORGANIZATION"},{"type":"September quarter","content":"DATE"},{"type":"Goldman Sachs’","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"}],"hashtag":["Apple","Goldman Sachs"],"authors":["Ruholamin Haqshanas"]}