{"summary":"Sen. Warren Warns US Military Officials, Claims Iranian Crypto Mining Supports Terrorism","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sen-warren-warns-us-military-officials-claims-iranian-crypto-mining-supports-terrorism.htm","publishDate":"2024-05-03T08:18:26","id":19142,"type":null,"title":"Sen. Warren Warns US Military Officials, Claims Iranian Crypto Mining Supports Terrorism","category":["Bitcoin News "],"content":["US Senator and highly vocal crypto critic, Elizabeth Warren, has claimed that Iranian crypto miners have terrorist ties including Hamas.","In an open letter dated May 1, Sen. Warren and Sen. Angus King Jr. have together warned that this “ongoing activity by the Iranian government threatens our national security.”","The lawmakers have called the Biden administration to provide information on the efforts “to combat Iran’s rampant evasion of U.S. and international sanctions through crypto mining.”","The Senators particularly raised alarm on Iranian crypto mining firm’s ties to fund Hamas, through the “steady revenue” from mining.","The letter had details about Iran’s massive crypto mining operations for past several years. “Crypto mining has become increasingly lucrative for Iran,” it added.","“Iran legalized the crypto mining industry in 2019. In the five years since Iran has raised millions of dollars through mining crypto, a steady revenue source that allows it to purchase imports, move funds domestically and internationally, and fund Hamas and other terrorist organizations.”","Further, estimates suggest that Iranian Bitcoin mining could have “produced as much as $1 billion in revenue in 2021”. This is mainly due to the Iranian Ministry of Industries, Mining and Trade issuing 1,000 licenses for cryptocurrency mining units so far, despite these operations sucking massive electricity power.","Apart from the highly profitable crypto mining, the Senators have accused the nation’s ability to launder funds using cryptos.","For instance, they mentioned how the nations largest crypto exchange Nobitex’s website provides guidelines to users on avoiding sanctions. Notably, Binance processed $8 billionworth of Iranian crypto transactions in a four-year period flowing through Nobitex.","Furthermore, the Iranian military has had a history of having ties with ransomware gangs. During Iran’s attack on Israel, the former’s military has used crypto to fund known terrorist groups like Hezbollah.","“Iran’s use of crypto to evade sanctions poses a direct threat to our national security,” the legislators stressed. “Unless we take action, Iran will continue to use crypto to fund attacks against Israel.”"],"entity":[{"type":"May 1","content":"DATE"},{"type":"Warren","content":"PERSON"},{"type":"Iranian Ministry of Industries","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Angus King Jr.","content":"PERSON"},{"type":"$8 billionworth","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Hezbollah","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Biden","content":"PERSON"},{"type":"Iran","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":["Crypto Mining","Elizabeth Warren","Iran"],"authors":["Sujha Sundararajan"]}