{"summary":"Australia’s Government Calls for Digital Asset Platforms to Abide by Existing Financial Regulations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/australias-government-calls-for-digital-asset-platforms-abide-by-existing-financial-regulations.htm","publishDate":"2023-10-16T04:39:00","id":19149,"type":null,"title":"Australia’s Government Calls for Digital Asset Platforms to Abide by Existing Financial Regulations","category":["Altcoin News "],"content":["The Australian government has unveiled a proposal aimed at imposing stricter regulations on cryptocurrency trading platforms, with a focus on enhancing oversight of customer funds. ","The proposal, released on Monday, suggests subjecting digital asset platforms to the same laws that govern other financial services providers, according to a report by the Wall Street Journal. ","As part of the plan, crypto platform operators will be required to obtain a financial services license, as well as continuous monitoring and routine audits of customer funds.","“Government is acting methodically to ensure that consumers are adequately protected and innovation can flourish,” Australian Treasurer Jim Chalmers stated in a released statement. ","He also noted that the proposed regulations align with similar measures implemented in other jurisdictions.","The recent collapse of some high-profile crypto firms has underscored the need for tighter oversight.","For one, the collapse of crypto exchange FTX in November 2022 revealed significant vulnerabilities. ","At the time of its downfall, FTX held a staggering 218.6 million Australian dollars (US$137.7 million) belonging to 24,656 local customers, as reported by local bankruptcy administrator KordaMentha. ","It is worth mentioning that FTX had previously held an Australian Financial Services license, which was subsequently suspended by regulators.","FTX founder Sam Bankman-Fried is currently facing trial in the United States. ","Prosecutors allege that Bankman-Fried orchestrated the theft of billions of dollars from customers, using the funds for personal enrichment, venture investments, and even political campaign contributions. ","Bankman-Fried has entered a plea of not guilty to all charges.","Crypto has been under increasing scrutiny in Australia as of late. ","Back in May, cryptocurrency exchange Binance Australia told customers they would lose access to Australian dollar deposits and withdrawals due to a decision by its third-party service provider. ","In July, officials from the Australian Securities and Investments Commission (ASIC) even conducted searches at Binance Australia‘s offices.","Moreover, in March, Australia’s prudential regulator instructed banks to report their exposures to crypto firms and startups following the collapse of the Silicon Valley Bank and the resulting turmoil in the banking sector. ","The APRA asked local banks to improve their reports on crypto assets and provide daily updates to the regulator to gain more insight into potential vulnerabilities in the system.","In response to increasing restrictions on crypto payments, Blockchain Australia, an industry body representing the Blockchain and digital currency industry in Australia, has launched new initiatives to tackle the issue of crypto scams and frauds.","Under the new plan, the body will take numerous measures, including education programs, roundtables, and more. "],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"Australian Securities and Investments Commission","content":"ORGANIZATION"},{"type":"Blockchain Australia","content":"LOCATION"},{"type":"218.6 million Australian dollars (US$137.7 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"Jim Chalmers","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Binance Australia","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Australian Financial Services","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Australia","Regulation"],"authors":["Ruholamin Haqshanas"]}