{"summary":"Navigating Spot Bitcoin ETFs in the US: What You Need To Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/navigating-spot-bitcoin-etfs-in-the-us-what-you-need-to-know.htm","publishDate":"2024-01-12T17:37:40","id":19144,"type":null,"title":"Navigating Spot Bitcoin ETFs in the US: What You Need To Know","category":["Bitcoin News "],"content":["In 2013 an entity affiliated with the Winklevoss twins sent the first application to The United States Securities and Exchange Commission (SEC) to create a spot Bitcoin (BTC) exchange-traded fund (ETF). The SEC officially approved spot Bitcoin ETFs on Jan. 10 this year.","It has taken over 10 years for spot Bitcoin ETFs to be approved in the US, resulting in a new-found interest in ETFs. Many individuals are now wondering what an ETF is and how the financial product can be used to buy Bitcoin.","","Yesha Yadav, professor of law and associate dean at Vanderbilt Law School, told Cryptonews that an ETF has rapidly come to represent a popular and versatile investment innovation within securities markets. According to Yadav, the basics behind ETFs are fairly straightforward. She said:","“In an ETF, investors put their money into a fund in return for shares in this fund. Returns on these shares are determined by particular products that a fund tracks – such as basket of stocks, bonds, certain commodities, or even a particular investment strategy. For example, a bond ETF will deliver returns to fundholders based on the interest income being generated by its basket of bonds.”","Yadav added that the major innovation behind an ETF, which distinguishes it from a typical mutual fund, is that an ETF’s shares are traded on a stock exchange like a normal stock. “This helps make ETFs very attractive to investors who can move in-and-out of ETF shares smoothly and generally at relatively low cost,” said Yadav. She further remarked that because ETFs are traded like stocks, they are regulated by the SEC.","This is important to point out, as both retail and institutional US investors for the first time have access to regulated Bitcoin. Moreover, because Bitcoin can now be bought or sold via familiar brokerages and held by individuals saving for retirement to hedge funds, spot BTC ETFs will likely be a way to increase mainstream adoption of crypto.","It’s also worth mentioning that ETFs have an enormous footprint within US securities markets. According to State Street Global Advisors, ETFs had a monumental month in the US in November last year, with assets climbing to a record $7.65 trillion.","","In 2021, the first Bitcoin Futures ETF was approved by the SEC in the US. ProShares’ Bitcoin Strategy ETF was listed as the first exchange-traded fund, allowing US investors direct exposure to cryptocurrency futures. While notable, there are key differences between a futures and spot ETF. Yadav said:"," “A spot Bitcoin ETF is one that tracks the value of Bitcoin. Returns are governed by the changing value of the underlying Bitcoin. The spot ETF for Bitcoin will directly hold a pool of BTC. In the case of a Bitcoin Futures ETF, investors take exposure on the performance of the Bitcoin derivatives rather than just the spot. A spot ETF versus a futures ETF can provide varying performance for investors, especially in the context of commodities such as Bitcoin.”","For added context, Bloomberg ETF analyst James Seyffart told Cryptonews that a spot Bitcoin ETF is just a fund that trades on an exchange like a typical stock, but will hold spot Bitcoin. “So buying a share of these ETFs will give you exposure to Bitcoin,” he said. Compared to a Futures ETF, Seyffart explained that these types of products hold monthly Bitcoin Futures contracts. He said:","“They have to sell the current month  every single month after, which can lead to poor performance due to the nature and friction in constantly rolling those contracts. Particularly when the contract you are selling is a lower price than the one you are buying. You end up selling low and buying high over and over again.”","According to Seyyfart, this process has led the leading Bitcoin futures ETF to underperform spot Bitcoin by 15.8% in 2023. However, he believes that the Bitcoin futures ETF is a great trading vehicle for short and even medium term exposure,  but warns that frictions can add up over time.","All things considered, the approval of a Bitcoin Futures ETF helped pave the way for the eleven spot Bitcoin ETFs that began trading on Jan. 11, which include highly credible institutional players like BlackRock’s iShares Bitcoin Trust (IBIT.O), Grayscale Bitcoin Trust (GBTC), Valkyrie Bitcoin Fund (BRRR.O) and others.","Leah Wald, chief executive officer of Valkyrie, told Cryptonews that Valkyrie’s spot Bitcoin ETF will be available to US investors through their brokerage and investment accounts. “Any investor will be able to purchase shares of our ETF which will be available for trading on the Nasdaq,” she said.","Wald added that due to heightened demand for access to Bitcoin, she expects upwards of $400 million in assets to flow into Valkyrie’s ETF during the first few weeks of trading. Wald’s prediction may be accurate, as it’s been reported that Bitcoin spot ETFs have already seen $4.6 billion in volume during the first day of trading.","Although impressive, it’s important to understand that investing in a spot Bitcoin ETF introduces counterparty risk. Perianne Boring, founder and chief executive officer of the Chamber of Digital Commerce, told Cryptonews that investors rely on the ETF issuer to accurately track the performance of the underlying asset (Bitcoin). “If the issuer encounters financial difficulties or mismanages the fund, it can impact the ETF’s value and the investor’s returns,” she said.","","While the spot ETF funds are expected to bring billions of dollars of fresh capital into Bitcoin, it’s important to note that fees are associated. In an effort to attract investors, many of the firms offering spot ETFs have announced low initial management fees with BlackRock’s iShares ETF charging 0.12% for the first 12 months (or first $5 billion of inflows), and the Invesco Galaxy ETF waiving its fee entirely for the first six months (or $5 billion).","Interestingly, it’s been reported that The Grayscale Bitcoin Trust (GBTC) led trading volume on Jan. 11, even with the highest trading fee. According to The Grayscale Team Jan. 12 newsletter, GBTC was the most actively traded Bitcoin ETF on Jan. 11, with a total of $2.32 billion in value on NYSE Arca. The post also noted that CBTC was the most actively traded commodity ETF across US markets.","Brian Dixon, chief executive officer of Off The Chain Capital – an investment fund specializing in digital assets – told Cryptonews that he thinks there are huge implications associated with Grayscale’s ETF product, noting that it has a first-mover advantage compared to Blackrock, Fidelity, and other providers. He said:","“Grayscale has an estimated 619,000 Bitcoins in its ETF. As Blackrock, Fidelity, and other providers go into the market to secure their supply for their ETFs, this will inherently drive up the price of Bitcoin, creating a tremendous enhancement of Grayscale’s ETF value and assets under management (AUM).”","Dixon added that even with some level of attrition to Grayscale’s Bitcoin ETF – which is to be expected as some investors may switch for lower fees – the dollars flowing into competitive products will continue to push up the value of Grayscale’s AUM. “History shows us with ETFs that the biggest and most liquid ETFs attract the majority of the AUM. As of today, this is exactly what Grayscale’s Bitcoin ETF provides,” he said.","","While there has been buzz regarding the impact spot ETFs are having on the price of Bitcoin and other cryptocurrencies, there are many other factors that make this a watershed moment. For instance, Seyyfart mentioned that it’s rare for ETFs to create a new bridge to a new asset. He said:","“The last time something like this happened it was a gold ETF in 2004. Before that was equities and bonds. You can make arguments that there were others, but this is really the next one I’m watching — it’s the first digital asset ETF and it shows both the flexibility and benefits of the ETF wrapper.”","Seyyfart added that he thinks there is a greater than 50 percent chance (maybe 70 percent), that a spot Ethereum ETF is next. However, he noted that any other digital asset is likely much farther behind and unlikely to be approved anytime soon.","Dixon further noted that as the Bitcoin ETFs expand adoption of the asset, the US may enter a geopolitical race for countries to capture Bitcoin on their balance sheet. “As countries continue to educate themselves on Bitcoin, I believe there will be a race to acquire as much as possible for their reserves. If Bitcoin becomes the monetary base layer for the planet in the future, the country that holds the most Bitcoin holds the most control,” he said.","According to Nasdaq, as of October of 2023 the US Government is one of the largest holders of Bitcoin with over 200,000."],"entity":[{"type":"The United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Brian Dixon","content":"PERSON"},{"type":"October of 2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jan. 10 this year","content":"DATE"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Jan. 12","content":"DATE"},{"type":"Jan. 11","content":"DATE"},{"type":"Grayscale’s AUM","content":"ORGANIZATION"},{"type":"AUM","content":"ORGANIZATION"},{"type":"Yadav","content":"PERSON"},{"type":"The Grayscale Team","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Vanderbilt Law School","content":"ORGANIZATION"},{"type":"Seyyfart","content":"LOCATION"},{"type":"50 percent","content":"PERCENT"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"Invesco Galaxy ETF","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Bitcoin Strategy ETF","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Leah Wald","content":"PERSON"},{"type":"State Street Global Advisors","content":"ORGANIZATION"},{"type":"Valkyrie","content":"LOCATION"},{"type":"Seyffart","content":"PERSON"},{"type":"Winklevoss","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"NYSE Arca","content":"ORGANIZATION"},{"type":"$7.65 trillion","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"15.8%","content":"PERCENT"},{"type":"0.12%","content":"PERCENT"},{"type":"2013","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"70 percent","content":"PERCENT"},{"type":"$2.32 billion","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Seyyfart","content":"PERSON"},{"type":"James Seyffart","content":"PERSON"},{"type":"2004","content":"DATE"},{"type":"Yadav","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Grayscale’s Bitcoin ETF","content":"ORGANIZATION"},{"type":"US Government","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Adoption","Bitcoin ETF","United States"],"authors":["Rachel Wolfson"]}