{"summary":"Stablecoin Issuer Circle Plans US Transition for Legal Operations, Leaving Ireland Base","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/circle-plans-us-transition-legal-oprations-leaving-ireland-base.htm","publishDate":"2024-05-15T05:41:52","id":19150,"type":null,"title":"Stablecoin Issuer Circle Plans US Transition for Legal Operations, Leaving Ireland Base","category":["Altcoin News "],"content":["Stablecoin issuer Circle plans to relocate its legal base from the Republic of Ireland to the US.","Bloomberg reported on Wednesday that the company recently filed court paperwork to re-domicile. This follows Circle submitting plans for an initial public offering to the US securities regulator in January.","“The initial public offering is expected to take place after the SEC completes its review process, subject to market and other conditions,” Circle said at the time.","Choosing the US as its new home could mean Circle faces a higher tax burden, according to Bloomberg. Companies would generally do the opposite, flocking to Ireland for its business-friendly environment and low tax rate.","The country’s 12.5% rate pales in comparison to many other European nations. This makes Ireland a magnet for international firms looking to keep taxes down.","Launched in 2013, Circle has carved a niche in the crypto industry. It is best known for issuing USDC, a stablecoin tethered to the US dollar. As of May 2024, USDC boasts a market cap exceeding $32b, solidifying its place as a major player.","Circle’s core business focuses on issuing and managing USDC. Stablecoins are generally said to provide stability for transactions in the often-turbulent cryptocurrency market.","Further, Circle’s plan to go public through a traditional IPO follows a failed 2021 attempt via a special purpose acquisition company (SPAC) merger. The IPO will proceed after SEC approval, but remains subject to market conditions and other factors.","In January, Circle revealed plans to introduce USDC on the Celo network. Celo is a Layer-1 blockchain evolving into an Ethereum Layer-2 scaling network. This collaboration seeks to capitalize on Celo’s mobile-centric user community in areas with the highest blockchain adoption rates."],"entity":[{"type":"2021","content":"DATE"},{"type":"May 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Republic of Ireland","content":"LOCATION"},{"type":"12.5%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"$32b","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Ireland","content":"LOCATION"}],"hashtag":["Circle","IPO"],"authors":["Shalini Nagarajan"]}