{"summary":"Cryptocurrency exchange Kraken said it has no exposure to Alameda Research, but that it held close to 9,000 of FTX’s native token FTT. \nThe statement comes amid speculation as to which companies might be affected by the stunning collapse of FTX.","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185156\/kraken-holds-ftt-tokens-but-claims-no-exposure-to-alameda","publishDate":"2022-11-10T02:58:37","id":1915,"type":null,"title":"Kraken holds FTT tokens, but claims no exposure to Alameda","category":["Companies"],"content":["Cryptocurrency exchange Kraken said it has no exposure to Alameda Research, but that it holds around 9,000 FTT, the native token of embattled exchange FTX.&nbsp;","\"We have not listed the FTT token on our spot or futures exchanges and Kraken is not affected by the recent FTX news in any material way,\" <a href=\"https:\/\/blog.kraken.com\/post\/16139\/how-kraken-continues-to-lead-the-way-in-transparency-and-trust\/?utm_campaign=Proof+of+reserves&amp;utm_medium=social&amp;utm_source=twitter&amp;utm_term=P03\" data-v-f87c67ca=\"\">said<\/a> the company in a statement.&nbsp;","The statement comes amid rife speculation as to which companies might be affected by the stunning collapse of FTX — either by having lent it money, through equity investments, or because of money held on the exchange.","On Nov. 8, FTX revealed that it had agreed to an acquisition by rival Binance.&nbsp;Yesterday, however, that acquisition <a href=\"https:\/\/www.theblock.co\/post\/184636\/binance-backs-out-of-ftx-acquisition-deal\" data-v-f87c67ca=\"\">fell through<\/a> after Binance reviewed the FTX's financials.&nbsp;","An array of crypto heavyweights and other companies have issued statements on their exposure, or lack thereof, to FTX in the past 24 hours. Sequoia Capital said that $213.5 million in equity investments in FTX across two of its funds are <a href=\"https:\/\/www.theblock.co\/post\/185136\/sequoia-says-its-investment-in-ftx-is-now-worthless\" data-v-f87c67ca=\"\">now effectively worthless<\/a>.&nbsp;"],"hashtag":[]}