{"summary":"Manta Pacific Flips Base as Fourth Largest Layer 2 Solution as TVL Surges to $845 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/manta-pacific-flips-base-as-fourth-largest-layer-2-solution-as-tvl-surges-to-845-million.htm","publishDate":"2024-01-16T16:44:31","id":19156,"type":null,"title":"Manta Pacific Flips Base as Fourth Largest Layer 2 Solution as TVL Surges to $845 Million","category":["Blockchain News "],"content":["Manta Pacific has moved past Base to become the fourth largest layer 2 scaling solution in the market. The total value locked (TVL) of the network soared past $840 million.","Recent data from L2Beat show that Base, an Ethereum layer 2 solution backed by Coinbase, has lost its spot as the fourth largest scaling network and currently controls 3.4% of the total market share.","The TVL on Manta Pacific surged 13.62% and currently stands at $851 million. This means the network now controls 3.83% of the market share displacing Base, whose TVL stands at $756 million.","The platform, which was rolled out four months ago, is rated among the fastest-growing layer 2 networks after it moved from $10 million in TVL to over $850 million.","Manta Pacific now boasts of 180,000 daily transactions and over 570,000 wallet addresses. What’s more, the network continues its explosive growth based on the “New Paradigm Campaign” which bridges networks and projects.","","The campaign launched in December saw a massive inflow of millions as it rewarded users for porting their Ether (ETH) and USDC to the platform. This model has helped the network rise through the ranks and has been compared to a similar strategy used by Blast.","Michael Nadeau, the DeFi report threw more light on the rise of the platform and the New Paradigm Campaign on X (formerly Twitter).","Manta New Paradigm program. Running a similar playbook to Blast:","1. offering native yield on Ethereum and USDC at a rate of 4-5%. Yield comes from staking ETH and US Treasury Bonds. Deposited funds locked for 69 days.","2. Depositors get a future airdrop of the Manta token.…","— Michael Nadeau (@JustDeauIt) January 16, 2024","","According to him, the network offers 4 to 5% yield for ETH and USDC on the network by staking funds locked for 69 days.","Depositors are also entitled to future airdrops of the Manta Token boosting community engagements in addition to tokens that can be used within the ecosystem.","“NFT “Box pieces” for depositing and inviting friends. The amount depends on the deposit. For example, if you deposit 1 ETH, you’ll get 25 box pieces. Pieces can be combined into a box, and once opened, you receive an NFT. If you collect 6 pieces, they can be combined into “the first modular L2” NFT, which can be sold on the marketplace.” ","Cryptonews reported on Manta’s efforts to modular blockchains becoming the first solution to integrate Celestia’s modular data model leading to an 80% reduction in developer cost.","Kenny Lee, the co-founder of Manta Pacific told Cryptonews that New Paradigm captures a larger community’s attention adding:","“This has propelled Pacific into becoming the third-largest ecosystem with over $900 million in TVL, following Arbitrum and Optimism. With this achievement comes the responsibility to continue building momentum and delivering value to our users and developers.” ","Layer 2 solutions like Manta and Base are secondary networks built atop a blockchain relying on its infrastructure. Meanwhile, they offer scalability for faster transaction processing at lower cost. On the other hand, TVL is the total value of assets deposited across decentralized applications on the network and it is used to rank platforms by size."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"$756 million","content":"MONEY"},{"type":"US Treasury Bonds","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"3.83%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"3.4%","content":"PERCENT"},{"type":"Michael Nadeau","content":"PERSON"},{"type":"$851 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Manta Pacific","content":"LOCATION"},{"type":"Kenny Lee","content":"PERSON"},{"type":"$850 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"13.62%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Manta","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"New Paradigm","content":"ORGANIZATION"},{"type":"January 16, 2024","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"$840 million","content":"MONEY"},{"type":"Manta New Paradigm","content":"ORGANIZATION"}],"hashtag":["Base","Layer-2","Manta Pacific"],"authors":["David Pokima"]}