{"summary":"Here’s Why Ethereum Price Can Reach $5k in 2023, and Love Hate Inu Will Raise $10 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/heres-why-ethereum-price-can-reach-5k-2023-love-hate-inu-will-raise-10-million.htm","publishDate":"2023-04-15T11:40:00","id":19165,"type":null,"title":"Here’s Why Ethereum Price Can Reach $5k in 2023, and Love Hate Inu Will Raise $10 Million","category":["Altcoin News "],"content":["The primary token in the world’s largest smart contract ecosystem, Ethereum has topped $2,100 for the first time since May. Ethereum price blasted through resistance at $2,000 following a successful Shapella upgrade, previously referred to as Shanghai, on April 12.","Both Bitcoin and Ethereum have continued to surpass investor expectations since the beginning of the year and particularly after emerging stronger during the banking crisis in the United States.","Three crypto-friendly banks collapsed in March including Silvergate Bank, Signature Bank, and Silicon Valley Bank (SVB). Since then, regulators have been on a sprint to provide oversight, a situation that is troubling many crypto-based companies that are unable to find banking partners.","Ethereum price holds slightly above $2,100 on Saturday, with its uptrend mainly supported by the Shapella upgrade. A daily close above this level is required for bulls to maintain the lead relative to bearish advances.","Such a move coupled with the optimistic outlook from the Moving Average Convergence Divergence (MACD) implies that the path with the least resistance is to the upside.","Currently, all eyes are glued on resistance at $2,000 because if broken, it would propel Ethereum price to $2,400, or higher.","The hype around the beginning of a bull market is driving investors into the market in droves. Often this fear of missing out (FOMO) helps to build momentum during up-trending markets.","Ethereum price is suitably positioned to rally following its remarkable performance since the beginning of the year. This week’s spike above $2,000 confirmed the initial stages of a bull market.","Its older sibling, Bitcoin blasted above $30,000 changing the technical outlook for a potential rally to $38,000 in the coming few weeks. In addition to the momentum surrounding the Shapella upgrade, Ethereum price tends to follow in Bitcoin’s footsteps.","A massive rally in Ethereum price to $5,000 will only happen if many boxes are checked in the market in the coming months. For instance, Ether must hold the new support at $2,000 at all costs.","However, this cannot be guaranteed even with a successful Shapella upgrade, which allowed investors who staked ETH to withdraw their tokens and the rewards earned, for the first time since the network transitioned to become a proof-of-stake (PoS) protocol.","Whales must keep their bags intact if not keep demand for Ethereum rising. Another huge factor to consider is the regulatory landscape in the industry.","Europe is moving a step closer to having a clear regulatory framework with a vote on the Markets in Crypto-Assets (MiCA) expected later this month.","However, the situation in the US is still murky with no hope for a resolution in the near term. The SEC vs Ripple lawsuit summary judgment in May might provide some clarity, but maybe not.","All the same, the US approach to digital assets in 2023 could shape the market for a bull run or extend the crypto winter.","That said, Ethereum price continues to exhibit strength in the bullish camp and the move above $2,000 could mark the start of a sustainable climb to $5,000.","Buy Ethereum Now","The cryptocurrency market is watching the birth of a new ecosystem with the potential to rival both Dogecoin (DOGE) and Shiba Inu (SHIB).","For the first time in the crypto industry, community members will be rewarded for their opinions on the world’s hottest topics.","Users will be allowed to create polls on different topics, be it politics, entertainment, or social issues.","Love Hate Inu’s voting system is secure, decentralized, and cannot be manipulated thanks to a rule that requires those who wish to take part in the polls to stake LHINU tokens for a minimum of 30 days.","The more you stake and the longer your staking period, the more voting power you accumulate.","The team is keen to ensure the future of the project is not undermined by a few people in bad faith. Therefore, an anti-rug pull mechanism has been put in place.","Note that 90% of the ecosystem’s total supply is currently available to investors in the presale. The remaining 10% has been allocated for supporting token listings.","Love Hate Inu believes it is building the project on a strong foundation by distributing the majority of the tokens to community members.","So far, the best crypto presale for 2023 has raised $4.2 million – a step closer to the $10 million target.","Each LHINU token goes for $0.000115 at the moment but investors must hurry before the price ticks up to $0.000125. Love Hate Inu will list on exchanges for the first time at $0.000145.","Buy Love Hate Inu Now",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"$2,400","content":"MONEY"},{"type":"Hate Inu","content":"ORGANIZATION"},{"type":"$2,100","content":"MONEY"},{"type":"$2,000","content":"MONEY"},{"type":"$0.000115","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$38,000","content":"MONEY"},{"type":"Silicon Valley Bank (SVB","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"$4.2 million","content":"MONEY"},{"type":"$30,000","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"April 12","content":"DATE"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Hate Inu","content":"LOCATION"},{"type":"$0.000145","content":"MONEY"},{"type":"$0.000125","content":"MONEY"},{"type":"sprint","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ETH","Ethereum","Love Hate Inu"],"authors":["John Isige"]}