{"summary":"SEC Denies Coinbase Push for Crypto Regulation, Cites Own Priorities","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-denies-coinbase-push-for-crypto-regulation-cites-own-priorities.htm","publishDate":"2023-12-15T19:32:00","id":19169,"type":null,"title":"SEC Denies Coinbase Push for Crypto Regulation, Cites Own Priorities","category":["Blockchain News "],"content":["The Securities and Exchange Commission (SEC) rejected a petition by cryptocurrency exchange Coinbase on Friday requesting the creation of tailored regulations for digital assets.","In a two-page response, the SEC said that after careful consideration, the requested rulemaking was currently unwarranted and the petition by Coinbase was denied. SEC Chair Gary Gensler noted in a statement that the securities regulator already has sufficient authority under current statutes to govern crypto asset securities and police wrongdoing in the nascent industry.","This denial is a setback for Coinbase, which had formally petitioned the SEC in 2022 to develop specialized crypto regulations, distinct from conventional securities regulations. The exchange argued that shoehorning digital assets into traditional securities law would stifle innovation in the crypto sector. Coinbase then took the SEC to court to compel a response to its rulemaking petition.","","The SEC disagreed with the notion that established securities laws are unworkable for crypto asset securities, however. The regulator said it has already been proposing rules to directly regulate crypto market participants, and its enforcement arm has addressed violations effectively thus far.","According to Gensler, preserving the SEC’s discretion in setting its rulemaking priorities based on broad public interest is also an important consideration. He pointed out that a crypto broker-dealer, Prometheum, has successfully registered with the regulator by following existing laws.","The SEC’s decisive refusal to accommodate the crypto industry’s regulatory demands underscores an increasingly adversarial relationship between the watchdog and players like Coinbase. Earlier this year, the agency sued Coinbase for allegedly operating an unregistered cryptocurrency exchange.","While the SEC is flexing its regulatory muscle, crypto businesses have grown frustrated over the lack of clear crypto rules tailored to digital asset activities. This denial will further cement perceptions that the securities watchdog is stubbornly stonewalling the industry’s calls for bespoke policy.","Cryptocurrency advocates argue that an inflexible application of antiquated securities law to crypto inhibits advancements and drives activity overseas to more welcoming jurisdictions. They say the unique nature of digital assets warrants updated rules that encourage American crypto companies to grow domestically.","For now, the SEC insists on applying traditional securities laws to crypto, dashing hopes for immediate crypto regulatory clarity. The industry will likely face continued uncertainty unless lawmakers intervene to spur crypto regulation action."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Prometheum","content":"LOCATION"}],"hashtag":["Crypto Regulation"],"authors":["Trent Alan"]}