{"summary":"Wallet provider Blockchain.com’s lending desk is coming out of stealth mode\nThe unit, launched over the summer, is on track to lend out over $120 million in November","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk","publishDate":"2019-11-14T09:05:46","id":1917,"type":null,"title":"As credit concerns loom in crypto, Blockchain.com secretly builds multi-million dollar loan desk","category":["Bitcoin"],"content":["In stealth, over the past several months, Peter Smith, CEO of Blockchain.com, has been building a lending business to go head-to-head with firms like Genesis Global Trading and BlockFi.&nbsp;","Leveraging his global crypto connections and access to inventory, Smith said the business started off with the wallet provider lending out coins to other lending operations on a case-by-case basis. In August, Blockchain.com lent out $10 million in new loans. Fast forward to November, the firm is on-track to lend out $120 million this month — having lent, traded or borrow over a $1.6 billion worth of cryptocurrency. The business is emerging as market participants question whether there is a credit bubble pop looming in the nascent digital asset market. The firm estimates it is now one of the top five crypto lenders.&nbsp;","\"We don't really have a size limit,\" Smith said. \"That's probably unique and why other lending desks borrow from us.\"","As reported by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-10-29\/another-credit-bubble-grows-the-5-billion-crypto-loan-market\" data-v-f87c67ca=\"\">Bloomberg News<\/a>, the lending industry has ballooned to $5 billion out of nothing in the span a two short years, illustrating the desire for leverage in an industry where gains and losses are already intensified by break-neck volatility. Genesis Global Trading saw its cumulative originations increase from $700,000 in March 2018 to just over $3 billion today, according to the report.&nbsp;","\"What keeps me up at night is not adoption, or even regulatory uncertainty: it’s credit risk,\" Jason Urban, chief executive officer of Chicago-based Drawbridge Lending, said in an interview with Bloomberg.&nbsp;","“The torpedo below the waterline is an MF Global-Lehman Brothers type event.”","Smith is less concerned about a \"Lehman\" like blowup, at least for his firm.&nbsp;","\"Our loan desk is so heavily collateralized a Lehman moment would be impossible,\" he said in a phone interview.","Indeed, the firm believes its offering is less risky than others on the market given the fact that every loan deal is bespoke and customized to each client. As such, it's difficult for Smith to say whether borrowers are getting a better deal than if they were to opt for a rival.","\"There is no standard rate,\" he said. \"We may be cheaper than Genesis on one deal and more expensive on the next.\"","At an industry conference in New York, Michael Moro of Genesis told The Block that the firm has never had anyone default on a loan thanks to the fact that they are dealing with very credit worthy customers. In a sense, that level of caution makes the business less profitable than it could be if the firm on-boarded more riskier clients.&nbsp;","\"We are pretty selective. And I can do you one better: we never had someone late for a margin call,\" Smith said.&nbsp;","The roll-out of lending business follows the launch of Blockchain's exchange venue, The Pit, complementing its wallet business of 40 million accounts.&nbsp;"],"hashtag":[]}