{"summary":"SEC Commissioners Criticize Agency’s Crypto Enforcement Strategy Following ShapeShift Settlement","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/two-commissioners-criticize-sec-following-shapeshift-settlement.htm","publishDate":"2024-03-07T08:02:09","id":19170,"type":null,"title":"SEC Commissioners Criticize Agency’s Crypto Enforcement Strategy Following ShapeShift Settlement","category":["Blockchain News "],"content":["The U.S. Securities and Exchange Commission (SEC) Commissioners, Hester Peirce and Mark Uyeda, have publicly criticized the agency’s unclear cryptocurrency enforcement policies following a recent settlement with ShapeShift.","In a detailed statement published on March 5, Peirce and Uyeda highlighted the ShapeShift case as emblematic of broader issues within the SEC’s handling of digital assets.","“The Commission’s enforcement action against ShapeShift is the latest installment in the serial drama of the Commission’s poorly conceived crypto policy,” said the commissioners.","The SEC recently concluded its proceedings against the crypto platform ShapeShift by accepting a $275,000 settlement. This agreement followed charges that ShapeShift had offered unregistered securities to its customers.","Operating from Denver, Colorado, ShapeShift listed at least 79 crypto assets. Some were deemed unregistered securities by the SEC, using the Howey Test as the benchmark for determination.","Under the terms of the settlement, ShapeShift must pay the civil penalty within two weeks from the order’s issuance. Additionally, the company agreed to a cease-and-desist order, halting any future violations.","“The Securities Exchange Act defines a dealer as ‘any person engaged in the business of buying and selling securities . . . for such person’s own account through a broker or otherwise,’” the statement reads.","“ShapeShift meets this definition, according to the Commission, because ‘[t]he crypto assets offered by ShapeShift included those that were offered and sold as investment contracts and, therefore, securities,’” the statement explained.","However, the commissioners claimed the SEC did not specify which of the 79 crypto assets traded by ShapeShift were considered investment contracts, nor did it offer any rationale for its determination.","Peirce and Uyeda argued that ShapeShift faces repercussions despite the significant time elapsed since its inception and business model shift, with the SEC alleging violations involving an unspecified subset of these assets as investment contracts, without providing clarity on its reasoning.","According to the statement, the SEC did not even allege any harm caused by ShapeShift, as both the platform and customers voluntarily transacted.","“The standards are so opaque and arbitrary that the Commission itself is unwilling to stand by its own analysis,” said the commissioners. “The environment we have created for the crypto asset markets, especially as it relates to secondary trading, is untenable.”","“Cases like this do not protect investors; they intimidate innovators and entrepreneurs. We respectfully dissent,” Peirce and Uyeda concluded."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"Commission","content":"ORGANIZATION"},{"type":"ShapeShift","content":"ORGANIZATION"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Uyeda","content":"PERSON"},{"type":"Denver","content":"LOCATION"},{"type":"March 5","content":"DATE"},{"type":"Colorado","content":"LOCATION"},{"type":"$275,000","content":"MONEY"}],"hashtag":["SEC","United States"],"authors":["Hongji Feng"]}