{"summary":"Nigeria Detains Two Binance Execs Amid Exchange Probe","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigeria-detains-binance-executives-crypto-exchange-probe.htm","publishDate":"2024-02-29T07:04:12","id":19177,"type":null,"title":"Nigeria Detains Two Binance Execs Amid Exchange Probe","category":["News "],"content":["Authorities in Nigeria have detained two senior Binance executives and confiscated their passports as the country cracks down on crypto exchanges.","The Financial Times reported Wednesday that the two executives traveled to Nigeria after the country decided to prohibit multiple crypto websites. However, upon their arrival, the office of Nigeria’s national security adviser reportedly apprehended them. It is currently unclear who the executives are.","Last week, Nigeria’s telecommunications regulator instructed telecom firms to block access to websites like Binance, Coinbase, and OctaFX. This measure was intended to curb crypto speculation activities within the country, local media reported.","It appears the crackdown is aimed at preventing cryptocurrencies from exacerbating currency instability. The efforts come particularly as the Nigerian naira experiences frequent declines against the US dollar.","Bayo Onanuga, a special adviser to President Bola Tinubu, recently said: “We were told that, if we don’t clamp down on Binance, it will destroy the economy of this country.”","Binance didn’t return Cryptonews’ request for comment by press time.","After their detention, Binance reportedly suspended trading of the naira against bitcoin and tether digital coins on its platform.","Separately, during a press conference on Tuesday, Nigeria’s central bank governor, Olayemi Cardoso, singled out Binance as he addressed funds moving through crypto exchanges. He expressed the bank’s concern about “suspicious” flows passing through various crypto platforms.","“In the last one year alone, $26bn has passed through Binance Nigeria from sources and users who we cannot adequately identify,” he told reporters.","Various authorities are reportedly collaborating on an investigation into crypto exchanges. These include Nigeria’s anti-corruption agency, police, and national security adviser. They have requested a list of all Nigerian-based Binance users since the exchange’s establishment.","According to ConsenSys, Nigeria was the most aware nation in crypto-related matters last year. The African country even surpassed the US and European countries. The data revealed that 99% of Nigerians were fully aware of cryptocurrencies. 70% were found to possess an understanding of the value, functioning, and basics of blockchain technology.","The statistics came despite the Central Government of Nigeria banning digital asset ownership in 2021 due to concerns about investor protection. The previous administration also issued strong statements regarding the market before introducing its Central Bank Digital Currency (CBDC), the e-naira."],"entity":[{"type":"$26bn","content":"MONEY"},{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"Central Government","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Bayo Onanuga","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"99%","content":"PERCENT"},{"type":"Bola Tinubu","content":"PERSON"},{"type":"Binance Nigeria","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"last one year","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"}],"hashtag":["Binance","Nigeria"],"authors":["Shalini Nagarajan"]}