{"summary":"Crypto Exchanges Reported Over 16,000 Flagged Transactions to South Korean Authorities","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchanges-reported-over-16000-flagged-transactions-to-south-korean-authorities.htm","publishDate":"2024-02-14T15:44:11","id":19175,"type":null,"title":"Crypto Exchanges Reported Over 16,000 Flagged Transactions to South Korean Authorities","category":["Blockchain News "],"content":["South Korean crypto exchanges reported over 16,000 transactions to local authorities in 2023, an increase from previous years.","The Financial Intelligence Unit (FIU) released a breakdown of its efforts to tackle money laundering and other illegal financial threats involving crypto assets.","The FIU’s plan for 2024 highlights four main areas, including inspection of financial firms and internal anti-money laundering measures.","The roadmap also focuses on user protection among digital asset business operators and an established AML system deployed by authorities in line with foreign standards.","“FIU is largely concentrating its financial information analysis capabilities in the following three directions to strengthen its role in detecting and notifying law enforcement agencies of crimes that violate the public’s livelihood, such as virtual asset abuse crimes and illegal private financing, and as a result, related suspicious transaction reports in 2023.”","The financial regulator is encouraging crypto exchanges and other platforms to report suspicious activities, as data shows an uptick in the number of incidents last year.","In 2023, the number of suspicious transaction reports (STRs) by crypto assets companies soared by 49% from the previous year. The proportion of total STR also grew from 1.2% to 1.7% within the same timeframe.","While total STR stood at 906,000, up from 822,644 the previous year, crypto asset cases were 16,076, up from 10,797 in 2022.","“Intensive analysis of virtual asset transactions was conducted and the analysis system was advanced. As a result, the number of cases notified to law enforcement agencies of suspected crimes related to virtual assets increased by approximately 90% * compared to the previous year.”","The milestones recorded so far come on the heels of efforts by the unit to bridge the gap between all stakeholders in Web3 activities.","According to the statement, the regulator strengthened communication channels with crypto-related companies. Best practices for flagging and forwarding suspected transactions were also enforced at various levels.","Furthermore, the FIU unveiled a 9-person workforce for analysis and expert gathering on flagged crypto transactions.","In recent months, South Korea has taken several steps to curb the rate of cryptocurrency scams, citing investor protection efforts.","🇰🇷 South Korea Plans to Block Unlicensed Crypto Exchanges","Learn more 👇","— Cryptonews.com (@cryptonews) February 12, 2024","","Following the collapse of Terra’s stablecoin and the implosion of FTX, regulators in the country have placed stringent restrictions on both crypto firms and private traders.","On Feb 7, the Financial Service Commission (FSC) disclosed a new law against illegal trading and market manipulation by private traders. Users who make an excess of $3.8 million risk facing life sentences.","The Virtual Asset User Protection Act will come into force on July 19, 2024, adding to the country’s regulations.","Authorities also rolled out regulations on crypto exchange executives asking them to register with the FSC before assuming the position."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"Block Unlicensed Crypto Exchanges","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1.7%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"February 12, 2024","content":"DATE"},{"type":"1.2%","content":"PERCENT"},{"type":"Financial Intelligence Unit (FIU","content":"ORGANIZATION"},{"type":"July 19, 2024","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$3.8 million","content":"MONEY"},{"type":"FSC","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"FIU","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"the Financial Service Commission (FSC","content":"ORGANIZATION"}],"hashtag":["CRYPTO","Illegal Transactions","South Korea"],"authors":["David Pokima"]}