{"summary":"Crypto Exchange Patricia’s CEO Denies Closure Rumors – Here’s The Latest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-patricias-ceo-denies-closure-rumors-heres-the-latest.htm","publishDate":"2024-05-02T10:30:30","id":19188,"type":null,"title":"Crypto Exchange Patricia’s CEO Denies Closure Rumors – Here’s The Latest","category":["Blockchain News "],"content":["Patricia Exchange’s CEO Fejiro Hanu, has refuted rumors of the exchange’s closure, dismissing them as media sensationalism aimed at generating clicks. Patricia Exchange is the first platform to offer crypto exchange services in Nigeria. Hanu said,","“I am done speaking to these fake outlets. I will speak directly to Patricia users, the very few decent reporters, and on my platforms.” ","Despite facing scrutiny after a hacking incident in May 2023, Hanu assured users in a Twitter post that Patricia is still operational. ","","A thread:","Something I want to point out is, most reporters, media houses, blogs, twitter influencers do not care about the truth.","Why? Your eyeballs, your clicks, your views — that’s the prize.","— Hanu (@Fejizzy) May 1, 2024","","Patricia’s CEO criticized media outlets for distorting the narrative and emphasized that the exchange remains committed to integrity and customer trust.","Time and time again, I have shared information, poured my heart out to these media houses. But guess what?","They turn it around to fit their own narrative, to farm your views.","Why do you think billionaires invest heavily in media companies?","— Hanu (@Fejizzy) May 1, 2024","","In response to challenges accessing customer funds since April 2023, Patricia converted the value of assets into its native Patricia Token (PTK) in October 2023, ensuring future repayment. Hanu clarified that PTK represents debt and is not an on-chain token. Patricia pledged to reimburse holders with 1 Tether (USDT) token for each Patricia token. With these, Patricia demonstrates its commitment to asset recovery after the security breach.","Hanu updated users on Patricia’s status, mentioning ongoing efforts by Nigerian security services to address the situation. In November 2023, an arrest was made in connection with the crypto wallet heist. Politician Wilfred Bonse was apprehended for allegedly stealing over 200 million Nigerian Naira ($246,153) from Patricia Technologies’ wallet. ","HERE IS ONE TRUTH!","Governorship candidate Wilfred Bonse and his cohorts were arrested in association to the hack, and we are currently awaiting prosecution.","Imagine if he had become governor — how easy would it have been to arrest him? who would have even believed my story?… pic.twitter.com\/y7x3gbTbGA","— Hanu (@Fejizzy) May 1, 2024","","The case includes charges of criminal conspiracy, unauthorized alteration of computer systems, and illicit fund diversion, underscoring Patricia’s determination to pursue justice for affected users.","Notably, Patricia announced in January its plans to reimburse its customers within two to five years, citing “expectation management purposes.” Despite claims of repaying 24% of customers, reports suggest that many have yet to receive any payment, with some having been unable to access their funds for over a year before the hacking incident.","The announcement of a repayment plan adds to the frustration of customers who have already endured lengthy delays in accessing their funds. For those affected before the hack, the total waiting period could extend to three to six years. This further exacerbates concerns over the uncertainty of when they will regain access to their assets.","Despite previous indications that investors were prepared to assist Patricia in fulfilling its repayment obligations, new sources suggest the company never secured investor support. Reports of layoffs in 2023 raise questions about the company’s financial health. Conflicting statements regarding the reasons behind the layoffs add to the uncertainty surrounding Patricia’s operations.","However, recent police investigations into the hacking incident and the upcoming trial of arrested suspects starting in June 2024 offer some hope of progress.","Notably, Patricia announced last year that it was undergoing a significant debt restructuring effort. The introduced Patricia Tokens (PTK) allow customers to convert owed funds into Patricia shares.","CEO Fejiro Hanu confirmed that this move is part of the company’s fundraising and debt reorganization strategy. The strategy offers users the option to convert their debt tokens to shares at a discount. A third-party provider licensed by the Nigerian Securities and Exchange Commission (SEC) will manage this.","However, not all customers are satisfied with this approach. Some have expressed frustration through social media posts and visits to the company’s office, demanding the release of their funds. "],"entity":[{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Patricia Exchange","content":"ORGANIZATION"},{"type":"May 1, 2024","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"Patricia Token","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Patricia’s","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"200 million Nigerian Naira","content":"MONEY"},{"type":"Wilfred Bonse","content":"PERSON"},{"type":"Patricia","content":"LOCATION"},{"type":"PTK","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Patricia Tokens","content":"PERSON"},{"type":"Hanu","content":"LOCATION"},{"type":"Patricia","content":"PERSON"},{"type":"Patricia Technologies","content":"ORGANIZATION"},{"type":"Fejiro Hanu","content":"PERSON"},{"type":"24%","content":"PERCENT"},{"type":"Nigeria","content":"LOCATION"},{"type":"$246,153","content":"MONEY"},{"type":"Nigerian Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"June 2024","content":"DATE"}],"hashtag":["Nigeria","Patricia"],"authors":["Hassan Shittu"]}