{"summary":"Web3 Messaging Platform beoble Gets Backing from Animoca Brands to Scale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-soicial-media-platform-beoble-gets-backing-from-animoca-brands.htm","publishDate":"2024-03-07T12:00:51","id":19181,"type":null,"title":"Web3 Messaging Platform beoble Gets Backing from Animoca Brands to Scale","category":["Altcoin News "],"content":["Web3 messaging and social platform beoble has secured a strategic investment from Animoca Brands, a gaming and metaverse-focused venture capital firm.","The investment aims to support beoble’s mission of becoming a leading global Web3 social platform by leveraging blockchain technology to enhance user interaction, privacy, and security, the company said in a press release shared with Cryptonews.com. ","With this partnership, beoble will have the opportunity to offer its advanced Web3 chat features to selected companies and projects within Animoca Brands’ extensive portfolio of Web3 investments.","“We’re excited to have Animoca Brands’ backing, as it is a testament to its support of our vision and capabilities,” Sung Min Cho, CEO of beoble, said. ","“This strategic investment empowers us to scale and grow our platform and enables us to drive greater communication and collaboration opportunities for Animoca Brands’ portfolio companies.”","beoble offers secure and decentralized wallet-to-wallet messaging, token-gated chatrooms, and unique earning features. ","The funding from Animoca Brands will be utilized to expedite the platform’s development and expand its range of features, enabling beoble to grow its user base worldwide. ","Collaboratively, beoble and Animoca Brands will work towards offering beoble’s chat features to relevant companies and projects within Animoca Brands’ portfolio, fostering enhanced community engagement and interactivity across the Web3 ecosystem.","“Our investment in beoble reflects our confidence in the ability of its team and technology to drive advances in how people interact digitally,” Yat Siu, the executive chairman and co-founder of Animoca Brands, commented.","“The integration of beoble’s chat features can foster more vibrant and engaged communities, aligning with the vision of a more enriched social experience in an interconnected, interactive Web3 ecosystem.”","Last month, beoble closed its seed funding round, bringing in a total of $7 million from a number of major investors including Hashkey, Samsung, DCG, DWF Ventures, Nomura Laser Digital, Cypher Capital, and Blockchain Founders Fund.","The landscape of Web3 social media platforms is evolving rapidly, offering more decentralized, user-controlled alternatives to traditional social media. ","These platforms leverage blockchain technology, NFTs, and cryptocurrency to empower content creators and enhance user experiences by providing more security, flexibility, and new revenue streams. ","One such platform is Odysee, a decentralized content sharing and publishing platform that rivals YouTube by offering a secure environment for content monetization. ","It allows creators to upload content simultaneously on both YouTube and Odysee through a YouTube Sync function.","Likewise, Nostr is a decentralized networking protocol that resembles Twitter’s architecture but is customizable for various social media experiences. ","It supports encrypted direct messaging and lets users create self-governed accounts and identities​​. ","Nostr has grown significantly, boasting over 524,000 profiles with bio attached and more than 30,000 daily new users as of early February​.","Mirror is another well-known Web3 social media platform. ","It is a publishing platform for writers that uses Ethereum for logging in, minting posts as NFTs, and creating new revenue streams. ","Content published on Mirror is stored permanently on the Arweave network.​"],"entity":[{"type":"” Yat Siu","content":"PERSON"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Odysee","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Sung Min Cho","content":"PERSON"},{"type":"$7 million","content":"MONEY"},{"type":"Nostr","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Nomura Laser Digital","content":"ORGANIZATION"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"Odysee","content":"LOCATION"}],"hashtag":["Social media","Web3"],"authors":["Ruholamin Haqshanas"]}