{"summary":"Nigeria to Delist Naira From Crypto P2P Space to Curb Manipulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigeria-to-delist-naira-from-crypto-p2p-space-to-curb-manipulation.htm","publishDate":"2024-05-07T12:02:11","id":19180,"type":null,"title":"Nigeria to Delist Naira From Crypto P2P Space to Curb Manipulation","category":["Altcoin News "],"content":["The Federal Government of Nigeria, through the country’s regulator, is considering to delist the naira from all peer-to-peer (P2P) platforms.","The move would be rolled out “in the coming days,” says Nigeria’s SEC Director General Emomotimi Agama. According to a Bloomberg report on Tuesday, the new rules will cover crypto exchanges and custodians.","“The thing that needs to be done is delisting the naira from the P2P space in order to avoid the level of manipulation that is currently happening,” Agama noted.","Agama disclosed the plans during a meeting with the Nigerian Blockchain Industry on Monday. Some market players have been manipulating the value of naira and as a result, the regulator is “seeking collaboration and help in making sure that the crypto environment is respected globally.”","In 2021, the Central Bank of Nigeria restricted banks and other financial institutions from operating accounts for crypto service providers. However, in December 2023, the country’s SEC lifted the ban and announced the reversal of the policy.","In February 2024, concerns surfaced over the activities of the largest crypto exchange Binance, removing naira from its P2P platform. The removal came amid claims by Nigerian authorities that the platform contributed to its devaluation.","Agama expressed concerns over manipulation and all forms of activities that undermine naira noting it as “unacceptable.”","“Recent concerns regarding crypto P2P traders and their perceived impact on the exchange rate of the naira has underscored the need for collective action.”","The warning comes after the nation banned Binance following accusations from Central bank Governor Olayemi Cardoso of allowing illicit transactions.","“We ask that those involved in sharp practices that undermine national interest should cease and desist,” Agama added.","Last month, the Central Bank of Nigeria directed fintech firms including Moniepoint and OPay to restrict new account openings in a move to combat fraud."],"entity":[{"type":"Nigerian Blockchain Industry","content":"ORGANIZATION"},{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"SEC Director General Emomotimi Agama","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Federal Government","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Central Bank of Nigeria","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"December 2023","content":"DATE"}],"hashtag":["Naira","Nigeria","P2P"],"authors":["Sujha Sundararajan"]}