{"summary":"Ethereum Founder Vitalik Buterin Concerned About Elon Musk’s Twitter Plan","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-founder-vitalik-buterin-concerned-about-elon-musks-twitter-plan.htm","publishDate":"2022-11-02T14:15:00","id":19187,"type":null,"title":"Ethereum Founder Vitalik Buterin Concerned About Elon Musk’s Twitter Plan","category":["Ethereum News "],"content":["Ethereum (ETH) co-founder Vitalik Buterin has shared on Twitter his concerns over Tesla and Twitter chief Elon Musk‘s blue check system but said that there might be a solution.","On November 1, Musk announced the blue Twitter verification tick would cost $8 a month. “Twitter’s current lords & peasants system for who has or doesn’t have a blue checkmark is bullshit,” he tweeted. ","To all complainers, please continue complaining, but it will cost $8","Buterin, however, commented on this announcement, specifically about the potential for scams. How well this new system would work depends on “exactly how much due diligence is done” to ensure that those behind the blue checkmarks are indeed who they claim to be, he said in a tweet. ","That said, there is a ‘but’. Buterin followed his statement up with:","“”Pay $8\/month and call yourself whatever” would damage the blue check’s anti-scam role. But if there’s more actual verification, the result is very different.”","And while quite a few people suggested in the comments that paying $8 for the famed verified badge would be worth it for any scammer if that means gaining people’s trust and being able to earn a lot more than the ‘invested’ $8 – others, similarly to Buterin, argued that this could be avoided with more verification.","This is a great point. If there is more actual verification done to make sure blue checks are who they say they are, then the result will be very different.","Yet, it is somewhat ironic that crypto supporters and possibly decentralization advocates would argue for more know-your-customer (KYC)-type measures. ","“Power to the people” Blue for $8\/month,” said the new Twitter chief yesterday upon announcing the news. ","You will also get:\n– Priority in replies, mentions & search, which is essential to defeat spam\/scam\n– Ability to post long video & audio\n– Half as many ads","But many people argued that it is not entirely clear how power will be given to those who cannot afford the monthly fee. ","I got my blue checkmark to stop clone accounts from scamming children, so now I’d have to pay to protect my followers myself? I feel liberated already","Buterin, however, disagreed, saying that the current system is “*far* more exclusive than even the $20\/month level from yesterday.” ","He does not see it as creating any sort of an “economic hierarchy.” Buterin added, however, that,","“Ideally, though, verification would be charged at-cost and separate from other premium services.”","Yes, this will destroy the bots. If a paid Blue account engages in spam\/scam, that account will be suspended.\n\nEssentially, this raises the cost of crime on Twitter by several orders of magnitude."," "," "],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"Musk","content":"ORGANIZATION"},{"type":"$8","content":"MONEY"},{"type":"Tesla","content":"LOCATION"},{"type":"November 1","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Buterin","content":"LOCATION"}],"hashtag":["Community","Elon Musk","Fraud","Scam","Twitter","Vitalik Buterin"],"authors":["Sead Fadilpašić"]}