{"summary":"Two US Senators Ask SEC to Deliver Report to Congress on Breach of X Account","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/two-us-senators-ask-sec-to-deliver-report-to-congress-on-breach-of-x-account.htm","publishDate":"2024-01-10T07:02:58","id":19190,"type":null,"title":"Two US Senators Ask SEC to Deliver Report to Congress on Breach of X Account","category":["Altcoin News "],"content":["Two United States senators, J.D. Vance and Thom Tillis, have raised concerns about the recent breach of the United States Securities and Exchange Commission’s (SEC) X (formerly Twitter) account. ","In a letter addressed to SEC Chair Gary Gensler on the same day as the incident, the senators called for a report to be delivered to Congress regarding the breach, emphasizing the need to evaluate the commission’s internal cybersecurity procedures.","Describing the breach as a matter of serious concern, Vance and Tillis emphasized that it contradicts the SEC’s core mission of protecting investors, maintaining fair markets, and facilitating capital formation. ","🚨BREAKING: Senators @JDVance1 & @SenThomTillis Demand Explanation For The SEC's Errant Announcement Of The Approval Of Spot-Bitcoin ETFs","\"It is unacceptable that the agency entrusted with regulating the epicenter of the world’s capital markets would make such a colossal error.\" pic.twitter.com\/xG77jM9xAM","— Senator Vance Press Office (@SenVancePress) January 10, 2024","","The senators expressed their worry about the widespread confusion caused by the hack and referred to a recently finalized rulemaking on cybersecurity disclosures, urging the SEC to provide Congress with a comprehensive report on the incident.","The letter, dated January 9, set a deadline of January 23 for the report. ","Additionally, the senators reminded the SEC of the mandate requiring businesses to disclose the impact of cybersecurity incidents within four days, posing a question to the commission about the possibility of providing a report to Congress within that timeframe if the breach was indeed a result of a cyberattack.","The breach occurred on January 9, when the SEC’s X account shared a false tweet suggesting the approval of spot Bitcoin (BTC) exchange-traded funds (ETFs) in the United States. ","However, the excitement in the crypto community was short-lived as Chair Gary Gensler quickly revealed that the SEC’s X account had been compromised, and the tweet was unauthorized.","The incident not only caused confusion among investors and markets but also highlighted the SEC’s vulnerability to cyberattacks and online threats. ","An internal investigation conducted by X confirmed that the SEC account did not have two-factor authentication enabled at the time of the breach.","We can confirm that the account @SECGov was compromised and we have completed a preliminary investigation. Based on our investigation, the compromise was not due to any breach of X’s systems, but rather due to an unidentified individual obtaining control over a phone number…","— Safety (@Safety) January 10, 2024","","The report stated that the compromise was not a result of any breach of X’s systems but rather an individual gaining control over a phone number associated with the @SECGov account through a third party.","Various government officials, including Senators Cynthia Lummis and Bill Hagerty, as well as Representative Ann Wagner, echoed the concerns raised by their fellow members of Congress. ","Hagerty demanded full disclosure about the incident, while Lummis emphasized the risks associated with fraudulent announcements and called for clarity on incidents that can manipulate markets.","The SEC is expected to finally approve a batch of ETFs on late Wednesday.","Executives from some ETF issuers, speaking on condition of anonymity, told Reuters they were startled and surprised by the initial tweet.","One executive said he was “concerned” that the SEC might delay or withhold approval for spot bitcoin ETFs as a result of the hack.","Two issuers, speaking on condition of anonymity, said it was not immediately clear whether the hack would impact the timeline for approvals of the spot bitcoin ETFs. "],"entity":[{"type":"Bill Hagerty","content":"PERSON"},{"type":"January 10, 2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Tillis","content":"PERSON"},{"type":"Ann Wagner","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"J.D. Vance","content":"PERSON"},{"type":"January 9","content":"DATE"},{"type":"January 23","content":"DATE"},{"type":"Senator Vance Press Office","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"late Wednesday","content":"DATE"},{"type":"Vance","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Thom Tillis","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"United States","content":"LOCATION"}],"hashtag":["Securities and Exchange Commission","Spot ETFs","Twitter"],"authors":["Ruholamin Haqshanas"]}