{"summary":"Solana March 2024 Recap: SOL Price Analysis and Ecosystem Review","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-march-2024-sol-price-analysis-and-ecosystem-review.htm","publishDate":"2024-04-04T15:59:09","id":19197,"type":null,"title":"Solana March 2024 Recap: SOL Price Analysis and Ecosystem Review","category":["Altcoin News "],"content":["In this report, we offer a complete Solana ecosystem analysis and SOL price action overview for March 2024, with a particular focus on the reasons for SOL’s meteoric price hike and the rise of meme coin trading on the blockchain.","","","Solana is an open-source blockchain platform founded in 2017 that emphasizes scalability and speed. With its unique Layer 1 network architecture, it processes over 710,000 transactions per second, enabling the creation of smart contracts and decentralized applications (DApps) for various use cases, such as decentralized finance (DeFi) and non-fungible tokens (NFTs) marketplaces. Unlike Ethereum, Solana does not require additional scaling solutions, relying on powerful computers for network maintenance and data storage. Its native cryptocurrency, SOL, is essential for transactions and network security through staking.","On March 18, the market capitalization of Solana cryptocurrency surged to an all-time high of $92.5 billion, surpassing its previous peak of around $77.9 billion recorded in November 2021. On March 21, the Solana network also updated its record for the daily number of new addresses on the blockchain. The number of daily new addresses reached 1.61 million.","Solana’s daily active addresses reached 2.4 million, outperforming all other chains — a new high for Solana since June 2021.","Solana’s daily transaction volume fluctuated during the month, rising slightly from 27.9 million on March 1 to 29.1 million on March 28. During the last two days of the month, this number dropped to 23.3 million.","Solana’s total value locked (TVL) reached $4.9 billion in March, representing a 96% increase compared to February 2024.","SOL is the native cryptocurrency fueling the Solana ecosystem, used for transaction fees and staking to secure the network, with its value influenced by the ecosystem’s growth and market dynamics.","While the crypto markets experienced a bit of a pullback, the SOL price continued to rise throughout March. Starting at $135 on March 1, SOL’s price quickly approached $205 on March 28 — for the first time since December 2021 — and closed the month at nearly $200.","Solana’s meme coin mania also pushed on-chain volumes and fees to new highs. Volume on Solana exceeded $3.79 billion on March 15. On March 16, Solana’s total trading volume soared past Ethereum, reaching $3.52 billion and beating out the daily volume on the Ethereum network by more than $1.1 billion, per DefiLlama.","Total fees on Solana were also at new all-time highs. The total transaction fees paid on Solana on March 18 amounted to $4.9 million — the vast majority of which was non-vote priority fees.","Moreover, since March 9, Solana has overtaken Ethereum to become the number one blockchain for stablecoin transfer volume. Data from blockchain analytics platform Artemis showed that Solana’s stablecoin transfer volume reached a new high of $112.9 billion on March 28, surpassing the Ethereum network, which reported only $17.6 billion. ","Not surprisingly, Solana was searched for more globally than ever before, according to Google data. Google Trends’ weekly tracker of a keyword’s popularity shows that global interest in Solana hit a five-year high of 100 on March 10 and 16, surpassing the previous peak in the last week of December 2023.","According to CoinGecko Research, Solana has also been declared the most popular blockchain so far in 2024, accounting for 49.3% of global crypto investor interest in chain-specific narratives.","","The estate of bankrupt cryptocurrency exchange FTX will sell its remaining 41 million Solana, worth $7.7 billion at the time of publication, to institutional investors for around $60, while the current SOL market price is around $188. Neptune Digital announced the acquisition of 26,964 SOL at $64 per token, with 20% to be unlocked in March 2025 and the remainder on a monthly basis until 2028.","Among other institutional investors is also Pantera Capital, a major crypto hedge fund with $5.2 billion in assets under management, which is seeking to raise funds for the potential acquisition of SOL from FTX, according to a March 7 Bloomberg report. Bloomberg reports that FTX holds around 41.1 million SOL tokens, accounting for 10% of the total Solana circulating supply and valued at approximately $5.4 billion. The potential sale of these tokens could provide vital funds for compensating investors affected by the exchange’s bankruptcy.","Coca-Cola HBC, a key partner of the Coca-Cola Company, partnered with Solana-based platform ALL.ART to implement blockchain-based employee certification. Students or trainees will be required to digitally sign the certificate themselves, creating a permanent aspect of the NFT’s metadata and enhancing security and authenticity.","Institutional staking services provider Figment Europe and Apex Group are preparing to launch Solana (SOL) staking exchange-traded products (ETPs) on the SIX Swiss Exchange via Issuance.Swiss AG. This product, Figment Solana Plus Staking Rewards (SOLF), will be tailored to provide institutions with easy access to staking rewards through traditional brokers or banks within a familiar ETP framework.","A new virtual smartphone app, Aphone, was launched on Solana’s blockchain and Aethir’s decentralized cloud infrastructure, targeting people with older hardware and those in developing countries. Aphone allows users to interact with resource-intensive apps and games, regardless of their device’s capabilities, and aims to provide access to Web3 concepts and applications to a wider audience. ","APhone’s Features 🌐","Ready to ditch the data giants? Experience the first decentralized cloud smartphone!","With APhone, enjoy:","💚Decentralized Cloud by @AethirCloud\n💚 Web3 DApp Store\n💚 Multiple Accounts\n💚 Super VPN\n💚 Airdrop Farming Portal\n💚 State-of-the-art Specs pic.twitter.com\/CRV8lZl76k","— APhone (@aphonelabs) March 30, 2024","","The Ethereum-based gaming project Killabears revealed its plan to transition to the Solana blockchain on March 20. This event is important for Solana, as it signifies Killabears as the first major gaming project to commence a migration from Ethereum.","","Solana ecosystem coins are digital assets that operate on the Solana blockchain, which is known for its high throughput and low transaction costs. These coins can represent a wide range of applications and services, including decentralized finance (DeFi) platforms, non-fungible tokens (NFTs), and other blockchain-based projects, all leveraging Solana’s fast and efficient network infrastructure. There is also significant interest in Solana meme coins.","Solana’s meme coins have been in a frenzy as part of the recent crypto bull run.","Slerf (SLERF), the meme coin of the Solana-based NFT community Bozo Collective, saw a surge despite a major pre-launch glitch on March 18. After a $10.8 million SOL pre-sale, a glitch resulted in the liquidity pool (LP) and 50% of the token supply being burned.","This sparked controversy, but the reduced supply fueled a buying frenzy that pushed SLERF to $1.28 and a market cap of $500 million within three hours. MEXC, CoinEx, and Bitget quickly listed SLERF. The developer admitted the LP burn was a mistake and went on X to address 10,000 listeners. Despite the debate, SLERF’s early performance broke records and boosted Solana’s DEX volume.","Dogwifhat (WIF), a dog-themed meme coin, became the third-largest meme coin by market capitalization on March 29, surpassing Pepe (PEPE). The WIF price skyrocketed to an all-time high of $4,8 on March 31 as meme coin fans raised over $700,000 to advertise the token’s logo on the Las Vegas sphere. Major exchanges such as Binance and Robinhood Europe listed WIF, which also pushed up its price.","Jeo Boden (BODEN), a Solana meme coin parody of U.S. President Joe Biden launched on March 9, also hit its new record, surpassing $325 million in market cap on March 28.","On March 18, the Milady NFT collection joined the meme coin craze as well and released the Solana-based meme coin, Milady Wif Hat (LADYF), named after the popular Solana meme coin Dogwifhat (WIF). The meme coin attracted 91,486 SOL ($18.6 million) within two hours of its pre-sale announcement.","Similarly, a pseudonymous art producer (@darkfarms on X) launched a new Solana meme coin, Book of Memes (BOME), on March 14 through a rapid 24-hour presale that garnered over 10,000 SOL. This event created an immediate buzz, prompting centralized exchanges such as Bingx, MEXC, Poloniex, and HTX to quickly list BOME, soon followed by Kucoin, Binance, and Bybit. Within just 36 hours, the market capitalization of this meme coin skyrocketed to $1.4 billion.","Another meme coin SMOG has also been making waves and is positioned to soar onto centralized exchanges (CEX) in the near future. Despite its recent retracement to $0.20 on March 31st from fleeting highs of $0.36 on March 8th, SMOG experienced a remarkable uptrend, reflecting a 233% increase over the last month. ","The meme coin frenzy helped Solana-based decentralized exchanges (DEX) top the charts in trading volume.","On March 27, Solana’s decentralized exchange (DEX) Jupiter allocated $10 million in USDC and $100 million in its native JUP token to launch its Jupiter DAO. The allocation is intended to provide the DAO with the resources to support ideas using USDC and to adjust the JUP allocation for long-term incentive alignment with JUP contributors. ","Jupiter DAO also introduced a new voting system that changes the dynamics of community engagement and decision-making within the ecosystem. By locking JUP tokens, users gain voting power and can actively participate in the governance process. This system is designed to provide equal treatment to all participants, regardless of the amount of JUP tokens they lock.","Catdets, It’s TIME TO VOTE!","We have a fun genesis vote for you to get familiar with the platform. Head over to https:\/\/t.co\/j63st12ogA, lock some JUP, and try it out!","All votes (including the genesis vote) will receive incentives, which includes launchpad fees from the JUP and… pic.twitter.com\/1sj3QIeu5G","— Jupiter 🪐 (@JupiterExchange) March 5, 2024","","The price of Jupiter’s native token, JUP, has skyrocketed with the formation of the JUP DAO and the introduction of ASR. The token has reached an all-time high of $1.6 and is up 220% since. The market cap of JUP has also surpassed $1.6 billion.","In March, Solana’s DeFi ecosystem was also enhanced with the introduction of Circle’s Cross-Chain Transfer Protocol (CCTP), which is now operational on Solana’s main net. This means that Solana developers can now natively exchange USDC tokens from Ethereum and other EVM-compatible ecosystems, including Arbitrum, Avalanche, Base, Optimism, and Polygon. It will also be compatible with non-EVM blockchains. Solana ecosystem players such as Jupiter Exchange, Allbridge, Drift Protocol, Solend, Wormhole, and others have already integrated support for CCTP. ","1\/ @Circle’s Cross-Chain Transfer Protocol is now live on Solana!","Fast, frictionless flows of USDC to Solana from 8 blockchain networks across 56 unique routes are now possible 🔥","All you need to know about #CCTP👇🧵 https:\/\/t.co\/3InoRf83H8","— Solana (@solana) March 26, 2024","","IO Research, creator of the Solana-based decentralized physical infrastructure network (DePIN) Io.net, raised $30 million at a $1 billion valuation. Since the launch of the platform and the Ignition program, Io.net has experienced massive growth, with the total number of workers providing graphics processing unit (GPU) power exceeding 120K. ","BREAKING: https:\/\/t.co\/WLXlHkvE4z has raised $30M to build the largest decentralized GPU network in the world and solve the AI compute shortage.","The Series A round was led by Hack VC with participation from Multicoin Capital, 6th Man Ventures, M13, Delphi Digital, Solana Labs,…","— io.net (@ionet) March 5, 2024","","Zeta Markets, the derivatives DEX on Solana, officially confirmed the Z Airdrop and eligibility details. The event will take place in April and will reward early adopters and dedicated users of the platform. ","Kamino Finance, a dominant player in the Solana DeFi space with over $674 million in TVL across multiple products, announced the launch of its governance token, KMNO. The airdrop, dubbed the “Genesis Distribution,” will also take place in April, with eligibility determined at a snapshot on March 31.","Data from CryptoSlam indicated that the sales volume for Solana-based NFTs in March reached $249,9 million. The data further revealed that the Solana network has attracted around 376k buyers and 203k sellers of NFTs during March. The number of NFT transactions on Solana in March reached more than 2,3 million.","A notable update came from the Solana NFT marketplace Tensor, which announced its intention to issue a governance token, TNSR. In its post on X, the Tensor Foundation revealed its plan to launch the TNSR token, hinting at the issuance of a governance token without going into specifics. ","Introducing $TNSR – the future of NFT trading.$TNSR will govern Tensor protocols that have already traded over $2bn worth of NFTs on the fastest, most scalable blockchain – Solana. pic.twitter.com\/eff2IxGOwr","— Tensor Foundation (@TensorFdn) March 12, 2024","","The month also saw a fascinating event when a relatively unknown NFT artist, pseudonymously known as Kero, managed to raise over $10 million in SOL in less than a day. This feat was accomplished through the pre-sale of a meme coin that was originally started as a joke. ","Im not on Sol yet, to start it right should we make a SOL Shitcoin for fun ?","— Kero 🐸🦇🔊 (@KeroNFTs) March 14, 2024","","The Solana NFT market has also seen significant sales activity. The purported owner of Achi, the dog behind the Solana-based meme coin Dogwifhat, sold the iconic photo of the dog wearing a hat as an NFT for $4.3 million.","🚨SOLD🚨","On November 17, 2018, Achi's owners captured him in an endearing hat on camera. It went viral, ultimately becoming a meme and mascot for the meme coin $wif.","Today, that image was collected by Gigantic Rebirth Ventures on FND for 1,210.759 ETH (4.3 Mil)! pic.twitter.com\/8jV4szdPg1","— Rob | Foundation (@RDToTheMoon) March 18, 2024",""," "," ","In March, Solana’s on-chain data analysis showed that the blockchain and the SOL price performance both reached significant milestones. Market capitalization reached an all-time high of $92.5 billion, accompanied by a record number of daily new and active addresses. Despite fluctuations, daily transaction volume increased slightly, and TVL jumped to $4.9 billion, a 96% increase from February 2024.","According to Google Trends and CoinGecko Research, interest in Solana has skyrocketed worldwide, reflected in the price of SOL, which rose from $135 to nearly $205 by March 28, a new high since December 2021. ","The ecosystem witnessed new collaborations and advancements, including institutional investments, DeFi enhancements such as Circle’s Cross-Chain Transfer Protocol, and the launch of innovative projects such as Aphone and Io.net.","The meme coin scene thrived, with Slerf and Dogwifhat experiencing surges in market capitalization and trading volumes. New meme coins like Jeo Boden, Milady Wif Hat, and Book of Memes also emerged, driving excitement and market activity. ","Solana’s NFT market saw robust sales, highlighted by Tensor’s announcement of a governance token, TNSR, and a successful $10 million SOL raise by NFT artist Kero. In addition, notable NFT sales included the iconic Dogwifhat photo, which sold for $4.3 million. ","These developments underscored Solana’s growing prominence in the blockchain space, as evidenced by its market performance, ecosystem expansion as well as vibrant meme coin and NFT markets.","",""],"entity":[{"type":"March 8th","content":"DATE"},{"type":"JUP DAO","content":"ORGANIZATION"},{"type":"March 18, 2024","content":"DATE"},{"type":"Google Trends’","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Robinhood Europe","content":"LOCATION"},{"type":"$3.52 billion","content":"MONEY"},{"type":"February 2024","content":"DATE"},{"type":"Jeo Boden (BODEN)","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"$325 million","content":"MONEY"},{"type":"Bozo Collective","content":"ORGANIZATION"},{"type":"Swiss Exchange","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"$674 million","content":"MONEY"},{"type":"IO Research","content":"ORGANIZATION"},{"type":"$92.5 billion","content":"MONEY"},{"type":"Neptune Digital","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"},{"type":"$60","content":"MONEY"},{"type":"2028","content":"DATE"},{"type":"$135","content":"MONEY"},{"type":"Artemis","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Rob | Foundation","content":"ORGANIZATION"},{"type":"Milady NFT","content":"ORGANIZATION"},{"type":"$3.79 billion","content":"MONEY"},{"type":"Genesis Distribution","content":"ORGANIZATION"},{"type":"March 12, 2024","content":"DATE"},{"type":"JUP","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Milady Wif Hat","content":"PERSON"},{"type":"220%","content":"PERCENT"},{"type":"March 2025","content":"DATE"},{"type":"March 2024","content":"DATE"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"JUP","content":"ORGANIZATION"},{"type":"SOL","content":"ORGANIZATION"},{"type":"Jupiter Exchange","content":"ORGANIZATION"},{"type":"March 26, 2024","content":"DATE"},{"type":"CoinGecko Research","content":"ORGANIZATION"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"March 1","content":"DATE"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Cola HBC","content":"ORGANIZATION"},{"type":"Slerf","content":"PERSON"},{"type":"Solana","content":"ORGANIZATION"},{"type":"Tensor","content":"ORGANIZATION"},{"type":"March 9","content":"DATE"},{"type":"ASR","content":"ORGANIZATION"},{"type":"March 7","content":"DATE"},{"type":"$700,000","content":"MONEY"},{"type":"Tensor Foundation","content":"ORGANIZATION"},{"type":"March 30, 2024","content":"DATE"},{"type":"Google Trends","content":"ORGANIZATION"},{"type":"$10.8 million","content":"MONEY"},{"type":"June 2021","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"Las Vegas","content":"LOCATION"},{"type":"$4.3 million","content":"MONEY"},{"type":"$1.6 billion","content":"MONEY"},{"type":"March 31st","content":"DATE"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Solana!","content":"ORGANIZATION"},{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"March 14, 2024","content":"DATE"},{"type":"Aphone","content":"PERSON"},{"type":"TNSR","content":"ORGANIZATION"},{"type":"$112.9 billion","content":"MONEY"},{"type":"Cola Company","content":"ORGANIZATION"},{"type":"Figment Europe","content":"LOCATION"},{"type":"last week of December 2023","content":"DATE"},{"type":"$2bn","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$17.6 billion","content":"MONEY"},{"type":"$188","content":"MONEY"},{"type":"$TNSR","content":"MONEY"},{"type":"Pepe (PEPE)","content":"PERSON"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$1.28","content":"MONEY"},{"type":"$wif","content":"MONEY"},{"type":"last two days","content":"DATE"},{"type":"$4.9 billion","content":"MONEY"},{"type":"November 17, 2018","content":"DATE"},{"type":"Gigantic Rebirth Ventures","content":"ORGANIZATION"},{"type":"Jupiter DAO","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"Poloniex","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Achi","content":"PERSON"},{"type":"49.3%","content":"PERCENT"},{"type":"Figment Solana","content":"PERSON"},{"type":"$18.6 million","content":"MONEY"},{"type":"Solend","content":"LOCATION"},{"type":"Solana","content":"LOCATION"},{"type":"Cross-Chain Transfer Protocol","content":"ORGANIZATION"},{"type":"$7.7 billion","content":"MONEY"},{"type":"Kamino Finance","content":"ORGANIZATION"},{"type":"$205","content":"MONEY"},{"type":"Solana blockchain","content":"PERSON"},{"type":"$1.6","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Apex Group","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Issuance.Swiss AG","content":"ORGANIZATION"},{"type":"March 29","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"$4,8","content":"MONEY"},{"type":"March 27","content":"DATE"},{"type":"$249,9 million","content":"MONEY"},{"type":"96%","content":"PERCENT"},{"type":"233%","content":"PERCENT"},{"type":"March 21","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Milady Wif","content":"ORGANIZATION"},{"type":"Wormhole","content":"LOCATION"},{"type":"March 20","content":"DATE"},{"type":"Kucoin","content":"PERSON"},{"type":"$0.36","content":"MONEY"},{"type":"$77.9 billion","content":"MONEY"},{"type":"$5.2 billion","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"Joe Biden","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Jeo Boden","content":"PERSON"},{"type":"March 5, 2024","content":"DATE"},{"type":"$64","content":"MONEY"},{"type":"TVL","content":"ORGANIZATION"},{"type":"$1.4 billion","content":"MONEY"},{"type":"March 18","content":"DATE"},{"type":"VPN\n💚 Airdrop Farming Portal\n💚 State","content":"ORGANIZATION"},{"type":"March 16","content":"DATE"},{"type":"March 15","content":"DATE"},{"type":"March 14","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"March 10","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$0.20","content":"MONEY"},{"type":"$4.9 million","content":"MONEY"},{"type":"$30M","content":"MONEY"}],"hashtag":["SOL","Solana","Solana Ecosystem"],"authors":["Veronika Rinecker","Hristina Yordanova"]}