{"summary":"Turkey’s Crypto Regulations Ready for Parliament, Draft Prioritizes Consumer Protection and Global Standards","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/turkey-crypto-regulations-draft-ready-for-parliament.htm","publishDate":"2024-05-13T06:54:21","id":19191,"type":null,"title":"Turkey’s Crypto Regulations Ready for Parliament, Draft Prioritizes Consumer Protection and Global Standards","category":["News "],"content":["Lawmakers in Turkey are reportedly set to submit a draft law on crypto regulation to the parliament this week.","Local outlet Daily Sabah reported Sunday that the Ruling Development and Justice Party’s (AK Party) chairperson hosted a meeting to conclude preparations for the draft law.","The proposed regulations aim to reduce risks for people dealing with cryptocurrency. These also aim to bring crypto trading platforms under the Capital Markets Board’s (SPK) control. The SPK would then license and supervise these platforms.","Other areas of regulation include how platforms store customer’s cash and crypto penalties that apply for breaking the rules. Specific rules for how these platforms operate will be decided later. This will be done through additional regulations that will be created separately.","Earlier this year, Turkish Finance Minister Mehmet Simsek said the country’s crypto regulations were in its final stages. He added that they aim to reduce crypto trading risks and establish licensing and operating standards for trading platforms.","An additional benefit is that they could help Turkey improve its standing with the Financial Action Task Force’s standards.","A recent Statista study revealed that Nigeria and Turkey led in terms of crypto adoption and the proportion of crypto owners among 56 countries as of Feb. 2024. In both countries, 47% of internet users reported owning or using cryptocurrency.","Interestingly, it also found North America and European countries surveyed lagged significantly behind in crypto adoption rates.","Nigerians and Turks turn to crypto for reasons including economic hardships like high inflation, weak currencies, and limited access to banks. They also consider crypto to be a hedge against inflation and currency devaluation and that it can provide greater financial accessibility and inclusion through the global crypto market."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Capital Markets Board","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"SPK","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"North America","content":"LOCATION"},{"type":"Mehmet Simsek","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"Ruling Development and Justice Party’s (AK Party)","content":"ORGANIZATION"},{"type":"Turkish Finance","content":"ORGANIZATION"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"Feb. 2024","content":"DATE"}],"hashtag":["Crypto Regulations","Turkey"],"authors":["Shalini Nagarajan"]}