{"summary":"Few Tokens Besides Bitcoin To Become SoV, Ethereum To Reshape Finance – Novogratz","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/few-tokens-besides-bitcoin-to-become-sov-ethereum-to-reshape-8686.htm","publishDate":"2020-12-21T15:40:07","id":19206,"type":null,"title":"Few Tokens Besides Bitcoin To Become SoV, Ethereum To Reshape Finance – Novogratz","category":["Ethereum News "],"content":["Very few cryptoassets will stand the test of time and become lasting stores of value (SoV) outside of bitcoin (BTC), Mike Novogratz, the CEO of digital asset-focused financial services firm Galaxy Digital, said, adding that he is increasingly confident that the Ethereum community will help reshape the future of finance.","In an interview with Raoul Pal on Real Vision, Novogratz said:","“When you criticize litecoin (LTC), you get hammered by people. It was a variation of bitcoin. A lot of people bought litecoin and say, well, I cannot afford a bitcoin, but I can afford a litecoin, which makes no economic sense but that was their argument. I think in pure store of value coins, I do not think a lot of the smaller ones will have long-lasting gigs. Now, then there are utility coins like, protocols, you think about ethereum (ETH), definitely, EOS, hashgraph, all of these coins that want to be the base layer of trust, where lots of things get processed.”","However, Novogratz estimates that “90-95% of the real talent that is entering the space as programmers are programming around the Ethereum world.”","And on the subject of Ethereum, he added,","“That is really where you are going to rebuild the future of finance and the future of lots of things.”","As reported, Ethereum already has more developers than Bitcoin.","Novogratz, who already warned banks over DeFi, opined that while “bitcoin is an easier story on a risk-adjusted basis,” he was “liking Ethereum more and more as I see this thing go.”","The businessman recalled that, back in 2017, he “would invest in sexier projects with good founders and decent communities, and as soon as there was liquidity, I would sell them.”","Novogratz also claimed that previous crypto bubbles have strengthened his focus on key investment parameters, such as market capitalization and fully diluted market capitalization.","Saying that this was the best investment lesson he learned in 2020, he advised investors to focus on the second marker, which refers to what a token’s market cap would be if all available coins in total supply were issued.","He stated,","“When you get the growth at an accelerating rate, you can stay long. Even if prices do not make sense, because that compounding of the second derivative really creates the excitement around it. If it was Zoom, like I am going to short Zoom, that was a mistake to short Zoom. They were growing at an accelerating rate.”","The CEO added that, as a rule of thumb, when market cap levels get to “stupid levels” and “when the community is valuing this new protocol at stupid levels, even in this wild bubble already with all equities,” investors have “got to sell.”","“You’ve got to take some profits off the table,” the Galaxy Digital CEO said.","Novogratz also cautioned crypto investors that paying attention to these markers would turn certain individuals into “momentum traders,” but would also help people “know the good projects,” so they would “not buy fundamentally on the big dips.”","“There are going to be big dips on new projects,” he concluded.\n___","Learn more:\nBitcoin, Ethereum, XRP, Bitcoin Cash, Litecoin, Chainlink Price Predictions for 2021\nEthereum Foundation Sold ETH To Novogratz At Premium In 2015\n“Ethereum Is (Not) Money” Trigger Tested Again And It Still Works\nBitcoin Is Better Than Ethereum At These Four Things\nCrypto in 2021: Bitcoin To Ride The Same Wave Of Macroeconomic Problems"],"entity":[{"type":"Ethereum Foundation Sold ETH To Novogratz","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Galaxy Digital CEO","content":"ORGANIZATION"},{"type":"Novogratz","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Raoul Pal on Real Vision","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Litecoin","content":"LOCATION"}],"hashtag":["Adoption","Bitcoin","Ethereum","Litecoin","Mike Novogratz"],"authors":["Jaroslaw Adamowski"]}