{"summary":"Stablecoin Issuer Tether Hits Back Deutsche Bank’s Argument Over its Solvency","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/stablecoin-issuer-tether-hits-back-deutsche-banks-argument-over-its-solvency.htm","publishDate":"2024-05-10T05:21:15","id":19208,"type":null,"title":"Stablecoin Issuer Tether Hits Back Deutsche Bank’s Argument Over its Solvency","category":["Altcoin News "],"content":["In a latest response, Tether, the world’s largest stablecoin, has vehemently criticized Deutsche Bank’s statement, which questioned the sustainability of stablecoins and Tether’s solvency.","A Deutsche Bank research, published Tuesday, studied 334 currency pegs since the year 1800 and concluded that only 14% survived. Applying the research to stablecoins, the bank’s analysts noted that the asset class is prone to “turbulence and de-pegging events.”","“While some may survive, most will likely fail, particularly due to the lack of transparency in stablecoin operations and vulnerability to speculative sentiment.”","The research analyzed the collapse of TerraUSD stablecoin, leaving a ripple effect on the entire crypto market. “These incidents highlight the volatility and risks associated with stablecoins, and the need for greater transparency and regulation in the cryptocurrency market,” the report read.","Further, Deutsche Bank criticized Tether – a dominant stablecoin – questioning its solvency and its industry standard for crypto derivatives.","“A ‘Tether peso moment’ could cause significant losses, negatively impacting leveraged traders and causing severe repercussions for the entire crypto system.”","Additionally, the report stressed the challenges in constructing stable currency pegs, despite the novelty of cryptocurrencies. “It is likely that we will see much more instability in the years to come,” it added.","The German banking giant surveyed over 3,350 consumers in March (550 in France, Germany, Spain, Italy, UK each and 600 in USA), questioning the stability of stablecoins.","“Only 18% of consumers expecting them to thrive, while 42% expect them to fade,” the survey found.","","","Notably, the research team wrote that they are concerned about Tether, given its implications amid “monopoly in the stablecoin market.” According to a Bloomberg report, the analysts also pointed out reliance on Tether in the crypto derivatives market.","“The 30% de-peg rate among some stablecoins is therefore hardly surprising, and many defunct stablecoins are hard to account for.”","Retaliating back to Deutsche Bank’s stablecoin claims, Tether said that the research “lacks clarity and substantial evidence, relying on vague assertions rather than rigorous analysis.”","“While it attempts to forecast the decline of stablecoins, it fails to provide concrete data to support its claims.”"],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Tether","content":"PERSON"},{"type":"USA","content":"ORGANIZATION"},{"type":"42%","content":"PERCENT"},{"type":"1800","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"Germany","content":"LOCATION"},{"type":"Spain","content":"LOCATION"},{"type":"Italy","content":"LOCATION"}],"hashtag":["Deutsche Bank","Stablecoins","Tether"],"authors":["Sujha Sundararajan"]}