{"summary":"Rich Dad Poor Dad Author Robert Kiyosaki Celebrates Financial Planners’ Pivot To Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/rich-dad-poor-dad-author-robert-kiyosaki-celebrates-financial-planners-pivot-to-bitcoin.htm","publishDate":"2024-02-13T21:13:32","id":19211,"type":null,"title":"Rich Dad Poor Dad Author Robert Kiyosaki Celebrates Financial Planners’ Pivot To Bitcoin","category":["Bitcoin News "],"content":["Financial planners are finally beginning to acknowledge Bitcoin (BTC) – and Rich Dad Poor Dad author Robert Kiyosaki is happy to see it.","The man behind the famous finance book has often advised followers to invest in “hard assets” like gold, silver, real estate, and BTC. According to him, advisors have steered clients away from these assets over time simply to profit on commissions, even though gold “has beaten the S&P for decades.”","“The S&P is about to crash by 70%. Don’t be a loser. Choose your financial advisors carefully,” Robert Kiyosaki wrote on X. “Prepare for the biggest crash in history.”","The prediction, while jaw-dropping for first-time readers, is hardly new. Kiyosaki has publicly called for incoming financial catastrophe at least a dozen times dating back to 2011 and has rarely been correct so far.","Two months ago, the author told followers to withdraw their money from banks in anticipation of the “biggest crash in history.”","Just 70% this time? pic.twitter.com\/7nIdtTTy9w","— Nick Maggiulli (@dollarsanddata) February 12, 2024","","His analysis of gold against stocks is also inaccurate. Dating back to 1974, the S&P 500 has appreciated 5200% while gold has only risen 1306%, according to Longtermtrends. With the exception of the early 80s, gold has rarely outperformed stocks across any time frame.","Regardless, gold has still kept its value far better than USD, which the author regularly criticizes for being easily printed and prone to inflation\/debasement.","Bitcoin proponents, including Kiyosaki, often praise the digital currency as a form of “digital gold.” Not only is its maximum supply capped at 21 million coins, but its digital nature makes it easily tradeable in a manner comparable to dollars.","Back in November, Kiyosaki claimed that Bitcoin was the “best protection” against hyperinflation—better than both gold and silver.","“Bitcoin is people’s money which means people control the value of Bitcoin, not our leaders,” he said.","Since the launch of several spot Bitcoin ETFs last month, Bitcoin has already become the second-largest ETF commodity in the country, inserting itself between silver and gold.","In terms of net inflows, ETFs for the so-called “digital gold” have absorbed $3 billion in BTC since last month. By comparison, the very first gold ETF – GLD –only reached this level after roughly 2 years."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"Kiyosaki","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"2011","content":"DATE"},{"type":"Robert Kiyosaki","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"5200%","content":"PERCENT"},{"type":"February 12, 2024","content":"DATE"},{"type":"1974","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"1306%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Longtermtrends","content":"LOCATION"},{"type":"Nick Maggiulli","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin"],"authors":["Andrew Throuvalas"]}