{"summary":"Final Fantasy Publisher Square Enix Reveals How to Obtain NFTs for Upcoming Game Symbiogenesis","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/final-fantasy-publisher-square-enix-reveals-how-to-obtain-nfts-for-upcoming-game-symbiogenesis.htm","publishDate":"2023-11-08T12:00:12","id":19218,"type":null,"title":"Final Fantasy Publisher Square Enix Reveals How to Obtain NFTs for Upcoming Game Symbiogenesis","category":["NFT News "],"content":["The Japanese gaming giant Square Enix has shared how players can get characters for its upcoming non-fungible token (NFT) game Symbiogenesis.","Ethereum and Polygon NFT game Symbiogenesis is nearing its December launch.","Therefore, the Final Fantasy series creator announced the launch of the ‘Chapter 1’ allowlist campaign for the new game.","It means that it will not hold a public mint for Symbiogenesis, it said. Instead, players will need to join a campaign to get on the “allow” list.","“Taking part in the Allow List Entry Campaign (getting onto the Allow List) is the ONLY way to mint the characters from Chapter 1.”","Furthermore, participants will get prizes: Relics that can be redeemed for Chapter 2 Allow List points.","Top-ranking players will “stand a chance” to mint a character for free, it said, adding:","“Even if you don’t get a free chapter 1 character, take a chance on chapters 2 through 6!”","The team will reset the Allow List and run the Entry Campaign for each chapter.","The campaign with “various activities” will be held on the game’s Discord server for two weeks, November 7-21.","These activities include questions in the Prologue Quiz, the Lucky Bloom, the Majority-Minority Game, and the Hella Difficult Quiz.","【Allowlist Entry Campaign -Lucky Bloom-】","The Lucky Bloom is one of the campaign activities running on Discord.\n・A test of luck with a total of 10 sessions","Take part in our Discord server!https:\/\/t.co\/wWQh4UTWCn#SYMBIOGENESIS","— SYMBIOGENESIS -NFT Art＆Game Project- | SQUARE ENIX (@symbiogenesisPR) November 7, 2023","","To join, players need to log in and connect their wallet to the Discord account.","Participants need to join treasure hunts and social media campaigns to collect NFT Relics. Member points will be awarded based on the number of Relics.","“Only those with the highest ranking will be eligible to participate in Phase 2 of the NFT Character Mint.”","A total of three Phases will be launched, said the website. Phase 2 will also have “a high chance” to mint a character for free.","In total, 90 people will proceed to Phase 2. The rest will receive Relics to redeem for points that will give them an advantage for the Chapter 2 Allow List Entry Campaign.","Participants eligible for Phase 2 will also be eligible for Phase 3, which will include all participants who took part in the campaign.","Per the website, Symbiogenesis aims to “establish a new IP within the realm of Web3, with the team “strongly” encouraging Character owners to use them within the game and partake in the community.","There are four character types based on their uniqueness and relevance in the story: facet, mesh, line, and point.","The Protagonist is Chroma. The main story begins with the meeting of Chroma the Guard and Lambda the Conservator. Lambda is the current leader of the Land of Salvation in the Floating Continent.","Humanity has managed to survive the pollution by living on the Floating Continent. However, a Dragon attack puts everything in danger.","The World Mission is the last of the game. This story has multiple endings and will change depending on this mission.","Only 3 people who completed all the missions and collected special items will be able to participate in the World Mission.","Meanwhile, Symbiogenesis recently started collaborating with GensoKishi Online, which committed to building on Zero-Knowledge (ZK) proof-based scaling rollup Immutable zkEVM."],"entity":[{"type":"November 7","content":"DATE"},{"type":"November 7, 2023","content":"DATE"},{"type":"Chroma","content":"LOCATION"},{"type":"Hella Difficult Quiz","content":"ORGANIZATION"},{"type":"Symbiogenesis","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"21","content":"DATE"},{"type":"Enix","content":"ORGANIZATION"},{"type":"ENIX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dragon","content":"ORGANIZATION"},{"type":"GensoKishi Online","content":"ORGANIZATION"},{"type":"Polygon NFT","content":"ORGANIZATION"},{"type":"Floating Continent","content":"ORGANIZATION"},{"type":"Bloom","content":"PERSON"}],"hashtag":["Community","Gaming","NFT","Non-fungible tokens"],"authors":["Sead Fadilpašić"]}