{"summary":"A German regulator is looking into whether Worldcoin users have “sufficient and clear” information about how the project uses their sensitive biometric data, Reuters reported.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242287\/german-authorities-probe-worldcoin-project-over-privacy-reuters","publishDate":"2023-07-31T12:48:54","id":1921,"type":null,"title":"German authorities probe Worldcoin project over privacy: Reuters","category":["Policy"],"content":["Bavaria's State Office for Data Protection Supervision has been looking into the <a href=\"https:\/\/www.theblock.co\/post\/237647\/inside-sam-altmans-worldcoin-and-its-quest-to-catalog-all-humans\" data-v-f87c67ca=\"\">Worldcoin<\/a> crypto project since last year over concerns about how sensitive data might be used, Reuters reported.","\"These technologies are at first sight neither established nor well analyzed for the specific core purpose of the processing in the field of transferring financial information,\" Reuters cited the regulator's president, Michael Will, as saying. The Bavarian regulator is the lead authority looking at Worldcoin under European Union data protection rules.","Will added that consent is another major risk, such as whether users have \"sufficient and clear\" information about how Worldcoin uses their sensitive biometric data.","German authorities have been investigating Worldcoin since November as Worldcoin parent company Tools for Humanity has a subsidiary in the country. <a href=\"https:\/\/www.reuters.com\/technology\/frances-privacy-watchdog-says-worldcoin-legality-seems-questionable-2023-07-28\/\" data-v-f87c67ca=\"\">French<\/a> as well as <a href=\"https:\/\/www.theblock.co\/post\/241282\/uk-data-protection-regulator-sam-altman-worldcoin\" data-v-f87c67ca=\"\">UK<\/a> regulators have also looked into Worldcoin's use of private data collection and use.&nbsp;","Worldcoin launched in Germany on June 29, using Okta's popular authentication and authorization platform Auth0. Worldcoin's \"<a href=\"https:\/\/www.theblock.co\/post\/237647\/inside-sam-altmans-worldcoin-and-its-quest-to-catalog-all-humans\" data-v-f87c67ca=\"\">orbs<\/a>\" used to scan an individual's iris and collect biometric data are also produced in Germany.&nbsp;"],"hashtag":["EUROZONE REGULATION"]}