{"summary":"BNB Chain’s New Roadmap Prioritizes Blockchain Adoption, Web2 and AI Support","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bnb-chains-new-roadmap-prioritizes-blockchain-adoption-web2-and-ai-support.htm","publishDate":"2023-12-12T18:33:19","id":19210,"type":null,"title":"BNB Chain’s New Roadmap Prioritizes Blockchain Adoption, Web2 and AI Support","category":["Altcoin News "],"content":["BNB Chain has unveiled the roadmap for the Greenfield decentralized storage network targeting web2 and web3 integrations and better innovation to drive blockchain adoption. ","In a Dec 12 statement, the company highlighted key areas of Greenfield’s development roadmap describing it as an ambitious journey to change how users and developers deal with data on-chain and on web2 platforms. ","“This roadmap update shares Greenfield’s upcoming plans on improving the user experience while blending the best of Web2 performance with the innovative features of Web3 in the sphere of decentralized storage.” ","In Q4 2023, it set a target to enable smart contracts and make storage provider’s (SP) exit stages easier while in the first quarter of 2024, it aims to improve SP performance and garbage collection. ","Still, between the second and the third quarter, storage speeds will be increased by 5x around download and upload utilities and finally, the fourth quarter will see an Artificial Intelligence (AI) integration. ","","Perfecting its vision for wider blockchain adoption, it seeks to create a high-performance network for several uses that rival big technology firms operating in web2. According to the release, this would enable faster transaction processing and onboarding of users.","While the current speed is pegged at 2mb\/s for uploads and a download speed of 20mb\/s, the BNB protocol sets for five times better performance by tackling the blockchain scaling problem in several ways. ","Aside from the base speeds, it integrates a bundle service that allows users to group several files into a single storage order making it faster to send more items. It can be similar to the model of lumping on-chain transactions together to drive scalability as used across multiple chains. ","A major update hailed by several analysts is the interoperability of the features being described as a multi-chain ecosystem giving users access to diverse platforms. Its cross-chain programmability makes it possible for smart contracts to become resource owners for them to give permissions as they own and control resources in future operations. ","The project promises a design to perfectly integrate AI to web3 for several benefits like creating a specialized storage model for huge files and off-chain generic computing to process large data off-chain in a bid to save time and cost. ","“The current AI landscape faces a unique set of challenges that Web3 has the unique ability to address as well. Some examples include blockchain facilitating ownership, decentralization, transparency, and innovation for builders. ","On network governance, the release states that Greenfield makes it easier and cheaper to participate in the network either as a storage provider or user by reducing computational demands, simplifying exit processes, and decreasing energy usage on devices."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"fourth quarter","content":"DATE"},{"type":"Greenfield","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"}],"hashtag":["BNB","CRYPTO"],"authors":["David Pokima"]}