{"summary":"Yuga Labs Accuses Ryder Ripps of Destroying NFT Keys to Evade Court Order","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/yuga-labs-accuses-ryder-ripps-of-destroying-nft-keys-to-evade-court-order.htm","publishDate":"2024-03-14T10:47:17","id":19224,"type":null,"title":"Yuga Labs Accuses Ryder Ripps of Destroying NFT Keys to Evade Court Order","category":["News "],"content":["Bored Ape Yacht Club creators, Yuga Labs, are accusing artist Ryder Ripps of contempt of court. In a recent filing, they allege Ripps deliberately destroyed access to his wallets containing RR\/BAYC NFTs to avoid complying with a court order.","Yuga Labs claims Ripps’ actions were made in “bad faith” and that he misled the court. They are requesting the court punish Ripps for these actions.","In a filing last week in a California District Court, Yuga Labs requested sanctions against Ripps for his alleged actions. The company stated that Ripps’s deliberate destruction of private keys was an attempt to thwart the court’s injunction.","In April 2023, a judge ruled in favor of Yuga Labs in its claim against Ripps and Cahen for violating copyright laws by creating unauthorized versions of BAYC nonfungible tokens (NFTs). This came after the pair played on the words of the well-known BAYC brand, launching the Ryder Ripps BAYC (RR\/BAYC) collection in May 2022.","As a result, Ripps and Cahen were ordered to pay a total of $1.57 million in damages to Yuga Labs, along with covering legal fees, supposedly bringing the lawsuit to an end. The Court’s findings of fact and conclusions of law on October 25, 2023, confirmed that the injunction would be enforced due to the irreparable harm caused by the infringing conduct—the injunction aimed to allow Yuga Labs to regain control over its brand and reputation.","On February 3, 2024, the Court issued a final judgment in favor of Yuga Labs, mandating that defendants destroy or transfer their RR\/BAYC NFTs within two weeks. However, on February 21, 2024, Mr. Ripps, through counsel, disclosed for the first time that he had allegedly destroyed the private keys for wallets containing RR\/BAYC NFTs back on December 9, 2023.","Yuga Labs argues that Ripps acted in bad faith by destroying his private keys, providing misleading information, and continuing to misrepresent facts to both Yuga Labs and the Court. As a result, Yuga Labs is urging the Court to hold Ripps in contempt for his actions.","However, in response to Yuga Labs’ request for sanctions, Ripps and his partner, Jeremy Cahen, have filed a request for the Court to reject the sanctions. They claim that Ripps complied fully with the October injunction, except for orders tied to wallets he lost access to. They also highlight that Ripps’ counsel had reached out to Yuga Labs’ counsel, contrary to Yuga Labs’ claims.","Critics argue that Ripps’ actions frustrate the effectiveness of the Court’s judgment, as Ripps retains potential access to the NFTs through various means, including backups or recovery options. Furthermore, it was disclosed that Mr. Ripps had yet to fully disclose all wallets containing RR\/BAYC NFTs, raising questions about the sincerity of his compliance efforts.","The lawsuit added that Ripps and his co-defendant have failed to fulfill other obligations outlined in the Court’s judgment, including the payment of attorneys’ fees and reimbursement for fees paid to a Special Master.","Furthermore, Yuga Labs alleges that Ripps disclosed only on February 21 that he had destroyed the private keys for the wallets containing the NFTs in December of the previous year. Ripps claimed this action was to prevent accidental engagement with the wallets, which could be seen as a violation of the court injunction. However, Yuga Labs argues that Ripps’ actions further harm their case and frustrate the purpose of the Court’s injunction.","Yuga Labs also questions the validity of Ripps’ explanation, suggesting that he may still be able to recover access to his NFTs if he has physical or digital backups of his private keys. Additionally, they claim that Ripps continued to use wallets tied to RR\/BAYC after the initial court injunction.","The legal battle between them continues. Both parties are presenting their arguments before the Court as they seek resolution in the ongoing dispute over intellectual property rights related to NFTs."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"Ripps","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"February 21","content":"DATE"},{"type":"Cahen","content":"PERSON"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"California District Court","content":"ORGANIZATION"},{"type":"February 21, 2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"February 3, 2024","content":"DATE"},{"type":"October 25, 2023","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Jeremy Cahen","content":"PERSON"},{"type":"Ripps","content":"PERSON"},{"type":"December 9, 2023","content":"DATE"},{"type":"October","content":"DATE"},{"type":"$1.57 million","content":"MONEY"}],"hashtag":["Bored Ape Yatch Club","NFT","Yuga Labs"],"authors":["Hassan Shittu"]}