{"summary":"Bitcoin Users Spend Record $2.4M in Fees to Be a Part of Bitcoin Halving History","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-users-spend-record-2-4m-fees-join-bitcoin-halving-history.htm","publishDate":"2024-04-22T23:17:08","id":19221,"type":null,"title":"Bitcoin Users Spend Record $2.4M in Fees to Be a Part of Bitcoin Halving History","category":["Bitcoin News "],"content":["Investors spent more than 37.7 Bitcoin, worth $2.4 million, in fees to claim their spot on the 2024 Halving Block, making it the most expensive block ever mined.","On April 20, at 12:09 p.m. UTC, Bitcoin miner ViaBTC generated the 840,000th block, triggering an automated protocol that cuts per-block Bitcoin (BTC) emissions in half.","The event that occurs once every 4 years, known as the Bitcoin Halving, saw mining rewards cut from 6.25 BTC to 3.125 BTC.","Revenue earned from Bitcoin mining reached record heights on the day of the halving, hitting $107.7 million in daily earnings as community members willingly paid extortionate fees to get their transactions recorded on the 840,000th Bitcoin block.","","This resulted in a total of $2.4 million in fees as users competed for the most valuable piece of digital real estate in Bitcoin history. According to data from Bitcoin block explorer mempool.space, 3,050 transactions occurred, meaning the average user paid a little under $800.","","One reason for the record fees was an influx as users rushed to engrave and etch unique Satoshis on the halving block. ","The new Runes Protocol, developed by Bitcoin Ordinals creator Casey Rodarmor, was the main source of the influx of activity, as it launched simultaneously with the halving.","Runes have been marketed as a more efficient way to create new tokens on the Bitcoin network, compared to the BRC-20 token standard — an Ordinals-based method for creating Bitcoin-based tokens.","Runes, like BRC-20s, use the Bitcoin network and pay fees in Bitcoin to generate new tokens. However, Runes uses the Unspent Transaction Output (UTXO) model to “etch” new tokens on Bitcoin. This contrasts with Ordinals’ “inscription” account model, according to a protocol explainer from Rodarmor. ","The protocol lets users inscribe individual satoshis with unique identification numbers, and embed them with arbitrary data directly into Bitcoin’s blockchain.","Aside from the battle to inscribe one of the first Runes, Bitcoin mining pools competed for what is known as an “epic” satoshi. An epic satoshi is the very first satoshi, or the smallest possible Bitcoin denomination, mined on the halving block.","Given the decrease in Bitcoin mining rewards, many crypto miners have taken a threatening hit to their income, leaving them vulnerable.","So far, Bitcoin miners have been making up for the loss of mining rewards following the halving through technological advancements that have improved mining efficiency.","However, according to pseudonymous Ordinals developer Leonidas, “Runes degens have single-handedly offset the drop in miner rewards from the halving.”","In the last five Bitcoin blocks the fees have surpassed the coinbase reward!","The Runes degens have single handedly offset the drop in miner rewards from the halving.","Runes are drastically increasing Bitcoin's security budget.","You're welcome @LukeDashjr","— Leonidas (@LeonidasNFT) April 20, 2024","","According to aggregated data from mempool. space, a total of $3.82 million in fees, excluding miner subsidies, was spent on the five blocks following the halving, signifying a positive future despite the anticipated massive impact the halving would have on Bitcoin Mining Operations."],"entity":[{"type":"$2.4 million","content":"MONEY"},{"type":"$800","content":"MONEY"},{"type":"Leonidas","content":"PERSON"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12:09 p.m.","content":"TIME"},{"type":"UTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Leonidas (","content":"PERSON"},{"type":"April 20","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Bitcoin Mining Operations","content":"ORGANIZATION"},{"type":"$107.7 million","content":"MONEY"},{"type":"April 20, 2024","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$3.82 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin halving","Fees"],"authors":["Harvey Hunter"]}