{"summary":"SEC Accuses Kraken of Operating Unregistered Platform, Kraken Responds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-accuses-kraken-of-operating-unregistered-platform-kraken-responds.htm","publishDate":"2023-11-21T06:28:22","id":19220,"type":null,"title":"SEC Accuses Kraken of Operating Unregistered Platform, Kraken Responds","category":["Blockchain News "],"content":["The U.S. Securities and Exchange Commission (SEC) has initiated legal proceedings against the cryptocurrency exchange Kraken, claiming it has been operating an unregistered securities trading platform.","The SEC filed the lawsuit in North District of California against the parent firms of Kraken, Payward Ventures, Inc. and Payward Trading Ltd. According to the SEC’s complaint, Kraken has provided unregistered crypto trading and transaction services to the public and allegedly created risks for its investors.","“Without registering with the SEC in any capacity, Kraken has simultaneously acted as a broker, dealer, exchange, and clearing agency with respect to these crypto asset securities.” The SEC wrote in the filing, “In doing so, Kraken has created risk for investors and taken in billions of dollars in fees and trading revenue from investors without adhering to or even recognizing the requirements of the U.S. securities laws that are designed to protect investors.”","In addition, the SEC also stated that the company posed “significant risks” by mixing the users’ and investors’ crypto assets with its own corporate assets. “For example, Kraken has at times held customer crypto assets valued at more than $33 billion, but it has commingled these crypto assets with its own,” said the SEC.","The SEC proceeded with specific instances to specify Kraken’s alleged wrongdoing. “In fact, Kraken has at times paid operational expenses directly from bank accounts that hold customer cash,” said the SEC. The agency also believed that according to the independent auditor, issues “related to Kraken’s recordkeeping of customer custodial assets” have resulted in “material errors to Kraken’s financial statements for 2020 and 2021.”","The accused Kraken’s operation of acting as an unregistered broker, dealer, exchange, and clearing agency mirrors the SEC’s ongoing lawsuits filed earlier this year against Binance and Coinbase. The SEC also sued the crypto exchange Bittrex for offering unregistered securities in April. Bittrex received its bankruptcy approval in October to cease its operations in the U.S.","Kraken has responded to the lawsuit filing with a blog post, claiming that the SEC’s complaint “alleges no fraud, no market manipulation, no customer losses due to hacking or compromised security, and no breaches of fiduciary duty.”","“Instead, the complaint makes a technical argument: that Kraken’s business requires special securities licenses to operate because the digital assets we support are really ‘investment contracts,’” said the exchange.","Regarding the accusation of commingling its own funds with the clients’, the company said that it is a “allegation already made of other crypto trading platforms” and hyperlinked the SEC’s filing against Coinbase.","“The SEC cannot and does not allege that any customer funds are missing, or any loss has occurred. Nor does it allege that any loss will occur,” said the blog post. “The complaint itself concedes that this so-called ‘commingling’ is no more than Kraken spending fees it has already earned.”","We strongly disagree with the SEC claims, stand firm in our view that we do not list securities, and plan to vigorously defend our position.","As we have seen before, the SEC argues that @krakenfx should “come in and register” with the agency, when there is no clear path to…","— Dave Ripley (@DavidLRipley) November 21, 2023","","Kraken CEO Dave Ripley also voiced his disagreement with the SEC’s accusation, demonstrating the support for the Congressional action to resolve the “lack of regulatory clarity in the U.S.”"],"entity":[{"type":"Payward Ventures, Inc.","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Dave Ripley","content":"PERSON"},{"type":"Congressional","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$33 billion","content":"MONEY"},{"type":"Payward Trading Ltd","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"November 21, 2023","content":"DATE"},{"type":"North District of California","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Kraken","SEC"],"authors":["Hongji Feng"]}