{"summary":"US States Collaborate to Drive Blockchain and Cryptocurrency Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-states-collaborate-to-drive-blockchain-and-cryptocurrency-adoption-2.htm","publishDate":"2023-12-08T17:47:39","id":19235,"type":null,"title":"US States Collaborate to Drive Blockchain and Cryptocurrency Adoption","category":["Blockchain News "],"content":["While United States federal policymakers look to implement cryptocurrency and blockchain regulations, state-led organizations are taking initiatives to ensure that policy focused on cryptocurrency and blockchain adoption pass within the U.S. This is important to consider given that federal U.S. policymakers continue to remain divided on policy focused on cryptocurrency and blockchain technology usage.","Dominic Folino, president of the Pennsylvania Blockchain Coalition – a non-profit organization made up of blockchain allies, users and providers –  told Cryptonews that legislation isn’t coming out of the United States Congress fast enough. Given this, States now have the opportunity to enact policies that may eventually be pushed to the federal level.","In order to drive state legislation, Folino explained that the Pennsylvania Blockchain Coalition  joined forces with The U.S. Blockchain Coalition (USBC). USBC was created in June 2021, when thirty U.S. states initially came together to enable blockchain and crypto policies.","Arry Yu, chair of The Washington Technology Industry Association Cascadia Blockchain Council – a founding member of USBC – told Cryptonews that there are currently forty-six states within USBC that are working closely on crafting legislation. “We aim to have all fifty states as part of this coalition in the next several weeks,” said Yu.","What a collaborative and insightful Summit put on by the @TXblockchain_ ! The CA BAC was thrilled to participate in this panel alongside our colleagues in PA, FL and @blockcoalition! Blockchain policy started in the states, and that’s where the real innovation can and will occur. https:\/\/t.co\/Rb6ISDjUfJ","— CA Blockchain Advocacy Coalition (@BlockAdCo) November 30, 2023","","Yu explained that USBC was created with the goal of driving and conducting policy analysis, development and advocacy around blockchain technology and cryptocurrency at the State level. She said:","“It’s important for states to drive advocacy and clarity, because the states are the best laboratories for democracy. We are far more nimble than the federal level. We are also closer to the ones that hold the mandate of the people, being hyperlocal and working at the grassroots level.”","Yu further noted the importance of U.S. states working together to help enable legislation. “Prior to USBC, we saw crypto-friendly states like Wyoming, Florida and Texas not communicating with each other, creating silos in legislation. This was no better than what we are currently seeing at the federal level. States working together enables the sharing of best practices to breed legislation that may pass within all states and even at a federal level,” she remarked.","To put these points in perspective, Folino explained that the Pennsylvania Blockchain Coalition recently spoke with the Pennsylvania State legislature in regards to passing a bill similar to New York’s “BitLicense” regulation. The BitLicense Bill grants permission for crypto companies to legally operate in the state of New York. “This would make Pennsylvania pro-business when it comes to crypto companies planning to get started here,” he said. Folino also mentioned that he has been in touch with a number of Pennsylvania House Representatives to help them understand the benefits around blockchain and cryptocurrency policies.","Mike Cabell, a legislator for the State of Pennsylvania, told Cryptonews that both USBC and the Pennsylvania Blockchain Coalition have served as fantastic resources for education and connecting with other State legislators to develop technology and digital asset policy. He said:","“The biggest thing to keep in mind here is education. I’ve been reading and learning about blockchain technology and cryptocurrency for years, but it’s very complex. These organizations have been helpful for educating my constituents and colleagues.”","Ongoing industry education remains extremely important, as Cabell shared that he is currently working on introducing a “Blockchain Basics Act” within the State of Pennsylvania. “This act will ensure that Pennsylvania has a regulatory structure that will encourage the industry and protect consumers,” Cabell explained.  While this bill is new to Pennsylvania, Cabell added that Pennsylvania has utilized policy from other pro-crypto and blockchain states to help craft the document.","While Pennsylvania is focused on driving business to the area, Yu mentioned that Washington State and the Cascadia region in general – which includes Oregon, Washington and British Columbia – remain driven on blockchain legislation. “We want objectives in place to make the Pacific Northwest the best place to work and live, while embracing emerging technologies like blockchain. This involves using new technologies for things such as portable medical records, and a regional economic visa to help grow the workforce and make it easier for workers to move around the region,” she explained.","Similar to the goals Yu described, Jaime Minor, chief advocate for the California Blockchain Advocacy Coalition – an organization committed to educating legislators and regulators about blockchain technology and a USBC member –  told Cryptonews that she believes blockchain technology can solve problems lawmakers and their constituents are currently facing. “Each state has unique problems and priorities based on their needs. The California Blockchain Advocacy Coalition looks forward to working with the legislature in 2024 on ways that blockchain technology can help streamline data, for instance, to clear backlogs that get in the way of building affordable housing,” she said.","Samuel Armes, president of the Florida Blockchain Business Association – a non-profit organization promoting blockchain and cryptocurrency innovation and a member of USBC –  further told Cryptonews that Florida has already passed a number of crypto-friendly bills with the help of USBC. He believes these pieces of legislation may even influence the federal government in the future. He said:","“We currently have a Bitcoin Kiosk Bill, a Digital Gold Bill, and an Anti-SEC\/Pro DAO Bill. We also have about 3-4 appropriations from the State that are pushing to fund different programs.”","According to Cabell, there is a good chance that State level policy will eventually influence Federal policy. He said:","“I think the best thing States can do currently is push common sense legislation and policy that will responsibly allow this industry to grow and thrive. I’m hoping to reach out to Congress to let them know what is being accomplished and how policy from a Federal perspective can line up with these initiatives. We are testing everything in the States to get it right before we get Federal policy.”","While blockchain and cryptocurrency innovation on a state level is notable, there are a number of challenges that may hamper adoption. For instance,  Folino believes that a lack of education among state policymakers may result in delayed passing of legislation. “State legislators have several committees trying to absorb information, but do not have robust staff like members of Congress. We also need to demonstrate that blockchain and cryptocurrency innovation is bipartisan,” he said.","Echoing Folino, Minor believes that a large knowledge gap remains for state legislators. “Legislators often equate blockchain technology with Sam Bankman-Fried and the collapse of FTX. Yet the potential for blockchain technology is infinite,” she remarked. In order to solve this knowledge gap, Minor explained that much of the advocacy her organization does is around education and breaking down misconceptions associated with blockchain.","Armes pointed out that coordination is key to driving innovation in large states like Florida. However, he noted that Florida’s multiple epicenters, each with their own draws and pulls, can often create internal competition. He said:","“This makes an organized message sometimes much harder, as the pace in which Florida’s web3 scene is growing is faster than can be politically organized. This is why we put a lot of effort into supporting local meetups around the state, to get the community plugged into the larger community.”","Yet Armes believes that States ultimately provide a number of benefits when it comes to implementing crypto and blockchain legislation. “States can be aggressive and push the boundaries on legislation, especially when congress is in a bipartisan deadlock,” he said. Armes further noted that States can ban federal initiatives that would potentially harm the web3 and blockchain communities in those regions. “For instance, we were able to ban central bank digital currencies in Florida,” Armes said.","In addition to State accomplishments, Folino mentioned that overall USBC aims to draft legislation that will be adopted by each and every state. “If we can come up with model legislation that applies for all state levels, then maybe this will help drive federal legislation.”"],"entity":[{"type":"Pennsylvania State","content":"ORGANIZATION"},{"type":"State","content":"ORGANIZATION"},{"type":"Mike Cabell","content":"PERSON"},{"type":"British Columbia","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"State of Pennsylvania","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"PA","content":"ORGANIZATION"},{"type":"Bitcoin Kiosk Bill","content":"PERSON"},{"type":"FL","content":"LOCATION"},{"type":"November 30, 2023","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Jaime Minor","content":"PERSON"},{"type":"Samuel Armes","content":"PERSON"},{"type":"Dominic Folino","content":"PERSON"},{"type":"Armes","content":"PERSON"},{"type":"Florida Blockchain Business Association","content":"ORGANIZATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Pennsylvania Blockchain Coalition","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"4","content":"DATE"},{"type":"U.S","content":"LOCATION"},{"type":"California Blockchain Advocacy Coalition","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"June 2021","content":"DATE"},{"type":"CA Blockchain Advocacy Coalition","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"Washington State","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Folino","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cascadia","content":"LOCATION"},{"type":"United States Congress","content":"ORGANIZATION"},{"type":"Oregon","content":"LOCATION"},{"type":"The Washington Technology Industry Association Cascadia Blockchain Council","content":"ORGANIZATION"},{"type":"USBC","content":"ORGANIZATION"},{"type":"Pennsylvania House","content":"ORGANIZATION"},{"type":"Pacific Northwest","content":"LOCATION"},{"type":"Cabell","content":"PERSON"},{"type":"U.S. Blockchain Coalition (USBC","content":"ORGANIZATION"},{"type":"Federal","content":"ORGANIZATION"}],"hashtag":["Adoption","Blockchain","Community","Cryptocurrency","Regulation","United States"],"authors":["Rachel Wolfson"]}