{"summary":"Bitcoin Miner Hut 8 Accused of a Pump and Dump Scheme, HUT Shares Plummet","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/btc-miner-hut-8-accused-of-a-pump-and-dump-scheme-hut-shares-plummet.htm","publishDate":"2024-01-19T12:19:21","id":19239,"type":null,"title":"Bitcoin Miner Hut 8 Accused of a Pump and Dump Scheme, HUT Shares Plummet","category":["Bitcoin News "],"content":["Bitcoin miner Hut 8 has been accused of hiding stock ownership in a perceived pump-and-dump scheme. The accusation comes from an unconfirmed report by JCapital Research. In a Jan 18 release, the firm leveled accusations against the Bitcoin miner stemming from its recent partnership with US Bitcoin (USBTC) warning investors of potential trouble.","$HUT The J Capital Research report raises serious concerns about the merger of Hut 8 and U.S. Bitcoin Corp. (USBTC), now trading as \"New Hut\" on Nasdaq as $HUT. https:\/\/t.co\/qSdinZxh6q","— yvsx (@yvsx) January 18, 2024","","The firm claims that USBTC promoters have a history of legal trouble. Additionally, accusers say the company has previously defaulted on loan payments and paid fines on two separate occasions. ","What’s more, the firm alleged that the company’s management hides stock ownership of the largest shareholders through an undisclosed related party. ","On Nov 30, the Canadian miners announced the partnership with USBTC creating a new business partnership described as the biggest M&A transaction to have transpired within the digital asset industry as the CEO of HUT 8 Jamie Laverton expressed optimism. ","The move created New Hut under the trading ticker TSE:HUT and its price plummeted over 20% after the release of the report by JCapital. ","According to the report, Hut 8 inherited a huge debt from the merger with other flagged details that concluded it was a pump-and-dumps target. An insider revealed that the merger was a “godsend” for USBTC as the company would have gone bankrupt within weeks after the company lost about 50% of its miners in addition to other assets. The report added:","“Our interviewee said that USBTC “begged” NYDIG to forgive the loan but soon after Christ-mas was forced to surrender assets. Hut 8 managed to characterize this default as a $23.7 mln GAIN on debt extinguishment. But it had started as a $24.2 mln LOSS that the company “fixed” through an accounting sleight of hand. Abracadabra!” ","Furthermore, the company states that the value of USBTC was 70% less meaning HUT 8 paid way more than expected. This is because the main asset of USBTC is not operating at optimal capacity to mine more Bitcoin. The co-founders also locked up a fraction of their shares in the company alongside claims of promoters linked with fraud claims including charges from the Securities and Exchange Commission (SEC). ","“Ultimately, we strongly believe that [HUT} shareholders are likely to feel the pain of being on the wrong side of an over-levered pump-and-dump, only to be left holding the most inefficient Bitcoin miner, which is unprofitable even at a Bitcoin price of over $60,000.” ","At press time, Hut 8 is down by 23.49% due to the report although the broader markets face a correction which has led to reduced miner prices. Marathon Digital (MARA) is down by 6.89% while  Riot Platforms has plummeted by 4.97%."],"entity":[{"type":"$60,000","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"US Bitcoin (USBTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Christ","content":"LOCATION"},{"type":"$24.2 mln","content":"MONEY"},{"type":"JCapital Research","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"January 18, 2024","content":"DATE"},{"type":"Bitcoin miner","content":"ORGANIZATION"},{"type":"HUT 8 Jamie Laverton","content":"ORGANIZATION"},{"type":"$23.7 mln","content":"MONEY"},{"type":"23.49%","content":"PERCENT"},{"type":"$HUT","content":"MONEY"},{"type":"6.89%","content":"PERCENT"},{"type":"Nov 30","content":"DATE"},{"type":"4.97%","content":"PERCENT"},{"type":"U.S. Bitcoin Corp.","content":"ORGANIZATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Bitcoin","HUT 8","USBTC"],"authors":["David Pokima"]}