{"summary":"New Crypto to Launch Today – Will Evil Pepe Be The Next Pepe Coin to Explode?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-crypto-launch-today-will-evil-pepe-next-pepe-coin-explode.htm","publishDate":"2023-08-03T15:14:00","id":19234,"type":null,"title":"New Crypto to Launch Today – Will Evil Pepe Be The Next Pepe Coin to Explode?","category":["Altcoin News "],"content":["An exciting new Pepe the Frog-themed meme coin called Evil Pepe Coin ($EVILPEPE) is about to launch on decentralized exchanges (DEXs) for the first time today.","As per an update from the project’s official Twitter account, $EVILPEPE will debut at 1900 CET.","Today is the day. The most sininster of #Pepe is launching #EvilPepeCoin\n\n⏰ Today at 1900 CET\n🐸 Contract is already deployed\n😈 Presale can claim at launch\n☠️ Only follow official account for info\n\nIt's happening in just over 6 hours. Prepare yourself#Launchday #ERC20 #ETH pic.twitter.com\/wNzTcqAu0u","The launch comes just days after Evil Pepe Coin sold 90% of its token supply via a blockbuster presale that raised a $1.996 million in a matter of days.","Presale investors will be able to claim their tokens from 1900 CET in order to ensure a fair launch.","In wake of the original Pepe Coin’s explosion into prominence back in May, which saw it hit a market cap of $1.8 billion at highs, and the subsequent success of various other Pepe-themed tokens like Pepe2.0, Pepe3.0, XPepe and Saudi Pepe, meme coin degens are betting on Evil Pepe Coin to the be the next meme coin to explode.","Just over 2 hours away from launch of $EvilPepe\n\nIf you are presale you will claim your tokens at the time of launch, not before. And some useful info for all you sinister pepe loving traders..\n\nYou can find it here:https:\/\/t.co\/fhrvWQP6uH\n\nBuy it here:https:\/\/t.co\/p4Wo61JwCW pic.twitter.com\/AZKjM4K3XY","Evil Pepe’s presale valued the coin at a highly conservative $2.218 million, with the final 10% of the token’s supply dedicated to a one-month DEX liquidity lock.","That’s an incredibly low market cap that leaves a lot of room for 5, 10 or even 100x gains.","But will Evil Pepe Coin be the next meme coin to explode?","Let’s examine some reasons why this might be a crypto launch not to miss out on.","The stunning pace at which Evil Pepe Coin’s presale sold out at suggests that plenty of meme coin investors missed out.","That pent up demand could translate into an explosive DEX launch, as investors who missed out rush in to secure the token at the most favorable price possible.","FOMO (fear of missing out) could also play a big role at the token’s DEX launch.","The Evil Pepe Coin marketing team has been hard at work in recent days spreading the word about the project and drumming up hype.","They have secured features across the crypto media landscape, including on reputable websites like Binance, Outlook India, CoinGape, Cointelegraph, CryptoPotato, as well as here on Cryptonews, plus many more.","And high profile crypto influencers including the likes of Michael Wrubel and Conor Kenny have been singing the token’s praises.","The result of all this marketing is that, in just a few short weeks, they have succeeded in organically growing the project’s official Twitter profile and Telegram channel to more than 2,000 committed degens each.","It’s worth noting that Evil Pepe Coin is backed by the same marketing team that brought us SpongeBob ($SPONGE), which reached pumped to a market cap high of $80 million.","If Evil Pepe Coin can achieve the same result, presale investors could be sat on gains of around 40x.","$EVILPEPE may not hang around at a market cap of $2 million for long.","Evil Pepe Coin’s team have an explicitly stated goal for their token to reach a coveted market cap of $100 million.","In Evil Pepe Coin’s roadmap, which can be viewed in the project’s whitepaper here, the team says it hopes to achieve this goal by collaborating “with influential meme-makers, (and) forging alliances with the most wickedly creative minds in the meme coin universe”.","A market cap of $100 million would mean near-50x gains for the resourceful meme coin degens who managed to get in on the presale.","But it could mean more than 10x gains for any meme coin traders who is able to get in whilst the project still has a market cap of below $10 million.","But “why stop there?” the Evil Pepe Coin team asks.","“With our community’s unwavering support and Evil Pepe’s mischievous influence, we won’t shy away from pushing the boundaries and rewriting the rules of the meme coin game”.","Pepe Coin currently has a market cap of just over $600 million.","Wouldn’t it be fitting if Evil Pepe Coin was able to overtake its predecessor?","Meme coin investors who missed the presale, but want to get in on $EVILPEPE are advised to move quickly to secure their tokens via Uniswap as soon as trade is launched at 1900 CET.","Those who dawdle may end up having to pay a higher price.","Just double check you are buying the official $EVILPEPE token, not a scam coin, by verifying its token and Uniswap trading pair address against the addresses shared on the official Evil Pepe Coin website and Twitter.","Don’t miss out on one of 2023’s hottest meme coin opportunities."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Michael Wrubel","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$600 million","content":"MONEY"},{"type":"1900","content":"DATE"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$EvilPepe","content":"MONEY"},{"type":"Pepe","content":"PERSON"},{"type":"Pepe Coin","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"$2.218 million","content":"MONEY"},{"type":"Saudi Pepe","content":"LOCATION"},{"type":"Cointelegraph","content":"LOCATION"},{"type":"$1.996 million","content":"MONEY"},{"type":"Outlook India","content":"LOCATION"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$SPONGE","content":"MONEY"},{"type":"Evil Pepe Coin","content":"ORGANIZATION"},{"type":"$EVILPEPE","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Pepe’s","content":"PERSON"},{"type":"Conor Kenny","content":"PERSON"}],"hashtag":["ICO","Meme coin"],"authors":["Joel Frank"]}