{"summary":"The Key to Making More Money During a Crypto ICO? Look Trustworthy, New Study Says","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/the-key-to-making-more-money-during-an-ico-look-trustworthy-new-study-says.htm","publishDate":"2024-02-09T21:32:54","id":19244,"type":null,"title":"The Key to Making More Money During a Crypto ICO? Look Trustworthy, New Study Says","category":["Blockchain News "],"content":["A February 8 study from the Hanken School of Economics in Helsinki, Finland, has unveiled that a trustworthy appearance could boost investor funding in crypto initial coin offerings (ICOs) by an impressive 95%.","For context, ICOs typically refer to the raising of capital required to launch a new cryptocurrency-related product or service, similar to an initial public offering (IPO).","Using machine learning, Professor Sinh Toi Moi examined the facial features of individuals involved in 5,826 ICOs, seeking insights into how these traits influence perceived trustworthiness.","The results revealed that the “average amount raised by crypto ICOs in the top trustworthiness quintile is approximately $2.91 million (95%) higher than the average amount raised by crypto ICOs in the bottom trustworthiness quintile.”","The study suggests that “investors’ perception of facial trustworthiness may be misleading, however, and investors may suffer from a behavioral bias, namely the halo effect.”","The halo effect is a psychological tendency wherein people associate an overall favorable impression of an individual based on certain positive characteristics they possess.","Despite the positive effect facial trustworthiness had for certain members of the studied crypto ICOs, it did not always end positively for investors.","The study revealed that “facial trustworthiness is negatively associated with the post-ICO token cumulative return,” including “survival, listing on exchange, employment,” and “code development activity.” The correlation suggests that investors who overvalued crypto ICOs during initial fundraising periods attempt to “see their tokens and reverse their overinvestments.”","","Professor Toi Moi believes his research aligns with prior psychological studies that “investors may suffer from behavioral biases” and that “facial impressions may be misleading.”","The study, which is one of the first to discover individual investor bias throughout the crypto ICO market, also noted that individual investors may overcompensate for their insufficient understanding of certain technical aspects related to ICOs with more readily available information – in this case, whether or not an ICO member’s facial characteristics seem trustworthy.","“Further examination shows that the effect of facial trustworthiness is stronger when ICOs publish less code information on GitHub accounts or publish more complex white papers,” the study reads. “The result is consistent with prior studies and suggests that investors rely more on facial impressions when they have less fundamental information about ICO products.”","While not elaborated on in the study itself, the findings may connect to why scammers may be able to get away with raising substantial funding during the crypto ICO period."],"entity":[{"type":"February 8","content":"DATE"},{"type":"Helsinki","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Toi Moi","content":"PERSON"},{"type":"Finland","content":"LOCATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Sinh Toi Moi","content":"PERSON"},{"type":"$2.91 million","content":"MONEY"},{"type":"Hanken School of Economics","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"}],"hashtag":["Crypto ICO","Crypto investors","ICO"],"authors":["Julia Smith"]}