{"summary":"Volta Raises $4.1 Million in Seed Funding For Institutional Platform","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/volta-raises-4-1-million-in-seed-funding-for-institutional-platform.htm","publishDate":"2024-05-03T12:00:19","id":19243,"type":null,"title":"Volta Raises $4.1 Million in Seed Funding For Institutional Platform","category":["Blockchain News "],"content":["Volta has raised $4.1 million in seed funding to develop a crypto platform for institutional investors.","According to a press release shared with Cryptonews.com, the funding round was led by Fika Ventures and Haven Ventures. Other participants included Soma Capital, Dispersion Capital, and Uphonest Capital.","This investment aims to support the multi-signature, non-custodial platform Volta Circuit that targets enhanced speed, security, and compliance for its users.","To address scalability, security, and performance, the platform stated that it would integrate smart contract wallets, incorporating direct on-chain enforcement of governance and policy controls.","The architecture would provide expansion capabilities through a multi-signature wallet that facilitates authorized, single-signature transactions.","This feature allows traders to execute and manage transactions rapidly, ensuring direct control and ownership of assets without reliance on third-party key management.","In addition, Volta Circuit supports open signature standards, making it compatible with any wallet. This interoperability enables the customization and permission settings, improving wallet configuration flexibility.","“Volta Circuit is the new standard for a straightforward and safe way to work with digital assets,” said Volta co-founder and CEO George Melika. “We’re solving the key problems faced by investors by ensuring security, speed, and full ownership.”","“Volta Circuit is the only solution that gives institutions direct control of a fast, secure, scalable, and customizable infrastructure to build and scale digital asset businesses and trading operations without the limitations or costs of a centralized platform,” stated Melika.","The release included projections that the decentralized finance market is expected to reach $446 billion by 2030, with the market capitalization for on-chain tokenization anticipated to hit $16 trillion.","Despite these positive forecasts, the release noted that institutional investors still harbor concerns about the security, transfer, and management of these assets.","“The finance industry is undergoing a paradigm shift towards digitizing real-world assets and adopting distributed architectures, prompting traditional institutions to seek greater control over their assets,” said Haven Ventures co-founder McLain Southworth."],"entity":[{"type":"$16 trillion","content":"MONEY"},{"type":"Volta","content":"ORGANIZATION"},{"type":"Volta Circuit","content":"ORGANIZATION"},{"type":"George Melika","content":"PERSON"},{"type":"$446 billion","content":"MONEY"},{"type":"Soma Capital","content":"ORGANIZATION"},{"type":"Uphonest Capital","content":"ORGANIZATION"},{"type":"Haven Ventures","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$4.1 million","content":"MONEY"},{"type":"Fika Ventures","content":"ORGANIZATION"},{"type":"Dispersion Capital","content":"ORGANIZATION"},{"type":"McLain Southworth","content":"PERSON"}],"hashtag":["funding","Institutional Investors"],"authors":["Hongji Feng"]}