{"summary":"Web3 Gaming Firm Immutable Opens zkEVM Mainnet Early Access with Polygon","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/immutable-zkevm-mainnet-early-access-polygon-web3-gaming-goes-live.htm","publishDate":"2024-01-29T22:30:50","id":19254,"type":null,"title":"Web3 Gaming Firm Immutable Opens zkEVM Mainnet Early Access with Polygon","category":["Blockchain News "],"content":["Gods Unchained developer Immutable launched early access for its zkEVM Mainnet powered by Polygon on Monday.","In the early access period, a mainnet deployer allowlist will be in place to guarantee operational smoothness and user security. Initially, this allowlist will include specific game studios and ecosystem partners.","The zkEVM, a gaming chain based on Ethereum, enables game developers to incorporate personalized digital ownership and Web3 features into their games.","This innovation aims to enhance gaming industry capabilities, opening up fresh revenue opportunities for studios and granting players control over their digital assets, Immutable said.","A slew of games, including Guild of Guardians, Cool Cats,  BADMAD Robots, and Imaginary Ones, have committed to being early adopters on the platform.","When the Immutable zkEVM Testnet was introduced in Oct. 2022, it caught the attention of over 50 games eager to build on it.","#Immutable zkEVM: The Road to Mainnet & Beyond","With the recent launch of Immutable zkEVM Testnet, along with numerous games that have already begun building on it, Immutable zkEVM, powered by @0xPolygonLabs, is on track to become the home of gaming on Ethereum.","Over 50 games… pic.twitter.com\/5LyICTKNQ5","— Immutable (@Immutable) October 4, 2023","","Immutable co-founder Robbie Ferguson said in a statement:","“This is a chain built exclusively for gamers and gaming studios, and every step of the way, our development team made sure to implement any and all aspects a targeted gaming audience could ask for.”","“Over the last 12 months, over 200 games have committed to building on Immutable, bringing our market share close to 70%. 2024 is going to be the year a large number of these games go live, and we’ll see tens of millions of players adopt the next gaming experience,” he added.","Development of the zero-knowledge Ethereum Virtual Machine (zkEVM) project began in March when Immutable partnered with Polygon Labs. It “will allow both large game studios and independent developers to build high-quality games that support true asset ownership,” Immutable said in a statement at the time.","Meanwhile, Polygon launched its own highly-anticipated Ethereum-scaling zkEVM last March.","Immutable said that its zkEVM network is fully compatible with Ethereum apps, simplifying the transition for developers.","The protocol offers game developers cost savings and access to Ethereum’s security and network advantages.","zkEVM can process smart contracts using zero-knowledge technology, offering enhanced security and quicker transaction confirmation. It boasts advantages over Layer-1 1 and other Layer-2 rollups, including secure scalability, affordability, and faster transaction confirmation.","It boosts Ethereum’s scalability by moving computation off-chain, reducing the network’s computational workload.","Immutable’s existing products, such as Passport, Orderbook, and Checkout, will integrate with zkEVM, and ready-made smart contract templates will simplify the development process.","The chain also introduces a gas-free feature for gamers using Immutable Passport. This eliminates the primary user experience issue related to gas fees and allows players to engage in gaming and trading without encountering these fees."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"Oct. 2022","content":"DATE"},{"type":"1 1","content":"DATE"},{"type":"Immutable","content":"ORGANIZATION"},{"type":"Robbie Ferguson","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"October 4, 2023","content":"DATE"},{"type":"Mainnet & Beyond","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum Virtual Machine","Gaming"],"authors":["Shalini Nagarajan"]}