{"summary":"Bitcoin self-custodial Lightning wallet Phoenix has launched its third-generation wallet, introducing splicing technology to reduce fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239098\/phoenix-wallet-lightning","publishDate":"2023-07-12T06:37:57","id":1925,"type":null,"title":"Lightning Network wallet Phoenix adds &#x27;splicing&#x27; to reduce payment fees","category":["LAYER 2S AND SCALING"],"content":["Bitcoin self-custodial Lightning wallet Phoenix has launched its third-generation wallet, introducing splicing technology to reduce fees.","Splicing allows for resizing channels, eliminating the need for multiple channels per user which scatters liquidity, the project said. A common feedback from previous versions of Phoenix was the surprise creation of new channels and associated fees, Phoenix's development firm <a href=\"https:\/\/acinq.co\/blog\/phoenix-splicing-update\" data-v-f87c67ca=\"\">Acinq<\/a> wrote in a blog post on Tuesday. Users will now have a single dynamic channel, providing more predictability and control over incoming Lightning payments.","Lightning Network operates as a network of bi-directional payment channels on top of the Bitcoin blockchain, designed to enable fast and cost-effective micropayments. It offers a solution to the slower transaction speeds and higher fees associated with Bitcoin's mainnet, enabling users to transact directly without immediate settlement on the main blockchain.","Phoenix’s splicing technology allows users to add or remove funds from their channel without incurring future risk, and it can be priced at the current cost, according to Acinq. With ‘inbound liquidity,’ the capacity to receive Lightning payments that were previously scattered across channels, “it becomes very hard to predict when an incoming payment will trigger the creation of a new channel,” Acinq said. This unpredictability can be frustrating for users, as the opening and closing of Lightning channels have an on-chain cost.","Rather than creating new channels, the new version will “splice-in” funds. The wallet will display a fee warning beforehand, allowing users to adjust the maximum fee they are willing to pay to avoid unexpected charges. If the fee is too high Phoenix will retry later or reject the transaction.","With a single dynamic channel, the previous 1% fee on inbound liquidity (a minimum of 3,000 sats) is replaced by the mining fee for the underlying on-chain transaction, offering a more transparent and cost-effective solution.","“We believe that the efficiency gains brought by splicing are so phenomenal that all wallets will eventually implement it,” Acinq said.","Additionally, the fee for sending Lightning payments is also now shown in advance, fixed at 0.4% rather than a variable up to 0.5%, enabling users to validate fees before making transactions rather than simply trusting the wallet to find the cheapest route.","Unlike its previous trusted swap service to bridge between Bitcoin and Lightning, Phoenix will now offer trustless swaps directly in and out of the channel. The “splice-out\" feature allows users to remove funds from their channel to a Bitcoin address with the ability to set their own fee rate or adjust it later to expedite confirmation. Similarly, a “splice-in” transaction enables users to send on-chain transactions to their channel.","The wallet is currently available on Android, with an iOS version expected in a few weeks.","Lightning wallets like Phoenix and Muun have been looking at ways to reduce fees since the Ordinals protocol came to prominence <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">earlier<\/a> this year, enabling the creation of tokens and NFTs on Bitcoin and causing a <a href=\"https:\/\/www.theblock.co\/post\/232897\/bitcoin-active-users-fees-and-transactions-had-a-wild-ride-in-may-amid-memecoin-mania\" data-v-f87c67ca=\"\">surge<\/a> in transactions and fees on the network.","Last month, the Lightning Network hit a <a href=\"https:\/\/www.theblock.co\/post\/236315\/lightning-network-capacity\" data-v-f87c67ca=\"\">record-high<\/a> capacity of 5,630 BTC ($172 million) for the first time since April. It eclipsed this briefly on July 9 before falling on Monday, according to The Block's data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 9","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Phoenix","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"Acinq","content":"PERSON"},{"type":"0.4%","content":"PERCENT"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"$172 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}