{"summary":"New Partnership to Give ’83M Users’ Access to .blockchain NFT Domains","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-partnership-to-give-82m-users-access-to-blockchain-nft-domains.htm","publishDate":"2022-06-10T13:00:00","id":19253,"type":null,"title":"New Partnership to Give ’83M Users’ Access to .blockchain NFT Domains","category":["News "],"content":[" ","Domain and digital identity platform Unstoppable Domains is teaming up with major crypto company Blockchain.com to launch .blockchain non-fungible token (NFT) domains. Under their plan, 83 million Blockchain.com wallet users will be able to obtain a free .blockchain domain from their wallets “in the coming weeks.”","“With a .blockchain domain, our users can not only send and receive crypto as easily as they send email, but own their identity in Web3,” Lane Kasselman, Chief Business Officer at Blockchain.com, said in a statement.","“Our partnership with Unstoppable Domains marks the first custom top level domain (TLD) and gives us a unique way to share the .blockchain name with the millions of users of the Blockchain.com Wallet,” he said.","Users will also be allowed to buy new .blockchain domains through Unstoppable Domains and customize them, according to the statement. ","Unstoppable Domains offers NFT domains minted on the Polygon (MATIC) blockchain which are not subject to minting fees or renewal fees.","The latest development adds another layer of cooperation between the two companies. In 2021, Unstoppable Domains enabled Blockchain.com wallet users to send crypto to easy-to-remember domains instead of lengthy, alphanumeric wallet addresses. Last March, the platform also added the ability for users to send crypto to .x, .nft, .wallet, .coin, .bitcoin, .dao, and .888 domains with the use of their Blockchain.com wallets.","“By offering free blockchain domains to their users, Blockchain.com is helping unlock the potential of Web3 for millions of people across the world,” said Sandy Carter, SVP of Business Development at Unstoppable Domains.","____","Learn more: \n– Blockchain.com’s IPO Might Happen This Year, Indian Exchange CoinDCX Doubles Valuation\n– Brazil in Bitcoin Adoption Drive: Blockchain.com’s Expansion, Miners’ Tax Break, Real Estate Firm’s BTC Choice\n\n– Unstoppable Domains’ New Feature Allows Ethereum, Polygon Login With NFT Domains\n– Unstoppable Domains Joines Forces with 70 Companies for ‘Unstoppable Women of Web3’ Initiative\n___\n\n(Updated on June 13 at 08:16 UTC: 83 million, not 82 million Blockchain.com wallet users will be able to obtain a free .blockchain domain.)"],"entity":[{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Lane Kasselman","content":"PERSON"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Polygon Login With NFT Domains\n– Unstoppable Domains Joines Forces","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"SVP of Business Development","content":"ORGANIZATION"},{"type":"June 13","content":"DATE"}],"hashtag":["NFT","Non-fungible tokens","Wallet","Web3"],"authors":["Jaroslaw Adamowski"]}