{"summary":"Can Decentralized Social Media Redefine Online Community Engagement?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/decentralized-social-media-redefine-online-community-engagement.htm","publishDate":"2024-02-09T12:26:08","id":19276,"type":null,"title":"Can Decentralized Social Media Redefine Online Community Engagement?","category":["News "],"content":["Decentralized social media (DeSo) is a concept that is looking to stir up the digital landscape and promises to redefine how we connect online.","Meanwhile, traditional social media as we know it today is a vibrant hub of community engagement. It is a space where ideas flourish and voices are heard. But as we scroll through our feeds, a question lingers: Is there a better way to do this?","We now stand at the cusp of a revolution that promises to hand the reins back to the users.","The push towards DeSo arises from a growing discontent with how major companies manage privacy, political bias, user autonomy, and harmful content on their platforms.","What is this decentralization about? Unlike centralized platforms, they use independent servers or blockchain, giving users more control and transparency. This leads to better ownership and management of personal data and content.","Users often overlook the fact that they don’t really own their social media content, noted Arie Trouw, CEO at XY Labs.","“Instagram photos, tweets, and Facebook posts all live on centralized servers owned by private companies – companies that could choose to pull the plug at any time,” he said.","“Decentralized social media projects upend these absurd norms and grant users sovereignty over the content they create. Users are typically able to store their posts on their own private servers, protecting them from data collection and preserving them from deletion.”","Mastodon, a federated social network, and Steem, operating on a social blockchain, serve as notable examples. And just this week, Jack Dorsey-backed Bluesky opened its doors to all users by lifting invite-only restrictions.","The buzz surrounding decentralized social media is certainly palpable. Still, these platforms might be trickier to navigate and may not have all the cool features you’d find on mainstream social media.","The industry is actually just getting started, and is still in experimental phase — kind of like the early days of Web2 back in the 2000s.","Christian Quiver, CEO of decentralized social networking platform League.Tech, said that during that time, there wasn’t a clear winner between Facebook, MySpace, and other platforms.","“Ultimately, with that generation of centralized systems, what we saw play out were platforms that ended up being extractive in terms of user data and a lack of user monetization,” he said.","In Web3, creators can earn from their audience without relying on ads or data mining, fostering trust in a decentralized space, he added.","Users will likely adopt new social media formats if they provide a great user experience and valuable features. Christopher Bouzy, CEO of microblogging site Spoutible, noted that most users prioritize functionality, user interface, and ease of use over the technical aspects of platforms.","“Decentralized platforms, by virtue of their nature, tend to involve a learning curve and can present challenges in achieving the seamless experience provided by their centralized counterparts. This aspect can be a significant barrier to widespread adoption,” he said.","Juan Bruce, co-founder of Web3 social media firm DSCVR, agreed, emphasizing the importance of providing a user experience that matches or surpasses that of traditional centralized social networks.","“Users need to have a compelling reason to shift their time and engagement from a traditional network to a decentralized alternative, and one of the key aspects to this is offering incentives that are uniquely powered by blockchain networks,” he said.","He also underscored the necessity for these networks to run on high-performing blockchains like Solana, which can facilitate inexpensive and rapid transactions.","DeSo platforms should consider new revenue models like SocialFi and modest subscription fees for added features and experiences.","While they looks promising, these hasn’t really been put to the test yet. And whether they can make money in the long run is still up in the air.","Kevin Lu, CEO of Friendzone, a platform that plans to debut on Polygon, said: “For a decentralized social media application to sustain itself financially, it must build intrinsic value and utility beyond mere speculation which we haven’t seen yet.”","Friendzone, a decentralized social app, has announced its launch on the Polygon PoS ecosystem, marking a significant milestone in the evolution of Web3 social applications.","Spearheaded by veterans from Band Protocol, Synthetix, and Koinly, Friendzonehttps:\/\/t.co\/O4jx4wnAXb pic.twitter.com\/iNCYk1qyjB","— BitcoinWorld Media (@ItsBitcoinWorld) February 8, 2024","","He pointed to the emergence of platforms like Farcaster, offering an open protocol for integrated social media functions. Similarly, Lens provides a decentralized social graph, and Friendzone offers a modular protocol for value accrual.","These platforms address critical issues of ownership, transparency, verifiability, and incentives. Incumbents struggle or are unwilling to resolve these issues.","Ryan Lee, chief analyst at Bitget Research, said that DeSo platforms primarily depend on the liquidity of their native tokens for monetization. According to him, these platforms must first prioritize user-friendly mobile features to achieve significant monetization.","“DeSo gives control back to the content creators and viewers — both in terms of monetization and censorship,” he said.","Although DeSo seems promising, overcoming challenges related to financial sustainability, governance, regulations, and user experience is crucial for realizing its full potential."],"entity":[{"type":"Juan Bruce","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"February 8, 2024","content":"DATE"},{"type":"Kevin Lu","content":"PERSON"},{"type":"Christopher Bouzy","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"XY Labs","content":"ORGANIZATION"},{"type":"Arie Trouw","content":"PERSON"},{"type":"Bitget Research","content":"ORGANIZATION"},{"type":"Steem","content":"PERSON"},{"type":"2000s","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Ryan Lee","content":"PERSON"}],"hashtag":["Decentralization","Social media"],"authors":["Shalini Nagarajan"]}