{"summary":"Franklin Templeton Confident in Spot Bitcoin ETF’s Future, Awaits Advisor Familiarity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/franklin-templeton-confident-in-spot-bitcoin-etfs-future-awaits-advisor-familiarity.htm","publishDate":"2024-01-24T15:29:53","id":19278,"type":null,"title":"Franklin Templeton Confident in Spot Bitcoin ETF’s Future, Awaits Advisor Familiarity","category":["Bitcoin News "],"content":["The renowned financial services firm Franklin Templeton remains optimistic about the future of its spot Bitcoin ETF despite not yet achieving significant trading volumes compared to industry giants like BlackRock, Fidelity, and Grayscale.","While these major players account for about 90% of total trading volume in the spot Bitcoin ETF space, Franklin Templeton believes its product will gain traction. Interest could spike as financial advisors and investors become more familiar with the offering, crypto news outlet The Block reported on Tuesday.","Speaking with The Block, Roger Bayston, Head of Digital Assets at Franklin Templeton, expressed confidence in the spot Bitcoin ETF’s potential popularity and said education is key to showcasing how these assets complement existing portfolios. He stated:","“It’s just a matter of time […] as education moves forward about how these assets complement and help deliver potentially better long-term solutions alongside other assets in their portfolio.”","Bayston highlighted the product’s novelty and the platforms’ fiduciary responsibilities in filtering through providers to ensure clients achieve the best long-term results.","According to data on X on Tuesday by Bloomberg Intelligence’s senior ETF analyst Eric Balchunas, Franklin Templeton’s ETF with the ticker EZBC is the third to last by total flows, with $56 million in net inflows.","The leader among the new spot Bitcoin ETFs is the BlackRock\/iShares fund, with $1.69 billion in net inflows.","LATEST: The Great GBTC Gouge hit record -$640m on Monday, the Nine did their best to offset but fell short w\/ a $553m haul. ROLLING NET FLOWS still healthy at +$1b but ongoing battle. The Nine now have a 20% share vs GBTC. Volume also remains very high for new launches in 2nd wk pic.twitter.com\/ng0BU8mi6L","— Eric Balchunas (@EricBalchunas) January 23, 2024","","Franklin Templeton’s business revolves around collaborating with financial advisors to provide solutions for end clients.","Bayston’s view is in line with predictions from the independent investment bank and asset management firm Needham, which last month said Registered investment advisors (RIAs) will likely drive the Bitcoin ETFs once they are approved in the US.","In the interview with The Block, Bayston said he envisions his firm becoming a “digital asset provider of choice” as familiarity with spot Bitcoin ETFs grows within the investment community.","Despite starting with relatively modest trading volumes, Bayston said he believes Franklin Templeton will stand out among competitors.","He pointed out the firm’s commitment to digital assets, including building within the public blockchain community, as a key differentiator, saying this approach provides the firm with a unique understanding of the blockchain infrastructure compared to other providers.","“The idea that we offer deep investment services and research across the entire digital asset space is another differentiator,” Bayston said."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$553m","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Roger Bayston","content":"PERSON"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"January 23, 2024","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$1b","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$640m","content":"MONEY"},{"type":"Head of Digital Assets","content":"ORGANIZATION"},{"type":"Needham","content":"ORGANIZATION"},{"type":"$1.69 billion","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$56 million","content":"MONEY"},{"type":"Bayston","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","ETF","Franklin Templeton"],"authors":["Fredrik Vold"]}