{"summary":"New Russian Law Will Legalize Industrial Crypto Miners, Limit Private Mining","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-russian-law-will-legalize-industrial-crypto-miners-limit-private-mining.htm","publishDate":"2024-04-29T23:30:06","id":19272,"type":null,"title":"New Russian Law Will Legalize Industrial Crypto Miners, Limit Private Mining","category":["Blockchain News "],"content":["Russian lawmakers are poised to legalize the nation’s burgeoning industrial crypto mining sector, but could impose strict limits on home-based “private” miners.","Per the media outlets Finam and RBC, Deputy Chairman of the State Duma Committee on Information Policy Anton Gorelkin confirmed that the State Duma will debate a new mining law in the current session.","It appears that the mining bill will be bundled with proposed crypto regulation that would effectively ban crypto exchanges from operating in Russia.","Certain exceptions will be made for companies operating in a Central Bank-supervised sandbox.","However, the bank appears to have made this concession exclusively for international trade firms that use crypto in place of USD in international trade deals.","Industrial miners, it appears, may also be allowed access to these Moscow-controlled exchanges under the new proposals.","But they will only be allowed to use these platforms to sell their tokens.","Gorelkin explained that the new bill proposes that “only Russian firms and business operators who have obtained permission” will be allowed to continue mining.","Lawmakers have previously said they hope the bill will be adopted in the coming weeks, and that it will come into force on September 1.","Gorelkin added that “individuals who do not exceed energy consumption limits established by the government” would be free to mine coins “without applying for permits.”","This would be a step back from previous efforts to ban all forms of non-industrial crypto mining.","However, it remains to be seen what the proposed energy consumption caps would be. Russian energy providers have been cracking down on illegal mining operations in recent months, an indication that their tolerance threshold for home-based miners may already be low.","Industrial miners will also be obliged to provide reports on their activities to Rosfinmonitoring, the nation’s anti-money laundering agency.","Interestingly, perhaps, Gorelkin also made remarks about industrial miners being allowed to sell coins “without the use of Russian information infrastructure.”","This could be a reference to overseas crypto exchanges. Previous efforts to regulate crypto mining in Russia centered around the idea of forcing domestic firms to sell their coins on foreign trading platforms.","The Central Bank thinks that this policy would help keep crypto “out of the domestic economy.”","The bank has made this a priority demand, as it attempts to fast-track its digital ruble project.","Exclusive: As China's big banks pull back from financing Russia-related transactions, some Chinese companies are turning to small banks on the border and underground financing channels such as money brokers and banned cryptocurrency https:\/\/t.co\/GLmIBNPaHR","— Reuters (@Reuters) April 29, 2024","","The bill also appears to hand a certain degree of power to energy providers and local government bodies.","In the past, officials in mining hotspots like Irkutsk have complained that miners are placing excessive pressure on their grids.","Gorelkin explained that the proposed law “includes the possibility of giving the Russian government the right to ban mining activities in certain regions.”","However, he conceded, there is still much to “debate” about the possible “terms and scope” of such “bans.”","Cryptominers rack up big B5m unpaid electricity bill https:\/\/t.co\/fbR8ywG3Uc","— Malcolm Carter (@MalcolmThailand) April 29, 2024","","Russian law experts expressed mixed opinions about the news. RBC quoted Yuri Brisov, a partner at the legal consultancy Digital and Analogue Partners, as noting that lawmakers have tried – and failed – to regulate mining before.","The latest effort appears to be the result of intensive lobbying from the industrial mining sector.","And despite talk of adopting the bill in time for a September rollout, Brisov said that lawmakers would need to revise the draft law before a vote. He explained:","“This bill is already the eighth attempt to create a mining law. It is very crude, even the definition of mining is hastily set out. The writing is terrible. There is little chance that it will be accepted in its current form.”",""],"entity":[{"type":"Irkutsk","content":"LOCATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Gorelkin","content":"PERSON"},{"type":"State Duma","content":"ORGANIZATION"},{"type":"April 29, 2024","content":"DATE"},{"type":"September 1","content":"DATE"},{"type":"Malcolm Carter","content":"PERSON"},{"type":"Analogue Partners","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Yuri Brisov","content":"PERSON"},{"type":"RBC","content":"ORGANIZATION"},{"type":"State Duma Committee on Information Policy Anton Gorelkin","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Brisov","content":"PERSON"}],"hashtag":["Crypto Mining","Russia"],"authors":["Tim Alper"]}