{"summary":"OKX and Bybit Capitalize as Binance’s Market Share Declines + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/okx-and-bybit-capitalize-as-binances-market-share-declines-more-news.htm","publishDate":"2023-12-07T14:00:23","id":19271,"type":null,"title":"OKX and Bybit Capitalize as Binance’s Market Share Declines + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","Year-to-date, crypto exchanges Upbit, Bybit, and OKX have made the largest gain in spot market share, according to on-chain analytics firm CCData’s Exchange Review. They increased their dominance by 6.39%, 4.89%, and 3.86% to 9.20%, 5.80%, and 7.41%, respectively.","Meanwhile, Binance, BeQuant, and Crypto.com continue to see the highest decline in market share by spot trading volume, falling by 19.5%, 3.28%, and 2.96% to 31.8%, 0.45%, and 2.03%, respectively.","Looking at derivatives volumes, OKX and Bybit had the highest increase in market share, rising by 2.75% and 0.61% to 24.9% and 14.2%, respectively.","Binance, however, saw the highest decline in market share last month, falling by 2.30% to 47.6%.","This was Binance’s lowest derivatives market share since October 2020.","That said, Binance was the largest derivatives exchange in November by monthly volume, trading $1.26tn (up 30.5% compared to October), followed by OKX ($660bn, up 53.8%) and Bybit ($375bn, up 42.9%).","OKX and Bybit were the best-performing derivatives exchanges in the last month, recording an increase of 53.8% and 42.9%, respectively.","Onchain asset custody protocol Safe (previously Gnosis Safe) is collaborating with Swiss-regulated digital asset banking group Sygnum and UK-regulated recovery service provider CoinCover to launch Safe{RecoveryHub}.","Safe{RecoveryHub} offers a comprehensive range of recovery solutions for all digital asset holders, from large institutions to individual users, the press release said.","Users can recover access to their accounts through designated recoverers (one or more), including personal backup devices, family, friends, and collaborators, in a process known as “social recovery.”","Also, third-party service providers like Sygnum and CoinCover can be designated as recoverers.","Recoverers are given control by the user only in case of a recovery event. At all other times, users retain control through veto rights to cancel any recovery attempt.","Safe{RecoveryHub} is now available to all Safe{Wallet} users, while solutions from partners will be launched in the first half of 2024.","BNB Chain announced the launch of its DAU (Daily Active Users) Incentive Program.","Per the announcement, It will support the development of star projects building on BNB Smart Chain (BSC) that have launched within the last 6 months and have an average of 10 DAU in the 7-days prior to application.","Eligible projects will be ranked based on their average DAU during the month of program participation.","The program will offer rewards of up to $200,000 in BNB tokens per month.","The first prize will receive 45% of the total prize pool, the second prize will receive 25%, the third prize 15%, the fourth 10%, and the fifth 5%.","Web3 security company Blockaid announced the launch of a new Transaction Safety feature on the Rainbow wallet.","This security upgrade will provide the wallet users with real-time protection against malicious sites and apps, as well as full transparency into the path of each Web3 transaction before signing any confirmations.","“Blockaid and Rainbow aim to provide web3 users with more confidence to explore new apps and participate in the fast-growing decentralized ecosystem,” the two firms said.","Fabrica, a platform bringing real estate on the blockchain, and NFTfi, a peer-to-peer NFT lending platform, announced a partnership to launch lending for real land on the blockchain.","The partnership lets users borrow against their properties or offer loans to landowners on either Fabrica or NFTfi.","Landowners with all types of credit scores and financial history can tap into on-chain capital within minutes, the companies said in an email.","Fabrica’s platform lets users buy and sell real land via digital assets. It holds over 20 licenses, operates in all 50 states and has on-boarded over 300 properties to the platform.","NFTfi adds a blockchain-based digital asset lending infrastructure that has facilitated over $500 million in peer-to-peer loans to date.","Crypto exchange BitMEX announced a strategic partnership with crypto options platform PowerTrade. The partners will explore the integration of new products into BitMEX’s portfolio.","Power Trade is backed by Ascend Ventures, Pantera Capital, Ledger Prime, and QCP Capital, among others.","Its CEO Mario Gomez Lozada commented that the companies will combine PowerTrade’s advanced financial products with BitMEX’s established user base and liquidity.","BitMEX CEO Stephan Lutz added that the exchange recognizes “the dynamics and competitive nature of the market” and hopes “to set new standards for the future of crypto trading.”"],"entity":[{"type":"2.03%","content":"PERCENT"},{"type":"2.75%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"7.41%","content":"PERCENT"},{"type":"CCData’s Exchange Review","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.26","content":"MONEY"},{"type":"$200,000","content":"MONEY"},{"type":"47.6%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"5.80%","content":"PERCENT"},{"type":"Blockaid","content":"PERSON"},{"type":"19.5%","content":"PERCENT"},{"type":"0.45%","content":"PERCENT"},{"type":"42.9%","content":"PERCENT"},{"type":"2.96%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"0.61%","content":"PERCENT"},{"type":"3.28%","content":"PERCENT"},{"type":"Mario Gomez Lozada","content":"PERSON"},{"type":"31.8%","content":"PERCENT"},{"type":"Ascend Ventures","content":"ORGANIZATION"},{"type":"6.39%","content":"PERCENT"},{"type":"Stephan Lutz","content":"PERSON"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"9.20%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"October 2020","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"RecoveryHub}","content":"ORGANIZATION"},{"type":"DAU (Daily Active Users) Incentive Program","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"53.8%","content":"PERCENT"},{"type":"4.89%","content":"PERCENT"},{"type":"$660bn","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"$375bn","content":"MONEY"},{"type":"Gnosis","content":"PERSON"},{"type":"3.86%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"2.30%","content":"PERCENT"},{"type":"the first half of 2024","content":"DATE"},{"type":"14.2%","content":"PERCENT"},{"type":"$500 million","content":"MONEY"},{"type":"OKX","content":"ORGANIZATION"},{"type":"30.5%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"24.9%","content":"PERCENT"},{"type":"October","content":"DATE"}],"hashtag":["Binance","BitMEX","ByBit","Crypto.com","Lending","Market","Security","Upbit","Wallet"],"authors":["Sead Fadilpašić"]}