{"summary":"Bitcoin Price Crosses $59,000 Amid Wider Crypto Rally","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-crosses-59000-amid-wider-crypto-rally.htm","publishDate":"2024-02-28T09:45:43","id":19281,"type":null,"title":"Bitcoin Price Crosses $59,000 Amid Wider Crypto Rally","category":["Bitcoin News "],"content":["The price of Bitcoin (BTC) has crossed the $59,000 mark amid a notable rally within the broader cryptocurrency market.","At the time of writing, BTC is trading at $59,140, up by more than 5% over the past day. The leading cryptocurrency is up by 15% over the past week and around 40% over the past month. ","It is worth noting that Bitcoin is merely 14% away from its all-time high of $68,789 recorded in November 2021. ","The #Bitcoin bullish megaphone is playing out again!","Price is rapidly closing in on the target: $60,000. pic.twitter.com\/sELibMAraC","— Jelle (@CryptoJelleNL) February 28, 2024","","The surge in price comes as spot Bitcoin ETFs continue to attract investments from institutional investors. ","Data from Farside shows that total spot Bitcoin inflows has reached a staggering $6.7 billion since the SEC greenlighted the products on January 10. ","On average, these products have seen $210 million in daily inflows. ","In the past week, Bitcoin ETFs recorded an unprecedented $2.4 billion in weekly inflows, with BlackRock’s IBIT and Fidelity’s FBTC leading the charge, attracting $1.6 billion and $648 million, respectively. ","The spotlight on BlackRock’s iShares Bitcoin Trust (IBIT) is particularly noteworthy, as it outperformed nine other Bitcoin ETFs and ETFs of other asset classes, accumulating $1.673 billion in net inflows throughout the week. ","Meanwhile, the surge in Bitcoin price comes amid a rally in the broader crypto market. ","Ethereum, the second-largest cryptocurrency by market cap, has gained around 3% over the past day to hit $3,335. The token is up by over 45% over the past month. ","In a recent report, Matrixport predicted that Bitcoin could reach a target of $63,000 by March 2024. ","In its report, the firm identified four key catalysts that could propel Bitcoin to new heights, including the recent approval of spot Bitcoin ETFs, the upcoming halving event, and interest rate cuts. ","The report noted that the Bitcoin Halving event, slated for 2024, will further drive the price of BTC higher by reducing supply. ","The Bitcoin halving is a pre-scheduled event that reduces the reward for mining new blocks by half, effectively slowing the rate at which new bitcoins are created. ","Historically, halving events have been precursors to substantial price rallies, attributed to the reduced supply of new Bitcoins entering the market.","The report also mentioned that expectations of interest rate cuts following the Federal Reserve’s Federal Open Market Committee (FOMC) meetings could tilt the scales in favor of riskier assets like Bitcoin. ","Lower interest rates typically reduce the appeal of yield-generating investments, making growth-oriented assets more attractive.","Furthermore, the upcoming US presidential elections and policy uncertainty could also affect Bitcoin prices. ","Bitwise Chief Investment Officer Matt Hougan also expects Bitcoin to soar beyond $80,000 this year thanks to the recent success of spot ETFs.","Likewise, analysts at investment firm Bernstein expect Bitcoin to resume its upward trajectory, surpassing its previous all-time high of $69,000 and potentially reaching $70,000 this year.","The analysts have expressed confidence in the cryptocurrency’s risk-reward profile, stating that no significant challenges are anticipated to impede its ascent."," "],"entity":[{"type":"$59,000","content":"MONEY"},{"type":"$68,789","content":"MONEY"},{"type":"Matrixport","content":"PERSON"},{"type":"$59,140","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$1.673 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$63,000","content":"MONEY"},{"type":"$80,000","content":"MONEY"},{"type":"Bernstein","content":"PERSON"},{"type":"January 10","content":"DATE"},{"type":"$2.4 billion","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"February 28, 2024","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"Matt Hougan","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"$6.7 billion","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"$3,335","content":"MONEY"},{"type":"$210 million","content":"MONEY"},{"type":"March 2024","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"$70,000","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$648 million","content":"MONEY"},{"type":"Federal Reserve’s Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Price"],"authors":["Ruholamin Haqshanas"]}