{"summary":"Crypto Theft Plummets by 48% in March — Are Crypto Assets Getting Safer?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-theft-plummets-48-in-march-crypto-getting-safer.htm","publishDate":"2024-04-01T21:41:30","id":19285,"type":null,"title":"Crypto Theft Plummets by 48% in March — Are Crypto Assets Getting Safer?","category":["Blockchain News "],"content":["March saw a major decrease in crypto theft incidents, with malicious actors stealing approximately $79 million from decentralized finance (DeFi) projects, according to data from blockchain security firm CertiK.","The figure represents an incredible 48% drop compared to the $160 million stolen in February.","CertiK’s breakdown of the incidents revealed that targeted exploits on protocols led to the highest losses, amounting to $52.1 million. Flash loan attacks and phishing scams followed closely, resulting in combined losses of around $43 million. Exit scams accounted for an additional $5.7 million in losses.","#CertiKStatsAlert 🚨","Combining all the incidents in March we’ve confirmed ~$79m lost to exploits, hacks and scams after ~$69m was returned.","The total is a 48% decrease from February with phishing accounting for ~$21m","Exit scams: ~$5.7m\nFlash loans: ~$21.9m\nExploits: ~$52.1m… pic.twitter.com\/vdZN2S25K1","— CertiK Alert (@CertiKAlert) March 31, 2024","","One of the biggest crypto theft incidents in March involved Curio’s MakerDAO-based smart contract on Ethereum. Initial estimates suggested a loss of $16 million, but blockchain security company PeckShield later indicated that the actual amount stolen could be closer to $40 million.","Prisma Finance experienced the second most substantial loss in March, with a flash loan attack resulting in a theft of about $12.4 million. The perpetrator, claiming to be a white-hat hacker, promised to return the stolen funds after the project’s team held an online conference. During the event, the hacker demanded that the team members reveal their identities and issue a public apology.","The Binance-backed platform NFPrompt also fell victim to unauthorized access, leading to a loss of approximately $10 million. Another notable hack affected the WooFi decentralized exchange, which suffered losses of roughly $8.5 million.","Another hack incident has occurred.","The #Binance #Launchpool project, #NFPrompt, experienced a breach where hackers gained unauthorized access to certain wallets and funds. #hack #security","It happens every day :\/, we need to finally fix this. Dont you think? pic.twitter.com\/MoMNGGK3Ve","— Paweł Łaskarzewski (@PawelSynapse) March 15, 2024","","Other prominent crypto theft incidents in March include the NFT platform Remilia and the Web3 gaming platform Super Sushi Samurai, which lost approximately $4.7 million and $4.6 million, respectively.","As crypto theft activities decreased, asset returns experienced a major surge. CertiK’s data shows that owners recovered about $69.2 million in March, a considerable increase from the $7.8 million returned in February.","One of the biggest asset returns occurred on the Ethereum layer-2 network Blast-based gaming platform Munchables. A North Korean attacker voluntarily returned $62 million stolen from the platform without demanding a ransom. On March 27, Munchables identified the hacker as one of its developers. On the same day, Blast core contributors announced that $97 million in crypto stolen during the incident had been secured.","While the decline in crypto theft incidents and the increase in asset returns are encouraging signs, the question of whether crypto is safe now is still a big one. The industry continues to face challenges in ensuring the security of digital assets, and investors must be vigilant in protecting their investments from potential hacks and scams."],"entity":[{"type":"$160 million","content":"MONEY"},{"type":"$43 million","content":"MONEY"},{"type":"March 31, 2024","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"$8.5 million","content":"MONEY"},{"type":"March 27","content":"DATE"},{"type":"$5.7","content":"MONEY"},{"type":"$52.1","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"March 15, 2024","content":"DATE"},{"type":"$69.2 million","content":"MONEY"},{"type":"Super Sushi Samurai","content":"ORGANIZATION"},{"type":"$5.7 million","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"$7.8 million","content":"MONEY"},{"type":"Prisma Finance","content":"ORGANIZATION"},{"type":"$62 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$12.4 million","content":"MONEY"},{"type":"$4.7 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$69m","content":"MONEY"},{"type":"48%","content":"PERCENT"},{"type":"$4.6 million","content":"MONEY"},{"type":"$97 million","content":"MONEY"},{"type":"$52.1 million","content":"MONEY"},{"type":"$21.9","content":"MONEY"},{"type":"$79m","content":"MONEY"},{"type":"$79 million","content":"MONEY"},{"type":"$16 million","content":"MONEY"},{"type":"$21m","content":"MONEY"}],"hashtag":["Crypto hack","crypto scam","crypto theft"],"authors":["Trent Alan"]}