{"summary":"U.S. Treasury Department Highlights Increasing Use of Crypto by Criminals in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/u-s-treasury-department-highlights-increasing-use-of-crypto-by-criminals-in-2024.htm","publishDate":"2024-02-07T22:25:53","id":19286,"type":null,"title":"U.S. Treasury Department Highlights Increasing Use of Crypto by Criminals in 2024","category":["Blockchain News "],"content":["The U.S. Department of the Treasury has released its 2024 National Risk Assessments on Money Laundering, Terrorist Financing, and Proliferation Financing, outlining the most significant threats facing the United States in illicit finance.","The reports detail updates to the anti-money laundering and counter-financing of terrorism framework, addressing issues such as the fentanyl crisis, terrorist attacks, ransomware potency, professional money laundering, and digital payments’ growth.","The US Treasury Department has issued a stark warning regarding the escalating utilization of cryptocurrencies by criminals, fraudsters, and other illicit entities. This cautionary message was the focal point of three national risk assessment reports released on Wednesday, with a focus on Money Laundering, Terrorist Financing, and Proliferation Financing.","These reports underscore the mounting threats, vulnerabilities, and risks associated with illicit financing within the United States. The Treasury elaborated on how malicious actors exploit various channels, including cash and increasingly cryptocurrencies, to perpetrate fraud, drug trafficking, human smuggling, and corruption.","Money laundering remains a critical concern, with criminals utilizing various techniques to move illicit proceeds, including fraud, drug trafficking, cybercrime, human trafficking, and corruption. Terrorist financing threats persist both domestically and internationally, with foreign terrorist groups soliciting funds and domestic extremist movements posing challenges for law enforcement.","In proliferation financing, Russia and North Korea present heightened risks, with Russia expanding efforts to acquire U.S.-origin goods for its illegal activities in Ukraine and networks linked to North Korea exploiting the digital economy.","The report highlighted a significant shift among criminals and fraudsters towards virtual assets, marking a broader pattern of exploitation within digital finance. Cryptocurrencies are increasingly being leveraged as conduits for money laundering associated with a spectrum of illicit activities, including fraud, drug trafficking, human smuggling, and corruption.","Of particular note is the Treasury’s apprehension towards cryptocurrencies, which contrasts sharply with traditional laundering methods primarily involving cash-based operations linked to drug trafficking proceeds.","Furthermore, the Treasury outlined its plans to unveil a strategic plan in the forthcoming weeks, aimed at providing recommendations to address the concerns highlighted in the latest reports.","“Although the laundering of drug trafficking proceeds is predominantly cash-based, the use of virtual assets is a growing concern for U.S. law enforcement,” the Treasury stated in its money laundering report.","The Treasury highlighted the non-compliance of Virtual Asset Service Providers (VASPs), which it defines as entities facilitating exchanges between virtual assets and fiat currencies, among other functions. It was observed that many VASPs either claim exemption from regulatory rules or fail to register adequately.","Moreover, the Treasury emphasized the necessity for Decentralized Finance (DeFi) services, part of the financial system under the Bank Secrecy Act, to adhere to Anti-Money Laundering\/Combating the Financing of Terrorism (AML\/CFT) regulations. This oversight enables illicit actors to exploit these platforms, exacerbating the complexity of the regulatory landscape.","Furthermore, the assessment highlights the emerging threat posed by the online gaming industry, which, while innovative and rapidly expanding, introduces new avenues for money laundering. The online gaming environment’s anonymity and vast scale make it fertile ground for illicit financial activities, adding another layer of complexity to digital finance regulation.","Additionally, the report reveals that terrorist networks are diversifying their financial channels, turning to virtual assets for money transfers. Notably, there is a growing demand for stablecoins among these groups, indicating a strategic shift towards more stable digital currencies.","In response to these findings, the U.S. Treasury Department is gearing up to issue a strategic plan aimed at addressing vulnerabilities and risks identified in the 2024 assessments. This forthcoming plan is expected to offer detailed recommendations, signaling a proactive stance toward preventing abuse within digital finance."],"entity":[{"type":"Virtual Asset Service Providers","content":"ORGANIZATION"},{"type":"Bank Secrecy Act","content":"ORGANIZATION"},{"type":"U.S. Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Proliferation Financing","content":"ORGANIZATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Decentralized Finance (DeFi","content":"ORGANIZATION"},{"type":"Terrorist Financing","content":"ORGANIZATION"},{"type":"US Treasury Department","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"National Risk Assessments on Money Laundering","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["anti-money laundering","CRYPTO","US Treasury"],"authors":["Hassan Shittu"]}