{"summary":"Number of Central Banks Involved in CBDC Projects Almost Doubles in One Year","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/number-of-central-banks-involved-in-cbdc-projects-almost-doubles-year-on-year-bis-report.htm","publishDate":"2022-05-06T08:07:00","id":19296,"type":null,"title":"Number of Central Banks Involved in CBDC Projects Almost Doubles in One Year","category":["Bitcoin News "],"content":[" ","A rising number of central banks globally have the legal authority to issue central bank digital currencies (CBDCs), and, compared with a year earlier, the share of central banks which are currently developing a CBDC or running a pilot nearly doubled from 14% to 26%, according to a new report by the Bank for International Settlements (BIS) ","The report found that some 62% of central banks are running related experiments or proofs-of-concept.","The survey, under which the BIS collected answers by the end of December 2021, shows that the work on retail CBDCs is at a more developed stage than the work on wholesale CBDCs. Close to 20% of central banks are advancing or testing a retail CBDC. This is twice the share of central banks building or piloting a wholesale CBDC, according to the paper.","“Globally, more than two thirds of central banks consider that they are likely to or might possibly issue a retail CBDC in either the short or medium term,” the report states.","According to the BIS, 9 out of 10 central banks are exploring CBDCs, and: ","“More than half are now developing them or running concrete experiments. In particular, work on retail CBDCs has moved to more advanced stages.”","The bank says that both the COVID-19 pandemic and the emergence of stablecoins and cryptos have accelerated central banks’ work on CBDCs, in particular in advanced economies, where the surveyed institutions declared that financial stability has increased in importance as their motivation for involvement in CBDC projects.","On average, 79% of advanced economy central banks said the emergence of stablecoins and cryptoassets has accelerated their work on CBDCs, compared with 48% of central banks from emerging market and developing economies.","The BIS also finds that ensuring cross-border payments efficiency is increasingly a reason behind the work on wholesale CBDCs.","“Central banks consider CBDCs as capable of alleviating key pain points such as the limited operating hours of current payment systems and the length of current transaction chains,” the paper said.","Headquartered in Switzerland’s Basel, the BIS says it is jointly owned by the world’s 62 central banks, representing countries that together represent some 95% of the global gross domestic product (GDP).","____","Learn more:\n– Work on a Multi-CBDC Platform Has Revealed ‘More Questions Than Answers’ – BIS\n– BIS Indicates CBDC Issuance May Hinge on Private Sector Collaboration\n\n– Russia Sanctions May Lead More Countries To Consider CBDCs, Ex-Central Banker Says\n– Russian Tax Body Suggests Allowing Crypto Pay in Trade Deals, Digital Ruble May Be Ready by 2023\n– Digital Yuan Now Being Used to Pay Taxes in Chinese Pilot Zones\n\n– US Senator Suggests Banning Fed From Issuing a Direct-to-Consumer CBDC\n– CBDCs in 2022: New Trials and Competition with Crypto"],"entity":[{"type":"Switzerland","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Basel","content":"LOCATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"62%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"December 2021","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"79%","content":"PERCENT"},{"type":"26%","content":"PERCENT"},{"type":"48%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"Chinese Pilot Zones\n\n– US Senator Suggests Banning Fed","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Adoption","CBDC","Central Bank","Coronavirus","Cryptocurrency","Stablecoin"],"authors":["Jaroslaw Adamowski"]}