{"summary":"Short-Term Correction Brewing as BTC Price Increased Too Fast: CryptoQuant","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/short-term-correction-brewing-as-btc-price-increased-too-fast-cryptoquant.htm","publishDate":"2024-03-08T07:27:08","id":19297,"type":null,"title":"Short-Term Correction Brewing as BTC Price Increased Too Fast: CryptoQuant","category":["News "],"content":["Bitcoin price hit an all-time-high of $69,000 on Tuesday — the price is continuing to hover around the $67,000 mark — but a short-term pause or correction may be brewing as prices have increased too fast, according to crypto market data, on-chain data provider CryptoQuant.","Data from the firm shows that Bitcoin inflows into accumulation addresses have reached record daily inflows of 38,000 Bitcoin just as prices approached record-high levels. Bitcoin price touched a fresh all-time high mostly amid record-high money flows from new investors. This is evident due to Bitcoin flows into accumulation addresses and growing ETF holdings highlights CryptoQuant.","“Indeed, the total Bitcoin holdings of accumulation addresses also reached record-high levels. The total holdings at these addresses are now 1.5 million Bitcoin. These addresses denote investors that only accumulate Bitcoin and have never sell, so the accelerating growth in their Bitcoin holdings is a sign of strong demand,” said CryptoQuant in the research note.","CryptoQuant reports that the total Bitcoin holdings of ETFs (excluding the Grayscale GBTC) stand at 360,000 Bitcoin, representing 1.8% of the total Bitcoin supply.","The approval of eleven Bitcoin spot ETFs in the U.S. earlier this year shows there is a huge appetite for such products. BlackRock is the world’s largest asset manager with $10 trillion in assets as of December 31. Unsurprisingly, the firm entering Bitcoin with a new Spot Bitcoin product has triggered another bull market.","Bitcoin’s price prediction takes centre stage as Bitget’s Managing Director, Gracy Chen, forecasts a potential climb to $120,000 – $140,000. This bold prediction hinges on recent ETF net inflows, suggesting an imminent rally, reports Arslan Butt from Cryptonews. With Bitcoin currently trading near $67,000 and showing signs of resilience after a sharp pullback, the stage is set for what could be an unparalleled bull market cycle."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"December 31","content":"DATE"},{"type":"Gracy Chen","content":"PERSON"},{"type":"1.8%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"$10 trillion","content":"MONEY"},{"type":"$67,000","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"$120,000","content":"MONEY"},{"type":"$140,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Bitcoin Price Prediction","CryptoQuant"],"authors":["Tanzeel Akhtar"]}