{"summary":"Blockchain monitoring startup Metrika has raised $14 million in a Series A funding round led by Neotribe Ventures.\nMetrika plans to expand its platform’s capacity and broaden its customer base across industries.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118169\/blockchain-monitoring-startup-metrika-raises-14-million-coinbase-ventures","publishDate":"2021-09-21T10:00:30","id":1929,"type":null,"title":"Blockchain monitoring startup Metrika raises $14 million in Series A","category":["Venture Capital"],"content":["Metrika, a U.S.-based startup that provides operational monitoring tools for blockchain networks, has raised $14 million in a Series A funding round.","The round was led by Neotribe Ventures, with participation from Coinbase Ventures, Samsung NEXT, Nyca Partners, and SCB 10X, among others. This was an equity round and as part of the deal, Swaroop \"Kittu\" Kolluri from Neotribe Ventures has also joined Metrika’s board, Metrika CEO Nikos Andrikogiannopoulos told The Block.","With fresh capital at hand, Metrika plans to expand its platform's capacity and broaden its customer base across industries. \"We are allocating the funding for continued development of our first-of-its-kind operational intelligence platform for blockchains, and to integrate our solutions into a wider range of blockchain-based applications,\" said Andrikogiannopoulos. \"We’re also planning to increase marketing efforts to encourage platform adoption, and extend our reach further into the crypto ecosystem.\"","Metrika's current clients include Algorand, Solana, ConsenSys, Dapper Labs (creator of NBA Top Shot), Hedera Hashgraph, and Blockdaemon. The firm essentially helps keep these clients' blockchain networks up and running via dashboards, reports, and \"real-time\" alerts. Its business model is based on subscriptions, said Andrikogiannopoulos.","The funding news comes one week after Solana <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117711\/solana-blockchain-validators-restart-network-after-transaction-stoppage\" data-v-f87c67ca=\"\">experienced<\/a> a major outage that lasted for over 17 hours. When asked why Metrika didn't help prevent the outage, Andrikogiannopoulos said Solana is one of the firm's newest clients. \"Over the past month, we’ve been setting up our platform on the Solana network which, when fully operational, will strengthen enormously the level of operational insights on the Solana network and help prevent future outages.\"","There are currently 16 people working for Metrika and the firm is hiring across several functions, including software development, analytics, product management, sales, and marketing, said Andrikogiannopoulos.","The Series A round brings Metrika's total funding to date to $17.7 million. The firm has previously raised $3.7 million in a seed round."],"hashtag":["SERIES A"]}