{"summary":"Square Enix’s NFT Game Symbiogenesis Sets Auction Dates, Launches December 21 – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/square-enixs-nft-game-symbiogenesis-sets-auction-dates-launches-december-21-heres-what-you-need-to-know.htm","publishDate":"2023-11-27T11:35:05","id":19291,"type":null,"title":"Square Enix’s NFT Game Symbiogenesis Sets Auction Dates, Launches December 21 – Here’s What You Need to Know","category":["NFT News "],"content":["The Japanese gaming giant Square Enix has begun the character non-fungible token (NFT) auction for its game Symbiogenesis, less than a month before its launch.","The official website shows the game is scheduled for launch on December 21.","‍Once users log in to the game, an additional 400EXP will be added to the Daily Reward for holding the NFT Characters.","“So, be sure to hold on to these NFTs and have your MetaMask wallet and Discord account ready before starting the game,” the Final Fantasy series creator said.","As the launch of this Ethereum and Polygon NFT game approaches, Square Enix revealed auction details.","It will be held in three phases, according to the company’s tweet.","The first one starts today, November 27, and lasts until tomorrow.","Phase 2 is scheduled for November 30 until December 1. The third phase will follow on December 2, also lasting 24 hours.","According to the website, the first phase is ‘Stakeholder Mint,’ the second ‘Priority Mint,’ and the third ‘AL Mint’.","Square Enix will launch only 500 NFTs for Chapter 1 of the game. Ten characters are allocated for the first phase, 90 for the second, and 400 for the third.","Users can bid only on one character in Phases 1 and 2. There are no limits in Phase 3.","Furthermore, the team announced additional perks for the bidders.","As Cryptonews reported, there is no public mint for Symbiogenesis. Users had to participate in the Allow List Entry Campaign to mint NFT Characters in any phase.","Also, the Phase 2 Priority Mint offers a chance to get characters for free, but becoming top in rank in the Campaign is necessary.","As noted, the auction is open only to those who were selected for the Allow List during the Allow List Entry Campaign.","For Phases 1 and 2, bidders who are outbid and fall below second place will be eligible to bid on a different character.","Participants in Phase 2 are eligible for Phase 3, where they are allowed to bid on more than one character.","The mint price for all phases begins from 0 ETH. Bidding can be made in 0.01 ETH increments. Each bid will incur gas fees.","An English Auction will occur if other bidders are on the line. No midway cancellations are allowed for the bidder who is first in position.","If a bid is made within the final 5 minutes of a phase, the mint period for that character will be extended by an additional 5 minutes “to ensure a clearer final bidding process, as well to avoid potential confusion due to last-minute bids.”","Winners must claim their NFT Characters by December 6. The gas fee for each claim is the responsibility of the user.","Additionally, participants who hold onto their NFT Characters and log into the game with the same wallet by December 28 will receive an extra 5 Replica Issue Points on December 29.","Learn more: Final Fantasy Publisher Square Enix Reveals How to Obtain NFTs for Upcoming Game Symbiogenesis"],"entity":[{"type":"December 21","content":"DATE"},{"type":"Final Fantasy Publisher Square Enix","content":"ORGANIZATION"},{"type":"Square Enix","content":"ORGANIZATION"},{"type":"November 27","content":"DATE"},{"type":"Enix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"December 6","content":"DATE"},{"type":"Replica Issue Points","content":"ORGANIZATION"},{"type":"December 1","content":"DATE"},{"type":"November 30","content":"DATE"},{"type":"Phase 3","content":"DATE"},{"type":"December 2","content":"DATE"},{"type":"Polygon NFT","content":"ORGANIZATION"},{"type":"December 29","content":"DATE"},{"type":"December 28","content":"DATE"}],"hashtag":["Community","Ethereum","Gaming","NFT","Non-fungible tokens","Polygon"],"authors":["Sead Fadilpašić"]}