{"summary":"Institutional Interest for Bitcoin Rises, Yet Challenges May Hamper Future Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/institutional-interest-for-bitcoin-rises-yet-challenges-may-hamper-future-adoption.htm","publishDate":"2024-03-14T19:46:36","id":19295,"type":null,"title":"Institutional Interest for Bitcoin Rises, Yet Challenges May Hamper Future Adoption","category":["Bitcoin News "],"content":["Institutional interest for Bitcoin and other digital assets has been apparent in previous years. Yet industry experts believe that investors are taking a newfound interest in Bitcoin (BTC) following the approval of 11 US spot Bitcoin exchange-traded funds (ETFs).","David Lawant, Head of Research at FalconX – an institutional crypto brokerage – told Cryptonews that increasing institutional interest for digital assets has become evident based on recent data.","“Since mid-last year, when Blackrock filed for a spot Bitcoin ETF and the approval began to seem like a genuine possibility, the conversation around institutional interest started to shift,” said Lawant. “With the exceptional performance of spot Bitcoin ETFs, it has been further accelerated.”","According to Lawant, one of the best ways to gauge adoption of US-based large institutional investors is by comparing the open interest with the basis – which is the difference between futures and spot prices – at the Chicago Mercantile Exchange (CME).","“For instance, the chart directly below shows futures open interest by exchanges,” said Lawant. “The second chart shows the CME basis for both Bitcoin and Ethereum (ETH).”",""," ","","Lawant pointed out that both charts reveal unprecedented interest by institutions.","“The CME overtook the first spot in Bitcoin’s future open interest at the end of last year, and it has been gaining further share since then,” he said. “Also, the CME basis remains elevated, especially for Bitcoin futures.”","Matthew Niemerg, Co-Founder of the Layer-1 platform Aleph Zero, told Cryptonews that Microstrategy issuing over $800 million of low-interest senior convertible notes to buy Bitcoin is another example of continued institutional adoption in digital assets.","Institutional interest in Bitcoin may also be the reason behind BTC’s recent record-breaking highs.","“Indeed, this is contributing to the rise in the price of Bitcoin, which is evident from the inflows,” said Niemerg. “I anticipate that this trend will continue, mirroring the trajectory seen with tokens – beginning with BTC, then ETH, and subsequently encompassing all other assets.”","#Bitcoin's price briefly rose above its previous all-time high, driven by inflows into US-listed spot #Bitcoin ETFs. Past performance is not indicative of future results","Read our full analysis: https:\/\/t.co\/LWJ8wO59mZ pic.twitter.com\/3QoENLNGSj","— Grayscale (@Grayscale) March 14, 2024","","Matt Ballensweig, Head of Go Network – a digital asset settlement solution from BitGo – told Cryptonews that the rising price of Bitcoin may also be attributed to Blackrock CEO Larry Fink’s recent support.","“Fink has recently been a vocal champion of Bitcoin having a place within institutional portfolios and similarly, Fidelity has now recommended a multitude of different portfolios across different risk thresholds, each consisting of some percentage of digital assets,” Ballensweig said. “These endorsements cannot be understated as it pertains to their impact on asset allocation from hedge funds, pensions, endowments and RIAs”","Yet while it’s notable that institutional interest in digital assets has been gaining traction, experts warn that ongoing challenges within the crypto industry may slow adoption.","For instance, Niemerg pointed out that the biggest hurdle for institutions buying digital assets relates to security and compliance.","“Institutions require robust safeguards against theft through smart contract vulnerabilities,” he said.","Niemerg added that the lack of security within smart contract platforms has already cost the decentralized finance (DeFi) sector billions annually.","Most recently, the DeFi protocol Unizen had a security breach that resulted in the loss of approximately $2.1 million in user funds. As Cryptonews previously reported, the hacker exploited an external call vulnerability within the Ethereum-based contract, converting the stolen USDT to DAI.","Niemerg believes that implementing failsafes, insurance, and optional privacy features at a protocol level could mitigate these risks without compromising DeFi’s open and permissionless nature. Such implementations may also ensure continued interest from institutions.","Niemerg pointed out that compliance is equally as critical.","“Institutions need assurance that they won’t unwittingly interact with sanctioned addresses or fall afoul of regulations,” he said.","Niemerg also noted that enforcing Know Your Customer (KYC) and Anti-Money Laundering (AML) checks at the protocol level is critical.","“This would enable compliant trading with verified counterparties,” he remarked.","Regulatory clarity is also becoming increasingly important as institutions dip their toes into Bitcoin. Even with the approval of spot Bitcoin ETFs, there are other ongoing aspects relating to Bitcoin that may create concerns in the future.","For instance, US President Joe Biden released his 2025 budget proposal on March 11. The proposal features a number of provisions aimed at altering the cryptocurrency industry, including a wash sale rule for digital assets.","Jonathan Bander, Head of Tax Strategy at ExperityCPA, told Cryptonews that the proposed implementation of wash sale rules within the crypto industry stands to initiate a profound transformation for institutional investors.","“These regulations would inevitably increase the burden of compliance, demanding meticulous attention to transaction tracking and potentially leading to higher operational expenses,” said Bander. “Furthermore, the limitations on claiming tax benefits could diminish the appeal of certain trading strategies, compelling institutions to reassess their methods.”","According to Bander, a wash sale rule for digital assets could hinder market accessibility, reduce liquidity, and increase market uncertainty, posing challenges for both institutional and retail investors.","Additionally, John Lilic, Executive Director of the Telos Foundation, said he believes scalability is the primary challenge for institutions entering the crypto sphere.","“The demand from institutions necessitates achieving extensive scalability, high throughput, and significantly reduced transactional costs,” said Lilic.","Data from Ycharts shows that Bitcoin transaction fees were $8.075 on March 12.","It’s also worth mentioning that Gas fees on the Ethereum mainnet remain high, above 72 gwei according to Ycharts. To put this in perspective, an average swap would cost users $86.15 in gas fees, according to Etherscan data.","Challenges aside, Ballensweig remarked that Bitcoin adoption will likely continue for institutions, especially given regulatory clarity taking place in regions outside of the US.","“There seems to be a softening towards regulation of digital assets globally,” he said. “This has become apparent with the UK allowing Bitcoin-linked securities to be listed on the stock market and South Korea weighing options to lift the ban on spot Bitcoin ETFs, so we are making steps in the right direction.”","Echoing this, Lilic added that Hong Kong is becoming increasingly important for institutional adoption of digital assets too.","“Recently, I had the opportunity to visit and spend time with my longtime Ethereum buddy, Lawrence Chu,” said Lilic. “His team is leading efforts to pre-empt the United States in adopting an ETH ETF in Hong Kong. I am confident in their success, and the growing momentum underscores institutional interest in digital assets.”","This may very well be the case, as Hong Kong-based institutions are actively preparing to launch spot ETFs for Ethereum.","Moreover, Niemerg remarked that the required infrastructure is finally in place for institutions to move forward with digital asset adoption.","For example, he pointed out that institutions having qualified custodians has been implemented.","“This has allowed institutions to further purchase digital assets,” he said. “With the right technical and regulatory groundwork, institutions can confidently participate in DeFi markets, unlocking greater liquidity and adoption.”"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"John Lilic","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Niemerg","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"Bander","content":"PERSON"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Fink","content":"PERSON"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Head of Tax Strategy","content":"ORGANIZATION"},{"type":"Matt Ballensweig","content":"PERSON"},{"type":"Lawrence Chu","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"David Lawant","content":"PERSON"},{"type":"Matthew Niemerg","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$8.075","content":"MONEY"},{"type":"Lawant","content":"LOCATION"},{"type":"Lawant","content":"PERSON"},{"type":"$2.1 million","content":"MONEY"},{"type":"Lilic","content":"PERSON"},{"type":"March 12","content":"DATE"},{"type":"$86.15","content":"MONEY"},{"type":"March 11","content":"DATE"},{"type":"Telos Foundation","content":"ORGANIZATION"},{"type":"March 14, 2024","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Niemerg","content":"PERSON"},{"type":"Jonathan Bander","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"Unizen","content":"PERSON"},{"type":"Ballensweig","content":"PERSON"},{"type":"$800 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Adoption","Bitcoin","United States"],"authors":["Rachel Wolfson"]}