{"summary":"Prospective spot bitcoin ETF issuers need to submit their final filings and wait for their forms to be approved before they can start trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270498\/heres-how-spot-bitcoin-etf-issuers-are-anticipating-the-coming-days-to-play-out","publishDate":"2024-01-04T17:41:10","id":193,"type":null,"title":"Here&#x27;s how spot bitcoin ETF issuers are anticipating the coming days to play out","category":["COMPANIES"],"content":["Prospective spot bitcoin ETF issuers are able and ready to start trading as early as next week, if the Securities and Exchange Commission approves the necessary filings, according to three sources involved in the process.","But first, issuers and exchanges need to get some final filings ready.","Over the next three business days, Grayscale Investments is working toward the filing of an amended form 19b-4, according to a source. This is needed because <a href=\"https:\/\/www.theblock.co\/post\/258299\/grayscale-submits-new-filing-to-sec-in-attempt-for-spot-bitcoin-etf-approval-following-pivotal-court-ruling\" data-v-f87c67ca=\"\">previous paperwork<\/a> was filed months ago and needs a refresh, the source said. This would likely first show up in a rulemaking section of the <a href=\"https:\/\/www.nyse.com\/regulation\/rule-filings\" data-v-f87c67ca=\"\">NYSE website<\/a>.","The prospective spot bitcoin ETF issuers will also need to file final S-1 forms, laying out the fees, naming the authorized participants and removing any bracketed items, according to a different source.&nbsp;","In order for spot bitcoin ETFs to go live, the SEC would need to approve the outstanding 19b-4 forms for each fund, which would likely first appear on the <a href=\"https:\/\/www.sec.gov\/rules\/sro\/national-securities-exchanges\" data-v-f87c67ca=\"\">SEC's website<\/a>. The S-1 forms will also need to become effective. The approvals of the separate forms won't necessarily come at the same time.&nbsp;","\"The morning after both are true, trading will start,\" said a source at one prospective issuer.","One source said the 19b-4 approvals will probably come mid-to-late next week and that trading could begin as early as Thursday or Friday next week. Another source noted there is still some uncertainty, given that some spot bitcoin ETFs, including BlackRock's, don't have deadlines until March.","Bloomberg Intelligence ETF analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1742989633561190454\" data-v-f87c67ca=\"\">noted on X<\/a> that the \"SEC is giving final comments as we speak, then issuers will submit final 19b-4s and S-1s soon after. So I mean this is [definitely] as close to 'done' as we've been but no official approval as far as I know.\"","\"We don’t comment on individual filings,\" a spokesperson for the SEC told The Block in an emailed response to questions. \"Broadly speaking, if the Commission declares a registration statement effective, that is reflected on EDGAR. Any Commission 19b-4 orders will be posted on our website and then published in the Federal Register.\"","In the last two days, multiple prospective spot bitcoin ETF issuers have <a href=\"https:\/\/www.theblock.co\/post\/270379\/fidelity-grayscale-filing-8-a-forms-show-progress-for-spot-bitcoin-etf-applications\" data-v-f87c67ca=\"\">submitted Form 8-As<\/a>, another step forward in the process. This includes Fidelity, Grayscale, Ark Investments, Valkyrie and VanEck, and t<span data-v-03de5780=\"\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">he move signifies registration that allows issuers to trade on an exchange once the product has been approved.<\/span><\/span>","Over the last few months, issuers have been working closely with the SEC to try and <a href=\"https:\/\/www.theblock.co\/post\/270222\/issuers-have-fixed-three-of-the-secs-remaining-concerns-for-spot-bitcoin-etfs-sources\" data-v-f87c67ca=\"\">fix any of its remaining concerns<\/a>. Three key issues have been hashed out, including<span class=\"s1\" data-v-03de5780=\"\" data-v-f87c67ca=\"\"> which redemption models to go with, the naming of authorized participants and the question of how to manage hard forks and airdrops.<\/span>","<span data-v-03de5780=\"\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-03de5780=\"\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/269732\/blackrock-updates-sec-filing-for-spot-bitcoin-etf-names-jane-street-and-jpmorgan-as-authorized-participants\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">BlackRock<\/a>, for example, named Jane Street Capital and JP Morgan Securities as authorized participants over the past week. V<\/span><span class=\"s4\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">alkyrie named Jane Street Capital and Cantor Fitzgerald.<\/span><\/span> Goldman Sachs also reportedly <a href=\"https:\/\/www.theblock.co\/post\/270193\/goldman-sachs-may-play-key-role-in-spot-bitcoin-etfs-via-blackrock-grayscale-report\" data-v-f87c67ca=\"\">wants to get involved<\/a>.","The agency could also further delay a spot bitcoin ETF launch, said James Angel, associate professor at Georgetown University.","\"The SEC has a number of ways they can slow things down even more,\" Angel said. \"They can basically go to the issuer and say, if you want the answer today it's no. What we want you to do is withdraw your application and refile it to start the clock again and here is what we want you to do.\"","\"Although the deadlines are there, the SEC has plenty of ability to coerce the registrants to voluntarily agree to a delay,\" Angel noted, adding that issuers could go to court, but that could take months.","\"Anything can happen,\" he added.","(<em data-v-f87c67ca=\"\">With additional reporting assistance from Sarah Wynn.<\/em>)","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Angel","content":"PERSON"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"Georgetown University","content":"ORGANIZATION"},{"type":"JP Morgan Securities","content":"ORGANIZATION"},{"type":"4","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Sarah Wynn","content":"PERSON"},{"type":"Cantor Fitzgerald","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"James Angel","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"last two days","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Commission 19b","content":"ORGANIZATION"},{"type":"Jane Street Capital","content":"ORGANIZATION"}],"hashtag":["SEC","SPOT BITCOIN ETF"],"authors":["Tim Copeland","Frank Chaparro","The Block"]}