{"summary":"The Financial Conduct Authority (FCA), the UK watchdog for consumer and investment protection, has published revised guidance on cryptoassets following consultation\nThe finalised guidelines fall in line with existing norms and match recommendations the FCA received from the industry\nThe regulator has, however, kept its tough stance on crypto derivatives trading","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34125\/uk-regulator-issues-relaxed-guidance-on-crypto-and-clear-domain-over-security-tokens","publishDate":"2019-07-31T07:34:00","id":193,"type":null,"title":"UK regulator issues relaxed guidance on crypto and clear domain over security tokens","category":["Regulation"],"content":["After promising to deliver clarification on crypto assets last year, the UK financial watchdog, the FCA, has published an updated report on the crypto market in the country.","Wednesday’s guidance is as expected, offering a comprehensive overview of what the FCA will regulate in the space. The new rules also closely follow the FCA's draft \"proposals\" issued in January, declaring that \"any token that is not a security token, or an e-money token is unregulated.\" In short, that means those trading cryptocurrencies like bitcoin and ether will remain free from the watchdog's scrutiny, needing to adhere only to KYC rules.&nbsp;","Commentators said the industry “has been operating on [these rules]…already\" but that having fresh regulatory guidelines would take away additional uncertainty.&nbsp;","The regulator's <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/16\/uk-regulator-looking-to-hire-series-of-cryptocurrency-specialists\/\" data-v-f87c67ca=\"\">Crypto Asset Task Force<\/a> was formed last year and has been hoping to establish how crypto assets fit within the existing regulatory perimeter. After publishing the proposals in January, they then opened a consultation period to solicit feedback from 90 actors. That period ended in April.&nbsp;","In short, the FCA has ruled on a definition and domain for specific cryptocurrency types:","The <span class=\"il\" data-v-f87c67ca=\"\">FCA has also seemingly steered clear of<\/span> specific regulation for most crypto exchanges and other market participants.&nbsp;","Assuming the UK leaves the EU in October, the FCA will be the sole actor responsible for consumer and investor protection for those in the country.","<strong data-v-f87c67ca=\"\">Welcome news<\/strong>","While the FCA's new rules act only as a framework, commentators in the UK have welcomed the news.","CryptoUK, a lobbying and advocacy group, told its members:<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Overall, the changes made provide greater clarity on the areas covered in CryptoUK's consultation response,\" noting it was particularly pleased that the FCA had included its recommendation to create a new category for tokens which constitute e-money.","Archax's Pollard said: \"The FCA continues to cautiously tackle digital assets. The recent [] paper is another positive sign that progress is being made and that the FCA has a plan.\"","The only outlier is the FCA's stance on banning the sale of cryptocurrency derivatives and exchange-traded notes (ETNs) to retail investors, which it first <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/uks-financial-watchdog-proposes-to-ban-crypto-derivatives-for-retail-investors\/\" data-v-f87c67ca=\"\">announced <\/a>earlier this month.","\"Our efforts are [now] focused on the current FCA consultation considering the ban of crypto derivatives...later this year,\" CryptoUK said.","By the FCA's own admission, the guidance does not address each and every specific token query. Therefore firms will still need to engage with the FCA for the avoidance of doubt."],"hashtag":["FCA"]}