{"summary":"After Eight Years of Dormancy, Long-Forgotten Ethereum ICO Wallet Resurfaces with $15 Million Worth of Funds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/after-eight-years-of-dormancy-long-forgotten-ethereum-ico-wallet-resurfaces-with-15-million-worth-of-funds.htm","publishDate":"2023-05-29T11:20:00","id":19307,"type":null,"title":"After Eight Years of Dormancy, Long-Forgotten Ethereum ICO Wallet Resurfaces with $15 Million Worth of Funds","category":["Ethereum News "],"content":["A wallet dating back to the Ethereum (ETH) initial coin offering (ICO) in 2015 has caught the attention of the crypto community after it suddenly moved a significant amount of funds.","The wallet, which has been completely inactive since the ICO, on Saturday transferred all of its 8,000 ETH to another newly created address, on-chain data from Etherscan shows.","The fund movement was made in two transactions, with one test transaction worth just 1 ETH first, followed by another transfer of the remaining 7,999 ETH.","In total, the transfers are worth some $15.2 million by today’s exchange rate, representing a massive increase in the value of the wallet since it was set up during the ICO with ETH worth only $2,500.","One noteworthy detail is that the new wallet that the funds were sent to recorded a separate inbound transaction of 207 ETH, worth close to $400,000, just moments earlier.","That transaction came from a wallet that have been dormant since 2017, and it remains unknown who owns it and why the funds are now being consolidated.","On Twitter, on-chain researcher Lookonchain was quick to share details about the original transaction, with members of the crypto community taking the opportunity to comment under the tweet with their own theories about the transfer.","“Maybe switch from Ledger,” one user suggested, referring to the controversy around the popular hardware wallet Ledger’s new “Recover” service.","Ledger launched its first version of a hardware wallet in 2014, which makes it plausible that the mysterious Ethereum whale could be storing his or her funds on one of the early iterations of the device.","An Ethereum ICO participant who has been dormant for 8 years woke up today.\n\nHe transferred all 8000 $ETH($14.7M) to a new address.https:\/\/t.co\/1griKB9Te9 pic.twitter.com\/1bvQh3zsqY",""],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Lookonchain","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$400,000","content":"MONEY"},{"type":"Ethereum ICO","content":"ORGANIZATION"},{"type":"$15.2 million","content":"MONEY"},{"type":"$2,500","content":"MONEY"},{"type":"$ETH($14.7","content":"MONEY"},{"type":"Saturday","content":"DATE"}],"hashtag":["ETH","Ethereum","ICO"],"authors":["Fredrik Vold"]}