{"summary":"This New Crypto Combines Social Media with Crypto and It’s Going Viral – How Does it Work?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-crypto-combines-social-media-with-crypto-its-going-viral-how-does-it-work.htm","publishDate":"2023-03-09T16:22:00","id":19309,"type":null,"title":"This New Crypto Combines Social Media with Crypto and It’s Going Viral – How Does it Work?","category":["Industry Talk "],"content":["A brand-new dog-themed meme coin project called Love Hate Inu is already going viral just a few days since its launch, with meme coin fans and crypto enthusiasts alike hailing the project’s novel use case.","Love Hate Inu is building a dog meme-inspired crypto-powered, decentralized social media platform centered on community polls and seeks to incorporate a new vote-to-earn (V2E) mechanism. LHINU is the cryptocurrency that will power Love Hate Inu’s social media platform.","LHINU owners will be able to stake their tokens and vote on meme polls on a wide range of topics from politics to entertainment and social issues. According to Love Hate Inu’s development team, “the voting system is built on blockchain technology, ensuring the process is fair, transparent, and secure”.","Users who hold LHINU tokens and participate in polls will receive rewards in the form of tokens. The creator of each poll will distribute these rewards to the participants. ","The more LHINU tokens a user holds and the longer they hold them, the more voting power they will have in each poll. ","Initially, Love Hate Inu’s developers will control which polls appear on the platform, but the plan is to quickly hand over the reins to the community via the launch of a Vote Submission platform later in the year. Here users can submit their poll ideas for the community to consider.","Visit Love Hate Inu Here","Since the project’s first tweet on the 8th of March, Love Hate Inu’s social media page has already garnered an impressive over 4,000 followers. That number is expected to explode higher in the coming weeks. ","Meanwhile, the project’s Telegram channel already has over 2,500 members.","To fund the development of its platform, Love Hate Inu is conducting a presale of its LHINU token. And the presale is already catching fire – in barely two days, the project has already raised over $170,000, meaning nearly 20% of the stage one presale tokens have now been scooped up.","LHINU tokens are currently selling for $0.000085, though this price will rise to $0.00009 when the presale enters its second stage. ","Investors are advised to move quickly to secure LHINU tokens as early as possible, given that the price will have risen to $0.000145 by the end of the presale. That means investors who get in now will be set on a paper gain of around 70% by the time the presale ends.","Love Hate Inu has already been ranked by Cryptonews.com’s Industry Talk team as the best presale of the year. ","LHINU tokens can be bought using crypto and via normal credit card fiat transactions.","Love Hate Inu could experience impressive growth in the coming years given that it combines two fast-growing niches in one project – that of crypto dog-inspired meme coins and the online survey market. ","According to The Business Research Company, the software market grew at a compound annual growth rate (CAGR) of 14.6% in 2022 from $2.79 billion to $3.2 billion, with this market expected to expand to $5.69 billion by 2027, implying a CAGR of 15.5% over the coming years.","Love Hate Inu says its project is “disrupting the online survey market by introducing the first blockchain-powered voting platform capable of recording immutable results via distributed ledger technology”. ","If Love Hate Inu becomes “the only online polling platform that truly matters” as its team claims, the market cap of its LHINU token could explode higher like Shiba Inu’s did back in 2021.","By the end of the LHINU presale, the token price will have risen to $0.000145. ","Given the total token supply of 100 billion, that implies a market capitalization of $14.5 million, which is far lower than existing meme coin projects. ","If the project enjoys decent growth later in 2023 and achieves milestones in its roadmap, such as handing poll creation to the community, the monetization of Love Hate Inu data via brand deals, and, in 2024, integration into major metaverse experiences, this market cap could go a lot higher.","If LHINU can reach even 5% of Shiba Inu’s $6.3 billion market cap, that would imply a market cap of over $315 million and an LHINU token price of $0.00315. ","That 37x versus the current presale price of $0.000085. ","Popular crypto YouTuber Jacob Crypto Bury speculated in a recent video that LHINU could have 10x potential before sinking $2,500 of personal funds into the project.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.",""],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$315 million","content":"MONEY"},{"type":"Love Hate Inu","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"$0.00009","content":"MONEY"},{"type":"Hate Inu","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$14.5 million","content":"MONEY"},{"type":"$2.79 billion","content":"MONEY"},{"type":"The Business Research Company","content":"ORGANIZATION"},{"type":"$2,500","content":"MONEY"},{"type":"Love Hate Inu","content":"ORGANIZATION"},{"type":"$5.69 billion","content":"MONEY"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"14.6%","content":"PERCENT"},{"type":"$3.2 billion","content":"MONEY"},{"type":"2027","content":"DATE"},{"type":"15.5%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"$0.00315","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$6.3 billion","content":"MONEY"},{"type":"YouTuber Jacob Crypto Bury","content":"ORGANIZATION"},{"type":"Hate Inu","content":"LOCATION"},{"type":"$0.000145","content":"MONEY"},{"type":"$170,000","content":"MONEY"},{"type":"Hate Inu Here","content":"ORGANIZATION"},{"type":"$0.000085","content":"MONEY"}],"hashtag":["Crypto Presale","Love Hate Inu","Social media"],"authors":["Joel Frank"]}