{"summary":"Six Arrested in Connection with Austrian Crypto Fraud Scheme, €2M Worth of Assets Frozen","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/six-arrested-in-connection-with-austrian-crypto-fraud-scheme-2m-worth-of-assets-frozen.htm","publishDate":"2024-05-08T11:38:39","id":19319,"type":null,"title":"Six Arrested in Connection with Austrian Crypto Fraud Scheme, €2M Worth of Assets Frozen","category":["Altcoin News "],"content":["A joint operation involving national authorities from Austria, Cyprus, and the Czech Republic has led to the arrest of six individuals connected to an online scam related to the sale of rights or tokens for a supposed new cryptocurrency. ","Supported by Eurojust and Europol, the coordinated action resulted in the seizure and freezing of assets totaling €2 million, according to an official announcement.","The operation included the execution of search warrants and the apprehension of the main suspects, the report said.","The fraudulent scheme took place between December 2017 and February 2018, during which the scammers posed as operators of a legitimate online trading company that had allegedly launched a new cryptocurrency. ","They offered 10 million tokens or rights to the new currency for sale, accepting payments in established cryptocurrencies such as Bitcoin and Ethereum. ","To gain credibility with investors, the fraudsters claimed to have developed their own software and algorithm for token sales.","However, in February 2018, the perpetrators abruptly closed all their social media accounts and took down the fake company’s website, executing what is commonly known as an exit scam. ","This move exposed the fact that investors had been deceived, resulting in losses estimated at around €6 million. ","Not all victims of the fraud have been identified at this stage.","The report said that Eurojust played a crucial role in supporting the operation against the online scam by establishing a coordination center to facilitate real-time communication among the participating authorities. ","This enabled the swift execution of European Arrest Warrants and search warrants. ","Europol also contributed to the operation by deploying a mobile office in Cyprus and organizing operational meetings. ","Additionally, they worked closely with the Austrian desk at Eurojust to provide a comprehensive analysis of the investigation.","In another incident, Instagram influencer Jebara Igbara, known as “Jay Mazini,” has been sentenced to seven years in prison for orchestrating a multi-million dollar crypto Ponzi scheme.","JUST IN: Jebara Igbara, AKA 'Jay Mazini,' Sentenced to 7 Years in Prison for Crypto-Related Fraud pic.twitter.com\/9r8dEvdq1J","— BitMemes Daily (@daily_bitmeme) April 25, 2024","","Igbara, a 28-year-old from New Jersey, pleaded guilty to fraud charges, confessing to running a Ponzi scheme that involved cryptocurrency fraud and resulted in approximately $8 million in illicit gains.","The money was used to fund an extravagant lifestyle, including luxury cars and excessive gambling.","More recently, Queensland Police took action against an alleged crypto investment fraud operating on the Gold Coast, resulting in the arrest and charging of four individuals. ","The investigation, led by the Financial and Cyber Crime Group Money Laundering Unit, began in July 2022.","The search focused on companies including Crypto Advisers Australia, Strategic Capital, Active Marketing Solutions, and Alternative Capital, which were suspected of engaging in fraud and money laundering activities.","As reported, the first quarter of this year has seen $336 million lost to Web3 hackers and fraud, with nearly half of the capital stolen in January alone. "],"entity":[{"type":"Jebara Igbara","content":"PERSON"},{"type":"Austria","content":"LOCATION"},{"type":"Czech Republic","content":"LOCATION"},{"type":"$336 million","content":"MONEY"},{"type":"April 25, 2024","content":"DATE"},{"type":"Jay Mazini","content":"PERSON"},{"type":"New Jersey","content":"LOCATION"},{"type":"Europol","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Active Marketing Solutions","content":"ORGANIZATION"},{"type":"Queensland Police","content":"ORGANIZATION"},{"type":"Gold Coast","content":"ORGANIZATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"$8 million","content":"MONEY"},{"type":"February 2018","content":"DATE"},{"type":"Financial","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"multi-million dollar","content":"MONEY"},{"type":"Australia","content":"LOCATION"},{"type":"Cyber Crime Group Money Laundering","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"July 2022","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Austria","Bitcoin Scam","crypto scam"],"authors":["Ruholamin Haqshanas"]}