{"summary":"Web3 Funding Sees Uptick in Q1 as Startups Secure Nearly $1.9B: Crunchbase","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-funding-sees-uptick-in-q1-as-startups-secure-nearly-1-9b-crunchbase.htm","publishDate":"2024-04-18T11:00:20","id":19313,"type":null,"title":"Web3 Funding Sees Uptick in Q1 as Startups Secure Nearly $1.9B: Crunchbase","category":["News "],"content":["Despite Web3’s challenging journey in recent years, funding for the sector bounced back in the first quarter this year. It marks the first increase since the final quarter of 2021, a Crunchbase report published Thursday showed.","Web3 startups raised nearly $1.9b across 346 deals, a 58% jump compared to last quarter. However, funding from venture capitalists is still lower year-over-year, and securing large funding rounds is still a challenge.","While startup funding in Q1 2024 surged 58% compared to Q4 2023, it still fell short of the last year’s Q1 performance. Back then, startups secured a significantly higher amount of $2.3b across 670 deals. This year’s Q1 reflects a 17% funding decline and a 48% drop in deal count year-over-year.","Valuations appear to be increasing within the industry, as Web3 welcomed four new unicorns during the quarter. AI-related Exohood Labs, Berachain, an Ethereum-compatible blockchain for financial applications, Io.net, a blockchain service for selling excess GPUs, and Web3 infrastructure startup Polyhedra Network, all achieved unicorn status.","Moreover, the crypto market’s resurgence is driven by Bitcoin’s nearly 60% price surge and Ether’s 50% increase.","The heyday of the crypto industry swiftly waned in the last couple of years, characterized by the abrupt collapse of FTX and its cascading repercussions, alongside heightened regulatory scrutiny from authorities.","Last quarter, the three largest funding rounds amounted to under $300m combined. Exohood Labs, headquartered in London, secured a $112m seed round, valuing the company at $1.4b, for its AI project integrating quantum computing and blockchain.","EigenLabs, located in Seattle and the developer of EigenLayer for Ethereum staking, raised a $100m Series B funding from a16z crypto. Freechat, based in Hong Kong and known for its Web3 social network-centric super applications, closed an $80m Series A funding round.","Crunchbase suggests that the approval of Spot Bitcoin ETFs and the Bitcoin halving event could potentially lead to further growth in the cryptocurrency market, attracting new venture investments."],"entity":[{"type":"$2.3","content":"MONEY"},{"type":"$1.4","content":"MONEY"},{"type":"$80m","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$1.9","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"Exohood Labs","content":"ORGANIZATION"},{"type":"17%","content":"PERCENT"},{"type":"the first quarter this year","content":"DATE"},{"type":"$100m","content":"MONEY"},{"type":"$112m","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"final quarter of 2021","content":"DATE"},{"type":"Seattle","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$300m","content":"MONEY"},{"type":"Last quarter","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Berachain","content":"LOCATION"},{"type":"58%","content":"PERCENT"},{"type":"48%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"},{"type":"Polyhedra Network","content":"ORGANIZATION"}],"hashtag":["Venture Capital","Web3"],"authors":["Shalini Nagarajan"]}