{"summary":"US-based VC firms Thrive and Founders Fund participated in the round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159791\/center-raises-11-million","publishDate":"2022-07-28T07:00:37","id":1931,"type":null,"title":"NFT indexing company Center raises $11 million seed round","category":["NFTS"],"content":["NFT tooling company <a href=\"https:\/\/center.dev\" data-v-f87c67ca=\"\">Center<\/a> raised $11 million in a seed funding round, the company announced on Thursday.","US-based VC firms Thrive and Founders Fund participated in the round.","Center was founded last year by Omar Bohsali, who has previously held positions at the likes of Coinbase and Paradigm. In a mission statement from March this year, Center said its aim is to make NFTs useful for individuals and developers. To that end, it is attempting to index and organize every NFT on every chain and says it has 120 million NFTs on its books so far.","“It's sort of like indexing the web, but instead of web pages, we're organizing all permissionless digital property rights,” the company said in a release shared exclusively with The Block.","The company's seed round comes in the wake of an explosion of interest in NFTs, several NFT search engines cropped up over the past year.","In December, decentralised photo network Numbers Protocol launched its NFT search platform, although the link on its site to the search tool was not working at the time of writing. Last month, HUMBL also announced the launch of its cross-chain NFT search platform for web3.","The five-person team at Center is also working on NFT tools for developers, including an NFT rendering API and multi-chain interoperability aids.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"Omar Bohsali","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Numbers Protocol","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Center","content":"ORGANIZATION"},{"type":"March this year","content":"DATE"}],"hashtag":["FUNDRAISING"],"authors":["Callan Quinn","The Block"]}