{"summary":"Crypto Mining Firms Targeted: U.S. Treasury Proposes 30% Tax on Electricity Costs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-mining-firms-targeted-us-treasury-proposes-30-tax-electricity-costs.htm","publishDate":"2023-03-10T10:04:00","id":19310,"type":null,"title":"Crypto Mining Firms Targeted: U.S. Treasury Proposes 30% Tax on Electricity Costs","category":["Blockchain News "],"content":["Crypto mining firms based in the United States could be subject to a 30% tax on electricity costs under a new budget proposal aimed at reducing mining activity.","According to a supplementary budget explainer paper by the Department of the Treasury, any firm using owned or rented mining rigs would be “subject to an excise tax equal to 30 percent of the costs of electricity used in digital asset mining.”","Notably, the proposed tax would be implemented next year and phased in gradually over a period of three years at a rate of 10% a year, reaching the target 30% tax rate by the end of 2026. ","Crypto miners would also need to report the amount and type of electricity they use, as well as the value of that electricity. This means that even miners who use off-grid electricity for their operations would still need to pay taxes.","The provision explicitly mentions that the new change is aimed at reducing mining activity “along with its associated environmental impacts and other harms.” The Treasury added that the energy consumption of crypto mining operations increases prices for those sharing a grid and creates uncertainty and risks to local communities. ","“The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects and can have environmental justice implications as well as increase energy prices for those that share an electricity grid with digital asset miners,” the document reads. ","“Digital asset mining also creates uncertainty and risks to local utilities and communities, as mining activity is highly variable and highly mobile. An excise tax on electricity usage by digital asset miners could reduce mining activity along with its associated environmental impacts and other harms.”","Meanwhile, some in the crypto community have criticized the new proposal, noting that its structure is flawed. “If you care about climate, you should penalize\/tax crypto mining’s carbon footprint, not the total energy usage,” John Buhl, a crypto venture builder, said in a recent tweet. ","This also tilts things toward favoring crypto staking. From an energy use perspective that's good, but since we're still watching this industry skyrocket and then collapse on itself, it's too early to put out a policy saying \"this type of crypto system is for sure better.\"","The new proposal comes just one week after United States Senator Edward Markey and Representative Jared Huffman revealed intentions to reintroduce the Crypto-Asset Environmental Transparency Act in Congress in a bid to promote greater transparency around crypto mining and its environmental impacts. ","Should it be approved, the proposed legislation would mandate that crypto-mining enterprises divulge their emissions data for operations utilizing over 5 megawatts of power, or for multiple crypto-asset mining facilities under the same ownership, each with a power load of less than 5 megawatts, but with a cumulative power load of 5 megawatts or more.","Additionally, the legislation would require the head of the Environmental Protection Agency (EPA) to spearhead an interagency inquiry into the effects of crypto mining within the United States. This inquiry would receive a budget of $5 million and be required to release its results within 18 months of the bill’s ratification."],"entity":[{"type":"Department of the Treasury","content":"ORGANIZATION"},{"type":"2026","content":"DATE"},{"type":"Jared Huffman","content":"PERSON"},{"type":"Environmental Protection Agency (EPA","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Edward Markey","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"30 percent","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"John Buhl","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["Crypto Mining","Mining","Regulation"],"authors":["Ruholamin Haqshanas"]}