{"summary":"Ubisoft’s Nostalgic Leap into NFTs: Rayman and Beyond Good & Evil Characters Enter The Sandbox","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ubisofts-nostalgic-leap-into-nfts-rayman-and-beyond-good-evil-characters-enter-the-sandbox.htm","publishDate":"2023-11-21T11:52:51","id":19329,"type":null,"title":"Ubisoft’s Nostalgic Leap into NFTs: Rayman and Beyond Good & Evil Characters Enter The Sandbox","category":["NFT News "],"content":["Assassin’s Creed maker, the gaming giant Ubisoft, is launching a new set of non-fungible token (NFT) avatars for the popular metaverse game The Sandbox for 120 SAND each, enabling players to earn SAND along the way.","Ethereum scaling network Polygon will launch a collection of 1,866 futuristic, cyberpunk player avatars presented as NFTs.","This is a limited edition set of 1:1 “Captain Laserhawk: A Blood Dragon Remix” characters, including Rayman, Dolph Laserhawk, and Bullfrog.","Per the FAQ page,","“During the Allowlisting stage, one Avatar will cost 90 SAND. After this, during the Public Sale, one Avatar will cost 120 SAND.”","Per the prices at the time of writing, this would be $37 and $49, respectively.","During allowlist days (November 28 and 29), only registered wallets will be authorized to mint avatars.","Only 200 avatars will be available for free on November 28 and will be distributed on a first-come, first-served basis.","Users will be allowlisted based on specific criteria according to the NFTs they hold. The full list is available on the FAQ page.","3,000 spots are available on the Allow List. According to the website, registration for it will last from November 21 through 27.","The mint date is November 29.","Public sale will go live a day later, on November 30, while the reveal will happen on December 6.","The Sandbox website invited users to play as a citizen of Eden and earn SAND.","Each avatar, it said, will be playable inside The Sandbox metaverse. They unlock features, events, rewards, and content.","“There are unique Play&Earn opportunities for Avatar holders, giving any holder the opportunity to earn SAND and\/or NFT through gameplay.”","Underdogs, cyber-soldiers, TV hosts, rebel hackers, and military psychopaths, are all present in Eden, waiting to be collected, the company said, adding:","“Complete the quests of the Captain Laserhawk Blood Dragon experience to earn part of the 100K SAND pool and participate in exclusive community activations!”","Each avatar is customized with unique, randomly generated traits. There are four types of these NFTs: super rare, rare, uncommon, and common.","Also, in a first for The Sandbox, avatars will come in three different sizes: small, medium, and large.","Furthermore, after the end of the initial sale, players will be able to buy an unlimited number of avatars from users selling theirs on the OpenSea marketplace.","Lastly, Eden Icons holders will receive an Eden care package.","The avatars are based on the French—American adult animated series “Captain Laserhawk: A Blood Dragon Remix,” produced by Ubisoft Film & Television, Bobbypills, and Bootleg Universe.","The show is inspired by the 2013 video game “Far Cry 3: Blood Dragon” and includes a combination of elements and characters from several Ubisoft franchises, including Assassin’s Creed, Ghost Recon, and Splinter Cell.","Ubisoft first unveiled the show in October 2019, and Netflix released it in October 2023.","The experience is transporting the users into 1992 as citizens of Eden.","Per the HeyMint platform website, this is an original adventure filled with mystery, hacking, and stealth.","The year is 1992, welcome to Eden 📼 To celebrate the launch of Captain Laserhawk Blood Dragon on Netflix, Ubisoft and The Sandbox have teamed up to allow players to enter the metaverse as @EdenOnline_exe citizens in an exclusive avatar collection!https:\/\/t.co\/IV5Yoa2wQm","Get… pic.twitter.com\/TtgyQV8KUE","— The Sandbox (@TheSandboxGame) November 20, 2023","","Learn more: Assassin’s Creed Creator Ubisoft to Launch Free Ethereum NFT Event for ‘Champions Tactics’"],"entity":[{"type":"1992","content":"DATE"},{"type":"Eden","content":"ORGANIZATION"},{"type":"November 29","content":"DATE"},{"type":"Rayman","content":"PERSON"},{"type":"Captain Laserhawk Blood Dragon","content":"ORGANIZATION"},{"type":"Bootleg Universe","content":"ORGANIZATION"},{"type":"October 2019","content":"DATE"},{"type":"Assassin’s Creed Creator Ubisoft to Launch Free Ethereum NFT","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"$49","content":"MONEY"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"$37","content":"MONEY"},{"type":"November 28","content":"DATE"},{"type":"November 20, 2023","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Bullfrog","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"December 6","content":"DATE"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"November 30","content":"DATE"},{"type":"Ubisoft Film & Television","content":"ORGANIZATION"},{"type":"Dolph Laserhawk","content":"PERSON"},{"type":"Bobbypills","content":"LOCATION"},{"type":"November 21 through 27","content":"DATE"}],"hashtag":["Gaming","NFT","Non-fungible tokens","Polygon"],"authors":["Sead Fadilpašić"]}