{"summary":"Zcash Outperforms Bitcoin, Ethereum as it Prepares For Blossom","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/zcash-outperforms-bitcoin-ethereum-as-it-prepares-for-blosso-5285.htm","publishDate":"2019-12-11T12:59:00","id":19327,"type":null,"title":"Zcash Outperforms Bitcoin, Ethereum as it Prepares For Blossom","category":["Altcoin News "],"content":["Zcash (ZEC), the privacy-focused cryptocurrency, is set to activate “Blossom,” a code improvement, in a mandatory system-wide upgrade today, and is among the best performing coins on Wednesday and in the past week.","At pixel time (12:30 UTC), ZEC, is changing hands at c. USD 31 and traders are decidedly bullish, as the price is up by 3% in a day and 13% in a week, trimming its monthly losses to 15%. The coin, ranked 33rd by market capitalization, has an upper hand against the USD, BTC and ETH adding 14% on average in the last trading week. ZEC is also up by 4.5% against BTC, and by almost by 4% against ETH in the past 24 hours.","ZEC has nonetheless been struggling in recent months. Under bear pressure, ZEC price has slipped and is currently trading at lows last seen in the beginning of 2017. The price is down by 43% in a year.","ZEC price chart:","Meanwhile, the Blossom upgrade is set to be activated at c. 21:45 UTC. The upgrade is expected to improve capacity, scalability and user experience by halving block generation times to 75 seconds.","This way, more transactions should be processed. It is also estimated that the upgrade will double the Zcash’s throughput while simultaneously “keeping transaction fees low.” The emission time will remain unchanged but “other values based on block intervals such as end-of-service halt, default transaction expiry, and the number of confirmations required to consider a transaction final will be updated.”","Also, it will be the first implementation of the Network Upgrade Pipeline, established by the Electric Coin Co., the company behind Zcash, at the end of last year. This pipeline is a process mechanism for shipping new protocol upgrades in Zcash.","Sapling, the previous protocol update in October 2018, introduced shielded addresses, reduced transaction construction time by 90% and transaction memory by over 97%.","Meanwhile, major cryptocurrency exchange Coinbase has already announced their support of Blossom. When the upgrade begins, the exchange will “temporarily pause ZEC sends\/receives to\/from Coinbase and Coinbase Pro, and we will re-enable sends\/receives once we have determined the upgrade is stable.” As a rule of thumb, traders are advised to store their coins in secure, preferably cold wallets before the upgrade."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"4.5%","content":"PERCENT"},{"type":"Zcash","content":"LOCATION"},{"type":"4%","content":"PERCENT"},{"type":"Zcash","content":"PERSON"},{"type":"October 2018","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"97%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Electric Coin Co.","content":"ORGANIZATION"},{"type":"Coinbase Pro","content":"ORGANIZATION"},{"type":"USD 31","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"13%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Network Upgrade Pipeline","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"}],"hashtag":["Market","zcash"],"authors":["Dalmas Ngetich"]}