{"summary":"eToro and 21Shares Join Forces to Launch A “Data-Driven” Crypto Portfolio for Retail Investors","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/etoro-and-21shares-join-forces-to-launch-a-data-driven-crypto-portfolio-for-retail-investors.htm","publishDate":"2024-04-23T11:36:38","id":19328,"type":null,"title":"eToro and 21Shares Join Forces to Launch A “Data-Driven” Crypto Portfolio for Retail Investors","category":["Altcoin News "],"content":["Crypto trading firm eToro has partnered with 21Shares, the world’s largest issuer of crypto exchange-traded products (ETPs), to introduce a new crypto portfolio for retail investors. ","Called 21Shares-Flows, the portfolio aims to provide retail investors with a dynamic and data-driven approach to crypto investing, according to a Tuesday press release. ","It holds actual cryptoassets and leverages insights derived from monthly flows into European crypto ETPs. ","The flows are segmented by underlying assets, including popular cryptocurrencies like Bitcoin, Ethereum, and various altcoins. ","By tracking investor preferences and market dynamics, the portfolio adjusts its allocation to align with emerging trends and current sentiment.","For instance, if Bitcoin ETPs experience significant inflows, the portfolio’s allocation to Bitcoin will be increased accordingly, reflecting the prevailing market sentiment.","“Our latest research shows that retail investors around the world are more likely to increase their allocation to crypto than any other asset class,” Dani Brinker, Head of Investment Portfolios at eToro, said. ","“This portfolio provides investors with a unique opportunity to capitalize on the growth potential of cryptoassets in a structured and data-driven manner. We are looking forward to bringing 21Shares’ industry-leading insights to our users.”","We’re thrilled to announce our partnership with @eToro , a global leader in social trading and investing. Together, we’re launching 21Shares-Flows, a Smart Portfolio of 25 tokens including Bitcoin, Ethereum, and exciting new additions like Celestia.","Our shared vision is to make… pic.twitter.com\/1rGDx3u9ke","— 21Shares (@21Shares) April 23, 2024","","The 21Shares-Flows portfolio consists of 25 cryptoassets, including popular cryptocurrencies like Bitcoin and Ethereum, as well as newer additions such as Celestia. ","It undergoes monthly rebalancing to ensure alignment with market dynamics. ","During the rebalancing process, the sum of flows for each underlying asset is computed and divided by the total market flows to determine the updated weights.","“We are excited to partner with eToro to introduce the 21Shares-Flows portfolio, which represents a significant advancement in crypto investment,” Hany Rashwan, CEO of 21Shares, said in a comment. ","“This collaboration leverages our expertise in crypto ETPs and eToro’s innovative Smart Portfolios platform to offer investors a transparent and data-driven approach to navigating the crypto market.”","Last month, 21Shares revealed that it has surpassed $5 billion in Assets Under Management (AUM) amid market rebound.  ","21Shares has experienced rapid growth over the past couple of years. ","Just earlier this year, the company joined Ark Invest to refile an application for a spot market Ethereum ETF.","Likewise, Ark Invest and 21Shares have announced a collaboration to enhance transparency for their ARK 21Shares Bitcoin ETF (ARKB) by integrating Chainlink’s Proof of Reserve platform to verify holdings data.","21Shares’s diverse range of ETPs allow investors to gain exposure to cryptocurrencies through traditional investment vehicles without the need to directly buy, store, or manage the cryptocurrencies themselves."," Various stock exchanges have listed 21Shares ETPs, making them accessible to investors who have accounts with traditional brokers that have access to these exchanges. ","The ETPs are backed by the underlying cryptocurrencies, which are held in secure custody."],"entity":[{"type":"Dani Brinker","content":"PERSON"},{"type":"Hany Rashwan","content":"PERSON"},{"type":"earlier this year","content":"DATE"},{"type":"Celestia","content":"LOCATION"},{"type":"Head of Investment Portfolios","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"April 23, 2024","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"Chainlink’s Proof of Reserve","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CRYPTO","Crypto investing","eToro"],"authors":["Ruholamin Haqshanas"]}