{"summary":"EigenLayer Launches EIGEN Token Airdrop, Tokens Remain Non-Transferable","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/eigenlayer-launches-eigen-token-airdrop-tokens-remain-non-transferable.htm","publishDate":"2024-05-11T09:11:06","id":19324,"type":null,"title":"EigenLayer Launches EIGEN Token Airdrop, Tokens Remain Non-Transferable","category":["Ethereum News "],"content":["Ethereum restaking protocol EigenLayer has initiated its token-claim process, commonly referred to as an “airdrop,” for Season 1, Phase 1 rewards.","According to a recent blog post by the protocol’s development team, users who are eligible for the new EIGEN token can now acquire it through the claims process after a few weeks of anticipation.","However, it’s important to note that EIGEN tokens are currently nontransferable, meaning users cannot sell or trade them.","The blog post further mentioned that the EIGEN token will become transferable once the development team implements new features in the upcoming months.","The tentative target date for these implementations is set for September 30.","It’s crucial for users to claim their tokens before the claim process closes on September 7, as any unclaimed tokens after that date will not be distributed.","According to EigenLayer’s documentation, the EIGEN token is not available for users in over 30 jurisdictions, including the United States, Russia, China, and Canada.","Additionally, most VPN server addresses are prohibited from being used for token claims.","The current claims process has unlocked 6.05% of the total supply of EIGEN tokens, and an additional 0.7% will be unlocked in mid-June during “Phase 2.”","At that time, users of applications such as Kelp, Pendle, Equilibrium, and similar apps will be eligible to claim their tokens.","The ongoing airdrop primarily caters to users who restaked Ether or its liquid staking derivatives on EigenLayer before March 15.","Users who hold liquid restaking tokens (LRTs) can also claim their rewards now, as long as their activities do not fall under “Phase 2.”","Additionally, users who restaked on EigenLayer between March 15 and April 29 are eligible to claim 100 bonus tokens immediately, with the majority of their claims becoming available in mid-June alongside other Phase 2 participants.","The EIGEN airdrop has sparked controversy within the decentralized finance (DeFi) community. Leandro Schlottchauer, co-founder of Kuyen Labs, stated that it might be one of the last “life-changing airdrops.”","Conversely, many EigenLayer users have criticized the airdrop for its ban on VPN servers, the distribution of nontransferable tokens, and its perceived short snapshot period.","As airdrop season rages on, LayerZero Labs, a renowned cross-chain interoperability protocol, has vowed to tackle the issue of sybil farmers ahead of its highly anticipated airdrop.","The project has stated that it will conduct an internal investigation to identify and exclude sybil farmers from receiving allocations in its future token generation event.","Additionally, the project plans to launch a reward program, offering a 10% bonus of the intended token allocation to bounty hunters who identify additional sybil users.","LayerZero Labs recently completed the first snapshot for its highly anticipated airdrop.","In December, the project announced its plans to distribute tokens to early adopters in the first half of 2024."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"September 7","content":"DATE"},{"type":"Season 1","content":"DATE"},{"type":"0.7%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"March 15","content":"DATE"},{"type":"the first half of 2024","content":"DATE"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"September 30","content":"DATE"},{"type":"Leandro Schlottchauer","content":"PERSON"},{"type":"Pendle","content":"PERSON"},{"type":"April 29","content":"DATE"},{"type":"EIGEN","content":"PERSON"},{"type":"Equilibrium","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"6.05%","content":"PERCENT"},{"type":"United States","content":"LOCATION"},{"type":"Kuyen Labs","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Ethereum","Ethereum staking"],"authors":["Ruholamin Haqshanas"]}