{"summary":"Indonesia Sees Sharp Decline in Crypto Tax Revenue, Falling 63% in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/indonesia-sees-sharp-decline-in-crypto-tax-revenue-falling-63-in-2023.htm","publishDate":"2024-01-24T15:05:48","id":19339,"type":null,"title":"Indonesia Sees Sharp Decline in Crypto Tax Revenue, Falling 63% in 2023","category":["News "],"content":["The Indonesian government has reported a significant decline in crypto tax revenue for 2023, amounting to $31.7 million (Indonesian Rupiah 467.27 billion), according to a report by local news outlet Kontant.","The fall marks a sharp 63% drop compared to the partial collection period in 2022 when the crypto tax regime was introduced.","This is one of several new taxes on the “digital economy” introduced in 2022 as part of an Indonesian tax reform. The government has stated that it expects the tax reform will “improve tax collection,” and ultimately lead to a “healthy and fair taxation system.”","The decline in crypto tax revenue last year came despite Bitcoin’s impressive surge of around 160% over the course of the year.","The decrease in tax revenue from crypto reflected a 51% decrease in transaction volumes throughout the year compared to 2022.","Crypto transactions in Indonesia are subject to dual taxation, including a 0.1% income tax and a 0.11% value-added tax (VAT). On top of that comes a special tax on local crypto exchanges of around 0.04% that is paid to the country’s national digital asset bourse.","Local exchanges in Indonesia have on multiple occasions expressed dissatisfaction with the high tax rates, saying the taxes are forcing users to move to unregulated offshore exchange.","Among the exchanges that have spoken out in the past is INDODAX, which pointed out that total taxes on crypto transactions can often be higher than trading fees paid by the user, posing a risk of users seeking more cost-effective alternatives.","Just recently, Gibran Rakabuming Raka, a vice presidential candidate in the upcoming Indonesian election, said he aims to accelerate Indonesia’s position as a leader in the digital revolution by cultivating expertise in blockchain and cryptocurrencies.","“We are preparing blockchain experts, we are preparing cybersecurity experts, we are preparing crypto experts,” Gibran said during an event on December 10 last year."],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$31.7 million","content":"MONEY"},{"type":"0.11%","content":"PERCENT"},{"type":"Indonesia","content":"LOCATION"},{"type":"63%","content":"PERCENT"},{"type":"0.1%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"December 10 last year","content":"DATE"},{"type":"Gibran","content":"PERSON"},{"type":"160%","content":"PERCENT"},{"type":"INDODAX","content":"LOCATION"},{"type":"0.04%","content":"PERCENT"},{"type":"Gibran Rakabuming Raka","content":"PERSON"}],"hashtag":["Indonesia"],"authors":["Fredrik Vold"]}