{"summary":"Sifu, aka Michael Patryn, the co-founder of QuadrigaCX, is no longer the treasury manager of DeFi protocol Wonderland.\nWonderland is now voting on whether to wind down Wonderland or not. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132340\/wonderland-votes-out-quadrigacx-co-founder-sifu-and-is-considering-shutting-down","publishDate":"2022-01-29T10:08:08","id":1933,"type":null,"title":"Wonderland votes out QuadrigaCX co-founder and considers closing down","category":["DeFi"],"content":["The community of the DeFi protocol, Wonderland, has removed Sifu as its treasury manager. The move comes two days after the revelation that Sifu is Michael Patryn, the convicted co-founder of the failed Canadian crypto exchange QuadrigaCX.","Wonderland DAO opened a vote to unseat&nbsp;Sifu on January 27 and <a href=\"https:\/\/snapshot.org\/#\/bestfork.eth\/proposal\/0x8f974b76d4f50ea26a1f44843dcda2e0f6a4736883968b29996d272b86b447a9\" data-v-f87c67ca=\"\">passed<\/a> it with a majority on January 29. TIME token holders with a combined over 64,000 tokens participated in the vote. (One token generally serves as one vote). Nearly 88% of the TIME tokens voted that Sifu should be replaced. TIME is the native token of Wonderland.","The revelation that Sifu is&nbsp;Patryn was <a href=\"https:\/\/www.theblockcrypto.com\/post\/131931\/avalanche-defi-wonderland-time-0xsifu-quadrigacx-patryn\" data-v-f87c67ca=\"\">made<\/a> Thursday by a crypto sleuth who goes by Zach on Twitter. Zach posted their conversation with Daniele Sestagalli — the other co-founder of Wonderland — saying that Sifu is Patryn.","Sestagalli at the time told The Block that he found out Sifu is Patryn one month ago. Sestagalli and Sifu launched Wonderland in September of last year.","Wonderland is a DeFi protocol mostly based on Avalanche. It is a fork of Olympus DAO, a decentralized reserve currency protocol that lets users deposit or sell tokens to the Olympus treasury in return for discounted OHM tokens. Wonderland quickly became a famous fork of Olympus. The current treasury balance of Wonderland stands at over $735 million, according to its <a href=\"https:\/\/www.wonderland.money\/\" data-v-f87c67ca=\"\">website<\/a>.","Sestagalli said he decided not to judge Sifu by his past. Sifu\/ Patryn is a convicted financial criminal who spent time in jail. He also pled guilty to conspiracy to commit credit and bank card fraud in 2005 and burglary, grand larceny, and computer fraud in 2007. He founded QuadrigaCX in 2013 with Gerald Cotten, who passed away unexpectedly and mysteriously in 2018 after a trip to India. Cotten's death caused over $130 million in losses for 76,000 investors as the exchange was found to be largely devoid of assets.","Now that the vote to remove Sifu as Wonderland's treasury manager has ended, the project is holding another poll on whether to wind down Wonderland or not.&nbsp;","\"Winding down will mean giving every wMEMO [wrapped wonderful memories token] holder back the funds from the treasury that they are entitled to and declare the OHM Fork experiment closed,\" <a href=\"https:\/\/www.wonderlandforum.xyz\/t\/wip-4-wind-down-wonderland-and-give-the-treasury-back-to-its-holders\/10751\/1\" data-v-f87c67ca=\"\">said<\/a> Wonderland in a forum post on Friday. \"We strongly believe that this would be the cleanest way of moving forward.\"","The <a href=\"https:\/\/snapshot.org\/#\/bestfork.eth\/proposal\/0xf24f389b80f1e056c8f308802767d77060cbeecf17afd8d379ea71b3ded6ebb5\" data-v-f87c67ca=\"\">new vote<\/a> has opened today and will last for 48 hours. If the Wonderland community votes against the winding down proposal, the DAO will identify a new entity to give the control of the treasury to. But since that is not an easy task, the DAO expects the community to submit a counter-proposal within five days, recommending relevant people willing to take over the multi-sig and take on the project.&nbsp;","But if no counter-proposal is made, Wonderland will unwind the treasury. \"We don't want anything to happen to users' funds, and we would not feel confident to delegate the whole treasury to a non-structured replacement,\" it said.","Wonderland believes unwinding the treasury is the best solution. To that end, it is already getting a user interface ready for the community to claim its funds back.","It looks like the Wonderland community does want the treasury back. Thus far, TIME token holders with a combined 53,000 tokens have voted “yes” and those with a combined 33,000 tokens have voted “no.”","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["DAOS"]}