{"summary":"FCA Reviewed 44 Crypto Firms Registered in UK For Anti-Money Laundering Purposes","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fca-reviewed-44-crypto-firms-registered-in-uk-for-anti-money-laundering-purposes.htm","publishDate":"2024-02-14T18:33:56","id":19336,"type":null,"title":"FCA Reviewed 44 Crypto Firms Registered in UK For Anti-Money Laundering Purposes","category":["Blockchain News "],"content":["The Financial Conduct Authority (FCA) has conducted internal reviews on 44 cryptocurrency firms registered in the country to tackle money laundering concerns.","In a Feb 14 release, the regulator highlighted key areas in the UK markets including digital assets regulations. Last year, the FCA carried out wider industry oversight functions ranging from advertising compliance to consumer protection measures.","According to the release, the FCA has taken robust action to secure user assets with key regulations in the last three months.","So far, it has reviewed 44 digital asset firms registered in the country to ensure strict compliance with anti-money laundering regulations.","The FCA also kept track of unregistered firms and their promotions that were approved by an authorized agent. After reviews, the FCA found widespread noncompliance with rules as firms used affiliates and financial influencers to promote services.","Some firms used small fonts or poor positioning to conceal risk warnings and used regulated status for promotions. Furthermore, claims were made about the safety and security of assets without highlighting the risks invoked.","These reviews included websites, mobile apps, social media and advertising. We found significant levels of non-compliance with our rules. We have provided feedback to firms outlining our concerns and asked them to take action to rectify the breaches and conduct full reviews of their promotions to ensure they are compliant with our rules.","Financial advertising has been an area under the scrutiny of the FCA that has gotten lots of attention in the last three months.","The commission expects approvers to pay keen attention to regulatory requirements before allowing overseas firms to promote to UK consumers. This issue is seen in other jurisdictions with regulators instituting actions against foreign firms for targeting local users through promotional activity.","In the United States, regulators filed similar charges against Binance, and authorities in South Korea petitioned OKX over promoting its services to the local market.","⚡️ South Korea Exchange Association Petitions OKX for Offering Services Without Approval","Digital Asset Exchange Alliance (DAXA) has reported rival @okx to the financial authorities in South Korea.#CryptoNews #newshttps:\/\/t.co\/neZtcvmE7W","— Cryptonews.com (@cryptonews) February 7, 2024","","In the UK, the FCA issued 450 alerts to consumers in the last three months urging companies to adhere to rules.","To advertise, firms must either be registered with the FCA or be approved by a firm authorized for such purpose. First-time buyers are given adequate risk warnings and a 24-hour cooking period.","In addition to these, the regulator disclosed plans with tech companies to block illegal promotions on mobile applications, websites, and social media involving cryptocurrency assets.","For example, our work has resulted in 35 apps being removed from App Stores at the end of December 2023.  We will be continuing our robust action against firms issuing illegal financial promotions in 2024.","Apart from crypto assets, the FCA flagged over 10,000 financial advertisements in 2023, a 17% increase from 2022 despite regulatory measures deployed."],"entity":[{"type":"February 7, 2024","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"South Korea Exchange Association Petitions OKX for Offering Services Without Approval","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"App Stores","content":"ORGANIZATION"},{"type":"17%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Digital Asset Exchange Alliance (DAXA","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["CRYPTO","Crypto Regulation","FCA"],"authors":["David Pokima"]}