{"summary":"Analysts Foresee a Bitcoin ETF Offering by Charles Schwab – Trillions to Enter the Market?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/analysts-foresee-a-bitcoin-etf-offering-by-charles-schwab-trillions-to-enter-the-market.htm","publishDate":"2024-01-29T15:07:54","id":19344,"type":null,"title":"Analysts Foresee a Bitcoin ETF Offering by Charles Schwab – Trillions to Enter the Market?","category":["Bitcoin News "],"content":["Charles Schwab, a financial giant with $8.5 trillion in assets, has analysts speculating about the possibility of the company entering the spot Bitcoin (BTC) exchange-traded fund (ETF) market.","While Charles Schwab currently offers third-party spot Bitcoin ETFs, analysts believe the company might leverage its scale and lower-than-low fee pricing strategy to introduce its proprietary Bitcoin ETF, according to a recent report from RIABiz, a news outlet for the investment advisory industry.","The US Securities and Exchange Commission (SEC) recently granted approval for spot Bitcoin ETFs, and Schwab immediately made all 11 funds available on its platform.","However, the company has not yet launched its own Bitcoin ETF, with analysts suggesting that Charles Schwab might be waiting to observe the market dynamics and potentially introduce an ETF with “shock-and-awe low fees.”","Despite being a major player in the financial industry, Charles Schwab is known for its conservative approach to product development, Bloomberg Intelligence’s senior ETF analyst Eric Balchunas told RIABiz.","“They were really late in cheap beta and smart beta and dividends. They’re never first. They don’t have to be. The customers are so loyal and products are so cheap they don’t have to be in any rush. Rain or shine, the flows come in,” Balchunas said.","Don't sleep on Schwab, they're never first to market in anything but they make back impact when they come in w\/ dirt cheap fee + 30M active brokerage accts. And they do NOT like Fidelity, so $FBTC's success could annoy them to file something sooner rather than later. https:\/\/t.co\/w92J51Ildl","— Eric Balchunas (@EricBalchunas) January 27, 2024","","Similarly, Morningstar analyst Bryan Armour told the news outlet that Charles Schwab has historically been methodical in its approach, trading the first-mover advantage for a more “thoughtful lineup that can stick with them for the long-term.”","While Charles Schwab has a thematic crypto ETF, it has not ventured into a proprietary spot Bitcoin product.","The company’s cautious stance aligns with its commitment to avoiding conflicts of interest and refraining from endorsing specific funds, according to the RIABiz article, which added that the firm instead has provided flexibility to its advisors and investors by offering a variety of third-party ETFs."],"entity":[{"type":"$8.5 trillion","content":"MONEY"},{"type":"January 27, 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Schwab","content":"PERSON"},{"type":"Schwab","content":"LOCATION"},{"type":"$FBTC","content":"MONEY"},{"type":"Charles Schwab","content":"PERSON"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Bryan Armour","content":"PERSON"},{"type":"Balchunas","content":"PERSON"},{"type":"Morningstar","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","ETF"],"authors":["Fredrik Vold"]}