{"summary":"A Chinese court recently heard a case for a Chinese Filecoin mining firm for its alleged involvement in an $83.3 million pyramid scheme.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244929\/chinese-filecoin-mining-firm-charged-for-allegedly-orchestrating-83-3-million-pyramid-scheme","publishDate":"2023-08-15T05:54:02","id":1934,"type":null,"title":"Chinese Filecoin mining firm charged for allegedly orchestrating $83.3 million pyramid scheme","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">A Chinese court recently heard a case for a Chinese Filecoin mining firm and its four executives for their alleged involvement in an $83.3 million pyramid scheme, the court said.<\/span>","<span data-v-f87c67ca=\"\">In a social media <\/span><a href=\"https:\/\/mp.weixin.qq.com\/s\/iLrQfSW5Sfw3CL2OlpXXrw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> published Monday, the local court in Pingnan county in the Guangxi autonomous region said that it had started the trial of Shenzhen Shikongyun Technology and its four executives including founder surnamed Lai, who are suspected of organizing and leading pyramid scheme activities. The case is currently undergoing further trial proceedings.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Prosecutors alleged that the defendants enticed customers under the guise of mining FIL coins on the company’s platform. They demanded individuals to qualify for participation by paying fees for purchasing mining equipment or leasing mining machines, the post said.<\/span>","<span data-v-f87c67ca=\"\">“With the lure of substantial returns, they enticed further participation and deceived individuals to gain assets, disturbing the economic and social order,” the prosecutors said in the post.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The post said that the company had set up filpool.io and bpool.io platforms, and had built a website with the domain name ipfs.cn to inappropriately promote its services.<\/span>","<span data-v-f87c67ca=\"\">When the company was “busted” by the Chinese authorities in May 2022, it had dozens of thousands of users on its platforms and had obtained over 606.95 million yuan ($83.3 million) through the filpool.io and bpool.io sites, according to the post.<\/span>","A former employee of Shenzhen Shikongyun told The Block today that the company was well aware of the risks of operating on the Chinese mainland and had planned to expand overseas before the executives were arrested and brought into custody last year. The former employee requested anonymity due to the sensitivity of the matter.","<span data-v-f87c67ca=\"\">Unlike its neighboring Hong Kong which is actively <a href=\"https:\/\/www.theblock.co\/post\/242897\/hashkey-obtains-first-license-in-hong-kong-to-offer-crypto-retail-trading\" data-v-f87c67ca=\"\">developing<\/a> the crypto and Web3 industries, China banned all crypto transactions on the mainland in September 2021.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Guangxi","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"606.95 million yuan ($83.3 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Pingnan","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Shenzhen Shikongyun","content":"ORGANIZATION"},{"type":"Lai","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Shenzhen Shikongyun Technology","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"$83.3 million","content":"MONEY"}],"hashtag":["COURT HEARINGS","CRIME","LAWSUITS","MINING","MINING COMPANIES"],"authors":["Timmy Shen","The Block"]}