{"summary":"Predictor of Bitcoin’s Death Calls for Wider Crypto-Crackdown in China","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/predictor-of-bitcoin-s-death-calls-for-wider-crypto-crackdow-1032.htm","publishDate":"2018-01-16T14:41:00","id":19349,"type":null,"title":"Predictor of Bitcoin’s Death Calls for Wider Crypto-Crackdown in China","category":["Bitcoin News "],"content":["China, which once dominated the global Bitcoin markets, continues its efforts to stamp out crypto-trading within its borders.","Following up on a 2017 nationwide ban on cryptocurrency-to-fiat exchanges and initial coin offerings (ICOs) , a senior Chinese banking official is now supporting the prohibition of additional services related to and involved with crypto-trading, Reuters reported, citing a memo outlining a government meeting in early January.","Vice Governor Pan Gongsheng of China’s central bank, The People’s Bank of China (PBOC), said the government would implement additional regulations to shut down branches of the cryptocurrency industry including settlement providers, market-makers, guarantors, peer-to-peer lending vehicles, alternative trading platforms and cryptocurrency wallets, according to the report.","Moreover, Pan suggested local governments heighten their monitoring of mining energy consumption and use electricity price, taxes, and land use and environmental regulations as tools to guide the mines “toward an orderly exit.” China is currently a world leader in cryptocurrency mining because of its low energy prices.","In late 2017, Pan famously predicted the death of Bitcoin, saying, “There is only one thing left to do: Sit by the river bank and see Bitcoin’s body pass by one day.”","Since the recent crackdown on the crypto-sphere, major Chinese exchanges such as OKEx and Huobi Pro have redirected their business development into over-the-counter (OTC) trading, which typically uses private dealers rather than centralized exchanges, as well as overseas crypto-to-crypto venues. Pan feels websites and apps that facilitate these practices and\/or help people move money overseas should be sanctioned.","Meanwhile, some major Chinese mining groups are now moving to the U.S., Canada or Iceland. BTC.Top, the third-largest mining pool, is opening a new location in Canada, according to media reports."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"The People’s Bank of China (PBOC","content":"ORGANIZATION"},{"type":"Iceland","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["China","Regulation"],"authors":["Julia Travers"]}