{"summary":"Coinbase Says It Is Targeting More Users, Not Lower Fees","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-says-it-is-targeting-more-users-not-lower-fees-10308.htm","publishDate":"2021-05-14T08:03:04","id":19340,"type":null,"title":"Coinbase Says It Is Targeting More Users, Not Lower Fees","category":["Bitcoin News "],"content":["The crypto exchange giant Coinbase says it does not want to go toe-to-toe with its biggest rivals over fees – and instead expects to bolster its users numbers to as high as 9 million by the end of the financial year by convincing crypto investors to pick ahead of other trading platforms.","","In a Q1 2021 earnings conference call, their first such call as a listed company, the firm’s Chief Financial Officer Alesia Haas stated,","“We are not focused on competing with fees. We’re not trying to even win on fees. We’re trying to win on being the most trusted, easiest to use.”","When challenged to explain why Coinbase has not sought to drive down its fees in search of greater profitability, Haas claimed that “our biggest focus right now is to keep up with the current demand.” She also added that Coinbase is “bundling custody and storage services into our trading fee,” adding that “fees are not the sole basis that customers select who they engage with.”","She also claimed that Coinbase Pro app usership rose in the first quarter of the current financial year with higher trading volumes, a factor that affected fees, stating:","“As Pro users increase their volume, their weighted average fee rate came down. We did not see any material movement between the two products – between the consumer app and the Pro app – and so it really was just additional volume coming on the Pro app that drove lower fees in Q1.”","In a letter to shareholders, the exchange claimed that the number of its retail monthly transacting users (MTUs) “grew to 6.1 million in Q1 2021,” a figure that was “more than double” its Q4 2020 figures. The number appears to have far outstripped guidance forecasts made last month, when the company predicted an annual 15% rise to the 7 million user mark.","The firm has now revised its annual predictions, claiming that it could hit an average FY2021 MTU figure of as high as 9 million in a scenario that “assumes an increase in crypto market capitalization and moderate-to-high crypto asset price volatility.” Such factors, Coinbase said, would effectively ensure a steady continuation of Q1 growth.","But less favorable markets could see Coinbase climb much slower, and hit the 7 million mark as previously forecasted – while a “2018”-style crypto winter could see user numbers shrink back to 5.5 million.","The firm reported total sales worth USD 1.8bn, meeting its guidance figures from last month. However, per Bloomberg, the results were “slightly below” the USD 1.81bn analysts it consulted had predicted.","Meanwhile, Coinbase’s net income was USD 771m, outpacing the same analysts’ predictions of USD 762.6m.","Coinbase (COIN)’s first month on Nasdaq:","__\nLearn more:\n– Considering Working For Coinbase? Here’s Their New Compensation Policy\n– The Dark Side Of Coinbase Listing\n– Coinbase Aims At New Markets, Reg Hurdles After Nasdaq Debut"],"entity":[{"type":"2021","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"MTU","content":"ORGANIZATION"},{"type":"Reg Hurdles After Nasdaq Debut","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Haas","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Alesia Haas","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"9 million","content":"MONEY"},{"type":"Q1 2021","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Coinbase","Exchange","Fees","Forecast","Trading"],"authors":["Tim Alper"]}