{"summary":"Kraken Warns SEC’s Claims Could Reorder US Financial Structure","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kraken-warns-secs-claims-could-reorder-us-financial-structure.htm","publishDate":"2024-05-10T12:45:03","id":19354,"type":null,"title":"Kraken Warns SEC’s Claims Could Reorder US Financial Structure","category":["Blockchain News "],"content":["Crypto exchange Kraken urged the US court to dismiss the SEC claims against it to avoid a “significant reordering” of the US financial regulatory structure.","In November 2023, the Securities and Exchange Commission (SEC) initiated a lawsuit against Kraken. The SEC alleging it had been operating an unregistered securities trading platform.","This suit came months after settling charges over Kraken’s former staking service.","In February 2024, Kraken filed to dismiss the lawsuit, contending that it relied solely on a registration-based argument regarding Kraken’s operation as an unlicensed securities entity.","Kraken argued that cryptocurrencies listed as SEC-compliant should be treated like commodities and not securities.","However, now Kraken has escalated its position, urging the court to dismiss the claims to avoid a “significant reordering” of the US financial regulatory structure, according to court filings submitted in the Northern District of California on Thursday.","The SEC filed an opposition to Kraken’s motion to dismiss, asserting that its enforcement action falls within its congressionally granted authority. They emphasize its role in enforcing registration requirements for securities intermediaries.","“In applying the Howey test in its determination that Kraken must register, the SEC is simply following its Congressional mandate.”","They also stated that it’s not overstepping its powers and doesn’t need to “enact bespoke laws to each new technology that emerges.”","Kraken’s response to the SEC’s motion centers on interpreting the SEC’s jurisdiction through the Howey test.","This assesses whether an investment qualifies as a security based on 4 main criteria: an investment of money, expectation of profits, common enterprise, and reliance on the efforts of others. Kraken’s lawyers argued against:","“The SEC cannot satisfy Howey’s additional requirements that there be investments of money in a common enterprise with a reasonable expectation of profits based on the efforts of others.”","According to Kraken, the SEC’s interpretation would unnecessarily broaden its jurisdiction beyond what was intended, potentially drastically changing the financial regulatory environment. They said:","“This would gut Howey by significantly expanding the SEC’s jurisdiction to a host of investment activities that were never delegated to the agency. Such a significant reordering of the US’s financial regulatory structure should be debated in Congress, not in the courts.”","Kraken is just one of many leading companies within the crypto space battling with the SEC. Coinbase, Uniswap, Metamask, and Robinhood have also received regulatory action.","Despite making no progress on individual cases, the SEC continues to challenge major players in the space.","In 2023, like Kraken, Coinbase locked into a battle with the SEC after the federal agency accused the crypto exchange of selling unregistered securities.","Legal counsel for Coinbase had requested that DC Judge Katherine Polk Failla determine whether or not the matter falls outside of the agency’s delegated authority.","During a January hearing, Failla pushed back against Coinbase’s request to restrict the SEC’s regulatory scope.","However, Judge Failla placed the case on hold questioning the overreach of the SEC in their claims. She stated:","“I worry that I would be doing exactly the thing you’re alleging the Commission is doing here, which is to take power that I don’t have to stop activity I shouldn’t be stopping.”","The continued assault on the crypto space has prompted many figures to speak out, citing the SEC’s anti-crypto agenda to be an attempt to push crypto out of the US.","Ethereum Co-founder Joseph Lubin criticized the SEC’s approach, alleging that instead of fostering open discourse and providing clear regulatory guidelines, the SEC has opted for strategic enforcement actions.","This has caused unease within the cryptocurrency industry amidst such regulatory uncertainty,  causing US investors have become hesitant to enter the space. Lubin commented:","“The SEC probably doesn’t want to see a wave of innovation that will really transform the landscape.”","In February 2024, the Crypto and Financial Technology Advocacy Group (CFAT), which includes prominent figures like Paradigm, Coinbase, and Ledger, filed a lawsuit against the SEC.","This came under claims that “The SEC’s novel attempt to extend its regulatory power to virtually all digital assets reach far beyond the scope of its statutory authority.”","CFAT also argued that SEC’s ruling-by-enforcement approach has hindered crypto’s innovation. They claim the SEC has:","“Left this trillion-dollar industry in an unsustainable state of uncertainty, subject to the arbitrary enforcement whims of an agency with an overly broad view of its own authority.”","Today, we at @LEJILEX and the Crypto Freedom Alliance of Texas sued the @SECGov to put an end to its aggressive and unorthodox enforcement actions against our industry: https:\/\/t.co\/HPQfsOtML1","— Mike Wawszczak 🇺🇸 (@mikewawszczak) February 21, 2024","","Hence, Kraken’s position on the matter urged a dismissal. For the SEC to continue, it must revaluate the current US legal framework. Unless they stop overreaching their authority."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Northern District of California","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Mike Wawszczak","content":"PERSON"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Crypto and Financial Technology Advocacy Group","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Failla","content":"PERSON"},{"type":"Crypto Freedom Alliance of Texas","content":"ORGANIZATION"},{"type":"Kraken","content":"LOCATION"},{"type":"February 2024","content":"DATE"},{"type":"February 21, 2024","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Howey","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Kraken","Lawsuit","SEC"],"authors":["Harvey Hunter"]}