{"summary":"It’s Classic Now: Ethereum Classic Suffers Another 51% Attack","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/it-s-classic-now-ethereum-classic-suffers-another-51-attack-7343.htm","publishDate":"2020-08-06T06:00:00","id":19357,"type":null,"title":"It’s Classic Now: Ethereum Classic Suffers Another 51% Attack","category":["Altcoin News "],"content":["Ethereum Classic (ETC), one of the top 30 crypto networks by market capitalization, suffered another 51% attack in less than a week. (Updated at 06:50 UTC: updates in bold.)","“Today another large 51% attack occurred on the #ETC which caused a reorganization of over 4000 blocks. Until further notice ETC pool payouts are disabled and we encourage all our miners to switch to our #ETH pool at http:\/\/ethermine.org in the meantime,” Austria-based blockchain company Bitfly said today.","Additionally, ETC Cooperative, a team of ETC developers, urged all “exchanges, mining pools and service providers either significantly increase confirmation requirements or temporarily pause any deposits or payouts.”","Another ETC team, ETC Core, called “all honest miners and pools” to “sync together to defeat this malicious actor on our network.”","At the time of writing, no further details about the attack were available.","As a reminder, a 51% attack happens when a person or a group gain the control of the majority of mining power on a Proof-of-Work (PoW) blockchain network, meaning that they can double-spend and reverse transactions, preventing other users from mining. It doesn’t, however, allow the attackers to steal other’s coins.","Just recently, ETC experienced a 3,693-block chain reorganization that was likely caused by a 51% attack.","“Attacker double-spent ETC 807,260 (USD 5.6m) during this attack and spent BTC 17.5 (USD 192,000) to acquire the hash power for the attack. The attacker also got ETC 13,000 as a block mining reward, which we are not including in our double-spent calculation,” according to Bitquery, a blockchain analysis firm. The attack took place between July 31 and August 1.","Also, ETC suffered a 51% attack in January 2019.","At pixel time (05:51 UTC), ETC trades at USD 7 and is down by 1.5% in a day and 1% in a week. The price is up by 16% in a month and 19% in a year.",""],"entity":[{"type":"ETC Cooperative","content":"ORGANIZATION"},{"type":"Austria","content":"LOCATION"},{"type":"July 31","content":"DATE"},{"type":"today","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Bitfly","content":"PERSON"},{"type":"August 1","content":"DATE"},{"type":"January 2019","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"19%","content":"PERCENT"},{"type":"ETC","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"Bitquery","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"}],"hashtag":["Ethereum Classic","Security"],"authors":["Linas Kmieliauskas"]}