{"summary":"Trump Released Latest ‘MugShot’ NFTs, Commemorating His Previous Arrest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/trump-released-latest-mugshot-nfts-commemorating-his-previous-arrest.htm","publishDate":"2023-12-13T08:47:38","id":19355,"type":null,"title":"Trump Released Latest ‘MugShot’ NFTs, Commemorating His Previous Arrest","category":["NFT News "],"content":["The former U.S. President Donald Trump has introduced his latest “MugShot” edition NFT collection, referring to his previous arrest.","Priced at $99 per digital trading card, the “MugShot” edition not only encapsulates Trump’s legal history but also adds a new dimension to his previous digital collectible endeavors. Buyers who purchase 47 or more of these cards, a nod to Trump’s potential return as the 47th U.S. president, will be granted an exclusive dinner with Trump at Mar-a-Lago and a piece of the suit he wore during his arrest in August.","This new release of “MugShot” has also stirred interest in the digital collectibles market, rekindling interest in Trump’s earlier NFTs, leading to a significant rebound in their market value.","“Just Like Baseball Cards, But You Collect Them Digitally!” wrote the Trump NFT website. “In this Edition, some cards will even be one-of-ones (the only one in the world), while some others could even be hand-signed by President Donald J. Trump.”","https:\/\/t.co\/0TJzDIcOBP","Watch This Video: Don't Miss Out! pic.twitter.com\/vunSPlEY6Z","— CollectTrumpCards (@CollectTrump) December 12, 2023","","In addition to the dinner with the former president, the consumers who purchase 47 cards in a single transaction would receive a physical card with a piece of cloth from the suit which Trump wore getting arrested, the same one in his mugshot.","On Dec. 12, Representative Dean Phillips openly criticized both President Joe Biden and former President Donald Trump for their limited understanding of cryptocurrencies during the Crypto Presidential Forum.","As a Democratic nominee for the 2024 presidential election, Phillips acknowledged his own gaps in knowledge about financial technology and digital assets, but pointed out the scarcity of expertise in Congress regarding these topics. He specifically highlighted the lack of comprehension from both current and former presidents, stressing the need for more informed leadership in the evolving digital asset landscape.","“The two leading candidates right now, on both the left and the right, for the U.S. presidency are absolutely not in positions to understand it, prepare us for it, anticipate it, and lead us into the next century,” said Phillips. “Joe Biden and Donald Trump, at their age and stage of life, are simply not the right people to lead us forward.”","According to a financial filing in August, Trump holds between $250,000 to $500,000 in digital assets. He released the $99 trading cards in December 2022."],"entity":[{"type":"Trump NFT","content":"ORGANIZATION"},{"type":"$250,000","content":"MONEY"},{"type":"“MugShot”","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"$99","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"December 12, 2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Dec. 12","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Crypto Presidential Forum","content":"ORGANIZATION"},{"type":"Phillips","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Donald J. Trump","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["NFT"],"authors":["Hongji Feng"]}