{"summary":"Diva closed a $3.5 million seed round to build a decentralized liquid staking protocol and compete with Lido and centralized exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202690\/diva-closes-3-5-million-seed-round-for-distributed-liquid-staking-protocol","publishDate":"2023-01-17T09:00:34","id":1936,"type":null,"title":"Diva closes $3.5 million seed round for distributed liquid staking protocol","category":["CRYPTO INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">A handful of protocols and exchanges currently dominate the Ethereum staking scene. Diva recently closed a <\/span><a href=\"https:\/\/divalabs.medium.com\/9e5c3bd38896\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$3.5 million<\/span><\/a><span data-v-f87c67ca=\"\"> seed round led by A&amp;T Capital to change that, with plans to build out a cooperative decentralizing staking pool.<\/span>","<span data-v-f87c67ca=\"\">“Diva is an ultra-light client connecting to existing Ethereum execution and consensus clients via standard APIs,” CEO Pablo Villalba told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">“Stakers can stake any amount of ETH with no minimum, and don't need to run any nodes. A standard web3 wallet is enough” said Villalba. Those who wish to operate a node on Diva and earn rewards may do so with as little as 1 ETH, and the protocol works with any system that meets the minimum requirements to run a full Ethereum node.<\/span>","<span data-v-f87c67ca=\"\">In return for staking ETH on Diva, participants receive a one-to-one ratio of divETH, a freely tradable liquid asset. Any divETH rewards received by stakers accrue in wallets on a daily basis. DivETH can be unstaked and redeemed for ETH, again at a one-to-one ratio, at any time following the March 2023 Capella update, according to Diva.<\/span>","<span data-v-f87c67ca=\"\">The protocol is built to offer rewards to both passive stakers as well as full-time node operators, where “rewards will be socialized across the entire network to achieve smooth and predictable reward rates,” said Villalba.<\/span>","<span data-v-f87c67ca=\"\">Nodes on Diva collaborate together by posting a bond of 1 ETH to form groups.&nbsp;<\/span><span data-v-f87c67ca=\"\">Each group of 16 nodes is matched up against 16 ETH from various stakers on the network, together forming a full validation node.<\/span>","<span data-v-f87c67ca=\"\">Eduard Antuña, founder of the open source Ethereum validator protocol Dappnode, first <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=iHmnBh4En2A&amp;t=432s\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed<\/span><\/a><span data-v-f87c67ca=\"\"> the idea of Distributed Validator Technology (DVT) — which was to become the basis for Diva — at the ETHDenver conference, last year.<\/span>","<span data-v-f87c67ca=\"\">“He saw how the cost was prohibitive to many, and thought to make a ‘decentralized staking pool’ where nodes would validate for each other cooperatively, instead of in their own silos,” said Villalba.<\/span>","<span data-v-f87c67ca=\"\">The high threshold of 32 ETH to set up a validator node on Ethereum is a cost point that excludes many network participants operating nodes of their own. Given that, staking protocols remain largely presided over by organizations such as Lido, where validator keys are in the control of a minority group of whitelisted node operators, and centralized exchanges such as Binance, Kraken and Coinbase that fully control funds and validator keys.<\/span>","<span data-v-f87c67ca=\"\">The growth of such platforms erodes the values of decentralization that are core to the Ethereum blockchain, said Diva.<\/span>","<span data-v-f87c67ca=\"\">“We truly believe that we won't see real decentralization until we solve the validator problem. Diva is our proposal to the community effort to solve that,” said Villalba.<\/span>","<span data-v-f87c67ca=\"\">Concerned by issues of censorship and the power of single parties over the custody of validator keys, and noting the rise of <\/span><a href=\"https:\/\/www.theblock.co\/post\/180158\/63-of-ethereum-transaction-blocks-are-now-ofac-compliant\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">OFAC compliance-<\/span><\/a><span data-v-f87c67ca=\"\">driven censorship on Ethereum, Diva’s team worked with Antuña to build a prototype at ETHLisbon’s hackathon, said Villalba.<\/span>","<span data-v-f87c67ca=\"\">When presented with the opportunity to integrate the protocol, major staking provider Lido declined.<\/span>","<span data-v-f87c67ca=\"\">“Initially we offered Lido a deep partnership, offering our tech to power the heart of a Lido v2 built purely on DVT,” said Villalba. Lido, he pointed out, “has billions in TVL managed by only 30 trusted parties who could easily collude.”<\/span>","<span data-v-f87c67ca=\"\">The collaboration might have had “a significant impact on the ecosystem by dissolving Lido's permissioned islands,” said Villalba.<\/span>","<span data-v-f87c67ca=\"\">But Villalba said that Lido’s team “remained skeptical” of Diva's model, arguing instead that staking should be professionally managed at Devcon Bogotá. The announcement was to be <\/span><a href=\"https:\/\/twitter.com\/marceaueth\/status\/1580630154597974016?s=20&amp;t=Q70VlNrHvrsE-XrsXmnl0g\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">met<\/span><\/a><span data-v-f87c67ca=\"\"> with <\/span><a href=\"https:\/\/twitter.com\/benjaminion_xyz\/status\/1580682894715932673?s=20&amp;t=Q70VlNrHvrsE-XrsXmnl0g\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">criticism<\/span><\/a><span data-v-f87c67ca=\"\"> from some members of the community.<\/span>","<span data-v-f87c67ca=\"\">Spurred on by a passion to decentralize the staking ecosystem and with a solid MVP in hand, “we decided to compete face to face,” said Villalba.<\/span>","<span data-v-f87c67ca=\"\">“We had to come up with an economic system for a P2P network of nodes that would coordinate to act in the interest of the whole community,” said Villalba. “For this, we designed a rewards and penalties system in our own subnetwork of Ethereum nodes, where stakers can provide passive yield and node operators are rewarded for their work.”<\/span>","<span data-v-f87c67ca=\"\">Diva found backing with a $3.5 million seed round led by A&amp;T Capital, with support from other investors including Gnosis, Bankless, OKX Ventures, Metaweb, DCV Capital, Alphemy Capital, Very Early Ventures and Staked.vc. Additional angel investors behind projects such as Metacartel, Aave, Staking Rewards, zkEVM, ZKValidator, EthGlobal, EigenLayer, Aragon, Stakely and many more also joined in.<\/span>","<span data-v-f87c67ca=\"\">Diva is set to go live late January 2023.<\/span>","<span data-v-f87c67ca=\"\">Lido did not immediately respond to The Block’s request for comment.<\/span>","<em data-v-f87c67ca=\"\">Correction: This story has been updated to correct Staked.vc's name.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pablo Villalba","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"Metacartel","content":"LOCATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Villalba","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"A&amp;T Capital","content":"ORGANIZATION"},{"type":"Aragon","content":"LOCATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Ethereum nodes","content":"LOCATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"Antuña","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Very Early Ventures","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Devcon Bogotá","content":"ORGANIZATION"},{"type":"Bankless","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"Alphemy Capital","content":"ORGANIZATION"},{"type":"Eduard Antuña","content":"PERSON"},{"type":"Metaweb","content":"ORGANIZATION"}],"hashtag":["STAKING FIRMS"],"authors":["Jeremy Nation","The Block"]}