{"summary":"Billionaire Biohacker Bryan Johnson Dives into NFT Realm with Drip Solana Airdrop","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/billionaire-biohacker-bryan-johnson-dives-into-nft-realm-with-drip-solana-airdrop.htm","publishDate":"2024-01-30T15:49:48","id":19364,"type":null,"title":"Billionaire Biohacker Bryan Johnson Dives into NFT Realm with Drip Solana Airdrop","category":["NFT News "],"content":["Billionaire biohacker and longevity guru Bryan Johnson is venturing into the world of non-fungible tokens (NFTs) through a Solana airdrop.","Johnson’s Blueprint project collaborated with DRiP and digital artist Degen Poet to create a collection of NFTs issued as a free airdrop for DRiP holders, posts shared on social media platform X have revealed.","Living forever IRL 🤝 Living forever on @Solana","A Sponsored Claim is live featuring Blueprint by @bryan_johnson, with artwork created by our own @solanapoet.","Tap to claim a random collectible, from ⬛️ Common to 🟩 Legendary. Then, get access to the Blueprint waitlist. pic.twitter.com\/4IKn80Wd6K","— DRiP💧 (@drip_haus) January 29, 2024","","The Blueprint collection, consisting of three pieces, was made available to DRiP holders, allowing them to claim a random collectible with different rarities ranging from common to legendary.","Johnson expressed his enthusiasm for the collaboration on X, pointed to the synergy between crypto and longevity, and said he has been “warmly welcomed” by the crypto community.","Crypto x Longevity","We are long best friends and have so much to do together. @solanapoet has warmly welcomed me and our Don’t Die community, creating a unique collection of typewriter art. Free to collect @drip_haus.","Excited with the Solana ecosystem hosted by @superteamDAO. https:\/\/t.co\/EXtQsZPsoW pic.twitter.com\/pxbAhb9uVC","— Zero \/dd (@bryan_johnson) January 29, 2024","","DRiP Haus co-founder and CEO Vibhu Norby also welcomed Bryan Johnson to Solana in his own post on X, saying the artwork now has become “forever immortalized” on DRiP.","Nordy later updated his followers on the progress of the new NFTs, stating that some 22,000 Bryan Johnson collectibles part of the Solana airdrop, equivalent to around 50 collectibles per minute, had been claimed so far.","“Wait until most of the world wakes up,” he added.","22,000 @bryan_johnson x @solanapoet collectibles claimed so far on @drip_haus.","Around 50 per minute. Wait until most of the world wakes up. pic.twitter.com\/9gUBccPUfZ","— vibhu (@vibhu) January 29, 2024","","DRiP account holders can sign up for the airdrop for free with an invite code or join for 0.1 SOL on their wallet balance.","The airdrop, processed in real-time, was covered by DRiP for gas fees, and the collectibles were tagged to indicate their origin within users’ wallets.","Airdrops are free giveaways of tokens or NFTs to users of specific blockchains or protocols within the crypto space. Users usually need to take some type of action to manually claim the tokens, which are then transferred to the user’s own wallet.","The tokens may or may not have any monetary value on the secondary market, but affiliation with celebrities like Bryan Johnson undeniably helps bring awareness about the airdrop."],"entity":[{"type":"Degen","content":"PERSON"},{"type":"Bryan Johnson","content":"PERSON"},{"type":"January 29, 2024","content":"DATE"},{"type":"Johnson","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Vibhu Norby","content":"PERSON"}],"hashtag":["NFT","Solana"],"authors":["Fredrik Vold"]}