{"summary":"Harbor announced today that it has partnered with real estate company iCap Equity to tokenize its $100 million in real estate funds \nThese tokens will allow iCap investors to liquidate their investments more easily even during a lock-up period \nIn April, Harbor failed to carry out a $20 million token sale, which allowed bidders to own a slice of the “mega-dorm” built for University of South Carolina students ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/39784\/pivoting-from-direct-token-sales-harbor-partners-with-real-estate-firm-to-tokenize-100-million-in-assets","publishDate":"2019-09-16T13:23:12","id":1936,"type":null,"title":"Pivoting from direct token sales, Harbor partners with real estate firm to tokenize $100 million in assets","category":["Security Token"],"content":["Harbor, a startup that made headlines in April when its $20 million token sale fell through, is now helping other companies tokenize their securities.&nbsp;","The company announced today that it will work with real estate company iCap Equity to create ERC-20 tokens that represent iCap's over $100 million real estate funds. According to a company statement, this move will allow iCap's 1,100 investors and 17 placement agents to conveniently trade the real estate funds.&nbsp;","The announcement comes in as Harbor is seeking a pivot from directly selling security tokens for its clients to providing the infrastructure for clients to issue their own tokens.","In April, Harbor <a href=\"https:\/\/www.theblockcrypto.com\/daily\/19170\/2018s-banner-security-token-offering-by-harbor-is-scrapped\" data-v-f87c67ca=\"\">offered<\/a> a security token sale of $20 million that allowed investors to own a slice of the giant \"mega dorm\" that houses students at the University of South Carolina. The proposal was eventually called off due to \"the issuer [being unable to come to favorable terms with the existing mortgage lender,\" a Harbor spokesperson told The Block at the time.","In February, Harbor CEO Josh Stein told The Block it is seeing demand for issuers to have a direct relationship with their investors, a direction this partnership with iCap is exploring.&nbsp;","\"We have shifted to be an enabling platform to help issuers and broker-dealers tap into the efficiency and liquidity benefits of the technology... We've built a white-label platform that addresses fundraising management (investor onboarding, digital subscription process), investor communications, and liquidity options including private marketplaces,\" said Harbor director of marketing Kevin Young.&nbsp;","For iCap investors, tokenizing the real estate funds means more liquidity for their investments. Investors who purchase iCap assets usually entail a three- to five-year lock-up period, during which they can either hold the assets or find others willing to take over the remaining lock-up period. Representing these investments as tokens allows investors to trade assets while bypassing much of the paperwork and fees.&nbsp;","“The use of blockchain technology will assist with the accommodation of investors with different time horizons in the same fund. This will aid investors who need liquidity by providing an early exit, while at the same time assisting other investors obtain access to alternatives that were previously closed,\" CEO Michael Bradley of investment advisor firm Bradley Wealth said in a company statement.&nbsp;"],"hashtag":["SECURITY TOKENS","TOKENIZATION"]}