{"summary":"Crypto Whale Invests 460 ETH ($840,000) into New Coin Wall Street Memes – Best Crypto to Buy Now?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-whale-invests-460-eth-840000-into-new-coin-wall-street-memes-best-crypto-buy-now.htm","publishDate":"2023-08-01T18:29:00","id":19374,"type":null,"title":"Crypto Whale Invests 460 ETH ($840,000) into New Coin Wall Street Memes – Best Crypto to Buy Now?","category":["Altcoin News "],"content":["A crypto whale just made a huge investment into one of 2023’s hottest meme coin presales.","Over the course of about five minutes, five different wallets piled 460 ETH (worth nearly $850,000) into the Wall Street Meme’s $WSM token presale.","The coordinated nature of the purchases suggests one individual whale was behind them.","Wall Street Memes is one of the internet’s most powerful retail investing communities, with a massive 1 million-strong follower count across its various social media channels.","The community, which was born out of the movement in 2021 where the little investors teamed up to rebel against Wall Street, has recently been expanding its relevance in the crypto space with a highly sought-after presale of its $WSM meme coin.","Beyond acting as a huge vote of confidence in the project, Tuesday’s massive $WSM whale purchase has helped push the presale beyond the staggering $20 million milestone.","That’s a milestone most presales don’t even attempt to hit, let alone reach.","Given the strength of the Wall Street Memes community and the strong performance of the project’s presale, analysts and observers are billing $WSM to be the next viral meme coin.","Some are predicting it could go on to match the likes of Pepe, Shiba Inu or even Dogecoin.","The king of stonks is fast becoming the king of meme coins. Don’t miss out.","Visit Wall Street Memes Here","In fitting with its focus on empowering the little guy, 100% of the $WSM token supply is being dedicated to the Wall Street Memes community – there is no behind-the-scenes private sale and no team allocation largesse.","That means Wall Street Memes is one of this year’s fairest presales.  ","50% of the token supply is available in the presale, the raise for which and will be allocated to high-level marketing efforts; 30% as community rewards; 10% for CEX liquidity and 10% for DEX liquidity.","With 30% of the supply allocated to community rewards, it can reasonably be expected that airdrops to holders will be a big part of the ecosystem.","In fact, Wall Street Memes is already running a competition where five lucky degens will benefit from a generous $50,000 $WSM airdrop.","Investors who have already purchased $WSM only need to follow the steps detailed on the meme project’s website here to become eligible for the airdrop. ","The success of any meme coin relies on the power of its community and social media presence.","Given that Wall Street Memes already has a strong and engaged community around its project, $WSM already has all of the key ingredients for meme coin success.","It’s not surprising then that numerous analysts are already predicting big things for $WSM when it lists on exchanges.","Popular crypto presale analysts Jacob Crypto Bury and Crypto Dose are both predicting 10x gains for $WSM.","And the coin is also being touted by huge crypto influencers like Michael Wrubel, CryptoWendyO and Cilinix Crypto.","10x gains from $WSM’s exchange listing price of $0.0337 would see the token reach a fully diluted market cap of $674 million.","But some analysts have said $WSM could even match the size of major established meme coins like Dogecoin and Shiba Inu, which have respective market caps of around $8.5 billion and $4 billion.","Wall Street Memes has stated its goal of reaching a market cap of $1 billion, which it hopes to achieve through a combination of big partnerships, top tier CEX listings and awareness campaigns.","But 100x gains to a market cap of over $6 billion shouldn’t be ruled out, with some analysts arguing $WSM stands a chance of becoming one of the largest meme coins.","Anything is possible in crypto markets, especially when your coin is backed by over a million committed degens.","Amid the prospect of big potential gains, $WSM could well be the best crypto to buy right now.","Investors wanting to get in ahead of big potential future price rises should think about getting in on the meme coin’s presale as soon as possible in order to secure their $WSM at the best possible discount.","$WSM can be bought on both the Ethereum blockchain and BNB Smart Chain using ETH, BNB or USDT (ERC-20 or BEP-20).","All users need to do is connect their crypto wallet on the wallstmemes.com website to make their purchase. ","Buy Wall Street Memes Here","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"$850,000","content":"MONEY"},{"type":"Michael Wrubel","content":"PERSON"},{"type":"Pepe","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"WSM","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$50,000 $WSM","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Cilinix Crypto","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$674 million","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$WSM","content":"MONEY"},{"type":"$0.0337","content":"MONEY"},{"type":"$8.5 billion","content":"MONEY"},{"type":"Jacob Crypto Bury","content":"PERSON"},{"type":"1 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dogecoin","content":"PERSON"},{"type":"$WSM stands","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"$20 million","content":"MONEY"}],"hashtag":["Meme coin","Presale","Wall Street Memes","WSM"],"authors":["Joel Frank"]}