{"summary":"Rocket Pool Price Prediction as RPL Breaks Below This Key Support Level – Here’s Why RPL Could Continue Struggling","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/rocket-pool-price-prediction-as-rpl-breaks-below-key-support-level-heres-why-rpl-could-continue-struggling.htm","publishDate":"2023-07-20T23:47:00","id":19376,"type":null,"title":"Rocket Pool Price Prediction as RPL Breaks Below This Key Support Level – Here’s Why RPL Could Continue Struggling","category":["Altcoin News "],"content":["RPL, the utility token that powers the decentralized Rocket Pool Ethereum liquid staking protocol, has been taking a beating on Thursday.","The token, which is used for staking alongside ETH within the Rocket Pool protocol to incentivize honest node operation, as well as for protocol governance, was last down around 7.5% in the last 24 hours, as per CoinGecko.","That makes RPL the worst performing cryptocurrency in the top 100 by market cap over that time period.","RPL’s slump on Thursday saw it break to the south of key resistance in the form of the March lows at $31.30, with RPL\/USD last changing hands not far to the north of the $30 level.","If it also loses the key psychological $30 support, things could get bad for RPL, hence why price predictions are getting more and more bearish.","RPL is looking bad from a technical standpoint.","The cryptocurrency has not only broken below key March support, and is not only threatening a break below $30, but is also trading to the south of all of its major moving averages, with the 21-Day Moving Average (DMA) recently having acted as strong resistance on multiple occasions.","To make matters worse for RPL, a strong sell signal was also recently triggered when the 50DMA fell below the 200DMA last weekend – a so-called “death cross”.","There isn’t much by way of support until the $23-26 area.","Aside from its bearish technical outlook, RPL may continue struggling for fundamental reasons.","Firstly, though the protocol’s share of the staked ETH market has risen from just above 5% to now around 8% since 2023 begun, the pace of market share growth has slowed recently.","And some think it may start to reverse, given that Rocket Pool offers the lowest yield for ETH stakers of all of the major staking protocols, last around 3.3% as per DeFi Llama.","For comparison, Lido offers a yield of around 3.9% while Coinbase Wrapped Staked Ether offers a yield of about 4.4%.","Meanwhile, given its market cap to trade vale locked (TVL) ratio, the RPL token looks comparatively well overvalued when compared to Lido’s LDO token.","As per DeFi Llama, Rocket Pool’s market cap\/TVL ratio is 0.39 to Lido’s 0.12.","So the outlook for Rocket Pool is pretty rough.  ","Traders should thus probably take a look at diversifying their crypto portfolios by looking elsewhere.","Blue chip names like bitcoin (BTC) and ether (ETH) are always a good bet.","But for crypto investors with a higher tolerance for risk and a higher desire for near-term profits, meme coins might be the way to go.","The best way to profit big in the meme coin market is to identify a meme coin with a relatively unknown token that still has a very low market cap, but that has a good chance of exploding to the upside.","Luckily for high-risk tolerance meme coin investors, analysts at Cryptonews.com have identified the perfect such project.","Burn Kenny Coin is a brand-new South Park-themed meme coin that launched its presale on Thursday.","Despite only launching a few hours ago, the new project has already been able to sell a whopping $350,000 worth of $KENNY tokens.","Given that the project is only selling $500,000 worth of the token, meme coin degens need to move quickly if they don’t want to miss out.","$KENNY has a very strong likelihood of seeing explosive upside when it launches on decentralized exchanges (DEXs), which will happen most likely tomorrow.","That’s because:","With the project having now raised more than $340,000, Burn Kenny Coin’s presale could sell out within a matter of hours.","Head over to the Burn Kenny website now, where you can click through to become a follower of the Twitter account and join the Telegram channel, so you will be first to know when the presale ends and about the imminent DEX launch. ","To buy $KENNY in presale, you will need Ethereum.","Connect your wallet at the Burn Kenny Coin website set how much you wish to buy, approve the connection and purchase, and you are done.","Return to the site and claim your tokens after the presale has concluded.","Buy $KENNY on the sly before the rest of the world wakes up, and you could bag the easiest 3x, or more, opportunity in crypto.","","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital.",""],"entity":[{"type":"$30","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"26","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"last weekend","content":"DATE"},{"type":"$340,000","content":"MONEY"},{"type":"DMA","content":"ORGANIZATION"},{"type":"Kenny Coin","content":"PERSON"},{"type":"$350,000","content":"MONEY"},{"type":"South Park","content":"LOCATION"},{"type":"$31.30","content":"MONEY"},{"type":"7.5%","content":"PERCENT"},{"type":"TVL","content":"ORGANIZATION"},{"type":"3.9%","content":"PERCENT"},{"type":"RPL","content":"ORGANIZATION"},{"type":"$23","content":"MONEY"},{"type":"4.4%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"3.3%","content":"PERCENT"},{"type":"Burn Kenny Coin","content":"ORGANIZATION"},{"type":"Burn Kenny","content":"LOCATION"},{"type":"$KENNY","content":"MONEY"},{"type":"$500,000","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"}],"hashtag":["Meme coin","Presale","Price Prediction"],"authors":["Joel Frank"]}