{"summary":"Mark Lamb, the CEO of CoinFLEX, has accused one of the company’s investors, Roger Ver, of defaulting on a loan worth $47 million.\nVer addressed rumors by denying that he defaulted on any loan and saying that he was the one that was owed money by a “counter-party.”","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154616\/coinflex-ceo-accuses-investor-roger-ver-of-defaulting-on-47-million-loan","publishDate":"2022-06-28T14:55:59","id":1937,"type":null,"title":"CoinFLEX CEO accuses investor Roger Ver of defaulting on $47 million loan","category":["Exchanges"],"content":["CEO of CoinFLEX Mark Lamb today accused investor Roger Ver of defaulting on a loan agreement worth $47 million in USDC.","Lamb <a href=\"https:\/\/twitter.com\/MarkDavidLamb\/status\/1541831697787928576\" data-v-f87c67ca=\"\">said Tuesday on Twitter<\/a> that the contract required Ver to \"guarantee any negative equity\" and that he had been served a notice of default.","Seemingly responding to those accusations, <a href=\"https:\/\/twitter.com\/rogerkver\/status\/1541822377461415936\" data-v-f87c67ca=\"\">Ver wrote on Twitter<\/a> that rumors that he had defaulted on a loan were false. Instead, according to the investor, he is the one that is owed money.","\"This counter-party owes me a substantial sum of money, and I am currently seeking the return of my funds,\" Ver said.","Last week, CoinFLEX&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/153871\/coinflex-halts-withdrawals-amid-extreme-market-conditions\" data-v-f87c67ca=\"\">paused all withdrawals from users<\/a>, citing market conditions and \"continued uncertainty involving a counterparty.\"","On Monday the company announced that it was <a href=\"https:\/\/www.theblock.co\/post\/154468\/coinflex-plans-new-token-to-raise-funds-days-after-halting-withdrawals\" data-v-f87c67ca=\"\">launching a new token<\/a> called Recovery Value USD (rvUSD) — curiously with the same initials as Ver. It issued $47 million worth of it to start with, which is the same amount Lamb claims Ver owes.","On Twitter, Lamb also denied that CoinFLEX had any debts towards Ver, doubling down on the initial accusation.","\"He is denying that the debt pertains to him and so we felt the need to clarify to the public that yes - the debt is 100% related to his account,\" Lamb said. \"It is unfortunate that Roger Ver needs to resort to such tactics in order to deflect from his liabilities and responsibilities.\"","Besides being an investor in CoinFLEX itself, Ver has also backed companies like Bitcoin.com, Blockchain.com and Kraken."],"hashtag":[]}