{"summary":"On-chain Expert Probes the Ethereum Foundation’s Link to the Filecoin ICO","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chain-expert-probes-the-ethereum-foundations-link-to-the-filecoin-ico.htm","publishDate":"2023-09-28T18:00:00","id":19389,"type":null,"title":"On-chain Expert Probes the Ethereum Foundation’s Link to the Filecoin ICO","category":["Altcoin News "],"content":["An on-chain investigator, known as @BoringSleuth on X (formerly Twitter), has raised questions about the origin of the popular blockchain project Filecoin (FIL) and its initial coin offering (ICO). ","In a recent report shared on X, BoringSleuth detailed that they began their investigation by mapping out wallets associated with Filecoin and observed trends in funding transactions. ","“I was mapping out Wallets, starting with the wallet that sent the most ETH sent to Filecoin, and working my way down until I was deep enough,” the user wrote. ","“I began to notice trends, in both how the wallets were funded, who those wallets interacted with and in what patterns, as well as who was the owner of the wallets.”","More specifically, they discovered that several wallets that were sending Ethereum (ETH) to the Filecoin ICO wallet had very long decimal numbers. ","The investigator identified a total of 1,255 transactions with these unique numerical patterns.","Out of the identified transactions, 296 wallets concluded with 937, another 228 wallets with 967, some 179 wallets with 697, and 111 wallets with 696. ","The remaining 106 transactions had distinct last three digits but shared the same long decimal numbers.","BoringSleuth argued that these patterns were orchestrated by the founders and venture capitalists (VCs) involved in the ICO to create the appearance of high interest. ","The investigator suggests that this was done to deceive investors, with the intention of dumping tokens on unsuspecting participants. ","According to BoringSleuth, such codes or patterns are used to group together the senders and their contributions.","“You see, when you want to make it look like a bunch of people are “Apeing” in to your token sale, that you and your handful of VC’s are going to dump on the pleb’s, you have to use some sort of code that helps group together who sent what.”","🚨🇨🇳 Was #Filecoin a FRAUD Orchestrated by the Ethereum Foundation, Wanxiang, Prometheum, and other CCP entities? READ TO THE END!! 🇨🇳🚨\n\nWhen you sleuth, you need to remain open to all possibilities. Within a transaction, data can be derived from just about the entirety of it.… pic.twitter.com\/MzX82n4InC","The report even linked popular figures such as Ethereum founder Vitalik Buterin and the Ethereum Foundation to these activities. ","The investigator also suggested involvement from the CCP Group, as well as Cumberland and Prometheum, while referring to the Filecoin ICO as a Ponzi scheme.","BoringSleuth claimed to have grouped the wallets and crosschecked them with the “Truth Labs Database of Networks and Wallets” to ascertain ownership, which allowed the investigator to attribute the wallets to different entities involved in the ICO.","The report has gained notable attention on social media platforms, amassing around 150k views on X.","BoringSleuth has also claimed that there is more to be revealed at a later date. ","Despite the controversies surrounding its ICO, Filecoin has grown to be massive.","The project, a decentralized storage network that aims to create a global marketplace for storing and retrieving digital data, currently has a market cap of more than $1.4 billion, ranking as the 32nd largest cryptocurrency in the world.","As of now, Filecoin’s native token FIL is trading at $3.26, largely flat over the past day. "],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"CCP Group","content":"ORGANIZATION"},{"type":"Wanxiang","content":"ORGANIZATION"},{"type":"CCP","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Prometheum","content":"LOCATION"},{"type":"$3.26","content":"MONEY"},{"type":"“Truth Labs Database of Networks","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Filecoin ICO","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"Filecoin","content":"PERSON"},{"type":"Filecoin","content":"LOCATION"}],"hashtag":["ICO","Vitalik Buterin"],"authors":["Ruholamin Haqshanas"]}