{"summary":"March 2024: ETH Hit $4000, What Else Happened In The Ethereum Ecosystem?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-hit-4000-what-else-happened-to-the-ethereum-ecosystem-march-2024.htm","publishDate":"2024-04-08T09:11:18","id":19394,"type":null,"title":"March 2024: ETH Hit $4000, What Else Happened In The Ethereum Ecosystem?","category":["Ethereum News "],"content":["This report explores and analyzes Ethereum price and ecosystem developments, as well as notable events that happened in March 2024.","Key takeaways:","","Founded in 2013 by Vitalik Buterin, Ethereum serves as a distributed blockchain computing platform designed for the execution of smart contracts and decentralized applications (DApps). The network enables users to create and innovate extensively with smart contracts, catalyzing the emergence of various assets and industries such as decentralized finance (DeFi), non-fungible tokens (NFTs), decentralized autonomous organizations (DAOs), Web3, and beyond. At its core, Ethereum features an execution engine tailored for smart contract processing, known as the Ethereum Virtual Machine (EVM). In addition, Ethereum employs a proof-of-stake (PoS) consensus mechanism, which enhances its scalability and sustainability.","On March 11, the Ethereum price hit $4,000 for the first time since 2021. However, after rallying to $4,094 leading up to the Dencun upgrade, ETH underperformed compared to Bitcoin (BTC) and the broader crypto market over the past month. The Ethereum price fell to its low for the month of $3,367 on March 20 and closed the month at $3,636.","The potential approval of a spot Ether exchange-traded fund (ETF) remains an important catalyst for ETH to rise above the $4,000 mark. The United States Securities and Exchange Commission (SEC) is currently evaluating the matter, with a final decision expected by May 23. ","Furthermore, recent updates to the Ethereum protocol should not be underestimated. The Dencun hard fork, which took place on March 13, was designed to increase network scalability and improve Layer 2 (L2) data processing capabilities and has attracted strong interest from rollup solutions. As a result, transaction fees for most applications on Ethereum L2s like Arbitrum, Optimism, Startnet, and Zora Network have been significantly reduced. ","On Ethereum, reductions in fees were observed as well. Total fees on Ethereum dropped from $38.7 million on March 5 to $9.4 million on March 31. ","Total revenues on Ethereum decreased by 48% in the 10 days following EIP-4844 was implemented. The proposal introduces a novel transaction type capable of accepting data blobs. ","","","With a total value locked (TVL) of between $47.2 billion and $57.9 billion (peaking on March 13), Ethereum had the largest market share of any blockchain last month.","However, there has been some volatility in Ethereum network activity over the past month. The number of daily active addresses across the Ethereum ecosystem increased from 413k on March 1 to 534k on March 20, and then dropped to 467k on March 31.","Ethereum’s daily transaction volume also fluctuated during the month, rising from 1.2 million on March 1 to 1.4 million on March 19, and falling back to 1.2 million by the end of the month. ","The potential approval of a spot Ether ETF is one of the most eagerly anticipated events that could significantly impact the short-to-medium-term Ethereum price. Compared to the previous approval of Bitcoin ETFs, the approval of an ETH ETF is less certain, as it is expected to face increased regulatory scrutiny from the SEC. ","In March, the SEC postponed its decision on VanEck’s ETF application until May 23, and similarly delayed decisions on the Hashdex and ARK 21Shares Spot ETH ETFs until late May.","Recent filings with the SEC by big asset management firms, including Fidelity (on March 27) and Bitwise (on March 28) to create spot ETH ETFs underscore the growing interest in Ether-based financial products. Fidelity’s filing, in particular, indicates its intention to put some of the ETH it holds to work, demonstrating confidence in Ether’s long-term prospects. ","Additionally, the London Stock Exchange (LSE) announced it would accept applications for Ether and Bitcoin crypto exchange-traded notes (ETNs) in the second quarter of 2024, further underscoring the growing mainstream acceptance and integration of cryptocurrencies into traditional financial systems.","However, despite such strong interest in ETH ETFs, this back-and-forth dialogue between industry players and regulators underscores the complexities and nuances of integrating Ether-based financial instruments into traditional financial systems. Unsurprisingly, the Grayscale Ethereum Trust discount has fallen to its lowest level since November 2023 amid fading hopes for a spot ETF in May. ","According to data from Coin98 Analytics, the Ethereum ecosystem experienced significant growth in the first quarter of 2024. Ethereum tripled its earnings on a quarter-over-quarter basis in Q1 2024, reaching $369 million. The amount represented a 210% year-over-year increase from $119 million in Q1 2023.","Ethereum’s Q1 2024 fees and revenues increased 79% and 85% quarter-over-quarter, respectively. According to the data, Ethereum generated $1.2 billion in transaction fee revenue in Q1 2024, which is 155% more than in the first quarter of last year. Total Ethereum revenue reached $1 billion in Q1 2024, up 186% from $385 million last year. ","In March 2024, the Ethereum ecosystem witnessed several significant updates and developments that promise to shape its future trajectory.","BlackRock, the world’s largest asset manager, announced an initiative to launch a tokenized asset fund on Ethereum, solidifying the network’s importance. The BlackRock USD Institutional Digital Liquidity Fund (BUIDL) will be fully collateralized by cash, U.S. Treasury bills, and repurchase agreements, offering qualified investors the opportunity to earn U.S. dollar income. In a strong symbolic gesture, BlackRock deposited $100 million in USDC on the Ethereum network.","Google expanded its Ethereum search features to include human-readable Ethereum Name Service (ENS) domains, allowing users to view wallet balances associated with ENS names directly in search results. This integration further bridges the gap between traditional search functionality and blockchain data, improving accessibility and usability for users.","Nansen, a blockchain analytics platform, integrated blockchain data from SportFi chain Chiliz and Ethereum rollup zkSync on March 28. This integration provides a comprehensive overview of both ecosystems, allowing cryptocurrency teams to run queries and gain insights from raw data, thereby enhancing their decision-making capabilities.","Additionally, Ethereum’s Pectra upgrade is set to raise the maximum validator stake to 2,048 ETH, a significant increase from the current 32 ETH. This move, expected by the end of the year, aims to enhance the security and decentralization of the Ethereum network.","Furthermore, on March 26, Ethereum client diversity improved as the market share of Geth, a major Ethereum execution client, dropped from 84% to 63%. Coinbase’s decision to switch around half of its validators to Nethermind contributed to this diversification, addressing long-standing concerns about centralization risks within the Ethereum network.","Lastly, on March 21, Ethereum developers launched the “Pump The Gas” initiative to increase the blockchain network’s gas limit from 30 million to 40 million. This initiative aims to reduce transaction fees on layer 1, potentially improving Ethereum’s scalability and usability.","Ethereum Layer 2 protocols experienced a significant drop in transaction fees in March after the Dencun upgrade, as reported above. This led to increased translation on some L2 networks. ","For example, Coinbase’s Ethereum-based Layer 2 network Base saw a new high in daily transactions, which jumped from approximately. 440,000 before the upgrade to over 2 million on March 16, accompanied by a massive 3,200% increase in daily new users on Base –  (666,866 on March 16).","On March 12, Layer-2 scaling protocol Starknet announced the rollout of additional fee-saving measures to coincide with the Dencun upgrade. This hard fork aims to transform the storage of data on the Ethereum mainnet, introducing “blob space” as a cost-effective alternative to the traditional call data method. ","The protocol’s transition to a proto-danksharding, inspired by the Ethereum Improvement Proposal (EIP-4844), is expected to result in immediate fee reductions. In addition, the Foundation is preparing to release version 0.13.1, which will move from the costly call data method to the more economical blobs transaction type, with the goal of significantly reducing fees. This move is expected to have a significant impact on Starknet’s gas expenses, as call data accounts for nearly 90% of fees. In addition, a new hash system will be deployed to increase the protocol’s transaction capacity. ","In March, Uniswap continued to maintain its position as the leading DEX on the Ethereum blockchain. In particular, Uniswap’s governance token, UNI, surged 46%, topping $16 on March 6 and reaching a peak not seen since January 2022. This surge was complemented by a 54% increase in trading volume ($36,5 billion in February vs. $79,5 billion in March).","This follows a proposal by the Uniswap Foundation to upgrade the protocol’s fee redistribution governance with the goal of increasing community participation. In particular, the upgrade will focus on the distribution of the protocol fee to the holders of the UNI token.","Decentralized finance protocol MakerDAO’s ambitious “Endgame” transformation aims to grow the DeFi stablecoin market capitalization from $4.5 billion to over $100 billion, positioning it as a formidable competitor to Tether (USTD). ","Launch Season is upon us!","Endgame focuses MakerDAO towards scalable resilience and sustainable user growth: The goal is 100 billion Dai and beyond","Launch Season will bring the most important yield farming and UX features rapidly to market","More: https:\/\/t.co\/gWLWBWpEq8","(1\/9) pic.twitter.com\/Xujg04uYX2","— Rune (@RuneKek) March 12, 2024","","Ethena, a synthetic dollar protocol built on Ethereum, became the highest-earning DApp after surpassing $6.8 million in daily cumulative revenue in the first week of March. The only blockchains to surpass Ethena’s revenue were Tron, with $38.6 million, and Ethereum, with $182.5 million in daily cumulative revenue over the seven days.","Ethena nr 3 in terms of revenue pic.twitter.com\/c14c3HL2Td","— Seraphim (@MacroMate8) March 8, 2024","","Layer 2 developer Eclipse Labs secured $50 million in Series A funding, led by Placeholder and Hack VC. This funding aims to bolster Ethereum scalability using the Solana Virtual Machine (SVM). By integrating SVM’s high performance with the Ethereum ecosystem liquidity, Eclipse Labs aims to offer a differentiated Layer 2 solution. With collaborations with Rarible, Pyth Network, and Solend, Eclipse Labs targets a mainnet launch in Q2, promising a scalable and composable Layer 2 network.","The Optimism Foundation, the entity behind the Ethereum layer-2 blockchain Optimism, revealed a private sale of approximately 19.5 million of its governance tokens on March 8. With each Optimism (OP) token valued at around $4.62, the total worth of the tokens sold stands at approximately $90 million at the current market value. Notably, the foundation has stipulated a two-year vesting period for the sold tokens, preventing buyers from trading them before this period lapses. ","Morph, a developer of Ethereum’s Layer 2 network, successfully raised $20 million in combined seed and angel funding rounds. The $19 million seed round was spearheaded by Dragonfly, with contributions from Pantera Capital, Foresight Ventures, the Spartan Group, Symbolic Capital, and other esteemed investors. Additionally, the angel round, amounting to $1 million, enlisted the support of prominent figures, including Sandeep Nailwal from Polygon and Alex Svanevik from Nansen.","On March 24, Ethereum layer-2 scaling solution Polygon reported downtime for its zero-knowledge Ethereum Virtual Machine (zkEVM) due to a problem with its blockchain sequencer. Polygon has addressed its two million followers, emphasizing that the issue is isolated to zkEVM and does not affect any other chain deployed using the Polygon chain development kit (CDK).","The NFT market and NFT sales, in general, saw a slight dip in March, but Ethereum managed to remain the first most popular blockchain network for trading in the NFT ecosystem. ","According to CryptoSlam data, the sales volume of Ethereum-based NFTs reached $489.5 million in March, 11% less than in February ($553.4 million). The data further revealed that the Ethereum network attracted around 98k buyers and 84k sellers of NFTs in March. The number of NFT transactions on Ethereum reached more than 648k in March, 22% less than the previous month. ","Despite the Ethereum price reaching two-year highs, the prices of top NFTs witnessed a significant decline in March. The ETH-denominated floor prices for several of the top traded collections on NFT marketplace Blur plummeted. Yuga Labs’ Bored Ape and Mutant Ape Yacht Club saw drops of 44% and 35%, respectively. Additionally, collections such as DeGods experienced a decline of over 55%. ","However, in the midst of the downturn, NFT’s blue-chip CryptoPunks collection on the Ethereum blockchain continued to make headlines with record-breaking sales. In March, a rare Alien-like Punk fetched approximately $16 million in ETH, marking another milestone for the highly sought-after collection. Only nine Alien CryptoPunks have ever been minted, adding to the scarcity and desirability of these digital assets.","The gaming sector continues to be a major focus for Layer 2 projects on the Ethereum blockchain. Layer 2 networks Starknet and Arbitrum doubled down on promoting gaming development. The Starknet Foundation allocated $125.5 million worth of tokens to advance gaming initiatives on the network, while Arbitrum launched the Gaming Catalyst Program (GCP) to spur the growth of Web3 gaming, demonstrating the increasing focus on blockchain-based gaming within the Ethereum ecosystem. ","In conclusion, despite ETH reaching $4,000 in March for the first time since 2021, its performance has been subdued compared to BTC and the broader crypto market over the past month. ","The Ethereum ecosystem witnessed various updates and developments, including initiatives by major asset management firms such as Fidelity and Bitwise to create spot Ether ETFs, highlighting the growing interest in Ether-based financial products. In addition, the London Stock Exchange’s announcement to accept applications for Ether and Bitcoin ETNs in Q2 2024 further underscores the mainstream acceptance of cryptocurrencies.","Furthermore, recent updates to the Ethereum protocol, in particular the Dencun hard fork, aimed to improve scalability and reduce transaction fees on L2 solutions such as Arbitrum, Optimism, Starknet, and Zora Network. This also led to a notable decrease in fees on Ethereum in March, from $38.7 million to $9.4 million by the end of the month.","In the DeFi sector, MakerDAO’s ambitious “Endgame” transformation aims to grow the DeFi stablecoin market cap from $4.5 billion to over $100 billion, positioning it as a competitor to Tether. ","Additionally, Ethereum’s NFT market saw a slight dip in March, although it remained the most traded blockchain network in the NFT ecosystem, with turnover reaching $489.5 million. Despite price declines for top NFT collections, the Ethereum-based CryptoPunks NFT collection continued to make headlines with record-breaking sales, demonstrating the enduring appeal of digital collectibles.","Looking ahead, Ethereum’s focus on scalability, regulatory developments regarding ETH ETFs, and continued innovation in the DeFi and NFT sectors are likely to shape its future trajectory and adoption.","",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Rune (","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"January 2022","content":"DATE"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"$4.62","content":"MONEY"},{"type":"$90 million","content":"MONEY"},{"type":"$4,094","content":"MONEY"},{"type":"186%","content":"PERCENT"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"VanEck’s ETF","content":"ORGANIZATION"},{"type":"Coinbase’s Ethereum","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"$385 million","content":"MONEY"},{"type":"May 23","content":"DATE"},{"type":"2 million","content":"MONEY"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"March 12, 2024","content":"DATE"},{"type":"Ether","content":"LOCATION"},{"type":"85%","content":"PERCENT"},{"type":"$182.5 million","content":"MONEY"},{"type":"London Stock Exchange (LSE","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"March 2024","content":"DATE"},{"type":"Coin98 Analytics","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"46%","content":"PERCENT"},{"type":"$100 billion","content":"MONEY"},{"type":"Pyth Network","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$553.4 million","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"Eclipse Labs","content":"ORGANIZATION"},{"type":"March 1","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$369 million","content":"MONEY"},{"type":"March 8","content":"DATE"},{"type":"March 6","content":"DATE"},{"type":"March 5","content":"DATE"},{"type":"the first week of March","content":"DATE"},{"type":"$38.7 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"$19 million","content":"MONEY"},{"type":"63%","content":"PERCENT"},{"type":"the London Stock Exchange","content":"ORGANIZATION"},{"type":"$4,000","content":"MONEY"},{"type":"48%","content":"PERCENT"},{"type":"$20 million","content":"MONEY"},{"type":"$79,5 billion","content":"MONEY"},{"type":"3,200%","content":"PERCENT"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"$4,000 mark","content":"MONEY"},{"type":"Ethereum’s Pectra","content":"ORGANIZATION"},{"type":"54%","content":"PERCENT"},{"type":"$16","content":"MONEY"},{"type":"$3,367","content":"MONEY"},{"type":"$119 million","content":"MONEY"},{"type":"$6.8 million","content":"MONEY"},{"type":"March 8, 2024","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"79%","content":"PERCENT"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Alex Svanevik","content":"PERSON"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"$38.6 million","content":"MONEY"},{"type":"$36,5 billion","content":"MONEY"},{"type":"$3,636","content":"MONEY"},{"type":"second quarter of 2024","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"ENS","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"March 31","content":"DATE"},{"type":"March","content":"DATE"},{"type":"155%","content":"PERCENT"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Zora Network","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Optimism Foundation","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"March 27","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$125.5 million","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"March 26","content":"DATE"},{"type":"44%","content":"PERCENT"},{"type":"March 24","content":"DATE"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"84%","content":"PERCENT"},{"type":"March 21","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"March 20","content":"DATE"},{"type":"$489.5 million","content":"MONEY"},{"type":"BlackRock USD Institutional Digital","content":"ORGANIZATION"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Q1 2024","content":"DATE"},{"type":"Q1 2023","content":"DATE"},{"type":"Solana Virtual Machine (SVM","content":"ORGANIZATION"},{"type":"March 19","content":"DATE"},{"type":"$9.4 million","content":"MONEY"},{"type":"March 16","content":"DATE"},{"type":"55%","content":"PERCENT"},{"type":"the first quarter of last year","content":"DATE"},{"type":"March 13","content":"DATE"},{"type":"March 12","content":"DATE"},{"type":"March 11","content":"DATE"},{"type":"$57.9 billion","content":"MONEY"},{"type":"210%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"GCP","content":"ORGANIZATION"},{"type":"Nethermind","content":"LOCATION"},{"type":"19.5 million","content":"MONEY"},{"type":"March 16)","content":"DATE"},{"type":"Rarible","content":"PERSON"},{"type":"$47.2 billion","content":"MONEY"}],"hashtag":["Ethereum","Ethereum ETF","Ethereum News"],"authors":["Veronika Rinecker","Hristina Yordanova"]}