{"summary":"Bitcoin Breaks Through 1.6M Confirmed Transactions in a Single Day","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-breaks-through-1-6m-confirmed-transactions-in-a-single-day.htm","publishDate":"2024-04-30T20:31:37","id":19395,"type":null,"title":"Bitcoin Breaks Through 1.6M Confirmed Transactions in a Single Day","category":["Bitcoin News "],"content":["Just three days after the Bitcoin halving event, a record-breaking 1.6 million unique Bitcoin transactions were processed on April 23, according to data from Blockchain.com and Glassnode. The transaction surge signifies a growing interest in utilizing Bitcoin for everyday trades, moving beyond its traditional role as a store of value.","","Blockchain.com data points to a direct correlation between the launch of Bitcoin Runes, an alternative to Bitcoin Ordinals, and the spike in daily Bitcoin payments. On April 23, Runes accounted for 68% of all Bitcoin transactions, demonstrating its rapid adoption within the community.","","While BTC reasserted its dominance by April 29 with 77.8% of Bitcoin transactions, Runes maintained a strong second position with an 18.8% share. Other protocols like Ordinals and BRC-20 tokens also contributed to the network activity.","","","The rise of Bitcoin Runes has also generated over 1,200 BTC in transaction fees for miners since the Bitcoin halving event, presenting a powerful incentive for miners, and showcasing the economic viability of this emerging protocol.","Some experts urge caution, however. On April 17, pseudonymous DeFi researcher Ignas warned on X (formerly Twitter) that while Runes look promising, they could share the same fate as NFTs.","1\/16 Runes Protocol launches in 2 days: Ready to FOMO in?","Hold up.","There are few reasons to stay bearish for now:","— Ignas | DeFi Research (@DefiIgnas) April 17, 2024","","BRC-20 and Runes tokens represent the emergence of a new standard known as Bitcoin DeFi (BTCFi). These fungible token standards seek to expand Bitcoin’s utility beyond its current capabilities, opening doors to DeFi applications built on the Bitcoin blockchain.","The evolution is expected to unlock novel opportunities for Bitcoin holders and foster the growth of the BTCFi ecosystem. As developers explore BTCFi’s potential, investors can anticipate further innovation and diversification in Bitcoin payments and applications."],"entity":[{"type":"Bitcoin Ordinals","content":"PERSON"},{"type":"18.8%","content":"PERCENT"},{"type":"Ignas | DeFi Research","content":"ORGANIZATION"},{"type":"Bitcoin Runes","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 23","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Bitcoin DeFi","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"68%","content":"PERCENT"},{"type":"April 17, 2024","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"April 17","content":"DATE"},{"type":"77.8%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"Glassnode","content":"ORGANIZATION"}],"hashtag":["Bitcoin halving","btc","Runes Protocol"],"authors":["Thomas Musgrave"]}