{"summary":"Launched in early 2018, MegaCryptoPolis pioneered the adoption of NFTs being the first city-builder economic strategy game. The project gathered a huge community of players shaping the game’s economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122835\/megacryptopolis-dapp-game-with-3-years-history-transforms-into-metaverse","publishDate":"2021-11-01T17:11:36","id":194,"type":null,"title":"MegaCryptoPolis, dApp Game with 3 Years History, Transforms into Metaverse","category":["SPONSORED"],"content":["<a href=\"https:\/\/mcp3d.com\/?from=theblock\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MegaCryptoPolis<\/span><\/a><span data-v-f87c67ca=\"\"> has been live for 3 years and is seeing more than 10x growth in 2021.<\/span>","<span data-v-f87c67ca=\"\">Districts and Land Plots are managed on the Ethereum and TRON Network, while others migrated to Polygon (formerly Matic) for zero fees and instant transactions.<\/span>","<b data-v-f87c67ca=\"\">What is MegaCryptoPolis?<\/b>","<span data-v-f87c67ca=\"\">Launched in early 2018, <\/span><a href=\"https:\/\/mcp3d.com\/?from=theblock\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MegaCryptoPolis<\/span><\/a><span data-v-f87c67ca=\"\"> pioneered the adoption of NFTs being the first city-builder economic strategy game. The project gathered a <\/span><a href=\"https:\/\/discord.com\/invite\/AyX5QRw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">huge community of players<\/span><\/a><span data-v-f87c67ca=\"\"> shaping the game’s economy. Players can own land plots, houses, offices, and factories. Citizens need jobs, jobs need employees, factories produce resources, and so on. All these digital assets are an integral part of the MegaCryptoPolis ecosystem.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","&nbsp;","","","<span data-v-f87c67ca=\"\">The scarcity of land and resources (like in the real world) is the foundation of the game’s economy. It is hardcoded that when a player purchases a land plot, all the owners of nearby plots, as well as the owner of a District, receive a share of the price paid, and all nearby plots are getting more expensive. All the funds are distributed between players, the developers receive a small percentage of each in-game operation as a part of the sustainable revenue model. <\/span>","","","<b data-v-f87c67ca=\"\">Creating the Metaverse<\/b>","<span data-v-f87c67ca=\"\">For now, the company is on the verge of extending the existing MegaCryptoPolis model to the metaverse called Mega World, with the data-driven economy, where players will be able to create any assets, operate businesses inside their buildings, use and trade NTFs from various projects, visit each other’s properties, interact, and complete missions using their Citizen as an avatar. The game plans to offer every new user a Gen K Citizen (for an Avatar) and a tiny apartment in the Town Hall to craft the first Items and start with the game without even having a blockchain wallet.<\/span>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“Mega World will transform the gaming map into the global interactive NFT marketplace, where players will be able to display and shop for NFTs as they do groceries in real life”, - commented Alex Li, COO at <\/span><\/i><a href=\"http:\/\/spnv.io\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SUPERNOVAE<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">, game vendor.<\/span><\/i>","<span data-v-f87c67ca=\"\">More free-to-play activities will become available in Mega World with no fees or wallets required to play. Free and fast transactions allow creating a free-to-play experience on top of an existing gaming world. Mega World will enable new players to get acquainted with NFT technology and contribute to mass adoption.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Mega World Intro is scheduled to go live on November 2. MegaCryptoPolis <\/span><a href=\"https:\/\/play.mcp3d.com\/store\/?from=theblock\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Packs Store<\/span><\/a><span data-v-f87c67ca=\"\"> with unique Generation A Citizens will remain open until November 9 with a whopping 70% discount. Only 15’000 Gen A will ever exist. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matic","content":"PERSON"},{"type":"Town Hall","content":"LOCATION"},{"type":"November 9","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alex Li","content":"PERSON"},{"type":"November 2","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Mega World","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Metaverse","content":"LOCATION"},{"type":"Mega World Intro","content":"ORGANIZATION"},{"type":"TRON Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}