{"summary":"New York’s Bar Association Seeks Law Reform to Keep Crypto Market Lead","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-yorks-bar-association-seeks-law-reform-to-maintain-leading-crypto-market.htm","publishDate":"2024-01-30T14:23:06","id":19405,"type":null,"title":"New York’s Bar Association Seeks Law Reform to Keep Crypto Market Lead","category":["Blockchain News "],"content":["New York City’s Bar Association has pitched an amendment to the law relating to emerging technologies aiming to see the city maintain its crypto market lead.","The proposals on several issues were contained in its New York’s state Legislative Agenda released on Jan 29. The Bar seeks to amend lawsuits ranging from financial activities to human rights.","The association put forward the Emerging Technologies Amendment which will tweak the States Uniform Commercial Code (UCC).","According to the release, the association emphasized New York’s lead in financial and commercial activities. Still, it warned that the case is different with cryptocurrencies and an amendment to the UCC will preserve the state’s lead in modern financial services.","The proposed Emerging Technologies Amendment will reshape the handling of financial transactions with efforts to secure and speed while significantly decreasing transaction costs.","“Enacting the New York Emerging Technologies Amendments is necessary to preserve New York’s preeminence as a leading commercial jurisdiction by adapting New York’s Uniform Commercial Code (UCC) to recent and potential future developments in technology and related new methods of doing business.”","If these changes are implemented, this could serve as an added advantage for the city when market participants make key decisions on the location of their enterprise.","Aside from business premises, stakeholders in emerging financial services will also be lured to choose New York’s laws to settle trade disputes. Especially as the laws will cover emerging use cases.","The state’s UCC has not been amended since 2014 despite many innovations in financial and commercial infrastructure globally. The proposed change could help preserve the status quo regarding corporate finance while disincentivizing the migration to other jurisdictions.","Although New York leads in terms of crypto market participants registered, eleven states have passed UCC amendments with 15 more states introducing bills. As more states join the bandwagon, the Association warns that stakeholders in emerging finance may switch to other cities.","As the adoption of digital assets continues, more countries are developing laws to incorporate crypto and associated technologies to ease and attract investment, protect investors, and achieve faster as well as better cross-border payments.","However, for most jurisdictions, attaining cryptocurrency regulations has proved a challenge and has led to gaps within the sector leading to losses occasioned by bad actors and a plethora of lawsuits between authorities and executives due to uncertain laws.","In the United States, stakeholders have criticized the lack of rules and regulatory approach of the Securities and Exchange Commission (SEC) and warned of a possible exodus.","Today, 83% of G20 members and major financial hubs have made progress toward regulatory clarity for crypto. But the US is an outlier.","A picture paints a thousand words. https:\/\/t.co\/DpxoKFr4yV pic.twitter.com\/KvQ4q0zlsn","— Coinbase 🛡️ (@coinbase) September 7, 2023","","Last year, Coinbase announced plans for an international expansion to well-regulated markets like Hong Kong, and Brazil, while still pushing for clearer rules in the U.S."],"entity":[{"type":"2014","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"States Uniform Commercial Code (UCC","content":"ORGANIZATION"},{"type":"G20","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"83%","content":"PERCENT"},{"type":"Jan 29","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"September 7, 2023","content":"DATE"},{"type":"the Association","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"New York City’s Bar Association","content":"ORGANIZATION"},{"type":"New York Emerging Technologies Amendments","content":"ORGANIZATION"},{"type":"Emerging Technologies Amendment","content":"ORGANIZATION"},{"type":"UCC","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["CRYPTO","New York","Regulations"],"authors":["David Pokima"]}