{"summary":"bZx co-founder Kyle Kistner looked back on recent attacks on bZx’s network and announced the changes that the platform is making on its oracle design, development framework, and code review process\nKistner also apologized to 1inch.exchange for failing to pay a requested bug bounty right away.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58280\/bzx-outlines-changes-in-development-framework-after-defi-lending-protocol-exploits","publishDate":"2020-03-10T12:47:04","id":1941,"type":null,"title":"bZx outlines changes in development framework after DeFi lending protocol exploits","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">The team behind the Ethereum-based lending protocol bZx has published a review of the recent attacks on its network, claiming that it has reworked its oracle design, development framework, and review processes for new code.<\/span>","<span data-v-f87c67ca=\"\">The series of attacks on bZx first took place on Feb. 14, when someone&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/56171\/bzx-exploit-former-google-engineer-explains-how-an-attacker-made-350k-in-single-transaction\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">exploited a bug in the system<\/span><\/a>&nbsp;and ultimately<span data-v-f87c67ca=\"\">&nbsp;profited an estimated amount of $350,000. <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/56207\/bzx-attacked-again-645k-in-eth-estimated-to-be-lost\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">A second attack<\/span><\/a><span data-v-f87c67ca=\"\"> followed three days later, resulting in an estimated loss of $645,000 worth of ETH.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In another turn of events, decentralized exchange aggregator <\/span><a href=\"https:\/\/1inch.exchange\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1inch.exchange <\/span><\/a><span data-v-f87c67ca=\"\">came out on Feb. 20 and <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/56579\/bzx-attacks-and-1inch-exchange-allegations-heres-what-the-teams-have-to-say\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">alleged<\/span><\/a><span data-v-f87c67ca=\"\"> that it found a $2.5 million worth of vulnerability in bZx’s Fulcrum lending protocol more than a month prior. However, according to 1inch.exchange’s allegation, bZX neither informed the users nor paid them a bounty reward.<\/span>","<span data-v-f87c67ca=\"\">In a Monday <a href=\"https:\/\/bzx.network\/blog\/mea-culpa\" data-v-f87c67ca=\"\">blog post<\/a>, bZx co-founder Kyle Kistner looked back on the incidents and outlined measures that the platform is taking to mitigate security risks in the future.&nbsp;<\/span>","According to Kistner, the second attack was made possible due to vulnerabilities in the existing oracle system. bZx is, therefore, working on a new oracle design that would eventually include price information from Chainlink, Band, and Uniswap v2.0. In Phase 0, however, the system will temporarily rely on Chainlink alone for reference prices.&nbsp;","<span data-v-f87c67ca=\"\">Notably, the platform will also alter the way new codes get added to make sure that the whole ecosystem has more time to review them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We will transition to an EIP-like system for cataloging new features and improvements to the protocol,\" Kistner wrote in the blog post. \"This will make the process of how new code gets added completely visible to the public. Features should not be added as a surprise or at the last moment. Rather, they should go through a lengthy public process so that all ecosystem participants are able to make themselves familiar with the state of the code.\"<\/span>","<span data-v-f87c67ca=\"\">Additionally, bZx will have its newly refactored code go through a security audit, formal verification, and an economic audit before the platform becomes fully functional again, according to Kistner.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We believe that full test coverage, static analysis, and formal verification could have all formed additional lines of defense against the very first attack that bypassed the safety check on collateralization,\" he said. \"We believe that an economic audit would have been particularly valuable in preventing the second attack.\"<\/span>","<span data-v-f87c67ca=\"\">\"We will never again publish unaudited code, no matter how few lines or trivial,\" he added.<\/span>","<span data-v-f87c67ca=\"\">Regarding 1inch.exchange's complaint, Kistner apologized for the fact that bZx failed to pay the bug bounty right away.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Rather than simply pay the full bug bounty immediately, with extreme gratitude for finding such a serious exploit, we tried negotiating,\" he said. \"This was a serious mistake that we need to take responsibility for. Under no circumstances should this have happened, and we sincerely apologize.\" <\/span>"],"hashtag":[]}