{"summary":"FTX Mania Is On With SBF Token Pumping 84% and Analysts Say This Other Coin is Next","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ftx-mania-is-on-with-sbf-token-pumping-84-and-analysts-say-this-other-coin-is-next.htm","publishDate":"2024-05-01T15:37:38","id":19415,"type":null,"title":"FTX Mania Is On With SBF Token Pumping 84% and Analysts Say This Other Coin is Next","category":["Industry Talk "],"content":["Sam Bankman Fried-themed Solana meme coin, SBF token, has exploded in an FTX inspired rally, and now SBF price is giving way to this other viral crypto coin.","This article will provide an analysis of SBF’s current price trends and look to see whether an innovative new meme coin, Dogeverse, represents a more promising investment opportunity at this time.","It's the best time to buy $sbf\nAin't going lower than this pic.twitter.com\/YUCXr5MEE5","— friendlyme (@zillawears) May 1, 2024","","The rise of SBF token appears to have been fuelled by virality surrounding AI-generated memes of Sam Bankman Fried on X, which garnered rapid attention from retail investors once stung by the FTX disaster.","As price action continues to press to the upside, SBF token is currently trading at a market price of $0.000681 (representing a 24-hour change of +19.42%).","This comes as SBF token leaped from the jaws of death at 13:00 UTC on April 24, in a move which triggered multi-day gains now standing +444%.","SBF’s stunning bounce from capitulation has seen the Solana meme coin return to a local high at $0.001, however, this still stands at a significant margin below the original all-time high of $0.012 back on March 28.","","Yet, the revival in SBF price action remains noteworthy, providing relief to 2,860 underwater holders, as the project’s market cap returns to a more respectable $522k.","This suggests a potential return of upwards of 5x-10x gains for late-stage investors at present, although this is contingent on continued virality from an imprisoned man (a high-risk proposition for sure!).","For this reason, smart money investors are instead flocking to the viral DOGEVERSE presale, which offers the first multi-chain dogcoin investment.","","Dogeverse (DOGEVERSE), is a new multi-chain dog-themed meme coin project with an active presale that has currently raised over $12m.","The meme coin is deploying its highly anticipated presale across multiple chains, including Ethereum, Avalanche, Base, and Solana.","The project’s developer said this approach democratizes access, and anyone can acquire the coin, turbocharging growth – becoming a force across the crypto market","Looking at events in the market, the in-demand Dogeverse presale will likely reap massive benefits as more users flock, searching for potent meme coins.","Supporters claim Dogeverse could be the next BONK and BOME, securing a $1 billion market cap in the coming weeks.","Follow Dogeverse on X to get the latest news and connect with the presale community on Telegram.","Buy Dogeverse Here",""],"entity":[{"type":"$sbf","content":"MONEY"},{"type":"May 1, 2024","content":"DATE"},{"type":"+19.42%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"March 28","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"April 24","content":"DATE"},{"type":"$522k","content":"MONEY"},{"type":"Dogeverse","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Sam Bankman Fried","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"+444%","content":"PERCENT"},{"type":"$0.001","content":"MONEY"},{"type":"$0.012","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"$12m","content":"MONEY"},{"type":"$0.000681","content":"MONEY"}],"hashtag":["FTX","SBF","SBF Token"],"authors":["Sam Cooling"]}