{"summary":"PeckShield: Crypto Scams Plummeted 27.78% in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/peckshield-crypto-scams-plummeted-27-78-in-2023.htm","publishDate":"2024-01-29T14:53:16","id":19410,"type":null,"title":"PeckShield: Crypto Scams Plummeted 27.78% in 2023","category":["Blockchain News "],"content":["Blockchain security firm PeckShield has released an overview of the state of cryptocurrency hacks in the last twelve months with over 600 reported cases resulting in losses of $2.61 billion. Impressively, crypto scams saw a drop of 27.78% in 2023.","The company disclosed its latest findings in a Jan 29 update to the community on X (formerly Twitter).","#PeckShieldAlert 2023 saw 600+ major hacks in the crypto space, resulting in ~$2.61B in losses, with $674.9M recovered.\n$1.51B lost to hacks (excluding #Multichain unauthorized withdrawals) & $1.1B to scams. This marks a 27.78% decrease from 2022. #DeFi protocols remained prime… pic.twitter.com\/G7PIU3WyrX","— PeckShieldAlert (@PeckShieldAlert) January 29, 2024","","According to PeckShield, 600 major hacks were recorded in 2023 which led to $2.61 billion of lost user assets to bad actors who deployed several measures including phishing, flash loan attacks, and bridge hacks.","A breakdown of the figures shows $1.51 billion was lost to hacks while $1.1 billion to scams as bad actors switched to various models of both illicit approaches.","The latest numbers exclude multichain drains and constitute a 27.7% decline in total hacks from 2022, which saw massive numbers surpassing $3.6 billion, leading to investor losses, reduced market participants’ confidence, and increased global regulatory pressure.","A major highlight from PeckShield’s report is the increasing rate of theft recorded by digital asset firms following hacks.","This year, Web3 firms saw $674.9 million recouped from bad actors after scams, while 2022 saw only $133 million recovered.","Several factors are responsible for the positive response to crypto scams. These include stronger community engagement, collaboration from multiple channels and Web3 executives, and the deployment of intense negotiation tactics.","After the horror of 2022, digital asset users increased vigilance, flagging suspicious transactions, and tracing wallets linked to scams for further investigation.","Heightened regulations also saw law enforcement agencies go after scammers across several jurisdictions recovering assets and warning users of the risks and how to prevent possible fraudulent transactions.","Furthermore, blockchain firms offered bad actors bounties to return stolen funds and avoid prosecution leading to more recoveries.","In November, Poloniex suffered a massive hack with over $100 million drained which led Justin Sun, a major shareholder in the exchange, to announce a $10 million bounty for the hackers.","The company stated that it had uncovered the hacker’s identity, offering the bounty for a smooth return of all assets before Nov 25 or facing prosecution by the police in several countries.","Per the report, decentralized finance (DeFi) protocols remained more susceptible than centralized finance partners. DeFi incidents comprised 67% of the reported figures as volumes surged following an overall market rebound.","November marked the largest cases, with about $364.4 million reported stolen while September and March followed with $339.2 million and $217 million respectively.","May and January posted the lowest numbers with $20.2 million and $20.9 million respectively. Figures in November reported by Beosin’s EagleEye marked a 6.9-fold increase from October.","💸 Over $356M Lost to Hacks, Phishing Scams and Rug Pulls in Crypto in November: Beosin","Beosin EagleEye’s latest report exposes a massive surge in #blockchain security incidents, leading to a staggering total loss of over $356 million.#CryptoNews #newshttps:\/\/t.co\/vefotZcDug","— Cryptonews.com (@cryptonews) December 1, 2023","","This year, an infamous coordinated phishing scam saw approximately $3.3 million stolen after bad actors targeted a group of Web3 firms promising users airdrops."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"$1.1","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Beosin","content":"LOCATION"},{"type":"$356M","content":"MONEY"},{"type":"$2.61","content":"MONEY"},{"type":"$20.9 million","content":"MONEY"},{"type":"$1.51","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$3.6 billion","content":"MONEY"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$356 million","content":"MONEY"},{"type":"January 29, 2024","content":"DATE"},{"type":"September","content":"DATE"},{"type":"27.7%","content":"PERCENT"},{"type":"$10 million","content":"MONEY"},{"type":"Crypto","content":"LOCATION"},{"type":"$20.2 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$674.9 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Nov 25","content":"DATE"},{"type":"$217 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"67%","content":"PERCENT"},{"type":"$339.2 million","content":"MONEY"},{"type":"27.78%","content":"PERCENT"},{"type":"$1.51 billion","content":"MONEY"},{"type":"December 1, 2023","content":"DATE"},{"type":"$364.4 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$2.61 billion","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$133 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Phishing Scams","content":"ORGANIZATION"},{"type":"$674.9","content":"MONEY"}],"hashtag":["crypto scams","Hacks","PeckShield"],"authors":["David Pokima"]}