{"summary":"A series of amendments drafted for the EU Parliament’s opinion on anti-money laundering regulation seems to eliminate rules on transferring funds to unhosted wallets.\nThe amendments push for including decentralized finance, decentralized autonomous organizations and NFTs into anti-money laundering provisions.\nThere remains a series of steps ahead for the draft amendments before they are adopted.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173652\/europe-aml-rules-could-implicate-defi-daos-and-nfts","publishDate":"2022-09-29T07:58:11","id":1942,"type":null,"title":"Europe AML rules could implicate DeFi, DAOs and NFTs","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">A series of amendments drafted by members of the European Parliament for its position on the anti-money laundering (AML) and counter-terrorism financing (CTF) regulation have the potential to make big changes to Europe’s regulatory landscape, according to the draft report seen by The Block.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><span data-v-f87c67ca=\"\">\"Travel\" rule<\/span><span data-v-f87c67ca=\"\"> imposing identity verification provisions on the transfer of funds involving so-called unhosted wallets — which previously <a href=\"https:\/\/www.theblock.co\/linked\/140034\/eu-parliament-approves-rules-targeting-transfers-to-unhosted-crypto-wallets\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">caused a stir<\/a> in the industry — seems to have been removed.<\/span>","<span data-v-f87c67ca=\"\">However, new amendments expand the regulation’s scope to cover decentralized autonomous organizations (DAOs), decentralized finance (DeFi) protocols and their developers, and people trading NFTs.&nbsp;<\/span><span data-v-f87c67ca=\"\">The metaverse is also targeted as potential grounds for money laundering, and crypto-asset service providers may also be obliged to follow AML rules when dealing with transactions over €1000.<\/span>","<span data-v-f87c67ca=\"\">The provisions are a result of merging suggested modifications from the Parliamentary groups into compromise amendments — which try to cover all the different views. <\/span>","<span data-v-f87c67ca=\"\">The amendments still have a number of hoops to jump through before being formally adopted.&nbsp;<\/span><span data-v-f87c67ca=\"\">First, they need to pass through a vote to enter into the European Parliament report on AML regulation. Then, the final report needs to pass a vote in plenary with all of the Parliament’s committees. After that, the report will represent the Parliament in the inter-institutional debates on AML.<\/span>","<span data-v-f87c67ca=\"\">The final report on the Parliament’s position is projected for December, and technical meetings on the AML report are scheduled until then.<br data-v-f87c67ca=\"\">\n<\/span>","The Block reached out to the European Parliament for comment."],"hashtag":["DAOS","EUROPEAN PARLIAMENT"]}