{"summary":"Crypto M&A Deals up 22% in Q1 2024 From Previous Quarter, Says Advisory Firm","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-ma-deals-up-22-in-q1-2024-from-previous-quarter.htm","publishDate":"2024-04-08T06:38:56","id":19428,"type":null,"title":"Crypto M&A Deals up 22% in Q1 2024 From Previous Quarter, Says Advisory Firm","category":["Blockchain News "],"content":["Mergers and acquisitions (M&A) financing activities in the cryptocurrency sector through the first quarter of 2024 are up 22% compared to the previous quarter, according to a research note from Architect Partners.","In an announcement, the firm said, the uptick in M&A activity is good news, but still below the pace of the peak year 2022.  Although the crypto sector’s deal activity has improved a bit more than the overall tech sector deal activity, in contrast to an observed decline in announced fintech deals last quarter.","According to the firm crypto private financings by subsector shows that the trading infrastructure subsectors represented 30% of all capital raised in Q1 2024. This has carried through from last year.","In the fourth quarter of 2023, 39% of crypto deals were in the brokers and exchanges or trading infrastructure subsectors.  This trend has continued with 45% of deals in the same two leading sectors in the first quarter of this year.","Architect Partners has facilitated over 300 transactions involving industry players such as Coinbase, with a total value exceeding $30 billion. ","According to the advisory firm, the share of “bridge transaction” deals in which a non-crypto native firm acquires a crypto-native firm was up 25% last quarter, indicating increased comfort with the sector. ","Notable deals have included Valkyrie Funds, CoinShares, Brassica and BitGo, and the token merger involving SingularityNET, fetch.ai, and Ocean Protocol into the Artificial Superintelligence Alliance — these were the most notable M&A deals in the first quarter.","Another notable trend involves an increase in crypto private financings. From the fourth quarter of 2023 to the first quarter of this year capital increased by 36% and the number of financings increased by 77%.","There has been a 112% increase from the fourth quarter of 2023 to the first quarter of 2024 in the number of early-stage financings. Around a 32% increase for later-stage financings. Seed-stage financings attracted a 108% increase in capital, while later-stage financings only attracted 25% more, said Architect Partners.","As the crypto sector has entered a bull run venture capital funding in the crypto space has also experienced a surge in the first quarter of 2024, breaking a two-year downtrend, reports Ruholamin Haqshanas from Cryptonews. ","Both the total amount invested and the number of projects receiving VC funding have seen substantial increases since Q4 2023.","Data shows a notable 38% rise in funds invested during the quarter, indicating renewed investor confidence in the crypto industry.  Moreover, there has been a remarkable 49% increase in the number of projects securing funding, a level not witnessed since Q4 2021. "," "],"entity":[{"type":"32%","content":"PERCENT"},{"type":"108%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"112%","content":"PERCENT"},{"type":"39%","content":"PERCENT"},{"type":"25%","content":"PERCENT"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"49%","content":"PERCENT"},{"type":"Architect Partners","content":"ORGANIZATION"},{"type":"last quarter","content":"DATE"},{"type":"Ocean Protocol","content":"ORGANIZATION"},{"type":"Brassica","content":"PERSON"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"first quarter of 2024","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Valkyrie Funds","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"77%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"36%","content":"PERCENT"},{"type":"38%","content":"PERCENT"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["funding","Venture Capital"],"authors":["Tanzeel Akhtar"]}