{"summary":"Top NFT News Today – 12 January, 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/top-nft-news-today-12-january.htm","publishDate":"2024-01-12T13:32:13","id":19425,"type":null,"title":"Top NFT News Today – 12 January, 2024","category":["NFT News "],"content":["The non-fungible token (NFT) revival seems to be well on its way for now. And today is quite a Yuga Labs day.","Last November, Yuga Labs announced a collaboration with Magic Eden to launch the Magic Eden Ethereum Marketplace by the end of the year. The team, however, said that the timeline was too “aggressive.” They haven’t provided more detail yet.","We know many of you are excited for our upcoming Ethereum marketplace launch with @yugalabs","We had originally given the timeline of end of 2023 which in our enthusiasm may have been a tad aggressive.","We appreciate your patience and are looking forward to supporting creators and…","— Magic Eden 🪄 (@MagicEden) January 9, 2024","","Meanwhile, Yuga Labs’ Bored Ape Yacht Club released a new Otherside trailer, following criticism from the community regarding the quality of the original one – revealed just two days earlier.","CryptoPunks, meanwhile, has launched a new hub as the “living source” for the project.","At the same time, major NFT projects under the Yuga Labs umbrella are the best and among the best performers today per sales volume.","Let’s check all this out in more detail.","","On January 9, the creators of the popular NFT collection Bored Ape Yacht Club (BAYC), Yuga Labs, released a trailer for the third playtest of their much-anticipated metaverse project Otherside.","The 20-second trailer has been met with mixed reactions, to say the least. Most, however, expressed their disappointment over the video’s quality.","Some jokingly made suggestions:","In the future probably don’t put the lag in the teaser video. 😅","— Spencer (@sgsand1) January 9, 2024","","Then, on January 11, the team re-released the trailer, calling it a remastered version. It jokingly said that it was celebrating the second-day anniversary.","On January 8th, 2024 we released \"Apes Come Home.\"","To celebrate its 2-Day Anniversary, we're proud to announce: Apes Come Home… Remastered. pic.twitter.com\/1D5O3POcNs","— Othersidemeta (@OthersideMeta) January 11, 2024","","It included an additional comment from the team:","“APES_COME_HOME_REMASTER_60FPS_GORDON_SAYS_WE_FUCKED_UP_OUR_BAD_FINAL_FINAL”","The reactions have again been mixed but seem much more favorable. Besides the clear improvements to the video, many appreciated the team’s comment as well.","On the other hand, some argue that increasing resolution has improved the video but hasn’t made it as good as it could’ve been.","Ok I know this is in game trailer and all but if you really want to pump us up we need a trailer like you used to do with our apes:","This was beautiful, elegant, and pulled heartstrings with a call back\nTo the doors music from the first trailer. https:\/\/t.co\/fL8CsduSgo","— SΞP SAUCΞ 🍌☠️ 🍷 (@sepsauce) January 11, 2024","","Meanwhile, a year ago, Yuga Labs\/ BAYC co-founder Wylie Aronow (Gordon Goner) announced his departure from the project as a core team member to focus on his health.","Wasn’t meant as a criticism of the otherside team. Just wanted to clarify because the island is sick. Walking around with blue beams on BAYC Island is literally a dream come true. Major kudos to the team for getting us this far. Can't wait. ❤️ https:\/\/t.co\/IUoWHPYzz1","— GordonGoner.eth (Wylie Aronow) 🍌 (@GordonGoner) January 10, 2024","","","One of the most popular NFT projects unveiled its brand hub. The CryptoPunks team described it as “an archive and living source for project info and initiatives.”","Per the website,","“Part iconic NFT collection, part living art and technology experiment. What began as 10,000 pixel punks born on the blockchain in 2017 is now an evolving collaboration with a community of creatives, builders, and technologists. With an archival program that preserves the collection’s significance in digital art history and pioneering initiatives and unique partnerships that build on its legacy, the punk spirit remains at the heart of CryptoPunks.”","It was created with the US-based strategy, design, and technology agency Alright Studio.","“new work in collaboration with our friends cryptopunksnfts — a living, breathing, and ever-evolving archival hub,” the agency commented. “more soon!”","Punks Past, Present, and Future.","Introducing the CryptoPunks brand hub: an archive and living source for project info and initiatives.","Created with our friends at @alright_studio.https:\/\/t.co\/fIecgaqxOh pic.twitter.com\/DPHa0IXAxM","— CryptoPunks (@cryptopunksnfts) January 11, 2024","","The hub currently has the ‘about’, ‘legacy’, ‘index’, and ‘marketplace’ pages already up. The ‘cart’ and ‘goods’ sections are coming soon, it says.","Larva Labs created CryptoPunks in 2017. In 2022, Yuga Labs announced that it acquired the intellectual property rights to Larva Labs’ CryptoPunks and Meebits collections.","","Still in the Yuga Labs realm, its BAYC and CryptoPunks are the day’s best performers among the top 10 collections when it comes to sales volume.","According to CryptoSlam, BAYC sales are up by 568.5% over the past 24 hours.","It’s followed by CryptoPunks’ 510%.","Both of these collections have moved up since yesterday.","BAYC is up one position in a day, moving to the second spot on the list.","CryptoPunks wasn’t even in the top 5 yesterday but now sits as number three.","Furthermore, Yuga Labs’ Mutant Ape Yacht Club (MAYC) has also performed well. Its sales are up 80%.","Overall, it’s been a good day for Yuga Labs."],"entity":[{"type":"2017","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"January 10, 2024","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Yuga Labs’ Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Alright Studio","content":"ORGANIZATION"},{"type":"Apes Come Home","content":"ORGANIZATION"},{"type":"January 11","content":"DATE"},{"type":"568.5%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"510%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Yuga Labs’ Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"Wylie Aronow","content":"PERSON"},{"type":"CryptoPunks’","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"PERSON"},{"type":"January 11, 2024","content":"DATE"},{"type":"Wylie Aronow (Gordon Goner","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BAYC Island","content":"LOCATION"},{"type":"January 9","content":"DATE"},{"type":"Yuga Labs\/ BAYC","content":"ORGANIZATION"},{"type":"Day Anniversary","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"January 9, 2024","content":"DATE"},{"type":"Magic Eden Ethereum Marketplace","content":"ORGANIZATION"},{"type":"January 8th, 2024","content":"DATE"},{"type":"Larva Labs’ CryptoPunks","content":"ORGANIZATION"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":["BAYC","CryptoPunks","Yuga Labs"],"authors":["Sead Fadilpašić"]}