{"summary":"Tezos is The Worst Performer in The Top 50 Today","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tezos-is-the-worst-performer-in-the-top-50-today-5441.htm","publishDate":"2020-01-03T13:38:41","id":19426,"type":null,"title":"Tezos is The Worst Performer in The Top 50 Today","category":["Altcoin News "],"content":["Tezos (XTZ), one of the best performing digital assets in 2019, is moving out and back into the list of the top 10 coins by market capitalization today after less than a month in this club.","At pixel time (12:57 PM UTC), XTZ trades at c. USD 1.28 and is the worst performing digital asset among the top 50 tokens today and the second-worst in the past 7 days. The price dropped by more than 4% in a day and by almost 7% in a week.","In comparison, other major coins are in green today and in a week, while the total market capitalization is up by almost 2% in the past 24 hours.","Earlier today, XTZ left the top 10 list before reclaiming the 10th spot again. However, the fight for this position is intense: market capitalization of XTZ stands at almost USD 893 million, while Tron (TRX) reached USD 891.8 million and Stellar (XLM) – USD 890 million.","XTZ price chart:","With no specific fundamentals to support the decline, XTZ is likely correcting after last year’s rally, when its prices more than doubled. The coin traded at c. USD 0.47 at the beginning of 2019 and ended it at more than USD 1.3 per coin, outperforming Bitcoin (BTC), Ethereum (ETH) and many other major coins.","At the end of 2019, Tezos had multiple positive news to share with the market, including new staking opportunities at the major cryptocurrency exchanges such as Coinbase, Binance, OKex, and Kraken.","Meanwhile, this past Tuesday, the Tezos Foundation said they have exceeded their goal to bring 1,000 new developers into the Tezos ecosystem by training 1,300 developers."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Binance","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"Tezos Foundation","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"}],"hashtag":["Market","Tezos"],"authors":["Dalmas Ngetich"]}