{"summary":"Cosmos Price Soars 12% in a Week, Second Best Performer in Top 20","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cosmos-price-soars-12-in-a-week-second-best-performer-in-top-5311.htm","publishDate":"2019-12-13T15:05:23","id":19420,"type":null,"title":"Cosmos Price Soars 12% in a Week, Second Best Performer in Top 20","category":["Altcoin News "],"content":["Today and in the past week, Cosmos (ATOM) is one of the best performing digital assets in the top 20, and is registering gains against BTC, ETH and the USD.","At pixel time (14:34 UTC), ATOM, ranked 16th by market capitalization, trades at c. USD 4.05 and is up by 2% in a day and by 12% in a week, increasing its monthly gains to 2.6%. While daily and weekly gains against BTC and ETH look similar to those against USD, in a month, ATOM surged by 24% against BTC, and by 32% against ETH.","ATOM price chart:","This week, the network implemented their Cosmos Hub 3 upgrade, which is the first major Cosmos Hub upgrade since launching in March 2019, and improves their governance mechanism. Also, the project announced CosmWasm, a smart contracting platform, similar to Ethereum’s, for developers. Moreover, recently, major crypto exchange Binance announced that they will support ATOM staking from December 5.","In the daily chart, ATOM\/USD prices are contained inside an ascending channel, an indication of underlying strength. From price action, there could be more room for more upsides if there is a high-volume breakout above November 2019 resistance line at USD 4.3. A surge past this ceiling could spur further demand.","However, despite the recent ATOM price increase, the token still trades well below its all-time high of almost USD 7, reached in June. Not only are prices consolidating inside April trade range, but the failure of bulls to spring back with the same velocity observed in Q2 2019 may pour cold water on bullish sentiments.","On the flip side, a major takeaway that could prove vital and even feed bull momentum assuming this uptrend continues is the steady trading volume. Even after ATOM prices slumped in Q3 2019, participation levels were equally distributed and high throughout the year."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"November 2019","content":"DATE"},{"type":"2.6%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"December 5","content":"DATE"},{"type":"24%","content":"PERCENT"},{"type":"March 2019","content":"DATE"},{"type":"June","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":["Market"],"authors":["Dalmas Ngetich"]}