{"summary":"Gold Smugglers in Nepal Caught Exchanging 33kg of Gold for Tether USDT Stablecoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gold-smugglers-in-nepal-caught-exchanging-33kg-of-gold-for-tether-usdt-stablecoin.htm","publishDate":"2023-11-23T11:35:22","id":19430,"type":null,"title":"Gold Smugglers in Nepal Caught Exchanging 33kg of Gold for Tether USDT Stablecoin","category":["Altcoin News "],"content":["An international, organized criminal network has been busted for gold smuggling and using the tether (USDT) stablecoin in its $16 million-worth illegal operations.","According to the local media report by The Rising Nepal, the group managed to smuggle 33 kg of gold.","Notably, the group earned money through other illegal activities.","District Police Office Dolakha said in a press conference the gold smugglers had transacted Rs. 2.19 billion via cryptocurrency in less than a year. This is $16.43 million.","Another report, this one by Khabarhub, gives a figure of over Rs 2 trillion transferred to Chinese counterparts using crypto and digital wallets from Nepal. If true, this would be $15 billion.","The group utilized USDT and 12 distinct digital wallets for their endeavor.","The CIB Police Inspector Ram Krishna Pathak stated that the payment made through crypto, involving the 12 wallets, represents one of the largest amounts recorded so far.","Cryptocurrency transactions are illegal in Nepal.","The latest arrests are part of an ongoing effort by the local police, the Central Investigation Bureau (CIB), and other relevant authorities to squash gold smuggling in the region.","The police said in the press conference that they identified 27 people involved in gold smuggling. Two are Chinese, and the rest are Nepali.","Fifteen were arrested, and twelve are on the run, it added.","Between November 2022 and October 2023, the groups within the network (some of which allegedly didn’t know each other) moved gold to Nepal’s capital Kathmandu via the Phalaak crossing of Lamabagar in Dolakha, a region bordering Tibet.","The group transported it on six separate occasions.","They would tie the gold to a rope and smuggle it across the river from the Phalaak crossing.","Also, they transported the smuggled gold to Kathmandu by public vehicles.","The smugglers, said the report, even used children to hide the gold inside potato and flour sacks.","In return, they would return the sacks filled with cash (dollars), musk, and yarsagumba.","The latter is a combination of caterpillar and fungus found only in the highest Himalayan pastures and only for a few weeks a year. The fungus grows on insects, mummifying them.","This is known as ‘Himalayan gold.’","It is a highly valued traditional medicine in the Chinese world.  The price per kilo (2.2 lbs) commonly ranges between $40,000 and $50,000 but can (and often does) go for much more.","And while yarsagumba has improved life in many Himalayan communities, it has – unsurprisingly – found itself in the crime world as well, but in a surprising combination with USDT.","The police so far recovered 11 kg of gold and 532 grams of gold ornaments.","____","",""],"entity":[{"type":"Central Investigation Bureau (CIB","content":"ORGANIZATION"},{"type":"CIB Police Inspector Ram Krishna Pathak","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Tibet","content":"LOCATION"},{"type":"Nepal","content":"LOCATION"},{"type":"$50,000","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"District Police Office Dolakha","content":"ORGANIZATION"},{"type":"$16.43 million","content":"MONEY"},{"type":"The Rising Nepal","content":"ORGANIZATION"},{"type":"2.19 billion","content":"MONEY"},{"type":"$15 billion","content":"MONEY"},{"type":"Khabarhub","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"Dolakha","content":"LOCATION"},{"type":"$40,000","content":"MONEY"},{"type":"$16 million","content":"MONEY"},{"type":"Kathmandu","content":"LOCATION"}],"hashtag":["China","Crime","Police","Tether","USDT"],"authors":["Sead Fadilpašić"]}