{"summary":"The CEOs of JP Morgan Chase and BlackRock couldn&#x27;t have different views in regard to bitcoin and neither are shy about sharing their opinion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273128\/jamie-dimon-says-he-doesnt-care-about-larry-fink-changing-his-view-on-bitcoin","publishDate":"2024-01-17T10:14:42","id":1944,"type":null,"title":"Jamie Dimon says he doesn&#x27;t care about Larry Fink changing his view on bitcoin","category":["PEOPLE"],"content":["There's at least one Wall Street heavyweight from Larry Fink's peer group that could care less about the BlackRock CEO's evolving views on bitcoin and surprise, surprise it's the reliably blunt Jamie Dimon.","Dimon, who serves as CEO of the financial juggernaut JP Morgan Chase, has consistently derided the world's most popular cryptocurrency by market cap, and once again expressed his dislike for the digital asset when <a href=\"https:\/\/www.cnbc.com\/2024\/01\/17\/jamie-dimon-says-hes-done-talking-about-bitcoin-i-dont-care.html\" data-v-f87c67ca=\"\">speaking to CNBC<\/a> on Wednesday from Davos, Switzerland, site of the World Economic Forum.","“This is the last time I’m talking about this with CNBC, so help me god,” Dimon told CNBC before offering a curt answer when asked about Fink's views of bitcoin — given BlackRock launched a spot bitcoin ETF last week. \"I don’t care. So just please stop talking about this shit,\" he said.&nbsp;","He went on to say “I don’t know what [Fink] would say about blockchain versus currencies that do something versus bitcoin that does nothing,” Dimon added.&nbsp;","While Dimon decried bitcoin, he expressed more support for smart contract-enabled blockchains. He gave the example of tokenization — a potential area of agreement relating to the wider crypto space with Fink.","Last week, <a href=\"https:\/\/www.theblock.co\/post\/272274\/blackrock-ceo-larry-fink-sees-value-in-spot-ethereum-etf-following-bitcoin-launch\" data-v-f87c67ca=\"\">Fink said bitcoin ETFs<\/a> \"<span data-v-03de5780=\"\" data-v-f87c67ca=\"\">are just stepping stones towards tokenization and I really do believe this is where we're going to be going.\"<\/span>","But, unlike Dimon, Fink was positive on both crypto and bitcoin. He compared bitcoin's trajectory to gold's history. \"It’s no different than what gold represented over thousands of years,\" he said.","In 2022, Fink also called cryptocurrency potentially transcendent. \"It's an international asset,\" he said in a July <a href=\"https:\/\/www.cnbc.com\/2023\/07\/14\/blackrock-has-a-responsibility-to-democratize-investing-including-in-crypto-larry-fink-says.html\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">interview<\/a> with CNBC, referring to crypto broadly. \"It has a differentiating value versus other asset classes, but more importantly, because it's so international, it's going to transcend any one currency.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/bitcoin-spot-etf-volumes\/embed\" title=\"Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","So far, BlackRock's spot bitcoin ETF is one of the <a href=\"https:\/\/www.theblock.co\/post\/272945\/grayscale-blackrock-and-fidelity-dominate-spot-etf-market-with-nearly-90-of-volume-on-third-day-of-trading\" data-v-f87c67ca=\"\">most popular<\/a> in terms of trading activity and has generated nearly $2 billion worth of volume through three days of trading, according to data from Yahoo Finance compiled by The Block.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Davos","content":"LOCATION"},{"type":"the World Economic Forum","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Larry Fink","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Fink","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Dimon","content":"PERSON"},{"type":"JP Morgan Chase","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}