{"summary":"Thailand SEC Clears Path for Accredited Investors to Dive Into US Bitcoin ETFs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/thailand-sec-allows-accredited-invetors-spot-bitcoin-etfs.htm","publishDate":"2024-03-12T07:00:33","id":19444,"type":null,"title":"Thailand SEC Clears Path for Accredited Investors to Dive Into US Bitcoin ETFs","category":["Bitcoin News "],"content":["The Thailand securities regulator has greenlit asset management firms to introduce private funds tailored to invest in Spot Bitcoin ETFs. However, access to these funds will be restricted to institutional investors and individuals with ultra high net-worth.","Essentially, the decision enables a select group of sophisticated Thailand-based investors to indirectly invest in Bitcoin through regulated channels.","SEC secretary-general Pornanong Budsaratragoon announced that asset management firms are now permitted to oversee private funds that invest in US-based Spot Bitcoin ETFs, the Bangkok Post reported Tuesday. The SEC board reportedly agreed on this decision last week.","According to SEC regulations, securities companies are authorized to facilitate trading for assets categorized as securities. These ETFs are now classified as securities after Spot Bitcoin ETF trading was approved in the US.","Consequently, Thai securities firms are now permitted to invest in them, aligning with the regulatory framework governing securities trading, the report said.","“Asset management firms asked the SEC for them to have exposure in digital assets, especially Bitcoin and spot Bitcoin ETFs, but we need to consider carefully whether to allow asset management firms to invest in digital assets directly due to the high risk,” Pornanong said.","Existing rules overseeing asset management firms’ investments do not encompass digital asset ETFs. Consequently, the SEC found it necessary to modify these rules to facilitate such investments, according to the official.","The SEC’s approval arrives amidst Bitcoin’s surge to a new all-time high exceeding $72,000. This surge is attributed to various factors, notably the increased investment flowing into US Spot Bitcoin ETFs.","Back in January, Thailand’s SEC said it wouldn’t allow trading of spot Bitcoin ETFs in the country. The regulator wasn’t convinced that foreign-approved Bitcoin ETFs were ready for the local market, feeling like they didn’t match up with what Thailand needed economically.","“We are monitoring these developments, but currently, there is no plan to permit the establishment of spot Bitcoin ETFs in Thailand,” a representative told the Bangkok Post.","Recently, the SEC has taken steps toward crypto-friendliness by relaxing investment limits for retail investors in specific asset-backed tokens. Additionally, it now mandates custodial wallet management by dedicated entities, reflecting a more open approach to cryptocurrency regulation."],"entity":[{"type":"Thailand","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$72,000","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Pornanong","content":"PERSON"},{"type":"Bangkok Post","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["spot Bitcoin ETF","Thailand SEC"],"authors":["Shalini Nagarajan"]}