{"summary":"RWA Tokenization Firm Securitize Secures $47 Million Investment Led by BlackRock","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/rwa-tokenization-firm-securitize-secures-47-million-investment-led-by-blackrock.htm","publishDate":"2024-05-01T18:18:46","id":19440,"type":null,"title":"RWA Tokenization Firm Securitize Secures $47 Million Investment Led by BlackRock","category":["Blockchain News "],"content":["Securitize, a company specializing in RWA tokenization, announced the successful closure of a $47 million funding round on May 1. The investment was led by BlackRock, the world’s largest asset manager, further solidifying the growing interest and potential within the RWA tokenization sector.","Additional participants in the funding round included financial institutions such as Hamilton Lane, ParaFi Capital, and Tradeweb Markets. The influx of capital will allow Securitize to broaden its efforts to leverage blockchain technology to digitize capital markets.","Securitize is excited to announce that we have completed a $47 million funding round led by @BlackRock together with @hamilton_lane, @paraficapital, @Tradeweb, and strategic investors @AptosLabs, @circle and @Paxos.","This further proves that the demand for tokenized real-world… pic.twitter.com\/sRuNgEslVj","— Securitize (@Securitize) May 1, 2024",""," ","“In our view, the transformative potential of blockchain technology to reshape the future of finance in general – and tokenization in particular – is promising,” said Carlos Domingo, Co-Founder and CEO of Securitize.\n","This investment follows another recent collaboration between BlackRock and Securitize on the development of the BlackRock USD Institutional Digital Liquidity Fund. The initiative suggests a strategic focus on RWA tokenization for BlackRock, a process involving the creation of digital tokens representing real-world assets like equities, bonds, and real estate, which are then traded on a blockchain.","Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, has been appointed to Securitize’s Board of Directors.","“…we believe that tokenization has the potential to drive a significant transformation in capital markets infrastructure,” said Chalom. “Our investment in Securitize is another step in the evolution of our digital assets strategy.”"],"entity":[{"type":"May 1","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"May 1, 2024","content":"DATE"},{"type":"Carlos Domingo","content":"PERSON"},{"type":"Hamilton Lane","content":"PERSON"},{"type":"BlackRock USD Institutional Digital Liquidity Fund","content":"ORGANIZATION"},{"type":"Securitize’s Board of Directors","content":"ORGANIZATION"},{"type":"$47 million","content":"MONEY"},{"type":"Joseph Chalom","content":"PERSON"},{"type":"Chalom","content":"PERSON"},{"type":"BlackRock’s Global Head of Strategic Ecosystem Partnerships","content":"ORGANIZATION"}],"hashtag":["Asset tokenization","Blackrock","RWA"],"authors":["Trent Alan"]}