{"summary":"Here are the Top Potential Crypto Airdrops to Watch Right Now","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/here-are-the-top-potential-crypto-airdrops-to-watch-right-now.htm","publishDate":"2024-02-20T18:35:23","id":19442,"type":null,"title":"Here are the Top Potential Crypto Airdrops to Watch Right Now","category":["Altcoin News "],"content":["Airdrops have become a popular way for those involved in digital currencies to receive extra tokens, essentially free money, just for being part of a cryptocurrency community.","They work by distributing new tokens directly into the wallets of active participants as a reward or promotional boost, without any cost to the recipients.","Let’s dive into the top five airdrops happening right now that you won’t want to miss.","Marinade is a liquid staking protocol on Solana. Liquid staking is a service where users can lock up tokens and take advantage of already-staked tokens to participate in various yield-generating activities on DeFi.","In Marinade, users can stake Solana (SOL) tokens to receive MNDE, a protocol governance token pegged to the price of SOL. In other words, users receive 1 MNDE for every 1 SOL locked up in the protocol. The more MNDE they have, the more votes they have in Marinade governance, treasury, and improvement proposal polls.","To take advantage of the offer, visit the Marinade’s website and connect a Solana wallet with some SOL loaded onto it. Doing so will net you an 1 mSOL, the staking token used in the protocol, alongside 1 MNDE. MNDE is also rewarded to users who refer their friends to the protocol.","","Solana’s leading perpetual swap futures exchange, Drift Protocol, rolled out its own points program in January to reward users ahead of an airdrop.","Points are distributed once a week to users based on their trading volume. The total number of points given to protocol hands out is 100 million a week. Drift Protocol’s four key metrics in assessing this are total volume, the number of users, cumulative trades, and the total value locked (TVL).","To date, Drift has processed over $5 billion in trading between over 90,000 users, securing over $130M in TVL.","The airdrop is currently unavailable for folk in the US, though. It will run for the next two and a half months, although there is currently no date for the deadline. Visit the points leaderboard and find out more here.","How to Earn Points","Drift Points will represent your role in the growth and success of Drift.","You’ll be dropped Drift Points weekly based on your trading activity, and can see your rank on the leaderboards.","Hint: your trading activity will earn you the most Points","— Drift Protocol (@DriftProtocol) January 23, 2024","","","Ethereum layer-2 scaling solution Blast has attracted enormous stakes of ETH and stablecoins in its ongoing presale. Over 145,000 users have collectively staked $1.9 billion in the hopes of earning airdropped tokens.","Blast has touts itself as the only layer 2 that incorporates “native yield” where users begin earning rewards of 4% ETH and 5% stablecoins simply for holding their balance on the prorocol..","The Early Access airdrop is now live. You can earn airdrop points by bridging to Blast and inviting friends. Airdrop points can be redeemed for crypto in May.","NFT marketplace Magic Eden launched its rewards program at the end of January. The team tweeted it had spent the last year “designing a long-term, cross-chain NFT rewards program built for everyone.”","Introducing Magic Eden Rewards","We’ve spent the last year designing a long term, cross-chain NFT rewards program built for everyone. This isn’t just another points campaign. It’s a meticulously crafted plan to give back to Magic Eden’s OGs, collectors, creators, and degens alike.… pic.twitter.com\/RQkJpoZEvi","— Magic Eden 🪄 (@MagicEden) January 23, 2024","","The team says its Diamond rewards program is “a meticulously crafted plan” to give back to Magic Eden’s OGs, collectors and creators.","The program promises to reward airdrop tokens on a points basis. It will distribute these rewards across all the chains the marketplace operates on: Solana, Ethereum, Polygon and Bitcoin.","At the same time, the startup is launching an NFT token, dubbed $NFT, in collaboration with the Non-Fungible DAO. The team will allocate them to traders based on their all-time usage of certain open source contracts, including the M2 marketplace and MMM launchpad; Magic Eden developed both.","As a governance token, $NFT will grant holders proposal-making or voting rights within the Magic Eden protocol.","Both current and new users can earn diamonds by buying, listing, and making offers on the marketplace. More diamonds equals more rewards during the airdrop.","","Magic Eden’s rival on Solana, Tensor, is also getting in on the airdrop action. So far the marketplace has including stimulated trading activity with its own rewards program. Again, these points will reflect the proportion of tokens airdropped.","Tensor doesn’t currently have a utility token, but it has hinted that there could soon be an airdrop for early adopters, so now is the time to get involved.","To begin claiming rewards, visit Tensor’s website, connect a Solana wallet and become a daily marketplace user. The more points you get, the more loot boxes you’ll be rewarded with, which will ultimately put you in good stead if and when the airdrop arrives.","Right now, Tensor has not officially announced an airdrop, but people have good reason to on it, given the project’s current lack of a token and the business models of its competitors."],"entity":[{"type":"Non-Fungible DAO","content":"ORGANIZATION"},{"type":"SOL","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$5 billion","content":"MONEY"},{"type":"Drift Points","content":"ORGANIZATION"},{"type":"MMM","content":"ORGANIZATION"},{"type":"January 23, 2024","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Eden Rewards","content":"ORGANIZATION"},{"type":"$1.9 billion","content":"MONEY"},{"type":"Diamond","content":"ORGANIZATION"},{"type":"Tensor","content":"ORGANIZATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"$NFT","content":"MONEY"},{"type":"$130M","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Earn Points","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Airdrop","Altcoin","Presale"],"authors":["Tim Hakki"]}