{"summary":"Tornado Cash, a popular Ethereum mixer that helps obfuscate crypto transactions, now blocks OFAC-sanctioned wallet addresses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142081\/ethereum-mixer-tornado-cash-now-blocks-sanctioned-addresses","publishDate":"2022-04-15T10:01:05","id":1945,"type":null,"title":"Ethereum mixer Tornado Cash blocks sanctioned addresses from its frontend","category":["ETHEREUM"],"content":["Tornado Cash, a popular Ethereum mixer that helps obfuscate crypto transactions, has said that it will block crypto addresses sanctioned by the Office of Foreign Assets Control (OFAC) — an enforcement agency of the US Treasury Department.","The news means OFAC-sanctioned crypto wallet addresses will now not be able to use Tornado Cash. \"Maintaining financial privacy is essential to preserving our freedom, however, it should not come at the cost of non-compliance,\" <a href=\"https:\/\/twitter.com\/TornadoCash\/status\/1514904975037669386\" data-v-f87c67ca=\"\">tweeted<\/a> Tornado Cash on Friday.","Tornado Cash said it uses the Chainalysis oracle — a smart contract that validates if a crypto wallet address has been included in a sanctions designation — to block OFAC-sanctioned crypto addresses.","The news comes a day after the Treasury Department <a href=\"https:\/\/www.theblockcrypto.com\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">alleged<\/a> that North Korean hacking group Lazarus is linked to the $625 million theft from the Axie Infinity's Ronin bridge. The Department added an Ethereum address to its sanctions list, allegedly tied to the Ronin exploit, and Tornado Cash has now blocked this address.","Chainalysis <a href=\"https:\/\/etherscan.io\/address\/0x40c57923924b5c5c5455c48d93317139addac8fb\" data-v-f87c67ca=\"\">created<\/a> a contract to block sanctioned addresses over a month ago. Thus far, the contract has created three transactions to block a total of 24 addresses. The Ronin exploit-tied address was added on Thursday. Tornado Cash uses this contract to check whether an address is sanctioned.","Tornado Cash co-founder Roman Semenov said that the changes are made only at the frontend, i.e., at its decentralized application (dapp) level. \"The smart contracts are immutable,\" Semenov said in a tweet on Friday. \"The protocol (onchain smart contracts) and the frontend (dapp) are different things.\"","In other words, he meant Tornado Cash itself cannot be shut by sanctions.","Last year, decentralized protocols Uniswap and 1inch also blocked some services from their frontend. Uniswap <a href=\"https:\/\/www.theblockcrypto.com\/linked\/112399\/uniswap-labs-culls-synthetic-stock-and-derivatives-citing-evolving-regulatory-landscape\" data-v-f87c67ca=\"\">delisted<\/a> a host of tokens that resembled securities or derivatives offerings, while 1inch <a href=\"https:\/\/www.theblockcrypto.com\/linked\/119055\/dex-aggregator-1inch-blocks-out-us-trades-in-preparation-for-separate-american-platform\" data-v-f87c67ca=\"\">began<\/a> geofencing US IP addresses.","As for Tornado Cash, some people on Twitter have <a href=\"https:\/\/twitter.com\/DegenSpartan\/status\/1514929991490097152?s=20&amp;t=dhSVD_IM6QPQfON-A6ebrw\" data-v-f87c67ca=\"\">criticized<\/a> its move, suggesting that sanctioning addresses does not mean bad actors cannot use its services. All they have to do is send their crypto to other non-sanctioned addresses and still use Tornado Cash, according to them.&nbsp;","Tornado Cash declined to comment on The Block's queries for this story.","<em data-v-f87c67ca=\"\">This report's headline has been updated for clarity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Lazarus","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"US Treasury Department","content":"ORGANIZATION"},{"type":"Department","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Roman Semenov","content":"PERSON"},{"type":"Semenov","content":"PERSON"},{"type":"$625 million","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Yogita Khatri","The Block"]}