{"summary":"The largest public bitcoin mining firms in North America are holding over 20,000 BTC, worth more than $1.1 billion.\nTo fund this “Hodl” strategy, they have borrowed funds or issued equity for expenses and expansion.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119830\/bitcoin-btc-us-mining-hold-billion","publishDate":"2021-10-08T04:39:51","id":1945,"type":null,"title":"US-listed mining firms have hoarded over $1 billion worth of bitcoin","category":["Mining"],"content":["Several publicly listed bitcoin mining firms in North America have collectively stockpiled over 20,000 BTC, worth over $1.1 billion at current prices.","Based on their latest monthly production data released recently, Riot, Marathon, Bitfarms, Hut8, Greenidge, Argo, and HIVE have mined a total of 6,463 BTC in Q3, which accounted for about 7.5% of the total BTC block rewards up for grab during the period.","On average, the Q3 bitcoin mining production of Riot, Marathon, Bitfarms, Hut8, Argo, and HIVE is about 82% higher than their Q2 numbers, thanks to their equipment expansion and waning competition from Chinese miners after the country's recent crackdown.","","","New York-based Greenidge went public in Q3 of this year via a merger deal and therefore has only disclosed its production and earnings for the quarter. BIT Digital, the only North American bitcoin mining firm that had operations in China and was affected by China’s crackdown, has yet to update its Q3 numbers.","Cleanspark is a new entrant this year in the North American bitcoin mining market. Besides Cleanspark, BIT Digital and Greenidge, the other firms have added all their mined BTC year-to-date to their balance sheets and now jointly hold 20,459 BTC, including 4,812 BTC of Marathon that it bought from the secondary market earlier this year.","","","Since these companies now hold their mined bitcoin on their balance sheets and have not liquidated it, they need to ensure they have enough funds to pay utility bills, pre-order new equipment, or expand their facilities amid an infrastructure boom in North America. To that end, some of these companies are borrowing capital.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">For instance, Argo Blockchain recently pledged some of its mined BTC as collateral to Galaxy Digital for a loan of $25 million. Marathon recently obtained a $100 million revolving line of credit from Silvergate Bank secured by its BTC and cash reserves. Hut8&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/linked\/92070\/hut8-12m-loan-foundry-bitcoin-mining\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">borrowed<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;$12 million earlier this year from DCG's Foundry to fuel its equipment expansion.<\/span>","This strategy is similar to what Chinese bitcoin miners had been doing since early 2019, betting on the upside of BTC's growth while bearing an interest rate. They also took the risk of their collateral being force-liquidated during extreme market volatility, such as in March 2020. A similar situation could occur for U.S. miners if the crypto market were to plunge.&nbsp;","But in addition to loans, U.S.-listed miners have also turned to the public market this year to increase their working capital and fuel expansion plans.","Last month, Hut8 and Argo raised $150 million and $112 million, respectively, through public offerings, and BIT Digital closed an $80 million private placement recently.","Earlier this year, Bitfarms raised $30 million in a private placement from U.S. institutions. And Nasdaq-listed Cleanspark netted $200 million in a public offering as the firm entered the bitcoin mining space."],"hashtag":["BITCOIN"]}