{"summary":"A digital euro would protect people from data collection for commercial purposes, Christine Lagarde, president of the European Central Bank (ECB) said on Wednesday at a conference in Frankfurt.\nAn American central bank digital currency, if adopted, would also prioritize privacy, according to Fed Chair Jerome Powell.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173303\/digital-euro-would-not-be-used-for-commercial-purposes-ecb-lagarde","publishDate":"2022-09-28T04:43:35","id":1946,"type":null,"title":"A digital euro would not be used for commercial purposes, ECB&#x27;s Lagarde says","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">A digital euro issued by the European Central Bank (ECB) “will not be used for commercial purposes,” according to Christine Lagarde, the central bank’s president.<\/span>","<span data-v-f87c67ca=\"\">The ECB provides “the guarantee that those payments will not be exploited for commercial purposes,\" Lagarde said on Wednesday at a conference in Frankfurt when talking about the possibilities of a central bank digital currency (CBDC)&nbsp;. \"<\/span><span data-v-f87c67ca=\"\">This is not the business of a central bank.\"<\/span>","<span data-v-f87c67ca=\"\">The ECB president referred back to a <\/span><a href=\"https:\/\/www.ecb.europa.eu\/press\/pr\/date\/2021\/html\/ecb.pr210113~ec9929f446.en.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">survey<\/span><\/a><span data-v-f87c67ca=\"\"> from January 2021, which was rolled out ahead of launching its digital euro investigation, that privacy ranked at the top of European respondents' list of features expected from a digital currency.<\/span>","<span data-v-f87c67ca=\"\">Lagarde said that a digital euro is essentially a bank note “with a little less anonymity,” but she promised that — unlike companies that sell data collected through payments — a European CBDC would protect citizens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Any U.S. CBDC would also have a focus on privacy, if adopted, Jerome Powell, the Federal Reserve chairman, <\/span><a href=\"https:\/\/www.theblock.co\/post\/173111\/the-fed-has-not-decided-to-proceed-with-a-digital-dollar-says-powell\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">Privacy-protection is one of the four CBDC characteristics Powell named, alongside intermediated, identity-verified and interoperable. However, the U.S. central bank has “not decided to proceed” with a CBDC for now.<\/span>","<span data-v-f87c67ca=\"\">The ECB’s digital euro prototype, on the other hand, is in the works. The central bank <\/span><a href=\"https:\/\/www.theblock.co\/post\/170734\/amazon-among-five-companies-to-develop-digital-euro-prototype-for-the-ecb\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> the five partner companies that will help build the trial payment system earlier this month. <\/span><span data-v-f87c67ca=\"\">T<\/span><span data-v-f87c67ca=\"\">he evaluation and results of the project are expected in March 2023.<\/span>"],"hashtag":["ECB","FEDERAL RESERVE"]}