{"summary":"Hacked DeFi Platform Opyn Says They Will Reimburse the Victims in Full","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hacked-defi-platform-opyn-says-they-will-reimburse-the-victi-7332.htm","publishDate":"2020-08-05T08:52:40","id":19462,"type":null,"title":"Hacked DeFi Platform Opyn Says They Will Reimburse the Victims in Full","category":["DeFi News "],"content":["Options issuance platform Opyn said that they would reimburse the victims of a hack that occurred less than a day ago.","“We will be reimbursing ETH put sellers in full who were affected by the vulnerability,” Opyn said this morning (UTC time). They added that more details on the reimbursement process will be available in the next three days.","Today, Opyn also published an overview of the exploit, stating that it affected only the Opyn ethereum (ETH) put contracts. This exploit enabled the attacker(s) to “double exercise” oTokens, taking the collateral posted by some sellers.","USD Coin (USDC) 371,260 were found to be stolen at the time of the report. Further USDC 572,165 from outstanding vaults was recovered by a white hat hack by the Opyn team.","To mitigate further loss, said the team, they removed liquidity from their ETH Put pools on the Uniswap platform and removed the ability to buy ETH Puts on the opyn.co website. Furthermore, “in order to ensure liquidity for existing oToken holders, we also offered and continue to offer to purchase all ETH Put oTokens that were outstanding at the time of the exploit for 20% above market price on Deribit.”","The Cryptoverse seems to no longer be surprised by the attacks in the decentralized finance (DeFi) space. Some write how learning smart contract exploits is “more profitable than trading,” some argue that insurance cover is the way to go, and others are warning that “Some bad stuff will probably happen over the next few years.”","“If you’re truly risk averse, you should avoid using DeFi altogether,” said Management consultant and Ethereum investor ‘DCinvestor.eth’. “But if you want to be a pioneer in decentralizing finance, do your own research, manage your risk, and good luck out there.”",""],"entity":[{"type":"this morning","content":"TIME"},{"type":"Opyn","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"}],"hashtag":["DeFi","Derivatives","Ethereum","Hack"],"authors":["Sead Fadilpašić"]}