{"summary":"Ethereum Name Service is set to support a web domain called .box that will have the capability to be routed on web browsers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233455\/ethereum-name-service-blockchain-browser-domains","publishDate":"2023-06-07T07:54:52","id":1946,"type":null,"title":"Ethereum Name Service to power .box domain names for web browsers","category":["WEB3"],"content":["Ethereum Name Service is set to support a web domain called .box that can be routed on web browsers, just like any conventional internet domain.","The .box name, or Top-Level Domain, originates from a project named My.Box. According to Nick Johnson, the founder and lead developer of ENS, .box will be a blockchain-based internet name service to be <a href=\"https:\/\/twitter.com\/nicksdjohnson\/status\/1666368619876327424\" data-v-f87c67ca=\"\">rolled out<\/a> for Ethereum users and enabled by the ENS protocol. Notably, My.Box will allow domains to be used for both crypto and internet services, such as email.&nbsp;","“We are delighted to have .box as the pioneer of blockchain-native DNS-routable TLD enabled by ENS. These bridges between Web2 and Web3 are vital to bring decentralized use cases to a broader audience,” Johnson said in a statement shared with The Block. “By building on ENS, it’s part of the overall goal of making decentralized naming a simple, usable standard.”","Registrations and transfers of the .box domain will be conducted on the Ethereum blockchain. The ownership of the associated NFT will encompass both the Domain Name System and My.Box ENS-based names.","The My.Box project is set to go live in September.","ENS currently <a href=\"https:\/\/www.theblock.co\/post\/158540\/ethereum-name-service-collector-buys-sony-eth-ens-for-72000\" data-v-f87c67ca=\"\">operates<\/a> the .eth name service for Ethereum users, offering an easily memorizable alternative to long and complex Ethereum crypto addresses. Unlike .eth, which doesn’t interact with the internet’s default naming protocol, DNS, the .box domain will be accessible on all web browsers via ENS. This signifies a crucial integration of ENS and DNS protocols under the project.","The team at My.Box explained that the project will be able to use Ethereum names and conventional web names simultaneously by tokenizing a DNS domain with each naming registration and by having a crypto counterpart.","“We have a mechanism to tokenize a DNS domain. Think of everything you know about .eth, then add that you also get to set your DNS records (through the same dApp), and you can use it for websites and email,” Josh Brandley, founder of My.Box, told The Block. Furthermore, it will be deployed on an Ethereum Layer 2, so gas fees will be minimal, Brandley added.","However, Johnson highlighted potential challenges concerning censorship resistance. He <a href=\"https:\/\/twitter.com\/nicksdjohnson\/status\/1666373370475061250\" data-v-f87c67ca=\"\">stated<\/a> that, unlike .eth, the .box name would not have the same resistance level. As per ICANN’s TLD policies, .box names must adhere to certain regulations — meaning the DNS records could be seized under specified and rare circumstances.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DNS","content":"ORGANIZATION"},{"type":"Nick Johnson","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Josh Brandley","content":"PERSON"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brandley","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"Domain Name System","content":"ORGANIZATION"},{"type":"ICANN","content":"ORGANIZATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","ETHEREUM"],"authors":["Vishal Chawla","The Block"]}