{"summary":"Decentralization to Secure Crypto Assets: Interview with Billy Mullins","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/decentralization-to-secure-crypto-assets-interview-with-billy-mullins.htm","publishDate":"2024-01-29T00:13:19","id":19473,"type":null,"title":"Decentralization to Secure Crypto Assets: Interview with Billy Mullins","category":["Blockchain News "],"content":["MatterFi, a decentralized digital asset wallet solution focused on security and efficiency, seeks to raise the bar regarding custody integration, faster transactions, and wider crypto adoption.","In a recent press release, the company announced Billy Mullins as its new Chief Technology Officer (CTO) to bring a wealth of experience in traditional finance and blockchain technology to enhance the company’s solutions.","In an exclusive interview with Cryptonews, Mullins gave an overview of the development of decentralized finance (DeFi) particularly on safeguarding user assets in the wake of high industry scams and hacks recorded in recent months.","Mullins aims to go beyond bridging the gap between centralized finance (CeFi) and decentralized finance and onboarding new use cases for the wider community.","DeFi has been lauded for bringing financial services to people disadvantaged by traditional finance with Mullins highlighting the objectives including safeguarding the current model from bad actors.","To him, DeFi needs to evolve to platforms where trust and scrutiny ensure total transparency to avoid incidents like the Mt. Gox and FTX saga which rocked the industry.","The implosion of FTX in 2022 wiped out billions from the market leading to widespread criticisms on the management of digital assets platforms and heightened regulatory scrutiny on the market.","Mullins believes cryptocurrency governance failures are caused by over-centralization which can lead to mismanagement resulting in a breakdown. In the alternative, MatterFi seeks to establish true decentralization alongside security and user privacy.","“Centralized systems tend to mask mismanagement, creating an environment ripe for theft and governance breakdowns. Our approach is firmly rooted in achieving true decentralization without sacrificing security, privacy, and regulatory compliance.”","Aside from internal company solutions, Mullins projects that just like the slogan “not your keys, not your coins”, the phrase “privacy is priceless” can equally gain popularity among all stakeholders in a bid to project activities from bad actors.","Finally, the firm stresses a compliance-first approach in markets and wants practical regulation to coexist with the innovations of web3 to protect investors and drive adoption.","According to the press release, Mullins joins the firm with over two decades of experience in investment banking, big data, mobile payment, and blockchain technology.","As a former Vice President at Goldman Sachs in New York and in top positions in technology, the company can leverage the blend to spur the next wave of web3 adoption based on key solutions.","“Billy’s decision to join MatterFi is fueled by a desire to dive back into the heart of engineering, to actively participate in the development process, and to leverage his skills in a role directly connected to technological innovation. His blend of technical knowledge and a background in trading, banking, and financial services uniquely positions him to contribute meaningfully to MatterFi’s mission.”","In line with the company’s objectives, Mullins stated that his appointment will help to drive adoption and reshape how cryptocurrency transactions are handled in a more user-friendly and secure blockchain space.","The “send to name” feature of the platform received mentions and is tipped to become a game-changer in bringing the desired user convenience to cryptocurrency transactions."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Billy Mullins","content":"PERSON"},{"type":"Mullins","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Billy’s","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Cryptonews","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Billy Mullins","CRYPTO","MatterFi"],"authors":["David Pokima"]}