{"summary":"Orbit Chain Hacker Swaps Stolen USDT for ETH, Rakes in $1.45 Million Profits","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/orbit-chain-hacker-swaps-stolen-usdt-for-eth-rakes-in-1-45-million-profits.htm","publishDate":"2024-01-02T05:11:39","id":19476,"type":null,"title":"Orbit Chain Hacker Swaps Stolen USDT for ETH, Rakes in $1.45 Million Profits","category":["Altcoin News "],"content":["The attackers behind the recent Orbit Chain exploit successfully converted their ill-gotten gains into Ethereum (ETH), amassing an additional $1.45 million in unrealized profits amidst a 4.7% surge in ETH prices over the past 24 hours.","🚨 After stealing ~$81.6M in various assets from @Orbit_Chain, the exploiter swapped 30M $USDT and 230.9 $WBTC to 17,250 $ETH ($39.7M) at $2,301 on avg.","And now further gains $1.45M in unrealized profit thanks to the 3.8% pump in $ETH price in the past 24 hours.","👉 More… https:\/\/t.co\/PLbl1yXo8m pic.twitter.com\/RA791tBkEw","— Spot On Chain (@spotonchain) January 2, 2024","","The cybercriminals, responsible for the theft of approximately $81.6 million from the Orbit Chain platform just hours before the new year, exchanged 30 million USDT and 230.9 WBTC for 17,250 ETH at an average price of $2,301. The conversion, valued at $39.7 million, allowed the attackers to capitalize on the upward momentum in ETH prices.","Orbit Chain later confirmed an unidentified access to Orbit Bridge, a cross-chain bridging service of the South Korean-based multi-asset blockchain. Following the breach, the project swiftly suspended the cross-chain bridge contract and engaged in on-chain negotiations with the attackers, as reported by Beosin Alert, an on-chain analytics platform.","Concerns about a potential exploit were initially raised by a pseudonymous Twitter user, Kgjr, on December 31. The user highlighted significant outflows from the Orbit Chain Bridge protocol. Subsequent investigations by blockchain analytics platform Arkham Intelligence revealed that the hackers orchestrated five separate transactions, transferring various assets to new wallets.","Orbit Chain, renowned for facilitating cross-chain transfers between decentralized networks, particularly EVM-compatible networks and Klaytn, now faces the aftermath of this high-profile breach. The protocol, deeply integrated with the Klaytn network, experienced a substantial loss as eight of the largest assets on Klaytn were wrapped assets on the Orbit Bridge."],"entity":[{"type":"$81.6 million","content":"MONEY"},{"type":"$ETH","content":"MONEY"},{"type":"South Korean","content":"LOCATION"},{"type":"$39.7 million","content":"MONEY"},{"type":"3.8%","content":"PERCENT"},{"type":"December 31","content":"DATE"},{"type":"4.7%","content":"PERCENT"},{"type":"Beosin Alert","content":"ORGANIZATION"},{"type":"Klaytn","content":"PERSON"},{"type":"$ETH ($39.7","content":"MONEY"},{"type":"Kgjr","content":"PERSON"},{"type":"$2,301","content":"MONEY"},{"type":"January 2, 2024","content":"DATE"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"$1.45 million","content":"MONEY"},{"type":"$USDT","content":"MONEY"},{"type":"$1.45","content":"MONEY"},{"type":"$WBTC","content":"MONEY"},{"type":"$81.6","content":"MONEY"}],"hashtag":["Crypto hack","DeFi"],"authors":["Jai Pratap"]}