{"summary":"South Koreans Warned to Declare Overseas Crypto Exchange Holdings","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-koreans-warned-to-declare-overseas-crypto-exchange-holdings.htm","publishDate":"2024-04-30T03:00:20","id":19487,"type":null,"title":"South Koreans Warned to Declare Overseas Crypto Exchange Holdings","category":["Blockchain News "],"content":["South Korean crypto holders were warned to declare their overseas crypto exchange holdings – or face a potential “tax bombshell.”","The cautionary words came from Kim Dae-kyung, a tax accountant at the Hana Bank Asset Management group’s Asset Management Consulting Center. Kim published the warning in an article for the media outlet Money S.","Crypto trading profits are not subject to any form of taxation in South Korea, provided this trading is done on domestic platforms.","As of next year, that is slated to change. A new law will require traders to file capital gains declarations and pay tax on profits over a threshold of around $2,100.","However, Kim explained that cryptoassets held on platforms outside South Korea are already considered “overseas assets.”","Failure to declare these assets on Financial Year 2023-2024 tax declarations could be considered tax law violations, Kim wrote.","The tax expert wrote that “overseas financial account” declarations must be completed by the end of June this year.","These such declarations were mandatory per the terms of the Income Tax Act.","The act stipulates that “if the total balance of overseas financial institution accounts exceeds [$363,000],” South Korean residents “must fulfill the obligation to report overseas financial accounts by June 30.”","The expert added that until recently, tax bodies were relatively powerless to identify overseas assets. They relied entirely on voluntary declarations for their information, Kim wrote.","However, Kim noted that as of 2014, South Korean tax bodies have been exchanging data with their counterparts in the USA and other OECD nations.","As such, Kim wrote that the National Tax Service can now access all of “an individual’s overseas account information.”","Tightening global regulation of crypto exchanges has extended this to token wallets. Data sharing between international exchanges is now mandatory in many areas.","Kim noted that fines for “non-reporting” are“very large,” at “approximately 10-20% of the [wallet] balance.”","If crypto traders fail to report details of wallets containing over $3.6 million worth of assets, they could face criminal prosecution.","Lawmakers added crypto-specific clauses to the tax code in December 2020. These specifically cover “accounts opened overseas to trade cryptoassets.”","https:\/\/t.co\/0ODFiUuW3F delays Korean market entry indefinitelyhttps:\/\/t.co\/0wH9g3SCmZ","— The Korea Times (@koreatimescokr) April 24, 2024","","President Yoon Suk-yeol has previously pledged to raise the tax threshold for domestic crypto trading profits to around $41,000."],"entity":[{"type":"2014","content":"DATE"},{"type":"$41,000","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"$363,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Kim Dae","content":"PERSON"},{"type":"June this year","content":"DATE"},{"type":"USA","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"$3.6 million","content":"MONEY"},{"type":"December 2020","content":"DATE"},{"type":"$2,100","content":"MONEY"},{"type":"Yoon Suk","content":"PERSON"},{"type":"Hana Bank Asset Management group’s Asset Management Consulting Center","content":"ORGANIZATION"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"OECD","content":"ORGANIZATION"}],"hashtag":["crypto tax","South Korea"],"authors":["Tim Alper"]}