{"summary":"PSYOP Token Investors Lose Half Their Funds After ‘Scam’ – Here’s Three Coins You Can Trust","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/psyop-token-investors-lose-half-their-funds-after-scam-heres-three-coins-you-can-trust.htm","publishDate":"2023-05-22T17:51:00","id":19480,"type":null,"title":"PSYOP Token Investors Lose Half Their Funds After ‘Scam’ – Here’s Three Coins You Can Trust","category":["Altcoin News "],"content":["Presale investors in Ben.eth’s unorthodox launch of the PSYOP meme coin appear to have lost out big time, with some losing half of their funds and others dubbing the token launch a “scam”.","On-chain analytics Twitter account @lookonchain examined the airdrops received by some of the PSYOP presale’s biggest investors.","A wallet starting with 0xf4ae sent 29 ETH to Ben.eth, but has so far only received around 25.5 million in PSYOP tokens worth only around 14 ETH, representing a loss of nearly half of his funds.","Ben.eth has promised to airdrop more tokens, which could make investors such as 0xf4ae whole.","But others are dubbing the meme token launch as a scam.","Psuedoanonymous Twitter account @vydamo_, who claims to have worked with Ben.eth on the first $PSYOP contract, said he had “never worked with someone more unprofessional or deranged” and claimed in a tweet thread to “have credible evidence that Ben does not intend for this to be a fair launch or even project”.","Ben.eth has also been threatened with a lawsuit by Mike Kanovitz, a partner at law firm Loevy & Loevy, unless he agrees to refund presale investors with all of the ETH they sent him for the PSYOP airdrop.","Ben.eth could face charges relating to racketeering, wire fraud and misleading investors, Kanovitz said in a letter sent to Ben.eth via the blockchain as an NFT.","Investors need to be careful about investing in dodgey presales like the one offered by Ben.eth for PSYOP.","Investors should be looking to invest in projects where the token contract is fair and audited, where the project’s creators are doxed and where the project has a meaningful plan of action to deliver value to early investors (i.e. a well-articulated white paper and business plan).","That way, the risk of a project being a rug pull (i.e. trick to steal funds from investors) is a lot lower.","Here are three projects that the team at Cryptonews.com think have a lot of potential and can be trusted.","AiDoge, a fun AI-powered meme-generating tool and social media platform, could be the next token to explode, as not only is it a meme coin, but also boasts a solid use case and utility.","AiDoge is building a platform where users can generate memes using breakthrough generative AI technology, before sharing them with the AiDoge community via the platform’s public wall.","The creators of the most popular memes will be rewarded with AiDoge’s native $AI token, meaning that AiDoge is bringing the concept of “meme-to-earn” (M2E) into reality.","","It's official #AiDogeArmy! 🔥\n\nStage 16 of the #Presale has sold out and we have raised over $11.6 million 🤯💥\n\nOnly 4 stages of the presale left! ⏰\n\nAct fast and secure your $AI before time runs out! 😎\n👉 https:\/\/t.co\/5j5tt4smcs#MemeCoin #Crypto $PEPE $FLOKI $DOGE $BTC pic.twitter.com\/mCykQhyosB","AiDoge has already raised a huge $11.6 million via the public presale of its native $AI token and investors should move quickly whilst they can still secure the token at what observers say is a substantial discount versus how high $AI has the potential to go.","Visit AiDoge Here","Love Hate Inu (LHINU), the meme coin that powers a first-of-its-kind blockchain-powered social media polling platform, launched on major cryptocurrency exchange OKX on Friday and has already seen an explosive rally.","The token listed for $0.000145 but almost immediately saw 150% gain to hit $0.00036, before falling back to current levels around $0.00012.","The platform will allow users to have a say on whether they love or hate divisive figures like Elon Musk, Cristiano Ronaldo and Donald Trump, as well as Andrew Tate.","Given it combines the virality of meme coins and controversial current affairs whilst offering a clearly articulated utility, many observers think Love Hate Inu will catch fire in 2023.","Visit Love Hate Inu Here","Ecoterra is the native cryptocurrency of a blockchain-run green ecosystem that incentivizes environmentally friendly behavior. ","Ecoterra’s ecosystem consists of a Recycle to Earn (R2E) platform, a carbon offset marketplace, a marketplace for recycled materials and an impact profile.","The green web3 start-up’s R2E app is supported in any country that uses Reverse Vending Machines (RVMs), meaning a huge potential market.","Ecoterra is in the seventh stage of its ECOTERRA token presale, with tokens currently priced at just $0.0085.","The project just passed the massive milestone of having raised over $4.2 million.","Potential investors should note that the presale price will soon rise to $0.00775 and that the token will list on exchanges at $0.01 – a more than 17% jump from current levels.","Visit Ecoterra Here"],"entity":[{"type":"$PEPE $FLOKI $DOGE $BTC","content":"MONEY"},{"type":"Cristiano Ronaldo","content":"PERSON"},{"type":"$0.0085","content":"MONEY"},{"type":"$PSYOP","content":"MONEY"},{"type":"$AI","content":"MONEY"},{"type":"$11.6 million","content":"MONEY"},{"type":"17%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"150%","content":"PERCENT"},{"type":"AiDoge Here","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Loevy & Loevy","content":"ORGANIZATION"},{"type":"Reverse Vending Machines","content":"ORGANIZATION"},{"type":"$0.00036","content":"MONEY"},{"type":"$4.2 million","content":"MONEY"},{"type":"$0.00012","content":"MONEY"},{"type":"Kanovitz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$0.00775","content":"MONEY"},{"type":"Ben","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Andrew Tate","content":"PERSON"},{"type":"$0.01","content":"MONEY"},{"type":"Donald Trump","content":"PERSON"},{"type":"$0.000145","content":"MONEY"},{"type":"Mike Kanovitz","content":"PERSON"},{"type":"Hate Inu Here","content":"ORGANIZATION"}],"hashtag":["Presale"],"authors":["Joel Frank"]}