{"summary":"Nine Blocks Capital Management will cater to institutional investors and operate as a market neutral crypto fund focused on generating alpha from inefficiencies in the crypto markets.\nDespite saying Hong Kong would be a “natural home” for the firm, it has chosen to set up shop in Dubai and the Cayman Islands.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161412\/former-pwc-crypto-head-sets-up-crypto-asset-management-firm-in-dubai","publishDate":"2022-08-04T06:44:43","id":1949,"type":null,"title":"Former PwC crypto head sets up crypto asset management firm in Dubai","category":["Institutional Investors"],"content":["PwC's former global crypto leader Henri Arslanian is launching a crypto asset management firm in Dubai, according to a <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:6960837108236181504\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> post on Thursday.","Nine Blocks Capital Management will cater to institutional investors and operate as a \"market neutral\" fund focused on profiting from inefficiencies in the crypto markets using relative value, arbitrage and quantitative strategies, according to the post.","The company has received $75 million in funding from its main shareholder, Hong Kong-based hedge fund Nine Masts, where Nine Blocks co-founder Andrew D. Goodwin was perviously a portfolio manager.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>Nine Blocks will also absorb Nine Masts’ existing digital assets trading arm.","Its 10-strong team includes three portfolio managers based in the Cayman Islands, where the company has an office. But it has also received provisional approval from Dubai’s Virtual Assets Regulatory Authority (VARA).","Since the <a href=\"https:\/\/www.theblock.co\/linked\/136994\/dubai-creates-agency-for-virtual-asset-regulation\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">launch of VARA<\/a> in March, high profile crypto brands have been moving to Dubai as the city tries to position itself as a financial center. Among them, VARA has granted provisional approval to the likes of FTX and Binance.","The firms that Dubai gains are firms lost for established Asian financial centers like Singapore and Hong Kong, both of which have cooled on the crypto industry.","Speaking with the Financial Times, <a href=\"https:\/\/www.ft.com\/content\/7ddc38c3-9a94-4d6f-86f0-783097a49910\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Arslanian admitted<\/a> that Hong Kong would have been a \"natural home\" for the firm but pointed to regulatory approval times and travel restrictions —<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> quarantine is still mandatory for international travellers <\/span>—<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> as forcing their hand.<\/span>","\"When we looked at the broader ecosystem . . . Cayman and Dubai made a natural choice,” he said."],"hashtag":[]}