{"summary":"Litigation Analyst Gives Coinbase a 70% Shot at Full Dismissal in SEC Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/analyst-gives-coinbase-shot-at-full-dismissal-in-sec-case.htm","publishDate":"2024-01-22T14:54:23","id":19498,"type":null,"title":"Litigation Analyst Gives Coinbase a 70% Shot at Full Dismissal in SEC Case","category":["Blockchain News "],"content":["According to Bloomberg senior litigation analyst Elliott Stein, the major US-based crypto exchange Coinbase might be looking at a favorable outcome in its legal battle against the US Securities and Exchange Commission (SEC).","In a recent post on X, Stein shared his analysis of the case and expressed a 70% confidence in Coinbase securing a full dismissal in the ongoing lawsuit.","Initially, Stein anticipated that Coinbase might successfully object to certain SEC claims but could face challenges regarding allegations related to its staking rewards program and overall operational structure. However, after a five-hour hearing, his outlook changed.","“I went into SEC v. Coinbase hearing thinking COIN would, on this motion, win dismissal of SEC’s primary claims (concerning trading) but maybe not staking and broker claims. I left thinking COIN would win full dismissal,” Stein wrote in the X post.","I went into SEC v. Coinbase hearing thinking $COIN would, on this motion, win dismissal of SEC's primary claims (concerning trading) but maybe not staking and broker claims. I left thinking COIN would win full dismissal. Snippet below and full note here: https:\/\/t.co\/UfjiByMLzS https:\/\/t.co\/7Y2Z93Nrwt pic.twitter.com\/yLUUEwdVkl","— Elliott Z. Stein (@NYCStein) January 19, 2024","","The SEC has accused Coinbase of offering investment contracts (also known as securities) by staking customer assets. The exchange has received staking rewards in returns, which it has paid back to its customers.","Additionally, the regulator alleges that Coinbase operated as an unregistered broker.","Coinbase, on its end, has rejected the claims, and focused its defense on the difficulty it has faced in registering with the SEC for a license.","According to Stein, a pivotal moment in the hearing occurred when Coinbase provided a more precise definition of an “investment contract” than the SEC, emphasizing the requirement for an investment in a business with an “enforceable obligation.”","Stein referenced the SEC vs. Ripple case, where Ripple achieved a partial victory in 2023 after the judge ruled that XRP is “not in and of itself” a security.","Specifically, the judge made it clear that XRP should not be seen as a security when sold to retail investors, although it could be deemed a security when sold to institutional investors.","“As the Ripple ruling in July suggested, sales of digital assets on public exchanges don’t fit neatly into the Howey test for what constitutes an investment contract,” Stein wrote in his note.","He added that even if the case survives, it will likely reach the Supreme Court, and said Coinbase has “good arguments that the SEC’s allegations don’t sufficiently plead that it was performing broker functions.”"],"entity":[{"type":"Elliott Stein","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"$COIN","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Elliott Z. Stein","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"January 19, 2024","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Stein","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"}],"hashtag":["Coinbase","SEC"],"authors":["Fredrik Vold"]}