{"summary":"London Stock Exchange to Roll Out Crypto ETNs on May 28","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/london-stock-exchange-to-roll-out-crypto-etns-on-may-28.htm","publishDate":"2024-03-26T08:52:38","id":19492,"type":null,"title":"London Stock Exchange to Roll Out Crypto ETNs on May 28","category":["Bitcoin News "],"content":["London Stock Exchange (LSE) is set to lunch Bitcoin (BTC) and Ether (ETH) exchange-traded notes (ETNs) from May 28. The announcement follows FCA’s approval on March 11, to allow LSE list crypto offerings for pro investors.","Announced Monday, LSE signalled that it would start accepting applications for physically-backed crypto ETNs from April 8. Further, the market for crypto ETN will be subject to the approval of the UK regulator – FCA, the notice read.","The exchange has selected May 28 to ensure that issuers get enough time to meet the requirements for consideration.","“We have decided to launch the market in Crypto ETNs on 28 May 2024 to enable the maximum number of issuers to be present in the market on the first day of trading.”","London Stock Exchange noted that applications will not be accepted beyond April 15, including a base prospectus for FCA approval.","Additionally, per LSE’s “Crypto ETN Admission Factsheet,” the exchange would only consider physically-backed BTC and Ether ETNs with its assets held in cold storage. Also, the admission guidance set out in this Factsheet donot apply to crypto ETNs, “given the nature of the product.”","“Issuers and their advisers should therefore liaise with the Exchange at the earliest opportunity to discuss their proposed admission.”","Despite FCA’s approval to list crypto ETNs, industry players are not happy with its availability to only “professional investors.” The FCA continues its ban on retail investors buying crypto ETPs.","The regulator’s stance is in contrast with several other jurisdictions that have opened the door for such vehicles to individual investors.","Bradley Duke, chief strategist of ETC Group hopes that the retail ban will be lifted soon after. “The LSE is such an important market for us we definitely will list products when possible and preparation is under way,” he told FT.","FCA stressed early this month that it “continued to believe that crypto ETNs and crypto derivatives are ill-suited for retail consumers due to the harm they pose.”"],"entity":[{"type":"Crypto ETN Admission Factsheet","content":"ORGANIZATION"},{"type":"May 28","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"May 2024","content":"DATE"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bradley Duke","content":"PERSON"},{"type":"March 11","content":"DATE"},{"type":"London Stock Exchange","content":"ORGANIZATION"},{"type":"London Stock Exchange (LSE","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"April 15","content":"DATE"},{"type":"April 8","content":"DATE"},{"type":"LSE","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Exchange-Traded Notes","London Stock Exchange"],"authors":["Sujha Sundararajan"]}