{"summary":"Sapien AI Raises $5M for Blockchain Data Labeling Platform","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sapien-ai-raises-5m-for-blockchain-data-labeling-platform.htm","publishDate":"2024-04-10T09:42:44","id":19497,"type":null,"title":"Sapien AI Raises $5M for Blockchain Data Labeling Platform","category":["Blockchain News "],"content":["Artificial intelligence firm Sapien AI has raised $5 million in a seed funding round with participation from Primitive Ventures, Animoca Ventures, and Yield Guild Games.","In an announcement, the firm said the funding will be used to accelerate Sapien’s mission of providing scalable annotation services for training AI models through its gamified data labelling platform.","“This funding will allow us to expand our team, expand our frontend labelling infrastructure, and provide better quality data for our growing list of enterprise customers,” said Trevor Koverko, co-founder of Sapien in a press release.","Sapien is a San Francisco headquartered firm and founded in 2023. The firm helps companies develop AI models by gamifying the data labelling experience with blockchain-based rewards.","The platform has customers across the AI data industry including healthcare, web3, education and leading LLMs. This fresh funding round will be used to further develop and open source its gamified labelling infrastructure while continuing to set a new standard for how humans and AI work together, said the firm.","“Sapien’s innovative approach to data labelling, which combines advanced technology with human expertise, sets them apart in the industry,” said James Ho, Head of Animoca Ventures.","“We believe the team’s deep understanding of the market and their commitment to customer success will make them an ideal partner for companies looking to train their AI models with the best data possible. We are excited to support Sapien as they continue to grow and make a significant impact in the AI space,” adds Ho.","Venture capital funding in the Web3, gaming, AI and crypto space has experienced a surge in the first quarter of 2024, breaking a two-year downtrend. Both the total amount invested and the number of projects receiving VC funding have seen substantial increases since Q4 2023, according to data gathered by crypto analysis platform Crypto Koryo, as reported by Ruholamin Haqshanas from Cryptonews. ","Data shows there has been a notable 38% rise in funds invested during the quarter, indicating a renewed investor confidence in the crypto industry.  Moreover, there has been a remarkable 49% increase in the number of projects securing funding, a level not witnessed since Q4 2021. "],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"Yield Guild Games","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Primitive Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sapien AI","content":"ORGANIZATION"},{"type":"Head of Animoca Ventures","content":"ORGANIZATION"},{"type":"Crypto Koryo","content":"ORGANIZATION"},{"type":"38%","content":"PERCENT"},{"type":"49%","content":"PERCENT"},{"type":"Animoca Ventures","content":"ORGANIZATION"},{"type":"Trevor Koverko","content":"PERSON"},{"type":"James Ho","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":["Blockchain","funding","Sapien AI"],"authors":["Tanzeel Akhtar"]}