{"summary":"Stephane Gosselin, the Flashbots relay co-founder, announced he left the company last month.\nGosselin expressed hopes that validators will support relays that are not censored.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175709\/flashbots-co-founder-steps-down-after-disagreements-with-team-over-censorship","publishDate":"2022-10-07T21:58:39","id":195,"type":null,"title":"Flashbots co-founder steps down after disagreements with team over censorship","category":["People"],"content":["<span data-v-f87c67ca=\"\">Stephane Gosselin, co-founder of Flashbots, last month resigned from the maximal extracted value (MEV)&nbsp; service following disagreements with the team, he announced on Twitter.<\/span>","<span data-v-f87c67ca=\"\">For a diverse and competitive MEV ecosystem, it is crucial to preserve censorship resistance,&nbsp; Gosselin said in a statement. Gosselin also said he was proud of what the project had achieved.<\/span>","“In the short term, I am hopeful that validators will avoid connecting to relays that perform censorship. Blockspace suppliers putting economic pressure against censorship will go a long way to making sure it does not become ubiquitous.” Gosselin told The Block via direct message on Twitter.","<span data-v-f87c67ca=\"\">Since The Merge a relative consolidation of Ethereum validators on popular staking pools that use <\/span><a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Flashbots<\/span><\/a><span data-v-f87c67ca=\"\"> relays occurred. The MEV provider’s decision to ignore transactions from sanctioned mixing service Tornado Cash has drawn criticism that Flashbots is enabling censorship on the blockchain.<\/span>","<span data-v-f87c67ca=\"\">Concerns over the apparent censorship prompted a <\/span><a href=\"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">response<\/span><\/a><span data-v-f87c67ca=\"\"> from Flashbots Product Lead Robert Miller, who said the company is exploring ways to reduce dominance, and has <\/span><a href=\"https:\/\/www.theblock.co\/post\/164152\/flashbots-to-hasten-open-sourcing-of-its-mev-boost-relay-code\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">open-sourced<\/span><\/a><span data-v-f87c67ca=\"\"> its code.<\/span>","<span data-v-f87c67ca=\"\">Gosselin described how Flashbots makes markets more efficient in a Season 4 episode of The Scoop.<\/span>","<iframe frameborder=\"0\" height=\"482\" src=\"https:\/\/playlist.megaphone.fm\/?e=BLOCK2573689595\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>L"],"hashtag":["CENSORSHIP","ETHEREUM","MEV"]}