{"summary":"Arthur Hayes Predicts Bitcoin Price to Rally Back to $70,000 – Here’s Why","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/arthur-hayes-bitcoin-price-to-reach-70k.htm","publishDate":"2024-05-03T19:08:18","id":19517,"type":null,"title":"Arthur Hayes Predicts Bitcoin Price to Rally Back to $70,000 – Here’s Why","category":["Bitcoin News "],"content":["Arthur Hayes, co-founder and former CEO of BitMEX crypto exchange, shared his optimistic outlook on the future of Bitcoin’s price on May 3. He predicted a stabilization around $60,000, followed by fluctuations within the $60,000 to $70,000 range until August 2024.","Arthur Hayes explained in a Medium blog post that the BTC price may have reached its lowest point and is set for a gradual recovery.","JUST IN:🚨📈#Bitcoin Billionaire Arthur Hayes Predicts Market Bottom Is In, 'Slow Grind Higher' over the summer pic.twitter.com\/2Y1PNpy7t8","— Crypto Macro (@cryptomacro14) May 3, 2024","","Hayes attributed the downward trend of the Bitcoin price to various factors, including the US tax season, uncertainty surrounding Federal Reserve actions, and the impact of the Bitcoin halving event. He sees these indicators as a necessary adjustment for the market.","The erstwhile BitMEX chief justified his rally insights by referencing the Federal Reserve’s recent announcement. The Fed had stated that it would decrease the rate of quantitative tightening (QT)—a method used by central banks to reduce the circulation of money in the economy.","This will reduce the monthly cap on maturing Treasuries from $60 billion to $25 billion monthly, with an annual reduction in holdings at $300 billion.","“When you combine the Interest on Reserve Balances, RRP payments, and interest payments on US Treasury debt, the reduction in QT increases the amount of stimulus provided to the global asset markets each month,” Hayes stated.","Hayes predicted that as the Fed tapers QT, billions of dollars of liquidity would be added, offsetting negative price movements. He believes that this liquidity injection would gradually push crypto prices higher, albeit at a slow pace.","He further described the Fed’s approach as a form of “stealth money printing,” wherein gradually reducing its balance sheet would ease dollar liquidity and stabilize market conditions.","BREAKING: Interest rate futures are now expecting 1 rate cut in 2024 at the Fed's NOVEMBER meeting.","This is the first time we have seen rate cuts pushed all the way back to November 2024.","After the January Fed meeting, markets were pricing-in 7 interest rate cuts at EVERY… pic.twitter.com\/iQ7PgntG3k","— The Kobeissi Letter (@KobeissiLetter) May 1, 2024","","The insight from the BitMEX co-founder follows the release of the Federal Reserve’s rate, which will remain unchanged between 5.25% and 5.50%.","Dr. Jeff Ross, the founder and CEO of Vailshire Capital Management, commented on Arthur Hayes’ sentiments regarding his Bitcoin price prediction on X on May 2.","Lot's of #bitcoin doom and gloom out there again today.","You do you, but I'm still respecting the ongoing bullcrab market.","The FOMC rhetoric pivot yesterday (which begins on June 1st) was the official transition from bad-to-less-bad liquidity conditions, IMHO.","As an aside,… pic.twitter.com\/2HY0nWuW43","— Dr. Jeff Ross (@VailshireCap) May 2, 2024","","He stated that analysts could be in for a surprise — suggesting that the widely held belief that the Bitcoin bull market has concluded may be incorrect. Instead, Ross argued that the actual bullish run for the Bitcoin price may be yet to start."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"May 2, 2024","content":"DATE"},{"type":"Jeff Ross","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"5.50%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ross","content":"PERSON"},{"type":"$300 billion","content":"MONEY"},{"type":"May 3, 2024","content":"DATE"},{"type":"August 2024","content":"DATE"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Vailshire Capital Management","content":"ORGANIZATION"},{"type":"$60,000","content":"MONEY"},{"type":"$25 billion","content":"MONEY"},{"type":"May 2","content":"DATE"},{"type":"May 3","content":"DATE"},{"type":"November 2024","content":"DATE"},{"type":"May 1, 2024","content":"DATE"},{"type":"RRP","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"June 1st","content":"DATE"},{"type":"January Fed","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"5.25%","content":"PERCENT"},{"type":"Interest on Reserve Balances","content":"ORGANIZATION"},{"type":"NOVEMBER","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"$60 billion","content":"MONEY"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["Arthur Hayes","Bitcoin","Bitcoin Price Prediction"],"authors":["Jimmy Aki"]}