{"summary":"The majority of global crypto fundraising and M&A deals in 2019 took place outside of the U.S., according to PwC\nAPAC and EMEA regions together accounted for a total of 51% share\nPwC global crypto leader Henri Arslanian said: “We expect to see more APAC and EMEA based family offices looking at the market turbulence as a good time to invest in promising crypto companies.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60993\/crypto-fundraising-and-ma-deals-shifting-outside-of-the-us-says-pwc","publishDate":"2020-04-06T06:10:31","id":1952,"type":null,"title":"Crypto fundraising and M&amp;A deals shifting outside of the US, says PwC","category":["Investments"],"content":["The majority of global crypto fundraising and M&amp;A (mergers and acquisitions) deals in 2019 took place outside of the U.S., according to the “Big Four” consulting firm PwC.","In a report published Monday, PwC said both APAC (Asia-Pacific) and EMEA (Europe, Middle-East and Africa) regions accounted for a total of 51% of crypto fundraising and M&amp;A deals last year - APAC (29%) and EMEA (22%).","In 2018, the share of both regions was 44% - that is an increase of 7% year-on-year. The share of U.S., on the other hand, has dropped to 48% of the total from 55% a year ago.","","","“We expect to see more APAC and EMEA based family offices looking at the market turbulence as a good time to invest in promising crypto companies,” said Henri Arslanian, PwC global crypto leader and one of the authors of the report.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOverall, there was a sharp decline in both the number and value of deals last year. The number of equity fundraising deals for crypto-related companies decreased by 18% last year as compared to 2018, while the value of fundraising deals fell by 40% to $2.24 billion in 2019, per the report.","On the M&amp;A side, the number of deals decreased by 40%, and the total deal value decreased by 76%, with average crypto M&amp;A deal size down to $17.2 million as compared to $27 million in 2018.","“The crypto industry is not immune to the global headwinds, and the number and value of crypto fundraising and M&amp;A deals may be impacted in 2020,” said Arslanian.","In terms of top 5 investors by deal count, 2019 saw more crypto-focused firms such as Coinbase and ConsenSys providing funding, as compared to traditional VCs and incubators in 2018, per the report.","",""],"hashtag":["FUNDRAISING"]}