{"summary":"Ethereum Fees Pushed Higher by DEX Trading as Optimism’s Upgrade Nears","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-fees-pushed-higher-by-dex-trading-as-optimisms-upgrade-nears.htm","publishDate":"2021-11-10T17:37:00","id":19525,"type":null,"title":"Ethereum Fees Pushed Higher by DEX Trading as Optimism’s Upgrade Nears","category":["Ethereum News "],"content":["As Ethereum (ETH) continues to be plagued by high gas fees, the layer 2 (L2) scaling solution Optimism is expected to launch a major upgrade on November 11.","“There is progress being made towards scalability via L2 scaling solutions that promise lower fees and full alignment with Ethereum. This Thursday (November 11th) the L2 solution Optimism is set to release one of its biggest upgrades which will, among other things, greatly improve the developer experience building on Optimism,” according to crypto analysis firm Coin Metrics. ","Layer 1 (L1) is the base protocol (the Ethereum blockchain), while L2 is any protocol built on top of Ethereum.","Decentralized finance (DeFi) startup Optimism announced “the biggest update in Optimistic Ethereum’s history: OVM 2.0” in September, as “the simplest, cheapest, and fastest version of OE [Optimistic Ethereum] yet.” Then in late October, they described it as “a new gold standard for L2s.”","Per this Twitter thread, Optimistic Ethereum will become the first [Ethereum virtual machine] Equivalent L2, which meant that almost all of their custom code will be cut out “in favor of simply using an existing Ethereum client — Geth.”","EVM Equivalence is powerful enough that we think other L2s will have to adopt the same pattern. This is a good thing for Ethereum as a whole — it means we can start to standardize L2 architectures. And standardization means more progress for less effort.","Meanwhile, as reported in mid-July, Optimism launched the long-awaited Alpha L2 solution for major decentralized exchange (DEX) Uniswap (UNI) through the Optimistic Ethereum mainnet.","A solution can’t come fast enough as Ethereum gas fees are back on the rise with activity on the network picking up. ","As of Tuesday this week, the 7-day moving average of the mean Ethereum transaction fee stood at USD 47.7, down from a peak of USD 52 a week earlier, according to data from BitInfoCharts.","Coin Metrics wrote in its latest State of the Network report that some activities have now become prohibitively expensive on Ethereum.","“Even after adjusting for the rise in ETH’s price in USD terms, fees are still increasing in native units. The high fees are starting to price out certain economic activity such as small transfers under [USD] 100 in value that have dropped off with the increase in fees,” the report said.","Further, the firm also said that unlike this summer, when high gas prices plagued the Ethereum network as non-fungible token (NFT) trading took off, the digital art pieces are likely not to blame for the latest rise in fees.","The reason Coin Metrics cited for this is that daily transfers of ERC-721 tokens – the standard that NFTs are built on – is down from a peak of about 200,000 per day in early September to an average of 67,000 over the last week.","Instead, the report hinted that trading on DEXs could be a contributing factor, describing this activity as “less cost-sensitive.” Specifically, it cited an uptick in the number of trades and unique buyers in recent weeks on Uniswap.","In addition to DEX trading, however, the recent meme coin mania may also be playing a role, given that the recently hot, self-proclaimed “dogecoin killer,” shiba inu (SHIB), is an Ethereum-based ERC-20 token.","“For example, on October 28th over 100K ETH addresses interacted with SHIB while 133K transactions involved the token that day, ~9% of the 1.5M ETH transactions that day,” Coin Metrics said.","The analysis firm further noted that high gas fees remain “a double-edged sword” for Ethereum. On one side, it is a sure sign that activity on the protocol is high, indicating strong user demand, but on the other, as noted, the fees are “pricing out” certain actors and activities.","At press time (12:37 UTC) on Wednesday, ETH traded at USD 4,746, down just under 1% for the past 24 hours and up 3.2% for the week.","____","Learn more:\n– Ethereum and Uniswap Tank Despite Optimism News\n– DYDX Soars as Protocol Sees Trading Volume Double That of Coinbase\n\n– Ethereum Tests All-Time High as On-Chain Activity Grows, SHIB Burns ETH\n– Ethereum’s EIP-1559 Helped Coinbase Save ETH 27 on Daily Fees\n\n– USD 0.5 Million Paid in Failed Ethereum Transaction\n– DeversiFi Explains What Caused the USD 23M Transaction Fee on Ethereum\n\n– Altcoins in for a Bumper 2022 as Number of Crypto Traders Set to Double – Report\n– Altcoins Eclipse Combined Bitcoin, Ethereum Transaction Volumes on Coinbase"],"entity":[{"type":"Ethereum Transaction Volumes on Coinbase","content":"ORGANIZATION"},{"type":"Burns","content":"PERSON"},{"type":"Tuesday this week","content":"DATE"},{"type":"November 11","content":"DATE"},{"type":"3.2%","content":"PERCENT"},{"type":"Uniswap Tank Despite Optimism News\n– DYDX Soars as Protocol Sees Trading Volume Double That of Coinbase","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Number of Crypto Traders","content":"ORGANIZATION"},{"type":"mid-July","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"1559","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Optimistic Ethereum","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"USD 23M Transaction","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Altcoins","DEX","Dogecoin","Ethereum","Fees","Market","NFT","Non-fungible tokens","Shiba inu","Uniswap"],"authors":["Fredrik Vold"]}