{"summary":"Bitcoin Decouples from Nasdaq, 40-Day Correlation Now Stands at Zero","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-decouples-from-nasdaq-40-day-correlation-now-stands-at-zero.htm","publishDate":"2024-01-09T07:32:56","id":19526,"type":null,"title":"Bitcoin Decouples from Nasdaq, 40-Day Correlation Now Stands at Zero","category":["Bitcoin News "],"content":["Bitcoin (BTC) has broken free from its historical correlation with Nasdaq (NDX), with the 40-day correlation dropping to zero.","For most of the past four years, BTC had been moving in sync with the tech-heavy equity index on Wall Street. ","However, according to data analyzed by research provider Fairlead Strategies, the 40-day correlation between the two now stands at zero, ","Correlation values are determined using a mathematical formula that examines the price movements of both the index and BTC over time. ","A correlation above 0.5 indicates a moderately strong positive relationship, with readings above 0.70 suggesting a robust connection. ","Conversely, negative figures below -0.5 indicate a lack of correlation.","The positive correlation between Bitcoin and Nasdaq has been consistently strong since early 2020, reaching a peak of 0.8 during the 2022 crypto bear market. ","The recent decoupling can be attributed to the crypto market’s focus on the anticipated launch of a spot BTC exchange-traded fund (ETF) in the United States. ","The Securities and Exchange Commission (SEC) is expected to make decisions on nearly a dozen spot ETF applications by January 10, potentially leading to broader adoption of the asset class.","This breakdown in correlation means that Bitcoin can now serve as a diversification tool within investment portfolios. ","Fairlead Strategies predicts that BTC will remain independent from Nasdaq for the foreseeable future.","“We believe correlations between bitcoin and the NDX will likely remain low in the coming months, given the potential events such as the approval of a spot bitcoin ETF and the halving in April,” noted Fairlead analysts, led by founder and managing partner Katie Stockton, in a client report on Monday. ","“Risk assets generally exhibit lower correlations during bull markets compared to bear markets.”","On Monday, Bitcoin surged above the $47,000 mark for the first time since April 2022. ","The surge was primarily driven by the growing anticipation of a landmark decision on the approval of a spot-based Bitcoin ETF in the United States.","The excitement around this potential development has led to a sharp increase in Bitcoin’s value, with its price jumping from $43,200 to a 19-month high of $47,190.","Bloomberg analysts are increasingly optimistic about the approval of a spot Bitcoin ETF in the United States, with the odds now exceeding 90%. ","In a recent post, Bloomberg ETF analyst Eric Balchunas commented on the likelihood of the Securities and Exchange Commission (SEC) rejecting proposals following a flurry of updated filings. ","Balchunas stated that he would assign a mere 5% chance of rejection, leaving a small possibility open for such outcomes. "],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Nasdaq (NDX","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NDX","content":"ORGANIZATION"},{"type":"$43,200","content":"MONEY"},{"type":"January 10","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"$47,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Katie Stockton","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$47,190","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","Bitcoin Price","Nasdaq"],"authors":["Ruholamin Haqshanas"]}