{"summary":"D3 Global, which aims to merge the utility of web3 with existing internet infrastructure, announced it has raised $5 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249236\/shima-capital-backs-domain-name-startup-d3-global-in-5-million-round","publishDate":"2023-09-05T11:44:30","id":1952,"type":null,"title":"Shima Capital backs domain name startup D3 Global in $5 million round","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">D3 Global, a startup endeavoring to merge the utility of web3 with existing internet infrastructure, has raised $5 million in a seed funding round led by Shima Capital with participation from Arthur Hayes' Maelstrom, among others.<\/span>","<span data-v-f87c67ca=\"\">The company said it possesses \"patent-pending technology\" which can bring added interoperability to both web2 and web3 versions of the internet while creating more utility and security. D3 also said it plans to \"apply for and acquire new Top Level Domains during ICANN's upcoming application window to offer secure identities that are natively supported on all browsers and devices.\"<\/span>","<span data-v-f87c67ca=\"\">Top Level Domains are mostly managed by ICANN, or the I<\/span><span data-v-f87c67ca=\"\">nternet Corporation for Assigned Names and Numbers.<\/span>","<span data-v-f87c67ca=\"\">\"Our vision extends far beyond the traditional utility of domain names as mere website addresses. We aim to fully utilize blockchain technology to offer domains that serve as secure digital identities,\" said D3 Global co-Founder and CEO Fred Hsu.<\/span>","<span data-v-f87c67ca=\"\">D3's investors appear confident the company will be able to merge web3's focus on interoperability and digital ownership with traditional internet infrastructure.<\/span>","<span data-v-f87c67ca=\"\">The company \"is uniquely positioned to revolutionize the domain name industry in this new era of web3 and interoperability with what we consider as the real metaverse, ICANN-accredited domains that represent digital property rights,\" said Yida Gao, a managing partner at Shima Capital.<\/span>","<span data-v-f87c67ca=\"\">D3 is also launching an on-chain marketplace for domains, which it said includes the tokenization of over 1,000 top level domains.<\/span>","<span data-v-f87c67ca=\"\">Other investors in D3's seed round included Lightshift, Dispersion Capital, VentureSouq and Infinite Capital and Identity Digital founder Paul Stahura, the company said in a statement.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yida Gao","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Corporation for Assigned Names and Numbers","content":"ORGANIZATION"},{"type":"Paul Stahura","content":"PERSON"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Infinite Capital and Identity Digital","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"Dispersion Capital","content":"ORGANIZATION"},{"type":"ICANN","content":"ORGANIZATION"},{"type":"Fred Hsu","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["RT Watson","The Block"]}