{"summary":"South Korea Seeks Regulation Against Crypto Mixers Citing Illegal Use Cases","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korea-seeks-regulation-against-crypto-mixers-citing-illegal-use-cases.htm","publishDate":"2024-01-15T15:43:01","id":19531,"type":null,"title":"South Korea Seeks Regulation Against Crypto Mixers Citing Illegal Use Cases","category":["Blockchain News "],"content":["South Korean regulators seek to introduce new laws that would sanction the use of cryptocurrency mixers in the country to curb the rate of illicit financial activities.","According to local news outlets, the Financial Intelligence Unit is considering rolling out new regulations similar to those of the United States for digital asset mixing services.","The reasons given for the incoming regulations are due to abuse of the service from bad actors engaging in money laundering and other illegal services.","Officials from the agency say this is a growing concern because there is currently no law to sanction the activities of mixers in the country.","“We sympathize with the problem that there is a high risk of money laundering through mixers… If  virtual assets are transferred to a mixer, tracking funds and monitoring crimes is difficult.”  ","As a result, the financial watchdog revealed that the need to restrict and cover transactions by coin mixers is being discussed, adding that talks began in South Korea when the United States took action against digital assets mixing services.","Per the report, mixers have limited authorities from tracing stolen funds of several hackers as they move them around on exchange without the platforms being able to flag them.","","While incidents using crypto mixers are reported globally as hacks and bridge attacks are recorded, some local cases have made regulators a lot more concerned about investor protection and going a step ahead of bad actors.","The recent Orbit Bridge incident described as the first hack to 2024 that saw losses of over $81 million is an example of the use of crypto mixers to mask transactions to numerous wallets.","🥷🏽 South Korean Agencies Investigate $82M Orbit Bridge Hack After Reports of Lazarus Group’s Involvement","Orbit Bridge, the main bridge for the Claytont ecosystem, was exploited for nearly $82 million hours before New Year’s Eve.#CryptoNews #newshttps:\/\/t.co\/PZ3Ud5IHAJ","— Cryptonews.com (@cryptonews) January 5, 2024","","Although without mixers, there would still be a level of digital asset scams, regulators argue that the presence of mixing services makes it easier for bad actors to carry out the attack and mine proceeds of the crime, reducing official traces.","Hwang Seok-jin, a Professor at the Graduate School at Dongguk University stated that every hacker will transfer assets into cash through exchanges, and as a result, they resort to coin mixers.","“It is meaningful to convert virtual assets stolen through hacking into cash. To do so, they must go through a virtual asset exchange, so it appears that they are trying to ensure that transactions using mixers are blocked from the exchange. Preemptive response to virtual asset-related crimes is positive in terms of securing the soundness of the market.”  ","The United States Treasury Department announced sanctions against Tornado Cash in 2022 leading to a lengthy legal battle and in 2023 more digital asset mixers citing money laundering activities as hackers utilize these services to move stolen funds.","🆕 🚫 The US Department of the Treasury’s Office of Foreign Assets Control added Ethereum-powered crypto mixing service Tornado Cash to its Specially Designated Nationals list, effectively banning Americans from using this mixer.","— Cryptonews.com (@cryptonews) August 8, 2022","","Cryptocurrency mixers are services that collate assets together before sending them to recipients to avoid traces from third parties."],"entity":[{"type":"August 8, 2022","content":"DATE"},{"type":"Dongguk University","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"January 5, 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Graduate School","content":"ORGANIZATION"},{"type":"United States Treasury Department","content":"ORGANIZATION"},{"type":"$82 million","content":"MONEY"},{"type":"US Department of the Treasury’s Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"South Korean Agencies Investigate $82M Orbit Bridge Hack After Reports of Lazarus Group’s Involvement","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"$81 million","content":"MONEY"}],"hashtag":["Crypto mixers","South Korea","tornado cash"],"authors":["David Pokima"]}