{"summary":"Judge Condemns SEC’s Handling of DEBT Box Case, Ordered to Reimburse Legal Costs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/debt-box-case-judge-sec-handling-orders-reimbursement-legal-fees.htm","publishDate":"2024-03-19T04:43:09","id":19539,"type":null,"title":"Judge Condemns SEC’s Handling of DEBT Box Case, Ordered to Reimburse Legal Costs","category":["News "],"content":["The US Securities and Exchange Commission was sanctioned for its controversial restraining order against crypto firm DEBT Box, a March 18 court filing showed. In a rare rebuke, Judge Robert Shelby slammed the agency on Monday, calling its actions toward DEBT Box a “gross abuse of power.”","Shelby penalized the agency and ordered it to cover DEBT Box’s legal fees stemming from the restraining order.","The SEC sued DEBT Box in July 2023, accusing the firm of defrauding investors of at least $49m through a scheme involving “node licenses.”","According to the lawsuit, the licenses supposedly entitled holders to profits from mining 11 different cryptocurrencies. But the SEC claims these tokens were never actually mined, raising questions about the legitimacy of the entire operation.","The DEBT Box case took a surprising turn when the defendants challenged the SEC’s claims. The regulator had secured a temporary restraining order to freeze the crypto platform’s assets. But the defendants accused them of twisting the truth to obtain it.","Judge Robert Shelby then demanded the SEC explain its actions. Faced with scrutiny, the SEC’s lawyers acknowledged mistakes but pleaded with the judge to avoid formal punishment.","Faced with criticism, the SEC in January opted to withdraw the lawsuit entirely. However, Shelby refused to dismiss the case “without prejudice,” meaning the SEC couldn’t simply refile the lawsuit later.","The SEC’s move to withdraw didn’t convince Shelby. He pointed out that its misrepresentations weren’t isolated statements. Rather, every evidence the SEC presented to freeze DEBT Box’s assets turned out to be “false, mischaracterized, and misleading.”","In December, SEC enforcement chief Gurbir Grewal issued an apology to Shelby for inaccuracies in the case. He assured the court that measures would be implemented to prevent similar errors in the future.","Among these steps, Grewal announced mandatory training sessions starting Jan. 2024. These are aimed at ensuring adherence to proper standards when pursuing emergency relief.","The response from crypto stakeholders indicates that the result of this case could serve as a focal point, emphasizing the SEC’s assertive approach to crypto assets during Gary Gensler’s tenure as chairman. Industry sentiment suggests Gensler’s administration prioritizes legal action over transparent regulations.","The DEBT Box case is just one example of the numerous civil lawsuits initiated by the federal agency in its attempt to enforce compliance within the crypto sector.","Last month, several Republican senators voiced criticism against Gensler for what they perceived as unethical behavior in how the agency managed the DEBT Box case.","“The public must have well-placed confidence in the Commission’s enforcement actions, its motives for undertaking them, and its professionalism when carrying them out,” the senators said in a letter. “This trust is undermined, and your mission compromised, by episodes like the DEBT Box case.”"],"entity":[{"type":"Jan. 2024","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"March 18","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Robert Shelby","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Grewal","content":"PERSON"},{"type":"$49m","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Shelby","content":"PERSON"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"July 2023","content":"DATE"}],"hashtag":["Debt Box","SEC"],"authors":["Shalini Nagarajan"]}