{"summary":"Web3 Startups Raise Nearly $1.9B in Q1 2024 Despite Overall Downtrend in Crypto VC Interest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-startups-raise-nearly-1-9b-in-q1-2024-despite-overall-downtrend-in-crypto-vc-interest.htm","publishDate":"2024-04-18T16:13:40","id":19532,"type":null,"title":"Web3 Startups Raise Nearly $1.9B in Q1 2024 Despite Overall Downtrend in Crypto VC Interest","category":["Altcoin News "],"content":["Venture capital funding for cryptocurrency and blockchain projects has experienced its first quarterly rise since 2021. ","Crunchbase data published today reveals that Web3 startups managed to secure just under $1.9 billion in funding across 346 deals in the first quarter of 2024. ","This marks a significant 58% increase from the previous quarter, offering a glimmer of hope amidst the lingering downward trajectory of overall crypto VC interest.","The latest surge in funding can be attributed to investors with a more long-term perspective on Web3, in contrast to the hype-driven “tourist investors” who were prevalent in recent years. ","According to Chris Metinko, the author of the report, these investors are currently focusing their attention on the AI sector, indicating a shift in investment strategy. ","Metinko explains that there is a growing interest in supporting the underlying infrastructure of the decentralized internet, rather than solely focusing on crypto wallets and lenders, which garnered substantial investments during the peak period of 2021 to 2022.","Although big funding rounds were relatively rare in Q1, a few notable investments stood out. ","Exohood Labs, a company merging AI, quantum computing, and blockchain, secured a $112 million seed round at a valuation of $1.4 billion. ","EigenLabs, an Ether token “restaking” platform, raised $100 million in a Series B led by a16z crypto. ","Additionally, Freechat, a decentralized social network built on blockchain technology, secured $80 million in a Series A round. ","These investments, along with others, contributed to the rise in valuations and the emergence of four new Web3 unicorns in Q1.","Despite the recent progress, the future of Web3 remains uncertain. ","Metinko suggests that the next few quarters will be crucial for determining the industry’s direction. ","While investors anticipate a bounce-back in investment as the decentralized internet continues to develop, it may take another year for venture capital activity to stabilize after the exuberance of 2021. ","Factors such as the approval of U.S. spot Bitcoin exchange-traded funds and the upcoming Bitcoin halving could also impact the market, as the prices of Bitcoin and Ether have been on the rise.","A recent example of significant funding in the Web3 space is Monad Labs’ successful round, which secured $225 million led by Paradigm. ","Monad Labs is a layer-1 blockchain compatible with Ethereum that offers faster transaction processing. ","This funding round evokes memories of the golden era of crypto funding in 2021-2022 when L1 solutions attracted substantial investments.","Earlier this year, Balance, a digital asset custodian based in Canada, has revealed that it has once again achieved $2 billion in assets under custody (AUC) amid the recent recovery in crypto markets. ","Likewise, Korea Digital Asset (KODA), the largest institutional crypto custody service in South Korea, has seen a remarkable growth in crypto assets under its custody. ","Just recently, the company revealed that the value of these crypto assets under its custody expanded by nearly 248% in the second half of 2023.","According to analysts at Bernstein Research, crypto funds could reach a staggering $500 billion to $650 billion within the next five years, a significant leap from the current valuation of approximately $50 billion."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"$50 billion","content":"MONEY"},{"type":"$112 million","content":"MONEY"},{"type":"$1.9 billion","content":"MONEY"},{"type":"$500 billion","content":"MONEY"},{"type":"Bernstein Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"second half of 2023","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"$1.4 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"Korea","content":"LOCATION"},{"type":"248%","content":"PERCENT"},{"type":"Chris Metinko","content":"PERSON"},{"type":"$650 billion","content":"MONEY"},{"type":"58%","content":"PERCENT"},{"type":"$225 million","content":"MONEY"},{"type":"Balance","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["funding","Venture Capital"],"authors":["Ruholamin Haqshanas"]}