{"summary":"Cardano Price Prediction as ADA Drops Out of Top 10 Crypto Rankings – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-prediction-as-ada-drops-out-of-top-10-crypto-rankings-whats-going-on.htm","publishDate":"2024-04-09T12:43:56","id":19547,"type":null,"title":"Cardano Price Prediction as ADA Drops Out of Top 10 Crypto Rankings – What’s Going On?","category":["Price Predictions "],"content":["ADA has fallen by 1% today, with the Cardano price slipping to $0.6044 as the wider market also declines by 1% in the past 24 hours.","Cardano’s drop has seen it fall to 11th in the market cap rankings, with its former place now occupied by Toncoin, which has been on a rampage thanks to Tether partnership rumors.","And while ADA remains up by 3.5% in the past week, it’s actually down by 10% in a fortnight and by 17% in the last 30 days.","However, its fundamentals are as strong as ever, and with the market potentially close to another bull run, the Cardano price could rally again soon enough.","Despite today’s slip, Cardano’s chart and indicators remain in a relatively promising position, with the coin potentially on course to rebound again very soon.","After dropping below 50 this morning, ADA’s relative strength index (purple) has begun modestly climbing back up.","This suggests that the coin could recover in the very near future, something which is also indicated by its 30-day average (orange).","The 30-day has moved sideways this morning, indicating that the coin isn’t that weak at the moment, and perhaps won’t fall much further before recovering.","ADA’s support level (green) also reinforces this suspicion, given that it has been rising consistently since the first week of April.","Unfortunately, Cardano’s trading volume does look particularly uninspiring, at around $400 million today.","To put this in some perspective, PEPE has a volume of just over $600 million today, while Toncoin – which has leapfrogged ADA – is at $850 million.","This means that ADA is very much an unloved child at the moment, with low demand a big part of the reason why it has slipped in the market rankings.","Seeing all the dunking on Cardano makes me smile a bit. We are holding all the cards as an ecosystem. We have the best path for scalability, governance, and innovation. We also have the best community.","Chang is coming soon as measured by progress on SanchoNet. Ouroboros Leios is… pic.twitter.com\/11RTXaDrZU","— Charles Hoskinson (@IOHK_Charles) April 7, 2024","","Despite this, Cardano’s fundamental position hasn’t changed, with the platform growing still steadily as a blockchain network.","Its total value locked stands at close to $400 million, which is up from $142 million exactly a year ago.","It’s in this context that it has seen more app launches, with 164 projects now running on Cardano.","And with the blockchain awaiting several significant updates (e.g. Chang), ADA’s fundamentals are only going to improve in the coming months.","As such, the Cardano price could reach $1 by the summer, and potentially return to $2 by the end of the year.","Given that ADA is such a slow burner, many traders may prefer to expand their portfolios into lower cap tokens, which can often have more potential upside.","And while many low-cap coins are of correspondingly low quality, some are showing some real potential at the moment, particularly certain presale coins.","A great example of this is Slothana (SLOTH), a Solana-based meme token that has attracted more than $10 million in its sale.","","This makes Slothana one of the most successful presales of 2024 so far, with investors being interested in the new coin for a variety of reasons.","First of all, Slothana’s team also developed the successful Smog (SMOG) token, which listed earlier this year and made big gains in relation to its sale price.","Something similar is also likely to happen with SLOTH, which has already gained more than 14,000 followers on X.","This figure suggests that its playful use of memes has helped it spread via word of mouth, with the token already very popular for a coin that hasn’t even launched.","Investors can join its sale by going to the Slothana website and connecting a compatible wallet (e.g. Phantom, Solflare).","Traders can exchange SOL for the token at a rate of 1 SOL for 10,000 SLOTH, which is equal to roughly $0.019393 per coin.","🚀 Get ready to blast off with Slothana! 🌿 We're gearing up for launch and this is your last chance to grab your $SLOTH 🌕 Don't miss out on the action as we prepare to announce our official launch date. Watch this space. #slothana #memecoin","— Slothana (@SlothanaCoin) April 8, 2024","","And as a SOL-based meme token, Slothana’s launch comes at a time when the market’s appetite for new and exciting meme coins is near a peak.","It could, therefore surge dramatically once it lists on trading platforms in the next few weeks.","Visit Slothana Now",""],"entity":[{"type":"50 this morning","content":"TIME"},{"type":"this morning","content":"TIME"},{"type":"$SLOTH","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$600 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$2","content":"MONEY"},{"type":"17%","content":"PERCENT"},{"type":"$142 million","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"3.5%","content":"PERCENT"},{"type":"Cardano","content":"PERSON"},{"type":"today","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"April 8, 2024","content":"DATE"},{"type":"Slothana","content":"LOCATION"},{"type":"$0.6044","content":"MONEY"},{"type":"$850 million","content":"MONEY"},{"type":"$0.019393","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Toncoin","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"the first week of April","content":"DATE"},{"type":"April 7, 2024","content":"DATE"}],"hashtag":["ADA","Cardano","Price Prediction"],"authors":["Simon Chandler"]}