{"summary":"McDonald’s Hong Kong Collaborates with The Sandbox to Launch McNuggets Land in Web3","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mcdonalds-hong-kong-collaborates-with-sandbox-launch-mcnuggets-land-web3.htm","publishDate":"2023-07-24T10:34:00","id":19543,"type":null,"title":"McDonald’s Hong Kong Collaborates with The Sandbox to Launch McNuggets Land in Web3","category":["Blockchain News "],"content":["McDonald’s Hong Kong collaborated with The Sandbox to create McNuggets Land, an immersive Web3 experience to commemorate the 40th anniversary of Chicken McNuggets. ","This virtual world offers users an immersive journey through a hidden factory and a historical tour of the popular chicken snack.","McNuggets Land also offers quests and challenges to gamers that stand to win The Sandbox utility token. ","These tokens can be utilized to purchase virtual goods and customize avatars within the platform. ","Moreover, users from Hong Kong have the opportunity to win exclusive 365-day free Chicken McNuggets coupons, redeemable at any of the chain’s restaurants.","Users can join the virtual world with just an email address.","McDonald’s is not alone in offering a metaverse experience to its users. Several companies are using virtual world experience to offer  online loyalty programs, to market their products to a younger audience.","Sebastien Borget, the co-founder and COO of The Sandbox, expressed his excitement about the collaboration with McDonald’s, believing that it propels The Sandbox to new heights and brings them closer to achieving mass adoption of the metaverse, which has been their ultimate goal.","Notably, McDonald’s is not in the Web3 world, the fast food chain has explored the space before.","In October last year, McDonald’s announced to accept bitcoin USDT payments in Lugano, Switzerland in collaboration with payment facilitator GoCrypto.","In 2021, McDonald’s released a collection of 188 non fungible tokens (NFTs) to celebrate its 31st anniversary in the Chinese market","The partnership between McDonald’s and The Sandbox highlights a growing trend of global brands venturing into the virtual world. ","The Sandbox has already established collaborations with numerous prominent companies, including Warner Music Group, Ubisoft, Gucci, and Adidas.","Entertainment icons like Snoop Dogg, The Smurfs, Care Bears, and The Walking Dead, among others have also collaborated with the Web3 firm.","With the recent introduction of self-publishing on The Sandbox platform, partners can now fully explore the potential of the metaverse and monetize their brand by making their unique customer experiences widely available.","This feature allows brands to launch experiences directly on the platform’s map, enhancing engagement and interaction with their audience.","McDonald’s decision to venture into McNuggets Land with The Sandbox is a testament to the increasing importance of the metaverse in brand-building strategies. On the occastion McDonald’s Hong Kong CEO Randy Lai said:","“Rooted in Hong Kong for 48 years, McDonald’s has always strived to deliver innovative experiences and happy moments, we are excited to collaborate with The Sandbox to provide fun-filled Web3 metaverse game experience themed on McDonald’s for our customers.” \n ",""],"entity":[{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"Adidas","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"Warner Music Group","content":"ORGANIZATION"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"Sebastien Borget","content":"PERSON"},{"type":"Randy Lai","content":"PERSON"},{"type":"Care Bears","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Lugano","content":"LOCATION"},{"type":"McDonald’s","content":"ORGANIZATION"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":["NFTs","Web3"],"authors":["Jai Pratap"]}