{"summary":"Cardano Investors Swing to This Exciting Virtual Reality ICO, Chasing Potential 2,300% Profits","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-investors-swing-to-this-exciting-virtual-reality-ico-chasing-potential-2300-profits.htm","publishDate":"2024-04-26T21:51:58","id":19548,"type":null,"title":"Cardano Investors Swing to This Exciting Virtual Reality ICO, Chasing Potential 2,300% Profits","category":["Industry Talk "],"content":["Cardano’s price is currently stuck in a downtrend from its 2024 highs above $0.80. The 21DMA is also providing strong resistance. Last at $0.468, ADA is down over 10% from earlier weekly highs.","As the Cardano (ADA) price struggles to gain traction, investors are turning to a new virtual reality ICO called 5thScape (5SCAPE) to chase potential 2,300% profits.","The cryptocurrency is down more than 40% from its March highs, with most other altcoins also suffering as macro headwinds have picked up.","The latest US Core PCE inflation data emphasized that core price pressures in the US are still uncomfortably high, supporting the notion that the Fed will wait until later in 2024 before cutting interest rates.","Here is Powells favourite inflation gauge.","PCE Core Service Less Housing MoM up almost 0.6%","TOO much.. End of discussion pic.twitter.com\/yEBlWeV1MA","— Andreas Steno Larsen (@AndreasSteno) February 24, 2023",""," ","Unsurprisingly, US bond yields and the US dollar are close to multi-month highs.","In addition, fading inflows into spot Bitcoin ETFs have recently been a major altcoin headwind, with cryptocurrencies like Cardano having been at the forefront of the battering.","While ADA is over 15% up from earlier monthly lows, risks are still tilted to the downside.","There is a good chance that ADA will mount a more sustained recovery in the months and quarters ahead.","Most assume that we are still in the middle of a crypto bull market.","Continued disappointing growth in Cardano’s web3 ecosystem, which suggests a lack of adoption, is concerning.","As per DeFi Llama, Cardano’s total value locked (TVL) was last $368 million. TVL refers to the value of crypto locked in smart contracts on a blockchain.","Cardano’s TVL currently ranks 26th, suggesting the ADA price could be substantially overvalued.","After all, Cardano is the 10th largest crypto, with a market cap of $21.5 billion, according to CoinMarketCap.","To put Cardano’s potential overvaluation into some context, its TVL is less than PulseChain, Ultron, MultiverseX, and Thorchain.","But its market cap valuation is at least 10x these rivals.","That’s not to say that ADA will see a 90% price drop. It may struggle to keep pace with other major cryptos that enjoy much more adoption, like Bitcoin and Ethereum, however.","Same repetitive but useless slogan of Cardanzos: DYOR","I did.","50K active users daily max\n4.4M wallets\n350M TVL\n88M transactions\n200M liquidity in USDM\n… this is RIDICULOUS","Tell me something I don't know and that changes my mind. Cardano is a ghost chain.","— Hossa 182 (@182Hossa) April 18, 2024","","Understandably, Cardano investors are turning to a new virtual reality ICO called 5thScape (5SCAPE), chasing projects with higher potential upside.","5thScape has been attracting a lot of attention recently, with investors betting it will become a market leader.","🌟 Unlock new dimensions with 5th Scape! Dive into adrenaline-pumping battles, precision archery, and high-speed racing—all within the limitless virtual realm. Holding 5SCAPE tokens unlocks exclusive benefits like free games, discounts, and seamless in-world transactions.\nThe… pic.twitter.com\/LNO30KXRPW","— 5th Scape (@5th_scape) April 20, 2024","","5thScape is a first-of-its-kind crypto-powered VR\/AR project, and its presale has already raised over $5.6 million.","The token is priced at $0.00327, a steep discount from its planned launch price of $0.1. Investors who get involved now can lock in potential gains of 200%.","Given its total token supply of 5.1 billion, investors who get in now are essentially buying into the project at a market cap of $16 million.","Considering 5thScape could become a major market leader in its VR\/AR niche,  its native token, 5SCAPE, could be 2024’s best crypto presale.","🎮 Exciting News! 🎮\nGet an exclusive sneak peek into the heart-pounding world of MMA Cage Conquest! 🥊🔥 Our virtual reality experience takes you from gritty training sessions to the roaring crowds of iconic MMA arenas. It’s more than just a fight; it’s your journey to become… pic.twitter.com\/BLq09Nbk5D","— 5th Scape (@5th_scape) April 23, 2024","","As the platform gains traction and organic demand for 5SCAPE comes in, there is a chance that it could one day become a $500 million market cap token.","$5SCAPE token can be bought today with ETH, MATIC, USDT, BNB, or card.","Eighty percent of the total token supply is available for purchase in the presale.","Buy 5SCAPE Here","See below why 5thScape is popular crypto presale analyst Michael Wrubel’s top AR & VR crypto for 2024.","",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Hossa","content":"PERSON"},{"type":"Michael Wrubel","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$0.1","content":"MONEY"},{"type":"$0.00327","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"2,300%","content":"PERCENT"},{"type":"$0.80","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"$5.6 million","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"MMA","content":"ORGANIZATION"},{"type":"$368 million","content":"MONEY"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Cardano","content":"LOCATION"},{"type":"0.6%","content":"PERCENT"},{"type":"200%","content":"PERCENT"},{"type":"Ultron","content":"LOCATION"},{"type":"April 18, 2024","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"$21.5 billion","content":"MONEY"},{"type":"$5SCAPE","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Andreas Steno Larsen","content":"PERSON"},{"type":"April 20, 2024","content":"DATE"},{"type":"April 23, 2024","content":"DATE"},{"type":"ADA","content":"ORGANIZATION"},{"type":"February 24, 2023","content":"DATE"},{"type":"$0.468","content":"MONEY"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$16 million","content":"MONEY"},{"type":"AR & VR","content":"ORGANIZATION"}],"hashtag":["ADA","Cardano","virtual reality crypto"],"authors":["Joel Frank"]}