{"summary":"Robert Kiyosaki Says Dollar Decline is Imminent, Advocates BTC, ETH Investments","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robert-kiyosaki-says-dollar-decline-is-imminent-advocates-btc-eth-investments.htm","publishDate":"2024-05-10T09:04:13","id":19545,"type":null,"title":"Robert Kiyosaki Says Dollar Decline is Imminent, Advocates BTC, ETH Investments","category":["Bitcoin News "],"content":["Rich Dad Poor Dad author and renowned investor Robert Kiyosaki believes that the US dollar is losing value and expressed his support over crypto investments.","During a recent episode of the podcast “The Rich Dad Channel,” Kiyosaki discussed the importance of portfolio diversification including cryptocurrencies. Speaking to Andy Shechtman, CEO of Miles Franklin Precious Metals, Kiyosaki advocated investors to turn to gold, Bitcoin and Ethereum.","He stressed that the dollar decline is imminent, which is why accumulating alternative investments is vital to be prepared for adverse financial conditions. “Our money is fake,” he noted.","“It’s a reason to buy gold, silver, Bitcoin, and all this because our currency is screwed up now, it’s going to get worse because our debt keeps going up.”","Kiyosaki revealed that he bought Ethereum “for the same reason.”","Further, he criticized the lack of financial literacy education in schools, particularly when there is an already dire financial situation. Kiyosaki also pointed out the absence of counterparty risk issues when it comes to borrowing money.","“If I borrow money, who’s the guy to pay me back? And gold and silver – you don’t need that – the same as Bitcoin, you have no counterparty risk.”","","The bestselling author in March, described the world’s largest crypto – Bitcoin – as “the perfect asset at the right time.” However, he is also having a cautious approach to the asse-class, doubting its potential to be scam or Ponzi scheme.","Kiyosaki has maintained a bullish stance on Bitcoin over the years. In November 2023, the financial educator said that Bitcoin is the “best protection” against hyperinflation because it is people’s money. He drew a historical comparison and urged his followers to consider Bitcoin as a means of protection against hyperinflation.","However, he wasn’t keen on the spot Bitcoin ETFs, claiming that these financial products are apt for institutional investors. He rather favors direct ownership of physical assets due to his entrepreneurship pathway.","Kiyosaki has invested in a mix of assets like gold, silver, Bitcoin, which according to him are bargains today."],"entity":[{"type":"March","content":"DATE"},{"type":"Kiyosaki","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Robert Kiyosaki","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Kiyosaki","content":"ORGANIZATION"},{"type":"Andy Shechtman","content":"PERSON"},{"type":"Miles Franklin Precious Metals","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Robert Kiyosaki"],"authors":["Sujha Sundararajan"]}