{"summary":"‘NFTs May Be New, but This Criminal Scheme Isn’t’: Ex-OpenSea Head Arrested for NFT Insider Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nfts-may-be-new-but-this-criminal-scheme-isnt-ex-opensea-head-arrested-for-nft-insider-trading.htm","publishDate":"2022-06-02T09:30:00","id":19556,"type":null,"title":"‘NFTs May Be New, but This Criminal Scheme Isn’t’: Ex-OpenSea Head Arrested for NFT Insider Trading","category":["News "],"content":[" ","Nathaniel Chastain, former Head of Product at OpenSea, the largest non-fungible token (NFT) marketplace, has been arrested and charged with wire fraud and money laundering in connection with insider trading in NFTs.","On Wednesday, prosecutors in New York’s Southern District accused the 31-year-old of “using confidential information about what NFTs were going to be featured on OpenSea’s homepage for his personal financial gain.”","Chastain was responsible for selecting NFTs that would be featured on OpenSea’s homepage as part of his employment. Typically, the price of an NFT would drastically increase after it is featured on the homepage.","Being aware of this, according to the Justice Department, Chastain allegedly bought such NFTs and then dumped them shortly after they had been featured on the homepage — for a substantial profit.","The DOJ said that Chastain used OpenSea’s confidential information between June 2021 and September 2021 to secretly purchase “dozens of NFTs” just before they were featured on the homepage and swiftly sell them “at profits of two- to five-times.”","Chastain has reportedly purchased the NFTs using several secret wallets and anonymous accounts on OpenSea.","According to US Attorney Damian Williams,","“NFTs might be new, but this type of criminal scheme is not. As alleged, Nathaniel Chastain betrayed OpenSea by using its confidential business information to make money for himself.” ","As reported, an anonymous thread on Twitter in mid-September first revealed that Chastain might be using insider information to purchase NFTs.","Subsequently, OpenSea confirmed that they learned one of their employees purchased items using confidential information, without disclosing if it was Chastain.","“As the world’s leading Web3 marketplace for NFTs, trust and integrity are core to everything we do. When we learned of Nate’s behavior, we initiated an investigation and ultimately asked him to leave the company. His behavior was in violation of our employee policies and in direct conflict with our core values and principles,” a spokesperson for OpenSea said in an emailed comment to Cryptonews.com this week.","Meanwhile, the incident led to a discussion around the need for decentralized NFT marketplaces.","“Whether or not there is truth to the accusations of insider trading—OpenSea needs to use this as a catalyst to build a more decentralized platform,” said Compound Finance co-founder Robert Leshner at the time. “Centralized systems and their users are vulnerable to bad decisions by humans.”","Bullish on decentralized NFT marketplaces, few","____","Learn more: \n– NFT Insider Trading On OpenSea Highlights Benefits of Decentralization\n– OpenSea’s Trading Volume Remains in a Downtrend Amid Recent Attacks\n\n– Decentralization in Crypto Is a Hard to Measure Ideal\n– Decentralization Debate Heats Up Again as MetaMask, OpenSea Block Users\n\n– OpenSea’s New Marketplace Protocol Could Become ‘Uniswap Moment’ of NFTs\n– Another Expensive NFT Gets Mistakenly Sold at Large Discount – How Does That Happen?\n____\n(Updated on June 3 at 18:08 UTC with a comment from OpenSea.)"],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"mid-September","content":"DATE"},{"type":"Nate","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"June 3","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Compound Finance","content":"ORGANIZATION"},{"type":"OpenSea Block Users\n\n– OpenSea’s New Marketplace Protocol Could Become ‘Uniswap Moment’ of NFTs\n– Another Expensive NFT","content":"ORGANIZATION"},{"type":"Chastain","content":"PERSON"},{"type":"OpenSea Highlights Benefits of Decentralization\n– OpenSea’s Trading Volume Remains","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Nathaniel Chastain","content":"PERSON"},{"type":"US Attorney Damian Williams","content":"ORGANIZATION"},{"type":"Robert Leshner","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"New York’s Southern District","content":"LOCATION"}],"hashtag":["Decentralization","Legal","Manipulation","NFT","Non-fungible tokens","Opensea"],"authors":["Ruholamin Haqshanas"]}