{"summary":"Rwanda’s CBDC Taking Shape? Central Bank Explores Tokenized Retail CBDC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/rwandas-cbdc-taking-shape-central-bank-explores-tokenized-retail-cbdc.htm","publishDate":"2024-05-09T11:23:43","id":19558,"type":null,"title":"Rwanda’s CBDC Taking Shape? Central Bank Explores Tokenized Retail CBDC","category":["Altcoin News "],"content":["Rwanda is studying the feasibility of adopting a central bank digital currency (CBDC), exploring benefits, risks and practicalities of implementing a retail CBDC.","The National Bank of Rwanda (BNR) released a feasibility report on Wednesday, assessing possible opportunities for a CBDC in Rwanda. The central bank is adopting latest innovative technologies, and the CBDC is curated to local norms and conditions.","“The feasibility study finds that there are opportunities for improvements in the payments landscape of Rwanda,” the report read. “The identified Sweet Spots are well-positioned to address these opportunities.”","The bank pointed to four “sweet spots” for CBDC “based on stronger evidence and higher certainty of achievability than the other opportunities.”","This includes increasing resilience against power or network outages, improving innovation and competition among other rival CBDCs, contributing to achieving a cashless economy and developing faster, cheaper and transparent international remittances.","BNR also laid out challenges involved in introducing a CBDC in the Central African nation. “The risks that the study identifies with a high level of concern and few mitigation options are related to CBDC adoption by the public, financial service providers, and merchants.”","","Rwanda bank stressed on clearly explaining and articulating CBDC in a simple manner to Rwandans. It also noted that the risk of CBDC adoption is a “complex mater,” which has to be addressed.","“CBDC should provide a frictionless user experience by combining the best of both private and public currency worlds,” it added. “Alternatively, the CBDC user experience could mimic mobile money. This requires careful balancing, since the BNR should not be seen as a competitor to EMIs.”","Further, to address these issues, the central bank of Rwanda recommended a token-based CBDC model with open programmability. It also proposed an offline-capable CBDC. It would use Bluetooth or Near Field Communication (NFC) “that are not reliant on Internet connectivity.”"],"entity":[{"type":"BNR","content":"ORGANIZATION"},{"type":"National Bank of Rwanda (BNR","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Near Field Communication (NFC","content":"ORGANIZATION"},{"type":"Rwanda","content":"LOCATION"}],"hashtag":["CBDC","Rwanda","Tokenization"],"authors":["Sujha Sundararajan"]}