{"summary":"XRP Falls Short of $1, But This Coin Can Hit $5, Raises $14.5 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-falls-short-of-1-but-coin-can-hit-5-raises-145-million.htm","publishDate":"2023-07-13T20:25:00","id":19553,"type":null,"title":"XRP Falls Short of $1, But This Coin Can Hit $5, Raises $14.5 Million","category":["Altcoin News "],"content":["Judge Analisa Torres issued a verdict on Thursday saying that US fintech company Ripple Labs did not break federal securities law via its sales of XRP on public exchanges, a huge victory for the firm that sent the price of XRP shooting higher.","XRP\/USD was last trading at its highest levels since April 2022 just above $0.80 up around 70% on the day.","The cryptocurrency, which powers the layer-1 XRP Ledger blockchain, topped out close to $0.95, falling short of a test of the $1.0 level.","But XRP is likely to continue to gather bullish momentum in the coming days, as US-based exchanges like Gemini signal that they are open to relisting the token.","Many US exchanges had delisted the exchange after the SEC claimed that XRP was a security back in 2020 as part of its lawsuit against Ripple Labs.","","This is is a huge win for Larsen, Garlinghouse and the XRP community.\n\n1. While the court rules that some of Ripple's \"Institutional Sales\" of XRP were investment contracts and thus, the sale of unregistered securities,\n\n2. Ripple's sales of XRP to \"Programmatic Buyers\"… https:\/\/t.co\/FWSYgO8x3q","While XRP could perform very well in the coming days, weeks and months as confidence returns to the market, crypto degens looking for quick exponential gains might instead want to check out the best opportunities in the meme coin market.","Analysts at Cryptonews.com, who spend a lot of time parsing the meme coin space in order to find the best opportunities, have identified Wall Street Meme’s presale as a potential gem.","Wall Street Memes, one of the internet’s hottest retail investing communities, rose to prominence in the meme stock craze of 2021 and has recently been expanding its relevance in the cryptocurrency space with the presale of its new $WSM token.","The success of the $WSM presale, which has raised $14.5 million in just over one month, isn’t surprising given the size of Wall Street Memes’ community.","Not only are there 523k hyper-engaged community members on its wallstbets Instagram account, there are another 214k on Twitter and more than 100k across its two other Instagram channels, wallstgonewild and wallstbullsnft.","All told, Wall Street Memes has a 1 million-strong social community of degens, which analysts think all but guarantees that the $WSM token will be listed on tier 1 crypto exchanges like Binance.","With 30% of the token supply being held back for community rewards, it can reasonably be expected that airdrops to holders will be a big part of the ecosystem.","Indeed, the first $WSM airdrop is open now. ","Analysts are already predicting big things for Wall Street Memes when it lists on exchanges and you can be a part of it.","Visit Wall Street Memes Here","Wall Street Memes is currently selling for $0.0319 in the presale, but will launch across major exchanges at $0.0337 with a fully diluted market cap of $67.4 million.","But given the clout of the Wall Street Memes investing community, many are predicting it could be the next multi-billion-dollar meme coin.","Let’s say $WSM hits a market cap of $1.8 billion like Pepe Coin did in early May.","That would imply a $WSM token price of $0.9, 26x up versus the exchange launch price.","Wall Street Memes would need to hit a market cap of $10 billion for its token to be worth.","That might be a bit far-fetched.","But as risk appetite continues to return to the crypto space, nothing should be ruled out.","After all, during the last bull market, Shiba Inu (SHIB) hit a market cap of nearly $50 billion.","Buy Wall Street Memes Here","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$1.0","content":"MONEY"},{"type":"April 2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"$0.9","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$50 billion","content":"MONEY"},{"type":"$0.80","content":"MONEY"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Larsen","content":"PERSON"},{"type":"Pepe Coin","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$WSM","content":"MONEY"},{"type":"$67.4 million","content":"MONEY"},{"type":"$14.5 million","content":"MONEY"},{"type":"$0.0337","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$0.0319","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Garlinghouse","content":"PERSON"},{"type":"$0.95","content":"MONEY"},{"type":"$10 billion","content":"MONEY"},{"type":"Wall Street Memes","content":"ORGANIZATION"},{"type":"Analisa Torres","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2020","content":"DATE"}],"hashtag":["Meme coin","Presale","Ripple","SEC","Wall Street Memes","WSM","XRP"],"authors":["Joel Frank"]}