{"summary":"Daily Bitcoin Rune Etchings Plummet by 99% Since April Peak","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/daily-bitcoin-rune-etchings-plummet-by-99-since-april-peak.htm","publishDate":"2024-05-14T05:41:36","id":19550,"type":null,"title":"Daily Bitcoin Rune Etchings Plummet by 99% Since April Peak","category":["Bitcoin News "],"content":["The number of new Runes etched on Bitcoin daily has experienced a drastic decline, falling below 250 for the past six days.","The drop is particularly notable, with only 157 Runes etched on Monday, marking a staggering 99% decrease from the peak witnessed in late April, according to a Dune Analytics dashboard created by RUNES.IS.","The decline follows a highly successful period that occurred a week after the launch, during which an average of 14,700 new Runes were etched each day between April 26 and 30.","This impressive streak included a record-setting 23,061 Runes etched on April 26.","Runes, a new token standard, was introduced at the fourth Bitcoin halving block on April 20.","The protocol enables memecoin and non-fungible token enthusiasts to inscribe and etch their favorite artwork, images, audio, and videos onto the Bitcoin network.","Initially, it provided a much-needed revenue boost for Bitcoin miners seeking to offset the impact of the recent halving.","The block subsidy was halved to 3.125 Bitcoin (BTC), equivalent to $196,800 at current prices.","However, the decline in Rune etchings is evident, with the 157 Runes etched on May 13 contributing a mere $3,835 in transaction fees to Bitcoin miners.","This is a significant drop compared to the hundreds of thousands of dollars miners were receiving daily in late April.","Since its launch on April 20, a total of $4.5 million in transaction fees have been paid to Bitcoin miners, averaging approximately $189,000 per day.","The current count stands at over 91,200 Runes etched on Bitcoin.","Despite the decrease in Rune etchings, Runes transactions continue to dominate the majority of transactions in May.","These transactions primarily take place on popular marketplaces such as Magic Eden, OKX, Ordinals Wallet, and UniSat.","Runes, introduced by Ordinals inventor Casey Rodarmor, aims to utilize blockspace more efficiently than its main competitor, BRC-20s, as outlined by Binance Research.","Unlike BRC-20s, Runes are compatible with Bitcoin’s unspent transaction output (UTXO) model, allowing UTXOs to hold balances of arbitrary fungible tokens like Runes.","Last month, Bitcoin core developer Luke Dashjr criticized the Runes protocol, suggesting it exploits a fundamental design flaw within the Bitcoin blockchain network.","In his post, Dashjr highlighted the contrasting nature of Ordinal Inscriptions and the Runes protocol in their interactions with the network.","Ordinals exploits vulnerabilities.","Runes merely exploit design flaws.","— Luke Dashjr (@LukeDashjr) April 26, 2024","","He explained that while Ordinals exploit vulnerabilities within Bitcoin Core, the Runes protocol operates within the existing framework of the network’s design flaws.","In response to his opposition to Runes, Dashjr suggested methods for filtering out transactions related to the protocol.","He recommended adjusting the “datacarriersize” setting in the bitcoin.conf file to zero, which would effectively block Runes’ spam.","However, early indications suggest that miners are not following this advice.","The popularity of the Runes protocol led to Bitcoin transaction fees reaching an all-time high average of $128 on April 20, coinciding with the fourth Bitcoin halving."],"entity":[{"type":"May 13","content":"DATE"},{"type":"$128","content":"MONEY"},{"type":"Ordinals Wallet","content":"ORGANIZATION"},{"type":"Rune","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"$196,800","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 26, 2024","content":"DATE"},{"type":"$3,835","content":"MONEY"},{"type":"$4.5 million","content":"MONEY"},{"type":"99%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Binance Research","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"April 26","content":"DATE"},{"type":"$189,000","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"late April","content":"DATE"},{"type":"Dashjr","content":"PERSON"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Runes Protocol"],"authors":["Ruholamin Haqshanas"]}