{"summary":"Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cryptocom-internal-trading-teams-prompt-concerns-over-conflicts-of-interest.htm","publishDate":"2023-06-19T13:00:00","id":19563,"type":null,"title":"Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest","category":["Altcoin News "],"content":["Major cryptocurrency exchange Crypto.com has come under scrutiny for deploying internal teams to trade tokens for profit. ","The Singapore-based group reportedly operates proprietary trading and market-making teams, which has raised concerns about potential conflicts of interest, the Financial Times reported, citing people familiar with the matter. ","One of the people with direct knowledge about the teams claimed that Crypto.com executives gave other external trading houses “absolutely dramatic sworn statements that Crypto.com was in no way involved in trading.”","Another source reportedly told the FT that employees were asked to “say there is no internal market maker type operation.”","However, Crypto.com refuted the claim, stating that employees had not been asked to lie to other market participants. ","The company added that it had an internal market maker that operates on the Crypto.com exchange and that the market maker is treated exactly the same as third-party market makers that identically facilitate tight spreads and efficient markets on its platform. ","The company said that most of its revenue comes from its app for retail traders where Crypto.com is the customers’ counterparty for transactions and runs as a broker model. Its exchange is for institutional traders and “operates as a level playing field trading venue.”","In most markets, exchanges match buyers with sellers at the most competitive, transparent price. ","However, laws surrounding market-making and proprietary trading require that they be conducted by separate private companies in order to avoid conflicts of interest. ","Crypto.com’s proprietary trading team has the sole goal of making money “and not facilitating an exchange.” ","The market-making desk, however, is tasked with boosting liquidity on the venue, the people familiar with the matter said. ","They added that the proprietary trading desk trades both on the company’s own exchange and other platforms. ","Crypto.com reportedly told the FT that “all companies operating in the trading industry compare volumes to their competitors.” ","It added that the priority was to “continuously improve order book liquidity and lowering spreads as it results in a more efficient market for all participants.”","The company stated that “participants on the platform, including market makers, are treated equally” and that the company “does not rely on proprietary trading as a source of revenue”.","The new revelations about potential conflicts of interest in Crypto.com come as the Securities and Exchange Commission and other regulators have long warned users about the dangers of manipulation in the industry. ","In fact, the SEC has hit Binance, the world’s biggest crypto exchange, with 13 charges, including using a trading firm owned by CEO Changpeng Zhao to engage in “manipulative trading that artificially inflated the platform’s trading volume.”","The commission even requested an asset freeze for Binance.US, claiming that Binance improperly moved billions of dollars of customer funds to a bank account for an entity controlled by Zhao. ","However, the agency and Binance.US have recently agreed on a compromise that avoids the freezing of the exchange’s assets."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["Crypto Exchange","Crypto.com"],"authors":["Ruholamin Haqshanas"]}