{"summary":"The total dollar amount invested in crypto and blockchain startups passed an important milestone after a busy start to the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278442\/crypto-projects-have-received-over-90-billion-in-all-time-funding","publishDate":"2024-02-24T08:01:05","id":1956,"type":null,"title":"Crypto projects have received over $90 billion in all-time funding","category":["DEALS"],"content":["The all-time, total dollar amount invested in crypto and blockchain-related companies has surpassed $90 billion, according to The Block Research.","More than 50 deals so far this month helped power funding for projects pass the $90-billion mark, also according to <a href=\"https:\/\/www.theblock.pro\/?utm_source=direct&amp;utm_medium=direct&amp;utm_campaign=deals_launch&amp;section=deals-section\" data-v-f87c67ca=\"\">The Block Research data<\/a>, which has been tracking capital flows into the relatively new sector since 2017.&nbsp;","\"When observing the current state of venture funding in the blockchain sector, it’s evident that while we haven’t seen a substantial uptick in funding figures, there are encouraging signs,\" said The Block Research Director John Dantoni.","The Block Research separates new funding announcements into distinct categories: web3, infrastructure, DeFi, NFTs\/gaming, crypto financial services, trading and brokerage, data and analytics, and finally, enterprise. Since the start of the year, more than 230 deals have been reported thus far for a total dollar amount of nearly $1.3 billion, according to The Block Research data.","So far for 2024, the vast majority of funding has been allocated to DeFi, infrastructure, NFTs\/gaming and web3 projects. Venture capitalists and investors participating in funding rounds have included Animoca Brands, Polychain Capital, Framework Ventures and Shima Capital. In one of this month's higher-profile investments, Tether, along with Solana co-founder Anatoly Yakovenko, participated in a <a href=\"https:\/\/www.theblock.co\/post\/276023\/tether-and-solanas-yakovenko-join-25-million-round-for-crypto-payments-firm-oobit\" data-v-f87c67ca=\"\">$25-million Series A<\/a> investment in the crypto mobile payment firm Oobit.","\"Increased deal activity in recent months, particularly noticeable in Pre-Seed\/Seed investments and the risk-on behavior exhibited by Asian VCs, coupled with the growing interest in DeFi &amp; DePIN, paints a picture of investors strategically positioning themselves for what could be the onset of a new digital asset cycle,\" Dantoni also said.","<span data-v-f87c67ca=\"\">Total investment into crypto and blockchain-related companies. Image: The Block Research.<\/span>","Outside the Oobit deal, most funding announcements have been for capital injections below $10 million, according the data. The number of new deals struck each month has remained relatively stable for several months despite dollar amounts falling considerably short of the investment levels seen in 2021 and 2022.","Since 2017, more than 9,500 investments into the industry have been announced, according to The Block Research data.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFi &amp; DePIN","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$1.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$90 billion","content":"MONEY"},{"type":"John Dantoni","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$25","content":"MONEY"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Framework Ventures","content":"ORGANIZATION"},{"type":"\" Dantoni","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"$90","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}