{"summary":"Another Expensive NFT Gets Mistakenly Sold at Large Discount – How Does That Happen?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/another-expensive-nft-gets-mistakenly-sold-at-large-discount-how-does-that-happen.htm","publishDate":"2022-03-29T10:59:00","id":19566,"type":null,"title":"Another Expensive NFT Gets Mistakenly Sold at Large Discount – How Does That Happen?","category":["News "],"content":[" ","Another very popular and pricy non-fungible token (NFT), this time Bored Ape #835, an item in the popular NFT collection Bored Ape Yacht Club (BAYC), has been sold for a fraction of the collection’s floor price — and the community is debating what may be behind it. ","On Tuesday morning (10:00 UTC) the floor price for BAYC sits at ETH 107 (USD 360,000). However, Bored Ape #835, which has a rarity score of 86.83, was sold for DAI 115 (USD 115), 99.9% below the collection’s floor price.","According to OpenSea data, the NFT’s previous owner, who goes by the moniker “cchan,” accepted the DAI 115 bid on Monday. The owner has also accepted a bid of DAI 25 for its Mutant Ape #11670, while the collection currently has a floor price of ETH 22.6 (USD 76,000).","At first look, it can be argued that the owner confused the stablecoin DAI with ETH, particularly since ETH 115 and ETH 25 could have been suitable bids for Bored Ape #835 and Mutant Ape #11670, respectively.","However, it is worth noting that OpenSea lists the USD equivalent of bids right alongside the cryptocurrency, which makes it hard to miss. Moreover, the fact that the owner sold both of the NFTs to the same buyer makes it more curious.","While the sale could have been a result of a mistake, there is also a chance that it was due to some kind of an exploit. Twitter user and NFT trader NFApes claims to have contacted the owner, stating that they were not aware of the sale and it might have been a hack.","just contacted him he was not aware of siutation so iguess it's a hack","Cryptonews.com has contacted OpenSea for a comment. ","Recently, on several occasions, users saw their blue-chip NFTs being sold at a considerably low price without their consent.","Earlier this year, exploiters were able to buy NFTs for old listing prices on OpenSea. In a statement to Cryptonews.com, the marketplace denied the hack allegations and detailed that the issue arises when users create listings for their NFTs and then transfer the listed NFTs to a different wallet without canceling the listing.","And more recently, OpenSea fell victim to a phishing attack where users saw their NFTs being sold without their permission. At the time, OpenSea CEO Devin Finzer claimed that victims might have “signed a malicious payload from an attacker.”","Nevertheless, another speculation has been that sales could be part of an attempt at tax evasion, as pointed out by Twitter user Artchick.","“Feels more like a tax evasion attempt, they sold their mutant for [USD] 25 to the same wallet,” she said. “They’ll probably claim they were scammed and may even have the audacity to try to write it off, they bought the ape for 16eth.”","feels more like a tax evasion attempt, they sold their mutant for $25 to the same wallet\n\nthey'll probably claim they were scammed and may even have the audacity to try to write it off, they bought the ape for 16eth\n\nif it was a mistake, i wish them well, it's quite a loss pic.twitter.com\/lOvpZaaC9Y","Meanwhile, according to Etherscan transactions, the buyer has redeemed their share of free ApeCoin (APE) which was airdropped to Bored Ape holders last week. They have received a total of APE 12,136 (USD 172,700).","Notably, the buyer has sent the NFTs and APE tokens to a third wallet.","____","Learn more:\n– OpenSea’s Trading Volume Remains in a Downtrend Amid Recent Attacks\n– Texas Man Sues OpenSea Over Stolen NFT, Asks for Over USD 1M in Damages\n\n– Decentralization Debate Heats Up Again as MetaMask, OpenSea Block Users\n– NFT Minting is Increasingly Competitive, But One in Three NFTs End Up Dead – Nansen\n\n– NFT Market Cools Down As Ukraine War Pushes Investors Toward Safe-Haven Assets\n– Ukraine Launches NFT Museum of War to Help its Army and Civilians"],"entity":[{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"OpenSea’s Trading Volume Remains","content":"ORGANIZATION"},{"type":"Haven Assets\n– Ukraine Launches NFT","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$25","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"OpenSea Block Users\n– NFT","content":"ORGANIZATION"},{"type":"99.9%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"Bored Ape #835","content":"ORGANIZATION"},{"type":"Army","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Community","NFT","Non-fungible tokens","Opensea"],"authors":["Ruholamin Haqshanas"]}