{"summary":"Pepe Coin Killer? New Web3 Project Meme Kombat Raises $1 Million in Surging Presale, Earn 112% APY And Beat Next Price Rise","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pepe-coin-killer-meme-kombat-hits-1m-raised-in-presale.htm","publishDate":"2023-11-01T14:25:18","id":19578,"type":null,"title":"Pepe Coin Killer? New Web3 Project Meme Kombat Raises $1 Million in Surging Presale, Earn 112% APY And Beat Next Price Rise","category":["Industry Talk "],"content":["","Wednesday, November 1st, 2023 – Exciting new web3 meme project Meme Kombat just hit a huge milestone in its closely watched presale.","The project, which takes inspiration from the multi-billion dollar Mortal Kombat franchise, but with a meme coin spin plus a sprinkling of crypto degeneracy humor, has now raised a $1 million via the crypto presale of its native $MK token.","Traders are rushing in ahead of a price slated to take place in under two days and ahead of the launch of Meme Kombat’s $MK token staking program, which will offer huge annual percentage yields (APYs) to its earliest participants.","Meme Kombat are looking to raise a minimum of $5 million via the sale of 50% of the $MK supply, with tokens currently available for $0.1667.","But on the 2nd of November, this price will jump 10% to $0.1833.","🔥 #MemeKombat UPDATE 🔥","Staged Presale = ON","▪️ NOW: 0.1667 USD\n▪️ Nov 2nd: JUMPS to 0.1833 USD","The timer is set! Secure your $MK before the rise! ⏰ pic.twitter.com\/LMreT8M2Ce","— Meme Kombat (@Meme_Kombat) October 23, 2023","","After this point, the price will rise every seven days until it reaches $0.279 in just over 10 weeks’ time.","That means savvy investors who get in on the presale now will be on huge paper gains of 67% by the time the presale enters its last stage.","Meme Kombat’s staking dashboard will also be going live this week, as per a source familiar with the matter.","The project’s website is already teasing that early staking participants can get APYs of up to 112%.","All $MK tokens bought in the presale are automatically entered into Meme Kombat’s staking program, meaning presale investors will start earning rewards right away.","30% of the $MK supply is dedicated to staking and battler rewards, 10% for community rewards, and 10% for decentralized exchange liquidity.","The project’s founder is Founder Matt Whiteman is Chief Operations Officer at Netherlands-based North Technologies, an NFT trading and analytics platform.","Meme Kombat ($MK) is an all-purpose meme coin because it is building a one-of-a-kind platform for battling meme characters and will therefore likely have wide appeal to all types of meme coin traders and investors.","Not only will you be able to battle with meme characters, but you will also be able to wager on the outcome of those head-to-heads.","You can get a feel for the virality of the project from the fun that the team’s artists are already having with the meme characters.","So whether you are won over by Dogecoin, Shiba Inu, Pepe or Sponge, meme coin watchers will find their character and more represented in Meme Kombat","For degens focused on where to find the next 100x gem, Meme Kombat has to be front and center. Put succinctly, Meme Kombat captures the latent value of arguably the top-valued sectors in crypto today – gaming and gambling.","","At its current price of $0.00000115, Pepe Coin ($PEPE) has an enormous market cap of close to $500 million, a staggering achievement considering the coin offers literally no utility to its investors, beyond the sense that they are part of the admittedly large and engaged Pepe Coin community.","Of course, there is a lot of value in networks of highly engaged individuals, something which Pepe certainly has.","But as the crypto market enters its next bull cycle, one feature of the maturing nature of this market is that investors are becoming more demanding in what they expect from a coin.","Those higher expectations are also being put onto new memes coins.","Increasingly, meme coin investors are flocking towards projects that are offering genuinely unique and potentially valuable use cases – for a project to succeed now, there has to be a value differential.","Meme Kombat fits the bill perfectly. It not only hits on the two booming sectors of GameFi and GambleFi, it is also playing in the high-octane meme coin segment, where old and new money is sure to flow in powerful torrents as crypto winter recedes.","It doesn’t require much analysis to immediately see the value proposition in Meme Kombat and how it stacks up when compared to coins like Pepe.","You can keep up with developments at Meme Kombat on X (formerly Twitter) and Telegram.","","Meme Kombat is at the center of the intersection of gaming and gambling in the cryptocurrency industry, two industries that are booming.","Indeed, Data compiled by Statista shows that the online gambling industry’s market size is $95 billion for 2023.","Crypto is at the forefront of the gambling growth story because of the way in which the unique properties of blockchain technology are so well suited for products like gambling that depend on verifiable randomness, trust and transparency.","Merge the gambling with gaming and meme coins and you have the recipe for success that can send Meme Kombat way beyond a $1 billion valuation.","With Meme Kombat looking to raise between $5 and $10 million via the sale of 50% of its $MK token supply in presale, a surge in the project’s market cap to over $1 billion could mean an increase of over 100x from the project’s presale valuation.","Of course, to reach a valuation of this level, Meme Kombat is going to need to become a household name in the crypto space.","That requires a big marketing push, which is exactly what the project’s team has been cooking in recent weeks.","Meme Kombat has received coverage on top crypto news outlets, including Cointelegraph, Coinpedia, Decrypt, Coincodex, BeInCrypto, FXStreet, and CryptoPotato.","It has even featured on popular gaming sites like Game is Hard.","YouTube influencers are also taking note.","Cryptonews YouTuber Ari has also just published a video for Cryptonews featuring Meme Kombat.","Meanwhile, crypto expert Joe Parys, who has 382,000 subscribers on YouTube, has selected Meme Kombat as one of his ‘top 5 meme crypto coins for 2024 and beyond’.","Michael Wrubel, another respected crypto YouTuber with around 310,000 subscribers, is just as bullish on Meme Kombat’s potential to carve out a valuable niche.","No Bs Crypto YouTube channel told his 36,000 subscribers that Meme Kombat ‘could kill Pepe’."],"entity":[{"type":"$MK","content":"MONEY"},{"type":"$0.1833","content":"MONEY"},{"type":"Netherlands","content":"LOCATION"},{"type":"Meme Kombat","content":"PERSON"},{"type":"Meme Kombat","content":"LOCATION"},{"type":"Michael Wrubel","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"Coinpedia","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"$95 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$0.00000115","content":"MONEY"},{"type":"112%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$5","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coincodex","content":"LOCATION"},{"type":"Pepe","content":"PERSON"},{"type":"$0.279","content":"MONEY"},{"type":"Pepe Coin","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"North Technologies","content":"ORGANIZATION"},{"type":"$0.1667","content":"MONEY"},{"type":"Pepe Coin (","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"67%","content":"PERCENT"},{"type":"Meme Kombat","content":"ORGANIZATION"},{"type":"$PEPE","content":"MONEY"},{"type":"Joe Parys","content":"PERSON"},{"type":"Wednesday, November 1st, 2023","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"YouTuber Ari","content":"ORGANIZATION"},{"type":"October 23, 2023","content":"DATE"},{"type":"2nd of November","content":"DATE"},{"type":"Matt Whiteman","content":"PERSON"}],"hashtag":["Meme coin","Presale"],"authors":["Gary McFarlane"]}