{"summary":"Tornado Cash Developer Challenges Charges, Files Motion to Dismiss with Legal Arguments","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tornado-cash-developer-challenges-charges-files-motion-to-dismiss-with-legal-arguments.htm","publishDate":"2024-03-31T09:34:48","id":19577,"type":null,"title":"Tornado Cash Developer Challenges Charges, Files Motion to Dismiss with Legal Arguments","category":["Altcoin News "],"content":["Roman Storm, co-founder of the cryptocurrency mixer Tornado Cash, has submitted a motion to dismiss all three charges against him, claiming that he did not operate a money laundering business and did not violate the International Emergency Economic Powers Act.","In a filing with the United States District Court for the Southern District of New York on March 29, Storm’s lawyers argued that he cannot be accused of conspiring to launder funds.","According to Storm’s legal team, Tornado Cash was developed, became immutable, and was publicly available before it was utilized by the hacking groups that were sanctioned by the U.S. Department of Treasury. ","They assert that Storm had limited control over preventing a “sanctioned entity from using it” by the time the alleged misconduct occurred.","The charges against Storm revolve around the accusation that Tornado Cash facilitated the efforts of the North Korean Lazarus Group in evading U.S. sanctions, potentially enabling the country’s regime to finance its nuclear program.","Storm’s lawyers further contended that Tornado Cash did not operate as a money-transmitting business since it did not charge a fee for transmitting funds, and users retained full control over their cryptocurrencies. ","They argued that Storm’s intention was to develop software solutions that offered financial privacy for law-abiding cryptocurrency users, asserting that the charges are “fatally flawed and should be dismissed.”","In September 2023, Storm pleaded not guilty to all charges and was released on a $2 million bond shortly after his arrest. ","He currently faces travel restrictions, confining him to certain regions of New York, New Jersey, Washington, and California.","The development comes amidst the U.S. government’s ongoing crackdown on crypto-mixing services. ","Recently, the founder of Bitcoin Fog, a $400 million crypto-mixing service, was convicted of money laundering. ","Roman Sterlingov was found guilty of money laundering, money laundering conspiracy, operating an unlicensed money-transmitting business, and violations of the D.C. Money Transmitters Act.","Earlier this year, Storm sought support from right-to-privacy advocates in anticipation of his upcoming criminal trial.","At the time, Storm said that his legal team was preparing a strong defense for his September 2024 trial. ","“Whether you’re [a] passionate developer like me involved with Web3 or just care about software and privacy, this legal battle will affect you. This case will set a major precedent for years to come,” he said. ","In response, the Arbitrum DAO submitted a proposal that called for the allocation of approximately $1.3 million worth of Arbitrum (ARB) tokens from the community wallet to assist Storm.","However, the submitter has since removed the proposal without providing any reasons.","A crowdfunding campaign on GoFundMe, intended to collect legal fees for Storm and Pertsev, was canceled on February 16 due to a breach of the platform’s terms of service that could expose GoFundMe, its employees, or users to potential harm or liability.","As reported, the US Treasury has added Tornado Cash to its Specially Designated Nationals list, effectively banning Americans from using this mixer. "],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"February 16","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"D.C. Money Transmitters Act","content":"ORGANIZATION"},{"type":"March 29","content":"DATE"},{"type":"$1.3 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"International Emergency Economic Powers Act","content":"ORGANIZATION"},{"type":"U.S. Department of Treasury","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Arbitrum DAO","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"United States District Court","content":"ORGANIZATION"},{"type":"North Korean Lazarus Group","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"September 2023","content":"DATE"},{"type":"September 2024","content":"DATE"}],"hashtag":["Crypto Regulation","tornado cash"],"authors":["Ruholamin Haqshanas"]}