{"summary":"Hong Kong Securities Association is Considering an ‘ICO’ Issuance Mechanism","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-securities-association-is-considering-an-ico-issuance-mechanism.htm","publishDate":"2023-11-30T12:33:41","id":19586,"type":null,"title":"Hong Kong Securities Association is Considering an ‘ICO’ Issuance Mechanism","category":["Altcoin News "],"content":["The Hong Kong Securities & Futures Professionals Association, an influential industry trade group, has proposed the establishment of an initial coin offering (ICO) portal in the city. ","The suggestion was included in the group’s comments on the Hong Kong’s budget for 2024-25, addressed to Financial Secretary Paul Chan Mo-po and Deputy Financial Secretary Wong Wai-lun.","The proposed ICO portal in Hong Kong would serve as a platform for conducting regulatory-compliant token offerings. ","By creating a controlled environment, authorities can mitigate risks associated with fraudulent ICOs while providing opportunities for legitimate projects to access funding. ","With a potential bull market on the horizon, industry stakeholders, including the Hong Kong Securities & Futures Professionals Association, believe that revisiting ICOs within a regulated framework could unlock new opportunities for both investors and projects.","While the specifics of the proposed ICO portal are yet to be determined, its potential launch would offer a regulated avenue for token issuers to raise funds and investors to participate in promising blockchain projects. ","ICOs emerged as a fundraising method in 2015, following Ethereum’s launch, and gained significant popularity. ","However, the ICO landscape faced setbacks due to numerous scams and violations of securities regulations. Hong Kong, once a thriving hub for ICO listings, witnessed regulatory measures to delist many tokens.","While security token offerings (STOs), compliant ICOs that emerged later, failed to attract substantial investor interest in Asia, the industry landscape has since evolved. ","The JPEX scandal, regarded as potentially the largest financial fraud in Hong Kong‘s history, has prompted the Hong Kong government to expedite the approval process for cryptocurrency products to promote compliance in the industry.","According to OSL Compliance Exchange, a licensed virtual asset platform, financial technology solution providers have shown interest in the potential benefits of integrating tokenized platforms with banks in the future. ","This integration could leverage the public’s trust in banks, thereby facilitating the growth of the virtual asset industry.","Back in June, Hong Kong implemented its new regulatory framework for crypto.","The new rulebook allows retail investors the ability to trade virtual assets, instead of restricting digital assets trading to professional investors and traders with at least $1 million in bankable assets.","As part of the new regulations, the SFC has also started providing licenses to crypto exchanges. ","OSL and Hashkey Group have become the first crypto exchanges in the city to receive licenses from the SFC. ","They also enjoy crypto-to-fiat conversion services from ZA Bank, the largest online-only bank in Hong Kong. ","The bank allows users of the trading platforms to withdraw crypto deposits in US dollars, Hong Kong dollars, and Chinese yuan. ","More recently, crypto exchange Hong Kong VAEXC (VAEX) applied for a virtual asset trading platform license with the SFC. "],"entity":[{"type":"2015","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"25","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"OSL Compliance Exchange","content":"ORGANIZATION"},{"type":"Hashkey Group","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"ZA Bank","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wong Wai","content":"PERSON"},{"type":"Paul Chan Mo","content":"PERSON"},{"type":"Hong Kong Securities & Futures Professionals Association","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["Hong Kong","ICO"],"authors":["Ruholamin Haqshanas"]}