{"summary":"Animoca-Backed Gaming Blockchain Reveals $15M Token Exploit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-token-hacks-blockchain-gaming-project-animoca.htm","publishDate":"2024-01-23T11:17:11","id":19580,"type":null,"title":"Animoca-Backed Gaming Blockchain Reveals $15M Token Exploit","category":["Blockchain News "],"content":["Blockchain gaming project GAMEE fell victim to a token hack on Monday, losing 600m GMEE tokens valued at about $15.3m.","The team revealed in an X post on Tuesday that “unauthorized access” to the GMEE token contracts on the Polygon network resulted in the loss of funds.","“The exploit affected proprietary team token reserves only, and no community-owned assets have been exploited,” it added.","Summary:\nA few hours ago, there was unauthorized access to the $GMEE token contracts on Polygon leading to the theft of funds. Gamee team has secured all unauthorized access to the token contracts. The exploit affected proprietary team token reserves only, and no community-owned…","— GMEE Token (@GAMEEToken) January 23, 2024","","The team suspected the Polygon GMEE deployer address was hacked on Monday at 6:31 pm UTC through unauthorized GitLab access, with the stolen tokens converted to ether and MATIC.","Following the incident, the perpetrator appears to have traded the compromised tokens on multiple decentralized exchanges, affecting their price across these platforms.","The team said it responded by securing the token contract ownerships linked to the breached deployer address, and transferring them to a new address for safety.","GAMEE has temporarily stopped providing liquidity on decentralized exchanges and informed centralized exchanges with GMEE markets to halt deposits and freeze tokens associated with the hack.","They plan to release a more comprehensive update in 48 hours.","An administrator on GAMEE’s Discord channel advised users to avoid interacting with GMEE until further notice.","The Animoca Brands-backed GAMEE blockchain is designed to generate and deploy gaming tokens through smart contracts on platforms such as Ethereum, Binance Smart Chain, or Avalanche.","This way, games can move and hold these tokens with ease. Its objective is to transform the dynamic between players and game developers into one that is more equitable and transparent.","The perceived security of blockchain projects has been debated for a long time, and various attacks over the years suggest that they are only somewhat secure.","Notable incidents in blockchain gaming include the Ronin Network breach in March 2022, where hackers stole about $625m in ether and other tokens, and the Wormhole bridge exploit in Feb. 2022, which led to the loss of $321m in wrapped ether (wETH) tokens.","Nevertheless, projections indicate that the blockchain gaming market could surpass a value of $600b by 2030."],"entity":[{"type":"Feb. 2022","content":"DATE"},{"type":"$600b","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"6:31","content":"TIME"},{"type":"March 2022","content":"DATE"},{"type":"$15.3m.","content":"MONEY"},{"type":"$625m","content":"MONEY"},{"type":"MATIC","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"January 23, 2024","content":"DATE"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Ronin Network","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$GMEE","content":"MONEY"},{"type":"$321m","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Blockchain"],"authors":["Shalini Nagarajan"]}