{"summary":"Vitalik Buterin on the Challenges Between Crypto and AI, Warns ‘Tread Carefully’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vitalik-buterin-discusses-challenges-between-crypto-and-ai-warns-tread-carefully.htm","publishDate":"2024-01-31T08:04:24","id":19583,"type":null,"title":"Vitalik Buterin on the Challenges Between Crypto and AI, Warns ‘Tread Carefully’","category":["Ethereum News "],"content":["Ethereum co-founder Vitalik Buterin has discussed the intersections between crypto and artificial intelligence (AI), warning to “tread carefully.”","In a blog post published Tuesday, Buterin highlights the main challenges between the two hottest technology trends of the past decade and explains what he considers to “be the most fruitful” for the developer community.","“There must be some kind of connection between crypto and AI.”","He goes on to claim that “with the rise of much more powerful AI and the rise of much more powerful crypto in the form of ZKPs, FHE, (two-party and N-party) MPC,” adding that there are some promising applications of AI inside of blockchain ecosystems.","Buterin uses the analogy that AI is like a player in a game, adding that the application of AI that a lot of people are excited about, he believes is the most risky.","“We need to tread the most carefully: what I call AIs being part of the rules of the game,” blogs Buterin.","The Ethereum co-founder goes on to explain that if a blockchain-based smart contract or a DAO needs to make a subjective decision could you make an AI simply be part of the contract or DAO to help enforce these rules?","The term AI is a broad concept and refers to the simulation of human intelligence processes by machines, typically computer systems.","These processes include learning for example the acquisition of information and rules for using it.","Reasoning for example using rules to reach approximate or definite conclusions and self-correction. AI can be applied to various tasks such as problem-solving, understanding natural language, recognizing patterns in data, and more.","AI is a very broad concept, blogs Buterin.","AI can be considered as being the set of algorithms that you create not by specifying them explicitly, “but rather by stirring a big computational soup and putting in some kind of optimization pressure that nudges the soup toward producing algorithms with the properties that you want,” adds Buterin.","The bottom line from Buterin is that both blockchains and AIs are becoming more powerful.","However, it remains  challenging to “get right applications that attempt to use blockchains and cryptographic techniques to create a ‘singleton’: a single decentralized trusted AI.”","Buterin, a prolific blogger, proposed in December alternative methods aimed at simplifying the Ethereum blockchain’s proof of stake design. The initiative is intended to address a potential systemic complexity within Ethereum’s consensus mechanism.","The proposals center on reducing the number of signatures required per slot in the blockchain."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"AIs","content":"ORGANIZATION"}],"hashtag":["Artificial Intelligence","Ethereum","Vitalik Buterin"],"authors":["Tanzeel Akhtar"]}