{"summary":"Runes Will “Close The Gap” Between Bitcoin and Ethereum: Franklin Templeton","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-runes-franklin-templeton.htm","publishDate":"2024-04-17T01:40:24","id":19582,"type":null,"title":"Runes Will “Close The Gap” Between Bitcoin and Ethereum: Franklin Templeton","category":["Bitcoin News "],"content":["Bitcoin’s soon-to-launch “Runes” token standard will allow the premiere crypto network to catch up to rivals in the realm of DeFi, predicted asset manager Franklin Templeton in a Monday report.","The firm released a fact sheet expanding on the upcoming technology over Twitter, which is set to go live at the same time as the Bitcoin halving.","“Runes introduces a new token standard on Bitcoin layer 1, which improves upon the current fungible token standards on Bitcoin (BRC-20s)” Franklin explained.","Runes – Bitcoin’s new Fungible Token Standard pic.twitter.com\/0VmlFbyKPc","— Franklin Templeton Digital Assets (@FTI_DA) April 15, 2024","","Tokens are blockchain-based assets that are different from that blockchain’s native currency, such as BTC on Bitcoin, or ETH on Ethereum. Until 2023, there was no way to mint tokens on Bitcoin’s main blockchain, locking it away from many applications available on other chains, including NFTs, stablecoins, and DeFi.","That changed in early 2023 with the rise of Ordinals, as invented by Casey Rordamor. The protocol lets users inscribe individual satoshis with unique identification numbers, and embed them with arbitrary data, enabling NFTs.","Bitcoin NFTs stood out from Ethereum and Solana NFTs, in that their image data was embedded directly into Bitcoin’s blockchain, rather than on a centralized server.","As of today, Bitcoin hosts a larger NFT market than both blockchains, according to Cryptoslam. In the past 30 days, its processed $462 million in NFT trading volume, versus Ethereum’s $296 million.","A developer named Domo later built on the Ordinals protocol to enable BRC-20 tokens, though the creator himself admitted that such tokens were highly inefficient.","Today, Runes – once again created by Rordamor – are designed to be much more efficient, requiring less blockchain-based data to move around than BRC-20 tokens, or even Ethereum’s ERC-20 tokens. Some other benefits of Runes include compatibility with the lightning network, and increased transaction privacy.","“Bitcoin is positioned well to close the gap between its fungible market cap versus that of other blockchain,” wrote Franklin.","Bitcoin’s total market cap right now is $1.2 trillion, while its fungible token cap is just $600 million. By contrast, Ethereum’s market cap is $378 billion, while its fungible token market cap is $499 billion.","“We are excited to see if Runes can do for Bitcoin’s Fungible token and DeFi market what Ordinals did for Bitcoin’s Non-fungible token market,” the report concluded."],"entity":[{"type":"April 15, 2024","content":"DATE"},{"type":"$1.2 trillion","content":"MONEY"},{"type":"Casey Rordamor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$296 million","content":"MONEY"},{"type":"Twitter","content":"LOCATION"},{"type":"Fungible Token Standard pic.twitter.com\/0VmlFbyKPc","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"Franklin","content":"PERSON"},{"type":"$499 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Franklin Templeton Digital","content":"ORGANIZATION"},{"type":"$462 million","content":"MONEY"},{"type":"$378 billion","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Solana NFTs","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Ethereum"],"authors":["Andrew Throuvalas"]}