{"summary":"Polygon Network Embraces Colombian Peso Stablecoin nCOP – Crypto Adoption on the Rise?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-network-embraces-colombian-peso-stablecoin-ncop-crypto-adoption-rise.htm","publishDate":"2023-08-25T18:00:00","id":19599,"type":null,"title":"Polygon Network Embraces Colombian Peso Stablecoin nCOP – Crypto Adoption on the Rise?","category":["Altcoin News "],"content":["A stablecoin pegged to the Colombian peso (COP) has gone live on the Polygon network, stablecoin issuer Num Finance announced on Thursday.","The new stablecoin, called nCOP, is a traditional fiat-backed stablecoin, and was described by Num Finance in a post on X as “overcollateralized” in a way that “guarantees rock-solid stability and security.”","The stablecoin issuer called the launch a “remarkable milestone on our path to constructing the Num Network,” and indicated that it will offer new opportunities for Latin American residents who rely on remittances.","💸Smooth transactions and rapid remittances\n📈Shields against volatility through yields\n🔁Easy trades with USD\n🏛️Financial inclusion in the region by offering high-quality financial solutions.","According to a blog post published by Num Finance on Thursday, a unique thing about nCOP is that it will offer holders yield.","The yield will be in the form of “nCOP rewards,” which Num Finance said are “based on regulated financial products.”","In a comment, Num Finance CEO Agustín Liserra pointed to the big opportunity Colombia represents for stablecoin issuers given the country’s position as one of the largest remittance destinations in Latin America.","“In Colombia, there exists a unique opportunity to ’tokenize’ remittances and offer them a yield in nCOP, based on regulated financial products. Currently, Colombia is one of the main recipients of remittances in Latin America, with nearly USD 6.5 billion flowing into the country,” Liserra said.","He added that the stablecoin in this way opens up the opportunity for Colombians to “send and receive nCOP as remittances and get a yield on it.”","According to Num Finance, nCOP is redeemable 1:1 with the Colombian peso.","The new stablecoin is already live on the Polygon network, and has a total supply 180 million tokens, according to data from Polygonscan.","The token could not yet be found on coin tracking sites like CoinMarketCap or CoinGecko at the time of publication.","Established in 2021, Num Finance offers stablecoins pegged to the Argentine peso (nARS) and Peruvian sol (nPEN) in addition to the new Colombian peso-pegged coin."],"entity":[{"type":"Colombia","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Num Finance","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"USD\n🏛️Financial","content":"ORGANIZATION"},{"type":"Liserra","content":"PERSON"},{"type":"Num Network","content":"ORGANIZATION"}],"hashtag":["Stablecoin"],"authors":["Fredrik Vold"]}