{"summary":"Coinbase would likely benefit from improved market sentiment if a spot bitcoin ETF is approved, which could boost retail revenues.\nBerenberg analysts said ETFs associated with Coinbase could be less likely to secure approval.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248770\/bitcoin-etf-boost-for-coinbase-would-be-more-of-a-feel-good-story-than-a-revenue-one","publishDate":"2023-09-01T12:20:40","id":1959,"type":null,"title":"Bitcoin ETF Coinbase boost more a feel-good story than a revenue one","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Approval of spot bitcoin ETFs could be a boon for Coinbase, but not because it will drive a significant increase in revenues, some analysts predict.<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, when a <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">court ruled<\/a> that the Securities and Exchange Commission had to re-review Grayscale Investments' spot bitcoin ETF proposal, <\/span><span data-v-f87c67ca=\"\">Coinbase’s shares jumped by 14%.<\/span>","<span data-v-f87c67ca=\"\">But how bitcoin ETFs will benefit the U.S.-based cryptocurrency trading platform could be indirect and slightly sentimental, argued <\/span><span data-v-f87c67ca=\"\">John Todaro, a senior research analyst at <\/span><span data-v-f87c67ca=\"\">Needham &amp; Company.<\/span>","<span data-v-f87c67ca=\"\">\"The real benefit for Coinbase is that an <\/span><span data-v-f87c67ca=\"\">ETF changes sentiment and brings retail volumes back,\" said Todaro.<\/span>","<span data-v-f87c67ca=\"\">And that would be welcome news for Coinbase, which in its <a href=\"https:\/\/www.theblock.co\/post\/243100\/coinbase-q2-revenues-beat-estimates-but-usdc-interest-income-falls-to-151-million\" data-v-f87c67ca=\"\">most recent<\/a> quarterly earnings statement reported that <\/span><span data-v-f87c67ca=\"\">revenue from transaction fees fell to $327 million from the $655 million posted during the same quarter a year ago.<\/span>","<span data-v-f87c67ca=\"\">Coinbase has surveillance-sharing agreements in place for proposed spot ETFs from asset managers including BlackRock, Fidelity and Valkyrie. Eventual approval of the funds could potentially benefit the company, which stands to earn revenue through the agreements. <\/span>","<span data-v-f87c67ca=\"\">But the amount of revenue will likely pale in comparison to what Coinbase has traditionally been able to earn from individual clients, said Todaro.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">While Coinbase would generate direct revenue from these approvals, the direct top-line impact is likely to be limited,\" he said. \"It is a positive step for Coinbase and the space broadly which is where we envision the greatest impact.\"<\/span>","<span data-v-f87c67ca=\"\">Coinbase's Chief Policy Officer <\/span><span data-v-f87c67ca=\"\">Faryar Shirzad echoed Todaro's big-picture takeaway when appearing in an interview with CNBC yesterday.<\/span>","<span data-v-f87c67ca=\"\">Approval of bitcoin ETFs \"is enormously important for institutional adoption which I think then allows for broader adoption,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Berenberg Capital Markets analyst Mark Palmer and his colleagues view the future of ETFs associated with Coinbase with some pessimism.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">We believe the proposed spot bitcoin ETFs that designated Coinbase as the custodian or as a surveillance-sharing partner are less likely to be approved<\/span><span data-v-f87c67ca=\"\">,\" said Palmer, referencing a report he and his team published earlier this week.<\/span>","<span data-v-f87c67ca=\"\">\"Regarding any incremental financial benefit Coinbase could gain from its potential role in spot bitcoin ETFs, we would not be surprised if the company's involvement were to serve as part of the SEC’s reconfigured arguments for rejecting the applications,\" the analysts said.&nbsp;<\/span>","Even if Coinbase-associated bitcoin ETFs are eventually approved, Palmer agreed that won't put the trading platform on track to meaningfully grow revenues.","\"<span data-v-f87c67ca=\"\">Playing a supporting role in the operation of another company's spot bitcoin ETF is not likely to make a big difference,\" he said.<\/span>","The company's shares declined 1.1% to $78.70 on Friday at 11:32 a.m. ET, according to TradingView. The SEC <a href=\"https:\/\/www.theblock.co\/post\/248595\/sec-moves-to-delay-decisions-on-spot-bitcoin-etfs-from-wisdomtree-invesco-and-valkyrie\" data-v-f87c67ca=\"\">said Thursday<\/a> that it would delay decisions on seven proposals for spot bitcoin ETFs for at least another month."],"hashtag":[]}