{"summary":"Senator Elizabeth Warren Advocates for a “Level Playing Field” and Regulations in Crypto and AI","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/warren-advocates-for-a-level-playing-field-in-crypto-and-ai.htm","publishDate":"2024-02-28T08:36:28","id":19602,"type":null,"title":"Senator Elizabeth Warren Advocates for a “Level Playing Field” and Regulations in Crypto and AI","category":["Altcoin News "],"content":["United States Senator Elizabeth Warren has emphasized the need for a legal “level playing field” in the cryptocurrency industry and has called for restrictions on major tech companies’ development of artificial intelligence (AI) models. ","In a Bloomberg Television interview on February 27, Warren expressed her desire to collaborate with the crypto industry while advocating for fair regulations.","Warren argued that in the financial system, everyone should adhere to the same set of rules. ","“My view is that it’s the same kind of activity, the same kind of risk, and should have the same kind of regulations… I’m not looking for fancier regulations or anything tougher; I just want a level playing field.” ","According to her, achieving a level playing field has been hindered by claims from the crypto industry that concessions are necessary to ensure its survival. ","Warren highlighted ransomware scammers, drug and human traffickers, and terrorists as examples of actors for whom the industry seeks leniency.","To address concerns related to money laundering in the crypto space, Warren has proposed the Digital Asset Anti-Money Laundering Act. ","The legislation aims to treat decentralized technologies, including blockchain nodes, validators, noncustodial wallets, and software providers, as financial institutions similar to traditional banks and stock brokers. ","","However, the bill has faced criticism from industry executives, organizations, and associations who argue that it is ill-suited for the technology and may impede innovation and investment, potentially pushing them overseas.","In addition to her focus on the crypto industry, Warren has also targeted major tech players such as Microsoft, Google, and Amazon in the realm of AI. ","She expressed her intention to prevent these companies from using their size and resources to dominate the development of large language models. ","Warren believes that such dominance could hinder competition and innovation, particularly in emerging AI areas like chatbots. ","This stance aligns with her broader campaign against the market power and concentration of Big Tech in various industries.","Last week, Warren claimed that a well-funded member of the “crypto lobby” is vying to displace her from her seat on Capitol Hill.","As reported by Fox Business journalist Eleanor Terret, Warren’s campaign team claimed that she’s “not afraid” of the new challenge, but will “need to prepare” to compete against such powerful interest groups.","“Ever since I began speaking out about protecting consumers from crypto scams and making that industry follow the same basic regulations as banks and all other financial institutions, the crypto lobby has put a target on my back,” Warren wrote in a recent letter to followers.","🚨SCOOP: @SenWarren is RALLYING her donor base in anticipation of a challenge to her Massachusetts Senate seat from a pro-#crypto candidate.","In an email sent to me by a source who received it, Warren directly addresses the @BostonGlobe report speculating that @JohnEDeaton1 will… pic.twitter.com\/NuEBSp1924","— Eleanor Terrett (@EleanorTerrett) February 19, 2024","","Deaton, who boasts over 317,000 followers on Twitter, is best known as a crypto-supportive litigator who defended over 75,000 XRP holders during Ripple’s years-long lawsuit with regulators that came to a close last year.","He was also a vocal supporter of Grayscale in its lawsuit against the Securities and Exchange Commission (SEC), often suggesting that the agency acted in bad faith against crypto at large."],"entity":[{"type":"Warren","content":"PERSON"},{"type":"February 27","content":"DATE"},{"type":"Eleanor Terrett","content":"PERSON"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"Bloomberg Television","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Massachusetts Senate","content":"ORGANIZATION"},{"type":"Fox Business","content":"ORGANIZATION"},{"type":"Eleanor Terret","content":"PERSON"},{"type":"February 19, 2024","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Deaton","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":["Crypto Regulation","Elizabeth Warren"],"authors":["Ruholamin Haqshanas"]}