{"summary":"Vitalik Buterin Proposes New EIP to Tackle Ethereum’s Sky-High Gas Fees","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vitalik-buterin-proposes-new-eip-to-tackle-ethereums-sky-high-gas-fees.htm","publishDate":"2021-11-29T10:30:00","id":19606,"type":null,"title":"Vitalik Buterin Proposes New EIP to Tackle Ethereum’s Sky-High Gas Fees","category":["Ethereum News "],"content":["Ethereum (ETH) co-founder Vitalik Buterin has put forward a new Ethereum Improvement Proposal (EIP) that aims to tackle the network’s gas fee problems by adding a limit on the total transaction calldata.","Since Ethereum can only process 15 transactions per second, gas fees tend to spike at times of network congestion. On November 9, the average transaction network fee reached USD 62 per transaction. As of now, Ethereum transactions cost around USD 44, according to BitInfoCharts.","After highlighting concerns regarding the transaction fees on the Ethereum network, Buterin suggested the new EIP-4488, saying that it would “decrease transaction calldata gas cost, and add a limit of how much total transaction calldata can be in a block.”","In other words, EIP-4488 would limit the total transaction calldata, where data from external calls to functions are stored, before reducing the calldata gas cost to remove the possibility of breaking the network.","“Simply decreasing the calldata gas cost from 16 to 3 would increase the maximum block size to 10M bytes. This would push the Ethereum p2p [peer-to-peer] networking layer to unprecedented levels of strain and risk breaking the network; some previous live tests of ~500 kB blocks a few years ago had already taken down a few bootstrap nodes,” Buterin said.","He added that the “decrease-cost-and-cap proposal” would increase the maximum block size to 1.5 MB, which “will be sufficient while preventing most of the security risk.”","The new solution is anticipated to reduce data transaction costs. As per BitMEX Research, an industry analysis firm, the update could reduce gas fees by five times.","Looks like Ethereum may soon effectively have a 1MB blocksize limit!\n\nThis is part of the process to lower the gas cost of data by around 5 times, to make rollups cheaperhttps:\/\/t.co\/W98cePpnKP","If the proposal is approved, the implementation would require a scheduled network upgrade. ","Meanwhile, there are some concerns about the implications of the update. For one, Alex Krusz, an Ethereum developer, said that there could be several far-reaching consequences as a result of the update.","“While ostensibly simple, it could be argued that the calldata limit is an architectural decision with greater implications than just modifying a gas constant,” Krusz said. “If there is an arbitrary limit imposed, why not make it a soft limit, or impose it on the entire block size rather than on calldata specifically?”","Tim Beiko, an Ethereum Core developer, said that one of the challenges to the calldata solution is that it “influences the block sizes on Ethereum.”","“It’s literally data we add to each transaction. If we lower the gas cost, and keep the same gas limit, we then have bigger blocks, which can be problematic in the short and long term,” Beiko said.","Long term, it increases the size of the Ethereum blockchain. If we go from adding 0.1MB of chaindata per block to even 0.5MB, that's a 5x increase in the rate of chain growth.","Notably, EIP-4488 is a “short-term” remedy for Ethereum’s sky-high gas fees. Arguably, the main update that is expected to solve Ethereum’s scalability issue is the shift from proof-of-work (PoW) to proof-of-stake (PoS) mechanism.","At 10:12 UTC on Monday morning, ETH was trading at USD 4,298. It’s up almost 6%, erasing almost all its losses in the past week. ","____","Learn more:\n– Ethereum Gas Fees Highest During US Business Hours, Coin Metrics Finds\n– Ethereum Fee Debate Heats Up as Avalanche Enters and Exits Top 10\n\n– Ethereum Fees Pushed Higher by DEX Trading as Optimism’s Upgrade Nears\n– Ethereum Tests All-Time High as On-Chain Activity Grows, SHIB Burns ETH\n\n– Ethereum’s EIP-1559 Helped Coinbase Save ETH 27 on Daily Fees\n– Ethereum Users Flock To Arbitrum In Search of Scalability"],"entity":[{"type":"November 9","content":"DATE"},{"type":"6%","content":"PERCENT"},{"type":"Burns","content":"PERSON"},{"type":"4488","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Alex Krusz","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"1559","content":"DATE"},{"type":"Buterin","content":"PERSON"},{"type":"Krusz","content":"PERSON"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"BitMEX Research","content":"ORGANIZATION"},{"type":"Beiko","content":"PERSON"},{"type":"Ethereum Gas Fees Highest During US Business Hours","content":"ORGANIZATION"},{"type":"Ethereum Users Flock To Arbitrum In Search of Scalability","content":"ORGANIZATION"}],"hashtag":["Ethereum","Fees"],"authors":["Ruholamin Haqshanas"]}