{"summary":"Goldman Sachs’ Digital-Asset Team Ready to Expand with New Blockchain Platform – Is the Bear Market Over?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/goldman-sachs-digital-asset-team-ready-to-expand-with-new-blockchain-platform-is-the-bear-market-over.htm","publishDate":"2023-03-01T15:10:00","id":19601,"type":null,"title":"Goldman Sachs’ Digital-Asset Team Ready to Expand with New Blockchain Platform – Is the Bear Market Over?","category":["Blockchain News "],"content":["The major Wall Street investment bank Goldman Sachs has said it stands ready to bolster its digital asset team, as it promotes its new tokenization platform GS DAP for new users around the world.","The GS DAP platform – a private and centralized blockchain controlled by Goldman Sachs – was trialed in Hong Kong last week for an inaugural sale of $100m worth of so-called green bonds, Bloomberg reported on Tuesday this week.","The tokenization of the bonds cut the settlement time from five days to just one day, the Bloomberg article said.","Speaking at an event following the trial, Goldman Sachs’ global head of blockchain, Mathew McDermott, said bank is still “hugely supportive” of the potential that blockchain technology has, despite this year’s downturn in crypto prices. He also said that his division will expand “as appropriate” in 2023.","According to Bloomberg, the digital asset team now has around 70 staff, up from just four people in 2020 when McDermott took over as head of the unit.","At the event, McDermott explained that he expects Goldman’s blockchain platform to also be used for other assets than bonds in the future. Among the possibilities are alternative investments, fund units, derivatives and private equity.","For stock trading and initial public offerings (IPOs), however, McDermott said the blockchain platform will most likely not be used, given that systems currently in place are already efficient enough.","Bloomberg cited McDermott as saying that Goldman’s blockchain platform potentially could make markets more efficient:","“The blockchain platform allows investors to see more data, have more transparency, more accurate pricing on an asset, which will then encourage more liquidity and hopefully bring in more investors in the secondary market.”","Despite the potential for more efficient markets, McDermott admitted that large-scale tokenization of financial assets will still take time to gain traction due to regulatory issues. Still, the bank is committed to continue investing in its own blockchain program, as other banks, including JPMorgan, also move forward with their own blockchain plans."],"entity":[{"type":"Mathew McDermott","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$100m","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Tuesday this week","content":"DATE"},{"type":"McDermott","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Goldman Sachs –","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["Goldman Sachs"],"authors":["Fredrik Vold"]}