{"summary":"Bankrupt Crypto Lending Firm Celsius Shifts Focus to Bitcoin Mining Amid SEC Feedback on Reorganization Plan","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bankrupt-crypto-lending-firm-celsius-shifts-focus-to-bitcoin-mining-amid-sec-feedback-on-reorganization-plan.htm","publishDate":"2023-11-21T17:54:49","id":19603,"type":null,"title":"Bankrupt Crypto Lending Firm Celsius Shifts Focus to Bitcoin Mining Amid SEC Feedback on Reorganization Plan","category":["Blockchain News "],"content":["Crypto lender Celsius has amended its reorganization plan, opting for a singular focus on bitcoin mining instead of the initially proposed combination of mining and staking.","In a court filing on Monday, Celsius signaled its departure from the earlier Plan that combined both staking and mining and planned to transition to a new company that focuses only on mining bitcoin.","This move follows feedback from the U.S. Securities and Exchange Commission (SEC) on specific aspects of the initial reorganization plan. The SEC’s request for additional information about the former crypto lender’s assets led to the revision of Celsius’s strategy.","Celsius said in the filing:","“Following confirmation, Celsius received feedback from the Securities and Exchange Commission (the “SEC”) on certain aspects of the Plan, which has resulted in Celsius now intending to begin the process of applying to register the shares in a new publicly traded Bitcoin mining company that will be owned by Celsius customers (the “Mining NewCo”).”","The company now plans to initiate the registration process for shares in a new publicly traded Bitcoin mining company named “Mining NewCo,” to be owned by Celsius customers.","Initially, the court-approved reorganization plan designated implementation responsibilities to Fahrenheit Holdings, a consortium including Arrington Capital and crypto miner U.S. Bitcoin Corp. Approved in May 2023, the Plan outlined the creation of a new company registered in Delaware, temporarily referred to as NewCo. The original intention was for NewCo to engage in both mining and staking activities.","The SEC’s feedback prompted Celsius to narrow its focus to bitcoin mining with Mining NewCo. The company anticipates commencing the registration process for shares in the new mining entity, representing a shift in its strategic direction.","Celsius intends to apply for the registration of shares in a new publicly traded bitcoin mining company, referred to as “Mining NewCo,” which will be owned by Celsius customers. The SEC’s feedback has prompted the retention of specific assets by Celsius’s estates for regulatory reasons, with plans to administer and monetize these assets for the benefit of creditors.","Negotiations are ongoing with parties involved in the future management of Mining NewCo, with further details expected to be disclosed as agreements are reached. Due to the reduced scope and scale of Mining NewCo compared to the initially proposed Fahrenheit NewCo, Celsius anticipates lower aggregate fees and economic incentives for operators. However, this adjustment is expected to result in a greater amount of liquid cryptocurrency available for direct distribution to customers.","In the coming weeks, Celsius plans to file a motion with the bankruptcy court to seek approval for modifications to the reorganization plan, reflecting the shift to Mining NewCo. The company does not believe that these modifications will necessitate the solicitation of the Plan and still aims to commence distributions to creditors in January 2024.","Celsius, the crypto lending platform, is set to emerge from Chapter 11 bankruptcy following its filing in July 2022. The SEC filed a lawsuit in July 2023 against Celsius and its former CEO, Alex Mashinsky, alleging false promises of a secure investment through the firm’s Earn Interest Program.","Despite the legal challenges, Celsius is working on a reorganization plan and is expected to exit Chapter 11 in early 2024, according to a post on X, formerly known as Twitter. Founder of Arrington Capital, Michael Arrington, stated that Celsius’ revival distinguishes itself from other crypto companies that collapsed in 2022 and were unable to reorganize.","As part of the reorganization, Fahrenheit, a blockchain infrastructure firm, will acquire a minority stake in the reorganized Celsius for $50 million. The new company’s stock is set to be publicly listed on Nasdaq, enabling Celsius customers to sell equity shares received as part of their bankruptcy recovery."],"entity":[{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Mining NewCo","content":"ORGANIZATION"},{"type":"Earn Interest Program","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Fahrenheit Holdings","content":"ORGANIZATION"},{"type":"NewCo","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"crypto miner U.S. Bitcoin Corp","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"“Mining NewCo","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"Michael Arrington","content":"PERSON"},{"type":"July 2023","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Hassan Shittu"]}