{"summary":"Brace for More S Korean Altcoins as President-Elect Prepares to Ditch ICO Ban","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brace-for-more-s-korean-altcoins-as-president-elect-prepares-to-ditch-ico-ban.htm","publishDate":"2022-05-05T00:00:00","id":19619,"type":null,"title":"Brace for More S Korean Altcoins as President-Elect Prepares to Ditch ICO Ban","category":["Bitcoin News "],"content":[" ","South Korea’s President-Elect Yoon Suk-yeol has indicated he is ready to come good on some of the crypto-related campaign promises that helped him win power earlier this year – and could end an initial coin offering (ICO) ban that dates back to 2017.","Yoon will be sworn into power on May 10. And per Newsis, Yoon’s Presidential Transition Committee has placed the creation of a Digital Asset Framework Act (literal translation) on a shortlist of 110 action points that his government will tackle in the weeks and months after he takes up the presidency.","The details of the plan include the creation of suitable “conditions” for investors who wish to invest in “digital assets” with “confidence.” More importantly for big businesses, however, the committee made mention of enabling “domestic ICOs,” albeit with “issuance methods” that provide “safeguards for investors.”","This will be music to the ears of the likes of the SK Group, a powerful conglomerate that has already indicated that it will issue its own token via a subsidiary firm before the end of 2022. Unconfirmed reports in the country have also stated that other mega-companies (so-called chaebol firms) such as LG and Samsung may look to follow suit. Previously the likes of Kakao and a Hyundai subsidiary have had to issue their own tokens through international subsidiaries. But with the SK token – and possibly others – primarily intended for domestic use, companies are thought to prefer a domestic launch.","The proposed Digital Asset Framework Act would, the committee indicated, comprise “measures to protect consumers and improve transaction stability,” and could extend to the policing of both ICOs and the issuance of non-fungible tokens (NFTs). Further token listing regulations are also likely to be included for crypto exchanges.\n\nDomestic ICOs, under the proposed law, would be organized into a “regulatory system,” where coins would be classified as “security type” and “non-security type” tokens, with a government-appointed body ruling on matters such as the utility nature of a token and whether it was intended for use in the payments and settlements markets.","“Security type” coins would need to issued in accordance with the terms of the Capital Market Act, which governs the issuance of conventional securities, and includes a number of “safeguards for investors.”","Yoon’s team has indicated that if necessary, the new government will create a preliminary financial regulatory sandbox.","“Non-security type” coins, meanwhile, would need to be issued within a system that ensures that listing and “unfair trading prevention” measures are adhered to.","An official from the committee was quoted as stating that “introducing an insurance system against hacks and system errors” was paramount.","South Korean media outlets have also reported that Yoon’s team is adamant that the nation’s forthcoming crypto tax law is postponed until legislation aimed at protecting consumers comes into force. Depending on the speed of this legislative rollout and promulgation dates, that could well mean the tax is delayed until 2024, with an eleventh-hour cross-party consensus in the National Assembly last year already delaying the start of crypto taxation until at least 2023.","Yoon has previously spoken of raising the threshold for capital gains levies on crypto-related earnings to grant crypto traders parity with KOSDAQ market stock traders.\n___\nLearn more: \n– Bitcoin Maintains Dominance Despite Massive Proliferation of Altcoins\n– Web 3.0 Is Coming, and Crypto Will Be Essential to It\n\n– South Korea’s Biggest Neobank Reportedly on Verge of Crypto exchange Banking Deal\n– South Korean Crypto Exchanges Resume Service as Usual after Travel Rule Breakthrough"],"entity":[{"type":"SK Group","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Hyundai","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"the end of 2022","content":"DATE"},{"type":"Biggest Neobank Reportedly on Verge of Crypto exchange Banking Deal\n– South Korean Crypto Exchanges Resume Service","content":"ORGANIZATION"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Elect Yoon Suk","content":"PERSON"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"Bitcoin Maintains Dominance Despite Massive Proliferation","content":"ORGANIZATION"},{"type":"Yoon’s","content":"PERSON"},{"type":"May 10","content":"DATE"},{"type":"Yoon’s Presidential Transition Committee","content":"ORGANIZATION"},{"type":"LG","content":"ORGANIZATION"}],"hashtag":["Altcoins","Ban","ICO","Regulation","South Korea","Tokenization"],"authors":["Tim Alper"]}