{"summary":"Binance confirmed Tuesday it has started the process of integrating the Lightning Network.\nThey would join rivals Kraken and Bitfinex who have already integrated it.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235556\/binance-starts-whipping-up-bitcoin-lightning-network-nodes","publishDate":"2023-06-20T04:00:01","id":1961,"type":null,"title":"Binance starts whipping up Bitcoin Lightning Network nodes","category":["Companies"],"content":["Crypto exchange Binance confirmed on Tuesday that it has started running nodes on the Bitcoin Lightning Network as part of its plan to integrate it for deposits and withdrawals.","\"Some eagle-eyed users spotted our new lightning nodes recently,\" Binance said in a <a href=\"https:\/\/twitter.com\/binance\/status\/1671042638592589826?s=20\" data-v-f87c67ca=\"\">tweet<\/a>. \"Yes - that's us! However, there's still more tech work to be done. We'll update once Lightning is fully integrated.\"","The exchange first said it was planning to integrate the network in a <a href=\"https:\/\/twitter.com\/binance\/status\/1655419624962527233\" data-v-f87c67ca=\"\">tweet<\/a> on May 8. This was in response to congestion it faced on the main Bitcoin network.","The Layer 2 network, which is meant to lower costs and increase throughput of transactions on Bitcoin, has already been integrated by rival exchanges including <a href=\"https:\/\/www.kraken.com\/learn\/lightning-network\" data-v-f87c67ca=\"\">Kraken<\/a> and <a href=\"https:\/\/support.bitfinex.com\/hc\/en-us\/articles\/360039801053-Lightning-Network-BTC-LN-BTC-Deposits-Withdrawals\" data-v-f87c67ca=\"\">Bitfinex<\/a>.","Bitcoin's Lightning Network can support 1 million transactions per second. The network's capacity has been increasing steadily over the last year, according to data from The Block's data dashboard.&nbsp;","At last check, it stood at $148 million.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["BINANCE"]}