{"summary":"Pro-Bitcoin, Central Bank Critic Javier Milei Wins Argentina’s Presidential Elections","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pro-bitcoin-javier-milei-wins-argentina-presidential-elections.htm","publishDate":"2023-11-20T05:22:43","id":19621,"type":null,"title":"Pro-Bitcoin, Central Bank Critic Javier Milei Wins Argentina’s Presidential Elections","category":["Bitcoin News "],"content":["In a decisive win during Argentina’s presidential run-off on November 19, pro-bitcoin and far-right populist candidate Javier Milei clinched victory with over 55% of the votes, boasting a substantial lead of nearly 3 million votes, according to Bloomberg data.","Milei has taken a strong stance against the country’s central bank, which he has criticized as a “scam” and a tool for politicians to impose inflationary taxes on the public.","Bitcoin price is currently trading at $37,229, up nearly 2% in the last 24 hours.","As the nation grapples with a prolonged inflation crisis, Milei’s vocal opposition to the central bank’s role has resonated with voters.","The Argentine peso has witnessed a staggering 140% increase in annual inflation over the past 12 months. Milei sees Bitcoin as a pivotal movement, advocating for the return of money to the private sector.","Despite Milei’s pro-Bitcoin stance, there is no indication that he plans to make Bitcoin legal tender in Argentina. Milei prepares to assume office on December 10.","In contrast, defeated opponent Sergio Massa, the current minister of economy, has opposing views on the financial landscape. Massa had pledged in October to launch a central bank digital currency (CBDC) as a solution to Argentina’s enduring inflation crisis, showcasing a divergence in perspectives within the country’s political landscape.","While Massa secured the first round of the presidential election in October, it was insufficient to secure the presidency outright, leading to the final run-off vote that culminated in Milei’s triumph. Milei had previously emerged victorious in Argentina’s primary election against other prominent candidates in August, setting the stage for his successful presidential bid."],"entity":[{"type":"November 19","content":"DATE"},{"type":"December 10","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Sergio Massa","content":"PERSON"},{"type":"Milei","content":"PERSON"},{"type":"Milei","content":"LOCATION"},{"type":"55%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$37,229","content":"MONEY"},{"type":"Argentina","content":"LOCATION"},{"type":"140%","content":"PERCENT"},{"type":"Javier Milei","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Massa","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["Argentina","Bitcoin"],"authors":["Jai Pratap"]}