{"summary":"New Solana GambleFi Token Mega Dice Raises $300,000+ in Crypto Presale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-solana-gamblefi-token-mega-dice-raises-300000-in-crypto-presale.htm","publishDate":"2024-04-17T10:42:36","id":19625,"type":null,"title":"New Solana GambleFi Token Mega Dice Raises $300,000+ in Crypto Presale","category":["Industry Talk "],"content":["New Solana GameFi token Mega Dice (DICE) has now raised over $300,000 in its presale, which opened this week and has already begun attracting investors.","Mega Dice is already a well-established name in the world of cryptocurrency casino platforms, yet the launch of its own native DICE token promises to take it to another level.","DICE will serve as a funding and payment token on Mega Dice’s platform, with certain games requiring the token to play, and with the coin also available for staking.","This provides it with strong fundamentals and utility, setting it up nicely for a big presale and an equally impressive round of exchange listings.","Launched in 2023, Mega Dice has quickly risen through the ranks to become one of most highly regarded online casinos and betting platforms in crypto.","Its website offers more than 4,500 games to play and bet on, including classic casino staples such as slots, roulette and blackjack, as well as a comprehensive sportsbook.","And given that it has been a crypto-friendly online casino since day one, it makes sense that it’s now rolling out its very own token, DICE.","DICE will run on the Solana blockchain and will have a max supply of 420 million tokens, with its presale receiving the biggest share – 35% – of this total.","Investors can join the presale by visiting its official website, where they can buy the token at a price of $0.069 per coin.","It’s quickly becoming evident that many investors will be taking the chance to buy DICE early, with the sale already raising just over $325,000.","This a great sign for such a new sale, with interested investors advised to act early before the offering sells outs.","As a native token, DICE will provide various benefits to its holders, most of which are centered around its use within the Mega Dice ecosystem.","First of all, holders can use DICE to game on MegaDice.com and also via the Mega Dice Casino bot on Telegram, while they won’t be able to access certain games unless they hold the token.","Draw your sword and prepare for battle in our #NewGame release #SamuraisKatana by @push_gaming at Mega Dice Casino 🗡️ Wield the legendary katana of the samurai providing an unforgettable adventure filled with honor, courage, and BIG wins! 💰","🔗 https:\/\/t.co\/fawORyTnCC pic.twitter.com\/WuFp10tzeI","— Mega Dice Casino (@megadice) April 16, 2024","","On top of this, Mega Dice will begin paying out rewards in DICE, with the token also serving as the currency of choice for various promotions.","This means that there will be incentives for holding DICE, something that will raise demand for the token, potentially boosting its price over time.","Also likely to boost is price is the fact that Mega Dice will actually commence a program of buybacks and token burns, which in conjunction with the capped supply could be very bullish.","Then there’s the fact that DICE will be stakeable, with 10% of its supply – or 42 million DICE – set aside for staking.","This means that even more of the token will exit circulation, improving the chances of steady price growth.","Taken together, such features make for a potentially very profitable coin.","And its launch will come at a time when the wider market is likely to experience renewed bullishness.","This will follow from this week’s Bitcoin halving, which in constricting the BTC supply even further could boost demand.","On top of this, the Federal Reserve is likely to bring in several rate cuts this year, further growing the appetite for cryptocurrencies.","It’s within this mix that DICE will launch, and once it lists it could potentially rocket.","Buy DICE Now",""],"entity":[{"type":"Mega Dice (DICE)","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mega Dice Casino bot","content":"ORGANIZATION"},{"type":"Mega Dice Casino 🗡️ Wield","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 16, 2024","content":"DATE"},{"type":"$325,000","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"$300,000","content":"MONEY"},{"type":"$0.069","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Mega Dice Casino","content":"ORGANIZATION"}],"hashtag":["Mega Dice","Mega Dice Casino","Presale"],"authors":["Simon Chandler"]}