{"summary":"February Frenzy: These 5 Cryptos Have Nearly $1 Billion Worth of Unlocks Due This Month","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/february-frenzy-these-5-cryptos-have-nearly-1-billion-worth-of-unlocks-due-this-month.htm","publishDate":"2024-02-05T11:01:17","id":19622,"type":null,"title":"February Frenzy: These 5 Cryptos Have Nearly $1 Billion Worth of Unlocks Due This Month","category":["Altcoin News "],"content":["The crypto market is poised for increased selling pressure across numerous tokens as unlocks worth nearly $1 billion are set to occur this month.","Projects such as Optimism (OP), Avalanche (AVAX), The Sandbox (SAND), Aptos (APT), and Sui (SUI) are expected to have the largest unlocks, adding to the trading volume and market dynamics.","When a new crypto project launches, its tokens are typically subject to a vesting period during which they remain locked.","However, once the tokens unlock, holders gain the ability to sell or transfer them, potentially impacting the market.","A lot of big token unlocks this month pic.twitter.com\/1zjiOOz0a4","— Johnny (@CryptoGodJohn) February 1, 2024","","The largest token unlock scheduled for February 2024 is Avalanche’s AVAX.","On February 22, approximately 9.54 million AVAX tokens, valued at a staggering $344.17 million, will be released, accounting for 2.60% of the circulating supply.","Another significant unlock to watch out for is Aptos, with 24.84 million APT tokens worth $229.54 million set to unlock on February 11.","Previous unlocks of the same amount led to notable price corrections, with the token experiencing a downturn of 17.94% and 14.10% during previous unlocks in January and December 2023, respectively.","The Sandbox, which conducts two unlocks annually, has its first unlock of 2024 scheduled for February 14.","This release will introduce 205.59 million SAND tokens, equivalent to 9.19% of the circulating supply, worth $95.47 million based on current market prices.","Additionally, Optimism and Sui are set to contribute significant tokens to circulation.","On the last day of February, Optimism will unlock 24.16 million OP tokens, valued at $76.58 million, for core contributors and investors.","Sui, on the other hand, released 34.62 million tokens worth $54 million for its community access program on February 3.","Notably, the SUI token unlock has not adversely impacted its price.","According to data from CoinMarketCap, the cryptocurrency is currently trading at around $1.52, up by 2.84% over the past day. It is also up by more than 8% over the past week.","Likewise, dYdX (DYDX) unlocked 33 million coins, worth approximately $90 million, on February 1.","The token also did not experience any major price swings after the unlocks.","While crypto traders and investors closely monitor unlock events, it’s important to note that they don’t always result in a price decline.","Various factors influence price actions and the market’s response to these unlocks may differ.","Nevertheless, the unlocking of substantial amounts of tokens can introduce increased volatility and trading opportunities in the crypto market."],"entity":[{"type":"February 14","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"February 11","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"February 1, 2024","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"$1.52","content":"MONEY"},{"type":"SUI","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"$90 million","content":"MONEY"},{"type":"Sui (SUI","content":"ORGANIZATION"},{"type":"$54 million","content":"MONEY"},{"type":"last day of February","content":"DATE"},{"type":"$229.54 million","content":"MONEY"},{"type":"$95.47 million","content":"MONEY"},{"type":"February 22","content":"DATE"},{"type":"9.19%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"2.84%","content":"PERCENT"},{"type":"$344.17 million","content":"MONEY"},{"type":"2.60%","content":"PERCENT"},{"type":"14.10%","content":"PERCENT"},{"type":"$76.58 million","content":"MONEY"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"February 3","content":"DATE"},{"type":"December 2023","content":"DATE"},{"type":"February 1","content":"DATE"},{"type":"17.94%","content":"PERCENT"}],"hashtag":["Avalanche","Optimism","SUI"],"authors":["Ruholamin Haqshanas"]}