{"summary":"Ethereum’s TVL Breaches $50 Billion as DeFi Activity Ramps Up","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereums-tvl-breaches-50-billion-as-defi-activity-ramps-up.htm","publishDate":"2024-02-28T10:29:11","id":19627,"type":null,"title":"Ethereum’s TVL Breaches $50 Billion as DeFi Activity Ramps Up","category":["Altcoin News "],"content":["The Ethereum network has recorded several gains in the last four months as decentralized activity continues to rise amid institutional inflows.","Data from DefiLlama shows an increasing number of transactions around decentralized finance (DeFi) protocols causing a spike in values locked on most platforms.","The Total Value Locked (TVL) on Ethereum is at $51.3 billion with protocols recording more inflows. Lido, Maker, and EigenLayer remain the top three with $32 billion, $9.1 billion, and $9 billion respectively in TVL.","","At press time, Ethereum dominates 60.03% of the market share while Tron and Binance Smart Chajn come in next with 11.6% and 5.5%.","While Ethereum grew 6% in the last seven days, Bitcoin posted a massive 30% jump in the same period. This points to the wider market as a major reason for an increasing DeFi landscape.","DeFi activities spiked from Q4 2023 with massive inflows taking the market out of the bear cycle. The 2022 bear market was caused largely due to macroeconomic factors and industry implosions led to plunging asset prices and low DeFi volumes. Market leaders Bitcoin and Ethereum lost 55% of their volumes with the entire ecosystem struggling below water.","Activities picked up following BlackRock’s spot Bitcoin ETF application coupled with a renewed institutional demand in the market taking the price of BTC above $40,000 in December.","The anticipation for a spot BTC ETF approval by the United States Securities and Exchange Commission (SEC) led to inflows into institutional products growing assets under management (AUM) above $67 billion.","As institutional funds grow, investors look to earn interest through more products on several networks. Ethereum being the largest smart contract blockchain has become a beneficiary of the recent market uptick.","Institutions have also looked to Ethereum as spot ETF hopes become prominent following the success of Bitcoin. Bitcoin ETFs have attracted over  $5.2 billion in inflows with projections for more by several commentators.","This has led to new investments in ETH flagged as the next crypto ETF in the market by major firms. Last year, a group of wealth managers picked Ethereum as the asset with the highest growth potential.","Ethereum’s staking feature and undervalued narrative at the time led to the decision by the institutional traders.","Similarly, a new market report from Coinbase shows institutional interest in Ethereum following anticipation of an ETF approval in the United States."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"60.03%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"11.6%","content":"PERCENT"},{"type":"last seven days","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"$67 billion","content":"MONEY"},{"type":"$9.1 billion","content":"MONEY"},{"type":"$5.2 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"55%","content":"PERCENT"},{"type":"$51.3 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"$9 billion","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["DeFi","Ethereum","TVL"],"authors":["David Pokima"]}