{"summary":"Friend.tech Native Token Tanks 50% After Biggest Whale Dumps","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/friend-tech-native-token-tanks-after-biggest-whale-dumps.htm","publishDate":"2024-05-03T23:23:28","id":19620,"type":null,"title":"Friend.tech Native Token Tanks 50% After Biggest Whale Dumps","category":["Altcoin News "],"content":["Friend.tech native token $FRIEND fell 50% on May 3 after its debut as the largest whale dumped their holdings. Meanwhile, users couldn’t access their airdropped tokens.","As BaseScan data shows, within hours of the airdrop, the largest holder, “Murphys1d,” sold over 55,000 of the newly issued $FRIEND.","This led to an immediate 53.3% drop in the token’s price from $3.26 to $1.30 as of writing. ","","Beyond the sell-off, some users were unable to claim their airdrop, forcing them to watch helplessly as $FRIEND’s price plummeted. Crypto investor Luke Martin commented that this just “adds insult to injury.”","Watching the value of my airdrop go from 7 figs to 5 figs in the span of 2hrs while I keep refreshing the page trying to claim….still can't claim.","Meanwhile I gotta watch this guy cashout while my wallet won't even load.","Adds insult to injury 💀💀💀","— Luke Martin (@VentureCoinist) May 3, 2024","","In a low liquidity environment, a few large orders can have an outsized impact on the market price.","$FRIEND only had $0.01 worth of liquidity, leaving holders vulnerable. ","The extremely low liquidity evoked outrage within the community.","“First you milk your users with fees, then you get them to add liquidity so that they can dump on each other,” disgruntled X user mcSleuth commented.","","The Friend.tech dump is just one example of a professional airdrop farmer dumping on markets. These “squatters” interact with emerging protocols solely for the airdrop rewards, often with multiple wallets to compound rewards.","This comes at a heavy cost to the communities surrounding the protocol squatters’ targets. Dumps create major selling pressure, causing legitimate protocol users to panic and sell their holdings as well, further compounding the issue. ","In April 2024, Omni Network was similarly affected by Sybil farmers. Their native OMNI token fell 55% in less than 18 hours following its airdrop, losing over half of its market capitalization. ","While these events can have a huge negative impact on price action, it’s often only short-term. $FRIEND may struggle following this event, but its community of investors may pull it through in the long term."],"entity":[{"type":"$0.01","content":"MONEY"},{"type":"April 2024","content":"DATE"},{"type":"53.3%","content":"PERCENT"},{"type":"$3.26","content":"MONEY"},{"type":"May 3","content":"DATE"},{"type":"May 3, 2024","content":"DATE"},{"type":"$1.30","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Omni Network","content":"ORGANIZATION"},{"type":"$FRIEND","content":"MONEY"},{"type":"Luke Martin","content":"PERSON"}],"hashtag":["Airdrop","price crash","Whale"],"authors":["Harvey Hunter"]}