{"summary":"Messari CEO Expects Bitcoin to Remain the Unstoppable “Godzilla of Finance” in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/messari-ceo-expects-bitcoin-to-remain-the-unstoppable-godzilla-of-finance-in-2024.htm","publishDate":"2023-12-20T06:41:57","id":19630,"type":null,"title":"Messari CEO Expects Bitcoin to Remain the Unstoppable “Godzilla of Finance” in 2024","category":["Bitcoin News "],"content":["Messari CEO Ryan Selkis has likened Bitcoin (BTC) to the unstoppable “Godzilla of finance,” emphasizing its enduring position as the leader in the crypto market. ","In his annual report outlining the key trends within the crypto industry, the crypto boss said he remains optimistic about the path ahead, predicting that 2024 will showcase the increasing utility and prominence of cryptocurrencies at the forefront of technological innovation.","Specifically, he claimed that Bitcoin would maintain its dominance, power, and impact within the financial realm.","“Bitcoin has been, and will remain in 2024, the Godzilla of finance.”","While algorithmic stablecoins may currently be facing challenges, Selkis said he remains optimistic about their potential in the near future. ","Additionally, the report suggested that retail-focused central bank digital currencies (CBDCs) will have a comparable impact to meme coins.","The report emphasized that the industry must navigate the regulatory landscape, recognizing that regulators hold significant power in determining the fate of cryptocurrencies globally. ","Selkis stressed the importance of stakeholders engaging with regulators, particularly in the United States, where the battle for crypto’s future will be fiercely contested.","Meanwhile, after a relatively calm year for centralized crypto financial services in 2023, Selkis predicts a resurgence as institutions recommit to the crypto space. ","The promises and impact of centralized finance (CeFi) and institutional involvement in crypto might warrant a dedicated report in the coming year.","The crypto boss said Ethereum experienced significant advancements with its long-awaited Shapella upgrade and its vision for a “rollup-centric” future, while highlighting the multi-blockchain reality and the importance of compatibility and interoperability across networks.","The report anticipated a regulated environment for decentralized finance (DeFi), signaling a gradual, multi-decade technical upgrade similar to how traditional financial institutions adapted to the internet.","Furthermore, it mentioned the booming consumer interest in crypto, despite recent market sentiment, emphasizing the importance of developing user-friendly platforms.","The past year witnessed significant breakthroughs in crypto wallets and decentralized autonomous organization (DAO) governance. ","These developments mark a pivotal moment in crypto adoption, with parallel hardware infrastructure being developed by entities like DePIN.","“Amidst a grueling year, this report stands as a testament to the relentless commitment of our research team and reinforces why I remain perma-bullish on this technology and this community,” Selkis concluded. ","“While the past twelve months proved to be another challenging cycle, the builders laid the foundation for crypto’s next phase of adoption. This report celebrates the builders.”","Selkis is a prominent figure in the cryptocurrency and blockchain industry.","He is the founder and CEO of Messari, a leading provider of digital asset market intelligence and research.","His annual report, the Messari Theses, has become a highly anticipated publication that provides valuable insights into the industry’s trends and future outlook."],"entity":[{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Selkis","content":"PERSON"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"United States","content":"LOCATION"}],"hashtag":["Bitcoin"],"authors":["Ruholamin Haqshanas"]}