{"summary":"Solana’s Hottest New GambleFi ICO Mega Dice Has Already Attracted $500,000 In First Week","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solanas-hottest-new-gamblefi-ico-mega-dice-has-already-attracted-500000-in-first-week-2.htm","publishDate":"2024-04-25T20:26:10","id":19631,"type":null,"title":"Solana’s Hottest New GambleFi ICO Mega Dice Has Already Attracted $500,000 In First Week","category":["Industry Talk "],"content":["Thursday, April 25, 2024 – A presale for Solana’s hottest new GambleFi token, Mega Dice ($DICE), kicked off last Wednesday, quickly netting over $500,000 dollars in the first seven days, according to the token’s website.","Mega Dice is already a well-established name in GambleFi. It launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram and has since attracted 50,000 players.","Others have since followed suit and launched iGaming bots on Telegram, most notably TG Casino.","Mega Dice’s website currently offers gamers over 4,500 ways to win money, including classic staples like slots, roulette and blackjack, in addition to a comprehensive bookmaker that streams the most popular games from a selection of over 50 sports and esports.","The bookmaker currently collects average monthly wagers totalling $50 million between some 10,000 monthly active users.","The ICO for Mega Dice’s new crypto token $DICE turbocharges the online casino’s services to a whole new level. As the platform’s native token, players can use $DICE to fund games and receive payment, with some games requiring the token.","Let’s see why investors pumped $300,000 into the ICO within twenty-four hours of launch.","$DICE has a hard supply cap of 420 million tokens, with 35% allocated to the presale, where the token sells at a current fixed price of $0.069 per coin.","After the first $1 million raised (14.7 million DICE sold), the presale will proceed to the next stages, where the price will get incrementally higher.","So, this is the cheapest price investors can purchase it for in the presale before the price rises. And once the token lists on exchanges, the sky’s the limit on potential appreciation.","Holders don’t necessarily need to risk their $DICE at the casino to get rewards. It can be staked to earn passive income, with 10% of the total supply earmarked by the casino for staking rewards.","","$DICE is also going to get even more utility in the future. Mega Dice has outlined plans to integrate the token into the casino’s loyalty program, offering more generous rewards to gamers who play with the native token. It will also unlock access to exclusive competitions and VIP experiences.","Then there’s also the casino’s buyback and burn program, which will reduce the supply, increasing scarcity and potentially pumping value.","In sum, $DICE offers a compelling pitch. It’s a brand new GambleFi token in a fast growing sector, backed by a well-established brand, transparent tokenomics, strong fundamentals and utility beyond gaming.","","Finally, there will be a $2.25 million airdrop across three seasons of $750,000 each. To participate in the first season, players have to wager $5000 or more between now and May 3, with a maximum airdrop win of up to $37 500 per entrant.","Other exciting offers on the horizon include early bird bonuses, limited edition NFTs, and a referral program that promises referrers a 10% cut of the initial investment of any gamer who signs up on their recommendation, according to a recent announcement by the Mega Dice team.","Introducing #ReferAndEarn with $DICE! 🚀💰","You can now refer users to the Mega Dice presale and earn a generous 10% commission on all referral purchases.","Here's a simple guide on how to get started: 👇 pic.twitter.com\/jbXSdljjvK","— Mega Dice Casino (@megadice) April 24, 2024","","Given the multiple ways investors can put their DICE to work, it’s obvious why GambleFi investors are stacking Mega Dice.","Stay abreast of Mega Dice token and casino news on X\/Twitter and Telegram.","Don’t miss out.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"April 25, 2024","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$37","content":"MONEY"},{"type":"$2.25 million","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"last Wednesday","content":"DATE"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"$DICE","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"$5000","content":"MONEY"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"May 3","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$500,000 dollars","content":"MONEY"},{"type":"Mega Dice presale","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"TG Casino","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"$0.069","content":"MONEY"},{"type":"$750,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Crypto Presale","megadice"],"authors":["Gary McFarlane"]}