{"summary":"Bitcoin Struggles for Direction in Run-Up to Christmas + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-struggles-for-direction-in-run-up-to-christmas-more-news.htm","publishDate":"2023-12-19T14:00:49","id":19648,"type":null,"title":"Bitcoin Struggles for Direction in Run-Up to Christmas + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","This past week marked the first instance of a weekly bitcoin (BTC) price decrease after eight consecutive weeks of price appreciation. This signals anticipated market movements aimed at reducing market leverage, according to Matteo Greco, Research Analyst at the publicly listed digital asset and fintech investment business Fineqia International.","Some $345 million worth of long and short positions were liquidated during the week, with the majority of liquidations affecting long positions, totaling around $235 million, Greco said in an email.","That said, the strong uptrend price movements also resulted in about $110 million in liquidation of short positions.","“High volatility is a typical outcome following periods of significant uptrends and downtrends, triggering a cascade of liquidations that reduce market leverage and contribute to a more sustainable price action and market environment,” Greco commented. “Traders often capitalize on moments of heightened volatility to attract liquidity and readjust their positions.”","Bitcoin dominance declined from 53.46% to 53.11% in a week, indicating the robust resilience of altcoins compared to the leading digital asset during the recent downtrend.","This suggests active investor engagement, as this pattern typically occurs when investors swiftly allocate capital across various altcoins in search of short-term profitability, Greco said.","AIA Carnival – Hong Kong’s largest outdoor event, attracting over one million visitors each year, hosted by pan-Asian life insurance group AIA Group Limited – partnered with the Web3 financial app and ecosystem hi to enable crypto payments.","Per the emailed press release, AIA Carnival attendees will be able to buy food and beverages from selected vendors using cryptocurrencies. These include BTC, ETH, SAND, and USDT.","Leveraging hi’s Super App, attendees will be able to scan QR codes to make crypto payments.","The collaboration “pioneers the integration of cryptocurrency payments in live events,” the announcement said.","EMTECH, a modern central banking infrastructure company, has successfully delivered a 12-week central bank digital currency (CBDC) Hackathon as a strategic pilot for the Bank of Ghana.","According to the press release, this is the company’s latest technical partnership with the Bank of Ghana. It follows the deployment of its Digital Regulatory Sandbox.","Announced on October 3, 2023, the eCedi Hackathon brought together developers, banks, fintech innovators, and the Bank of Ghana to pilot how EMTECH’s tokenized CBDC solution could achieve key objectives and be used in use cases relevant to the Ghanaian market such as merchant payments, government payments, lending, crowdfunding, transparent taxation, and others.","Partners included West Africa, Ghana Fintech Association, HBAR Foundation, and KPMG.","Ten selected participants onboarded a dedicated hackathon platform. They received Institutional Wallets and 1,000 BYDC-eCedi tokens from the central bank to prototype various solutions.","All transactions were performed using Hedera’s token and public ledger services that used an ERC-20 token standard and delivered transparency in transactions with the privacy of a user’s information, the announcement said.","Crypto exchange Binance announced the successful completion of the System and Organization Controls (SOC) 2 Type II compliance audit for its global platform and technology services.","Per the press release, the audit was conducted by trusted third-party assessor A-LIGN. Binance completed the SOC 2 Type II after a multi-month assessment of its controls and practices. Two areas were assessed: systems protection and data security.","“On top of revealing that Binance’s controls are well-designed and appropriately implemented, the independent audit also validated the day-to-day operational effectiveness of these controls and is globally recognized,” the exchange said.","KuCoin Labs, the VC arm of the KuCoin exchange, partnered with BRC20 tool aggregator Biis, to bolster the Bitcoin ecosystem.","The press release said that Biis offers features like batch distribution, collection, and cross-chain tools, simplifies digital asset management, enhances efficiency for BRC20\/420\/721\/100 operations, and integrates the Ordinals protocol for improved security and convenience, catering to both developers and users.","The collaboration with KuCoin Labs will enable Biis to expand its technological infrastructure. It will foster a more integrated, user-friendly environment for crypto enthusiasts and professionals, the announcement said.","The partnership will also drive innovation and growth within the BRC20 ecosystem, offering users a comprehensive suite of tools and services."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"KuCoin Labs","content":"ORGANIZATION"},{"type":"Fineqia International","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"AIA Carnival","content":"ORGANIZATION"},{"type":"October 3, 2023","content":"DATE"},{"type":"Ghana Fintech Association","content":"ORGANIZATION"},{"type":"Greco","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"West Africa","content":"LOCATION"},{"type":"Matteo Greco","content":"PERSON"},{"type":"$235 million","content":"MONEY"},{"type":"53.11%","content":"PERCENT"},{"type":"AIA Group Limited –","content":"ORGANIZATION"},{"type":"53.46%","content":"PERCENT"},{"type":"HBAR Foundation","content":"ORGANIZATION"},{"type":"EMTECH","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"Bank of Ghana","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Digital Regulatory Sandbox","content":"ORGANIZATION"},{"type":"$345 million","content":"MONEY"},{"type":"$110 million","content":"MONEY"}],"hashtag":["Adoption","Binance","Bitcoin","btc","CBDC","Central Bank","ETH","Ethereum","Hong Kong","KuCoin","Market","Payments","Security","USDT"],"authors":["Sead Fadilpašić"]}