{"summary":"‘If You’re Selling BTC for Something, Sell it for Gold Instead of USD’, Says Tether CTO Paolo Ardoino","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/if-youre-selling-btc-for-something-sell-it-for-gold-instead-of-usd-says-tether-cto-paolo-ardoino.htm","publishDate":"2023-06-15T15:02:00","id":19649,"type":null,"title":"‘If You’re Selling BTC for Something, Sell it for Gold Instead of USD’, Says Tether CTO Paolo Ardoino","category":["Altcoin News "],"content":["In an insightful conversation with Cryptonews, Paolo Ardoino, the CTO of both Tether and Bitfinex, shed light on crucial topics relating to the crypto world.","The dialogue navigated the volatile waters of inflation, the allure of gold as a tangible asset, and the growing fascination with digital gold – Bitcoin. ","Ardoino also explained Tether’s novel approach toward global transactions and the role of their unique digital gold model.\n\nLet’s dive in.","As inflation escalates and national currencies depreciate, “the only lifeline to have something tangible in your portfolio is gold,” according to Ardoino.","This ancient safe haven asset is finding parallels with its digital counterpart, Bitcoin (BTC).","The COVID-19 pandemic and subsequent economic stimulus have inflated global economies, as a result of central banks‘ mass money printing. ","In fact, a whopping 30% of all USD in circulation was printed in the past three years, Ardoino noted to Cryptonews.com.","Countries like Turkey and Argentina are bearing the brunt of this trend, grappling with severe currency devaluations.","In response, central banks are pivoting to secure assets like gold and, to a lesser extent, Bitcoin.","Both gold and Bitcoin are seen as scarce, hard-to-extract assets, making them attractive, safe assets.","While central banks have a long history of using gold as a reserve asset, Bitcoin remains less understood, and is harder for these institutions to integrate.","“So what they do in this case is go out and try to buy the safest asset that they can hold in their portfolios, and that is gold.”","The shared characteristics of gold and Bitcoin include their scarcity, as well as the extraction difficulty and the cost of their production.","The largest gold buyers are in Asia, said Ardoino, with China and India leading the way.","“I love the fact that there is a deep connection between gold and digital gold, Bitcoin.”","However, Ardoino stressed,","“I always try to make the point that Tether Gold is not competing with Bitcoin but with dollars. I personally think that Bitcoin is much better than gold.”","Yet, the reality is that Bitcoin needs a currency to trade against. ","“So if you are selling your Bitcoin for something else, in my opinion, selling it for gold is better than selling it for dollars.”","Globally, several countries have started seeking an alternative to the US dollar for settling transactions.","Yet, accepting foreign currencies for international trade introduces the risk of inflation exposure.","Gold may be the solution. It is “the only currency that can be understood and could be the common denominator,” Tether CTO said.","As physical gold is challenging to move and use in transactions, digital gold is seen as a more practical option.","Stablecoin-issuer, Tether, has created a model for digital gold, called Tether Gold, that Ardoino believes other countries and organizations could replicate for international trade.","“We believe that this solution can potentially even outgrow USDT.”","Tether targeted the crypto industry first with its digital gold, as this sector is best positioned to grasp its purpose.","Now, the company is also in talks with hedge funds looking to add Tether Gold to their portfolios.","Tether Gold is designed to play a pivotal role in decentralized finance (DeFi), Ardoino explained. It would reduce the dependency on USD in lending and borrowing.","Thus, he posited, gold trumps fiat currency as a superior DeFi asset.","On top of regulation, Tether Gold’s focus is on security and validating the gold that underpins the digital tokens.","One key security measure is ensuring that the physical gold is stashed in the world’s safest location.","Switzerland, renowned for its trustworthiness and neutrality, is the perfect repository for this gold, being an “agnostic” nation, Ardoino suggested.","A comprehensive audit is another crucial step. This entails more than just weighing the gold; sophisticated tools must measure other parameters, including density.","With the physical and auditing aspects covered, attention then shifts to regulatory matters.","On the regulatory front, Ardoino confirmed that Tether is collaborating with global regulators to secure licenses and expand.","In this evolving landscape of Fintech and crypto, the fusion of traditional assets like gold with blockchain technology demonstrates an exciting potential. ","As Tether continues to pioneer this new frontier, the world watches, ready to navigate the uncharted territories of digital gold.","____","– Tether Announces Q1 Profit of $1.48 Billion and Discloses Bitcoin, Gold Reserves\n– Tether Stablecoin Recoups Lost Market Value in 2022 Crash, Topping $83.2 Billion\n\n– Tether Plans Bitcoin Mining in Uruguay\n– Tether Plans 15% of Its Net Profits Into Bitcoin in Move of Confidence\n\n– What is DeFi? Decentralized Finance Explained\n– What Is Bitcoin?"],"entity":[{"type":"Turkey","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"19","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"Tether Plans Bitcoin Mining","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Tether CTO","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Cryptonews","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"$83.2 Billion","content":"MONEY"},{"type":"$1.48 Billion","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Uruguay","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["Argentina","Asia","Bitcoin","Central Bank","China","Coronavirus","DeFi","India","Inflation","Regulation","Security","Tether","USDT"],"authors":["Khashayar Abbasi"]}