{"summary":"Deepfakes Accelerating Crypto Scams on Twitter + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/deepfakes-accelerating-crypto-scams-on-twitter-more-crypto-news.htm","publishDate":"2024-02-09T14:34:14","id":19642,"type":null,"title":"Deepfakes Accelerating Crypto Scams on Twitter + More Crypto News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In today’s edition:","__________","Online crypto fraud has increased in recent months due to the lack of moderation on Twitter and the use of artificial intelligence (AI).","El País reported that by the end of 2023, it had become impossible to be on Twitter without seeing false newspaper articles quoting celebrities as saying things they never said.","Ruth García, a Spain’s National Cybersecurity Institute (INCIBE) technician, explained that people easily fall victim to deepfakes as they become increasingly sophisticated.","“In general terms, we are identifying an increase in publications whose purpose is to misinform. But surely the most problematic aspect is the appearance of deepfakes, because they are more difficult to identify.”","The report said impersonating media outlets and falsifying news became popular during the crypto boom. Twitter, in particular, is “the perfect breeding ground” for  deepfake crypto scams to “proliferate again.”","As soon as Elon Musk took over, he fired content moderators and reinstated fraud- and hate-speech-related accounts. This resulted in many well-known companies pulling the plug or drastically reducing advertising on this social media site, leaving room for advertisers promoting scams.","Alberto Redondo, head of the Spanish Civil Guard’s criminal cyber-intelligence group, said that the scam campaigns are cyclical and within the scheme of false investments.","The biggest scam currently in circulation is being carried out by very well-organized and serious criminal groups.","The scam works in phases: one group seeks victims on social media, promising crypto investment gains.","After the victim provides information for the purported crypto purchase, another group collects this sensitive data to sell to external platforms.","Redondo said that,","“In some cases, they even go so far as to impersonate your identity, with all the risks that this entails.”","And it’s not easy to leave the scam either. Scammers work to convince their victims that it is not a good time to withdraw money but instead invest more.","Per Redondo, “when they finally realize that they have been scammed and report it, recovering the lost money is impossible, because these companies disappear.”","Austrian fintech unicorn Bitpanda announced that its users will no longer be charged a fee to deposit or withdraw money from the platform, regardless of the currency or transaction method used, according to the press release.","It explained that this enables people to make more flexible and impactful decisions about how they invest and react to market changes.","Per the company,","“Bitpanda is the only broker to completely remove fees for all currencies and for all payment and withdrawal methods, from PayPal to Apple Pay, credit cards, and debit cards.”","CEO and co-founder Eric Demuth argued that removing all deposit and withdrawal fees sets a new standard and will ultimately further improve user experience for investors.","Additionally, Bitpanda has increased payment limits across the platform. It has raised the daily credit card limit from €10,000 to €20,000. Hence, it now offers one of the highest daily and monthly limits available in Europe, it stated.","Furthermore, this wider series of changes will include the addition of new transaction methods. Bitpanda’s partnership with PayPal was announced in December. It is already live in some markets and will roll out across the Eurozone and Switzerland in the coming months.","Moreover, the broker will be adding several new local verification methods and plans to undertake greater localization in several key markets this year.","“Together, these changes make trading more accessible, increase transparency, and ultimately maximise the impact of user deposits or returns,” the press release said.","Demuth stated that, “to be successful, we have to be a local player in every market that we operate in. That means being more local and more accessible for everyone, regardless of where they are based. […] We are able to reduce the payment fees to zero because of one reason: Our users are very sticky, once they decide to trust Bitpanda.”","In other crypto news, the total Bitcoin reserves held by public mining companies finally returned to the 40,000 BTC level, according to the latest Miner Weekly report by BlocksBridge Consulting, citing TheMinerMag data.","Fourteen out of seventeen public mining companies that TheMinerMag regularly tracks have so far released production updates for January.","They sold 3,907 BTC, representing 68.68% of their total production. This is the lowest ratio since July.","Furthermore, about half of them, including Core Scientific and Iris Energy, have been consistently selling 100% of their monthly productions.","Other miners “decided on a hybrid treasury strategy.” They sell a portion of their production depending on the market environment.","“Even though Bitcoin retreated from a local high of $49,000 after a dozen Bitcoin spot ETFs began trading, it found support above $40,000, and some public mining companies reduced the amount of Bitcoin they needed to sell to fund operating expenses,” the report noted."],"entity":[{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"68.68%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Redondo","content":"LOCATION"},{"type":"Eric Demuth","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"BlocksBridge Consulting","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Ruth García","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Spain","content":"LOCATION"},{"type":"National Cybersecurity Institute (INCIBE","content":"ORGANIZATION"},{"type":"Bitpanda","content":"PERSON"},{"type":"Alberto Redondo","content":"PERSON"},{"type":"$49,000","content":"MONEY"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitpanda","Mining","Twitter"],"authors":["Sead Fadilpašić"]}