{"summary":"Expert Opinions: Massive Inflows to Follow Spot Bitcoin ETF Approval, Bull Market Questionable","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/expect-massive-inflows-to-follow-spot-bitcoin-etf-approval-but-bull-market-is-still-in-question-experts-say.htm","publishDate":"2024-01-19T11:05:28","id":19656,"type":null,"title":"Expert Opinions: Massive Inflows to Follow Spot Bitcoin ETF Approval, Bull Market Questionable","category":["Bitcoin News "],"content":["Talking with Cryptonews, three experts have shared their views on spot Bitcoin ETFs trading volumes.","They discussed the initial price drop post-approval, how the US Fed and presidential election could affect the market, BlackRock’s marketing approach, the benefits and downsides of the new product, and more.","For this article, we talked to Vijay Marolia, the Managing Partner and Chief Investment Officer of Regal Point Capital and a money manager with over 20 years of capital markets experience, Shane Rodgers, the Chairman and Co-founder of the PDX platform, and Dan Hoover, the Chief Operating Officer and Chief Compliance Officer at investment firm Castle Funds.","Read on to learn what they told us.","Talking about the approved spot Bitcoin ETFs trading volumes, Vijay Marolia opined that “Bitcoin isn’t going away anytime soon.”","Shane Rodgers argued that volumes indicate the size and scope of the new ETF market. They suggest that BTC adoption and investment will continue to grow for the foreseeable future.","“We’ll see that reflected in direct BTC prices and trading volumes,” said Rodgers.","He added that the market is correct to anticipate massive inflows.","“This will drive BTC prices and crypto valuations overall well into the future.”","The market saw an initial price decrease following the new Bitcoin ETF approval.","Per Marolia,","“This as the first act of a strategic shift in institutional investors exposure—this is not necessarily a vote on a bull or bear market.”","Rodgers argued that the drop doesn’t tell us much at all – only that BTC is behaving like a normal financial asset more and more. These moves are quite normal in traditional financial assets, he said.","He added that “it should also always be remembered that retail investors are ‘sheep’. Most recent Bitcoin selling has been profit taking, overtaken by unfounded worry from the retail crowd.”","Most Bitcoin trading happened on Binance and some of the bigger Asian exchanges. But the selling was “unsophisticated,” Rodgers opined, “and in our view created a nice buying opportunity.”","Rodgers also commented on some recently expressed BTC supply shortage concerns. When asked if these are valid, he replied “Absolutely not.”","Bitcoin is a digital asset divisible by 18 decimal points, making the maximum supply of 21 million BTC irrelevant, he said. Therefore, there will never be a shortage of BTC.","As time goes by, things are bound to change. The question is in which direction.","Rodgers commented that the near-term and long-term impact of the new Bitcoin ETFs on the market is positive. And not just for BTC, he added, but the entire crypto space.","Per Marolia, we are likely to see “slightly less volatility” in the coming months while average volumes start to increase. This follows the mentioned initial decrease. The expert argued:","“This is a healthy way of building a “base” of strong (read: long-term) investors.”","However, Marolia brought up a couple of key factors that will significantly impact the market in the coming years: the US Federal Reserve and the 2024 presidential elections.","One should keep in mind that Bitcoin was created due to a lack of trust in global fiat monetary systems, he noted.","“If the Fed lowers rates or ANY democratic wins the election (including undercover democrat, Nikki Haley, this is BULLISH for Bitcoin and will cause more inflation.”","On the other hand, should Donald Trump win the election (again), Marolia opined that it would slow down or delay another strong bull market in Bitcoin. He said that it would likely cause dollar strength and that, just like gold, we price Bitcoin in dollars.","BlackRock has been making headlines left and right, specifically in the ETF context.","It seems that BlackRock is targeting an audience besides crypto enthusiasts. Asked if this is the correct approach, Rodgers said it is – especially at this point in the maturity cycle for the asset class.","“This helps us get past reliance on the unsophisticated average retail investor, to more prudent investors with greater capital and better judgement. It’s a step along the way to increasing mass adoption.”","Meanwhile, the company recently purchased 11,439 BTC. Per Rodgers, however, this purchase, in and of itself, has “zero meaningful impact.”","Dan Hoover, the CCO\/COO at Castle Funds, said he doesn’t believe that BlackRock is buying this much BTC for themselves. The number was implied by the increase in assets under management (AUM) reported for the iShares Bitcoin Trust (IBIT) after the first two days of trading, he said.","“If this is the case, I think that this is a positive sign that the ETP’s can in fact scale their creation (and, theoretically, their redemption) processes in an orderly fashion.”","If the BTC were purchased over the holiday weekend, it shows that risk-management processes are in place, such as hedging. This helps mitigate risk to the market-makers and Authorized Participants (APs). This is healthy for both the ETP holders and the market in general, he argued.","But downsides remain, Hoover noted. The Bitcoin market relies on transparency in holdings and movements, tracking flows across different wallets with each block mined.","However, he said, BlackRock – or any of the brokers they are using to buy the underlying BTC – are unlikely to be readily identifiable on chain for now. This will persist at least until the patterns of ownership are worked out.","“When added to the timing delays, the net result is confusion and volatility until the market learns how to track and adapt to these market actors,” Hoover said."],"entity":[{"type":"Shane Rodgers","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Marolia","content":"LOCATION"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Marolia","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Rodgers","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Castle Funds","content":"ORGANIZATION"},{"type":"CCO","content":"ORGANIZATION"},{"type":"Vijay Marolia","content":"PERSON"},{"type":"Nikki Haley","content":"PERSON"},{"type":"Hoover","content":"PERSON"},{"type":"US Fed","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Cryptonews","content":"PERSON"},{"type":"Dan Hoover","content":"PERSON"},{"type":"ETP","content":"ORGANIZATION"},{"type":"Regal Point Capital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin ETF","Blackrock","Market"],"authors":["Sead Fadilpašić"]}