{"summary":"Crypto Assets Under Management Surge 36.7% in January as Markets Recover, But Grayscale Situation Remains “Delicate”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-assets-under-management-surge-367-january-as-markets-recover-but-grayscale-situation-remains-delicate.htm","publishDate":"2023-02-01T14:50:00","id":19655,"type":null,"title":"Crypto Assets Under Management Surge 36.7% in January as Markets Recover, But Grayscale Situation Remains “Delicate”","category":["Bitcoin News "],"content":["Total assets under management (AUM) for digital asset investment products surged a whopping 36.8% to $19.7 billion in January, its highest level since May 2022, CryptoCompare said in its latest monthly Digital Asset Management review report. According to the crypto intelligence firm, “bullish sentiment was driven by liquidated short positions and a favorable macro environment, reflected in the most recent CPI announcement, which saw Bitcoin’s price reach $23,000; its highest level since August 2022”.","However, CryptoCompare noted that AUM is still 38.7% below its level in January 2022 “due to a difficult year for Bitcoin, the wider cryptocurrency market, and traditional assets”. It is widely agreed amongst analysts that the main trigger of 2022’s risk asset and crypto bear markets was a surprisingly aggressive hawkish shift in the policy stance of the US Federal Reserve and other major central banks in order to clamp down on a stronger-than-expected surge in global price pressures.","Despite the January revival in crypto market sentiment that has also resulted in a rebound on crypto investment product AUM, CryptoCompare noted that the situation relating to Grayscale’s Bitcoin Trust (GBTC) remains delicate. While GBTC remains the dominant Bitcoin investment trust product in terms of AUM, with a market share of 69.3%, CryptoCompare noted that “the discount associated with Grayscale’s GBTC Trust has only slightly narrowed” in January.","The GBTC discount refers to the percentage that GBTC shares are trading below their net asset value. As of the 31st of January, the GBTC discount was a staggering 42.29%, only slightly above record lows printed last December in the 48% area. CryptoCompare explains that “the situation remains delicate” with Grayscale facing challenges including “the bankruptcy announcement of its sister company Genesis due to exposure to FTX in January, and the ongoing lawsuit against the SEC to convert its Bitcoin Trust into an ETF”.","The latest CryptoCompare report chimes with the latest weekly fund flows report from CoinShares. According to CoinShares, digital asset investment products saw their largest inflows since July 2022 last week, with Bitcoin dominating and accounting for $116 million of the inflows. January clearly saw a resurgence of appetite amongst institutional investors for crypto investments.","But that resurgence looks set to be put firmly to the test this Wednesday. The Fed is scheduled to release its latest monetary policy decision at 1900GMT and is expected to raise interest rates by 25 bps to a 4.50-4.75% target range. That would mark another slowdown in the pace of rate hikes after the Fed lifted rates by 50 bps at its last meeting and 75 bps at each of its previous four meetings prior to that.","Optimism about a less aggressive Fed as inflation shows significant signs of cooling and forward-looking economic indicators point towards a probable US recession later this year was a key pillar of January’s rally. But macro strategists are warning that market optimism may have gone too far. Markets expect just one more 25 bps rate hike after today’s move and rate cuts later this year, but Fed Chair Jerome Powell may signal more hikes ahead, and may push back against the idea of rate cuts later this year.","Traders should brace for the risk of an aggressive short-term pullback in crypto prices – for the longer-term bulls this might present a new opportunity to buy the dip, given growing signs that the 2022 bear market is over."],"entity":[{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"August 2022","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"36.8%","content":"PERCENT"},{"type":"January 2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$19.7 billion","content":"MONEY"},{"type":"Digital Asset Management","content":"ORGANIZATION"},{"type":"4.75%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"July 2022 last week","content":"DATE"},{"type":"38.7%","content":"PERCENT"},{"type":"Grayscale’s GBTC Trust","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"69.3%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Grayscale’s Bitcoin Trust","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$23,000","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"42.29%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"48%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"$116 million","content":"MONEY"}],"hashtag":["Bitcoin","btc","CRYPTO","Grayscale"],"authors":["Joel Frank"]}