{"summary":"Genesis Agrees to Pay $21M Fine to Settle SEC Crypto Lending Charges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/genesis-agrees-to-pay-21m-fine-to-settle-sec-crypto-lending-charges.htm","publishDate":"2024-03-19T20:59:21","id":19650,"type":null,"title":"Genesis Agrees to Pay $21M Fine to Settle SEC Crypto Lending Charges","category":["Blockchain News "],"content":["Bankrupt cryptocurrency lender Genesis Global Capital has agreed to pay a $21 million fine as part of a final court judgement to settle charges with the U.S. Securities and Exchange Commission (SEC).","In an official ruling released on March 19, the SEC highlighted the reason for the penalty is related to Gemini Earn.","The Gemini Earn program, created by the Gemini exchange, allows investors to earn up to 7% APY via its interest-earning program. Gemini partnered with Genesis as its lending partner for the Earn product.","SEC Chairman Gary Gensler explained the regulatory enforcement, saying, “We charged Genesis with failing to register its retail crypto lending product before offering it to the public, bypassing essential disclosure requirements designed to protect investors.”","In November 2022, following the implosion of FTX, Genesis paused withdrawals from Gemini Earn customers, which froze assets of thousands of Earn customers. At the time, Gemini Earn customers had approximately $900 million in assets locked up in Genesis.","Today’s settlement with the SEC concludes over 14 months of court proceedings. The financial watchdog also explained that Genesis consented to a final judgement that imposes a permanent ruling prohibiting them from engaging in future violation of registration provisions in federal securities laws.","“Today’s settlement builds on previous actions to make clear to the marketplace and the investing public that crypto lending platforms and other intermediaries need to comply with our time-tested securities laws,” Gensler noted in the release. “Doing so best protects investors. It promotes trust in markets. It’s not optional. It’s the law.”","According to the press release, the $21 million civil penalty will only be paid to the SEC after all lingering claims have been satisfied in the ongoing Chapter 11 bankruptcy proceeding. One of the claims to be fulfilled before paying the fine is that Gemini Earn investors are made whole.","While Genesis did not deny or admit to the SEC’s allegations, the penalty could set a precedent for other crypto exchanges in court with the regulator on charges related to unregistered securities.","As part of the plans to repay its customers, Genesis disclosed its intent on February 28 to refund over $1.1 billion to Gemini Earn investors.","According to Genesis, investors will receive 100% of their crypto assets and possible bonuses.","“This means, for example, that if you had lent one bitcoin in the Earn program, you would receive one bitcoin back. And it means that you will receive any and all appreciation of your assets since you lent them into the Earn program,” the company wrote. “If approved, we will be returning over $1.8 billion in value (at today’s prices)—$700 million more than when Genesis halted withdrawals on November 16, 2022.”","The settlement with the SEC comes a few weeks after it settled with the New York Attorney General (NYAG).","The NYAG sued DCG, Genesis, and Gemini last year. Attorney General Letitia James alleged that they conspired in fraudulent schemes involving Gemini’s Earn product.","The Digital Currency Group (DCG), Genesis’ parent company, strongly opposed the settlement, arguing that the settlement between the New York Attorney General (NYAG) and Genesis was not genuine.","Genesis “cannot, under the guise of a ‘settlement,’ take value from lower classes and redistribute it to preferred creditors in violation of absolute priority,” DCG explained.","DCG is a venture capital firm focusing on the crypto markets that owns some notable crypto brands, including crypto lender Genesis, Bitcoin exchange Luno, and Grayscale Investments."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$700 million","content":"MONEY"},{"type":"Genesis","content":"PERSON"},{"type":"November 16, 2022","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"$900 million","content":"MONEY"},{"type":"February 28","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"$21 million","content":"MONEY"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Genesis","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Gemini","Genesis","SEC"],"authors":["Jimmy Aki"]}