{"summary":"AI and Crypto Mining to More Than Double Energy Use by 2026, Report Says","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ai-and-crypto-mining-to-more-than-double-energy-use-by-2026-report-says.htm","publishDate":"2024-01-26T21:48:55","id":19668,"type":null,"title":"AI and Crypto Mining to More Than Double Energy Use by 2026, Report Says","category":["Blockchain News "],"content":["The International Energy Agency (IEA) anticipates substantial increases in energy consumption from crypto mining and artificial intelligence (AI) in the coming years, with projections suggesting a more than 30% surge by 2026.","The IEA’s Electricity 2024 report outlines the expected growth in energy usage through 2026, highlighting that power generation, including for crypto mining purposes, remains a major contributor to carbon emissions but is leading the transition to net-zero emissions.","Meanwhile, renewables are forecasted to become the primary sources of power by 2025, according to the report.","The report noted that energy consumption by data centers, AI, and crypto mining facilities may surpass 1,000 terawatt-hours (TWh), more than doubling in the specified timeframe.","Data centres are now the main drivers of electricity demand growth in many regions","And electricity consumption from the sector — along with AI & cryptocurrency — could double by 2026","Energy efficiency improvements will be key to address rising demand: https:\/\/t.co\/JfBLS2p2Pg pic.twitter.com\/JOuORlMJnX","— International Energy Agency (@IEA) January 24, 2024","","In terms of AI specifically, the report said the growing sector is set to experience a tenfold increase in power consumption between 2023 and 2026, with large language models (LLMs) like ChatGPT alone expected to consume nearly 10 TWh per year.","The rise in energy usage from crypto and related activities is projected to reach the level of Japan’s electricity consumption.","In 2023, Bitcoin mining alone consumed 120 TWh, up from 110 TWh in 2022.","Despite the report acknowledging that crypto mining constitutes a small portion of global energy consumption, it did raise concerns about challenges in reducing electricity consumption.","The IEA predicts that crypto mining will consume 160 TWh by 2026."],"entity":[{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"International Energy Agency (IEA","content":"ORGANIZATION"},{"type":"IEA","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"International Energy Agency","content":"ORGANIZATION"},{"type":"January 24, 2024","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"}],"hashtag":["AI","Bitcoin","Mining"],"authors":["Fredrik Vold"]}