{"summary":"Georgia Protests ‘Are Funded by Overseas Crypto,’ Claims Security Service","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/georgia-protests-are-funded-by-overseas-crypto-claims-security-service.htm","publishDate":"2024-05-09T23:30:19","id":19664,"type":null,"title":"Georgia Protests ‘Are Funded by Overseas Crypto,’ Claims Security Service","category":["Blockchain News "],"content":["Georgia’s security service has claimed overseas actors are using crypto to fund a spate of protests that have divided the country.","Thousands have taken to the streets in the capital Tbilisi in recent days, with smaller protests also taking place in the cities of Zugdidi, Kutaisi, and Gori.","But the State Security Service of Georgia (SSSG) says the masterminds behind the protests are using “funds from abroad.”","And, the SSSG claimed, protest organizers are making use of crypto in a bid to “cover their tracks.”","","The SSSG is Georgia’s state intelligence agency. Per the Georgian media outlet Ambebi, the SSSG said that “a group of people” based overseas is “planning and organizing rallies in the Georgian capital.”","The agency claimed that these individuals want to engineer “destructive and violent incidents.” And the SSSG said:","“Citizens of Georgia who are based abroad – in particular a certain group of Georgians participating in the hostilities in Ukraine – in taking part in criminal plans.”","The agency accused these overseas “agents” of plotting to sabotage Tbilisi’s traffic networks.","The agency said agents also plan to barricade access to the roads around government institutions and strategic facilities.","It claimed these same individuals plan to block railway networks and “set up encampments” outside law enforcement agencies. The SSSG explained:","“[The masterminds] funds are receiving funds from abroad. And they are using cryptocurrency, in many cases, to cover their tracks.”","The SSSG thinks that “foreign instructors” visited Georgia “at the end of April of this year” to conduct “cryptocurrency transaction-related training sessions.”","It said that “the organizers” of the protests “received instructions on how to secretly receive funding” for their “radical actions.”","Georgia's parliament approved the second reading of a bill on ‘foreign agents’ that has been criticized as Kremlin-inspired, as police fired tear gas and stun grenades to clear a large crowd of protesters opposed to the draft law https:\/\/t.co\/q5tbKoPNNQ","— Reuters (@Reuters) May 2, 2024","","","Protests have raged in Tbilisi in recent days, with many taking to the streets to vent their anger about a so-called “foreign agents” bill.","Many have taken to the streets waving EU flags, apparently concerned that their nation’s bid to join the European Union could result in failure.","The Georgian parliament is poised to vote on a bill that proposes labeling all political and civil society NGOs that receive over 20% of their funding from overseas “foreign agents.”","Critics say the bill is a copy of a Russian law that seeks to identify “foreign agents.” Moscow parliamentarians have accused Western-backed “foreign agents” of using crypto from abroad to fund their activities in Russia.","Vetoed the 'offshore' law and will keep vetoing any bill that contradicts Georgia's European and Euro-Atlantic aspirations.","Georgia's identity is European, unshakeable despite any attempts to distort it 🇬🇪🇪🇺","— Salome Zourabichvili (@Zourabichvili_S) May 3, 2024","","","An article in the British magazine The Spectator claimed:","“Such a law would [..] dash any hope of Georgia joining the EU. This week, in reaction to the government’s heavy-handed attempts to disperse the protestors, more than 30 members of the European Parliament called on Brussels to withdraw Georgia’s EU membership candidate status.”","The bill has become a political hot potato in Georgia, where President Salome Zourabichvili says she intends to veto the bill.","The nation’s parliament, however, has the power to overrule a Zourabichvili veto.","Western media commentators have claimed that the result of the vote could “mean revolution” for Georgia.","Government officials have claimed the protestors are agitated by Western-backed groups seeking a “revolution.”","The SSSG said that the protesters’ goal is to spark violence and “provoke law enforcement agencies.”","The agency warned of the danger of “panic, stampedes, serious injuries, and casualties” should the demonstrations continue.","Crypto remains popular in Georgia, as does crypto mining. In 2018, the nation began exploring plans to adopt blockchain technology in government operations."],"entity":[{"type":"May 2, 2024","content":"DATE"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Kremlin","content":"ORGANIZATION"},{"type":"Atlantic","content":"LOCATION"},{"type":"Tbilisi","content":"LOCATION"},{"type":"end of April of this year","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Georgia","content":"LOCATION"},{"type":"Zugdidi","content":"LOCATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"State Security Service","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Brussels","content":"LOCATION"},{"type":"Kutaisi","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Gori","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"May 3, 2024","content":"DATE"},{"type":"Salome Zourabichvili","content":"PERSON"},{"type":"SSSG","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["funding","Georgia"],"authors":["Tim Alper"]}