{"summary":"CEO Dan Schulman reiterated PayPal’s intentions to take a deeper dive into crypto on today’s investors call.\nThat includes positioning PayPal’s wallets as “the digital wallet for global CBDCs.”\nSchulman’s comments also pointed towards possible forays into tokenization and smart contract use.\nSchulman also said that PayPal’s crypto service will soon expand to the U.K.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94687\/paypal-ceo-central-bank-digital-currencies","publishDate":"2021-02-11T17:58:17","id":1967,"type":null,"title":"PayPal CEO says the payments giant wants to be &#x27;the digital wallet for global CBDCs&#x27;","category":["Startups"],"content":["PayPal CEO Dan Schulman said Thursday that he sees PayPal playing a significant role in the utility of central bank digital currencies (CBDCs).","On the company's investor day call, Schulman said PayPal is gearing up to be \"the digital wallet for global CBDCs.\"","PayPal's newly unveiled product roadmap for crypto includes becoming a CBDC platform. Schulman said he sees PayPal's digital wallets becoming the way in which central banks distribute tokens to consumers.&nbsp;","\"PayPal is a perfect complement to central banks and government to distribute those CBDC in a modern way so that more people can access the digital economy, and we think that is a focus area of this new business unit we have put together.\"","Still, some central banks are a long way off from issuing a CBDC. The European Central Bank head Christine Lagarde has said a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92783\/ecb-lagarde-digital-euro-technology\" data-v-f87c67ca=\"\">digital euro<\/a> could take years to accomplish, and the Federal Reserve is still in the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93142\/fed-stablecoin-hiring-innovations-program-stablecoins-1\" data-v-f87c67ca=\"\">research phase<\/a> of a possible digital dollar. In the meantime, Schulman said PayPal is looking to add utility to existing assets.","PayPal unveiled its product roadmap earlier this month in its <a href=\"https:\/\/www.theblockcrypto.com\/post\/93668\/paypal-crypto-business-unit-earnings-2021\" data-v-f87c67ca=\"\">Q4 2020 earnings call<\/a>. During that call, Schulman called the current financial system \"antiquated,\" which lead PayPal to build out a new unit focused on blockchain and the digital economy. Schulman reiterated those sentiments on today's investor call.","\"As we move to a modern tech — it could be distributed ledger technology, it could be other tech — we will see a shift in how digital forms of value will be moved around the world,\" he said.","And PayPal is planning to take a closer look at those other digital forms of value. Schulman's comments hinted at wider aspirations than just CBDC distribution. \"Step 1\" on the product roadmap is enabling crypto as a funding instrument on PayPal, but Schulman also indicated that PayPal is looking into digitizing other assets through the use of smart contracts and tokenization.&nbsp;","\"If you think of some of the utility in blockchain...you talk about digitizing assets...that can be broken down in smaller parts. That’s clearly stuff we are looking at and have on our roadmap,\" he said.","&nbsp;Part of creating utility in the present is thinking about the long term and what a new financial system might look like, according to Schulman.","\"This is a once in a multi-decade opportunity...where the fundamental rails are redesigned and we have an opportunity to reshape that,\" said Schulman."],"hashtag":[]}