{"summary":"A Resurgence of Faketoshis and the Search for the Real One","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/a-resurgence-of-faketoshis-and-the-search-for-the-real-one-3015.htm","publishDate":"2018-12-03T15:00:09","id":19685,"type":null,"title":"A Resurgence of Faketoshis and the Search for the Real One","category":["Bitcoin News "],"content":["Satoshi Nakamoto, the mysterious creator of Bitcoin, remains as unknown as ever, but perhaps not so elusive after all. New posts, like one on his\/hers social network P2PFoundation profile, seem to indicate that he\/she has not left the world for good. But is it him\/her, an impostor, or a practical joke?","The first seemingly significant thing that happened in November was the appearance of a Twitter account under the handle @satoshi (now closed by Twitter), which tweeted, “I do not want to be public, but, there is an issue with SegWit. If it is not fixed, there will be nothing and I would have failed. There is only one way that Bitcoin survives and it is important to me that it works. Important enough, that I may be known openly.” The tweet appeared on November 16th – incidentally, one day after the already infamousBitcoin Cash hard fork.","There had been previous tweets as well, mostly copy-pasted sentences from the Bitcoin whitepaper, as well as some numbers that are actually just plugged into formulae to calculate the probability of a successful attack on the network. The above mentioned tweet is the first one not to quote the whitepaper directly. However, the account was later suspended.","Then, on November 29th, Satoshi’s P2PFoundation profile showed some activity for the first time since early 2011. First, it added a guy named Wagner Tamanaha to its friends list, and then posed a single word, “nour,” which many from the community point out means “light” in Arabic.","However, there are claims that the email used by the account is [email protected], which was allegedly hacked back in 2014. The hacking incident was first brought to light on the Bitcointalk forum, where a user claimed to have received a message from that address writing, “Michael, send me some coins before I hitman you,” and pointing out that this is not really Satoshi’s usual style. Now, this could well mean that the P2PFoundation profile was compromised as well.","And that’s what most of the community seems to agree on: all of this is probably fake. Reddit user u\/mr_li_jr writes, “If anyone wants to claim to be Satoshi, they can move his coins. Anything else can be faked or hacked,” and this sentiment is echoed by most of the community throughout several social networks.","It would seem that the big question behind it was never the validity of the posts, but who’s behind them and why? Most of the community readily points at Craig Wright, often dubbed Faketoshi due to his claim that he is Satoshi Nakamoto and general lack of any sort of proof. The timing of the tweet claiming that Satoshi might reveal himself is suspicious enough, as it is a day after the BCH hard fork, when it seemed that Bitcoin SV, backed by Wright, would lose the battle.","Wright’s Twitter account is a cesspool of cryptic tweets. On the same day when the @satoshi account wrote its last tweet, Wright wrote, “I have done all I can for now to warn people. I will work to make the system right, it is not you, it is not your profit, it is sound money for the world. If you cannot understand that, I cannot make you. I hope that your children will,” later adding, “About a year from now, I have something to release, but, right now, I cannot. So, the place is marked and saved, and in the time it takes, you will find what that is… when it is fixed.”","Wright also wrote two tweets in Arabic around 7 hours after Satoshi’s “nour” post, both of which contain the word “light” in it. One translates to, “The light haunts the darkness,” while the other means, “The light of the world in trade.” Neither of those were subsequently explained, however.","Now the community is debating on whether the “Satoshi” accounts are controlled by Wright, or if he’s as clueless as the rest of the community but just trying to connect himself to those posts. Most believe that the latter is the case: Redditor u\/HiTierChris writes, “There is a huge time difference between when Craig posted that and when that was posted from Satoshi’s profile. Is there a possibility that Satoshi actually posted that and Craig saw that and now is pretending that it’s him?” and u\/JasonLeeH replies, “Yes, that’s exactly what is happening.”","However, this option also implies that if the accounts are neither owned by Satoshi or Wright, there is yet another Faketoshi in the game – Faketoshi v2.0, if you will. Maybe they’re trolling, maybe they want to spread FUD in the community, or maybe they’re just kids who are having a few laughs. Still, another unknown element in the game seriously hinders the possibility of ever discovering who Satoshi really is.","But should we discover it in the first place? Many in the community are content with letting sleeping dogs lie, while some are actively warning against demystifying the creator of the world’s largest cryptocurrency. Some even warn that it could put Satoshi in danger.","Whether or not Satoshi is still alive, following the crypto market or not, or maybe even debating coming back into the spotlight, one fact remains: nobody will believe him\/her until he proves he\/she has access to the original Satoshi’s private key, as well as funds. Until then, listening to the FUD can only be harmful in the long run. The question remains: does it matter who Satoshi is, and would his\/her reappearance really change anything?"],"entity":[{"type":"2014","content":"DATE"},{"type":"BCH","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Satoshi or Wright","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Satoshi’s “","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Michael","content":"PERSON"},{"type":"Wagner Tamanaha","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"HiTierChris","content":"PERSON"},{"type":"Craig","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"November 29th","content":"DATE"},{"type":"Faketoshi","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Community","Craig Wright","Satoshi Nakamoto"],"authors":["Sead Fadilpašić"]}