{"summary":"Crypto Infrastructure Firm Aquanow Obtains VASP License in Dubai","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-infrastructure-firm-aquanow-obtains-vasp-license-in-dubai.htm","publishDate":"2024-02-13T11:20:26","id":19695,"type":null,"title":"Crypto Infrastructure Firm Aquanow Obtains VASP License in Dubai","category":["Blockchain News "],"content":["Canadian-based crypto infrastructure firm Aquanow acquired a Virtual Asset Service Provider (VASP) license from financial authorities in Dubai.","In a Feb 12 announcement, Aquanow disclosed that it received the regulatory nod from the Virtual Assets Regulatory Authority (VARA) in Dubai to offer its service to the ever-growing market.","Big news: we've been awarded a VASP license by Dubai's VARA! 🇦🇪","— Aquanow (@aquanow) February 12, 2024","","According to the release, the license will remain non-operational until the company completes other obligations needed for the full license. Such conditions can include localization requirements and certain approvals.","“The license remains non-operational until the company fully satisfies all remaining conditions and select localization requirements defined by VARA, following which it will be able to commence operations, subject to regulatory verification and approval.”","This first step to securing full regulatory compliance in Dubai shows Aquanow’s commitment to international expansion and its plans to onboard new users to the platform.","The license will allow Aquanow to offer investment, management, lending, borrowing, and broker-dealer services in the jurisdiction.","Aquonow noted in the release that the approval came after a rigorous vetting process showing the high VARA standards.","Phil Sam, the CEO of Aquanow, lauded Dubai’s vision to become an innovation hub and its policies as a critical determinant for choosing the city as part of its expansion plans.","The company will now onboard crypto use cases and other services in line with the region’s effort to become a leader in digital technologies.","“We look forward to enabling a range of crypto use cases and contributing to the region’s efforts leading the virtual assets industry in balancing consumer protections with world-changing technology.”","Headquartered in Canada, Aquanow serves 300 institutional clients from 50 countries with diverse crypto use cases as part of its strategy.","Last year, multiple cryptocurrency commentators praised Dubai’s effort to roll out a regulatory framework in its plans to become a leading Web3 hub.","Established in March 2022, VARA aims to streamline the entire digital assets ecosystem, creating regulatory guidelines for all stakeholders.","The purpose is to protect investor assets from the prevalent crypto scams and fraudulent activities and create a growth map for the region to become a functioning Web3 hub.","Dubai seeks to tap into the potential of blockchain technology to boost trade and cross-border payments and attract Web3 firms to the city.","In February 2023, VARA released a regulatory guideline for companies operating in its jurisdiction that mandates firms to obtain their licenses before offering services to users. All companies must follow the rules regarding registrations, disclosures to authorities, and advertising with sanctions imposed on defaulters.","Aquanow’S VASP license takes it further in global regulatory compliance, a significant criterion for major investors."],"entity":[{"type":"Virtual Assets Regulatory Authority (VARA","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Aquanow","content":"ORGANIZATION"},{"type":"VARA","content":"ORGANIZATION"},{"type":"Phil Sam","content":"PERSON"},{"type":"VASP","content":"ORGANIZATION"},{"type":"February 12, 2024","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Virtual Asset Service","content":"ORGANIZATION"}],"hashtag":["Aquanow","CRYPTO","VARA"],"authors":["David Pokima"]}