{"summary":"NFT Infrastructure Moves: OpenSea Acquires Dharma, Coinbase Partners With Mastercard","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nft-infrastructure-moves-opensea-acquires-dharma-coinbase-partners-with-mastercard.htm","publishDate":"2022-01-19T09:08:00","id":19704,"type":null,"title":"NFT Infrastructure Moves: OpenSea Acquires Dharma, Coinbase Partners With Mastercard","category":["News "],"content":[" ","The market for non-fungible tokens (NFTs) is off to a strong start in 2022. While this is evident from the increasing number of NFT users and the rising volume of transactions, the recent decisions by some of the industry leaders further strengthen this perspective — as companies move to make it easier for an average user to buy NFTs.","Just yesterday, major NFT marketplace OpenSea announced the acquisition of crypto wallet startup Dharma Labs, while payments giant Mastercard unveiled a partnership with crypto exchange Coinbase to, as they said, simplify the NFT buying experience. ","In an announcement, Opensea said they are acquiring Dharma Labs to accelerate product development, expand safety and reliability efforts, invest in the NFT and Web3 ecosystems, and grow their team.","While details of the deal are undisclosed, a report earlier this month by Axios claimed that OpenSea was in discussion to purchase the initiative for between USD 110m and USD 130m.","Dharma Labs, a nearly five-year-old decentralized finance (DeFi) protocol, runs on Ethereum (ETH) and allows users to borrow, lend, and engage with other elements of the DeFi ecosystem. ","However, as part of the deal, Dharma’s app will be shut down and its users will be given one month to transfer assets to a different wallet.","Per Devin Finzer, co-founder and CEO of OpenSea, the two teams “share a vision that NFTs will be the cultural focal point of crypto’s adoption for years to come,” arguing that “that vision can only be realized if using NFTs becomes easy & delightful for the average person.”","Nadav Hollander, co-Founder and CEO of Dharma Labs, will become OpenSea’s new chief technology officer, while the platform’s current CTO Alex Atallah will start a new role as a representative for the recently announced NFT Security Group. ","As reported, OpenSea and crypto derivatives exchange FTX US announced their NFT marketplaces in mid-October. Meanwhile, a new decentralized NFT marketplace, LooksRare, outperfomed OpenSea by 4.25x in a matter of days since its debut.","In a bid to simplify buying NFTs “as buying a T-shirt or coffee pods on an e-commerce site,” Mastercard has teamed up with Coinbase to allow card payments on its yet-to-be-launched NFT marketplace.","Currently, users who want to purchase NFTs need to open a crypto wallet, buy some ETH or other accepted crypto, and then use it to buy an NFT. There are also technical complexities, as well as user interface (UI) \/ user experience (UX) hurdles with some of the wallets, which make this process even more complex.","“We’re working to make NFTs more accessible because we believe tech should be inclusive,” Mastercard said. “When more people are included in new technologies, it spurs innovation, helps economies grow and expands choices for consumers.”","Coinbase launched a waitlist for customers interested in its NFT marketplace, which attracted 1.5% of the exchange’s users by mid-October last year.","____","Learn more:\n– OpenSea Sees Massive Volume, Collections Gain Popularity as NFTs Boom in 2022\n– OpenSea To Expand Beyond Ethereum, Eyes ‘Broadening’ of Marketplace – CEO\n\n– Coinbase to Launch Crypto Derivatives in US, While Lawmakers Urge CFTC to Beef up Crypto Regulation\n– Mastercard, Bakkt Team Up To Integrate Bitcoin In Global Payments Network\n\n– Samsung Opens ‘Limited Time’ Store in Decentraland, Lures Metaverse Visitors With NFTs\n– How Music NFTs Could Disrupt the Music Industry\n\n– Metaverse Trends in 2022: Prepare for More Gaming and New Virtual Experiences with NFTs\n– Insiders Predict: NFTs the ‘Gateway Drug to Crypto’, More Countries May Adopt Bitcoin in 2022"],"entity":[{"type":"Nadav Hollander","content":"PERSON"},{"type":"NFT Security Group","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Devin Finzer","content":"PERSON"},{"type":"1.5%","content":"PERCENT"},{"type":"Music Industry\n\n– Metaverse Trends","content":"ORGANIZATION"},{"type":"Alex Atallah","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"mid-October","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Samsung Opens ‘Limited Time’ Store","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Opensea","content":"PERSON"},{"type":"OpenSea Sees Massive Volume","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Dharma Labs","content":"ORGANIZATION"}],"hashtag":["Adoption","Coinbase","Investment","mastercard","NFT","Non-fungible tokens","Opensea"],"authors":["Ruholamin Haqshanas"]}