{"summary":"Controversy Arises as Genesis Creditors Challenge DCG’s Claim of Full Debt Repayment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/controversy-arises-as-genesis-creditors-challenge-dcgs-claim-of-full-debt-repayment.htm","publishDate":"2024-01-10T05:23:14","id":19708,"type":null,"title":"Controversy Arises as Genesis Creditors Challenge DCG’s Claim of Full Debt Repayment","category":["Blockchain News "],"content":["Digital Currency Group (DCG) is facing allegations from an ad hoc group of lenders, claiming that DCG has not fulfilled its repayment requirements to its bankrupt subsidiary, Genesis Global.","Despite DCG’s recent announcement on X that it had fully repaid short-term loans from Genesis, the lenders assert that DCG entities still owe significant sums in both USD and BTC. Genesis and other debtors claim that DCG owes an undetermined amount of bitcoin, along with $26 million in interest and late fees, as specified in the repayment agreement and master loan agreements.","The lenders allege that DCG transferred $189 million in US dollars, along with the relinquishment of certain ETHE (Grayscale Ethereum Trust) shares and illiquid ETCG (Grayscale Ethereum Classic Trust) shares, purportedly to settle its BTC obligations.","1\/ On January 5th, 2024, @DCGco (and @BarrySilbert) triumphantly announced it had *finally* paid off a loan due in May 2023 to its child company Genesis (now in bankruptcy).","This announcement follows a pattern of deception used by Barry and DCG for over a year.","Thread time 🧵 pic.twitter.com\/nQeRll9V8y","— Vijay Boyapati (@real_vijay) January 8, 2024","","However, Genesis claims it cannot determine the outstanding bitcoin obligations until it sells the ETHE and ETCG and converts the proceeds into bitcoin, with the associated costs to be borne by DCG.","As of early December, ETCG was trading at a 69% discount to its net asset value, and ETHE was trading at a 50% discount. These funds, not approved by the US Securities and Exchange Commission, are sold over the counter. The creditors anticipate a true accounting after monetizing ETCG and ETHE shares, with the proceeds used to purchase Bitcoin, funded by DCG.","The disagreement extends to the form of payment, as the creditors argue that the Partial Repayment Agreement doesn’t allow DCG to settle its USD and BTC obligations with assets other than USD and BTC. The creditors express concern over the proposed use of illiquid instruments, specifically Grayscale Ethereum Classic Trust (ETCG) and Grayscale Ethereum Trust (ETHE), held as collateral.","Creditors argue that the repayment terms were breached, emphasizing that the agreement did not permit settlement in any form other than USD or Bitcoin. They also added that monetizing these shares and converting them to Bitcoin, even with DCG covering the purchase cost, is deemed insufficient by the creditors to rectify the repayment method issue.","The official committee of unsecured creditors, in a statement filed on Jan. 8, revealed that DCG, under the amended partial repayment agreement of Nov. 28, has a debt of 2,737.77102141 BTC and 14,048 Bitcoin Cash, with late fees of 10.12600241 BTC.","The conflicting claims set the stage for further legal scrutiny and resolution in this ongoing matter.This contradicts DCG’s claim that they owe more than $1.7 billion to Genesis and other creditors, including 4,550 BTC and 14,048 Bitcoin cash, along with additional late fees. Genesis stated that DCG owed them a notable sum of 4,550 BTC, which equated to approximately $214 million as of Monday.","Additionally, DCG had 14,048 units of Bitcoin cash valued at around $3.5 million on the same day, along with an extra charge of 70 bitcoins as late fees. However, DCG has not responded to the allegations. The proposed deal was an effort to allow Genesis to end a lawsuit against DCG filed in September that sought to have the firm repay overdue loans worth around $620 million.","Genesis filed for bankruptcy in January 2023 after suspending withdrawals in November 2022. In November 2023, Digital Currency Group (DCG) reached an agreement to settle all outstanding loans with Genesis by April 2024. This strategic move was part of resolving a legal dispute arising from Genesis filing for bankruptcy in January 2023.","The lawsuit, initiated in September, sought to compel DCG to repay overdue loans in an estimated amount of approximately $620 million. Genesis faced insolvency after suspending withdrawals in November 2022, revealing debts exceeding $3.5 billion to its top 50 creditors, including prominent entities such as Gemini and VanEck’s New Finance Income Fund."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Nov. 28","content":"DATE"},{"type":"$26 million","content":"MONEY"},{"type":"VanEck’s New Finance Income Fund","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 5th, 2024","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"$189 million","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"69%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$3.5 billion","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"January 8, 2024","content":"DATE"},{"type":"$214 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Grayscale Ethereum Classic Trust","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Barry","content":"PERSON"},{"type":"ETHE","content":"ORGANIZATION"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Genesis Global","content":"ORGANIZATION"},{"type":"Jan. 8","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$620 million","content":"MONEY"},{"type":"ETHE (Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["DCG","Digital Currency Group","Genesis"],"authors":["Hassan Shittu"]}