{"summary":"SEC Probing Crypto Firms to Classify Ethereum as a Security: Fortune Reports","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-reportedly-probing-key-crypto-companies-in-push-to-make-eth-a-security-fortune.htm","publishDate":"2024-03-20T21:04:01","id":19707,"type":null,"title":"SEC Probing Crypto Firms to Classify Ethereum as a Security: Fortune Reports","category":["Ethereum News "],"content":["The United States Securities and Exchange Commission (SEC) is reportedly serving subpoenas to several U.S. businesses as part of a “legal campaign” to formally classify Ethereum as a security, a Tuesday article from Fortune revealed.","According to the article by Fortune’s Leo Schwartz and Jeff Roberts, three prominent cryptocurrency businesses received subpoenas in recent weeks from the federal agency for records about the Ethereum Foundation, a non-profit organization supporting the Ethereum ecosystem.","🚨Scoop: SEC expands push to make Ethereum a security","Subpoenas sent to 3 well-known crypto companies asking for docs\/records about the Ethereum Foundation","Agency is using Merge as a pretext to reclassify. w\/@leomschwartz https:\/\/t.co\/SmxVY4LOjm","— Jeff Roberts (@jeffjohnroberts) March 20, 2024","","The aforementioned article notes that an anonymous employee at one of the subpoenaed companies claims the investigation began shortly after Ethereum shifted to its new proof-of-stake model in September 2022.","News of the SEC’s investigation follows shortly after CoinDesk published its own report Tuesday claiming that the foundation was being investigated by a “state authority” following a GitHub commit from the company posted on February 26, 2024.","Similarly, the Switzerland-based foundation took down its canary warrant designating that it had never been hit with a private government investigation on the same day.","The SEC had previously stayed quiet on its position regarding an Ethereum ETF following the approval of several spot Bitcoin ETF applicants in January 2024. ","Just last month, analysts predicted a 50% chance of the token’s SEC approval by May. ","We get it. Our credibility is what is drives our predictions. It isn't rooted in being btc lover or eth hater (personally we 100% think SEC should approve it) it's simply wanting to get it right, which we have decent record of. And right now it ain't looking good. I'm sorry. https:\/\/t.co\/6GOp5ALm49","— Eric Balchunas (@EricBalchunas) March 20, 2024","","However, news that SEC Chair Gary Gensler is leading the charge in hopes of classifying Ethereum as a security has made those odds drop quickly.","In a post to X on Tuesday, Senior ETF analyst for Bloomberg, Eric Balchunas, claimed odds were “not looking good” for the token’s SEC approval, following a 35% approval prediction from last week.","Correspondingly, fellow Bloomberg ETF analyst James Seyffart stated in an X post that the two researchers now believe the federal agency would ultimately reject Ethereum ETFs in May. ","My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round. The SEC hasn't engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall. https:\/\/t.co\/TyAzAOrAC5","— James Seyffart (@JSeyff) March 19, 2024","","The Bloomberg analysts went on to cite a lack of engagement from the SEC with potential issuers as one of the reasons for the denial, calling it the “exact opposite” of how the commission proceeded in the leadup to spot Bitcoin ETF approval.","SEC Chair Gary Gensler has been facing increased scrutiny for his handling of the federal agency, with the U.S. House Committee on Financial Services holding a hearing on Wednesday to discuss the commission’s potential reform.","During testimony on Wednesday, Congressman French Hill (R-LA) claimed the SEC under Gensler’s direction had “blatantly and repeatedly” overstepped “its statutory authority."],"entity":[{"type":"Jeff Roberts","content":"PERSON"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"February 26, 2024","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Leo Schwartz","content":"PERSON"},{"type":"March 20, 2024","content":"DATE"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"U.S. House Committee on Financial Services","content":"ORGANIZATION"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"James Seyffart","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"May 23rd","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"March 19, 2024","content":"DATE"}],"hashtag":["Ethereum as a security","Ethereum ETF","Ethereum Security"],"authors":["Julia Smith"]}