{"summary":"Coinbase Advertises Bitcoin Halving In New Commercial","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-advertises-bitcoin-halving-in-new-commercial.htm","publishDate":"2024-04-15T23:52:59","id":19721,"type":null,"title":"Coinbase Advertises Bitcoin Halving In New Commercial","category":["Bitcoin News "],"content":["The Bitcoin halving is less than one week away, and Coinbase is hyping up the event with a new commercial released on Monday.","The trading platform released the video on X illustrating how much Bitcoin’s price has appreciated over time by measuring its purchasing power in terms of pizza.","“Over time, your money gets you less. Does Bitcoin?” the ad’s narrator asks.","Food for thought:\nWhat if money was designed to get you more over time, not less?#Bitcoin pic.twitter.com\/z8eHF8JltQ","— Coinbase 🛡️ (@coinbase) April 15, 2024","","Back in 2010, early Bitcoin adopter Laszlo Hanyecz famously spent 10,000 Bitcoin to buy two pizzas, in what is widely known as the first-ever use of Bitcoin as a medium of exchange. By 2012, just one Bitcoin could purchase a pizza, and by 2020, Bitcoin was worth thousands of dollars per coin.","“Roughly every four years, the future supply of Bitcoin is reduced,” the Coinbase ad said. “So historically, you get more, not less. Bitcoin moves money forward.”","Coinbase refers to the “Bitcoin halving” in the video, when Bitcoin’s supply issuance rate is cut in half every 210,000 blocks. The next Bitcoin halving takes place at block 840,000 in approximately 4 days, and will reduce Bitcoin block payments to miners from 6.25 BTC per block to 3.125 BTC per block.","This effectively lowers Bitcoin’s inflation rate to less than that of gold, to which the asset’s promoters often compare it to as a reliably scarce store of value. Historically, the event has also been followed by a sharp increase in Bitcoin’s price roughly 12 to 18 months later, theoretically due to the ensuing supply crunch.","Even Bitcoin miners are bullish on the event, despite the fact that it will reduce their revenues in the short term.","“The supply shock of the halving has historically been linked to exponential runs in the price of Bitcoin, which counteracts the impact on miner revenues,” an IREN spokesperson told Cryptonews last week.","Coinbase isn’t the only one promoting the halving: even the multinational bank TD released a commercial last week emphasizing how Bitcoin’s halving creates a supply crunch.","“Bitcoin was designed so only 21 million coins can be created, but instead of flooding the market with all the coins at once, the supply of new coins is slowly released into the market every day,” the commercial stated.","By contrast, Coinbase released a report last year arguing that the halving isn’t as impactful on Bitcoin’s price as people think and that the crypto market is more impacted by macroeconomic cycles."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"April 15, 2024","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Laszlo Hanyecz","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin halving","Coinbase"],"authors":["Andrew Throuvalas"]}