{"summary":"Australian Federal Court Rules in Favor of ASIC, Against Unlicensed Qoin Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/australian-federal-court-rules-in-favor-of-asic-against-unlicensed-qoin-crypto.htm","publishDate":"2024-05-03T12:21:46","id":19723,"type":null,"title":"Australian Federal Court Rules in Favor of ASIC, Against Unlicensed Qoin Crypto","category":["Altcoin News "],"content":["An Australian Federal Court on Friday, ruled in favor of the Australian Securities and Investments Commission (ASIC) regarding an unlicensed crypto platform that misled customers.","The court noted that a Gold Cost crypto promoter – BPS Financial – allegedly broke the law by promoting unlicensed crypto wallet. The firm misled customers while offering the ‘Qoin Wallet’, a non-cash payment facility which used a crypto-asset token called ‘Qoin.’","ASIC Chair Joe Longo cautioned the highly volatile and risky behavior of crypto assets, emphasizing the importance of authorized licenses.","“It is critically important that providers have the appropriate licenses and authorizations, and that investors are provided with clear and accurate information.”","Longo also stressed that ASIC has been constantly taking enforcement actions against unlicensed crypto businesses.","Justice Downes noted that BPS breached the Corporations Act as it did not hold an Australian Financial Services license. He also found that the firm misled customers making false representations concerning Qoin Wallet.","Qoin launched in Australia in early 2020, promising multi-fold returns to those who invest in it. One of the claims made by the firm include projecting Qoin Wallet as officially registered, which was not the case.","Sooner, business owners expressed uncertainty over the future of the digital currency. Concerns raised about possible misinformation and an inability for some to cash out.","Following this, Australia’s corporate regulator launched court action alleging advertisements promoting Qoin, misled consumers by giving them the false impression. The adverts promised that investors could confidently exchange Qoin for other currencies and that there were merchants who accept it.","Over 79,000 individuals and entities who bought Qoin may have believed that the product was compliant with financial services laws. However, in 2022, the ASIC alleged that it was not the case, lodging civil penalty proceedings in the Federal Court against BPS Financial.","“This is an important case for us because it is the first occasion really where we’ve taken court proceedings alleging that a crypto asset offering, so here the Qoin facility … is a financial product that is being offered,” said ASIC deputy chair Sarah Court at the time."],"entity":[{"type":"Longo","content":"PERSON"},{"type":"Downes","content":"PERSON"},{"type":"BPS Financial","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Australian Securities and Investments Commission","content":"ORGANIZATION"},{"type":"Joe Longo","content":"PERSON"},{"type":"Sarah Court","content":"ORGANIZATION"},{"type":"Australian Federal Court","content":"ORGANIZATION"},{"type":"Federal Court","content":"ORGANIZATION"},{"type":"ASIC","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Australian Financial Services","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"}],"hashtag":["ASIC","Australia","Qoin"],"authors":["Sujha Sundararajan"]}