{"summary":"Bitcoin Price Prediction as Gary Gensler Says Official SEC Account is ‘Compromised’ – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-prediction-as-gary-gensler-says-official-sec-account-is-compromised-whats-going-on.htm","publishDate":"2024-01-09T22:46:57","id":19746,"type":null,"title":"Bitcoin Price Prediction as Gary Gensler Says Official SEC Account is ‘Compromised’ – What’s Going On?","category":["Price Predictions "],"content":["The Bitcoin price just saw a sudden pump to new yearly highs near $48,000 after the US SEC’s official X account tweeted that spot Bitcoin ETFs had gained approval, for the BTC only to then drop as much as $3,000 to briefly below $45,000 after SEC Chairman Gary Gensler said that the official account is “compromised”.","The @SECGov twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.","— Gary Gensler (@GaryGensler) January 9, 2024","","“The SEC has not approved the listing and trading of spot bitcoin exchange-traded products”, Gensler was clear to emphasize.","Amid the confusion, the Bitcoin price was last changing hands around $46,000, down around 2% on the day.","The crypto market has been eagerly awaiting the SEC to approve multiple spot Bitcoin ETF applications as soon as Wednesday.","That’s why the Bitcoin price has been so sensitive to fake news being disseminated by the SEC’s “compromised” official account.","Crypto community members were quick to blast Gensler and the SEC’s incompetence for allowing itself to get hacked at such a sensitive time for the market.","“It’s wild that the SEC can scream and whine about the dangers of crypto etc… And at the same time, they can’t even keep their Twitter account secure”, lambasted @OhHaiAndy.","It's wild that the SEC can scream and whine about the dangers of crypto etc","And at the same time, they can't even keep their Twitter account secure.","\"BE CAREFUL WITH CRYPTO SCAMS!!!\"","\"OOPS SORRY, WE ACCIDENTALLY MOVED THE MARKETS WITH A HACK\"","— Your Friend Andy (@OhHaiAndy) January 9, 2024","","Geoffrey Miller said the hack was a “total failure of SEC cybersecurity” that “imposes billions of pointless losses on investors”.","“Do Better” he urged Gary Gensler.","This is so stupid.","The @SECGov X account gets hacked, falsely claims Bitcoin ETFs have been approved, Bitcoin surges, wiping out people who have used options to short Bitcoin.","Then the SEC announces the hack a few minutes later, reversing the claim, & Bitcoin falls, also wiping… https:\/\/t.co\/u3b2BasmS2 pic.twitter.com\/fJ3pNidoHO","— Geoffrey Miller (@primalpoly) January 9, 2024","","Dumb Bitch Capital, LLC comically suggested that the SEC conduct a multi billion dollar 3-year investigation into themselves in order to get to the bottom of the hack.","The SEC should conduct a multi billion dollar 3 year investigation on themselves so we can get to the bottom of the hack","— Dumb Bitch Capital, LLC (@dumbbitchcap) January 9, 2024","","Some users questioned why, if someone had hacked the SEC’s account, they would tweet approval and not rejection.","So you're telling me someone is smart enough to hack the SEC twitter, but also dumb enough to send an approval tweet while being long bitcoin futures instead of shorting bitcoin futures and sending a rejection tweet?","— Jason Strasser (strassa2.eth) (@strassa2) January 9, 2024","","After all, the market has been pumping for weeks on optimism about spot ETF approvals.","A rejection tweet would have triggered a much larger downside move.","If the \"hacker\" had half a brain he would've said the ETF was denied & got a -20% candle instead of this whipsaw","My money is on the intern clicking \"publish\" instead of \"schedule,\" & Gary is saving face calling it a Twitter hack while taking the intern out back to shoot him.","— Sicarious (@Sicarious_) January 9, 2024","","Others hailed the speed of the SEC’s recovery of control over its main account.","The SEC just set the world record for the fastest acount recovery after a hack on X. I smell tons of 🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀🐀 https:\/\/t.co\/BxlsUOjUAq","— Digital Asset Investor (@digitalassetbuy) January 9, 2024","","As a result, various X users theorized that the SEC’s main account wasn’t actually hacked.","Instead, they suggested that it was an intern who accidentally pressed “publish” rather than “schedule” on the SEC’s official spot Bitcoin ETF approval announcement tweet.","I think it was the official text for the SEC announcement tomorrow approving #Bitcoin ETFs.","Intern messed up.\nPulled the trigger early\/accidentally.","Not a hack.","— Bitcoin Archive (@BTC_Archive) January 9, 2024","","“Gary is saving face calling it a Twitter hack while taking the intern out back to shoot him,” quipped X user Sicarious.","If the \"hacker\" had half a brain he would've said the ETF was denied & got a -20% candle instead of this whipsaw","My money is on the intern clicking \"publish\" instead of \"schedule,\" & Gary is saving face calling it a Twitter hack while taking the intern out back to shoot him.","— Sicarious (@Sicarious_) January 9, 2024","","If these theories are correct, that means the SEC has already internally decided to approve spot Bitcoin ETFs.","All that’s left is the announcement, which they appear to have made a real hash of.","Whilst the SEC “hack” has caused chaos in the market on Tuesday, its unlikely to distract from Bitcoin’s positive outlook.","Assuming the SEC is about to approve multiple spot Bitcoin ETFs, near-term price predictions are likely to remain bullish.","Swathes of institutional and retail investors have been waiting for the approval Spot Bitcoin ETFs for some time.","Firstly, approval will be interpreted as a regulatory green light from the SEC, bolstering BTC’s credibility as an asset.","Secondly, buying spot Bitcoin ETFs through their existing brokers is an easy way for US investors to get BTC exposure.","Standard Chartered projected on Tuesday that spot Bitcoin ETF approvals in the US will result in $50-$100 billion in inflows.","That’s a major long-term tailwind for Bitcoin, hence why the bank also projected BTC hitting $200,000 in 2025.","The sudden demand shock that spot Bitcoin ETF approvals is expected to generate comes at a time when the Bitcoin market is about to experience a supply shock.","The issuance rate to miners will drop by half in April, reducing sell pressure from BTC miners.","Fed rate cuts are also expected to create currency debasement tailwinds for assets like Bitcoin and gold in the coming years.","Dip buying is thus likely to remain the mantra.","If the Bitcoin price does experience a “sell-the-fact” reaction to SEC spot Bitcoin ETF approval, expect a wave of buyers to be waiting on the sidelines to scoop up BTC as it approaches $40,000."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"Dumb Bitch Capital","content":"ORGANIZATION"},{"type":"$50","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$46,000","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"multi billion dollar","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"Geoffrey Miller","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"multi billion dollar 3","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"2025","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"$48,000","content":"MONEY"},{"type":"\" & Gary","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"-20%","content":"PERCENT"},{"type":"Gary","content":"PERSON"},{"type":"$45,000","content":"MONEY"},{"type":"Jason Strasser","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"January 9, 2024","content":"DATE"},{"type":"$100 billion","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","btc","SEC"],"authors":["Joel Frank"]}