{"summary":"XRP Price Prediction as XRP Overtakes Cardano to Become 6th Largest Coin in the World – Can XRP Overtake Bitcoin in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-price-prediction-as-xrp-overtakes-cardano-become-6th-largest-coin-world-can-xrp-overtake-bitcoin-2023.htm","publishDate":"2023-04-08T14:28:00","id":19755,"type":null,"title":"XRP Price Prediction as XRP Overtakes Cardano to Become 6th Largest Coin in the World – Can XRP Overtake Bitcoin in 2023?","category":["Altcoin News "],"content":["XRP, the token powering Ripple’s cross-border money transfer ecosystem, exhibited exemplary performance in March alongside Bitcoin and Ethereum, as investors kept the imminent summary judgment on the lawsuit against the US Securities and Exchange Commission (SEC) in the sight glass.","From the lowest price level in March at $0.3372, XRP price exploded 65% to trade new 2023 highs of $0.5847 before correcting to test support at $0.5. Support at $0.5 has been pivotal this week, as XRP tested $0.484 at some point before reclaiming its current position.","XRP’s market cap is up by 0.58% in 24 hours to $26 billion, surpassing Cardano’s $13.5 billion. ADA is performing relatively well on Saturday, up 2% to exchange hands at $0.38.","Meanwhile, XRP has attracted over $700 million in trading volume in the same 24-hour period, however, its price remains relatively unchanged at $0.51.","Most experts believe XRP is balancing at the edge of a tall cliff; where two scenarios are likely to play out. On the bright side, XRP may resume the uptrend, bolstered by possible bullish momentum ahead of the final ruling on the case with the SEC on or before May 6.","On the other hand, if support at $0.50 fails to hold and XRP price slides below $0.48, investors may start acclimatizing to a possible trend reversal. This means short positions could quickly turn profitable with targets at $0.45, $0.4, and $0.4, respectively.","On the other side of the fence, declines could liquidate most long positions taken in anticipation of Ripple winning the case.","The path with the least resistance is to the downside based on the position of the Moving Average Convergence Divergence (MACD) indicator. The sell signal, as observed on the chart above, manifested as the MACD line in blue crossed below the signal line in red.","The sell signal would have a dire impact on XRP price if bulls let go of the support area between $0.48 and $0.50. However, if this support is upheld, the technical outlook for XRP will keep improving toward $1.","According to the position of all the applied moving averages, the likelihood of XRP price recovering to $1 is greater.","In addition to a golden cross that came into play in late March, the 100-day Exponential Moving Average (EMA) (line in blue) is about to flip above the 200-day EMA (line in purple).","A golden cross pattern forms when a short-term moving average crosses above a long-term one. For example, when the 50-day EMA flips above the 200-day EMA. Traders consider the pattern bullish, which means chances of a pullback to $0.4 or $0.35, may reduce significantly.","The performance of XRP in 2023 will revolve around the Ripple vs SEC court case, whose summary judgment is expected on or before May 6. Investors are betting on Ripple winning the case as the biggest driver for XRP price in 2023.","However, as we draw closer to the ruling, new twists seem to be emerging. On April 7, attorney Bill Morgan took to Twitter to share that according to an admission made by the SEC’s expert, the fluctuations in XRP’s value since mid-2018 have been largely influenced by the prices of Bitcoin and Ethereum, accounting for up to 90% of the variations.","He put forth the idea that if the SEC’s expert assumption holds, it may suggest that Ripple is allowing the value of XRP to be affected by the price changes in Bitcoin and Ethereum.","Thus, the SEC aims to prove this claim by showing evidence that Ripple’s price announcements influence XRP’s value. Furthermore, the SEC could argue that the fact that Ripple holds substantial amounts of XRP makes the token centralized and subsequently a security.","Having said that, XRP has a significant distance to cover before it can pose a serious challenge to Bitcoin’s dominant position in the market.","Buy XRP Now.","Related Articles:",""],"entity":[{"type":"$0.5","content":"MONEY"},{"type":"90%","content":"PERCENT"},{"type":"0.58%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"Bill Morgan","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$0.4","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"EMA","content":"ORGANIZATION"},{"type":"$0.35","content":"MONEY"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$700 million","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"$0.38","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"$0.5847","content":"MONEY"},{"type":"$0.484","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"$26 billion","content":"MONEY"},{"type":"65%","content":"PERCENT"},{"type":"$0.50","content":"MONEY"},{"type":"$0.51","content":"MONEY"},{"type":"$0.45","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$0.3372","content":"MONEY"},{"type":"$0.48","content":"MONEY"},{"type":"$13.5 billion","content":"MONEY"},{"type":"Moving Average Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"April 7","content":"DATE"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Cardano","XRP"],"authors":["John Isige"]}