{"summary":"Ethereum Classic Price Prediction: Gives Back Gains at $37, Merge Still Value Supportive","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-classic-price-prediction-gives-back-gains-at-37-merge-still-value-supportive.htm","publishDate":"2022-09-08T06:47:00","id":19766,"type":null,"title":"Ethereum Classic Price Prediction: Gives Back Gains at $37, Merge Still Value Supportive","category":["Altcoin News "],"content":["Ethereum Classic (ETC), Ethereum (ETH), and Lido Finance (Lido) are just some of the cryptocurrencies that have taken significant losses in the last couple of days due to their association with the merger. However, Ethereum Classic is making a bullish reversal of 9.36% in 24 hours. ","Previously, Ethereum Classic has plunged by 13% as all eyes have been on ETC and the other Ethereum alternatives as the crypto community near The Merge. After the Merge is finalized, Hoskinson and Buterin have discussed the best course of action for Ethereum miners.","Cardano founder Charles Hoskinson has recommended that miners switch to Ergo, and on September 6, Hoskinson sent out a tweet encouraging Ethereum miners to move to Ergo over ETC.","If you're into proof of work, I'd recommend checking out @ErgoFoundation. Ergo is one of the few coins in the PoW space still innovating and has a great community.","Among the top 20 cryptocurrencies, Ethereum Classic, a hard split of Ethereum carried out after the 2016 DAO breach, caused a massive drop of more than 13% in just 24 hours; however, the bears jumped in immediately to capture an oversold altcoin. ","The Ethereum network has been using proof-of-stake (PoS), a new approach (or “consensus mechanism”) for verifying crypto transactions. Proof-of-work (PoW) is a more energy-intensive process pioneered by Bitcoin; however, it will be replaced by the new system. The whole process is known as Ethereum Merge.","The Ethereum Merge, which will transition the network from the Proof-of-Work (PoW) consensus model to the Proof-of-Stake (PoS) model, is scheduled to take place in the middle of September, as most cryptocurrency users are aware.","We are now just a few days away from this much-anticipated event, the planning for which has spanned years. But, as seen in the word cloud for Ethereum news on IntoTheBlock, the Merge has been one of the most talked about events outside of hacks and token collapses this year and has been ubiquitous throughout the previous week.","At the time of writing, the current price of Ethereum Classic is $37.25, with a 24-hour trading volume of $1.8 billion. In the last 24 hours, Ethereum Classic has gained 9.69%. CoinMarketCap now ranks #17, with a live market cap of $5 billion. There are 136,757,414 ETC coins in circulation, with a maximum supply of 210,700,000.","The ETC\/USD pair has made a bullish reversal above the $33.90 support level in the 4-hour timeframe. This level was extended by a 78.6% Fibonacci retracement, encouraging bulls to seize control of the oversold altcoin.","ETC consolidates in a narrow trading range of $36.75 to $38 after completing a 38.2% Fibonacci correction. ETC formed a Doji and a spinning top candlestick pattern, followed by a solid bullish rally. Typically, such a pattern indicates a trend weakness, as investors appear to be waiting for a compelling reason to enter the market.","On the upside, a surge in ETC demand could cut through the $36 resistance and open up additional buying opportunities until $39.35 or 41.85 resistance levels. Simultaneously, support remains at $36.75, $35.42, and $33.95."],"entity":[{"type":"Hoskinson","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"last 24 hours","content":"DATE"},{"type":"September 6","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"$38","content":"MONEY"},{"type":"9.36%","content":"PERCENT"},{"type":"38.2%","content":"PERCENT"},{"type":"$36","content":"MONEY"},{"type":"Buterin","content":"PERSON"},{"type":"$33.95","content":"MONEY"},{"type":"$1.8 billion","content":"MONEY"},{"type":"78.6%","content":"PERCENT"},{"type":"Ergo","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"$33.90","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"ETC","content":"LOCATION"},{"type":"$39.35","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"9.69%","content":"PERCENT"},{"type":"Doji","content":"ORGANIZATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Ethereum Merge","content":"ORGANIZATION"},{"type":"$37.25","content":"MONEY"},{"type":"ETC","content":"ORGANIZATION"},{"type":"ETC\/USD","content":"ORGANIZATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$36.75","content":"MONEY"},{"type":"$35.42","content":"MONEY"}],"hashtag":["Ethereum Classic"],"authors":["Arslan Butt"]}