{"summary":"TVL on Real-World Assets Spikes Up 700% as Stablecoin and CBDC Popularity Grows in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tvl-on-real-world-assets-spikes-up-700-as-stablecoin-and-cbdc-popularity-grows-in-2023.htm","publishDate":"2023-12-15T21:49:58","id":19764,"type":null,"title":"TVL on Real-World Assets Spikes Up 700% as Stablecoin and CBDC Popularity Grows in 2023","category":["Blockchain News "],"content":["Total value locked on real-world assets recorded a 700% surge year-to-date (YTD) alongside overall decentralized finance (DeFi) figures in 2023 as the market’s bullish sentiment continues.","A recent market report by CCData shows overall strength in the market after several months of harsh bearish numbers with institutional demand in cryptocurrency products rising into Q4 2023.","Institutional interest was recorded in Bitcoin (BTC), real-world assets, Assets Under Management (AUM), and derivatives although there was a decline in stablecoins, a preferred asset for traditional investors because of its backed reserves.","The stablecoin market saw plunging numbers at the start of the year despite other assets posting slight gains. Analysts viewed the trend as coming off the heels of growing signals for harsher regulations by authorities and the rapid development of Central Bank Digital Currencies (CBDCs).","However, after 18 months of consecutive outflows, stablecoin market capitalization rose in October as new capital was sparked by a drive in cryptocurrency funds and tokenization.","At press time, the stablecoin market cap stands at $129 billion, 30% below its all-time high of last year. While cryptocurrencies crashed in value last year, the downtrend of stablecoins wasn’t as sharp as altcoins due to investors utilizing them as a haven against inflation.","Analysts at CCData expect the market share to rise in the coming months in line with other cryptocurrencies as a new market cycle introduces a new demand for the assets.","A turning point for stablecoins in recent months is the surge seen in DeFi numbers pointing to the bullish outlook in the market. The downtrend in the market cap was due to a lack of yield activities with stablecoins used in most cases as bridge assets between wallets and DeFi protocols.","🙏 DeFi Value Locked Reaches Nearly $42 Billion as Token Market Experiences Significant Growth – Here's the Latest","The total value locked across DeFi projects has experienced a resurgence after teetering below the $40 billion mark last week.#CryptoNewshttps:\/\/t.co\/AcGRBjJRDN","— Cryptonews.com (@cryptonews) August 14, 2023","","“But, as is the case of innovative technologies, many stablecoins have incorporated treasury bonds as collateral, diversifying away from solely using cash and cash equivalents or other crypto assets.” ","The rise in the number of CBDC pilots and regulatory pressure in the market shaped institutional sentiment to a large extent in Q1 and Q2 2023.","At the moment, 130 countries are exploring CBDCs to expand payment options and create the perfect model to settle cross-border transactions. For most commentators, the exploration of stablecoins by central banks is a measure to limit the growth and utility of private cryptocurrencies.","Looking to the future, more CBDCs will be officially rolled out, and assets under management will also record growth as more institutional investors trickle into the market.","For tokenized assets, the 700% rise is expected to be a lift toward 2024 with institutions innovating around the sector and driving associated products.","“With more protocols tokenizing treasury bonds, real estate, and private credit, we expect the capital flowing into this sector to rise in 2024, with institutions particularly keen on this sector of the market. As a result, protocols innovating in the industry, and facilitating the exchange of RWA products…”"],"entity":[{"type":"August 14, 2023","content":"DATE"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$42 Billion","content":"MONEY"},{"type":"$129 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"700%","content":"PERCENT"},{"type":"DeFi Value Locked Reaches Nearly","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"30%","content":"PERCENT"}],"hashtag":["CBDC","Regulation"],"authors":["David Pokima"]}