{"summary":"Web3 Game Developer Wemade Reports Widening Losses in Q4 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/wemade-south-korean-web3-game-developer-reports-widening-losses-in-q4-2023.htm","publishDate":"2024-02-06T15:50:30","id":19770,"type":null,"title":"Web3 Game Developer Wemade Reports Widening Losses in Q4 2023","category":["Blockchain News "],"content":["South Korean Web3 game developer Wemade has disclosed a significant increase in operating and net losses in the fourth quarter of last year, as per its latest earnings report.","According to the report released on Tuesday, the Kosdaq-listed company’s net loss surged to 189.5 billion won ($142.6 million) in the fourth quarter of 2023, compared to 74.4 billion won in the same period of the previous year. Operating losses also widened to 70.8 billion Korean won in Q4 2023, up from 28.7 billion won in Q4 2022.","Despite this, Wemade generated 118.4 billion won in sales during the fourth quarter, marking a 2.8% increase year-on-year. On Tuesday, Wemade’s stock closed down by 2.25% to 49,950 won.","The gaming company attributed the sales growth to the domestic launch of its game Night Crows and the licensing agreement for its “MIR” franchise. However, the increasing operating losses were primarily attributed to rising sales-related and labor costs.","Losses from stock investments by affiliated companies and a decrease in the value of convertible bond derivatives also contributed to the expansion of net losses.","Wemade transitioned its focus from traditional video games to Web3 gaming and launched its native utility token WEMIX via its blockchain subsidiary Wemade Tree in 2020. Additionally, it rolled out its mainnet and stablecoin.","First issued in 2020, WEMIX tokens have returned 635% since inception and currently trade at $2.64 with a diluted market cap of $2.5 billion. It is an Ethereum Virtual Machine-compatible protocol that powers Wemade’s network of Web3 applications.","In 2017, South Korea banned initial coin offerings but is considering reversing the ban and imposing a 20% tax on profits arising from crypto transactions.","In December 2023, Wemade partnered with Whampoa Group to launch a $100 million Web3 fund to invest in digital asset initiatives in the Middle East. This collaboration also entails Whampoa Digital becoming an ecosystem partner for Wemade’s Wemix Play Center in the Dubai International Financial Centre Innovation Hub. The fund capital will support developers working on Wemix Play projects.","The newly launched Wemade Web3 Fund focuses on investing in blockchain gaming projects, primarily in the Middle East. The initiative’s overarching objective is to expedite the adoption of blockchain technology within the gaming sphere, as highlighted in the joint announcement.","However, amid this venture, Wemade disclosed an unrelated predicament, revealing its outstanding tax liability to South Korea’s tax authorities. The company owes a substantial 53.7 billion won ($41 million), equivalent to approximately 10% of its equity, potentially affecting its financial stability.","According to a January 3 filing with Kosdaq, the unpaid taxes pertain to WEMIX tokens issued by its subsidiary, Wemade Tree, from January 2019 to 2022. “The ‘imposed amount (KRW)’ above is the sum of the amount stated in the tax audit result notice imposed on our company and Wemade Tree Co., Ltd.”","Wemade is scheduled to hold its quarterly earnings call on Wednesday in Asia, where it plans to provide more insights into its 2023 performance and unveil upcoming strategies for the year ahead.","Despite South Korea’s restrictive stance on blockchain gaming, local studios persist in developing such games for international markets. Wemade, for instance, has been working on blockchain-powered adaptations of its existing games but has opted against releasing them domestically.","The South Korean government’s stance against blockchain gaming has been evident since early 2021. In January 2023, a court ruling prohibited the release of the play-to-earn game “Five Stars” due to concerns over promoting financial speculation through its NFTs."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"2.25%","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"$142.6 million","content":"MONEY"},{"type":"Dubai International Financial Centre Innovation Hub","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"January 2023","content":"DATE"},{"type":"635%","content":"PERCENT"},{"type":"$2.64","content":"MONEY"},{"type":"Whampoa Group","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Kosdaq","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Wemade","content":"PERSON"},{"type":"Middle East","content":"LOCATION"},{"type":"2.8%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January 3","content":"DATE"},{"type":"KRW","content":"ORGANIZATION"},{"type":"Wemade Tree Co.","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"the fourth quarter of 2023","content":"DATE"},{"type":"January 2019","content":"DATE"},{"type":"Ltd","content":"ORGANIZATION"},{"type":"fourth quarter of last year","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"December 2023","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Whampoa Digital","content":"ORGANIZATION"},{"type":"Wemade’s Wemix Play Center","content":"ORGANIZATION"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["Gaming","South Korea","Wemade"],"authors":["Hassan Shittu"]}