{"summary":"DCG has proposed a new creditor agreement in Genesis’s bankruptcy, offering unsecured creditors a 70-90% baseline recovery.\nThe firm submitted a filing on Wednesday that outlined the recovery math for the agreement. \nThe agreement, pending creditor approval, aims to renegotiate a $630 million loan between Genesis and DCG.\nGemini Earn users, who hold collateral worth approximately $607 million, have the potential to receive as much as 110% of their total claim, according to the firm. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250562\/new-dcg-plan-could-see-gemini-earn-users-get-back-all-their-crypto","publishDate":"2023-09-13T08:02:13","id":1977,"type":null,"title":"New DCG plan could see Gemini Earn users get back all their crypto","category":["Companies"],"content":["Digital Currency Group has proposed a new creditor agreement as part of Genesis's bankruptcy proceedings that could see Gemini Earn users recoup all of the crypto held by the platform — the latest development in the battle between the crypto empire run by Barry Silbert and counterparties that lent to Genesis Global.&nbsp;","DCG, which was ensnarled by the crypto credit crisis that swept the market last year, said that the plan provides a framework for creditors that would offer \"all unsecured creditors a 70-90% recovery with a meaningful portion of the recovery in digital currencies.\"&nbsp;","The firm submitted a filing on Wednesday that outlined the recovery math for the agreement, which was formalized in August. This is the second agreement in principle submitted, with the previous proposal offering DCG equity.&nbsp;","<span data-v-f87c67ca=\"\">Creditors would also be able to capture the upside of crypto appreciation, amounting \"to $85,000 for <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.34%\n    <\/span><\/a> <!----><\/span> and $8,500 for <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +2.56%\n    <\/span><\/a> <!----><\/span>,\" which DCG hopes will push creditors to commit to the new deal.&nbsp;<\/span>","In a statement, DCG described the return rates as representing a \"remarkable outcome for any liquidating chapter 11 case, let alone one in the volatile cryptocurrency industry.\"","DCG has made headlines this year for the ongoing negotiations between its subsidiary Genesis, which saw its lending unit file for <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">bankruptcy<\/a> protection at the beginning of 2023, and its creditors, namely Gemini. The latter firm has been feuding with DCG since Genesis froze withdrawals of its retail lending program Earn. Gemini co-founders Tyler and Cameron Winklevoss <a href=\"https:\/\/www.theblock.co\/post\/238387\/gemini-sues-digital-currency-group-barry-silbert-over-alleged-fraud\" data-v-f87c67ca=\"\">accused<\/a> Silbert and Genesis of misleading investors in a July suit. The twins' claims later sparked a probe of DCG by the U.S. Federal Bureau of Investigation and the Securities and Exchange Commission, according to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-09-07\/winklevoss-claims-fuel-us-investigation-of-barry-silbert-s-dcg-crypto-empire\" data-v-f87c67ca=\"\">Bloomberg News<\/a>.&nbsp;","As for the new agreement, which is pending a vote from creditors to be implemented, it would renegotiate the terms of a $630 million loan between Genesis and DCG. Under the terms, part of the loan will be paid back in cash shortly after the deal's close and then the remainder would be structured into a two year note.&nbsp;","DCG's Genesis owes approximately $1.1 billion to Gemini's Earn customers, which account for nearly 99% of all claimants, according to representatives of DCG. Those creditors, specifically, are in a slightly better position than the overall pool of creditors because of collateral that Genesis posted to Gemini as part of their business relationship. Genesis posted about 31 million of shares of GBTC as collateral, which has appreciated significantly and represents about 60% of the total balance owed to Earn clients, DCG representatives noted.&nbsp;","In total, Gemini Earn creditors could receive as much as 110% of their claim.&nbsp;","\"At current pricing, the Gemini User Collateral is worth approximately $607 million,\" the agreement notes. \"If Gemini agrees to provide $100 million to Gemini Earn users under the Proposed Agreement, as it previously did, or to distribute even a small portion of the Gemini User Collateral to Gemini Earn users, there would be little doubt Gemini Earn users would receive a full recovery,\" the firm said referring to a previous promise in February by Gemini to contribute to a potential shortfall.&nbsp;","DCG contends that Gemini is failing to \"put its money where its mouth is,\" noting in the filing that the firm \"is not contributing a single penny to provide Gemini Earn users a better recovery.\"","The remainder balance could be met by assets held by Genesis, including cash, stablecoins, and payments made to the firm by DCG as part of longer termed notes.&nbsp;","\"DCG is extremely proud of the deal it was able to achieve with the Debtors and the UCC, and believes the rightful owners of claims, including, importantly, Gemini Earn users, should have the opportunity to vote on the deal,\" DCG said.&nbsp;"],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","LAWSUITS"]}