{"summary":"Huobi Korea Announces Closure Citing Challenging Business Environment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/huobi-korea-announces-closure-citing-challenging-business-environment.htm","publishDate":"2024-01-04T11:04:52","id":19790,"type":null,"title":"Huobi Korea Announces Closure Citing Challenging Business Environment","category":["News "],"content":["South Korean cryptocurrency exchange Huobi Korea has announced the shut down of its services with effect from January 29, 2024. The decision comes in response to what the company described as a challenging “business environment.”","Established in 2017, Huobi Korea had severed ties with HTX (formerly Huobi Global) in January 2023. The closure announcement follows similar decisions by other smaller South Korean exchanges, including Cashierest and Coinbit, in November, along with the suspension of trading services by CoreDAX, which reportedly faced financial difficulties.","Huobi Korea assured its users that they would be able to withdraw their funds even after the shutdown, emphasizing a commitment to ensuring a smooth transition for its customer base.","The company’s decision aligns with a trend observed in the South Korean cryptocurrency market, with the top five exchanges—Upbit, Bithumb, Coinone, Korbit, and Gopax—dominating 99.6% of the total crypto trade volume as of June 30, 2023, according to the Financial Services Commission (FSC).","South Korea’s stringent regulatory environment for cryptocurrency exchanges, introduced through a 2021 amendment to the financial reporting law, requires these platforms to maintain a partnership agreement with a local bank to offer fiat-to-crypto services. The aim is to mitigate risks associated with money laundering and price manipulation. However, Huobi Korea, along with 20 other exchanges, failed to secure such partnerships, limiting them to crypto-to-crypto trading.","The forthcoming “Virtual Asset Investor Protection Act,” expected to be enacted in July 2024, is set to impose additional responsibilities on cryptocurrency exchanges for safeguarding user funds. These obligations include maintaining 80% of total user funds or their equivalent value in a secure cold wallet and registering insurance coverage to guarantee compensation for users in the event of hacks or system failures."],"entity":[{"type":"Huobi Korea","content":"LOCATION"},{"type":"Coinone","content":"LOCATION"},{"type":"Korbit","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Bithumb","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"January 2023","content":"DATE"},{"type":"November","content":"DATE"},{"type":"June 30, 2023","content":"DATE"},{"type":"January 29, 2024","content":"DATE"},{"type":"Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"99.6%","content":"PERCENT"},{"type":"July 2024","content":"DATE"}],"hashtag":["Crypto Regulations","Huobi","South Korea"],"authors":["Jai Pratap"]}