{"summary":"Polygon Spinoff Avail Secures $27M in Seed Funding From Founders Fund, Dragonfly","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-avail-seed-round-founders-fund-dragonfly.htm","publishDate":"2024-02-26T14:00:14","id":19792,"type":null,"title":"Polygon Spinoff Avail Secures $27M in Seed Funding From Founders Fund, Dragonfly","category":["Blockchain News "],"content":["Polygon spinoff Avail raised $27m in seed funding led by Peter Thiel’s Founders Fund and Dragonfly, the company announced Monday.","The funding will go toward developing three key products within Avail’s platform: Data Availability (DA), Nexus, and Fusion.","“These core components, which constitute the Avail Trinity, will allow the network to accelerate the unification of web3,” Avail said in a statement.","“Today’s raise led by world-class VCs, Founders Fund and Dragonfly, accelerates our vision to unify the Web3 space and solve the growing pains of fragmentation,” said Avail co-founder Anurag Arjun.","“The rollup-centric future for scaling blockchains is already here,” he added. “Over the next few years, there will be a multitude of rollups, and not necessarily just EVM. There will be a whole host of non-EVM rollups, especially app-specific rollups. Rollup tooling will mature to such an extent that it will be as easy to deploy an app-specific rollup as it is to deploy a smart contract today.”","Avail’s funding arrives amid a surge in venture capital investment in the Web3 ecosystem. Last week, prominent VC firm Andreessen Horowitz announced a $100m investment in crypto restaking startup EigenLayer. Further, Hack VC revealed a $150m fund dedicated to backing projects centered on decentralizing the internet.","Avail started as part of Polygon Labs. Then it branched out on its own in March last year. It is currently run by Anurag Arjun, one of Polygon’s co-founders, and Prabal Banerjee, a former research lead. It was spun off to concentrate on being a protocol-neutral, open-source, and community-driven initiative.","Avail was constructed using Polkadot’s Substrate technology as it employs nominated proof-of-stake (nPOS) and promotes broad stake distribution.","Joey Krug, partner at Founders Fund, said: “Their stellar team, tech stack, and emerging ecosystem are enabling a more modular design space for projects to build on their infra.”","Avail is presently operational on a testnet, and aims to secure additional funding before its mainnet launch.","Co-founder Arjun told Cryptonews that the DA timeline is projected for early Q2, likely around April. Meanwhile, the initial release of Nexus is planned for later this year, with fusion security anticipated next year.","Its three core products aim to establish a scalable data availability layer for the Web3 ecosystem.","The initial part, Avail DA, aims to address rollup scalability while ensuring security in data availability. Since rollups regularly need access to large volumes of transaction data, this scalability needs to be matched with execution, Avail said. Arjun told Cryptonews that this DA layer is the first to anchor modular blockchains using state-of-the-art zero-knowledge technology for reliable data availability.","Secondly, Nexus will serve as the central hub for verification. It will bring together rollups from both within and outside the Avail ecosystem.","“It takes the native assets of the most mature ecosystems, including BTC, ETH, and others, and allows them to contribute additional security to the Avail ecosystem,” Arjun said. “Unification = modularity + aggregation + shared security.”","Finally, to ensure strong security for the Avail platform, Avail is developing Fusion Security — the third component of the Avail trinity. Fusion Security allows assets from established ecosystems like BTC and ETH to provide extra security to the Avail system."],"entity":[{"type":"Prabal Banerjee","content":"PERSON"},{"type":"Peter Thiel","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March last year","content":"DATE"},{"type":"Avail Trinity","content":"ORGANIZATION"},{"type":"Joey Krug","content":"PERSON"},{"type":"$27m","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"$150m","content":"MONEY"},{"type":"$100m","content":"MONEY"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Cryptonews","content":"PERSON"},{"type":"Avail trinity","content":"ORGANIZATION"},{"type":"Arjun","content":"PERSON"},{"type":"Avail","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Avail DA","content":"ORGANIZATION"}],"hashtag":["Ethereum","Polygon"],"authors":["Shalini Nagarajan"]}