{"summary":"Cardano Price Forecast as Founder Charles Hoskinson Takes Jab at Crypto Critics – Time to Buy ADA?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-forecast-as-founder-charles-hoskinson-takes-jab-at-crypto-critics-time-buy-ada.htm","publishDate":"2023-03-14T12:05:00","id":19794,"type":null,"title":"Cardano Price Forecast as Founder Charles Hoskinson Takes Jab at Crypto Critics – Time to Buy ADA?","category":["Altcoin News "],"content":["Investors in the crypto market are displaying renewed bullishness in the wake of the US government stepping in to help Silicon Valley Bank depositors. ","The total crypto market capitalization has climbed back above $1.1 trillion as investors capitalized on the fresh bullish momentum. This bullish trend is expected to continue throughout the week as investors remain resilient despite the collapse of US banks.","Cardano’s ADA token, which powers its decentralized ecosystem, has surged 3.6% in the past 24 hours and is currently trading at $0.3435.","The co-founder of Cardano has taken issue with the way crypto critics are portraying the market. ","In response to the recent failures of three US banks, Signature Bank, Silvergate Bank, and Silicon Valley Bank, Charles Hoskinson spoke out on Twitter.","Hoskinson noted that when stablecoin issuers such as Circle, Paxos, and Tether announce plans to hold collateral primarily in cash and T-bills, crypto critics remain silent. He also pointed out that governments have long maintained the view that “CRYPTO IS SUPER RISKY,” and this is unlikely to change even in the face of banking sector implosions.","Furthermore, Hoskinson criticized banks for choosing to hold collateral mostly in longer-dated traditional finance bonds, which ultimately failed and left more questions than answers. Despite the impact of the three banks’ collapse in a record four days, the ADA co-founder believes the government will continue to claim that “CRYPTO IS SUPER RISKY.”","The crypto community appeared to agree with Hoskinson’s sentiments with the tweet garnering over 3,000 likes in a few hours.","After hitting a new 2023 high of $0.4210, Cardano’s price experienced a sharp downtrend that stabilized at $0.30, in line with analysts’ predictions.","Here, buyers stepped in and pushed the price of ADA back up toward $0.35, where it has been hindered by a confluence resistance formed by the 50-day Exponential Moving Average (represented by the red line) and the 100-day EMA (represented by the blue line).","Traders who are considering opening new or additional long positions in ADA may want to wait until the token confirms the uptrend by breaking above the critical area of contention, which is slightly above $0.35.","A natural break above this level is essential to confirm the subsequent swing toward $0.40 as bulls play the long game, ultimately reaching for the $1 level.","The Moving Average Convergence Divergence (MACD) has already issued a buy signal, indicating that the path of least resistance is towards the upside with resistance levels along the way at $0.50 and $0.75.","Bulls are upholding the optimistic outlook for Cardano price even in shorter timeframes, as observed on the four-hour chart. The buy signal from the MACD is more aggressive, with the indicator at 0.007.","For Cardano’s price movement, two levels are crucial in the short term. The 100-day EMA at $0.329 acts as a downside support, preventing ADA from dropping to $0.32 and $0.30. ","On the upside, the 200-day EMA at $0.35 coincides with the resistance on the daily chart. Breaking through the upper trendline on the four-hour chart is essential for another attack at $0.40.","As long as the SuperTrend indicator trails below Cardano’s price, the bullish outlook remains intact. ","Even in the event of a short-term selloff, investors are likely to take advantage of the lower-priced ADA tokens to play the long game to $1.","Buy Cardano Now","If you’re looking for other high-potential crypto projects alongside ADA, we’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the Cryptonews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.",""],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Hoskinson","content":"PERSON"},{"type":"Paxos","content":"LOCATION"},{"type":"3.6%","content":"PERCENT"},{"type":"$0.3435","content":"MONEY"},{"type":"Silicon Valley Bank depositors","content":"ORGANIZATION"},{"type":"$1.1 trillion","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$0.35","content":"MONEY"},{"type":"$0.30","content":"MONEY"},{"type":"$0.75","content":"MONEY"},{"type":"$0.32","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Cardano Now","content":"ORGANIZATION"},{"type":"$0.50","content":"MONEY"},{"type":"$0.4210","content":"MONEY"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"Cryptonews Industry Talk","content":"ORGANIZATION"},{"type":"$0.329","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["ADA","Cardano"],"authors":["John Isige"]}