{"summary":"Terra Luna Classic Crypto Price Prediction 2022 – Can LUNC Rocket to $0.00088?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crypto-price-prediction-2022-can-lunc-rocket-to-5.htm","publishDate":"2022-09-11T09:39:00","id":19793,"type":null,"title":"Terra Luna Classic Crypto Price Prediction 2022 – Can LUNC Rocket to $0.00088?","category":["Altcoin News "],"content":["Terra Luna Classic (LUNC) is now trading in a healthy consolidative retreat at $0.000442, currently down 25% from the $0.00059 swing high achieved on the 7th of September.","The battle for control between the bulls and bears is still finding equilibrium but there is still scope for LUNC to push towards $0.00088.","Can Terra Luna Classic maintain positive price momentum? ","Fundamental analysis could suggest that a recent Tweet caused deleterious effects for the price of Terra Luna Classic (LUNC) on the 9th of September. ","Extremely disappointed in CZ for not keeping his word\n\nApplying the 1.2% tax to withdrawals and deposits only discourages people from leaving Binance\n\nThey are not applying the $LUNC burn to the spot + margin trading AKA what the community asked forhttps:\/\/t.co\/VuAkTYiVan pic.twitter.com\/xPKSYQYGEi","The 9th of September is where Terra Luna Classic lost a key level of support within a symmetrical triangle leading to loss of price structure. This resulted in a 28.87% pull back in price.","It is speculated that much of the hype and euphoria surrounding the positive price momentum of Terra Luna Classic surrounds the idea that Binance will integrate the 1.2% tax burn mechanics on their exchange. ","The community has recently lost morale and are feeling rather disappointed as it seems like this may no longer be the case.  ","This has had a detrimental impact on the sentiment and investor appetite as Binance holds the greatest amount of market dominance for the LUNC\/Fiat trading pairs achieving an incredible 46.15% of all trading volume.","With no tax burning mechanics being integrated it means that the previously speculated amount of supply that will be burned in the ecosystem will no longer happen (for now). ","From a technical analysis perspective Terra Luna Classic (LUNC) is still looking strong despite the negative news and fear amongst holders. ","Terra Luna Classic (LUNC) has now written in three key support levels: $0.000363, $0.000388 and $0.000434 which it must respect and hold in order to prevent further continuation to the downside.","Currently, Terra Luna Classic is trading in a horizontal channel and has been over the last 48 hours. This reflects consolidation and could lead to a decisive move to the upside or downside. ","It is imperative that LUNC can push back through the $0.000448 price level, the next key levels of of resistance would be $0.000489 followed by the previous swing high on the 7th of September being $0.000593. ","According to the Fibonacci extension LUNC could be preparing to make a big move up to $0.00088 which would result in a 98% increase in price from current levels. This is merely dubious speculation, but we have seen LUNC do similar things already over the recent weeks."," ",""],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"$0.00059","content":"MONEY"},{"type":"$LUNC","content":"MONEY"},{"type":"46.15%","content":"PERCENT"},{"type":"98%","content":"PERCENT"},{"type":"9th of September","content":"DATE"},{"type":"1.2%","content":"PERCENT"},{"type":"7th of September","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Terra Luna Classic (LUNC","content":"ORGANIZATION"},{"type":"$0.000434","content":"MONEY"},{"type":"$0.000489","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"$0.000448","content":"MONEY"},{"type":"last 48 hours","content":"DATE"},{"type":"$0.000442","content":"MONEY"},{"type":"$0.000388","content":"MONEY"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"$0.00088","content":"MONEY"},{"type":"28.87%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$0.000363","content":"MONEY"},{"type":"$0.000593","content":"MONEY"}],"hashtag":["LUNC","Terra Luna Classic"],"authors":["Jacob Bury"]}