{"summary":"Vanguard Has No Plans to Join Asset Management Rivals in Pursuing Bitcoin ETFs: CEO Tim Buckley","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vanguard-has-no-plans-to-join-asset-management-rivals-in-pursuing-bitcoin-etfs-ceo-tim-buckley.htm","publishDate":"2023-10-31T05:17:26","id":19799,"type":null,"title":"Vanguard Has No Plans to Join Asset Management Rivals in Pursuing Bitcoin ETFs: CEO Tim Buckley","category":["Bitcoin News "],"content":["Asset management firm Vanguard has revealed that it will not be joining its competitors in pursuing a spot Bitcoin exchange-traded fund (ETF).","While rivals like BlackRock and Fidelity have pending applications for Bitcoin ETFs, Vanguard CEO Tim Buckley stated in a recent interview with CNBC that his firm has no plans to follow suit.","“We won’t be pursuing a bitcoin ETF. It’s just like we don’t use gold as an asset class for our clients,” he said.","“It’s not that people can’t invest in there. We just look at asset classes or, you know, what belongs in a long-term portfolio, what has intrinsic value, has cash flows to it? And those are the asset classes we steer people towards. And so we don’t go towards bitcoin or gold or any other of those stable assets.”","A Vanguard spokesperson further elaborated on the firm’s perspective in a comment to Insider, claiming that the firm is still skeptical of cryptocurrencies.","“Unlike stocks and bonds, most cryptocurrencies lack intrinsic economic value and generate no cash flows, such as interest payments or dividends,” the spokesperson reportedly said.","“Further, cryptocurrencies have proven to be highly volatile, which runs counter to Vanguard’s goal to generate positive real returns to investors over time.”","The regulatory landscape surrounding cryptocurrencies has been a point of contention, with the SEC previously rejecting several Bitcoin ETF applications.","However, Grayscale Investments recently won a court case against the SEC, raising hopes that regulatory obstacles may soon be cleared for the approval of a spot bitcoin ETF.","Despite Vanguard’s stance, enthusiasm for a potential spot bitcoin ETF continues to grow on Wall Street.","Prominent cryptocurrency advocate Mike Novogratz recently expressed his belief that blocking an ETF would make no sense.","This sentiment is mirrored by market trends, as inflows into digital asset funds reached their highest weekly level since July 2022.","According to a CoinShares report, digital asset investment inflows reached $326 million for the week, with Bitcoin accounting for 90% of the inflows.","It is worth noting that the anticipation of a spot ETF approval has led to a surge in Bitcoin’s price in recent weeks.","The cryptocurrency rallied towards $35,000 earlier this month, driven by market speculation surrounding the potential approval of a spot ETF.\nThe surge in price has not only caught the attention of investors but has also sparked a renewed interest in crypto trading, leading to a significant increase in daily exchange volumes.","As reported, the seven-day moving average for spot exchange volumes across reputable platforms breached an impressive $24 billion on October 26, a level not seen since the end of March."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$35,000","content":"MONEY"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"$24 billion","content":"MONEY"},{"type":"October 26","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$326 million","content":"MONEY"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Tim Buckley","content":"PERSON"},{"type":"July 2022","content":"DATE"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitcoin ETF","Blackrock"],"authors":["Ruholamin Haqshanas"]}