{"summary":"Non-custodial crypto investing app provider Ember Fund has raised $700,000 via SEC-registered crowdfunding sale\nEmber co-founder and CEO Alex Wang said: “We will be aggressively deploying this capital on customer acquisition and building out the smart contract technology that powers the Ember app”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64176\/non-custodial-crypto-investing-app-ember-fund-raises-700k-via-sec-registered-crowdfunding-sale","publishDate":"2020-05-06T04:50:07","id":198,"type":null,"title":"Non-custodial crypto investing app Ember Fund raises $700K via SEC-registered crowdfunding sale","category":["Cryptocurrency"],"content":["Ember Fund, a non-custodial app for cryptocurrency investing, has raised $700,000 through a Securities and Exchange Commission (SEC)-registered crowdfunding sale.","Ember <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1783580\/000178358019000001\/xslC_X01\/primary_doc.xml\" data-v-f87c67ca=\"\">held<\/a> its sale under the SEC’s Regulation Crowdfunding (Reg CF), which <a href=\"https:\/\/www.sec.gov\/smallbusiness\/exemptofferings\/regcrowdfunding\" data-v-f87c67ca=\"\">allows<\/a> eligible companies to raise a maximum aggregate amount of $1.07 million in a 12-month period.","\"Our initial goal was only to raise $500,000, but we increased allocation because as the sale went on, we saw new growth channels to deploy capital,\" Ember co-founder and CEO Alex Wang told The Block.","\"We will be aggressively deploying this capital on customer acquisition and building out the smart contract technology that powers the Ember app,\" said Wang.","The crowd sale saw participation from various investors, including Gil Penchina of Flight Ventures, David Weisburd of Growth Technology Partners, and an anonymous former partner at venture firm Kleiner Perkins, among others.","Ember held the sale via investment platform Republic and sold “Crowd SAFE” securities. SAFE stands for Simple Agreement for Future Equity and is an investment contract entitling investors to equity when companies get acquired or go public.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Managed crypto portfolios<\/strong><\/span>","Launched last year, the Ember app allows users to invest in managed cryptocurrency portfolios. Its current offerings are Marius S-Tier Fund, DataDash Index Fund, Big 3 Weighted Fund, Ember 5 Weighted Fund and flagship Quant Fund, which is run by Blockforce Capital, according to its <a href=\"https:\/\/www.emberfund.io\/resources.html\" data-v-f87c67ca=\"\">website<\/a>.","“Our managed portfolios are beating the market year-to-date (until April 2020) - the S-Tier has returned 23.4% and the Quant fund has returned 29.5%. Bitcoin was up 20.9% in the same period,” Wang told The Block.","Ember has seen over $6 million in deposits since the launch and has processed close to $20 million in transactions, said Wang, adding that the firm is “close to being profitable” and hopes to be one “in the next 6-8 months.”","The app currently has around 20,000 users and its top five markets are the U.S., Canada, the U.K., Australia, France and Spain, according to Wang.","Ember currently employs ten people, with half of it as full-time, and is currently looking for a junior full stack developer and an operations associate, Wang told The Block.","Looking ahead, Ember is not planning to raise more funds anytime soon. “Our goal is to stay lean and focus on product and growth,” said Wang."],"hashtag":["SEC"]}