{"summary":"Blockchain-Based Game MetalCore Receives $5 Million in Latest Funding Round","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-based-game-metalcore-receives-5-million-in-latest-funding-round.htm","publishDate":"2024-03-13T06:35:43","id":19808,"type":null,"title":"Blockchain-Based Game MetalCore Receives $5 Million in Latest Funding Round","category":["Blockchain News "],"content":["The videogame developer Studio369’s has successfully raised $5 million in the latest funding round for its upcoming web3 MMO, MetalCore.","As detailed in the press release provided to Cryptonews.com, the March 12 funding round saw contributions from notable investors such as Delphi Digital, BITKRAFT Ventures, and Sanctor Capital alongside other backers supporting Studio369’s vision.","Additional contributors, including Spartan Group, King River Digital Assets, and Arrington Capital, also supported the funding.","Studio369 announced MetalCore’s immersive features, emphasizing its dynamic mission system driven by AI to offer varied challenges and objectives.","“Studio369 will put the newly raised funds toward continued development and upcoming features, such as a never-seen-before dynamic mission system that leverages AI to generate unique assignments, objectives, and tasks,” the press release reads.","The user-generated content feature would also become a prominent gameplay to be expanded backed by blockchain.","“With integration in the Immutable zkEVM ecosystem, developers can deploy custom smart contracts and offer users a gas-free experience,” the press release reads.","Players would have the ability to enhance and create in-game items, conduct transactions, receive rewards, and engage in various activities. The developer expected to welcome more long-term partners and expand the game’s ecosystem to attract players.","According to the release, MetalCore is designed to offer an expansive open-world setting where players engage in large-scale battles for territorial control.","The game allows for crafting and trading of vehicles and equipment, recruitment of pilots, land development, and various other interactive tasks, all in the pursuit of planetary supremacy.","“We are excited to see that some of the most prominent companies and influencers in gaming continue to share and support our vision of MetalCore,” stated Studio369 CEO Matt Candler.","“The additional funding will help us hone and sharpen MetalCore even further to deliver the most fun, engaging, and awesome experience,” said Candler.","MetalCore is developed by veterans from companies like Activision and Lucasfilm, with extensive experience in major titles including Gears of War and Mortal Kombat. The project, which received the GAM3 2022 Award for Best Shooter Game, previously secured $15 million in funding in 2021."],"entity":[{"type":"Matt Candler","content":"PERSON"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"King River Digital Assets","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"Activision","content":"ORGANIZATION"},{"type":"Candler","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"MetalCore","content":"ORGANIZATION"},{"type":"Lucasfilm","content":"ORGANIZATION"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["Disney","Gaming","Web3"],"authors":["Hongji Feng"]}