{"summary":"GAO Criticizes SEC’s Handling of Crypto Accounting Bulletin, Calls for Clearer Rule","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gao-criticizes-secs-handling-of-crypto-accounting-bulletin-calls-for-clearer-rule.htm","publishDate":"2023-11-01T00:40:47","id":19803,"type":null,"title":"GAO Criticizes SEC’s Handling of Crypto Accounting Bulletin, Calls for Clearer Rule","category":["Blockchain News "],"content":["The Government Accountability Office (GAO) has determined that the Securities and Exchange Commission (SEC) erred in its handling of “Staff Accounting Bulletin 121” (SAB 121) by failing to submit it to Congress as is required for official rules.","In a report titled “Securities and Exchange Commission—Applicability of the Congressional Review Act to Staff Accounting Bulletin No. 121,” released on October 31, the Government Accountability Office (GAO) has determined that the U.S. Securities and Exchange Commission (SEC) overstepped its bounds when issuing the controversial “Staff Accounting Bulletin 121” (SAB 121).","The GAO contends that Congress should have been given the opportunity to review it.","The GAO argues that the SEC did not comply with the Congressional Review Act (CRA) by failing to submit a report to Congress or the Comptroller General regarding the Bulletin. The GAO further highlights that the 2022 guidance, viewed by the industry as potentially impacting crypto investors’ ability to secure safe harbors for their assets, should have been treated as a formal rule.","Despite this determination, the GAO’s finding does not directly alter the ongoing nonbinding status of the Bulletin as outlined by the SEC.","The Congressional Review Act mandates that before a rule can take effect, an agency must furnish a report on the rule to both the House of Representatives and the Senate, in addition to the Comptroller General. If Congress chooses to disapprove of the rule, the CRA provides procedures for review and potential rejection.","It is anticipated that the Bulletin will now undergo congressional review. The exact details of this process are yet to be clarified. Under the Congressional Review Act, lawmakers have a specified period to potentially reject a new federal rule once it has been submitted for review.","In response to the GAO’s opinion, the SEC stated, “The GAO opinion expresses its view that SAB 121 is a ‘rule’ for purposes of the CRA. The opinion does not otherwise affect the status of SAB 121.”","The Government Accountability Office (GAO) has examined the SEC assertion that SAB 121 should not be considered a formal rule due to its characteristics as an “agency statement” lacking “future effect.” Contrary to the SEC’s argument, the GAO has pointed out that SAB 121 provides recommendations for covered entities regarding best practices in accounting for their obligations related to safeguarding crypto assets.","The GAO emphasizes that the Bulletin’s guidance effectively encourages regulated entities to adapt their internal operations and policies in accordance with its recommendations.","Additionally, as the Bulletin is published on the SEC’s official website, covered entities reasonably interpret it as an expectation to consider the guidance when preparing their financial disclosures.","Furthermore, the GAO notes that an SEC Commissioner acknowledged the Bulletin’s role in providing definitive interpretive guidance for public companies, outlining detailed descriptions of expected disclosures. This reinforces the GAO’s agreement with the characterization of the Bulletin’s significant impact on covered entities’ compliance expectations and internal practices.","SEC Commissioner Hester Peirce, a notable figure within the Commission, had previously voiced her objections to the SEC’s decision, characterizing it as a “scattershot and inefficient approach to crypto.”","In conclusion, the GAO affirms that the Bulletin meets the Administrative Procedure Act’s (APA) definition of a rule, and none of the three CRA exceptions apply. Therefore, it concludes that the Bulletin is subject to the CRA’s submission requirement, signaling a pivotal development in its regulatory status.","The GAO reviewed this proposal at the request of a member of Congress. This will be brought up for a vote of disapproval.","Each chamber of Congress now has until December 31 to pass a resolution of disapproval to invalidate the rule. @DigitalChamber will actively reach out to…","— Cody Carbone (@CodyCarboneDC) October 31, 2023","","This finding paves the way for a congressional vote of disapproval, a prospect emphasized by Cody Carbone, Vice President of Policy for the Chamber of Digital Commerce. Each chamber of Congress now has until December 31 to deliberate and potentially pass a resolution of disapproval, which could ultimately invalidate SAB 121."],"entity":[{"type":"October 31, 2023","content":"DATE"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"December 31","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"October 31","content":"DATE"},{"type":"Government Accountability Office (GAO","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"GAO","content":"ORGANIZATION"},{"type":"“Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"CRA","content":"ORGANIZATION"},{"type":"APA","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Hassan Shittu"]}