{"summary":"Indonesia to Require Cryptocurrency Exchanges to Register with Country’s National Digital Asset Bourse","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/indonesia-to-require-cryptocurrency-exchanges-to-register-with-countrys-national-digital-asset-bourse.htm","publishDate":"2023-12-28T12:05:32","id":19807,"type":null,"title":"Indonesia to Require Cryptocurrency Exchanges to Register with Country’s National Digital Asset Bourse","category":["Altcoin News "],"content":["The Indonesian government has announced that all cryptocurrency exchanges operating within the country will be required to register with the newly established Commodity Future Exchange (CFX).","Launched earlier this year, the CFX is the world’s first national bourse dedicated to digital assets. ","It aims to provide a safer environment for crypto investors while also serving as a platform to track digital asset transactions for taxation purposes. ","The move comes as a response to the surging demand for cryptocurrencies in Indonesia, where the number of registered crypto traders exceeds that of stock traders, according to official data from 2023.","Under regulations introduced in 2019 by the Indonesian Commodity Futures Trading Supervisory Agency (Bappebti), all crypto exchanges operating in the country are required to seek authorization. ","While exchanges that have been operating legally since 2014 fall under the category of “prospective crypto exchanges,” they must still undergo a rigorous process to gain recognition as legitimate entities associated with the CFX.","Beyond regulatory oversight, the registration requirement with the CFX serves as a gateway for the Indonesian government to monitor cryptocurrency transactions for tax purposes. ","The authorization process involves registration with self-regulatory organizations (SROs) like the CFX, followed by scrutiny by Bappebti to assess the company’s suitability to operate.","Only after meeting all requirements can a crypto exchange be issued a crypto exchange license (PFAK). ","Failure to complete the new procedures and registrations within the specified timeframe will result in the inability to operate in Indonesia. ","The deadline for registration is set for August 17, 2024.","There are currently 29 prospective crypto exchanges in Indonesia that will need to obtain authorization.","It is worth noting that the upcoming regulatory overhaul in 2025 will shift the oversight of cryptocurrency regulation from Bappebti to Indonesia’s Financial Services Authority (OJK). ","This change could potentially reclassify cryptocurrencies as securities, which may have implications for taxation. ","While crypto assets are currently subject to Value Added Tax (VAT) and Income Tax (PPh) as commodities, reclassification as securities could potentially lead to a reduction in taxes.","As reported, in late February, Didid Noordiatmoko, head of the country’s Commodity Futures Trading Regulatory Agency (Bappebti), said that the nation aimed to launch its much-anticipated state-backed crypto exchange by mid-2023. ","He added that the exchange will be run by a private-sector company rather than the government. Also, private-sector crypto platforms will execute trades on the exchange. ","Yet, in late May, Bali Governor Wayan Koster suggested that the popular Indonesian tourist island will tighten rules around payments to make it harder for foreign tourists to pay with crypto.","Just recently, Gibran Rakabuming Raka, a vice presidential candidate in the upcoming Indonesian election, said he aims to accelerate Indonesia’s position as a leader in the digital revolution by cultivating expertise in blockchain and cryptocurrencies.","“We are preparing blockchain experts, we are preparing cybersecurity experts, we are preparing crypto experts,” Gibran affirmed during the event on December 10."],"entity":[{"type":"2025","content":"DATE"},{"type":"’s Financial Services Authority","content":"ORGANIZATION"},{"type":"August 17, 2024","content":"DATE"},{"type":"Bappebti","content":"LOCATION"},{"type":"December 10","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Indonesia","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Didid Noordiatmoko","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Commodity Futures Trading Regulatory Agency","content":"ORGANIZATION"},{"type":"Gibran","content":"PERSON"},{"type":"Bali","content":"LOCATION"},{"type":"CFX","content":"ORGANIZATION"},{"type":"Commodity Future Exchange","content":"ORGANIZATION"},{"type":"2014 fall","content":"DATE"},{"type":"Gibran Rakabuming Raka","content":"PERSON"},{"type":"Wayan Koster","content":"PERSON"}],"hashtag":["Crypto Regulation","Indonesia"],"authors":["Ruholamin Haqshanas"]}