{"summary":"Ripple Faces SEC Pressure for Financial Transparency in Ongoing Legal Saga","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ripple-faces-sec-pressure-for-financial-transparency-in-ongoing-legal-saga.htm","publishDate":"2024-01-12T13:39:39","id":19805,"type":null,"title":"Ripple Faces SEC Pressure for Financial Transparency in Ongoing Legal Saga","category":["Altcoin News "],"content":["The legal battle between US-based blockchain payments firm Ripple and the US Securities and Exchange Commission (SEC) has taken a new turn as the SEC seeks to compel Ripple to disclose its financial statements for the years 2022-2023.","The regulator filed the motion on Thursday, adding complexity to an already intricate case.","#XRPCommunity #SECGov v. #Ripple #XRP The @SECGov has filed a Motion to Compel @Ripple to produce (a) its financial statements for the years 2022-2023; and (b) its post-Complaint contracts governing “Institutional Sales.\"https:\/\/t.co\/Egc4wpf7UY","— James K. Filan 🇺🇸🇮🇪 (@FilanLaw) January 11, 2024","","The legal dispute began with a July 13 ruling that XRP, the cryptocurrency Ripple originally issued, is not a security, but certain Ripple sales made under written contracts qualify as securities.","Both parties had agreed on a joint briefing schedule for remedies after this ruling, with a deadline of Feb. 12, 2024, for the completion of remedies-related discovery.","However, the recent SEC motion seeks to compel Ripple to disclose the amount of XRP institutional sales proceeds after the filing of the complaint for contracts entered into precomplaint.","","The SEC has accused Ripple of persistently selling XRP as unregistered securities while earning billions of dollars in proceeds.","Ripple, in response, asserts its intention to continue selling XRP to “institutional sales” buyers in On-Demand Liquidity (ODL) transactions, claiming it can structure future sales in compliance with federal securities laws.","Ripple filed a Motion for Extension of Time in response to the SEC’s demands, requesting an additional two days until Jan. 19 to formulate its response.","#XRPCommunity #SECGov v. #Ripple #XRP @Ripple has filed a Motion for Extension of Time requesting an additional 2 days, until January 19th, to respond to the @SECGov’s Motion to Compel. pic.twitter.com\/mAy7mPi4gw","— James K. Filan 🇺🇸🇮🇪 (@FilanLaw) January 11, 2024","","The unexpected extension suggests that the legal feud, ongoing for three years, is far from resolution, with both parties now preparing for more courtroom drama in the time ahead.","The extension also comes after the SEC in October last year dropped securities law violation charges against Ripple CEO Brad Garlinghouse and co-founder Chris Larsen.","Garlinghouse has over the years often lashed out at the SEC publicly, and in November last year he accused the agency of deviating from its core mission to protect investors."],"entity":[{"type":"Motion for Extension of Time","content":"ORGANIZATION"},{"type":"January 11, 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"James K. Filan","content":"PERSON"},{"type":"January 19th","content":"DATE"},{"type":"’s Motion to Compel","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July 13","content":"DATE"},{"type":"Chris Larsen","content":"PERSON"},{"type":"Feb. 12, 2024","content":"DATE"},{"type":"Garlinghouse","content":"PERSON"},{"type":"October last year","content":"DATE"},{"type":"November last year","content":"DATE"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Jan. 19","content":"DATE"}],"hashtag":["Ripple","SEC","XRP"],"authors":["Fredrik Vold"]}