{"summary":"The Central African Republic is reportedly adopting bitcoin as legal tender, alongside the CFA franc.\nPresident Touadera says the move will put the impoverished country on the map.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp","publishDate":"2022-04-27T09:31:31","id":1980,"type":null,"title":"Central African Republic adds bitcoin as legal currency: AFP","category":["Bitcoin"],"content":["The President of the Central African Republic (CAR), Faustin Archange Touadera, has signed a law legalizing cryptocurrencies and making bitcoin a legally recognized currency in the country following a unanimous parliamentary vote on the matter, the AFP news agency <a href=\"https:\/\/news.yahoo.com\/central-african-republic-adopts-bitcoin-104407031.html\" data-v-f87c67ca=\"\">reported<\/a> on Wednesday.","Obed Namsio, the President’s chief of staff, said the move marks an important milestone for the country’s economic recovery, according to a <a href=\"https:\/\/m.facebook.com\/story.php?story_fbid=305888361698320&amp;id=100068314766662&amp;sfnsn=mo#_=_\" data-v-f87c67ca=\"\">post<\/a> on the CAR government's official Facebook page.&nbsp;","“With this historic decision, the economic recovery and peace consolidation plan enter a new era and the Executive demonstrates consistency in applying the agenda of achieving strong and inclusive growth for the benefit of development and economic performance, generating prosperity for our citizens,” the announcement stated.","Apart from legalizing bitcoin as a recognized form of money, the landlocked African nation says it is also moving forward with broad-based crypto adoption plans.","CAR is the first African nation to adopt bitcoin as legal tender and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/108056\/imf-el-salvador-bitcoin-law-meeting\" data-v-f87c67ca=\"\">joins El Salvador<\/a> as only the second in the world to do so.","Like El Salvador, CAR doesn't issue its own currency. It uses the France-backed CFA franc just as El Salvador uses the US dollar.","","","The central African nation ranks among the least developed economies in the world with agriculture the largest contributor to its GDP. According to World Bank <a href=\"https:\/\/data.worldbank.org\/indicator\/NY.GDP.MKTP.CD?locations=CF\" data-v-f87c67ca=\"\">figures<\/a>, CAR’s GDP stood at only $2.38 billion as of 2020 and the country ranks near the bottom of the United Nation’s Human Development Index."],"hashtag":["BITCOIN"]}