{"summary":"Goldman Sachs Warns Bitcoin Investors – Don’t Read Into Past Halving-Cycles","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/goldman-sachs-warns-bitcoin-investors-on-halving.htm","publishDate":"2024-04-18T14:47:18","id":19802,"type":null,"title":"Goldman Sachs Warns Bitcoin Investors – Don’t Read Into Past Halving-Cycles","category":["Blockchain News "],"content":["In a note to clients, Goldman Sachs, one the world’s largest investment bank, advised against extrapolating data from previous Bitcoin halving cycles due to macroeconomic changes.","Every four years, the “halving” event occurs, in which the per-block Bitcoin (BTC) emissions are cut in half. The next halving is in 2 days, and it will see rewards cut to 3.125 BTC from 6.25 BTC, essentially halving the rate of new supply.","This creates artificial scarcity, which increases demand, and has historically preceded massive multi-month BTC rallies – something the cryptocurrency community believes will be repeated.","This is something Goldman Sachs acknowledges, stating “Historically, the previous three halvings have been accompanied by BTC price appreciation after the halving, although the time it took to reach the all-time highs differs significantly.”","","However, this time they are skeptical, warning their clients that “Caution should be taken against extrapolating the past cycles and the impact of halving, given the respective prevailing macro conditions” in a note from the Currencies and Commodities (FICC) and Equities team on April 14th.","This doubt is seeded in the understanding that today’s economy is not the same as it has been in previous halvings. Macroeconomic factors such as high inflation and interest rates should be taken into account.","Last year, the M2 money supply of the major central banks at the time, including the People’s Bank of China, the European Central Bank, the Bank of Japan, and the U.S. Federal Reserve, rose quickly.","Consequently, interest rates in the developed world remained at or below zero, encouraging risk-taking across the financial market, including cryptocurrencies. Goldman believes that similar macro conditions to encourage risk-taking are necessary for history to repeat itself in this cycle. ","That is not the case in today’s world, with Interest rates in the US, the world’s largest economy, standing above 5%, and the hopes of interest rate cuts fading. Traders estimate the probability of a June rate decrease at only 20.6%, compared to 45.9% for September, according to CME’s FedWatch tool. ","This bearish outlook is shared with others, such as Bitwise, heeding similar warnings.","Historically, the Halving Has Been Good for Bitcoin’s Price Long-Term (a Look at the Data)","The change in bitcoin’s price in the year following the halving:","2012: 8,839%\n2016: 285%\n2020: 548%","The change in bitcoin’s price in the month following the halving:","2012: 9%\n2016: -10%… pic.twitter.com\/aaXSakLfko","— Bitwise (@BitwiseInvest) April 16, 2024","","Goldman maintains optimism despite the fact that the economy is not set up to sustain growth in the cryptocurrency space, arguing that the halving is only a “psychological reminder to investors of BTC’s capped supply.” Instead, the medium-term outlook will be determined by the adoption of Bitcoin ETFs.","“BTC price performance will likely continue to be driven by the said supply-demand dynamic and continued demand for BTC ETFs, which combined with the self-reflexive nature of crypto markets is the primary determinant for spot price action,” the team stated.","In the last six months, US-based Bitcoin spot exchange-traded funds have increased 130%. The 11 spot-based ETFs that went live three months ago have $59.2 billion in assets under management, according to Bloomberg.","Because of this, some analysts think that the majority of the typical post-halving surge has already occurred, which could lead to a “buy the rumor, sell the news” pullback following the halving on April 20, according to Goldman.","The slowing growth in Bitcoin ETFs supports this. Although they have seen over $12 Billion in inflows since the SEC greenlighting spot Bitcoin ETFs in January, the majority of this inflow occurred last quarter. However, they have lost momentum as of April.","","Something caused by the “initial novelty hype, ETF flows tend to run out unless prices continue increasing—which they have not done since early March,” commented 10x Research Founder Markus Thielen."],"entity":[{"type":"$59.2 billion","content":"MONEY"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"8,839%","content":"PERCENT"},{"type":"45.9%","content":"PERCENT"},{"type":"548%","content":"PERCENT"},{"type":"Markus Thielen","content":"PERSON"},{"type":"$12 Billion","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"Data)","content":"ORGANIZATION"},{"type":"Bitcoin’s Price Long","content":"ORGANIZATION"},{"type":"People’s Bank of China","content":"ORGANIZATION"},{"type":"last six months","content":"DATE"},{"type":"130%","content":"PERCENT"},{"type":"285%","content":"PERCENT"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"20.6%","content":"PERCENT"},{"type":"last quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"CME","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"Bank of Japan","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"April 14th","content":"DATE"},{"type":"-10%","content":"PERCENT"},{"type":"April 16, 2024","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Equities","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin ETF","Bitcoin halving","Goldman Sachs"],"authors":["Harvey Hunter"]}