{"summary":"El Salvador May Become One of the World’s Richest Countries Due to Bitcoin Holdings","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/el-salvador-may-become-one-of-the-worlds-richest-countries-due-to-bitcoin-holdings.htm#:~:text=Indeed%2C%20Bitcoin%20is%20already%20proving,and%20sovereignty%20to%20the%20region","publishDate":"2024-03-08T20:08:33","id":19810,"type":null,"title":"El Salvador May Become One of the World’s Richest Countries Due to Bitcoin Holdings","category":["Bitcoin News "],"content":["El Salvador – one of the smallest and most densely populated countries in Central America – may eventually become one of the wealthiest countries in the world because of its Bitcoin holdings.","For context, the country became the world’s first nation to accept Bitcoin as legal tender in September 2021. Then, on November 16, 2022, El Salvador’s President Nayib Bukele announced that the government would start purchasing 1 BTC per day.","Although President Bukele’s decision was met with criticism, it has been reported that the Bitcoin held by the government of El Salvador – which consists of over 2,000 BTC – is now valued at more than $150 million.","BREAKING NEWS: Emir of Qatar and President of El Salvador announce “No more easy buying or dips for laggards #Bitcoin full send to 70K” pic.twitter.com\/UIvDUVow6m","— RŌNIN (@ronin21btc) March 3, 2024","","While impressive, President Bukele has also stated that he has no plans to sell the country’s vast Bitcoin holdings. As the Bitcoin halving event approaches, El Salvador could see even more gains if the price of BTC continues to increase.","Given this, industry experts are predicting that El Salvador may eventually become one of the wealthiest countries in the world.","Silicon Valley-based Venture Capitalist Tim Draper recently stated on the Web3 Deep Dive podcast that El Salvador is taking off as an innovative country, noting that the region may soon be one of the most attractive places in the world to live.","“Within maybe 30 or 40 years, El Salvador will have gone from the poorest, most crime ridden country, to maybe one of the richest, most innovative countries in the world, just in that period of time,” said Draper. “And this is just because they embraced Bitcoin.”","Draper further pointed out that if Bitcoin reaches $100,000 El Salvador may be able to pay off loans owed to the International Monetary Fund (IMF).","Echoing this, Alexander Mamasidikov, Founder and CEO of CrossFi – a platform focused on bridging traditional banking with blockchain – told Cryptonews that he believes El Salvador will soon be financially independent.","“This will allow the country to focus entirely on its internal tasks, which is most important in our modern world,” said Mamasidikov. “Recognizing Bitcoin as an official currency has allowed the government to completely change the financial model and go its own way.”","Indeed, Bitcoin is already proving to be an important asset class for El Salvador.","Joe Nakamoto – a crypto journalist who recently filmed a Bitcoin-focused documentary in El Salvador – told Cryptonews that Bitcoin has introduced financial inclusivity and sovereignty to the region.","“In a country where a large portion of the population does not have access to traditional banking services and many families depend on remittances, BTC allows Salvadorans to become their own bank and receive money from anywhere in the world for an incredibly low fee,” said Nakamoto.","✨ When you pay with #Bitcoin #Lightning in El Salvador…","..you get high fives, laughs and a hug 🧡⚡️ 🇸🇻 @nayibbukele pic.twitter.com\/pqjnlOafRd","— Joe Nakamoto ⚡️ (@JoeNakamoto) July 17, 2023","","While President Bukele is firm on not selling the Government’s Bitcoin holdings, Nakamoto explained that BTC is used as money in the country by a small subset of the population.","“In circular economy projects including Berlín, El Zonte, and in some parts of San Salvador, there is an intransigent minority of Bitcoiner Salvadorans who are keen to see Bitcoin use outstrip Dollar use,” he said.","Mamasidikov pointed out that El Salvador abandoned the Dollar as a reserve currency in 2021 and began using Bitcoin. He believes that using BTC will allow the country’s wealth to increase over time.","“Bitcoin is digital gold for El Salvador, creating confidence among citizens and on the global stage, openly demonstrating that the country has money,” remarked Mamasidikov.","This is critical for El Salvador, as The World Bank has found that the region still faces high poverty rates that have doubled since 2019, along with a fragile fiscal position.","Even though El Salvador currently faces economic hardships, there are reasons  the Government should continue to hold on to its Bitcoin.","For instance, Nakamoto believes that selling the BTC the country possesses could lead to short-term financial gains, but it may also undermine confidence in El Salvador’s Bitcoin initiatives.","“I wonder how the hardcore Bitcoin community would look at El Salvador if President Bukele were to sell some of the country’s stash,” he said. “Personally, I wouldn’t care, but his resolute ‘HODLing’ suggests Bukele is sending out a message.”","Mamasidikov added that Bitcoin is not a means of speculation and trading for El Salvador because it is their reserve stock.","“If they wanted to sell BTC, they would face problems since the country has officially abandoned the reserve currency in the form of the Dollar and Gold,” he said.“This would deplete their reserves. The government will not do this.”","Regardless of what President Bukele eventually plans to do with the Government’s Bitcoin, El Salvador has started to set a positive example for other countries planning to incorporate the digital asset.","For instance, El Salvador’s long-anticipated Bitcoin bonds, also known as “Volcano Bonds,” have reportedly received regulatory approval for a launch this year. Once approved, El Salvador will be the first country in the world to leverage Bitcoin bonds.","“Personally, I see the adoption of Bitcoin in El Salvador as a step towards financial freedom while Bitcoin advocates globally can now well and truly point to El Salvador as a success story,” said Mamasidikov.","Yet although the efforts made by President Bukele have been impressive, Nakamoto pointed out that many of the country’s citizens still lack basic understanding of Bitcoin concepts.","“I interviewed over 30 Salvadorans on the streets of San Salvador to ask them if they had used Bitcoin as part of the documentary I filmed in 2022,” he said. “The vast majority had used Bitcoin at some point in the past 3 months. However, when it came to basic concepts about Bitcoin such as what is the total number of Bitcoin, most struggled.”","Given this, Nakamoto shared that he plans to travel back to El Salvador this year to further investigate Bitcoin adoption.","“I hope to repeat my questioning to understand if the country has a deeper understanding of Bitcoin and money,” he said. “Bitcoin as a technology and money is a paradigm shift, and as such, it requires time, effort, and a willingness to learn and understand.”"],"entity":[{"type":"El Salvador’s President Nayib Bukele","content":"ORGANIZATION"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"San Salvador","content":"LOCATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"September 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Berlín","content":"PERSON"},{"type":"Bukele","content":"PERSON"},{"type":"Joe Nakamoto","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Draper","content":"PERSON"},{"type":"Central America","content":"LOCATION"},{"type":"Tim Draper","content":"PERSON"},{"type":"November 16, 2022","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"Mamasidikov","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"March 3, 2024","content":"DATE"},{"type":"Government’s Bitcoin","content":"ORGANIZATION"},{"type":"El Zonte","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Government","content":"ORGANIZATION"},{"type":"The World Bank","content":"ORGANIZATION"},{"type":"El Salvador…","content":"LOCATION"},{"type":"July 17, 2023","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"Qatar","content":"LOCATION"},{"type":"Alexander Mamasidikov","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Cryptocurrency","El Salvador"],"authors":["Rachel Wolfson"]}