{"summary":"Alipay Collaborates with Avalanche for Web3 Voucher Program","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/alipay-collaborates-with-avalanche-for-web3-voucher-program.htm","publishDate":"2024-03-20T17:31:51","id":19816,"type":null,"title":"Alipay Collaborates with Avalanche for Web3 Voucher Program","category":["Blockchain News "],"content":["Alipay, a leading online payment platform, has partnered with Avalanche, a smart contract blockchain platform, to introduce a voucher program leveraging Web3 technology.","Avalanche said the initiative allows brands to test Web3 solutions and how to create new engagement opportunities with their users.","Announced on March 20, Avalanche revealed that Alipay’s ordering solution, Alipay+ D-store, along with its partnered e-wallets, are utilizing Avalanche for a Web3-enabled voucher program.","The voucher program was initially implemented in Southeast Asian milk tea stores, where customers can obtain vouchers by participating in a mini-game. Upon completing the game, users can claim a voucher directly in their e-wallets, enabling them to receive up to 50% discounts at over 500 milk tea shops.","This Web3 voucher program operates on an Avalanche subnet managed by AvaCloud, the blockchain service provided by Avalanche. The vouchers, designed to foster innovative interactions between brands like Alipay and users, are part of a proof-of-concept (POC) aimed at exploring the potential of Web3 solutions in enhancing customer engagement and driving new revenue streams.","Avalanche subnets offer flexibility, transparency, and Web3 capabilities, allowing builders to customize their EVM chains with desired privacy configurations.","In addition to offering discounts, the program enables Alipay to collaborate with other brands to leverage blockchain-powered features and digital collectibles. ","In its initial phase, the program will be introduced to over 2,000 stores, with plans to reach 100 million users. Avalanche highlighted that this initiative demonstrates its commitment to building partnerships with established brands and expanding its ecosystem.","Leading e-wallet partners across the region can integrate Alipay+ D-store, activating Avalanche’s Web3 capabilities. Alipay+ D-store streamlines in-store processes, online selling, orders, marketing, and insights, making it easy to set up an online store in just 10 minutes with no upfront costs.","As stated in the announcement, Alipay+ D-store’s voucher program opens doors for collaboration with brands using digital collectibles and blockchain-powered features. Using AvaCloud, enterprises can launch subnets with minimal cost and effort, benefiting from industry-leading Web3 capabilities.","🔺 Avalanche is cooperating with China's largest payment app @Alipay+ to launch an e-wallet and a voucher program that supports #Web3. The Avalanche subnet built and managed by AvaCloud provides support for this program and is gradually expanding to 100 million users from the…","— Dr Martin Hiesboeck (@MHiesboeck) March 20, 2024","","Avalanche, a scalable smart contract platform, offers a novel consensus protocol, subnet infrastructure, and HyperSDK toolkit, empowering Web3 developers to launch custom blockchain solutions quickly. With its eco-friendly blockchain designed for Web3 developers, developers can build anything they want in any way.","Collaborations with well-known brands have further bolstered the ecosystem’s expansion. For example, on February 20, the smart contract platform partnered with Sports Illustrated’s ticketing arm, SI Tickets, to host its NFT ticketing platform, Box Office, on the Avalanche network. This integration allows for the minting of NFT tickets directly on the Avalanche network, enhancing accessibility and usability for users.","Partnerships with traditional financial giants like JPMorgan and Citi have increased Avalanche’s recognition. These partnerships, focused on real-world asset tokenization initiatives and technological deployments, highlight the platform’s appeal to established institutions seeking innovative blockchain solutions.","Its popularity is also evident in its record-breaking user interest, as seen with the surge in Avalanche inscriptions. These inscriptions, particularly the Bitcoin BRC-20 inscription tokens, have garnered significant attention, with over 100 million Avalanche inscriptions minted since their inception in 2023.","Furthermore, Avalanche has made strategic moves into the gaming sector, as demonstrated by its collaboration with the popular MMORPG MapleStory. By extending MapleStory onto its subnet, users can now access exciting content-generation opportunities within the Avalanche ecosystem, enriching the platform’s offerings and fostering a vibrant user community."],"entity":[{"type":"SI Tickets","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"Martin Hiesboeck","content":"PERSON"},{"type":"March 20","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 20","content":"DATE"},{"type":"AvaCloud","content":"ORGANIZATION"},{"type":"March 20, 2024","content":"DATE"},{"type":"Box Office","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin BRC","content":"ORGANIZATION"},{"type":"Alipay","content":"PERSON"},{"type":"Citi","content":"ORGANIZATION"}],"hashtag":["AliPay","Avalanche","AVAX"],"authors":["Hassan Shittu"]}