{"summary":"China Warms Up to Blockchain Technology","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/china-warms-up-to-blockchain-technology-1329.htm","publishDate":"2018-03-05T09:00:00","id":19815,"type":null,"title":"China Warms Up to Blockchain Technology","category":["Blockchain News "],"content":["An idea of a national blockchain digital asset trading platform has emerged. Local governments are also keen to implement blockchain technology.","It might be hard to believe, but cryptocurrencies could make its way back into the Chinese market, although most likely in a slightly different form. Officials, business leaders and influential media outlets in China have been striking a promising tone in recent weeks toward blockchain, the underlying technology for cryptocurrencies.","At the major legislative session in Beijing known as “Two Sessions”, which started last Saturday and is expected to last until March 15, blockchain technology and cryptocurrency regulation are among the topics to be discussed in detail.","Wang Pengjie, an official delegate at the meetings, even suggested over the weekend that China should “explore setting up a national blockchain digital asset trading platform,” the People’s Daily reported.","Wang said that setting up a “regulated, effective and transparent” platform could provide a legal channel for companies seeking investment and investors. But such a platform needs to be set up under the coordination of the central bank and the securities watchdog, with regulations such as “real-name authentication.”","Wang reportedly submitted the proposal to the National People’s Congress (NPC) for review, but whether such a proposal could make its way to become a piece of legislation is unclear.","Still, this represents the first call from any top political figure in China for setting up a cryptoasset exchange after they were banned last summer.","While others did not propose such moves, many offered support for blockchain technology.","Zhang Jindong, a deputy to the 13th National People’s Congress and chairman of electronics retailer Suning Holdings Group, proposed that the “Two Sessions” should adopt appropriate legislation regarding data security and expand the adoption of artificial intelligence and blockchain technology, Xinhua News Agency reported on Saturday.","Pony Ma, another NPC deputy and billionaire chairman of China’s Tencent Group, also said on Saturday that blockchain technology “is indeed an innovative and potentially good technology, depending on how it is being used.”","Ma pointed out that blockchain technology could be used in many areas, including note verification. “We are actively exploring the application for different situations but development is still in the earlier stage and everyone is still looking at digital currency.”","Ma also noted that:","“[Tencent] will not consider issuing [digital] currency. This is a very dangerous thing.”","A hot topic throughout China","Local government officials are also pushing forward the development of blockchain technology in their own parliamentary sessions.","Liang Gang, a local official in Chengdu, the capital of southwestern China’s Sichuan province, proposed last week that the government should promote Chengdu as a technological hub for blockchain in China, focusing on applying blockchain technology in the banking sector, according to a local newspaper.","Sichuan was one of the most popular destination for Chinese bitcoin mining companies before the climate surrounding mining changed, given its favorable policy incentives to tech companies.","In Hangzhou, in East China’s Zhejiang Province, mayor Xu Liyi has put blockchain technology as top priority for the city’s development agenda, second only to artificial intelligence and virtual reality.","These are just some examples of good vibes for blockchain technology in China. In fact, blockchain has become a hot topic among people both online and offline in recent weeks. It has in many ways become a buzzword that people use to impress others. The question now is whether it could mean a possible return for cryptocurrencies to China.","Bobby Lee, CEO and co-founder of Bitcoin China, or BTCC, a crypto exchange, thinks that it’s only matter time before Chinese officials lift the ban on cryptocurrency exchanges, CNBC reported in January. He told the TV network:","","“In this world, nothing is ever permanent… one day I think it’s possible they will lift the ban, so called, and they might reinstitute it and license it.”","Lee’s assumption might have sounded ridiculous just a few months ago when Chinese regulators took a slew of measures against cryptocurrencies. But the trend of Chinese society warming up to blockchain in recent weeks definitely makes it more realistic."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"13th National People’s Congress","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"March 15","content":"DATE"},{"type":"Xinhua News Agency","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"East China","content":"LOCATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"last Saturday","content":"DATE"},{"type":"Suning Holdings Group","content":"ORGANIZATION"},{"type":"Wang Pengjie","content":"PERSON"},{"type":"Chengdu","content":"LOCATION"},{"type":"Zhejiang Province","content":"LOCATION"},{"type":"Tencent Group","content":"ORGANIZATION"},{"type":"Xu Liyi","content":"PERSON"},{"type":"National People’s Congress (NPC","content":"ORGANIZATION"},{"type":"Hangzhou","content":"LOCATION"},{"type":"NPC","content":"ORGANIZATION"},{"type":"Bitcoin China","content":"LOCATION"},{"type":"Zhang Jindong","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Bobby Lee","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["Blockchain","China","Regulation"],"authors":["Fredrik Vold"]}