{"summary":"Norwegian Man Stabbed to Death After In-Person Bitcoin Sale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/norwegian-man-stabbed-to-death-after-in-person-bitcoin-sale-2790.htm","publishDate":"2018-10-18T05:53:00","id":19826,"type":null,"title":"Norwegian Man Stabbed to Death After In-Person Bitcoin Sale","category":["Bitcoin News "],"content":["A murder in Norway, even if it’s not related to a bitcoin trade that took place before the killing happened, comes as a reminder to be extra careful when buying or selling bitcoin in person.","A 24-year-old man who was found dead in his apartment in Oslo, Norway on Monday morning, had earlier sold bitcoins to another person for cash, according to Norwegian broadcaster TV2.","The victim reportedly brought the large sum of money back to his apartment, where he was later found stabbed to death. It is unclear exactly when the bitcoin trade took place.","“We are aware of a tip relating to bitcoin, but we do not wish to elaborate on it at this stage of the investigation,” Grete Lien Metlid, head of the intelligence and investigations unit at the Oslo Police Department, told TV2.","According to sources who spoke with TV2, several of the victim’s friends were aware that he stored a large amount of money in cash in his apartment, located in one of Oslo’s best neighbourhoods, after the bitcoin sale.","After failing to show up for work Monday morning, the victim was found dead by one of his roommates at 12:15 the same day. Before that, he was last seen on Sunday night as everyone who lived in the apartment were preparing to go to sleep. It remains a mystery how the murderer got into the apartment and carried out the crime without waking up any of the other roommates.","As of press time, forensic analysts were still working on the crime scene. No arrests have yet been made in the case, nor does the police have any suspects.","Since the beginning of the year, there was a number of violent attacks on individuals who hold a substantial amount of cryptocurrency.","No matter where you are in the world, if you have a substantial holding in bitcoin or other cryptocurrencies, it is important to be aware of the potential security concerns that can arise from your newfound crypto wealth.","Now, before you go and buy yourself a gun or install the latest security system in your home, you should know that there are cheaper and perhaps more sensible precautions that you can take."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Oslo","content":"LOCATION"},{"type":"Norway","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Oslo Police Department","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Grete Lien Metlid","content":"PERSON"},{"type":"night","content":"TIME"}],"hashtag":["Bitcoin","Crime"],"authors":["Fredrik Vold"]}