{"summary":"Brazil’s Largest Lender Itau Unibanco Brings Bitcoin Trading Service to Clients","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazils-largest-lender-itau-unibanco-brings-bitcoin-trading-service-to-clients.htm","publishDate":"2023-12-04T16:34:24","id":19821,"type":null,"title":"Brazil’s Largest Lender Itau Unibanco Brings Bitcoin Trading Service to Clients","category":["Altcoin News "],"content":["Itaú Unibanco, Brazil’s largest private bank, has entered the crypto space with new trading service, per a Reuters report.","The lender would first launch Bitcoin (BTC) and Ether (ETH) trading for clients of its investment platform. The bank’s crypto division head Guto Antunes said in an interview that it is planning to add other cryptocurrency options soon.","“It starts with bitcoin, but our overarching strategic plan is to expand to other crypto assets in the future.”","The support of other tokens trading would depend on the progression of crypto regulations within the country, Antunes noted.","The latest move by Brazil’s largest lender aligns with the increasing demand for cryptocurrency services. The move also aligns with the global trend of traditional financial institutions incorporating crypto services.","Itau promises to stand out from its competitors like crypto exchange MB and investment bank BTG Pactual’s crypto unit, Mynt. Aside from local firms, the bank also faces competition from international platforms including Binance.","The announcement comes a month after two local entities, XP brokerage and financial services firm PicPay bowed out of the crypto market. PicPay attributed its departure to the crypto’s existing regulatory uncertainty.","A recent Chainalysis data paints an optimistic picture for the Brazilian crypto market. Some crypto traders along with basic retail users were stuck to the asset class even during crypto winter.","Further, Brazilians display a higher demand for Bitcoin and altcoins, which are more typically used for long-term investment and speculation.","While the crypto regulatory environment evolves, Brazil is also experiencing substantial demand for spot Bitcoin exchange-traded funds (ETFs).","This strong demand for crypto-related financial instruments suggests a rising interest in digital assets among Brazilian investors."],"entity":[{"type":"Guto Antunes","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Antunes","content":"PERSON"},{"type":"BTG","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Unibanco","content":"ORGANIZATION"},{"type":"Mynt","content":"LOCATION"}],"hashtag":["Brazil","Crypto Trading"],"authors":["Sujha Sundararajan"]}