{"summary":"XRP Crypto Price Prediction 2022 – How High Can Ripple Pump?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-crypto-price-prediction-2022-how-high-can-ripple-pump.htm","publishDate":"2022-09-23T19:28:00","id":19829,"type":null,"title":"XRP Crypto Price Prediction 2022 – How High Can Ripple Pump?","category":["Altcoin News "],"content":["XRP crypto has exponentially risen in price over the week soaring over 63% in value. The successful breakout has moved XRP up by one position and is now ranked #6 amongst other cryptocurrencies. ","Will XRP continue to pump? ","Zooming out on the XRP crypto price charts the recent pump has resulted in breaking through a critical level of resistance. At the time of writing this article XRP is trading at $0.45 and just lost a key support level of $0.51. ","The below chart reflects XRP previously getting rejected at the yellow resistance trendline, however, on this particular occasion the bulls have been able to retest and imminently break though, pumping the price of XRP up to $0.55.","Over the 105 days XRP had been trading within a consolidation pattern known as a horizontal channel and formed a giant double bottom bullish reversal pattern within it.","As the bulls are getting more and more optimistic about a legal settlement with the SEC excitement is reflected in the price action. ","XRP rocketed up to $0.55 and has since corrected by 17.25%. Entering the overbought territory on the relative strength index at 80.77 a correction was bound to take place. ","Currently XRP has lost support of the 0.382 Fibonacci retracement level and could potentially make way to the next support trendline at $0.44.","Overall, XRP is down by 76.18% from the local high of $1.96 set on the 14th of April 2021. ","Whilst I do not think we will see any all-time highs this year, current price levels could be described as undervalued and offer strong returns by the next crypto bull run. ","According to Coinmarketcap the current market capital for XRP is $23.1 billion. Incredibly, in 2018 XRP had a market capital of $130 billion.","The most recent bull run of 2021 the market capital for XRP came up to $81.4 billion. I speculate that if there were not so many legalities suppressing a bull run we could potentially see the market capital for XRP explode past $200 billion.","For those that prefer investing early before a pump, we also reviewed a new crypto coin listing set to take place Tuesday on OKX."],"entity":[{"type":"$81.4 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$1.96","content":"MONEY"},{"type":"$0.51","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"$200 billion","content":"MONEY"},{"type":"63%","content":"PERCENT"},{"type":"$0.45","content":"MONEY"},{"type":"17.25%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"$0.55","content":"MONEY"},{"type":"$0.44","content":"MONEY"},{"type":"14th of April 2021","content":"DATE"},{"type":"76.18%","content":"PERCENT"},{"type":"$130 billion","content":"MONEY"},{"type":"$23.1 billion","content":"MONEY"}],"hashtag":["Ripple","XRP"],"authors":["Jacob Bury"]}