{"summary":"Coin Metrics announced a new partnership to include Social Market Analytics into its data platform\nThat will allow traders to pull vital signal from the deluge of crypto twitter","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27628\/coin-metrics-is-unleashing-crypto-twitter-data-onto-its-platform","publishDate":"2019-06-17T12:27:59","id":1983,"type":null,"title":"Coin Metrics is unleashing crypto Twitter data onto its platform","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Crypto Twitter is often thought of as a stream of mindless consciousness, but that stream may soon become more valuable thanks to a new data partnership.&nbsp;<\/span>","Coin Metrics is incorporating Social Market Analytics’ (SMA) cryptocurrency data feed into its market data platform, which will provide sentiment data on different cryptos based on Twitter information.","Tim Rice, CEO of Coin Metrics, explained the sentiment data makes social media discourse digestible in a quantitative way for traders to plug into their strategies. Specifically, the feed offer 19 unique metrics, which traders can use to analyze the risk of their holdings, make a trade, or build indices.&nbsp;","\"We believe that the power of combining sentiment data with granular network and market data is fundamental to building a deeper understanding of crypto assets,\" Rice said.","Rice said the feed has been built to weed out Twitter chaos via an in-house build proprietary phrase and word dictionary to exclude spam tweets and bots.&nbsp;","\"Bad Bots and spammers are eliminated from calculated&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">metrics,\" Rice said. \"<\/span>A calculation engine then takes the relevant Tweets and calculates 19 different aggregate sentiment <span class=\"il\" data-v-f87c67ca=\"\">metrics<\/span>&nbsp;down to snapshots of one minute.&nbsp;","<span data-v-f87c67ca=\"\">According to Rice, the inclusion of Twitter sentiment data within its platform makes it more of an all-in-one product, which could be a considerable convenience to traders. Quant-based crypto funds have already taken an interest among other clients, according to Rice. And he expects the addition to lure users to the platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“These institutions are looking to make data-driven decision by accessing sources of data that they understand from their legacy investing frameworks,” he said.<\/span><span data-v-f87c67ca=\"\"> “<\/span><span data-v-f87c67ca=\"\">We believe that the power of combining sentiment data with granular network and market data is fundamental to building a deeper understanding of crypto assets.”<\/span>","This news is followed by Coin Metrics acquisition of Bletchley Indexes earlier this month, a move&nbsp; that <span data-v-f87c67ca=\"\">could further drive adoption of so-called <a href=\"https:\/\/www.theblockcrypto.com\/wp-admin\/post.php?post=26429&amp;action=edit\" data-v-f87c67ca=\"\">smart-beta indexing in bitcoin markets<\/a>.<\/span>","Coin Metrics, a Fidelity-backed firm, closed a $1.9 million seed round in February."],"hashtag":["SOCIAL MEDIA","TWITTER"]}