{"summary":"Singapore Court to Adjudicate DeFiance Capital’s $140 Million Dispute with 3AC Liquidators","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/singapore-court-adjudicate-defiance-capitals-140-million-dispute-with-3ac-liquidators.htm","publishDate":"2023-08-16T12:12:00","id":19832,"type":null,"title":"Singapore Court to Adjudicate DeFiance Capital’s $140 Million Dispute with 3AC Liquidators","category":["Blockchain News "],"content":["A judge in Singapore has decided that a $140 million legal dispute between bankrupt crypto hedge fund Three Arrows Capital’s (3AC) liquidators and investment firm DeFiance Capital will be heard in the city-state, against the will of the liquidators.","The disagreement between the parties center around assets managed by DeFiance Capital, an independently run firm that was within the 3AC corporate structure.","The 3AC liquidators argue DeFiance Capital’s assets should be included in the 3AC bankruptcy estate for distribution to creditors, while DeFiance Capital insists they should be treated separately and returned to its investors.","In a hearing on August 8, Singapore Judge Chua Lee Ming ruled in favor of hearing the case in Singapore.","As the reason, the judge pointed to several factors, including the location of crypto assets held by DeFiance Capital and the substantial creation of the trust in Singapore.","The judge also emphasized the importance of evidence related to DeFiance Capital founder Arthur Cheong’s control over the fund.","In comments posted on social media platform X, Cheong expressed optimism about the judge’s decision to hear the case in Singapore, viewing it as a vindication of their position.","“We are delighted that following a hearing last week, the High Court of Singapore agreed with our position, accepting that Singapore is the more appropriate jurisdiction for hearing this dispute, implicitly accepting that our case was not, as the liquidators claim, ‘without merit’,” Cheong wrote.","Statement and Update on Dispute with Three Arrows Capital Limited (3AC)\n\nWe are very pleased to share a positive development on our end with the public.\n\nIt is well-known that for the past year, we have been locked in a dispute with the 3AC estate who are claiming that the assets…","Meanwhile, the same dispute is also under discussion in the British Virgin Islands (BVI), and if it is determined that the BVI is the appropriate jurisdiction, parallel proceedings could result in divergent judgments in the two cases, The Block reported on Tuesday.","Assets under contention amount to $141 million, according to the liquidators, while DeFiance Capital has estimated the value to be $120 million.","The assets include cryptocurrencies, non-fungible tokens (NFTs), and SAFE\/SAFT (simple agreement for future equity\/simple agreement for future tokens) contracts.","DeFiance Capital was initially launched within the 3AC structure but achieved independence in 2022.","The situation grew complex when 3AC founders transferred legal rights and certain assets from DeFiance Capital, leading to a disagreement over the disposition of these holdings.","Despite these legal troubles, Cheong has moved forward with raising funds for a new venture, the DeFiance Liquid Venture Fund, which invests in liquid tokens."],"entity":[{"type":"August 8","content":"DATE"},{"type":"Cheong","content":"ORGANIZATION"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"DeFiance Liquid Venture Fund","content":"ORGANIZATION"},{"type":"High Court","content":"ORGANIZATION"},{"type":"Chua Lee Ming","content":"PERSON"},{"type":"$141 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$140 million","content":"MONEY"},{"type":"BVI","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"$120 million","content":"MONEY"},{"type":"British Virgin Islands","content":"LOCATION"}],"hashtag":["Three Arrows Capital"],"authors":["Fredrik Vold"]}