{"summary":"Ore Suspends Mining Amid Solana Congestion to Prepare for V2","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ore-suspends-mining-amid-solana-congestion-to-prepare-for-v2.htm","publishDate":"2024-04-17T05:32:16","id":19839,"type":null,"title":"Ore Suspends Mining Amid Solana Congestion to Prepare for V2","category":["Blockchain News "],"content":["Ore has paused its mining operations on the Solana blockchain to address issues of network congestion.","According to a series of social media posts by the Ore developer Hardhat Chad, the mining suspension aims to mitigate the recent congestion on Solana caused by the rapid adoption of their protocol.","I have decided to pause all mining, effective immediately.","I believe this action to be in the best interests of Solana, Ore holders, and the fastest path forward to v2.","🧵","— Hardhat Chad (@HardhatChad) April 16, 2024","","“I have decided to pause all mining, effective immediately. I believe this action to be in the best interests of Solana, Ore holders, and the fastest path forward to v2,” announced the contributor.","The protocol was initially introduced two weeks ago during a hackathon as an experimental endeavor. Since its launch, it has rapidly become the most actively used program on the Solana network based on transaction count.","Hardhat Chad further noted that Ore has produced a higher load on Solana’s mainnet than any other smart contract in blockchain history, addressing to its significant impact on network traffic.","“This experiment helped identify bugs in the Solana networking stack and validated my core thesis that proof-of-work can be a fun and fair token distribution mechanism,” said Hardhat Chad.","“With this demonstration now behind us, I believe it’s appropriate we turn to optimizing the system for v2,” he said.","Recent difficulty updates have made clear the need for a new contract design. Pausing operations now will provide the developers the necessary time to analyze the data, assemble a team, and concentrate efforts on refining Version 2.","“The v2 contract will aim to address three primary issues in the current system: 1. Inefficiencies in the code were being squeezed to give some miners an asymmetric edge,” stated Hardhat Chad.","“2. There is currently no structural incentive to hold the token. Miners who hold Ore should receive an advantage when mining,” he said. “3. Difficulty changes should be either algorithmic or pick-your-own. This would be far less biased than a vote.”","Hardhat Chad assured that there is no deadline for claiming rewards and all existing Ore tokens will be eligible for a one-for-one upgrade to the new Version 2 tokens. More details about Version 2 will be shared in the coming weeks."],"entity":[{"type":"Hardhat Chad","content":"PERSON"},{"type":"Hardhat Chad","content":"LOCATION"},{"type":"April 16, 2024","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Mining","Solana"],"authors":["Hongji Feng"]}