{"summary":"Erik Voorhees, ShapeShift Founder, Unveils Privacy-Focused AI Platform ‘Venice’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/erik-voorhees-shapeshift-founder-unveils-privacy-focused-ai-platform-venice.htm","publishDate":"2024-05-11T16:00:57","id":19844,"type":null,"title":"Erik Voorhees, ShapeShift Founder, Unveils Privacy-Focused AI Platform ‘Venice’","category":["Altcoin News "],"content":["Erik Voorhees, the founder of popular cryptocurrency exchange ShapeShift, has unveiled his latest venture called “Venice AI.”","The new platform introduces a privacy-focused generative AI chatbot, addressing the growing concerns surrounding privacy in both the cryptocurrency and artificial intelligence (AI) industries.","In the announcement, Voorhees expressed his worries about the direction of AI, stating that he observed a trend where large tech companies, closely aligned with governments, are gaining control over AI technologies.","He said that this could lead to a dystopian future and advocates for open-source decentralization as a countermeasure.","Voorhees aims to provide users with an alternative choice by offering open-source AI solutions.","Back in 2014, Voorhees launched the ShapeShift cryptocurrency exchange.","However, in July 2021, the exchange announced its transition into an open-source decentralized exchange (DEX), with control being transferred to the ShapeShift DAO.","Following a battle with the Securities and Exchange Commission, ShapeShift agreed to pay a fine and comply with a cease-and-desist order, leading Voorhees to shift his focus towards building a permissionless, decentralized AI model.","Announcing Venice","Today, we launch private, permissionless AI for the purpose of unfettered civilizational advancement: https:\/\/t.co\/m2jsJuDuXS","Full announcement:https:\/\/t.co\/lPIDpgI9K1@TryVenice","A thread…\n1\/17","— Erik Voorhees (@ErikVoorhees) May 10, 2024","","Venice AI, the latest product from Erik Voorhees, prioritizes user privacy. It does not store user data or have access to user conversations.","Instead, user input is sent through an encrypted proxy server to a decentralized GPU, which runs the AI model and returns the answer.","This process ensures security and anonymity, as the GPU only sees the specific prompt and not the user’s entire conversation.","Venice AI’s model is designed to be substantially better than the current status quo, where centralized companies store and retain user conversations tied to their identities.","The AI industry’s top players, such as Microsoft, Google, OpenAI, and Meta, have made efforts to improve the perception of generative AI by promoting responsible AI practices.","However, Voorhees argues that once a company has access to user information, it cannot be trusted to delete it permanently.","Venice AI addresses this concern by avoiding central repositories altogether. Chat history is stored locally in the user’s browser and can be deleted at any time, even without creating an account.","While creating an account offers certain advantages, such as higher message limits and the ability to modify prompts, users can also access additional features by subscribing to a Venice Pro account.","Currently priced at $49 annually, Venice Pro provides unlimited text prompts, removes watermarks from generated images and document uploads, and allows users to turn off Safe Mode for unrestricted image generation.","Although Venice AI does not yet accept digital currencies for Venice Pro subscriptions, Voorhees confirmed that this feature is coming soon.","Fun with https:\/\/t.co\/m2jsJuDuXS","In Venice (with a Pro account), you can modify the \"System Prompt.\" This is basically like god mode or root access over the LLM with which you're interacting.","It can enable interesting perspectives that normal AI services would censor. pic.twitter.com\/qlt0xp0aC9","— Erik Voorhees (@ErikVoorhees) May 10, 2024","","In the meantime, users holding the Morpheus token will be rewarded with a free Pro account indefinitely.","The platform integrates with MetaMask wallets, offering users a seamless experience.","While Venice AI is built on the decentralized Morpheus network, Voorhees acknowledges concerns regarding its performance.","He noted that it is important that AI solutions are on par with centralized companies to ensure user adoption."],"entity":[{"type":"2014","content":"DATE"},{"type":"Voorhees","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"$49","content":"MONEY"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"ShapeShift DAO","content":"ORGANIZATION"},{"type":"May 10, 2024","content":"DATE"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Venice","content":"LOCATION"},{"type":"July 2021","content":"DATE"}],"hashtag":["Artificial Intelligence"],"authors":["Ruholamin Haqshanas"]}