{"summary":"Russian Firms ‘Already Doing Business in Crypto’ – And Say They’ve ‘Every Right to Do So’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russian-firms-already-doing-business-crypto-say-theyve-every-right-do-so.htm","publishDate":"2023-05-12T09:30:00","id":19849,"type":null,"title":"Russian Firms ‘Already Doing Business in Crypto’ – And Say They’ve ‘Every Right to Do So’","category":["Blockchain News "],"content":["A top Russian politician says domestic firms are “already” doing business overseas in crypto – and says they think they are within their legal rights to do so.","The nation’s vehemently anti-crypto Central Bank has recently agreed to the creation of a law that will allow certain firms to trade in crypto under its auspice.","But one of the nation’s top MPs has suggested that even this may not be necessary.","The comments came from Anatoly Aksakov, the Chair of the State Duma Committee on the Financial Markets.","The BeIn Crypto Russian-language site quoted Aksakov as stating that “big” Russian companies are already “using cryptocurrency to make payments.”","United States and EU sanctions have effectively frozen Russia out of dollar-powered trade.","But Russian firms think they can circumvent these measures by paying for imports in crypto.","They also want the power to receive crypto payments from foreign buyers of Russian exports.","And Aksakov explained that Russian “authorities” are “aware” that many “large” Russian firms are doing just that.","He stated that “businesses are not afraid of persecution, because they believe that they are acting within the law.”","He said:","“[Big Russian companies are saying: ‘We don’t even need a law [to carry out crypto transaction-powered business]. We know we are working within the existing legal framework and are not afraid of the consequences.’”","The fact that senior politicians like Aksakov are aware of the situation and are happy to allow firms to continue in this manner is an indication that Moscow may be softening its crypto stance.","The Central Bank has stated that it is happy to allow firms to buy and sell goods in crypto.","But it will only sign off on this if it can receive assurances that the crypto used in these deals will be sold for fiat overseas.","It does not want crypto to enter the Russian economy, and prefers to prioritize the fast-tracked launch of a digital ruble.","Last month, Russian lawmakers claimed that they were making rapid progress on crypto regulation, with two bills reportedly ready for adoption as early as June.","In addition to regulating the crypto sector, MPs also want to legalize authorized crypto mining.","They also hope to outlaw unregistered mining, and will seek to tax industrial miners on their profits."],"entity":[{"type":"Anatoly Aksakov","content":"PERSON"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Financial Markets","content":"ORGANIZATION"},{"type":"State Duma Committee","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Aksakov","content":"PERSON"}],"hashtag":["Russia"],"authors":["Tim Alper"]}