{"summary":"Binance Executives Stripped of Passports, Held in Confinement by Nigerian Authorities for Two Weeks","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-executives-held-in-confinement-for-two-weeks-in-nigeria.htm","publishDate":"2024-03-12T08:32:18","id":19842,"type":null,"title":"Binance Executives Stripped of Passports, Held in Confinement by Nigerian Authorities for Two Weeks","category":["Altcoin News "],"content":["Two senior executives from cryptocurrency exchange Binance have been detained against their will by Nigerian authorities for the past two weeks. ","Tigran Gambaryan, who leads Binance’s criminal investigations team, and Nadeem Anjarwalla, Binance’s regional manager for Africa based in Kenya, have been stripped of their passports and confined to government property in Abuja, the Nigerian capital, according to a report from Wired.","The ordeal began on February 26 when Gambaryan and Anjarwalla arrived in Abuja to address the ongoing dispute between Binance and the Nigerian government. ","The government had ordered the country’s telecoms to block access to Binance and other cryptocurrency exchanges, citing the devaluation of the national currency, the naira, and alleged facilitation of “illicit flows” of funds. ","However, the executives were taken to their hotels after their initial meeting and then moved to a government-run guesthouse by Nigeria’s National Security Agency.","The families of Gambaryan and Anjarwalla have expressed deep concern and frustration over the lack of information and uncertainty surrounding the situation.","“There’s no definite answer for anything: how’s he’s doing, what’s going to happen to him, when he’s coming back,” Gambaryan’s wife, Yuki Gambaryan, told Wired. “And not knowing that is killing me.”","Despite visits from a US State Department official and a representative from the UK foreign office, the executives have not been able to communicate privately due to the presence of Nigerian government guards during these meetings. ","The families have also shared that Gambaryan and Anjarwalla were briefly transferred to a local hospital when Anjarwalla fell ill, possibly due to malaria, but have since been returned to the government property where they continue to be held.","Binance, when approached for comment, declined to provide details regarding the accusations or demands made by the Nigerian government. ","However, a spokesperson stated that the company is working collaboratively with Nigerian authorities to secure the safe return of the executives. ","The spokesperson emphasized the professionalism and integrity of Gambaryan and Anjarwalla and expressed hope for a swift resolution to the matter.","The detention of Gambaryan and Anjarwalla is particularly ironic given Gambaryan’s reputation as a former US federal agent specializing in cryptocurrency-related investigations. ","His recruitment by Binance was seen as an effort to improve compliance with regulations and cooperate more closely with law enforcement.","Prior to joining Binance, Gambaryan was involved in high-profile cases, including the investigation into the Silk Road dark-web drug market and the takedown of the Welcome to Video crypto-based child sexual abuse materials network.","As reported, Binance recently had to discontinue all services involving Nigerian local fiat currency, the Nigerian naira (NGN), after regulatory scrutiny. ","Last week, the world’s largest cryptocurrency exchange said it would suspend NGN withdrawals after March 8. ","Earlier, the Nigerian government imposed a staggering $10 billion fine on Binance as part of a crackdown on the platform in an effort to stabilize the nation’s local currency. "],"entity":[{"type":"February 26","content":"DATE"},{"type":"Yuki Gambaryan","content":"PERSON"},{"type":"Kenya","content":"LOCATION"},{"type":"Gambaryan","content":"PERSON"},{"type":"Abuja","content":"LOCATION"},{"type":"US State Department","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Anjarwalla","content":"PERSON"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Anjarwalla","content":"ORGANIZATION"},{"type":"March 8","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Nigeria’s National Security Agency","content":"ORGANIZATION"}],"hashtag":["Binance","Nigeria"],"authors":["Ruholamin Haqshanas"]}