{"summary":"STRK Token Claims Surge to 420M in a Day as Starknet Blockchain Transactions Reach Record High","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/strk-token-claims-surge-to-420m-in-a-day-as-starknet-blockchain-transactions-reach-record-high.htm","publishDate":"2024-02-21T23:08:03","id":19854,"type":null,"title":"STRK Token Claims Surge to 420M in a Day as Starknet Blockchain Transactions Reach Record High","category":["Blockchain News "],"content":["Starknet, an Ethereum layer-2 scaling protocol, commenced the distribution of its native network token, the STRK token, on February 20, witnessing a substantial uptake with millions of tokens claimed upon the launch of the provisions portal.","The newly released STRK tokens experienced robust demand, with 71% of available tokens claimed within the first 24 hours of the mammoth airdrop going live. Tokenflow data reveal that over 490,000 individual users claimed 420 million tokens. ","Although the price initially slumped from a debut high of $5 to $1.77, positive funding rates in the futures market indicate bullish sentiment among investors.","As it entered the broader cryptocurrency ecosystem, STRK traded above $7 on Binance and exceeded $5 on KuCoin. CoinMarketCap data indicated STRK trading between $3 and $4, with a market capitalization exceeding $2.1 billion.","Over 1.3 million wallets, including those of Ethereum solo and liquid stakers, Starknet developers and users, and projects outside the Web3 ecosystem, can claim Starknet’s native token. During the peak of the airdrop claim frenzy, Starknet recorded a record high of 1.06 million daily transactions, achieving a notable speed of 45.2 transactions per second. This surpassed the transaction volumes of other layer-2 networks, such as Arbitrum and Optimism.","STRK serves as the native token of Starknet, a layer-2 network utilizing zero-knowledge cryptography to scale the Ethereum blockchain by processing transactions off-chain, thereby reducing fees and enhancing transaction speeds. The level of token demand observed parallels the uptake seen during Jupiter’s massive airdrop in January and Arbitrum’s first-day takeup in March last year.","Trading volume for STRK reached $1.6 billion over the past 24 hours, while open interest surpassed $150 million. Positive funding rates on Bybit suggest that futures traders maintain a bullish outlook on STRK despite the substantial spot demand driven by airdrop claimants liquidating their positions.","Another metric indicating network activity is the measurement of Cario, Starknet’s native smart contract language, which recorded 7.8 billion Cario steps on Tuesday, matching a previous record high set in November.","Although the token remains volatile, with over $7 million in liquidated positions across long and short trades, high levels of liquidity on exchanges like Binance are evident. Binance’s 2% market depth indicates that capital between $1.38 million and $1.53 million is required to move the token by 2% in either direction.","Regarding total value locked (TVL) on Starknet, the figure stands at $56 million, showcasing stability since the initial rise from $40 million on February 1, as reported by DefiLlama.","The Starknet Foundation released an outline of its token provision alongside the launch of a dedicated portal enabling individuals to check their eligibility and receive STRK tokens. The protocol addressed concerns Starknet and Ethereum community members raised regarding the STRK airdrop’s eligibility criteria, acknowledging feedback and committing to a resolution for users who felt overlooked.","More than 700 million STRK tokens are slated for allocation across nine categories, earmarked for governance and transaction fees, with staking of STRK tokens planned for the future.","Starknet cautioned the broader cryptocurrency ecosystem to remain vigilant against scams and malicious links amidst the token distribution.","StarkWare and the Starknet Foundation also announced a pilot program called “Devonomics,” allocating a 10% cut of network fees to developers. The program aims to empower decentralized app builders and infrastructure engineers through transparent and open voting processes.","In an announcement shared on December 12, StarkWare CEO Uri Kolodny said it allocated a portion of the network fees, provisionally 8%, to decentralized app builders and 2% to infrastructure engineers and core developers through a transparent and open voting process.","“It’s all about giving the hands-on builders a strong voice in shaping the network,” explained Kolodny.","Starknet currently ranks as the ninth-largest layer-2 network by total value locked (TVL), with $137 million locked, marking a significant increase of over 2,600% since the beginning of 2023, according to industry analytics platform L2beat."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"December 12","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Kolodny","content":"PERSON"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"March last year","content":"DATE"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$5","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"$4","content":"MONEY"},{"type":"$1.38 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$7","content":"MONEY"},{"type":"Cario","content":"LOCATION"},{"type":"$56 million","content":"MONEY"},{"type":"$2.1 billion","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"2,600%","content":"PERCENT"},{"type":"$137 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"$7 million","content":"MONEY"},{"type":"71%","content":"PERCENT"},{"type":"$1.53 million","content":"MONEY"},{"type":"$1.77","content":"MONEY"},{"type":"February 1","content":"DATE"},{"type":"Uri Kolodny","content":"PERSON"},{"type":"February 20","content":"DATE"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["Ethereum","Starknet","STRK"],"authors":["Hassan Shittu"]}