{"summary":"Hong Kong Gears Up for e-HKD: Phase Two Pilot Seeks CBDC Use Cases","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-gears-up-for-e-hkd-phase-two-pilot-seeks-cbdc-use-cases.htm","publishDate":"2024-03-15T08:07:28","id":19869,"type":null,"title":"Hong Kong Gears Up for e-HKD: Phase Two Pilot Seeks CBDC Use Cases","category":["Blockchain News "],"content":["Hong Kong’s central bank, the Hong Kong Monetary Authority (HKMA), announced today the launch of the second phase of its e-HKD pilot program.","They also invite industry participants to propose potential use cases for the central bank digital currency (CBDC). This initiative aims to delve deeper into the potential of a central bank digital currency (CBDC) for the region.","Announced on March 14, the HKMA’s second phase of the e-HKD pilot aims further to explore the potential of a digital Hong Kong dollar, focusing on areas such as programmability, tokenization, and atomic settlement. ","The HKMA expressed its intention to explore new use cases for the e-HKD while also revisiting promising applications identified during the first phase, which concluded in October 2023. The initial phase successfully tested the e-HKD for various domestic retail purposes, including programmable payments, settlement of tokenized assets, and offline transactions.","The HKMA highlighted that the upgraded e-HKD sandbox will benefit from Project Ensemble, a recently launched initiative focused on wholesale CBDCs. The regulatory sandbox is an essential mechanism in the HKMA’s work to improve the network around CBDCs, enabling the smooth integration of the e-HKD with the current financial system. ","This collaboration aims to “accelerate the development and testing of use cases” for participants while examining interoperability between the e-HKD and other forms of digital currency. The e-HKD sandbox infrastructure will be central to the eventual introduction and integration of digital currency into Hong Kong’s financial market.","According to the HKMA’s pilot page, the second phase of the e-HKD pilot is expected to run until mid-2025. Organizations interested in contributing to the program are invited to submit applications by May 17. The HKMA noted the extensive participation of major financial institutions and payment providers during the first phase.","Participants will have the opportunity to test and evaluate proposed use cases during this time. The HKMA’s guidelines for participation include criteria such as innovation, impact on consumer experience, readiness for market testing, compliance with regulations, and maximizing the use of e-HKD in Hong Kong.","Key players from different sectors, such as major financial institutions and payment firms that participated in the first phase, will be crucial in this investigation. Some of the names on the list for the first phase included major financial institutions and payment firms such as Alipay, Bank of China, HSBC, Hang Seng Bank, China Construction Bank, Industrial and Commercial Bank of China, Mastercard, Visa, Boston Consulting Group, and ZA Bank.","The HKMA launched the e-HKD pilot program in November 2022 to evaluate the commercial viability of an in-house CBDC as part of its “Fintech 2025” strategy. Phase one was dedicated to studying e-HKD in six areas: full-fledged payments, programmable payments, offline payments, tokenized deposits, and settlement of Web3 transactions and tokenized assets.","Research on Hong Kong’s central bank digital currency (CBDC) places the region among over 100 jurisdictions globally exploring CBDCs’ potentials and advantages. This worldwide interest in CBDCs signifies a growing recognition of digital currencies’ capacity to enhance the efficiency, security, and inclusivity of financial systems.","As the e-HKD pilot advances, the knowledge acquired will not only enhance Hong Kong’s financial framework but also contribute to a wider global comprehension of CBDCs. The results of this pilot have the potential to shape the adoption and regulation of digital currencies worldwide, establishing precedents for forthcoming endeavors in digital finance."],"entity":[{"type":"HSBC","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"May 17","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"March 14","content":"DATE"},{"type":"Hang Seng Bank","content":"ORGANIZATION"},{"type":"Commercial Bank of China","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"China Construction Bank","content":"ORGANIZATION"},{"type":"ZA Bank","content":"ORGANIZATION"},{"type":"Boston Consulting Group","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Alipay","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"}],"hashtag":["e-HKD","HKMA","Hong Kong"],"authors":["Hassan Shittu"]}