{"summary":"Spot Bitcoin ETF Bidding War Heats Up as Applicants Drop Proposed Management Fees Ahead of Expected SEC Approvals – Where Next for the BTC Price?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spot-bitcoin-etf-bidding-war-heats-up-as-applicants-drop-proposed-management-fees-ahead-of-expected-sec-approvals-where-next-for-the-btc-price.htm","publishDate":"2024-01-09T16:02:21","id":19866,"type":null,"title":"Spot Bitcoin ETF Bidding War Heats Up as Applicants Drop Proposed Management Fees Ahead of Expected SEC Approvals – Where Next for the BTC Price?","category":["Bitcoin News "],"content":["Various ETF providers are dropping the management fee they plan to charge investors who buy their spot Bitcoin ETFs, as a bidding war heats up ahead of the expected approvals by Wednesday.","Up to 13 ETF providers may be given the green light to launch spot Bitcoin ETFs by the US Securities and Exchange Commission (SEC) as soon as Wednesday.","Invesco just dropped the proposed fee on its ETF to 0.39% annually from 0.59%, as per an SEC filing.","Valkyrie just dropped its proposed fee to 0.49% from 0.8%.","And WisdomTree just dropped its proposed fee to 0.2%.","WisdomTree also announced that it will waive fees for the first $1 billion in assets under management (AUM).","Presumably, this move by WisdomTree is a marketing stunt to try and engineer great fear of missing out (FOMO) around its ETF launch.","Other ETF providers are employing similar tactics to attract investor attention to their proposed spot Bitcoin ETFs.","Bitwise, ARK\/21Shares, Invesco and iShares (BlackRock) are all proposing either zero or lower fees for the first few months\/tranch of AUM.","Regardless of long term plans, the intensity of this bitcoin ETF bidding war is telling me the issuers believe that the winner’s low fees will be compensated by HUGE $$ inflows. pic.twitter.com\/tzEmHzPsWU","— Tuur Demeester (@TuurDemeester) January 9, 2024","","Some analysts and market participants betting that spot Bitcoin ETFs could go live as soon as Thursday.","VanEck’s CEO was recently on CNBC touting this view.","🚨VanEck CEO says their spot Bitcoin ETF will START trading on Thursday (in 2 days) pic.twitter.com\/4w1g2pXzft","— Kris Kay | 🦇🔊🍩 DeFi Donut (@thekriskay) January 9, 2024","","As a result, FOMO has been rapidly building up in the Bitcoin (BTC) market.","BTC vaulted above $47,000 for the first time since April 2022 on Monday, pumping around 7% on the day, its best one-day performance since October.","The approval of spot Bitcoin ETFs could open the door to waves of new long-term institutional investment into BTC.","Standard Chartered recently projected a $200,000 BTC price by 2025 amid $50-100 billion of inflows.","🔸 Spot bitcoin ETFs may bring $50-100 billion of inflows in 2024, says Standard Chartered Bank","As a result, the price of bitcoin could rise to $200,000 by the end of 2025, according to the bank.https:\/\/t.co\/x3CSYdk9Uo","— *Walter Bloomberg (@DeItaone) January 8, 2024","","And the bidding war between potential spot Bitcoin ETF providers has been further pumping excitement.","Bitcoin traders will be closely monitoring the volume of inflows that new spot Bitcoin ETF products attract on Thursday.","That’s assuming they get the green light to launch from the SEC.","Some analysts have been flagging the risk that Bitcoin suffers a “sell-the-fact” reaction to the approval of spot Bitcoin ETFs.","That’s thanks to the fact that, ahead of anticipated approvals, the BTC price is up over 70% in 90 days.","“Sell-the-fact” refers to a market phenomenon where investors take profit following the confirmation of a positive catalyst.","But chart analysis suggests that momentum lies firmly in the hands of the bulls.","The BTC price recently broke to the north of a short-term upward trend channel that had been in play for around one month, setting the stage for a potential acceleration of near-term gains.","Spot Bitcoin ETF approvals could well be the catalyst for a near-term price surge, especially if demand at launch exceeds expectations.","Bulls will be eyeing tests of the 2022 highs in the $48,000s and the key psychologically important $50,000 level.","Of course, if the SEC opts to reject or delay spot Bitcoin ETF approvals, we are likely to see a massive market reversal and a near-term bearish trading bias.","Meanwhile, a sell-the-fact reaction could easily see prices dip back towards $40,000 amid a flush out of leveraged long positions.","But the long-term outlook remains bullish.","Not only should spot Bitcoin ETF approvals in the US introduce new structural demand for BTC.","But if the Fed is to start cutting interest rates (as most expect) in 2024, macro should also become a major tailwind moving forward.","The Bitcoin halving, coming up in April, has also historically been a bullish event.","That’s because the halving of the BTC issuance rate lowers sell pressure from BTC miners.","New all-time highs for the BTC price in 2024 are very much on the table."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$50","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"April 2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"Walter Bloomberg","content":"PERSON"},{"type":"Kris Kay","content":"PERSON"},{"type":"AUM","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$47,000","content":"MONEY"},{"type":"0.39%","content":"PERCENT"},{"type":"0.49%","content":"PERCENT"},{"type":"0.59%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"January 8, 2024","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"2025","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$48,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"VanEck CEO","content":"ORGANIZATION"},{"type":"0.8%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"0.2%","content":"PERCENT"},{"type":"$$ inflows","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"January 9, 2024","content":"DATE"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Standard Chartered Bank","content":"ORGANIZATION"}],"hashtag":["Bitcoin","btc","spot Bitcoin ETF"],"authors":["Joel Frank"]}