{"summary":"South Korean Tax Dodgers Out of Pocket as Authorities Seize $768,500 Worth of Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-tax-dodgers-out-of-pocket-as-authorities-seize-768500-worth-of-crypto.htm","publishDate":"2024-03-21T03:00:24","id":19864,"type":null,"title":"South Korean Tax Dodgers Out of Pocket as Authorities Seize $768,500 Worth of Crypto","category":["Blockchain News "],"content":["South Korean “tax dodgers” have been dealt another blow, with tax authorities in the city of Hwaseong confiscating crypto assets worth over $768,500.","Tax officers said they had seized a whopping $567,000 of the total from one single individual. The move is part of a continued nationwide crackdown.","Crypto trading profits are not yet subject to taxation in South Korea, where successive governments have u-turned on and delayed plans to introduce levies.","However, tax officials think that many people throughout the country have used crypto to conceal their earnings and income.","Tax officers have been given the power to comb data from domestic crypto exchanges to look for evidence of undeclared income.","Per Newsis, the city began to investigate the aforementioned individual after noticing they had failed to pay local taxes and local income tax levies.","But using a new “electronic management system that can track virtual assets,” Hwaseong tax officials could monitor the individual’s crypto transactions.","The city began using the new platform in October last year. Officials used this solution to probe the individual, named only as “A” by the media outlet.","City officials initially found that A appeared to own no property, had no cash assets, and did not live at a registered Hwaseong address.","The officials launched a larger probe in conjunction with the National Tax Service. They even questioned A’s family members.","Eventually, the officials began to suspect that A may have been using crypto to pay for living costs.","Using crypto exchange data, the officials unearthed A’s crypto holdings, which they seized to pay off the individual’s tax bills.","The city also began investigating 568 residents who had defaulted on large amounts of local taxes.","In each case, the tax body checked to see if it could find crypto wallets in these people’s names.","Finally, officers discovered that 100 of these people “held virtual assets.” They seized a total of $201,500 worth of crypto from these “tax dodgers.”","An undisclosed number of these individuals appear to have made “voluntary” cash payments to stop the city from forcibly liquidating their cryptoassets.","The South Korean won’s correlation with the yen has risen to the highest level in more than nine months as traders await a potentially historic policy decision by the Bank of Japan https:\/\/t.co\/ace64BEHOU","— Bloomberg Economics (@economics) March 19, 2024","","Oh Chu-seop, the head of the city’s tax collection department, said:","“We will take strong action against habitual tax dodgers by all means possible. That includes seizing their personal assets.”","In February, the province of Gyeonggi announced it had recovered $4.6 million in outstanding taxes from crypto-holding residents using a similar system.","South Korean tax dodgers have been warned local authorities are coming for them. Tax officials said they had seized tokens worth $28.4 million from “delinquents” in 2023.","Under ruling party proposals, South Korea could once again move to defer the introduction of capital gains tax on crypto earnings.","Such a proposed delay would likely push tax plans back, and would not require South Koreans to pay any tax on their coin earnings until 2027 at the earliest.","South Korean President Yoon Suk Yeol called for deeper defense ties with the United Kingdom as he met the visiting British deputy prime minister, with the two countries also kicking off a new round of trade negotiations this week https:\/\/t.co\/pBkp89OG8K","— Reuters (@Reuters) March 20, 2024","","South Korea goes to the polls for legislative elections on April 10.","Earlier this month, the National Tax Service said it had commissioned an IT firm to help it build a crypto monitoring system.","The system will help the body ensure that crypto holders do not fall behind on their taxes. The service said the platform will help the body seize coins from those who fail to pay income and local taxes."],"entity":[{"type":"Bloomberg Economics","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"2027","content":"DATE"},{"type":"Bank of Japan https:\/\/t.co\/ace64BEHOU","content":"ORGANIZATION"},{"type":"Yoon Suk Yeol","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"$768,500","content":"MONEY"},{"type":"October last year","content":"DATE"},{"type":"$201,500","content":"MONEY"},{"type":"$567,000","content":"MONEY"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Newsis","content":"PERSON"},{"type":"$4.6 million","content":"MONEY"},{"type":"March 19, 2024","content":"DATE"},{"type":"South Koreans","content":"LOCATION"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"March 20, 2024","content":"DATE"},{"type":"$28.4 million","content":"MONEY"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["South Korea","Tax"],"authors":["Tim Alper"]}