{"summary":"Early Crypto Investor Erik Voorhees Says the Next Bitcoin Bull Market Will Start When This Happens","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/early-crypto-investor-erik-voorhees-says-next-bitcoin-bull-market-will-start-when-happens.htm","publishDate":"2023-01-04T10:40:00","id":19873,"type":null,"title":"Early Crypto Investor Erik Voorhees Says the Next Bitcoin Bull Market Will Start When This Happens","category":["Bitcoin News "],"content":["The next bull market could start anytime between the summer of this year and 2026, according to crypto veteran Erik Voorhees, who also mentioned the need for the macro environment to improve first.","Voorhees, who is the founder and CEO of crypto exchange ShapeShift, was a guest on the latest Bankless podcast episode.","Replying to a question about when we’d get to see another bull run and all-time highs, Voorhees jokingly said that it wouldn’t be 10 years, adding that he often talks with his “crypto OG” friends over barbecues when the markets would turn around – but that they’re always wrong. ","He stated, however, that,","“If it takes 10 years for the bull market to happen, probably the whole thing failed. […] I would guess it’s sometimes in the next 6 months to 3 years.” ","Certain things need to occur in order for the bull to return, Voorhees suggested. There is also some amount of time necessary “for people’s minds to start changing and speculative cycles to return.”","The CEO stated “It also has a lot to do with the macro environment. So as long as the interest rates are held high, monetary conditions are tighter, it’s gonna be a headwind. But […] that will start changing in early to mid-next year. So, I wouldn’t be surprised if bitcoin was at like 40K by the summer, that wouldn’t surprise me at all. And that’s like 2.5X from here, so that’s a great return.”","Voorhees had some lessons and warnings to share about both the bull and the bear markets – certain common denominators seen every time during each cycle.","Not unique to crypto, he said, but “when the bullishness is happening, people’s skepticism and judgment fall way too low” and they’re willing to accept anything. That is the time when “all the stupid ideas get just as much money as the good ones, there is no discretion, and everyone is making money doing everything.”","Therefore, Voorhees warned that,","“During a bull market, remembering to stay sane means [asking] yourself if this thing is actually useful or it’s just stupid. […] Don’t follow the crowd, because they’ll go into everything.”","Meanwhile, in the bear market, people are “far too bearish, and they dismiss the whole thing.” The technology hasn’t suddenly changed between the bull and the bear markets, it will work just the same in either one – meaning that it is the users’ opinion of it that turns negative. ","The bear market advice would be to buy and build, but also to “just remember to live your lives, crypto is not everything,” he said. ","You can watch the full interview here: ","","____","Learn more: \n– Crypto Winter Will Last ‘At Least Another Year’ Says Founder of Crypto Firm Which Just Laid Off 40% of Its Workforce\n– Prepare for ‘Pretty Long Crypto Winter’\n\n– Erik Voorhees Introduces the ShapeShift DAO\n– ShapeShift DAO Launches a New Mobile App\n\n– Can An Algorithmic Stablecoin Ever Succeed?\n– Erik Voorhees Explains Why He Thinks Toxic Bitcoin Maximalism Is Bullshit"],"entity":[{"type":"2026","content":"DATE"},{"type":"Crypto Winter Will Last","content":"ORGANIZATION"},{"type":"Voorhees","content":"PERSON"},{"type":"‘Pretty Long Crypto Winter","content":"ORGANIZATION"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"40%","content":"PERCENT"}],"hashtag":["Bitcoin","Forecast","Market"],"authors":["Sead Fadilpašić"]}