{"summary":"Just In: FTX’s Bankruptcy Estate Sold 22 Million GBTC Shares, Leading to $1 Billion GBTC Outflow","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/just-in-ftxs-bankruptcy-estate-sold-22-million-gbtc-shares-leading-to-1-billion-gbtc-outflow.htm","publishDate":"2024-01-22T18:07:31","id":19876,"type":null,"title":"Just In: FTX’s Bankruptcy Estate Sold 22 Million GBTC Shares, Leading to $1 Billion GBTC Outflow","category":["Bitcoin News "],"content":["The ongoing bankruptcy proceedings for crypto exchange FTX have led to major sell-offs from one of the largest bitcoin funds. According to a recent CoinDesk report, FTX’s bankruptcy estate sold 22 million shares in the Grayscale Bitcoin Trust (GBTC) fund, amounting to around $1 billion in outflows.","This revelation helps explain the declines seen in GBTC since its conversion to a spot Bitcoin ETF on January 11, as well as the overall crypto market declines since the SEC approved spot Bitcoin ETFs.  While new entrants like BlackRock have seen inflows, GBTC has bled over $2 billion as its discount to net asset value widened. Data indicates much of this stems from FTX exiting its position.","According to a November 2023 filing, The firm held 22.3 million shares worth nearly $600 million since October 2023. This stake surged above $900 million after the long-awaited Bitcoin ETF approval lifted GBTC’s share price.","FTX estate prioritized raising cash by unwinding the crypto exchange’s investments, including its GBTC holdings. As one of the largest shareholders of GBTC, FTX had benefited from the long-standing premium between the trust’s share price and its underlying BTC holdings. This disparity evaporated once GBTC converted to an ETF structure.","Looking at the heatmap Im calling The Big Squeeze.","– @FTX_Official has sold out of $GBTC and $BTC and this will hit the media circuit.\n– @binance is in court and their case may be thrown out by end of day, their Royal Flush is complete and leverage longs entered during the ETF… pic.twitter.com\/WymX4jmIep","— MartyParty (@martypartymusic) January 22, 2024","","With GBTC no longer trading at a premium, FTX’s bankruptcy estate moved quickly to exit its position. The $1 billion sale represented nearly 40% of the total $2.5 billion in GBTC outflows since its conversion.","Private sources confirmed to CoinDesk that FTX’s bankruptcy estate dumped its entire 22.3 million share position. FTX’s $1 billion selloff created major downward pressure just as hopes grew that Bitcoin ETFs would spur a price surge. Instead, Bitcoin’s price has declined with FTX’s ongoing asset liquidations.","With FTX’s holdings exhausted, GBTC may see selling pressure ease. Yet the damage has been done, with heavy outflows and a mass exodus of investors. FTX’s fire sale has already cast doubt on the narrative that Bitcoin ETFs would unlock new inflows and institutional capital.","The bankruptcy also led Alameda Research, FTX’s trading affiliate, to drop its lawsuit alleging excessive fees from GBTC issuer Grayscale. With FTX exiting its stake, Alameda no longer stands to gain from potential fee reductions.","While Bitcoin ETFs were meant to spur adoption, products like GBTC have faltered due to FTX’s exit plan, with the firm’s $1 billion unwinding of its position helping to explain GBTC’s recent mass outflows."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Big Squeeze","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"January 11","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"$GBTC","content":"MONEY"},{"type":"$BTC","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"January 22, 2024","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin ETF","FTX Bankruptcy","GBTC"],"authors":["Trent Alan"]}