{"summary":"Crypto Derivatives Industry ‘Expects’ Severe Regulation, Bitcoin’s Price to Return to USD 65K – Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-derivatives-industry-expects-severe-regulation-bitcoins-price-to-return-to-usd-65k-report.htm","publishDate":"2022-08-25T15:00:00","id":19889,"type":null,"title":"Crypto Derivatives Industry ‘Expects’ Severe Regulation, Bitcoin’s Price to Return to USD 65K – Report","category":["Bitcoin News "],"content":[" ","More than half of global crypto derivatives industry representatives say they expect to see a more severe approach by the world’s regulatory agencies as a result of the recent decreases in the prices of cryptoassets – but a decisive majority of the surveyed experts argue that bitcoin (BTC) will again reach the level above USD 65,000, according to a report by market intelligence provider Acuiti.","The company’s Crypto Derivatives Management Insight report for the third quarter of 2022 comprises an analysis of the impact of the recent crypto price falls, as well as the industry’s views on regulation and the impact it will have on the market’s structure, according to Acuiti. ","The study is based on the views of the Acuiti Crypto Derivatives Expert Network, a global group of senior executives hailing from hedge funds, banks, brokers, prop traders, asset managers, and exchanges. The survey was carried out between June 30 and July 19.","The report indicates that some 59% of the Network anticipates a more severe regulatory approach that will be the principal medium- to long-term effect of this year’s price falls in the crypto market. ","What do you think will be the biggest medium to long-term impacts of the recent falls in crypto prices?","Despite these forecasts, the industry’s belief in bitcoin and the crypto’s potential to return to its top price level seems to be unshaken by this year’s market downturn, according to Acuiti’s report.","“84% of the network believes Bitcoin will rise back above USD 65,000, but opinion ranges on how long it will take to do this,” the company said.","Will BTC go back above USD 65,000? ","Meanwhile, a third of the Network said that BTC will go as low as USD 15,000, said the report, noting that the survey was completed before the recovery in prices in early August."," What do you think will be the lowest point BTC reaches this year? ","At the same time, 50% of the Network said that the market will be moving closer to the world’s traditional finance institutions, and 58% of the surveyed industry representatives said they expect banks will start to play a significant role in permissioned decentralized finance (DeFi). But only 3% said this would happen in pure DeFI, however. ","____","Learn more: \n– Bitcoin Price Rally Failed to Attract Active Users, Exchange Flows Reveals ‘Lackluster’ Demand – Glassnode\n– Crypto Market Regains Ground Ahead of Key US Jackson Hole Meeting\n\n– Canadian Exchanges’ Cap on Annual Purchases Excludes Only Bitcoin, Ethereum, Litecoin and Bitcoin Cash\n– 10 Traditional Companies that are Moving into Crypto Despite Market Downturn\n\n– Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD 30,000 Barrier Soon\n– Bitcoin Could Fall to USD 13.6K This Year, Panel Says After Adjusting Predictions Once Again"],"entity":[{"type":"June 30","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"third quarter of 2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Crypto Derivatives Management Insight","content":"ORGANIZATION"},{"type":"Network","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Crypto Market Regains Ground Ahead of Key US Jackson Hole Meeting","content":"ORGANIZATION"},{"type":"84%","content":"PERCENT"},{"type":"58%","content":"PERCENT"},{"type":"59%","content":"PERCENT"},{"type":"Litecoin","content":"PERSON"},{"type":"Acuiti Crypto Derivatives Expert Network","content":"ORGANIZATION"},{"type":"July 19","content":"DATE"},{"type":"Bitcoin Price Rally Failed to Attract Active Users","content":"ORGANIZATION"},{"type":"Crypto Despite Market Downturn\n\n– Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Panel Says After Adjusting Predictions Once Again","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","DeFi","Forecast","Market","Regulation"],"authors":["Jaroslaw Adamowski"]}