{"summary":"Cardano Price Forecast – Can ADA Make a New All-Time High This Year?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-forecast-can-ada-make-a-new-all-time-high-this-year.htm","publishDate":"2022-10-15T12:37:00","id":19886,"type":null,"title":"Cardano Price Forecast – Can ADA Make a New All-Time High This Year?","category":["Altcoin News "],"content":["Cardano price continues to wallow in the murky waters of the crypto winter about a year after posting an impressive show to its all-time of $3.09. If the current retracement at $0.36 carries on, ADA could broadcast a 90% correction from its historical high.","However, robust support between $0.30 and $0.35 will likely come in handy and avert a potential seller-only field day. While such a move would be a major setback, it is doubtful that it will happen, especially with ADA having grown to a noticeable cryptocurrency ecosystem compared to August last year when it tagged $3.09.","On the bright side, Cardano is closer to its floor price now than ever since the rains started beating the crypto market in November 2021. Furthermore, the extremely oversold conditions the smart contracts token deals with negates the idea of a continued retracement.","That said, Cardano price prediction might not be as outlandish as everyone would hope, yet it could certainly make a new all-time high this year.","The IOHK (Input Output Hongkong), the organization that is tasked with building and maintaining the Cardano blockchain, has been busy working on what could be termed revolutionary DeFi (decentralized finance) tech solutions.","Cardano recently achieved another milestone with the release of the Vasil upgrade. According to Charles Hoskinson, founder of the network, this software upgrade focuses on scaling the blockchain.","The Vasil Upgrade saw the Cardano protocol reach a larger network capacity – supported by lower transaction fees and higher throughput. Furthermore, Cardano is grinding toward another upgrade dubbed Voltaire – which will introduce governance standards.","Cardano’s focus on decentralization sets it up for the front-row role in blockchain security and scalability. Over the last year, Cardano technically rebranded from a sleeping to a tech star. In addition to bringing staking to Cardano in the third quarter of 2021, the protocol’s adoption has been aggressively expanding globally among governments and organizations.","Cardano price prediction to a new all-time could be rather reserved, considering it rallied 2,300% from $0.12 in July 2020 to $3.09 in August 2021. Such a run-up from the current price will place ADA price slightly above $8.00.","It is worth mentioning that in the short term, Cardano price could face restricted movement owing to the current bear market conditions. However, in the next bull run, ADA may have the potential to climb to $15.00.","According to Dan Gambardella, an analyst and a Cardano bull, the worst of the bear market is nearly gone, and the only way will soon be to the upside. Nevertheless, Gambardello admits that investors are scared – and are abandoning projects, especially Cardano, oblivious of how close the finish line is.","(1) Dan Gambardello on Twitter: “$ADA holders, I think the last year leading to this current moment was the toughest part. Now we prepare for the last leg of the bear market. It will be volatile &amp; crazy, but the clouds will eventually clear and #Cardano will thrive in the next bull cycle. Stay strong &amp; plan.” \/ Twitter","The TD Sequential indicator buy signal on the 3-day chart reveals through a red nine candle that Cardano price could be at the tail end of this downtrend. In other words, there is a tendency for selling pressure to ease, allowing buyers to push the price higher.","Traders must, however, ensure the low of the sixth and the seventh candles closed beneath the eighth and ninth bars in the count. Moreover, one bullish candle on the four-hour or daily chart should close before making good on the long positions."," ","ADA\/USD 3-day chart","Cardano price is treading in oversold conditions based on the position of the Stochastic oscillator. The OBV (On Balance Volume) will start climbing as the oscillator lifts above 20.00. A bullish divergence from the Stochastic will be necessary to ascertain the validity of the uptrend.","While Cardano is a must-have on any crypto portfolio, creating room for green crypto like IMPT sets it from the rest.","IMPT is the new kid on the block for building an ESG crypto portfolio. The platform, currently in its presale stage, aims at introducing carbon offsetting to the blockchain.","Visit IMPT To Learn More"," "],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$8.00","content":"MONEY"},{"type":"third quarter of 2021","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"2,300%","content":"PERCENT"},{"type":"Vasil Upgrade","content":"ORGANIZATION"},{"type":"$0.12","content":"MONEY"},{"type":"Dan Gambardello","content":"PERSON"},{"type":"$0.35","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"$0.36","content":"MONEY"},{"type":"$0.30","content":"MONEY"},{"type":"$15.00","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"$3.09","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"Cardano","content":"PERSON"},{"type":"Dan Gambardella","content":"PERSON"},{"type":"Cardano blockchain","content":"PERSON"},{"type":"August last year","content":"DATE"},{"type":"winter","content":"DATE"},{"type":"Vasil","content":"PERSON"},{"type":"Gambardello","content":"PERSON"},{"type":"July 2020","content":"DATE"},{"type":"ESG","content":"LOCATION"},{"type":"ADA","content":"ORGANIZATION"}],"hashtag":["ADA","Cardano","IMPT"],"authors":["John Isige"]}