{"summary":"New York lawmakers will discuss a bill proposing a moratorium on crypto mining during a committee meeting on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138789\/new-york-legislators-weigh-moratorium-on-crypto-mining-while-some-look-to-an-executive-order-from-the-governor","publishDate":"2022-03-22T10:59:28","id":1988,"type":null,"title":"New York legislators weigh moratorium on crypto mining, while some look to an executive order from the governor","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">New York state lawmakers will discuss a bill proposing a two-year moratorium on proof-of-work crypto mining on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">The New York State Assembly's Environmental Conservation Committee is holding a meeting on the amended version of the <a href=\"https:\/\/www.nysenate.gov\/legislation\/bills\/2021\/A7389\" data-v-f87c67ca=\"\">bill<\/a>, which was first <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/103703\/ny-bill-ban-crypto-mining-environmental-impact\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced in May of last year<\/span><\/a><span data-v-f87c67ca=\"\"> and has faced an uphill battle through the Assembly and Senate.<\/span>","<span data-v-f87c67ca=\"\">Environmental groups have pushed for the state to intervene as miners flocked to New York last year, in some instances taking over power plants. A study recently <\/span><a href=\"https:\/\/scholarship.law.columbia.edu\/sabin_climate_change\/187\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> by Columbia Law School’s Sabin Center for Climate Change Law concluded that, in theory, the New York governor has the authority to put in place a moratorium via executive order.<\/span>","<span data-v-f87c67ca=\"\">In practice, this would mean preventing new permits from being issued to certain mining operations until the New York Department of Environmental Conservation (DEC) can study their impact with a Generic Environmental Impact Statement (GEIS).<\/span>","<span data-v-f87c67ca=\"\">The current bill addresses mining facilities that get their energy delivered behind the meter, meaning that it is used on-site without passing through a meter.<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/57943\/a-power-plant-in-new-york-is-reportedly-mining-roughly-50000-in-bitcoin-each-day\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Greenidge Generation's<\/span><\/a><span data-v-f87c67ca=\"\"> 107-megawatt plant, in particular, has drawn much attention for its use of natural gas at a former coal plant in the Finger Lakes region. The mining firm is currently waiting for a decision on its air permit renewal application.<\/span>","<span data-v-f87c67ca=\"\">The DEC <\/span><a href=\"https:\/\/www.dec.ny.gov\/permits\/123728.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">received over 4,000 public comments<\/span><\/a><span data-v-f87c67ca=\"\"> on the matter and is expected to put out a decision by March 31. Officials have hinted that the mining facility falls short of the environmental requirements of New York’s Climate Leadership and Community Protection Act (CLCPA), which was passed in 2019, after Greenidge set up shop.<\/span>","<span data-v-f87c67ca=\"\">The act calls for the state to reduce greenhouse gas emissions by 85% below 1990 levels by 2050 and to achieve 100% zero-emission electricity by 2040.<\/span>","<span data-v-f87c67ca=\"\">“DEC has not made a final determination on the permits and Greenidge has not shown compliance with NY’s climate law,” DEC commissioner Basil Seggos <\/span><a href=\"https:\/\/twitter.com\/BasilSeggos\/status\/1435724739352449025\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said on Twitter<\/span><\/a><span data-v-f87c67ca=\"\"> in September.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As per the Columbia Study, a GEIS study would be reason enough to put new permits on hold, but it is less clear whether a ban on permit renewals would hold up. The study also argues that the DEC would have the authority to treat Greenidge Generation’s application as if it were an application for a new permit based on the fact that the CLCPA has since come into law and that Greenidge’s facilities have changed from power generation to proof-of-work mining.<\/span>","<span data-v-f87c67ca=\"\">The company <\/span><a href=\"https:\/\/www.governor.ny.gov\/sites\/default\/files\/atoms\/files\/REDCAwardsBooklet2015_2.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">got a $2 million grant<\/span><\/a><span data-v-f87c67ca=\"\"> from the state in 2015 to renovate the plant in Dresden. The plan for proof-of-work mining was not stated in the original permits, according to the study.<\/span>","<span data-v-f87c67ca=\"\">“The state of New York should have sued them because they misrepresented in their <\/span><span data-v-f87c67ca=\"\">business plan why they wanted the pipeline,” said Cornell professor Anthony Ingraffea, who testified during a State Assembly public hearing last year on mining and climate change.<\/span>","<span data-v-f87c67ca=\"\">Asked whether Gov. Kathy Hochul is considering a moratorium on crypto mining, a spokesperson responded with the following statement:<\/span>","<span data-v-f87c67ca=\"\">“Governor Hochul is taking bold, nation-leading actions to confront climate change head-on, and the State is actively reviewing proposals regarding the role of cryptocurrency mining in New York's energy landscape, especially in light of the Climate Leadership and Community Protection Act.”<\/span>","<span data-v-f87c67ca=\"\">The Columbia study points out that the bills that have been proposed by the New York state legislature “have stalled.”<\/span>","<span data-v-f87c67ca=\"\">After an earlier version of the bill <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/108243\/unions-shoot-down-new-yorks-crypto-mining-moratorium-for-now-at-least\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">died in the Assembly<\/span><\/a><span data-v-f87c67ca=\"\"> in June of last year, a staffer for Assemblywoman Anna Kelles, who sponsored the bill, told The Block that \"the roadblock was the unions.\"<\/span>","<span data-v-f87c67ca=\"\">One of them, the International Brotherhood of Electrical Workers, said in a statement that “the bill fails to take into account the valid benefits of the technology behind the industry.\"<\/span>","<span data-v-f87c67ca=\"\">The most recent draft calls for a moratorium on new permits for facilities that use carbon-based fuel to power proof-of-work mining operations with behind-the-meter energy. It also does not allow for permit renewals in instances where there is an increase in the amount of energy consumed. It effectively freezes operations at current levels for two years, other than those using renewable sources of energy.<\/span>","<span data-v-f87c67ca=\"\">According to legislators, proof-of-work mining “will greatly increase the amount of energy usage in the state of New York, and impact compliance with the Climate Leadership and Community Protection Act.” <\/span>","<span data-v-f87c67ca=\"\">The public hearing on the moratorium bill will start at 12 pm on Tuesday and will be broadcast <\/span><a href=\"https:\/\/nyassembly.gov\/av\/live\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"State","content":"ORGANIZATION"},{"type":"Greenidge Generation","content":"ORGANIZATION"},{"type":"Anthony Ingraffea","content":"PERSON"},{"type":"Assembly and Senate","content":"ORGANIZATION"},{"type":"DEC","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"New York Department of Environmental Conservation (DEC","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2050","content":"DATE"},{"type":"Climate Leadership and Community","content":"ORGANIZATION"},{"type":"New York State Assembly","content":"ORGANIZATION"},{"type":"Environmental Conservation Committee","content":"ORGANIZATION"},{"type":"Kathy Hochul","content":"PERSON"},{"type":"Greenidge","content":"PERSON"},{"type":"Columbia Study","content":"ORGANIZATION"},{"type":"1990","content":"DATE"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Columbia Law School’s Sabin Center for Climate Change Law","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Generic Environmental Impact Statement (GEIS","content":"ORGANIZATION"},{"type":"Basil Seggos","content":"PERSON"},{"type":"Dresden","content":"LOCATION"},{"type":"Hochul","content":"PERSON"},{"type":"State Assembly","content":"ORGANIZATION"},{"type":"Anna Kelles","content":"PERSON"},{"type":"85%","content":"PERCENT"},{"type":"March 31","content":"DATE"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"May of last year","content":"DATE"},{"type":"Columbia","content":"ORGANIZATION"},{"type":"2040","content":"DATE"},{"type":"International Brotherhood of Electrical Workers","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}