{"summary":"Bitcoin Trading at Discount on Binance Australia Due to Upcoming Payment Cutoff – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-trading-at-discount-binance-australia-due-upcoming-payment-cutoff-heres-what-you-need-know.htm","publishDate":"2023-05-31T13:27:00","id":19882,"type":null,"title":"Bitcoin Trading at Discount on Binance Australia Due to Upcoming Payment Cutoff – Here’s What You Need to Know","category":["Bitcoin News "],"content":["As Binance Australia is facing a cut off from a key local on-ramp service, traders have been trading Bitcoin (BTC) and other cryptocurrencies at a discount on the platform. ","As of 1:10 p.m. on May 30 in Singapore, Bitcoin traded at about A$34,863 ($22,589) on Binance Australia. This was about A$7,516 lower than the average price on platforms such as Independent Reserve and CoinJar, according to CryptoCompare data. Discounts of some 20% were also visible for coins such as Ether and Solana, Bloomberg reported. ","“Bitcoin\/AUD is trading at a material discount to Bitcoin\/USD as Australian clients are willing to sell Bitcoin at a discount so they can withdraw the AUD before the deadline,” commented Richard Galvin, the co-founder at fund manager Digital Asset Capital Management. ","Starting at 5 p.m. AEST on June 1, Binance Australia’s users will no longer be able to withdraw Australian dollars to their bank accounts with the use of the country’s popular PayID service. Earlier this month, the platform was deprived of access to some AUD deposit services. ","A spokesperson for Binance Australia said that AUD balances can be converted into the Tether stablecoin with the aim to “facilitate withdrawals and trading activities” after June 1.","“While AUD deposits by bank transfers are no longer available to Binance users in Australia, there are still a number of ways Aussie users can deposit onto the exchange,” the platform said in a statement. “We are working hard to find an alternative provider to continue offering AUD deposits and withdrawals to our users.“","Meanwhile, over the past days, Binance Australia has been gradually cut off from a number of financial services providers. ","On May 18, the platform said it could no longer offer Australian dollar deposit services as a result of a decision taken by payments solutions provider Cuscal.","Cuscal commented on the same day that the company’s primary goal is “protecting Australians from financial crimes and scams”. ","Westpac Banking Corp., which is one of Australia’s largest financial institutions, stated on May 18 it had begun testing new customer protections for some cryptocurrency payments in a bid to reduce “scam losses.”","On Twitter, numerous customers have also mentioned they would like the platform to enable transactions made with the use of PayID, a service accepted by more than 100 banks, credit unions, building societies and other organizations in the Australian market. ","“We regret to inform you that with immediate effect we are unable to facilitate PayID AUD deposits for Binance users due to a decision made by our third party payment service provider. We understand from our third party payment service provider that Bank Transfer withdrawals will also be impacted and we will advise users on timeline when this is confirmed,” Binance Australia replied to its users’ requests in a tweet."],"entity":[{"type":"June 1","content":"DATE"},{"type":"$22,589","content":"MONEY"},{"type":"Independent Reserve","content":"ORGANIZATION"},{"type":"Richard Galvin","content":"PERSON"},{"type":"May 18","content":"DATE"},{"type":"Westpac Banking Corp.","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Binance Australia","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Bitcoin\/USD","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Australian dollars","content":"MONEY"},{"type":"Digital Asset Capital Management","content":"ORGANIZATION"},{"type":"Binance Australia","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"5 p.m.","content":"TIME"},{"type":"1:10 p.m.","content":"TIME"},{"type":"May 30","content":"DATE"},{"type":"Bank Transfer","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Australia","Binance","Bitcoin"],"authors":["Jaroslaw Adamowski"]}