{"summary":"Top Russian MPs Dismiss Central Bank’s Calls for a Crypto Ban","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russian-mps-dismiss-central-banks-calls-for-crypto-ban.htm","publishDate":"2022-01-25T12:14:00","id":19880,"type":null,"title":"Top Russian MPs Dismiss Central Bank’s Calls for a Crypto Ban","category":["Bitcoin News "],"content":[" ","The Russian political talk shop is open – or at least it is for crypto, with many leading lawmakers hitting back at the Central Bank’s calls last week for a blanket ban on cryptoassets and token mining.","As reported yesterday, the Central Bank has won some small amount of conditional support for some of its proposals – none of which are particularly new, as the body and its Governor, the arch crypto-skeptic Elvira Nabiullina, have been calling upon Moscow to issue a ban for several years.","But crypto, mining, and tokenization have many allies in the corridors of power in Moscow, and international media coverage of the bank’s ban intentions have drawn flak.","The news agency Tass quoted Anton Gorelkin, the Deputy Chairman of the parliament’s Committee on Information Policy, Information Technology and Communications, as describing the bank’s call for a ban as “sensational,” but conceded that it could be a launching point for “a broad discussion” on crypto regulation. He explained:","“I don’t think that the ban on cryptocurrencies […] is the right decision. Yes, many of the arguments given by the regulator are reasonable and correct from the point of view of economic security. But I share the position of experts […] who see a future in blockchain technologies and believe that a ban on cryptocurrencies would negatively affect the IT development of Russia.”","Anatoly Aksakov, the head of the parliamentary committee that deals with financial markets and the chief broker of crypto legislation, also played down talk of an outright ban, stating:","“Various options are being discussed and will continue to be discussed. It is too early to say that the committee has come to an unequivocal position on this issue.”","He said that his committee would look at the Central Bank’s proposal, but “will also consider other proposals.”","“So far,” Aksakov said, “points of view differ quite dramatically,” adding:","“The committee is an arbiter in this discussion and it is important for us to hear all sides. Based on these discussions, we will make a decision.”","Lenta reported that Andrey Lugovoy, the First Deputy Chairman of the Committee on Security and Anti-Corruption, has also spoken out against the proposed ban.","And the same media outlet noted that MPs had asserted that “the Central Bank is alone in calling for total bans” within the working group charged with creating a law to regulate crypto and mining this year.","The outlet noted that “not a single government body supports the position taken up by the Central Bank so far.”","Indeed, MPs were quoted as expressing the fear that talk of such “repressive” measures “may make Russia a laughing stock for the whole world.”","PlusWorld quoted Lugavoy as stating:","“If you make statements asking to ‘categorically prohibit everything,’ then you need to justify them as much as possible, with specific, clear and understandable numbers and with an explanation of what we should do about people who currently hold cryptocurrency. No one knows why the Central Bank has taken up such a radical position.”","He added that talk of “high volatility” and “pyramid schemes” would not do as it is possible to “give examples of many things that are part of our lives, but are also risky for citizens.”","Meanwhile, Aksakov also added that a crypto bill may hit the State Duma (Russia’s parliament) in time for its spring session, but added that “no bills on this matter” have come before committees as of yet. Regardless, he called on the government to hurry. Tass quoted him as stating:","“During the spring session, it is important for us to adopt some kind of legal document that determines the shape of regulation in the market. It is developing too fast, there are too many investors. And it is important to draw a line under many issues, especially because mining is creating problems for consumers’ electricity, for local authorities. And in order to regulate this issue at least, we must make the appropriate legal decision.”","____","Learn more:\n– Ban Crypto, but Legalize Mining and Issue Gold-backed Stablecoin, Urges Top Russian MP\n– Russia: Total Ban on Crypto Ownership Still on Table, Says Top Official\n\n– Crypto Anonymity Must End, States Top Russian Policymaker\n– Russian Intelligence Service Wants More Power to Seize Crypto, Freeze Wallets\n\n– Time to ‘Resolve All Crypto Issues’ Says Russian Parliament\n– Russian Provinces Free to Make Crypto Miners Pay Higher Electricity Rates, Says Gov’t"],"entity":[{"type":"Crypto Ownership Still on Table","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Tass","content":"ORGANIZATION"},{"type":"Elvira Nabiullina","content":"PERSON"},{"type":"Andrey Lugovoy","content":"PERSON"},{"type":"’s Committee on Information Policy, Information Technology and Communications","content":"ORGANIZATION"},{"type":"State Duma","content":"ORGANIZATION"},{"type":"Anton Gorelkin","content":"PERSON"},{"type":"Russian Intelligence Service Wants More Power to Seize Crypto, Freeze Wallets\n\n– Time to ‘Resolve All Crypto Issues’ Says Russian Parliament\n– Russian Provinces Free to Make Crypto Miners Pay Higher Electricity Rates","content":"ORGANIZATION"},{"type":"Central Bank’s","content":"ORGANIZATION"},{"type":"Aksakov","content":"PERSON"},{"type":"Anatoly Aksakov","content":"PERSON"},{"type":"Committee on Security","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"spring","content":"DATE"}],"hashtag":["Bitcoin","Cryptocurrency","Mining","Politics","Regulation","Russia"],"authors":["Tim Alper"]}