{"summary":"Sam Altman’s Crypto Project Worldcoin Needs More Orbs for Sign-Ups","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sam-altman-crypto-project-worldcoin-needs-more-orbs-sign-ups.htm","publishDate":"2024-04-25T07:09:50","id":19891,"type":null,"title":"Sam Altman’s Crypto Project Worldcoin Needs More Orbs for Sign-Ups","category":["News "],"content":["Sam Altman’s Worldcoin project is reportedly running low on orbs, the devices used for iris scans in return for tokens.","These orbs are biometric imaging devices that securely verify a person’s identity using iris scans. They are intended to prevent multiple accounts or identities within the Worldcoin system.","Alex Blania, CEO of Tools for Humanity, the developer behind Worldcoin, told Semafor that the startup is expanding silver orb production to meet soaring demand. Currently, between 300 and 500 orbs are available, according to the report published Wednesday.","The issue highlights Worldcoin’s swift uptake. It was introduced less than a year ago in July. And its primary aim is to enroll every individual globally into its financial system. The World App, which enables access to Worldcoins, currently has 10m users across 160 countries. Also, Worldcoin is said to process over seven transactions per second, ranking it among the top crypto wallets worldwide.","Semafor reported that the orbs are made in an unidentified German factory. They orbs might have an unassuming appearance. But they feature advanced sensors to prevent counterfeit “World IDs.” This is to guarantee that each digital identity issued is linked to a genuine individual.","Initially, Blania expected the orbs to travel globally for iris scans. But people flocked to them instead. They queue up to have their eyes scanned in exchange for an initial payment of 10 Worldcoins, followed by three more every two weeks.","The large crowds surrounding each orb pose logistical challenges. This requires beefing up the security team and having experienced managers for crowd control. Blania reportedly didn’t expect the need to establish strong teams in various markets early on, as he anticipated having more time.","Worldcoin sign-ups are restricted in certain countries due to regulatory and privacy concerns. US individuals cannot use, purchase, or access the coins. Meanwhile, Worldcoin has temporarily halted orb-verification services in India, Brazil, and France.","Last week, Worldcoin unveiled a new blockchain on the Ethereum protocol “to bring all humans unchain.” World Chain’s developer preview is expected to be released shortly, followed by the full launch later this year.","Worldcoin’s user transactions account for about 44% of the activity on Optimism, an Ethereum Layer-2 scaling solution, according to the team. This establishes the project as the largest application on the network.","“Given the scale and growth rate of the community, it’s time to graduate to a dedicated network,” the team said."],"entity":[{"type":"Alex Blania","content":"PERSON"},{"type":"Blania","content":"PERSON"},{"type":"France","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"44%","content":"PERCENT"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["Sam Altman","Worldcoin","Worldcoin Orb"],"authors":["Shalini Nagarajan"]}