{"summary":"Harbor is linking up with BitGo, the cryptocurrency custodian, to beef up its tokenization platform, the firm announced Wednesday.  Backed by Andreessen","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2533\/harbor-is-teaming-up-with-bitgo-to-unleash-the-tokenization-revolution","publishDate":"2018-10-31T14:07:50","id":1990,"type":null,"title":"Harbor is teaming up with BitGo to unleash the tokenization revolution","category":["INVESTMENTS"],"content":["Harbor is linking up with BitGo, the cryptocurrency custodian, to beef up its tokenization platform, the firm announced Wednesday.&nbsp;","Backed by Andreessen Horowitz and Pantera Capital among others, Harbor offers a platform for firms and other entities to issue tokenized securities as a way to raise capital. Those tokens (similarly to bitcoin, built on blockchain technology) can represent ownership in assets spanning real estate to private equity to art. As part of the partnership, BitGo, which provides storage solutions to hedge funds and other investors trading in crypto, will store crypto raised by companies via a token offering on Harbor's platform.&nbsp;","BitGo recently got approval from the South Dakota Division of Banking to operate as a qualified custodian, which is a designation many investors require in a custody bank. Coinbase and Gemini also boast the designation.&nbsp;","\"Most of the people that are coming to raise capital on Harbor are institutional-grade folks,\" Harbor CEO Josh Stein said. \"In the same way you want to keep your money in a bank account and not shoved under your mattress, institutions want to make sure their funds are secured.\"","Elsewhere, other security token platforms are trying to fit everything into one business, covering custody, issuance, and trading, according to Stein. He said outsourcing the custody aspect to an \"industry expert\" will allow the firm to focus on the core product.","[related id=1]As noted in recent research by&nbsp;<em data-v-f87c67ca=\"\">The Block,&nbsp;<\/em>security tokens can help remedy a number of issues facing U.S. stocks.&nbsp;Instead of a single institution controlling shares and settling transactions, security tokens are built on blockchains operated by&nbsp;<em class=\"markup--em markup--li-em\" data-v-f87c67ca=\"\">distributed<\/em>&nbsp;miners and nodes (servers). If a miner or node ceases operating, the blockchain will continue to run as usual. The lack of centralization makes the settlement and transfer of securities more reliable -- thus removing certain risks.","Still, not everyone is convinced that blockchain will make a big difference across capital markets. Chris Concannon, the president of Cboe Global Markets, said recently at an industry conference he didn’t see blockchain “impacting the most liquid assets that we trade.”","Still, Harbor is targeting the private markets, where assets don't see the same level of liquidity that big-name stocks like Apple do.","“Tokenization of private securities can bring liquidity to trillions of dollars of traditionally illiquid assets,\" Stein said.","\"It will not have the same liquidity as public markets, but bringing some levels of liquidity can unlock tremendous value for both asset owners and their investors.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"South Dakota Division of Banking","content":"ORGANIZATION"},{"type":"Stein","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Chris Concannon","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Josh Stein","content":"PERSON"}],"hashtag":["TOKENS"],"authors":["Frank Chaparro","The Block"]}