{"summary":"Injective Protocol’s inEVM Nears Completion, Bridging Ethereum and Low-Fee Derivatives Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/injective-protocols-inevm-nears-completion.htm","publishDate":"2024-03-07T04:26:54","id":19901,"type":null,"title":"Injective Protocol’s inEVM Nears Completion, Bridging Ethereum and Low-Fee Derivatives Trading","category":["DeFi News "],"content":["The Injective Protocol, a decentralized exchange (DEX) platform focused on derivatives, has notified the broader community that the development of its Injective Ethereum Virtual Machine, known as inEVM, is now 98% complete.","Injective inEVM loading ⏳","A groundbreaking Ethereum rollup for hyperscaling multi VM development is nearly here.","▓▓▓▓▓▓▓▓▓▓▓▓▓▓░░ 98%","— Injective 🥷 (@injective) March 4, 2024","","In a post on X, the derivatives trading platform describes inEVM as a “groundbreaking Ethereum rollup designed to facilitate hyperscaling multi-VM development.” ","Despite Ethereum’s scaling challenges and relatively high trading fees, it is a popular choice among developers, especially in bull markets. ","The inEVM will bridge the gap, linking the low-fee and highly scalable Injective Protocol to Ethereum, empowering traders to swap at a fraction of the cost. From the platform’s main page, the average transaction cost is less than $0.01.","Moreover, connecting with Ethereum will allow developers to deploy their solutions on Injective Protocol. The inEVM merges the high performance in Injective with the depth of developer tools present in Ethereum.","By enabling multiple virtual machines, inEVM can process transactions faster and handle more users. This enhancement is key because Injective Protocol aims to take on centralized exchanges like Bybit and Binance. The decentralized platform supports, among other features, margin trading and perpetual swaps.","With the launch of inEVM, the number of Injective Protocol users is expected to surge, translating to more transactions. As of early March 2024, Injective reported processing approximately half a billion on-chain transactions.","Nearing half a billion on-chain transactions ⏳ https:\/\/t.co\/ObrfGbMVuP","— Injective 🥷 (@injective) March 3, 2024","","Over the past few months, INJ, the native currency of the protocol, has been one of the top performers. Tracking the performance of Solana (SOL) and some of its meme coins, INJ rose from around $8 to peak at $45 in late December.","The price boom propelled the coin to the top 50 by market cap. Currently, INJ is changing hands at around $40, up 10% in the last 24 hours, as per Coingecko data. "],"entity":[{"type":"$40","content":"MONEY"},{"type":"March 4, 2024","content":"DATE"},{"type":"$45","content":"MONEY"},{"type":"98%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"March 3, 2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$0.01","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"March 2024","content":"DATE"},{"type":"$8","content":"MONEY"},{"type":"Injective Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Solana (SOL","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DeFi","Ethereum","Injective Protocol"],"authors":["Dalmas Ngetich"]}