{"summary":"Terra Luna Classic Crypto Price Prediction 2022 – Will LUNC Reach $0.0005?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crypto-price-prediction-2022-will-lunc-reach-5.htm","publishDate":"2022-09-05T21:21:00","id":19906,"type":null,"title":"Terra Luna Classic Crypto Price Prediction 2022 – Will LUNC Reach $0.0005?","category":["Altcoin News "],"content":["Terra Luna Classic (LUNC) has once again gone parabolic today as we see a 42.39% increase in price over the last 24 hours. ","September could be a huge month for the Terra Luna Classic (LUNC) community as it is rumored that major exchanges such as Binance and Kucoin may support the token swap burn which is due to go live on the 12th of September. This is a burning mechanism that effectively removes 1.2% in supply of total transaction volume.  ","Will Terra Luna Classic continue to surge? ","Terra Luna Classic is back in the spotlight today as investors anticipate further positive price momentum through the remainder of September.","From a technical analysis perspective Terra Luna Classic (LUNC) crypto looks extremely bullish and has blasted through critical resistance levels over the last few days. ","LUNC must respect the $0.000305 support level in order to prevent continuation to the downside.","At the time of writing this article Terra Luna Classic (LUNC) crypto is residing within a classic bull pennant where we could speculate another breakout to the upside.","By measuring the flagpole of this bullish pattern, we can speculate the technical price target would bring us up to roughly $0.000401. ","It is quite clear the bulls are in control at the moment with Terra Luna Classic. Should LUNC be able to retest the $0.000354 resistance trendline we may see another breakout to the upside which could yield a total of 12.74%. ","This would need to be supported with a large amount of volume and a retest as support in order to validate the move to ensure that it is not a fake out. ","Whilst it may be tempting to chase the green candles it is worth noting that Terra Luna Classic (LUNC) is currently overbought on the relative strength index.","We can also see the formation of a bearish divergence which could mean that we might be due a short term pull back and require some healthy consolidation following these overbought euphoric levels.","In addition to this, we can see that Terra Luna Classic is also sitting above the top trendline of the bollinger band (top pink trend line) which indicates we could also see a bearish reversal play out rather soon. ","The 20-day moving average is now overextended and it would also be good to see a pull back and a retest of this level to see if we can hold key support levels of around $0.0003. "," "," ","It is almost as if Terra Luna Classic is completely independant right now and not correlated with Bitcoin and the rest of the crypto markets or sentiment surrounding it. ","Should Terra Luna Classic be able to maintain positive price action I speculate that we could possibly reach $0.0005 in the next few weeks. ","Whilst Terra Luna Classic has demonstrated fantastic performance recently, it has already done a 750% increase in price since June 2022. This means the upside potential is becoming limited as returns begin to diminish as the market capital climbs higher and higher. ","If you are looking for other potential lucrative cryptocurrencies that are developed with longevity in mind and have high long-term growth potential then Tamadoge could be the next one. ","Tamadoge is a unique and thrilling play-to-earn meme coin which is deployed on the Ethereum mainnet. ","What makes Tamadoge such a strong choice is that it is a deflationary meme coin with a maximum supply of just 2 billion coins. ","Not only is it a utility based meme coin with integrations of augmented reality and opportunities to mint your very own Doge NFTs, players can also take advantage of 0% transaction fees. ","Tamadoge has currently been in presale for the last 5 weeks and has already raised a tremendous $11,648,050. Only 30% of presale coins are remaining and it is forecasted that the presale could finish in October 2022.","Security is also in the forefront of the developers minds as Tamadoge is fully audited by Solid Proof and is verified by Coinsniper. This ensures that Tamadoge is 100% secure and is also rug pull proof. ","Investors who wish to participate in the Tamadoge presale can head over to buy.tamadoge.io and purchase TAMA using Ethereum or USDT by connecting their MetaMask or TrustWallets to the official site.","If you wish to learn more about the Tamadoge white paper and roadmap click here. "],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"last 24 hours","content":"DATE"},{"type":"$0.0005","content":"MONEY"},{"type":"Tamadoge","content":"ORGANIZATION"},{"type":"12.74%","content":"PERCENT"},{"type":"$0.0003","content":"MONEY"},{"type":"750%","content":"PERCENT"},{"type":"$11,648,050","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"2 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"October 2022","content":"DATE"},{"type":"Kucoin","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Tamadoge","content":"LOCATION"},{"type":"$0.000354","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"June 2022","content":"DATE"},{"type":"12th of September","content":"DATE"},{"type":"Terra Luna Classic (LUNC","content":"ORGANIZATION"},{"type":"$0.000401","content":"MONEY"},{"type":"$0.000305","content":"MONEY"},{"type":"42.39%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Luna","LUNC","Terra"],"authors":["Jacob Bury"]}