{"summary":"Bitcoin Mining Pool Ocean Successfully Mines Third Block in Ongoing Decentralization Quest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/decentralized-bitcoin-mining-pool-ocean-successfully-mines-third-block-in-ongoing-quest.htm","publishDate":"2023-12-27T17:25:52","id":19908,"type":null,"title":"Bitcoin Mining Pool Ocean Successfully Mines Third Block in Ongoing Decentralization Quest","category":["Bitcoin News "],"content":["The decentralized Bitcoin mining pool Ocean reached a new milestone this week by successfully mining its third block ever. According to data from Mempool.Space, Ocean mined block number 823,129 on Wednesday morning, earning a total block reward of 7.412 bitcoins. This achievement demonstrates the capabilities of Ocean’s decentralized system, which was launched in November 2022 to promote decentralization in Bitcoin mining.","Mononaut, a key figure at BitfeedLive, an open-source Bitcoin mempool visualizer, brought attention to Ocean’s distinctive mining approach after the milestone.","“The block was constructed using their standard “filtered” template, only containing 1 inscription and 54 op_returns (mostly Runes),” the analyst tweeted. “The filtering cost them ~0.144 BTC in fees, which is an 11.03% reduction in fees or about a 2% reduction in total block reward.”","Ocean found their third block! 🥳https:\/\/t.co\/FKMLeDWy94","— mononaut (tx\/acc) (@mononautical) December 27, 2023","","Ocean’s current hash rate stands at 525 ph\/s, making it a small but not insignificant player in the competitive Bitcoin mining sector.","The launch of Ocean mining was announced on November 28 by Bitcoin Core developer Luke Dashjr. The initiative, supported by a $6.2M round led by notable figure Block Head Jack Dorsey, seeks to challenge the current norms of Bitcoin mining pools and promote a more decentralized approach.","Dashjr, in a statement on October 31, emphasized the necessity of such an initiative. He expressed concerns over the centralization and overreach of other pool operators, which, according to him, has altered Bitcoin to the extent that its security model is at high risk. Dashjr pointed out the custodial nature of current mining pools and their control over who can use Bitcoin, suggesting a need for change.","","Ocean’s latest achievement in mining block number 823,129 is more than just a numerical success. It’s a clear indication of the potential and effectiveness of decentralized mining pools in the Bitcoin ecosystem. As the industry continues to evolve, Ocean’s role and impact will be closely watched, particularly in the context of decentralizing mining and maintaining the integrity of the blockchain network."],"entity":[{"type":"$6.2","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"October 31","content":"DATE"},{"type":"December 27, 2023","content":"DATE"},{"type":"November 28","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Ocean","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Wednesday","content":"DATE"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"11.03%","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Mining","mining censorship","Ocean mining"],"authors":["Trent Alan"]}