{"summary":"Brazilian Financial Regulator Co-launches Crypto Glossary","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazilian-financial-regulator-co-launches-crypto-glossary.htm","publishDate":"2023-12-07T00:30:03","id":19905,"type":null,"title":"Brazilian Financial Regulator Co-launches Crypto Glossary","category":["Blockchain News "],"content":["The CVM, Brazil’s markets regulator, has co-launched a glossary of crypto-related terms in a bid to “standardize” terminology in the Latin American nation.","The glossary was co-compiled and published by the Brazilian Cryptoeconomics Association (ABCripto), a crypto industry group.","Per the Portuguese-language media outlet Criptofacil, the CVM’s Education and Financial Inclusion Director Paulo Portinho said the glossary would help people “understand technical terms related to new financial technologies.” Portinho said:","“The glossary is in line with the work that the CVM has been doing to […] make [crypto-related] language clearer and simpler. We are focusing on facilitating knowledge and rapprochement with individual investors […].”","ABCripto wrote that the resource was “developed to offer a comprehensive guide to terms related to […] cryptocurrencies, digital assets, tokenization, and related areas.” The group added:","“Our main objective is to establish standardization in language. We wanted to make it accessible and understandable to everyone.”","🇧🇷 Brazilian Senate OKs ‘15% Crypto Tax Rate’","Brazilian senators have voted in favor of a bill that proposes taxing crypto tax profits earned on overseas #crypto platforms at a fixed rate of 15%.#CryptoNews #newshttps:\/\/t.co\/ZndImy2A9U","— Cryptonews.com (@cryptonews) December 1, 2023","","The media outlet quoted the CVM as explaining that ABCripto created a working group that authored the document.","The CVM then “reviewed and validated the material.” The parties then “sought consensus regarding the definitions presented.”","The authors added that they also “adhered” to terminology already set out in Brazilian crypto-related legislation.","🇧🇷 Brazil’s Largest Lender Itau Unibanco Brings Bitcoin Trading Service to Clients@itau, Brazil’s largest private bank, has entered the crypto space with a new trading service.#CryptoNews #newshttps:\/\/t.co\/I5esoc9qEc","— Cryptonews.com (@cryptonews) December 4, 2023","","The glossary contains some 200 crypto and blockchain-related entries. It contains definitions of popular English and Portuguese terms.","These terms range from crypto mining tax-related terminology to English words and acronyms such as “stablecoin,” “bear market,” and “ATH.”","Bernardo Srur, the CEO of ABCripto, claimed that the glossary was “a source of pride for ABCripto and the CVM.” Srur explained:","“It is a work that features technical rigor and editorial quality. Many contributors took part in this project. The glossary will be a source of knowledge and structure for the development […] of everyone in the digital assets market.”","Last month, the domestic neobanking unicorn Nubank added five new altcoins to its banking platform."],"entity":[{"type":"December 1, 2023","content":"DATE"},{"type":"December 4, 2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"Bernardo Srur","content":"PERSON"},{"type":"Unibanco Brings Bitcoin Trading Service","content":"ORGANIZATION"},{"type":"CVM’s Education and Financial Inclusion Director Paulo Portinho","content":"ORGANIZATION"},{"type":"Brazilian Cryptoeconomics Association","content":"ORGANIZATION"},{"type":"CVM","content":"ORGANIZATION"},{"type":"Brazilian Senate","content":"ORGANIZATION"}],"hashtag":["Brazil","Regulation"],"authors":["Tim Alper"]}