{"summary":"Unstoppable Domains and The Sandbox Partner to Launch New Metaverse Experience + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/unstoppable-domains-and-the-sandbox-partner-to-launch-new-metaverse-experience-more-crypto-news.htm","publishDate":"2024-01-22T14:00:18","id":19915,"type":null,"title":"Unstoppable Domains and The Sandbox Partner to Launch New Metaverse Experience + More Crypto News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","Web3 domain names and digital identity provider Unstoppable Domains has joined hands with decentralized metaverse The Sandbox and Web3 gaming collectives Tuschay Studios and BoopGoop to launch Unstoppable Experience.","Per the press release making the crypto news rounds, this is the first live community competition involving a major Web3 brand inside The Sandbox.","It stated that,","“Unstoppable Experience represents Unstoppable Domains’ entry into metaverse creation for the first time, providing users with tools to own unique avatars and digital assets usable across all games in The Sandbox.”","Each collectible represents the player’s identity and accomplishments within the game.","The high-octane contest is a live multiplayer game where up to four players compete to top the scoreboard by painting the most tiles in the MetaCube with their avatar. No two games are ever the same.","Players will be able to interact in real time within a game. There is an exclusive hangout lounge on Unstoppable Domains’ land for UD domain holders to connect and collaborate.","A marketplace features exclusive wearable items for avatars. Also, the first-week participants will receive a free collectible.","Per Sandy Carter, COO and Head of Business Development at Unstoppable Domains, “this venture celebrates how digital identity can become a dynamic part of the gaming universe.”","As of January 16, the stablecoin sector saw a notable growth. The total market capitalization reached $134 billion, which is a 2.45% increase, according to a recent market report from on-chain analytics firm CCData. This is the highest value since February 2023 and the fourth consecutive month of growth.","Stablecoin trading volumes increased by 27.6% to $995 billion in December, the highest figure of 2023.","“Volumes on centralized exchanges (CEXs) are set to surpass this figure in January, having reached $579 billion halfway through the month.”","On January 15, the price of TrueUSD lost its parity. The price fell as low as $0.9841, and the market cap fell 18.5% to $2.10 billion in January.","Trading volumes for TUSD pairs remain at suppressed levels, recording a monthly volume of $6.95bn in December, almost 90% down from the highs recorded in June, the report notes.","Meanwhile, the market capitalization of PayPalUSD (PYUSD) hit an all-time high in January. It went up 12.9% to $264 million. The monthly trading volume reached $190 million in December, rising 175% from November.","The monthly PYUSD trading volume has surpassed its previous all-time high in January, reaching $230 million as of January 15.","ChuanQi IP, a subsidiary of the South Korean gaming giant WEMADE, has officially unveiled the story movie of the new blockchain-based idle RPG, MIR2M : The Grandmaster.","Per the press release making crypto news rounds, the video introduces the background story, depicting the origin of the Central Continent. It shows the attacks by demons who have taken control of the continent from the original inhabitants. The latter are forced to flee to the Empyrean Isle to escape the onslaught.","Pre-registration is available on the official website, Google Play, and Apple App Store starting from January 11. Pre-order gifts include a Shadow Master Transfer Card, Grade 4 Legendary Equipment Box, and a limited-edition costume.",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$190 million","content":"MONEY"},{"type":"$579 billion","content":"MONEY"},{"type":"12.9%","content":"PERCENT"},{"type":"2.45%","content":"PERCENT"},{"type":"18.5%","content":"PERCENT"},{"type":"COO","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"January 15","content":"DATE"},{"type":"January 16","content":"DATE"},{"type":"February 2023","content":"DATE"},{"type":"January 11","content":"DATE"},{"type":"Shadow Master Transfer Card","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$0.9841","content":"MONEY"},{"type":"$264 million","content":"MONEY"},{"type":"$134 billion","content":"MONEY"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Central Continent","content":"ORGANIZATION"},{"type":"$230 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"UD","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"$6.95","content":"MONEY"},{"type":"27.6%","content":"PERCENT"},{"type":"175%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"$2.10 billion","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$995 billion","content":"MONEY"},{"type":"Head of Business Development","content":"ORGANIZATION"}],"hashtag":["Gaming","Metaverse","Stablecoin"],"authors":["Sead Fadilpašić"]}