{"summary":"Polygon PoS Sidechain Implements Napoli Hard Fork, Adding Support for Upgrades Included in Dencun","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-pos-sidechain-implements-napoli-hard-fork-adding-support-for-upgrades-included-in-dencun.htm","publishDate":"2024-03-21T13:24:48","id":19912,"type":null,"title":"Polygon PoS Sidechain Implements Napoli Hard Fork, Adding Support for Upgrades Included in Dencun","category":["Blockchain News "],"content":["The Polygon Proof-of-Stake (PoS) sidechain has successfully executed the Napoli hard fork, adding support for Dencun features and making it the first network to support RIP-7212. ","The Napoli hard fork introduces three significant upgrades from Ethereum’s recent Dencun hard fork, namely EIP-1153: Transient Storage, EIP-6780: SELFDESTRUCT, and EIP-5656: memory copying instruction.","EIP-1153 aims to enhance the efficiency of block space utilization, optimizing the overall performance of the network. ","On the other hand, EIP-6780 restricts the functionality of the selfdestruct opcode, ensuring more secure and controlled operations. ","Meanwhile, EIP-5656 reduces the technical overhead associated with memory copying, and streamlining processes within the network.","As part of today's Napoli Hard Fork, Polygon PoS became the first chain to activate a Rollup Improvement Proposal (RIP) with RIP-7212, bringing support for a new precompile for the secp256r1 curve!","— Polygon | Aggregated (@0xPolygon) March 20, 2024","","Polygon has also announced plans to incorporate support for EIP-4844, a critical fee-reducing upgrade featured in Dencun. ","This integration is expected to be part of Polygon’s upcoming Feijoa upgrade, scheduled for release in May.","One of the key highlights of the Napoli hard fork is the inclusion of RIP-7212, an upgrade that opens doors for mainstream interoperability. ","This upgrade was developed by RollCall, a collective of Layer 2 teams. ","RIP-7212 introduces precompile support for the secp256r1 curve, a widely used elliptic curve for digital signatures across the internet. ","Its adoption enables greater interoperability with mainstream technologies and devices, with potential applications in storing keys within iPhone secure enclaves and facilitating various verification processes.","Polygon described RollCall as an entity that supports the extension of the EVM within Layer 2 solutions while adhering to the open standards process that has guided Ethereum from its inception. ","Furthermore, Polygon community contributors have proposed adding support for two other RIP\/EIP track changes in the next hard fork of PoS. ","These include EIP-3074 for enhancing account abstraction options for developers on PoS, as well as PIP-30, which increases the EIP-170 Max Code Size Limit. ","Polygon Community Contributors have proposed adding support for 2 other RIP\/EIP track changes in the next hard fork of PoS, EIP-3074 enhancing account abstraction options for developers on PoS, as well as PIP-30 which increases the EIP-170 Max Code Size Limit. Join the discussion…","— Polygon | Aggregated (@0xPolygon) March 20, 2024","","RollCall’s efforts to implement RIP-7212 are not limited to Polygon alone. ","Other Layer 2 solutions, including ZkSync Era and Optimism, are also working towards integrating support for this upgrade in the near future. ","This collaborative approach among Layer 2 projects signifies a move towards collective development and the establishment of Layer 2 solutions as Ethereum‘s core scaling mechanism.","David Silverman, the VP of product at Polygon Labs, highlighted the significance of RollCall in solidifying Layer 2 solutions as a fundamental part of Ethereum’s scaling strategy. ","He emphasized that RollCall provides a platform for the Ethereum ecosystem to govern itself effectively. ","“All of the rollups, we might fight a lot on Twitter, but we actually sit together in this new kind of committee [and] talk about proposed EVM changes — changes that are never going to actually come to Ethereum itself, but [that] the rollups are implementing to improve user behavior,” Silverman said.","“The Ethereum Foundation and the broader community is looking at L2s as an innovation hub and place where users are going to first onboard, as opposed to just naturally going to Ethereum at first,” he added. ",""],"entity":[{"type":"5656","content":"DATE"},{"type":"Napoli","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"1153","content":"DATE"},{"type":"Napoli Hard Fork","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Polygon Community Contributors","content":"ORGANIZATION"},{"type":"30","content":"DATE"},{"type":"Feijoa","content":"LOCATION"},{"type":"The Ethereum Foundation","content":"ORGANIZATION"},{"type":"Silverman","content":"PERSON"},{"type":"David Silverman","content":"PERSON"},{"type":"Dencun","content":"LOCATION"},{"type":"7212","content":"DATE"},{"type":"3074","content":"DATE"},{"type":"6780","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"March 20, 2024","content":"DATE"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["Dencun","Ethereum","Polygon"],"authors":["Ruholamin Haqshanas"]}