{"summary":"Ethereum Classic Did Not Solve Its Problem Following 51% Attack","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-classic-did-not-solve-its-problem-following-51-atta-3183.htm","publishDate":"2019-01-10T10:29:00","id":19914,"type":null,"title":"Ethereum Classic Did Not Solve Its Problem Following 51% Attack","category":["Altcoin News "],"content":["Ethereum Classic (ETC), the hard fork of the Ethereum blockchain, has not ultimately solved the problem of the recent 51% attack on the network, according to a blog post by its developer team member Donald McIntyre. They currently don’t know why this happened, but it is not due to an internal error, but to the fact that the network is very small and thus more susceptible to 51% attacks.","McIntyre published a blog post detailing the post mortem meeting of the ETC team that went over the main points about the attacks, analyzed the community’s reaction, and diagnosed possible solutions and next steps. Although the post openly states that the team has not solved the problem at all, they still applaud the community for the way this has been handled: under the “What went well?” header, the post states, “The ETC community didn’t try to minimize\/downplay the situation […] This post-mortem, our commitment to improvement.”","However, they also recognize their failings in this matter. “No alert system — exchanges, miners, wallet operators and other stakeholders had no contact points to initiate alerts or receive feedback from the developers or community,” is highlighted as one of the biggest issues in the event, along with “Echoing non facts and giving energy to conspiracy theories.”","They intend to fix this by creating a monitoring system that will alert the ecosystem sooner in the case of any new attacks, but also by significantly raising the confirmation time “depending on the type of transaction.”","“We suggest 2,500 to 5,000 blocks to achieve the same guarantees as 1 to 2 Bitcoin blocks; and more if dealing with large transactions. Essentially waiting until the cost to mine blocks to reorg is greater than the cost of what you’ve received,” according to the blog post.","The community is not happy about the possible longer confirmation time: “This makes ETC unusable… Imagine having to wait 10+ hours to interact with a dapp or trade tokens. Why would anyone choose to use this blockchain over the many competitors if this one requires 10+ hour wait times?” tweeted Tushar Jain, managing partner at analysis firm Multicoin Capital.","Meanwhile, China-based blockchain ecosystem security firm SlowMist claims it can identify attackers with the help from exchanges such as Binance, Gate.io, and Bitrue.","The attack began January 5th at 19:58:15 UTC, but the ETC team did not notice it. According to the developers, the two attacks on January 5\/6 and January 6\/7 lasted 19 hours in total. They report that the attacker duped several cryptocurrency exchanges in the process including Bitrue, and Gate.io. Gate.io claims that the attacker transferred 54,200 ETC in total, and that the exchange will be covering the 40,000 ETC loss for all of the users. Meanwhile, Bitrue writes that, “The attacker tried to withdraw 13,000 ETC from our platform but got halted by our system.”","As reported, according to Coinbase, the observed deep chain reorganization included a double spend of ETC 219,500 (USD 1 million) in total.","The price of the ETC token has fallen 13.13% in the past week, mostly due to the 9% drop in the past 24 hours, as the whole market dropped suddenly.","ETC price chart:","Cryptocurrency exchange Kraken has halted ETC funding until the network’s health has stabilized, but trading resumes as usual. Coinbase did the same, writing that “Due to unstable network conditions on the Ethereum Classic network, we have temporarily disabled all sends and receives for ETC. Buy and sell is not impacted.” OKEx seems to have done even less: “All ETC trading, depositing, and withdrawal remain open and continue normal operations. The number of confirmations required is increased to 100 for depositing and to 400 for withdrawal.”","Although exchanges continue to list ETC for now, this may prove to be a short-lived victory. “The lasting damage for ETC will come from the exchanges that will deem the coin insecure and delist it,” Emin Gün Sirer, co-director of Initiative for Cryptocurrencies and Smart Contracts at Cornell University, told Bloomberg earlier this week. According to him, this might trigger selling when the exchanges re-enable trades.","“Just how much is anyone’s guess — it’s a fascinating experiment overall, and we will see just how much of the market value is based on fundamentals and technical strength, which evidently and incontrovertibly went out the window,” he stressed.","Bitcoin maximalist Saifedean Ammous, professor of economics at the Lebanese American University, is part of the group which believes in ETC’s inferiority. “Two important lessons from this shitcoin’s demise: 1- The price has barely budged, which shows that demand for these shitcoins has nothing to do with their function, security, or safety and is entirely driven by speculation on exchanges. 2- It took more than a day for ETC fans & promoters on Twitter to even realize this attack was happening after @pierre_rochard told them about it, because they couldn’t find anyone who runs a node!” he tweeted. He has also previously called Ethereum a “worthless scam,” when attacking the Proof of Stake consensus mechanism."],"entity":[{"type":"Saifedean Ammous","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Cornell University","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Emin Gün Sirer","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Donald McIntyre","content":"PERSON"},{"type":"ETC","content":"ORGANIZATION"},{"type":"Lebanese American University","content":"ORGANIZATION"},{"type":"Bitrue","content":"ORGANIZATION"},{"type":"Tushar Jain","content":"PERSON"},{"type":"Bitrue","content":"PERSON"},{"type":"13.13%","content":"PERCENT"},{"type":"ETC","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Ethereum Classic","Hack"],"authors":["Sead Fadilpašić"]}