{"summary":"Solana Price Prediction as SOL Jumps Up 68% in Just Two Weeks – How High Can SOL Go in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-price-prediction-as-sol-jumps-up-68-just-two-weeks-how-high-can-sol-go-2023.htm","publishDate":"2023-01-24T13:43:00","id":19916,"type":null,"title":"Solana Price Prediction as SOL Jumps Up 68% in Just Two Weeks – How High Can SOL Go in 2023?","category":["Altcoin News "],"content":["The Solana price has upheld support above $20 against all odds and against the backdrop of the implosion of FTX, which threatened the survival of the ecosystem. ","In just three weeks, SOL’s value has grown by over 150% to trade at $24.56. The smart contracts token tagged a new 2023 high of $26.53 but has retraced, possibly because investors are cashing out for profit.","Solana price must secure higher support, preferably at $24.00 to give bulls time to build momentum for the subsequent movements to the upside. Tentative support levels may be provided for by the tested accelerated rising trendline in confluence with the 50-day Exponential Moving Average (EMA) (in red) around $23.22.","If sellers become aggressive, Solana price will be looking down to the main rising trend line and the next buyer congestion zone at $20.00. Traders looking for long positions in SOL price should tread cautiously, keeping in mind the Moving Average Convergence Divergence (MACD) indicator currently features a sell signal.","If investors heed the call to lock in profits, Solana price will first drop to $20.00 before rebounding for a fresh attack on the seller congestion at $26.00 and $30.00. The ongoing pullback may not last long considering the Money Flow Index (MFI) indicator is back above the midline (50.00) and may close in on the overbought region, thus paving the way for more gains in the short term.","Solana price uptrend gives the impression of being intact on the daily time frame chart but facing resistance at $26.00. Also capping movement to the upside is the falling trendline and the 200-day EMA (in purple) at $30.00.","The Moving Average Convergence Divergence (MACD) indicator upholds a buy signal which may call more buyers into SOL markets. As investors take up their positions in the market, momentum will build not only for a breakout above $30.00 but toward $100.","On the downside, the daily chart reinforcers support at $20.00 with the 100-day EMA (in blue). A rebound from this level might be the boost Solana price needs to ignite another rally.","Solana price tends to rally even when the cryptocurrency market is mum. Despite the crash in 2022 – made worse by the collapse of Sam Bankman-Fried’s FTX exchange, Solana still has a vibrant community and an ecosystem of applications and smart contracts tokens that are thriving in their capacities.","In late December, Vitalik Buterin recognized the Solana ecosystem and the developers within it. In the support message, the renowned developer said that it’s time for Solana to thrive – now that “awful opportunistic money people have been washed out.” Buterin was referring to people from organizations like FTX who, for a long time were controlling the liquidity in the entire network.","“Some smart people tell me there is an earnest smart developer community in Solana, and now that the awful opportunistic money people have been washed out, the chain has a bright future.”","Buterin added:","“Hard for me to tell from outside, but I hope the community gets its fair chance to thrive.”","The Solana ecosystem has always been vibrant and zealous for success to become a real “Ethereum Killer.” The frequent network outages appear to have been solved completely following a series of upgrades in Q3 2023. It has been almost four months since the Solana blockchain went offline.","According to a leading crypto analyst on TradingView going by the name ‘Richbust9,’ for Solana price to start trending toward its all-time high, it must successfully deal with three key obstacles, including the resistance at $40, $80, and $100.","This analyst also recommends buying SOL before it goes over $26.00 because “it’s pretty spikey” with the best buys ranging between $20.00 and $26.00.","“There are big 3 obstacles of resistance that Solana needs to break. 40$ zone 80$ zone and lastly 100$ area. In order to get that high then bulls should need to go sideways upwards and short dip retrace. It won’t be easy because of the Feds still increasing rates and inflation still high.”","Let’s face it, the bull market is yet to be confirmed and will highly rely on the United States Federal Reserve decisions on interest rates over the coming months. The first review in 22013 is expected around a mid-next week. Moreover, there is the likelihood of interest rate hikes to keep inflation under control. Therefore, investors need to manage their expectations going forward.","If you’re looking for other high-potential crypto projects alongside SOL, we’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:"," "],"entity":[{"type":"$24.00","content":"MONEY"},{"type":"$20.00","content":"MONEY"},{"type":"United States Federal Reserve","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$26.00","content":"MONEY"},{"type":"150%","content":"PERCENT"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$30.00","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"$80","content":"MONEY"},{"type":"Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"$24.56","content":"MONEY"},{"type":"$40","content":"MONEY"},{"type":"$23.22","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"MFI","content":"ORGANIZATION"},{"type":"$ zone 80$ zone","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$26.53","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Moving Average Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["SOL","Solana"],"authors":["John Isige"]}