{"summary":"A proposal to redenominate Polkadot&#x27;s DOT token and subsequently increase its total supply by 100x has been set aside for now by the Web3 Foundation, the Swiss non-profit that oversees the blockchain project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65420\/polkadot-redenomination-supply-proposal-web3","publishDate":"2020-05-15T11:48:33","id":1991,"type":null,"title":"Web3 Foundation tables proposal to redenominate Polkadot’s token and 100x its supply","category":["LAYER 1S"],"content":["A proposal to redenominate Polkadot's DOT token and subsequently increase its total supply by 100x has been set aside for now by&nbsp; the Web3 Foundation, the Swiss non-profit that oversees the blockchain project.","The news was announced on Friday in a <a href=\"https:\/\/polkadot.network\/p\/14714fb0-e035-4695-9020-3c6a97ff4d11\/\" data-v-f87c67ca=\"\">blog post<\/a> after a referendum was held on Kusama, an early version of the Polkadot chain that serves as a governance platform. Although the referendum vote passed, the Foundation decided to not move forward with the proposal at this time.&nbsp;","\"Informally, had the referendum recorded very little dissent, it is likely that Web3 Foundation, in its central role over the initial network launch, would have stood behind the redenomination proposal. However, given the non-negligible amount of opposition, including from some within the ranks of Web3 Foundation and Parity, the Foundation decided that we cannot, in good faith, sponsor redenomination at present,\" the blog post stated.","The proposal, which was brought up by the foundation, sought to change the denomination of DOTs, Polkadot's native token. Currently, one DOT equals one trillion Plancks, the smallest unit of account in Polkadot. A re-denomination would reduce that number by 100 times to ten billion Plancks. Accordingly, each user's DOT holding would increase by 100 times, so that their share of the network does not change.&nbsp;","According to the post, more than 13% of the Kusama stakeholders participated in the poll, making it the most-voted-on referendum in Kusama's history.&nbsp;","The proposal generated ample <a href=\"https:\/\/kusama.polkassembly.io\/referendum\/52\" data-v-f87c67ca=\"\">discussions<\/a> among the Polkadot community, as some worried that redenomination would wreak havoc as all related documents and infrastructure would need to be updated as well.&nbsp;","More importantly, as <a href=\"https:\/\/www.chainnews.com\/articles\/934869434023.htm\" data-v-f87c67ca=\"\">an article<\/a> by Chinese crypto media ChainNews points out, a change in total token supply might harm some retail investors that have purchased DOT futures from exchanges. Exchanges could act maliciously and not deliver 100 times the target DOTs when a futures contract expires.&nbsp;","Although the denomination remains unchanged for now, the Foundation said it will host a final vote on the Polkadot network itself after launch.","\"From here, we see only two options: do nothing and allow the current denomination to stand, or conduct a final, binding vote on the Polkadot network itself. As proponents of self-determination and on-chain governance, the latter is our favoured option,\" stated the blog post.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"ten billion","content":"MONEY"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Kusama","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"Kusama","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"the Foundation","content":"ORGANIZATION"},{"type":"Polkadot","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Plancks","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}