{"summary":"Tagomi has slashed its  fees at a time when major exchanges including Coinbase and Bitstamp are raising their fees for retail clients\n\nIn 2020, besides continuing scaling its lending, borrowing, and margin services, Tagomi also plans to introduce trading services for derivatives including futures","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50224\/tagomi-is-undercutting-large-crypto-exchanges-in-a-bid-to-lure-active-traders-to-its-platform","publishDate":"2019-12-12T13:11:26","id":1991,"type":null,"title":"Tagomi is undercutting large crypto exchanges in a bid to lure active traders","category":["The Block"],"content":["Cryptocurrency brokerage Tagomi is slashing its trading fees in a bid to lure active traders away from exchanges like Coinbase and Gemini to its platform.&nbsp;","The firm, which has raised approximately $28 million in venture capital funding, gatecrashed the digital asset trading world at the end of 2018 as an aspiring agency broker that would allow large traders to access liquidity across several markets.","In recent months, the firm has expanded its client pool to include active retail traders. To that end, the firm on Thursday introduced a new fee schedule that undercuts cryptocurrency exchanges' fees.&nbsp;","Previously, trading fees varied for Tagomi's clients, depending on the exchange where a given order was routed. Now, Tagomi will eliminate all exchange fees and charge a flat fee of 10 basis points for trades smaller than $1 million.&nbsp;","\"We’ve simplified the rate into a single all-in rate that clients pay to Tagomi,\" co-founder Marc Bhargava, told The Block. \"Clients don’t worry&nbsp;about any exchange fees, those are all borne by us.\"","","","Indeed, the move comes at a time when exchanges are actually raising fees on retail clients. Coinbase and Bitstamp, for instance, increased their maker fees for retail clients from Q1 to Q3.&nbsp;","","","<span data-v-f87c67ca=\"\">Still, in a sense Tagomi's relationship with exchanges like Coinbase mimics U.S. equities market structure in which brokers sit between large trading&nbsp;clients and exchanges such as Nasdaq or Cboe.<\/span>","<span data-v-f87c67ca=\"\">\"In the equities world, they turn to Interactive Brokers or a prime broker; in crypto they&nbsp;<\/span><span data-v-f87c67ca=\"\">turn to Tagomi,\" he said. \"It’s not to knock on retail exchanges and brokerages, it’s just a different&nbsp;<\/span><span data-v-f87c67ca=\"\">client base that demands having access to more than one exchange as a liquidity source&nbsp;<\/span><span data-v-f87c67ca=\"\">and cares about the best execution cost.\"<\/span>","The news comes a month after The Block reported on November 15 that Coinbase and Tagomi had held talks about a possible <a href=\"https:\/\/www.theblockcrypto.com\/daily\/47289\/tagomi-and-coinbase-have-held-acquisition-talks-and-insiders-say-its-a-perfect-match\" data-v-f87c67ca=\"\">acquisition deal<\/a>. Both firms have denied that an acquisition is being planned. &nbsp;","As for Tagomi's plans for 2020, the firm said it will continue to scale its lending, borrow, shorting and margin services to increase its client base. It also might also support the trading of derivatives, including futures.&nbsp;","Derivatives are a red-hot corner of the digital asset market. Intercontinental Exchange-backed Bakkt, for instance, recently rolled out two new derivatives, an option tied to its physically delivered bitcoin future as well as a cash-settled bitcoin futures. Tagomi didn't mention which markets it would support to start.&nbsp;"],"hashtag":[]}