{"summary":"Canada To Adopt International Standard For Crypto Tax Reporting – Here’s What That Means","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/canada-crypto-tax.htm","publishDate":"2024-04-18T22:52:58","id":19928,"type":null,"title":"Canada To Adopt International Standard For Crypto Tax Reporting – Here’s What That Means","category":["Blockchain News "],"content":["Canada is set to become one of the first nations to adopt the International Crypto-Asset Reporting Framework (CARF) for taxation by 2026, as outlined in a supplement to the country’s 2024 annual budget, as reported by the National Post on April 16.","The Organisation for Economic Co-operation and Development (OECD) agreed to the framework in August 2022 and is scheduled to be implemented in 47 countries by 2027, as pledged in November 2023.","#Canada to begin implementing international #crypto tax reporting standard :\nCanada is aiming to have the #OECD standard for crypto asset #tax reporting in place by 2027, as agreed with 46 other countries.\nAccording to a supplement to the 2024 annual budget, Canada expects to… pic.twitter.com\/oGWXFMKtfM","— TOBTC (@_TOBTC) April 18, 2024","","“Just as crypto-assets pose financial risks to middle-class Canadians, the rapid growth of crypto-asset markets poses significant risks of tax evasion,” the 2024 federal budget states. “Regulation and the international exchange of tax information must keep pace with tax evasion threats to ensure a fair tax system.”","The CARF places new reporting requirements on “crypto asset service providers” (CASPs) including crypto exchanges, brokers, and ATM operators. Stablecoins, derivatives issued as crypto tokens, and non-fungible tokens (NFTs) are included as examples of “crypto assets.”","Crypto asset service providers (CASPs), such as exchanges and ATM operators, will be obligated to report various transactions to the CRA. This includes crypto-to-fiat and crypto-to-crypto transactions and any crypto transfers exceeding $50,000 USD, encompassing payment processing activities.","CASPs must also collect information on their customers, including “name, address, date of birth, jurisdiction(s) of residence, and taxpayer identification numbers for each jurisdiction of residence.”","Transactions of both Canadian residents and non-residents will require reporting.","“Budget 2024 proposes to provide $51.6 million over five years, starting in 2024-25, and $7.3 million per year ongoing to the Canada Revenue Agency for the implementation and administration of these initiatives,” the budget reads.","The budget plan also includes a proposal to raise the capital gains tax inclusion rate from 50% to 66% for annual incomes exceeding $250,000. This change, which applies to cryptocurrency sales, has sparked concerns within the Canadian crypto community.","Trudeau has made living in Canada unaffordable & anyone trying to opt out of rampant money printing with Bitcoin just got screwed over: now it's harder to finally afford a house or support one's business. It's not a tax problem, it's a reckless spending problem #TrudeauMustGo pic.twitter.com\/mfZeNr0W54","— MAGS 🔑⛏️🚒 (@Crypto_Mags) April 16, 2024","","“Anyone trying to opt out of rampant money printing with Bitcoin just got screwed over,” tweeted @Crypto_ Mags on Tuesday, referring to the tax hike. “Now it’s harder to finally afford a house or support one’s business.”"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"August 2022","content":"DATE"},{"type":"$51.6 million","content":"MONEY"},{"type":"$50,000","content":"MONEY"},{"type":"25","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"National Post","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"International Crypto","content":"ORGANIZATION"},{"type":"$7.3 million","content":"MONEY"},{"type":"$250,000","content":"MONEY"},{"type":"2026","content":"DATE"},{"type":"2027","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Canada Revenue Agency","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"April 16, 2024","content":"DATE"},{"type":"April 18, 2024","content":"DATE"},{"type":"Organisation for Economic Co-operation and Development (OECD","content":"ORGANIZATION"},{"type":"April 16","content":"DATE"},{"type":"CRA","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"ATM","content":"ORGANIZATION"}],"hashtag":["Canada","Crypto Regulation","crypto tax"],"authors":["Andrew Throuvalas"]}