{"summary":"Bitcoin’s Flash Crash Sends Shockwaves Through Gaming Token Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoins-flash-crash-sends-shockwaves-through-gaming-token-market.htm","publishDate":"2024-01-04T12:02:29","id":19926,"type":null,"title":"Bitcoin’s Flash Crash Sends Shockwaves Through Gaming Token Market","category":["Altcoin News "],"content":["Bitcoin’s recent flash crash has sent shockwaves across the cryptocurrency market, impacting various gaming-related tokens. ","On Wednesday, Bitcoin (BTC), the largest cryptocurrency by market capitalization, experienced a rapid decline of approximately 7%, prompting a domino effect that saw gaming tokens losing anywhere from 5% to 15% of their value.","According to data from CoinGecko, following the Bitcoin crash, Immutable’s IMX token suffered a decline of around 9%, while The Sandbox’s SAND token dropped by about 12%. ","Axie’s AXS token experienced a roughly 10% decrease, and the GALA token took a significant plunge of approximately 13%. ","Additionally, Merit Circle’s BEAM token and ApeCoin fell by 9.5% and 13%, respectively.","Numerous other gaming tokens also faced losses within the past day, including the GMT token from the “move-to-earn” game Stepn, Enjin Coin, Parallel’s PRIME token, and WAX.","It is worth noting that these aforementioned cryptocurrencies have experienced overall declines over the past week, with their losses exacerbating following Bitcoin’s flash crash that occurred early on Wednesday morning. ","As reported, CoinGlass data indicates that the crash led to the liquidation of over $550 million in crypto long positions.","More specifically, 172,626 traders were liquidated, with the total long liquidations coming in at $557 million and short liquidations coming in at around $58 million.","Crypto exchange OKX took the lion’s share of these liquidations at over $230 million, followed by Binance at $105 million and Huobi at around $74 million. ","Bitcoin-tracked futures experienced $110 million in both short and long liquidations over the past day while Ethererum-linked futures saw over $82 million in liquidations. ","Despite the general downturn, a few tokens managed to make gains amidst the chaos. ","Axie’s Smooth Love Potion (SLP) and Yield Guild Games’ YGG tokens saw increases of approximately 4% and 11% respectively, seemingly unfazed by Bitcoin’s tumble. ","Oasys also experienced a rise of about 6.3% within the past day, joining the limited group of tokens that escaped the chilling effects of the flash crash.","While the current situation may seem challenging for lagging gaming tokens, it is important to note that some of them have recently achieved notable milestones. ","IMX reached a 20-month high of $2.35 last month, reaching prices not seen since the bullish market of April 2022. ","GALA also witnessed an 18% gain during the same period, although its price has since dropped back to around $0.027, similar to mid-December levels.","The record level of liquidations came as the leading cryptocurrency crashed to as low as $40,000 after a report from Matrixport claimed the SEC is poised to reject spot Bitcoin ETF applications this month. ","“Matrix on Target projects a January rejection for Bitcoin Spot ETFs by the SEC, cautioning traders to hedge long exposure,” the company wrote in a recent post on X (formerly Twitter). ","“With SEC Chair Gensler’s skepticism towards crypto, a potential -20% Bitcoin price drop is anticipated upon ETF denial, though a positive end-of-2024 outlook remains.”",""],"entity":[{"type":"Matrixport","content":"LOCATION"},{"type":"$58 million","content":"MONEY"},{"type":"6.3%","content":"PERCENT"},{"type":"April 2022","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Gensler","content":"PERSON"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Enjin Coin","content":"ORGANIZATION"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"$74 million","content":"MONEY"},{"type":"$2.35","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Ethererum","content":"PERSON"},{"type":"SLP","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"9.5%","content":"PERCENT"},{"type":"$230 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"$550 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"-20%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"$105 million","content":"MONEY"},{"type":"18%","content":"PERCENT"},{"type":"$82 million","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"$557 million","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"$0.027","content":"MONEY"}],"hashtag":["Bitcoin","Gaming"],"authors":["Ruholamin Haqshanas"]}