{"summary":"The top three ethereum mining pools have all issued a stance on the EIP-1559 proposal that could reduce miners&#x27; transactional revenues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/96316\/ethereum-mining-pools-divided-eip1559","publishDate":"2021-02-26T09:58:16","id":1993,"type":null,"title":"Ethereum&#x27;s biggest mining pools take opposing stances on EIP-1559 plan","category":["ETHEREUM"],"content":["Two of the three largest <a href=\"https:\/\/www.theblockcrypto.com\/linked\/3872\/security-experts-release-disclosure-for-an-ethereum-vulnerability-that-enables-attackers-to-potentially-force-exchanges-to-pay-large-gas-fees\" data-v-f87c67ca=\"\">Ethereum<\/a> mining pools are the latest to take a public stance on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/3937\/ethereum-developer-publishes-previously-undisclosed-internal-documents-about-a-potential-upgrade-in-2019\" data-v-f87c67ca=\"\">Ethereum<\/a> Improvement Proposal (EIP)-1559, a proposed protocol update that could reduce miners' transactional revenues.","F2Pool, currently the third-largest <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42857\/juno-raises-3m-for-a-neo-banking-platform-built-on-ethereum\" data-v-f87c67ca=\"\">Ethereum<\/a> pool with about 11% of the network's hashrate, has said it supports the EIP-1559 proposal in a post on February 26 entitled \"<a href=\"https:\/\/f2pool.io\/mining\/insights\/20210225-staying-on-the-bright-side-of-history-eip-1559\/\" data-v-f87c67ca=\"\">Staying on the (b)right side of history.<\/a>\"","\"Today, the general community along with core developers are siding with evolving Ethereum to include EIP-1559. It is important to side with the users and core contributors,\" F2Pool wrote in the post.","F2Pool's stance comes a day after Sparkpool, the largest mining pool with about 24% of the hashrate, said in a Tweet that it <a href=\"https:\/\/twitter.com\/sparkpool_eth\/status\/1364790269820825604\" data-v-f87c67ca=\"\">opposes the proposal<\/a>, highlighting the degree of division within the Ethereum mining community.","First proposed by Vitalik Buterin in 2018, EIP-1559 is perhaps the most anticipated upgrade in <a href=\"https:\/\/www.theblockcrypto.com\/linked\/4398\/ethereum-classic-development-group-shuts-down\" data-v-f87c67ca=\"\">Ethereum’s<\/a> history after its launch, apart from the Eth2 switch from proof-of-work to proof-of-stake.","Under the upgrade, the network would burn part of the transaction fees as profits to ETH holders instead of miners. The overall goal is to improve network's security and ensure the network's transaction fees won't be as highly variable as they are now.","As such, miners would lose out on one of their major revenue sources, as The Block Research detailed in a <a href=\"https:\/\/www.theblockresearch.com\/upcoming-eips-and-the-ethereum-1-0-roadmap-92101\" data-v-f87c67ca=\"\">roadmap piece here<\/a>. Ethereum miners have earned more than $600 million in mining fee revenue since the start of February, according to data collected by The Block Research.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereum-miner-revenue-monthly\/embed\" title=\"Ethereum Miner Revenue (Monthly)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Per the roadmap, the upgrade is scheduled for three to six months after <a href=\"https:\/\/www.theblockcrypto.com\/linked\/443\/new-ethereum-asic-could-shake-up-the-market-if-bold-claims-prove-true\" data-v-f87c67ca=\"\">Ethereum's<\/a> Berlin hard fork, which is likely to happen by the end of 2021's second quarter at the latest.&nbsp;","Sparkpool already expressed concerns with EIP-1559 earlier this month, having promoted arguments against EIP-1559's fee burning mechanism in January.","\"It is a tyranny of the majority in the name of better UX (in fact not). It is robbery. Why we love ether and btc? Because it gives us perfect property right,\" Sparkpool said in a <a href=\"https:\/\/twitter.com\/sparkpool_eth\/status\/1357633927914024960\" data-v-f87c67ca=\"\">Twitter thread<\/a> on February 5. \"EIP 1559 will break this. We are sad to see many people only care about price now.\"","In January, Bitfly, the operator behind <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46388\/banking-giant-standard-chartered-joins-enterprise-ethereum-alliance\" data-v-f87c67ca=\"\">Ethereum's<\/a> second-largest mining pool Ethermine (which possesses about 20% of the hashrate), said in a Twitter post that it is \"<a href=\"https:\/\/twitter.com\/etherchain_org\/status\/1351610475281309697\" data-v-f87c67ca=\"\">against adopting EIP-1559<\/a> in its current state,\" arguing that \"Ethereum's future may be at risk.\"","Those remarks joined those from a group of smaller <a href=\"https:\/\/www.theblockcrypto.com\/linked\/4770\/ethereum-core-developers-propose-activation-point-for-constantinople-hard-fork\" data-v-f87c67ca=\"\">Ethereum<\/a> mining pools that have called to <a href=\"https:\/\/stopeip1559.org\/\" data-v-f87c67ca=\"\">stop EIP-1559<\/a>.","Now with Sparkpool onboard, the side that opposes the plan has above 50% of the network's total hashrate at the current moment. That said, the upgrade's development is at an early stage, during which time pool participants have the option to shift their hashing power to different sides depending on their own preferences.","Yet F2Pool argued in its post that it believes there's \"a high likelihood that EIP-1559’s inclusion has been priced in today’s ETH price.\"","\"If the proposal fails to be implemented, the likely effect on short-term ETH prices will not be favorable as ETH holders account the new no-action on EIP-1559 into their thesis for ETH. The unfavorable price action might set off a sequence of events leading to further deleveraging both on centralized and decentralized financial markets. Eventually, the miners will also be impacted as their revenues are dependent on ETH prices,\" F2Pool argued in its post.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 26","content":"DATE"},{"type":"Today","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Sparkpool","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$600 million","content":"MONEY"},{"type":"Bitfly","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Berlin","content":"LOCATION"},{"type":"1559","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"February 5","content":"DATE"},{"type":"24%","content":"PERCENT"},{"type":"2021's second quarter","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","MINING"],"authors":["Wolfie Zhao","The Block"]}