{"summary":"SushiSwap is discussing a new proposed update that aims to form a new DAO structure called Meiji.\nIt proposed new changes including the use of non-transferable “shares” in Sushi governance voting.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178658\/sushiswap-weighs-new-dao-structure-that-uses-non-transferable-shares","publishDate":"2022-10-20T11:44:37","id":1993,"type":null,"title":"SushiSwap weighs new DAO structure that uses non-transferable shares","category":["DeFi"],"content":["On Wednesday, a Sushi core contributor floated a proposed update called \"Meiji Governance Rework,\" aiming to bring a wide array of changes to Sushi's <span data-v-f87c67ca=\"\">decentralized autonomous organization, which is collectively owned and managed by its members.<\/span>","<span data-v-f87c67ca=\"\">The Meiji update could make the project's governance “more equitable &amp; decentralized,” SushiSwap's newly appointed head chef Jared Grey<\/span> <a href=\"https:\/\/twitter.com\/jaredgrey\/status\/1582568345114619904\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\">. According to DeFiLlama, SushiSwap is the seventh-largest decentralized exchange, holding over<\/span> <a href=\"https:\/\/defillama.com\/protocol\/sushi\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$739 million<\/span><\/a><span data-v-f87c67ca=\"\"> in locked deposits.<\/span>","<span data-v-f87c67ca=\"\">If the proposal is passed, Sushi will be led by Meiji DAO —&nbsp; a new group that replaces the project's governance body called Sushi DAO.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">“The Sushiswap Meiji DAO will supersede all responsibilities currently held by the Sushi DAO. The Meiji DAO will bring governance on chain, and kickstart the Meiji Restoration of Sushi, which will become a new phase of Sushi and a new grand vision to execute on,” the proposal noted.<\/span>","<span data-v-f87c67ca=\"\">The most notable change proposed is that the Meiji DAO body will conduct voting with the help of Sushi “shares” which represent non-transferable governance rights to participate in Sushi governance. The shares can be obtained by locking up the DEX's native Sushi tokens in a smart contract. The holders can exit shares at any time by forfeiting them, per the proposal.<\/span>","<span data-v-f87c67ca=\"\">The proposal, still in a discussion phase, claimed the use of so-called Sushi shares will be useful in preventing Sybil actors or users who accumulate large amounts of tokens to influence the DAO voting results. <\/span><span data-v-f87c67ca=\"\">Shares will not be issued immediately, and members will have to wait for double the voting period before they can vote on different proposals.<\/span>","<span data-v-f87c67ca=\"\">The non-transferable design, the proposal said, will help the team implement \"quadratic voting\", a governance system that reduces the weight of additional votes used to cast votes by a single voter. <\/span>","<span data-v-f87c67ca=\"\">While quadratic voting is still a nascent concept in DAOs, it's meant to make governance processes more inclusive by amplifying the voting power of the average voter.<\/span>"],"hashtag":[]}