{"summary":"Five South Korean Crypto Exchanges to Delist Litecoin Following Mimblewimble Upgrade","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/five-south-korean-crypto-exchanges-delist-litecoin-following-mimblewimble-upgrade.htm","publishDate":"2022-06-08T09:59:00","id":19930,"type":null,"title":"Five South Korean Crypto Exchanges to Delist Litecoin Following Mimblewimble Upgrade","category":["Altcoin News "],"content":[" ","All five of South Korea’s licensed, fiat-trading crypto exchanges have announced they will delist litecoin (LTC) after developers rolled out the Mimblewimble Extension Block protocol.","The five exchanges – Upbit, Bithumb, Coinone, Korbit, and Gopax – all made their LTC delisting announcements “all at once,” News1 reported. This represents a first for the South Korean crypto industry.","In Upbit’s announcement, which was similarly worded to those of its rivals, the exchange explained that transaction support would end on June 20, with withdrawals allowed until July 20. In the past 24 hours, Upbit was responsible for around 11% of LTC trading volume (USD 55m), per CoinGecko data.\n\nAs a result, News1 noted, domestic litecoin trading in fiat KRW will essentially be “blocked” within days. Even exchanges that do not yet KRW market operating permits – such as Foblegate and Coredax – have placed special warning notices on their litecoin trading pages. The same media outlet stated that these platforms are also “expected to make the decision to delist soon.”","At 09:57 UTC, LTC trades at USD 62 and is down from USD 65, reached earlier today. The price is almost unchanged in a day and down 9% in a week and 34% in a month.","Last month, LTC node operators voted in favor of rolling out the protocol, which allows users of the Litecoin network to choose whether or not to make their transactions confidential. The upgrade also removes unnecessary transaction data from the network’s blocks using compression technology.","But the boost in privacy moves the protocol into uneasy legal waters in South Korea, where “privacy coins” such as monero (XMR) and zcash (ZEC) have already been delisted. South Korean law forbids exchanges from listing such tokens, insisting that all transactions be screened for possible money laundering violations.","And while the Mimblewimble update does not only focus on privacy, but also on decreasing block size to provide improved speeds and scalability, the exchanges appear keen not to end up in hot water with the authorities. As such, their swift and concerted effort to delist appears to be something of a conciliatory move.","Last month, all five exchanges were hauled before lawmakers to explain why they had failed to communicate with one another over the delisting of LUNAC following the Terra ecosystem crash and the ensuing controversy in South Korea. The exchanges responded by claiming they would set up a joint listing\/delisting council – which now appears to have claimed its first victim, litecoin.","\n____\nLearn more: \n– Litecoin Releases its Much-Anticipated Fungibility and Scalability Update\n– ZEC Stays Flat Despite Major Zcash Update That Boosts Privacy\n\n– CBDCs Are Likely to Make You Less Anonymous\n– Monero Usage in Ransomware Payments Rises while Bitcoin Accepted With Premium"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Coinone","content":"LOCATION"},{"type":"Korbit","content":"LOCATION"},{"type":"June 20","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"Bithumb","content":"LOCATION"},{"type":"July 20","content":"DATE"},{"type":"Upbit","content":"PERSON"},{"type":"Mimblewimble Extension Block","content":"ORGANIZATION"},{"type":"KRW","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"34%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"Scalability Update\n– ZEC","content":"ORGANIZATION"},{"type":"Foblegate","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"}],"hashtag":["Altcoins","Exchange","Litecoin","Privacy","South Korea","Trading"],"authors":["Tim Alper"]}