{"summary":"Sam Altman’s Worldcoin Debuts in Germany, Incorporates Okta for Enhanced Identity Management","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sam-altmans-worldcoin-debuts-germany-incorporates-okta-for-enhanced-identity-management.htm","publishDate":"2023-06-30T12:00:00","id":19936,"type":null,"title":"Sam Altman’s Worldcoin Debuts in Germany, Incorporates Okta for Enhanced Identity Management","category":["Altcoin News "],"content":["Sam Altman’s Worldcoin is integrating with one of the world’s largest identity management platforms and is launching a new identity protocol in Germany.","This is according to the company’s press release, shared with Cryptonews earlier this week. As per the anouncement, Worldcoin has now integrated with Okta and is launching World ID, the project’s identity protocol.","With World ID, users will be able to verify their identities with the use of custom-built hardware that leverages biometrics. The hardware is called the Orbs, and will first be available in Berlin, before expanding throughout the country.","Orbs come with iris scanners and then use the data to create unique cryptographic identities. Data processing happens in real time, it was said, and the generated digital key is stored on the device itself.","As part of its integration with Okta, there is now an option to “Sign in with Worldcoin” on the Auth0 marketplace, allowing developers to add the new feature to their apps and websites.","The new sign-in flow is not only simple but also more robust in terms of privacy, it was said on the Worldcoin blog. ","By signing in with Worldcoin, a zero-knowledge proof (ZKP) is generated on the user’s device, which confirms their identity without revealing sensitive, personally identifiable information. ","As the device generates a new ZKP every time a user logs in, it’s impossible to track accounts on different platforms to the same individual.","World ID is also expected to reduce bot traffic, which is a major pain point for advertisers. Bot traffic makes up the majority of internet traffic these days, and is often abused in digital ad fraud. ","This type of fraud, the Worldcoin blog further stated, is expected to grow into a $100 billion industry this year.","With World ID, it should be easier to determine whether the traffic is coming from an actual human or not, it was said.","As one of the world’s largest identity and access management software companies out there, Okta claims to service millions of users.","____","– Will Worldcoin Be the Next Cryptocurrency to Explode As AI Crypto Coins yPredict, Launchpad, AiDoge Explode\n– Sam Altman’s Worldcoin Introduces App for Eyeball-Scanning Crypto Project\n\n– What is Blockchain Technology?\n– What is a Smart Contract?"],"entity":[{"type":"Eyeball","content":"ORGANIZATION"},{"type":"Okta","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Launchpad","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Berlin","content":"LOCATION"},{"type":"Sam Altman’s Worldcoin","content":"PERSON"}],"hashtag":["Blockchain","Germany","Privacy"],"authors":["Sead Fadilpašić"]}