{"summary":"Fidelity Updates Spot Ethereum ETF Application to Include Staking","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fidelity-updates-spot-ethereum-etf-application-to-include-staking.htm","publishDate":"2024-03-19T04:24:21","id":19941,"type":null,"title":"Fidelity Updates Spot Ethereum ETF Application to Include Staking","category":["Altcoin News "],"content":["Fidelity has updated its Spot Ethereum exchange traded fund (ETF) application to the U.S. Securities and Exchange Commission (SEC) on March 18 to include staking.","Fidelity updated the SEC with the form 19b-4 stating that from time to time, it may stake a portion of the fund’s assets through one or more trusted staking providers.","“According to the Registration Statement, the Sponsor may, from time to time, stake a portion of the Fund’s assets through one or more trusted staking providers, which may include an affiliate of the Sponsor (“Staking Providers”). In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided.” – Fidelity’s 19b-4 form to the SEC.","Chanchal Samadder, head of product at ETC Group, told Cryptonews earlier this month that a primary attraction of ETH for institutional investors lies in its staking yield. For many investors, staking is a way of earning rewards by simply holding Ethereum.“We anticipate that staked ETH ETFs will face delays in approval in the US, unlike Europe where these products are readily accessible to investors,” adds Samadder.","In February, investment firm Franklin Templeton was the latest asset manager to file a spot Ethereum ETF application with the SEC — joining ​​a long list of asset managers such as BlackRock, Fidelity, Grayscale, VanEck, Invesco and Galaxy, as well as Cathy Wood’s Ark Invests and 21Shares, all of which have submitted applications for a spot Ethereum ETF.","Earlier this month,the SEC delayed a decision to approve the BlackRock spot Ethereum ETF. The SEC now has until May 23 to approve or reject VanEck’s ETF application for an Ethereum ETF.","Many product providers are optimistic about the approval of more crypto products believing it is inevitable the SEC will eventually approve Ethereum ETFs due to the demand.\n“I think it is inevitable Ether is next,” Hector McNeil, co-CEO and the co-founder of HANetf, a firm which markets and distributes exchange-traded products, told Cryptonews: “If Bitcoin can be approved and meets all the liquidity and asset class thresholds then Ether qualifies,” adds McNeil.","In January, the SEC approved almost a dozen Bitcoin spot ETFs which has caused a trading frenzy as demand for the products continues to accelerate. One of the eleven Bitcoin spot ETFs approved is the BlackRock iShares Bitcoin Trust trading under the ticker symbol “IBIT.” BlackRock’s ETF is leading the pack and so far has attracted $10 billion in assets under management (AUM) in just under two months since launching."],"entity":[{"type":"Cathy Wood","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"McNeil","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"March 18","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"BlackRock iShares Bitcoin Trust","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Cryptonews","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Hector McNeil","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"May 23","content":"DATE"}],"hashtag":["Ethereum ETF","Fidelity","US SEC"],"authors":["Tanzeel Akhtar"]}