{"summary":"Terra Luna Classic Crypto Price Analysis – LUNC Down 21.3%","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crypto-price-analysis-lunc-down-213.htm","publishDate":"2022-09-07T12:05:00","id":19940,"type":null,"title":"Terra Luna Classic Crypto Price Analysis – LUNC Down 21.3%","category":["Altcoin News "],"content":[" ","Terra Luna Classic (LUNC) has aggressively retraced today after reaching a euphoric top of $0.0004506 on the Binance crypto exchange. ","Recently Terra Luna Classic (LUNC) formed a bearish reversal pattern known as a broadening ascending channel and lost price structure. LUNC now resides within a bullish falling wedge pattern which could break out to the upside.","September is a notorious month for cryptocurrency as we usually see a downtrend for major altcoins and Bitcoin.","Will Terra Luna Classic continue to pump in September? ","Despite the current retracement in the crypto markets Terra Luna Classic (LUNC) is still looking fantastic when zooming out on the price charts. ","In fact, LUNC is still up a tremendous 761% from the bottom on the 9th June 2022. Terra Luna Classic is now trading in a bullish reversal pattern known as a falling wedge.","Upon breaking out of the falling wedge pattern traders might speculate that we would see positive price momentum back towards the critical resistance level of $0.0004506.","From a technical analysis perspective the technical target could create an impulse wave or pump as high as, if not higher than 25.5%. ","At the time of writing this article Terra Luna Classic (LUNC) is trading at $0.000363 and according to Coinmarketcap has a market capital of $2.2 billion. ","This particular corrective phase reminds me of the correction we had for LUNC on the 2nd of September within the symmetrical triangle pattern. ","We can clearly see Terra Luna Classic (LUNC) corrected 28.97% before making a parabolic move to the upside. ","The current correction within the falling wedge pattern has been 26.08% down to $0.0003364 where we saw a bounce from the support trend line of the falling wedge. Are 25-30% corrections perhaps the new norm for LUNC? ","Of course, this bullish reversal pattern can still be invalidated and we may lose support. If Terra Luna Classic (LUNC) cannot hold its support level we could see negative continuation down to the $0.0003057 and $0.000291 support ranges. ","If Terra Luna Classic has the ability to shock the crypto community one more time, a pragmatic target forecasted by the 1.618 Fibonacci extension would bring the price of LUNC up to around the $0.00052.","Of course this outcome can also rely on the sentiment of the entire crypto markets as if we see bitcoin crash to $17,500 or below there could be deleterious effects on the price of Terra Luna Classic. ","Update – Terra Luna Classic (LUNC) is currently breaking out of the falling wedge position, technical targets have not yet been met and this could easily be a fake out. ","Terra Luna Classic (LUNC) is now breaking out of the falling wedge pattern. The ideal bullish scenario here is to retest the resistance trendline as support and see further continuation to the upside. ","First Terra Luna Classic needs to combat the resistance level of $0.000389.","If we can consolidate at current price levels LUNC will print a very bullish looking candle on the 4 hour time frame.  ","The Terra Luna Classic bulls are certainly striking back once again. With enough positive price momentum and community morale there is still a possibility that we might see the $0.0005 price levels broken this September. ","I am still speculating that this might be the case, though like everything with cryptocurrency, volatility and uncertainty in the markets can take place at any time and the risk of losing capital always exists. ","A new crypto known as Tamadoge will also hit the crypto markets soon which could very well also do exciting things in the next coming weeks. "],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"$0.000291","content":"MONEY"},{"type":"$0.0005","content":"MONEY"},{"type":"$0.0004506","content":"MONEY"},{"type":"26.08%","content":"PERCENT"},{"type":"Tamadoge","content":"ORGANIZATION"},{"type":"$2.2 billion","content":"MONEY"},{"type":"Coinmarketcap","content":"ORGANIZATION"},{"type":"$17,500","content":"MONEY"},{"type":"First Terra Luna Classic","content":"ORGANIZATION"},{"type":"761%","content":"PERCENT"},{"type":"9th June 2022","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Terra Luna Classic (LUNC","content":"ORGANIZATION"},{"type":"25.5%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$0.000389","content":"MONEY"},{"type":"28.97%","content":"PERCENT"},{"type":"$0.0003364","content":"MONEY"},{"type":"$0.000363","content":"MONEY"},{"type":"$0.00052","content":"MONEY"},{"type":"$0.0003057","content":"MONEY"}],"hashtag":["Luna","LUNC","Terra"],"authors":["Jacob Bury"]}