{"summary":"Paul Chan, Hong Kong’s financial secretary, said in his budget speech that the government will expand the e-CNY pilot scope.\nThe Hong Kong government will also commence the second phase of its CBDC, the e-HKD.","author":["Timmy Shen","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279739\/hong-kong-to-broaden-e-cny-pilot-in-move-to-boost-cross-border-payment-efficiency","publishDate":"2024-02-28T23:24:11","id":1995,"type":null,"title":"Hong Kong to broaden e-CNY pilot in move to boost cross-border payment efficiency","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Hong Kong plans to expand the pilot scope of e-CNY, China’s central bank digital currency (CBDC) in trial, to enhance cross-border payment efficiency, according to the government’s latest budget.<\/span>","<span data-v-f87c67ca=\"\">Paul Chan, the financial secretary of Hong Kong, said in his <a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202402\/28\/P2024022800141.htm?fontSize=1\" data-v-f87c67ca=\"\">budget speech<\/a> on Wednesday that the government plans to expand the pilot testing of the digital yuan so more residents in Hong Kong may top up their e-CNY wallets through the local existing “Faster Payment System” (FPS).&nbsp;<\/span>","<a href=\"https:\/\/www.hkma.gov.hk\/eng\/key-functions\/international-financial-centre\/financial-market-infrastructure\/faster-payment-system-fps\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">FPS<\/span><\/a><span data-v-f87c67ca=\"\"> is a real-time payment settlement system that allows users to make cross-bank e-wallet payments by entering the mobile phone number or the email address of the recipient.<\/span>","<span data-v-f87c67ca=\"\">The Hong Kong Monetary Authority, Hong Kong’s de facto central bank, completed the first-phase pilot of its CBDC, the e-HKD, in October 2023, and has “studied domestic retail use cases in various areas such as programmable payments, offline payments and tokenized deposits,” according to Chan. The HKMA plans to “soon commence” the second phase of its e-HKD pilot.<\/span>","<span data-v-f87c67ca=\"\">The HKMA has also been engaged in the mBridge CBDC project, which is set to launch the first phase of its service this year, according to the budget speech. The <\/span><a href=\"https:\/\/www.bis.org\/about\/bisih\/topics\/cbdc\/mcbdc_bridge.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mBridge project<\/span><\/a><span data-v-f87c67ca=\"\"> is initiated by the Bank for International Settlements, the HKMA and the central banks of China, Thailand and the UAE to experiment with a common multi-CBDC platform for wholesale cross-border payments.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Hong Kong issued the second batch of tokenized green bonds earlier this month after it issued the first batch in February 2023, Chan added. That was “the world's first-ever multi-currency tokenized bond issuance,” and has attracted “overwhelming subscription” by global institutional investors, including asset managers, insurance companies, private banks and non-financial corporates, he said.<\/span>","<span data-v-f87c67ca=\"\">Chan also noted that Hong Kong plans to <\/span><a href=\"https:\/\/www.theblock.co\/post\/279492\/hong-kong-regulatory-sandbox-for-stablecoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">soon roll out a sandbox<\/span><\/a><span data-v-f87c67ca=\"\"> for those interested in issuing stablecoins. <\/span><span data-v-f87c67ca=\"\">In December, the <\/span><span data-v-f87c67ca=\"\">Financial Services and the Treasury Bureau<\/span><span data-v-f87c67ca=\"\"> and the HKMA jointly <\/span><a href=\"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched a consultation<\/span><\/a><span data-v-f87c67ca=\"\"> — until Feb. 29 — on regulating stablecoin issuers. They proposed that all fiat-referenced stablecoin issuers should obtain a license from the HKMA.<\/span>"],"hashtag":["ASIAN REGULATION","CBDCS"]}