{"summary":"Crypto Tax Law Firm Accuses Ex-Employee of Stealing Secrets for YouTube Videos","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-tax-law-firm-gordon-law-accuses-ex-employee-trade-secrets.htm","publishDate":"2024-04-11T10:17:46","id":19950,"type":null,"title":"Crypto Tax Law Firm Accuses Ex-Employee of Stealing Secrets for YouTube Videos","category":["News "],"content":["A law firm specializing in crypto taxation recently filed a trade secrets lawsuit in an Illinois US District Court. It names a competitor and a former employee as defendants, alleging misappropriation of confidential materials through YouTube videos. These include templates, client forms, and other proprietary information.","In the lawsuit, Gordon Law Group sued ex-employee Justin McCormick and his current employer, Founder’s CPA on four grounds.","McCormick’s tenure at Gordon Law spanned less than nine months, from Dec. 4, 2021 to Aug. 16, 2022. Now, he is a senior associate within the digital asset department at Founder’s CPA, an organization offering services similar to Gordon Law.","While at Gordon Law, McCormick was responsible for creating marketing and training materials for the firm, the lawsuit said.","In March 2023, he allegedly publicly shared a Google Drive folder containing confidential information belonging to Gordon Law. This information reportedly included “virtual replicas” of the firm’s processes, templates, automated converters, folder structures, and other sensitive materials.","According to Gordon Law, McCormick retained confidential spreadsheets, scripts, formulas, and electronic documents that are the proprietary property of the firm.","McCormick and Founder’s CPA didn’t return Cryptonews’ request for comment by press time.","Further, the training materials Gordon Law discovered show that McCormick and Founder’s CPA are “fully utilizing Gordon Law’s unique and secret methods and processes.”","The lawsuit provides specific examples of the alleged misappropriation of trade secrets. One instance involves a video published on the Founder’s CPA YouTube channel on May 6, 2023. Entitled “Crypto Taxes Made Easy: Setting Up Your Inventory,” the video was narrated by McCormick and included a link to the drive.","According to the lawsuit, the video detailed Gordon Law’s specific, internally-developed process for establishing a “client inventory,” and notably, used the exact tools and templates employed by the firm.","Furthermore, the lawsuit alleged another instance on May 15, 2023. A 42-minute video, narrated by McCormick again, was published on the same channel. This video specifically discussed the two software tools Gordon Law used to “pull data” and generate a usable data set.","“Founder’s CPA and McCormick have used and continue to use Gordon Law’s trade secrets and confidential information to their benefit for the creation of cryptocurrency tax reports for Founder’s CPA clients,” it said.","Notably, the videos identified within the lawsuit appear to have been deleted from the YouTube channel.","Gordon Law is seeking reimbursement for attorney’s fees incurred during the litigation. Additionally, the firm is pursuing an equitable accounting to determine the total profits lost."],"entity":[{"type":"Illinois US District Court","content":"ORGANIZATION"},{"type":"Gordon Law Group","content":"ORGANIZATION"},{"type":"Gordon Law","content":"PERSON"},{"type":"Dec. 4, 2021","content":"DATE"},{"type":"McCormick","content":"ORGANIZATION"},{"type":"Google Drive","content":"ORGANIZATION"},{"type":"May 6, 2023","content":"DATE"},{"type":"McCormick","content":"PERSON"},{"type":"March 2023","content":"DATE"},{"type":"Justin McCormick","content":"PERSON"},{"type":"May 15, 2023","content":"DATE"},{"type":"Aug. 16, 2022","content":"DATE"}],"hashtag":["crypto tax","Lawsuit"],"authors":["Shalini Nagarajan"]}