{"summary":"South Korean Agencies Investigate $82M Orbit Bridge Hack After Reports of Lazarus Group’s Involvement","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-agencies-investigate-82m-orbit-bridge-hack.htm","publishDate":"2024-01-05T06:39:34","id":19953,"type":null,"title":"South Korean Agencies Investigate $82M Orbit Bridge Hack After Reports of Lazarus Group’s Involvement","category":["Blockchain News "],"content":["Orbit Bridge, which serves as the main bridge for the Claytont ecosystem, was exploited for nearly $82 million hours before the New Year’s Eve. Multiple South Korean agencies are currently investigating the multi million hack.","Allegations have emerged identifying North Korea’s hacking group, ‘Lazarus,’ as the orchestrator of the exploit, prompting several South Korean National Intelligence Service (NIS) to intervene for a comprehensive investigation.","The bridge was utilized by prominent Korean domestic platforms such as Kakao’s blockchain platform Claytont and WEMIX, a blockchain project by WEMADE.","The NIS’s involvement in determining the perpetrator of the attack signifies an unusual level of engagement for a blockchain-related virtual asset theft. According to Orbit Bridge’s operating company, OZYS, they promptly reported the asset misappropriation incident to the Korea Internet & Security Agency (KISA) and the National Police Agency on January 1st, complying with mandatory reporting obligations under the Information and Communication Network Act.","The NIS commented on the ongoing investigation, stating, “We are currently investigating the cause and the perpetrator of the incident. While no direct link to North Korea has been confirmed so far, we are collaborating with relevant agencies and considering the possibility,” local news media reported.","The incident follows a pattern observed in the cryptocurrency space where cybercrime incidents trigger the involvement of agencies like the Cyber Investigation Division of the National Police Agency and KISA. However, the inclusion of the NIS in this case is deemed exceptional.","OZYS has actively cooperated with the investigation, notifying authorities promptly and seeking assistance from global blockchain analysis firms such as UPsala Security and the TON Foundation.","As the fallout from this incident reverberates not only within the Claytont decentralized finance (DeFi) sector but across the entire ecosystem, OZYS anticipates support from Claytont for resolving the crisis and assisting affected parties.","OZYS plans to release further details on their joint response with Claytont in addressing the incident."],"entity":[{"type":"‘Lazarus","content":"PERSON"},{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"$82 million","content":"MONEY"},{"type":"January 1st","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Cyber Investigation Division of the National Police Agency","content":"ORGANIZATION"},{"type":"NIS","content":"LOCATION"},{"type":"National Police Agency","content":"ORGANIZATION"},{"type":"South Korean National Intelligence Service","content":"ORGANIZATION"},{"type":"NIS","content":"ORGANIZATION"},{"type":"Korea Internet & Security Agency (KISA","content":"ORGANIZATION"}],"hashtag":["Crypto hack","Orbit Chain","South Korea"],"authors":["Jai Pratap"]}