{"summary":"Investors Believe the US Fed Will Pause Rate Hikes + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/investors-believe-the-us-fed-will-pause-rate-hikes-more-news.htm","publishDate":"2023-12-05T14:25:55","id":19952,"type":null,"title":"Investors Believe the US Fed Will Pause Rate Hikes + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","According to the latest Bitfinex report, “financial markets are now leaning towards a potential interest rate cut by the Fed [Federal Reserve], with the CME FedWatch Tool indicating a 78 percent likelihood of such a move by the end of their May meeting in 2024. This is a notable shift from just a month ago when the probability was pegged at 41 percent.”","The analysts added that “investors currently believe the Fed will pause its rate hikes, viewing its current policy as sufficiently restrictive to moderate growth and stabilise prices without triggering a recession. This delicate balance is crucial for the US economy as it navigates through uncertain economic conditions.”","Meanwhile, Bitcoin (BTC) reached a new year-to-date high, reaching over $41,646 on December 4, surpassing its previous trading range’s upper limit, to which it had been confined for several weeks. The new peak came after BTC had seen its strongest monthly close since March 2022.","BTC\/USD Weekly Chart ","Bitfinex analysts said that this upward movement can be attributed to a combination of factors, including a notable shift in the dynamics of the futures market compared to the spot market.","There was significant buying activity in the market, particularly aimed at absorbing the supply above $37,500, near the upper boundary of its recent trading range, they said. On December 1, BTC was still hovering below the range high.","Cumulative Volume Delta (CVD) for the futures market, which measures BTC’s mid- to long-term buy and sell pressure by comparing buying and selling volume over time, was more resilient on downswings on the lower time frames than the CVD for the spot markets. As a result, the market was in a state of “perp premium,” implying a high relative difference in demand for BTC in the futures market compared to the spot markets.","This may be seen as a signal to be cautious in other contexts, as more leverage in the markets is not always healthy, they said, but it was notable that at the same time, open interest declined.","Morgan Beller, general partner at NFX, a VC firm investing in pre-seed and seed-stage startups, said that “when the market was nuts,” the type of founders that can be described as “fruit flies” came into the crypto market.","Beller told Bloomberg that these founders thought it was like “the sexiest accessory to have a crypto company and thought overnight they would be worth a lot on paper.”","However,","“What the market cooling down did is it filtered those founders out. So now you really only have founders coming in who really, really care, who actually have a problem to solve. So in a weird way, the bear market is very nice because it automatically applies a filter, at least to the top of the funnel of startups, that isn’t necessarily there in a bull market.”","Asked about investments, she said that any project always needs to answer three questions: is this company solving a problem for anyone; is anyone using it; and is the product or company making money or has any potential to make money?","“And when you look at the history of crypto and crypto startups and blockchain companies, there’s very few that actually check all three of those boxes, let alone one or two. And Bitcoin is one of the few use cases that is, you know, checks all of those boxes and is real and is definitely a case study for potentially other investments,” Beller said.","Lastly, she added that she wished that crypto regulations were more founder-friendly in the US. If there were more clarity, she said, it would limit the amount of guessing or fear among founders looking to establish a crypto company in the US.","Beller is the co-founder of Libra and was Head of Strategy for Novi, Facebook’s digital wallet for the Libra payment system.","The Sandbox, a decentralized gaming virtual world and subsidiary of Animoca Brands, and Warner Music Group, the global music entertainment company, announced the launch of a new experience for hip-hop fans: “Breakin’ B.I.G.”","It is described as a nod to “the beloved side-scrolling games of the 1990s,” which immerses players in a neighborhood where The Notorious B.I.G. “reigns supreme.”","The game celebrates the era when US rapper Biggie rose to fame and brings the G.O.A.T. to today’s music fans in a whole new way, with homages to his Brooklyn roots and the formation of Junior M.A.F.I.A.","Several activities are set to launch in December, including the playable “Breakin’ B.I.G.” experience, an exclusive avatar collection, and the freshly revamped Warner Music Group social hub.","Players will be able to step into a 2D arcade-style world set in the music-infused backdrop of 1990s Brooklyn, where they assume the role of an aspiring rapper with deep admiration for Biggie, striving to make it big in the music industry, the announcement said.","Players will engage with Biggie and other characters to complete quests essential to earning his respect, “such as revitalizing Brooklyn neighborhoods, confronting those who dare to challenge Biggie’s influence, and assisting the hip-hop legend in achieving even greater success.”","Players will also be able to customize their digital selves with exclusive Biggie-themed avatars.","Crypto exchange Bitget has launched the TraderPro program to give users the opportunity and incentives to become elite traders. According to the press release, the program is designed to identify “exceptional demo trading users who can become Elite traders on the platform.”","TraderPro Program is a demo trading competition that enables crypto traders to earn rewards of 10,000 USDT and dual profit “without investing real money.”  To provide greater recognition to top traders, Bitget offers initial investing capital to users, the company said.","The TraderPro program is divided into two phases:","In addition to trading profits, traders can grab a share of their followers’ profits, it added. Users who stand out in the TraderPro program will also be highlighted in exclusive recommendation slots and labeled with special badges.","Decentralized finance (DeFi) company Folks Finance said it became the first platform to bring digital gold and silver to a wider audience by listing GOLD and SILVER — tokens tied to the real price of these precious metals.","Powered by Algorand, these tokens facilitate lending, borrowing, and trading of precious metals directly on the Folks Finance platform, bringing traditional financial assets into the DeFi space, the company said.","“Each token is backed by a gram of physically secured gold or silver, enabling tangible assets to enter Algorand’s DeFi ecosystem for the first time. This historic development signifies a pivotal step in bridging conventional finance with decentralized finance, unlocking the utilization of real gold and silver in DeFi loans and trades,” the press relase said.","This strategic move is anticipated to draw in new users and capture the attention of traditional financial sector investors, Folks Finance added, given the accelerating growth of the real-world asset (RWA) market. Forecasts from digital asset management firm 21.co predict the RWA industry could surge to $10 trillion by 2030."],"entity":[{"type":"41 percent","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"CME FedWatch Tool","content":"ORGANIZATION"},{"type":"$41,646","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CVD","content":"ORGANIZATION"},{"type":"USD Weekly Chart","content":"ORGANIZATION"},{"type":"Junior M.A.F.I.A.","content":"ORGANIZATION"},{"type":"Folks Finance","content":"ORGANIZATION"},{"type":"$10 trillion","content":"MONEY"},{"type":"1990s","content":"DATE"},{"type":"RWA","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"$37,500","content":"MONEY"},{"type":"78 percent","content":"PERCENT"},{"type":"NFX","content":"ORGANIZATION"},{"type":"Algorand","content":"LOCATION"},{"type":"2030","content":"DATE"},{"type":"1990s Brooklyn","content":"LOCATION"},{"type":"Morgan Beller","content":"PERSON"},{"type":"Beller","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Warner Music Group","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"December 4","content":"DATE"},{"type":"December 1","content":"DATE"},{"type":"Fed [Federal Reserve","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Delta (CVD","content":"ORGANIZATION"},{"type":"Novi","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Biggie","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitfinex","Bitget","Federal Reserve","Gaming","Investment","Market","Metaverse","Music","Regulation","Trading","USA","USDT"],"authors":["Sead Fadilpašić"]}