{"summary":"Kenya Establishes Multi-Agency Group To Lead Crypto Regulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-regulation-kenya-establishes-multi-agency-group.htm","publishDate":"2024-04-23T06:35:37","id":19958,"type":null,"title":"Kenya Establishes Multi-Agency Group To Lead Crypto Regulation","category":["News "],"content":["Kenya is initiating efforts toward crypto regulation, with the government forming a multi-agency team that includes the central bank.","This group will develop rules and oversight for cryptocurrencies (also known as virtual assets) and the companies that deal in them (Virtual Asset Service Providers), local outlet NTV Kenya reported Monday.","Kenyan National Treasury Cabinet Secretary Prof. Njuguna Ndung’u revealed the establishment of the multi-agency working group to the National Assembly. This follows warnings from regulators about unlicensed virtual asset products and a risk assessment by the Central Bank highlighting money laundering and terrorist financing concerns.","This assessment highlighted the potential for money laundering and terrorist financing associated with virtual assets, underlining the need for regulatory measures.","Kenya’s 2022 anti-money laundering report identified virtual assets and virtual asset service providers as areas needing attention.","Further, Kenyan authorities uncovered at least $20m injected into the economy in 2023 through suspicious M-Pesa withdrawals. These transactions were linked to the now-suspended iris-scanning project Worldcoin. ","Kenya boasts the highest cryptocurrency activity and interest in the East Africa region. It even ranks among the top five markets across the entire continent. However, Kenya falls behind Nigeria in terms of total cryptocurrency ownership, having roughly 4.4m holders.","Kenya’s approach to cryptocurrency regulation seems to be evolving. After a period of negativity, the country’s parliament actively engaged in discussions and projects related to crypto in 2023.","This culminated in the National Assembly’s committee approving the Capital Markets (Amendment) Bill, 2023 in December. This bill, if passed, would significantly change Kenya’s approach to crypto by introducing taxation on crypto exchanges and wallets, similar to traditional bank transactions."],"entity":[{"type":"Monday","content":"DATE"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"Kenya","content":"LOCATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"National Treasury Cabinet Secretary Prof. Njuguna Ndung","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"East Africa","content":"LOCATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"$20m","content":"MONEY"},{"type":"December","content":"DATE"}],"hashtag":["Africa","Crypto Regulation"],"authors":["Shalini Nagarajan"]}