{"summary":"Fidelity Bitcoin ETF Records First Daily Net Outflows Since January Listing","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fidelity-bitcoin-etf-records-first-daily-net-outflows-since-january-listing.htm","publishDate":"2024-04-26T15:21:11","id":19961,"type":null,"title":"Fidelity Bitcoin ETF Records First Daily Net Outflows Since January Listing","category":["Blockchain News "],"content":["The Fidelity Wise Origin Bitcoin (FBTC) ETF, a key player in the spot Bitcoin exchange-traded fund (ETF) market, experienced a significant setback on Thursday, with a first day of net outflows since launch. It recorded a noteworthy outflow of nearly $23 million, marking a significant event in the cryptocurrency market.","This outflow trend, the first of its kind since its introduction in January, had a ripple effect beyond Fidelity Bitcoin ETF. It impacted other prominent funds in the cryptocurrency market, painting a broader picture of the market’s current state.","On the same day, notable names in the cryptocurrency market, such as ARK 21Shares’ ARKB, Valkyrie’s BRRR, and Bitwise’s BITB, recorded outflows of $31.3 million, $20.2 million, and $6 million, respectively. ","According to SoSoValue data, the Fidelity Bitcoin ETF outflow on Thursday amounted to $22.61 million. This departure from its typical performance showed a shifting sentiment among investors in the Bitcoin market. ","Franklin Templeton’s EZBC emerged as a top performer among the affected funds, attracting a net inflow of $1.87 million. However, Grayscale’s GBTC counterbalanced this positive momentum, experiencing a substantial drainage of $139 million.","Daily Flows: @Grayscale ‘s $GBTC and @BlackRock ‘s $IBIT pic.twitter.com\/Uik7HRSuUH","— HODL15Capital 🇺🇸 (@HODL15Capital) April 26, 2024","","Analysts attribute the lack of significant fund inflows to the post-Bitcoin halving environment. Hong Song-uk, an analyst at NH Investment and Securities, highlights the need for follow-up events focusing attention on Bitcoin in the near term.","“There are no follow-up events that focus attention on Bitcoin in the near term,” Hong said.","At the time of publication, Coinglass data revealed that approximately $58.2 million of Bitcoin was liquidated in the past 24 hours, with long positions accounting for $35 million.","On Wednesday, the Fidelity Bitcoin ETF contributed $5.4 million to the total inflow of $9.8 million for the day. BlackRock’s IBIT fund continued its trend of zero inflows on Thursday, mirroring its performance from the previous day. Other funds that reported no inflows on Thursday include Invesco’s BTCO, VanEck’s HODL, WisdomTree’s BTCW, and Hashdex’s DEFI.","In a recent report from SoSoValue from April 17, Bitcoin also saw significant outflows in the Bitcoin exchange-traded funds (ETFs) market, notably highlighted by Grayscale’s Bitcoin Trust (GBTC) witnessing a net outflow of $79.38 million.","This contributes to GBTC’s historical net outflow of $16.46 billion. Conversely, the BlackRock ETF IBIT saw a net inflow of approximately $25.78 million, reflecting a divergent trend in investor sentiment.","Further insights highlight the magnitude of outflows from GBTC, reaching as high as $643 million, while other ETF products witnessed modest inflows.","On the other hand, while BlackRock’s 71-day streak of continuous inflows ends, signaling a potential shift in the Bitcoin market, there’s notable turbulence in the exchange-traded funds (ETFs) market.","Preliminary data from Farside Investors reveals a significant decline in BlackRock’s IBIT popularity. For the first time since its launch, the fund failed to attract new investments, contrasting with the modest inflows seen in Fidelity’s FBTC and the ARK 21Shares Bitcoin ETF.","Concurrently, Grayscale’s GBTC faced substantial withdrawals, culminating in a net outflow of $120.6 million—the largest since April 17.","Despite the initial enthusiasm and heavy investments, the sentiment towards Bitcoin ETFs has cooled off this month, dampening the previous momentum in the Bitcoin market.","As Hong Kong prepares to launch Bitcoin and Ether ETFs by the end of April, aiming to challenge the United States’ dominance in the digital asset space, regulatory hurdles and competition with established U.S. financial giants pose significant challenges. ","Moreover, while Fidelity’s Bitcoin ETF recently secured a record $40 million investment, concerns persist over low public participation in Bitcoin ETFs, highlighting the growing institutional interest in Bitcoin alongside the challenges hindering broader ETF adoption."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$16.46 billion","content":"MONEY"},{"type":"$1.87 million","content":"MONEY"},{"type":"$40 million","content":"MONEY"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"$IBIT","content":"MONEY"},{"type":"$5.4 million","content":"MONEY"},{"type":"$79.38 million","content":"MONEY"},{"type":"$58.2 million","content":"MONEY"},{"type":"$23 million","content":"MONEY"},{"type":"NH Investment and Securities","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$643 million","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"$120.6 million","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Bitwise’s BITB","content":"ORGANIZATION"},{"type":"$139 million","content":"MONEY"},{"type":"$20.2 million","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Fidelity Bitcoin ETF","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"April 26, 2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Farside Investors","content":"ORGANIZATION"},{"type":"$GBTC","content":"MONEY"},{"type":"VanEck","content":"PERSON"},{"type":"$25.78 million","content":"MONEY"},{"type":"Fidelity Wise Origin Bitcoin","content":"ORGANIZATION"},{"type":"April 17","content":"DATE"},{"type":"$31.3 million","content":"MONEY"},{"type":"$22.61 million","content":"MONEY"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"$9.8 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin ETF","Fidelity"],"authors":["Hassan Shittu"]}