{"summary":"Three Arrows Capital Co-founder Su Zhu Says Prison Was an “Enjoyable Experience Overall”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/three-arrows-capital-co-founder-su-zhu-says-prison-was-an-enjoyable-experience-overall.htm","publishDate":"2024-01-23T11:21:19","id":19960,"type":null,"title":"Three Arrows Capital Co-founder Su Zhu Says Prison Was an “Enjoyable Experience Overall”","category":["Altcoin News "],"content":["Su Zhu, the co-founder of now-collapsed hedge fund Three Arrows Capital (3AC), has shared his thoughts on his time spent in prison, describing it as an “enjoyable experience overall.”","During a video podcast, Zhu expressed appreciation for his time behind bars, even claiming that he had the “best sleep” of his life while incarcerated.","He suggested that everyone should have the opportunity to experience prison at least once, believing it to be beneficial.","Zhu provided insights into his daily life in prison, highlighting the simplicity of entertainment and comparing it to activities from “ancient days.”","He discussed the routines and privileges within the facility, such as access to ample reading material, the opportunity to exercise, and a structured diet.","“You can read all the books you want,” Zhu said. “You can do all the pushups you want.”","The quality of sleep in the prison environment particularly impressed Zhu.","He said that the lights would turn off at 9:30 pm and back on at 5:30 am, allowing for uninterrupted rest.","He described it as the best sleep he had ever experienced.","“…And then the sleep is amazing..because they’ll turn the light off at 9:30 pm and the light comes back on at 5:30.” Adding that, “I actually had the best sleep of my life in prison.”","Additionally, the disgraced crypto boss said he found a sense of connection with his ancestors through the use of mats instead of beds.","Su on the way prison induces a harmonic return to the natural state of man pic.twitter.com\/xQm3yrqipF","— Lukas (computer) 🐂 (@SCHIZO_FREQ) January 22, 2024","","In October last year, Zhu was arrested in Singapore while embarking on an attempt to flee.","According to a disclosure made by Teneo, the fund’s liquidator, Zhu was detained at the Changi airport after a committal order was issued on him and his business partner, Kyle Davies.","“(Zhu) was apprehended at Changi Airport whilst attempting to travel out of Singapore following a committal order granted by the Singapore Courts against him,” the announcement read.","Zhu and Davies were sentenced to four months in prison through a committal order for contempt of court. ","The former Three Arrow executives were issued subpoenas to cooperate with the investigations and activities of Teneo in unraveling issues that led to the implosion of the fund.","Although active on social media in the aftermath of the collapse, Zhu and Davies remain on the run from the firm’s liquidators and authorities.","Both were also prohibited by the Monetary Authority of Singapore from floating regulated investments for nine years."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"Changi","content":"LOCATION"},{"type":"Davies","content":"PERSON"},{"type":"January 22, 2024","content":"DATE"},{"type":"Changi Airport","content":"LOCATION"},{"type":"5:30","content":"TIME"},{"type":"October last year","content":"DATE"},{"type":"9:30","content":"TIME"},{"type":"Zhu","content":"PERSON"}],"hashtag":["Three Arrows Capital"],"authors":["Ruholamin Haqshanas"]}