{"summary":"Is Monero Going to Zero? XMR Price Drops 3% as Viral New Bitcoin Mining Project Surpasses $4 Million Milestone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-monero-going-to-zero-xmr-price-drops-3-as-viral-new-bitcoin-mining-project-surpasses-4-million-milestone.htm","publishDate":"2023-11-16T12:43:54","id":19965,"type":null,"title":"Is Monero Going to Zero? XMR Price Drops 3% as Viral New Bitcoin Mining Project Surpasses $4 Million Milestone","category":["Industry Talk "],"content":["","The XMR price has dropped by 3% in the past 24 hours, slipping to $160.91 on a day when the cryptocurrency market as a whole gains by 2.5%.","Monero is also down by close to 4% in the past week and by 6% in a fortnight, with the privacy coin gaining by only 9% in the last 30 days.","This performance contrasts poorly with many other major tokens, with XMR’s status as a privacy coin potentially meaning that traders will neglect it during any forthcoming bull market.","However, there are alternative tokens for big, above-average gains, with new stake-to-mine platform Bitcoin Minetrix set to have a very big listing in the next few weeks.","As XMR’s chart illustrates, its indicators are starting to show considerable weakness, as if the coin is at the beginning of medium-term dip.","In particular, its relative strength index (purple) has fallen from around 70 at the start of November to nearly 40 today, signalling considerable selling pressure.","It’s also notable that XMR’s 30-day average (yellow) has flattened out after several weeks of climbing, implying that it’s now on its way down, along with the XMR price.","Having said that, it should provide some comfort that the privacy coin’s support level has been rising since October.","This could mean that any losses in the next few days may be slight, and that XMR may begin rising again along with the rest of the market.","However, XMR hasn’t risen as strongly as other major tokens during the recent rallying, while the revelation of a hack on its community wallet has also recently damaged faith in the coin.","Since we don't know who did the #monero CCS hack, they should just donate all that back to Monero general fund and look like a hero. We wouldn't know if that was the thief. Everyone is happy!","— Vik Sharɱa 🇺🇸 (@vikrantnyc) November 12, 2023","","As a coin that offers privacy and security, the above hack seems to have weakened some of Monero’s credibility, dampening demand for the token.","As such, it could see further losses before stabilizing itself, with the XMR price potentially on course to reach $170 or $180 by the end of the year.","Because Monero is on relatively shaky ground, many traders may prefer to invest in coins with greater prospects of market-beating rallies in the short- and medium-term.","This may include checking out presale tokens, which can often rally big once they list on exchanges for the first time.","The biggest presale happening right now belongs to Bitcoin Minetrix (BTCMTX), a stake-to-mine platform that has raised more than $4 million in just over a month.","Big news! 📢#BitcoinMinetrix proudly announces a colossal accomplishment, more than $4,000,000 raised! 🪙 pic.twitter.com\/neW7VEgkjJ","— Bitcoinminetrix (@bitcoinminetrix) November 16, 2023","","Bitcoin Minetrix has been so successful in attracting investors due to the uniqueness of its platform, which will enable users to stake its native BTCMTX token in order to receive mined Bitcoin.","This works by providing users with tokenized mining credits, which they can then spend to have miners mine on their behalf.","If they stake enough BTCMTX and spend enough credits, they will receive newly minted BTC in return, as well as newly minted BTCMTX.","Examining $BTC mining with #BitcoinMinetrix! ⛏️#Cloudmining unveils a direct route to #Crypto:","🔓 Beginner-friendly access.\n💰 Economical without hardware costs.\n🏙️ No concerns about space, noise, or overheating.\n🌟 Effortless enhancements. pic.twitter.com\/m1LMaQe8G9","— Bitcoinminetrix (@bitcoinminetrix) November 16, 2023","","Bitcoin Minetrix’s platform therefore aims to make Bitcoin mining much more accessible to average investors and cryptocurrency holders, something which helps account for the runaway success of its presale.","New buyers can join this sale by going to the official Bitcoin Minetrix website, where 1 BTCMTX currently costs $0.0116.","This price will rise to $0.01190 by the sale’s tenth and final stage, at which point the token will list on exchanges, where it could make early investors a big profit.","Visit Bitcoin Minetrix Now","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"$0.0116","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"$4,000,000","content":"MONEY"},{"type":"$4 million","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"$160.91","content":"MONEY"},{"type":"$180","content":"MONEY"},{"type":"XMR","content":"ORGANIZATION"},{"type":"$170","content":"MONEY"},{"type":"$0.01190","content":"MONEY"},{"type":"last 30 days","content":"DATE"},{"type":"Bitcoin Minetrix","content":"PERSON"},{"type":"November 16, 2023","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Vik Sharɱa 🇺🇸","content":"ORGANIZATION"},{"type":"November 12, 2023","content":"DATE"}],"hashtag":["Altcoins","Monero","Technical Analysis"],"authors":["Simon Chandler"]}