{"summary":"Mastercard: 51% of Surveyed Consumers in Latin America & the Caribbean Have ‘Experienced’ Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mastercard-51-of-surveyed-consumers-in-latin-america-the-caribbean-have-experienced-crypto.htm","publishDate":"2022-06-25T00:00:00","id":19977,"type":null,"title":"Mastercard: 51% of Surveyed Consumers in Latin America & the Caribbean Have ‘Experienced’ Crypto","category":["Bitcoin News "],"content":[" ","Interest in crypto is piquing in Latin America and the Caribbean (LAC), where the payments giant Mastercard says over half of “consumers” have already had at least one encounter with crypto.","The firm said that it had spoken to “more than 35,000 people around the world” as part of its New Payments Index survey, with 51% of LAC respondents saying that they had completed “at least one crypto-related activity in the past 12 months.”","It added that “more than a third” of Latin American\/Caribbean respondents have used a stablecoin to “make a payment for an everyday purchase.”","The survey, conducted between March and April this year, further found that 54% of Latino and Caribbean consumers are “optimistic” about the performance of digital assets as an investment.","Some 66% of Latin Americans and Caribbeans replied that they wanted “greater flexibility to use crypto and traditional payment methods interchangeably” in their daily financial operations.","A whopping 82% also replied that they wanted their current banks to provide them with a range of “directly available” “cryptocurrency-related” functions. ","And 77% of those questioned said they would be happy to use crypto more if they understood more about it.","The survey further indicated that if cryptoassets “were issued or backed by a trusted organization,” such as a bank, 69% of the respondents would feel more confident investing. ","And 67% said they would be happy to make or receive payments in cryptoassets if tokens had tradfi (traditional finance) backers.","The survey appears to show that the area is an outlier, however. Globally, just over a third of respondents said they were “somewhat or very likely to try paying with crypto” in the next year, with fewer than 6 in 10 stating that they “would feel more confident about crypto if they knew it was issued or backed by a reputable organization.”","Mastercard’s survey also found that digital payments are on the rise in Latin America, with 95% of respondents stating that they intended to use digital payment methods in the next year. Almost a third of respondents stated that they had used less cash over the past 12 months.","The survey’s findings come hot on the heels of a flurry of activity in the region from Mastercard’s rival Visa. The latter rolled out a number of crypto cards in Brazil and Argentina this month – in partnership with major local blockchain industry players.","Walter Pimenta, Mastercard’s Executive Vice President of Products and Engineering in the Latin America\/Caribbean region, was quoted as stating that “more and more Latin Americans are showing interest in cryptocurrencies and want solutions that facilitate access to the crypto world.”","He added that Mastercard was now working on “solutions to expand digital inclusion and strengthening alliances that guarantee operability and support.”","____","Learn more: \n– Mastercard to Enable Direct NFT Payment Options for Marketplace Operators\n– Mastercard Doubles Down on its Crypto Strategy With New Acquisition\n\n– Visa Rolls out Multiple ‘Bitcoin Cashback’ Cards with Partners in Brazil, Argentina\n– Brazil’s Judges Receive Crypto ‘Training,’ Minister Warns of ‘Gaps’ in Regulation\n\n– One in Seven Wealthy People Now Owns ‘Digital Assets’ – Survey\n– 40% of Surveyed Lower-income Individuals Want to Use Bitcoin – Not to Make Money"],"entity":[{"type":"Mastercard","content":"ORGANIZATION"},{"type":"April this year","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"54%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"67%","content":"PERCENT"},{"type":"LAC","content":"ORGANIZATION"},{"type":"66%","content":"PERCENT"},{"type":"77%","content":"PERCENT"},{"type":"82%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"Walter Pimenta","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Argentina","content":"LOCATION"},{"type":"Enable Direct NFT Payment Options for Marketplace Operators\n– Mastercard","content":"ORGANIZATION"},{"type":"Caribbean","content":"LOCATION"},{"type":"69%","content":"PERCENT"},{"type":"Crypto Strategy With New Acquisition","content":"ORGANIZATION"}],"hashtag":["Adoption","Latin America","mastercard","Payments","Stablecoin","Survey"],"authors":["Tim Alper"]}