{"summary":"Yearn is asking users who profited from the bug to return a &quot;reasonable&quot; amount to the protocol’s multisig.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267483\/yearn-finance-says-faulty-script-wiped-out-63-of-treasury","publishDate":"2023-12-13T12:46:16","id":1997,"type":null,"title":"Yearn Finance says faulty script wiped out $1.4 million from treasury","category":["DEFI"],"content":["(<em data-v-f87c67ca=\"\">Yearn Finance corrects statement to show that incident affected 63% of Yearn's own LP position in Lp yCRV.<\/em>)","<span data-v-f87c67ca=\"\">Yield-farming protocol Yearn Finance said a <\/span><span data-v-f87c67ca=\"\">faulty multisig script wiped out 63% of a position in its treasury. No user funds were affected.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The incident took place during a \"regular fee token conversion process on behalf of Yearn's treasury,\" according to a disclosure <a href=\"https:\/\/github.com\/yearn\/yearn-security\/blob\/master\/disclosures\/2023-12-11.md\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">post<\/a> on Github. The faulty script caused of 3,794,894 lp-yCRVv2 tokens to be swapped for 779,958 yvDAI tokens.<\/span>","<span data-v-f87c67ca=\"\">\"The entire treasury balance of lp-yCRVv2 (POL, plus fees) was mistakenly transferred to the trading multisig, when only expected a much smaller fees portion. The script used by the trading multisig to swap tokens lacked sufficient output checks and contained a logical error that would have capped the trade size to a reasonable amount,” the post stated.<\/span>","<span data-v-f87c67ca=\"\">The trade led to significant price slippage, \"which arbed back to the normal price by the market shortly after,\" the protocol team wrote, asking any users that profited from the price movement caused by the incident \"to return an amount that they feel is reasonable to Yearn's main multisig.\"<\/span>","Losses totaled $1.4 million prior to any returned funds, or around 2% of the entire treasury, Yearn told The Block.","\"We are expecting some returned funds, there are communication channels open,\" a spokesperson said.&nbsp;","<span data-v-f87c67ca=\"\">To prevent such incidents in the future, the protocol developers plan to \"separate POL funds into dedicated manager contracts, introduce more human-readable output messages on trading scripts and enforce stricter price impact thresholds,\" the post stated.<\/span>","<span data-v-f87c67ca=\"\">Earlier <a href=\"https:\/\/www.theblock.co\/post\/226134\/exploit-involving-aave-v1-and-yearn-estimated-to-be-around-10-million-peckshield\" data-v-f87c67ca=\"\">this year<\/a>, an exploit involving an early Yearn version, called iearn, caused damages of $11.6 million, according to PeckShield. In February, <a href=\"https:\/\/www.theblock.co\/linked\/94365\/defi-platform-yearn-moves-to-restore-exploited-vault-less-than-a-week-after-11-million-loss\" data-v-f87c67ca=\"\">an exploit<\/a> resulted in the loss of $11 million worth of crypto from one of its vaults.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$11 million","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Github","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"$11.6 million","content":"MONEY"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"Yearn","content":"ORGANIZATION"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"$1.4 million","content":"MONEY"}],"hashtag":[],"authors":["Anna Baydakova","The Block"]}