{"summary":"US SEC Delays Decision on BlackRock’s Spot ETH ETF","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-sec-delays-decision-on-blackrocks-spot-eth-etf.htm","publishDate":"2024-03-05T04:35:46","id":19976,"type":null,"title":"US SEC Delays Decision on BlackRock’s Spot ETH ETF","category":["Ethereum News "],"content":["The U.S. Securities and Exchange Commission (SEC) has delayed a decision to approve the BlackRock spot Ethereum exchange-traded fund (ETF).","In November, BlackRock filed an application with the SEC for an “iShares Ethereum Trust” and if approved the trust would be listed on NASDAQ.","In January, the SEC approved almost a dozen Bitcoin spot ETFs which has caused a trading frenzy as demand for the products continues to accelerate. One of the eleven Bitcoin spot ETFs approved is the BlackRock iShares Bitcoin Trust trading under the ticker symbol “IBIT.”","So far, the BlackRock IBIT ETF has attracted $10 billion in assets under management (AUM) in just under two months since launching.","","In February, investment firm Franklin Templeton was the latest asset manager to file a spot Ethereum ETF application with the SEC — joining ​​a long list of asset managers such as BlackRock, Fidelity, Grayscale, VanEck, Invesco and Galaxy, as well as Cathy Wood’s Ark Invests and 21Shares, all of which have submitted applications for a spot Ethereum ETF.","","The SEC’s delay indicates a cautious approach towards crypto ETFs as the regulator assesses all risks and regulatory considerations associated with these ETFs. It took over ten years to approve a Bitcoin spot ETF in 2024. Back in July 2013, the Winklevoss twins first filed for a Bitcoin ETF but this was rejected over and over again.","","Ethereum remains the second-largest crypto by market capitalization after Bitcoin. Gas fees on the Ethereum network have soared to levels not seen since March 2023, driven by the growing interest in a new experimental token standard known as ERC-404, reports Hassan Shittu from Cryptonews.","On February 9, Ethereum gas prices soared to an average peak of 70 gwei, equivalent to $60 for a standard transaction. Peak gas costs even reached as high as 377 gwei, a level not seen since May 12, 2023. Several factors have contributed to the heightened gas fees, but the primary catalyst has been the hype surrounding the ERC-404 token standard.\n\n"],"entity":[{"type":"Cathy Wood","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"May 12, 2023","content":"DATE"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$60","content":"MONEY"},{"type":"July 2013","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"March 2023","content":"DATE"},{"type":"BlackRock iShares Bitcoin Trust","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"February 9","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"BlackRock IBIT ETF","content":"ORGANIZATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Winklevoss","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Ethereum","Exchange Traded Funds","Securities Exchange Commission"],"authors":["Tanzeel Akhtar"]}