{"summary":"Is Arweave Going to Zero? AR Price Drops 18.7%, While Traders Are Accumulating This New GambleFi Token","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-arweave-going-to-zero-ar-price-drops-18-5-while-traders-are-accumulating-this-new-gamblefi-token.htm","publishDate":"2024-05-01T13:49:39","id":19981,"type":null,"title":"Is Arweave Going to Zero? AR Price Drops 18.7%, While Traders Are Accumulating This New GambleFi Token","category":["Industry Talk "],"content":["The token for storage coin project Arweave (AR) has shed 18.7% overnight, taking some of the heaviest losses amidst a market-wide crash that has dragged market leader Bitcoin‘s (BTC) price down by 7%.","Arweave currently trades at a price of $27.76, according to CoinGecko. Given the fact it is currently posting 7-day losses of 18.1%, it’s clear the crash only began in the last 24 hours.","According to the token’s trading chart, a major sell-off occurred overnight. AR’s Relative Strength Index (RSI) is currently at 27 with the potential to fall further. RSI is a metric analyzing whether a token is priced well or not based on current buying and selling momentum.","An RSI below 30 is oversold, so it looks like tempestuous waters for the rest of the day. For some, this may be a perfect dip-buying opportunity, but as with any investment, investors should research prudently.","Arweave’s AR is currently trading about $4 south of its 30-day moving average, represented by the blue line. This further underscores the token’s extreme volatility right now.","Although AR is not a blockchain-based token, the Arweave protocol taps a distributed ledger system (DLS) to store data across multiple nodes.","The primary function of Arweave is to be a decentralized data storage solution, matching users who need data storage with those who have a surplus of it to give away.","It’s competitor, Filecoin (FIL), posted lighter overnight losses of around 6% and currently changes hand at $5.33. ","Cryptocurrencies everywhere are tumbling. Bitcoin’s heavy intraday losses put it now at around $57,500, far south of the $60k psychological support level and some 22% down from an all-time high of $73,737.94, posted on March 14 this year. ","Projects like Arweave and Filecoin both underscore the premise that crypto has a lot more to offer the world beyond payments and a store of value.","Today’s market crash may have briefly dimmed their shine, but the world hasn’t seen the last of utility tokens. As developers get more comfortable with the technology, crypto will likely be utilized in ways we can’t imagine yet.","GambleFi is one sector that’s getting more of a look-in nowadays. That’s because it’s a crypto-native Web3 version of online gambling.","According to data compiled by Statista, revenue in the sector market is projected to climb to $100.90 billion this year.","That means investors wanting a head start on Web3’s newest innovations early are more likely to find heady upside potential in tokens attached to crypto-integrated iGaming platforms, like Mega Dice.","The #1 GameFi token has arrived on #SOL 🚀","Join the $DICE presale and be part of the next gem gaming token – $600K already raised! 🚀","Presale link: https:\/\/t.co\/E5WFsXQhfQ 🏆","Why should you consider joining the $DICE presale? 👇 pic.twitter.com\/nTtNHgrqDC","— Mega Dice Casino (@megadice) April 30, 2024","","The Mega Dice ($DICE) presale is barely a fortnight old, and it has already bagged over $600,000 in investments, according to the token’s website.","As the platform’s native token, players can use $DICE to fund games and receive payment. Some games will require the token to play. ","Using $DICE on Mega Dice will have further benefits down the line. The casino plans to integrate the token into its loyalty program, offering more generous rewards to gamers who opt to play with it. The token will also unlock access to exclusive competitions and VIP experiences.","The team has also indicated there will be a buyback and burn program. This means Mega Dice will periodically buy some of the tokens and remove them from circulation to help keep them scarce and drive value.","Keep up to date with Mega Dice news over on X\/Twitter and Telegram.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"$73,737.94","content":"MONEY"},{"type":"18.1%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"last 24 hours","content":"DATE"},{"type":"18.7%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$100.90 billion","content":"MONEY"},{"type":"$600,000","content":"MONEY"},{"type":"$5.33","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"$27.76","content":"MONEY"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"$DICE","content":"MONEY"},{"type":"$4","content":"MONEY"},{"type":"March 14 this year","content":"DATE"},{"type":"$60k","content":"MONEY"},{"type":"Statista","content":"LOCATION"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"$600K","content":"MONEY"},{"type":"VIP","content":"ORGANIZATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$57,500","content":"MONEY"}],"hashtag":["ar","arweave","Mega Dice"],"authors":["Tim Hakki"]}