{"summary":"Ethereum Name Service Token, ENS, Soars on First Day of Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-name-service-token-ens-soars-on-first-day-of-trading.htm","publishDate":"2021-11-09T15:45:00","id":19986,"type":null,"title":"Ethereum Name Service Token, ENS, Soars on First Day of Trading","category":["Altcoin News "],"content":["Ethereum (ETH)’s decentralized naming system, Ethereum Name Service (ENS), has just launched its highly-anticipated governance token via an airdrop that can be claimed by existing ENS users.","At 14:09 UTC, the ENS token traded at USD 46, up a whopping 156% in less than a day, with the majority of trading taking place on the decentralized exchange Uniswap (UNI), according to CoinGecko.","Judging from the same source, USD 369m worth of ENS tokens have changed hands on the market since the token entered circulation.","“30k addresses have already claimed their airdrop amounting to 25% of the total ENS mass available to claim,” Elias Simos, a protocol specialist at crypto exchange Coinbase, wrote on Twitter today. He added that the market value of the tokens that have been claimed so far has exceeded USD 230m.","1\/ 30k addresses have already claimed their airdrop amounting to 25% of the total $ENS mass available to claim.\n\nTotal market value of what has been claimed thus far is about 230m USD 🤯\n\n👉 https:\/\/t.co\/ZlfS8cRgYY pic.twitter.com\/9kPa6ozMvr","Simos also said that the price of the token now appears to have stabilized “after a jittery start.”","“This might just be one of the most successful token launches we’ve seen ever,” Simos went on to say, while arguing that this is “particularly impressive granted the size of the user base.”","Since the Twitter thread was published, however, both the price and the market capitalization of ENS have continued higher, with data from Dune Analytics indicating a rolling market capitalization of USD 5.2bn as of press time.","According to Ethereum Name Service’s official announcement of the airdrop, users will have until May 4, 2022, to claim their tokens, and all those who make a claim during the first week will also be asked to vote on a proposed constitution for the newly formed ENS DAO (decentralized autonomous organization).","“If you’ve ever owned an ENS name, you’re eligible to receive ENS governance tokens. Head over to claim.ens.domains to claim your tokens and vote on the ENS Constitution,” the announcement said.","The Ethereum Name Service is a system that lets users buy human-readable names with a “.eth” suffix, such as “alice.eth,” that can be tied to, for instance, an Ethereum wallet address.","The airdrop today follows an earlier decision by the project’s team to pass the responsibility of governing the system over to the community, with the team saying at the time that ENS has always been an “open public utility that belongs to the community.”","____","Learn more:\n– Ethereum Name Service to Pass Governance Over to Community, Details ENS Airdrop\n– ENS Integration Lets Users Receive ETH to .com Addresses\n\n– Ethereum Name Service – What’s Human Readable Domain Name Good For?\n– DeFi Experiment: A Loan Issued With Ethereum Domain Name as Collateral\n\n– Handshake Introduces a New Way to Send Your Crypto \n– DeFi Governance Tokens Face Three Challenges"],"entity":[{"type":"Elias Simos","content":"PERSON"},{"type":"May 4, 2022","content":"DATE"},{"type":"$ENS","content":"MONEY"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Ethereum Domain Name as Collateral\n\n– Handshake","content":"ORGANIZATION"},{"type":"Community","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"156%","content":"PERCENT"},{"type":"ENS","content":"ORGANIZATION"}],"hashtag":["Coinbase","DeFi","Ethereum","Market","Uniswap"],"authors":["Fredrik Vold"]}