{"summary":"Taipei Blockchain Week Opens with Vitalik Buterin, Binance’s Richard Teng","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/taipei-blockchain-week-opens-with-vitalik-buterin-binances-richard-teng.htm","publishDate":"2023-12-14T15:52:31","id":19997,"type":null,"title":"Taipei Blockchain Week Opens with Vitalik Buterin, Binance’s Richard Teng","category":["Blockchain News "],"content":["Taipei Blockchain Week kicked off this week with around 2,000 people from the crypto community gathering on Thursday to hear industry players discuss blockchain trends ranging from Llayer 1’s role in Web3’s in 2024 to the future of decentralized finance (DeFi).","The event opened with a keynote speech from the Mayor of Taipei, Chiang Wan-an who welcomed innovation to the city. High-profile guest speakers included Ethereum creator Vitalik Buterin, and Binance’s new CEO Richard Teng who spoke about the importance of regulation in the crypto space.","From a live stream Teng, a former Abu Dhabi regulator who was recently appointed CEO of Binance succeeding Changpeng Zhao (aka CZ),  said he felt “humbled and honoured” to be leading the exchange adding he has seen the user base continue to grow – currently standing at 167 million users.","Speaking about his past role as a regulator he stressed that it is important to support growth as well as manage risk – just focusing on managing risk means the growth dynamic will be overlooked.","“Traditional media still associate crypto and blockchain with scams and illicit funds – but if you look at data issued by the US financial crime office Chainalysis and many other research pieces — the amount of illicit funds going into crypto is 0.02%,” said Teng.","Teng went on to add he remains bullish regarding crypto and with the Bitcoin Halving coming up and “hopefully” with an ETF being approved in the US more institutions will be entering the space.","Buterin spoke at the conference enthusiastically talking through Ethereuam’s pipeline. Ethereum co-founder Buterin has a special relationship with Taiwan having been granted a Taiwan Employment Gold Card – a permit that will allow him to legally reside and work in the country.","Most recently Buterin, who introduced a conceptual architecture called the enshrined Zero-Knowledge Ethereum Virtual Machine (ZK-EVM) to enhance the main chain’s efficiency has blogged, that the proposal of the enshrined ZK-EVM is aimed at integrating advanced cryptographic techniques directly into Ethereum’s main chain. By doing so, it seeks to provide a more secure and efficient verification process for Ethereum transactions. Specifically, it intends to improve and optimize the operation of Layer-2 applications.","With stands full of cakes and freebies, and human sized neon yellow Pikachu’s roaming around the conference centre in Taiwan – it certainly didn’t feel like a bear market. The price of Bitcoin has soared to $42,777, marking a significant 4% increase on Thursday. This rally is buoyed by a wave of optimism following the Federal Reserve’s latest FOMC meeting, which indicated a dovish stance on future rate hikes, and sparked lively discussions on the approval of Bitcoin Spot ETFs, with investment giant BlackRock interpreting the minutes as a ‘green light for investors.’","David Tng, managing director of TZ APAC, which is Asia’s leading Tezos blockchain Incubator told Cryptonews there is an excellent turnout ths year. He said:","“I’ve been very impressed at how Taipei Blockchain Week has grown. The event has gathered leaders and innovators from all walks of the industry, from Layer 1 blockchain entities to startups making a real-world impact”.","Tng who is based in Singapore and flew to Taipie for the event – and sees Taipei Blockchain Week as an excellent opportunity to network explaining that the Taiwanese artists and projects he has met are great symbols of the innovation he is seeing in the region.","“The akaSwap team was one of the startups that really caught my eye with their unique gamification approach they take when building their products,” said Tng.","Day 2 of the event continues tomorrow."," "],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.02%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Chiang Wan","content":"PERSON"},{"type":"Taiwan","content":"LOCATION"},{"type":"Buterin","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"David Tng","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Taipei Blockchain Week","content":"ORGANIZATION"},{"type":"$42,777","content":"MONEY"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Taipei","content":"LOCATION"}],"hashtag":["Binance","Vitalik Buterin"],"authors":["Tanzeel Akhtar"]}