{"summary":"Crypto Exchange VAEX Applies for Virtual Asset Trading Platform License in Hong Kong","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-linked-crypto-exchange-hkvaex-applies-for-virtual-asset-trading-platform-license-in-hong-kong.htm","publishDate":"2023-11-27T10:10:03","id":19998,"type":null,"title":"Crypto Exchange VAEX Applies for Virtual Asset Trading Platform License in Hong Kong","category":["Altcoin News "],"content":["Crypto exchange Hong Kong VAEXC (VAEX) has applied for a virtual asset trading platform license with Hong Kong’s Securities and Futures Commission (SFC). ","According to Hong Kong’s lists of virtual asset trading platforms, VAEX submitted the application on November 25, becoming the latest platform to do so. ","Panthertrade and OKX are two other crypto platforms that have applied for a virtual asset trading platform license so far this month. ","Back in June, Hong Kong implemented its new regulatory framework for crypto last month. ","The new rulebook allows retail investors the ability to trade virtual assets, instead of restricting digital assets trading to professional investors and traders with at least $1 million in bankable assets.","As part of the new regulations, the SFC has also started providing licenses to crypto exchanges. ","OSL and HashKey are the only two virtual asset trading platforms that have seen their licenses approved by the SFC. ","VAEX has applied for the license on behalf of KuCoin.","Due to its close name, it was mistakenly thought to be Binance’s Hong Kong applicant HKVAEX.","According to an October report from The South China Morning Post, HKVAEX, which was established in December 2022 and launched its trading platform in February, was set up by Binance to pursue a crypto licence in Hong Kong.","The report cited three industry insiders close to the company, who spoke on the condition of anonymity because the information is private.","HKVAEX was created as a separate entity in Hong Kong under the company BX Services Limited. ","However, the companies share resources, the people said, and the exchange’s website shows that it is using Binance servers for fetching content.","HKVAEX refuted the allegations, claiming that it operates “an independent virtual asset exchange platform based in Hong Kong.”","“It’s operated by a team of technology and seasoned professionals from the financial services sector, currently preparing to apply for the [Securities and Futures Commission’s virtual asset trading platform] licence.”","The JPEX scandal, regarded as potentially the largest financial fraud in Hong Kong‘s history, has prompted the Hong Kong government to expedite the approval process for cryptocurrency products to promote compliance in the industry.","According to OSL Compliance Exchange, a licensed virtual asset platform, financial technology solution providers have shown interest in the potential benefits of integrating tokenized platforms with banks in the future. ","This integration could leverage the public’s trust in banks, thereby facilitating the growth of the virtual asset industry.","Hu Zhenbang, chief financial officer of OSL, noted that regulatory authorities have expedited product approvals since the JPEX incident. ","He emphasized that non-compliant platforms will face stricter monitoring, preventing them from employing excessive advertising at MTR stations as seen in the past."],"entity":[{"type":"MTR","content":"ORGANIZATION"},{"type":"[Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"The South China Morning Post","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"November 25","content":"DATE"},{"type":"OSL Compliance Exchange","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"Hong Kong’s Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"BX Services Limited","content":"ORGANIZATION"}],"hashtag":["Hong Kong","KuCoin"],"authors":["Ruholamin Haqshanas"]}