{"summary":"Bitfarms Reports Slight Dip in Bitcoin Production for March 2024 Despite Expansion Efforts","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitfarms-reports-dip-bitcoin-production-march-2024.htm","publishDate":"2024-04-01T19:27:45","id":19992,"type":null,"title":"Bitfarms Reports Slight Dip in Bitcoin Production for March 2024 Despite Expansion Efforts","category":["Bitcoin News "],"content":["Leading global Bitcoin mining company Bitfarms Ltd. (BITF) released its monthly production report for March 2024 alongside an update on its ongoing fleet upgrade and expansion efforts On April 1.","While March’s Bitcoin production dipped slightly compared to previous months, the report highlights several positive developments that position the company for future growth.","#Bitfarms Announces March 2024 Production and Operations Update","– Company earns 286 $BTC in March 2024","– Upgrade and expansion plan, targeting 21 EH\/s and 21w\/TH in 2024, underway with T21 deliveries and installations","🔗 Press Release: https:\/\/t.co\/i3rrJbkDCG$BITF… pic.twitter.com\/cUVWhN9yOh","— Bitfarms (@Bitfarms_io) April 1, 2024","","The Bitcoin mining company produced 286 BTC in March, reflecting a decrease of 5% from February and 33% year-over-year. This decline is attributed to a combination of factors, including participation in grid management programs, power plant maintenance in Argentina, temporary downtime for facility upgrades that impacted the average operating hash rate, and overall network difficulty.","Despite the production dip, Bitfarms maintained a strong online hash rate of 6.5 EH\/s at the end of March. Bitfarms also achieved a 2% improvement in average Bitcoin earned per EH\/s compared to February. This indicates that the company’s operations are becoming more efficient at extracting Bitcoin despite the lower hash rate.","“As we enter the Halving, we remain focused on our 2024 transformational fleet upgrade and expansion plan which triples our hashrate to 21 EH\/s, increases our targeted operating capacity by 83% to 440 MW, and improves our fleet efficiency by 38% to 21 w\/TH,” said Chief Mining Officer Ben Gagnon.","The company has been actively pursuing its fleet upgrade and expansion plan to reach 21 EH\/s (exahashes per second) and 21 W\/TH (watts per terahash) in 2024.","In March, Bitfarms reported substantial earnings and expansions in its mining capabilities. The company’s daily earnings averaged around 9.2 BTC, totaling approximately $647,700 based on current prices. Bitfarms’ treasury also saw an increase, with 806 BTC held, equivalent to $56.7 million at the March 31, 2024 price.","💪 Our newest T21 miners have arrived and are now racked up in Farnham$BITF $BTC #BitcoinMining pic.twitter.com\/mKlOLQy4Uy","— Bitfarms (@Bitfarms_io) March 17, 2024","","As part of its regular treasury management process, Bitfarms sold 284 of the 286 BTC earned, generating total proceeds of $19.2 million.\nTo further enhance its mining operations, Bitfarms acquired 1,656 new Bitmain T21 miners, most of which are already operational and contributing to the hash rate.","Additionally, the company exercised a purchase option for 28,000 Bitmain T21 miners and bought 19,280 Bitmain T21 miners, 3,888 Bitmain S21 miners, and 740 Bitmain S21 hydro miners.","#Bitfarms announces the purchase of an additional ~51,900 new miners.","🔗 Press Release: https:\/\/t.co\/PVXf8jODTy$BITF $BTC #BitcoinMining pic.twitter.com\/gROQdl8jPx","— Bitfarms (@Bitfarms_io) March 11, 2024",""," ","“Having confirmed the tremendous performance of our T21 miners currently running, and with Bitcoin prices reaching all-time highs, we acted quickly to secure these miners at attractive prices in advance of anticipated hardware price increases,” said Bitfarms President and CEO Geoff Murphy.","Morphy highlighted that these acquisitions align with Bitfarm’s expansion plan for 2024 – to operate one of the newest and potentially most efficient mining fleets in the industry.","Despite a slight decrease in production figures for March, Bitfarms is continuing to invest in new mining hardware and infrastructure expansion in Paraguay, positioning the company for a major increase in hash rate in the coming months.","A crucial development includes the installation of an 80 MW main transformer at the Paso Pe facility in Paraguay, which will boost power capacity greatly. A shipment of 3,905 Bitmain T21 miners is also en route to further enhance the mining power at this site.","In anticipation of deploying a hydro-powered mining operation, Bitfarms has received 1,920 Bitmain M53S+ Hydro Miners. These miners will be deployed awaiting the arrival of specialized Hydro Containers, expected in mid-April.","🚧👷🏻‍♀️👷🏻 https:\/\/t.co\/LY14anS90c pic.twitter.com\/JXnL78VqCP","— Bitfarms (@Bitfarms_io) March 22, 2024","","To support the development of the Yguazu facility in Paraguay, Bitfarms has secured purchase agreements for all essential equipment with long lead times. This includes large transformers, cabling, and necessary interconnects to seamlessly integrate the new hardware into the existing infrastructure."],"entity":[{"type":"$56.7 million","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"Operations Update","content":"ORGANIZATION"},{"type":"March 31, 2024","content":"DATE"},{"type":"March 11, 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Hydro Containers","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"April 1","content":"DATE"},{"type":"March 17, 2024","content":"DATE"},{"type":"Ben Gagnon","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"April 1, 2024","content":"DATE"},{"type":"Bitfarms","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"mid-April","content":"DATE"},{"type":"33%","content":"PERCENT"},{"type":"Hydro Miners","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"March 22, 2024","content":"DATE"},{"type":"Bitfarms Ltd.","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"March 2024","content":"DATE"},{"type":"Geoff Murphy","content":"PERSON"},{"type":"$647,700","content":"MONEY"},{"type":"Paraguay","content":"LOCATION"},{"type":"$BITF $BTC","content":"MONEY"},{"type":"38%","content":"PERCENT"},{"type":"$19.2 million","content":"MONEY"}],"hashtag":["Bitcoin","Bitcoin Mining","Bitfarms"],"authors":["Hassan Shittu"]}