{"summary":"VanEck’s Gurbacs: Whole Assets More Appealing to Investors than Bitcoin Fractions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vanecks-gurbacs-whole-assets-more-appealing-to-investors-than-bitcoin-fractions.htm","publishDate":"2024-01-08T16:18:33","id":19993,"type":null,"title":"VanEck’s Gurbacs: Whole Assets More Appealing to Investors than Bitcoin Fractions","category":["Bitcoin News "],"content":["Gabor Gurbacs, an adviser at asset manager VanEck, has highlighted the psychological hurdle of unit bias among potential Bitcoin (BTC) investors, saying the desire to own complete units can deter people from entering the market.","In a recent post on X, the VanEck advisor suggested that the introduction of spot Bitcoin exchange-traded funds (ETFs), which some expect will go live as early as this week, could provide a solution to this challenge.","According to Gurbacs, a surprising number of potential investors are still unaware that they can own fractions of a Bitcoin.","And even among those who knew that it’s not necessary to buy a whole coin, there is a preference to own whole assets rather than fractions, he wrote.","“I was surprised that a good number of people didn’t know that one can own a fraction of a Bitcoin, and even more frequently, people didn’t want to own a fraction of a coin,” Gurbacs stated.","I was surprised that a good number of people didn’t know that one can own a fraction of a Bitcoin and even more frequently people didn’t want to own a fraction of a coin.","Owning a full share feels better than owning 0.001 Bitcoin. Seems like a a small thing but it’s a big thing.","— Gabor Gurbacs (@gaborgurbacs) January 6, 2024","","The adviser added that the psychological satisfaction of owning a complete share outweighs the appeal of fractional ownership, characterizing it as a significant factor in investor decision-making.","“Owning a full share feels better than owning 0.001 Bitcoin. Seems like a small thing but it’s a big thing,” Gurbacs said.","While acknowledging that this discussion is not new, Gurbacs stressed the significance of unit bias psychology in shaping market behavior. He also noted that understanding biases is essential for understanding market dynamics.","“Simplistic but unit bias psychology matters a lot. I think about this a lot,” the well-known advisor wrote.","Earlier this month, VanEck’s Gurbacs made headlines when he said that he believes people have overstated the initial impact of a spot Bitcoin ETF.","According to him, only around $100 million should be expected to flow into the ETFs from mostly recycled funds after the Securities and Exchange Commission (SEC) approves an ETF.","Still, he added that the long-term impact remains very bullish, and that people indeed tend to underestimate this.","“Long term, people tend to underestimate the impact of spot Bitcoin ETFs. If history is any guide, gold is worth studying as a parallel,” he said, while sharing a chart of the gold price before and after the first spot gold ETF.","In my view, people tend to overestimate the initial impact of U.S. Bitcoin ETFs. I think maybe a few $100mm flows (mostly recycled) money.","Long term, people tend to underestimate the impact of spot Bitcoin ETFs. If history is any guide, gold is worth studying as a parallel. https:\/\/t.co\/6vvkA9aC09","— Gabor Gurbacs (@gaborgurbacs) December 31, 2023","","VanEck is among the multiple firms that have applied to list a spot Bitcoin ETF in the US.","Among other things, the firm has differentiated itself from other ETF providers by committing to donating 5% of its BTC ETF profits to Bitcoin Core developers at nonprofit organization Brink."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Gurbacs","content":"LOCATION"},{"type":"January 6, 2024","content":"DATE"},{"type":"Gurbacs","content":"PERSON"},{"type":"VanEck","content":"PERSON"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"December 31, 2023","content":"DATE"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Bitcoin","ETF","VanEck"],"authors":["Fredrik Vold"]}