{"summary":"New UK bill allows financial authorities more ability to “seize, freeze and recover” cryptocurrencies.\nThe bill aims to beef up anti-money laundering measures, including company ownership verification. ","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172150\/new-uk-bill-would-increase-law-enforcement-cryptocurrency-powers","publishDate":"2022-09-22T14:14:01","id":200,"type":null,"title":"New UK bill would increase law enforcement cryptocurrency powers","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">A new anti-money laundering bill introduced in the UK today is intended to make it easier for law enforcement to seize digital assets, as part of a broader crackdown on money laundering.&nbsp;<\/span>","\"Domestic and international criminals have for years laundered the proceeds of their crime and corruption by abusing UK company structures, and are increasingly using cryptocurrencies,\" said National Crime Agency Director General Graeme Biggar in a <a href=\"https:\/\/www.gov.uk\/government\/news\/new-crackdown-on-fraud-and-money-laundering-to-protect-uk-economy\" data-v-f87c67ca=\"\">release<\/a> touting the bill. \"These reforms – long awaited and much welcomed – will help us crack down on both.\"","<span data-v-f87c67ca=\"\">After the first reading of the new bill which took place today in the House of Commons, a second reading is anticipated for October 13, the next necessary step for the bill to become law. <\/span>","The effort is part of a broader crackdown on illicitly gained funds and assets parked in the UK, an issue that came to the forefront following Russia's invasion of Ukraine. Russian oligarchs have long lived in and parked assets in the country, which began sanctioning and seizing those assets – including Chelsea Football Club – as part of an effort to punish Russian leadership and cut off financial means to continue the war.&nbsp;","<span data-v-f87c67ca=\"\">In addition to addressing cryptocurrencies, the bill also calls for people registering a company in the UK to verify their identities, and amps up the power in the hands of the national registrar, Companies House, to monitor and crosscheck the legitimacy of companies, an effort to limit the use of shell companies to launder money.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Newly-enthroned King Charles III had <\/span><a href=\"https:\/\/www.gov.uk\/government\/speeches\/queens-speech-2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">promised<\/span><\/a><span data-v-f87c67ca=\"\"> new anti-money laundering measures while delivering the final Queen's Speech, an annual agenda-setting address to Parliament, which he delivered on behalf of his recently deceased mother, Queen Elizabeth II.&nbsp;<\/span>"],"hashtag":[]}