{"summary":"BlackRock made its latest crypto play on Thursday when it launched an ETF with exposure to blockchain and crypto companies for its European customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173669\/blackrock-launches-etf-in-europe-with-blockchain-and-crypto-company-exposure","publishDate":"2022-09-29T08:53:16","id":200,"type":null,"title":"BlackRock launches ETF in Europe with blockchain and crypto company exposure","category":["MARKETS"],"content":["BlackRock just made another move into crypto, this time launching an ETF with exposure to blockchain and crypto companies for its European customers.&nbsp;","The iShares Blockchain Technology UCITS ETF is designed to track the New York Stock Exchange FactSet Global Blockchain Technologies capped index, it said in a release. The index includes 35 companies from around the world and is listed on the Euronext under the ticker BLKC.","The index has 75% exposure to companies with primary business related to blockchain — including crypto miners and exchanges. It has a further 25% exposure to companies supporting the blockchain ecosystem, whether that be payments or semiconductor companies.&nbsp;","\"We believe digital assets and blockchain technologies are going to become increasingly relevant for our clients as use cases develop in scope, scale and complexity. The continued proliferation of blockchain technology underscores its potential across many industries,\" Omar Moufti, product strategist for thematic and sector ETFs at BlackRock, said.","The exposure will give BlackRock clients the opportunity to engage with global companies leading the development of the blockchain ecosystem, he concluded.&nbsp;","The investment manager also <a href=\"https:\/\/www.theblock.co\/post\/162987\/blackrock-launches-private-trust-offering-direct-bitcoin-exposure\" data-v-f87c67ca=\"\">launched<\/a> a private trust offering US-based institutional clients exposure to spot bitcoin in August and <a href=\"https:\/\/www.theblock.co\/post\/167392\/blackrock-taps-krakens-cf-benchmarks-to-power-its-bitcoin-offering-exclusive\" data-v-f87c67ca=\"\">tapped<\/a> Kraken's CF Benchmarks for its<span data-contrast=\"auto\" data-v-f87c67ca=\"\"> index pricing product.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Stock Exchange FactSet Global Blockchain Technologies","content":"ORGANIZATION"},{"type":"Omar Moufti","content":"PERSON"},{"type":"Blockchain Technology UCITS ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Euronext","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["BLACKROCK"],"authors":["Adam Morgan McCarthy","The Block"]}