{"summary":"Asset Manager Susquehanna Has $1.8 Billion Locked In Bitcoin ETFs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/asset-manager-susquehanna-bitcoin-etfs.htm","publishDate":"2024-05-08T00:05:31","id":20009,"type":null,"title":"Asset Manager Susquehanna Has $1.8 Billion Locked In Bitcoin ETFs","category":["Bitcoin News "],"content":["Freshly published SEC filings have uncovered a massive Bitcoin whale holding nine-figure funds spread across multiple U.S. Bitcoin ETF products. According to a May 7 13F-HR filing submitted to the Securities and Exchange Commission (SEC), Susquehanna International Group, LLP (SIG) holds $1.8 billion worth of shares in such products.","Susquehanna is a global trading and investment firm with $438 billion in assets under management. Though its Bitcoin ETF allocation is just a fraction of its total investments, it is a far larger position than any witnessed for Q1 2024 so far.","Susquehanna – a single $438 billion fund – has disclosed a 0.3% position in #Bitcoin.","This will scale to 3% within the next year.","That’s $13.4 billion from ONE entity.","— British HODL ❤️‍🔥🐂❤️‍🔥 (@BritishHodl) May 7, 2024","","The reporting period ended on March 31, when BTC traded for $71,000 at the daily close, compared to $62,200 as of May 7.","Assuming the asset manager’s ETF shareholdings have stayed flat since then, their market value – designed to track BTC’s value – has likely plunged as well.","It represents one of the largest known allocations to Bitcoin ETFs among any asset manager or hedge fund, however – particularly those who use the ETFs as their preferred investment vehicle.","Last quarter marked the first reporting period in which asset managers had access to purchase Bitcoin spot ETFs. Following their approval in January, these ETFs took the crypto market by storm. Over the past few weeks, several firms have revealed their Bitcoin allocations within their mandatory 13F-HR forms.","Susquehanna holds positions in nine Bitcoin spot ETFs, though its largest allocation is with Grayscale, holding $1.092 billion in BTC as of the reporting date. The next largest holding was in Fidelity’s Bitcoin ETF at $83.7 million.","The diversification may seem odd given that most of the ETFs operate identically, with most even using the same custodian – Coinbase – to manage their funds. In fact, Grayscale is more costly than any Bitcoin ETF provider, charging roughly 6X the annual fee of its competition.","Susquehanna also holds positions in several Bitcoin futures and leveraged futures ETFs, such as over $400 million in the ProShares Bitcoin Strategy ETF. Additionally, it contains over $8.5 million in the Valkyrie Bitcoin Mining ETF."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"ProShares Bitcoin Strategy ETF","content":"ORGANIZATION"},{"type":"$71,000","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$8.5 million","content":"MONEY"},{"type":"0.3%","content":"PERCENT"},{"type":"$1.092 billion","content":"MONEY"},{"type":"Susquehanna International Group","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$438 billion","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"May 7","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"LLP","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"March 31","content":"DATE"},{"type":"Valkyrie Bitcoin Mining ETF","content":"ORGANIZATION"},{"type":"$83.7 million","content":"MONEY"},{"type":"$62,200","content":"MONEY"},{"type":"$13.4 billion","content":"MONEY"},{"type":"May 7, 2024","content":"DATE"}],"hashtag":["Bitcoin","Bitcoin ETF"],"authors":["Andrew Throuvalas"]}