{"summary":"This Is How BitMEX Juggled Private Keys Amid Crackdown","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/this-is-how-bitmex-juggled-private-keys-amid-crackdown-7996.htm","publishDate":"2020-10-14T18:00:00","id":20002,"type":null,"title":"This Is How BitMEX Juggled Private Keys Amid Crackdown","category":["Bitcoin News "],"content":["Major crypto derivatives exchange BitMEX avoided solvency problems and managed to process all of its users’ withdrawals on time to remain solvent and in operation after a recent crackdown by the United States legal system. So how did the custodian managed the fallout?","As reported, BitMEX founders Arthur Hayes, Samuel Reed, and Ben Delo were charged with running an unregistered trading platform and multiple Bank Secrecy Act violations on October 1. Samuel Reed was arrested on the same day but later released on a USD 5m appearance bond. After the indictment, the platform has seen a substantial drop in both open interest and balances held in its custody, and all three founders have stepped down from all executive management responsibilities at BitMEX’s parent company 100x Group.","As per the latest State of the Network issue by crypto intelligence firm Coin Metrics, BitMEX uses a 3-of-4 keys multisignature address for the cold storage of its customer funds, and the withdrawals are processed around 1 PM UTC on a daily basis. Three keys are owned by its three founders, while one so-called “vanity key” is generated to sign outgoing transactions. As such, only 2-of-3 signatures are needed for withdrawals from the platform.","Knowing this, Coin Metrics said it was able to make an “educated guess” about the withdrawals after the crackdown. Note that BitMEX made four additional withdrawal batches between October 1 and 2.","Presumably, the key A belonged to Samuel Reed, as it didn’t sign on October 1, when he was in custody. The red dates mark additional off-schedule withdrawals that were made to reassure the BitMEX users.","“The fact that all three founder keys have signed following the publication of the filings is reassuring for traders with funds on BitMEX. Had Mr Reed not been released on bail, any incapacitation of any of the two remaining founders could have meant a freeze of all the funds on the platform,” stated the report.","According to the analysis, it remains unknown “whether the founder keys have already changed ownership since the publication of the fillings”, but “the fact that all three original founders stepped down from their executive roles” may indicate that such transition has already happened.","BitMEX is yet to respond to our earlier request for comment on the matter.","Meanwhile, the derivatives exchange has lost approximately 4% of its market share, while its competitors have risen in popularity.","Regardless, it is unlikely that market regulators will stop its crackdown with BitMEX, as more unregistered exchanges are likely to be indicted in the near future, which might lead to solvency problems at other crypto custodians, the report concluded.","“As many precedents, like Mt. Gox or QuadrigaCX, show, it is just a question of time until the arrest or death of crypto custodians triggers another solvency problem,” they said.","As the old adage goes – “not your keys, not your coins.”\n___\nLearn more:\nSEC Commissioner Hester Peirce on BitMEX, DeFi & Token Safe Harbor\nBitMEX Case Might Prompt a Closer Regulatory Look into DeFi\nKuCoin Hack Shows Key Difference Between Altcoins and Bitcoin\nUS Banks Offering Crypto Custody is ‘Insanely’ Bullish and Risky"],"entity":[{"type":"Coin Metrics","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"100x Group","content":"ORGANIZATION"},{"type":"KuCoin Hack Shows Key Difference Between Altcoins","content":"ORGANIZATION"},{"type":"October 1","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Samuel Reed","content":"PERSON"},{"type":"Ben Delo","content":"PERSON"},{"type":"4","content":"DATE"},{"type":"3","content":"DATE"},{"type":"DeFi & Token Safe Harbor\nBitMEX Case Might","content":"ORGANIZATION"},{"type":"Reed","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin\nUS Banks Offering Crypto Custody","content":"ORGANIZATION"}],"hashtag":["Bitcoin","BitMEX","Exchange","Security","Trading"],"authors":["Eimantas Žemaitis"]}