{"summary":"The percentage of OFAC-compliant blocks on the Ethereum blockchain has dropped to 27% from 80% in November 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230179\/ethereums-ofac-compliant-blocks-fall-to-27-marking-a-drop-in-protocol-level-censorship","publishDate":"2023-05-10T07:48:16","id":2000,"type":null,"title":"Ethereum&#x27;s OFAC-compliant blocks fall to 27%, marking a drop in potential for censorship","category":["CRYPTO ECOSYSTEMS"],"content":["The percentage of OFAC-compliant Ethereum blocks has taken a significant plunge.","The percentage of blocks created using compliant relays has dropped to a daily rate of 27% from 80% in November 2022, according to data from analysis site mevwatch.info. This decrease reveals a substantial reduction in protocol-level censorship by Ethereum validators relying on the MEV Boost mechanism.","Maximum Extractable Value, or MEV, refers to the maximum value that can be extracted from block production, achieved by strategically reordering transactions within a block. In the Ethereum proof-of-stake blockchain, MEV is facilitated by the open-source software MEV Boost. This software assembles transactions and proposes blocks, relaying them to the block validators.","Validators use such software to help boost their earnings. MEV Boost operates in conjunction with various competing entities that run a type of software known as \"relay software,\" which creates bundles of transactions for dispatch to validators.","&nbsp;In August 2022, a shift occurred when some relay operators, including the largest one at the time, Flashbots, <a href=\"https:\/\/www.theblock.co\/post\/180158\/63-of-ethereum-transaction-blocks-are-now-ofac-compliant\" data-v-f87c67ca=\"\">began filtering specific transactions<\/a> on the network. This change was in response to an action by the Office of Foreign Assets Control (OFAC), which <a href=\"https:\/\/www.theblock.co\/post\/169688\/treasury-says-sanctions-on-tornado-cash-dont-stop-people-from-sharing-code\" data-v-f87c67ca=\"\">sanctioned<\/a> Tornado Cash and several associated Ethereum addresses in August 2022.","<span data-v-f87c67ca=\"\">Daily OFAC Compliant Blocks | Source: mevwatch.info <\/span>","As of November 2022, around 80% of all blocks on the Ethereum network had become OFAC-compliant. This caused delays in the inclusion of blocks related to Tornado Cash transactionsa and the development had significant implications for Ethereum's neutrality as a Layer 1 network, which sparked considerable concerns among its community.","However, the trend appears to have reversed since then. Non-censoring relay operators such as Ultra Sound Money and Agnostic now command over 60% adoption rate among validators, according to data from <a href=\"https:\/\/www.relayscan.io\/\" data-v-f87c67ca=\"\">relayscan<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Extractable Value","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"August 2022","content":"DATE"},{"type":"27%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Ultra Sound Money","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"60%","content":"PERCENT"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}