{"summary":"HKVAEX, Linked to Binance, Withdraws License Application from Hong Kong’s SFC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hkvaex-linked-to-binance-withdraws-license-application-from-hong-kongs-sfc.htm","publishDate":"2024-03-29T13:48:44","id":20003,"type":null,"title":"HKVAEX, Linked to Binance, Withdraws License Application from Hong Kong’s SFC","category":["Blockchain News "],"content":["The crypto exchange HKVAEX, linked to the world’s largest crypto exchange, Binance, has withdrawn its virtual asset trading platform license application from the Hong Kong Securities and Futures Commission (SFC) post-deadline.","The Hong Kong securities regulator asked crypto exchanges and firms to apply for the license before the deadline of February 29.","The Virtual Asset Trading Platform (VATP) is a license provided by the government of Hong Kong that allows crypto exchanges to operate within the region’s bounds.","Although the license has been available for several years now, only two exchanges—HashKey and OSL—currently possess one. HashKey secured its approval in November 2022, with its competitor getting the nod a month later in December 2022. Several applicants have been on the waitlist for a while, including HKVAEX, linked with Binance, until yesterday, when the firm withdrew its application.","HKVAEX, which reportedly shares technical and other resources with Binance, according to Chinese state media SCMP, submitted its application on January 4. However, the exchange appears to be missing from the list of companies whose license applications are on Hong Kong’s SFC website, which confirms that HKVAEX withdrew its license application nearly three months after the filing. ","Notably, the SFC publicly maintains a list of crypto platforms that will receive operational licenses to raise public awareness of safe crypto trading.","The reasons behind the withdrawal are unclear. Some believe it may be due to a request to change the audit company, insufficient materials, or other reasons. ","The Hong Kong SFC stipulates that crypto trading platforms apply for regional operational licenses by February 29, also setting a May 31 deadline for non-compliant exchanges to cease operations. Consequently, HKVAEX must close their businesses in Hong Kong by May 31.","In addition to HKVAEX, three other virtual asset trading platforms withdrew their license applications in 2024, although the reasons remain undisclosed. This includes Huobi, a prominent global crypto exchange.","In February, HTX, formerly known as Huobi, withdrew its license application in Hong Kong and then resubmitted it. HTX initially submitted the exchange license application in early February, only to withdraw three days later on February 23, citing the Securities and Futures Commission’s list of license applicants. The company, however, resubmitted the application on February 27, according to the SFC’s website.","Unlike its neighbouring Chinese mainland’s broader crypto trading and mining crackdown, Hong Kong rolled out the welcome mat for crypto firms last year. In June 2023, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services. Many global exchanges have applied for the retail trading licenses.","According to its website, the financial regulator is officially reviewing applications from 19 crypto firms, including OKX, Bybit, Bullish, and Crypto.com. The SFC urged investors to verify trading platforms using its public register of licensed persons and registered institutions and the list of licensed virtual asset trading platforms for relevant information on licensed entities, including their official websites."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"February 27","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"February 23","content":"DATE"},{"type":"January 4","content":"DATE"},{"type":"Hong Kong SFC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"February 29","content":"DATE"},{"type":"Bybit","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"SCMP","content":"ORGANIZATION"},{"type":"May 31","content":"DATE"},{"type":"Huobi","content":"LOCATION"},{"type":"November 2022","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Huobi","content":"PERSON"},{"type":"Hong Kong Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Binance","HKVAEX","Hong Kong"],"authors":["Hassan Shittu"]}