{"summary":"CME kicked off trading of its bitcoin option on Monday\nThe launch comes after the ICE-owned Bakkt launched its own option product in early December\nIn one day, CME surpassed Bakkt’s reported volumes: $2.19M vs. $1.15M.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52891\/cme-tops-bakkts-reported-bitcoin-options-volumes-in-one-day","publishDate":"2020-01-13T17:46:08","id":2000,"type":null,"title":"CME tops Bakkt&#x27;s reported bitcoin options volumes in one day","category":["Bitcoin"],"content":["Chicago-based derivatives exchange CME Group kicked off trading for its bitcoin option on Monday by trouncing its rival, the Intercontinental Exchange-owned Bakkt.&nbsp;","CME Group has traded 55 contracts, worth about 275 bitcoin or $2.1M, in its new bitcoin option, according to a spokeswoman.&nbsp;","The launch of the product followed Bakkt's bitcoin options roll-out, which has been less successful on a relative basis. Bakkt has traded slightly more than $1 million of bitcoin for its options contract since its December 9 launch. Bakkt has not yet reported its volumes for Monday.&nbsp;","","","Tim McCourt, managing director at CME Group, told The Block in a phone interview he was satisfied with the first day of trading, noting a balance between smaller on-screen trades and block trades. He also said feedback from market participants was \"great.\"","\"In terms of their ability to quote the market, consume the data, all technical aspects,\" he said. \"Everything worked as designed.\"&nbsp;","Still, it's early days for the market and it's likely anyone's game to win at this point. Market observers will remember that CME's crosstown rival, Cboe Global Markets, was first to launch bitcoin futures in December 2017, but ultimately announced they would stop offering the <a href=\"https:\/\/www.cnbc.com\/2019\/03\/18\/cboe-to-stop-listing-bitcoin-futures-as-interest-in-crypto-trading-cools.html\" data-v-f87c67ca=\"\">product<\/a>.&nbsp;","Elsewhere, crypto-native firms have seen even more success in the roll-out of options compared to U.S.-regulated venues. FTX saw 2,000 options traded on the firm's first day of offering the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52800\/binance-backed-derivatives-exchange-ftx-launches-bitcoin-options\" data-v-f87c67ca=\"\">bitcoin-tied product<\/a>, cofounder Sam Bankman-Fried told The Block in a phone interview.&nbsp;","Bankman-Fried described it as the firm's \"most active product launch, maybe, ever.\"","Indeed, these developments illustrate the emergence of a more robust and competitive exchange-listed derivatives market, which up until this point has been dominated by firms like BitMEX and Deribit.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:<\/strong>&nbsp;This report has been updated to clarify that Cboe launched bitcoin futures in December 2017.<\/em>"],"hashtag":[]}