{"summary":"The CFTC has warned users against a new roster of unregistered foreign firms offering trading in forex and crypto options.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157605\/cftc-flags-34-crypto-and-forex-trading-desks-as-unregistered-foreign-entities","publishDate":"2022-07-14T12:58:20","id":2001,"type":null,"title":"CFTC flags 34 crypto and forex trading desks as unregistered foreign entities","category":["THE BLOCK"],"content":["The Commodity Futures Trading Commission&nbsp; (CFTC) has expanded its RED List with a new roster of crypto and forex firms the agency has identified as unregistered foreign entities.&nbsp;","The CFTC <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8555-22?utm_source=govdelivery\" data-v-f87c67ca=\"\">announced<\/a> the 34 new additions on July 14, warning US users and financial service providers against accessing their services.&nbsp;","Several of the entities announced share domain names or have domains that redirect to the same website. Others have websites that are themselves not live, including fx-cryptex.com and directcryptos.com.&nbsp;","In a statement, Commissioner Kristin Johnson said:&nbsp;","\"In today’s global markets a foreign entity operating outside the United States may—with a few taps on a smartphone—reach potential US customers through email, text message, IM, chat app, or social media, and solicit them to invest, transfer, or deposit funds, or otherwise transact via platforms created and maintained outside of the United States.\"","The firms make a total of 202 on the commission's <a href=\"https:\/\/www.cftc.gov\/LearnAndProtect\/Resources\/Check\/redlist.htm\" data-v-f87c67ca=\"\">Registration Deficient List<\/a>, an initiative launched in 2015 to flag foreign entities the CFTC suspects of acting as intermediaries within the US. Today's announcement explains: \"The Commodity Exchange Act generally requires intermediaries in the derivatives industry to register with the CFTC. An 'intermediary' is a person or firm that acts on behalf of another person in connection with trading futures, swaps, or options.\"","The CFTC has been working to persuade <a href=\"https:\/\/www.theblock.co\/post\/153898\/the-future-of-digital-asset-regulation-the-cftc-says-congressional-committee\" data-v-f87c67ca=\"\">Congress to give<\/a> it more authority to regulate spot crypto markets. Although the commission has a registration regime for derivatives trading, it only has authorization to intervene in cash markets in the event of fraud or market manipulation.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"July 14","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Commodity Futures Trading Commission&nbsp; (CFTC","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Kristin Johnson","content":"PERSON"}],"hashtag":["CFTC","DERIVATIVES"],"authors":["Kollen Post","The Block"]}