{"summary":"Gary Gensler Maintains Stance on Crypto Despite SEC’s Spot Bitcoin ETF Approval","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/gary-gensler-maintains-stance-on-crypto-despite-secs-spot-bitcoin-etf-approval.htm","publishDate":"2024-01-11T13:36:38","id":20014,"type":null,"title":"Gary Gensler Maintains Stance on Crypto Despite SEC’s Spot Bitcoin ETF Approval","category":["Bitcoin News "],"content":["Securities and Exchange Commission (SEC) Chair Gary Gensler maintains a cautious stance on crypto despite the recent approval of spot Bitcoin exchange-traded funds (ETFs) by the agency he leads.","In a statement published on the SEC’s website on the same day as the approval, Gensler clarified that the approval of spot Bitcoin ETFs does not signify the SEC’s endorsement of bitcoin or a shift in its broader views on crypto assets.","Judging from the statement, the decision to approve spot Bitcoin ETFs was attributed to changing circumstances and a court ruling that mandated a re-review of Grayscale Investments’ bid for a spot bitcoin ETF.","“Based on these circumstances and those discussed more fully in the approval order, I feel the most sustainable path forward is to approve the listing and trading of these spot bitcoin [exchange-traded product] shares,” Gensler said.","The SEC Chair also emphasized that the approval should not be interpreted as an indication of the SEC’s willingness to approve listing standards for crypto asset securities or its assessment of the compliance of certain crypto asset market participants with federal securities laws.","“As I’ve said in the past, and without prejudging any one crypto asset, the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,” Gensler added.","He further urged investors to remain cautious about the risks associated with Bitcoin and products linked to crypto assets more broadly.","While Gensler highlighted the SEC’s approval of spot Bitcoin ETFs, he emphasized that it did not constitute an endorsement of Bitcoin. What’s more, he reiterated the need for caution due to the “myriad risks associated with bitcoin and products whose value is tied to crypto.”","In other words, Gensler made it clear that the approval is not an indication of the SEC’s broader stance on crypto assets, and the chair stressed the importance of investor vigilance in crypto specifically.","In her own statement that was also published on the SEC’s website, Republican SEC Commissioner Hester Peirce criticized the agency’s past handling of spot Bitcoin ETFs. She suggested that “disproportionate attention” and staff resources were dedicated to blocking such applications over the past decade.","“We squandered a decade of opportunities to do our job. If we had applied the standard we use for other commodity-based ETPs, we could have approved these products years ago, but we refused to do so until a court called our bluff,” Peirce, who is known as ‘crypto mom’ for her crypto-friendly stance, wrote."],"entity":[{"type":"Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"” Peirce","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["ETF","SEC"],"authors":["Fredrik Vold"]}