{"summary":"Ethereum’s Merge Could Lower Demand for Bitcoin but Regulatory & Technical Challenges Persist","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereums-merge-could-lower-demand-for-bitcoin-but-regulatory-technical-challenges-persist.htm","publishDate":"2022-04-22T17:00:00","id":20016,"type":null,"title":"Ethereum’s Merge Could Lower Demand for Bitcoin but Regulatory & Technical Challenges Persist","category":["Ethereum News "],"content":[" ","Ethereum’s (ETH) transition to proof-of-stake (PoS), known as The Merge, will likely lead some current bitcoin (BTC) holders to move part of their capital to ETH, one industry insider argues. Others, meanwhile, say that despite a yield on ETH being attractive, regulatory scrutiny means more uncertainty lies ahead for ethereum investors.","Once The Merge has been completed, “users will be able to stake and there won’t be any upfront cost,” Kosala Hemachandra, founder and CEO of the popular ETH wallet MyEtherWallet, stressed as the main benefit for ETH investors in a comment to Cryptonews.com.","Hemachandra said that he believes “a lot of bitcoin holders” will move to ethereum in order to be able to stake their tokens and earn a yield on their investment.","The transition of the Ethereum network to the proof-of-stake consensus mechanism comes at a time when more and more institutional investors are getting involved in the crypto landscape, with most so far getting exposure only to BTC.","However, with increasing pressure from groups claiming that Bitcoin’s proof-of-work (PoW) consensus mechanism uses too much energy and is therefore not environmentally friendly, virtue-signaling financial institutions may be getting more interested in Ethereum.","It’s worth noting that no firm timeline for Ethereum’s transition to PoS is known to the public. The best estimates for when The Merge will happen are therefore based on comments from leading developers on the project, pointing to completion in the second half of 2022 or early 2023.","Estimates for when the highly anticipated Ethereum Merge will happen have been pushed back a number of times in the past, and the event was until recently expected to occur sometime between May and June this year.","Despite the unclear timeline, MyEtherWallet’s Hemachandra said he is certain that ETH will become more popular among investors seeking a yield.","“ETH will definitely become more attractive and lucrative as it will be the largest blockchain to offer staking solutions and attractive returns,” Hemachandra said, stating that Bitcoin “will always have a role in the blockchain ecosystem.”","Meanwhile, according to Ben Caselin, head of research & strategy at crypto exchange AAX, The Merge could make ETH be seen as “superior” to BTC in the eyes of a certain group of investors “when framed with an ESG [Environmental, Social, and Governance] perspective.”","However, Caselin added that this narrative could easily change, and said that “institutional preferences could change” as the understanding of Bitcoin and PoW grows.","An important thing to note about ETH’s transition to a yield-generating asset is how regulators will look at it, Caselin said. In the US, the Securities and Exchange Commission (SEC) has already communicated that it is not too keen on yield or interest-bearing products, and this has negatively affected platforms like BlockFi and Celsius (CEL), according to Caselin.","The regulatory uncertainty around ETH’s future could thus scare some potential investors away, and in particular institutions with large amounts of capital to allocate.","As a result of this, bitcoin – as arguably the most decentralized cryptocurrency – could stand to benefit regardless of whether The Merge succeeds or not from a technical standpoint, Caselin said.","“[C]ontinuing to accumulate [BTC] during these years might actually be the best way forward. Because despite what everyone believes – or hopes – bitcoin and the wider crypto markets often defy expectations,” Caselin told Cryptonews.com.","ETH could “indeed climb to USD 10,000 or above by this year’s end, but it is unlikely to get there without [BTC] at least topping USD 120,000,” Caselin added, while noting that BTC and ETH “still move in relative unison, until one day, they don’t.”","At 14:02 UTC on Friday, BTC was trading at USD 40,293, down almost 6% in a day and up over 1% in a week. ETH dropped over 5% in a day and was almost unchanged in a week, trading at USD 2,993. \n____","Learn more:\n– ‘PoS Fanatics Attacking PoW are Actual Supervillains’, Kraken’s Powell Says as US Politicians Charge \n– Ethereum Devs Call Mainnet Shadow Fork a ‘Huge Success’, Propose Fixes for Bugs\n\n– Ethereum Staking Sees Accelerating Growth Ahead of Merge\n– Top Narratives About Ethereum and Its Merge with Its Proof-of-Stake Beacon Chain\n– Buterin Claims Ethereum Simplicity is Still Possible, as Developers Warn of Increasing Complexity\n\n– Bitcoin Maintains Dominance Despite Massive Proliferation of Altcoins\n– After Mozilla Abandoned PoW Cryptos Citing Energy Concerns, Wikipedia May Follow","– The Ethereum Economy is a House of Cards\n– Why Ethereum is Far From ‘Ultrasound Money’"],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Kosala Hemachandra","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"ESG [Environmental","content":"ORGANIZATION"},{"type":"The Ethereum Economy","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Ethereum Staking Sees Accelerating Growth Ahead of Merge\n– Top Narratives About Ethereum","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Hemachandra","content":"PERSON"},{"type":"second half of 2022","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Wikipedia May Follow","content":"ORGANIZATION"},{"type":"June this year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"US Politicians Charge \n– Ethereum Devs Call Mainnet Shadow Fork","content":"ORGANIZATION"},{"type":"House of Cards\n– Why Ethereum","content":"ORGANIZATION"},{"type":"Caselin","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Stake Beacon Chain\n– Buterin Claims Ethereum Simplicity","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Developers Warn of Increasing Complexity\n\n– Bitcoin Maintains Dominance Despite Massive Proliferation of Altcoins\n– After Mozilla Abandoned PoW Cryptos Citing Energy Concerns","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Ben Caselin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Ethereum","Forecast","Proof-of-stake","Proof-of-work","Regulation"],"authors":["Fredrik Vold"]}