{"summary":"Darknet Drug Operations Hit as Feds Move to Seize $54 Million in Crypto Crime Bust","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/darknet-drug-operations-hit-as-feds-move-to-seize-54-million-in-crypto-crime-bust.htm","publishDate":"2023-11-03T20:21:35","id":20023,"type":null,"title":"Darknet Drug Operations Hit as Feds Move to Seize $54 Million in Crypto Crime Bust","category":["News "],"content":["The U.S. Department of Justice announced on Thursday the seizure of 30,000 Ether (ETH), valued at over $54 million, that had allegedly been used for illegal narcotics distribution in New Jersey. The assets were traced back to Christopher Castelluzzo, who was involved in narcotics operations on darknet markets from 2013 to 2015.","The case first began in 2010 when Castelluzzo started his drug distribution business. It was not until 2013 that he transitioned to using Bitcoin on darknet markets for his narcotic transactions, however.","According to the DOJ statement, Castelluzzo initially acquired the 30,000 ETH during its ICO in July 2014. He purchased the ETH using 15 BTC derived from his illegal narcotics operations. At the time, the ETH was only worth about $9,000. Its value has since skyrocketed to over $54 million as Ethereum’s price has surged.","In addition to the Ethereum, Castelluzzo also obtained 30,000 Ethereum Classic in 2016. He then used these funds to acquire various other cryptocurrencies in an attempt to launder his illicit profits. The scheme was ultimately foiled when Castelluzzo was arrested and incarcerated in 2015 for his role in the drug distribution ring.","While in prison, Castelluzzo tried to launder the 30,000 ETH he had purchased back in 2014. According to the Justice Department, his plan was uncovered after intercepted recorded prison telephone calls from 2021 revealed the details. Authorities were able to seize the funds before they could be laundered.","","U.S. Attorney Philip R. Sellinger emphasized that the civil forfeiture action seeks to recover millions in crypto allegedly stemming from drug sales.","“Whether it’s as simple as bags of cash or as sophisticated as cryptocurrency, we will take the steps necessary to seize financial gains defendants obtain from criminal activity,” he stated.","FBI Special Agent James E. Dennehy, who oversees the case, noted that this serves as a warning to criminals that the government will hold them accountable and is committed to seizing illicit funds – whether in cash or crypto.","The Castelluzzo case illustrates how law enforcement is cracking down on the use of cryptocurrencies to obscure illegal activities and launder money. While crypto provides increased anonymity compared to traditional finance, it does not completely shield criminals from prosecution.","The seizure of $54 million in Ethereum highlights the growing trend of using cryptocurrencies within organized crime. Darknet marketplaces peddling illicit goods and services have increasingly shifted to only accepting crypto payments over the past decade. Bitcoin became the standard for these transactions due to its pseudonymous nature compared to traditional payment methods.","However, other privacy-focused cryptocurrencies like Monero have since emerged as preferred options on darknet markets and within criminal circles. Monero utilizes novel cryptographic techniques to obscure transaction details, making it very difficult to trace or attribute payments.","Holding monero will be a crime in less than 5 years","— Dr. Van Nostrand (@DoctorNostrand) October 28, 2023","","Cryptocurrency analytics firm Chainalysis estimates that last year criminal activity accounted for $20.6 billion worth of cryptocurrency transaction volume. While the figure represents a small percentage of total transaction volume, it still indicates a substantial level of crypto usage in illegal activities — especially given that criminals are likely using privacy coins to obscure even more transactions.","Criminals have developed complex techniques to layer, mix, and launder cryptocurrency associated with illicit activities. Centralized exchanges with loose know-your-customer (KYC) requirements are one avenue for off-ramping crypto into fiat currency. Over-the-counter brokers and peer-to-peer sites are also used to trade crypto for cash while avoiding regulated exchanges.","Another common tactic is employing mixing or tumbling services to obfuscate transaction trails. These services pool together crypto funds from multiple users and mix them before sending the funds back to different addresses. Analytics firms have become adept at unmasking many mixing techniques, however.","The Castelluzzo case demonstrates the Justice Department’s growing ability to identify and seize criminally-linked cryptocurrencies. But as crypto regulations are strengthened worldwide, some experts believe criminals will increasingly rely on decentralized platforms and protocols to launder funds."],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"James E. Dennehy","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Monero","content":"PERSON"},{"type":"$20.6 billion","content":"MONEY"},{"type":"$54 million","content":"MONEY"},{"type":"Castelluzzo","content":"PERSON"},{"type":"July 2014","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"October 28, 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"$9,000","content":"MONEY"},{"type":"Philip R. Sellinger","content":"PERSON"},{"type":"Christopher Castelluzzo","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Monero"],"authors":["Trent Alan"]}