{"summary":"A U.S. court ruled that the trading of certain crypto assets on secondary markets are securities transactions.\nThe ruling comes in an insider-trading case against former Coinbase product manager Ishan Wahi, brother Nikhil Wahi and friend Sameer Ramani.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280336\/crypto-assets-secondary-markets-securities","publishDate":"2024-03-04T02:42:13","id":2002,"type":null,"title":"Trading certain crypto assets on secondary markets are securities transactions, US court rules","category":["Legal"],"content":["A court in the United States has ruled that the trading of certain crypto assets on secondary markets, such as crypto exchanges, are securities transactions — a position in opposition to that taken by Coinbase and the wider crypto industry.","The ruling comes in an <a href=\"https:\/\/www.theblock.co\/post\/159239\/crypto-firms-could-face-fallout-from-sec-insider-trading-case-against-former-coinbase-employee\" data-v-f87c67ca=\"\">insider-trading case<\/a> against former Coinbase product manager <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">Ishan Wahi<\/a>, brother Nikhil Wahi and friend Sameer Ramani.","“Each issuer continued to make such representation regarding the profitability of their tokens even as the tokens were traded on secondary markets,\" the ruling reads, <a href=\"https:\/\/www.courtlistener.com\/docket\/63887980\/119\/securities-and-exchange-commission-v-wahi\/\" data-v-f87c67ca=\"\">stating<\/a>: \"Thus, under Howey, all of the crypto assets that Ramani purchased and traded were investment contracts.”","The statement from the court is a default judgment — which is provided when a defendant does not appear in court or fails to respond to a summons. The filing noted that “Ramani appears to have fled the country to avoid criminal prosecution for the actions alleged in this case.\"","Ramani has been prohibited from future violations and must pay a civil penalty for twice the amount of the gains he is calculated to have made. The SEC sought to impose prejudgement interest, as well, but this request was denied by the court.","The U.S. Securities and Exchange Commission settled with both Wahis last May. The agency notably <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/three-charged-first-ever-cryptocurrency-insider-trading-tipping-scheme\" data-v-f87c67ca=\"\">referred<\/a> to the case as the \"first-ever cryptocurrency insider trading tipping scheme.\""],"hashtag":["COINBASE","COURT HEARINGS","SEC"]}