{"summary":"Happy Bitcoin Pizza Day: This is How “Toppings” Changed in 10 Years","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/happy-bitcoin-pizza-day-this-is-how-toppings-changed-in-10-y-6624.htm","publishDate":"2020-05-22T14:12:00","id":20027,"type":null,"title":"Happy Bitcoin Pizza Day: This is How “Toppings” Changed in 10 Years","category":["Bitcoin News "],"content":["Between the event that’ll live on as Bitcoin Pizza Day ten years ago and today, the world’s first cryptocurrency, Bitcoin (BTC), saw it’s network metrics increase by six, eight, even fifteen digits.","Happy Bitcoin Pizza Day, Cryptoverse! For those who are new to this event, today we celebrate one man’s first crypto purchase – he bought pizza with a mind-boggling amount of bitcoin. On this faithful day in 2010, programmer Laszlo Hanyecz paid a Bitcoin talk forum user for two Papa John’s pizzas with BTC 10,000. At that time, this was worth some USD 25, but today we’re talking about more than USD 90 million! And Hanyecz was never allowed to forget it.","It wasn’t possible (or it was?) to predict at the time what road BTC would take. Now in 2020, looking back over the past ten years, we are able to see an enormous growth for this network, protocol and asset class, based on numbers alone, not to even venture into discussions on mainstream adoption, higher institutional interest, many regulator’s and authorities’ shifting and more favorable stances, better crypto education, etc. – all of which have contributed to the rise in the coin’s network metrics, which then leads to more adoption, and so on.","To see how Bitcoin changed over time from its first pizza day, we took a look at its progression from 2010 until today and we discovered that:","Bitcoin price chart","Here are more details on individual network metrics (starting with the first available 90-day moving average data):","Source: Bitinfocharts.com\n___","Here’s the change in searches for “bitcoin” on Google.","And here are several Bitcoin Pizza Day slices served by the Cryptoverse. Happy celebration!","{no_ads}"],"entity":[{"type":"Bitcoin Pizza Day","content":"ORGANIZATION"},{"type":"Papa John","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"today","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"USD 25","content":"DATE"},{"type":"USD 90 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Hanyecz","content":"PERSON"},{"type":"Laszlo Hanyecz","content":"PERSON"}],"hashtag":["Bitcoin","Community"],"authors":["Sead Fadilpašić"]}