{"summary":"Binance Working on Bitcoin Lightning Network Integration for Deposits and Withdrawals","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-working-bitcoin-lightning-network-integration-for-deposits-withdrawals.htm","publishDate":"2023-06-20T08:59:00","id":20030,"type":null,"title":"Binance Working on Bitcoin Lightning Network Integration for Deposits and Withdrawals","category":["Bitcoin News "],"content":["Binance crypto exchange is working to enable the Bitcoin Lightning Network, designed to make Bitcoin (BTC) transactions faster and cheaper. ","“Binance is working to integrate the Bitcoin Lightning Network for deposits and withdrawals,” the world’s largest cryptocurrency exchange said in a Tuesday tweet. ","The move comes as the exchange had pledged to add support for the Bitcoin Lightning Network in early May after it experienced issues due to the sheer volume of pending transactions.","At the time, Binance had to halt withdrawals to deal with the backlog.","#Binance is working to integrate the #Bitcoin Lightning Network for deposits and withdrawals.\n\nSome eagle-eyed users spotted our new lightning nodes recently. Yes – that's us!\n\nHowever, there's still more tech work to be done. We'll update once Lightning is fully integrated. https:\/\/t.co\/N0oN8561sN","The Lightning Network is a layer-2 protocol built on Bitcoin that addresses scalability issues. It allows for faster and cheaper transactions by creating a network of payment channels between participants.","The Bitcoin Lightning Network offers almost unlimited scalability in terms of transactions per second (TPS) as there is no upper bound. ","A single channel within the network has the capability to process more than 250 TPS, and there is no restriction on the number of channels that can be added to the network, allowing for further scalability and increased transaction capacity.","Fundamentally, the Lightning Network lets users engage in multiple off-chain transactions, with only initial and final wallet balances being written into the Bitcoin blockchain. ","This approach significantly increases the network’s throughput and decreases transaction fees. It also adds another layer of user security and anonymity.","Payments firm Strike, which leverages Bitcoin’s Lightning Network to provide a faster, cheaper, and more accessible alternative to traditional money transfer providers, has expanded its “Send Globally” service to Mexico.","The service allows users to send funds internationally, providing a convenient solution for cross-border transactions.","“At Strike, we believe that everyone should have equal access to better payments and financial stability,” Strike CEO and founder Jack Mallers said. ","“We’re excited to bring fast, low-cost cross-border payments via the Lightning Network to Mexico, enabling more people to send money home.”","Since its launch in December 2022, Strike’s Send Globally has expanded to over a dozen countries, including the Philippines, Vietnam, and Nigeria, among others, which are among the top 10 largest cross-border markets.","It is worth noting that Twitter also uses Strike to allow users to send and receive Bitcoin “tips” via the Lightning Network. ","However, the Bitcoin Lightening Network is yet to find mainstream adoption.","According to data by DefiLlama, the Lightning Network’s total liquidity is less than 0.5% that of Ether locked in DeFi contracts. "],"entity":[{"type":"Vietnam","content":"LOCATION"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Mexico","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Philippines","content":"LOCATION"},{"type":"Bitcoin’s Lightning Network","content":"ORGANIZATION"},{"type":"Jack Mallers","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"Bitcoin Lightening Network","content":"ORGANIZATION"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["Binance","Bitcoin","Lightning Network"],"authors":["Ruholamin Haqshanas"]}