{"summary":"Bitcoin and Altcoins Recovering After Binance Hack Drama","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-altcoins-recovering-after-binance-hack-drama-3823.htm","publishDate":"2019-05-08T08:58:56","id":20046,"type":null,"title":"Bitcoin and Altcoins Recovering After Binance Hack Drama","category":["Altcoin News "],"content":["Bitcoin price traded to a new 2019 high above USD 6,000 and later corrected lower. Ethereum price tested the USD 165 support and ripple revisited USD 0.300. ABBC coin is up more than 40% and JCT climbed around 16% today.","Yesterday, we discussed the chances of more upsides in bitcoin. BTC\/USD did climb further higher and traded to a new 2019 high above USD 6,000. However, the bulls failed to retain momentum, resulting in a downside correction. More importantly, the bulls struggled to contain losses after Binance reported a major hack. The price declined below USD 5,900 and USD 5,850. Having said that, the impact was very limited and the price jumped back above the USD 5,850 and USD 5,900 levels. Altcoins such as ethereum is down 4% and ripple price is trading just below the USD 0.300 support area.","Total market capitalization","After a major downside correction, bitcoin price found support near the USD 5,750 level and recently bounced back. BTC\/USD jumped back above USD 5,850 and USD 5,900. It is currently (08:10 UTC) trading near USD 5,910 and it seems like there could be another dip towards USD 5,850 before a fresh increase.\nOn the downside, the main supports are USD 5,850, USD 5,825 and USD 5,800. On the upside, a clear break above the USD 5,940 is needed for a push above USD 6,000 and USD 6,020.","Ethereum price declined from the USD 180 resistance and broke the USD 170 support. ETH\/USD tested the USD 165 support and recently recovered above USD 170.\nThe price is still down more than 4%, with an immediate resistance at USD 172. The main resistance is at USD 175, above which the price is likely to retest the key USD 180 resistance area.","Bitcoin cash price failed to clear the USD 298 and USD 300 resistance levels. As a result, there was a downside correction and BCH\/USD traded below the USD 290 support. The price tested the USD 275 support and recently climbed back above USD 280 and USD 282. The bulls are likely to face a strong selling interest near the USD 290 and USD 292 levels.\nEOS retreated after testing the USD 5.00 barrier. The price declined below the USD 4.90 support and tested the USD 4.80 zone. It is currently recovering, but likely to face resistance near USD 4.95.\nRipple price declined and broke the USD 0.302 and USD 0.300 support levels. XRP\/USD even tested the USD 0.296 level and it is currently moving higher. The price could face hurdles near USD 0.302, above which there are chances of a decent run towards USD 0.306.","Despite bearish moves in bitcoin and ethereum, a few small cap altcoins gained more than 8%, including ABBC, JCT, NET, AOA, DGD, TRUE and MXM. Out of these, ABBC is up around 43% and JCT gained nearly 16%.","Overall, bitcoin price corrected lower after testing a crucial resistance near USD 6,000. Binance hack added fuel to the fire, but the bulls are clearly unfazed. Therefore, there are high chances of fresh increase towards USD 5,950 and USD 6,000 in the coming sessions.\n_____",""],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"MXM","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"16%","content":"PERCENT"},{"type":"AOA","content":"ORGANIZATION"},{"type":"USD 0.302","content":"LOCATION"},{"type":"JCT","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Market"],"authors":["Aayush Jindal"]}