{"summary":"Terra Luna Classic Crash to $0.000255? LUNC Price Prediction October","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crash-0000246-lunc-price-prediction-october.htm","publishDate":"2022-09-22T15:10:00","id":20049,"type":null,"title":"Terra Luna Classic Crash to $0.000255? LUNC Price Prediction October","category":["Altcoin News "],"content":["Terra Luna Classic (LUNC) has continued to go lower in price over the last few days. Now trading at just $0.000278 anxious holders are anticipating another move to the downside as the bulls lose momentum. ","Will Terra Luna Classic recover?","Just recently Terra Luna Classic (LUNC) lost a key support level of $0.000283 from a chart pattern known as a bear pennant. ","A bear pennant is known as a bearish pattern which usually results in continuation to the downside. The trend prior to the pennant formation, is usually also down, hence why it is a continuation pattern. ","We have just seen the first phase of the bear pennant play out, which is an aggressive downtrend. The pennant we see now which looks like a symmetrical triangle is the second phase, known as consolidation. ","Traders would be looking for a potential breakout for Terra Luna Classic and are now targeting the key support levels of $0.000264 and $0.000255. ","The technical target of the bear pennant would bring the price of Terra Luna Classic (LUNC) down a total of 33.25% if the above support levels can not be held. ","Bearish chart patterns don’t typically always have to play out by text book. Sometimes we can experience fake outs in the crypto market. Traders with a contrarian mindset might actually be tempted to go long at these particular support levels as the chance of a bullish reversal would become higher. ","Many long-term holders of Terra Luna Classic (LUNC) will also deploy a dollar cost averaging strategy at key support levels and buy the red candles as opposed to green. ","Should Terra Luna Classic (LUNC) lose a key support level of $0.000255 there is a risk that we might see negative continuation down to the $0.000165 price level.","I speculate that LUNC will touch down at $0.000255 which would be an attractive level for buyers to rush in and pump the price back up to around $0.00033, this is where the bulls would have an opportunity to strike back and test for resistances one more time. ","Traders who have been in the crypto markets for a while now will know that Septembers are usually quite rocky for the blockchain markets.","It is extremely rare that September is a fruitful month for Bitcoin and other crypto assets. ","Whilst merely dubious speculation, there is a good chance that the markets could flip bullish as statistically over 75% of Octobers yield positive returns for Bitcoin. ","If you’d like to keep up with my latest LUNC trading calls and a thriving crypto community you can join my official Discord channel. "],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"Terra Luna Classic (LUNC","content":"ORGANIZATION"},{"type":"33.25%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$0.000255","content":"MONEY"},{"type":"75%","content":"PERCENT"},{"type":"$0.000278","content":"MONEY"},{"type":"$0.000283","content":"MONEY"},{"type":"$0.00033","content":"MONEY"},{"type":"$0.000264","content":"MONEY"},{"type":"$0.000165","content":"MONEY"}],"hashtag":["Luna","LUNC"],"authors":["Jacob Bury"]}