{"summary":"$336.3 Million In Crypto Funds Stolen In Q1, $98.8 Million Recovered from March Hacks: PeckShield","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/336-million-in-crypto-funds-stolen-in-q1-98-million-in-stolen-digital-assets-recovered-from-march-hacks-peckshield.htm","publishDate":"2024-04-01T15:21:09","id":20047,"type":null,"title":"$336.3 Million In Crypto Funds Stolen In Q1, $98.8 Million Recovered from March Hacks: PeckShield","category":["DeFi News "],"content":["According to PeckShield’s data, approximately $100 million in stolen crypto funds from hacking incidents in March have been successfully recovered. Despite significant initial losses totaling millions of dollars, 52.8% of the hacked funds were returned to their rightful owners.","PeckShield reported that the majority of the recovered funds stemmed from the Munchables incident, where the hacker returned the stolen cryptocurrency following negotiations.","","#PeckShieldAlert March 2024 witnessed 30+ hacks in the crypto space, resulting in ~$187.29 million in losses, with ~$98.8 million recovered.\nThis marks a decrease of ~48% from February 2024.#Top5 hacks:#Munchables (#Juice affected): $97 million (recovered)#CurioNetwork: $40… pic.twitter.com\/u3zejt9Ygn","— PeckShieldAlert (@PeckShieldAlert) April 1, 2024","","According to a report by web3 cybersecurity firm PeckShield on April 1, the market saw over 30 hacks in the crypto space, resulting in $187.29 million in losses, with $98.8 million recovered. This figure marked a decrease of 48% from February, when hackers stole over $360 million.","Despite declining losses compared to February, March’s figures still exceeded those of January, during which the market encountered $182.5 million in losses.","PeckShield also highlighted the top five incidents during the month. Among the top five incidents highlighted, the Munchables hack ranked as the most significant in terms of losses, followed by the Curio hack, the Prisma Finance breach, the NFPrompt hack, and the WOOFi exploit.","According to the report, most of the recovered funds were from the Munchables incident, a non-fungible token game on the Blast network. On March 26, the project disclosed that it had been exploited, with initial losses estimated at $62 million. However, the hacker later returned the funds without any ransom demands.","On March 27, Munchables identified the hacker as one of its developers. Ultimately, Blast core contributors announced that $97 million in crypto stolen from the incident had been secured.","In a similar version, the Prisma Finance incident, involving approximately $11 million in stolen digital assets, might also see a chance of recovery. Following the hack on March 28, the decentralized finance protocol froze its platform for investigation. The hacker later claimed the incident was a “white hat rescue,” and negotiations between the protocol and the hacker are underway.","On March 24, Curio’s MakerDAO-based smart contract on Ethereum was breached. While initial estimated losses were $16 million, PeckShield suggests it may be closer to $40 million in stolen crypto funds, making it the second-largest loss incident last month.","The fifth-largest incident for the month came from the Binance-backed platform NFPrompt, which experienced unauthorized access, resulting in about $10 million in losses, while the WooFi decentralized exchange suffered losses of approximately $8.5 million.","In the first quarter of 2024, the total amount lost to hacking and fraudulent activities reached approximately $336.3 million, a decrease from $437.5 million in 2023. The report outlines 46 hacking incidents and 15 cases of fraudulent activities during this time.","Two projects suffered significant losses, amounting to $144.5 million, making up 43% of the overall loss. The most significant attack, totaling $81.7 million, targeted the cross-chain bridge protocol Orbit Bridge on New Year’s Eve.","January witnessed the highest monthly losses in Q1, totaling $133 million. The second-largest attack of the quarter involved a $62 million exploit on Munchables. Overall, $73.9 million (22%) of the stolen funds from seven exploits in Q1 were successfully retrieved. The number of attacks decreased by 17.6%, from 74 in Q1 2023 to 61 in 2024.","Hacking incidents also dominated the losses, accounting for 95.6% ($321.6 million) across 46 incidents, while fraudulent activities, scams, and rug pulls made up 4.4% ($14.7 million) in 15 incidents.","Notably, Ethereum was the most targeted blockchain, followed by the BNB Chain, with both networks accounting for 73% of the total losses. Ethereum experienced the highest number of attacks, with 33 incidents constituting 51% of the total losses.","On the other hand, BNB Chain encountered 12 attacks, representing 22% of the exploited funds. Additional incidents occurred on Arbitrum, Solana, Optimism, Bitcoin, Blast, Polygon, Conflux Network, and Base."],"entity":[{"type":"$11 million","content":"MONEY"},{"type":"$321.6 million","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$8.5 million","content":"MONEY"},{"type":"February 2024","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$14.7 million","content":"MONEY"},{"type":"95.6%","content":"PERCENT"},{"type":"$40","content":"MONEY"},{"type":"April 1","content":"DATE"},{"type":"first quarter of 2024","content":"DATE"},{"type":"$187.29 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"April 1, 2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$62 million","content":"MONEY"},{"type":"73%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$182.5 million","content":"MONEY"},{"type":"March 2024","content":"DATE"},{"type":"52.8%","content":"PERCENT"},{"type":"$98.8 million","content":"MONEY"},{"type":"$97 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"$437.5 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"$16 million","content":"MONEY"},{"type":"$336.3 million","content":"MONEY"},{"type":"$81.7 million","content":"MONEY"},{"type":"17.6%","content":"PERCENT"},{"type":"$40 million","content":"MONEY"},{"type":"$360 million","content":"MONEY"},{"type":"March 28","content":"DATE"},{"type":"March 27","content":"DATE"},{"type":"March 26","content":"DATE"},{"type":"$144.5 million","content":"MONEY"},{"type":"March 24","content":"DATE"},{"type":"$73.9 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Prisma Finance","content":"ORGANIZATION"},{"type":"4.4%","content":"PERCENT"},{"type":"43%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"48%","content":"PERCENT"},{"type":"$133 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crypto hack","Hacks","PeckShield"],"authors":["Hassan Shittu"]}