{"summary":"Bitcoin Whales Bought The Dip, Netting 47,000 BTC In 24 Hours","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-whales-bought-the-dip-netting-47000-btc-in-24-hours.htm","publishDate":"2024-05-03T22:22:24","id":20043,"type":null,"title":"Bitcoin Whales Bought The Dip, Netting 47,000 BTC In 24 Hours","category":["Bitcoin News "],"content":["While many market segments panic-sold their Bitcoin (BTC) this week, the digital currency’s largest whales seem to have bought the dip with size.","According to data provided by CryptoQuant CEO Ki Young Ju, active Bitcoin whale addresses accumulated 47,000 BTC within 24 hours following Bitcoin’s slide this week below $57,000 per coin.","An active whale address is defined as owning at least 100 BTC, and having engaged in on-chain activity within the past day. Young Ju said the balances discount centralized exchanges and Bitcoin miners, but include certain Bitcoin custodians such as Bitcoin ETF providers.","“We’re entering a new era,” Young Ju wrote to Twitter regarding the data. Though whale balances have significantly increased since Bitcoin spot ETFs were approved in the United States this year, the executive says this week’s balance spike was “not ETF related.”","#Bitcoin whales accumulated 47K $BTC in the past 24 hours. We're entering a new era. pic.twitter.com\/SXgzToN8GU","— Ki Young Ju (@ki_young_ju) May 3, 2024","","A day prior, Young Ju highlighted how new Bitcoin whales, including spot ETF buyers, went underwater on their investments after Bitcoin plunged under $60,800.","Similarly, analysis from lead Glassnode analyst James Check found that Bitcoin’s broader short-term holder cost basis as of Wednesday was $59,600. Statistically, short-term holders are more likely to panic sell their holdings once their cost basis is lost, exacerbating price volatility at the time.","Regardless, Check also said that the dip was of a standard size seen in typical Bitcoin bull markets, and predicted it would make a good time to buy. As of Friday, Bitcoin has surged back to $62,700, proving profitable for anyone who followed his advice.","According to analyst TXMCtrades, the increased whale address balance may actually not represent whales accumulating coins, but instead show “innocuous wallet management flow” among larger entities.","“There are hundreds\/thousands of unidentified on-chain entities with big footprints, but people who don’t look at this data all day will be encouraged to leap to wild conclusions,” he wrote to Twitter on Friday.","Bitcoin ETF data shows that the Grayscale Bitcoin Trust (GBTC) had net inflows on Friday for the first time since launching as a Bitcoin spot ETF, possibly signaling the first strong inflow day for Bitcoin ETFs at large in almost a month."],"entity":[{"type":"$57,000","content":"MONEY"},{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$60,800","content":"MONEY"},{"type":"Ju","content":"PERSON"},{"type":"CryptoQuant CEO Ki Young Ju","content":"ORGANIZATION"},{"type":"James Check","content":"ORGANIZATION"},{"type":"$62,700","content":"MONEY"},{"type":"Young Ju","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"May 3, 2024","content":"DATE"},{"type":"$BTC","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"” Young Ju","content":"ORGANIZATION"},{"type":"$59,600","content":"MONEY"}],"hashtag":["Bitcoin","Bitcoin Whale"],"authors":["Andrew Throuvalas"]}