{"summary":"A third member of Sam Bankman-Fried’s inner circle has turned on him.\nNishad Singh, a co-founder of FTX, pleaded guilty to criminal charges and agreed to cooperate with prosecutors.\nSingh could help prosecutors prove Bankman-Fried had criminal intent when he allegedly mishandled customer funds at FTX and Alameda Research, experts say.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216250\/the-noose-is-tightening-sam-bankman-frieds-inner-circle-turns-on-him","publishDate":"2023-03-01T15:25:21","id":2005,"type":null,"title":"‘The noose is tightening’: Sam Bankman-Fried’s inner circle turns on him","category":["Policy"],"content":["A third member of FTX founder Sam Bankman-Fried's inner circle pleaded guilty to criminal charges, significantly upping the legal peril for the embattled former CEO.","Former FTX Director of Engineering Nishad Singh pleaded guilty to six counts on Tuesday, including wire fraud, commodities and securities fraud, money laundering and unlawful political donations.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","He may not be the last person to turn on Bankman-Fried, legal experts say.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The noose is tightening around Samuel Bankman-Fried,” said Anthony Sabino, a law professor at St. John’s University. “This is yet another executive, and a fairly high-placed one it appears, who has agreed to plead guilty and testify against SBF.”","Singh, a co-founder of FTX and close confidant of Sam Bankman-Fried, has also agreed to cooperate with the Justice Department’s criminal investigation. He follows former Alameda Research CEO Caroline Ellison and FTX co-founder Gary Wang. Each pleaded guilty in December to crimes linked to the crypto behemoth.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs the pool of potential witnesses grows, new details are revealed in court filings and Bankman-Fried faces new charges, he himself could consider a plea deal with prosecutors. But few see cooperating with the Justice Department as a get-out-of-jail-free card for him at this point in time.&nbsp;<\/span>","“Everyone who is pleading guilty represents the lineup of witnesses who will testify against him,” said Jacob Frenkel, an attorney at Dickinson Wright who previously served as senior counsel in the Securities and Exchange Commission's Division of Enforcement. “His protestations about expecting to be successful at trial ring hollow when his inner circle is lining up to enter guilty pleas.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","This latest development in the FTX criminal case has some legal experts wondering if other executives who were close to Bankman-Fried may try to cut deals with prosecutors. U.S. Attorney for the Southern District of New York Damian Williams issued a stark warning to those who participated in wrongdoing at FTX or Alameda Research to “come see us before we come see you” at a press conference in December.","“This is the classic strategy used by prosecutors since the dawn of time,” Sabino said. “You go after the little fish, who gets you the medium-sized fish, who gets you the big fish.”","Bankman-Fried, whose crypto empire was once valued at $32 billion, has pleaded not guilty to criminal charges and could face decades in jail if he is convicted. A spokesperson declined to comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The former billionaire is accused of mishandling FTX customer assets to prop up his trading firm, Alameda Research, along with making illegal political donations and other crimes.&nbsp;","Days before Singh pleaded guilty, Bankman-Fried was hit with a superseding indictment that held four new charges, including bank fraud. The court filing included new details about Bankman-Fried’s alleged political donations scheme, which included references two unnamed co-conspirators who took hefty loans from Alameda Research and gave money to political groups on either side of the aisle.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Singh, who was not named as a co-conspirator in any court documents, gave millions to political causes during the 2022 campaign cycle. He was charged this week with conspiracy to make unlawful political contributions and defraud the Federal Election Commission.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","It’s not clear whether another plea deal from a Bankman-Fried lieutenant could be in the works. Dan Friedberg, the former FTX compliance chief, has <a href=\"https:\/\/www.reuters.com\/business\/finance\/ftxs-former-top-lawyer-aided-us-authorities-bankman-fried-case-2023-01-05\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">reportedly<\/span><\/a> spoken with prosecutors investigating FTX.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Former FTX Digital Markets Co-CEO Ryan Salame, who gave millions to Republicans during the 2022 midterm cycle, did not comment. FTX US General Counsel Ryne Miller declined to comment via his lawyer. Bankman-Fried has been accused by prosecutors of contacting an FTX lawyer, who is also a potential witness in the case, via an encrypted app. Court documents did not disclose the name of employee whom Bankman-Fried contacted, but a judge amended his terms of bail to prevent him from future contact without outside lawyers present. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Others close to Bankman-Fried may feel more pressure to talk with prosecutors now that Ellison, Wang and Singh have pleaded guilty, Sabino said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“They've already pled guilty. They've made a deal. That leaves less room for these folks to make a deal,” Sabino said. “If they want to keep themselves out of prison for the rest of their lives, they better be moving fast and having some serious hard-knock discussions with the government at this point about the parameters of a plea deal.”","Singh’s cooperation could be key for prosecutors working to prove criminal intent when Bankman-Fried goes to trial in October.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“When Nishad pled guilty, he admitted that going back to mid-2022, he knew that FTX was improperly loaning funds to Alameda. This is really a key point because the prosecutors, in their case against Bankman-Fried, they have to prove criminal intent and that Bankman-Fried deliberately was breaking the law,” said Robert Heim, a partner at the law firm Tarter Krinsky<span class=\"s3\" data-v-f87c67ca=\"\"> &amp; Drogin.<\/span> Heim added that prosecutors now have a cooperator in Singh that can corroborate that he, and possibly Bankman-Fried, knew that investor funds were being diverted to Alameda.","<span class=\"s4\" data-v-f87c67ca=\"\">Prosecutors have been strategic in making plea deals, Heim added, receiving<\/span> cooperation from insiders at both FTX and Alameda Research, the two companies where client funds were allegedly commingled and mishandled.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> Though civil charges filed by U.S. markets regulators on Tuesday, with bifurcated settlements from Singh to the charges, went further in shedding light as to how little separation there may have been between the two companies.&nbsp;<\/span>","The SEC charged the 27-year-old with defrauding investors, saying the former director of engineering at FTX created a software code that allowed FTX customer funds to go to Alameda Research. The regulator also said Singh was told by Bankman-Fried to “falsely characterize” millions in revenue and move funds in order to reach a $1 billion annual revenue goal. Singh also lied to auditors about those transfers, the agency said.","Singh consented to a “bifurcated settlement” regarding the SEC charges, which awaits a court’s approval.","At this point experts say, given the witnesses that prosecutors have now, even if Bankman-Fried decides to cooperate it's not clear prosecutors would go easy on him.","“Bankman-Fried is the poster boy for criminal misconduct in the crypto space. So part of what the prosecutors want to do here is send a very strong message of deterrence to other people,” Heim said. “When it comes to plea negotiations, it comes down to how severe the prison sentence is going to be.”","There’s also no guarantee that prosecutors would even accept a plea deal.","“The government can very well turn around and say, 'No, we're not interested. You know why? Because we don't need you to plead. We've got you cold, we’re going to put you on trial and we’re basically going to crucify you,” Sabino said.","For his part, Bankman-Fried hasn't presented the image of someone who might cooperate with law enforcement. Prosecutors have urged the federal judge presiding over his criminal case to curtail Bankman-Fried’s internet access after he used Signal to contact a former employee and potential witness. They also raised concerns over his use of a virtual private network, which Bankman-Fried's lawyers claim was necessary to watch the Super Bowl.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The judge presiding over the case has agreed to temporarily limit some of Bankman-Fried's contact with former employees, and use of private messaging apps, before making a formal decision on limiting internet access. <\/span>","Despite the scrutiny of his internet use, days after his last court appearance Bankman-Fried followed a Twitter fan page for the infamous Ponzi schemer Bernie Madoff titled “@MadoffOnlyFans,” an account that has since been deactivated.&nbsp;","“It's hard to believe that he is not taking it seriously. But he clearly is trying to project the image that he's not worried,” Frenkel said. “That is a false facade.”","<em data-v-f87c67ca=\"\">Sarah Wynn contributed reporting.<\/em>"],"hashtag":["FTX","LAWSUITS","SAM BANKMAN-FRIED"]}