{"summary":"Just In: Billionaire Michael Saylor Purchases a Further $593 Million in Bitcoin – Total Holdings Now Exceeding $6 Billion","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/just-in-billionaire-michael-saylor-purchases-a-further-593-million-in-bitcoin-total-holdings-now-exceeding-5-billion.htm","publishDate":"2023-11-30T14:16:36","id":20059,"type":null,"title":"Just In: Billionaire Michael Saylor Purchases a Further $593 Million in Bitcoin – Total Holdings Now Exceeding $6 Billion","category":["Bitcoin News "],"content":["Michael Saylor, billionaire CEO of enterprise analytics firm MicroStrategy, has once again demonstrated his unwavering commitment to Bitcoin by purchasing an additional $593 million worth of the cryptocurrency.","In a tweet posted on November 30, Saylor revealed that MicroStrategy acquired 16,130 Bitcoins at an average price of $36,785 per coin. This brings the company’s total Bitcoin holdings to 174,530 BTC purchased for approximately $5.28 billion at an average price of $30,252 per Bitcoin.","MicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11\/29\/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https:\/\/t.co\/3XHhpIvsuA","— Michael Saylor⚡️ (@saylor) November 30, 2023","","With this latest purchase, MicroStrategy has further expanded its position as the single largest institutional holder of Bitcoin. The company now holds over 0.83% of the maximum 21 million Bitcoins that will ever exist.","No other publicly traded company comes close to MicroStrategy’s Bitcoin allocation. The next biggest corporate holder, Marathon Digital, has amassed just 13,726 BTC worth about $517 million at current prices.","Saylor has frequently explained his ultra bullish case for Bitcoin on Twitter, in interviews, and at conferences. He believes BTC will enjoy growing adoption as a hard asset like gold and will continue appreciating in value over the long term as more institutions and nation states accumulate holdings.","#Bitcoin is Forever. pic.twitter.com\/0eM3oWZ4WL","— Michael Saylor⚡️ (@saylor) November 29, 2023","","Many experts think approval of a spot Bitcoin exchange-traded fund (ETF) in the U.S. could be the next catalyst to spur major Wall Street inflows into BTC and propel prices higher.","There are currently multiple Bitcoin ETF applications pending before the Securities and Exchange Commission. The SEC has rejected filings in the past, but recent developments suggest the regulatory agency may be warming up to finally approve a spot Bitcoin ETF.","The SEC is now in talks with Grayscale about potentially converting the Grayscale Bitcoin Trust into an ETF product. This is being interpreted as a hugely positive sign by the cryptocurrency community.","The prospect of an imminent Bitcoin spot ETF approval, combined with Bitcoin’s inherent scarcity and increasing real-world utility, has ignited bullish sentiment over the past few weeks.","As market optimism grows, Michael Saylor and MicroStrategy have once again expanded their Bitcoin treasury while prices are still perceived to be low. With their holdings now exceeding $6 billion in value, they stand well positioned to benefit from any future appreciation in the price of Bitcoin."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"$30,252","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$36,785","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$593 million","content":"MONEY"},{"type":"$MSTR","content":"MONEY"},{"type":"0.83%","content":"PERCENT"},{"type":"November 29, 2023","content":"DATE"},{"type":"November 30, 2023","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$517 million","content":"MONEY"},{"type":"$6 billion","content":"MONEY"},{"type":"November 30","content":"DATE"},{"type":"11\/29\/23","content":"DATE"},{"type":"$5.28 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"$593.3 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Michael Saylor","MicroStrategy"],"authors":["Trent Alan"]}