{"summary":"South Korea to Make Temporary Crypto Investigative Unit Permanent","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korea-to-make-temporary-crypto-investigative-unit-permanent-report.htm","publishDate":"2024-04-29T13:15:13","id":20053,"type":null,"title":"South Korea to Make Temporary Crypto Investigative Unit Permanent","category":["Blockchain News "],"content":["Local media reports that South Korea is taking decisive measures to combat the surge in cryptocurrency-related crimes and fraud cases by moving to establish its temporary virtual asset investigative unit as a permanent entity.","This move comes amidst a surge in suspicious transaction reports from crypto companies. Over 16,000 reports were received last year, representing a 49% increase from the previous year.","According to a local report, South Korea is considering promoting its temporary crypto crime investigative unit, the Virtual Asset Joint Investigation Team, into a permanent department. ","In response to an ongoing trial of South Korea’s altcoin issuer arrested on fraud charges, the Ministry of Justice and the prosecution are advocating for formally establishing the Virtual Asset Joint Investigation Team to enhance investigative capabilities. Notably, the Justice Ministry and the Ministry of the Interior and Safety are scheduled to commence discussions in early May regarding the elevation of the unit to an official department.","Currently operating under the Seoul Southern District Prosecutor’s Office as a temporary body, the unit faces the risk of dissolution. According to the report, elevating its status is anticipated to enhance efficiency. This will be done through the appointment of new prosecutors and improved budget allocation.","The Virtual Asset Joint Investigation Team, inaugurated on July 26, 2023, is tasked with investigating coin-related crimes. It comprises around 30 investigative experts from seven different organizations, including the prosecution and financial authorities. This team collaborates with various crucial entities in virtual asset crime investigations.","Despite the commendable progress achieved by the unit, concerns about its temporary status could lead to its potential abolishment. Past cases, like the abolition of the Southern District Prosecutors’ Office’s Securities Crime Joint Investigation Team in January 2020, highlight the need for a formalized investigative organization to ensure balanced communication and cooperation with relevant entities.","South Korea witnessed a notable increase in crypto-related criminal activities, as indicated by South Korea’s Financial Intelligence Unit.","According to a February report by South Korea’s Financial Intelligence Unit, local crypto companies reported 16,076 suspicious transactions in 2023, a 49% increase from 2022. Over the five years from 2017 to 2022, the financial damage inflicted by virtual asset-related crimes exceeded 5.3 trillion won.","South Korea is set to introduce stricter regulations for token listing on exchanges, including the blocking of tokens that have been hacked.","Click here to learn more 👇https:\/\/t.co\/HySBMSNX4C","— Cryptonews.com (@cryptonews) April 5, 2024","","To safeguard investors, South Korea is set to implement its first comprehensive crypto regulation on July 19. The new regulation introduces stricter criminal penalties for market manipulation in the crypto sector. This regulation includes the possibility of life sentences in certain cases or significant fines for violators involved in such crimes.","Mr. Han, the CEO of a virtual asset issuer, has been accused of collaborating with a professional market manipulation business named ‘John Berkim’ to allegedly defraud investors of 21.6 billion won. He is now facing trial after being handed over on the 5th. In December 2020, Mr. Han launched and listed ‘Grape’, a coin without any utility. The coin allegedly caused significant losses to numerous investors through tactics such as market manipulation.","The Grape coin fraud case is just one example of the increasing number of virtual asset crimes. With virtual assets gaining popularity as a new investment avenue, related crimes and the extent of damage are escalating rapidly. "],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Southern District Prosecutors’ Office’s Securities Crime Joint Investigation Team","content":"ORGANIZATION"},{"type":"the Ministry of Justice","content":"ORGANIZATION"},{"type":"January 2020","content":"DATE"},{"type":"five years from 2017 to 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"South Korea’s Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"the Justice Ministry","content":"ORGANIZATION"},{"type":"April 5, 2024","content":"DATE"},{"type":"December 2020","content":"DATE"},{"type":"Virtual Asset Joint Investigation Team","content":"ORGANIZATION"},{"type":"Seoul Southern District Prosecutor’s Office","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"July 19","content":"DATE"},{"type":"July 26, 2023","content":"DATE"},{"type":"Han","content":"PERSON"},{"type":"John Berkim’","content":"PERSON"}],"hashtag":["Crypto fraud","South Korea"],"authors":["Hassan Shittu"]}