{"summary":"Billionaire Tim Draper’s Endorsement Skyrockets Stacks Token by 25%","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/billionaire-tim-drapers-endorsement-skyrockets-stacks-token-by-25.htm","publishDate":"2023-12-21T10:55:08","id":20056,"type":null,"title":"Billionaire Tim Draper’s Endorsement Skyrockets Stacks Token by 25%","category":["Bitcoin News "],"content":["Stacks (STX), the native token of the Bitcoin layer 2 solution Stacks Network, surged by 25% for the day on Wednesday following positive remarks from renowned investor Tim Draper.","The boost in the token’s price came as Draper expressed his excitement about Stacks in a recent interview on the popular YouTube channel CoinBureau, citing his interest in projects that aim to bring “important applications” to Bitcoin.","“I think that’s a really interesting trend, and we’re thinking it’s going to go the way Microsoft did,” Draper said about the efforts to bring more decentralized applications (dApps) to Bitcoin.","","Stacks is a layer 2 network specifically designed to bring smart contracts – traditionally used on platforms like Ethereum and Solana – to Bitcoin.","Unlike other Bitcoin layer 2 networks and sidechains such as Lightning and Liquid, the Stacks Network has its own native token, a move that has attracted criticism from some Bitcoin maximalists.","Tim Draper, a well-known American venture capitalist, has previously predicted that Bitcoin would reach $250,000 by 2025, and his positive sentiments toward Stacks thus appear to align with his broader outlook on the potential of Bitcoin.","Stacks has seen a notable rise in prominence throughout the year, particularly with the emergence of Ordinals, a form of NFTs on the Bitcoin blockchain.","The total capital locked on the Stacks platform has seen a substantial increase, rising from just $7 million at the beginning of 2023 to over $57 million as of this writing, per data from tracking site DefiLlama.","Meanwhile, the price of the network’s native STX token has also risen substantially.","Starting the year at $0.21, Stacks is currently trading at $1.49, reaching its highest level since March 2022, according to data from CoinGecko.",""],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"2025","content":"DATE"},{"type":"$57 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"” Draper","content":"PERSON"},{"type":"$7 million","content":"MONEY"},{"type":"Stacks Network","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Draper","content":"PERSON"},{"type":"$1.49","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"Tim Draper","content":"PERSON"},{"type":"$0.21","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin"],"authors":["Fredrik Vold"]}