{"summary":"Brazilian Senate OKs ‘15% Crypto Tax Rate’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazilian-senate-oks-15-crypto-tax-rate.htm","publishDate":"2023-12-01T05:00:28","id":20067,"type":null,"title":"Brazilian Senate OKs ‘15% Crypto Tax Rate’","category":["Blockchain News "],"content":["Brazilian senators have voted in favor of a bill that proposes taxing crypto tax profits earned on overseas crypto platforms at a fixed rate of 15%.","Per the parliamentary website and a report from Brazil’s Livecoins, lawmakers “seriously amended” the bill to ensure no loopholes were included.","Should the bill become law, users of international crypto exchanges such as Binance, Coinbase, and Kucoin will need to declare their earnings.","The law is slated to come into force on January 1, 2024. It will require Brazilian crypto investors to declare these gains “separately from other income and capital gains.”","Some more active crypto traders will breathe a sigh of relief, however.","The amended bill replaces an initial proposal for a “sliding scale”-type structure.","Under this proposal, those earning less than $1,200 from crypto trading on overseas platforms would have been exempt from taxation.","But crypto traders earning over $10,140 per year would have faced tax bills of over 22%.","Livecoins quoted Ana Paula Rabello, an accountant specializing in crypto, as saying the bill includes a clause that classifies crypto wallets as “overseas financial applications.”","This bill stipulates that the Special Secretariat of the Federal Revenue of Brazil – the country’s tax service – will be given regulatory powers.","The amended bill also includes a clause that requires all companies that have a presence in Brazil and handle crypto to “provide periodic reports on their activities and their customers.”","This will apply to all firms active in the nation, no matter where they are headquartered.","The firms will have to submit their reports to the Federal Revenue Service and another financial watchdog, the Financial Activities Control Council.","🇧🇷 Crypto Exchange OKX Officially Debuts in Brazil, Offers Trading With Advanced Features","Crypto platform @okx announced its official launch in Brazil, offering users advanced crypto features, including trading and staking rewards.#CryptoNews #Brazilhttps:\/\/t.co\/MHycRrqvN4","— Cryptonews.com (@cryptonews) November 28, 2023","","Ismael Decol, the legal head of Declare Cripto, explained that the law also contains “no provisions” for traders who want to write off their losses.","However, Decol claimed that “the Federal Revenue Service, the Central Bank, and other regulatory bodies” still needed to “fill in the gaps and provide further clarification.”","He noted that failure to do so would prevent the legislation from “becoming clearer to users and investors.”","Unless lawmakers raise additional objections to the bill, it will be passed to the President’s office.","The President will then have 15 working days to decide whether to approve or veto the bill.","In September, the nation’s Central Bank announced it would tighten the regulations governing crypto exchanges."],"entity":[{"type":"Ana Paula Rabello","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Decol","content":"PERSON"},{"type":"Ismael Decol","content":"PERSON"},{"type":"Financial Activities Control Council","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"January 1, 2024","content":"DATE"},{"type":"November 28, 2023","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"Federal Revenue of Brazil","content":"ORGANIZATION"},{"type":"$1,200","content":"MONEY"},{"type":"Kucoin","content":"PERSON"},{"type":"Federal Revenue Service","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Offers Trading With Advanced Features","content":"ORGANIZATION"},{"type":"Crypto Exchange","content":"ORGANIZATION"},{"type":"$10,140","content":"MONEY"}],"hashtag":["Brazil","Tax"],"authors":["Tim Alper"]}