{"summary":"Crypto Exchange OKX Officially Debuts in Australia","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-okx-officially-debuts-in-australia.htm","publishDate":"2024-05-14T06:01:59","id":20063,"type":null,"title":"Crypto Exchange OKX Officially Debuts in Australia","category":["Altcoin News "],"content":["OKX, a world-leading digital asset exchange, has officially launched its operations in Australia, a year after it established an office in Sydney in May 2023.","Announced Tuesday, the launch would enable spot trading for all users and derivatives trading for verified wholesale clients in Australia.","The move arrives months after the exchange’s subsidiary received in-principle approval for a payments license to operate in Singapore. The exchange also launched its operations in Turkey, this February.","Adding on to its expansion spree, OKX’s Australian launch aims to provide trusted, compliant, and transparent gateway to crypto trading and decentralized finance (DeFi).","“As part of our long-term commitment to the Australian market, we look forward to continuing to improve our offering to better serve the local crypto community,” the exchange wrote on X.","As part of our long-term commitment to the Australian market, we look forward to continuing to improve our offering to better serve the local crypto community.","Read more: https:\/\/t.co\/LHRZ7S77TC","— OKX (@okx) May 14, 2024","","With the launch, OKX claims to be the largest global crypto exchange offering direct AUD deposits and withdrawals to Australians.","As of now, spot trading users have access to 170 crypto spot pairs and a total of 85 tokens including Bitcoin, Ethereum, Solana and Tether, the release added. The OKX’s Australian arm plans to add more tokens in the coming months.","“Australian crypto users deserve a platform that is secure, easy-to-use and responsive to their needs, which include seamless access to banking rails as well as AUD pairs for the most popular cryptocurrencies,” Jamie Kennedy, general manager at OKX Australia, noted.","One of the key reasons for crypto exchanges to choose this smallest continent is due to its crypto-hungry population. According to a survey from Koinly reported that as many as 31.6% of Australians held or had held crypto as of July 2023.","Additionally, crypto ownership in Australia has consistently increased since 2019, in a way that 1 in 4 adults own some type of cryptocurrency.","On the other hand, Australia had intensified scrutiny on crypto exchanges lately, demanding data from 1.2 million accounts. A move to crackdown on users failing to pay their taxes amid a rising interest in crypto tokens.","Further, ASX, the country’s market operator, is eying to approve the first-ever Spot Bitcoin exchange-traded funds (ETFs) by the end of 2024. As a result, this would trigger a surge in Bitcoin investment options among Australian users."," "],"entity":[{"type":"May 14, 2024","content":"DATE"},{"type":"Jamie Kennedy","content":"PERSON"},{"type":"Turkey","content":"LOCATION"},{"type":"ASX","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"Sydney","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"31.6%","content":"PERCENT"},{"type":"Australia","content":"LOCATION"},{"type":"OKX Australia","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"July 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Australia","OKX","Spot trading"],"authors":["Sujha Sundararajan"]}