{"summary":"The alpha version of the game, which is set to launch next year, will be open to all, though Pudgy NFT and toy owners will get special perks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266882\/pudgy-penguins-announces-pudgy-world-web3-game-on-zksync-blockchain","publishDate":"2023-12-09T21:36:22","id":2006,"type":null,"title":"Pudgy Penguins announces &#x27;Pudgy World&#x27; Web3 game on zkSync blockchain","category":["NFT COLLECTIONS"],"content":["Pudgy Penguins, the popular NFT project, has announced the next stage of the project's development: Pudgy World, a Web3 game powered by Ethereum Layer 2 network zkSync Era, that the company describes as an \"immersive, digital environment.\"&nbsp;","Pudgy Penguins's announcement comes at a time of particular success for the project. The floor price of its NFTs has nearly doubled in the past two weeks, according to data from <a href=\"https:\/\/opensea.io\/collection\/pudgypenguins\/analytics\" data-v-f87c67ca=\"\">Opensea<\/a>, and the brand recently launched toys in 2,000 Walmart stores across the country — a bit fewer than half of over 4,000 branches in the United States.&nbsp;","Pudgy World's alpha will be open to all gamers, though Pudgy NFT holders and Pudgy Toy buyers will be able to claim unique perks inside the game's virtual world. Details on gameplay are currently scarce, though the company describes two \"hero characters,\" Pudgy and Peaches, that will \"guide players through the adventures that await them.\" Both characters feature in the game's animated <a href=\"https:\/\/x.com\/pudgypenguins\/status\/1733672528453705819?s=20\" data-v-f87c67ca=\"\">launch trailer<\/a>.&nbsp;","NFT holders will also benefit from others buying products related to the game's ecosystem through royalties, the company announced. Notably, the project's original founders proposed creating a metaverse game, but were <a href=\"https:\/\/www.theblock.co\/post\/252987\/walmart-pudgy-penguins-nft-toys\" data-v-f87c67ca=\"\">ousted<\/a> after the Pudgy Penguins community decided they hadn't kept their promises.&nbsp;","As for zkSync, Pudgy Penguins chose the Layer 2 network \"because it was the first zkEVM and fastest proof system in production to scale Ethereum to a million developers and a billion users,\" according to the company. \"zkSync...is the only chain able to advocate for and bolster the success of Pudgy World and the Pudgy community as they introduce blockchain technology to the next generation of mobile gamers.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Pudgy NFT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Opensea","content":"LOCATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["PUDGY PENGUINS"],"authors":["Zack Abrams","The Block"]}