{"summary":"Record $1.1 Trillion in Crypto Exchange Volume Driven by Spot Bitcoin ETF Anticipation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/record-1-1-trillion-in-crypto-exchange-volume-driven-by-spot-bitcoin-etf-anticipation.htm","publishDate":"2024-01-03T13:02:21","id":20065,"type":null,"title":"Record $1.1 Trillion in Crypto Exchange Volume Driven by Spot Bitcoin ETF Anticipation","category":["Blockchain News "],"content":["The monthly spot trading volume on crypto exchanges exceeded $1 trillion in December 2023, marking the first time this significant volume level has been surpassed in over a year.","According to data from compiled by The Block, the total exchange volume for the month reached a whopping $1.1 trillion.","The last instance of monthly spot trading volume surpassing the $1 trillion mark occurred in September 2022, with a total volume of $1.03 trillion, the data showed.","The latest figures for December 2023 not only represent a notable resurgence but also set a new monthly record since May 2022 when trading volume peaked at $1.35 trillion.","As usual, the crypto exchange responsible for the most trading volume was Binance, contributing 39.3% of the December’s total volume.","In US dollar terms, Binance’s share of the volume equaled $432.7 billion.","South Korea-based crypto exchange Upbit secured the second position with an 8.3% share, amounting to $91.8 billion, followed closely by OKX at 8%, totaling $87.5 billion.","Binance has long dominated the rankings as the largest spot crypto exchange by trading volume, but has seen its market share drop as regulatory scrutiny of the exchange has intensified.","At the same time, Upbit and OKX have both seen their market share increase.","The surge in trading activity coincides with heightened anticipation surrounding the potential approval of a spot Bitcoin exchange-traded fund (ETF) by the US Securities and Exchange Commission (SEC), potentially as early as January 10."],"entity":[{"type":"8.3%","content":"PERCENT"},{"type":"$91.8 billion","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"May 2022","content":"DATE"},{"type":"$1 trillion mark","content":"MONEY"},{"type":"39.3%","content":"PERCENT"},{"type":"$432.7 billion","content":"MONEY"},{"type":"$87.5 billion","content":"MONEY"},{"type":"$1.1 trillion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"January 10","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"$1 trillion","content":"MONEY"},{"type":"$1.03 trillion","content":"MONEY"},{"type":"$1.35 trillion","content":"MONEY"}],"hashtag":["Binance","OKX","Upbit"],"authors":["Fredrik Vold"]}