{"summary":"Monero Price Suffers 17% Drop on Binance Delisting","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/monero-price-binance-delisting-privacy-coins.htm","publishDate":"2024-02-06T11:39:14","id":20069,"type":null,"title":"Monero Price Suffers 17% Drop on Binance Delisting","category":["Altcoin News "],"content":["Monero‘s price dropped as much as 17% on Tuesday after Binance said it would delist the privacy token from its platform.","Binance delisted four tokens, including Aragon (ANT), Multichain (MULTI), Via (VAI), and Monero (XMR). The decision was a result of a routine assessment of standards and industry changes, the exchange said.","#Binance will delist the following tokens on February 20, 2024.","🔸 $ANT\n🔸 $MULTI\n🔸 $VAI\n🔸 $XMR","Full details here ⬇️https:\/\/t.co\/3YRKqYrb7T","— Binance (@binance) February 6, 2024","","Monero ranks 36th among cryptocurrencies, with a market cap of over $2.5b. It last traded around $140.67 at the time of reporting.","It is a type of privacy coin, or tokens that represent a category of cryptocurrencies engineered toward user privacy and anonymity. These coins incorporate certain privacy-centric features aimed at enhancing anonymity and minimizing traceability. These features make it challenging to work out the sender, recipient, and transaction details.","Monero also employs unique cryptography to guarantee anonymity of its transactions, according to CoinGecko. In an era marked by growing transparency, the appeal of a token like Monero is evident.","Monero and its XMR token were created to enable users to control their online data visibility. It originated from Bytecoin in 2012 and was launched as a fork in July 2014, focusing on anonymity.","Binance’s decision to delist Monero sparked criticism on X, with one user stating: “Monero continues to be one of the best privacy coins on the market.. or off the market now. Binance having to remove it just proves this fact.”","Monero continues to be one of the best privacy coins on the market.. or off the market now. Binance having to remove it just proves this fact. https:\/\/t.co\/Wc9CQr1w9U","— Toby Cunningham (@sircryptotips) February 6, 2024","","Binance is not alone in delisting privacy coins. OKX made a similar move last year, revealing its intention to remove eight privacy-focused coins, including Monero, ZCash, and Dash, citing non-compliance with listing criteria.","Regulatory compliance and user input are typical drivers of such removals,  as privacy coins face greater pressure to adhere to global standards.","Privacy coins have generated inquiries regarding their potential involvement in criminal activities and their legal standing across different nations."],"entity":[{"type":"February 20, 2024","content":"DATE"},{"type":"$2.5","content":"MONEY"},{"type":"February 6, 2024","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"Bytecoin","content":"LOCATION"},{"type":"Toby Cunningham","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Monero","content":"PERSON"},{"type":"$140.67","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"July 2014","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$ANT\n🔸 $MULTI\n🔸 $VAI\n🔸 $XMR","content":"MONEY"}],"hashtag":["Binance","Monero","privacy coins"],"authors":["Shalini Nagarajan"]}