{"summary":"Tether Freezes Tokens of Sanctioned Individuals Listed by OFAC","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-freezes-tokens-of-sanctioned-individuals-listed-by-ofac.htm","publishDate":"2023-12-11T07:17:06","id":20078,"type":null,"title":"Tether Freezes Tokens of Sanctioned Individuals Listed by OFAC","category":["Altcoin News "],"content":["Tether (USDT), the company behind the world’s largest stablecoin, has frozen the wallets of individuals sanctioned by the U.S. Office of Foreign Asset Controls (OFAC). ","In a recent announcement, the company said it aims to prevent potential misuse of its tokens and enhance security measures by aligning with global law enforcement and regulators.","“This strategic decision aligns with our unwavering commitment to maintaining the highest standards of safety for our global ecosystem and expanding our close working relationship with global law enforcement and regulators” Paolo Ardoino, CEO of Tether, said. ","“By executing voluntary wallet address freezing of new additions to the SDN List and freezing previously added addresses, we will be able to further strengthen the positive usage of stablecoin technology and promote a safer stablecoin ecosystem for all users.”","While Tether has previously frozen funds associated with illicit activities, the company had been hesitant to freeze wallets interacting with the sanctioned protocol, Tornado Cash. ","Tether claimed that it had not received any requests from U.S. law enforcement to do so. ","However, following the recent announcement, blockchain records indicate that Tether has blacklisted Tornado Cash’s contract addresses.","According to blockchain data, Tether froze a total of 161 Ethereum wallets, although 150 of these wallets currently hold no USDT tokens. ","It remains unclear whether these wallets previously held USDT tokens or if they were ever involved in any related activities. ","Among the remaining 11 wallets, over 3.5 million USDT tokens are held, with the majority concentrated in a single address holding 3.4 million tokens. ","Notably, this address has been linked to a recent hack of the betting platform Stake.","Of the wallets holding USDT tokens, two addresses contain around 20,000 tokens each, while another holds nearly 60,000 tokens. ","The remaining wallets hold smaller amounts, with one wallet containing just 16 cents worth of frozen USDT. ","Two days prior to the freeze, this particular wallet was used to transfer over 400,000 USDT received from THORChain through two other wallets, making it challenging to trace the funds. ","Interestingly, neither of the routing wallets used in the transaction has been frozen by Tether.","It is worth noting that the wallets may hold USDT tokens on different chains, including Ethereum Layer 2 networks. ","A search on Polygonscan revealed two wallets with USDT tokens on Polygon, but the combined total was just over 10,000 tokens, with one wallet also holding USDT on Ethereum’s mainnet. ","A similar search on Arbitrum and Optimism did not yield any wallets with USDT balances among the sanctioned list.","In May 2023, Tether announced its plans to allocate up to 15% of net realized profits into Bitcoin on an ongoing basis. ","By holding BTC and other assets, Tether aims to protect its reserves from the loss of purchasing power during prolonged cryptocurrency market downturns.","Courtesy of the recent surge in prices, Tether’s Bitcoin holdings have gained around 85%, or $1.1 billion, since their acquisition."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"16 cents","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"},{"type":"U.S. Office of Foreign Asset Controls (OFAC","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"85%","content":"PERCENT"}],"hashtag":["Bitcoin","Tether"],"authors":["Ruholamin Haqshanas"]}