{"summary":"Political Boost May Be on the Horizon for South Korean Metaverse, P2E, NFT Champions","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/political-boost-may-horizon-for-south-korean-metaverse-p2e-nft-champions.htm","publishDate":"2022-01-12T00:00:00","id":20072,"type":null,"title":"Political Boost May Be on the Horizon for South Korean Metaverse, P2E, NFT Champions","category":["News "],"content":[" ","South Korean metaverse and crypto gaming projects could get a massive boost in the weeks ahead – if the results of the next general election go their way, and provided politicians make good on their promises.","As reported, South Korean gaming giants have been all but frozen out of the play-to-earn (P2E) market due to the government’s restrictive stance on crypto and non-fungible tokens (NFTs). Titles like Axie Infinity cannot easily be accessed in the country, and the gaming regulator recently stated that it would be asking app marketplaces to remove P2E titles. ","In many cases, this has forced South Korean gaming firms into overseas markets with their blockchain releases – at the expense of the local gaming industry.","But in what may turn out to be a key development, Lee Jae-myung, the Democratic Party nominee in the nation’s presidential elections, has launched a “gaming and metaverse” unit ahead of March’s vote. Lee has previously positioned himself as a crypto-friendly candidate, leading a parliamentary movement that successfully delayed the introduction of a tax on trading profits until 2023.","He has since gone further, speaking of the need to position South Korea at the forefront of crypto innovation in East Asia. Many have accused Lee of desperately trying to curry favor among younger voters, a growing number of whom are keen crypto investors.","Regardless, Lee now appears to have successfully positioned himself as the pro-business and industry 4.0-savvy candidate in what is essentially a two-horse race between himself and the People’s Power Party candidate Yoon Suk-yeol.","The early evidence is that this stance has proved somewhat successful: Despite trailing Yoon in opinion polls late last year, a Realmeter opinion poll last week showed that Lee is now the frontrunner by a narrow margin, and is now winning the support of younger voters. Lee polled at almost 41% with Yoon on just over 39%. Lee also polled ahead of Yoon in every age group except the 60+ demographic, the firm reported.","At an event marking the launch of the Democratic Party’s “Gaming and Metaverse Special Task Force,” Lee was quoted as stating:","“Blockchain, the metaverse and NFTs are new technologies that many people are not familiar with yet, but their ripple effect will be greater if they converge with games. The more powerful the new technology, the more we need to pay attention to the shadows that it casts. Everyone should be able to use technology without discrimination. However, the problem now is that the lower people’s income is, the less accessible the technology is.”","Lee also spoke in “positive” terms about metaverse, NFT, and gaming industry developments and noted that the domestic gaming industry was forecasted to grow to the USD 16.7bn mark in the year ahead, reported Hanguk Jungkyung Shinmun.","Although Lee refrained from making broader promises about regulatory change, the membership of the “task force” is significant – as was the event. A number of key figures from the gaming industry were in attendance, and spoke to the media in glowing terms about the future of P2E gaming.","While they also spoke about creating “a surveillance mechanism” for P2E titles, they also explained there was a need to “approach gaming as a future industry,” and noted that “P2E should be approached as a business model for gaming companies.”","Meanwhile, Donga reported that the value of “South Korean” real estate in the metaverse project Earth 2 is starting to rocket on both domestic and international platforms.","The media outlet noted that while South Korean virtual “land” tiles were worth just USD 0.10 just over a year ago, “a little over a year later, the price of one tile in Jongno District [downtown Seoul], has reached 12,207 dollars” – a price rise of “more than x120,000.”\n____\nLearn more: \n– Real Estate in the Metaverse Is Booming. Is It Really Such a Crazy Idea?\n– I’m a Black Woman and the Metaverse Scares Me\n\n– Unstoppable Domains’ New Feature Allows Ethereum, Polygon Login With NFT Domains\n– Top 20 NFT Marketplaces Where You Can Buy & Sell Digital Collectibles\n\n– Blockchain Gaming Adoption Jumps, But Regulation & Education Obstacles Are High – Survey\n– Gaming Giant Nexon America Starts Accepting Bitcoin, Ethereum For In-Game Purchases"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Donga","content":"ORGANIZATION"},{"type":"Jongno District","content":"LOCATION"},{"type":"Lee","content":"PERSON"},{"type":"Yoon","content":"PERSON"},{"type":"Hanguk Jungkyung Shinmun","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lee Jae","content":"PERSON"},{"type":"People’s Power Party","content":"ORGANIZATION"},{"type":"But Regulation & Education Obstacles Are High – Survey\n– Gaming Giant Nexon America Starts Accepting Bitcoin","content":"ORGANIZATION"},{"type":"41%","content":"PERCENT"},{"type":"Blockchain","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"39%","content":"PERCENT"},{"type":"Metaverse Special Task Force","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Yoon Suk","content":"PERSON"},{"type":"East Asia","content":"LOCATION"},{"type":"NFT Marketplaces Where You Can Buy & Sell Digital Collectibles","content":"ORGANIZATION"},{"type":"Polygon Login With NFT","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"}],"hashtag":["Gaming","Metaverse","NFT","Non-fungible tokens","Politics","South Korea"],"authors":["Tim Alper"]}