{"summary":"IRS Halts Enforcement of $10K Crypto Tax Reporting Rule Pending Further Regulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/irs-halts-enforcement-of-10k-crypto-tax-reporting-rule-pending-further-regulation.htm","publishDate":"2024-01-17T14:02:03","id":20084,"type":null,"title":"IRS Halts Enforcement of $10K Crypto Tax Reporting Rule Pending Further Regulation","category":["Blockchain News "],"content":["The US Treasury Department and Internal Revenue Service (IRS) have announced that businesses are not required to report the receipt of digital assets in the same manner as cash until specific regulations are issued.","The decision by the two federal agencies comes in response to the Infrastructure Investment and Jobs Act. The Act classified digital assets as cash and mandated reporting for taxpayers engaged in a trade or business when receiving digital assets exceeding $10,000.","The original rule required centralized exchanges like Coinbase or Kraken to submit the necessary information about their clients to the IRS. On the other hand, the responsibility to submit information would shift to the individual when using peer-to-peer or non-custodial solutions.","“This particular provision requires Treasury and the IRS to issue regulations before it goes into effect,” the new announcement has now clarified.","","It’s important to note that the announcement does not impact the rules applicable before the Infrastructure Investment and Jobs Act for cash received in the course of business.","Such transactions must still be reported on Form 8300, “Report of Cash Payments over $10,000 Received in a Trade or Business,” within 15 days of cash receipt, the announcement said.","To provide clarity and procedures for reporting digital asset receipts and crypto tax on assets over $10,000, the Treasury and the IRS now plan to issue proposed regulations.","According to the two agencies, the public will be invited to provide written comments and, if requested, participate in a public hearing.","","The news that enforcement of the reporting rule has been halted received a positive reaction in the crypto community.","Among those who shared their reactions was the US-based advocacy group Blockchain Association, which called it “a positive step forward given its impossibility and breadth of reporting required.”","IRS states 6050I–a problematic provision of the infrastructure bill requiring reporting digital asset transactions over $10K–isn't effective until there's more rulemaking. A positive step forward given its impossibility and breadth of reporting required.https:\/\/t.co\/x8SFAQfuEh","— Blockchain Association (@BlockchainAssn) January 16, 2024","","Sharing a similar sentiment, Miles Jennings, general counsel and Head of Decentralization at the crypto-focused venture capital firm a16z Crypto, said the announcement wasn’t a surprise. However, it “runs counter to the bad guidance many people have been posting.”","“Be careful who you follow,” he added.","TLDR: Treasury and the IRS have announced that businesses do not have to report receipt of digital assets >$10k until they issue new regulations.","This isn't a surprise, yet it runs counter to the bad guidance many people have been posting. Be careful who you follow. https:\/\/t.co\/XTpmPxsGn5","— miles jennings (@milesjennings) January 16, 2024","",""],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"US Treasury Department and Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"January 16, 2024","content":"DATE"},{"type":"$10K","content":"MONEY"},{"type":"Miles Jennings","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"$10k","content":"MONEY"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["IRS"],"authors":["Fredrik Vold"]}