{"summary":"Long-Term Bitcoin Holders Are Finished Dumping Their Coins: Analyst","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/long-term-bitcoin-holders-coins.htm","publishDate":"2024-04-30T22:22:10","id":20089,"type":null,"title":"Long-Term Bitcoin Holders Are Finished Dumping Their Coins: Analyst","category":["Bitcoin News "],"content":["Bitcoin HODLers appear to have finished taking profits from their long-dormant coins after an early-year rally pushed them far into the green, according to a popular crypto market analyst.","In a Monday X post, TXMCtrades said that the market has “likely absorbed the majority of the Long-Term Holder supply we will see activated in this run.”","“As in every cycle, old supply came to life at the highs to pay itself for years of enduring risk,” he explained.","As in every cycle, old supply came to life at the highs to pay itself for years of enduring risk. That we know GBTC was 1\/3rd of it doesn't alter the cyclical footprint.","The hodler cohort is typically in accumulation at all times except parabolic bull runs. Their role- the… https:\/\/t.co\/h7of1iinTm pic.twitter.com\/d7wYATfq87","— 𝐓𝐗𝐌𝐂 (@TXMCtrades) April 30, 2024","","The total coin supply held by long-term holders – coins that haven’t moved for 155 days or more – steadily climbed between July 2022 and January 2024.","This pattern changed course after the launch of U.S. Bitcoin spot ETFs, which invited billions of dollars into the market, driving up the asset’s price and incentivizing HODLers to realize their gains.","Since then, long-term holders have sold 1.2 million BTC, of which roughly one-third of sales came from the fast-declining Grayscale Bitcoin Trust (GBTC). The Bitcoin ETF is mostly comprised of long-term BTC holders with a lower cost base, unlike fresher competitors whose earliest buyers arrived this January.","“That we know GBTC was 1\/3rd of it doesn’t alter the cyclical footprint,” TXMC explained. “The hodler cohort is typically in accumulation at all times except parabolic bull runs.”","Historical data shows that long-term holder supply has steadily increased throughout Bitcoin’s history. Exceptions include periods of rapid price ascent to new all-time highs for BTC, including December 2013, late 2017, and early 2021.","TXMC believes long-term holders will not return to impactful buying\/selling activity until the “next cyclical breakout.”","Lead Glassnode analyst James Check explained that he’s surprised Bitcoin still hasn’t retraced at least 20% from its March highs despite the HODLer sales that have occurred so far.","“Bear case is we’ve topped, and it looks about right,” he said. “Bull case is, we absorbed a full bull, and we’re not done.”","Both Check and others, including Peter Schiff, have warned that a bear market could officially begin if Bitcoin descends beneath $58,000 again. That’s the average cost basis for the average short-term holder, who is likely to capitulate fast if they see their investment turn red."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Peter Schiff","content":"PERSON"},{"type":"Long","content":"LOCATION"},{"type":"January 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$58,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"James Check","content":"ORGANIZATION"},{"type":"December 2013","content":"DATE"},{"type":"April 30, 2024","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","bull market"],"authors":["Andrew Throuvalas"]}