{"summary":"ENS Takes Legal Action Over Unstoppable Domains’ Blockchain Naming Patent","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ens-takes-legal-action-over-unstoppable-domains-blockchain-naming-patent.htm","publishDate":"2024-05-03T10:02:40","id":20085,"type":null,"title":"ENS Takes Legal Action Over Unstoppable Domains’ Blockchain Naming Patent","category":["Blockchain News "],"content":["Ethereum Name Service (ENS) has petitioned the United States Patent and Trademark Office (USPTO) to challenge a blockchain naming patent held by Unstoppable Domains (UD).","According to a series of posts ENS published on social media, UD obtained a patent for an open-source technology developed by ENS Labs. The company now has officially petitioned to challenge the validity of the patent.","ENS Update 🧵: In 2023 Unstoppable Domains (UD) obtained a patent for technology ENS Labs developed as open-source. Today, we petitioned USPTO to challenge the validity of that patent, and to ensure the web remains a collaborative space. Here's why and what’s at stake. pic.twitter.com\/Qxls0kkP6G","— ens.eth (@ensdomains) May 2, 2024","","As included in the posts, UD’s registered patent was named “Resolving Blockchain Domains.” ENS stated that UD patented its technology, “directly leveraging our open-source innovations.”","“This isn’t flattery — it’s theft,” the posts read. “We have to fight this to ensure that ENS remains unrestricted for all.”","The posts indicated that their contributions were acknowledged in Unstoppable Domains’ patent application. The company noted that the USPTO ‘s initial rejection of the patent cited prior art that included work outside of ENS’s contributions.","“ENS thrives on decentralization and public benefit, features we believe the UD patent threatens to distort or destroy,” the posts read. “Our legal position is rooted in our belief that core web functions must stay free for all, not fenced by patents.”","The company sent out letters to UD to address to the issue, yet the post indicated that the latter rejected the requests and refused to cooperate.","“We gave UD every opportunity to avoid this battle: UD refused to open source the patent and refused to make any irrevocable pledges not to use the patent to the detriment of the community,” said ENS.","The posts stated that UD’ pursuit of a patent represented a significant departure from the communal ethos of web3 and the open internet. They expressed concern that this move toward privatization contradicted the foundational principles of public accessibility and transparency.","According to ENS, UD has also submitted applications to claim the invention of other basic technologies.","“The community should know that this patent is not unique. Behind the scenes, UD filed for at least 9 other patents, for basic tech like accessing data on a blockchain, cross chain app access, and data resolution using domains,” said ENS."],"entity":[{"type":"May 2, 2024","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Unstoppable Domains (UD)","content":"ORGANIZATION"},{"type":"United States Patent","content":"LOCATION"},{"type":"Trademark Office (USPTO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UD","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"}],"hashtag":["ENS","Web3"],"authors":["Hongji Feng"]}