{"summary":"Pressure Mounts on Biden to Assist in Release of Detained Binance Executives","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pressure-mounts-on-biden-to-assist-in-release-of-detained-binance-executives.htm","publishDate":"2024-03-17T16:00:42","id":20095,"type":null,"title":"Pressure Mounts on Biden to Assist in Release of Detained Binance Executives","category":["Altcoin News "],"content":["There has been mounting pressure on the Biden administration to intervene and secure the release of the detained Binance executives.","The administration is facing increasing calls to take swift action in securing the release of Tigran Gambaryan, a Binance executive and former U.S. federal agent, and another Binance executive, Nadeem Anjarwalla, who have been detained by the Nigerian government since February 26, 2024.","The U.S. Chamber of Digital Commerce made an appeal through a blog post on its website on March 15, leading the charge for urgent diplomatic intervention to address what it deems a grave injustice.","The Chamber of Digital Commerce argues that Gambaryan’s detention under questionable circumstances sets a troubling precedent, suggesting that any American entrepreneur abroad, particularly those in the cryptocurrency industry, could face similar unlawful actions by foreign authorities. ","“The unwarranted detention of Tigran Gambaryan is more than a legal issue; it is a matter of national dignity and the protection of American citizens worldwide,” they wrote in a recent blog post. ","The Chamber of Digital Commerce contends that Gambaryan’s detention lacks due process and represents a significant challenge to international law norms and diplomatic relations. ","Nigeria, which receives over $1 billion in U.S. foreign aid annually, is a U.S. ally. ","Reports of Gambaryan and Anjarwalla’s apprehension emerged in late February, with the Financial Times covering the detentions without explicitly naming the executives.","According to their families, Gambaryan and Anjarwalla, the latter being a dual citizen of the United Kingdom and Kenya, arrived in Abuja on February 25 in response to an invitation from the Nigerian government to discuss the ongoing dispute with Binance over its alleged illegal activities in the country. ","The executives reportedly met with Nigerian officials the following day to address the government’s directive for telecom providers to restrict access to Binance and other cryptocurrency exchanges. ","The officials attributed the devaluation of Nigeria’s official currency, the naira, and the facilitation of illicit financial flows to crypto exchanges.","However, instead of reaching a consensus, Gambaryan and Anjarwalla were escorted to their hotels shortly after the meeting and instructed to gather their belongings. ","They were then transported to a “guesthouse” managed by Nigeria’s National Security Agency, according to their families.","The arrests of Gambaryan and Anjarwalla occurred a few days before Binance officially announced its exit from Nigeria on March 5, adding further complexity to the situation. ","Prior to joining Binance, Gambaryan was involved in high-profile cases, including the investigation into the Silk Road dark-web drug market and the takedown of the Welcome to Video crypto-based child sexual abuse materials network.","As reported, Binance recently had to discontinue all services involving Nigerian local fiat currency, the Nigerian naira (NGN), after regulatory scrutiny. ","The world’s largest cryptocurrency exchange said it would suspend NGN withdrawals after March 8. ","Earlier, the Nigerian government imposed a staggering $10 billion fine on Binance as part of a crackdown on the platform in an effort to stabilize the nation’s local currency."],"entity":[{"type":"U.S. Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"February 25","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Gambaryan","content":"PERSON"},{"type":"Kenya","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Abuja","content":"LOCATION"},{"type":"March 15","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"February 26, 2024","content":"DATE"},{"type":"Anjarwalla","content":"PERSON"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"National Security Agency","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"March 8","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"March 5","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["Binance","Crypto Regulation","Nigeria"],"authors":["Ruholamin Haqshanas"]}