{"summary":"MicroStrategy’s Michael Saylor to Sell $216 Million Company Shares for Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/microstrategys-michael-saylor-to-sell-216-million-company-shares-for-bitcoin.htm","publishDate":"2024-01-03T05:44:24","id":20090,"type":null,"title":"MicroStrategy’s Michael Saylor to Sell $216 Million Company Shares for Bitcoin","category":["Bitcoin News "],"content":["MicroStrategy co-founder Michael Saylor has planned to sell company shares worth $216 million for personal Bitcoin investment.","According to a recent filing with the U.S. Securities and Exchange Commission, Saylor will be selling 310,000 stock option awards, originally granted in 2014. MicroStrategy closed at $685.15 on Jan. 2, making Saylor’s holding worth $216 million.","Saylor revealed in MicroStrategy’s 2023 third-quarter earnings call, and as first disclosed in the company’s 10-Q filing, his intention to sell up to 5,000 shares per trading day within a four-month window.","This selling strategy, bound by a minimum price condition, allows Saylor to divest up to 400,000 shares of his vested options. The stock option awards, which are set to expire on April 26, 2024, form a key part of Saylor’s planned transaction.","“I was granted a stock option in 2014 with respect to 400,000 shares, which is going to expire next April,” said Saylor in the call. “Exercising this option will allow me to address personal obligations as well as acquire additional Bitcoin to my personal account.”","“I continue to be optimistic about MicroStrategy’s prospects and should note that my equity stake in the company after these sales will remain very significant,” said Saylor.","From Nov. 30 to Dec. 26, MicroStrategy purchased 14,620 Bitcoins for $616 million, increasing their total holdings to 189,150 Bitcoins worth over $8 billion. The company’s total holding represented a significant 1% of all Bitcoins currently in circulation post purchase, keeping its place as the largest listed corporate holder of Bitcoin among public companies.","Starting the new year strong, Bitcoin’s price has exceeded $45,000. Pending the SEC’s decision on the spot Bitcoin exchange-traded funds (ETFs), it is trading at $45,272 at the time of writing, up by 6.87% over the past week according to CoinMarketCap.","In addition, Bitcoin has achieved a significant milestone on New Year’s Eve, setting a new record in its network’s history with over 731,000 transactions processed in a single day."],"entity":[{"type":"2014","content":"DATE"},{"type":"$216 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"April 26, 2024","content":"DATE"},{"type":"Dec. 26","content":"DATE"},{"type":"Jan. 2","content":"DATE"},{"type":"$685.15","content":"MONEY"},{"type":"6.87%","content":"PERCENT"},{"type":"$45,000","content":"MONEY"},{"type":"Nov. 30","content":"DATE"},{"type":"$45,272","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$616 million","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Bitcoin","Michael Saylor","MicroStrategy"],"authors":["Hongji Feng"]}