{"summary":"Doodles and G-shock Join in an NFT Collab + More Top 10 News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/doodle-and-g-shock-join-wrists-in-an-nft-collab-more-top-10-news.htm","publishDate":"2024-02-02T12:10:58","id":20094,"type":null,"title":"Doodles and G-shock Join in an NFT Collab + More Top 10 News","category":["NFT News "],"content":["Over the past 24 hours, the non-fungible token (NFT) market sales volume has slightly decreased, less than 2%, to $35,310,744, with several big developments making NFT news rounds.","Buyers are up 8%, sellers 3%, and transactions 9%, according to CryptoSlam.","Most of the top 10 collections by sales volume are up – and significantly so.","The largest increase was recorded by CATS BRC-20 NFTs, jumping 4,876% in a day to the 10th place with $582,800.","Speaking of Bitcoin-based NFTs, Uncategorized Ordinals are in first place with a sales volume of $2.77 million, having gone up 98%.","And when it comes to Bitcoin, it is very close to Ethereum today: the former’s sales volume is $10,778,162, while the latter’s is $11,127,275.","While Bitcoin narrowed the gap between it and the throne-holder Ethereum, it widened it compared to Solana.","The two have been in a battle for second place for a while, but Solana currently has nearly half of Bitcoin’s volume: $5,772,470.","Today in NFT news: Doodles partners with the luxury watch brand G-shock, Art Blocks acquires the Sansa marketplace, and card-battling sci-fi game Parallel nears its open beta launch.","In the latest NFT news, Digital asset firm Doodles has partnered with the luxury watch brand G-shock to launch an NFT-inspired watch collection.","Notably, Doodles is behind the popular NFT collection with the same name.","The collaboration is “dropping soon,” the team said in a Twitter post, which was shared by G-shock as well.","something is coming 👽","doodles x @gshock_us collab","dropping soon 🛸✨ pic.twitter.com\/qcDz328OQ7","— doodles (@doodles) January 31, 2024","","The partners will reportedly launch a physical and digital NFT collection in the coming week.","No details are available as of yet.","Doodles are an Ethereum-based collection of 10,000 NFTs comprising hundreds of visual traits. Hand-drawn Doodles, says the website, include skellys, cats, aliens, apes, mascots, and “dozens of rare heads, costumes, and colorways of the artist’s palette.”","The team has also created Space Doodles, described as “spaceships for your Doodle.” All Original Doodles receive a free ship, it added. The ship can launch into space “where it will sync with its pilot and establish attributes like “bladder management”, “piloting ability”, and more.”","Meanwhile, the collection is up 25% over the past 24 hours to $423,746, per CryptoSlam. Over the past week, the volume is up 204% to $7,108,330.","Doodles don’t come cheap.","Currently, the lowest price for an OG Doodle on OpenSea is 2.1199 ETH ($4,900), and the highest is 888 ETH ($2 million). The floor price for a Space Doodle is 8.5 ETH ($19,644), while the highest is 25 ETH ($57,775).","Generative digital arts platform Art Blocks announced that it recently acquired NFT marketplace Sansa.","The two plan to, together, “deliver a well-tailored home for generative content that provides expanded opportunities for creators and showcases diversity of generative projects.”","We're thrilled to announce that we have acquired @sansaxyz! 🎉","Bringing Sansa's secondary market and collector experience into the Art Blocks family allows us to continue building on our vision by establishing a more robust ecosystem to serve creators and collectors. 🌐✨ pic.twitter.com\/VmSAjN0jx5","— Art Blocks (@artblocks_io) January 31, 2024","","According to the blog post, Sansa brings a simplified discovery of artworks, creator royalties earned with each sale, and an exclusive focus on digital art collections.","Furthermore, Sansa will continue running as a separate app for now.","Meanwhile, behind the scenes, it said, the team is working on integrating the two platforms to create a seamless experience.","They did not disclose the details of the acquisition.","Art Blocks Founder and CEO Erick ‘Snowfro’ Calderon commented that “building in web3 is hard, and seeing a nimble team be able to build something so aligned with what I am excited about felt like a no-brainer in exploring the opportunity to work together.”","The card-battling sci-fi game Parallel is nearing its open beta launch.","Parallel is a sci-fi franchise and trading card game that enables holders to own their cards and other game items. The cards can be used to build a deck and play in an online PC game.","The game is currently in the closed beta phase, but based on the latest tweet, it seems close to releasing Parallel to the public. Per the FAQ, the release is planned for 2024.","“More to come on Open Beta soon,” said the team.","This statement came as a part of the latest season launch.","Please Note: Season 1 Cosmetics and Cards will be available to mint\/claim beginning tomorrow at 7pm ET. More info to come on Open Beta soon \/\/","— Parallel (@ParallelTCG) February 1, 2024","","“Season 1: Vault Keeper” introduces two new playable cards: character Ilana, Keeper of the Vault, and universal legendary card Astel’s Glaive.","Each season will continue to offer new cards and cosmetics exclusive to the Battle Pass, said the website.","The blog post revealed a number of enhancements, as well as some bug fixes."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"Erick ‘Snowfro’ Calderon","content":"PERSON"},{"type":"2%","content":"PERCENT"},{"type":"$5,772,470","content":"MONEY"},{"type":"February 1, 2024","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"4,876%","content":"PERCENT"},{"type":"$10,778,162","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$35,310,744","content":"MONEY"},{"type":"Vault","content":"LOCATION"},{"type":"January 31, 2024","content":"DATE"},{"type":"OG Doodle on OpenSea","content":"ORGANIZATION"},{"type":"$57,775","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"$582,800","content":"MONEY"},{"type":"$7,108,330","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Battle Pass","content":"ORGANIZATION"},{"type":"204%","content":"PERCENT"},{"type":"Sansa","content":"ORGANIZATION"},{"type":"CATS BRC","content":"ORGANIZATION"},{"type":"$19,644","content":"MONEY"},{"type":"Ilana","content":"PERSON"},{"type":"$11,127,275","content":"MONEY"},{"type":"$423,746","content":"MONEY"},{"type":"Astel’s Glaive","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$4,900","content":"MONEY"},{"type":"$2.77 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Art","Gaming","NFT"],"authors":["Sead Fadilpašić"]}