{"summary":"MyShell has raised $11 million in a new round from Dragonfly, Nascent, OKX Ventures and others.\nThe web3 AI platform allows creators to generate AI agents or bots and plans to launch its token. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285072\/web3-ai-platform-myshell-funding","publishDate":"2024-03-27T10:00:04","id":201,"type":null,"title":"Web3 AI platform MyShell raises $11 million in a round led by Dragonfly","category":["Deals"],"content":["MyShell, a web3-enabled AI platform focused on creators, has raised $11 million in a pre-Series A funding round led by Dragonfly.","Other investors in the round included Delphi Ventures, Bankless Ventures, Maven11 Capital, Nascent, Nomad Capital and OKX Ventures, MyShell said Wednesday. Angel investors participating in the round included former Coinbase CTO Balaji Srinivasan, NEAR Protocol co-founder Illia Polosukhin, former Paradigm investment partner Casey Caruso and former Parafi partner Santiago Santos.","MyShell began raising funds for the round in November and closed last month, CEO Ethan Sun told The Block. Like its seed round, MyShell's pre-Series A funding round was also structured as equity with token warrants, Sun said. He declined to comment on the latest valuation. MyShell <a href=\"https:\/\/www.theblock.co\/post\/256691\/web-ai-platform-myshell-funding\" data-v-f87c67ca=\"\">was valued at $57 million<\/a> when it raised $5.6 million in a seed funding round last October.","Launched last year, MyShell allows creators to build AI agents or bots that consumers or users can use. MyShell claims its platform has around 50,000 creators and over 1 million registered users. Its ecosystem includes bots like OpenVoice, an instant voice cloning program; MeloTTS, a multilingual text-to-speech (TTS) library; and Alice, an AI agent that performs various tasks, including thematic research, coding and literature review.","\"The demand for personalized AI experiences has grown explosively in the last year, but right now, most of those experiences are centralized with gatekeepers,\" Haseeb Qureshi, managing partner at Dragonfly, said in a statement. \"MyShell uses crypto and decentralization to put the power over the AI ecosystem back into the hands of users.\"","MyShell currently offers points and plans to introduce token rewards for both creators and consumers. \"Points will be an important factor for a token airdrop,\" Sun said. After the token launch, MyShell creators will receive the token when their AI agents gain traction, and consumers can stake tokens on top of AI agents to generate income, Sun added.","MyShell is currently multichain, utilizing Polygon and opBNB. However, it plans to launch its own customized Layer 2 \"soon this year,\" according to Sun. \"The general approach and idea is that we don't want to commit to a single ecosystem, and as we have more creators and developers in our community, we will focus more on our customized L2,\" he said."],"hashtag":["SERIES A"]}