{"summary":"NY Attorney General Secures $4.3 Million Refund for Coin Cafe Customers Misled by Hidden Fees","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ny-attorney-general-secures-43-million-refund-for-coin-cafe-customers-misled-by-hidden-fees.htm","publishDate":"2023-05-19T13:00:00","id":20101,"type":null,"title":"NY Attorney General Secures $4.3 Million Refund for Coin Cafe Customers Misled by Hidden Fees","category":["Altcoin News "],"content":["The New York Attorney General’s office has ordered crypto trading platform Coin Cafe to repay $4.3 million to users for charging hidden fees. ","In a Thursday announcement, Attorney General Letitia James revealed that it has secured $4.3 million for Coin Cafe users after the company charged “exorbitant and undisclosed fees” for storing crypto on its platform.","Coin Cafe, which initially filed an application for a virtual currency license with the New York State Department of Financial Services back in 2015, acquired a BitLicense just earlier this year. ","The platform allegedly misled investors by charging fees that sometimes entirely emptied investors’ accounts despite claims that it offered free wallet storage.","As per the settlement with the state, Coin Cafe has agreed to compensate the affected users, which includes 340 investors in New York.","“Coin Cafe defrauded hundreds of New Yorkers out of thousands of dollars with its deceptive marketing and due to a lack of effective regulation,” James said in a statement.","“This is yet another example of why the cryptocurrency industry needs to be better regulated, just like any other financial institution where New York investors put their hard-earned money.”","The filing claimed that one New York investor incurred fees exceeding $10,000 in a single month, while another investor was hit with fees amounting to $51,000 over a span of 13 months.","James further revealed that Coin Cafe changed the fee structure four times since late 2020, without ever “clearly telling investors of the increase.”","The “most drastic fee structure change” occurred in October 2022, when investors were charged a fee for inactivity, the Office of the Attorney General said. ","“It charged investors the greater of 7.99 percent of the account or $99 worth of Bitcoin per month if an investor did not buy, sell, or transfer Bitcoin on the Coin Cafe site within 30 days.”","Under the settlement terms, Coin Cafe is obliged to reimburse all fees to investors based in the US who demand repayment within the next 12 months. ","Additionally, the platform is required to inform all US-based clients about their qualification for a refund via email no later than May 23.","New York is among the few states that require businesses that engage in the transmission of fiat currency as well as a virtual currency to have both a BitLicense and a traditional money transmitter license. ","The New York State Department of Financial Services, the state’s main financial regulator, has also released a series of crypto-related directives over the past year. ","Earlier this year, the regulator released new guidance that mandates companies to separate their own crypto assets from that of customers.","The move came after it was revealed that there was co-mingling of funds between the now-bankrupt cryptocurrency exchange FTX and its trading arm Alameda Research. ","More recently, the regulator passed a law that requires companies holding a BitLicense to pay assessment fees similar to insurance and banking firms. "],"entity":[{"type":"2015","content":"DATE"},{"type":"Letitia James","content":"PERSON"},{"type":"New Yorkers","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$99","content":"MONEY"},{"type":"$4.3 million","content":"MONEY"},{"type":"7.99 percent","content":"PERCENT"},{"type":"BitLicense","content":"ORGANIZATION"},{"type":"James","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$10,000","content":"MONEY"},{"type":"Attorney General","content":"ORGANIZATION"},{"type":"Coin Cafe","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"late 2020","content":"DATE"},{"type":"$51,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"May 23","content":"DATE"}],"hashtag":["Crypto Exchange","Regulation"],"authors":["Ruholamin Haqshanas"]}