{"summary":"Square Enix in 2024 Doubling Down on Blockchain, AI, and Metaverse Technologies","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/square-enix-in-2024-doubling-down-on-blockchain-ai-and-metaverse-technologies.htm","publishDate":"2024-01-03T10:25:40","id":20119,"type":null,"title":"Square Enix in 2024 Doubling Down on Blockchain, AI, and Metaverse Technologies","category":["Blockchain News "],"content":["The Japanese gaming giant Square Enix reaffirmed its plans to utilize blockchain, artificial intelligence (AI), and metaverse in creating novel content for consumers.","The Final Fantasy publisher’s Representative Director and President, Takashi Kiryu, has written a New Year’s letter outlining the 2024 plans.","He noted that a change was occurring in the realm of digital entertainment – the realm of the company’s core business – throughout 2023.","Kiryu wrote that “we saw the release of eye-catching products and services in multiple domains where the commercialization and adoption of emerging technologies had seemed a more distant eventuality.”","The company identified three focus investment fields for new business domains in 2023. This year, it redefined the mission and goals for these areas: blockchain, AI, and the metaverse.","Last year’s letter spent many more lines discussing blockchain than this year’s.","The then-President Yosuke Matsuda said that, among the three investment fields, the company was the most focused on blockchain entertainment. Square Enix “devoted aggressive investment and business development efforts” to it.","He stated,","“If we consider traditional gaming to have been centralized, then blockchain gaming must operate based on a self-sustaining decentralized model. It is that concept, that philosophy that I see to be key.”","He further opined that blockchain gained “significant recognition as a field” in 2022. The proof for this, he said, is that the term ‘Web3’ became “a firmly established buzzword” in business circles.","Matsuda also noted the Japanese government’s support for the development of the blockchain and Web3 ecosystem.","The latest letter simply added that the company is working to modify its organizational structure and optimize resource allocations to support the efforts outlined in 2023.","This year’s letter outlined AI and metaverse ideas in more detail.","While AI was a subject of academic debate for a long while, the introduction of ChatGPT changed everything, Kiryu argued.","It initiated a fast spread of generative AIs and showed that their applicability was not limited to text. A “quick succession of launches” of services and content followed, expanding generative AI into numerous digital entertainment-related areas, such as images, video, and music.","Kiryu stated that,","“We also intend to be aggressive in applying AI and other cutting-edge technologies to both our content development and our publishing functions.”","Generative AI has the potential to reshape what the company creates and the process to do so, including programming, he argued.","Technological innovation represents business opportunities, Kiryu said. Therefore, in the longer term, Square Enix plans to leverage AI and other novel tech to create new forms of content.","Lastly, Kiryu noted that extended reality (XR) expanded beyond business applications for the metaverse and other virtual spaces.","In 2023, new services merged virtual spaces with the real world.","“In the realm of digital entertainment, where the focus has been on pioneering the development of new content, the experiential value of digital content itself increased dramatically as devices came to market that were capable of delivering even more immersive, realistic experiences using virtual reality (VR) and augmented reality (AR).”","The next step, Kiryu said, is to apply these technologies to new forms of content that fuse the real and virtual worlds."],"entity":[{"type":"Enix","content":"ORGANIZATION"},{"type":"Kiryu","content":"PERSON"},{"type":"Yosuke Matsuda","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Takashi Kiryu","content":"PERSON"},{"type":"Square Enix","content":"ORGANIZATION"}],"hashtag":["AI","Blockchain","Square Enix"],"authors":["Sead Fadilpašić"]}