{"summary":"$2.2 Billion Illegal Forex Operation Busted by Chinese Authorities Using Crypto Platforms","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/2-2-billion-illegal-forex-operation-busted-by-chinese-authorities-using-crypto-platforms.htm","publishDate":"2023-12-27T16:59:15","id":20113,"type":null,"title":"$2.2 Billion Illegal Forex Operation Busted by Chinese Authorities Using Crypto Platforms","category":["Blockchain News "],"content":["Chinese authorities have reportedly dismantled an illegal underground banking operation that moved some $2.2 billion between China and other countries using overseas “virtual currency trading platforms.”","On December 24, an account on social media app WeChat run by China’s State Administration of Foreign Exchange (SAFE), reported that an underground bank had used crypto to bypass forex restrictions.","In China, citizens are prohibited from exchanging more than US$ 50,000 worth of foreign currency each year, but it has long been known that crypto has been used to evade these restrictions.","Xu Xi, an inspector from the Qingdao Branch of SAFE, explained that underground banks purchased virtual currencies and subsequently sold them through overseas trading platforms to acquire the necessary foreign currency.","During on-site investigations, authorities seized cryptocurrencies valued at $28,000 (200,000 Chinese yuan), including Tether (USDT) and Litecoin (LTC).","The underground bank’s operation reportedly spanned a thousand bank accounts across 17 Chinese provinces and municipalities.","Both mining and general use of crypto is banned in China, and some observers believe the real reason behind the ban is the country’s capital controls, which were implemented in 2016."],"entity":[{"type":"$28,000","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"$2.2 billion","content":"MONEY"},{"type":"December 24","content":"DATE"},{"type":"US$ 50,000","content":"MONEY"},{"type":"Qingdao","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"China’s State Administration of Foreign Exchange","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"}],"hashtag":["China"],"authors":["Fredrik Vold"]}