{"summary":"Ethereum Suffers Most Hacks Among Blockchains in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-suffers-most-hacks-among-blockchains-2024.htm","publishDate":"2024-04-16T09:37:42","id":20116,"type":null,"title":"Ethereum Suffers Most Hacks Among Blockchains in 2024","category":["Blockchain News "],"content":["Ethereum has emerged as the leading victim of blockchain hacks in 2024, with 33 reported incidents, according to a recent study.","Smart Betting Guide’s data reveals that, following Ethereum, BNB Chain has been impacted by the most hacking incidents (14) in 2024. Arbitrum and Solana have each experienced 6 incidents, while Bitcoin has seen only two.","Notably, the Decentralized Finance (DeFi) sector has been the most susceptible to these attacks, accounting for all reported incidents thus far this year.","The top 10 largest losses so far this year are:","Orbit Bridge: $81,680,000\nMunchables: $62,800,000\nPlayDapp: $32,350,000\nFixedFloat: $26,100,000\nGMEE: $15,000,000\nWOOFi: $8,750,000\nCoinspaid: $7,500,000\nAbracadabra Money: $6,500,000\nSeneca: $6,500,000\nGamma Strategies: $6,200,000","The report additionally revealed that crypto users have incurred significant losses exceeding $437m through scams and hacks in 2024. Fraudulent activities, including rug pulls, also contributed to the total losses, albeit to a lesser extent, amounting to $14m.","Additionally, a recent CertiK report indicates a significant decline in crypto theft during March. The report detailed that malicious actors stole about $79m from DeFi projects, reflecting a substantial 48% decrease compared to the $160m stolen in February.","In March, one of the most significant crypto thefts involved a MakerDAO-based smart contract deployed by Curio on Ethereum. While initial estimates placed the loss around $16m, PeckShield later revised the figure, suggesting the actual amount stolen could be closer to $40m.","Prisma Finance suffered the second-largest loss in March, with a flash loan attack leading to the misappropriation of about $12.4m. The attacker, who self-identified as a white-hat hacker, initially promised to return the stolen funds following an online conference held by the project’s team.","However, during the event, the attacker’s demands shifted, requiring the team members to publicly disclose their identities and issue an apology.","According to CertiK, security breaches were found to extend beyond DeFi protocols. The Binance-backed platform NFPrompt experienced a cyber intrusion, resulting in misappropriated funds of about $10m. Additionally, the WooFi decentralized exchange reported losses of roughly $8.5m following a hacking incident.","According to Smart Betting Guide, securing crypto involves keeping passwords and seed phrases off cloud storage. Seed phrases, acting as recovery keys, are vulnerable to theft by hackers attempting to steal cryptocurrency.","For further protection, the report recommended using a hardware wallet. This device, resembling a USB drive, securely stores a user’s private keys offline (cold storage). When needed, the keys can be connected online to complete transactions.","Further, users should implement critical security measures. These include refraining from clicking links in dubious emails, implementing Two-Factor Authentication (2FA) for logins, and avoiding interaction with online pop-ups or links. Additionally, vigilance against messages promising rapid financial gains is advised, as these often originate from fraudulent accounts, a prevalent social media scam."],"entity":[{"type":"$81,680,000","content":"MONEY"},{"type":"$8.5","content":"MONEY"},{"type":"$62,800,000","content":"MONEY"},{"type":"$32,350,000","content":"MONEY"},{"type":"Smart Betting Guide","content":"ORGANIZATION"},{"type":"$6,200,000","content":"MONEY"},{"type":"$16m","content":"MONEY"},{"type":"$160m","content":"MONEY"},{"type":"$14m","content":"MONEY"},{"type":"$40m","content":"MONEY"},{"type":"$8,750,000","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$10m","content":"MONEY"},{"type":"$6,500,000","content":"MONEY"},{"type":"Prisma Finance","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Decentralized Finance (DeFi","content":"ORGANIZATION"},{"type":"$26,100,000","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$7,500,000","content":"MONEY"},{"type":"$437m","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$15,000,000","content":"MONEY"},{"type":"48%","content":"PERCENT"},{"type":"$12.4m","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$79m","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["Ethereum","Hacks"],"authors":["Shalini Nagarajan"]}