{"summary":"Intain launched IntainMarkets, a platform for issuing and trading asset-backed securities on a permissioned Avalanche subnet.\nThe platform aims to make investment in traditional financial instruments involving multiple parties more secure, transparent and cost-efficient.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206863\/intain-launches-avalanche-subnet-for-asset-backed-securities","publishDate":"2023-01-31T10:00:36","id":2011,"type":null,"title":"Intain launches Avalanche subnet for asset-backed securities","category":["The Block"],"content":["Structured finance and administration platform Intain launched an Avalanche subnet for issuing and trading asset-backed securities on-chain.","The platform, IntainMarkets, is attempting to simplify the complex structure of financial instruments — making them more transparent, secure and cost-efficient, the company says. The current structured finance market involves several parties that all must communicate with and trust one another. The platform brings all these parties onto its platform and facilitates the tokenization and investment of assets without third party trust assumptions.","“Attempts by the blockchain industry thus far have focused on tokenization,” said founder and CEO of Intain Siddhartha. “Tokenization itself neither addresses the need of transparency nor efficiency.”","Intain said it chose to build its new platform on an Avalanche subnet, a blockchain built on top of the Avalanche network, because of its customizability. Intain needed to build a permissioned network that was also compliant with regulatory frameworks.","Subnets are separate blockchains from the main Avalanche network. The economics of Intain’s subnet are not dependent on the public Avalanche blockchain, meaning transactions and security are not dependent on Avalanche or other subnets. Validators, the network participants who validate transactions on a blockchain, will have to be verified U.S. residents.","Avalanche’s President of Business Development Jon Wu said Intain is the first structured finance platform attempting tokenization, issuance and investment facilitation in one platform. Avalanche’s business development focus is bringing traditional financial assets on-chain, he added."],"hashtag":[]}