{"summary":"Bitcoin options implied volatility has reached a yearly high, signaling an uptick in uncertainty as investors wait for news from the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271145\/bitcoin-options-traders-bracing-for-uncertainty-after-implied-volatility-spike","publishDate":"2024-01-09T14:03:28","id":2012,"type":null,"title":"Bitcoin options traders &#x27;bracing for uncertainty&#x27; after implied volatility spike","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Bitcoin options traders are bracing for significant <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.51%\n    <\/span><\/a> <!----><\/span> price movements later this week after derivatives data showed \"a clear increase in implied volatility,\" an analyst told The Block.<\/span>","<span data-v-f87c67ca=\"\">\"Bitcoin options traders are bracing for higher uncertainty ahead of possible ETF approvals after a clear increase in implied volatility,\" Head of Research at ETC Group André Dragosch said.<\/span>","Dragosch pointed to data that showed a very steep premium for options expiring this Friday because of the uncertainty associated with the possibility of ETF approvals. \"The steep premium also signals that options traders are bracing for higher uncertainty this week which also shows that most traders expect a definitive decision by the SEC by the end of this week, and not the week thereafter,\" he added.","According to cryptocurrency derivatives trader Gordon Grant, implied volatility rises when more people are coming into the market and buying <a href=\"https:\/\/www.theblock.co\/post\/270101\/bitcoin-call-options-concentrate-on-50000-for-january-26-expiry-on-deribit\" data-v-f87c67ca=\"\">options<\/a>.","\"If we unpack the implied volatility surge witnessed in the illiquid market conditions at the weekend, it showed that demand is outstripping supply. Bitcoin's spot price was not moving, but options, particularly out of the money calls, were bid rapidly higher, with fixed strikes in January levitating by over 10% points of implied volatility in some cases, in anticipation of a future event, that could take place this week,\" Grant told The Block.","The derivatives trader said that if a spot bitcoin ETF approval happened this week, it would be one of the most significant events in the asset's history. \"The uncertainty is palpable as everyone has a different opinion, some say its a sell the news event, some say it will be the catalyst for a dramatic upswing in prices,\" he added.","According to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-atm-implied-volatility\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>, at-the-money implied volatility, which is the market's forecast of a likely movement in price, for bitcoin has reached a yearly high of 86.3%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-atm-implied-volatility\/embed\" title=\"BTC ATM Implied Volatility\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to YouHodler Chief of Markets Ruslan Lienkha, the increase in implied volatility is a consequence of the market expecting of a significant capital inflow into the bitcoin market if the ETFs are approved.&nbsp;","\"Bitcoin is still quite illiquid in comparison to fiat currencies or commodity markets; a few hundred million dollars can move the price several percent. At the same time we are waiting for billions of dollars of capital inflow after the SEC's decision; such an amount of money can easily force the bitcoin price to fluctuate 50-100% during a short period of time,\" Lienkha told The Block.","Implied volatility represents the market's expectation of how much an underlying asset's price is expected to fluctuate in the future. When implied volatility rises, it indicates that options market participants anticipate larger price swings or greater uncertainty in the underlying asset.","On the other hand, when implied volatility decreases, it suggests a lower expectation of future price volatility, indicating reduced uncertainty. Option prices tend to be lower in periods of low implied volatility.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Gordon Grant","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"86.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Ruslan Lienkha","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"ETC Group André Dragosch","content":"ORGANIZATION"},{"type":"\" Head of Research","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"few hundred million dollars","content":"MONEY"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"+0.51%","content":"PERCENT"},{"type":"Friday","content":"DATE"}],"hashtag":["BITCOIN","CRYPTO MOVERS","ECONOMIC INDICATORS","SPOT BITCOIN ETF"],"authors":["Brian McGleenon","The Block"]}