{"summary":"UAE Records $25B in Crypto Transactions, Promotes Further Investment With Regulatory Flexibility","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uae-records-25b-crypto-transactions-in-2022.htm","publishDate":"2024-04-16T05:01:15","id":20120,"type":null,"title":"UAE Records $25B in Crypto Transactions, Promotes Further Investment With Regulatory Flexibility","category":["Blockchain News "],"content":["The United Arab Emirates (UAE) recorded $25b in crypto transactions in 2022. Now, it is adopting accommodative regulatory policies to pursue further investment, according to a report published Monday.","The Dubai Multi Commodities Centre’s (DMCC) report explored the market potential and opportunities associated with Web3 applications. These applications leverage blockchain to create decentralized digital infrastructure, including cryptocurrencies, Decentralized Finance (DeFi), and the metaverse.","According to the centre, the metaverse market is expected to hit $3.4t by 2027. This growth was attributed to the potential development of robust use cases and the rapid advancements in artificial intelligence.","Additionally, the DMCC forecasts substantial expansion in the global Decentralized Finance (DeFi) market, with a projected rise from $13.6b in 2022 to $600b by 2032. This growth is expected to be driven by the increasing demand for efficient and accessible financial services.","In the meantime, the crypto market seems poised for a period of stability following a turbulent phase. The resurgence of Bitcoin in 2023 serves as a strong indicator of renewed interest within the industry and institutional circles for long-lasting and value-generating crypto services.","However, the centre acknowledged that the future trajectory of these markets hinges heavily on the regulatory approach adopted by governing bodies. Striking a delicate balance between fostering innovation, safeguarding consumers, and mitigating fraud risks will be crucial.","The DMCC is Dubai’s premier free zone, offering tax incentives and other advantages to attract startups. In 2021, it established a dedicated crypto hub in Jumeirah Lake Towers. This initiative coincided with a surge in crypto firms establishing a presence in the UAE, capitalizing on the region’s aspirations to become a leading global crypto hub.","The central aim of the DMCC Crypto Centre is to foster collaboration and networking opportunities for entrepreneurs in the crypto and blockchain sectors by providing a shared workspace environment.","Last year, the crypto centre expanded its membership base to cross 600 members. Bybit and Solana are among the notable partners."],"entity":[{"type":"$3.4","content":"MONEY"},{"type":"2027","content":"DATE"},{"type":"2032","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"United Arab Emirates (UAE","content":"ORGANIZATION"},{"type":"$600b","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$25b","content":"MONEY"},{"type":"Dubai Multi Commodities Centre","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"DMCC Crypto Centre","content":"ORGANIZATION"},{"type":"Jumeirah Lake Towers","content":"LOCATION"},{"type":"$13.6","content":"MONEY"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["Dubai","UAE"],"authors":["Shalini Nagarajan"]}