{"summary":"How Indonesia’s Election Outcome Will Impact Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/how-indonesias-election-outcome-will-impact-crypto.htm","publishDate":"2024-02-14T13:00:00","id":20121,"type":null,"title":"How Indonesia’s Election Outcome Will Impact Crypto","category":["Bitcoin News "],"content":["Indonesia, a trillion-dollar economy, is impossible to ignore. The country held its election on Wednesday with defence minister Prabowo Subianto and ex-governors Anies Baswedan and Ganjar Pranowo all competing to become the next president.","In December, Indonesia’s Mayor Gibran Rakabuming Raka, a vice presidential candidate in Indonesia’s election, said he aims to accelerate Indonesia’s position as a leader in the digital revolution by cultivating expertise in blockchain and cryptocurrencies.","Rakabuming Raka is the son of President Joko Widodo, speaking during an event on December 10 last year, the young mayor said: “We are preparing blockchain experts, we are preparing cybersecurity experts, we are preparing crypto experts,”","But it seems the Joko Widodo era is now coming to an end, as Prabowo Subianto gains favour in the Indonesian elections on Wednesday. During press time Subianto was leading in the polls.","","Indonesia, the world’s biggest Muslim-majority country, has banned the use of cryptocurrencies as a means of payment. However, the country does allow investment in digital assets.","“Indonesia’s position in the global cryptocurrency landscape, securing the 7th spot in Chainalysis’s crypto adoption rankings, is a testament to the region’s strong inclination towards digital currencies, despite its fluctuating political climate,” said Sung Min Cho, CEO and co-founder of Beoble, a Web3 messaging platform based in Asia, told Cryptonews. He further explained:","“This achievement is part of a broader trend in Asia, which is marked by high rates of blockchain technology adoption, underscoring the region’s significant role in the global arena.”","","Min Cho goes on to explain that what stands out is the clear enthusiasm for cryptocurrencies among Indonesians, with over 14 million actively trading, surpassing traditional stock traders.","“This not only speaks to the country’s digital literacy and entrepreneurial spirit but also highlights the effort to bring financial services to the unbanked population. Even with regulatory uncertainties, this trend reflects a broader movement in Asia towards embracing decentralized financial systems, showing that neither businesses nor individuals in Indonesia have been deterred from exploring the potential of digital currencies,” said Min Cho.","","In January, the Indonesian government reported a significant decline in crypto tax revenue for 2023, amounting to $31.7 million (Indonesian Rupiah 467.27 billion), according to a report by local news outlet Kontant.","The fall marks a sharp 63% drop compared to the partial collection period in 2022 when the crypto tax regime was introduced. This is one of several new taxes on the “digital economy” introduced in 2022 as part of an Indonesian tax reform. The government has stated that it expects the tax reform will “improve tax collection,” and ultimately lead to a “healthy and fair taxation system.”\n\n"],"entity":[{"type":"Prabowo Subianto","content":"ORGANIZATION"},{"type":"Sung Min Cho","content":"PERSON"},{"type":"Beoble","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$31.7 million","content":"MONEY"},{"type":"Prabowo Subianto","content":"PERSON"},{"type":"Indonesia","content":"LOCATION"},{"type":"Ganjar Pranowo","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Min Cho","content":"PERSON"},{"type":"Anies Baswedan","content":"PERSON"},{"type":"63%","content":"PERCENT"},{"type":"December 10 last year","content":"DATE"},{"type":"Rakabuming Raka","content":"PERSON"},{"type":"Joko Widodo","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Subianto","content":"PERSON"},{"type":"Gibran Rakabuming Raka","content":"PERSON"}],"hashtag":["Crypto Regulation","Indonesia","Politics"],"authors":["Tanzeel Akhtar"]}