{"summary":"Ripple’s total sales of XRP declined by 80% in Q4\nThe sharp decline is the result of a drop in direct institutional sales, as well as a pause in Ripple’s programmatic sales\nThe Q4 sales figures are the lowest in the past three years, according to The Block’s research","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53835\/ripples-xrp-sales-declined-by-80-in-q4","publishDate":"2020-01-23T05:48:21","id":2012,"type":null,"title":"Ripple’s XRP sales declined by 80% in Q4","category":["Ripple"],"content":["Ripple has reported an 80% drop in sales of XRP during the fourth quarter of 2019.","The blockchain payments firm sold a total of $13.08 million in XRP in Q4, compared with $66.24 million in the previous quarter, it <a href=\"https:\/\/ripple.com\/insights\/q4-2019-xrp-markets-report\/\" data-v-f87c67ca=\"\">announced<\/a> Wednesday.","The sharp decline is the result of a drop in direct institutional sales, as well as a pause in Ripple’s programmatic sales, i.e. XRP sales to cryptocurrency exchanges.","“Ripple continued the pause of programmatic sales, focusing solely on our over-the-counter (OTC) sales with a few strategic partners, who are building XRP utility and liquidity in strategic regions including EMEA [Europe, the Middle East and Africa] and Asia,” the firm said.","As a result, Ripple’s programmatic sales went down to zero in Q4, compared with $16.12 million in Q3.","","","“Ripple continues to evaluate its benchmarks given challenges, such as fake volume, that continue to persist in the industry,” the firm said Wednesday.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Q4 sales figures are the lowest in the past three years, according to The Block's research. The price of XRP, on the other hand, has declined by 22% during the Q4.<br data-v-f87c67ca=\"\">\n","","Global trading volumes of XRP also declined slightly in Q4, at $17.24 billion as compared with $18.23 billion in the previous quarter.","“The average daily volume was reported at $187.34 million in Q4 versus $198.10 million in Q3, and below Q2’s reported $429.51 average daily volume,” said Ripple.","XRP, the third-largest cryptocurrency by market capitalization, is currently trading at around $0.22 apiece. Ripple clarified Wednesday that it “did not create\" XRP, but was rather “gifted a portion” of the 100 billion units of XRP in 2012 when it was founded."],"hashtag":["XRP"]}