{"summary":"As the international community struggles to respond to the Russian military buildup on the Ukrainian border, independent hackers seem to be stepping in as a sort of digital resistance.\nCybersecurity experts anticipate more data leaks and ransomware attacks against political targets in the region. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131804\/escalation-on-ukrainian-border-leads-to-spike-in-ransomware-and-data-leaks-against-russia-and-belarus","publishDate":"2022-01-26T14:19:52","id":2013,"type":null,"title":"Escalation on Ukrainian border leads to spike in ransomware and data leaks against Russia and Belarus","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">A wave of ransomware and data extraction attacks is building alongside Russian troops on the Ukrainian border.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On January 24, a Belarusian hacktivist group called “Cyber Partisans” announced that it had <\/span><a href=\"https:\/\/t.me\/cpartisans\/625\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">captured<\/span><\/a><span data-v-f87c67ca=\"\"> elements of Belarusian Railways’ IT system via ransomware.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier activities by Cyber Partisans included modding Telegram to circumvent government restrictions. They are also associated with dissident media, including Nexta.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ransom the group demanded was, consequently, unusual: The release of 50 high-risk political prisoners and the refusal to allow Russian soldiers to continue to use Belarusian rails in a widescale buildup around the Ukrainian border.<\/span>","<span data-v-f87c67ca=\"\">The Ukrainian border has been at the center of geopolitical tensions as the Russian military continues to amass forces, seemingly in preparation for war. Leaders of both countries have denied that armed conflict is coming, but that has not done much to allay fears of what could be the first mass land war in Europe since World War II.<\/span>","<span data-v-f87c67ca=\"\">The situation has provoked responses from the international community. But among cyberactivists taking matters into their own hands, Cyber Partisans are hardly alone.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On January 19, a hacker on Raid Forums first published nine gigabytes of internal data from major Russian defense contractor Almaz Antey. The leak was first <\/span><a href=\"https:\/\/readovka.news\/news\/87566\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">publicized<\/span><\/a><span data-v-f87c67ca=\"\"> by news outlet Readovka. The Raid Forums user behind the leak said he was “returning the favor” for pro-Russian attacks on Ukrainians. They subsequently published more leaks from other contractors.<\/span>","<span data-v-f87c67ca=\"\">Cybersecurity experts say this is not the end.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Analysts expect a growing intensity of such leaks and attacks in the coming days,” an analyst for cybersecurity firm Flashpoint told The Block. “Flashpoint has observed a variety of viewpoints expressed by threat actors on Russian-speaking forums in the past years, suggesting that there is a possibility of back-and-forth offensive activity even without the direct involvement of state-backed groups.”<\/span>","<span data-v-f87c67ca=\"\">Flashpoint further noted, however, the recent return of previously published data leaks focusing on targets in Russia, Ukraine and Belarus. The increased attention, they say, means greater opportunities for financial gain. “Therefore, in the upcoming days and\/or weeks there will likely be a number of previously published databases resurfacing in various communities,” the analyst continued.<\/span>","Hacking has taken on a geopolitical dimension in Eastern Europe, especially Russia, in recent years. 2021 saw US President Joe Biden put <a href=\"https:\/\/www.theblockcrypto.com\/post\/123571\/treasury-sanctions-another-crypto-exchange-and-two-ransomware-operators\" data-v-f87c67ca=\"\">Russia's ecosystem of ransomware gangs<\/a> at the center of the relationship between the two countries. Earlier this month, Russian authorities <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130330\/russian-authorities-raid-revil-hackers-seize-luxury-cars-and-crypto\" data-v-f87c67ca=\"\">conducted a widescale raid on REvil<\/a>, one of the most notorious of those gangs.&nbsp;"],"hashtag":["HACKS"]}