{"summary":"Ethereum Classic Price Prediction: Hashrate goes Parabolic, Price to Follow?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-classic-price-prediction-hashrate-goes-parabolic-price-follow.htm","publishDate":"2022-09-07T06:17:00","id":20132,"type":null,"title":"Ethereum Classic Price Prediction: Hashrate goes Parabolic, Price to Follow?","category":["Altcoin News "],"content":["Ethereum Classic has arisen as an unforeseen champ ahead of Ethereum’s Merge, planned for later this month. ETC coins are rising in value despite a generally flat market amid network metrics reaching all-time highs.","After a meteoric rise of almost 133% since the month of July, the Ethereum Classic hashrate surpassed the previous record of 28 TH\/s set in April, as of Tuesday morning. The capacity of a computer or mining device can be measured in terahashes. Due to the increased difficulty and expense of gaining network control, a high hashrate is regarded a security indication.","Over the past seven days, Ethereum Classic tokens have gained 2.43%, reaching a high of $42.07 before paring back some of those gains. During the same period, futures contracts based on the tokens saw $27 million in liquidations, second only to ether and to surpass bitcoin futures, which typically see the greatest liquidations.","As a result of the DAO attack in 2016, a hard network fork occurred, resulting in the creation of Ethereum Classic and Ethereum. Ethereum Classic is a continuation of the previous chain, while Ethereum is the newer chain.","The wealth locked up on Ethereum’s different applications reached $110 billion at its peak in 2021, making it the most widely used blockchain in the world. Conversely, Ethereum Classic’s development slowed to a crawl. ","While the Decentralized Finance (DeFi) industry has grown exponentially, applications built on this chain have only ever secured a little over $1 million at their peak.","Though the price of ETC did increase by a factor of ten over two months during the 2021 bull market, this was due more to the speculative mania that engulfed the cryptocurrency market at the time than to any actual increase in demand.","If the bull market fails to spark change, Merge is doing the job for it. ","Key network participants have shifted their attention to Ethereum Classic due to The Merge, which will change Ethereum’s existing proof-of-work (PoW) consensus process to a proof-of-stake (PoS) one.","The developers believe that abandoning the proof-of-work approach will result in significant cost savings, increased network speed, and less environmental impact. Ethereum miners, who are paid in ether tokens for contributing to the blockchain, will also lose their source of revenue.","According to the Ethereum platform, Ethereum, the world’s second-largest cryptocurrency, will undergo a massive revolution that will alter its technology and reduce carbon emissions by more than 98%. The “Merge” will improve Ethereum’s blockchain technology by moving it away from the more energy-intensive architecture used by its competitor, Bitcoin. ","However, the price of Ethereum’s token, Ether (ETH), has risen dramatically in the last two months as a result of the anticipated impact of the change. The first phase of the Merge upgrade will take place on September 6, according to the Ethereum Foundation, and the second phase will occur between September 10 and September 20.","Ethereum will move away from the proof-of-work (PoW) paradigm, which consumes much energy, and toward the proof-of-stake (PoS) model. Despite their differences, both systems are used to validate transactions and add new blocks to the chain.","According to Alex de Vries, an economist who runs the Digiconomist website, the migration to PoS is a step in the right direction for sustainability. He estimates that the energy required to mine Ethereum consumes approximately 72 terawatt-hours per year, comparable to Switzerland’s carbon footprint. De Vries claims to be attempting to calculate the amount of energy saved by the switch. ","He believes it is at least 99 percent right now. As a result, the “Merge” will have a significant positive impact on ETH prices in the coming days. Key network participants have shifted their attention to Ethereum Classic due to The Merge, which will change Ethereum’s existing proof-of-work (PoW) consensus process to a proof-of-stake (PoS) one. ","Despite a significant price increase, ETC has surrendered the majority of its gains and is now trading at $33.99. On the downside, the ETC\/USD pair is likely to find immediate support at $33.25; a break below this level may extend the selling trend until the next support level of $31.55. ","The leading technical indicators, such as the RSI and MACD, are now in the oversold zone, indicating that sellers are exhausted and bulls may enter the market. At the same time, the 50-day moving average is likely to support ETC at $33.50. ","Finally, the Doji candle on the 4-hour timeframe has the potential to cause a market bounce. On the upside, ETC faces immediate resistance at $35.50 and $36.65. ","A bullish breakout of this level, on the other hand, could expose ETC to levels as high as 37.85 and 39.35. Consider buying above $33.50 and selling below $33.50. "],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"September 6","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"2.43%","content":"PERCENT"},{"type":"98%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"September 20","content":"DATE"},{"type":"$33.50","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Alex de Vries","content":"PERSON"},{"type":"Digiconomist website","content":"ORGANIZATION"},{"type":"MACD","content":"ORGANIZATION"},{"type":"$31.55","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$33.99","content":"MONEY"},{"type":"$35.50","content":"MONEY"},{"type":"last two months","content":"DATE"},{"type":"$36.65","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Decentralized Finance (DeFi","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"$110 billion","content":"MONEY"},{"type":"99 percent","content":"PERCENT"},{"type":"133%","content":"PERCENT"},{"type":"$42.07","content":"MONEY"},{"type":"September 10","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"ETC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$33.25","content":"MONEY"},{"type":"ETC\/USD","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum Classic","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum 2.0","Ethereum Classic"],"authors":["Arslan Butt"]}