{"summary":"Crypto Hub in the Making: Hong Kong Pushes Forward with Plans for Retail Crypto Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-hub-making-hong-kong-pushes-forward-with-plans-for-retail-crypto-trading.htm","publishDate":"2023-02-21T10:15:00","id":20137,"type":null,"title":"Crypto Hub in the Making: Hong Kong Pushes Forward with Plans for Retail Crypto Trading","category":["Altcoin News "],"content":["In a push toward reclaiming its position as a global crypto hub, Hong Kong has outlined plans to allow retail investors to trade certain digital currencies on licensed exchanges. ","On Monday, Hong Kong’s Securities and Futures Commission (SFC) published a consultation paper on its proposed regulatory regime for crypto trading platforms. The new rules are set to come into effect starting in June and will require all crypto platforms to be licensed by the SFC.","The regulator also said that retail investors would be allowed to trade certain “large-cap tokens” on licensed exchanges, given that safeguards such as knowledge tests, risk profiles, and reasonable limits on exposure are put in place.","The agency did not specify which large-cap tokens would be allowed. However, a report by the FT claimed Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, would be opened up to retail customers.","The SFC also put forward criteria for which cryptocurrencies would be available for trading. Exchanges would be responsible for vetting the team behind a token, marketing materials, and legal risks and finding out “how resistant it [the token’s network] is to common attacks.” Furthermore, the token should have a relatively large market capitalization.  ","The agency defined large-cap virtual assets as tokens “which are included in at least two ‘acceptable indices’ issued by at least two independent index providers,” one of which should have experience in the traditional financial sector.","It is worth noting that crypto exchanges are required not to store more than 2% of their client assets in “hot wallets,” which is a type of wallet that is accessible online. That is because these wallets are more vulnerable to hacks or phishing scams.","The SFC first introduced its crypto regulatory framework back in 2018, which banned retail investors from trading crypto. However, the SFC said that the “virtual asset landscape has changed significantly” since it first announced the regulatory regime. ","Notably, the Hong Kong government has already allowed retailed investors access to exchange-traded funds (ETFs) investing in CME Group (CME) Bitcoin and Ether futures. ","Furthermore, Hong Kong raised $102 million worth of digital green bonds earlier this month. The sale marked the first tokenized green bond issued by a government, projecting the government’s forward-looking stance on blockchain and DLT.","Nevertheless, Hong Kong’s move is a stark contrast to mainland China where all types of crypto-related transactions are banned. With the city’s introduction of a more crypto-friendly regulatory environment, some of the Chinese-founded Web3 companies in exile might turn to Hong Kong for Chinese tech talent. ","Hong Kong, once the world’s crypto hub, started to lose its position in mid-2022 amid increasing concern about the city’s regulatory ambiguity on crypto and the emergence of potential rivals like Singapore and Dubai that are considered more friendly to the crypto industry.","“There was a point in time where Hong Kong had a leading position in cryptocurrency and business related to crypto,” Padraig Walsh, a partner at the Hong Kong law firm Tanner De Witt, said back in September. “That isn’t the case anymore, and I think regulation has been a key part of the reasons why.”"],"entity":[{"type":"2%","content":"PERCENT"},{"type":"SFC","content":"ORGANIZATION"},{"type":"Padraig Walsh","content":"PERSON"},{"type":"FT","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"CME Group (CME","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"$102 million","content":"MONEY"},{"type":"Tanner De Witt","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"’s Securities and Futures Commission (SFC","content":"ORGANIZATION"}],"hashtag":["Adoption","China","Hong Kong","retail"],"authors":["Ruholamin Haqshanas"]}