{"summary":"Coinbase: California Voters Favor Pro-Crypto Candidates in 2024 Elections","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-california-voters-favor-pro-crypto-candidates-in-2024-elections.htm","publishDate":"2024-02-10T08:30:12","id":20134,"type":null,"title":"Coinbase: California Voters Favor Pro-Crypto Candidates in 2024 Elections","category":["Altcoin News "],"content":["California voters who own cryptocurrencies are expected to have a significant impact on the 2024 elections.","Citing data from Morning Consult, a business intelligence firm, Coinbase revealed that approximately 27% of Californians, equivalent to around 8.2 million individuals, own digital assets.","Moreover, 78% of crypto holders in the state believe that policymakers should support “new, innovative, and disruptive technologies” and express their intention to vote for candidates who align with these views.","“California crypto owners overwhelmingly report that they would be much more likely to support candidates that hold pro-crypto and blockchain positions,” the exchange said in a blog post on February 9.","The exchange highlighted that nearly 4 out of 5 crypto owners in California would be more inclined to back a candidate who supports the U.S. crypto industry as a job creator and a source of geopolitical strength.","The sentiment in California aligns with a broader trend across the United States.","Among Generation Z and millennials, a slight majority of 51% of voters stated their likelihood of supporting candidates with favorable views towards cryptocurrencies in the upcoming 2024 elections.","This information becomes particularly relevant as potential candidates for both major political parties, such as U.S. President Joe Biden and former President Donald Trump, have already appeared on primary ballots in states like South Carolina and New Hampshire.","Coinbase’s findings echo those of a survey conducted by the Crypto Council for Innovation in January.","The advocacy group discovered that a majority of U.S. voters preferred lawmakers who aimed to establish clear regulations for cryptocurrencies. The survey further suggested that crypto users could form a crucial swing voting bloc in the 2024 elections.","Coinbase emphasized the importance of policymakers taking note of the engagement and preferences of crypto voters.","The exchange urged Congress and other decision-makers to establish clear rules for the cryptocurrency industry, rather than relying on unpredictable regulation-by-enforcement approaches.","“Congress and other policymakers should take note that crypto voters are engaged in their states and they want rules, not an unpredictable regulation-by-enforcement approach.”","Notably, digital assets have already emerged as a campaign issue for Republican Party presidential candidates.","Florida Governor Ron DeSantis, who later withdrew from the race, expressed opposition to central bank digital currencies in the United States.","Former President Donald Trump has even vowed to prevent the introduction of a digital dollar should he be reelected.","During a recent interview, he called the prospect of a central bank digital currency (CBDC) a “very dangerous thing.”","Trump’s latest comments echo those he made during a New Hampshire rally last month, where he promised to “never allow the creation of a central bank digital currency.”","The ex-president gave credit to former Republican rival, Vivek Ramaswamy, for informing him of the dangers of CBDC.","I respect Trump & give him full credit for being a strong leader who is willing to listen to the right ideas. 🇺🇸 https:\/\/t.co\/xcGdp8W7S2","— Vivek Ramaswamy (@VivekGRamaswamy) January 23, 2024",""," "],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"Trump &","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"South Carolina","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"78%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"New Hampshire","content":"LOCATION"},{"type":"February 9","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"January 23, 2024","content":"DATE"},{"type":"Donald Trump","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"27%","content":"PERCENT"},{"type":"Morning Consult","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"United States","content":"LOCATION"}],"hashtag":["Coinbase","Donald Trump"],"authors":["Ruholamin Haqshanas"]}