{"summary":"South Korean Mart Dishes Up Bitcoin-Themed Meal Packs with Crypto Exchange Bithumb","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-mart-dishes-up-bitcoin-themed-meal-packs-with-crypto-exchange-bithumb.htm","publishDate":"2024-05-09T16:31:08","id":20141,"type":null,"title":"South Korean Mart Dishes Up Bitcoin-Themed Meal Packs with Crypto Exchange Bithumb","category":["Bitcoin News "],"content":["A South Korean convenience store chain, Emart24, is teaming up with the popular cryptocurrency exchange Bithumb to offer Bitcoin Meal packs. These unique meal boxes will provide customers with an opportunity to win small amounts of Bitcoin, adding a crypto twist to their lunch break.","","Approximately 30,000 Bitcoin Meal packs will be available for purchase at Emart24 locations by the end of the month, priced at 5,900 Korean won (USD $4.30) each. The process is simple: after purchasing a meal pack, customers can download the Bithumb app and enter a coupon code inside the box to potentially win 10,000 won worth of Bitcoin.","An additional 20,000 won worth of Bitcoin will be awarded to those who choose to create a Bitcoin account with NH Nonghyup Bank. Existing Bithumb users need to connect their accounts to redeem their rewards.","SOUTH KOREAN CONVENIENCE STORE LAUNCHES BITCOIN MEAL BOXES WITH CRYPTO GIVEAWAY","To read more- https:\/\/t.co\/WGPAnwqF1e#Bitcoin $btc #cryptocurrencies #SouthKorea #Bithumb #Emart24BitcoinMeal pic.twitter.com\/YxO0CbWpo1","— CryptoniteUae (@CryptoniteUae) May 9, 2024","","Bithumb, a Digital Asset Exchange Association (DAXA) member alongside Coinone, Upbit, Gopax, and Korbit, plays a major role in South Korea’s crypto market. Despite delays in IPO plans, the exchange recently announced its plans to become the first crypto exchange listed on the South Korean stock market.","","Over the past few years, South Korea has implemented stricter crypto regulations surrounding the market. Legislators have also implemented stricter penalties for crypto-related crimes and established new regulatory guidelines. As of the fourth quarter of 2023, South Korean financial authorities mandate that cryptocurrency users report any unlicensed exchanges operating within the country.","Despite these regulations, the collaboration between Emart24 and Bithumb demonstrates the continued growth and integration of cryptocurrency within South Korea’s economy."],"entity":[{"type":"Upbit","content":"LOCATION"},{"type":"Gopax","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"Digital Asset Exchange Association","content":"ORGANIZATION"},{"type":"$4.30","content":"MONEY"},{"type":"$btc","content":"MONEY"},{"type":"May 9, 2024","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"},{"type":"NH Nonghyup Bank","content":"ORGANIZATION"},{"type":"Bithumb","content":"ORGANIZATION"}],"hashtag":["Bitcoin","South Korea"],"authors":["Thomas Musgrave"]}