{"summary":"US DOJ Files Lawsuit Against Apple Over Unfair Rules Targeting Crypto Apps","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-doj-files-lawsuit-against-apple-over-unfair-rules-targeting-crypto-apps.htm","publishDate":"2024-03-22T14:38:56","id":20142,"type":null,"title":"US DOJ Files Lawsuit Against Apple Over Unfair Rules Targeting Crypto Apps","category":["Technology News "],"content":["The Department of Justice (DOJ) and 16 state and district attorneys general have filed a civil antitrust lawsuit against Apple, accusing the tech giant of monopolizing or attempting to monopolize smartphone markets in violation of Section 2 of the Sherman Act.","Apple, a publicly traded company headquartered in California, generated significant revenues in fiscal year 2023, surpassing those of many countries’ gross domestic products.","","BREAKING: Justice Department sues Apple, accusing it of monopolizing the smartphone market.","\"We allege that Apple has employed a strategy that relies on exclusionary anti-competitive conduct that hurts both consumers and developers,\" AG Garland says. https:\/\/t.co\/bcBl2CiWmJ pic.twitter.com\/ha4FjfSBzA","— NBC News (@NBCNews) March 21, 2024","","According to the lawsuit filed in the US District Court for the District of New Jersey, Apple is accused of illegally controlling the smartphone market by imposing restrictive contracts on developers and limiting their access to essential points. ","This allegedly prevents the development of crypto apps, products, and services that could reduce dependence on iPhones, promote compatibility with other platforms, and lower costs for consumers and developers.","The DOJ alleges that Apple uses its dominant position to extract more money from various parties, such as consumers, developers, artists, and small businesses. The US attorney general, Merrick Garland, stated in a press conference on Thursday,","“Apple has maintained its power not because of its superiority but because of its unlawful exclusionary behavior. Monopolies like Apple threaten the free and fair markets upon which our economy is based.”","According to the DOJ, Apple’s policies have unfairly eliminated alternative payment systems and spotlighted the 30% fee it imposes on apps and in-app purchases despite not being the app developer.","This fee, coupled with Apple’s exclusive support for fiat currencies in its payment systems, has posed challenges to integrating cryptocurrencies in apps. As a result, many crypto-based apps have found it economically unfeasible to offer in-app purchases or utilize cryptocurrencies within the Apple ecosystem.","Government officials also allege the smartphone company has refused to support cross-platform messaging apps, limited third-party digital wallets and non-Apple smartwatches, and blocked mobile cloud streaming services, among other tactics, to preserve its dominance over the smartphone market.","Apple’s practices also allegedly restrict iPhone users and developers from accessing alternative app stores, which could compete with Apple’s fees. The DOJ claims that Apple arbitrarily enforces its App Store rules and penalizes developers who use technologies that could disrupt its monopoly power.","Some examples cited include nonfungible token (NFT) marketplaces like OpenSea disabling certain features on their iOS apps due to the 30% fee and a Bitcoin-friendly social app called Damus removing its BTC tipping feature after Apple delisted it for not using its in-app payments system.","Additionally, Apple’s control extends to web apps accessed through iOS devices, as the company requires all iOS web browsers to use its WebKit browser engine. The DOJ also accuses Apple of denying access to competing digital wallets and preventing developers from providing customers with payment services.","The officials leading the case stress that no company should be above the law, no matter how big they are. They’re determined to enforce antitrust laws to protect consumers and promote fair competition in the market.","In response, a spokesperson from Apple stated that the DOJ’s complaint is inaccurate and that they will vigorously defend against it. The company argues that the lawsuit could set a dangerous precedent by giving the government excessive control over technology design.","Following the news of the lawsuit, Apple’s shares [NASDAQ: AAPL] fell by 4% to approximately $171, remaining flat in after-hours trading, according to Google Finance.","Read more news stories about Apple:\n",""],"entity":[{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"March 21, 2024","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NBC News (","content":"ORGANIZATION"},{"type":"District of New Jersey","content":"ORGANIZATION"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"\" AG Garland","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Google Finance","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Merrick Garland","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"$171","content":"MONEY"},{"type":"fiscal year 2023","content":"DATE"},{"type":"Damus","content":"PERSON"},{"type":"US District Court","content":"ORGANIZATION"}],"hashtag":["Apple","Lawsuit","US DOJ"],"authors":["Hassan Shittu"]}