{"summary":"Robinhood Moves To the Rich Side as Crypto Enters Its ‘Netscape Moment’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/robinhood-picks-the-rich-side-as-crypto-enters-its-netscape-9053.htm","publishDate":"2021-01-28T16:53:00","id":20145,"type":null,"title":"Robinhood Moves To the Rich Side as Crypto Enters Its ‘Netscape Moment’","category":["Bitcoin News "],"content":["In the midst of a major battle between Wall Street professionals and retail traders from the r\/WallStreetBets subreddit, investing app Robinhood has suspended Gamestop (GME) and some other stocks buying today, citing the concerns of “significant market volatility.” The action has prompted dissatisfaction amongst retail traders and crypto proponents. Nevertheless, you can still sell those stocks.","Source: Adobe\/dennizn","____\nUpdated on January 29: Robinhood CEO Denies Being Directed to Halt GME Buying\n____","The enormous surge in GameStop price continued today, as it reached USD 500 even in pre-market hours. However, as various apps started limiting access to trading, after hitting USD 514.5 earlier today, GME crashed to USD 126 (16:21 UTC).","After halting the traders, Robinhood, which reportedly has around 13m users, issued the following statement:","“We continuously monitor the markets and make changes where necessary. In light of recent volatility, we are restricting transactions for certain securities to position closing only, including $AMC, $BB, $BBBY, $EXPR, $GME, $KOSS, $NAKD and $NOK. We also raised margin requirements for certain securities.”","The action has prompted a massive wave of dissatisfaction amongst retail traders, many of whom are reminding the company of its mission to “democratize finance for all.” For example, popular stock trader Dave Portnoy called it “Goodell level treachery.”","","We’re just making up rules as we go here. This is some Goodell level treachery. #DDTG pic.twitter.com\/zGITHC9oix","","Individual investors are being stripped of their ability to trade on @RobinhoodApp\n\nMeanwhile hedge funds and institutional investors can continue to trade as normal.\n\nWhat do you call a market that removes retail investors ability to buy to save institutional investors shorts? https:\/\/t.co\/G0hQFJDaG4","","Lets make this a bit easier.\nThe complaint form is here:https:\/\/t.co\/mkpm8wiUuE","Active cryptocurrency advocates have not remained silent as well, as many are calling this action unprecedented hypocrisy and are using the occasion to remind the traditional market participants of the importance of decentralized finance. According to popular crypto investor WhalePanda, this might be the most eye-opening event for many.","","You need to put back $GME and the other stocks you removed or we will end you!","","There's no way Robinhood came up with a \"destroy our brand\" decision without being pushed into a corner by someone with power.\n\nIn preparation for these hearings, I'm taking long positions in popcorn companies","Meanwhile, in his latest newsletter, Bitcoin (BTC) proponent Anthony Pompliano of Morgan Creek Digital, stated that the ongoing series of events is “the best marketing campaign for the future digital, decentralized financial system.” In his words:","“Bitcoin is throwing the middle finger to central banks. Decentralized exchanges are telling centralized peers to kick rocks. Digital assets that trade 24\/7\/365 without manipulation or intervention is where we are all heading. Whether you’re rich\/poor, American\/Chinese, smart\/dumb, or informed\/uninformed, you will be allowed to participate in the markets.”","Other market participants cried foul, too. Messari’s founder and CEO Ryan Selkis called this day a “crypto’s Netscape moment,” and was disgusted by the coordinated main street effort to curb “retail market manipulation.” “Netscape moment” refers to the dawn of a new industry.","The CEO wrote:","“The sideshow of the GameStop retailers vs. Melvin hedge fund managers was entertaining to watch at least. But seeing Wall Street Bets get summarily executed on Discord; Robinhood suspend buying of retail investors’ preferred stocks; and tech influencers (Chamath, Elon, Portnoy) stoke flames of populist outrage really hits a trifecta. The winnings will be paid out in crypto.”","Selkis also suggested:"," ","BTC trades at USD 32,223 and is up by 5% (16:56 UTC) in a day, trimming its weekly losses to almost 9%. The price is still up by 19% in a month and 263.5% in a year.\n____","","Inquiries into freezes should not be limited solely to Robinhood.\n\nThis is a serious matter. Committee investigators should examine any retail services freezing stock purchases in the course of potential investigations – especially those allowing sales, but freezing purchases.","","We don’t know all the facts yet. It is quite possible Robinhood was leaned on by the SEC, a banking partner, or one of many other regulators \/ regulated entities they are beholden to.\n\nWe’re seeing the limits of fintech vs crypto in real-time. Not your rails, not your stocks. https:\/\/t.co\/553tRc4BIy","","I'm assuming that the next time a hedge fund starts to make too much money shorting and destroying a business, that they will be de-platformed from their Blomberg terminal and throttled by their prime broker in the name of orderly markets and consumer protection.","","\"All animals are equal, but some animals are more equal than others.\" https:\/\/t.co\/pnhzBD2iHo","",".@RobinhoodApp bending the knee to their hedge fund overlords and removing $GME and other stocks from their platform.\n\nThis is going to backfire. pic.twitter.com\/VdzD9ps9gf","","Investment platforms turning off trading for select stocks demonstrates the importance of buying real #Bitcoin instead of $GBTC or any other artificial exposure to BTC.","","Robinhood realized they would be liable for allowing unsuitable option trading for most of their clients and therefore would be on the hook for losses. So they opted to screw their customers versus risk insolvency. That’s Wall Street my friends. $amc $gme $nok","","Prime brokers only halt trades for clients facing a margin call or significant counterparts risk. Right now the risk isn’t on Robinhood, unless regulators ordered them to do so","","This might be one of the best things to have happened for crypto.\nIt shows how retail is getting fucked over by big companies.#Bitcoin is the vaccine against corporate overlords.https:\/\/t.co\/dUCFyxyHso","","Reminder: Robinhood, which was planning on a $20b+ IPO, gives away its core service for free. It makes money by selling its users’ data to… giant Wall Street funds. https:\/\/t.co\/ZRuZ4OgZJg","https:\/\/www.twitter.com\/MoonOverlord\/status\/1354779385681731586","","In what world does @RobinhoodApp team decide to fuck over the retail traders?\n\nThousands of stories of traders changing their lives and they could have sided with the underdogs and been a champion for the people.\n\nInstead, they became a villain.\n\nThis will not end well for them.","","LMAO JUST LOOK AT THE ROBINHOOD PINNED POST AND NOW THEY'RE JUST BANNING BUYING. https:\/\/t.co\/yLMLouiJzA","___\nLearn more:\nA Look Into the Trending Decentralized Social Media Experience: Mastodon\nCentralized Money Has ‘Never Been Good’ – US Congressman\nDavos Watch: ‘Don’t Take Things For Granted For The Next Decades’\nDavos 2021 & A ‘Great Reset’: We Can’t Count On the Same Old Globalists\nCapitalism and The Coronavirus Crisis: The Coming Transformation(s)"],"entity":[{"type":"Adobe\/dennizn","content":"ORGANIZATION"},{"type":"$EXPR","content":"MONEY"},{"type":"Dave Portnoy","content":"PERSON"},{"type":"Robinhood CEO Denies Being Directed","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$KOSS","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"US Congressman\nDavos Watch","content":"ORGANIZATION"},{"type":"Chamath","content":"LOCATION"},{"type":"Elon","content":"LOCATION"},{"type":"$NAKD","content":"MONEY"},{"type":"$NOK","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"Gamestop (GME","content":"ORGANIZATION"},{"type":"$20b","content":"MONEY"},{"type":"Portnoy","content":"PERSON"},{"type":"GME","content":"ORGANIZATION"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Goodell","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"$AMC","content":"MONEY"},{"type":"$BBBY","content":"MONEY"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"Davos","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"$BB","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"263.5%","content":"PERCENT"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$GME","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Netscape","content":"ORGANIZATION"},{"type":"Blomberg","content":"PERSON"},{"type":"$GBTC","content":"MONEY"},{"type":"January 29","content":"DATE"},{"type":"$amc $gme $nok","content":"MONEY"}],"hashtag":["Anthony Pompliano","Bitcoin","Decentralization","DeFi","Ethereum","Robinhood","Trading"],"authors":["Eimantas Žemaitis"]}