{"summary":"Former Binance CEO CZ Released on $175 Million Bond, Sentencing Hearing Set for February 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/former-binance-ceo-cz-released-on-175-million-bond.htm","publishDate":"2023-11-22T04:59:57","id":20151,"type":null,"title":"Former Binance CEO CZ Released on $175 Million Bond, Sentencing Hearing Set for February 2024","category":["News "],"content":["The founder and former CEO of Binance, Changpeng “CZ” Zhao, has been released on a $175 million personal recognizance bond.","This follows his guilty plea to charges of violating the Bank Secrecy Act. A plea made during a court appearance where federal officials accused him of directing Binance to allow U.S. customers onto the platform without proper know-your-customer or anti-money laundering checks.","CZ could still face a maximum sentence of 18 months in prison as per the plea deal.","CZ out on $175m bond pic.twitter.com\/UL80rNlfQR","— db (@tier10k) November 21, 2023","","As part of his release conditions, Zhao is posting $15 million held in a trust account by Davis Wright Tremaine, separate from the bond, and agreeing to forfeit funds if he violates the terms.","Two guarantors, pledging $250,000 and $100,000 respectively, further support his release. A sentencing hearing is now scheduled for February 23, 2024, at 9 a.m. Pacific Time.","Zhao is also prohibited from breaking the law, tampering with witnesses or victims, and consuming non-prescribed controlled substances – standard provisions in a bond release.","The order seemingly permits Zhao to leave the U.S., with the condition that he returns 14 days prior to sentencing. Federal prosecutors, however, expressed their intention to appeal this provision to a higher judicial authority.","Zhao’s resignation from Binance, announced as part of the settlement with the U.S. Department of Justice, involves the exchange paying a hefty $4.3 billion in penalties to various federal agencies.","Additionally, the settlement mandates rigorous oversight through multiple monitors for Binance’s operations over the next five years. Attorney General Merrick Garland highlighted the significance of this penalty during a press conference, noting it as one of the largest ever obtained from a corporate defendant in a criminal matter."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Pacific Time","content":"ORGANIZATION"},{"type":"$175 million","content":"MONEY"},{"type":"Zhao","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"February 23, 2024","content":"DATE"},{"type":"Merrick Garland","content":"PERSON"},{"type":"$175m","content":"MONEY"},{"type":"November 21, 2023","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Davis Wright Tremaine","content":"PERSON"},{"type":"9 a.m.","content":"TIME"}],"hashtag":["Binance","Changpeng Zhao"],"authors":["Jai Pratap"]}