{"summary":"Crypto Community Talk Guns After Another Brutal Robbery","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-community-talk-guns-after-another-brutal-robbery-3428.htm","publishDate":"2019-02-25T12:38:29","id":20159,"type":null,"title":"Crypto Community Talk Guns After Another Brutal Robbery","category":["Bitcoin News "],"content":["Crypto community is disturbed by the brutal robbery attempt in the Netherlands. On February 10, three armed robbers with police vests broke into a residential building and tortured 38 years old Bitcoin trader for over an hour using a drill, reported the biggest Dutch news portal De Telegraaf.","According to the report, all this happened in front of his terrified four-year-old daughter. The victim was seriously injured and is now being treated in a hospital. The motive for the robbery is unknown, but the victim was known to be wealthy and involved in Bitcoin trading.","Although the police refused to disclose any extra details, rumor has it that the assailants did not manage to force the person to give them access his Bitcoin holdings.","Now, fifteen Dutch police officers are investigating the robbery which happened in a small village of Dourwenerveen, Drenthe. The police report that it is not the first brutal robbery attempt in the Drenthe province, but it is one of the first cases where attackers targeted Dutch digital asset holders.","The nature of digital assets makes them easily transferable, immutable and somewhat anonymous. The traders who hold sizeable amounts and are vocal about it are easy targets for both online scammers and real-life burglars. Such a disturbing event is a reminder to the crypto community to maintain low-profile when it comes to crypto investments.","Meanwhile, according to Bitcoin pioneer and cryptographer Nick Szabo, firearms are critical security instruments when it comes to protecting yourself offline.","His comment has sparked a debate among the cryptocurrency holders and whether firearms would have changed anything in this particular case.","In either case, it is not the first time when Bitcoin and cryptocurrency holders become victims of a robbery. Crypto robberies at gunpoint and kidnappings of wealthy digital asset holders have been happening throughout 2018.\n_____","Before you go and buy yourself a gun or install the latest security system in your home, you should know that there are cheaper and perhaps more sensible precautions that you can take.",""],"entity":[{"type":"Drenthe","content":"ORGANIZATION"},{"type":"Nick Szabo","content":"PERSON"},{"type":"February 10","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Dourwenerveen","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crime","Security","Society"],"authors":["Eimantas Žemaitis"]}