{"summary":"DTCC, which serves as the bedrock of Wall Street&#x27;s post-trade infrastructure, has a history of involvement in the blockchain space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258627\/dtcc-acquires-blockchain-startup-securrency-to-fast-track-defi-efforts","publishDate":"2023-10-20T06:23:39","id":2015,"type":null,"title":"DTCC acquires blockchain startup Securrency to &#x27;fast-track&#x27; DeFi efforts","category":["MERGERS & ACQUISITIONS"],"content":["The Depository Trust &amp; Clearing Corporation has acquired blockchain technology firm Securrency for $50 million, with Securrency becoming a wholly-owned subsidiary of DTCC and operating as DTCC Digital Assets.<br data-v-f87c67ca=\"\">\n&nbsp;","DTCC — the financial services company that sits behind Wall Street's trades — announced the acquisition of blockchain technology firm Securrency, the firm said in a press release.&nbsp;","According to the announcement, both companies have inked an agreement for the acquisition, which will lead to Securrency becoming a wholly-owned subsidiary of DTCC and subsequently operating under the name DTCC Digital Assets.","Led by former State Street crypto executive Nadine Chakar, Securrency provides a platform enabling clients to tokenize real-world assets through what it touts as \"the industry's most comprehensive, patented compliance technology.\"","Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-10-19\/dtcc-buys-blockchain-startup-securrency-to-expand-with-digital-ledger-tech#xj4y7vzkg\" data-v-f87c67ca=\"\">reported<\/a> that DTCC snapped up the startup for $50 million. The acquisition of Securrency, according to a press release, will \"fast-track development of its enterprise digital asset platform to unlock the power of institutional DeFi.\"","\"As we join forces with DTCC, we are excited to bring together DTCC’s infrastructure capabilities with Securrency’s technology to embrace a future where the digitization of capital markets is at the forefront of innovation,\" Chakar said in a release announcing the deal. \"These capabilities will allow DTCC to partner with the industry to build a resilient and scalable infrastructure critical to the mass adoption of digital assets.\"","DTCC, which serves as the bedrock of Wall Street's post-trade infrastructure, has a history of involvement in the blockchain space. In 2022, as <a href=\"https:\/\/www.coindesk.com\/business\/2022\/08\/22\/wall-streets-dtcc-launches-private-blockchain-platform-to-settle-trades\/\" data-v-f87c67ca=\"\">reported<\/a> by CoinDesk, the company initiated tests on a private blockchain designed to facilitate the clearing and settlement of stock trades. Supporters of transitioning equity trading infrastructure to blockchain anticipate improvements in efficiency and settlement speed. Traditionally, equity trades in the U.S. take two days to settle.&nbsp;","Elsewhere, <a href=\"https:\/\/paxos.com\/securities-settlement\/\" data-v-f87c67ca=\"\">Paxos<\/a> is waiting for the green light from U.S. regulators to expand its own securities settlement platform, which would offer real time clear and would essentially compete with DTCC.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nadine Chakar","content":"PERSON"},{"type":"Securrency","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Depository Trust &amp; Clearing Corporation","content":"ORGANIZATION"},{"type":"State Street crypto","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Chakar","content":"PERSON"},{"type":"DTCC Digital Assets","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["PRIVATE COMPANY M&AMP;A"],"authors":["Frank Chaparro","The Block"]}