{"summary":"This Bitcoin Debate is Now Hotter than Binance Hack","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/this-bitcoin-debate-is-now-hotter-than-binance-hack-3826.htm","publishDate":"2019-05-08T15:58:00","id":20158,"type":null,"title":"This Bitcoin Debate is Now Hotter than Binance Hack","category":["Bitcoin News "],"content":["If anything managed to overshadow the Binance hack that cost them more than BTC 7,000 (USD 40 million), it is the idea, mentioned by their CEO Changpeng Zhao, to roll back all the Bitcoin transactions that happened in the past few days in order to recover the lost funds and “teach [hackers] a lesson.” Ironically, the only lesson being taught all over the cryptoverse is what a tremendously terrible idea this would be. But the question remains: could this happen? And what would it truly mean?","Interestingly, in the livestream where the idea was first floated, CZ said that he hadn’t slept for the last 29 hours – which could serve to explain why the idea was uttered in the first place.","In either case, while this hot discussion is still ongoing and is more complex than we could cover in this article, below are only the main points that are being discussed.","Although CZ tweeted that “it’s not possible, bitcoin ledger is the most immutable ledger on the planet,” evidence suggests otherwise. The short answer to the above question is yes. But as Twitter user Tanuki (@TanukiBTC) pointed out today, “It’s technically also possible that ALL miners stop mining Bitcoin and let it die. But is it likely to happen?”","Bitcoin counts on its miners to not share the same goals other than making a profit from mining bitcoins and transaction fees. But if a better profit could be made through the rollback than through your usual mining process, then the chances of the rollback happening would significantly increase, argues Ari Paul, CEO and co-founder of crypto asset investment firm BlockTower Capital.","“If the exchange could think of a way to reward every miner that supports the reorg [blockchain reorganization] more than those who oppose it, that might be enough to cause the reorg by turning this into a classic prisoner’s dilemma,” he explained on Twitter, adding, “Is this a bad thing for Bitcoin? Maybe. One way to think about all of this is just as a cypherpunk free market rising organically from Satoshi’s competitive mining game theory solution for BFT. It’s just economic actors playing the game.”","Bitcoin developer Tamas Blummer went even further, publishing a Medium post that explains the process of bribing miners to do a reorg.","“Consequences of miners acting on a bribe could be severe as the reorg can disrupt regular transaction processing and diminish trust into the block chains immutability. Damages would be proportional to the length of the reorg. I think damage would be negligible if the rescue maneuver is executed within hours as a reorg of a few blocks is not an event in the technical sense and would not noticeable delay regular transaction processing,” Blummer concluded.","However, this is also an expensive game to play. Bitcoin developer Jimmy Song even did the maths:","Moreover, it would take more than a day for miners to agree, which increases costs even more, Song stressed, adding that there are significant risks for miners also as they earn around BTC 1,800 per day from mining rewards in total.","“There’s a reason people don’t go around trying to reorg, even in the aftermath of large thefts. A reorg doesn’t just hurt the thief, but it also hurts everyone else. There’s a huge collective incentive to not change history,” Song concluded in an article published today.","There are other problems too, as crypto researcher and analyst Willy Woo points out: “If you can convince 100% of miners to stop then divert work into the reorg then the network stops for at least as long as total time elapsed since hack to compute the reorg. If you convince less, say closer to 50% of the network, the time to reorg trends quickly to infinity.”","The most popular Bitcoin educator Andreas M. Antonopoulos also joined the debate:","“Your scientists were so preoccupied with whether or not they could, they didn’t stop to think if they should,” is a very memorable quote from Jurassic Park. Now it translates to crypto as well. Michael Novogratz, CEO of merchant bank dedicated to the digital assets and blockchain Galaxy Digital, tweets: “I am shocked that [Changpeng Zhao] even went there. Talk of forking or reorganizing the blockchain is close to heresy. When the Ethereum community did it the project was like 5 months old. A baby. Bitcoin now has USD 100bn market cap and is a legitimate store of wealth.”","Ethereum co-founder Vitalik Buterin – whose initial reaction to the idea was just tweeting “Wait what?” – argues that the Ethereum “reorg” after the infamous DAO hack (which also gave birth to Ethereum Classic) wasn’t even a reorg to begin with.","Still, CZ claims he’s being misunderstood: “To clarify, the proposal by [Jeremy Rubin] & [James Prestwich] is to construct a [transaction] that would keep all other [transactions], and just distribute the hacker coins to miners (about 300 BTC\/block prod). It’s not: rollback of any [transactions], nor is it reverting funds back to Binance.”","Meanwhile, Vlad Zamfir, Ethereum’s star researcher, writes, “It is indeed heretical to ask participants in blockchain governance for help recovering funds (#immutability) But it’s no secret that it’s technically possible to recover the funds.”","However, what the future might bring?","As developer and Bitcoin enthusiast Udi Wertheimer points out, this is “what you should be concerned about”:\n* “what if 500,000 BTC gets stolen?\n* what if exchange won’t be able to make users whole?\n* lovable influencer says “we should reorg”?”","“I’d argue it would still be impossible, but the drama could be real and painful. That’s why we must learn from this, stay vigilant, and not cut people some slack when making these suggestions in “test runs” like this one,” he said.","However, Tushar Jain, managing partner at crypto fund Multicoin Capital, which is a well known investor in Binance Coin, argues that “as the Bitcoin block reward drops by ~90% in the next 10 years, it would make it much easier to roll back the chain in the case of hacks such as the recent Binance hack. In fact, this might become so common as to actually serve as a deterrent to future hacks.”","In either case, while the rollback now looks possible only in theory, the community was quick to whip out Photoshop and make fun of the “CZ as a god” idea.",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Jeremy Rubin","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Bitcoin enthusiast Udi Wertheimer","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Andreas M. Antonopoulos","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"last 29 hours","content":"DATE"},{"type":"James Prestwich","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Binance Coin","content":"LOCATION"},{"type":"Jurassic Park","content":"LOCATION"},{"type":"Vlad Zamfir","content":"PERSON"},{"type":"BFT","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Michael Novogratz","content":"PERSON"},{"type":"Tushar Jain","content":"PERSON"},{"type":"Tamas Blummer","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ari Paul","content":"PERSON"},{"type":"infinity","content":"ORGANIZATION"}],"hashtag":["Binance","Bitcoin","Changpeng Zhao","Community","Hack","Security"],"authors":["Sead Fadilpašić"]}