{"summary":"What’s Happening In Crypto Today? Daily Crypto News Digest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-news-today.htm","publishDate":"2024-05-15T11:00:21","id":20154,"type":null,"title":"What’s Happening In Crypto Today? Daily Crypto News Digest","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news today – investigating the stories flying under the radar of today’s news.","","In crypto news today:","","__________","The global cryptocurrency market capitalization dropped 1.6% over the past 24 hours to $2.37 trillion.","Only 11 coins out of the top 100 by market cap have seen their prices increase.","The biggest rise out of these eleven is PEPE’s 11% to $0.00001134.","It is followed by FLOKI, with an increase of 8.1%, trading at $0.0002064.On the other hand, Worldcoin (WLD) fell the most: 7.4% to $4.85.","Render (RNDR) and Ethena (ENA) are close with a 7.2% decrease each to $10.24 and $0.6992, respectively.","Now, looking into the top 10 coins, we find that none are green.","","The drops are not high, however.","The highest is Dogecoin (DOGE)’s 3.8%, now trading at $0.14677.","Binance Coin (BNB) is in second place, having dropped 3.2% to $569.The rest are down less than 2%.","Bitcoin (BTC)’s price decreased by 0.2%, changing hands at $61,900.At the same time, Ethereum (ETH) fell 0.5%, trading at $2,905.Meanwhile, the cryptocurrency market recorded the launch of over 1 million new tokens since the beginning of April.","Ethereum saw over 370,000 new tokens, and Solana has 640,000 new tokens, mostly consisting of meme coins.","In crypto news today, Bitcoin Ordinals and Runes startup OrdinalsBot has recorded over $4 million in revenue for the first quarter of 2024. It now has over 200,000 individuals using the platform.","According to the press release, OrdinalsBot is behind 80% of the ten largest files inscribed on the Bitcoin blockchain. Recently, the team set a new record by inscribing Logos’ manifesto – currently the largest-ever Bitcoin block.","Also, OrdinalsBot Inscribed more than 150,000 Ordinals from the top 100 Ordinals collections by market cap, as well as 3 of the top 20 Ordinals collections in the top 20 by market cap (Runestone, Prometheans by CyberKongz, and Pizza Ninjas).","Excited to announce our Q1 results with $4M+ in revenue and 80% of the 10 largest files inscribed on #Bitcoin blockchain.","✔️ Collabs with top artists like @FrencHMonTanA and @GhostfaceKillah\n✔️ Partnerships with industry leaders\n✔️ $TRIO utility token launch on BRC-20","We're… pic.twitter.com\/agwj0AqNUU","— OrdinalsBot ⚡ (@ordinalsbot) May 14, 2024","","The Q1 success has paved the way for additional partnerships and launches in the coming months.","So far, OrdinalsBot has collaborated with industry leaders, such as Marathon Digital Holdings, Xverse, Leather, ALEX, Oyl, Mintlayer, Atomiq DeFi, Sulu, and TeleportDAO.","Furthermore, it collaborated with musicians, inscribing unique musical Ordinals for French Montana and Ghostface Killah of Wu-Tang Clan.","It has a “long pipeline” of partnerships and launches in Q2. These new collaborations will drive growth and allow builders, creators, and collectors to more easily create and mint fungible and non-fungible tokens, Ordinals, and Runes on the Bitcoin blockchain, the team said.","These announcements follow OrdinalsBot’s recent oversubscribed $3 million funding round.","Smart account infrastructure Safe has introduced a new native token swap feature in partnership with CoW Protocol, built directly into the multisig wallet Safe{Wallet}. Previously, Safe{Wallet} users who wanted to swap tokens had to use external websites. But the integrated swaps feature “significantly improves the user experience,” the team said.","According to the announcement, the feature integrates CoW Protocol, leveraging its advanced aggregation and intent-based architecture to access a vast liquidity pool across decentralized exchanges. It fetches quotes across multiple decentralized liquidity sources.This offers Safe{Wallet} users low prices and a wide selection of tokens for trades on CoW Protocol, it said.","👁️ Take a closer look at how Safe{Wallet}'s Native Swaps enhance your trading with our new feature walkthrough video.","Experience the simplicity and security firsthand!🎥https:\/\/t.co\/A5rdzMRvnl","— Safe (@safe) May 14, 2024","","Furthermore, the new swap feature ensures greater accuracy, the announcement said.","It utilizes an intent-based swap mechanism that supports batched execution and minimizes the likelihood of errors or expirations that are common with multi-signature transactions.","Safe{Wallet} has an average of $450 million in swap volume per month since June 2023 and nearly $1 billion in March alone.","Over the last three years, Safe Smart Accounts facilitated $23 billion in swap volume.","This “highlights the immense demand for seamless asset swaps within the Safe community,” the team said.","In other crypto news today, Ripple’s University Blockchain Research Initiative (UBRI) announced that Morgan State University in Baltimore, USA, has received a 3-year, $1,050,000 grant for the continued advancement of blockchain, crypto, and FinTech research, education, and programming.","Per the press release, as part of that, this is a part of UBRI’s recently renewed partnership with the University, building upon their initial collaboration that began in 2018.","It “highlights the program’s commitment to supporting blockchain innovators across America’s Historically Black Colleges and Universities (HBCUs),” it said.","This funding will ensure the continuation of the National FinTech Center at Morgan State University, focusing on leveraging cutting-edge technologies to revolutionize finance and technology sectors.","Ripple's #UBRI program has been shaping the future of blockchain education and research for over six years! 🎓⭐️","Learn about our renewed $1.05 million partnership with @MorganStateU and how we're supporting blockchain innovators at HBCUs: https:\/\/t.co\/u85BhmXq24","— Ripple (@Ripple) May 14, 2024","","Meanwhile, UBRI has more than 50 university partners across 26 countries, over 600 new or expanded FinTech courses, and 1,500 academic blockchain research projects.","It also resulted in the creation of innovative programming like the student-led MorganHacks. The winning submission, CarbonKarma, uses decentralized, community-driven incentives to reward travelers for choosing sustainable options.","BIG NEWS! 🔥 $1.05M investment from @Ripple fuels Morgan State's National FinTech Center! Find out how this grant keeps us leading the charge in #FinTech education, research for our students, and collaborating #HBCUs. ⬇️ #R2NextStopR1 https:\/\/t.co\/Ymoi89OOfX","— Morgan State University (@MorganStateU) May 14, 2024","","With this latest grant, Morgan State aims to engage other HBCUs and combine collaborative research and real-world applied learning opportunities to create highly trained professionals for blockchain jobs.","Proposed activities include boundary-pushing tech research; faculty-led projects intersecting blockchain, artificial intelligence (AI), and machine learning (ML); XRPL development workshops and programs; and an annual national blockchain and FinTech conference.","__________","For the latest crypto news updates, bookmark this page and subscribe to our newsletter!"],"entity":[{"type":"8.1%","content":"PERCENT"},{"type":"Bitcoin Ordinals","content":"PERSON"},{"type":"OrdinalsBot Inscribed","content":"ORGANIZATION"},{"type":"3.8%","content":"PERCENT"},{"type":"7.4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.6%","content":"PERCENT"},{"type":"$1,050,000","content":"MONEY"},{"type":"0.5%","content":"PERCENT"},{"type":"$0.6992","content":"MONEY"},{"type":"Mintlayer","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"OrdinalsBot","content":"ORGANIZATION"},{"type":"Xverse","content":"LOCATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"$1.05 million","content":"MONEY"},{"type":"$2,905","content":"MONEY"},{"type":"$23 billion","content":"MONEY"},{"type":"Ghostface Killah of Wu","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"0.2%","content":"PERCENT"},{"type":"University","content":"ORGANIZATION"},{"type":"Morgan State","content":"ORGANIZATION"},{"type":"Marathon Digital Holdings","content":"ORGANIZATION"},{"type":"National FinTech Center","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Atomiq DeFi","content":"ORGANIZATION"},{"type":"$0.0002064","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$4M","content":"MONEY"},{"type":"Pizza Ninjas)","content":"ORGANIZATION"},{"type":"$569","content":"MONEY"},{"type":"$450 million","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"7.2%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"USA","content":"ORGANIZATION"},{"type":"$4.85","content":"MONEY"},{"type":"3.2%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"UBRI","content":"ORGANIZATION"},{"type":"Ethena (ENA","content":"ORGANIZATION"},{"type":"$0.14677","content":"MONEY"},{"type":"Montana","content":"LOCATION"},{"type":"$1.05","content":"MONEY"},{"type":"Sulu","content":"LOCATION"},{"type":"$0.00001134","content":"MONEY"},{"type":"$2.37 trillion","content":"MONEY"},{"type":"Baltimore","content":"LOCATION"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"Tang Clan","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"$TRIO","content":"MONEY"},{"type":"America","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$10.24","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Ripple’s University Blockchain Research Initiative (UBRI","content":"ORGANIZATION"},{"type":"$61,900","content":"MONEY"},{"type":"Morgan State University","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Best Crypto","Bitcoin","Crypto News"],"authors":["Sead Fadilpašić"]}