{"summary":"Bitcoin miner Core Scientific said there was “substantial doubt” that it could keep operations going past November 2023, while struggling to look for additional financing and cut costs.\nThe company posted a net loss of $434.8 million in the third quarter, compared to $862 million in the previous one.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189088\/core-scientific-warns-of-substantial-doubt-to-continue-operations-posts-435-million-loss","publishDate":"2022-11-22T11:57:28","id":2016,"type":null,"title":"Core Scientific warns of &#x27;substantial doubt&#x27; to continue operations, posts $435 million loss","category":["Crypto Infrastructure"],"content":["Bitcoin miner Core Scientific will need extra liquidity to keep operations going past November 2023 — and it's facing a steep uphill battle to do so.","\"The ability to raise funds through financing and capital market transactions is subject to many risks and uncertainties and current market conditions have reduced the availability of these capital and liquidity sources,\" the company said in a Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1839341\/000162828022030600\/core-20220930.htm\" data-v-f87c67ca=\"\">filing<\/a>. \"Substantial doubt exists about the Company’s ability to continue as a going concern through November 2023.\"","The miner also posted revenue of $162.6 million in the third quarter, down 0.9% from the previous period. Net loss was $434.8 million, compared to $862 million in the second quarter, and a total of $1.7 billion in the first nine months of the year.","The company had already warned that it <a href=\"https:\/\/www.theblock.co\/post\/180358\/core-scientific-to-run-out-of-cash-by-the-end-of-2022\" data-v-f87c67ca=\"\">might run out of cash by the end of the year<\/a> and that it would not make payments in late October.","Core's woes reflect the struggles of the industry, which has faced rising power costs combined with decreased bitcoin prices and higher mining difficulty. Compute North has already <a href=\"https:\/\/www.theblock.co\/post\/172246\/compute-north-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed for bankruptcy<\/a>, while Argo said it was <a href=\"https:\/\/www.theblock.co\/post\/181291\/argo-blockchain-shares-fall-bitcoin-miner-negative-cash-flow\" data-v-f87c67ca=\"\">facing negative cash flow<\/a>.","Core says it has taken steps to cut operating costs, eliminate and delay construction expenses, and reduce and delay capital expenditures, while it also attempts to increase hosting revenue. It has hired law firm Weil Gotshal &amp; Manges and financial advisor PJT Partners to help find alternatives to improve liquidity.","\"The Company and its advisers have begun to engage in discussions with certain of its creditors regarding these initiatives,\" it said in the filing. \"Among possible alternatives, the Company may explore liability management transactions, including exchanging its existing debt for equity or additional debt, which transactions may be dilutive to holders of the Company’s common stock.\"","It may also pursue additional financing, asset sales or bankruptcy protection. Core is by far the largest company in the industry by computing power. It is both a hosting provider for third parties and a bitcoin miner itself.","Core&nbsp;recognized that it has opened itself to a host of lawsuits. A number of law firms are now pursuing class action lawsuits, including <a href=\"https:\/\/www.johnsonfistel.com\/investigations\/core-scientific-inc-2\" data-v-f87c67ca=\"\">Johnson Fistel<\/a> and <a href=\"https:\/\/www.johnsonfistel.com\/investigations\/core-scientific-inc-2\" data-v-f87c67ca=\"\">Schall Law Firm<\/a>, which both claim that Core made \"misleading statements\" to the market. It is also involved in a legal dispute with the mining arm of bankrupt Celsius over <a href=\"https:\/\/www.theblock.co\/post\/176589\/core-scientific-wants-celsius-to-pay-its-mining-bills-amid-bankruptcy-process\" data-v-f87c67ca=\"\">claims of missed payments<\/a>.","The company said last month that it had about $1 billion in debt, with some of its <a href=\"https:\/\/www.theblock.co\/post\/180546\/massmutual-blockfi-are-among-bitcoin-miner-core-scientifics-biggest-creditors\" data-v-f87c67ca=\"\">biggest lenders including<\/a> BlockFi, investment banking firm B. Riley, crypto financial services firm NYDIG and Anchor Labs. As of Oct. 31, it had 62 BTC and roughly $32.2 million."],"hashtag":["EARNINGS","MINING COMPANIES"]}