{"summary":"Bitcoin Lightning Network Is Growing Faster Than You Think","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-lightning-network-is-growing-faster-than-you-think.htm","publishDate":"2021-10-06T10:19:00","id":20171,"type":null,"title":"Bitcoin Lightning Network Is Growing Faster Than You Think","category":["Bitcoin News "],"content":["The usage of the Lightning Network is growing faster than seen in the available public statistics, according to Norwegian crypto-focused research firm Arcane Research. As the network is increasingly used for everyday purposes, we could be on a path of Bitcoin (BTC) adoption that will see hundreds of trillions of Lightning transactions each year by 2030, they estimate.","The report, powered by BTC payments company OpenNode and titled The State of Lightning, has aimed to provide “the most comprehensive overview of usage on the Lightning Network seen to date,” per the firm.  ","One of the major points made in the report is that the Lightning usage is actually growing faster than the public metrics show. Statistics such as total channel capacity and the number of nodes show that the Lightning Network is growing rapidly.","According to 1ML data, the number of Lightning nodes increased by 5% in a month, reaching almost 27,600, while the number of channels is up by almost 8%, nearing 75,500. At the same time, the capacity of the LN jumped by 26%, to BTC 2,999, or USD 152m.","While the Lightning Network launched in 2018, the usage growth has picked up significantly in late 2020, getting on a steep upwards trajectory since then, and seeing its growth go parabolic in September 2021. This is the result of El Salvador’s introduction of bitcoin as legal tender, fuelled by others enabling Lightning payments, including Paxful and Twitter.","“However, public metrics do not show the true magnitude of usage growth,” says the firm, which found that the wallet payment volume has increased “far more than the most widely cited growth metric, total channel capacity, over the past year.” It’s up by 20% monthly from January to August 2021, with the equivalent number for public channel capacity being 10%. In September, payment volume almost doubled compared to a 26% increase in public channel capacity.","Growth in payment volume (USD) from wallets on the Lightning Network vs. growth in public capacity (BTC).  Monthly compounded. ","Furthermore, “Lightning usage is pivoting from being dominated by online services to everyday use.” Arcane Research’s Lightning wallet statistics show that the composition of payments is changing with new users getting access to Lightning payments. While payments for online services like trading and gambling have dominated payment volume, “September showed that this is changing rapidly, as personal transfers and payments for more typical everyday use like merchant payments and gift cards grew by double the rate of online services.”","According to Elizabeth Stark, the CEO of Lightning Labs, developer of software that powers the Lightning Network, “Lightning is already enabling people to send money instantly via internet-native global transactions, with immense opportunities in emerging markets,” adding that they are “at the cusp of bringing bitcoin to billions with Lightning.”","The Lightning Network is presented as a solution to Bitcoin’s slow throughput, and without compromising the security of the network – allowing people to send fractions of a bitcoin at near-instant speed at the same time.","But going back to the adoption wave that started with El Salvador, Arcane Research also looked into the potential impact on activity on the Lightning Network from this wave. ","“Broad Lightning adoption will probably take some time, but usage growth will likely be exponential when bitcoin gets a foothold. In a potential scenario for Lightning adoption in El Salvador, close to 90% of the grown population will have access to Lightning payments by 2026,” the researchers said.","Additionally, they estimate that the monthly volume of household expenditure and remittance payments on the Lightning Network will grow to some USD 650m and 20m transactions every month.","A potential scenario for Lightning usage from household expenditure and remittance payments in El Salvador until 2030.","Then, if this is successful, other countries will likely follow El Salvador, primarily those with poor banking access, inflated national currencies, high reliance on remittances, and a strong dependence on the US dollar. Countries that fit that description, says Arcane Research, have a combined population of 850m. If 10% were to adopt BTC before 2030, that’s 50m more Lightning users. ","“By 2030, these users will be behind [USD] 17 billion in annualized Lightning payment volume and more than 1.2 billion Lightning transactions through household expenditure and remittance payments,” said the report.","A possible scenario for Lightning usage from household expenditure and remittance payments in other poorly banked and dollarized countries until 2030.","The adoption is then expected to continue beyond Lightning’s role as a medium of exchange in poorly banked countries. Arcane Research found that, while gaming rewards and earnings accounted for only an estimated USD 4,000 of incoming transaction volume, they did this on a “whopping” 189,000 transactions, suggesting an average transaction size of 2 cents. ","“These transactions clearly demonstrate the possibility of making minuscule payments on the Lightning Network, potentially allowing users and companies to settle almost instantly and thereby mitigate counterparty risk,” the report stated.","The researchers concluded that,","“The Lightning Network, and the possibility to perform micropayments instantaneously, will most likely change how we pay for certain services. We already see the first steps, but the alternative to stream money will revolutionize many popular services in the future.”","The number of global users for some services where Lightning payments can become an alternative way to pay, include 3bn in gaming, 3bn in video (1bn for paid and 2bn for unpaid services), and 500m in audio. “We then end up with an estimated 700 million users paying for gaming, video, and audio through the Lightning Network by 2030.”","Users of Gaming, Video, and Audio Services Paying with Lightning.","Furthermore, based on a conservative estimate of 1 hour used per day on these services and an average of 25% of this time spent consuming services with Lightning payments, the firm estimates “no less than 364 trillion Lightning transactions per year by 2030.”","The report further noted that, while the development and nodes are based mainly around the Western hemisphere, the usage of Lightning is global, “and users in the emerging markets are clearly present.” ","Data from crypto-only company that offers gift cards Bitrefill suggests that users from developing countries prefer to utilize Lightning payments over on-chain payments. Salvadoran, Brazilian and Nigerian users are the most frequent users of Bitrefill’s Lightning integration, followed by users in South Africa, Poland, Italy, and Russia.","Until August, per the firm’s estimates, the aggregate incoming and outgoing transaction values were close to USD 5m for the commonly used wallets combined. Half of it is used on payments for goods and services, totaling USD 2.4m in August.","But “volume is not the only measure of Lightning usage,” they said. “If we look at the number of transactions, the picture changes quite drastically.” Incoming payments account for a small part of transaction value but “make up the brunt of volume in terms of the number of transactions.” There were almost 250,000 incoming transactions in August, in addition to just under 45,000 transactions between wallets and 60,000 payments for goods and services.\n____\nLearn more: \n– Technically Capable Bitcoin Has Other Mass Adoption Challenges To Solve\n– El Salvador Will Be a Serious Test for Bitcoin’s Layer-2 Networks \n\n– How Bitcoin’s Lightning Network Works Under the Hood \n– Mastering Lightning with Andreas M. Antonopoulos & René Pickhardt "],"entity":[{"type":"90%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"El Salvador","content":"LOCATION"},{"type":"The State of Lightning","content":"ORGANIZATION"},{"type":"September 2021","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"South Africa","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Italy","content":"LOCATION"},{"type":"Andreas M. Antonopoulos & René Pickhardt","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Bitrefill","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2 cents","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Hood \n– Mastering Lightning","content":"ORGANIZATION"},{"type":"Arcane Research","content":"ORGANIZATION"},{"type":"Elizabeth Stark","content":"PERSON"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"26%","content":"PERCENT"},{"type":"17 billion","content":"MONEY"},{"type":"Poland","content":"LOCATION"},{"type":"Lightning Labs","content":"ORGANIZATION"},{"type":"El Salvador","content":"PERSON"},{"type":"Audio Services Paying","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","El Salvador","Twitter"],"authors":["Sead Fadilpašić"]}