{"summary":"Runes Protocol Helps Sustain Bitcoin Mining Industry, But There’s A Catch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/runes-protocol-helps-sustain-bitcoin-mining-industry-but-theres-a-catch.htm","publishDate":"2024-04-25T19:21:46","id":20177,"type":null,"title":"Runes Protocol Helps Sustain Bitcoin Mining Industry, But There’s A Catch","category":["Bitcoin News "],"content":["The fourth Bitcoin halving may be considered to be the most memorable, as industry experts believe this event was unlike any other. ","Bitcoin miners, in particular, were pleasantly surprised, as the recent halving sent BTC transaction fees soaring to record levels. ","As a result, Bitcoin miners saw an impressive amount in total revenue. According to YCharts, miners took in a record $107.8 million on the day of the halving. ","This came as a shock, as the halving was supposed to create a steep cut in revenue for crypto miners since rewards for new data blocks dropped by 50% during the event. ","Yet the launch of Casey Rodarmor’s new Runes protocol – which took place the same day as the Bitcoin halving – proved so popular that it created network congestion, along with unusually high transaction fees. ","To put this in perspective, Bitcoin transaction fees averaged a record $127.97 on April 20, 2024. ","While this might have been frustrating for users sending transactions across the Bitcoin network, miners reaped the benefits. ","Fun fact:","The first 77 blocks of epoch 5 have generated $75,000,000 in miner revenue","For reference, the final 77 blocks of epoch 4 generated just $35,000,000","The halving? More like the doubling.#Bitcoin miners are absolutely eating right now.","— Baylor Landry (@baylorlandry) April 20, 2024","","Jamie McAvity, CEO of Texas-based Bitcoin mining company Cormint, told Cryptonews that the most important post-halving event has been that hashrate has not dropped at all. ","“This was due to high fees being paid by Runes transactions,” McAvity said. “It’s a great sign of bullish activity going forward for this Bitcoin-native asset issuance technology.”","McAvity elaborated that there was a race to get transactions included in the newly launched Rune protocol, which launched at the halving block.","“Bitcoin mining pool ViaBTC found halving block number 840,000,” he said. “Data shows that 37.7 BTC in fees were paid in that block due to Runes.”","McAvity further explained that transaction fees associated with Runes are much higher than typical BTC transaction fees.  ","“Casey Rodarmor, the developer of Runes, set the minimum fee transaction for Runes protocol at 100 satoshi\/Byte. This is an increase in what minimum BTC transactions typically are,” he said. ","McAvity pointed out that ViaBTC currently has a good portion of the mining hashrate (around 15%). Yet he noted that transaction fees have varied widely since the halving, from block to block and certain pools. ","82% of wallets that hold bitcoin cannot move right now due to high fees. https:\/\/t.co\/wWo9FY2QPb pic.twitter.com\/0vKgf9G7RG","— Hector Lopez (@hlopez_) April 20, 2024","","For instance, ViaBTC has outperformed other pools in terms of fees earned, since the method of sharing transaction fees with miners varies between mining pools.","“Cormint’s revenue on the day following the halving was approximately 2 times what it was on the day prior,” McAvity remarked.","Rena Shah, VP of Products at Trust Machines – a team focused on growing the Bitcoin economy – told Cryptonews that since April 20 (the day of the halving) miners had generated over $100 million in rewards, with around $80 million just from transaction fees alone. ","“Runes, along with all the activity happening in the Bitcoin economy is creating new incentives for miners just as mining rewards have decreased again from the halving,” said Shah. ","This appears to be the case. Joe Downie, CMO at Bitcoin mining pool NiceHash, told Cryptonews that the Runes Protocol came as quite a surprise for many, but it certainly gave a boost to miners. ","“Runes increase the amount of transaction fees that miners get in addition to a block reward,” said Downie.","While it’s notable that Runes have boosted the Bitcoin mining industry for the time being, ecosystem participants remain aware of challenges associated with the protocol.","Luke Dashjr, Co-founder of non-custodial Bitcoin mining pool OCEAN, told Cryptonews that while Runes are somewhat compatible with Bitcoin, there are a number of issues. ","“The biggest issue is a design flaw in the bidding mechanism,” said Dashjr. “For instance, failed bids still get mined and fees paid, spamming Bitcoin’s blockchain as a result.”","Dashjr further remarked that he believes use cases for non-currency fungible tokens, like Runes, will encourage scams to occur across the Bitcoin network.","Shedding light on this, Andy Fajar Handika, CEO and Co-founder of decentralized Bitcoin mining pool Loka Mining, told Cryptonews that Runes enable use cases such as memes since it’s a fungible token protocol on Bitcoin. ","“Bitcoin’s primary use case as a store of value i.e. investing – has been on the far left of the spectrum, and Runes brings users from the far right of the spectrum to Bitcoin,” said Handika. ","This is a typical Bitcoin block since the halving: Runes are orange, ordinary transfers are the rest 😳","Bitcoin has completely ceased to be an \"Electronic Cash System\": it barely processes 0.5 monetary transactions per second, and people pay $100+ for that 💸 pic.twitter.com\/vdjlOpgvom","— Nikita Zhavoronkov (@nikzh) April 24, 2024","","McAvity pointed out that he is aware of the skepticism toward Runes. ","“Most miners are in favor of all this because we get paid the fees, but Runes is definitely a source of debate in the Bitcoin community,” he said. “Other Bitcoiners say this is not the intended use of Bitcoin, calling Runes ‘spam transactions.’”","While this may be the case, McAvity noted that with a halving event occurring every four years, there will always be a reduction in available BTC-denominated mining revenue from the block reward subsidy. He believes that for the mining industry to be maintained, the financial incentive to mine BTC must be strong through the growth of fee revenue. ","“This is why Runes and Ordinals are important protocols,” he said.","Although Bitcoin miners may view Runes in a favorable light, Dashjr thinks that the high fees associated with Runes will die down. ","“Due to the more apparent and costly nature of flaws associated with Runes, this will likely be short-lived – along with any profits it provides to miners,” he remarked.  ","Echoing this, Downie said, “It remains to be seen if Runes will be around for the long term, as we saw NFTs and Ordinals surge to popularity and then fade away. I think it is likely the fees will not stay so high for long.”","Data further shows that Bitcoin transaction fees have decreased since the halving. ","Yet Handika noted that although fees are decreasing, Bitcoin mining rewards have now stabilized around 60% to 80%, compared to 10% prior to the halving. ","“Roughly, this translates to miners’ total revenue not being slashed in half by the halving event, but only decreasing about 20-25% at the time this article was written,” he said. ","While the future of Runes and its impact on the Bitcoin industry are yet to be determined, Shah believes that overall the model of high fees on the Bitcoin network is unsustainable. ","As a result, Shah mentioned that there will be an influx of Bitcoin layer 2 (L2) solutions to accommodate protocols like Runes.","“That is why we’re about to see a true L2 Summer,” she said. “Bitcoin L2s are the essential next step to scale Bitcoin decentralized finance (DeFi) while keeping the L1 at sustainable levels.”","Alexei Zamyatin, co-founder of Bitcoin L2 solution Build on Bitcoin, told Cryptonews that he is also aware of the urgent need for L2 solutions on Bitcoin.  ","“Having native assets like Runes on Bitcoin will certainly increase fees – but ultimately trading and other DeFi related activity will have to move to Bitcoin L2s\/sidechains if it is to compete with the user experience people are used to with Ethereum and Solana,” said Zamyatin. “Otherwise, the 10 minute block times and high fees will result in a decrease of activity very quickly, once first speculation is done.”","Zamyatin added that he believes high Bitcoin transaction fees are unrelated to Runes. ","“Bitcoin has entered the same hype cycle as Ethereum. After Runes, there will be something else that drives fees up and makes Bitcoin transactions expensive,” he remarked. ","While this will likely impact the usability of the Bitcoin network, miners like Cormint believe this is necessary. ","“This is really a catch-22 situation. Bitcoin may be too expensive to use, but transaction fees have to remain high in order for the incentive to mine to remain strong” he said. “Overall, this presents an opportunity for developers to think of ways to scale Bitcoin using L2s. Higher fees will bring reinvigorated demand from users to keep BTC payments cheap, so now that innovation is finally happening.”"],"entity":[{"type":"Summer","content":"DATE"},{"type":"Handika","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"CMO","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Andy Fajar Handika","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$107.8 million","content":"MONEY"},{"type":"VP of Products","content":"ORGANIZATION"},{"type":"Trust Machines","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Baylor Landry (","content":"ORGANIZATION"},{"type":"82%","content":"PERCENT"},{"type":"Loka Mining","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"22","content":"DATE"},{"type":"Zamyatin","content":"PERSON"},{"type":"Downie","content":"PERSON"},{"type":"Nikita Zhavoronkov","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"$75,000,000","content":"MONEY"},{"type":"Runes","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Joe Downie","content":"PERSON"},{"type":"McAvity","content":"PERSON"},{"type":"$100","content":"MONEY"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"$127.97","content":"MONEY"},{"type":"April 24, 2024","content":"DATE"},{"type":"Hector Lopez","content":"PERSON"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"$80 million","content":"MONEY"},{"type":"Shah","content":"PERSON"},{"type":"Jamie McAvity","content":"PERSON"},{"type":"Alexei Zamyatin","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"$35,000,000","content":"MONEY"},{"type":"April 20, 2024","content":"DATE"},{"type":"Dashjr","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Rena Shah","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Mining","Runes"],"authors":["Rachel Wolfson"]}