{"summary":"Inflation concern seems to be behind everything these days\nBut are the worries over nothing? We explore ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74544\/the-inflation-fears-that-have-been-fueling-gold-and-bitcoin-markets-might-be-overblown","publishDate":"2020-08-11T11:59:29","id":2017,"type":null,"title":"Inflation fears fueling gold and bitcoin markets might be overblown","category":["Bitcoin"],"content":["If you can't easily figure out what's going on in a given corner of the market, you can pretty much chalk it up to inflation and no one would be the wiser.","Seemingly omnipresent investor concerns about inflation have been connected to the momentum in assets ranging from bitcoin to gold to Treasury inflation-protected securities —all of which have enjoyed a strong 2020. Looking at TIPs, demand for such bonds among inflation-worried investors has surged, sending their yields to record lows in some instances, as <a href=\"https:\/\/www.ft.com\/content\/c6f74b02-ec9a-4272-b78f-02ccc7713b56\" data-v-f87c67ca=\"\">reported<\/a> by The Financial Times. As for bitcoin, Nasdaq-listed MicroStrategy announced today that it would buy the digital currency as part of its capital allocation strategy.","The go-to explanation for why investors and businesses are worried about inflation is mounting government debt and the aggressive approach of central bankers around the globe to quell the impact of COVID-19. A weakening U.S. could also add fuel to the inflationary fire. Against the euro, greenbacks have shed by more than 4% over the last month.&nbsp;","Still, inflation has been on the decline since the beginning of the pandemic. That's despite some initial concerns that unique dynamics of a pandemic would result in more significant trade disruptions and prolonged production slowdowns.&nbsp;","\"But these potentially inflationary supply shocks have not amounted to much outside of the food industry, and ongoing pandemic-related cost pressures also appear unlikely to boost inflation significantly,\" the note added.&nbsp;","","","The Federal Reserve's PCE inflation gauge, meanwhile, has dipped to 1.7% — below the central bank's 2% target. Of course, most investors aren't necessarily concerned about inflation right now. The fear is down the road, at some ambiguous junction.&nbsp;","But high unemployment might fend off sharply rising inflation, as noted by Goldman.","\"The U.S. unemployment rate remains in double digits despite a fairly rapid decline over the last few months, and broader measures of labor market slack are even more elevated,\" the bank said.","A sustained period of higher unemployment should keep wages suppressed, which in turn should keep inflation from picking up quickly. The bank expects unemployment to dip to 9% by the end of 2020. If a vaccine is developed in 2021, the bank expects it to further decline to 6.5%.&nbsp;","\"But recovery will likely be a more gradual process after that, and we do not expect the economy to reach full employment until around 2025,\" the bank said. \"At a high level, this is the key reason that we expect inflation to remain soft in coming years.\"","","","But what about the risk of inflation beyond 2021? Well, Goldman went on to say that connecting \"money printing\" and inflation in a post-2008 world doesn't make sense. Here's Goldman:"],"hashtag":[]}