{"summary":"SEC Lawyers Resign Amid Criticisms in Crypto Case Against DEBT Box","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-lawyers-resign-amid-criticisms-in-crypto-case-against-debt-box.htm","publishDate":"2024-04-22T23:51:42","id":20175,"type":null,"title":"SEC Lawyers Resign Amid Criticisms in Crypto Case Against DEBT Box","category":["Blockchain News "],"content":["Two lawyers from the Securities and Exchange Commission (SEC), Michael Welsh and Joseph Watkins, resigned on April 22 following a federal judge’s sanction and severe criticism of the regulatory agency’s handling of a crypto-related case.","Initially, the SEC legal unit, led by attorney Michael Welsh, had convinced the court to freeze DEBT Box’s assets, arguing the company was moving to Dubai, beyond U.S. regulatory reach.","","Two Securities and Exchange Commission lawyers resigned after a federal judge sanctioned and sharply rebuked the Wall Street regulator for “gross abuse” of power in a crypto case. https:\/\/t.co\/4rI81TNFky","— Bloomberg Crypto (@crypto) April 22, 2024","","According to sources familiar with the matter, Welsh and Watkins stepped down after an SEC official informed them that they would face termination if they stayed. The attorneys were leading the SEC’s case against Digital Licensing Inc., the parent company for the aforementioned crypto platform, DEBT Box.","The lawsuit against DEBT Box was marred by allegations of false statements, misrepresentations, and a lack of evidence, as stated by Robert Shelby, the federal district court judge in Salt Lake City overseeing the case. In March, Shelby sanctioned the SEC for what he deemed “gross abuse” of power, prompting an apology from the SEC’s head of enforcement for the agency’s missteps.","The SEC had accused DEBT Box and its executives of defrauding investors of at least $50 million in July 2023, leading to the freezing of the company’s assets and the appointment of a receiver. The asset freeze was overturned after Shelby discovered potential false and misleading representations made by the SEC, however. Due to the judge’s ruling, the SEC was ordered to cover some of DEBT Box’s attorney’s fees.","Judge Shelby criticized Welsh’s arguments and the evidence Watkins and his team provided. One instance highlighted by the court involved Welsh’s claim that DEBT Box was closing bank accounts and transferring assets overseas, which was found to be untrue. The SEC attributed this error to a miscommunication, and Welsh apologized to the court.","The DEBT Box case underwent an unexpected twist. The defendants challenged the Securities and Exchange Commission’s (SEC) claims, alleging that the regulator had misrepresented facts to obtain a temporary restraining order freezing the crypto platform’s assets.","In response to the defendants’ accusations, Judge Robert Shelby called upon the SEC to justify its actions. While the SEC’s lawyers acknowledged errors in their approach, they implored the judge to refrain from imposing formal sanctions.","In January, the SEC withdrew the lawsuit entirely in the face of mounting criticism. Judge Shelby declined to dismiss the case “without prejudice,” however, preventing the SEC from refiling it at a later date.","In December, Judge Shelby issued a “show cause order“ to the Securities and Exchange Commission (SEC), a court directive compelling the agency to justify or prove its actions. While the SEC acknowledged its lack of transparency, it contended that formal sanctions were unwarranted.","Judge Shelby specifically criticized SEC attorney Michael Welsh for his role in misleading the court and attempting to obscure the truth.","“Welsh knew his statement from the TRO hearing was incorrect,” he said. “Rather than correcting the misstatement, he and the Commission subtly shifted the language to gloss over and perpetuate the misconduct.”","In response to the court’s scrutiny, SEC enforcement chief Gurbir Grewal expressed regret for the department’s actions and announced measures to address the situation, including appointing new attorneys and mandating training for enforcement staff. Subsequently, motions have been filed seeking reimbursement from the SEC for legal fees and other expenses totaling over $1.5 million incurred during the case."],"entity":[{"type":"Digital Licensing Inc.","content":"ORGANIZATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"April 22","content":"DATE"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Watkins","content":"PERSON"},{"type":"Welsh","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"April 22, 2024","content":"DATE"},{"type":"Shelby","content":"PERSON"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Bloomberg Crypto","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Michael Welsh","content":"PERSON"},{"type":"TRO","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Joseph Watkins","content":"PERSON"},{"type":"Salt Lake City","content":"LOCATION"},{"type":"July 2023","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Debt Box","SEC","Securities and Exchange Commission"],"authors":["Hassan Shittu"]}