{"summary":"iPhone Currently Not Compatible with Digital Euro: ECB Board Member","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/iphone-not-compatible-with-digital-euro-ecb-board-member.htm","publishDate":"2024-04-24T11:06:27","id":20172,"type":null,"title":"iPhone Currently Not Compatible with Digital Euro: ECB Board Member","category":["News "],"content":["An ECB executive board member wants Apple to change how iPhone payments work to support a potential digital euro. He claims the tech giant’s current system may not support offline payments for any European Central Bank digital currency.","The member, Piero Cipollone, outlined his concerns in a letter to EU antitrust chief Margrethe Vestager dated April 19.","“Apple’s proposed commitments would not give third parties full access to the secure element (SE), but only allow for the usage of Host Card Emulation (HCE),” he said. For clarification, a secure element (SE) is a specialized chip engineered for enhanced security. It functions like a miniature safe within a device, commonly present in smartphones, tablets, and certain credit cards.","Also, he thinks Apple’s proposal may not offer the same level of authentication and transaction speed as ApplePay.","Apple didn’t return Cryptonews’ request for comment by press time.","Cipollone added that currently, Apple’s proposals don’t ensure a fair level playing field for third-party payment solutions. This is especially true for in-store payments with iPhones. Were these proposals to be applied to a potential digital euro, they wouldn’t guarantee user-friendly payments on iPhone, the economist said.","He also noted certain limitations with the EU’s recent antitrust investigation into Apple. It doesn’t address limited access to near-field communication (NFC) technology in various payment situations, including person-to-person payments, he said.","“We note that this use case is crucial for the digital euro,” he said.","According to the economist, the proposed digital euro regulation requires device manufacturers and electronic communication service providers to offer fair, reasonable, and non-discriminatory access to the secure element in their devices.","He said this access should be unrestricted and not reliant on other mobile operating system applications. This ensures that digital euro payments on mobile devices are user-friendly.","The European Commission has released draft laws outlining the groundwork for a potential digital euro. This includes establishing basic criteria and preparing necessary legislation for potential issuance.","In late 2023, the ECB initiated a two-year preparatory phase for the digital euro. This phase involves finalizing regulations, selecting private-sector collaborators, and conducting testing and experimentation."],"entity":[{"type":"Piero Cipollone","content":"PERSON"},{"type":"April 19","content":"DATE"},{"type":"Host Card Emulation","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Margrethe Vestager","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"}],"hashtag":["Apple","Digital Euro"],"authors":["Shalini Nagarajan"]}