{"summary":"Bitcoin Lifeboat, Long Recovery Road, & Exaggerated BTC Deaths: Saylor, CZ, and Professor Weigh In","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-lifeboat-long-recovery-road-exaggerated-btc-deaths-saylor-cz-and-professor-weigh-in.htm","publishDate":"2022-06-23T12:39:00","id":20186,"type":null,"title":"Bitcoin Lifeboat, Long Recovery Road, & Exaggerated BTC Deaths: Saylor, CZ, and Professor Weigh In","category":["Bitcoin News "],"content":[" ","Bitcoin (BTC) is “a lifeboat,” says Michael Saylor, while  Binance‘s Changpeng Zhao (CZ) warns that BTC could still stay below its all-time high for two years, and an adjunct professor of law calls the reports about Bitcoin’s death “exaggerated.”","Among the experts who have spoken out about Bitcoin in recent days is Michael Saylor, a well-known bitcoin bull and one of the world’s largest holders through his company MicroStrategy.","Speaking on CNN on Monday, Saylor suggested that Bitcoin is a form of salvation for people suffering from rising prices and currency devaluations.","“Are you going to stay on a sinking ship or are you going to get on a lifeboat and be tossed about on the stormy sea,” Saylor said, noting that “bitcoin represents that lifeboat” for those who can “take the long view and focus on the fundamentals.”","Asked what it will take for BTC to “go back up” and whether regulation is required for that to happen, Saylor replied that “people are confused and regulation will be constructive because clarity will help the market mature.”","“The people are confused about what’s a currency, what’s a commodity, what’s a security, what are tokens,” he said, and argued that, ","“As the regulators come in and they clear up this confusion,“ the industry will be “catapulted“ from “the offshore, anything goes stage, and into an institutional mature asset class.” ","#Bitcoin is a lifeboat, tossed on a stormy sea, offering hope to anyone in the world that needs to get off their sinking ship. We are witnessing the birth of a new industry during the worst financial crisis of our lifetime. My interview w\/@jchatterleyCNN pic.twitter.com\/P2QJWgyf0S","And while Saylor remained an optimist, Changpeng Zhao (CZ), the CEO of the world’s largest crypto exchange Binance, was more practical in his approach when asked by the Guardian about the state of the market.","While reminding readers that “no one can predict the future,” Zhao told the Guardian that, ","“I think given this price drop, from the all-time high of [USD] 68k to 20k now, it will probably take a while to get back. It probably will take a few months or a couple of years.” ","According to the Binance boss, USD 20,000 is today thought of as “very low,” although as recently as in 2018 and 2019 people “would be very happy” with such a price.","“If you look at the bottom [of bitcoin], right now it’s higher than the last peak. So, whether normal or not, I think with the industry still definitely growing, fluctuations in price is normal,” Zhao said.","Lastly, Max Raskin, an adjunct professor at New York University School of Law and director of research at Qvidtvm Inc, said in an opinion piece in the Wall Street Journal on Wednesday that reports of Bitcoin’s death “have been exaggerated.”","“For those who’ve followed bitcoin since the beginning, the fall from [USD] 64,000 to [USD] 20,000 is simply another of bitcoin’s ‘many deaths’,” Raskin wrote. ","He was referring to the Bitcoin Obituaries page by 99 Bitcoins, which keeps track of how many times the crypto has been declared “dead” by critics.","“With millions of dollars in speculation in nonfungible tokens [NFTs], initial coin offerings and obvious get-rich-quick schemes, it’s easy to forget that bitcoin wasn’t created by people looking to get rich,” Raskin wrote.","Instead, Bitcoin was created by the pseudonymous programmer Satoshi Nakamoto, “who wanted a money not controlled by government-run central banks,” he said.","Raskin added that critics can rest assured that Bitcoin “isn’t going away because the ideology underlying it isn’t going away.”","“With the [US] Federal Reserve increasingly guiding monetary policy according to political concerns such as climate change and ‘diversity,’ the intensity of the desire for apolitical money can only grow,” Raskin wrote.","At 11:36 UTC on Thursday, BTC is trading at USD 20,662, up 0.5% in a day and down 8.3% in a week. Per coingecko.com, it is down 70% from its all-time high of USD 69,044 seen in November 2021. ","____","Learn more: \n– Bitcoin & Crypto Move Lower Again as Analysts Search for Answers, Point to Risks to Economy\n– Bitcoin, Ethereum & Crypto Analysts Search for Bottom as Investors in ‘Historically Meaningful Degree’ of Pain\n\n– Bitcoin Stock-to-Flow Model and Its Proponents Under Fire Again as Failure Becomes Obvious\n– ‘The Reckoning’ & ‘The Best Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n\n– US Fed to Blame for Downturn, Large Crypto Players Have Responsibility Toward Ecosystem – FTX CEO\n– SEC’s Peirce Says Crypto’s Lack of ‘Bailout Mechanism’ Is a Strength; FTX CEO as a ‘White Knight’"],"entity":[{"type":"8.3%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"Ethereum & Crypto Analysts Search for Bottom","content":"ORGANIZATION"},{"type":"Qvidtvm Inc","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"– Bitcoin & Crypto Move Lower Again as Analysts Search for Answers","content":"ORGANIZATION"},{"type":"0.5%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"Raskin","content":"PERSON"},{"type":"New York University School of Law","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Changpeng Zhao (CZ)","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Max Raskin","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"Peirce Says Crypto","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Large Crypto Players Have Responsibility Toward Ecosystem – FTX","content":"ORGANIZATION"},{"type":"With millions of dollars","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"[US] Federal Reserve","content":"ORGANIZATION"},{"type":"Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n\n– US Fed","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Changpeng Zhao","Forecast","Market","Michael Saylor","Regulation"],"authors":["Fredrik Vold"]}