{"summary":"D8X Launches on Polygon zkEVM, Targets Institutional Grade Investors","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/d8x-launches-on-polygon-zkevm-targets-institutional-grade-investors.htm","publishDate":"2024-02-13T23:46:25","id":20185,"type":null,"title":"D8X Launches on Polygon zkEVM, Targets Institutional Grade Investors","category":["Blockchain News "],"content":["D8X, a cryptocurrency decentralized exchange (DEX) for derivatives has launched on Polygon’s zkEVM in a bid to provide an institutional-grade platform for investors in decentralized finance (DeFi).","In a recent press release, the company announced its launch on Polygon’s zkEVM, rolling out plans, use cases to institutional clients, on-chain solutions, and multiple stablecoin integrations as it plans to create alternatives to USD-based assets.","According to the release, the platform is supported by Polygon Ventures to reshape how users interact with decentralized exchanges allowing institutional investors to trade perpetual futures seamlessly with on-chain tools.","The platform utilizes several interoperable features including white-label partnerships that will see firms link their traders to D8X and earn a commission through the revenue system.","Classical perpetuals are also offered to traders with no rollover or borrowing fees which can apply to a wide range of assets.","Liquidity providers earn fees in the automated market maker (AMM) options with a similar risk management setup to those deployed in “enterprise-wide risk-management” and clearing houses.","“Liquidity provision, liquidations, and order execution are decentralized. With our white-label model and our robust on-chain governance institutional professionalism and decentralization go hand in hand.” ","Utilizing traditional finance derivative pricing theory, D8X reduces risks and costs while maximizing efficiency.","Casper Sauter, the co-founder of D8X stated that the evolution of DeFi has seen banks and other financial institutions enter the space tipping the platform as the solution providing an incorruptible financial machine.","“For the first time in DeFi, D8X offers linear, inverses, and quantity perpetuals, enabling users to choose their collateral, base, and quote currencies to manage their exposure and control their risks,” the statement reads.","Sauter told CryptoNews that the company expects me about 5,000 trades per month during the zKEVM phase in February and March.","In Q2 2024, D8X projects twice the size in the first quarter following the activation of the zkEVM and the “go-live of X1 mainnet.” ","D8X plans to create diversification to the USD stablecoin dominance by floating an EURO stablecoin pool. This will give investors yield-bearing capabilities created in partnership with Polygon and Angle Protocol.","The move will allow EUR-based users to hedge their exposure to the dollar. Pablo Veyrat the co-founder of Angle Protocol stated that both companies are introducing a groundbreaking innovation to DeFi with EUR\/USD FX perpetual collaterized in stEUR.","“Traders can also collateralize trades in other assets. In addition to USDC, a liquidity pool in Lido’s stake ETH (stETH) will allow traders to trade with stETH and liquidity providers to earn the Lido yield, while simultaneously participating in the DEX’s earnings.”"],"entity":[{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"Pablo Veyrat","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"EUR","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"EURO","content":"ORGANIZATION"},{"type":"EUR\/USD","content":"ORGANIZATION"},{"type":"Casper Sauter","content":"PERSON"},{"type":"USD","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"}],"hashtag":["D8X","decentralized","Polygon"],"authors":["David Pokima"]}