{"summary":"By launching its own virtual machine, Filecoin can now support smart contracts and decentralized applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219201\/filecoin-becomes-a-blockchain-platform-compatible-with-ethereum-apps","publishDate":"2023-03-14T09:00:04","id":2018,"type":null,"title":"Filecoin becomes a blockchain platform compatible with Ethereum apps","category":["LAYER 1S"],"content":["Decentralized storage platform Filecoin has implemented its own virtual machine, enabling it to support smart contracts —&nbsp;opening it up to the world of decentralized applications, NFTs, liquid staking and more.","The network has always been designed to provide file storage in a decentralized manner — but now that it has launched its Filecoin Virtual Machine (FVM), it can support applications built on it. The goal is that this should encourage more tools built on the network, enable easier trading of tokens, support the creation of decentralized social media and, ultimately, become its own thriving ecosystem.","“The [FVM] augments the utility of Filecoin, and I think it also positions Filecoin as the Layer-1 blockchain that is uniquely positioned to power an open data economy,” said Lukas Bresser, ecosystem growth at Protocol Labs. “It’s a really critical step in this broader roadmap of turning the services of the cloud into open markets. That’s what’s exciting here.”","Filecoin’s virtual machine will give it the same capabilities as Ethereum, enabling anyone to build any kind of decentralized application on the network. It will also be able to support bridges to other blockchains and connect more closely to the rest of the crypto ecosystem. Bresser noted that SushiSwap, Axelar and Celer are all integrating with Filecoin.","Applications built on Filecoin will enhance its primary purpose of providing decentralized file storage. Files stored on the network are typically stored for around 18 months before someone needs to manually request the network to store them for another period of time — but applications can now be built that provide many more custom options, including the ability to pay for the data to be stored for much longer periods of time.","Filecoin applications will also be able to monetize data sets. Bresser said that, for example, multiple parties could generate training data on an AI model and upload this to Filecoin. Then anyone who wanted to access the data would pay these parties to do so. In this instance, “everybody who contributed to the data model is rewarded in direct contribution to their training data.”","Bresser added that this could expand to other products like decentralized social media. He suggested users could own their social graphs (the data around their connections and social media usage), control access to this data and monetize it in more ways than just advertising. This would also be possible because data on Filecoin is not stored unencrypted on the actual chain itself.","“I believe some of the things critical for social networks will be powered by Filecoin infrastructure. We are in conversation with a few of the web3 experiments that are trying to do things around social,” he said.","With the FVM, Filecoin will be able to support liquid staking, unlocking the value of tokens that are staked. Bresser said that there is a range of liquid staking providers that will add support for Filecoin, set to be announced in a few days.","There’s always been one significant criticism of NFTs: that they tend to link to images that aren’t stored on-chain. Bresser said that applications could be built on Filecoin that address this issue and provide a stronger guarantee that the image will be available.","Bresser said that you could have the image data stored on IPFS — like most are — for easy access to the image, but a backup version of the image could be stored on Filecoin. Now with data stored on Filecoin, the provider proves to the chain every 24 hours that it still exists. So this could be applied to NFTs, with the NFT getting a daily confirmation that the image is still being stored on its behalf.&nbsp;","“I believe that the FVM has a lot of potential to allow the creation of NFTs that don't only certify ownership, but also provably, verifiably show that the file is stored in a way that it persists over many hundreds of years,” said Breser.","While this is still a hypothetical use case, if it does get built, it could help prevent NFTs from having their images <a href=\"https:\/\/twitter.com\/neitherconfirm\/status\/1369285946198396928?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1369285946198396928%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fcointelegraph.com%2Fnews%2Fopensea-collector-pulls-the-rug-on-nfts-to-highlight-arbitrary-value\" data-v-f87c67ca=\"\">changed<\/a> —&nbsp;or even <a href=\"https:\/\/www.vice.com\/en\/article\/pkdj79\/peoples-expensive-nfts-keep-vanishing-this-is-why\" data-v-f87c67ca=\"\">removed entirely<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Breser","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Protocol Labs","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Lukas Bresser","content":"PERSON"},{"type":"Bresser","content":"PERSON"},{"type":"Filecoin","content":"ORGANIZATION"},{"type":"Filecoin","content":"PERSON"},{"type":"FVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}