{"summary":"Bitwise Bitcoin ETF Among Top 25 Fastest ETFs to Reach $1 Billion in Assets + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitwise-bitcoin-etf-among-top-25-fastest-etfs-to-reach-1-billion-in-assets-more-crypto-news.htm","publishDate":"2024-02-16T14:29:09","id":20184,"type":null,"title":"Bitwise Bitcoin ETF Among Top 25 Fastest ETFs to Reach $1 Billion in Assets + More Crypto News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In today’s crypto news:","__________","Crypto index fund manager Bitwise Asset Management said that the Bitwise Bitcoin ETF (BITB) surpassed $1 billion in assets under management (AUM) less than five weeks after the fund’s launch.","Per the press release, this makes it one of the top 25 fastest ETFs in history to reach the milestone.","Since its trading debut on January 11, BITB has seen more than $877 million in net inflows. This is an average of $36 million per day.","As of February 14, it had one of the lowest long-term fees of any Bitcoin ETF provider at 0.20%, the company said.","Furthermore, BITB was the first Bitcoin ETF in the US to publish the Bitcoin addresses of its holdings.","Also, the ETF donates 10% of its profits to organizations that fund Bitcoin open-source development.","Meanwhile, Bitwise CEO Hunter Horsley argued that,","“2024 will be a landmark year for bitcoin. […] The ETF format has already proven a “game-changer” for investors.”","He explained that 88% of financial advisors interested in investing in crypto were waiting for a Bitcoin ETF. Advisors who manage more than $20 trillion in the US can now access this asset class. Bitwise has seen substantial demand for the BITB from financial advisors in just the first few weeks.","According to Horsley, an ETF enables advisors to manage bitcoin exposure for clients along with all other components of wealth management. These include asset allocation, tax and estate planning, and financial reporting.","“Bitcoin ETFs empower advisors to avoid a longstanding concern: clients using online apps and exchanges outside their workflow to get exposure,” said Horsley. “Solving this pain point has been a key factor behind BITB’s early success.”","Crypto exchange KuCoin, Animoca Brands’ marquee membership network project Mocaverse, and social influence monetization financial infrastructure Halo Wallet have announced a strategic partnership.","Per the press release, they aim to redefine on-chain identity and facilitate growth by integrating the three platforms’ ecosystems.","It stated that,","“Through the integration of KuCoin user accounts, Mocaverse’s Moca ID, and Halo’s Genesis Pass, this partnership will empower users to seamlessly navigate different realms of the Web3 world.”","Therefore, the partners will collaborate and amplify user growth by offering users a full-fledged and rewarding experience in crypto trading, decentralized finance (DeFi), Web3 gaming, SocialFi, and more.","KuCoin CEO Johnny Lyu commented that the partnership “symbolizes a convergence of industry leaders pooling their strengths to create a transformative experience for users.”","Halo Wallet CEO Jeff Hou added that this is not only a fusion of services but a strategic alliance to create a cohesive digital asset environment for users.","In other crypto news, US mining colocation provider Coinmint has to pay $14 million to an upstart bitcoin mining chip maker Katena to fulfil its contractual obligation from 2021, according to the latest Miner Weekly report by BlocksBridge Consulting, citing the American Arbitration Association’s (AAA) ruling on February 9.","Coinmint provides hosting services for bitcoin mining companies such as CleanSpark and Bit Digital. It, however, doesn’t own proprietary miners, the report noted.","In 2021, after some issues, Coinmint’s management decided to build up its proprietary mining hashrate. It aimed to improve its odds of going public or raising external capital.","Over time, it got in touch with Katena about its K 10 Bitcoin mining chip. The two companies initially discussed a purchase order of $100 million for 1.6 EH\/s in May 2021. Katena asked for 50% as a down payment to secure chips from its fabrication processor TSMC.","Coinmint revised the proposal: it would buy $150 million worth of K 10 miners. The down payment was 25% ($37.5 million), due within three days of signing the contract in May 2021.","“However, Coinmint failed to pay $37.5 million on time despite having made the impression that it had the cash in hand.”","Between June and November, Coinmint paid $23.4 million to Katena.","Katena voided the contract, stating that Coinmint paid neither on time nor in full.","On its side, Coinmint accused Katena of fraud. It asked for a $23.4 million refund, bringing up a lawsuit against Katena.","In response, Katena accused Coinmint of a breach of contract and asked for $37.5 million in damages. Factoring in the $23.4 million already paid, the damages result in $14 million.","“Based on the evidence gathered over the past year, the panel found that the Katena team had what it needed to start making the hardware for Coinmint because the K10 mining chips were close to the final tape-out in May 2021. Hence, the panel ruled that Katena is entitled to liquidated damages of $14 million,” the report said."],"entity":[{"type":"February 14","content":"DATE"},{"type":"0.20%","content":"PERCENT"},{"type":"Katena","content":"PERSON"},{"type":"Katena","content":"LOCATION"},{"type":"Bitwise Bitcoin ETF","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"Horsley","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"Coinmint","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"88%","content":"PERCENT"},{"type":"$14 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"January 11","content":"DATE"},{"type":"$37.5 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"Hunter Horsley","content":"PERSON"},{"type":"Katena","content":"ORGANIZATION"},{"type":"Johnny Lyu","content":"PERSON"},{"type":"$20 trillion","content":"MONEY"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"May 2021","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"today","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$36 million","content":"MONEY"},{"type":"BlocksBridge Consulting","content":"ORGANIZATION"},{"type":"February 9","content":"DATE"},{"type":"$23.4 million","content":"MONEY"},{"type":"Mocaverse","content":"PERSON"},{"type":"ETF","content":"ORGANIZATION"},{"type":"American Arbitration Association","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Jeff Hou","content":"PERSON"},{"type":"TSMC","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"$877 million","content":"MONEY"}],"hashtag":["ETF","KuCoin","Mining"],"authors":["Sead Fadilpašić"]}