{"summary":"Coinbase&#x27;s share price has been in free fall over the last few months, but Wall Street is bullish on the stock.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129627\/despite-coins-slump-wall-street-is-rallying-behind-the-stock","publishDate":"2022-01-07T17:39:32","id":2019,"type":null,"title":"Despite COIN&#x27;s slump, Wall Street is rallying behind the stock","category":["THE BLOCK"],"content":["Coinbase is feeling the pain of the broader slump in cryptocurrency coin prices, but Wall Street analysts are rallying behind the company despite a months-long decline in the exchange's share price.&nbsp;","Coinbase Global Inc's shares have fallen nearly 35% since November 9. And the price has fallen even more sharply this week, in line with the broader market for crypto public equities and tokens, which have been upended in part by anxieties that the Federal Reserve will more quickly hike interest rates — potentially limiting the liquidity boom that's lifted asset prices from tech stocks to commodities.&nbsp;","Despite this backdrop, Wall Street analysts have become increasingly bullish on Coinbase's stock. This week, JPMorgan reemphasized its buy rating for the stock, while rival bank Bank of America cheekily suggested to clients to \"put some coin into COIN\" in its own buy rating.&nbsp;","Bank of America's upgrade was rooted in a thesis that Coinbase's revenue diversification will accelerate away from trading-based transaction revenues, which has been the firm's primary money maker. The firm charges juicy fees whenever its users buy or sell a cryptocurrency, but since it went public its executives have tried to emphasize promises that it will diversify its revenue base.&nbsp;","Drivers of diversification for Coinbase will include staking, non-fungible tokens, and decentralized finance, according to Bank of America.&nbsp;","\"In our view, calling of these non-trading revenue streams could also catalyze increased interest in the stock among institutional investors,\" Bank of America said.&nbsp;","\"While uncertainty around regulation remains an ongoing potential risk, we continue to believe that COIN's technology\/innovation and brand are positive differentiators as more consumers and institutions engage with various parts of the crypto\/digital asset ecosystem,\" it added.&nbsp;","Bank of America's price target for the stock sits at $340, an upside of more than 45% at the time of writing. The bank also&nbsp;noted potential upside to Coinbase's projections for the fourth quarter.&nbsp;","According to its analysis, the Bank of America increased its expectation for Coinbase's annual revenue per unit to $45 from $30, anchored in the firm's raised outlook for monthly transacting users. As such, it increased its net revenue forecast to $1.44 billion from $958 million. Coinbase's net revenue in the third quarter of 2021 clocked in at $1.234 billion.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 9","content":"DATE"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$30","content":"MONEY"},{"type":"\" Bank of America","content":"ORGANIZATION"},{"type":"third quarter of 2021","content":"DATE"},{"type":"$45","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"$1.234 billion","content":"MONEY"},{"type":"America","content":"LOCATION"},{"type":"Coinbase Global Inc","content":"ORGANIZATION"},{"type":"$1.44 billion","content":"MONEY"},{"type":"$958 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"$340","content":"MONEY"},{"type":"fourth quarter","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}