{"summary":"Fantom Creator Warns of Potential Crypto Meltdown Due to Risky Incentives","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fantom-creator-warns-of-potential-crypto-meltdown-due-to-risky-incentives.htm","publishDate":"2024-04-03T19:35:50","id":20200,"type":null,"title":"Fantom Creator Warns of Potential Crypto Meltdown Due to Risky Incentives","category":["DeFi News "],"content":["Fantom creator Andre Cronje recently expressed concerns about risk management practices within a specific DeFi project, indirectly referencing Ethena Labs’ synthetic dollar, USDe. Without explicitly naming the protocol, Cronje highlighted issues related to funding rates in perpetual futures contracts.","Cronje, a notable figure in DeFi, cautioned about potential risks associated with incentives linked to the synthetic dollar, comparing it to past market meltdowns like the Terra-Luna incident. ","","Every so often we see something new in this space. I often find myself on the mid curve for an extensive amount of time. I am comfortable here. That being said, there have been events in this industry I wish I was more curious about, there have also been events I definitely did…","— Andre Cronje (@AndreCronjeTech) April 3, 2024","","In an April 3 tweet, Cronje questioned the assumption that simply closing positions when markets turn negative is a viable risk management strategy, likening it to a meme due to its practical challenges. He warned about the risks associated with relying on positive funding rates during positive market conditions, as this can quickly turn negative, leading to liquidations and potentially “unbacked assets.”","Cronje also referenced the “law of large numbers” as a potential countermeasure, similar to strategies seen in other protocols like UST’s $1 billion BTC fund. However, he cautioned that such strategies may work until they don’t, implying potential vulnerabilities in risk management practices.","His tweet raised questions about the sustainability of high yields offered by Ethena’s synthetic dollar, USDe, particularly noting concerns that excessive optimism in positive market conditions could lead to unbacked assets and liquidations when market sentiment shifts negatively.","The initial launch of Ethena’s synthetic dollar on the public mainnet with a high annual percentage yield (APY) drew widespread attention. It raised concerns similar to those seen with the collapse of Terra UST’s Anchor protocol in the past, highlighting the importance of robust risk.","","Ethena Labs USDe is a synthetic dollar positioned on a decentralized protocol based on ETH. The stablecoin utilizes crypto-native collateral, such as staked Ethereum, and hedges price exposure in derivative markets on centralized and decentralized exchanges. This strategy results in a tokenized dollar, termed a synthetic dollar, where the price exposure is netted out.","In an exclusive interview with cryptonews.com, Conor Ryder, Head of Research at Ethena, discussed various aspects of stablecoins and synthetic dollars. Ryder touched upon the stablecoin trilemma, distinguishing between ‘stablecoins’ and ‘synthetic dollars,’ and highlighted the different use cases for stablecoins.","Ryder began by addressing the stablecoin trilemma, which revolves around achieving stability, decentralization, and scalability simultaneously. He mentioned past instances where projects sacrificed stability for scalability and decentralization, citing examples like TERA. Ryder emphasized the importance of a robust peg mechanism and adequate collateralization to maintain stability.","Regarding censorship resistance, Ryder discussed centralized stablecoins like USDC and USDT, noting that while they are stable, their collateral is not censorship-resistant due to being backed by US government bonds. This lack of censorship resistance contrasts with the stability they offer, making them a dominant force in the market.","Ryder then delved into the scalability aspect, highlighting challenges faced by DeFi stablecoins in achieving scalability while maintaining stability and decentralization. He pointed out that over-collateralization, common in crypto-backed stablecoins, limits scalability compared to centralized stablecoins.","Regarding Ethena’s approach, Ryder mentioned using crypto-native collateral (Stealth) to achieve censorship-resistant collateral. He said,","“And I guess to circle back to Ethena, hopefully then we’ve kind of touched on each of those points is we have censorship-resistant collateral, i.e., Stealth, that’s the crypto-native collateral. We hopefully are scalable because as, so this is probably the most intricate part, but as I said, with the derivative position, you basically need to match what for every $1 Stealth you have, you need to have a $1 short for the perpetual position to hedge that off. So that means you actually only need to take a one-to-one collateral ratio as well. So we’re actually kind of as scalable as centralized stablecoins.”",""],"entity":[{"type":"April 3, 2024","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Terra UST","content":"ORGANIZATION"},{"type":"April 3","content":"DATE"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"Ethena","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"Conor Ryder","content":"PERSON"},{"type":"TERA","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Terra","content":"LOCATION"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"Andre Cronje","content":"PERSON"},{"type":"UST","content":"ORGANIZATION"},{"type":"Cronje","content":"PERSON"}],"hashtag":["Ethena","Terra","USDe"],"authors":["Hassan Shittu"]}