{"summary":"Is Optimism Going to Zero? OP Price Drops 4%, While Experts Are Stocking Up On This New GambleFi Token","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-optimism-going-to-zero-op-price-drops-4-while-experts-are-stocking-up-on-this-new-gamblefi-token.htm","publishDate":"2024-04-30T10:57:30","id":20219,"type":null,"title":"Is Optimism Going to Zero? OP Price Drops 4%, While Experts Are Stocking Up On This New GambleFi Token","category":["Industry Talk "],"content":["The native token for Ethereum Layer 2 scaling solution Optimism (OP) has fallen 4% in the last 24 hours amidst a market-wide pullback that has hit Layer 2 tokens the hardest.","Optimism currently trades at a price of $2.39. This is down about 1% in the last hour. It also represents a 3.7% dip both in the last 24 hours and in the last seven days, according to data by CoinGecko.","The token is 7.2% more valuable than it was this time last week. However, today’s price represents a steep drop of 35% from a month ago.","Zooming out to the rest of the market, crypto’s total market capitalization today is a lofty $2.39 trillion, which represents a fall of about 1.6% in the last 24 hours.","As usual, the market is tracking the price movements of its leading coins. Original cryptocurrency Bitcoin (BTC) is the only cryptocurrency with a market cap above $1 trillion ($1.2 trillion, to be precise). In the last 24 hours, it fell 0.8% and currently trades at $61,760.","It’s closest competitor, the most commercially-important cryptocurrency, Ethereum (ETH), faced markedly heavier losses. ETH fell 3.8% overnight and currently changes hands at $3,050. ","Optimism’s heavier depreciation is matched by other leading layer 2 solutions today. Polygon (MATIC) fell 4.3% overnight to trade at $0.6735. Stacks (STX) dipped 2.1% to $2.33, Mantle (MNTL) shed 5.4% to $0.9762, and Arbitrum (ARB) lost 3.9% to $1.02. ","The risk-off attitude kickstarting this week could be down to investors’ jitters over this week’s Federal Reserve meeting.  The U.S. central bank has given indications that it may keep interest rates higher for longer, which means investors are more likely to take risk-averse positions to speculative investments like crypto.","Optimism’s trading chart for the last three months shows a steady 50% depreciation since the token posted an all-time high of $4.84 on March 6 this year amidst a market-wide rally. With a Relative Strength Index (RSI) of 35 and falling, there’s likely to be further losses today as the small overnight sell-off continues. ","As crypto adoption continues apace, Layer 2s are becoming more of a safer investment. To date, Ethereum dominates 63.42% of the market with over $54.3 billion in total value locked (TVL) on the blockchain.","However, Layer 2 protocol tokens are closely tied to the fate of their leader, Ethereum. On a good day, Layer 2 tokens rise in tandem, and vice versa, as we can see today.","One sector that’s getting more of a look-in nowadays is the world of GambleFi. Investors that want a head start on Web3’s newest innovations early are more likely to find heady upside potential in tokens attached to crypto-integrated iGaming platforms, like Mega Dice.","The Mega Dice ($DICE) presale is barely a fortnight old and it has already taken $600,000 in investments, according to the token’s website.","Introducing Refer & Earn with $DICE! 🚀💰","Exciting news! You can now refer users to the Mega Dice presale and earn a generous 10% commission on all referral purchases. Here's a simple guide on how to get started: ⤵️ pic.twitter.com\/3Xptw2ZR3T","— Mega Dice Casino (@megadice) April 29, 2024","","As the platform’s native token, players can use $DICE to fund games and receive payment, with some games requiring the token. Doing so will net them various advantages down the line. ","That’s because Mega Dice will integrate the token into the casino’s loyalty program, offering more generous rewards to gamers who play with the native token. $DICE will also unlock access to exclusive competitions and VIP experiences.","The team has also said there’s a buyback and burn program on the horizon. This means Mega Dice will periodically buy some of the tokens and remove them from circulation to help keep them scarce and drive value.","Curious? Keep up to date with Mega Dice news over on X\/Twitter and Telegram.","Don’t miss out.","Join the presale now on the Mega Dice website.",""],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"5.4%","content":"PERCENT"},{"type":"7.2%","content":"PERCENT"},{"type":"3.8%","content":"PERCENT"},{"type":"63.42%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$600,000","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"1.6%","content":"PERCENT"},{"type":"4.3%","content":"PERCENT"},{"type":"$1 trillion ($1.2 trillion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"2.1%","content":"PERCENT"},{"type":"$4.84","content":"MONEY"},{"type":"Mega Dice","content":"ORGANIZATION"},{"type":"Mega Dice website","content":"ORGANIZATION"},{"type":"last 24 hours and in the last seven days","content":"DATE"},{"type":"$1.02","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"$2.39","content":"MONEY"},{"type":"$DICE","content":"MONEY"},{"type":"$0.9762","content":"MONEY"},{"type":"$54.3 billion","content":"MONEY"},{"type":"$2.33","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"$2.39 trillion","content":"MONEY"},{"type":"March 6 this year","content":"DATE"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"3.9%","content":"PERCENT"},{"type":"3.7%","content":"PERCENT"},{"type":"0.8%","content":"PERCENT"},{"type":"April 29, 2024","content":"DATE"},{"type":"$0.6735","content":"MONEY"},{"type":"Mega Dice presale","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"’s Federal Reserve","content":"ORGANIZATION"},{"type":"$61,760","content":"MONEY"},{"type":"this week","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$3,050","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Layer-2","Mega Dice","Optimism"],"authors":["Tim Hakki"]}