{"summary":"Meta draws closer to completing its purchase of Within, the creator of the popular VR-workout app Supernatural.\nFTC has argued the acquisition would help Meta create a monopoly in the emerging virtual-reality market.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207618\/meta-overcomes-legal-hurdle-in-proposed-purchase-of-vr-startup-within-bloomberg","publishDate":"2023-02-01T11:44:10","id":2021,"type":null,"title":"Meta overcomes legal hurdle in proposed purchase of VR startup Within: Bloomberg","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Meta is one step closer to buying virtual-reality startup Within Unlimited after a U.S. district judge denied the <\/span><span data-v-f87c67ca=\"\">Federal Trade Commission’s request to block the proposed acquisition, according to Bloomberg.<\/span>","<span data-v-f87c67ca=\"\">While the ruling represents a victory for Meta, the judge ordered the company to refrain from closing the deal for a week, allowing the FTC time to decide whether or not to appeal the ruling. Within produces the popular VR-fitness app Supernatural.<\/span>","<span data-v-f87c67ca=\"\">A little more than a year ago, Meta pivoted to aggressively pursuing a strategy designed to transform the company known for operating successful social media platforms into an architect of the budding metaverse, an immersive world that is imagined to involve a mix of virtual, augmented and mixed reality. <\/span>","<span data-v-f87c67ca=\"\">While Meta has outpaced competitors in the VR headset market, it has struggled to woo consumers to its suite of apps.<\/span>","<span data-v-f87c67ca=\"\">Like it has in the past with companies like WhatsApp, Meta is trying to compensate for its struggles by acquiring smaller companies that possess valuable technology.<\/span>","<span data-v-f87c67ca=\"\">In July, the FTC sued Meta, arguing that the company's purchase of Within would give the tech giant an advantage and help it establish a monopoly in the virtual-reality market, Bloomberg reported.&nbsp;<\/span>"],"hashtag":[]}