{"summary":"Circle Drops TRON Support for USDC, Citing Risk Management","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/circle-drops-tron-support-usdc-risk-management.htm","publishDate":"2024-02-21T05:00:22","id":20216,"type":null,"title":"Circle Drops TRON Support for USDC, Citing Risk Management","category":["News "],"content":["Stablecoin issuer Circle will stop supporting USDC on the TRON blockchain, as part of concerns under its risk management framework.","In a statement on Wednesday, the company outlined a phased discontinuation of USDC support on TRON. This transition will occur over a period extending to Feb. 2025, with continued normalcy for USDC transfer and redemption activities on TRON.","“Our decision to discontinue support for USDC on TRON is the result of an enterprise-wide approach that involved the business organization, compliance and other functions across our company,” Circle said on X.","Circle didn’t return Cryptonews’ request for comment by press time.","1\/ We are discontinuing USDC on the TRON blockchain in a phased transition. Effective immediately, we will no longer mint USDC on TRON. Transfers and redemptions of USDC on TRON will continue to operate normally through February 2025. Read the details: https:\/\/t.co\/kw9A3ZUpWH","— Circle (@circle) February 21, 2024","","Further, Circle said it will enable Circle Mint customers to transfer USDC to alternative blockchains until Feb. 2025. They will have the option to transfer their USDC from TRON to other compatible blockchains, or redeem them directly for fiat currency through Circle.","Circle Mint is a feature allowing businesses and large-scale users to mint and redeem Circle’s stablecoins, USDC and EURC.","“As always, USDC remains redeemable 1:1 for US dollars,” the company added.","Circle’s move comes as troubled blockchain TRON has faced allegations of involvement in money laundering. This has raised concerns about potential illicit activity within its ecosystem.","Relatedly, non-profit ethics organization Campaign for Accountability in November wrote a letter to US Senators Elizabeth Warren and Sherrod Brown. The letter claimed that Circle facilitated funding for terrorist organizations, highlighting transfers on TRON as evidence.","“Circle’s recent employment of its Cross-Chain Transfer Protocol may be used to facilitate what appears to be the fastest growing vehicle for illicit finance in the digital asset space,” the group said.","It added that Circle continued to offer USDC on Tron and other offshore blockchains which pose risks of being employed in illicit activity.","Circle refuted the allegations, stating that it did not facilitate any illegal financing.","Additionally, a Reuters report from December further complicates TRON’s image. According to the report, TRON outshined its competitor Bitcoin, as the preferred platform for organizations labeled as terrorist groups to transfer crypto."],"entity":[{"type":"US Senators Elizabeth Warren","content":"ORGANIZATION"},{"type":"February 2025","content":"DATE"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"” Circle","content":"ORGANIZATION"},{"type":"February 21, 2024","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Feb. 2025","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"}],"hashtag":["Circle","Tron","USDC"],"authors":["Shalini Nagarajan"]}