{"summary":"German Authorities Confiscate 50,000 BTC Worth $2 Billion From Illegal Movie Site","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/german-authorities-confiscate-50000-btc-worth-2-billion-from-illegal-movie-site.htm","publishDate":"2024-01-30T18:26:18","id":20218,"type":null,"title":"German Authorities Confiscate 50,000 BTC Worth $2 Billion From Illegal Movie Site","category":["Blockchain News "],"content":["Following an investigation led by the Dresden General Prosecutor’s Office and the Saxony State Criminal Police, approximately 50,000 Bitcoins were “provisionally” secured in mid-January 2024 in connection with the crackdown on an illegal movie site.","According to German authorities, the illicit movie site in question is movie2k.to, which operated between 2008 and 2013. Allegedly run by a 40-year-old German and a 37-year-old Polish national, the site facilitated the unauthorized download of 880,000 copies of movies, films, and TV shows.","The duo reportedly acquired a substantial amount of Bitcoin from the advertising revenue generated on the platform.","The Saxony State Criminal Police, in collaboration with the Federal Criminal Police Office (BKA), the Federal Bureau of Investigation (FBI), and a Munich-based forensic IT company, successfully tracked down and arrested the suspects.","Upon arrest, the suspects voluntarily transferred their Bitcoin holdings to official crypto wallets provided by the BKA.","Discussing the next steps, the Saxony State Criminal Police pointed out an ongoing investigation into suspected unauthorized commercial exploitation of copyrighted works under the Copyright Act.","As of now, the German authorities have not reached a final decision on how the seized Bitcoin assets will be utilized.","Meanwhile, blockchain analytics firm Arkham Intelligence reported the movement of dormant Bitcoin assets worth $2 billion just before the US market opened on January 16, 2024.","$2 BILLION of dormant Bitcoin moved just before US market open today, across several linked addresses.","The BTC had moved once in 2019, and before that had been dormant since 2013. pic.twitter.com\/xD4frjzQuP","— Arkham (@ArkhamIntel) January 16, 2024","","These Bitcoin assets had remained inactive since 2013, and on January 16, they were consolidated from 49 Bitcoin-based wallet addresses into five new addresses.","Each wallet address held between 8,000 to 12,000 per wallet, worth $380 million to $480 million.","While the German authorities are making their first Bitcoin-based seizure, the US government has become a veteran in confiscating digital assets.","The North American nation has seized several thousands worth of Bitcoins and other alternative currencies (altcoins) over the years.","One such is the infamous Silk Road Bitcoin seizure. According to a recent public notice announcement by the United States Department of Justice (DoJ), it is set to sell off $130 million worth of Bitcoin assets.","#Breaking: 🇺🇸 US to sell $130M Bitcoin from Silk Road seizure.#BTC #Crypto #Cryptocurency #cryptocurrencynews pic.twitter.com\/e8m3t3tpNm","— SKnews (@SKnewsII) January 25, 2024","","The US government clarified that these sales would originate from the Bitcoin seizure linked to Ryan Farace, the developer and founder of the notorious Silk Road.","Silk Road operated as a web-based platform facilitating the purchase of illicit goods from the dark web using cryptocurrencies, especially Bitcoin.","In May 2021, the US government successfully closed the Silk Road operation, resulting in Farace’s imprisonment. At that time the government seized over $3.3 billion worth of BTC."],"entity":[{"type":"$480 million","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Saxony State Criminal Police","content":"ORGANIZATION"},{"type":"Dresden General Prosecutor’s Office","content":"ORGANIZATION"},{"type":"January 16","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Ryan Farace","content":"PERSON"},{"type":"$130 million","content":"MONEY"},{"type":"Federal Criminal Police Office (BKA","content":"ORGANIZATION"},{"type":"Munich","content":"LOCATION"},{"type":"BKA","content":"ORGANIZATION"},{"type":"United States Department of Justice (DoJ","content":"ORGANIZATION"},{"type":"January 16, 2024","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"Farace","content":"LOCATION"},{"type":"$380 million","content":"MONEY"},{"type":"mid-January 2024","content":"DATE"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"$2 BILLION","content":"MONEY"},{"type":"2008","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"$130M","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"January 25, 2024","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["FBI","Germany","movie2k"],"authors":["Jimmy Aki"]}