{"summary":"DeFi Education Fund, Apparel Firm Sue SEC Over Unwritten Airdrop Securities Rule","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/defi-education-fund-apparel-firm-sue-sec-over-unwritten-airdrop-securities-rule.htm","publishDate":"2024-03-26T09:40:47","id":20215,"type":null,"title":"DeFi Education Fund, Apparel Firm Sue SEC Over Unwritten Airdrop Securities Rule","category":["News "],"content":["Crypto advocacy group DeFi Education Fund and Texas-based apparel firm Beba filed a lawsuit against the Securities and Exchange Commission (SEC) on Monday. They aim to establish that airdrops should not be classified as securities.","The parties criticized the SEC’s “aggressive approach” to regulating token creators and other participants through enforcement actions.","Thus, Beba is pursuing a court order to safeguard its business from the SEC’s “unlawful” ongoing enforcement efforts.","“Every single one of us in this industry, including the DeFi Education Fund, is harmed by their overreach,” said DeFi Education Fund CEO Miller Whitehouse-Levine. “We are asking the court to put an end to the SEC’s arbitrary abuse of its authority.”","The parties allege that the SEC specifically targets digital asset companies. The agency enforces an unwritten rule that categorizes most digital assets, including airdrops, as securities, per the suit.","Airdrops involve distributing free tokens as part of a marketing strategy. Beba is seeking a court ruling that its $BEBA tokens do not qualify as investment contracts. It also seeks to establish that distributing the tokens for free does not constitute a securities transaction.","Further, the firm specified that it distributes $BEBA tokens at no cost to potential customers. These can then be used to access exclusive products at discounted rates.","“Because $BEBA tokens were given away for free, there was no ‘investment of money’ by recipients of the airdrop, a necessary prong of the Supreme Court’s test for determining whether an investment contract exists,” Beba states.","Now, both parties are urging the court to enforce the Administrative Procedure Act on the SEC. This act mandates that federal agencies formulate new rules in writing and through an open process. This would allow public input and knowledge about the rules they’re expected to comply with.","The lawsuit comes as enforcement actions in the crypto sector have significantly increased in the past two years.","Still, some Republican lawmakers have voiced concerns over Chairman Gary Gensler’s approach, citing potential impacts on innovation and American competitiveness.","Yet the SEC continues to escalate its enforcement efforts. In 2023 alone, the agency launched 46 crypto-related enforcement actions, marking a 53% increase from the previous year.","In June, both Coinbase and Binance, significant players in the cryptocurrency industry, encountered enforcement actions.","It’s anticipated that the SEC will continue its proactive approach to crypto regulation in 2024, likely relying heavily on enforcement actions to enforce regulatory standards."],"entity":[{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"53%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Beba","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$BEBA","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Levine","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Miller Whitehouse","content":"PERSON"}],"hashtag":["airdrops","Lawsuit","SEC"],"authors":["Shalini Nagarajan"]}