{"summary":"Stripe to Resume Crypto Payments, Starting with USDC Stablecoin on Numerous Blockchains","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/stripe-to-resume-crypto-payments-starting-with-usdc-stablecoin-on-numerous-blockchains.htm","publishDate":"2024-04-26T07:28:38","id":20223,"type":null,"title":"Stripe to Resume Crypto Payments, Starting with USDC Stablecoin on Numerous Blockchains","category":["Altcoin News "],"content":["Fintech giant Stripe has announced its decision to once again allow customers to accept cryptocurrency payments after a six-year break.","The company is starting with USDC stablecoins on the Solana, Ethereum, and Polygon blockchains, according to a report from TechCrunch. ","The news of Stripe’s reentry into crypto payments was unveiled by the company’s co-founder and president, John Collison, at the Connect developer conference held in San Francisco. ","Collison emphasized the improved stability and user experience that stablecoins offer.","“Stripe is bringing back crypto payments—this time with stablecoins, which are a way better experience.”","The latest announcement is part of Stripe’s broader strategy to expand its services and open up its platform to integrate with competing payment providers. ","The move aims to break down the company’s walled garden approach and provide customers with more flexibility and options.","Crypto is back. @Stripe will start supporting global stablecoin payments this summer. Transactions instantly settle on-chain and automatically convert to fiat. Join the waitlist https:\/\/t.co\/hws2OsU3Id and watch the demo (h\/t @Solana) from Sessions. pic.twitter.com\/zGKYW2FM6i","— John Collison (@collision) April 25, 2024","","Stripe’s history with cryptocurrency has been a delicate dance, balancing its disruptive fintech roots with the need for stability. ","The company has always sought to be at the forefront of discussions surrounding blockchain-based technologies and their impact on financial services. ","However, it has also been cautious not to compromise its position as a reliable and responsible financial powerhouse. ","Stripe processed a staggering $1 trillion in transactions last year and continues to grow, with a current valuation of $65 billion.","In 2014, Stripe dipped its toes into the world of cryptocurrency with tests involving Bitcoin, the pioneering digital currency. ","However, in 2018, the company decided to halt its support for Bitcoin due to its volatility and lack of suitability as a means of exchange. ","Stripe acknowledged that Bitcoin had become more of an asset than a practical form of payment.","Stripe’s relationship with cryptocurrency took another turn in June 2019 when it became a founding member of the Libra project spearheaded by Facebook. ","However, within a few months, Stripe, along with other prominent companies, withdrew its support for Libra, citing a continued interest in projects that promote accessible online commerce worldwide but expressing openness to collaborating with the Libra Association in the future.","After a three-year hiatus, Stripe cautiously embraced cryptocurrencies again, this time by enabling stablecoin payouts for Twitter users. ","The success of this endeavor appears to have encouraged the company to explore further crypto integration possibilities.","Aside from Stripe, other payment companies have also adopted stablecoins as a means of payment.","Last week, Singapore-based payments company Triple-A announced plans to integrate PayPal’s stablecoin into its list of supported tokens for customer payments. ","As the first licensed crypto payments firm in Singapore, Triple-A aims to introduce support for PayPal’s stablecoin, PYUSD, by the end of June.","Currently, the company offers payment services primarily in Bitcoin, Ether, and stablecoins issued by Tether and Circle.","Tether’s USDT remains the dominant stablecoin in the crypto market, with approximately $110 billion in circulation. ","In comparison, PYUSD, which launched in August 2023, has a circulating supply of just over $200 million."," "],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"2014","content":"DATE"},{"type":"April 25, 2024","content":"DATE"},{"type":"August 2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$65 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"John Collison","content":"PERSON"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"June 2019","content":"DATE"},{"type":"$1 trillion","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Libra Association","content":"ORGANIZATION"},{"type":"Collison","content":"PERSON"},{"type":"Stripe","content":"LOCATION"},{"type":"$110 billion","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"6i","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crypto Payment","Stablecoin","USDC"],"authors":["Ruholamin Haqshanas"]}