{"summary":"Terra Luna Classic Crypto Price Prediction – Time to Buy LUNC?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crypto-price-prediction-time-to-buy-lunc.htm","publishDate":"2022-09-14T20:56:00","id":20224,"type":null,"title":"Terra Luna Classic Crypto Price Prediction – Time to Buy LUNC?","category":["Altcoin News "],"content":["The sentiment for Terra Luna Classic (LUNC) crypto remains bearish this week as the price nosedives down to $0.000255. ","Over the last 24-hours Terra Luna Classic has been one of the worst performers, dropping by over 31% in price. ","However, there is still light at the end of the tunnel as LUNC is trading within a bullish reversal pattern known as a falling wedge.","Will Terra Luna Classic continue to pump? ","As the famous saying goes, nothing lasts forever and neither did the uptrend for Terra Luna Classic (LUNC). ","The bearish divergence on the 4-hour time frame finally played out when LUNC got rejected at the $0.000593 price level and flipped into a downtrend. ","Terra Luna Classic is now trading at $0.000289, down 51.33% from the recent high set just a week ago. ","However, there is still light at the end of the tunnel. Currently, LUNC resides within a bullish reversal pattern known as a falling wedge. There is a good chance that we might see a strong breakout to the upside with enough accumulation around the lower price levels. ","The above price chart clearly reflects a bearish trajectory for LUNC over the last few days. We can see prior to the downtrend, LUNC was healthily bouncing off of the 20-day moving average and setting higher highs and higher lows. ","Now we are seeing the exact opposite occur where Terra Luna Classic is getting rejected at the 20-day moving average and at the upper resistance trendline of the falling wedge at $0.000593, $0.000509, $0.000394 and $0.000377.","Terra Luna Classic must now gain enough bullish momentum to break through the $0.000333 resistance level. Upon doing so, the technical target for LUNC is $0.00051 which would be a 61% increase from current price levels. ","Zooming into the 15-minute time frame for Terra Luna Classic we can see the formation of a symmetrical triangle pattern.","Typically, this is a consolidative continuation pattern, on this particular occasion it would mean potentially dropping down to $0.00027 but I think the bulls may win the battle this time round. ","If LUNC breaks through the $0.0003 resistance trendline of the symmetrical triangle we should see a healthy continuation up to around $0.000319.","There has also been breaking news surrounding Terraform Labs stating that the South Korean court has issued an arrest warrant for Terra Co-Founder Do Kwon himself. ","This has created seismic waves and a huge amount of FUD amongst LUNC and Terra Luna holders causing a deleterious effect on the price for both tokens (LUNC down 17.10%, LUNA down 24.63%).","A recent tweet from crypto analyst @ClassyCrypto_ states that he is speculating that this is merely a shakeout for retail investors as the huge amount of fear being driven from this controversial news is causing panic and as a result large selling pressure. ","NOTE : @stablekwon has NO affiliation with $LUNC at this point.\n\nI presume these are old coins ($LUNA 2.0 is crashing WAY harder.)","$0.00025 could be the bottom on this instance for LUNC, although September is known for being quite a rocky and bearish month for cryptocurrency. If Bitcoin can hold current price levels, I would hope to see LUNC slowly climb back up through to the $0.0003 price levels. ","It is safe to say that Terra Luna Classic has been one of the fastest growing cryptocurrencies for 2022. ","Update – LUNC has recovered back above $0.0003. See our new Terra Classic price prediction post.",""],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"$0.00025","content":"MONEY"},{"type":"$LUNC","content":"MONEY"},{"type":"$LUNA","content":"MONEY"},{"type":"$0.00027","content":"MONEY"},{"type":"51.33%","content":"PERCENT"},{"type":"$0.0003","content":"MONEY"},{"type":"last 24","content":"DATE"},{"type":"$0.000319","content":"MONEY"},{"type":"Terra Luna","content":"ORGANIZATION"},{"type":"Terra Classic","content":"ORGANIZATION"},{"type":"LUNC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"$0.000255","content":"MONEY"},{"type":"$0.000377","content":"MONEY"},{"type":"$0.000333","content":"MONEY"},{"type":"$0.000394","content":"MONEY"},{"type":"$0.000593","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"31%","content":"PERCENT"},{"type":"$0.000509","content":"MONEY"},{"type":"61%","content":"PERCENT"},{"type":"24.63%","content":"PERCENT"},{"type":"Terra Co-Founder Do Kwon","content":"ORGANIZATION"},{"type":"$0.00051","content":"MONEY"},{"type":"$0.000289","content":"MONEY"},{"type":"17.10%","content":"PERCENT"}],"hashtag":["Luna","LUNC","Terra","Terra Luna Classic"],"authors":["Jacob Bury"]}