{"summary":"Tether Boosts Crypto Payments in Eastern Europe with Investment in CityPay.io","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-boosts-crypto-payments-in-eastern-europe-with-investment-in-citypay-io.htm","publishDate":"2024-05-09T04:44:34","id":20233,"type":null,"title":"Tether Boosts Crypto Payments in Eastern Europe with Investment in CityPay.io","category":["Blockchain News "],"content":["Tether Operations Limited, the USDT stablecoin issuer, disclosed today its plans to expand its presence in Eastern Europe through further investment in CityPay.io.","","Tether Boosts Payment Solutions in Eastern Europe with Additional Investment in https:\/\/t.co\/14g9wt7PCC ( @citypayio )https:\/\/t.co\/WSL1GVRhzz","— Tether (@Tether_to) May 8, 2024","","On May 8, Tether officially declared its injection of additional investment into CityPay.io, a platform enabling users to make payments at various establishments, including Wendy’s and Radisson Hotels, using cryptocurrencies like Bitcoin. ","As of May 2024, CityPay.io boasts over 600 locations in Georgia and plans to introduce its own e-wallet and card solutions within two years. The company also plans to establish over 500,000 crypto payment points across the designated expansion regions. ","Paolo Ardoino, CEO of Tether, expressed excitement about the collaboration, stating,","“Our previous collaboration with CityPay.io yielded exciting results in expanding convenient cryptocurrency use across Georgia. With this second investment, we aim to build on those results and drive the adoption of cutting-edge technologies that disrupt traditional payment systems.”","This latest funding initiative builds upon Tether’s previous investment in CityPay.io in 2023, when Tether became one of the world’s pioneering stablecoin firms to invest in the company.","In October 2023, CityPay.io introduced the integration of Tether for payments on the Polygon network. Additionally, in September 2023, Tether CEO Ardoino met with governmental structures in Georgia to bolster Tether’s presence in the country.","","Tether has recently expanded its presence in the digital asset space through strategic partnerships and platform launches, signaling a shift beyond stablecoin offerings into broader realms of innovation.","Last month, Tether joined forces with digital asset infrastructure provider Fuze to advance education and awareness surrounding digital assets in Turkey and the Middle East.","The collaboration, formalized through a Memorandum of Understanding (MoU), addresses various aspects of digital asset education, including cross-border payment solutions, compliance, regulatory framework development, and education for local financial institutions.","As Tether diversifies its focus with initiatives like Tether Evo, the company is pushing boundaries to propel humanity towards a future where technology and human capabilities converge in unprecedented ways.","Tether’s recent launch on TON, the 11th blockchain to host Tether, marks a significant milestone in expanding accessibility and utility for users worldwide. With the swift issuance of $60 million worth of USDT, TON’s integration underscores Tether’s commitment to enhancing its ecosystem."],"entity":[{"type":"Middle East","content":"LOCATION"},{"type":"May 8, 2024","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"May 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Tether Evo","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"October 2023","content":"DATE"},{"type":"Wendy’s","content":"PERSON"},{"type":"$60 million","content":"MONEY"},{"type":"May 8","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"Eastern Europe","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Tether","Tether USDT"],"authors":["Hassan Shittu"]}