{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/20301\/bitmain-and-kraken-motion-to-dismiss-alleged-bitcoin-cash-manipulation","publishDate":"2019-04-20T15:30:43","id":2023,"type":null,"title":"Bitmain and Kraken motion to dismiss alleged Bitcoin Cash manipulation","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]United American Corp. v. Bitmain Inc., et al., S.D. Florida 1:18-cv-25106 [SDP]<\/strong><\/em>","One of the more interesting recent lawsuits involving cryptocurrency is an antitrust complaint filed by United American Corp. against Bitmain, Kraken and a list of well-known cryptocurrency personalities alleging antitrust violations in connection with an alleged “scheme by a tight knit group of individuals and organizations to manipulate the cryptocurrency market for Bitcoin Cash.” The Defendants have lawyered and submitted motions to dismiss, to which Plaintiff has responded. However the Court ultimately rules, the way the sides frame the issues is fascinating and may have implications for other disputes that are either currently burbling or may arise in the future.","First, a tl;dr about the lawsuit itself. Plaintiff describes the gravamen of the complaint as follows in the introduction its Motion to Dismiss response: “Defendants effectively hijacked the Bitcoin Cash network, centralized the market, and violated all accepted standards, protocols and the course of conduct associated with Bitcoin since its inception. The highly planned and coordinated scheme caused a global capitalization meltdown of more than $4 billion and cause many U.S. Bitcoin holders — including Plaintiff — to suffer damages and irreparable harm … [In addition,] there are significant long-term implications for world economies and particularly the U.S. economy.” [Editorial observation — this last line seems like … a stretch.] Plaintiffs say that the allegations in the complaint describing this are enough to “infer an agreement in restraint of trade and, thus, an antitrust violation under Section I of the Sherman Act”, as well as state law claims.","Bitmain’s motion to dismiss argues that the antitrust claim fails because the lawsuit doesn’t allege facts to show or infer an agreement between any of the defendants. Rather, Bitmain says the allegations align more with independent action than conspiracy, and “boil down” to the fact that Bitmain and other Defendants voted with their CPU power and in so doing combined hashing power with the Bitcoin.com pool, after which “independent software developers implemented checkpoints in the Bitcoin Cash blockchain to prevent others from rolling back the update [and] some Bitcoin.com and Kraken employees bragged on social media about Bitcoin Cash ABC’s victory over Bitcoin Cash SV.” According to Bitmain, none of this suggests an unlawful agreement involving Bitmain.","Bitmain also argues that the complaint fails to plead a restraint of trade or harm to competition, also required for an antitrust claim. “None of [plaintiff’s] alleged injuries reflects any harm to competition.” Following the fork, Bitcoin Cash SV continued to exist and be traded on exchanges next to hundreds of other cryptocurrencies: “the vote represented competition in its truest form, not a lack of it.” In addition, Bitmain argues that no facts are alleged to “support its wholly conclusory assertion that the implementation of the Bitcoin Cash ABC upgrade cause the decline in Bitcoin Cash prices, as opposed to broader macroeconomic forces.” (It makes a couple of other arguments, but these are some of the major ones).","I also took a look at Kraken and Jesse Powell’s Motion to Dismiss. (Powell is Kraken’s CEO). A large part of their argument is that the lawsuit is a way to hold the defendants liable for the collapse in Bitcoin Cash prices, which resulted from market forces, not an elaborate conspiracy. It makes no sense, they argue, for Kraken to do anything to lower Bitcoin Cash prices, because higher prices would have been better for business. The antitrust theory simply makes no sense, they suggest — “exchanges make the most money in a market with rising prices[.]” Furthermore, they argue that choosing a particular product, standard or service doesn’t violate antitrust laws. In addition, Kraken isn’t alleged to be competitor of any of the other defendants. The remainder of the motion runs through an analysis of the various elements of an antitrust claim, concluding that the Plaintiff fails to satisfy any of them.","How did the Plaintiff respond to all of this? It’s important to note that for purposes of a motion to dismiss you only have to plead facts that if taken as true give rise to a claim. You don’t have to prove that the facts are true, just that they support a recognized legal theory. Plaintiff says they’re done that by alleging facts that show “Defendants have made explicit statements declaring that they coordinated, conspired and agreed with each other.” This includes Bitmain redeployment of up to 90,000 Antminer S9 servers in November as a resolution of collusion between Roger Ver, Bitcoin.com, Jihan Wu and Bitmain. Plaintiff says (based on a YouTube video) that this was all agreed to in advance (“rigged”) with Kraken.","Plaintiff’s weakest response may be about how its damages claim works. According to Plaintiff, “Defendants misrepresented to Plaintiff and the market that they would abide by the [Satoshi] Whitepaper and accepted standards and protocols.” Relying on this “misrepresentation”, Plaintiffs claimed that they bought millions of dollars of equipment to mine Bitcoin Cash and that by “colluding” and effectively centralizing the market by adding a software checkpoint inconsistent with the technology that plaintiff had invested in, defendants damaged them. Hmmmm. Nor sure where the representation or misrepresentation is. I’d probably point this out to the Court and I am sure that if it’s a decent argument the defendants will do just that.","The motions appear to be largely briefed, so we will eventually receive a very interesting Order from the Court, resolving all of this. There are state law claims as well, which the defendants also seek to have dismissed. We’ll provide an update when the ruling is handed down. While motions to dismiss are difficult at this stage if someone can state a plausible claim, I would not be shocked if the antitrust claims are dismissed, at least as to Kraken and Powell. I have a lesser degree of certainty about Bitmain, but some real doubts about the damages claim here, which sounds weak.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Plaintiff","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Bitmain","content":"LOCATION"},{"type":"Bitmain","content":"PERSON"},{"type":"Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"S.D. Florida","content":"LOCATION"},{"type":"United American Corp.","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ABC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Jihan Wu","content":"ORGANIZATION"},{"type":"Antminer S9 servers","content":"ORGANIZATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"United American Corp. v. Bitmain Inc.","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Satoshi] Whitepaper","content":"PERSON"},{"type":"Roger Ver","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}