{"summary":"Crypto Miner Phoenix Group Reports 50% Jump in Net Income","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-miner-phoenix-group-uae-reports-50-jump-in-net-income.htm","publishDate":"2024-02-15T11:46:07","id":20248,"type":null,"title":"Crypto Miner Phoenix Group Reports 50% Jump in Net Income","category":["Cryptonews Deals "],"content":["UAE-based blockchain mining firm Phoenix Group said it has seen a 50% growth in net income and a “substantial increase” in year-on-year sales following its initial public offering (IPO) on the Abu Dhabi Stock Exchange.","In an announcement, Phoenix Group said sales experienced a surge of 20% year-on-year. The firm’s core hosting business saw year-on-year growth of 119% and its self-mining businesses experienced year-on-year growth of 480%.","Company results show that the Phoenix Group significantly increased the value of its total assets compared to 2022, from $229 million to $834 million in 2023.","The UAE is an attractive destination for high-net-worth individuals (HNWIs) and Phoenix Group is pinning its success to strategic partnerships made in the region.","“This success stemmed from strategic partnerships with high-net-worth individuals, power supply companies, and mining equipment manufacturers, solidifying a foundation for continued growth in the coming years,” said Phoenix Group in a press release.","In January, Phoenix Group announced it had successfully acquired mining equipment valued at $187 million from Bitmain Development PTI Limited. Phoenix Computer Equipment, a subsidiary of Phoenix Group, disclosed that the acquisition agreement was facilitated through Cypher Capital DMCC.","In December, Phoenix Group disclosed its partnership with Whatsminer. The agreement involved a $380-million deal to procure hydro cooling hardware equipment. This technology utilizes a closed-loop water system that preserves water volume and quality within pipes, enhancing heat transfer efficiency.","Phoenix Group said it is expecting continued growth in 2024, adding that investors can expect further positive developments in the coming months as the company plans to push for success outside of the UAE.","“Our success has been impressive, but 2024 promises to be truly transformative. With ambitious plans and an unwavering commitment to excellence, the group is poised to redefine success, not just in the UAE, but on a global scale,” said Seyed Mohammad Alizadehfard, the co-founder and CEO of Phoenix Group, in a press release.","It seems the Bitcoin Halving is triggering mining acquisitions, reports Jimmy Aki from Cryptonews. As Bitcoin approaches its halving event scheduled for April 2024 – a crucial moment when mining rewards are halved – companies are intensifying their efforts to acquire advanced mining machines.","This strategic initiative is aimed at improving mining efficiency, boosting profitability, and solidifying their positions in the cryptocurrency mining sector.","Hive Digital Technologies, renowned for its expertise in data centre operations, recently secured 7,000 S21 Antminers from Bitmain on December 21, 2023."," "],"entity":[{"type":"Bitmain Development PTI","content":"ORGANIZATION"},{"type":"April 2024","content":"DATE"},{"type":"Digital Technologies","content":"ORGANIZATION"},{"type":"Bitmain","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"$834 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Whatsminer","content":"ORGANIZATION"},{"type":"Phoenix Computer Equipment","content":"ORGANIZATION"},{"type":"$380","content":"MONEY"},{"type":"$229 million","content":"MONEY"},{"type":"$187 million","content":"MONEY"},{"type":"Seyed Mohammad Alizadehfard","content":"PERSON"},{"type":"Phoenix Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December 21, 2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"119%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"Abu Dhabi Stock Exchange","content":"ORGANIZATION"},{"type":"Bitcoin Halving","content":"PERSON"},{"type":"480%","content":"PERCENT"},{"type":"Jimmy Aki","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["Crypto Mining","Phoenix Group","UAE"],"authors":["Tanzeel Akhtar"]}