{"summary":"Edward Snowden Warns “The Clock Is Ticking” for Bitcoin Privacy","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/edward-snowden-addresses-bitcoin-privacy-after-crypto-mixers-charged.htm","publishDate":"2024-05-03T20:54:42","id":20246,"type":null,"title":"Edward Snowden Warns “The Clock Is Ticking” for Bitcoin Privacy","category":["Bitcoin News "],"content":["With the U.S. government targeting crypto mixers, Edward Snowden, the famed whistleblower and vocal supporter of cryptocurrencies, took to X on Thursday to urge Bitcoin developers to prioritize privacy. He stressed that time is running out to implement privacy solutions at the protocol level.","“I’ve been warning Bitcoin developers for ten years that privacy needs to be provided for at the protocol level,” Snowden warned on X. “This is the final warning. The clock is ticking.”","I've been warning Bitcoin developers for ten years that privacy needs to be provided for at the protocol level. This is the final warning. The clock is ticking. https:\/\/t.co\/r7w7gdrHRp","— Edward Snowden (@Snowden) May 2, 2024","","Snowden’s X post, which has received over 8,400 likes, responded to Wasabi Wallet’s announcement that its developer, zkSNACKs, would formally shutter its Coinjoin service due to a lack of regulatory clarity in the U.S.","“This decision was made after careful consideration and with a heavy heart,” a statement from ZkSNACKs reads. “Throughout our history, we have always made efforts to operate under legal clarity. At this point, we need to regain more certainty before moving forward.”","The closure of the crypto mixer, a process designed to obfuscate the source of crypto transactions to make them harder to trace, comes as the U.S. is cracking down on companies that offer the service.","Last year, the U.S. government charged the founders of crypto mixer Tornado Cash with money laundering, operating an unlicensed money transiting service, and sanctions evasions.","U.S. prosecutors allege that the crypto mixer “laundered hundreds of millions of dollars for the Lazarus Group,” a state-sponsored hacking collective from North Korea. ","The Department of Justice (DOJ) also arrested the founders of crypto mixer Samourai Wallet last month on similar charges, prompting concern from the crypto community that the government might view self-custody wallets as unregistered money-transmitting businesses.","If they do, it could mean greater regulatory enforcement actions for non-custodial crypto services in general.","Snowden criticized the DOJ’s stringent legal action against the Samourai Wallet founders, echoing the need to further privatize cryptocurrencies.","The Department of \"Justice\" has once again criminalized the developers of an app that restores financial privacy. The way to fix this it to make money private by default. Privacy must never be \"exceptional,\" or they will make it criminal.","— Edward Snowden (@Snowden) April 24, 2024","","“The Department of ‘Justice’ has once again criminalized the developers of an app that restores financial privacy,” Snowden said. “The way to fix this is to make money private by default. Privacy must never be ‘exceptional,’ or they will make it criminal.”","Snowden is no stranger to privacy issues. In 2013, the former computer contractor infamously leaked highly classified information belonging to the National Security Agency (NSA).","The whistleblower has long defended digital assets and recently called Bitcoin “the most significant monetary advance since the creation of coinage.” His warning highlights the consequences of inaction as regulatory pressures mount."],"entity":[{"type":"Edward Snowden","content":"PERSON"},{"type":"May 2, 2024","content":"DATE"},{"type":"April 24, 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"North Korea","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"crypto mixer","content":"ORGANIZATION"},{"type":"Department of \"Justice\"","content":"ORGANIZATION"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"National Security Agency (NSA","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"laundered hundreds of millions of dollars","content":"MONEY"},{"type":"Snowden","content":"PERSON"},{"type":"The Department of ‘Justice’","content":"ORGANIZATION"}],"hashtag":["Bitcoin developers","Crypto mixing","Edward Snowden"],"authors":["Julia Smith"]}