{"summary":"Financial Advisors Skeptical About 2024 Spot Bitcoin ETF Approval, Survey Finds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/financial-advisors-skeptical-about-2024-spot-bitcoin-etf-approval-survey-finds.htm","publishDate":"2024-01-05T13:40:13","id":20240,"type":null,"title":"Financial Advisors Skeptical About 2024 Spot Bitcoin ETF Approval, Survey Finds","category":["Bitcoin News "],"content":["A new survey from digital asset management firms Bitwise and ETF data provider VettaFi has revealed a notable disparity in expectations among financial advisors regarding the approval of a spot Bitcoin ETF in 2024.","While the survey indicated persistent client interest in crypto, it also exposed lingering barriers faced by financial advisors, such as limited access to crypto, regulatory uncertainty, and concerns about market volatility, an announcement from the two firms said.","According to the findings, less than half of the surveyed advisors (39%) anticipate the approval of a spot Bitcoin ETF in 2024, contrasting sharply with Bloomberg ETF analysts’ estimate of “a very optimistic 90%” likelihood of an ETF approval by January.","LESS THAN HALF OF ALL ADVISORS EXPECT A SPOT BITCOIN ETF IN 2024…","In a surprising development, only 39% of advisors believe a spot bitcoin ETF will be approved in 2024. By contrast, Bloomberg ETF analysts peg the likelihood of a January approval at 90%.","— Bitwise (@BitwiseInvest) January 4, 2024","","Despite lower expectations for approval, a substantial 88% of advisors who expressed interest in purchasing Bitcoin plan to do so after the approval of a spot Bitcoin ETF, suggesting the potential for an unexpectedly significant market impact.","Only 19% of advisors claim the ability to buy crypto in client accounts, indicating limited access to digital assets in their advisory capacity.","Advisors already invested in crypto indicate a strong commitment, with 98% planning to either maintain or increase their exposure in 2024.","The size of crypto allocations is also on the rise, with 47% of client portfolios with crypto exposure exceeding 3%.","Despite challenges, 88% of advisors received client inquiries about crypto in the past year.","Notably, 59% of advisors reported that “some” or “all” of their clients were independently investing in crypto outside of their advisory relationship.","In a notable shift from the previous year, 71% of advisors favor Bitcoin over Ethereum, marking a significant increase from the previous year’s 53%.","Regulatory uncertainty remains a significant concern, cited by 64% of advisors, followed closely by concerns about market volatility (47%).","The survey garnered responses from more than 400 financial advisors across the US."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"53%","content":"PERCENT"},{"type":"64%","content":"PERCENT"},{"type":"88%","content":"PERCENT"},{"type":"71%","content":"PERCENT"},{"type":"39%","content":"PERCENT"},{"type":"19%","content":"PERCENT"},{"type":"47%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"59%","content":"PERCENT"},{"type":"January 4, 2024","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Bitcoin","Bitwise","ETF"],"authors":["Fredrik Vold"]}