{"summary":"Elon Musk May Launch Twitter IPO After Takeover – Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/elon-musk-may-launch-twitter-ipo-after-takeover-report.htm","publishDate":"2022-05-04T12:35:00","id":20244,"type":null,"title":"Elon Musk May Launch Twitter IPO After Takeover – Report","category":["Altcoin News "],"content":[" ","As Elon Musk is advancing his plan to buy Twitter in a deal valued at some USD 44bn, the Tesla CEO has reportedly told potential investors that the social platform could be returned to public ownership after a few years.","Musk declared that he intended to launch Twitter’s initial public offering (IPO) perhaps as soon as three years from when he purchases the platform, persons familiar with the matter told The Wall Street Journal. ","With this in mind, the entrepreneur has discussed his future plans for the site with various players, including private-equity firms, who could take part in the deal. Apollo Global Management is one of the potential participants, they said.","The takeover is expected to be finalized by the end of this year, and it will be subject to the approval of Twitter’s shareholders and relevant regulators.","Musk’s bid to take over the platform for USD 54.20 a share means that Twitter could become one of the world’s most valuable privately-owned companies. At the same time, the multi-billionaire claims that his main intention is to bolster free speech through the takeover, and not to enrich himself.","Twitter will always be free for casual users, but maybe a slight cost for commercial\/government users","The deal’s importance for the crypto industry is emphasized by the fact that Twitter is a major venue for crypto-focused communication.","“Twitter isn’t a particularly valuable company relative to peers. It’s valued at a market cap of [USD] 37.5 billion with 217 million daily active users, far behind most of its social media competitors,” stated a recent newsletter by the crypto podcast Bankless. ","“But Twitter is a gateway to cultural significance. Unlike Facebook or Instagram where users add\/follow others, its open ecosystem design is akin to a public town square space where every voice can be heard. It’s why it’s been so effective for crypto,” the newsletter said. ","Furthermore, Musk has today changed his profile picture on Twitter to a collage of the popular Bored Ape Yacht Club (BAYC) non-fungible tokens (NFTs). ","It seems that this particular image is a stock photo.  The Ape #5809, currently priced at ETH 85 (USD 243,430), sits in its center. This latest bid follows a much lower one of ETH 6.64. Notably, the high bid has been placed at 11:00 UTC today after days of inactivity. ","At 11:42 UTC, Apecoin (APE), launched by BAYC creator Yuga Labs, was up nearly 1% in a day and down 13.3% in a week, trading at USD 15.59. At one point today, the coin had jumped from USD 14.54 to USD 17.46, dropping to the current level soon after.  ","____","Learn more:\n– Elon Musk NFT First to Enter Ukrainian Hall of Fame and You Can’t Buy It\n– Elon’s Twitter: bluesky Keeps Independence, Dorsey Praises Musk, Market Awaits Next Step\n\n– Crypto Community Welcomes Musk’s Twitter Bid as Obstacles Emerge\n– Musk Not Joining Twitter’s Board But Wants ‘Significant Improvements’, Teases DOGE Payments Integration\n– Elon Musk Won’t Sell Bitcoin, Ethereum, Dogecoins as Inflation Soars and Recession Risk Grows\n\n– Blockchain.com’s IPO Might Happen This Year, Indian Exchange CoinDCX Doubles Valuation\n– Bitfury Is Said To Be Valued ‘In Billions’ as IPO Rumors Reemerge"],"entity":[{"type":"Apollo Global Management","content":"ORGANIZATION"},{"type":"BAYC","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"PERSON"},{"type":"Crypto Community Welcomes Musk","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"5809","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"13.3%","content":"PERCENT"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Tesla CEO","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Teases DOGE Payments Integration\n– Elon Musk","content":"ORGANIZATION"},{"type":"Elon Musk NFT First to Enter Ukrainian Hall of Fame","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Dorsey","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Elon Musk","IPO","NFT","Non-fungible tokens","Twitter"],"authors":["Jaroslaw Adamowski"]}