{"summary":"Over One Million Pudgy Penguin Toys Sold in the Past Year","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/over-one-million-pudgy-penguin-toys-sold-in-the-past-year.htm","publishDate":"2024-05-13T09:29:10","id":20257,"type":null,"title":"Over One Million Pudgy Penguin Toys Sold in the Past Year","category":["NFT News "],"content":["The Pudgy Penguins nonfungible token (NFT) project has achieved a remarkable milestone, with more than one million Pudgy Penguin toys sold over the past 12 months.","According to CEO Luca Schnetzler, the popular NFT project has experienced a surge in sales, expanding its reach to retailers worldwide.","In a recent post on X, Schnetzler expressed surprise at the Consumer Crypto revolution being led by “fat flightless birds.”","The sales milestone comes on the heels of the recent news that Pudgy Toys with Pudgy World are now available in the prominent United States retail giant, Target.","Over 1,000,000 toys sold in the last 12 months as @pudgypenguins continues it's expansion in retailers all over the world.","Who would've thought that the Consumer Crypto revolution was going to be lead by fat flightless birds. pic.twitter.com\/E8jmSICwlt","— Luca Netz 🐧 (@LucaNetz) May 12, 2024","","Pudgy Penguins, a collection of 8,888 colorful penguin avatars, gained popularity after its creation in 2021.","The project faced initial challenges, with accusations of a rug pull against the former founder.","However, in 2022, Schnetzler acquired the brand for $2.5 million, revitalizing its prospects.","The success of Pudgy Penguins extends beyond the digital realm, as stuffed toy versions of the lovable penguins are now also available for purchase in retail giants like Walmart and Target.","The move has contributed to the project’s ongoing triumph.","One unique aspect of Pudgy Penguins is its model that allows NFT holders to earn 5% royalties on net revenues from sales of physical products featuring their unique Pudgy Penguin designs. ","The NFT versions themselves have gained significant value, with a floor price of 12.87 ETH (approximately $37,580 at current prices) on NFT marketplace OpenSea.","The recent sales highlight includes the impressive transaction of Penguin #6873, which was sold for a staggering 400 ETH, equivalent to around $1.17 million, according to OpenSea.","Sales activity for the Pudgy Penguins collection experienced a peak in mid-February, with 439 sales per day at an average price of 20 ETH.","While sales volumes have slightly declined since then, the project still maintains a daily average of approximately 269 sales as of May 6.","In terms of secondary sales over the past seven days, Pudgy Penguins ranks twelfth on the NFT sales tracking platform CryptoSlam, with a total value of $2.2 million.","Back in February, Pudgy Penguins partnered with Unstoppable Domains to introduce “.pudgy” domain names. ","The collaboration allows customers of Unstoppable Domains to purchase top-level domain names ending in “.pudgy,” which can be associated with Pudgy Penguin NFTs.","The integration introduces numerous possibilities for domain holders, including the ability to send and receive web3 messages, make crypto payments between domain addresses, and collect exclusive utility badges through the new domains.","“We are thrilled to welcome Pudgy Penguins, a true innovator and a strong brand, into the Unstoppable Domains family,” said Sandy Carter, COO at Unstoppable Domains."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"6873","content":"DATE"},{"type":"$37,580","content":"MONEY"},{"type":"Pudgy World","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Luca Schnetzler","content":"PERSON"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Pudgy Penguin NFTs","content":"ORGANIZATION"},{"type":"May 12, 2024","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Pudgy Toys","content":"ORGANIZATION"},{"type":"mid-February","content":"DATE"},{"type":"Pudgy Penguins","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"May 6","content":"DATE"},{"type":"Pudgy Penguins","content":"LOCATION"},{"type":"$2.2 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Schnetzler","content":"PERSON"},{"type":"Luca Netz","content":"PERSON"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"$1.17 million","content":"MONEY"}],"hashtag":["NFT","Pudgy Penguins"],"authors":["Ruholamin Haqshanas"]}