{"summary":"Bitcoin Millionaire Jumps From Window to Escape Burglar","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-millionaire-jumps-from-window-to-escape-burglar-4609.htm","publishDate":"2019-09-09T10:07:00","id":20255,"type":null,"title":"Bitcoin Millionaire Jumps From Window to Escape Burglar","category":["Bitcoin News "],"content":["A previously unknown event in Norway should serve as a reminder to all crypto holders to secure not only their funds but to take care of their personal security also.","According to Norwegian broadcaster TV2, a high-profile local bitcoin investor in his forties barely got away from a robbery in his own house earlier this year, when an armed man showed up at his door.","According to the report, the victim, a businessman who has reportedly been working in the crypto industry for close to a decade, was spending his evening at home in his apartment in Oslo when someone knocked on the door. When he opened, an unknown man aimed at him with a shotgun as he ordered the bitcoin investor to get down on the floor.","However, instead of complying and giving away his money, the victim chose to run off by jumping from his balcony located on the second floor of the building. It is still unknown whether the victim suffered any injuries from the incident, TV2 said.","The local broadcaster said that the man owns a company in the crypto industry, and that publicly available financial statements shows that his wealth amounts to over NOK 100 million (USD 11 million).","Although the attempted robbery happened all the way back in May of this year, details have only recently gotten known to the public.","The case is scheduled to come up for trial in Oslo on October 17 and 18. Both the victim’s attorney and the perpetrator’s defense lawyer declined to comment on the case.","The story from Norway comes a year after a 24-year-old bitcoin investor was tragically murdered in his Oslo apartment after selling bitcoin for cash. Although the suspect was later apprehended, at the time it was unclear if the murder was directly related to the bitcoin sale.","Meanwhile, in February 2019, crypto community was disturbed by the brutal robbery attempt in the Netherlands, when three armed robbers with police vests broke into a residential building and tortured 38 years old Bitcoin trader for over an hour using a drill.","In either case, these are not the first cases when cryptocurrency holders become victims of a robbery. Crypto robberies at gunpoint and kidnappings of wealthy digital asset holders have been happening throughout 2018.","Before you go and buy yourself a gun or install the latest security system in your home, you should know that there are cheaper and perhaps more sensible precautions that you can take.",""],"entity":[{"type":"Oslo","content":"LOCATION"},{"type":"October 17","content":"DATE"},{"type":"Norway","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"NOK 100 million","content":"MONEY"},{"type":"February 2019","content":"DATE"},{"type":"2018","content":"DATE"}],"hashtag":["Crime","Security"],"authors":["Fredrik Vold"]}