{"summary":"Ethereum Price Prediction as ETH Rallies Above $1,600 – Can ETH Reach $10,000 in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-price-prediction-as-eth-rallies-above-1600-can-eth-reach-1-2023.htm","publishDate":"2023-01-30T12:25:00","id":20258,"type":null,"title":"Ethereum Price Prediction as ETH Rallies Above $1,600 – Can ETH Reach $10,000 in 2023?","category":["Altcoin News "],"content":["The value of the largest smart contracts platform, Ethereum continues to gain strength against the US dollar, especially with its recent move above $1,600. Recovery is expected to continue after the Federal Open Market Committee (FOMC) meeting and decision on the interest rate hike in two days.","Experts say that cryptos may generally retreat before then, thus shaking out weak hangs before carrying on with the bullish move aiming for highs above $2,000. Ethereum price had pulled back to trade at $1,594 at the time of writing with support around $1,500 expected to absorb the growing selling pressure.","Investors are anxiously waiting for the Federal Reserve decision on interest rate hikes and expect the regulator to continue with its strict measures to curb economic growth. However, market watchers are eyeing a 25-basis points increase, relatively lower than the December hike of 50-basis points.","This positive sentiment hails from a general inflation drop for December to 6.5% from 7.1% recorded for November. Although the drop is not big enough to see the Fed lift the foot off the gas pedal completely, it signals that the economy is headed in the right direction.","CPI is an indicator for the Fed to either tighten its monetary measures used to combat inflation or loosen its grip – allowing markets to recover, especially those considered to have a high volatility index like digital assets.","Meanwhile, Ethereum price is still in a position to break out significantly despite the resistance at $1,680. Since the tentative support at $1,600 has already been infiltrated, ETH price might be forced to look down to $1,500 before the resumption of its uptrend. Based on the daily timeframe chart, the 200-day Exponential Moving Average (EMA) (in purple) solidifies support in that area.","Adding credence to the short-term bearish outlook in Ethereum price is a buy signal from the Moving Average Convergence Divergence (MACD) indicator. The MACD line in blue confirmed the call to traders to offload their bags while locking in profits (shaking off weak hands) by flipping beneath the signal line in blue.","Doctor Profit, analyst and trader on Twitter shared with his large following on Twitter that “weak hands are getting shaken out, market awaits FOMC in two days.” The analyst terms the pullback a “fake dumb” meant to “shake out weak hands” ahead of the next breakout in a few days.","The same daily chart reveals the formation of a falling wedge, whose breakout helped Ethereum price sustain the uptrend to $1,680 in January. It is worth mentioning that ETH price currently exchanges hands approximately halfway through the 46.55% breakout target.","For such a massive upswing to $1,947, a retracement would be expected before another sharp move. That said, support at the 200-day EMA remains crucial to the resumption of the uptrend. However, bulls could hasten the recovery process by reclaiming the lost ground above $1,600.","With this support level in place, investor confidence in the uptrend could grow, thus flipping the odds in favor of a quick move to close the gap to $1,947 and later open the door to gains above $2,000.","Renowned trader and crypto analyst, Rekt Capital informed his 334k followers on Twitter Ethereum is still in a position to breakout above the monthly downtrend resistance. According to his chart, such a move would bring Ethereum price to $2,275. On other hand, failure to successfully achieve this move could see Ethereum retest support at $1,068.","The region between 1,585 and $1,633 is home to at least 2.11 million addresses that purchased 5.28 million ETH in the past. These addresses are currently out of the money (facing an unrealized loss) according to on-chain data presented by IntoTheBlock (ITB).","The immense presence of sellers in this zone means that as Ethereum price recovers, some investors may sell at their various breakeven points, resulting in a spike in overhead pressure. Bulls need to prepare for such eventualities as they push ETH price to higher levels.","A clear break above this wide seller congestion could be the only boost needed to propel Ethereum to the wedge breakout target at $1,947 and possibly guide ETH above $2,000.","On the flip side, Ethereum support sits above clusters of medium-to-strong support areas – illustrated by the green circles. Therefore, the ongoing pullback may not stretch below $1,500. Moreover, it validates the price analysis above.","The bullish outlook in Ethereum price will greatly depend on the Fed’s decision on interest rates. A break above $2,000 is required to confirm a long-term bullish trend in ETH but declines to $1,500 and the 100-day EMA (in blue) at $1,400 cannot be ruled out, at least not for now.","That said, a breakout to $10,000 in 2023 could be a tall order for Ethereum price. However, the token may close in on its all-time high of $4,878, especially if bulls support the second recovery phase above $2,000 over the coming days, possibly a few weeks.","Buy Ethereum Now","Before you invest in Ethereum, you may want to consider other high-potential crypto projects alongside ETH. ","We’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:"," ",""],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$1,633","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"6.5%","content":"PERCENT"},{"type":"$1,594","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"EMA","content":"ORGANIZATION"},{"type":"Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"$2,000","content":"MONEY"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"MACD","content":"ORGANIZATION"},{"type":"$4,878","content":"MONEY"},{"type":"Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"$1,600","content":"MONEY"},{"type":"46.55%","content":"PERCENT"},{"type":"7.1%","content":"PERCENT"},{"type":"$1,947","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Rekt Capital","content":"ORGANIZATION"},{"type":"$1,680","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$1,068","content":"MONEY"},{"type":"$1,400","content":"MONEY"},{"type":"$1,500","content":"MONEY"},{"type":"$10,000","content":"MONEY"},{"type":"IntoTheBlock (ITB","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$2,275","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETH","Ether","Ethereum"],"authors":["John Isige"]}