{"summary":"Iron Bank Euro’s Stablecoin Crisis: No Clear Path to Repeg After 60% Value Drop","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/iron-bank-euros-stablecoin-crisis-no-clear-path-to-repeg-after-60-value-drop.htm","publishDate":"2023-12-20T18:00:08","id":20252,"type":null,"title":"Iron Bank Euro’s Stablecoin Crisis: No Clear Path to Repeg After 60% Value Drop","category":["Blockchain News "],"content":["Iron Bank Euro (IBEUR), a low-cap alternative stablecoin, has found itself in the midst of a crisis with no immediate route back to its stablecoin peg after experiencing a sharp 60% drop in value on Monday.","The stablecoin, with a $3.7 million issuance, tumbled from a price of $0.97 (€0.89) to as low as $0.39 following disruptions in IBEUR’s main trading pool, resulting in an imbalance in the asset’s markets.","Immediately following the crash, the stablecoin surged back up to $0.82, before it again entered into a downtrend.","At the time of writing on Wednesday, IBEUR traded at $0.70. which equals around €0.64.","IBEUR is supposed to be pegged at €1, but has consistently traded around €0.98 over the past month, data from CoinGecko shows.","Despite the partial comeback in the price of IBEUR, uncertainties linger regarding the stablecoin’s ability to swiftly regain its previous price level.","According to a CoinDesk report that cited sources “close to the project,” IBEUR is not currently engaged in any kind of peg maintenance, and the treasury liquidity required to stabilize the asset is lacking.","Funk, the pseudonymous administrator of the Keep3r Network Telegram chat, linked to the project, emphasized this point, saying that the protocol is not actively managing the peg at the moment.","The administrator further explained potential paths to repegging, mentioning the option for the Keep3r treasury to trade liquid assets for IBEUR at a discount. They could then utilize the acquired IBEUR to pay down some of their outstanding borrows with Iron Bank, Funk said.","The depeg incident was triggered by a single trader withdrawing nearly $900,000 in USDC liquidity from the Curve pool that primarily supports trading in IBEUR.","The imbalance resulted from the withdrawal, as the pool was slightly weighted toward IBEUR, lacking sufficient USDC liquidity to maintain proper trading alignment.","According to CoinDesk, Funk mentioned in the Keep3r chat that, regarding the IBEUR\/USDC pool, they would have to wait and let the curve pool readjust.","Additionally, Funk suggested that it would be helpful if the Iron Bank team halted their credit borrowing contract, which currently has 2.5 million IBEUR borrowed and appears to be involved in farming single-sided activities on the pools.Top of Form"],"entity":[{"type":"Funk","content":"ORGANIZATION"},{"type":"$0.70","content":"MONEY"},{"type":"$900,000","content":"MONEY"},{"type":"$0.82","content":"MONEY"},{"type":"Iron Bank","content":"ORGANIZATION"},{"type":"Bank Euro","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$0.97","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$3.7 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$0.39","content":"MONEY"}],"hashtag":["Stablecoin"],"authors":["Fredrik Vold"]}