{"summary":"Starknet to Reduce Transaction Fees as Ethereum’s Dencun Hard Fork Takes Place","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/starknet-to-reduce-transaction-fees-as-ethereums-dencun-hard-fork-takes-place.htm","publishDate":"2024-03-13T06:29:37","id":20251,"type":null,"title":"Starknet to Reduce Transaction Fees as Ethereum’s Dencun Hard Fork Takes Place","category":["Ethereum News "],"content":["Starknet Foundation said it is introducing a new initiative to reduce fees, which benefits users and developers, in parallel to the Ethereum Dencun hard fork.","The Ethereum Dencun upgrade includes EIP-4844 which reduces the costs of layer-2 rollups is taking place today and is expected to immediately decrease gas fees on layer 2s by 75%. After Dencun lands, many of the network’s retail users will ultimately get funnelled onto layer 2s, lured by the cheaper fees.","Starknet operates as a layer 2, providing scale and Ethereum-level security by producing STARK proofs off-chain, and then sending those proofs on-chain.","“As Dencun kicks in on Ethereum, Starknet users can celebrate that they will be feeling a double set of fee savings,” said Diego Oliva, CEO of the Starknet Foundation, in a press release.","“More than users on any other L2 [layer two] they are expected to see Dencun directly cut fees. This is because Starknet fees have the highest proportion of data availability costs, where the savings are being made,” said Oliva.","Starknet said it is ready to get the most out of Ethereum’s 4844hard fork through its own special Dencun-dedicated upgrade dubbed, “Starknet version, 0.13.1.”","The upgrade for this version started on Tuesday. Ethereum’s Dencun upgrade includes EIP-4844 or “proto-danksharding,” a key enhancement that introduces “blobs”—a cheaper transaction type, reducing overall costs on the Ethereum network.","Starknet said with the new update to Starknet 0.13.1, the network will transition from using the expensive ‘calldata’ method for sending data to Ethereum to the more cost-effective ‘blobs’ transaction type, significantly reducing fees.","Calldata currently accounts for 85% to 90% of the gas fees that Starknet pays to post transactions. Version 0.13.1 will also bring additional compute fee reductions.",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"4844","content":"DATE"},{"type":"Oliva","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Diego Oliva","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Dencun","content":"PERSON"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Ethereum Dencun","Starknet"],"authors":["Tanzeel Akhtar"]}