{"summary":"Angry South Korean Crypto Traders Threaten to Quit over New 20% Tax","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/angry-south-korean-crypto-traders-threaten-to-quit-over-new-7222.htm","publishDate":"2020-07-25T00:00:00","id":20267,"type":null,"title":"Angry South Korean Crypto Traders Threaten to Quit over New 20% Tax","category":["Bitcoin News "],"content":["Active crypto traders in South Korea said they are prepared to walk away from the scene forever – slamming “unfair” 20% crypto trading tax law proposals unveiled by the government earlier this week. It is a sign, perhaps, of what traders in other nations will have to deal with in the near future, with draft crypto tax laws now being drawn up by governments all over the planet.","The proposals, which will be bundled with a range of other tax changes, are almost certain to be voted into law in the next parliamentary session, which will convene in autumn. This would allow the law to promulgate in October 2021, and will see anyone earning over around USD 2,100 in crypto trading profits obliged to cough up 20% of their earnings to the taxman.","Speaking to Cryptonews.com, Mira Kim, a South Korea-based blockchain consultant, stated,","“A lot of people really seem to think that it’s not fair, that the bar has been set too high. Stock traders, for example, are allowed to offset their tax payments for up to five years [depending on the size of their trading profits], but it doesn’t look like that will be an option for crypto traders.”","Kim added that many people have told her that going from paying nothing to paying 20% is just too much of a jump, that the government should introduce taxes more gently if it wants to make money from traders instead of just scaring them off.","“I don’t know if it’s just angry talk, but a couple of very active traders have told me that as of the end of this year, they will stop crypto trading for good,” Kim said.","Per Chosun, even legal experts agreed that crypto traders and stock traders were “clearly being treated differently.”","Those hoping to find legal loopholes to help them evade the taxman’s grasp might also find themselves frustrated.","An unnamed lawyer told the media outlet,","“Even [people trying to] bypass [the tax] by using an overseas exchange will eventually have to use a fiat ramp at a domestic exchange. That process will involve clarifying how you acquired the funds.”","Eventually, said the lawyer, the tax authorities would be able to pick on the deal, and would come with questions. Furthermore, the taxman has been given the power to hit would-be crypto tax evaders with a second 20% tax bill should they fail to declare their earnings correctly.","Tax authorities might still struggle to identify and tax peer-to-peer (P2P) trading, said lawyers – a fact that could lead to a boom in harder-to-trace crypto deals."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Mira Kim","content":"PERSON"},{"type":"Kim","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"October 2021","content":"DATE"}],"hashtag":["Altcoins","Bitcoin","South Korea","Tax","Trading"],"authors":["Tim Alper"]}