{"summary":"The Central African Republic has raised $1 million from the sale of its Sango Coin crypto on the first day of the public sale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159716\/central-african-republic-begins-public-sale-of-sango-coin","publishDate":"2022-07-26T13:27:40","id":2026,"type":null,"title":"Central African Republic begins public sale of Sango Coin","category":["CRYPTOCURRENCY"],"content":["Sango Coin, the national cryptocurrency of the Central African Republic (CAR), is now on sale according to details on the Sango project <a href=\"https:\/\/sango.org\/\" data-v-f87c67ca=\"\">website<\/a>.","The public sale began on Monday with the 200 million Sango Coins available for purchase at a price of $0.10. According to the website, the final listing price will be $0.45.","People looking to buy the token need at least $100 in the accepted cryptocurrencies. These coins are bitcoin, ether, binance, tether, usd coin, binance usd, and dai. The sale supports transfers of these tokens on both the Ethereum ERC-20 and Binance Smart Chain networks. The project already stipulated a $500 minimum for participation in this round but was forced to lower the entry requirement amid complaints from prospective buyers.","The Sango project has sold 5.25% of the tokens, as of the time of publishing. &nbsp;This means the project has raised a little over $1 million in the first 24 hours of the public sale. The project plans to raise more than $1 billion from the token sale that will last for one year.","Sango Coins bought during this public sale phase have a one-year vesting requirement. As such, buyers cannot withdraw or transfer their tokens until the lock-up period is over.","CAR’s President Faustin-Archange Touadéra <a href=\"https:\/\/www.theblock.co\/post\/155665\/central-african-republic-launches-national-cryptocurrency-called-sango-coin\" data-v-f87c67ca=\"\">announced Sango Coin<\/a> as the country’s national crypto earlier in July. The token will be used as part of the country’s plans to <a href=\"https:\/\/www.theblock.co\/post\/150041\/central-african-republic-announces-plan-to-tokenize-countrys-minerals\" data-v-f87c67ca=\"\">tokenize its mineral resources<\/a>.","Sango Coin will run on a bitcoin sidechain, as previously reported by The Block. This sidechain is reportedly similar to Blockstream’s Liquid Network with a two-way peg mechanism with BTC and Sango Coin as the tokens in the peg architecture.","CAR became the first African nation, and the second in the world, to adopt bitcoin when it <a href=\"https:\/\/www.theblock.co\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">recognized BTC as legal tender<\/a> in April.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Archange Touadéra","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"20","content":"DATE"},{"type":"5.25%","content":"PERCENT"},{"type":"$0.45","content":"MONEY"},{"type":"Faustin","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$0.10","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"Blockstream’s Liquid Network","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Sango Coin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Osato Avan-Nomayo","The Block"]}