{"summary":"Worldcoin Orb Software Goes Open-Source — What Does it Mean for User Data Privacy?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/worldcoin-orb-software-goes-open-source-what-does-it-mean-for-user-data-privacy.htm","publishDate":"2024-03-22T18:41:47","id":20263,"type":null,"title":"Worldcoin Orb Software Goes Open-Source — What Does it Mean for User Data Privacy?","category":["Blockchain News "],"content":["The Worldcoin Orb has open-sourced some of its eyeball-scanning technology in a bid by founders to verify its claims to data privacy, according to a Friday blog post.","Developers can now review the software components of the Worldcoin Orb on Github, where it has been made publicly available under an MIT\/Apache 2.0 dual license.","The reveal adds to the organization’s pre-existing hardware and iris recognition repositories made available in January 2023 and December 2023, respectively.","“Their public availability marks significant progress in making the Orb’s image processing transparent and its privacy claims verifiable,” the Worldcoin Foundation wrote.","Worldcoin (WLD) is a crypto project designed to distribute digital tokens to every human being on the planet, creating the foundation for a universal basic income scheme.","Doing so requires verifying “humanness” – that each user of the network is actually a one-of-a-kind person, and not artificial intelligence (AI) or a duplicate.","Hence, the foundation is spreading a vast network of Worldcoin Orbs throughout the globe, where network participants can peer into the orb, have their iris scanned, verify their identity, and receive tokens.","However, given the ominous nature of “orbs” and “eyeball scanning,” its founders – including Sam Altman – have received massive criticism from the crypto community for what seems to many like a massive privacy invasion\/surveillance tool.","This looks like it produces a global (hash) database of people's iris scans (for \"fairness\"), and waves away the implications by saying \"we deleted the scans!\"","Yeah, but you save the *hashes* produced by the scans. Hashes that match *future* scans.","Don't catalogue eyeballs. https:\/\/t.co\/uAk0NYGeZu","— Edward Snowden (@Snowden) October 23, 2021","","According to the Foundation, privacy and security were top priorities in the Orb’s construction.","“One privacy-critical step is sending individual data from the Orb to World App for a feature called ‘Personal Custody’. Individuals can use this self-custodied data, for example, for Face Authentication in World App,” they stated.","The Foundation added that it may reduce the frequency in which users must visit the orb to re-verify their identity in the future.","A white-box audit report by Trail of Bits found that the Orb collects no personally identifiable information from its users besides an Iris code. It also said that it collects no information from users’ devices that have the World App installed.","“Further audits are underway and, combined with open sourcing, reflect the Foundation’s aim to maintain a continuously high level of transparency around privacy and security,” the Foundation stated.","The WLD token has risen $3.45 to $8.16 over the past three months. In February, the foundation revealed that World App’s daily active user count has crossed 1 million."],"entity":[{"type":"Edward Snowden","content":"PERSON"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Sam Altman","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Worldcoin Orb on Github","content":"ORGANIZATION"},{"type":"October 23, 2021","content":"DATE"},{"type":"Worldcoin Orb","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"$3.45","content":"MONEY"},{"type":"$8.16","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":["Data privacy","Sam Altman","Worldcoin Orb"],"authors":["Andrew Throuvalas"]}