{"summary":"King River Capital, Immutable, and Polygon Labs Launch $100M Gaming Fund","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/king-river-capital-immutable-and-polygon-labs-launch-100m-gaming-fund.htm","publishDate":"2024-03-20T05:13:10","id":20265,"type":null,"title":"King River Capital, Immutable, and Polygon Labs Launch $100M Gaming Fund","category":["Blockchain News "],"content":["Australian venture capital firm King River Capital, blockchain gaming firm Immutable and Polygon Labs have teamed up to launch a $100 million gaming fund.","In an announcement, the trio said the new fund dubbed the “Inevitable Games Fund” is a first of its kind “ecosystem-agnostic fund” and will identify high growth opportunities for investors.","VC firm King River Capital will lead the investment process with other two specialist firms providing key sourcing and web3 gaming expertise.","Citing data from Messari, a crypto market intelligence firm, the firms said recent data on trends estimates that the combined market share of Immutable and Polygon Labs is to be 70% of total blockchain gaming development, following a significant growth year for the entire industry.","In 2023, it is estimated that the blockchain gaming related rounds reached $1.7 billion which is a significant part of that has flowed to the 270 blockchain games in development on Immutable.","“Spending on video games exceeds the global revenue from movies, streaming TV and the music industry, combined, and it is ripe for a huge technology shift,” said Zeb Rice, co-founder and managing partner at King River Capital, in a press release.","“Just as mobile gaming went from virtually zero in 2008 to 79% of gamers playing mobile today, we believe a similar shift has only just begun to web3 technology. The Fund provides investors with an opportunity to gain unique access to the best web3 gaming projects globally and is designed to benefit from this multi-hundred billion dollar shift in spending to this disruptive new technology,” adds Rice.","It is estimated that total gaming revenue globally will rise from $227 billion in 2023 to $312 billion in 2027, according to a report by PwC.","Key drivers will be the benefits of decentralization and ownership features, play-and-earn models which give players financial incentives to play and progress through games.","The Inevitable Games Fund will be open for investment by professional and sophisticated investors and has supported seven early stage investments including: Pixelmon, Metalcore, Guild of Guardians,and My Pet Hooligan."],"entity":[{"type":"$312 billion","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"2027","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Messari","content":"LOCATION"},{"type":"multi-hundred billion dollar","content":"MONEY"},{"type":"2008","content":"DATE"},{"type":"King River Capital","content":"ORGANIZATION"},{"type":"Zeb Rice","content":"PERSON"},{"type":"PwC","content":"ORGANIZATION"},{"type":"Guild of Guardians","content":"ORGANIZATION"},{"type":"79%","content":"PERCENT"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"$227 billion","content":"MONEY"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":["Polygon","Web3"],"authors":["Tanzeel Akhtar"]}