{"summary":"Hong Kong Government Accelerates Cryptocurrency Product Approvals Following JPEX Rugpull: OSL Compliance Exchange","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-government-accelerates-cryptocurrency-product-approvals-following-jpex-rugpull-osl-compliance-exchange.htm","publishDate":"2023-11-27T06:22:24","id":20273,"type":null,"title":"Hong Kong Government Accelerates Cryptocurrency Product Approvals Following JPEX Rugpull: OSL Compliance Exchange","category":["Altcoin News "],"content":["The JPEX incident has prompted the Hong Kong government to expedite the approval process for cryptocurrency products to promote compliance in the industry.","According to OSL Compliance Exchange, a licensed virtual asset platform, financial technology solution providers have shown interest in the potential benefits of integrating tokenized platforms with banks in the future. ","This integration could leverage the public’s trust in banks, thereby facilitating the growth of the virtual asset industry.","In a comment to Chinese newspaper Ming Pao, BC Technology, a subsidiary of OSL and a licensed virtual asset platform company, acknowledged the government’s longstanding support for the licensed virtual asset industry. ","Hu Zhenbang, chief financial officer of OSL, noted that regulatory authorities have expedited product approvals since the JPEX incident. ","He emphasized that non-compliant platforms will face stricter monitoring, preventing them from employing excessive advertising at MTR stations as seen in the past.","Chen Yaowen, chief digital director and financial technology innovation director at Sifang Innovative Hong Kong, a financial technology solution provider, emphasized their focus on tokenization in the virtual asset field.","By integrating tokenization with the banking system, they aim to accelerate the adoption of relevant technologies by banks.","Chen said that if banks venture into the virtual asset sector and the China Securities Regulatory Commission actively participates in the review and approval process, ensuring compliant operations, it will ultimately facilitate public participation in virtual asset trading through regulated platforms. ","The involvement of banks, coupled with seamless deposits and withdrawals, will contribute to the development of Hong Kong’s virtual asset market. ","Chen also claimed that there is significant potential for banks to explore the development of tokenized virtual assets and custody wallets.","The JPEX scandal, regarded as potentially the largest financial fraud in Hong Kong‘s history, has not only harmed thousands of victims but has dealt a significant blow to retail trust in cryptocurrencies in the jurisdiction. ","Analysts and industry experts have voiced concern that the fallout from the JPEX debacle will present significant challenges for virtual asset companies and hinder the government’s efforts to expand the sector.","“At a time when people still don’t completely understand what Web3 is, the JPEX case has created a negative impression for people in Hong Kong on digital assets and the broader Web3 industry,” Cyrus Ip, a crypto venture investor and chief business officer at artificial intelligence start-up DreamWld Technology, said.","JPEX, established in 2021, targeted retail investors through extensive advertising campaigns in prominent business and transportation hubs. ","The exchange claimed to be a licensed cryptocurrency exchange and enticed investors with promises of high returns, reaching up to 20 percent. ","However, in September, the company raised withdrawal fees and paused the operations of the Earn program on its platform citing an ongoing liquidity crisis."],"entity":[{"type":"MTR","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Chen Yaowen","content":"PERSON"},{"type":"Ming Pao","content":"PERSON"},{"type":"OSL","content":"ORGANIZATION"},{"type":"OSL Compliance Exchange","content":"ORGANIZATION"},{"type":"Sifang Innovative Hong Kong","content":"ORGANIZATION"},{"type":"DreamWld Technology","content":"ORGANIZATION"},{"type":"Cyrus Ip","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"20 percent","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China Securities Regulatory Commission","content":"ORGANIZATION"}],"hashtag":["Hong Kong"],"authors":["Ruholamin Haqshanas"]}