{"summary":"All MetaMask Users Will Now Receive Security Alerts + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/all-metamask-users-will-now-receive-security-alerts-more-crypto-news.htm","publishDate":"2024-02-20T14:45:44","id":20288,"type":null,"title":"All MetaMask Users Will Now Receive Security Alerts + More Crypto News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In today’s crypto news:","__________","Following a successful beta phase, the Consensys-developed wallet MetaMask and Web3 security provider Blockaid announced the by-default integration of privacy-preserving security alerts for all MetaMask extension and mobile app users.","Per the press release shared with Cryptonews,","“This ensures that 100% of global users of the world’s leading self-custodial wallet will automatically receive alerts about potentially malicious transactions, thereby enhancing the wallet’s overall security.”","The security alerts were integrated by default on the Ethereum Mainnet via an extension on January 29. They are now available for mobile and extension on Linea, BNB Chain, Polygon, Arbitrum, Optimism, and Avalanche.","MetaMask estimates that in 2024 alone,","“The privacy- preserving security alerts will prevent hundreds of millions worth of dollar assets from being stolen. Projected over time, the impact of these security alerts is expected to be monumental.”","Also, this positions MetaMask ideally for broader adoption, the press release added. It has seen its Monthly Active Users (MAUs) grow 55% between September 2023 and January 2024, from 19 million four months ago to over 30 million. “This growth nearly matches the peak figures seen during the bull market in 2022.”","However, despite positive signals of mainstream adoption, security in crypto remains a key barrier to broader adoption. Unintended transactions are among the most common causes of fund loss incidents within MetaMask. “Security alerts that proactively thwart malicious transactions are pivotal in safeguarding users against scams, phishing, and hacks,” the company said.","MetaMask and Blockaid don’t share any data with a third party to provide alerts. Instead, they created a privacy-preserving module that simulates transactions while eliminating the need to share every transaction and signature request with external parties.","The peaq blockchain announced an expansion of its ecosystem, with ELOOP NETWORK revealing its plans for a tokenization platform on peaq.","According to the blog post, ELOOP is building a platform that will enable companies and communities to represent a stake in the value generated by their machines as on-chain tokens.","Anyone holding the Machine RWA tokens will be entitled to a share of the rewards allocated for token holders based on their share in the Pool.","It stated that,","“These tokens will generate rewards for their holders based on the real-world value the underlying machines — wind turbines, WiFi hotspots, shared e-scooters, and more — create.”","ELOOP plans to unlock machine real-world asset (RWA) tokenization for Web3 projects, communities, and businesses. This will enable access to more liquidity and new revenue streams. People will be able to directly contribute to and earn from the deployment of infrastructure currently limited to large corporations and governments, it argued.","Furthermore, RWAs are commonly associated with on-chain stocks and other financial instruments. However, says the announcement, tokenizing rewards-generating machines opens a new subcategory: Machine RWAs.","“With real-world machines creating real-world value as their underlying assets, such real-world assets are as real as real gets — and they unlock new opportunities for companies and decentralized physical infrastructure networks (DePINs) looking to set up costly hardware and even infrastructure, solving their capital expenditure challenge.”","They can leverage tokenized RWAs to raise liquidity from the global community of Web3 investors in exchange for a share in future revenue instead of facing the upfront costs.","ELOOP’s project that tokenized vehicles in a car-sharing Tesla fleet in Vienna helped it raise more than €1.6 million without any marketing spend. The company shared the revenues generated by the vehicles with the token holders.","Therefore, it is now building a Machine RWA tokenization platform on peaq to enable businesses to replicate this approach.","ELOOP is already testing the platform on krest, peaq’s canary network. It plans to launch it on the peaq Mainnet this year.","“A range of both Web2 and Web3 projects are already exploring pilot projects on the platform,” it said. This includes connectivity DePIN Dabba, a major energy provider company, and various players from the shared mobility sector.","Initially, ELOOP will focus on tokenizing mobility and energy Machine RWAs, such as solar panels, electric vehicles, and e-scooters, as well as DePINs focused on any industries. In the future, it will expand to include more industries and sectors.","Machine Tokenization is HERE 🔥","Introducing the world's first Machine Real-World Asset (#RWA) Tokenization platform, by @eloop_network, powered by peaq 🌎","Up until now, real-world apps (#DePINs) have been limited by hardware costs.","Individuals can often afford WiFi routers or… pic.twitter.com\/MsZJPa8bxz","— peaq (@peaqnetwork) February 20, 2024","","ZKX, a decentralized perpetual futures exchange operating on Starknet, has launched its second product, Pro Trade. It is a trading exchange for experienced traders, offering advanced features, gasless transactions, and exclusive ZKX rewards.","Per an announcement, the key features of Pro Trade include:","ZKX noted that this is an early step in its road map. It also includes Airdrop 2, staking initiatives, the listing of the ZKX token, social trading and pools, and the ZKX Appchain Block scanner.","This latest announcement follows Starknet Foundation revealing its STRK token distribution plan last week.","ZKX Founder Eduard Jubany Tur commented that, “with the launch of Pro Trade, we’re advancing towards our vision of establishing ZKX as the go-to DeFi solution. It’s an exciting period where our growth parallels the expansion of the Starknet ecosystem. Our mutual objective is to attract and onboard more users into DeFi.”","What is Pro Trade? 🤔","Pro Trade is an advanced trading terminal tailored for risk-savvy traders who thrive on arbitrage, sub-second speed & APIs 💪","Targeted to whales, prop & seasoned traders!","Here's a guide to navigate the Exchange like a PRO👇https:\/\/t.co\/otzopij9uC","2\/20 pic.twitter.com\/S94VhawjAR","— ZKX (@zkxprotocol) February 19, 2024","",""],"entity":[{"type":"four months ago","content":"DATE"},{"type":"February 20, 2024","content":"DATE"},{"type":"Linea","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"today","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"55%","content":"PERCENT"},{"type":"ZKX Appchain Block","content":"ORGANIZATION"},{"type":"Vienna","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"January 29","content":"DATE"},{"type":"February 19, 2024","content":"DATE"},{"type":"Eduard Jubany Tur","content":"PERSON"},{"type":"September 2023","content":"DATE"},{"type":"19 million","content":"MONEY"},{"type":"Machine RWA","content":"ORGANIZATION"}],"hashtag":["MetaMask","Security","Tokenization"],"authors":["Sead Fadilpašić"]}