{"summary":"Cordial Systems Launches Cordial Treasury Naming Jump Crypto as a Client","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cordial-systems-launches-cordial-treasury-with-jump-crypto.htm","publishDate":"2024-03-15T04:00:56","id":20298,"type":null,"title":"Cordial Systems Launches Cordial Treasury Naming Jump Crypto as a Client","category":["Cryptonews Deals "],"content":["Cordial Systems, a blockchain infrastructure company which builds custody products, has launched Cordial Treasury with several clients including Jump Crypto, the digital-asset unit of Jump Trading.","In an announcement, Cordial Systems said, that Cordial Treasury is a self-hosted product that allows financial institutions to independently manage their digital asset operations in-house.","“Cordial Systems have been a critical partner as we have scaled our digital asset business,” said Alex Davies, the CTO of Jump Trading, in a press release.","“Being able to enforce precisely defined policies from our digital asset control framework via independently controlled software with large numbers both of internal users and external chains has allowed us to safely keep up with fast-moving business requirements and stay at the forefront of the industry,” said Davies.","Cordial Treasury gives its clients a bespoke private blockchain custody a method used to secure crypto assets. Its technology is self-administered by the customer’s team and designed to allow clients to run the service in their own data centre or private cloud.","Jump Trading said it is using Cordial Treasury as part of its “proprietary technology stack.” This technical term refers to software developed and owned by a company or organization which is not available for public use or modification. Having a proprietary tech stack can provide companies with a competitive advantage in maintaining control over their own technology infrastructure.","For many firms operating in the digital assets space being able to demonstrate controls to safeguard customer assets is crucial and a regulatory requirement.","“Cordial Treasury is an important part of our tooling that we rely on daily,” said Armani Ferrante, CEO of Backpack, in a statement.","“As a regulated institution under VARA, it is important that Backpack has demonstrable controls to safeguard our customer assets and evidence our proof of reserves. Cordial Treasury is an important part of our tooling that we rely on daily,” adds Ferrante."],"entity":[{"type":"Cordial Systems","content":"ORGANIZATION"},{"type":"VARA","content":"ORGANIZATION"},{"type":"Ferrante","content":"PERSON"},{"type":"Alex Davies","content":"PERSON"},{"type":"Davies","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Cordial Treasury","content":"ORGANIZATION"},{"type":"Armani Ferrante","content":"PERSON"}],"hashtag":["Cordial Systems","Crypto Custody","Jump Crypto"],"authors":["Tanzeel Akhtar"]}