{"summary":"Goldman Sachs Upgrades Coinbase to Neutral as Bitcoin Prices Rally","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/goldman-sachs-upgrades-coinbase-to-neutral-as-bitcoin-prices-rally.htm","publishDate":"2024-03-08T22:18:36","id":20291,"type":null,"title":"Goldman Sachs Upgrades Coinbase to Neutral as Bitcoin Prices Rally","category":["Blockchain News "],"content":["Wall Street Investment firm Goldman Sachs (GS) adjusted its bearish stance on Coinbase on March 7 by upgrading COIN’s stock position from sell to neutral. This shift in position followed the recent bitcoin price uptrend, which set a new all-time high of $69,225.37 on Wednesday.","Goldman Sachs responded to this price rally by increasing the price target for COIN stock from $170 to $282.","This adjustment reflects the firm’s acknowledgment of the market-neutral strategy amid the current cryptocurrency boom, where portfolio managers seek to profit from market movements regardless of direction.","The investment bank credited the crypto market uptrend for the recent skyrocketing performance of stocks.","“While we still see limited use cases of crypto at present, the ‘beta’ to the price action has significantly outweighed any alpha from not seeing an acceleration in retail adoption over time,” said Will Nance of Goldman Sachs.","While Coinbase’s positive performance is evident, a closer look into similar stocks of companies heavily invested in Bitcoin reveals a related trend.","Bitcoin-related companies like Marathon and Microstrategy, listed on NASDAQ, have also experienced a surge in their stock prices since Bitcoin began to gain momentum.","Of the companies that have benefited from Bitcoin’s price surge, Michael Saylor’s MicroStrategy is currently the most prominent.","Saylor’s bet on holding a sizable amount of Bitcoin was a “great” financial decision, with MicroStrategy currently being the 347th most valuable company in the U.S.","MicroStrategy is now the 347th largest public company in the US. #Bitcoin pic.twitter.com\/SpKe6N9p8s","— Bold Bitcoin (@BoldBitcoin) March 5, 2024","","Notably, MicroStrategy’s (MSTR) stock price has grown by 132.70% in the last month, while COIN has witnessed a 94.06% increase within the same period. Marathon(MARA), which currently trades at $23.45, saw the least growth in the past month, realizing a relatively meager 8.67% uptick.","The price charts for these stocks affirm the correlation between the stock trends and the Bitcoin boom.","Despite Goldman Sachs’s shift to a bullish stance and the positive indicators outlined in their report, Coinbase’s share price stayed relatively unchanged in premarket trading.","COIN’s stock has been experiencing a muted reaction, suggesting that the market might still be neutral to the company’s positive developments.","Some developments expected to have more than a neutral effect on COIN stock include the Bitcoin price surge.","Other effects, such as the increase in daily trading volumes driven by retail participation and Coinbase’s focus on profitability through increased revenue, market share maintenance, expense control, and the benefit of higher interest rates, can not be overlooked either.","Coinbase has been experiencing never-before-seen trading traffic on its platform since the start of the Bitcoin rally.","JUST IN: Coinbase says \"some users may experience increased latency\" and see intermittent balances of $0. pic.twitter.com\/opVGB03Dox","— Bitcoin Magazine (@BitcoinMagazine) March 4, 2024","","The Coinbase app has crashed twice within a week, an occurrence last witnessed in the 2021 bull run. A new case of crashing was also reported today after Bitcoin set a new all-time high of $70,000"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$69,225.37","content":"MONEY"},{"type":"March 4, 2024","content":"DATE"},{"type":"Goldman Sachs (GS)","content":"ORGANIZATION"},{"type":"$0","content":"MONEY"},{"type":"132.70%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"March 7","content":"DATE"},{"type":"$282","content":"MONEY"},{"type":"8.67%","content":"PERCENT"},{"type":"Michael Saylor","content":"PERSON"},{"type":"March 5, 2024","content":"DATE"},{"type":"$23.45","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"94.06%","content":"PERCENT"},{"type":"Will Nance","content":"PERSON"},{"type":"$170","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"Goldman Sachs’s","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Price","Coinbase","Goldman Sachs"],"authors":["Jimmy Aki"]}