{"summary":"The Sui Foundation says it did not sell SUI staking rewards on Binance, or elsewhere. \nAdditionally, the Sui Foundation said it’s on track for the SUI token unlock as it aims to double the supply by November.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236759\/sui-foundation-denies-selling-staking-rewards-on-binance","publishDate":"2023-06-27T14:35:40","id":203,"type":null,"title":"Sui Foundation denies selling staking rewards on Binance","category":["Crypto Ecosystems"],"content":["Sui Foundation, the organization building out the Sui crypto network, said Tuesday that it had not sold staking rewards on the Binance crypto exchange.&nbsp;","\"Sui Foundation has not sold staking rewards or any other tokens from locked and non-circulating staked SUI on Binance or otherwise,\" the organization wrote on <a href=\"https:\/\/twitter.com\/SuiFoundation\/status\/1673722226909274114?s=20\" data-v-f87c67ca=\"\">Twitter<\/a>. \"All insider token allocations remain subject to and compliant with their lock ups and other restrictions on transfer.\"&nbsp;","The foundation said that SUI token unlocks have \"proceeded as planned.\"","Sui aimed to release <a href=\"https:\/\/www.theblock.co\/post\/232511\/optimism-sui-set-for-large-token-unlocks-worth-a-combined-650-million\" data-v-f87c67ca=\"\">61 million tokens<\/a> worth $62 million on June 3 and double its token supply by November of this year, The Block previously reported. There is currently a circulating supply of over 604 million SUI tokens at a market capitalization of $435 million, with each single token worth around $0.72, according to Coinmarketcap.","The web3 infrastructure firm <a href=\"https:\/\/www.theblock.co\/linked\/138813\/web3-infrastructure-startup-mysten-labs-unveils-its-layer-1-blockchain\" data-v-f87c67ca=\"\">Mysten Labs<\/a> launched the Sui mainnet on <a href=\"https:\/\/www.theblock.co\/post\/229236\/mysten-labs-sui-mainnet\" data-v-f87c67ca=\"\">May 3<\/a>. Sui competes with other Layer 1's like Solana through increased block finality, and the blockchain can support up to 300,000 transactions per second with 100 testnet validators.","Mysten intended to sell the Layer 1's native asset on Binance, in addition to other exchanges like OKX, Bybit and Kucoin.&nbsp;The U.S. Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">sued<\/a> Binance on June 5 for alleged financial misconduct."],"hashtag":["SUI"]}