{"summary":"Blockchain development firm ConsenSys said public testing of the zkEVM rollup network will commence on Mar. 28.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216948\/consensys-announces-public-testing-of-zk-rollup-network-compatible-with-ethereum","publishDate":"2023-03-03T11:36:09","id":2030,"type":null,"title":"ConsenSys announces public testing of ZK-Rollup network compatible with Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain development firm ConsenSys will begin a public test of a zkEVM rollup network compatible with Ethereum on Mar. 28.","The zero-knowledge, or ZK-Rollup, network performs off-chain computations on a secondary layer for faster and cheaper transactions while prioritizing Ethereum's security; a private beta phase was successfully completed, having processed over 490,000 transactions from various decentralized apps, ConsenSys <a href=\"https:\/\/consensys.net\/blog\/research-development\/consensys-zkevm-is-ready-for-public-testnet\/\" data-v-f87c67ca=\"\">said<\/a>.","One of the key features of the zkEVM rollup is its functionality with Ethereum Virtual Machine, which enables easy migration of existing dApps to the Layer 2 network. Developers can onboard apps from Ethereum, and use them on the zkEVM network without making significant changes, the firm noted.","The zkEVM technology is considered the next major step in the development of Layer 2 solutions, but it has remained in the testing phase so far.","While they are considered more scalable than existing Layer 2 solutions like Arbitrum and Optimism, which have seen growth, zero-knowledge Layer 2 solutions currently lack Ethereum compatibility. To address this, teams including Polygon, Starknet, zkSync, Scroll and ConsenSys have fiercely competed over the past year to develop a functioning ZK-based Layer 2 that can support Ethereum apps.","While ConsenSys is one of the top contenders, it's going to remain in a testing phase for some time. On the other hand, Polygon is <a href=\"https:\/\/www.theblock.co\/post\/211517\/polygon-eyes-mainnet-beta-release-for-zkevm-layer-2-next-month?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">attempting<\/a> to take a lead by releasing their zkEVM on the Ethereum mainnet in beta phase on March 27, one day before the ConsenSys public testnet goes live.","There's also zkSync, which&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/212564\/zksync-opens-doors-to-ethereum-developers-while-network-remains-in-alpha\" data-v-f87c67ca=\"\">released<\/a> an alpha mainnet last month to onboard select apps. A final zkSync beta launch may also take place in the coming months, finally opening up the network for public use.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Mar. 28","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"March 27","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","OPTIMISM","POLYGON","ZKEVM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}