{"summary":"Billionaire Mike Novogratz Says These Cryptos Are Here to Stay Despite Current Bear Market – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/billionaire-mike-novogratz-says-these-cryptos-are-here-stay-despite-current-bear-market-heres-what-you-need-know.htm","publishDate":"2022-11-28T11:40:00","id":20303,"type":null,"title":"Billionaire Mike Novogratz Says These Cryptos Are Here to Stay Despite Current Bear Market – Here’s What You Need to Know","category":["Bitcoin News "],"content":["Mike Novogratz, the founder of the US-based crypto financial services firm Galaxy Digital Holdings, named two major cryptocurrencies among those that are here to stay despite the massive turbulence seen in the crypto market this year: Bitcoin (BTC) and Ethereum (ETH). ","The CEO shared his thoughts during an interview with CNBC on Wednesday, stating that, currently,","“We certainly have a crisis of confidence in this market, and we’re not out of the woods yet.”","It will take a few weeks, he argued, for people to “just get their balance back” following several major collapses in the space, including Terra, Three Arrows Capital, and FTX.","However, despite all this, Novogratz said,","“Bitcoin is not going away. There are 150 million people that have already decided to store some of their net worth in Bitcoin. […] In no world is bitcoin going away, and quite frankly, the blockchain, and Ethereum, and everything else.”","If anything, this is a buying opportunity in the long run, and prices may possibly go a bit lower, he suggested. Therefore, in his opinion, more people will come in to “inject capital.” ","Being asked about the situation surrounding the now-collapsed crypto exchange FTX, Novogratz said that it is all “about transparency and disclosure.” ","Centralized companies play a relevant part in the crypto ecosystem, he added, but they have to build trust with their clients through transparency and risk management. ","“This is always about building trust with your clients, and right now, we’re in a deficit of trust. People think that there is a black swan around every corner, that everyone else is a sociopath and saying one thing and doing something else.” ","The long-term goal, said Novogratz, remains the same – creating a completely trustless system, adding:","“This is not an indictment of crypto. It’s an indictment of FTX and other companies which were poorly run or fraudulently run.” ","He went on to opine that increasingly more people will be putting their funds in “safe and trusted” custodians, adding that “the big winners” here will be companies like Fidelity, which have a century-long trusted relationship with their clients. ","That said, Novogratz suggested that market recovery will be slow. The industry, he concluded, has failed to self-regulate, adding that,","“The money side of crypto, companies like ours that buy, and sell, and lend, and do derivatives are going to get regulated, and they should be. And then, the tech side of crypto, the on-chain stuff, why we all started crypto, that has its own series of regulatory challenges […].”","As reported, in October, Novogratz forecasted a bullish takeoff for BTC once the US Federal Reserve eases down on its aggressive rate hikes aimed at taming inflation. “When [the Fed Chair Jerome Powell] started beating inflation over the head with a sledgehammer, of course, bitcoin came back down as did lots of assets,” Novogratz remarked at the time.","Earlier this month, there were reports that Galaxy could let go of up to 20% of the workforce amid the market downturn, though there was no complete, official plan for a workforce reduction at that point. ","At 10:20 UTC on Monday morning, BTC was trading at $16,218, down 2% in a day and 0.5% in a week. At the same time, ETH was changing hands at $1,170, down 3.5% in 24 hours and up 2.2% in 7 days. ","____","Learn more: \n– Billionaire Mike Novogratz Believes Bitcoin Price Will Surge if Fed Makes This Decision\n– Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD 30,000 Barrier Soon\n\n– Bitcoin and Hard Assets Will Win as Inflation Rises, Novogratz Says and Sees BTC at USD 500K\n– Mike Novogratz: Bitcoin Remains A Strong Macro Asset"],"entity":[{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"Galaxy Digital Holdings","content":"ORGANIZATION"},{"type":"Novogratz","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$1,170","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Bitcoin Price Will Surge if Fed Makes This Decision\n– Galaxy Digital’s Novogratz Doubts Bitcoin Will Pass USD","content":"ORGANIZATION"},{"type":"3.5%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"2.2%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"US","content":"LOCATION"},{"type":"$16,218","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Blockchain","Ethereum","Forecast","FTX","Galaxy Digital","Market","Mike Novogratz"],"authors":["Sead Fadilpašić"]}