{"summary":"Digital Currency Group told shareholders that revenue rose 63% in the first quarter of 2023, compared to the previous period.\nChief Financial Officer Michael Kraines stepped down from his role in April, the letter to shareholders said.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229128\/digital-currency-group-revenue-up-from-fourth-quarter-lags-year-earlier-as-cfo-steps-down","publishDate":"2023-05-02T12:49:49","id":2030,"type":null,"title":"DCG&#x27;s first quarter revenue bounces from previous period, lags year earlier","category":["Companies"],"content":["Digital Currency Group rode the cryptocurrency rally over the first quarter to post revenue that topped the previous quarter, but still lagged the year-ago period.","The group's first quarter revenue totaled $180 million, up 63% from the fourth quarter. That's still down 46% from the first quarter of 2022, when bitcoin traded about $40,000.","“DCG’s financial performance this year so far is reflective of the market,” the letter said.&nbsp;","The firm also shared that DCG Chief Financial Officer Michael Kraines stepped down from his role in April. DCG President Mark Murphy and Chief Strategy Officer Simon Koster are co-leading the finance department while executive search company Heidrick &amp; Struggles look for a new financial officer.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/linked\/97684\/dcg-chief-financial-officer-hire\" data-v-f87c67ca=\"\"> Kraines had been CFO<\/a> since March 2021.<\/span>","<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">DCG did not immediately respond to a request for comment.&nbsp;<\/span>","The shareholder update comes after Genesis, a DCG subsidiary, filed for bankruptcy protection in January. Although Genesis and DCG had reached a deal with creditors, DCG said last week&nbsp;that a <a href=\"https:\/\/www.theblock.co\/post\/228128\/genesis-creditors-reject-restructuring-plan\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">said last week group of creditors had \"reneged\"<\/span><\/a>&nbsp;on the agreement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“DCG worked around the clock last winter to reach the original deal with Genesis and its creditors and will remain focused on implementing a fair and reasonable agreement for all parties. We will continue to update you as the process unfolds,” DCG said in the letter.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Also during the first quarter of 2023, DCG repaid a $350 million senior secured term loan that was issued by a lender syndicate led by Eldridge, a private equity investment firm.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Aside from the amounts owed to Genesis, DCG no longer has any third-party debt. This is a major milestone and we’re looking forward to shifting our focus towards the next stage of DCG’s growth,” the letter said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":[]}