{"summary":"‘Wrapped’ GameStop Token Appears as Cryptoverse Draws GME-Bitcoin Parallels","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/wrapped-gamestop-token-appears-as-cryptoverse-draws-gme-bit-9030.htm","publishDate":"2021-01-27T11:29:00","id":20315,"type":null,"title":"‘Wrapped’ GameStop Token Appears as Cryptoverse Draws GME-Bitcoin Parallels","category":["Bitcoin News "],"content":["In the midst of the GameStop (GME) stock explosion, the video game retailer just got “tokenized” and “wrapped”. Meanwhile, the Cryptoverse is hard at work drawing parallels between GME and Bitcoin (BTC).","Source: Adobe\/wolterke","The Cryptoverse woke up this morning to a new token – a decentralized finance (DeFi) developer has created Wrapped Gamestop, an ETH\/GME token, “and folks aped into it. Amazing,” wrote Microsoft Strategist Joe McCann.","Per Etherscan, total supply is 20m tokens, and it’s showing nearly 270 transactions by 8:30 UTC Wednesday morning. Uniswap decentralized exchange (DEX) shows the price of GME rising quickly, trading at USD 5.25 at the time of writing, as well as USD 552,500 in volume and USD 414,000 in liquidity.","A wrapped token is an ERC-20 token, meaning it exists on the Ethereum (ETH) blockchain, and it’s pegged to the value of another asset. However, people have been warning that this is not a wrapped token, as it’s not pegged to anything, but just a regular ERC-20 token, and potentially a scam.","Exactly","Many more people in the comments section to McCann’s post seem neither impressed nor happy about this twist, with, for example, Proof Systems and BarnBridge founder, Tyler Culler-Ward, stating that “This fuckery is how they’ll try to blame us,” and more commenters seeing a potential rug pull coming.","Meanwhile, popular crypto derivatives exchange FTX launched GameStop March 2021 Futures and a tokenized GME stock today.","GameStop is an American mall-based video game, consumer electronics, and gaming merchandise retailer, which is in the middle of closing nearly 2,000 shops, and which “most people have written off more or less for dead,” as Time wrote.","The worlds of both the crypto and the traditional markets noticed that this company’s stocks started rising on January 22, jumping soon afterwards – in total rising nearly 205% in five days, from USD 48.56 to USD 147.98. Moreover, it more than doubled in the pre-market trading session today, hitting USD 365.","GME price chart:","Source: Google","Per a CNBC article, “GameStop has more than 138% of its float shares sold short, the single most shorted name in the US stock market,” with Caitlin Long, the Founder and CEO of Avanti Financial Group and former Wall Street insider, tweeting that this is a matter of “a dishonest ledger system. It allowed more shares to be sold than actually existed.”","It’s the r\/wallstreetbets subreddit, with 2.7m users, that many have credited with raising the stocks’ price, as they’ve focused their efforts on buying them, apparently driven by their resentment towards Wall Street, money printing that helps it, and regulators that protect it. User ‘u\/consygiere’, for example, wrote that it’s no longer about GME, but that “retail does not want to be manipulated anymore”, that the group is “tired of Market Manipulators and corrupted media” and that “this is time to act.”","But this is also where many commenters drew parallels between GME and the world’s number one crypto, stressing the relevance and power of decentralization, and also calling out the hypocrisy they find long-present in the traditional markets: “”Market manipulation is only good when banksters do it!” Okay, boomer,” wrote ‘Hypron.’","“The activity in GameStop is more proof of concept that Bitcoin is going to work. How are you going to beat that decentralized crowd? That to me is more affirmation about decentralized finance,” SkyBridge Capital’s Anthony Scaramucci told Bloomberg.","River Financial Director Zev Mintz further argued that asset managers made the average person believe it was impossible to invest on their own for decades, but that the subreddit and Robinhood platform “changed the game overnight.” The Breakdown Podcast host Nathaniel Whittemore asked how can one not support what the subreddit members are doing, with some adding that this is in line with bitcoin philosophy. Others said they wished to see the same in crypto, stating “wait until they find out what they can all do to the bitcoin price,” and noting that this is a “refreshing grey swan event.”","Wait until they find crypto and realize that markets don't get halted in crypto.https:\/\/t.co\/fIY7UB3P9U"," ","“Think about what the GME saga means,” said Jimmy Song, a venture partner at Blockchain Capital and a Bitcoin developer\/educator. “There’s so much money being printed that a determined group can leverage and short squeeze without much resistance. Until there’s opportunity cost to lending, this is going to be par for the course.”","Furthermore, CoinShares‘ Meltem Demirors compared the massive jump in stocks of companies like GameStop and the giant Tesla, joking how the mainstream media calls bitcoin volatile. Tyler Winklevoss, Co-Founder and CEO of crypto exchange Gemini, said that he were the GameStop CEO, “the next move would be to purchase bitcoin and put it on the balance sheet.”","Additionally, some commenters pointed to the arrival of decentralization, as the subreddit’s moves are tanking a hedge fund. Per The Wall Street Journal, hedge fund Melvin Capital Management has been hit by a series of short bets, and among its short positions, Melvin bet against the surging GME stock.","BREAKING: Melvin Capital closes out of its GameStop position $GME@andrewrsorkin reports: pic.twitter.com\/5dx65M7zIP","Citadel and Point72 (formerly SAC) invested $3.75 billion in Melvin Capital. #WallStreetBets made a collective decision to pump #GameStop (wiping out the hedgefund)\n\nThis is the last time Wall Street ignores Twitter and Reddit. Decentralization is the wayhttps:\/\/t.co\/zzsfMG0l29","“We are witnessing the power of social media against traditional institutions,” tweeted trader Teddy Cleps. “A subreddit VS Wall Street. 2021 is already starting out to be a wild year.” Well-known Bitcoiner and developer Gigi said that Wall Street hedge funds are “literally being raided for everything they have by Main Street memers,” comparing it to “the Occupy Wall Street movement but on their own turf & with real financial consequences.”","Meanwhile, some, like ‘ParabolicTrav’ argued that medium-term, a cooperative like this subreddit is “an unstable equilibrium,” as the “members will break ranks for profit.”","____","How utterly savage.. https:\/\/t.co\/zmQ57H56qN","__","Right now…billion dollar hedge fund managers…all over the world…have redeployed their best and brightest quants and traders…to Reddit.","__","Gamestonk!! https:\/\/t.co\/RZtkDzAewJ","__","Crypto degen just looking for something to gamble on. https:\/\/t.co\/S4v7jYnzzg","__","WSB using an app named Robinhood to tank a hedge fund is poetic","__","Are markets now political too? https:\/\/t.co\/WPiI3vsl4x","__","This is both exciting and terrifying to think about tbh","__","There is precedent to when this happened to other subreddits before. They do move elsewhere but since it's inconvenient, you always lose a big part of the community. We shall see what happens here when a lot of money is on the line though","__","Somebody’s getting squeezed real hard this morning","__","bitcoiners two weeks ago:\nINSTITUTIONS WILL MAKE USE RICH!!!\n\nbitcoiners today:\nHEY GAMESTOP KIDS, LET’S DESTROY INSTITUTIONS WITH #BITCOIN!!!","___\nLearn more: \nBitcoin, Ethereum & Co Have Plenty of Room Left to Take Over TikTok\nDogecoin Soars As TikTokers Attempt To Pump It\nResearchers Found a Way to Catch Altcoin Pumpers and Dumpers Early\nCrypto Traders Smell Institutional-Grade Bitcoin Price Manipulation\nResearchers ‘Trap’ Frontrunning Bots Spying On Ethereum Transactions\n__\n(Updated at 11:50 UTC with announcements by FTX and CNBC)."],"entity":[{"type":"Zev Mintz","content":"PERSON"},{"type":"138%","content":"PERCENT"},{"type":"Catch Altcoin Pumpers","content":"ORGANIZATION"},{"type":"Gigi","content":"PERSON"},{"type":"American mall","content":"ORGANIZATION"},{"type":"GME","content":"ORGANIZATION"},{"type":"Dumpers Early\nCrypto Traders Smell Institutional","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Tyler Culler","content":"PERSON"},{"type":"Tesla","content":"LOCATION"},{"type":"Ward","content":"PERSON"},{"type":"Caitlin Long","content":"PERSON"},{"type":"January 22","content":"DATE"},{"type":"March 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Cryptoverse","content":"PERSON"},{"type":"GAMESTOP","content":"ORGANIZATION"},{"type":"Wrapped Gamestop","content":"ORGANIZATION"},{"type":"CNBC)","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"Reddit","content":"LOCATION"},{"type":"$GME@andrewrsorkin","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"GameStop (GME","content":"ORGANIZATION"},{"type":"Ethereum & Co Have Plenty of Room","content":"ORGANIZATION"},{"type":"205%","content":"PERCENT"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"Nathaniel Whittemore","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Grade Bitcoin Price Manipulation\nResearchers","content":"ORGANIZATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"McCann","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Melvin Capital","content":"ORGANIZATION"},{"type":"Joe McCann","content":"PERSON"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"Time","content":"ORGANIZATION"},{"type":"SkyBridge Capital","content":"ORGANIZATION"},{"type":"$3.75 billion","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Melvin Capital Management","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Melvin","content":"PERSON"},{"type":"8:30 UTC Wednesday morning","content":"TIME"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Jimmy Song","content":"PERSON"},{"type":"…billion dollar","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Avanti Financial Group","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Decentralization","Ethereum","Manipulation","Stocks","Trading"],"authors":["Sead Fadilpašić"]}