{"summary":"US Department of Justice Takes Action Against $2.3 Million ‘Pig Butchering’ Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-department-of-justice-takes-action-against-2-3-million-pig-butchering-scam.htm","publishDate":"2024-03-14T08:30:28","id":20316,"type":null,"title":"US Department of Justice Takes Action Against $2.3 Million ‘Pig Butchering’ Scam","category":["Blockchain News "],"content":["The U.S. Department of Justice has initiated a legal move to seize $2.3 million in cryptocurrency, funds that are traceable back to an elaborate “pig butchering” scam.","According to the official press release by the U.S. Attorney’s Office, District of Massachusetts, the authority filed a civil forfeiture action to recover the funds connected to an alleged “pig butchering” scheme “targeting a Massachusetts resident as part of a romance scam.”","The investigation into this scheme began in spring 2023, uncovering that the Massachusetts resident, among others, fell victim to this fraud. The victim was deceived into wiring over $400,000 into a crypto wallet.","This incident was part of a larger pattern of fraudulent activities that have ensnared 37 individuals across the United States, leading to the seizure of crypto from two Binance accounts in January 2024.","“Pig butchering” scams, as described, involve scammers building trust online before convincing victims to invest in fraudulent schemes, leading to significant financial and emotional damage.","“Specifically, the government seeks to forfeit 299,457.4 USD Coin (USDC), 1,455,305.997648 Tether (USDT), 102,278.515015 Tron (TRX), 3,032.1689461 Solana (SOL), 67.79400436 Binance Coin (BNB), 13,703.955431 Cardano (ADA) and 0.54151495 Ether (ETH) seized from two accounts,” the press release reads.","“Collectively, this cryptocurrency has a current estimated value of approximately $2,300,000,” concluded the DOJ.","The document posited that the seized crypto originated from wire fraud activities and was utilized in money laundering, making it eligible for forfeiture.","Civil forfeiture procedures enable third parties with potential claims to the disputed property to come forward. These claims must be adjudicated before the assets can officially be forfeited to the U.S. government and subsequently redistributed to the scam’s victims.","The Federal Bureau of Investigation (FBI) recently reported that investment losses related to cryptocurrencies rose from $2.57 billion in 2022 to approximately $3.94 billion in 2023, indicating a significant surge of 53%.","These losses represented the majority of investment fraud in the country, constituting approximately 86% of the total investment fraud losses, which reached $4.57 billion over the year."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"53%","content":"PERCENT"},{"type":"86%","content":"PERCENT"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Massachusetts","content":"LOCATION"},{"type":"U.S. Attorney’s Office","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$2.57 billion","content":"MONEY"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"$3.94 billion","content":"MONEY"},{"type":"$2.3 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$2,300,000","content":"MONEY"},{"type":"$4.57 billion","content":"MONEY"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"spring 2023","content":"DATE"}],"hashtag":["DOJ","FBI","Scam"],"authors":["Hongji Feng"]}