{"summary":"The report alleges that Jesse Powell has led politically charged discussions on Slack that have divided the company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152349\/kraken-ceo-is-fueling-a-corporate-culture-war-reports-the-new-york-times","publishDate":"2022-06-15T20:23:31","id":2032,"type":null,"title":"Kraken CEO is fueling a &#x27;corporate culture war,&#x27; reports the New York Times","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The work culture at crypto-exchange Kraken has turned toxic and CEO Jesse Powell is at the center of it, a new report from the New York Times claims.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to <a href=\"https:\/\/www.nytimes.com\/2022\/06\/15\/technology\/kraken-crypto-culture.html\" data-v-f87c67ca=\"\">the report<\/a>, Powell has allegedly led discussions on the company’s Slack channels where he objected to employees' use of preferred pronouns, debated who should be able to use certain racial slurs, and called American women “brainwashed.” <\/span>","<span data-v-f87c67ca=\"\">Kraken also released a 31-page culture document explaining Kraken’s “libertarian philosophical values,” which included tolerance for “diverse thinking” and affirmed the right of law-abiding citizens to arm themselves. The document was released alongside what Powell called the “Jet Ski Program,” which specified that anyone who disagreed with it was encouraged to leave the company and claim four months' pay.<\/span>","<span data-v-f87c67ca=\"\">Powell, a 41-year-old Bitcoin pioneer who founded Kraken in 2011 with Thanh Luu, is part of a shrinking cohort of crypto entrepreneurs who remain committed to the original vision of Bitcoin, a philosophy that challenges institutional forms of power. As mainstream interest in crypto has grown, these ideals have been challenged in the workplace.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kraken is one of a number of technology companies that have been embroiled in politically charged conflict during the coronavirus pandemic, as remote work, diversity, and inequality have become important issues to more employees.<\/span>","The firm currently employs more than 3000 workers and, according to <a href=\"https:\/\/www.theblockresearch.com\/may-by-the-numbers-2-149555?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">data compiled by The Block Research<\/a>, was the fourth-largest crypto exchange by trading volume in May.","According to the Times report, on Monday Christina Yee, a Kraken executive, wrote on Slack that “C.E.O., company, and culture are <i data-v-f87c67ca=\"\">not<\/i> going to change in a meaningful way.” She added:","<span data-v-f87c67ca=\"\">“If someone strongly dislikes or hates working here or thinks those here are hateful or have poor character,” she said, “work somewhere that doesn’t disgust you.” Employees have until Monday to decide whether to opt into the Jet Ski program.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Times","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Times","content":"ORGANIZATION"},{"type":"Monday Christina Yee","content":"PERSON"},{"type":"Thanh Luu","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["JESSE POWELL","KRAKEN"],"authors":["Sam Venis","The Block"]}