{"summary":"Andorra Taking Baby Steps Toward Crypto Adoption","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/andorra-taking-baby-steps-toward-crypto-adoption.htm","publishDate":"2022-07-19T20:00:00","id":20325,"type":null,"title":"Andorra Taking Baby Steps Toward Crypto Adoption","category":["Bitcoin News "],"content":[" ","The microstate of Andorra is looking to make crypto and central bank digital currency (CBDC)-related moves with a legislative proposal that could eventually see the country issue its own token – and despite an initial setback, could push to adopt crypto-friendly policies in the near future.","The population of the Principality of Andorra is just under 78,000, but it has its own parliament and is technically independent from both Spain and France, the nations it is sandwiched between. And the Andorran government has been keen to adopt a number of pro-crypto policies in recent months.","Last year, it made its first moves to regulate crypto operators that have a base in the country. And in April, per the news outlet Diari Andorra, the ruling Democrats for Andorra party put forward a proposal to “allow the state to create its own token.”","The draft law made mention of what its authors called “programmable digital sovereign money” that could “serve as a means of payment” and would be issued by the “central bank or a sovereign government authority.” It would also be “intended for use by the general public,” and could be used to make government bond issuances.","The proposal makes mention of “blockchain technology” and, perhaps more pertinently, also looks to grant private businesses permission to launch their own digital tokens – cryptoassets in all but name – under certain conditions.","The proposal was put out for public consultation. But last month, the same newspaper reported, its architects hit the pause button on the plan. Instead of accepting it completely, politicians instead decided to approve “tokenization” in “closed ecosystems,” such as “ski resorts.” As such, coins could not be publicly traded or listed on exchanges – and would have more in common with “Disney Dollars” than with bitcoin (BTC).","The revised bill, now the Digital Assets Law, dictates that cryptoassets “cannot be [used] as a legal tender in the Principality,” and appears to have been diluted heavily at the request of the Andorran Financial Authority (AFA), the top financial regulator.","The AFA claimed that it “required more resources to be able to carry out the necessary controls” on cryptoassets.","However, the proponents of the bill will be back for a second bite of the cherry. The terms of the act require the architects to return with a “new bill” before a period of 15 months is over.","And this new proposal will contain details on the prosed “issuance of digital assets that can be considered financial instruments.” This seemingly opens the door for a cryptoasset to attain legal tender status, El Salvador-style.","The media outlet remarked that this delay would provide “room for maneuver” for politicians who wanted to keep track of how European Union regulators police the crypto sector and “thus be able to follow in their footsteps.”","But some in the private sector would prefer not to wait – and have proposed ambitious-sounding plans to follow other more maverick nations’ leads.","A more recent proposal from the Andorra-based crypto firm 21 Million drew up the case for adopting BTC in the principality.","The firm remarked that adopting bitcoin could allow the Treasury to “open a lot of economic activities,” as it would “allow Andorran banks and businesses to transact outside” bank messaging networks like SWIFT. Instead, parties could “settle transactions on the Bitcoin blockchain, while allowing Andorran businesses and citizens to make daily transactions on the Lightning network.”","The firm explained that bitcoin would “provide additional resilience to legacy channels while preserving Andorra’s financial independence.”","The company’s CEO urged politicians to act fast, explaining:","“By attracting innovative entrepreneurs who want to enjoy a high-quality European lifestyle in a safe environment, the country could climb up some more ranks towards the most prosperous nations on earth, while remaining in control of its future, and that’s great!”","____","Learn more: \n– Crypto Community Unimpressed as ECB President Pushes for Digital Euro with Privacy ‘of the Highest Standard’\n– CBDCs ‘An Investment’ to Protect the Fiat System, Cash Will Disappear, Swedish Central Banker Says\n\n– El Salvadoran Government to Back New Token, Bukele Says ‘Don’t Panic’ About Falling Bitcoin Prices\n– Central Africa Rolls Out Sango Coin Amid Transparency, Credibility Worries\n\n– Spanish Crypto Holders to Be ‘Burdened’ with Fresh Crypto Declaration Rules\n– French Lawmaker Releases New Report to Push for Crypto Legislation"],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"France","content":"LOCATION"},{"type":"New Token","content":"LOCATION"},{"type":"Principality","content":"LOCATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Digital Euro","content":"ORGANIZATION"},{"type":"Disney Dollars","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"El Salvadoran Government","content":"ORGANIZATION"},{"type":"Crypto Community Unimpressed","content":"ORGANIZATION"},{"type":"Andorra","content":"LOCATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Diari Andorra","content":"LOCATION"},{"type":"Andorran Financial Authority (AFA","content":"ORGANIZATION"},{"type":"Crypto Legislation","content":"ORGANIZATION"},{"type":"Spain","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Fiat System","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"AFA","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","Blockchain","CBDC","Cryptocurrency","Lightning Network","Regulation"],"authors":["Tim Alper"]}