{"summary":"Ethereum Classic Rallies Again, Outperforms Ethereum YTD – But What Does History Show?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-classic-rallies-again-outperforms-ethereum-ytd-but-what-history-shows.htm","publishDate":"2022-07-19T13:25:00","id":20322,"type":null,"title":"Ethereum Classic Rallies Again, Outperforms Ethereum YTD – But What Does History Show?","category":["Altcoin News "],"content":[" ","Ethereum classic (ETC), the network created after a hard fork of the original Ethereum (ETH) blockchain in 2016, is again rallying in the market and has now outperformed ETH on a year-to-date basis. However, history shows that ETC rallies rarely last.","Although prices of both coins are down year-to-date, ETC has managed to outperform its larger sibling ETH. Since the beginning of the year until noon (UTC) on Tuesday, ETC is down by 28%, while ETH has fallen by 59%.","Furthermore, since reaching a local bottom of USD 13.34 a week ago, ETC has now rallied by close to 87% to a price of USD 25.2. By comparison, ETH has risen by almost 54% in the same time period, from USD 1,006 a week ago to USD 1,551 at the time of writing.","The strong ETC rally now comes after another short-lived pump from March and April this year, when ETC surged by over 90% in just over two weeks. That was followed by a dump of around 47% over the next 30 days.","Looking at the chart, it doesn’t take an expert to see that ETC is essentially behaving as ‘ETH on steroids’. The two coins’ price moves are generally in the same direction, but ETC often experiences stronger rallies followed by deeper corrections.","Year-to-date price for ETC\/USDT (blue line) and ETH\/USDT (red line):","Zooming out further, the same can also be seen in longer time frames.","As Cryptonews.com reported in March this year, major price rallies for ETC against ETH were seen in August and December 2016, September 2018, February 2020, and May 2021. After each spike, however, the market always reversed lower again, with ETC generally ending up at a lower level than before the price rally began.","ETC\/ETH price since 2017:","Still, it is worth noting that Ethereum Classic as a network does have its own set of fundamentals backing it with, for instance, the hashrate on the network growing significantly over the course of 2021. This year, however, the growth in hashrate appears to have stagnated, generally ranging between 22 and 28 Thash\/s.","In addition, a narrative about Ethereum miners potentially switching over to Ethereum Classic as Ethereum transitions to the proof-of-stake (PoS) consensus mechanism has gained traction, although such a shift is still not visible in the data.","Ethereum Classic hashrate (7-day simple moving average):","Among members of the Ethereum Classic community, however, hope remains that ETC will have its day once Ethereum’s ‘Merge’ arrives, with some even claiming that institutional investors “prefer ETC for the fundamentals”:","At 12:11 UTC, the 24th coin by market capitalization, ETC, traded at just over USD 25.1, up 12.3% for the day and 77% for the week. At the same time, the 2nd coin on the list, ETH, is trading at USD 1,548, up 5% in a day and 41% in a week.","____","Learn more: \n– Ethereum Classic Jumps 54% In a Week, But History Shows That the Rally May Not Last\n– ETC Upgrade\n\n– Ethereum Miners Can Transition to These Coins and Boost Their Values\n– Massive Liquidations Push Ethereum Higher as the Nearing Merge Boosts Sentiment\n\n– Ethereum’s Step Towards PoS\n– Vitalik Buterin Confirms Post-Merge Ethereum Centralization Concerns, Urges Not to ‘Overly Catastrophize’ It"],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"April this year","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"December 2016","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"12.3%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"47%","content":"PERCENT"},{"type":"February 2020","content":"DATE"},{"type":"59%","content":"PERCENT"},{"type":"August","content":"DATE"},{"type":"September 2018","content":"DATE"},{"type":"May 2021","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"87%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"77%","content":"PERCENT"},{"type":"41%","content":"PERCENT"},{"type":"28%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Rally May Not Last\n– ETC Upgrade\n\n– Ethereum Miners Can Transition to These Coins","content":"ORGANIZATION"},{"type":"ETC","content":"ORGANIZATION"},{"type":"Nearing Merge Boosts Sentiment\n\n– Ethereum’s Step Towards PoS\n– Vitalik Buterin Confirms Post-Merge Ethereum Centralization Concerns","content":"ORGANIZATION"},{"type":"March this year","content":"DATE"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["Ethereum","Ethereum Classic","Market","Proof-of-stake"],"authors":["Fredrik Vold"]}