{"summary":"FASB Approves New Accounting Standards for Crypto Holdings","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fasb-approves-new-accounting-standards-for-crypto-holdings.htm","publishDate":"2023-09-07T06:58:00","id":20320,"type":null,"title":"FASB Approves New Accounting Standards for Crypto Holdings","category":["Altcoin News "],"content":["The Financial Accounting Standards Board (FASB) in the United States has given unanimous approval to new accounting standards for disclosure of cryptocurrency holdings. ","The FASB, a non-governmental entity overseen by the U.S. Securities and Exchange Commission (SEC), introduced these rules in March, departing from the traditional practice of valuing cryptocurrency assets solely based on unrealized losses. ","The implementation of these rules is scheduled to commence for fiscal years starting after December 15, 2024, pending final approval through a written vote.","This change was viewed as a barrier to wider corporate adoption of cryptocurrencies.","Under the new standards, companies will be required to adopt a fair-value approach, assessing certain digital assets based on their market trading prices.","The new rules set by FASB will impact how companies report their financial performance, with gains and losses related to cryptocurrencies becoming a standard part of their quarterly income reports.","Richard Jones, Chairman of the FASB, expressed support for the move, noting that it is aimed at providing investors with better information for decision-making.","One notable aspect of this development is its potential to remove obstacles to the corporate adoption of cryptocurrencies as treasury assets. ","Michael Saylor, the founder and former CEO of MicroStrategy, commented on this aspect, stating that it eliminates a significant impediment to corporate adoption of Bitcoin.","While the change in accounting methodology will lead to increased earnings volatility for companies holding substantial amounts of cryptocurrency, it will also enable them to record financial recoveries as cryptocurrency prices rise. ","This rule change will particularly impact companies like Coinbase, investment firms, and major corporations such as MicroStrategy and Tesla, which hold significant cryptocurrency portfolios.","To accommodate these changes, cryptocurrencies will now be categorized as “intangible assets” in financial accounts, reflecting their evolving role in the financial landscape."],"entity":[{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Richard Jones","content":"PERSON"},{"type":"December 15, 2024","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Financial Accounting Standards Board (FASB","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"FASB","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Bitcoin","Crypto Regulation","Michael Saylor"],"authors":["Jai Pratap"]}