{"summary":"“Now is an opportunity to actually deploy capital if you really believe in the space,” GSR CEO Jakob Palmstierna told The Block.\nPalmstierna said he’s particularly excited to invest in zero-knowledge proofs, decentralized options trading, lending protocols and decentralized insurance.\nPalmstierna also expanded on the practical workings of the Binance-led industry recovery fund. ","author":["Andrew Rummer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191445\/gsr-opportunities-in-alameda-demise","publishDate":"2022-12-02T03:04:26","id":2033,"type":null,"title":"Crypto trading firm GSR sees opportunities in Alameda’s demise","category":["Finance firms"],"content":["Against the backdrop of November’s crypto market carnage, Jakob Palmstierna, CEO of trading firm GSR, cuts a surprisingly serene figure.","Dressed in a blue-and-white checkered shirt, a dark cardigan and tortoiseshell glasses, the softly spoken 41-year-old is eager to stress that GSR’s more conservative approach stands it in good stead now that high-flying rival Alameda Research — which, like GSR, also operated both trading and venture capital arms — has <a href=\"https:\/\/www.theblock.co\/post\/185332\/bankman-fried-apologizes-says-ftx-has-more-assets-than-client-deposits\" data-v-f87c67ca=\"\">crashed and burned<\/a>.","“Alameda was artificially pumping up a lot of crypto projects by utilizing customer funds to flood them with assets in billions of dollars,” Palmstierna said in an interview in London on Monday, referring to reports that the investment firm founded by Sam Bankman-Fried received funds from crypto exchange FTX, another of his companies. FTX didn’t respond to a request for comment.","Now that Alameda, which shut up shop in November as its sister firm FTX filed for bankruptcy protection, is out of the picture, Palmstierna said valuations for crypto venture capital deals are starting to fall.","“Now is an opportunity to actually deploy capital if you really believe in the space,” he said. “There is a lot of assets which are now looking at very good value. Which means that it might not be a VC, it might be a follow-on type investment.”","Founded in 2013 by former Goldman Sachs executives Rich Rosenblum and Cristian Gil, GSR is one of the oldest market makers in crypto. The firm offers services from over-the-counter trading to risk management and also has been very active in crypto VC this year, with 29 deals in the first quarter alone, <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-gsr-portfolio-145824\" data-v-f87c67ca=\"\">according to<\/a> The Block Research.","Donning his VC hat, Palmstierna listed a few areas where he’s particularly excited to invest at the moment: zero-knowledge proofs; decentralized options trading; lending protocols; and decentralized insurance, which he said has huge potential in underserved emerging markets in particular.","Still, despite these bright points and the recent removal of a large rival, Palmstierna acknowledged that the world of crypto investing faces a challenging time.","For one thing, rising interest rates make the returns on safe assets like U.S. Treasury bonds more enticing, leaving less investor cash to go around for alternative investments like crypto and venture capital.","“Capital is more expensive. LP capital is already harder to access,” Palmstierna lamented, referring to limited partners, the name given to those who invest in VC firms. “It's a much tougher environment for funds to raise.”","Even before FTX and Alameda blew up, the firm, which has about 300 employees across&nbsp;offices in London, New Jersey, Singapore, Malaga and Zug, had <a href=\"https:\/\/www.theblock.co\/post\/176342\/market-maker-gsr-lays-off-staff-following-rapid-expansion\" data-v-f87c67ca=\"\">announced plans<\/a> to cut headcount by 10% in October.","Despite these headwinds, GSR still felt able to contribute to a $1 billion crypto industry recovery fund <a href=\"https:\/\/www.theblock.co\/post\/186597\/binance-will-launch-a-new-industry-recovery-fund\" data-v-f87c67ca=\"\">spearheaded<\/a> by exchange giant Binance that will — in the words of Binance CEO Changpeng Zhao — “help projects who are otherwise strong, but in a liquidity crisis.”","Palmstierna expanded on the practical workings of the recovery fund, which Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/web3-leaders-join-binance-to-spearhead-web3-industry-recovery-initiative-5285759314040744618\" data-v-f87c67ca=\"\">insists<\/a> is “not an investment fund.”","Firms like GSR that pay into the fund aren’t handing Binance their assets, he said. Instead, the separate contributors&nbsp; — who also include Jump Crypto, Polygon Ventures and Aptos Labs — will make separate decisions on which struggling projects to support.","“There is coordination of what we look at and then people make their own individual decisions,” he said. “GSR might support something that Binance doesn't or it might support something that GSR doesn't — or we might both support something together.”","The pool of money, to which GSR has <a href=\"https:\/\/twitter.com\/GSR_io\/status\/1598269564584091650\" data-v-f87c67ca=\"\">contributed<\/a> an initial $5 million, is not an investment fund because it isn’t going to look for newly created projects to back, according to Palmstierna. Its main aim will instead be to “resurrect” technologies that have been “unfairly treated by the current downfall.”","That said, investors will expect to receive something in return for their cash, and the ways the capital is deployed are likely to “evolve over time.”","“You don't just give away the money. You probably get something for it.” he said.","Yet amid all the noise of a tumultuous 2022 — which has seen Terra’s algorithmic stablecoin collapse, the hedge fund Three Arrows Capital implode and now FTX leave more than a million creditors out of pocket — GSR’s CEO is plotting a steady course.&nbsp;","“The opportunity for someone like GSR is to continue operating like we are doing and being transparent and providing liquidity across exchanges — centralized, decentralized and for token issuers — because without it, the networks don't work,” Palmstierna said. “First, you stabilize the markets and then you continue to build on the franchise.”"],"hashtag":["INVESTMENT FIRMS"]}