{"summary":"S Korean Police Shut Down $472,000 Group Chat-based Crypto Fraudsters","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/s-korean-police-shut-down-472000-group-chat-based-crypto-fraudsters.htm","publishDate":"2022-11-01T09:30:00","id":20336,"type":null,"title":"S Korean Police Shut Down $472,000 Group Chat-based Crypto Fraudsters","category":["Bitcoin News "],"content":["South Korean police say they have arrested the ringleaders of a $472,000 crypto fraud gang that made use of the group chat function on a social media app to lure in unsuspecting victims.","MBN Money reported that the Incheon Metropolitan Police Agency explained that it had arrested three men in their 20s, including a 26-year-old man, on fraud-related charges. At least 10 other people are also being questioned in connection with the incident.","Officers say that the gang created a group chat room on a social media platform. They allegedly called the group the “Investment Reading Room” and managed to lure a number of unsuspecting crypto-curious social media users to join.","The police explained that the alleged masterminds sought to “deceive” members of the chat by enlisting “fake investors” to join the group. These individuals “pretended to be professional investment advisors” or people who had made massive gains by investing in crypto.","At least 10 people appear to have been duped by the ruse: They initially invested small amounts, which they saw yield high returns – with the masterminds providing payouts. But they were then convinced to part ways with much larger sums of cash, which they hoped to see mushroom into huge profits.","But this was the point where the money appeared to dry up – and the investors allegedly found themselves unable to withdraw their stakes.","The 26-year-old is thought to have been the operation’s kingpin, but the police believe that a number of other individuals “systematically committed” crimes to help the operation run smoothly.\n\nPolice described the alleged victims as ranging from “college students” with an interest in crypto to “beginner investors” and even “housewives.”\n\nA police spokesperson urged citizens to be cautious about crypto investment, and explained:","“There is a high likelihood that promises of investments that yield high returns will turn out to be fraudulent.”","In September, a crypto fraudster who tricked victims out of around $1.7 million worth of Bitcoin (BTC), Ethereum (ETH), and fiat was given a five-year jail sentence. And in nearby Japan last month, two men in their thirties explained that they were duped by chat app-based fraudsters who ran a fake crypto exchange."],"entity":[{"type":"$472,000","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1.7 million","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"Incheon Metropolitan Police Agency","content":"ORGANIZATION"}],"hashtag":["Fraud","Police","South Korea"],"authors":["Tim Alper"]}