{"summary":"Coal Giant Alliance Resource Has Been Mining Bitcoin Using Excess Electricity Since 2020","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coal-giant-alliance-resource-mining-bitcoin-using-excess-electricity-since-2020.htm","publishDate":"2024-04-30T11:00:59","id":20337,"type":null,"title":"Coal Giant Alliance Resource Has Been Mining Bitcoin Using Excess Electricity Since 2020","category":["Bitcoin News "],"content":["Alliance Resource Partners (ARLP), a prominent coal mining company listed on the NASDAQ, has mined $30 million worth of Bitcoin by utilizing excess power at its facilities. ","During an earnings call on Monday, Cary Marshall, the chief financial officer of ARLP, revealed that the company embarked on a pilot project in the latter half of 2020 to capitalize on the already paid-for electricity.","“In the second half of 2020, we started mining bitcoin as a pilot project to monetize the already paid-for yet underutilized electricity load at our River View mine.”","Marshall further disclosed that as of the end of the quarter, ARLP possessed 425 BTC on its balance sheet, which it values at $30 million. ","After factoring in the net costs of property, plant, and equipment, the company recorded an increase of $7.3 million. ","The positive news resulted in ARLP’s stock surging by 5% following the earnings call, during which the company also exceeded revenue estimates.","Nasdaq listed Alliance Resources $ARLP, a $2.8b coal mining company, is mining #bitcoin, and currently holds 425 $BTC on its balance sheet.","The company has additionally adopted the new FASB accounting standards for its holdings. pic.twitter.com\/uZomhnuBPz","— Dylan LeClair 🟠 (@DylanLeClair_) April 30, 2024","","It is important to note that ARLP does not engage in the purchase of Bitcoin or similar activities. ","Rather, it focuses solely on mining Bitcoin using its existing equipment. ","Marshall clarified that the company rents out its excess capacity to other bitcoin miners within its purpose-built data center, taking advantage of the low energy costs it enjoys.","In comparison to other entities, ARLP’s bitcoin holdings on its balance sheet are relatively modest. ","BitcoinTreasuries.net, which offers information about publicly traded companies and other large entities that hold BTC on their balance sheet., reveals that MicroStrategy leads the pack with holdings worth $13.5 billion. ","Tesla, known for its foray into the cryptocurrency world, holds approximately $615 million in Bitcoin.","Bitcoin experienced a week of minimal volatility, resulting in a gradual decline in price and closing the week at around $63,100. ","The downward trend in BTC’s price has persisted for four consecutive weeks, following a remarkable seven-month period of continuous growth.","The recent decline in BTC’s price can be attributed to investors taking profits, Matteo Greco, a research analyst at digital asset investment firm Fineqia International, said in a recent note. ","He said that many of these investors had entered the market during the downturns of 2022 and 2023, and they have now decided to capitalize on the significant price appreciation witnessed in recent months. ","Additionally, ETF investors who entered the market early in 2024 and saw substantial gains on their shares are also participating in profit-taking activities.","“Last week saw stagnant demand for BTC ETFs, continuing a short-term trend observed over the past five weeks, with neutral flow in these financial products,” Greco wrote. ","He added that the trading volume for BTC ETFs also decreased during the week. ","The cumulative trading volume since the inception of these funds reached $235.7 billion, with a total trading volume of $9.7 billion during the week and a daily volume of about $1.9 billion. ","This decline in trading activity is significant compared to previous weeks, with an average daily trading volume since inception of approximately $3.1 billion."],"entity":[{"type":"Fineqia International","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"$9.7 billion","content":"MONEY"},{"type":"Dylan LeClair","content":"PERSON"},{"type":"$63,100","content":"MONEY"},{"type":"Greco","content":"PERSON"},{"type":"$2.8","content":"MONEY"},{"type":"FASB","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"second half of 2020","content":"DATE"},{"type":"ARLP","content":"ORGANIZATION"},{"type":"$7.3 million","content":"MONEY"},{"type":"$1.9 billion","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"Cary Marshall","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"Matteo Greco","content":"PERSON"},{"type":"$615 million","content":"MONEY"},{"type":"Alliance Resources $ARLP","content":"ORGANIZATION"},{"type":"April 30, 2024","content":"DATE"},{"type":"$13.5 billion","content":"MONEY"},{"type":"Alliance Resource Partners (ARLP","content":"ORGANIZATION"},{"type":"the latter half of 2020","content":"DATE"},{"type":"$235.7 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Mining"],"authors":["Ruholamin Haqshanas"]}