{"summary":"Kraken’s Security Team Keeps a Low Profile on Social Media By Design","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kraken-security-team-social-media-presence-restricted.htm","publishDate":"2024-02-06T07:10:33","id":20330,"type":null,"title":"Kraken’s Security Team Keeps a Low Profile on Social Media By Design","category":["News "],"content":["Crypto exchange Kraken is prioritizing security and ensuring its security team maintains a low public profile.","Chief security officer Nick Percoco recently told Financial News that his 400-member team is encouraged to refrain from using social media. This strategy is aimed at mitigating potential security risks for the company.","Further, only a few team members are reportedly permitted to publicly acknowledge their association with Kraken. The remainder of the team is advised to maintain a lower profile as cybercriminals frequently target crypto exchange staff.","Percoco added that having security team members active on social media can expose the company to hacks. He also noted that hackers tend to target employees from TradFi backgrounds who change job titles on social media.","Confronting these risks, Kraken reportedly established a policy 5 years ago — if employees don’t need social media for work, they should not have profiles on these platforms.","Now, less than 5% of Kraken’s security team is publicly known — a crucial aspect of the exchange’s security approach.","Kraken didn’t return Cryptonews’ request for comment by press time.","Kraken’s move is not surprising as hacking continues to pose a major threat to crypto companies. Crypto exchanges, DeFi apps, and smart contracts are among the frequent focal points that hackers target. Related thefts exceeded $3.8b in 2022.","Hackers managed to pilfer about $1.7b from crypto platforms in 2023, although this was a 54.3% decline compared to the previous year.","Then in Jan. 2024, hackers and fraudsters managed to acquire $126m through 19 different incidents.","In today's #securityspotlight, we look at crypto security annual report 2023's graphic by @PeckShieldAlert: In summary there was over","600 hacks drained ~$2.61B, with $674.9M clawed back.\nHacks alone gulped $1.51B, scams snatched $1.1B. Down 27.78% from '22\nDeFi's still in the… pic.twitter.com\/mTkG8JqztV","— Extropy.io (@Extropy) February 5, 2024","","Hackers can weaponize social media to launch cyberattacks and phishing scams. This can compromise a company’s network and sensitive data can be stolen. Data can then be misused to breach compliance standards and reveal confidential information, putting employee safety at risk.","Kraken appears to be taking compliance measures seriously after a tough year for the crypto industry.","Last year, the exchange faced allegations of running without proper registration as a securities exchange, broker, dealer, and clearing agency.","Co-founder Jesse Powell has stressed the need for self-regulation in the industry, as timely protection can be unreliable. He suggested that companies like Coinbase, Ripple, and Kraken remain susceptible to SEC scrutiny and that governments can use questionable operations to tighten crypto regulations."],"entity":[{"type":"Jan. 2024","content":"DATE"},{"type":"$1.7","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$126m","content":"MONEY"},{"type":"$2.61","content":"MONEY"},{"type":"$1.51","content":"MONEY"},{"type":"February 5, 2024","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$3.8","content":"MONEY"},{"type":"27.78%","content":"PERCENT"},{"type":"Jesse Powell","content":"PERSON"},{"type":"54.3%","content":"PERCENT"},{"type":"Nick Percoco","content":"PERSON"},{"type":"Financial News","content":"ORGANIZATION"},{"type":"$674.9","content":"MONEY"}],"hashtag":["Hacks","Kraken","Security"],"authors":["Shalini Nagarajan"]}