{"summary":"South Korea Plans to Block Unlicensed Crypto Exchanges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korea-crypto-block-unlicensed-exchanges.htm","publishDate":"2024-02-12T09:24:10","id":20347,"type":null,"title":"South Korea Plans to Block Unlicensed Crypto Exchanges","category":["News "],"content":["South Korea plans to conduct virtual asset exchange inspections to expel ineligible platforms later this year.","Authorities are contemplating an advanced suspension system for suspicious transactions. This would rapidly prevent the concealment of illicit funds during all stages of the investigation process.","The Financial Intelligence Unit (FIU) released a “2024 Work Plan” on Monday, collecting opinions from experts through consultation with the Policy Advisory Committee, Yonhap News reported.","The department plans to prevent unauthorized virtual asset exchanges from accessing the Korean won market. It also aims to strengthen screening and anti-money laundering checks to remove ineligible exchanges already operating. To assist with this, the FIU intends to enlist the help of lawyers and accountants.","In the first half of 2024, an initial check will be conducted to assess money laundering risks and how well the market operates. A more detailed check will be conducted in the second half. Any virtual asset operators that don’t meet the standards will be kicked out.","The unit plans to expand the review to major shareholders. It will also broaden the law’s scope to disqualify those with a history of violations. Additionally, social credit criteria, such as debt default, will be considered.","It also suggests implementing a Financial Action Task Force (FATF) to quickly identify crimes and stop suspicious transactions during pre-prosecution investigations.","South Korea is home to major exchanges such as Upbit, BitHumb, CoinOne, Korbit, and Gopax. The country is said to host about 30% of global crypto trading, with about 4% of the population owning cryptocurrency.","Regulators have begun to target crypto firms over suspected fraud, embezzlement, and trust breaches. New rules to address these concerns are set to take effect July 19.","Moreover, a proposed crypto law last year suggested heavy fines and life sentences for those making over $4.2m from market manipulation.","Did you know: South Korea may punish crypto offenders with the possibility of life imprisonment?","Episode 22 on Sean’s Take on Asia 🌏 for latest news on #digitalasset and #policy updates.","Full 3 min episode here 👉🏻👉🏻 https:\/\/t.co\/55LmnKboOl pic.twitter.com\/wdlVZAPF7a","— Sean Lee (@CryptoSeanLee) February 11, 2024","","Recently, a ministry declared that high-ranking public officials must reveal their cryptocurrency holdings this year onward. The Coin Gate political scandal, involving a crypto-related parliamentary committee lawmaker accused of trading coins using insider information, prompted this announcement."],"entity":[{"type":"Upbit","content":"LOCATION"},{"type":"$4.2","content":"MONEY"},{"type":"Sean Lee","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"Korbit","content":"LOCATION"},{"type":"February 11, 2024","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Policy Advisory Committee","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Financial Intelligence Unit (FIU","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Yonhap News","content":"ORGANIZATION"},{"type":"FIU","content":"ORGANIZATION"},{"type":"Financial Action Task Force (FATF","content":"ORGANIZATION"},{"type":"July 19","content":"DATE"},{"type":"first half of 2024","content":"DATE"},{"type":"the second half","content":"DATE"},{"type":"Gopax","content":"ORGANIZATION"}],"hashtag":["Crypto exchanges","South Korea"],"authors":["Shalini Nagarajan"]}