{"summary":"UK Financial Regulator Adds Poloniex to Warning List Amid Recent $100 Million Hack: What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-financial-regulator-adds-poloniex-to-warning-list-amid-recent-100-million-hack-whats-going-on.htm","publishDate":"2023-12-07T14:14:17","id":20344,"type":null,"title":"UK Financial Regulator Adds Poloniex to Warning List Amid Recent $100 Million Hack: What’s Going On?","category":["Blockchain News "],"content":["The Financial Conduct Authority has added cryptocurrency exchange Poloniex to its warning list of firms that may not be fully authorized to render trading services in the country.","In an official publication on Dec 6, the financial regulator warned users from dealing with the company adding that the firm may be promoting financial services without proper regulations.","Firms and individuals cannot promote financial services in the UK without the necessary authorization or approval. This firm is not authorized by us and may be targeting people in the UK.","The Seychelles-based firm has been added to the list as part of a wider push by British regulators to protect investors following previous losses recorded in the global market.","Per the release, the body advises users on the potential risk of continued interaction with the firm adding that users will not have access to the Financial Ombudsman Service and the Financial Services Compensation Scheme (FSCS) meaning there would be no avenue to recover lost assets if things go south.","The publication advises users under its purview to only deal with authorized firms as they have greater protection under the law.","The FCA says it received over 291 applications from crypto firms seeking to become fully compliant in the jurisdiction but has only approved 38 before bound forward to announce in October that 140 crypto firms are included in its warning list.","As global authorities ramp up crypto regulations, the FCA has released new rules and guidelines for financial promotion in the crypto market requiring firms to disclose risk warnings.","In addition to risk warnings, digital asset adverts will introduce a cool-off period for first-time investors to avoid possible risks while bonuses for referrals will also remain prohibited.","These new policies have sparked uncertainty in the UK market as described by several analysts because they can limit and stifle user adoption in the market. On the other hand, pro-regulation circles have hailed the rules to provide more sanity in the system to prevent an infamous incident in the future that could result in wide losses.","The placing of Poloniex on the FCA’s warning list comes after several Justin Sun’s linked digital asset companies suffered hacks raising concerns among community members if both incidents may be linked.","On Nov 10, Poloniex suffered a massive $100 million hack leading to a suspension of trading activities and an internal investigation by the company. Sun revealed the exchange would reinstate all losses while seeking measures to recover assets from the bad actors including offering a $10 million white hat bounty.","The exchange gradually resumed deposits and withdrawal services before the HECO bridge was compromised with $86 million drained and HTX also losing assets due to a hot wallet breach in November.","💻 Heco Chain, HTX Hit by $100M Hack, Justin Sun Says Exchange Will Cover All Losses","A recent hack drained $100 million worth of crypto from Heco Chain and HTX exchange.#CryptoNews #newshttps:\/\/t.co\/qft4PZZRZ9","— Cryptonews.com (@cryptonews) November 22, 2023","",""],"entity":[{"type":"FCA","content":"ORGANIZATION"},{"type":"$86 million","content":"MONEY"},{"type":"Financial Services Compensation Scheme","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Financial Ombudsman Service","content":"ORGANIZATION"},{"type":"HTX","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"$100M","content":"MONEY"},{"type":"Justin","content":"PERSON"},{"type":"Heco Chain","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"November 22, 2023","content":"DATE"}],"hashtag":["Justin Sun","Regulation"],"authors":["David Pokima"]}