{"summary":"Chris Dixon’s New Book Explores All the Cool Stuff Blockchain Can Do","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chris-dixon-book-read-write-own-blockchain-a16z-crypto.htm","publishDate":"2024-01-30T10:05:04","id":20340,"type":null,"title":"Chris Dixon’s New Book Explores All the Cool Stuff Blockchain Can Do","category":["Blockchain News "],"content":["Chris Dixon, general partner at Andreessen Horowitz, releases his new book “Read Write Own: Building the Next Era of the Internet” on Jan. 30.","He wrote the book to show how blockchain offers an opportunity to create an open internet fostering creativity and progress.","Dixon, who joined a16z in 2013, believes blockchain should be relevant to entrepreneurs, developers, and innovators.","In a recent interview with CNBC’s Andrew Ross Sorkin, Dixon described blockchain as an “expansive technology.”","“It’s a new way to build Internet services,” he said. “Those services can be games, they can be social networks, they can be financial services.” He thinks the financial aspect, particularly, has been overly emphasized.","“One of the things I tried to do in my book is describe all of the different expansive use cases for the technology,” he added.","Dixon founded and leads a16z Crypto at Andreessen Horowitz. The VC fund has grown from $300m in 2018 to over $7b committed to investing in crypto and web3.","The fund has a portfolio of various investments including Coinbase, dYdX, Dapper Labs, Lightspark, and Mysten Labs.","He touched on the VC’s continued interest in the space due to ongoing innovation. Regarding the recent approval of spot Bitcoin ETFs in the US, he anticipates growing acceptance of these financial instruments.","“But I think that will take time,” he said. “Our focus is on investing in early-stage entrepreneurs.”","Book production began in Oct. 2022. He wanted to keep it casual, making sure that even non-specialists could easily understand it. He’s written it keeping “smart high school students” in mind, following advice he received.","Chris Dixon’s book is 230 pages long, with an additional 36 pages of endnotes.","I started working on Read Write Own in October 2022, and I’m excited that it’s finally coming out in a few weeks, on January 30.","I wrote Read Write Own because I felt we needed a book that explains the full potential of blockchains and tokens, and how these technologies can…","— cdixon.eth (@cdixon) January 3, 2024","","“Internet veterans will be familiar with the topics covered in some sections,” he said. “Crypto veterans will be familiar with others. General readers should read end to end to get the full narrative.”","Dixon also talked about how blockchain can serve as a crucial base for everything from social networks, marketplaces, AI products, and immersive virtual worlds.","He believes blockchain plays a significant role in countering advanced phishing and identity fraud attempts.","Additionally, Dixon emphasized a16z Crypto’s commitment to regulatory compliance. He pointed out that the firm chose not to invest in now-collapsed FTX due to red flags they had noticed.","“We are strong advocates for more guardrails around the technology,” he said."],"entity":[{"type":"January 30","content":"DATE"},{"type":"Lightspark","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"$300m","content":"MONEY"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"Jan. 30","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Chris Dixon","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"$7b","content":"MONEY"},{"type":"Dixon","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Oct. 2022","content":"DATE"},{"type":"Andrew Ross Sorkin","content":"PERSON"},{"type":"January 3, 2024","content":"DATE"}],"hashtag":["Blockchain","crypto 2024"],"authors":["Shalini Nagarajan"]}