{"summary":"Ask any large investor what&#x27;s keeping them out of the nascent market of cryptocurrencies, and the answer might not necessarily be its breakneck","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5345\/peter-thiel-backed-crypto-broker-tagomi-went-live-today-and-its-hoping-to-hold-wall-streets-hand-as-it-dips-its-toes-into-bitcoin","publishDate":"2018-12-17T17:26:01","id":2035,"type":null,"title":"Peter Thiel-backed crypto broker, Tagomi, went live today — and it&#x27;s hoping to hold Wall Street&#x27;s hand as it dips its toes into bitcoin","category":["INSTITUTIONAL INVESTORS"],"content":["Ask any large investor what's keeping them out of the nascent market of cryptocurrencies, and the answer might not necessarily be its breakneck volatility. But rather the fact that they don't know how to make a trade in the market.&nbsp;","<span data-v-f87c67ca=\"\">On Wall Street, large investors rely on brokers to help come up with the parameters of a trade and decide the best exchange venue and price at which to execute. In a sense, these&nbsp;broker-dealers sit between the investors making bet on the market and the markets itself. In&nbsp;crypto, there are very few firms in the broker&nbsp;business. Coinbase recently announced it has entered the business, saying it would act as an agency broker for large clients. And there are a slew of OTC desks conducting trades almost exclusively via phones and chat groups.<\/span>","Tagomi, <a href=\"https:\/\/www.wsj.com\/articles\/peter-thiel-backed-venture-to-help-big-investors-bet-on-bitcoin-1525176121\" data-v-f87c67ca=\"\">a startup backed by Peter Thiel's Founders Fund<\/a>, however, is vying to be that one-stop shop for investors looking for a middleman to help them navigate the fragmented crypto markets electronically. The platform went live today. The firm earlier this year closed a $16 million fundraising round from investors including Digital Currency Group and SV Angel. The startup counts market structure wonk Greg Tusar, formerly of KCG as head of client market making and execution services, and a prior partner at Goldman Sachs, as a co-founder. It is being led by CEO Jennifer Campbell, who previously was on the investment team at Union Square Ventures for two years.","\"The space is growing so fast and has so many different business models. For us, we saw a landscape that was made up of exchanges that offered&nbsp;up their own liquidity. Software&nbsp;vendors that sell you software but the end user is responsible for running their own exchange relations, and OTC dealers. None of these act effectively as the client's broker from the beginning to the end,\" Tusar said in an interview with <em data-v-f87c67ca=\"\">The Block<\/em>.&nbsp;","As part of the firm's offering, there is a consulting element. Let's say a big client shows up and wants to make a multi-million dollar crypto trade. Tagomi would show the client the best way to go about making that trade based on the best available data, aggregated from multiple exchange venues. Where that trade is executed and the timing at which it is executed could vary. It could happen across multiple exchanges or just one. It could happen over the course of a few hours or a few days. And in some cases trading algorithms could step in to help with the decision-making process. At the end of the day, the goal is to achieve best-execution as to limit slippage and market impact.&nbsp;","Best-execution is well-understood in established markets such as equities, but is just starting to develop in crypto. Both Coinbase and crypto wallet firm Blockchain are looking to develop their own standards for bestex, as it is referred to on the Street. And they've been recruiting their own Wall Street electronic trading titans. Jamie Selway <a href=\"https:\/\/www.reuters.com\/article\/us-blockchain-selway\/blockchain-hires-jamie-selway-to-ramp-up-institutional-business-idUSKBN1KM5LT\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">joined Blockchain<\/a> from ITG. and Jonathan Kellner <a href=\"https:\/\/www.reuters.com\/article\/us-coinbase-moves-jonathankellner\/instinets-ex-ceo-jonathan-kellner-joins-coinbase-idUSKCN1MC2KB\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">joined Coinbase<\/a> from Instinet.&nbsp;","As for Tagomi, the firm is paying extra attention to liquidity — the ease at which a trader can move in and out of a position — when it thinks about best-execution. For that reason, it is not as simple as making the trade on where bitcoin is trading at the lowest amount — or the price of bitcoin on popular data aggregators.&nbsp;","&nbsp;\"Best-execution is a little more nuanced. We have to look at best price and best liquidity. Getting access to all of this liquidity is difficult. And you have to explain to a client that while you saw this price available on CoinMarketCap for a coin, it might not be easy to get connected to a venue where you can get that price but with Tagomi, you can access multiple venues from a single account, and get much better price execution which represents the full market,\" Kevin Johnson, chief-operating officer, said in an interview. Johnson joined the firm from Citadel where he was deputy COO of its Aptigon unit.&nbsp;","The firm declined to say how many clients it has but says some have never traded crypto before.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Greg Tusar","content":"PERSON"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Instinet","content":"ORGANIZATION"},{"type":"Tagomi","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tagomi","content":"LOCATION"},{"type":"Union Square Ventures","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"Jonathan Kellner","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Jennifer Campbell","content":"PERSON"},{"type":"Jamie Selway","content":"PERSON"},{"type":"Kevin Johnson","content":"PERSON"},{"type":"Tusar","content":"PERSON"},{"type":"ITG","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"},{"type":"Citadel","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}