{"summary":"Binance Suspends Bitcoin Ordinals Trading – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-suspends-bitcoin-ordinals-trading.htm","publishDate":"2024-04-05T18:22:45","id":20356,"type":null,"title":"Binance Suspends Bitcoin Ordinals Trading – What’s Going On?","category":["Blockchain News "],"content":["Binance announced on April 4 that it will suspend Bitcoin Ordinals trades and deposits from April 18, 2024. The exchange has then advised the holders of the Bitcoin-based non-fungible tokens (NFTs) to withdraw their assets from the trading platform NFT marketplace before May 18, 2024.","Binance did not disclose the reason behind the suspension of Bitcoin Ordinals but added that it sought to “streamline product offerings” on its marketplace. Additionally, the Binance NFT marketplace will no longer offer airdrops, utilities, and benefits related to Bitcoin NFTs after April 10, 2024, according to the announcement.","Despite this setback from Binance, OKX plans to support four new inscription standards, as it believes Bitcoin Ordinals will play a pivotal role in 2024.","Bitcoin Ordinals, otherwise known as Bitcoin NFTs, allows users to embed digital content such as music, audio, text, video, images, or art onto the Bitcoin blockchain. Binance added support for the collectibles in 2023, promising further opportunities to collectors. The inclusion appears to be over in less than a year, however, leaving community members surprised about the turn of events.","The decision to end support for Bitcoin Ordinals comes at a time when interests and trading activities in the overall NFTs market, including Bitcoin-based NFTs, are at multi-year lows, according to data from non-fungible.com.","Statista data reveals a stark decline in NFT sales, which peaked at 117,000 in August 2021 but has plummeted to 2,400 across several blockchains, including Ethereum.","While Bitcoin Ordinals have been adversely affected by the drop in the global NFT market, many investors have raised concerns about its effect on the security of the Bitcoin network and the congestion it creates.","Luke Dashjr, a popular Bitcoin Core developer, disclosed on December 6, 2023, that Bitcoin NFTs had caused widespread network clogs, increased fees, and “exposed a vulnerability” in the network.","PSA: “Inscriptions” are exploiting a vulnerability in #Bitcoin Core to spam the blockchain. Bitcoin Core has, since 2013, allowed users to set a limit on the size of extra data in transactions they relay or mine (`-datacarriersize`). By obfuscating their data as program code,…","— Luke Dashjr (@LukeDashjr) December 6, 2023","","Since its inception, there has been a high volume of inscriptions, which has led to Bitcoin network congestion and high transaction fees, with users complaining of slow transaction processing.","Dune Analytics data revealed that the Bitcoin network has recorded over 64.17 million inscriptions and has generated over $430.7 million in transaction fees.","Meanwhile, the rise of Bitcoin Ordinals has fueled a debate over whether or not inscriptions representing NFTs and BRC-20 tokens on the Bitcoin network should exist. Recall that some Bitcoin developers collaborated to standardize BRC-20 tokens.","Some experts believe that the network and its token, BTC, were meant for pure peer-to-peer (P2P) financial transactions and may suffer from the same problems that have plagued the Ethereum chain for years, including scammy meme coins, NFT pictures of monkeys hogging the space, and ever-rising transaction fees.","Others argue that Bitcoin Ordinals have driven positive momentum and innovation within the network as a pathway toward decentralization, however."],"entity":[{"type":"Binance NFT","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Bitcoin Ordinals","content":"PERSON"},{"type":"April 4","content":"DATE"},{"type":"April 10, 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"December 6, 2023","content":"DATE"},{"type":"April 18, 2024","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"May 18, 2024","content":"DATE"},{"type":"$430.7 million","content":"MONEY"},{"type":"Bitcoin Ordinals","content":"ORGANIZATION"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Binance","Bitcoin ordinals","NFT"],"authors":["Jimmy Aki"]}