{"summary":"Billion-Dollar Crypto Fund Grayscale Refuses to Post Proof-of-Reserves – Next Firm to Collapse?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/billion-dollar-crypto-fund-grayscale-refuses-to-post-proof-of-reserves-next-firm-to-collapse.htm","publishDate":"2022-11-20T11:06:00","id":20366,"type":null,"title":"Billion-Dollar Crypto Fund Grayscale Refuses to Post Proof-of-Reserves – Next Firm to Collapse?","category":["Blockchain News "],"content":["Crypto investment firm Grayscale has refused to share its proof-of-reserves citing “security concerns.” The move has stirred up speculations about the financial health of the company. ","In a Saturday tweet, the company said major cryptocurrency exchange Coinbase, which is used by Grayscale as custodian, frequently performs “on-chain validation,” adding that they cannot share their proof of reserves due to security risks. ","“Due to security concerns, we do not make such on-chain wallet information and confirmation information publicly available through a cryptographic Proof-of-Reserve, or other advanced cryptographic accounting procedure,” the company said. ","6) Coinbase frequently performs on-chain validation. Due to security concerns, we do not make such on-chain wallet information and confirmation information publicly available through a cryptographic Proof-of-Reserve, or other advanced cryptographic accounting procedure.","In crypto, proof of reserves is a methodology that allows users to prove whether or not an independent auditor has the reserves of a specific exchange or business. It uses Merkle Trees to capture data and get a set of fingerprints that let users verify that their funds were properly audited by a third party.","Grayscale acknowledged that its decision to keep its reserve information private would be a “disappointment” to some investors. However, the company claimed that “panic sparked by others is not a good enough reason to circumvent complex security arrangements that have kept our investors’ assets safe for years.”","Nevertheless, the recent revelation has only exacerbated user confidence in Grayscale. It appears that the bulk majority of crypto users are not convinced by the company’s reasoning, particularly since other major crypto exchanges, including Binance and Crypto.com, have shared their proof of reserves. ","“I wasn’t concerned about GBTC solvency until reading this statement, please explain how proof of reserve is a security risk?” said ChainLinkGod.eth, a prominent member of the crypto community and a Chainlink Community Ambassador. ","I wasn’t concerned about GBTC until reading this statement. Given the amount of scrutiny and pressure they are under the best thing they could do was to show proof of reserves. Instead they come out with a statement pointing to “security concerns”. pic.twitter.com\/qGMn1lPP50","Prominent cryptographer Adam Back also claimed Grayscale’s statements don’t “make that much sense.” ","“Taint-tracing firms know the UTXOs, and it’s not hard to ask around for the export. Only vague thing you might argue is if Coinbase custody move them or have change it might reveal their IP address to geo- location on p2p. But use Tor,” he added. ","The unprecedented collapse of FTX, once the third largest cryptocurrency exchange that earned itself a reputation as crypto’s bail-out king during the recent crypto meltdown, led to many in the crypto industry voicing concern over the reliability of centralized players. ","In a bid to address this skepticism, crypto executives started to share proof of reserves. For one, Crypto.com published its crypto addresses, revealing how much and what cryptocurrencies it stores on behalf of its customers.","More recently OKX exchange released a PoR audit, in conjunction with Nansen."],"entity":[{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Adam Back","content":"PERSON"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Merkle Trees","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"Chainlink Community Ambassador","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","Grayscale","Grayscale Investments"],"authors":["Ruholamin Haqshanas"]}