{"summary":"Bitfinex Lands on UK Financial Watchdog’s Warning List for Unauthorized Promotion of Financial Services","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitfinex-lands-on-uk-financial-watchdogs-warning-list-for-unauthorized-promotion-of-financial-services.htm","publishDate":"2023-10-31T20:48:53","id":20377,"type":null,"title":"Bitfinex Lands on UK Financial Watchdog’s Warning List for Unauthorized Promotion of Financial Services","category":["Blockchain News "],"content":["The Financial Conduct Authority (FCA) in the UK has raised concerns about Bitfinex, a cryptocurrency exchange, that it may be promoting financial services or products without the FCA’s permission.","On October 27, the FCA in the UK issued a public warning regarding Bitfinex, expressing concerns that Bitfinex may be offering financial services or products without the necessary regulatory authorization. The FCA advises the public to exercise caution and avoid engaging with this platform.","The FCA has cautioned investors that dealing with Bitfinex may not offer the protections provided by the Financial Ombudsman Service or the Financial Services Compensation Scheme (FSCS). This means its users’ funds are at risk in the event of financial difficulties or insolvency faced by the company.","In response to these concerns, Bitfinex noted that it has taken measures to comply with UK law, which has led to changes in the availability of its products and services for UK customers.","Bitfinex said in a blog post on October 27:","“Bitfinex is aware that it has been placed on the UK Financial Conduct Authority’s (FCA) warning list of unauthorised firms.”","The trading platform continued and expressed disappointment with the FCA’s actions, claiming to have engaged in discussions and taken measures to meet the regulator’s requirements over the past four months.","“Bitfinex has held detailed discussions with the FCA and has proactively taken measures to attempt to meet the FCA’s requirements including issuing a notice to all its customers providing detail of all the measures it has taken to meet the FCA’s requirements. Bitfinex has also blocked  a range of website pages to visitors from the UK including the Bitfinex Affiliates pages, Staking pages, Credit \/ Debit Cards, Lending Pro, Bitfinex Borrow, various ‘How to buy’ pages and the Mobile App information page .”","The FCA’s concerns centered around a lack of transparency in marketing, particularly with respect to the risks associated with crypto investments and the positioning of risk warnings in promotions. The regulatory body also noted that risk warnings in promotions are often difficult to notice due to small fonts or non-prominent positioning, potentially misleading consumers.","Under the new UK crypto marketing rules that came into force in early October, cryptocurrency-related advertisements can only be promoted or approved by firms authorized or regulated by the Financial Conduct Authority (FCA). These rules apply to all businesses, including those that do not have a physical presence in the UK.","These cryptocurrency promotions must prominently feature risk warnings and should not incentivize or encourage investing in cryptocurrencies. Certain promotions commonly used in overseas markets, such as referral bonuses and memes, are banned or restricted in the UK to ensure consumer protection and regulatory compliance.","The FCA urged companies that approve financial promotions for crypto firms to adhere strictly to regulatory guidelines, and non-compliance could result in restrictions imposed on offending firms.","However, it is not only Bitfinex that has been banned by the FCA, as they have already imposed restrictions on some firms such as Winnex, BeSpoke, Equinox Finances, and many others. The FCA issued a warning that these firms, too, do not meet the required standards for approving crypto asset promotions. In another blog post, the FCA identified some recurring issues in the marketing of cryptoassets following the implementation of new regulations.","The FCA said that since the introduction of the new rules, it has issued more than 200 alerts against firms suspected of illegally promoting cryptoassets. Also, the FCA issued a warning list accompanied by a statement advising them to refrain from dealing with these firms. The list includes 143 new entities, notably major crypto exchanges like Huobi-owned HTX and KuCoin.","On October 10, in a statement, it noted that it placed restrictions on Rebuildingsociety, the firm that Binance partnered with, to approve its marketing and communications to comply with the FCA’s rules. As a result, Binance temporarily stopped onboarding new users from the United Kingdom.","The FCA allowed an extension until January 2024 for the implementation of technically challenging features like the cooling-off period. However, firms were expected to comply with the core rules starting on October 8."],"entity":[{"type":"October 27","content":"DATE"},{"type":"UK Financial Conduct Authority","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"Equinox Finances","content":"ORGANIZATION"},{"type":"Financial Services Compensation Scheme","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Financial Ombudsman Service","content":"ORGANIZATION"},{"type":"October 10","content":"DATE"},{"type":"October 8","content":"DATE"},{"type":"Credit \/ Debit Cards","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Bitfinex Borrow","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Winnex","content":"LOCATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["Bitfinex"],"authors":["Hassan Shittu"]}