{"summary":"NY Attorney General Proposes Bill To Rein In Cryptocurrency Industry","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ny-attorney-general-proposes-bill-rein-cryptocurrency-industry.htm","publishDate":"2023-05-05T15:50:00","id":20372,"type":null,"title":"NY Attorney General Proposes Bill To Rein In Cryptocurrency Industry","category":["Blockchain News "],"content":["New York Attorney General Letitia James proposed legislation that would require refunds of customers and audits of cryptocurrency exchanges in her latest move to rein in the industry. ","James’ program bill proposes the “strongest and most comprehensive set of regulations on cryptocurrency in the nation,” according to a statement released by her office on Friday. ","“Rampant fraud and dysfunction have become the hallmarks of cryptocurrency and it is time to bring law and order to the multi-billion-dollar industry,” James said in a statement. ","New York has robust regulations already, such as BitLicense —  business license permitting regulated virtual currency activities. ","Most recently, the state has cracked down on bad actors in the industry.\n ","James filed a lawsuit against crypto exchange KuCoin in March for allegedly failing to register with the state. ","Notably in that action, James names ether as a security, marking the first time a regulatory official in the US has referred to ether as being a security. ","James has also accused crypto lender Celsius’ former CEO Alex Mashinsky of misleading investors about the financial health of that company. Celsius filed for bankruptcy in July. ","The Crypto Regulation, Protection, Transparency and Oversight (CRPTO) Act will be submitted to the State Senate and Assembly to be considered during the 2023 legislative session, according to the attorney general’s office. ","The bill would stop conflicts of interest by preventing crypto brokers and marketplaces from trading their own accounts and by blocking brokers from borrowing or lending customer assets, according to the attorney general’s statement.","James also proposed requiring companies to undergo independent auditing and require them to publish audited financial statements. ","The bill also addresses stablecoins and separately requires platforms to reimburse customers who are affected by unauthorized asset transfers and transfers as a result of fraud.","“The lack of transparency plaguing the crypto industry causes immense harm to countless investors, especially low-income New Yorkers and people of color who carry a disproportionate share of the losses,” said New York City Comptroller Brad Lander, in a statement.","On the federal level, lawmakers are working on bills to regulate the industry, with some expected to be introduced in the coming months. "],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Letitia James","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"James","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"State Senate","content":"ORGANIZATION"},{"type":"Brad Lander","content":"PERSON"},{"type":"Crypto Regulation","content":"ORGANIZATION"}],"hashtag":["Exchanges","Regulation"],"authors":["Sarah Wynn"]}