{"summary":"Grayscale Investments has the rights to Ethereum Proof of Work tokens as a result of The Merge, and may or may not distribute them to holders in the form","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170749\/grayscale-files-for-rights-to-ethpow-tokens-after-the-merge","publishDate":"2022-09-16T10:55:31","id":2037,"type":null,"title":"Grayscale files for rights to ETHPoW tokens after The Merge","category":["THE MERGE"],"content":["Grayscale Investments has the rights to Ethereum Proof of Work tokens as a result of The Merge, and may or may not distribute them to holders in the form of a cash disbursal, the asset manager said in a Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1729997\/000095017022018573\/gdlc-ex99_1.htm\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">filing<\/span><\/a> on Friday.","ETHPoW, a fork of the proof of work Ethereum chain, <a href=\"https:\/\/www.theblock.co\/post\/170463\/ethpow-goes-live-after-ethereums-proof-of-stake-merge\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">went live<\/span><\/a> on Thursday when Ethereum shifted to proof of stake. As a result of the fork, the Grayscale Ethereum Trust and the Grayscale Digital Large Cap Fund received the rights to ETHPoW tokens. The former received the rights to approximately 4 million, while the latter holds rights to approximately 41,000 ETHPoW tokens.","However, it’s not clear how much those assets are worth.","“There is uncertainty as to whether digital asset custodians will support ETHPoW tokens or if trading markets with meaningful liquidity will develop,” the filing said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Trading venues for ETHPoW tokens are not broadly established because the Ethereum Proof of Work Network is so new, the filing noted. The price of ETHPoW tokens is expected to fluctuate.","“In the event digital asset custodians do support ETHPoW tokens and trading markets do develop, it is expected that there will be widely fluctuating values for ETHPoW tokens for some time,” the filing said. “As a result of this uncertainty and the potential for significant volatility in prices it is not possible to predict the value of rights to ETHPoW tokens, if any.”","The filing noted future forks or airdrops on the Ethereum Network will be evaluated on a case-by-case basis, and may not be addressed in the same manner as the ETHPoW fork.","Holders of each fund as of the end of business on Sept. 26 will be eligible for any proceeds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"Sept. 26","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum Proof of Work","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Ethereum Network","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Stephanie Murray","The Block"]}