{"summary":"Banks Will Invest in Blockchain When They Make Money from Bitcoin ETF + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/banks-will-invest-in-blockchain-when-they-make-money-from-bitcoin-etf-more-crypto-news.htm","publishDate":"2024-01-11T14:30:38","id":20374,"type":null,"title":"Banks Will Invest in Blockchain When They Make Money from Bitcoin ETF + More Crypto News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","The US Securities and Exchanges Commission (SEC) approving spot Bitcoin exchange-traded funds (ETFs) is a big deal – to say the least.","Per blockchain platform Swarm Markets’ co-founder Timo Lehes,","“The shift for digital assets into regulated realms, and the steps taken by major household-name institutional finance into the space is nothing short of a ‘big bang’ moment.”","Making these financial instruments legal signals to the market that institutions who look to fully comply can unlock new opportunities. This is particularly the case in the digital real-world asset (RWA) space. Here, the new technology is remaking opportunities underpinned by tangible assets, Lehes said in an email.","Chief Business Development and Communications Officer Katie Evans commented that blockchain is “a back office revolution and the approval of a bitcoin ETF is the gateway drug for major financial institutions adoption.”","Evans opined that,","“Until large financial institutions earn revenue from a space or asset class, they won’t invest in it, which is why making money from the Bitcoin ETF is the first step on that adoption curve for blockchain technology at large. The Bitcoin ETF is just the start.”","Blockchain’s killer use case is for the more efficient trading of traditional assets. Real-time settlement will change the risk profile of capital markets globally, she said.","If a bank or asset manager wants to trade a commodity, stock, or bond, they have to go to a designated venue. But “money goes where it’s most efficiently put to use.”","Tokenization brings all assets onto one trading infrastructure. This way, the market can benefit from cross margining across different asset classes and building real-time risk profiles.","Prometheum announced its plan to launch its digital asset securities custody platform in Q1 2024. Founded in 2017 by a group of Wall Street attorneys, it provides an end-to-end, blockchain-enabled ecosystem for the trading, clearance, settlement, and custody of digital asset securities.","Its subsidiary Prometheum Capital LLC recently received membership approval with the Financial Industry Regulatory Authority (FINRA). This has allowed it to operate as a Special Purpose Broker-Dealer (SPBD) to custody digital asset securities. Now, it has expanded its business to include clearing and settlement of digital asset security trades for its affiliate, Prometheum Ember ATS.","The press release states that this marks the final regulatory approval required for Prometheum to offer trading and custody of digital asset securities in 2024.","Prometheum Capital is the only SEC-qualified custodian and special-purpose broker-dealer for digital asset securities. It operates under US federal securities laws, it added.","Prometheum will begin offering custodial services to institutional clients for a range of digital asset securities. This will include asset management firms, hedge funds, RIAs, and financial institutions. What’s more, trading and clearing services will soon be available to retail and institutional clients.","Ecosapiens, a climate technology platform that creates carbon-offsetting digital collectibles using blockchain technology, has made crypto news headlines by launching its first series of carbon-capture digital art collectibles. The collection is created in collaboration with Polygon Labs, the growth and development team for the Polygon protocol.","Per the press release, the series, titled Polysapiens, is free to mint for all collectors, creators, and members of the Polygon community.","“The project represents a new way for corporations to leverage blockchain and NFT technology to implement impactful sustainability initiatives,” it said.","The Polysapiens collection includes unlimited 1-of-1 carbon-backed digital art collectibles underpinned by 1,000 tons of CO2 from Reseed and a number of blockchain-based carbon credit providers such as Andes.bio, Mangrove DAO, and Solid World mangrove restoration.","The collectibles are dedicated to investing in mangrove restoration, soil regeneration, and mineralization projects that permanently remove CO2 or avoid the creation of CO2 in the atmosphere.","The collectibles will account for Polygon Labs’ scope 3 emissions for 2023. The majority of the carbon credit providers are on-chain. This is a part of Polygon Labs’ selection strategy in an effort to support improvements to the Voluntary Carbon Market (VCM) through the use of blockchain and other frontier technologies, the announcement said.","Asset manager WisdomTree released monthly metrics for December 2023, including assets under management (AUM) and flow data by asset class in the latest crypto news.","Per the press release, it achieved milestone AUM of over $100 billion, and finished 2023 with over $10 billion of net inflows, posting a 13% pace of organic growth.","It further reported $765 million of net outflows in December. It was driven primarily by a risk-on re-allocation out of the US Floating Rate Treasury Fund and profit-taking in commodity products.","Additionally, the report included organic revenue growth in Q4 2023 notwithstanding net outflows of $254 million during the quarter. Specifically, as inflows into higher-fee products offset outflows from lower fee products.","WisdomTree Prime expanded its product lineup with the introduction of three digital asset allocation funds, it said."],"entity":[{"type":"Mangrove DAO","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Financial Industry Regulatory Authority (FINRA","content":"ORGANIZATION"},{"type":"Lehes","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"$765 million","content":"MONEY"},{"type":"WisdomTree Prime","content":"ORGANIZATION"},{"type":"US Floating Rate Treasury","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"US Securities and Exchanges Commission (SEC","content":"ORGANIZATION"},{"type":"Business Development and Communications","content":"ORGANIZATION"},{"type":"Timo Lehes","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"$100 billion","content":"MONEY"},{"type":"$254 million","content":"MONEY"},{"type":"Katie Evans","content":"PERSON"},{"type":"Voluntary Carbon Market (VCM","content":"ORGANIZATION"},{"type":"Prometheum Ember ATS","content":"ORGANIZATION"},{"type":"Prometheum Capital LLC","content":"ORGANIZATION"}],"hashtag":["Banking","ETF","Polygon"],"authors":["Sead Fadilpašić"]}