{"summary":"Is Sui About to Crash? SUI Price Drops 9% as Traders Pile into a New Bitcoin Protocol – What Does it Do?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-sui-about-to-crash-sui-price-drops-9-as-traders-pile-into-a-new-bitcoin-protocol-what-does-it-do.htm","publishDate":"2024-01-26T13:14:44","id":20371,"type":null,"title":"Is Sui About to Crash? SUI Price Drops 9% as Traders Pile into a New Bitcoin Protocol – What Does it Do?","category":["Industry Talk "],"content":["Sui Network has undertaken a dramatic -9% drop amid worsening performance, yet, could SUI price analysis reveal an upcoming push to the upside?","The downside movement after a bounce-off of the 20DMA on January 23 was fuelled by an announcement from Alibaba cloud that they were increasing support for the network.","$SUI","Thought price was gonna wick higher up, cut the lim order, would have been nice to get filled for a short scalp here tho into 1.12 area","On to the next one pic.twitter.com\/uSPSyHSPfA","— Eddie Trades (@eddiextrades) January 25, 2024","","But with double-top rejection forming a descendant trajectory amid lower highs, many traders are shifting towards a negative sentiment on the short-time frame.","In the midst of consolidation, Sui Network is currently trading at a market price of $1.25 (representing a 24-hour change of +6.21%).","Amid the lower high at $1.31, SUI price is now fighting to consolidate around the $1.16 price level.","If SUI bulls are able to mount a successful defence a this level, with immediate lower support from an ascendant 20DMA down at $1.12.","","The 20DMA has provided a foothold of support for much of SUI’s rally since November 2023, highlighting the importance of this key moving average.","Meanwhile, the 200DMA remains low, at a -9.88% divergence below the lower trendline, offering bedrock support at $0.62.","Shifting attention to Sui Network’s indicators, the RSI is emerging as a cause for concern, once again pushing up into an increasingly bearish overbought signal at 59.74.","With the recent downtick also failing to significantly cool the RSI to an oversold signal, this could indicate a need for a deeper retracement on the short-time frame.","While the MACD is also shifting bearish, with a current reading at -0.0076 suggesting dwindling momentum in the chart.","Overall, SUI price analysis reveals a worrying picture of a struggling consolidation (characterized by lower highs) and double-confirmation on bearish sentiment from key indicators.","","This leaves SUI price with a limited upside target at $1.31 on the short-time frame (a possible +5%).","While downside risk could see SUI price tumble to lower support at $1 (a potential -19.79%).","Therefore, SUI price analysis is left with a risk: reward ratio of 0.26 – a bad entry characterized by outsized downside risk.","Overall, with SUI price analysis revealing a poor trade on the short-time frame, traders are increasingly shifting their focus to a better play which emerges in the shape of the Bitcoin Minetrix presale.","","Dive into the innovative world of Bitcoin Minetrix and its pioneering stake-to-mine system – as the skyrocketing presale smashes +$9,486,555 raised – as Stage 21 draws to an end.","Offering an enticing 75% Staking APY, Bitcoin Minetrix provides a platform where users can buy, stake, and then watch as the rewards start accumulating.","The true essence of passive income in the crypto world has never been this accessible.","With the Bitcoin Minetrix approach, gone are the days of heavy initial capital and navigating complex mining contracts.","#BitcoinMinetrix has successfully raised more than $9,400,000! 🪙 pic.twitter.com\/4jFDiFu5wJ","— Bitcoinminetrix (@bitcoinminetrix) January 26, 2024","","Since the 2021 Bull Run, Bitcoin mining has defied expectations by undertaking something of a renaissance in network growth.","Bitcoin’s Hash Rate (a measure of the total amount of computational power directed at mining Bitcoin blocks) has surged to an incredible all-time high of 525 Exahashes per second (EH\/S).","","This dramatic growth has been fuelled by a substantial increase in the scale of Marathon Digital and Riot Platforms’ mining operations.","The world’s largest Bitcoin miner – Marathon – reported that for Q3 2023 it had an average hash rate of 14.2 EH\/s (a 500% growth YoY), around 4% of the overall network hash (mining around 1153 BTC per month, or, $42.2M USD).","Meanwhile Riot Platforms reported a new record hash rate of 10.9 EH\/s (mining around 368 BTC per month, or, $13.3M USD), with Riot’s operations expected to grow to 20.2 EH\/s by summer 2024.","But while the all-time high in Bitcoin network hash rate is healthy for Bitcoin network security, and clearly profitable for growing mining operations, it has also begun to lose sight of the original promise of Satoshi Nakamoto’s decentralization.","Bitcoin mining in 2023 is the most centralized it has ever been in its short 15-year history.","A closer look at the summary of mined blocks over the past 48-hours reveals that a shocking 55.79% of all Bitcoin block rewards go to just two Bitcoin mining pools.","AntPool took the largest share at 83 blocks mined (29.123%), while second largest mining pool Foundry USA mined 76 blocks (26.667%).","This dwarfs the number of blocks mined by even third-place F2Pool (34 blocks mined, around 11.93%), highlighting the growing challenge of increased mining centralization.","","This heightened network activity, and increased centralization of mining power has become clearly reflected in the consequent all-time high in the difficulty rate for mining Bitcoin.","Currently standing at 70,440,798,833,881 – it has never been harder for individual participants to engage in profitable Bitcoin mining.","","This challenge of heightened network difficulty, fuelled by increased competition and centralization of mining power, has created the need for new solutions for the retail investor to participate in Bitcoin mining – both for network decentralization and preserving Bitcoin as a profitable activity for the individual.","Enter Bitcoin Minetrix, which was launched to deliver secure and transparent Bitcoin mining rewards for the retail investor through an innovative, decentralized Bitcoin cloud mining approach.","","In sum, Bitcoin Minetrix is set to redefine the Bitcoin landscape. With its innovative methodologies, stringent security measures, and the vast potential of its stake-to-mine mechanism, it beckons as a lucrative opportunity for early-bird investors.","Secure your position in this transformative journey by joining the BTCMTX presale today.","Buy BTCMTX Here",""],"entity":[{"type":"M USD)","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$0.62","content":"MONEY"},{"type":"SUI","content":"ORGANIZATION"},{"type":"RSI","content":"ORGANIZATION"},{"type":"$1.25","content":"MONEY"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Bitcoin Minetrix presale","content":"ORGANIZATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"Sui Network","content":"ORGANIZATION"},{"type":"+5%","content":"PERCENT"},{"type":"-19.79%","content":"PERCENT"},{"type":"January 26, 2024","content":"DATE"},{"type":"-9%","content":"PERCENT"},{"type":"Bitcoin Minetrix","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$9,486,555","content":"MONEY"},{"type":"January 23","content":"DATE"},{"type":"$1.16","content":"MONEY"},{"type":"-9.88%","content":"PERCENT"},{"type":"29.123%","content":"PERCENT"},{"type":"$1.12","content":"MONEY"},{"type":"11.93%","content":"PERCENT"},{"type":"January 25, 2024","content":"DATE"},{"type":"Bitcoin Minetrix","content":"PERSON"},{"type":"summer 2024","content":"DATE"},{"type":"Bitcoin miner – Marathon –","content":"ORGANIZATION"},{"type":"Bull Run","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"500%","content":"PERCENT"},{"type":"$9,400,000","content":"MONEY"},{"type":"$SUI","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"$13.3","content":"MONEY"},{"type":"26.667%","content":"PERCENT"},{"type":"1153","content":"DATE"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"+6.21%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"55.79%","content":"PERCENT"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"$42.2","content":"MONEY"},{"type":"$1.31","content":"MONEY"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["SUI","SUI Price","Sui price analysis"],"authors":["Sam Cooling"]}