{"summary":"Republican Senators Pen Scathing Letter to Gensler for “Unethical” Handling of DEBT Box Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/republican-senators-pen-scathing-letter-to-gensler-for-unethical-handling-of-debt-box-case.htm","publishDate":"2024-02-09T16:48:47","id":20387,"type":null,"title":"Republican Senators Pen Scathing Letter to Gensler for “Unethical” Handling of DEBT Box Case","category":["Blockchain News "],"content":["A group of Republican senators criticized United States Securities and Exchange Commission (SEC) Chair Gary Gensler over the federal agency’s “unethical” handling of the DEBT Box case in a February 7 letter. Here’s everything you need to know.","Senators Cynthia Lummis (R-WY), Bill Haggerty (R-TN), Thom Tillis (R-NC), JD Vance (R-OH), and Katie Boyd Britt (R-AL) all signed the letter lambasting the SEC for its now botched case against DEBT Box, where the federal agency accused the software firm of defrauding investors of $49 million.","Last month, the SEC decided to dismiss the lawsuit without prejudice after it was discovered the federal agency had presented several representations against DEBT Box that were deemed false and misleading.","“We are greatly concerned by the Commission’s conduct in this case,” the senators wrote in the letter. “It is unconscionable that any federal agency—especially one regularly involved in highly consequential legal procedures and one that, under your leadership, has often pursued its regulatory mission through enforcement actions rather than rulemakings—could operate in such an unethical and unprofessional manner.”","In December 2023, SEC lawyers apologized for their conduct and stated that the federal agency would conduct “mandatory training” on the “duty of accuracy and candor” going forward.","I've just read over the documents in the Debt Box case and this is absolutely shocking behavior. The SEC went to a judge seeking an emergency order to paralyze several businesses and blatantly misrepresented facts to get it before anyone on the other side could defend themselves.","— David \"JoelKatz\" Schwartz (@JoelKatz) December 5, 2023","","“The Commission takes this Court’s concerns seriously and deeply regrets these errors,” a December 21st court filing read. “Agency officials are taking steps to ensure those errors are not repeated in this action or other proceedings.”","Republican senators expressed skepticism over the sufficiency of the SEC’s new mandatory training in their recently released letter, however.","“Perhaps such training in the most elementary aspects of legal conduct is necessary,” the senators stated. “However, we are skeptical that this response and the Commission’s pledge to reshuffle personnel is proportionate to the very serious allegations outlined by the Court.”","The SEC has found itself immersed in a number of controversial legal battles under Gensler’s direction and has faced criticism for its “ruling-by-enforcement” approach.","The DEBT Box case is just one of many civil lawsuits the federal agency has brought against crypto-related firms in recent times, with crypto exchange platforms Coinbase and Binance also facing heavy litigation.","“The public must have well-placed confidence in the Commission’s enforcement actions, its motives for undertaking them, and its professionalism when carrying them out,” the senators’ letter continued. “This trust is undermined, and your mission compromised, by episodes like the DEBT Box case.”"],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"Bill Haggerty","content":"PERSON"},{"type":"$49 million","content":"MONEY"},{"type":"December 5, 2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"David \"JoelKatz\" Schwartz","content":"PERSON"},{"type":"The Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"February 7","content":"DATE"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Katie Boyd Britt (","content":"PERSON"},{"type":"JD Vance","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Thom Tillis","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Binance","content":"PERSON"}],"hashtag":["Debt Box","Lawsuit","SEC"],"authors":["Julia Smith"]}