{"summary":"SBF’s Legal Team Responds to Proposed 50-Year Sentence, Says It “Is Not Justice”","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sbf-responds-to-proposed-50-year-sentence.htm","publishDate":"2024-03-20T08:35:06","id":20384,"type":null,"title":"SBF’s Legal Team Responds to Proposed 50-Year Sentence, Says It “Is Not Justice”","category":["Altcoin News "],"content":["Lawyers representing former FTX CEO Sam Bankman-Fried, aka SBF, have criticized the government’s proposal for a maximum sentence of 50 years in prison, saying it is “not justice.”","In response to the government’s sentencing recommendation filed on March 15, SBF’s attorneys, Marc Mukasey and Torrey Young, penned a letter to Judge Lewis Kaplan, branding the proposed sentence as a throwback to a “medieval” approach to punishment.","They added that the proposed sentence presents a distorted narrative that portrays their client as a malevolent supervillain.","“With marked hostility, the memorandum distorts reality to support its precious ‘loss’ narrative and casts Sam as a depraved super-villain.”","The government’s additional documents filed alongside a sentencing memorandum called for a 40-to-50-year prison term for Bankman-Fried, who was convicted of fraud and money laundering charges in November 2023. ","Dismissing the proposed sentence as an unjust punishment, the defense team argued for a reduced prison term of five to six years, emphasizing that the bankruptcy proceedings would ensure that all customers and lenders are fully compensated, leaving no actual losses.","Bankman-Fried’s lawyers also disputed the prosecution’s portrayal of their client as driven by greed and solely focused on personal wealth accumulation. ","They highlighted his philanthropic efforts and purportedly modest lifestyle, countering the government’s narrative. ","In addition, they challenged the government’s assertion that Bankman-Fried posed a high risk of re-offending, citing research indicating low recidivism rates among white-collar, educated offenders without prior records.","The defense team further criticized the prosecution for making unsubstantiated claims, including allegations that Bankman-Fried evaded responsibility and misinterpreted sentencing data related to comparable fraud cases. ","They pointed out the lack of precedent for a non-violent offender serving a 40-to-50-year sentence and stressed that such an excessively harsh punishment was unnecessary, considering the personal and professional losses Bankman-Fried had already endured.","Having experienced a jury trial that found him guilty on all seven charges brought by the U.S. government, Bankman-Fried’s defense team argued for a significantly reduced sentence of approximately five to six and a half years. ","They urged the court to consider a substantial downward variance from the suggested guidelines range of 63 to 78 months if the government genuinely believed in Bankman-Fried’s eventual return to liberty.","Earlier this week, the Department of Justice (DOJ) filed dozens of victim impact statements in the criminal case against Bankman-Fried ahead of his sentencing.","In the filings, victims of FTX’s collapse expressed their anguish, claiming that the event robbed them of financial security, inflicted emotional distress, and eroded their trust in the financial system. ","The impact statements were provided by FTX creditors from various parts of the world, outlining their FTX holdings and detailing the profound impact of the exchange’s bankruptcy on their lives. ","One victim lamented their precarious financial situation, revealing that as a restitution claimant, they had experienced a complete loss of income for over a year. ","“My circumstances are exacerbated by my current unemployment status and ongoing disability recognition process,” they added.","Numerous other respondents shared similar stories, disclosing that they were unemployed due to health issues and heavily relied on the funds they had stored in FTX. "," "],"entity":[{"type":"Marc Mukasey","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Torrey Young","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"March 15","content":"DATE"},{"type":"a half years","content":"DATE"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bankman","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["FTX","Sam Bankman-Fried","USA"],"authors":["Ruholamin Haqshanas"]}