{"summary":"El Salvador Passes Bitcoin Bill: Countdown to Legal Tender Status Begins","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/el-salvador-passes-the-bitcoin-law-10617.htm","publishDate":"2021-06-09T06:02:00","id":20386,"type":null,"title":"El Salvador Passes Bitcoin Bill: Countdown to Legal Tender Status Begins","category":["Bitcoin News "],"content":["Bitcoin (BTC) will officially become legal tender in El Salvador, the Central America country with a population of 6.5m people, in just 90 days time after the country’s President Nayib Bukele secured what he called a “supermajority” of 62 out of 84 votes in favor of a special bill in the Salvadorian Congress. (Updated at 09:14 UTC: updates throughout the entire text.)","Bukele appears keen to expedite the process, details of which were only made public this past weekend at a Miami-based Bitcoin conference. He has already published the bill in the Official Gazette, which means the countdown to promulgation has already begun.","The bill (the full text (in English) of which can be found below) contains clauses that many traditional economists will likely find surprising, including the provision that “prices may be expressed in bitcoin.” Citizens and residents will also be allowed to pay tax in BTC, while BTC transactions “will not be subject to capital gains tax.” However, for accounting purposes, the USD must be used as the official reference currency.","(Learn more: El Salvador Brings New Global Puzzle – What Is Bitcoin & How To Tax It?)","Bitcoin-related news stories dominated the country’s media, with multiple front-page stories in leading newspapers such as ElSalvador.com (which publishes the top-selling print paper El Diario de Hoy).","Despite Bukele’s zeal, it appears that not everyone in a position of power is quite ready for the BTC revolution yet.","ElSalvador.com quoted the head of the Central Reserve Bank, Douglas Rodríguez, as stating that bitcoin had displayed “quite high volatility,” although he added that the USD itself was not immune to the same phenomenon.","He said:","“BTC volatility does exist. There is quite high volatility, but that also happens even with the dollar. Even the best currencies experience volatility. [Prices] can go down or it can go up, they will not necessarily stagnate.”","At 09:22 UTC, BTC trades at USD 34,292 and is up by almost 4% in a day, trimming its weekly losses to 6.5%. It’s the best-performing cryptoasset today among the top 10 coins by market capitalization.","And the economist and former president of the Central Reserve Bank, Oscar Cabrera, was quoted elsewhere by the same outlet as stating that “wanting to adopt bitcoin as legal tender only generates uncertainty,” since it is was “not clear whether the measure “will be supported by the Central Bank.”","Cabrera added that the timing of the new law was also misjudged, as the country is currently “negotiating a program with the International Monetary Fund (IMF).”","He concluded:","“Cryptocurrencies have many risks and many of these are of a fraudulent nature. They are also very volatile and risky. And no financial regulator or prosecutor [fully understands] cryptocurrency.”","Another leading economist said that crypto showed no evidence of retaining its value over time and bemoaned the fact that it cannot be policed by financial regulators.","Meanwhile, opposition MPs expressed concern, with the former presidential candidate Rodrigo Ávila of the ARENA party claimed that the government should “listen to cyber experts,” as the new law specifies that any resident of the country who owns a computer or a telephone is obliged to accept bitcoin for any transaction.","Another opposition MP claimed that Congress should have been given more time to study the bill – especially considering the fact that accusations of money laundering-related issues have blighted crypto in the past – and the fact that no other country in the world has ever adopted a law of this sort.","But Bukele appears unconcerned with such matters – particularly as his Nuevas Ideas (New Ideas) Party recently won a landslide in congressional elections, making “supermajority” votes relatively easy.","A number of Nuevas Ideas MPs spoke up in favor of the bill, with one claiming that money laundering concerns were much more pressing with cash than with crypto.","Bukele, meanwhile, appears set on courting the global crypto community – and wants to encourage businesses to set up shop in the country. He joined a live session on Twitter today, that was attended by more than 20,000 participants, including politicians, bankers, diplomats, investors, and others, to field questions about his new bill and policies. Asked if he thought other countries would follow his lead, he answered:","“Probably it will create a domino effect. […] I know we’re doing the right thing. […] We’re going to see a lot of countries change because of [the bill] and it will likely be a better future.”","(Learn more: More Latin American MPs Push for Bitcoin Laws – Including a Gov’t Vice Minister)","The President’s plan involves creating a trust at the Banco de Desarrollo de El Salvador (Bandesal) to allow for the “automatic and instantaneous convertibility of bitcoin to USD necessary for the alternatives provided by the state.”","ElSalvador.com wrote that Bandesal would, in effect, become a state-sanctioned “exchange house” for BTC-USD transactions.","This trust will help the government, in the words of the bill, “provide alternatives that allow the user to carry out transactions in bitcoin and have automatic and instant convertibility from bitcoin to USD if they wish.”","The bill also commits the state to “promoting the necessary training and mechanisms so that the population can access bitcoin transactions.”","He told attendees at the live session that although the state does not yet hold BTC, it is hoping to build up a store of USD 150m worth of BTC soon. At this stage, they’re not considering adding BTC to the country’s reserves, but, per the President, things are “evolving very fast” now.","Perhaps the pick of his bullish remarks, however, was the President’s claim that he wanted “to get people used to thinking in bitcoin units and less about dollars.”","He added that citizens would be free to use wallets of their choosing, and would not seek to impose an official provider on the nation – although a government “option” (developed by Lightning Network-powered BTC payments company Strike) would be made available.","The President said:","“Financial inclusion is going to need some government investment, so we’re going to make that investment.”","And Bukele also discussed the possibility of the state entering the BTC mining industry, stating that he had “never thought of it,” but conceded that “we could do something to promote mining,” particularly as his government has plans to better use clean, geothermal energy sources.","Nic Carter, a partner at Castle Island Ventures who hosted the live session, drew a parallel to the ambitious but ultimately doomed Bretton Woods economic system, which collapsed in the early 1970s.","Elsewhere on Twitter, reaction has been plentiful and forthcoming, with prominent crypto investors and traders like @Iamnomad and @WhalePanda giving their takes on the developments.","The former noted:","“A nation-state accepting [BTC] as legal tender, having laws countrywide mandated to support adoption and provide infrastructure for it is a gigantic step forward.”","Meanwhile, the latter remarked (pertinently) that Bukele could soon have to defend his government’s position to a very different crowd.","____","THE LEGISLATIVE ASSEMBLY OF THE REPUBLIC OF EL SALVADOR","CONSIDERING:","THEREFORE, DECREES the following:","BITCOIN LAW","CHAPTER I\nGENERAL DISPOSITIONS","Art. 1. The purpose of this law is to regulate bitcoin as unrestricted legal tender with liberating power, unlimited in any transaction, and to any title that public or private natural or legal persons require carrying out.","What is mentioned in the previous paragraph does not hinder the application of the Monetary Integration law.","Art. 2. The exchange rate between bitcoin and the United States dollar, subsequently USD, will be freely established by the market.","Art. 3. Prices may be expressed in bitcoin.","Art. 4. Tax contributions can be paid in bitcoin.","Art. 5. Exchanges in bitcoin will not be subject to capital gains tax, just like any legal tender.","Art. 6. For accounting purposes, the USD will be used as the reference currency.","Art. 7. Every economic agent must accept bitcoin as payment when offered to him by whoever acquires a good or service.","Art. 8. Without prejudice to the actions of the private sector, the State shall provide alternatives that allow the user to carry out transactions in bitcoin and have automatic and instant convertibility from bitcoin to USD if they wish. Furthermore, the State will promote the necessary training and mechanisms so that the population can access bitcoin transactions.","Art. 9. The limitations and operations of the alternatives of automatic and instantaneous conversion from bitcoin to USD provided by the State will be specified in the Regulations issued for this purpose.","Art. 10. The Executive Branch will create the necessary institutional structure to apply this law.\nFINAL AND TRANSITIONAL PROVISIONS","Art. 11. The Central Reserve Bank and the Superintendency of the Financial System shall issue the corresponding regulations within the period mentioned in Article 16 of this law.","Art. 12. Those who, by evident and notorious fact, do not have access to the technologies that allow them to carry out transactions in bitcoin are excluded from the obligation expressed in Art. 7 of this law. The State will promote the necessary training and mechanisms so that the population can access bitcoin transactions.","Art. 13. All obligations in money expressed in USD, existing before the effective date of this law, may be paid in bitcoin.","Art. 14. Before the entry into force of this law, the State will guarantee, through the creation of a trust at the Banco de Desarrollo de El Salvador (BANDESAL), the automatic and instantaneous convertibility of bitcoin to USD necessary for the alternatives provided by the State mentioned in Art. 8.","Art. 15. This law will have a special character in its application concerning other laws that regulate the matter, repealing any provision that contradicts it.","Art. 16. This decree will take [effect] ninety days after its publication in the Official Gazette.\n_____","_____","Learn more:\n– Latin American MPs Widen Overton Window For Bitcoin\n– Bitcoin Is More ‘Public’ Money than Central Bank-Issued Fiat Currencies","– Prepare For ‘Uncertain Future of Money’ – US Intelligence Center\n– Bitcoin Faces Hedge Test Amid Rising Inflation Concerns","– Post-COVID-19, Bitcoin & Co May Help UK Escape from Economic Funk\n– A Debt-Fuelled Economic Crisis & Bitcoin: What to Expect?","– Not Only Bitcoin Price Is Changing During This Bull Run\n– Bitcoin Mass Adoption Would Benefit and Harm Current Economy"],"entity":[{"type":"State","content":"ORGANIZATION"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"Carter","content":"PERSON"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"Miami","content":"LOCATION"},{"type":"4%","content":"PERCENT"},{"type":"6.5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Banco de Desarrollo de El Salvador","content":"ORGANIZATION"},{"type":"Bukele","content":"PERSON"},{"type":"Rodrigo Ávila","content":"PERSON"},{"type":"1970s","content":"DATE"},{"type":"Central America","content":"LOCATION"},{"type":"Financial System","content":"ORGANIZATION"},{"type":"Twitter today","content":"DATE"},{"type":"Bitcoin & Co May Help UK Escape","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"‘Uncertain Future of Money’ – US Intelligence Center","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"Oscar Cabrera","content":"PERSON"},{"type":"Salvadorian Congress","content":"ORGANIZATION"},{"type":"Central Reserve Bank","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Fuelled Economic Crisis & Bitcoin","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Fiat Currencies","content":"ORGANIZATION"},{"type":"USD","content":"LOCATION"},{"type":"Douglas Rodríguez","content":"PERSON"},{"type":"Art. 7","content":"DATE"},{"type":"Official Gazette","content":"ORGANIZATION"},{"type":"Bitcoin Mass Adoption Would Benefit","content":"ORGANIZATION"},{"type":"Latin American MPs Widen Overton Window","content":"ORGANIZATION"},{"type":"El Diario de Hoy)","content":"ORGANIZATION"},{"type":"Monetary Integration","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","El Salvador","Regulation"],"authors":["Linas Kmieliauskas"]}