{"summary":"Stripe will be supporting payments in the USDC stablecoin on the Polygon blockchain, according to an announcement today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143018\/twitter-to-test-out-stripes-newly-added-support-for-usdc-payments","publishDate":"2022-04-22T09:24:29","id":2039,"type":null,"title":"Twitter to test out Stripe&#x27;s newly added support for USDC payments","category":["STARTUPS"],"content":["Financial services provider Stripe will support payments in the USDC stablecoin on the Polygon blockchain, according to an announcement today.","Such payments will be accessible through Stripe Connect — its system for integrating payments into online marketplaces — starting with Twitter as its first partner.","\"With crypto payouts, a select group of creators on Twitter — our first partner — will be able to use cryptocurrency-based rails to receive their earnings from Twitter,\" said Stripe in a <a href=\"https:\/\/stripe.com\/blog\/expanding-global-payouts-with-crypto\" data-v-f87c67ca=\"\">blog post<\/a>.","Twitter will let content creaters who use Twitter's products, such as Ticketed Spaces and Super Follows, to receive their earnings in the stablecoin.","Stripe claims that businesses and platforms using Stripe Connect will be able to pay out in USDC, without having to buy or hold the stablecoin itself.","\"<span id=\"m_7504646054249224929m_260830597567364824gmail-m_-4038855248239945455gmail-docs-internal-guid-13df40a1-7fff-5006-a56a-ea6b2355986a\" data-v-f87c67ca=\"\">With crypto payouts, platforms using Stripe can instantly send money to verified recipients nearly anywhere in the world,\" said Polygon co-founder Sandeep Nailwal.<\/span>","Stripe said that it plans to add support for additional \"rails\" and payout currencies over time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"}],"hashtag":["POLYGON","TWITTER","USDC"],"authors":["Tim Copeland","The Block"]}