{"summary":"Do Kwon’s Unreasonable Operations Led to Terraform Collapse: Co-founder Shin Denies Involvement","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/do-kwons-unreasonable-operations-led-to-terraform-collapse-co-founder-shin-denies-involvement.htm","publishDate":"2023-10-31T15:19:52","id":20393,"type":null,"title":"Do Kwon’s Unreasonable Operations Led to Terraform Collapse: Co-founder Shin Denies Involvement","category":["Blockchain News "],"content":["The co-founder of Terraform Labs Daniel Shin has denied involvement in the collapse of the Terra Network pointing fingers at former CEO Do Kwon.","Following his trial, reports have made rounds from local news media showing that Shin blames the bad policies of Do Kwon as he was not part of the company before the collapse.","Although Shin left the company three years ago, South Korean authorities charged him due to his affiliation with the network for breaching capital markets laws, allegations which he has denied insisting on his exit from the company.","#Terra Co-Founder Among Ten Formally Charged in South Korea Following Months-Long Investigation – $185 Million Worth of Assets Frozen 👮🏽🔗","Prosecutors have indicted #TerraformLabs co-founder Daniel Shin and nine others on several charges.#CryptoNews https:\/\/t.co\/5hr9yONIMp","— Cryptonews.com (@cryptonews) April 26, 2023","","Per the report, Shin Hyun-Seong represented by his lawyers at the Criminal Agreement Division 14 of the Seoul Southern District Court noted that the defendant parted ways with Do Kwon for business purposes as far back as 2022 two years before the infamous incident.","“The cause of the coin plunge was the unreasonable operation of the Anchor Protocol conducted by CEO Kwon and external attacks. It has nothing to do with Shin.” ","Several within the crypto community have also shared this sentiment that crypto crashes are hinged on poor executive decisions alongside tight regulations and wider market downturns.","Anchor Protocol was a lending platform on the Terra Network that allowed users to earn as high as 20% against their deposits and borrow against their holdings.","Anchor took a nosedive together with user assets contributing to the whole saga.","The prosecution alleged that Shin made profits worth billions of won by issuing tokens to investors while knowing of the subsequent fall of the platform.","Shin’s lawyer also stated that the authorities commenced prosecution based on the regulatory scrutiny adding that, according to them, the Terra project was impossible due to regulations.","He argued that there was no legislation prohibiting the development of virtual asset payment services in the country so no laws were violated.","After a year-long manhunt, Do Kwon is jailed in Montenegro for falsifying documents and faces potential extradition to the United States or South Korea at the end of the sentence.","In another development, Do Kwon maintains his innocence in a suit filed by the US Securities and Exchange Commission (SEC) alleging that Terra-linked assets are securities.","⚖️📃 Do Kwon and Terraform Labs Submit Motion for Case Dismissal against U.S. SEC#Terraform Labs and co-founder Do Kwon have filed a motion against the U.S. SEC, seeking to dismiss allegations of multi-billion-dollar securities fraud. #CryptoNews #newshttps:\/\/t.co\/puE0iiRAVS","— Cryptonews.com (@cryptonews) October 31, 2023","","Legal representatives of the former CEO claim that the SEC has no evidence to back any charges and have asked the court to toss the whole suit.","“After two years of investigation, the completion of a discovery period that resulted in the taking of more than 20 depositions, and the exchange of over two million pages of documents and data, the SEC is evidentiarily no closer to proving that the Defendants did anything wrong.” ",""],"entity":[{"type":"$185 Million","content":"MONEY"},{"type":"U.S. SEC","content":"ORGANIZATION"},{"type":"October 31, 2023","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"Shin","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Terra Network","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"April 26, 2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Shin Hyun","content":"PERSON"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Montenegro","content":"LOCATION"},{"type":"Criminal Agreement Division 14 of the Seoul Southern District Court","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"Daniel Shin","content":"PERSON"},{"type":"United States","content":"LOCATION"}],"hashtag":["Do Kwon","Luna"],"authors":["David Pokima"]}