{"summary":"UK financial regulators have reportedly found flaws in the auditing process of Revolut, a neobank that offers crypto investment services. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167774\/uk-regulators-find-flaws-in-revolut-audit","publishDate":"2022-09-05T06:26:42","id":204,"type":null,"title":"UK regulators find flaws in audit of crypto-friendly neobank Revolut: FT","category":["FINTECH"],"content":["UK financial regulators have found flaws in the auditing process of Revolut, a neobank that offers crypto investment services, according to the Financial Times.","A Financial Reporting Council report in July said an audit by accountancy firm BDO of an unidentified \"financial services provider\" was \"inadequate\" and ran a \"risk of an undetected material misstatement.\" This unnamed company is Revolut, according to people familiar with the matter that the <a href=\"https:\/\/www.ft.com\/content\/6e7bca1a-f43a-45f1-a684-1f6cf1415e2c\" data-v-f87c67ca=\"\">Financial Times<\/a> spoke to.&nbsp;","Revolut declined to comment when contacted by The Block. BDO didn't immediately respond to a request for comment.","Europe's second most valuable private fintech company is now under pressure to improve its internal controls — the systems that ensure its financial reporting is reliable — so that it complies with legal and regulatory requirements, according to the FT.&nbsp;","A person that the FT spoke to also warned that a more rigorous approach by BDO could result in delays in filing its accounts, the majority of which are due at the end of the month. The company is currently late on filing accounts for <a href=\"https:\/\/find-and-update.company-information.service.gov.uk\/company\/12871051\" data-v-f87c67ca=\"\">Revolut Newco UK Ltd.<\/a>, the entity intended to house its delayed UK banking license.&nbsp;","Failing to file an account on time could lead to the prosecution of company directors, in this case, Revolut founder and CEO Nikolay Storonsky, said the report.&nbsp;","A person familiar with the situation told the FT that the neobank must improve “unsexy things like its back office and controls” because it \"needs to have a back office like a bank and it’s got the culture of a tech firm.\"&nbsp;","The news comes as the company has been hit by <a href=\"https:\/\/www.cityam.com\/exclusive-revoluts-uk-risk-and-compliance-chiefs-quit-in-slew-of-senior-resignations\/\" data-v-f87c67ca=\"\">resignations<\/a> in its risk and compliance departments — including its UK heads of risk, compliance and money laundering — and after Storonsky complained in an interview with City AM about the time that regulators are taking to consider its banking license application.&nbsp;","Revolut is also yet to receive a permanent license to offer cryptocurrency services in the UK. Most recently, however, it received authorization from the Cyprus Securities and Exchange Commission to provide cryptocurrency services and launch several new tokens.&nbsp;","In a May interview with The Block, Storonsky <a href=\"https:\/\/www.theblock.co\/post\/147768\/revoluts-planned-native-token-will-reward-customer-loyalty-storonosky-says\" data-v-f87c67ca=\"\">confirmed<\/a> to The Block that it is aiming to launch its own native token along with a non-custodial wallet.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Revolut Newco UK Ltd.","content":"ORGANIZATION"},{"type":"Financial Reporting Council","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"FT","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Cyprus Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"BDO","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"City AM","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Storonsky","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Nikolay Storonsky","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}