{"summary":"Terra Luna Classic Price Prediction – Can LUNC Hit $3 in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-price-prediction-can-lunc-hit-2023.htm","publishDate":"2023-01-28T13:15:00","id":20408,"type":null,"title":"Terra Luna Classic Price Prediction – Can LUNC Hit $3 in 2023?","category":["Altcoin News "],"content":["LUNC, a token worth roughly over $1 billion on the Terra Classic protocol, is edging closer to a 17.54% move that could propel it to $0.00021. Meanwhile, the 50th largest cryptocurrency’s value increased by 6.5% in 24 hours and is trading at $0.0001775 at the time of writing.","Investors are preparing for the expected outcome by taking up new positions in LUNC, according to data from CoinMarketCap, showing a 48% spike in the 24-hour trading volume to $100 million.","A persistent spike in trading volume reveals that investors are enthusiastic about the asset, or the token is aggressively bullish. The high volumes imply demand for LUNC is rising and might validate a sustainable uptrend.","Terra Luna Classic Price is dancing at the apex of a symmetrical triangle pattern while getting ready to fly above its immediate resistance, as observed at $0.00018 in confluence with the 200-day Exponential Moving Average (EMA) (in purple).","Market participants trading the symmetrical triangle for the first time may need to understand that this pattern is formed as the price moves into a tighter and tighter range, culminating in a fierce battle between bulls and bears.","From the four-hour time frame chart below, we see Terra Luna Classic price consolidating within the confines of two trend lines: One connecting the higher lows and the other linking its lower highs.","Terra Luna Classic price is now on the verge of a breakout as long as bulls win the battle and push above the triangle’s resistance, reinforced with the 200-day EMA. Traders can place orders slightly above the slope of the lower highs’ trendline. Following the expected breakout, investors would be looking forward to cashing out at $0.00021.","Insight from the Moving Average Convergence Divergence (MACD) indicator can corroborate the bullish narrative in LUNC price. Notice a buy signal sustained since the beginning of January as the MACD line in blue flipped above the signal line in red.","Importantly, the momentum indicator can be seen making its way into the positive region above the mean line (0.00). Furthermore, the bullish histograms observed in the chart above may validate a bullish outcome. Some analysts believe that Terra Luna Classic price is about to trigger a major move to the upside, with the short-term target at $0.0001758.","Terra Luna Classic community has also been very aggressive in championing a bullish LUNC. For instance, TargetNodes on Twitter thanked other users for “holding on the support line & pushing it back up.” The trader added that the biggest task now is pushing “it to the horizontal resistance line which is $0.00019.”","The Terra Luna Classic community has recently been pushing for a listing on BinanceUS, the subsidiary of Binance.com, the largest cryptocurrency exchange by daily trading volume. Such a listing would expose LUNC to a wider audience in the United States and could be a catalyst for Terra Luna Classic price rally.","As Terra Luna Classic price recovers, it is bound to attract attention from investors mulling over tokens considered cheap to buy. For now, a move above $0.00018 is required to keep user interest intact. However, a break above $0.0002 and subsequently the triangle target at $0.00021 could boost LUNC price to ‘eat’ another zero and start another recovery phase above $0.001.","Whether LUNC price will hit $3 in 2023 depends on how the crypto market generally behaves throughout the year. The Terra Luna Classic token burn program will contribute immensely to its ability to sustain a long-term price rally. ","At the same time, getting listed on BinanceUS would give LUNC price a big boost – think of it as the fast mover’s advantange. Nevertheless, as analyzed, investors may take advantage of short-term recovery stints like the anticipated move to $0.00021 to bag gains along the way. ","Buy Terra Luna Classic Now","Before you invest in Terra Luna Classic, you may want to consider other high-potential crypto projects alongside LUNA. ","We’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:",""],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"6.5%","content":"PERCENT"},{"type":"$0.0002","content":"MONEY"},{"type":"EMA","content":"ORGANIZATION"},{"type":"$3","content":"MONEY"},{"type":"Terra Classic","content":"ORGANIZATION"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"MACD","content":"ORGANIZATION"},{"type":"$0.00021","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$0.0001775","content":"MONEY"},{"type":"$0.00018","content":"MONEY"},{"type":"$0.00019","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$0.0001758","content":"MONEY"},{"type":"Terra Luna Classic Now","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"48%","content":"PERCENT"},{"type":"Moving Average Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"$0.001","content":"MONEY"},{"type":"17.54%","content":"PERCENT"},{"type":"Terra Luna Classic Price","content":"ORGANIZATION"}],"hashtag":["LUNC","Terra"],"authors":["John Isige"]}