{"summary":"Sri Lanka’s Stance on Crypto and the Launch of ‘Lanka Pay’ in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sri-lankas-stance-on-crypto-and-the-launch-of-lanka-pay-in-2024.htm","publishDate":"2024-01-22T08:20:34","id":20406,"type":null,"title":"Sri Lanka’s Stance on Crypto and the Launch of ‘Lanka Pay’ in 2024","category":["Bitcoin News "],"content":["Sri Lanka has always been a country where cash is king and this remains the case despite the country planning to introduce its digital currency by the end of 2024.","Once dubbed “the pearl of the Indian Ocean” — Sri Lanka is known for producing the finest tea, fresh coconuts, and spices. Not forgetting the exotic wildlife including the leopard, elephant, sloth bear, blue whale, and sperm whale.","Sri Lanka remains anti-crypto. Its stance on cryptocurrencies is that digital currency is not considered legal tender in the country. According to directions No. 03 of 2021 under Foreign Exchange Act, No. 12 of 2017, Electronic Fund Transfer Cards (EFTCs) such as debit cards and credit cards are not to be used for payments related to cryptocurrency transactions.","Sri Lankan economic crisis first started in 2019 and in 2022, Sri Lanka’s economy struggled after fuel supplies ran dry. In terms of GDP, Sri Lanka is expected to reach $76.86 billion by the end of 2024, according to data from Trading Economics, and in the long-term, Sri Lanka’s GDP is projected to trend around $79.54 billion in 2025 and $82.33 billion in 2026, reports Trading Economics. In October 2023, Nandalal Weerasinghe, the Governor of the Central Bank in Sri Lanka, said he believes that the adoption of decentralized cryptocurrencies will worsen the nation’s economic condition.","Last year, American millionaire Tim Draper travelled to Sri Lanka and proposed using Bitcoin as a legal tender to combat the corruption that caused the island nation’s hyperinflation.  But Sri Lanka wasn’t having any of this. During a TV shoot in Sri Lanka, Draper met with President Ranil Wickremesinghe and Weerasinghe to suggest Bitcoin as a practical solution for solving financial issues. But Weerasinghe, the Governor of the Central Bank of Sri Lanka – a major authority figure made it clear that doing so would aggravate the economic condition of the nation.","The Central Bank has warned the public of the growing number of financial scams operating with the promise of high returns based on crypto-investments. “These scams include deceiving individuals and obtaining money from them with the promise of providing a high return by investing money in cryptocurrency, as well as deceiving individuals to invest in fraudulent cryptocurrency projects. Such scams circumvent traditional regulatory and legal protection mechanisms, resulting in individuals losing their hard-earned money.”","The Central Bank made it clear that it has not issued any licence or authorized any individual or business to operate schemes involving cryptocurrency, or mining operations, cryptocurrency exchanges, deposit-taking or custody services related to cryptocurrency or any cryptocurrency investment advisory service.","Sri Lanka’s Central Bank announced plans to introduce a digital currency by the end of 2024 its official told a top committee in Parliament, as reported by the Colombo-based local media news site Daily Mirror LK.“The exercise of introducing ‘Lanka Pay’ and ‘Central Bank Digital Currencies’ has already begun. The two systems will be launched by the end of this year,” Central Bank officials informed the Ways and Means Committee in Parliament, reports Daily Mirror LK.","Central Bank officials were called before the committee to discuss issues pertaining to online payments in Sri Lanka. Accordingly, the Chairman of Ways and Means Committee Patali Champika Ranawaka inquired about the regulation of online payment systems in Sri Lanka,” Parliamentary Media Unit (PMU) said. In September 2023,  Nandalal Weerasinghe, the Governor of the Central Bank acknowledged in a keynote speech that interest in digital currencies has been gaining traction and within the Central Bank of Sri Lanka.","“We are also engaged in studies on the potential of Central Bank Digital Currency (CBDC) which is the digital form of legal tender issued by the Central Bank. There is consensus across global central banks that CBDC will help enhance the efficiency and resilience of the payment system while also serving to increase financial inclusion.","Importantly, other potential benefits of CBDC include more effective monetary transmission and improved financial transparency,” said Weerasinghe. For now, Sri Lanka is showing signs of revival through growing tourism but cryptocurrency remains an unregulated investment instrument and is not recognized as an asset class. \n\n"],"entity":[{"type":"2017","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Central Bank Digital Currencies’","content":"ORGANIZATION"},{"type":"$76.86 billion","content":"MONEY"},{"type":"Draper","content":"PERSON"},{"type":"Central Bank Digital Currency (CBDC","content":"ORGANIZATION"},{"type":"Tim Draper","content":"PERSON"},{"type":"Parliament","content":"LOCATION"},{"type":"Ways and Means Committee in Parliament","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Sri Lanka’s Central Bank","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Ranil Wickremesinghe","content":"PERSON"},{"type":"Chairman of Ways and Means Committee Patali Champika Ranawaka","content":"ORGANIZATION"},{"type":"$82.33 billion","content":"MONEY"},{"type":"Nandalal Weerasinghe","content":"PERSON"},{"type":"Weerasinghe","content":"PERSON"},{"type":"September 2023","content":"DATE"},{"type":"Colombo","content":"LOCATION"},{"type":"Electronic Fund Transfer Cards","content":"ORGANIZATION"},{"type":"Trading Economics","content":"ORGANIZATION"},{"type":"Sri Lanka","content":"LOCATION"},{"type":"$79.54 billion","content":"MONEY"},{"type":"Central Bank of Sri Lanka","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Central Bank Digital Currency","Sri Lanka","Tim Draper"],"authors":["Tanzeel Akhtar"]}