{"summary":"Prepare for a North American Bitcoin Mining Infrastructure Boom + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/prepare-for-a-north-american-bitcoin-mining-infrastructure-boom-more-news.htm","publishDate":"2023-12-15T14:00:38","id":20404,"type":null,"title":"Prepare for a North American Bitcoin Mining Infrastructure Boom + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","A new wave of Bitcoin (BTC) infrastructure boom may be coming, which could further strengthen the network and hashrate dominance in North America, according to the latest Miner Weekly report by BlocksBridge Consulting.","China’s 2021 Bitcoin mining ban has led to a “massive infrastructure buildout” in other countries. Much of it is in North America, especially in Texas, USA.","Now, over the past few weeks, several major mining companies have revealed their near- and long-term site expansion plans.","This expansion will progress with their $1.2 billion preordered bitcoin miners that will begin shipment next year in anticipation of the halving in April, the report said.","Some of the plans include:","Bitcoin mining company Marathon Digital Holdings plans to acquire rival Bitcoin miners and related infrastructure in the next two years, according to Bloomberg.","Chief Executive Officer Fred Thiel was quoted as stating that: “We intend to expand considerately” in 2024 and 2025. “I think you’ll see us being a consolidator in the industry.”","An approval from the US Securities and Exchange Commission (SEC) of a US exchange-traded fund (ETF) that invests directly in Bitcoin should be beneficial for miners because it will boost overall demand for BTC, Thiel said.","The company’s shares have jumped more than 400% this year, the report added.","Crypto exchange Binance’s survey of over 1,000 respondents found that nearly half (45%) listed earning extra income as their primary use for crypto.","Among these respondents, 23% indicated that their goal was to supplement their primary income, with another 23% using it to save for a home and 21% for investing in other digital assets.","The earning extra income response was followed by saving money (19%) and offsetting inflation (9%).","More than a third (36%) of respondents indicated that achieving financial security and independence was the primary motivation for using crypto for savings.","More than a third of respondents shared that high fees (19%) and slow transaction times (14%) were the largest challenges when dealing with traditional financial systems and services.","76% of the respondents indicated that crypto can play a role in reducing income inequality or financial disparities within society.","Additionally, 36% use crypto to save money as it offers financial security and independence, 16% to earn better interest on their savings, and 14% to save for retirement.","PancakeSwap’s ‘Pancake Protectors’ player-versus-player (PvP) game with on-chain rewards has expanded to Polygon zkEVM and Base networks as of December 14.","Per the press release, Pancake Protectors players can now deposit and withdraw CAKE tokens, the primary in-game currency, on Polygon zkEVM and Base.","With elements catering to the GameFi community, CAKE collectors, Pancake Squad, and Bunnies NFT holders, Pancake Protectors has attracted over 25,000 players daily active users during peak times, it said.","The announcement added that PancakeSwap’s gaming marketplace currently features “Pancake Protectors” developed in partnership with Mobox in May 2023, and the new “Pancake Mayor”, developed in partnership with Binary X."],"entity":[{"type":"BTC","content":"ORGANIZATION"},{"type":"76%","content":"PERCENT"},{"type":"USA","content":"ORGANIZATION"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"December 14","content":"DATE"},{"type":"Pancake Squad","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Bunnies NFT","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Fred Thiel","content":"PERSON"},{"type":"21%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"Pancake Protectors","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Marathon Digital Holdings","content":"ORGANIZATION"},{"type":"BlocksBridge Consulting","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"400%","content":"PERCENT"},{"type":"36%","content":"PERCENT"},{"type":"14%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"16%","content":"PERCENT"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["Binance","Bitcoin","Gaming","Mining","Polygon","USA"],"authors":["Sead Fadilpašić"]}