{"summary":"Fox Launches Blockchain-based Open Source Platform with Polygon Labs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/fox-launches-blockchain-based-open-source-platform-with-polygon-labs.htm","publishDate":"2024-01-10T05:28:54","id":20414,"type":null,"title":"Fox Launches Blockchain-based Open Source Platform with Polygon Labs","category":["Blockchain News "],"content":["The Fox Corporation has partnered with Polygon Labs to unveil the new blockchain-based Verify, an open source platform designed to verify the authenticity of content and track its use across the web.","Built on Polygon PoS, the core blockchain infrastructure can transparently prove authenticity of content. Publishers who opt in to the platform will be able to prove their content’s organization in hopes of tackling authenticity problems caused by the rapid development of AI.","“Though advances in AI have developed at a breathtaking pace, one downside of these platforms has been the rise of AI-generated media, from articles to audio to images,” reads a January 9th statement from Paragon Labs.","“There is broad agreement this problem needs to be met head on, but there haven’t been many real-world solutions that prove the provenance of any given piece of content. Researchers at Polygon Labs have been building the core blockchain infrastructure that can transparently prove authenticity.”"," ","Allegations of defamation and hard-hitting litigation News of the media conglomerate’s latest venture follows a nearly $3 billion litigation brought against the company by Smartmatic, a voting technology company, for its alleged defamatory reporting during the 2020 election.","Similarly, in April, Fox was mandated to pay $787.5 million in damages to Dominion Voting Systems, another voting technology firm that alleged defamation against the media conglomerate.","It seems that Fox is seeking to avoid further issues regarding allegations of inauthenticity with the release of the new technology.","“Individual pieces of content are cryptographically signed onchain, allowing consumers to identify content from trusted sources using the Verify Tool,” Polygon’s press release states.","Since Verify’s beta version originally launched on August 23rd, thus far the licensing and verification platform platform has seen 89,000 pieces of content onboarded across the platform from the Fox Corporation and its affiliates. An efficient way to verify content “With this technology, readers will know for sure that an article or image that purportedly comes from a publisher in fact originated at the source,” Polygon says.","News of Fox’s foray into content verification comes amidst wider discussions attempting to reconcile the rapid implementation of AI with the global market.","“As AI-generated text and images flow more widely online, Verify will be able to help consumers not only identify the veritable source of content, but also give media publishers more control over relationships with AI platforms scraping the web,” Polygon Labs’ press release states."],"entity":[{"type":"Paragon Labs","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"$787.5 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"August 23rd","content":"DATE"},{"type":"Fox","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Dominion Voting Systems","content":"ORGANIZATION"},{"type":"Fox Corporation","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Smartmatic","content":"ORGANIZATION"},{"type":"Fox’s","content":"ORGANIZATION"}],"hashtag":["Blockchain","Polygon"],"authors":["Julia Smith"]}