{"summary":"Polygon Nearly Matches Ethereum in Crypto User Acquisition in 2023","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-nearly-matches-ethereum-in-crypto-user-acquisition-in-2023.htm","publishDate":"2024-01-26T05:44:50","id":20412,"type":null,"title":"Polygon Nearly Matches Ethereum in Crypto User Acquisition in 2023","category":["Altcoin News "],"content":["Layer-2 scaling network Polygon (MATIC) came close to matching Ethereum (ETH) in terms of crypto user acquisition in 2023.","According to blockchain analytics firm Flipside, Polygon acquired an impressive 15.24 million users during the year, falling just shy of Ethereum’s 15.4 million users.","To define an “acquired” user, Flipside considered individuals who conducted at least two transactions on a specific blockchain, with at least one transaction occurring in 2023.","Is the bull is really here? How can we tell?","Data.","Sentiment isn't the only thing that's changed lately. According to the data, user behavior is shifting — and with it, crypto markets.","We cover it all in The Onchain Crypto User Report 🧵📊👇 pic.twitter.com\/IsclNOZhJk","— Flipside 📊 (@flipsidecrypto) January 25, 2024","","Notably, Polygon took the lead in user acquisition during the first half of the year but was eventually surpassed by Ethereum, which maintained its lead throughout the second half.","Flipside highlighted Polygon’s strong start to the year, with 2.8 million acquired users in January alone, accounting for over 40% of the network’s total acquired users for 2023.","“From there, Polygon experienced the most consistent decline in monthly user acquisition over the year in relative terms, but still compared favorably with more other networks,” the report added.","While Polygon experienced a relatively consistent decline in monthly user acquisition throughout the year, it still fared favorably compared to other networks.","Bitcoin secured the third position with 10.65 million acquired users, while Solana and Arbitrum rounded out the top five.","In total, the eight tracked blockchains recorded 62 million acquired users, which included Optimism, Avalanche, and Base.","Flipside observed that user acquisition peaked in May before gradually declining.","Flipside noted a possible connection between the increase in acquired users and the collapse of Silicon Valley Bank in March, which may have led to a loss of confidence in centralized entities, prompting a shift towards decentralized custody alternatives.","“The acquired user increase began in March, coinciding with the collapse of Silicon Valley Bank, which may have shaken confidence in centralized entities and ignited a flee to decentralized custody alternatives.”","Regarding Base, which launched in August, Flipside stated that it enjoyed a strong start but experienced a tapering off in user volume towards the end of 2023.","The firm attributed this decline to renewed enthusiasm for more established chains with robust and diverse app ecosystems.","However, Flipside believes that Base’s user growth could benefit from the next bull run, especially considering Coinbase’s efforts to serve as a gateway for new users in the crypto space.","As reported, Ethereum-based layer 2 network Arbitrum now has a market share of 49.17% among layer 2 networks, far surpassing number two on the list, Optimism Mainnet, with its 28.85% market share.","The network has also seen a consistent increase in its TVL at least since October last year, rising about 50% from $1.66 billion in October to the current value of $2.51 billion, data from DeFi tracking site DefiLlama showed.","The upcoming Ethereum Dencun upgrade, incorporating changes proposed by EIP-4844, is expected to reduce rollup transaction costs, benefiting layer 2 solutions like Arbitrum by lowering gas fees and improving network capacity."],"entity":[{"type":"4844","content":"DATE"},{"type":"Flipside","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"January","content":"DATE"},{"type":"49.17%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$1.66 billion","content":"MONEY"},{"type":"October last year","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"January 25, 2024","content":"DATE"},{"type":"28.85%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"$2.51 billion","content":"MONEY"}],"hashtag":["Ethereum","Polygon"],"authors":["Ruholamin Haqshanas"]}