{"summary":"Hong Kong Regulator Boosts HashKey’s License, Expanding Retail Crypto Services","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hashkey-hong-kong-license-upgrade-expands-retail-crypto-services.htm","publishDate":"2024-04-11T05:15:57","id":20418,"type":null,"title":"Hong Kong Regulator Boosts HashKey’s License, Expanding Retail Crypto Services","category":["News "],"content":["Hong Kong’s Securities and Futures Commission (SFC) granted an expanded license to HashKey Capital. This upgrade enables HashKey to offer its services to retail investors, removing the prior restriction that limited its clientele to professional investors only, the firm said Thursday.","This regulatory approval signifies a potential pathway for HashKey Capital to introduce virtual asset investment products to retail investors. However, such offerings remain contingent upon obtaining the necessary product approvals from the SFC.","“This development not only demonstrates our leadership in the industry but also opens up exciting opportunities for retail investors to access our fund products and participate in the growing digital asset market through a trusted and regulated platform,” said Deng Chao, CEO of HashKey Capital.","Moreover, the upgrade is anticipated to serve as a catalyst for HashKey’s market expansion. It has the potential to unlock new markets and opportunities, enabling the firm to cultivate a wider investor base and solidify its position as a leader in the digital asset management domain.","The development comes as the SFC aims to approve the first group of Spot Bitcoin Exchange-Traded Funds (ETFs) on April 15. In anticipation of this initial approval announcement, the SFC updated its list of authorized fund companies on Wednesday. Notably, this list included prominent Chinese asset managers Harvest Global Investment and China Asset Management.","Last week, HashKey announced a strategic collaboration with Bosera Funds. This agreement focuses on offering virtual asset Spot ETFs and financial technology. Through this partnership, both parties aim to develop novel products, conduct joint research on emerging technologies, and collaborate on initiatives such as talent training, technology exchange, and market expansion.","Recently, HashKey unveiled its new global trading platform, offering a selection of over 20 cryptocurrencies for trading. It focuses on international markets, with the exception of regions with crypto restrictions, such as mainland China, Hong Kong, and the US.","The platform intends to introduce futures trading capabilities within the first three months following its launch."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"Harvest Global Investment and China Asset Management","content":"ORGANIZATION"},{"type":"Bosera Funds","content":"ORGANIZATION"},{"type":"April 15","content":"DATE"},{"type":"Deng Chao","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HashKey","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"’s Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"HashKey Capital","content":"ORGANIZATION"}],"hashtag":["HashKey","Hong Kong"],"authors":["Shalini Nagarajan"]}