{"summary":"Polygon Labs CEO Condemns Ethereum Layer 3 Networks Amid Surge in Meme Coin Trading","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-labs-ceo-condemns-ethereum-layer-3-networks-amid-surge-in-meme-coin-trading.htm","publishDate":"2024-04-01T10:19:06","id":20410,"type":null,"title":"Polygon Labs CEO Condemns Ethereum Layer 3 Networks Amid Surge in Meme Coin Trading","category":["Ethereum News "],"content":["Polygon Labs CEO Marc Boiron has lashed out at Layer 3 (L3) networks on the Ethereum blockchain, claiming they are unnecessary for scaling the network and only serve to drain value from the mainnet.","In a recent post on X, Boiron expressed his skepticism about L3 networks, stating that Polygon Labs, a prominent Layer 2 (L2) scaling network for Ethereum, does not work on L3s because they are not essential for scaling existing networks. ","“L3s exist only to take value away from Ethereum and onto the L2s on which the L3s are built,” he argued.","Boiron’s comments have raised eyebrows and sparked a debate among industry participants. ","One respondent argued that while L2s on Ethereum are indeed valuable to the network, there is no such thing as “taking value away from Ethereum and onto the L2s.”","“I disagree that L2 value is Ethereum value,” Boiron replied. ","“Just take this to the extreme. If all L3s settled to one L2, then Ethereum would capture basically no value and, thus, Ethereum security would be at risk.”","He further clarified that Polygon does not oppose the development of L3s on other networks, including Polygon itself. ","However, he emphasized that their mission is to scale Ethereum while ensuring fair value distribution between Polygon and Ethereum.","I agree that L2s are Ethereum. I disagree that L2 value is Ethereum value. Just take this to the extreme. If all L3s settled to one L2, then Ethereum would capture basically no value and, thus, Ethereum security would be at risk.","— Marc Boiron (@0xMarcB) March 31, 2024","","Layer 3 protocols are designed to operate on top of L2s and provide application-specific decentralized applications with enhanced scaling, performance, interoperability, customization, and cost-efficiency. ","The L3 ecosystem includes various solutions from L2 networks such as Orbs, Xai, zkSync Hyperchains, and the recently launched Degen Chain on Arbitrum Orbit. ","Despite the growing interest, the L3 sector remains relatively small, with only four L3 tokens listed on CoinGecko.","Peter Haymond, the senior partnership manager at Offchain Labs, countered Boiron’s arguments, highlighting the benefits of L3s that don’t deplete Ethereum’s value. ","He pointed out advantages such as the low cost of native bridging from L2, cost-effective on-chain proofs, custom gas tokens, and specialized state transition functions.","Meanwhile, Patrick McCorry, a researcher at the Arbitrum Foundation, said that L3s offer compelling advantages, including enabling L2 networks to become settlement layers and leveraging Ethereum as a global ordering service and final judge of settlement.","“Surprised by take. L3s seem like a no brainer, especially when it allows the L2 to eventually become a settlement layer (ie executing the bridge is cheaper) and ultimately relying on Ethereum as global ordering service + final judge of settlement.”","The debate surrounding L3 networks comes amid the recent launch of the Degen Chain network.","Built on Arbitrum Orbit, Degen Chain was introduced by infrastructure provider Syndicate on March 28th as a specialized ultra-low-cost network for the Degen token ($DEGEN). ","This token has become the community’s go-to option for users of the Farcaster Web3 social media service, which operates on Base, an Ethereum Layer 2 network. ","Consequently, Degen Chain functions as a Layer 3 network, or L3.","It is worth noting that early adopters of Degen have transformed small investments into substantial profits. ","One trader, who initially put in less than $7,000, walked away with over $2 million in profits. ","Only invested 3 $ETH($6,991) on $DEGEN, this trader made $2.15M, a gain of 308x!","He spent 3 $ETH($6,991) to buy 277M $DEGEN on Jan 8, then sold 77M $DEGEN for 134 $ETH($370K), with 100M $DEGEN($1.79M) left.https:\/\/t.co\/j3vq0Op2S5 pic.twitter.com\/468vrPQ0Xq","— Lookonchain (@lookonchain) March 26, 2024","","While amassing wealth through meme coins is not new in the crypto world, Degen’s adoption as one of the first L3 chains to gain significant traction is noteworthy. ","On Degen Chain, an ecosystem of additional meme coins, denominated in $DEGEN, has generated tens of millions of dollars in trading volume."],"entity":[{"type":"Degen Chain","content":"PERSON"},{"type":"March 31, 2024","content":"DATE"},{"type":"$DEGEN($1.79","content":"MONEY"},{"type":"March 26, 2024","content":"DATE"},{"type":"Arbitrum Orbit","content":"ORGANIZATION"},{"type":"Xai","content":"PERSON"},{"type":"$2.15","content":"MONEY"},{"type":"$ETH($370K","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Degen","content":"PERSON"},{"type":"$7,000","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"$ETH($6,991","content":"MONEY"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Degen Chain","content":"ORGANIZATION"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"March 28th","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Peter Haymond","content":"PERSON"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"Degen Chain on Arbitrum Orbit","content":"ORGANIZATION"},{"type":"Degen","content":"ORGANIZATION"},{"type":"$DEGEN","content":"MONEY"},{"type":"Patrick McCorry","content":"PERSON"}],"hashtag":["Ethereum","Polygon"],"authors":["Ruholamin Haqshanas"]}