{"summary":"The Road to Digital Euro: ECB Publishes Crucial Rulebook Draft","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/the-road-to-digital-euro-ecb-publishes-crucial-rulebook-draft.htm","publishDate":"2024-01-04T13:50:25","id":20416,"type":null,"title":"The Road to Digital Euro: ECB Publishes Crucial Rulebook Draft","category":["Blockchain News "],"content":["The European Central Bank (ECB) has unveiled progress in the development of the digital euro, with the publication of a report detailing the advancements made by the digital euro scheme’s Rulebook Development Group (RDG).","The update follows a June 2023 report from the same group, and highlights the completion of the initial chapters of the digital euro rulebook, aligning with legislative proposals and design decisions greenlit by the ECB’s Governing Council.","The first draft of the rulebook serves as an intermediate version, encompassing functional and operational models, technical scheme requirements, and the adherence model, which outlines the rights and obligations of scheme members based on the draft legislation.","According to the report, the first complete rulebook draft with all chapters included will be prepared during the ongoing digital euro “preparation phase.”","RDG members, representing consumers, retailers, and intermediaries, collaborated over the past months to develop these chapters, emphasizing inclusivity and diverse perspectives, the ECB said.","The rulebook draft is currently undergoing an interim review, providing stakeholders with the opportunity to scrutinize and offer feedback on its current state.","The RDG will consider making adjustments based on received feedback, with a goal of ensuring a comprehensive and adaptable regulatory framework.","According to the ECB, flexibility is a key feature of the draft rulebook, ensuring it is capable of accommodating future adjustments aligned with the digital euro legislative process.","In the preparation phase, the RDG will intensify efforts to finalize the rulebook, introducing additional sections on user experience requirements, branding and communication standards, certification processes, testing and approval procedures, internal rules, risk management, and interoperability and implementation specifications, the ECB statement said.","The ECB has not yet made a final decision on whether or not a digital euro will be launched, but ECB President Christine Lagarde is known as a strong proponent of a European central bank digital currency (CBDC), as well as a critic of private cryptocurrencies.","Among other things, the ECB President has claimed that her son lost “almost all” the money he invested in crypto.","In September last year, Lagarde said that a digital Euro pilot “will probably take us another two years, at least, before it’s the final say.”","At the time, she also said that a euro CBDC will not eradicate cash, nor substitute it.","“If it can be user friendly, if it can be free, if it can be a universal digital mode of payment throughout the entire Euro system, I think it will have checked many of the boxes, which I believe would characterize it as success,” she noted."],"entity":[{"type":"Lagarde","content":"PERSON"},{"type":"ECB","content":"ORGANIZATION"},{"type":"ECB’s Governing Council","content":"ORGANIZATION"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"September last year","content":"DATE"},{"type":"RDG","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Rulebook Development Group","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["CBDC","ECB"],"authors":["Fredrik Vold"]}