{"summary":"Uniswap Volume Surges as Traders Praise DEX & DeFi Tandem","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uniswap-volume-surges-as-traders-praise-dex-defi-tandem-7297.htm","publishDate":"2020-07-31T12:45:00","id":20419,"type":null,"title":"Uniswap Volume Surges as Traders Praise DEX & DeFi Tandem","category":["Altcoin News "],"content":["After going through a major protocol upgrade in May this year, Version 2 of the popular decentralized exchange (DEX) Uniswap is seeing sharply rising trading volumes, while traders discuss the pros and cons of DEX trading.","Following Uniswap’s upgrade to its Version 2, the vast majority of trading now takes place on the upgraded protocol, with a 24-hour trading volume of over USD 125m on V2 versus USD 3.5m on V1, according to data from Coingecko.","Trading volume on Uniswap V2","The discussion on Uniswap today drew multiple opinions, while startup investor Qiao Wang compared Uniswap’s latest record-breaking trading volume with centralized exchange giants like Coinbase and Kraken.","Meanwhile, Crypto hedge fund Spartan Capital’s Kelvin Koh said that he has “used more of Uniswap in the last 2 months than in the last 3 years,” while complaining that centralized exchanges are too slow to list new decentralized finance (DeFi) tokens.","The same sentiment was also shared by Three Arrows Capital CEO Su Zhu, who listed several ways in which he sees DEXs as better than their centralized counterparts:","From there on, the praising of decentralized trading continued, with for instance Eric Conner of the Into the Ether podcast saying “centralized exchanges are basically just fiat on ramps now,” and Jason Choi of Spartan Capital writing the “space has come pretty far from the days of clunky CLOBs [Central Limit Order Books] to DEXs that are objectively better than CEX [centralized exchange] counterparts.”","Despite the popularity of DEXs, however, some also warned of the dangers of using decentralized exchanges like Uniswap, given the potential for anyone to create a market for tokens that are essentially clones of popular existing tokens:","“Another reminder that there are TONS of impostor tokens “on” Uniswap. Due to their very nature there is basically zero barrier of entry to somebody cloning a token, & every ERC20 is findable on Uniswap. Always check the contract address to make sure everything looks kosher,” popular crypto trader sicarious warned.","Similarly, another trader opined about DEXs that “you miss nothing, they are trading higher, but in reality, the volume is very low, and there is close to 0 liquidity,” while adding “so if you want to sell your $1,000,000 on the paper and you hit the market you will probably get $50 on the bids until zero.”","The increasing popularity of DEXs was also noted by crypto research firm TokenInsight in its report on crypto spot exchanges for Q2 this year, saying that “the volume of decentralized exchanges in this quarter reached USD 191.4bn, which is about the level of the second quarter of the centralized exchanges in 2017.”","Further, the report also showed that Uniswap was the largest DEX over the course of the second quarter this year, even before V2 took off, with the exception of Etherflyer, which may or may not be considered a pure DEX:",""],"entity":[{"type":"$50","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Coingecko","content":"ORGANIZATION"},{"type":"$1,000,000","content":"MONEY"},{"type":"Jason Choi","content":"PERSON"},{"type":"May this year","content":"DATE"},{"type":"Su Zhu","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Uniswap","content":"PERSON"},{"type":"Kelvin Koh","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"second quarter this year","content":"DATE"},{"type":"Eric Conner","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"last 3 years","content":"DATE"}],"hashtag":["Altcoins","Decentralized Exchange","DeFi","DEX","Exchange","Trading","Uniswap"],"authors":["Fredrik Vold"]}