{"summary":"Optimism to Halt ETH Withdrawals for Testing Upgraded Incident Response System","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/optimism-to-halt-eth-withdrawals-for-testing-upgraded-incident-response-system.htm","publishDate":"2024-02-09T18:42:50","id":20417,"type":null,"title":"Optimism to Halt ETH Withdrawals for Testing Upgraded Incident Response System","category":["Blockchain News "],"content":["On February 15, the Optimism network will suspend ETH token withdrawals to test an updated security response system. Withdrawals will not be possible for one hour, the developers said.","According to the announcement, ETH withdrawals from Optimism’s Level-2 network to the main Ethereum network will be suspended, while the ability to make deposits from the main network will not be affected. Users will also be able to perform regular transactions.","","During this exercise, L2-to-L1 withdrawals will be paused. L1-to-L2 transactions are not affected. Smart contract calls and RPC calls involving withdrawals to L1 may fail during this window. Transactions on L2 will continue as normal and not be affected.","— OP Labs (@OPLabsPBC) February 9, 2024","","This pause, as announced on Discord first, will affect withdrawals from the Layer 2 network to the Ethereum mainnet, while deposits from the mainnet to the Layer 2 network and regular transactions on the network will continue unaffected.","The primary objective of this test is to bolster the capability to respond to security incidents across various chains within the Optimism ecosystem in a synchronized manner. Currently, the incident response system entails an on-chain pause specifically for Ethereum withdrawals.","In January, OP Labs proposed a protocol upgrade aimed at bolstering the ability to respond to security incidents in a coordinated manner across all OP chains. This upgrade is a result of insights gleaned from comprehensive incident response drills and valuable input from industry experts, with the goal of enhancing the resilience of the Superchain once implemented.","A notable feature of this upgrade is the introduction of a new SuperchainConfig contract, which is initially minimalistic but can expand over time as new capabilities are integrated into the Superchain. These enhanced features have been operational on OP Sepolia since December 11, 2023, without encountering any issues.","The forthcoming upgrade will introduce a broader feature enabling a Superchain-wide pause, which will halt withdrawals for tokens and non-fungible tokens (NFTs) across Optimism and any Optimism-based chains opting into the system.","The current incident response mechanism, including the on-chain pause feature for ETH withdrawals, mitigates critical security concerns within the Optimism Protocol. The proposed upgrade extends this functionality by introducing a Superchain-wide pause mechanism, enhancing protection across multiple fronts, including withdrawals for ERC-20 and ERC-721 tokens.","In announcing the enhanced system in January, OP Labs emphasized that the upgrade aims not only to fortify individual chains but also to harness the collective security intelligence of the entire Superchain.","OP Labs also encourages stakeholders to review the full upgrade proposal, including the audit and impact assessment available in the Governance Proposal. Key technical changes include the introduction of the SuperchainConfig contract and updates to the OptimismPortal and L1CrossDomainMessenger.","The Optimism blockchain is an ecosystem of Level-2 chains (collectively named the Superchain) that use Optimism to reduce transaction costs for decentralized applications. This ecosystem is managed by a DAO known as the Optimism Collective. OP Mainnet is the flagship network representing the fast, stable, and scalable L2 blockchain. Optimism also includes other L2 networks, such as Base and Zora.","The upgraded feature is presently operating on its testing network, and the one-hour pause on February 15 will serve as a live environment check for its functionality. Throughout the downtime, stakeholders can expect updates posted on Optimism’s network status page to stay informed."],"entity":[{"type":"February 15","content":"DATE"},{"type":"ERC","content":"ORGANIZATION"},{"type":"December 11, 2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"February 9, 2024","content":"DATE"},{"type":"20","content":"DATE"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["Layer-2","OP Labs","Optimism"],"authors":["Hassan Shittu"]}