{"summary":"Singapore Authorities to Set Best Practices for Crypto Client Vetting in Banks","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/singapore-authorities-set-best-practices-for-crypto-client-vetting-banks.htm","publishDate":"2023-04-06T08:56:00","id":20423,"type":null,"title":"Singapore Authorities to Set Best Practices for Crypto Client Vetting in Banks","category":["Altcoin News "],"content":["Singapore officials are collaborating with local banks to develop uniform standards for evaluating customers in the digital asset sector in the aftermath of significant global disruptions in the industry. ","The Monetary Authority of Singapore and the police have been working with lenders in the country to refine their approach to onboarding crypto service providers, Bloomberg reported, citing people familiar with the matter. ","The report claimed that the initiative has been ongoing for approximately six months. ","A statement describing best practices in areas such as risk management and due diligence may be released in two months. ","The guidelines will also encompass stablecoin, transferable gaming or streaming credits, and non-fungible tokens (NFTs). ","Despite the regulatory guidelines, it will be up to banks to determine whether to accept crypto clients based on their risk appetite. ","“As with any other current or prospective customer, banks are required to conduct customer due diligence measures to understand and manage the risk(s) posed by them,” the MAS said in a comment to Bloomberg.","“Banks make their own determination of whether to start or continue a banking relationship with a customer, balancing between commercial considerations and business risk tolerance.” ","Although financial institutions in Singapore are allowed to do business with digital asset management firms or other such companies, some firms have experienced difficulties with account creation, primarily because local banks were concerned about the potential for illegal cash flows and other illicit activities. ","Singapore, in line with other countries, has created a licensing system for the crypto industry and has also proposed more restrictions on crypto trading by retail customers.","This came as some high-profile crypto companies that collapsed last year, including Terraform Labs and crypto hedge fund Three Arrows Capital, were based in the country. ","In early March, Singaporean authorities launched a probe into Do Kwon’s Terraform Labs, the entity that developed the now-collapsed TerraUSD stablecoin.","Singapore and Hong Kong have been striving to create a more friendly environment for crypto firms in a push to become global crypto hubs. ","As reported, Hong Kong officials plan to host a meeting between crypto companies and bankers in an attempt to ease financing for the sector, which suggests the city is determined to tackle various difficulties that crypto companies face when trying to set up corporate banking accounts.","Furthermore, a number of Chinese state-owned banks in Hong Kong, including the Bank of Communications, Bank of China, and Shanghai Pudong Development Bank, have either started offering banking services to local crypto firms or have made inquiries.","On the other hand, regulators in the US, specifically the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC), have launched an aggressive crackdown on the crypto industry.","Just recently, crypto exchange Bittrex announced that it is shutting down US operations due to increasing regulatory pressure and a lack of clear regulatory requirements.","“Regulatory requirements are often unclear and enforced without appropriate discussion or input, resulting in an uneven competitive landscape. Operating in the U.S. is no longer feasible,” Bittrex co-founder Richie Lai said at the time. "],"entity":[{"type":"Shanghai Pudong Development Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Richie Lai","content":"PERSON"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bank of Communications","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Adoption","Banks","Singapore"],"authors":["Ruholamin Haqshanas"]}