{"summary":"Exciting little magical creatures called ‘Nepers’ from Neptune are marching their way onto the Metis Layer 2 ecosystem this month","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135638\/neptune-gamefi-orbiting-on-metis","publishDate":"2022-03-01T09:00:03","id":2042,"type":null,"title":"Neptune GameFi Orbiting on Metis","category":["SPONSORED"],"content":["Exciting little magical creatures called ‘Nepers’ from <a href=\"https:\/\/neptune.live\/\" data-v-f87c67ca=\"\">Neptune<\/a> are marching their way onto the Metis Layer 2 ecosystem this month! Neptune is an exciting and intricate gaming platform as it combines gaming with NFTs, DeFi, and DAO governance for a community experience that holds true to the ethos of decentralization. As a result of these values a strategic partnership was struck between Metis, its native DeX Netswap, and Neptune! With Metis offering cheap transactions, and instantaneous speed coupled with Netswap’s liquidity pool for Neptune token holders we get to see much added value for Neptune game players as they explore Neptune! Add to the mix killer graphics and visually stunning gameplay, Neptune is changing the Web3 gaming landscape!","<strong data-v-f87c67ca=\"\">The World of Neptune<\/strong>","Neptune is the underwater world of Nepers, the fearless NFT characters players can adventure and take to battle and earn NFTs, governance and more! Each Neper has different traits and elemental skills to assist players on their journey through Neptune, and as <a href=\"https:\/\/medium.com\/@NeptuneGameFi\/neper-and-gameplay-introduction-part-2-ded16fd88864\" data-v-f87c67ca=\"\">battles<\/a> are won, players can advance the power and capabilities of their Neper team. Learn more about how to acquire and play Nepers <a href=\"https:\/\/medium.com\/@NeptuneGameFi\/neper-and-gameplay-introduction-part-one-f87370675d38\" data-v-f87c67ca=\"\">here<\/a>.","<strong data-v-f87c67ca=\"\">Become a Neptunian<\/strong>","As DAO governance and community play expands, so will the opportunities within Neptune. The platform’s vision is to build a robust ecosystem for blockchain gaming, adding new games and opportunities for Neptunians to participate in NFT marketplaces and DeFi protocols like Netswap. Beyond voting governance, Neptunians will also receive priority access to new game launches where they can reap the benefits of Neptune’s expansion and future collaborations.","","","<strong data-v-f87c67ca=\"\">Making a Splash<\/strong>","With enthusiastic support from the Metis community, Neptune has already sold out their first two rounds of NFT drops, but it’s not too late to get in early! The final round of the Neper NFT drop is March 11th. Be sure to follow Neptune on <a href=\"https:\/\/twitter.com\/NeptuneGameFi\" data-v-f87c67ca=\"\">Twitter<\/a> for sneak peeks of the underwater world &amp; its magical little wonders. Neptunians who are holding their NFTs early may be rewarded as we get closer to game launch by the end of March! Get ready to dive into Neptune!","&nbsp;","<strong data-v-f87c67ca=\"\">Check out more of Neptune at:<\/strong>","www.neptune.live","www.twitter.com\/neptunegamefi","https:\/\/medium.com\/@NeptuneGameFi","https:\/\/t.me\/Neptune_OfficialGroup","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Neper NFT","content":"ORGANIZATION"},{"type":"Neptune","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Neper","content":"PERSON"},{"type":"DeX Netswap","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Metis","content":"ORGANIZATION"},{"type":"March 11th","content":"DATE"},{"type":"Neptunians","content":"ORGANIZATION"},{"type":"Nepers","content":"ORGANIZATION"},{"type":"March!","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}