{"summary":"SocialFi Project Friendzone to Debut on Polygon Blockchain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/friendzone-socialfi-decentralized-social-app-polygon-blockchain.htm","publishDate":"2024-02-08T08:51:58","id":20425,"type":null,"title":"SocialFi Project Friendzone to Debut on Polygon Blockchain","category":["News "],"content":["Decentralized social marketplace Friendzone is hopping on the Polygon blockchain for a Feb. 26 launch, and eyeing a move to Polygon zkEVM down the line.","The app is said to combine the emotional aspects of traditional social media with the financial rewards of Web3 to build online communities.","According to CEO Kevin Lu, Friendzone has two main parts. The first is a user-friendly interface to manage connections and social activities. Second, a deeper layer called LayerSocial, where developers can create innovative apps using the platform’s social connections and data.","“Choosing @0xPolygon PoS as our native chain was strategic, driven by our trust in their technology, the vibrant community of developers and users,” the team said on Wednesday.","♾️ Billions in value created, yet users are left out. Social platforms have long monetized user interactions with minimal return to end-users.","We're excited to tap into @0xPolygon to power the world's first social capital marketplace. pic.twitter.com\/mN9EB0veDt","— friendzone (@friendzone_pro) February 7, 2024","","“With Polygon, we are excited to create the unified layer for social identities, verification and rewards – sparking the first on-chain social circular economy,” it added.","Friendzone’s launch follows the success of buzzy SocialFi app Friend.Tech last year.","Friend.tech quickly gained over 100,000 users within a month. But by October, user activity dropped significantly, and by year-end, it faded from popularity.","Towards the end of the year, competitor app Post.Tech saw a spike in daily trading activity.","Friendzone claims to have learned from past experiences. To this end, it has created a Web3 social platform with a dynamic pricing curve and built-in reward system. On Friendzone, users receive rewards for supporting creators or brands, a feature unique to the platform.","It claims that no single large holder can dominate the market, ensuring fairness for all who participate in the network or “friendzone.”","To support creators and brands, Friendzone has created tailored access controls to enhance user-generated content in various formats. These include private alpha groups, bounties, experiences, pay-per-view, giveaways, raffles, and personalized interactions.","“The heart of a great SocialFi product is achieved when the value of the network increases for each user as more people join, creating reinforced engagement loops and a circular economy,” the team said about its product.","Friendzone was developed by team members and advisors from Synthetix, Band Protocol, Spark Labs Korea, Immutable, and Pendle."],"entity":[{"type":"Immutable","content":"LOCATION"},{"type":"February 7, 2024","content":"DATE"},{"type":"Pendle","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"Spark Labs Korea","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Feb. 26","content":"DATE"},{"type":"Kevin Lu","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Friendzone","content":"PERSON"}],"hashtag":["Decentralization","Polygon","Social media"],"authors":["Shalini Nagarajan"]}