{"summary":"Nonprofit Focused On “Corporate Wrongdoing” Empower Oversight Launches Lawsuit Against SEC Amidst Reports of Conflicts of Interests","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nonprofit-focused-on-corporate-wrongdoing-empower-oversight-launches-lawsuit-against-sec-amidst-reports-of-conflicts-of-interests.htm","publishDate":"2024-03-19T17:49:09","id":20426,"type":null,"title":"Nonprofit Focused On “Corporate Wrongdoing” Empower Oversight Launches Lawsuit Against SEC Amidst Reports of Conflicts of Interests","category":["Blockchain News "],"content":["Empower Oversight, a nonprofit dedicated to enhancing independent governmental oversight, filed a lawsuit against the United States Securities and Exchange Commission (SEC) on Friday, alleging the federal agency failed to comply with their Freedom of Information Act (FOIA) request regarding cryptocurrency conflict of interests at the agency.","The nonprofit’s lawsuit is focused on uncovering information about William Hinman, the Director of the Division of Corporate Finance at the SEC from May 2017 to December 2020, following revelations “that several former-SEC officials held financial interests that call into question the integrity of their actions at the SEC.”","Empower Oversight alleges that Hinman violated the federal agency’s ethics guidance as his former employer, Simpson Thacher, “continued to pay him millions of dollars” during his time at the federal agency.","Additionally, Hinman gave a speech in July 2018 in support of Ether while Simpson Thacher served as a member of the Enterprise Ethereum Alliance.","“Despite very little cooperation from the SEC, Empower learned through FOIA requests that Hinman both had a personal financial interest in cryptocurrencies the SEC was regulating and also broke ethics guidance by meeting with other entities that had an interest,” a Monday press release from the nonprofit noted.","The March 15 filing is the latest development in Empower Oversight’s push for transparency at the federal agency, which has been seeking additional information about the reported conflict of interest since last year.","🚨 We gave the SEC a month.","They didn't produce any documents.","They didn't commit to when they would produce any documents.","So now we've filed suit.https:\/\/t.co\/teh5tEQ6xk https:\/\/t.co\/egWn9L50M2 pic.twitter.com\/nKyP0k41sw","— Tristan Leavitt (@tristanleavitt) March 18, 2024","","The litigation follows the SEC’s Office of Inspector General’s (OIG) failure to produce investigation records “related to financial conflict of interest issues identified and referred to the OIG by Empower Oversight in May 2022.”","Equally important, the court filing further scrutinizes comments made by former SEC Chairman Jay Clayton, who alleged that Bitcoin was not a security.","Clayton went on to work for a Bitcoin and Ether hedge fund called One River Asset Management following his tenure, shortly after “the SEC filed suit against Ripple Labs alleging that its XRP currency was a security.”","“By slow walking their response to our FOlA request, the SEC is stonewalling Empower’s oversight into SEC officials with conflicts of interest on cryptocurrency issues,” said Tristan Leavitt, President of Empower Oversight. “The public has a right to see all documents that relate to how these public officials violated ethics guidance and how the agency failed to hold them accountable.”","A spokesperson for the SEC declined Cryptonews’s request for comment."],"entity":[{"type":"OIG","content":"ORGANIZATION"},{"type":"William Hinman","content":"PERSON"},{"type":"July 2018","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Division of Corporate Finance","content":"ORGANIZATION"},{"type":"March 18, 2024","content":"DATE"},{"type":"Jay Clayton","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Simpson Thacher","content":"PERSON"},{"type":"Clayton","content":"PERSON"},{"type":"Hinman","content":"PERSON"},{"type":"March 15","content":"DATE"},{"type":"Tristan Leavitt","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Enterprise Ethereum Alliance","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"May 2017","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Lawsuit","SEC"],"authors":["Julia Smith"]}