{"summary":"Binance Faces Regulatory Hurdle in Nigeria: Ordered to Cease Operations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-faces-regulatory-hurdle-nigeria-ordered-cease-operations.htm","publishDate":"2023-06-11T18:00:00","id":20424,"type":null,"title":"Binance Faces Regulatory Hurdle in Nigeria: Ordered to Cease Operations","category":["Altcoin News "],"content":["Binance, the world’s largest cryptocurrency exchange by trading volume, has been ordered to cease operations in Nigeria by the country’s Securities and Exchange Commission (SEC). ","In a recent statement, the regulator declared the operations of Binance “illegal” in the West African nation, stating that the cryptocurrency exchange was neither registered nor regulated by the commission. ","“Any member of the investing public dealing with the entity is doing so at his or her own risk,” the commission warned.","Nigeria’s central bank had previously banned banks and financial institutions from facilitating transactions in digital currencies in 2021. ","However, despite the ban, residents in Africa’s most populous country still make up the largest volume of digital token transactions done on peer-to-peer trading platforms outside of the United States.","In the order, the Nigerian SEC warned investors that investing in crypto-assets is “extremely risky and may result in total loss of investment.” ","The regulator ordered Binance to stop soliciting investments from Nigerians and threatened to take further regulatory action against the platform and other similar exchanges operating in the country.","Last year, Nigeria’s SEC published a set of regulations for digital assets, signalling the country’s attempt to find a middle ground between an outright ban on crypto assets and their unregulated use. ","The regulator had suggested permitting tokenized coin offerings on licensed digital exchanges that are backed by assets such as equity, debt, and property, but not crypto.","The new order from Nigeria’s SEC comes days after the US SEC launched lawsuits against Binance, accusing the firm of illegally operating a securities exchange. ","Earlier this week, the SEC sued Binance and its CEO for their “blatant disregard of the federal securities laws,” unveiling 13 charges against the platform, including operating an unregistered exchange.","The agency accused Binance of breaking the law by offering unregistered securities to the general public, including its BNB token and BUSD stablecoin. ","Other charges levied against Binance by the SEC included the company’s failure to register as a broker as well as its failure to register as an exchange. ","The SEC said Zhao and Binance knew that they were operating the Binance.com platform in violation of various US laws.","Moreover, the agency said Zhao and Binance created BAM Management and BAM Trading in 2019 “as part of an elaborate scheme to evade” US laws, by saying that the Binance.US platform was run independently and that US customers could not use the Binance.com platform. ","Meanwhile, despite the increasing regulatory scrutiny, Binance has not seen large outflows.","In a Saturday tweet, CZ claimed that the platform saw net outflow of about $392 million over the past 24 hours.","“On a sharp price movement day like today, many arbitrage traders move a lot of funds between exchanges, usually exponentially more than on normal days,” he said, noting that the exchange saw $7 billion in withdrawals in one day back in November. ","For reference, we processed $7b net outflow in one day last Nov."," "],"entity":[{"type":"2021","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Zhao","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"$7 billion","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$7b","content":"MONEY"},{"type":"Nigerian SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$392 million","content":"MONEY"},{"type":"Nov","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["Binance","Changpeng Zhao"],"authors":["Ruholamin Haqshanas"]}