{"summary":"Nigeria’s Financial Watchdog Summons Binance CEO Over Crime Concerns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigerias-financial-watchdog-summons-binance-ceo-over-crime-concerns.htm","publishDate":"2024-03-04T17:15:20","id":20430,"type":null,"title":"Nigeria’s Financial Watchdog Summons Binance CEO Over Crime Concerns","category":["Blockchain News "],"content":["New Binance CEO Richard Teng must appear before Nigeria’s House of Representatives Committee on Financial Crimes to answer questions about his company’s lax KYC and AML policies, which may have played a part in terrorism financing and money laundering.","Committee Chairman Ginger Onwusibe issued the ultimatum to Teng during a panel last week, according to local sources. Teng had seven days to appear before the committee, up-to and including today.","Onwusibe further warned Teng that the committee will use its constitutional powers “to take appropriate measures” if the CEO fails to comply.","This isn’t the first time this committee has tried to summon Teng. In a letter dated December 12 2023 and signed by Onwusibe, the committee requested Teng’s attendance at a hearing on December 18, 2023.","Onwusibe said it’s the Committee’s duty “to protect and defend the country’s finances, especially now that the country is nose-diving into recession. The allegations of terrorism financing, money laundering and tax evasion amongst others leveled against Binance are damning enough.”","He added: “You cannot run a company with over 10 million Nigerians on your platform without paying tax and having a physical office where Nigerians can lodge their complaints when they experience any challenge with your service. The era of exploitation is over and all culprits must be held accountable.”","Binance has been in Nigerian lawmakers’ crosshairs for several weeks now as the country makes a focused effort to grapple with the risks and advantages of growing adoption in its territory.","In the second half of February, Nigerian authorities asked telecommunications firms in the country to block access to Binance and Coinbase.","At the time, presidential advisor Mr. Bayo Onanuga attributed the naira’s depreciation to market manipulation by crypto exchanges and urged the Economic and Financial Crimes Commission (EFCC) and the central bank to take actions against them.","However, many Nigerians in the crypto industry believe the responsibility for the naira’s depreciation rests solely with the government.","At the end of February, Nigerian authorities detained two Binance executives and confiscated their passports. Binance retaliated by delisting the naira from its peer-to-peer (p2p) trading service.","Binance now faces a $10 billion fine and ongoing investigations into its alleged money laundering offences."],"entity":[{"type":"Economic and Financial Crimes Commission","content":"ORGANIZATION"},{"type":"Bayo Onanuga","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Committee Chairman Ginger Onwusibe","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"House of Representatives Committee on Financial Crimes","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"December 18, 2023","content":"DATE"},{"type":"December 12 2023","content":"DATE"},{"type":"Onwusibe","content":"PERSON"},{"type":"second half of February","content":"DATE"}],"hashtag":["Binance","Nigeria","richard teng"],"authors":["Tim Hakki"]}