{"summary":"Binance to Opt Out of Ruble Payment Deal with Advcash Amid Russian Exit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-to-opt-out-of-ruble-payment-deal-with-advcash-amid-russian-exit.htm","publishDate":"2023-11-02T06:17:37","id":20435,"type":null,"title":"Binance to Opt Out of Ruble Payment Deal with Advcash Amid Russian Exit","category":["Blockchain News "],"content":["Binance is planning to end its partnership with the payment provider Advcash, putting a stop to the ruble-based transactions, according to the Wall Street Journal. This move is in line with the crypto exchange’s ongoing strategy to exit the Russian market.","Binance’s collaboration with Advcash started in 2019. It allowed Binance customers to deposit and withdraw rubles, facilitating transactions for Russian traders using its service.","Through Advcash, customers could move funds from the sanctioned Russian banks to Binance. Advcash’s site provided links to “independent exchange providers” that could handle transfers from customers’ accounts at Russian banks to the platform. Users could then move funds between their Advcash and Binance accounts.","An Advcash spokesperson mentioned they had not received any updates from Binance regarding ceasing the partnership. Yet, the unfolding scenario mirrors the shift in Binance’s operational strategy in Russia.","In September, Binance announced the sale of its Russian operations to the crypto exchange CommEX. This marked a significant step in Binance’s endeavor to comply with global regulatory standards, particularly amidst the evolving legal landscape governing cryptocurrencies.","Binance’s Chief Compliance Officer, Noah Perlman, emphasized the compliance-centric motive behind the exit. “As we look toward the future, we recognize that operating in Russia is not compatible with Binance’s compliance strategy,” Perlman stated on Sept 27.","This operational realignment demonstrated Binance’s commitment to adhering to regulatory norms. By opting out of the ruble payment partnership with Advcash, Binance is signaling its adherence to a compliance-driven business ethos, a crucial pivot in its broader company strategy in the world."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Perlman","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Noah Perlman","content":"PERSON"}],"hashtag":["Binance","Russia"],"authors":["Hongji Feng"]}