{"summary":"Crypto Exchange Self-Regulation Kicks In as Regulators Start to Kick","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-self-regulation-kicks-in-as-regulators-start-11194.htm","publishDate":"2021-07-26T10:09:34","id":20434,"type":null,"title":"Crypto Exchange Self-Regulation Kicks In as Regulators Start to Kick","category":["Bitcoin News "],"content":["It appears that the crypto industry is increasingly turning to self-regulation as the rope of regulators threatens to tighten firmly around it – and the trend hasn’t missed a major decentralized exchange either.","Major crypto derivatives exchange FTX CEO Sam Bankman-Fried announced that the exchange decided to limit the amount of margin-trading debt traders can wager from 100 times leverage to 20 times.","“An effective margin system is integral to an efficient economic system,” he said, following that up with: “There are limits to everything, though.”","Bankman-Fried went on to say that margin systems must have liquidations as a backup, but with a goal to “do so rarely.” At FTX, he says, “way less than a percent of volume comes from margin calls,” which is in contrast to some platforms that “are sometimes > 5%, and some which removed data because it looked bad.”","Liquidations in the past 24 hours:","Leveraged trading refers to borrowing funds so that you can take a larger position than you would be able to with your existing funds so that you can potentially generate a higher profit. However, while margin trading enables traders to amplify their returns, it can also lead to increased losses and liquidations, which is why experienced traders tend to advise newcomers to stay away from leveraged trading.","The average leverage used on FTX is some 2x. “And while we think that many of the arguments are high leverage miss the mark, we also don’t think it’s an important part of the crypto ecosystem, and in some cases it’s not a healthy part of it.”","Therefore, claims the CEO, removing high leverage (more than 20 times) is a step in the direction the industry has been headed for a while.","“Again, this will hit a tiny fraction of activity on the platform, and while many users have expressed that they like having the option, very few use it. And it’s time, we think, to move on from it,” he added.","The risky trades offered on FTX, Binance, BitMEX and other exchanges are often blamed for accelerating a market downturn in May.","Clara Medalie, the research lead at Kaiko, a cryptocurrency market data provider in Paris, told The New York Times that “these liquidations are obviously a huge factor in the price crash,” and that “it is a vicious cycle.”","The price crash automatically prompted the exchanges to liquidate trading positions of the most highly leveraged investors – before their collateral became insufficient to cover their positions.","The high-leverage offerings on FTX are more of a reputational liability as Bankman-Fried looks to expand FTX’s global reach, said Timothy Massad, the former chairman of the Commodity Futures Trading Commission.","And another exchange is apparently reacting to the recent regulatory developments. Major crypto exchange Binance said that its futures already started limiting new users to maximum 20 times leverage.","Per the CEO Changpeng Zhao, the move was made on July 19, but the team “didn’t want to make this a thingy.”","“In the interest of Consumer Protection, we will apply this to existing users progressively over the next few weeks,” said Zhao.","Having previously offered a maximum of 125 times, an investment of USD 1,000 could be turned into a bet of as much as USD 125,000 on Binance.","All this, and likely more, is coming as the regulatory pressure from around the world, and particularly the US as of late, is increasing on the fast-developing crypto industry. Binance alone, for example, has been facing regulatory issues in a number of countries.","“It’s clear that heavy regulations should be expected. Binance is in the mindset of shifting from a tech startup to a financial service. We are increasing compliance efforts, including ex-regulators,” Zhao said during the virtual summit REDeFiNE TOMORROW 2021.","Today, Binance Margin said it will delist AUD, EUR, and GBP cross and isolated margin pairs in August.","These two centralized exchanges are not the only ones that seem to be doing some pre-emptive regulation.","The software development studio behind major decentralized exchange Uniswap (UNI), Uniswap Labs, has restricted access to a number of tokens on an open-source interface that it supports, app.uniswap.org – “consistent with actions taken by other DeFi interfaces,” they said.","The list includes derivatives and tokenized stocks. The listed coins “have always represented a very small portion of overall volume” on Uniswap, the team argued.","“To continue to innovate and provide this tool for the Uniswap community, we monitor the evolving regulatory landscape,” they said.","Notably, Uniswap is restricting access through its own interface only, adding that “this action has no impact on the Uniswap Interface code, which remains open-source, or the many other portals or locally-run instances used to access the Uniswap Protocol.”","Last Tuesday, the US Securities and Exchange Commission (SEC) Chair Gary Gensler suggested that stock tokens would have to be registered, be they on centralized or decentralized platforms. “If these products are security-based swaps, the other rules I’ve mentioned earlier, such as the trade reporting rules, will apply to them,” he added, noting that the SEC has already brought some cases involving retail offerings of security-based swaps and “unfortunately, there may be more.”","Last week, Binance also announced that stock tokens are already unavailable for purchase on Binance.com, and this platform will no longer support any such tokens as the platform shifts its “commercial focus to other product offerings.”","Meanwhile, some crypto exchanges such as Coinbase, Kraken, and Gemini have already been focusing on compliance more, trying to avoid grey regulatory areas and turning it into their competitive advantage.","“We’re playing the long game,” Gemini’s Cameron Winklevoss recently told Bloomberg. “We’re trying to be the fastest tortoise in the race. The long game pays off over time.”","Gemini’s parent, Gemini Trust Co., also helped create the Virtual Commodity Association the goal of which is to prevent fraud and manipulation, and which is “reminiscent of the self-regulatory groups set up by Wall Street.”","Meanwhile, Coinbase published audited financials and “beefed up” its compliance operations as it listed shares this year, while Kraken got a regulated bank charter in Wyoming as it prepares to go public as well.","“The Catch-22 is that the crypto system was set up to avoid big banks,” John Griffin, a professor of finance at the University of Texas at Austin’s McCombs School of Business was quoted as saying. Griffin added that “rather than having this autonomous universe free of government regulation, we have crypto exchanges playing the role that traditional exchanges and governments play in traditional markets.”\n___\nLearn more:\n– Bitcoin Shows Resilience Amid Global Political Pushback\n– EU Regulation May Harm Small Crypto Players, Stablecoin Users, And Elon Musk","– SEC to Provide Clarity on Token Distribution, Crypto-Based ETPs – Hester Peirce\n– S Korean Regulator to Force Crypto Overseas Exchanges to Abide by its Rules","– BlockFi Fights Regulatory Fire in 3 US States; Reportedly Wants to Go Public\n– European Commission Clarifies What It Means By ‘Anonymous Crypto Wallets’","– SEC Coinschedule Settlement Opens up Old Crypto Securities Wounds\n– Japanese Regulator Report Suggests DeFi Regulations Could Be Coming","– UK Watchdog Set to (Re)Target ‘Misleading’ Crypto Investment Marketing\n– This Is Why Robinhood Doesn’t Allow You to Withdraw Bitcoin, DOGE & Co."],"entity":[{"type":"a percent","content":"PERCENT"},{"type":"Force Crypto Overseas Exchanges","content":"ORGANIZATION"},{"type":"EUR","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Clara Medalie","content":"PERSON"},{"type":"Kaiko","content":"LOCATION"},{"type":"Zhao","content":"PERSON"},{"type":"Withdraw Bitcoin, DOGE & Co","content":"ORGANIZATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"UK Watchdog Set","content":"ORGANIZATION"},{"type":"Virtual Commodity Association","content":"ORGANIZATION"},{"type":"Griffin","content":"PERSON"},{"type":"Timothy Massad","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Token Distribution","content":"ORGANIZATION"},{"type":"Gemini Trust Co.","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Stablecoin Users","content":"ORGANIZATION"},{"type":"John Griffin","content":"PERSON"},{"type":"Crypto Investment Marketing","content":"ORGANIZATION"},{"type":"Uniswap Interface","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"SEC Coinschedule Settlement Opens up Old Crypto Securities Wounds","content":"ORGANIZATION"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Consumer Protection","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"July 19","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"US States","content":"LOCATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Austin’s McCombs School of Business","content":"ORGANIZATION"},{"type":"University of Texas","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Binance Margin","content":"ORGANIZATION"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Bitcoin Shows Resilience Amid Global Political Pushback\n– EU Regulation May Harm Small Crypto Players","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","Bitcoin","Coinbase","Cryptocurrency","Decentralized Exchange","Derivatives","FTX","Gemini","Kraken","Regulation","Trading","Uniswap"],"authors":["Sead Fadilpašić"]}