{"summary":"The outlook for customer funds is grim, particularly given what seems to be misrepresentation of the insurance backing their USD holdings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156065\/despite-voyagers-claims-its-bank-says-fdic-insurance-will-not-protect-customer-usd-deposits-from-firms-bankruptcy","publishDate":"2022-07-06T14:01:29","id":2043,"type":null,"title":"Despite Voyager&#x27;s claims, its bank says FDIC insurance will not protect customer USD deposits from firm&#x27;s bankruptcy","category":["POLICY"],"content":["On Tuesday night, crypto broker Voyager Digital <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy<\/a> in New York.","Early Wednesday morning, the firm released a statement downplaying the bankruptcy, calling it a \"voluntary Chapter 11 process.\"","However, the outlook for customer funds is grim and subject to the complexities -- and potential long duration -- of the bankruptcy process. In its statement, Voyager said that \"customers with crypto in their account(s) will receive in exchange a combination of the crypto in their account(s), proceeds from the 3AC recovery, common shares in the newly reorganized Company, and Voyager tokens.\"","Also of potential worry are the prospects for customers holding US dollars with the firm, given what appears to be a misrepresentation of the insurance backing their USD bank holdings.&nbsp;","While the firm has never held insurance with the Federal Deposit Insurance Corporation (FDIC), in previous marketing materials Voyager Digital, LLC had <a href=\"https:\/\/invest-voyager.medium.com\/usd-held-with-voyager-is-now-fdic-insured-5165343aa554\" data-v-f87c67ca=\"\">touted<\/a> that \"USD held with Voyager is now FDIC insured,\" citing its strategic banking partnerships. The FDIC came about as a reaction to the bank runs of the early Great Depression, to serve as a federal backstop for funds that financial institutions failed to redeem to clients.&nbsp;","Specifically, Voyager had promised in its December 2019 post:&nbsp;","\"That means that in the rare event your USD funds are compromised due to the company or our banking partner’s failure, you are guaranteed a full reimbursement (up to $250,000).\"","However, Voyager's own customer <a href=\"https:\/\/www.investvoyager.com\/useragreement\/\" data-v-f87c67ca=\"\">agreement<\/a> appears to contradict that claim. \"FDIC insurance does not protect against the failure of Voyager or any Custodian (as defined below) or malfeasance by any Voyager or Custodian employee,\" it reads.","Voyager holds customer USD with Metropolitan Commercial Bank. While Metropolitan Commercial Bank is FDIC-insured, it appears that insurance does not kick in the event that Voyager fails.&nbsp;","Wednesday morning, Voyager wrote: \"Customers with USD deposits in their account(s) will receive access to those funds after a reconciliation and fraud prevention process is completed with Metropolitan Commercial Bank.\"","When reached for comment, a representative for Voyager repeated this line and declined further comment. The spokesperson also declined to answer a question about how long that \"reconciliation and fraud prevention process\" will take.&nbsp;","Meanwhile, Metropolitan Commercial Bank has put out its own <a href=\"https:\/\/www.mcbankny.com\/fdic-coverage-available-to-voyager-customers\/\" data-v-f87c67ca=\"\">announcement<\/a> for Voyager customers. The bank identified Voyager's USD holdings as being within a single omnibus account.","And while Voyager said earlier that \"all U.S. regulatory obligations associated with the movement of, and holding of, USD in connection with each Account are the responsibility of the Bank,\" MCB stated that \"Voyager is responsible for maintaining records to determine the ownership and amount of each of its customer’s funds on deposit in the omnibus account.\"","MCB further clarified the limits of FDIC insurance in its statement. Namely, it said that the FDIC is not going to pay out over Voyager's failure:&nbsp;","\"FDIC insurance coverage is available only to protect against the failure of Metropolitan Commercial Bank. FDIC insurance does not protect against the failure of Voyager, any act or omission of Voyager or its employees, or the loss in value of cryptocurrency or other assets.\"","The function of a limited liability corporation is, clearly, to limit liability. A Chapter 11 bankruptcy process exists to disengage from debts. Consequently, Voyager's customers should be wary.&nbsp;","Metropolitan Commercial Bank had not responded to a request for comment as of press time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Voyager","content":"LOCATION"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"Voyager","content":"PERSON"},{"type":"Great Depression","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"MCB","content":"ORGANIZATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Metropolitan Commercial Bank","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Bank","content":"ORGANIZATION"}],"hashtag":["FDIC","TRADFI BANKS"],"authors":["Kollen Post","The Block"]}