{"summary":"Farcaster Parent Company Valued at Over $1 Billion in Paradigm-Led Funding Round","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/farcaster-parent-company-valued-at-over-1-billion-in-paradigm-led-funding-round.htm","publishDate":"2024-03-31T15:00:49","id":20441,"type":null,"title":"Farcaster Parent Company Valued at Over $1 Billion in Paradigm-Led Funding Round","category":["Altcoin News "],"content":["Merkle Manufactory, the company behind the decentralized social network Farcaster, is on the verge of reaching a valuation of $1 billion in its latest funding round.","Leading the funding round is crypto investment firm Paradigm, known for its investments in major cryptocurrency companies like Coinbase, Blur, dYdX, Compound, and Citadel Securities, Bloomberg reported, citing sources familiar with the matter.","Founded in 2020 by former Coinbase executives Dan Romero and Varun Srinivasan, Merkle Manufactory is best known for its flagship social media application called Warpcast.","This application operates on the decentralized network for social media apps known as Farcaster. ","Dan Romero confirmed the ongoing capital raise in a post on March 28.","However, Paradigm has not officially confirmed its participation in the funding round. ","Merkle previously raised $30 million in July 2022 from venture capital firm A16z Crypto.","Farcaster has experienced a significant surge in user activity since January, following the introduction of Frames, a feature that allows apps to run within posts without leaving the platform. ","Frames enable users to perform various actions such as minting nonfungible tokens (NFTs), conducting transactions, accessing external blog posts, and participating in surveys directly within the app. ","As a result, user engagement has skyrocketed. ","According to data from Dune Analytics, the number of daily active users on the Farcaster network surged from around 5,000 on January 28 to over 249,000 on March 30.","Decentralized social media platforms represent a new breed of networks that leverage blockchain technology to offer users ownership over their data, content, and interactions. ","These platforms aim to move away from the centralized control typically associated with traditional social media. ","Key features of decentralized social media platforms include censorship resistance and the ability to monetize content without intermediaries. ","Other popular platforms in this sector include Friend.tech, Minds, and Mastodon.","However, industry executives note that user retention remains one of the greatest challenges for decentralized social media platforms.","Romero does not view his decentralized social app as a competitor to Elon Musk’s Twitter, which is now called X.","“I don’t think anything is working as a Twitter alternative,” he said in a recent interview. ","Romero emphasized that attempting to replicate Twitter’s model would not lead to success, citing the example of Meta (formerly Facebook).","Despite Meta’s vast resources and distribution, their Threads feature has failed to make a significant dent in Twitter’s dominance.","Romero believes that public square conversations, in a format similar to Twitter, still predominantly occur on Twitter.","You’re hiding an entirely new developer paradigm underneath that Twitter clone of yours, are you not? pic.twitter.com\/4KY5pyx9Oe","— Dan Romero (@dwr) February 8, 2024","","Farcaster has grand ambitions, seeking to reach a billion daily active users—an ambitious goal considering the platform currently boasts over 160,000 signups, according to data from Dune.","Romero firmly believes that achieving such widespread adoption requires a fundamental reimagining of the social media paradigm.","“What we are doing with Farcaster is trying to build something new and different,” emphasizing their focus on cultivating the largest community of developers."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"Varun Srinivasan","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"February 8, 2024","content":"DATE"},{"type":"A16z Crypto","content":"ORGANIZATION"},{"type":"January 28","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Merkle Manufactory","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"March 30","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Mastodon","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Merkle Manufactory","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Dan Romero","content":"PERSON"},{"type":"July 2022","content":"DATE"}],"hashtag":["farcaster","Twitter"],"authors":["Ruholamin Haqshanas"]}