{"summary":"Russia FATF Rating Downgraded Due to ‘Insufficient Crypto Regulation’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russia-fatf-rating-downgraded-due-to-insufficient-crypto-regulation.htm","publishDate":"2024-02-29T23:30:40","id":20440,"type":null,"title":"Russia FATF Rating Downgraded Due to ‘Insufficient Crypto Regulation’","category":["Blockchain News "],"content":["The Financial Action Task Force (FATF) has downgraded Russia’s compliance rating due to its “insufficient regulation of virtual assets and cryptocurrencies.”","Vedomosti reported that German Neglyad, the Deputy Head of the domestic anti-money-laundering regulator Rosfinmonitoring, said the Russia FATF rating was confirmed at a plenary meeting on February 23.","Neglyad said that the Eurasian Group on Combating Money Laundering and the Financing of Terrorism (EAG) conducted an analysis that resulted in the downgrading.","The EAG is a FATF affiliate, and its assessments were approved by the international body, Neglyad added.","The bodies also created a report on the technical compliance of the country’s anti-money laundering system.","The latest Russia FATF news will come as a blow to Moscow. The nation passed a full FATF audit in 2019, where its compliance level was awarded the body’s highest ranking.","The FATF has a compliance standard for “monitoring and countering suspicious transactions with virtual assets and cryptocurrency.”","The latest report notes that Russia’s rating was lowered from a rating of “compliant” to “partially compliant.”","Neglyad concurred that there was a need to respond to the downgrading. He admitted that Russia’s crypto regulations needed attention. Neglyad said:","“The extent to which Russia complies with the […] recommendations has been assessed. Russia’s rating was downgraded to [its] partial compliance. That indicates a remaining weakness in this area. First of all, there is a need to regulate the circulation of cryptocurrency.”","The Rosfinmonitoring chief added that Moscow needs to police the “activities of cryptocurrency exchanges.”","He added that the government needs to move in line with domestic “financial organizations.”","The FATF report noted that Russia “has taken some steps” to address crypto regulation, but noted that these were insufficient.","This is likely a reference to a piece of legislation introduced in mid-2020 entitled “On Digital Financial Assets.”","Russian crypto industry experts at the time told Cryptonews.com that the law was, in effect, little more than a glorified “glossary” of crypto-related terms.","The law banned the use of crypto as a form of payment in Russia, but included no further regulatory measures. All subsequent attempts to regulate the industry have failed.","This is largely due to an impasse between the Central Bank and major government ministries.","The US and UK have held high-level conversations over security risks that may be triggered if the two countries hold elections around the same time later this year https:\/\/t.co\/rUKTs9AIzl","— Bloomberg (@business) February 28, 2024","","The ministries want to “legalize” the resurgent domestic crypto sector and bring it into the tax system. In particular, they hope to tax Russia’s burgeoning crypto mining sector.","However, the Central Bank would prefer to ban crypto altogether. The bank would prefer to press ahead with its fast-tracked digital ruble project.","The issue has been muddied somewhat by the fact that many Russian firms have begun using crypto as a cross-border payment tool to circumvent US, UK, and EU-led sanctions.","According to Rosfinmonitoring data, the number of transactions conducted in Russia using crypto tripled from the beginning of last year to November 2023.","The agency head, Yuri Chikhanchin, previously urged lawmakers to decide how they want to regulate the sector “as quickly as possible.”"],"entity":[{"type":"Digital Financial Assets","content":"ORGANIZATION"},{"type":"Eurasian Group on Combating Money Laundering","content":"ORGANIZATION"},{"type":"Russia FATF","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"February 23","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"last year to November 2023","content":"DATE"},{"type":"FATF","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Yuri Chikhanchin","content":"PERSON"},{"type":"EAG","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Financial Action Task Force (FATF","content":"ORGANIZATION"},{"type":"February 28, 2024","content":"DATE"}],"hashtag":["Financial Action Task Force","Russia"],"authors":["Tim Alper"]}