{"summary":"&quot;The community is poised to redefine sports viewership and experiences through the metaverse,&quot; Deloitte said in a statement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215731\/deloitte-sinclair-broadcast-launching-new-sports-metaverse-experience","publishDate":"2023-02-28T09:23:54","id":2044,"type":null,"title":"Deloitte, Sinclair Broadcast launching new sports metaverse experience","category":["COMPANIES"],"content":["Deloitte and Sinclair Broadcast Group said they'll be launching a new metaverse sports fan community experience leveraging Epic Games' Unreal Engine to \"enhance the ways in which fans and audiences can build connections and engage with the content they love.\"","\"The community is poised to redefine sports viewership and experiences through the metaverse,\" Deloitte said in a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/sinclair-broadcast-group-teams-with-deloitte-to-launch-new-virtual-community-in-the-metaverse-301757942.html\" data-v-f87c67ca=\"\">statement<\/a>. \"Sinclair's sports community goes beyond game time, providing a metaverse experience to engage fans during post-season, pre-game, post-game and eventually, during the game.\"","The experience, which launches the week of <span class=\"xn-chron\" data-v-f87c67ca=\"\">March 6, <\/span>was built by Deloitte's Unlimited Reality practice, which brings together 3D computing, artificial intelligence, web3, immersive experiences and advanced connectivity to help clients create business value.","The community makes use of Epic's Unreal Engine, a 3D creation tool that robust experiences to life in real time.","According to Deloitte's recently published \"<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3795690-1&amp;h=1914437043&amp;u=https%3A%2F%2Fwww2.deloitte.com%2Fus%2Fen%2Fpages%2Ftechnology-media-and-telecommunications%2Farticles%2Fsports-business-trends-disruption.html&amp;a=2023+Sports+Industry+Outlook\" target=\"_blank\" rel=\"nofollow noopener\" data-v-f87c67ca=\"\">2023 Sports Industry Outlook<\/a>,\" this year could see advancement in the sports NFT market.","\"Simple digital collectibles, originally seen as curiosities, are becoming advanced digital assets that can be used to improve fan engagement and loyalty and create new business models and even more new revenue streams,\" Deloitte wrote, noting some barriers involving a continued lack of understanding about NFTs and broader concerns about market immaturity and sustainability.&nbsp;","\"Sports organizations and their technology partners should consider making it as easy as possible for the average fan to set up a wallet and purchase digital assets,\" Deloitte continued. \"These challenges will likely have to be addressed if sports organizations want new revenue sources, better fan engagement, and more knowledge of their audience.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sinclair","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Unreal Engine","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"March 6","content":"DATE"},{"type":"Sinclair Broadcast Group","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}