{"summary":"Stars Arena Crypto Social Platform Faces Internal Challenges as Another Team Member Resigns – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/stars-arena-crypto-social-platform-faces-internal-challenges-as-another-team-member-resigns-whats-going-on.htm","publishDate":"2023-10-31T11:20:38","id":20447,"type":null,"title":"Stars Arena Crypto Social Platform Faces Internal Challenges as Another Team Member Resigns – What’s Going On?","category":["Altcoin News "],"content":["Another team member has said goodbye to the Avalanche-based social finance platform Stars Arena. And the situation is only heating up, with criticism and accusations filling the comments sections.","According to a tweet posted on Monday evening (UTC time), “as of today, KookCapitalLLC has been relieved of his duties as a Stars Arena team member.”","Yesterday, Kook tweeted that “with a heavy heart i must announce my resignation from” Stars Arena, and that, despite the goal to support the founder hannesxda, aka ‘theBuilder’, “I have had serious issues with management and direction for some time.”","And Starts Arena may not be done. They stated that,","“We are continuing with the transition to a new team without the presence of any former member.”","Commenters have been generally expressing confusion and criticism regarding the recent news coming from the project, asking for clarification on what is happening.","Some participants have suggested that there may be a rug pull incoming.","I checked the @starsarenacom multsig this morning and was shocked.@iamchillpill and the remaining team removed myself and @KookCapitalLLC as signers.","– Right now the quorum is 4\/4.\n– Chill has 2x signatures.","Not only is this gross negligence around the management of funds… pic.twitter.com\/T1H1E5NtXW","— boot ♻️ (@lowercaseboot) October 31, 2023","","And many of the accusations, including those from Kook, mentioned member Chill Pill:","Chill Pill has removed myself and @lowercaseboot from the @starsarenacom multisig","The multisig is now controlled by THREE people","FOUR SIGNATURES","………","TWO ARE @iamchillpill","watch the money","— kook 🌊 (@KookCapitalLLC) October 31, 2023","","In the resignation tweet, Kook wished the project “the best of luck,” but this seems to have changed since.","Kook has posted multiple tweets suggesting that some sort of an exposé may be coming, which would air the team’s dirty laundry in public.","everything on my X is fiction, larp, and performance art","jokes only all made up","— kook 🌊 (@KookCapitalLLC) October 31, 2023","","As for Chill Pill, it was announced on October 29 that he stepped down from his role as CEO.","“We will continue to take significant steps towards rebuilding trust with our community,” Stars Arena said at the time.","","On October 27, the project issued a statement saying that it failed in “making sure the pace of development matched expectations.”","To rectify the situation, Star Arena transitioned to “a legal entity,” which it said allowed the project to expand the in-house tech team following the exploit.","TheBuilder (hannesxda) has been “fully reintegrated” into the tech operations.","This post, too, received criticism, with some users claiming that the update had been done without any prior communication.","On October 31, theBuilder issued a lengthy statement “on recent events,” saying that,","“The truth is, we couldn’t function as a team. Which I’m very sorry. Now there is a fight and some false allegations, which is even worse.”","Also on October 27, Star Arena announced “real steps” towards funding, stating that it partnered with Avalaunch, a protocol for the Avalanche ecosystem, “to steward us through our funding round.”","Then, on October 30, Avalaunch tweeted that “there was not more than an informal partnership between the two teams,” and that they’ve ended it, stating:","“Unfortunately, it has become more and more clear that there is too much happening around the project that we either aren’t comfortable with or simply don’t understand.”","As reported, Stars Arena suffered an exploit on October 7 that saw nearly $2.9 million worth of AVAX stolen. The team recovered 90% of user assets, while the hacker was offered a 10% bounty. It has been relaunched on October 15."],"entity":[{"type":"October 31, 2023","content":"DATE"},{"type":"October 27","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"October 29","content":"DATE"},{"type":"Star Arena","content":"ORGANIZATION"},{"type":"October 30","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"October 31","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"UTC","content":"ORGANIZATION"},{"type":"October 7","content":"DATE"},{"type":"Chill Pill","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"October 15","content":"DATE"},{"type":"Avalaunch","content":"PERSON"},{"type":"$2.9 million","content":"MONEY"},{"type":"multsig this morning","content":"TIME"},{"type":"Monday","content":"DATE"},{"type":"” Stars Arena","content":"ORGANIZATION"},{"type":"Stars Arena","content":"ORGANIZATION"}],"hashtag":["Avalanche","Career","Community","Hack"],"authors":["Sead Fadilpašić"]}