{"summary":"Bitcoin Mining Stocks Plummet as Miners Face Reduced Revenue Post Halving","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-mining-stocks-plummet-ahead-of-halving.htm","publishDate":"2024-04-17T07:22:22","id":20453,"type":null,"title":"Bitcoin Mining Stocks Plummet as Miners Face Reduced Revenue Post Halving","category":["Bitcoin News "],"content":["Bitcoin mining companies are experiencing a significant decline in their stock prices as they face reduced revenue due to an upcoming code update for the largest cryptocurrency. ","Companies such as Marathon Digital Holdings Inc., Riot Blockchain Inc., and CleanSpark Inc. have seen their stock prices fall for three consecutive days. ","The Valkyrie Bitcoin Miners exchange-traded fund has also suffered a decline of approximately 28% this month.","The downward trend in Bitcoin mining stocks is further compounded by the accumulation of short interest in crypto-mining stocks and recent geopolitical tensions. ","Iran’s retaliatory attack against Israel over the weekend has prompted a shift to a risk-off environment for investors. ","However, despite these challenges, the CEOs of these mining companies remain optimistic about the future, highlighting low-cost operations, more efficient equipment, and growing demand for cryptocurrencies as factors that can offset the anticipated revenue losses resulting from the upcoming software update.","Jason Les, CEO of Riot Blockchain, expressed his confidence in the long-term prospects of Bitcoin.","“Riot is here for the long term… Our long-term investment thesis on Bitcoin is strong, and I think we have the setup for a very positive movement in Bitcoin over the next several months here,” he said in a recent Bloomberg Television interview.","Bitcoin mining is an energy-intensive process that involves using specialized computers to validate transactions on the blockchain and earn rewards in the form of tokens. ","The majority of mining revenue comes from these rewards, which are halved every four years in an event called the halving. ","The upcoming halving, the fourth since 2012, will reduce the daily production of Bitcoin rewards from 900 tokens to 450.","Miners are hopeful that increased demand from new spot exchange-traded funds (ETFs) will help mitigate the negative impact of the halving by driving Bitcoin prices higher. ","Since the launch of these ETFs by traditional asset management firms in January, the digital asset has experienced substantial growth and attracted billions of dollars from a wider range of investors beyond the cryptocurrency community.","“I think it is very hard to predict Bitcoin prices on any kind of short-term time frame,” Tyler Page, CEO of Cipher Mining, said. ","“But over the course of years, I think you have seen a steady course of adoption… We can remain very, very bullish on the adoption of the network.”","As reported, Kris Marszalek, CEO of Crypto.com, Kris Marszalek, has acknowledged the possibility of selling pressure in the near term due to the “buy-the-rumor, sell-the-news” trading phenomenon.","However, he emphasized that the halving will have a significant positive impact on the market in the long run. ","“Over a longer period, the halving will make a substantial difference and is a positive development for the market.”","Last week, Marathon CEO Fred Thiel said Bitcoin’s highly anticipated “halving” event may already be partially factored into the market. "," "],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"Cipher Mining","content":"ORGANIZATION"},{"type":"CleanSpark Inc.","content":"ORGANIZATION"},{"type":"Bloomberg Television","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Jason Les","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Riot Blockchain Inc.","content":"ORGANIZATION"},{"type":"Marathon Digital Holdings Inc.","content":"ORGANIZATION"},{"type":"Valkyrie Bitcoin Miners","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"Israel","content":"LOCATION"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin halving","Bitcoin Mining"],"authors":["Ruholamin Haqshanas"]}