{"summary":"One in Seven Wealthy People Now Owns ‘Digital Assets’ – Survey","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/one-in-seven-wealthy-people-now-owns-digital-assets-survey.htm","publishDate":"2022-06-15T20:00:00","id":20450,"type":null,"title":"One in Seven Wealthy People Now Owns ‘Digital Assets’ – Survey","category":["Bitcoin News "],"content":[" ","A new report has found that global high-rollers are spending more money than ever on crypto, which has become “an essential part” of rich individuals’ investment portfolios.","The claim was made in a wealth management study from Capgemini, a Paris, France-based IT services and consulting company. The firm stated that the number of High Net Worth Individuals (HNWIs) grew by 7.8% in 2021, with 1.7 million individuals around the world joining the category. ","“Wealth,” the firm added, “swelled by 8%” to the tune of USD 6.4 trillion last year.","As part of its research, Capgemini explained that it had spoken to “2,973 HNWIs across 24 major wealth markets in North America, Latin America, Europe, and Asia-Pacific” about their investment behavior and their level of “preference for emerging asset classes such as digital assets.”","The company concluded that “digital asset investments” were “becoming an essential part of HNWI portfolios” – and noted that 71% of respondents said they had already bought “digital assets.”","For HNWIs aged under 40, however, the number was 91%.","“Furthermore,” the report’s authors added, younger HNWIs said that “cryptocurrencies are their favorite digital asset investment.”","The same group stated that exchange-traded funds (ETFs) and metaverse-related investments were also of interest.","The French company noted that the popularity of crypto and blockchain technology-related assets would likely pique the attention of wealth management firms, explaining:","“As the adoption of digital assets (cryptocurrencies, ETFs, NFTs, metaverse-related products, and digital currencies) grows, [wealth management] firms will need capabilities around products and education. In addition, ecosystem partnerships will be necessary to create a diversified portfolio of digital offerings.”","The report’s authors also added that the rise of “digital asset classes” had “increased the demand for educational capabilities” for HNWIs to “learn and make more informed decisions.” ","The authors quoted Joseph Gribb, the Principal and Head of Advice IT at the American investment advisor Vanguard, as stating:","“As demand for emerging asset classes rises, firms must offer investment advice based on customer risk tolerance and provide distinctive experiences across various channels based on customer preferences.”","Capgemini explained that 30% of the HNWIs it spoke to had accrued their fortune from the IT sector, and belonged to what they called the “tech-wealth” demographic.","____","Learn more: \n– 13% of Surveyed Canadians Owned Bitcoin in 2021, Up from 5% in 2020 – Bank of Canada\n– About 50% of Surveyed Crypto Owners Made Their First Buy in 2021 – Gemini\n\n– Accenture Sees Strong Demand for Digital Assets Among Asian Investors, but Hesitancy Among Advisory Firms\n– Just 18% of Respondents Do Not Expect Bitcoin to Become Legal Tender in 3 Years – Survey\n\n– 40% of Surveyed Lower-income Individuals Want to Use Bitcoin – Not to Make Money\n– 7 in 10 Retail and Institutional Investors Plan to Buy More Crypto, Bitstamp Survey Finds"],"entity":[{"type":"Hesitancy Among Advisory Firms","content":"ORGANIZATION"},{"type":"7.8%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"Capgemini","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"Bitstamp Survey Finds","content":"ORGANIZATION"},{"type":"Pacific","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"– Bank of Canada\n– About","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"91%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"Latin America","content":"LOCATION"},{"type":"71%","content":"PERCENT"},{"type":"18%","content":"PERCENT"},{"type":"Joseph Gribb","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":["Adoption","Asia","Europe","Investing","Latin America","Survey"],"authors":["Tim Alper"]}