{"summary":"ARK Invest Spearheads Bitcoin ETF Amendment Rush Ahead of SEC Deadline","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ark-invest-spearheads-bitcoin-etf-amendment-rush-ahead-of-sec-deadline.htm","publishDate":"2023-12-29T18:53:18","id":20457,"type":null,"title":"ARK Invest Spearheads Bitcoin ETF Amendment Rush Ahead of SEC Deadline","category":["Bitcoin News "],"content":["ARK Invest has taken the lead in filing the final Form S-1 amendment for its proposed spot Bitcoin exchange-traded fund (ETF) ahead of a deadline set by the US Securities and Exchange Commission (SEC).","The SEC allegedly set a deadline of December 29, 2023, for ETF applicants to file their final S-1 amendments to be considered in what Bloomberg analyst Eric Balchunas has called “the crucial first tranche of the race.”","Officials from the SEC reportedly met with representatives from at least seven firms on December 21, emphasizing the importance of meeting the specified deadline. ARK Invest responded promptly by filing an amendment to the S-1 registration statement for its Ark 21Shares Bitcoin ETF on December 28.","According to Bloomberg’s Balchunas, ARK Invest’s amendment was focused on so-called authorized participants, or Aps for short.","ARK kicks off the S-1 Amendment-athon. Ahead of the pack as usual. Unclear yet what was changed tho, AP mentioned a ton but not named. Assuming that will prob come in the very final effective update just prior to launch. But we still don't know if they have signed agreement. https:\/\/t.co\/mcNgpoR451","— Eric Balchunas (@EricBalchunas) December 28, 2023","","The move follows a revision by Ark on December 19, aligning its application with changes to cash creations and redemptions for shares in the fund—a modification that mirrored other issuers adapting to cash creations.","As more than a dozen firms compete for approval of a spot Bitcoin ETF, the rush to submit amended S-1 filings is expected to continue, with Balchunas saying in a recent X post that there is a “mad scramble behind scenes to get signed AP agreements.”","New one from me today on how just making it to the starting gate is half the battle for ETF issuers in the Cointucky Derby, it's the race before the race, currently a mad scramble behind scenes to get signed AP agreements, a critical but not easy last step. pic.twitter.com\/IF58KQthcV","— Eric Balchunas (@EricBalchunas) December 27, 2023","","The ETF Store, Inc. president Nate Geraci also weighed in on the developments on X, calling the ETF “the bridge” that will force traditional finance investors and crypto fans to learn about each other.","“Crypto isn’t going away,” he added.","Know some of you are fatigued w\/ my endless bitcoin ETF tweets (which I get)…","But I love the fact that this saga is forcing more tradfi investors to learn about crypto & more crypto investors to learn about ETF wrapper.","That is “The Bridge”.","Crypto isn’t going away.","— Nate Geraci (@NateGeraci) December 28, 2023","",""],"entity":[{"type":"December 21","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"December 27, 2023","content":"DATE"},{"type":"Bloomberg’s Balchunas","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"December 29, 2023","content":"DATE"},{"type":"Nate Geraci","content":"PERSON"},{"type":"ETF Store, Inc.","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"December 28, 2023","content":"DATE"},{"type":"Cointucky Derby","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"December 28","content":"DATE"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"December 19","content":"DATE"}],"hashtag":["ARK Invest","Bitcoin ETF","ETF"],"authors":["Fredrik Vold"]}