{"summary":"The Bank for International Settlements has launched an initiative calling for sustainable finance solutions that use blockchain and AI.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250105\/bis-blockchain-sustainable-finance-solutions","publishDate":"2023-09-11T07:51:18","id":2045,"type":null,"title":"BIS calls for blockchain-based sustainable finance solutions","category":["INTERNATIONAL POLICYMAKING"],"content":["The Bank for International Settlements has launched an initiative calling for sustainable finance solutions that use blockchain, artificial intelligence and the Internet of Things.","The initiative is spearheaded by the United Arab Emirates' COP28 presidency. It is&nbsp;being developed by the BIS in partnership with the Central Bank of the UAE and the Emirates Institute of Finance.","The COP28 UAE TechSprint <a href=\"https:\/\/www.bis.org\/press\/p230907.htm\" data-v-f87c67ca=\"\">challenges<\/a> developer teams to find solutions that address data verification gaps in sustainable finance.","BIS General Manager Agustín Carstens announced the start of TechSprint by stating: \"Combating climate change is more urgent than ever and it calls for a profound change in the way economies operate and grow.\"","\"To finance the needed transformation, investors need certainty that their funds are channeled to their intended uses. Technologies that promote the timely measurement and disclosure of climate-related information are part of the solution,\" he further elaborated.","The initiative outlines three critical problem statements that it aims to address.","First, it advocates for applying AI to strengthen reporting, verification and disclosure mechanisms in the financial services industry. Second, it underscores the potential of blockchain technology for auditing and enhancing transparency, traceability and accountability in sustainable finance. Lastly, it encourages the integration of the Internet of Things and sensor technology into sustainable finance to ensure informed assessments of impact, risk or compliance.","COP28 President Designate Dr. Sultan Al Jaber affirmed this vision in a statement, saying: \"Tackling climate change requires available, accessible and affordable finance, and by introducing advanced technological solutions that support the development of sustainable finance standards and instruments, we can help to foster investor confidence and better ensure that capital reaches those who require it the most.\"","Open to developers from around the globe, the initiative has <a href=\"https:\/\/hackolosseum.apixplatform.com\/h1\/cop28uaetechsprint#preview\" data-v-f87c67ca=\"\">set a proposal submission deadline<\/a> of October 6. The winners of the TechSprint will be announced on Dec. 4 during an event at COP28 UAE. The UAE is set to host COP28 from Nov. 30 to Dec. 12, at Expo City Dubai.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Expo City Dubai","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Emirates Institute of Finance","content":"ORGANIZATION"},{"type":"Agustín Carstens","content":"PERSON"},{"type":"October 6","content":"DATE"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Dec. 12","content":"DATE"},{"type":"Central Bank of the UAE","content":"ORGANIZATION"},{"type":"Dec. 4","content":"DATE"},{"type":"Sultan Al Jaber","content":"PERSON"},{"type":"Nov. 30","content":"DATE"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}