{"summary":"Tether Partners With Chainalysis to Monitor Transactions and Combat Illicit Activity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-partners-with-chainalysis-to-monitor-transactions.htm","publishDate":"2024-05-03T04:14:35","id":20451,"type":null,"title":"Tether Partners With Chainalysis to Monitor Transactions and Combat Illicit Activity","category":["Altcoin News "],"content":["Tether, the issuer of the world’s largest stablecoin, said it has teamed up with the blockchain data platform Chainalysis to monitor secondary market activity and combat illicit activity.","In an announcement, Tether which issues the cryptocurrency “USDT” pegged to the U.S. dollar, said it is launching new monitoring and analysis tools with Chainalysis. The tools will have the ability to identify wallets that may pose risks or may be associated with illicit or sanctioned addresses.","“Tether’s proactive commitment to monitoring the secondary market for USDT – the world’s most popular cryptocurrency – has the potential to transform the entire ecosystem and make it a safer place to transact,” said Jonathan Levin, co-founder and chief strategy officer, of Chainalysis, in the blog post.","Tether Enhances Compliance Measures with Chainalysis Ecosystem Monitoring Solution. Tether has collaborated with @chainalysis, the blockchain data platform to develop a customizable solution for monitoring secondary market activity.","Read Morehttps:\/\/t.co\/8r5NwJmL5q","— Tether (@Tether_to) May 2, 2024","","Tether goes on to explain that “secondary market activity” refers to transactions conducted within the broader ecosystem using USDT  beyond the limited entities that directly buy and sell USDT from Tether.","The new tools have been formed by  Chainalysis and will allow Tether to “methodically monitor transactions” giving the firm oversight of the USDT market. The tools will be used by Tether compliance professionals and investigators by allowing them to identify wallets that may pose risks or may be associated with illicit or sanctioned addresses, said Tether.","Earlier this week, Tether reported a record net profit of $4.52 billion in the first quarter of 2024, marking a significant achievement for the company. The substantial profit was primarily attributed to the firm’s financial gains on Bitcoin and gold, totalling $3.52 billion, and an additional $1 billion from operating profits.","In December, American credit ratings firm S&P Global Inc. said it had started assessing the ability of Tether to maintain its peg to the U.S. dollar marking it at a ‘constrained’ rating of 4. The risk assessment is between 1 to 5 – with 5 being ranked weak. Tether has been scored weak due to the lack of information disclosed.","Stablecoins are a cryptocurrency whose value is usually pegged to a fiat currency or commodity. Tether has been under scrutiny for years – the stablecoin was issued in 2014 and is the longest-standing stablecoin with the largest volume in circulation. Its price has remained relatively stable in recent years and particularly over the past 12 months, noted the S&P."],"entity":[{"type":"2014","content":"DATE"},{"type":"May 2, 2024","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"first quarter of 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Chainalysis","content":"LOCATION"},{"type":"$3.52 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$4.52 billion","content":"MONEY"},{"type":"Jonathan Levin","content":"PERSON"},{"type":"Chainalysis Ecosystem Monitoring Solution","content":"ORGANIZATION"},{"type":"S&P Global Inc.","content":"ORGANIZATION"}],"hashtag":["Chainalysis","Tether","Tether USDT"],"authors":["Tanzeel Akhtar"]}