{"summary":"Here’s What Agents Say They Photographed in ‘Bitfinex Hack’ Couple’s Apartment","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/heres-what-agents-say-they-found-bitfinex-hack-couples-apartment.htm","publishDate":"2022-02-11T10:28:00","id":20466,"type":null,"title":"Here’s What Agents Say They Photographed in ‘Bitfinex Hack’ Couple’s Apartment","category":["Bitcoin News "],"content":[" ","The mysterious case of the duo charged with attempting to launder a vast bitcoin (BTC) haul allegedly looted from the Bitfinex crypto exchange in a hack in 2016 just got a lot more bizarre – with the Attorney’s Office for the District of Columbia issuing a 34-page legal document detailing why the couple should not be granted bail.","The case centers around a BTC 119,754 cache and a couple named Heather Morgan (31) and Ilya “Dutch” Lichtenstein (34). The latter is a tech investor. And the former is the CEO of a copywriting firm named SalesFolk and a writer for publications including Inc. and Forbes – as well as a musician who goes by the moniker Razzlekhan (here she is apparently professing her love to her husband in musical form).","\nIn the Attorney’s document, lawyers explained how law enforcement officials traced funds to a crypto wallet under Lichtenstein’s name. Officers stated they had seized USD 3.6bn worth of tokens – making for the biggest financial seizure in American history.","They also stated they had found accounts linked to the funds that were controlled by both Morgan and her husband. And there were yet more unusual findings at the couple’s apartment on Wall Street, Manhattan.","The officers’ strange search began thusly, per the document:","“Agents permitted Morgan to retrieve the defendants’ cat, which was hiding under the bed. While Morgan was crouched next to the bed calling to the cat, she positioned herself next to the nightstand, which was still holding one of her phones. She then reached up and grabbed her cell phone from the nightstand and repeatedly hit the lock button. It appeared that Morgan was attempting to lock the phone in a way that would make it more difficult for law enforcement to search the phone’s contents.”","The police then were forced “to wrest the phone from her hands.”","Under the bed, however, officers found “a bin containing various bags holding multiple cell phones, SIM cards and assorted electronics” – as well as a bag labeled “Burner Phone.”","They then went on to find over USD 40,000 worth of cash and “what appears to be a substantial amount of foreign currency.”","The law enforcement found other items including a bag full of mobile phones, multiple hardware wallets and hollowed-out books."," ","The duo had applied for bail, claiming in their own filing that Morgan had previously suffered from MERS-related lung damage, so would be placed in danger should she be jailed – where the risk of COVID-19 infection would be high. They added that she had also recently undergone surgery and that the government’s “complaint is especially flimsy as to Ms. Morgan.”","As evidence that they posed no flight risk, their lawyers explained:","“[Morgan and Lichtenstein] previously froze several of her embryos at a hospital in New York in anticipation of starting a family together, as she can only conceive through in vitro fertilization because she suffers from endometriosis. The couple would never flee from the country at the risk of losing access to their ability to have children, which they were discussing having this year until their lives were disrupted by their arrests in this case.”","But the FBI appears to have refuted these claims, noting that a “review of Lichtenstein and Morgan’s devices” was “ongoing, and adding that officers expected to uncover “additional wallets” within “encrypted partitions and other secured folders.”\n\nFurthermore, officers said they found Lichtenstein’s Russian passport (he has dual nationality as his family is from Russia), noting:","“Russia does not extradite its own citizens. If Lichtenstein succeeded in fleeing to Russia, he could escape prosecution in the United States indefinitely. Morgan’s marriage to Lichtenstein would allow her to qualify for Russian citizenship.” ","Additionally, the officers reported that when the couple was arrested, “they had a brief conversation with each other in Russian.”","And the FBI claimed that just because they had not attempted to flee the country when officers first began moving against them earlier this month was not proof they would not seek to leave the country if released on bail, noting that “their failure to [escape when they had the chance] is not indicative of their future risk of flight.”","While many media outlets have focused on the duo’s somewhat unorthodox lifestyle and behavior, others claimed they’re clearly cut from a different cloth from the average criminal.","Eric Wall, the CIO of Arcane Assets, claimed that Morgan’s musical activities were likely signs of her “intelligence.”","Wall’s observations may well be true, but some may feel that even this doesn’t make any of these musical monstrosities any more listenable.","____","Learn more:\n– Bitfinex Hack: Meet the Self-Proclaimed ‘Serial Entrepreneur’ Couple Charged Over Laundering Bitcoin\n– US Government Is Now Top Bitcoin Whale. What Could Happen Next?\n\n– Crypto Security in 2022: Prepare for More DeFi Hacks, Exchange Outages, and Noob Mistakes \n– CFTC Fines Tether For Lying & Bitfinex For ‘Illegal’ Transactions\n\n– North Korea Still Hacking Crypto Exchanges to Fund Its Weapons Program, Says UN\n– The 4th Largest Crypto Theft Shows DeFi Weakness as Hacker Nets USD 325M in a Wormhole",""],"entity":[{"type":"2016","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"4th Largest Crypto Theft Shows DeFi Weakness as Hacker Nets USD","content":"ORGANIZATION"},{"type":"Crypto Security","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"CFTC Fines Tether For Lying & Bitfinex For ‘Illegal","content":"ORGANIZATION"},{"type":"Wormhole","content":"LOCATION"},{"type":"Eric Wall","content":"PERSON"},{"type":"Heather Morgan","content":"PERSON"},{"type":"Ilya “Dutch” Lichtenstein","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"Exchange Outages","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"the District of Columbia","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Morgan","content":"ORGANIZATION"},{"type":"Morgan","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"19","content":"DATE"},{"type":"Inc.","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Attorney’s Office","content":"ORGANIZATION"},{"type":"Lichtenstein","content":"PERSON"},{"type":"SIM","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Bitfinex","Hack","Legal","USA"],"authors":["Tim Alper"]}