{"summary":"Dapper Labs CEO Roham Gharegozlou&#x27;s spending on luxury travel and courting of celebrities while “bullying” and “public shaming” his employees is said to have stoked a toxic company culture at the NFT startup he co-founded. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215888\/nba-top-shot-ceos-decadent-lifestyle-public-shaming-led-to-toxic-culture-as-dapper-flails","publishDate":"2023-03-01T11:10:36","id":2046,"type":null,"title":"NBA Top Shot CEO’s decadent lifestyle, ‘public shaming’ led to toxic culture as Dapper flails","category":["METAVERSE & NFT"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Last May, Grammy award-winning DJ Diplo grabbed headlines after a video showed him struggling to pass security and get into a yacht party held during the Cannes Film Festival. Although meant to perform at the private event, Diplo's name wasn't on the guest list.<\/span><br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Luckily the owner was walking by and let me in,” Diplo said in an Instagram <\/span><a href=\"https:\/\/www.instagram.com\/p\/CeMHnqAF8hO\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">post<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">. <\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<br data-v-f87c67ca=\"\">\n<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">That “owner” was Roham<\/span> <span data-contrast=\"none\" data-v-f87c67ca=\"\">Gharegozlou, CEO and co-founder of Dapper Labs. He rose to prominence along with the once wildly popular NFT collection his company created, NBA Top Shot. Gharegozlou forged partnerships with <a href=\"https:\/\/www.dapperlabs.com\/newsroom\/coatue-michael-jordan-kevin-durant-a16z-and-more-than-30-other-nba-and-nfl-players-and-vcs-invest-305-million-in-dapper-labs-makers-of-nba-top-shot-and-flow-blockchain\" data-v-f87c67ca=\"\">an impressive list of stars<\/a> like Michael Jordan, Will Smith, Ashton Kutcher and the National Basketball League. Dapper’s investor list was equally impressive, with Andreessen Horowitz, Google Ventures and Samsung all giving the startup money.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">It only took about three and a half years for Gharegozlou to guide Dapper to a staggering $7.6 billion valuation, much of it realized during a bull run that saw cryptocurrencies and NFT prices achieve record highs. But while Gharegozlou was often celebrated in the media and business communities, behind the scenes many of his company’s employees lived in fear of what they called the CEO’s erratic nature. Several employees also found the first-time CEO’s spendthrift ways imprudent, especially when the NFT market began to sour, Top Shot sales plummeted and layoffs at Dapper became common.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">So when news spread of the Diplo party Gharegozlou hosted on the French Riviera aboard a 184-foot yacht — which <a href=\"https:\/\/www.fraseryachts.com\/en\/yacht-for-charter\/tacanuya\/\" data-v-f87c67ca=\"\">costs more than<\/a> $200,000 a week to charter — it landed like a gut punch for several Dapper employees worried about their job security amid the turbulent market conditions.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Inside Dapper, much of the company was in turmoil. Senior leader exits were becoming commonplace, and those employees left behind were tired and frustrated. Additionally, according to several former employees, the CEO’s frequent private jet travel, pursuit of celebrity partners and spending on luxurious accommodations, which at one point included a $85 million Beverly Hills mansion, had people questioning Gharegozlou’s priorities. The CEO’s constant “bullying” and “public shaming” of employees only added to the fire, helping to stoke a toxic company culture.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The Block spoke to eleven current and former employees for this story, including both staffers who left of their own volition and those who did not. Some of those who participated still own equity in Dapper.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDapper Labs acknowledged in a written statement that working at a startup can be hectic and that it has tried to create a safe and respectful workplace. \"We value each employee’s contributions to our business and our communities, and we take their feedback seriously,” said a company spokesperson. Gharegozlou didn't respond to a request for comment.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSeveral key investors including Andreessen Horowitz didn't respond to requests for comment.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Dapper CEO Roham Gharegozlou letting DJ Diplo into a yacht party on the French Riviera. SOURCE: Diplo's public Instagram account.<\/em>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With a prolonged bear market that has seen NFT trading volumes plummet by more than 90%, layoffs at larger NFT shops like Dapper have become increasingly common in recent months, putting pressure on management to cut costs and find ways to navigate the downturn. <span class=\"NormalTextRun SCXW237439082 BCX0\" data-v-f87c67ca=\"\">R<\/span><span class=\"NormalTextRun SCXW237439082 BCX0\" data-v-f87c67ca=\"\">evelations of poor management and cavalier CEO behavior have also <\/span><span class=\"NormalTextRun SCXW237439082 BCX0\" data-v-f87c67ca=\"\">recently <\/span><span class=\"NormalTextRun SCXW237439082 BCX0\" data-v-f87c67ca=\"\">become a common <\/span><span class=\"FindHit SCXW237439082 BCX0\" data-v-f87c67ca=\"\">refrain<\/span><span class=\"NormalTextRun SCXW237439082 BCX0\" data-v-f87c67ca=\"\"> across the world of crypto.<\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDapper’s NBA Top Shot collection has seen trading collapse, tumbling from a monthly sales-peak of $224 million in February 2021 to a mere $2.8 million last month, <a href=\"https:\/\/www.cryptoslam.io\/nba-top-shot\/sales\/summary\" data-v-f87c67ca=\"\">according to CryptoSlam<\/a>.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Last week Dapper <a href=\"https:\/\/www.theblock.co\/post\/214755\/dapper-labs-said-to-lay-off-20-more-of-its-full-time-employees\" data-v-f87c67ca=\"\">laid off<\/a> 20% of its full-time staff. Four months earlier, it parted ways with 22% of its employees.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\"><iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/non-ethereum-art-and-collectibles-nft-trade-volume\/embed\" title=\"Non-Ethereum Art and Collectibles NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe> &nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Described by many as charismatic and personable, Gharegozlou’s entrepreneurial roots appear to run deep. His father Reza moved the Gharegozlou family to Dubai from Tehran in the early 1990s to start a gas and refrigerants company, <\/span><a href=\"https:\/\/financialpost.com\/fp-finance\/cryptocurrency\/the-brothers-gharegozlou-vancouver-siblings-behind-nba-top-shot-phenomenon-are-just-getting-started\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">according to a profile<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in the Canadian business publication Financial Post. Later, Roham Gharegozlou got a degree from Stanford University and he and his brother Sam started a small venture capital firm called <a href=\"https:\/\/www.axiomzen.com\/\" data-v-f87c67ca=\"\">Axiom Zen<\/a> in 2012. <\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Then in 2017, Gharegozlou’s journey to become an NFT pioneer began when Axiom Zen helped create CryptoKitties, a popular blockchain game where people could buy and sell virtual cats. CryptoKitties, and its official creator Dapper Labs, <\/span><a href=\"https:\/\/venturebeat.com\/business\/cryptokitties-creator-dapper-labs-raises-15-million-to-build-more-blockchain-cats\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">spun off<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> from Axiom Zen the next year. Shortly thereafter, Dapper <\/span><a href=\"https:\/\/www.dapperlabs.com\/newsroom\/dapper-labs-the-company-behind-cryptokitties-raises-15m-in-financing-to-drive-consumer-adoption-of-blockchain-technology\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">secured $15 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> from a long line of major players in both finance and entertainment including Andreessen Horowitz, Jeffrey Katzenberg’s WndrCo and the founder and CEO of Reddit, Steve Huffman.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Gharegozlou and the Vancouver-based Dapper’s winning streak continued in 2020 after the company partnered with the NBA to create NBA Top Shot, a collection of NFTs that are video clips of specific basketball highlights that people can buy, sell and trade. The collection caught fire in the first quarter of 2021, generating more than $200 million in sales during two <\/span><a href=\"https:\/\/www.cryptoslam.io\/nba-top-shot\/sales\/summary\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">consecutive months<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">. It also helped introduce NFTs to the mainstream.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">And that’s when the big bucks started to roll in. In March 2021 Dapper <\/span><a href=\"https:\/\/www.theblock.co\/linked\/99824\/dapper-labs-nba-top-shot-new-funding-305-million\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">raised $305 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in a funding round that <\/span><a href=\"https:\/\/www.dapperlabs.com\/newsroom\/coatue-michael-jordan-kevin-durant-a16z-and-more-than-30-other-nba-and-nfl-players-and-vcs-invest-305-million-in-dapper-labs-makers-of-nba-top-shot-and-flow-blockchain\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">included<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> NBA legend Michael Jordan as well current all-star Kevin Durant. Along with prolific blockchain investor Andreessen Horowitz, dozens more venture capitalists, NBA and National Football League players invested in the round. Later that year, as NFT trading volumes were hitting all-time highs, Dapper raised another $250 million, giving the roughly three-year-old company a valuation of $7.6 billion, <\/span><a href=\"https:\/\/techcrunch.com\/2021\/09\/22\/nba-top-shot-creator-dapper-labs-raises-another-250-million\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">according to TechCrunch<\/span><\/a>.<span data-contrast=\"none\" data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Positioned as a trailblazer, Gharegozlou’s accomplishments were featured in premier business publications like The Wall Street Journal, Forbes, Fortune and Fast Company. The executive’s fame had ascended along with Dapper’s soaring valuation.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Around this time is when Gharegozlou’s behavior is said to have started to change, according to two former employees that worked closely with the CEO for years.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With NBA Top Shot generating buzz, Gharegozlou started receiving calls from famous entrepreneur celebrities and top CEOs, said one person familiar with the matter. Two people said he could land a meeting with practically anyone he wanted.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Gharegozlou’s lifestyle also evolved dramatically. The CEO began to fly frequently on private jets, according to five people familiar with the matter. The mode of travel became one of his priciest expenditures as the trips would generally cost between $60,000 and $100,000 per flight, one person said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While on the ground, Gharegozlou routinely rented mansions whenever he traveled, including once renting a 12-bedroom, $85 million mansion in Beverly Hills that can cost <a href=\"https:\/\/www.compass.com\/listing\/2571-wallingford-drive-beverly-hills-ca-90210\/1229294280605289625\/\" data-v-f87c67ca=\"\">$300,000 a month<\/a>, according to three people. When not renting a mansion, the CEO often booked five-star hotel suites that would sometimes cost as much as $30,000 a night, according to one person familiar with the matter.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">The $85 million Beverly Hills mansion Gharegozlou is said to have rented. Private jet travel and luxury accommodations were often marked down as \"marketing\" expenses. PHOTO SOURCE: Zillow<\/em>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">As Gharegozlou considered the big-ticket expenses integral to his strategy of cozying up to celebrities, they were often listed as “marketing” expenses, one person said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“He totally got roped in by the high life,” said a former employee that worked closely with Gharegozlou for years.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Four former employees who worked closely with the CEO said even as the bear market set in, Gharegozlou appeared to be more concerned with generating hype via celebrity partnerships than he did building new products or finding developers to utilize Dapper’s blockchain, Flow. Also, the celebrity partnerships, while making for flashy press releases, generally did not create tangible value for the company, three of those people said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Dapper also frequently sponsored extravagant events, according to three people with knowledge of the strategy. The company's Flow blockchain officially sponsored a February 2022 New York Fashion Week bash held in Los Angeles. Musical superstars Justin Bieber and Drake performed, and the party boasted a guest list that included Kendall Jenner and Leonardo DiCaprio, according to a <a href=\"https:\/\/www.vogue.com\/slideshow\/hwood-group-and-revolve-host-homecoming-weekend-2022\" data-v-f87c67ca=\"\">report in Vogue<\/a> at the time.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Dapper said in a statement that “the notion that there has been excessive spending\" not tied to the company's strategy is \"inaccurate and misleading.\" The company also said the CEO personally funded some events. \"Our business is rooted in entertainment and sports,\" the statement also said. \"We have and will continue to spend money on high-impact events.\"<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Regardless, oversight of the CEO’s spending may have been lacking as during much of the company's existence three-fifths of the company’s board has included Gharegozlou, his brother Sam and a college friend, said one person familiar with the matter.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">As Dapper quickly became a multi-billion dollar darling, at least on paper, the company expanded its headcount exponentially. Its staff swelled to about 600 from 100 in less than two years. But Gharegozlou struggled to delegate or relinquish control of even minor details, according to many of the former employees who said the CEO was eager to take part in every possible decision, to the point of micromanaging, they said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">As the current crypto winter emerged, Gharegozlou’s mercurial nature worsened, according to each of the people The Block spoke to. It became increasingly frequent for Dapper’s staff to either quit or be fired as the toxic work culture spiraled out of control, the people also said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">NBA Top Shot monthly trading volumes declining in 2022 as bear market sets in. SOURCE: CryptoSlam!<\/em>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Throughout much of 2022, it was common for newly hired senior staff to last only a few months as they would either quit after struggling under Gharegozlou’s leadership or were fired, said five people familiar with the matter. The high turnover fostered a stressful work environment where people were terrified of crossing the CEO, according to everyone The Block spoke to. <\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Employees’ anxieties were also exacerbated by a culture of “bullying” spurred on by Gharegozlou’s propensity for publicly shaming staff on Slack or screaming at employees during video calls, many of the people said. Employees opting to take mental-health breaks became commonplace, the people said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.theblock.co\/post\/214755\/dapper-labs-said-to-lay-off-20-more-of-its-full-time-employees\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">document obtained<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> by The Block, which announced Dapper was laying 20% of its employees, Gharegozlou told investors he aimed to improve efficiency and that the company is in a “strong cash position with no outstanding debt.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Dapper also now finds itself in the midst of a <\/span><a href=\"https:\/\/www.theblock.co\/post\/214100\/dapper-labs-nba-top-shot-moments-nfts-are-securities-federal-judge-rules\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">court battle <\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">to determine whether the company violated securities laws by selling NBA Top Shot Moments NFTs without the standard registration and disclosures which is applied to other investment contracts.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">In last week’s memo to investors, Gharegozlou waxed optimistic, saying Dapper is “tremendously excited about several major launches coming up this year, and more confident than ever that web3 will remake digital life for the better, for billions of people over time.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Zillow","content":"ORGANIZATION"},{"type":"$7.6 billion","content":"MONEY"},{"type":"Cannes","content":"LOCATION"},{"type":"Google Ventures","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Michael Jordan","content":"PERSON"},{"type":"$200,000","content":"MONEY"},{"type":"February 2021","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Diplo","content":"ORGANIZATION"},{"type":"New York Fashion Week","content":"ORGANIZATION"},{"type":"$305 million","content":"MONEY"},{"type":"$60,000","content":"MONEY"},{"type":"Roham<\/span> <span data-contrast=\"none\" data-v-f87c67ca=\"\">Gharegozlou","content":"PERSON"},{"type":"Will Smith","content":"PERSON"},{"type":"$30,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dapper","content":"LOCATION"},{"type":"Tehran","content":"LOCATION"},{"type":"March 2021","content":"DATE"},{"type":"first quarter of 2021","content":"DATE"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Gharegozlou","content":"PERSON"},{"type":"Ashton Kutcher","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"Vogue","content":"LOCATION"},{"type":"$85 million","content":"MONEY"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"National Football League","content":"ORGANIZATION"},{"type":"Financial Post","content":"ORGANIZATION"},{"type":"Axiom Zen","content":"ORGANIZATION"},{"type":"National Basketball League","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Kevin Durant","content":"PERSON"},{"type":"Vancouver","content":"LOCATION"},{"type":"Drake","content":"PERSON"},{"type":"Kendall Jenner","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"Jeffrey Katzenberg","content":"PERSON"},{"type":"Beverly Hills","content":"LOCATION"},{"type":"Roham Gharegozlou","content":"PERSON"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Leonardo DiCaprio","content":"PERSON"},{"type":"Steve Huffman","content":"PERSON"},{"type":"Los Angeles","content":"LOCATION"},{"type":"Justin Bieber","content":"PERSON"},{"type":"Diplo","content":"PERSON"},{"type":"Forbes","content":"LOCATION"},{"type":"early 1990s","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"$2.8 million","content":"MONEY"},{"type":"$300,000","content":"MONEY"},{"type":"$224 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}