{"summary":"Satoshi Nakamoto Mined More Than 1 Million Bitcoin – Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/satoshi-nakamoto-mined-more-than-1-million-bitcoin-report-7179.htm","publishDate":"2020-07-21T09:28:45","id":20477,"type":null,"title":"Satoshi Nakamoto Mined More Than 1 Million Bitcoin – Report","category":["Bitcoin News "],"content":["Bitcoin’s (BTC) pseudonymous creator Satoshi Nakamoto may have mined more than 1 million bitcoin in the early days of the cryptocurrency, according to analysts at crypto transaction tracker Whale Alert.","The early Bitcoin miner known as Patoshi mined BT 1,125,150 during BTC’s infancy, when Patoshi controlled “a constant 60%” of the network’s processing power, presumably in order to ensure no other miners would be able to carry out a 51% attack on the new and vulnerable network, analysts said in a blog post.","The new report, which builds upon work from 2013 by crypto researcher Sergio Demian Lerner, further said that it is known for certain that the miner dubbed Patoshi was indeed Satoshi. The reason for this, it said, is that the distinct “saw pattern” that characterizes Patoshi appeared at the birth of the network, and it mined the block that contained the bitcoins that were sent to Hal Finney – the first-ever recipient of a bitcoin transaction sent from Satoshi.","The fact that Satoshi’s mining power was kept at a constant 60% of the entire network, combined with among other things the lack of spending, also suggests that Satoshi was “only interested in growing and protecting the young network,” according to Whale Alert.","In addition to eliminating the risk of a 51% attack by controlling 60% of the network, this practice also helped Satoshi to maintain his “ideal block time” of around 10 minutes, in particular during periods when there was either too much or not enough activity on the network, the report said.","Given this information, Whale Alert was able to determine that an estimated 22,503 blocks out of the first 54,316 blocks mined, were indeed mined by Bitcoin’s creator. Further, the team also concluded that at least 18 of the spent blocks were Satoshi’s, which means that the pseudonymous Bitcoin creator in total spent BTC 907, with a price of less than USD 0.01 per coin at the time. This also means that BTC 1,122,693 were left unspent by Satoshi, Whale Alert wrote.","They concluded that the manner in which the early mining by Satoshi was carried out suggests that the bitcoin’s mined were “possibly a mere byproduct” of his efforts to keep the network safe and stable. This makes it “unlikely” that the remaining 1.12 million BTC will ever be spent, the article said, although it also added that “the question remains why Satoshi didn’t simply burn them in this case.”","However, the practice of using nonce (the number that Bitcoin miners are solving for) patterns to determine the amount of bitcoin Satoshi mined has previously been called into question by BitMEX Research. According to a 2018 blog post, there is “reasonable evidence” to support the claim that “a dominant miner” in 2009 mined around 700,000 BTC. Whether that miner was Satoshi, however, is “certainly not conclusive.”\n____\nLearn more:\nSomeone Just Moved 50 Bitcoins, Prompting Speculations It’s Satoshi Nakamoto\nSatoshi-era Bitcoin Miner Calls Craig Wright a Fraud Using “His” BTC Addresses"],"entity":[{"type":"Satoshi Nakamoto\nSatoshi","content":"PERSON"},{"type":"Patoshi mined BT","content":"ORGANIZATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Sergio Demian Lerner","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"2009","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Hal Finney","content":"PERSON"},{"type":"BitMEX Research","content":"ORGANIZATION"},{"type":"Whale Alert","content":"ORGANIZATION"},{"type":"Patoshi","content":"PERSON"}],"hashtag":["Bitcoin","Mining","Satoshi Nakamoto"],"authors":["Fredrik Vold"]}