{"summary":"Genesis and Gemini File for Dismissal of SEC’s Earn Program Lawsuit – Here’s the Latest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/genesis-gemini-file-for-dismissal-of-secs-earn-program-lawsuit-heres-latest.htm","publishDate":"2023-06-14T11:59:00","id":20478,"type":null,"title":"Genesis and Gemini File for Dismissal of SEC’s Earn Program Lawsuit – Here’s the Latest","category":["Blockchain News "],"content":["Cryptocurrency exchange Gemini and bankrupt cryptocurrency lender Genesis Global Capital have filed a petition to dismiss the SEC action linked to their joint venture product, Gemini Earn.","The SEC lawsuit charges the firms with offering yield-bearing instruments to their customers and that, as such, these products are securities offered for sale without the required registration with the relevant authority. ","In its court documents, Gemini and Genesis contend that Gemini Earn is not a security. ","The firms argue that the transactions effectively amounted to loans. They ask the court to dismiss the complaint or to overturn the SEC’s requests for a disgorgement and permanent injunction.","In a post directed at Earn users, Gemini criticized the SEC case as being “ill-conceived,” clarifying that Gemini, not Genesis, was responsible for the Earn program’s customer-facing aspects.","1\/ I and the @JFBLegal team are proud to represent @Gemini. Today we filed our motion to dismiss the @SEC’s ill-conceived lawsuit against Gemini and Genesis relating to the Earn program.","Due to Genesis’ bankruptcy filing following the SEC’s lawsuit in January, withdrawal rights for Earn users were restricted during mid-November 2022. ","Gemini responded by submitting a claim to seek the recovery from Genesis of about $1.1 billion in assets for 232,000 Earn users.","Gemini negotiates with Genesis, #DCG & #creditors to restructure DCG's $630M debt expiring on May 11, to avoid default.\n\nIf unsuccessful, they'll propose a DCG-independent plan. #Gemini also prepares to claim $1.1B in digital assets for 200K+ #Earn users from #Genesis. pic.twitter.com\/fjTcOgpU1o","To establish a reorganization and settlement agreement, Gemini and Genesis’ parent firm, Digital Currency Group (DCG) are negotiating through a mediator.","Further, Gemini and other creditors are working together on an “amended plan of reorganization” to ensure the best outcome for Earn users. ","This is despite the fact that a preliminary agreement from February has not been finalized yet.","Representing Gemini, Jack Baughman, founding partner of JFB Legal, criticized the SEC’s case, claiming that it made it more difficult to compensate Earn users and made it harder to recover assets from the Genesis bankruptcy.","6\/ The Genesis bankruptcy is dragging on. The SEC’s case is only making it harder and more complicated to retrieve assets from the Genesis bankruptcy and make Earn users whole. It does nothing to speed it the process and unlock assets that need to be returned to Earn users.","Users of Gemini’s Earn program were able to earn interest on their cryptocurrency deposits thanks to a financing partnership with Genesis Global Capital.","The corporation emphasized that the contracts were not offered on a secondary market. This supports its claim that the lending arrangements are not securities. ","Notably, all these started with the SEC’s crackdown on the cryptocurrency industry, triggering a cascade of events that continues to affect the market.","The SEC: Hit BlockFi for failing to register its crypto-lending program; Stopped Coinbase from launching its crypto-lending program; and Just hit Gemini\/Genesis's for its Earn crypto-lending grift. Buckle up: An SEC regulatory onslaught is just beginning.https:\/\/t.co\/YIEWZd577d pic.twitter.com\/ge6xb2RpCG","In the enforcement action against Genesis and Gemini, SEC Chair Gary Gensler, who is reported to have tried landing a job with Binance, emphasized the necessity of compliance with securities laws, emphasizing the significance of safeguarding investors.","However, the bankruptcy of Genesis’s lending arm has further complicated the process of compensating Earn users, with Genesis’s parent company missing a $630 million payment.","Digital Currency Group missed a $630M payment to its bankruptcy subsidiary Genesis@Gemini says @DCGco missed a $630M payment it was meant to shell out to its bankruptcy subsidiary @GenesisTrading earlier this month. Gemini is now working with other creditors to provide… pic.twitter.com\/ZvGUQo6vx4","Gemini and Genesis have filed a request to dismiss the action in keeping with their prior promise to challenge the SEC’s claims. ","Tyler Winklevoss, a Gemini co-founder, described the action as a “manufactured parking ticket” and voiced faith in their ability to defend themselves.","The court’s ruling will greatly influence the future of the legal procedures and potential outcomes for Earn users on the motion to dismiss.\n "],"entity":[{"type":"mid-November 2022","content":"DATE"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"$1.1","content":"MONEY"},{"type":"earlier this month","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$630M","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"$630 million","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Jack Baughman","content":"PERSON"},{"type":"Gemini\/Genesis","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Genesis","content":"ORGANIZATION"},{"type":"May 11","content":"DATE"}],"hashtag":["Gemini"],"authors":["Lockridge Okoth"]}