{"summary":"OKX and Polygon Collaborate to Launch X Layer Public Mainnet","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/okx-and-polygon-collaborate-to-launch-x-layer-public-mainnet.htm","publishDate":"2024-04-16T07:52:58","id":20470,"type":null,"title":"OKX and Polygon Collaborate to Launch X Layer Public Mainnet","category":["Blockchain News "],"content":["OKX has officially launched the X Layer public mainnet in partnership with Polygon.","According to a recent announcement by the crypto exchange OKX, the X Layer network is designed to make Ethereum-based transactions faster and more cost-effective for the company’s 50 million users.","The Layer-2 (L2) network uses Zero Knowledge (ZK) for security and is built using the Polygon Chain Development Kit (CDK). The platform facilitates shared state and liquidity across various chains through the AggLayer.","Hiya creators, builders, founders 👩‍💻👨‍💻","🚨 We're opening X Layer Mainnet to the Public 🚨","With +200 dApps building, X Layer is now accessible to everyone, not just developers.","Experience the power & security of our zkEVM L2 network firsthand.","Start building:… pic.twitter.com\/K59dg0sJrG","— X Layer (@XLayerOfficial) April 16, 2024","","The ZK proofs employed would also ensure transactions are scalable while reducing costs. Additionally, its EVM compatibility allows for seamless deployment of Ethereum-based decentralized apps (dApps) with minimal development effort.","“X Layer is for visionary builders who are creating applications to help bring millions of people on-chain,” stated OKX Chief Marketing Officer Haider Rafique.","“We envision X Layer and other Layer-2 chains as the highway infrastructure of the Web3 world, with dApps as the marketplaces and self-hosted wallets as the vehicles that take you there,” said Rafique.","Since its beta unveiling in November 2023, X Layer has seen rapid adoption, with over 50 web3 dApps deploying on the platform within the first week of its testnet launch.","The dApps include major applications such as The Graph, Curve, LayerZero, QuickSwap, Galxe, and Timeswap, which are enhancing the network’s utility and reach.","Users globally can now utilize the X Layer network for asset transfers, crypto deposits and withdrawals via OKX, and access to a suite of over 170 dApps that enable swapping, staking, and smart contract interactions.","“X Layer is a monumental next step in the industry’s ambition to build a truly unified Web3,” said Polygon CEO Marc Boiron. “The X Layer’s connection to the AggLayer solves the fragmentation of liquidity and users across chains on the AggLayer so they can all grow together.”","“The impressive roster of talented developers who have already started to build on X Layer is a testament to the potential of the network, and we look forward to continuing to collaborate with OKX to achieve our shared goals for the industry,” said Boiron."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Timeswap","content":"ORGANIZATION"},{"type":"Rafique","content":"PERSON"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Polygon Chain Development","content":"ORGANIZATION"},{"type":"April 16, 2024","content":"DATE"},{"type":"Galxe","content":"PERSON"},{"type":"Haider Rafique","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Layer-2","OKX","Polygon"],"authors":["Hongji Feng"]}