{"summary":"Michael Saylor and MicroStrategy See Massive Returns on Bitcoin Investment, Crossing $1.1B Mark","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/michael-saylors-btc-investment-crosses-1b-in-unrealized-profits.htm","publishDate":"2023-11-10T14:24:18","id":20497,"type":null,"title":"Michael Saylor and MicroStrategy See Massive Returns on Bitcoin Investment, Crossing $1.1B Mark","category":["Bitcoin News "],"content":["The price of Bitcoin has risen substantially in recent weeks, pushing the value of MicroStrategy’s Bitcoin holdings above $5.8 billion. The rally has resulted in over $1.2 billion in unrealized profit for the company and its CEO Michael Saylor.","MicroStrategy is a business software firm that has made massive investments in Bitcoin over the past few years. According to recent data from Bitcoin Treasuries, the company holds more than 158,000 Bitcoins acquired at a cumulative cost of $4.6 billion. With the price of Bitcoin crossing $37,000 this week, the value of these holdings now stands at approximately $5.88 billion.","This means the company has made an unrealized profit of over $1.2 billion on its Bitcoin investment. Unrealized profit refers to gains on investments that have yet to be sold or withdrawn. As the value of MicroStrategy’s Bitcoin holdings continues to rise, so does their unrealized profit.","MicroStrategy’s Bitcoin position is more than 10 times larger than any other public company. The next biggest institutional holder, Marathon Digital, has 13,726 Bitcoins worth approximately $500 million at current prices, highlighting the scale and success of MicroStrategy and Michael Saylor’s Bitcoin bet.","In September, ahead of Bitcoin’s latest surge, MicroStrategy purchased an additional 5,445 Bitcoins for $150 million, at an average price of $27,053 per Bitcoin. The purchase allowed the firm to capitalize on lower prices and increase its holdings before the recent upward price movement.","#Bitcoin is Coming. pic.twitter.com\/5oE42SQvgC","— Michael Saylor⚡️ (@saylor) November 9, 2023","","MicroStrategy’s Executive Chairman Michael Saylor has been one of the most vocal proponents of Bitcoin among prominent business leaders. He has consistently touted the cryptocurrency and publicly backed its long-term adoption.","Under Saylor’s direction, MicroStrategy has steadily built its Bitcoin position over time by using company funds as well as proceeds from bond offerings. The firm adopted Bitcoin as its primary treasury asset back in 2020 and has continued investing despite volatility.","Bitcoin has seen a boost in recent weeks partially due to growing optimism around a Bitcoin exchange-traded fund (ETF) being approved in the United States.","Many experts believe the approval of a Bitcoin ETF would spur major Wall Street investment into the cryptocurrency and propel prices higher. There are currently several proposals before the Securities and Exchange Commission (SEC).","On Wednesday, it was reported by CoinDesk that the SEC is in discussions with Grayscale about the potential conversion of its popular Bitcoin trust product into an ETF. While the regulator has rejected applications in the past, the latest developments suggest an approval may now be on the horizon.","The prospect of a potential approval of Bitcoin spot ETFs, along with Bitcoin’s finite supply and growing adoption, has fueled bullish sentiment and lifted prices off their 2022 lows. As a result, MicroStrategy and Michael Saylor now sit on massive Bitcoin gains that may see other companies taking notice in the coming months."],"entity":[{"type":"$5.8 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$37,000","content":"MONEY"},{"type":"$5.88 billion","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$27,053","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"November 9, 2023","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"$4.6 billion","content":"MONEY"},{"type":"MicroStrategy’s Executive","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Bitcoin Treasuries","content":"ORGANIZATION"}],"hashtag":["Bitcoin ETF","Michael Saylor"],"authors":["Trent Alan"]}