{"summary":"Bitcoin Price Forecast for 2022 Cut Once Again as Break ‘Only’ Above USD 80K Now Expected","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-forecast-for-2022-cut-once-again-as-break-only-above-usd-80k-now-expected.htm","publishDate":"2022-04-22T13:53:00","id":20490,"type":null,"title":"Bitcoin Price Forecast for 2022 Cut Once Again as Break ‘Only’ Above USD 80K Now Expected","category":["Bitcoin News "],"content":[" ","The price of bitcoin (BTC) will hit a peak of USD 81,680 this year, before falling back to USD 65,185 by the end of the year, argued a panel of members from the fintech and crypto industry surveyed by comparison website Finder.com.","The peak of over USD 80,000 was described as “significantly higher” than the current bitcoin price (USD 40,542 as of Friday at 11:17 UTC), but still 15% lower than Finder.com’s end-of-year prediction from January of USD 76,360.","Martin Fröhler, CEO of trading platform Morpher, who gave one of the most bullish end-of-year predictions for BTC, commented that,","“Political uncertainty, inflation, and an ever increasing desire to own non-government controlled assets will propel Bitcoin to new all-time highs.” ","Offering a more cautious prediction, crypto trading app CoinJar’s CEO Asher Tan said he believes BTC will hit a peak of USD 60,000 this year.","“There’s still plenty of uncertainty about the short-term Bitcoin outlook. Given the macroeconomic headwinds, it would not surprise me to see Bitcoin spend the whole year bouncing around between USD 30-60k – the sort of conditions that are terrible for traders, but rewarding for accumulators with a multi-year timeframe,” Tan said.","Notably, half of the participants in Finder’s panel, made up of 35 “industry experts,” said they believe bitcoin will eventually be overtaken by another coin as the most popular cryptoasset.","Among those who claimed bitcoin’s days as the top crypto are numbered, Jeremy Cheah, an associate professor of decentralized finance at Nottingham Trent University, said the coin “consumes too much energy and suffers from interoperability and scalability problems.”","Meanwhile, 32% of the panelists also said they think that BTC should move from the more energy-intensive proof-of-work (PoW) model to proof-of-stake (PoS). However, only 9% said they believe BTC will actually make the move.","Overall, 67% of respondents said BTC is still a good buy, despite their price predictions being lower now than in the last survey from January. ","24% of the respondents opined that users who already hold BTC should not sell it, while 9% said that BTC holders should sell the coins they have.","____","Learn more:\n– Investors Show Rising Interest in Crypto, but Financial Illiteracy Hampers Investments – Surveys\n– About 50% of Surveyed Crypto Owners Made Their First Buy in 2021 – Gemini\n\n– Surging Consumer Interest in Crypto is Accelerating eCommerce Adoption – Survey\n– More Investors Enter Crypto But Keep Multiple Financial Service Providers – Survey\n\n– Most Surveyed US Financial Advisors Plan to Raise Crypto Allocations, 0% Plan to Reduce – Nasdaq\n– 45% of Surveyed US Financial Advisors Expect to Use Crypto Per Clients’ Request"],"entity":[{"type":"9%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"32%","content":"PERCENT"},{"type":"Financial Illiteracy Hampers Investments","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Asher Tan","content":"PERSON"},{"type":"67%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Crypto But Keep Multiple Financial Service Providers – Survey\n\n– Most Surveyed US Financial Advisors","content":"ORGANIZATION"},{"type":"Nottingham Trent University","content":"ORGANIZATION"},{"type":"Martin Fröhler","content":"PERSON"},{"type":"24%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Surveyed US Financial Advisors Expect to Use Crypto Per Clients’ Request","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"0%","content":"PERCENT"},{"type":"Crypto","content":"LOCATION"},{"type":"Jeremy Cheah","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Forecast","Market","Proof-of-stake","Proof-of-work","Survey"],"authors":["Fredrik Vold"]}