{"summary":"SEC Stifling Innovation by Hindering Ethereum’s Potential in Banking: Joseph Lubin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-stifling-innovation-by-hindering-ethereums-potential-in-banking-joseph-lubin.htm","publishDate":"2024-05-09T18:42:45","id":20499,"type":null,"title":"SEC Stifling Innovation by Hindering Ethereum’s Potential in Banking: Joseph Lubin","category":["Blockchain News "],"content":["Ethereum Co-Founder Joseph Lubin launched scathing criticisms against the Securities and Exchange Commission (SEC) on May 9, accusing the regulatory body of deliberately impeding innovation and obstructing Ethereum’s transformative potential in the banking landscape.","Speaking at FT Live’s Crypto and Digital Assets summit in London, Lubin criticized the SEC’s approach, alleging that instead of fostering open discourse and providing clear regulatory guidelines, the SEC has opted for strategic enforcement actions, causing uncertainty within the cryptocurrency industry.","“The SEC probably doesn’t want to see a wave of innovation that will really transform the landscape,” he said.","","Lubin’s remarks were made in light of Consensys’s decision to sue the SEC after receiving a Wells notice from the regulator. Lubin asserted that the SEC’s actions, such as reclassifying Ether as a security without transparent communication, were designed to instill fear and doubt, potentially driving cryptocurrency companies offshore.","“The SEC appears to have reclassified Ether as a security without telling anybody that that’s the case,” Lubin said. “They are going about a strategic series of enforcement actions rather than open discourse and clear rulemaking.”","Central to Lubin’s critique is the suspicion surrounding the SEC’s motives, particularly regarding its recent enforcement actions against Ethereum. Lubin suggested that the impending decision to approve Ether spot exchange-traded funds (ETFs) has spurred the SEC’s intensified scrutiny, fearing the potential influx of capital into the Ethereum ecosystem.","🗣️ Ethereum developer firm Consensys managed by Joe Lubin has filed a lawsuit against the SEC over its “overzealous regulation” around the Ethereum blockchain.#CryptoNewshttps:\/\/t.co\/1MsgbSROXn","— Cryptonews.com (@cryptonews) April 25, 2024","","“We believe that there’s a flurry of activity designed to enable them to say that their action wasn’t capricious in the very likely event that they deny the Ether spot ETFs,” The Ethereum co-founder explained.","In Lubin’s view, the SEC’s reluctance to embrace Ethereum’s advancements in scalability and usability stems from a desire to maintain the status quo, fearing the transformative impact decentralized finance (DeFi) could have on the banking industry.","“I think they’re concerned that so much attention and capital will flow to our ecosystem, considering it is improving enormously in terms of scalability and usability,” he added.","Lubin further argued that the SEC’s apprehension towards innovation reflects a broader reluctance to adapt to emerging technologies, potentially hindering the growth of the cryptocurrency sector.","Additionally, Lubin cautioned against the SEC’s attempts to classify platforms like Coinbase and MetaMask’s wallets as broker-dealers, warning that such actions could set a dangerous precedent and stifle innovation across the technology sector.","“We’re at odds over whether we should register MetaMask as a broker-dealer,” he said. “Should ever MetaMask user have to register their wallet as a broker-dealer, it’s chilling.”","","The SEC recently decided to delay its ruling on the proposed Invesco Galaxy spot Ethereum exchange-traded fund (ETF). The new deadline for the decision is July 5, 2024. The SEC stated additional time is required to review the proposed rule change and the associated issues thoroughly.","Similarly, Franklin Templeton’s application for a spot Ethereum ETF also faces an extended delay, with the SEC pushing the decision deadline to June 11, 2024.","Several other issuers, including BlackRock, 21Shares with Ark, Fidelity, Grayscale, VanEck, Hashdex, and Franklin Templeton, have filed applications for Ethereum ETFs, adding to the market’s anticipation.","Market analysts had initially speculated that the SEC would reach a final decision on spot Ethereum ETF applications during May, coinciding with deadlines for various asset managers’ submissions.","The recent delays announced by the SEC have dampened these expectations, however. Bloomberg Intelligence analyst James Seyffart expressed skepticism, suggesting that the current round of Ether ETF applications might face rejection, altering the landscape for Ethereum investment options in the US."],"entity":[{"type":"James Seyffart","content":"PERSON"},{"type":"April 25, 2024","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"July 5, 2024","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Lubin","content":"PERSON"},{"type":"VanEck","content":"PERSON"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"June 11, 2024","content":"DATE"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Joe Lubin","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"FT Live’s Crypto and Digital Assets","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"May 9","content":"DATE"},{"type":"Invesco Galaxy","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Hashdex","content":"LOCATION"},{"type":"Ethereum ETF","content":"ORGANIZATION"}],"hashtag":["Ethereum","Ethereum as a security","SEC"],"authors":["Hassan Shittu"]}