{"summary":"JPMorgan is said to be now serving crypto exchanges  \nCoinbase and Gemini are reportedly the bank’s first clients \nA banker told The Block: “It’s quite significant news in my opinion” and that it may lead to further doors being opened for crypto firms at other banks","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64906\/jpmorgan-now-serves-crypto-exchanges-coinbase-and-gemini-first-clients-report","publishDate":"2020-05-12T07:49:04","id":2049,"type":null,"title":"JPMorgan now serves crypto exchanges, Coinbase and Gemini first clients - report","category":["Exchanges"],"content":["Banking giant JPMorgan is now reportedly serving cryptocurrency exchanges.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJPMorgan's first crypto clients are Coinbase and Gemini, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/amp\/articles\/jpmorgan-extends-banking-services-to-bitcoin-exchanges-11589281201\" data-v-f87c67ca=\"\">reported<\/a> the news on Tuesday, citing \"people familiar with the matter.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis is the first time JPMorgan has taken clients from the crypto space. Coinbase and Gemini's accounts were approved last month, and transactions are now starting to be processed, per the report. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen reached for comment, JPMorgan and Gemini declined to comment to The Block. We have also reached out to Coinbase for comments, and will update this story should we hear back.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJPMorgan is reportedly providing cash-management services to the crypto exchanges and handling dollar-based transactions for their U.S.-based customers. It will process wire transfers, and deposits and withdrawals through the Automated Clearing House (ACH) network.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Quite significant news'<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBanks have since long been known to remain reluctant to provide services to cryptocurrency firms, including exchanges. Last August, Barclays <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35904\/barclays-cancels-banking-deal-with-coinbase-report\" data-v-f87c67ca=\"\">stopped<\/a> providing banking services to Coinbase. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJPMorgan's move suggests that traditional finance companies are becoming more comfortable with the cryptocurrency market.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"It's quite significant news in my opinion,\" a banker told The Block. \"There is little business in fees associated with processing wire and ACH payments, I would expect that there are other associated benefits to JPM from any associated banking services, additional collaboration with both of those firms, potential for winning any future IPO or another angle such as JPM coin being offered on either of those platforms.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe banker added that the whole of Wall Street will notice this news, and it may lead to further doors being opened for crypto firms at other banks.","\"In the same way, the <a href=\"https:\/\/www.theblockcrypto.com\/post\/64398\/paul-tudor-jones-says-he-is-buying-bitcoin-as-a-hedge-against-central-bank-money-printing\" data-v-f87c67ca=\"\">Paul Tudor Jones news<\/a> gives macro hedge funds a justification to look at bitcoin, the largest bank offering crypto exchange services means a lot of credibility for the space.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Bitcoin 'a fraud'?<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJPMorgan's move is particularly interesting since its CEO Jamie Dimon has been a long-time critic of bitcoin. He once <a href=\"https:\/\/www.theblockcrypto.com\/post\/11689\/jp-morgan-launches-its-own-cryptocurrency-the-first-for-a-major-us-bank\" data-v-f87c67ca=\"\">called<\/a> the world's largest cryptocurrency “a fraud.”","JPMorgan, however, has experimented with bitcoin's underlying blockchain technology. The bank operates a blockchain-based payment network called Interbank Information Network, which allows member banks to exchange information related to international payments. Some of the notable banks on the network include Deutsche Bank, Royal Bank of Canada and Australia and New Zealand (ANZ) Banking Group, among others.","JPMorgan also operates a stablecoin-like digital token called JPM Coin, which enables instant payment transfers between institutional accounts.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier this year, JPMorgan was also <a href=\"https:\/\/www.theblockcrypto.com\/post\/55477\/jpmorgan-said-to-be-in-talks-to-merge-its-blockchain-unit-with-consensys\" data-v-f87c67ca=\"\">said<\/a> to be in discussions to merge its blockchain unit Quorum with Ethereum development studio ConsenSys."],"hashtag":["COINBASE","GEMINI","JPMORGAN"]}