{"summary":"Kraken Exchange CEO Jesse Powell Slams SEC for ‘Assault on America’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kraken-exchange-ceo-jesse-powell-slams-sec-for-assault-on-america.htm","publishDate":"2023-11-22T11:10:00","id":20498,"type":null,"title":"Kraken Exchange CEO Jesse Powell Slams SEC for ‘Assault on America’","category":["Altcoin News "],"content":["Jesse Powell, co-founder of crypto exchange Kraken, has called the US regulators masochists attacking America and extortionists chasing crypto companies out of the country.","Powell came after the country’s regulators, specifically the Securities and Exchange Commission (SEC).","On Tuesday, he tweeted that,","“USA’s top decel is back with another assault on America. The masochists haven’t been happy with the beatings they’ve been taking in NY and are shopping for a different flavor of RegDom in CA.”","“Decel” stands for “decelerationist.” It is used as derogatory slang in certain communities for someone who aims to slow down (decelerate) technological progress.","USA's top decel is back with another assault on America. The masochists haven't been happy with the beatings they've been taking in NY and are shopping for a different flavor of RegDom in CA. I thought we settled all their concerns for $30m in Feb. Now they're back for seconds? https:\/\/t.co\/SkfPJyneUz","— Jesse Powell (@jespow) November 21, 2023","","This comes as the SEC sued the crypto exchange again. It claims Kraken operates as an unregistered national securities exchange, broker, and clearing house.","The exchange denied the claims, stating it would “vigorously” defend its position.","According to the SEC’s complaint, “since at least September 2018, Kraken has made hundreds of millions of dollars unlawfully facilitating the buying and selling of crypto asset securities.”","The commission seeks injunctive relief, conduct-based injunctions, disgorgement of ill-gotten gains, interest, and penalties.","However, it also included that it had settled with Kraken for $30 million in February.","The SEC added that the exchange agreed to stop offering or selling securities through crypto asset staking services or staking programs.","Powell reacted to the latest complaint, stating:","“I thought we settled all their concerns for $30m in Feb. Now they’re back for seconds?”","Nonetheless, Kraken said the new lawsuit had not impacted its products and would continue providing services without interruption.","JUST IN: Business as usual","— Kraken Exchange (@krakenfx) November 21, 2023","","The SEC is not willing to actually solve any issues or offer clear guidelines, Powell’s tweets suggest.","He said that,","“Message is clear: $30m buys you about 10 months before the SEC comes around to extort you again.”","Furthermore, he said, these fights are costly – and the SEC knows it. Those who can’t afford to fight will have to pack up and leave.","“Lawyers can do a lot with $30m but the SEC knows that a real fight will likely cost $100m+, and valuable time. If you can’t afford it, get your crypto company out of the US warzone.”","Kraken said that the SEC has made it difficult for crypto companies to register and comply with the unclear rules.","Furthermore, it argued that the regulator “has repeatedly challenged crypto exchanges to come in and register,” but it doesn’t have “a single law” supporting its position.","Kraken CEO David Ripley added that the SEC has called Kraken to register with the agency, but there is no clear way to do so.","“Its allegations are factually incorrect, contrary to law, and the wrong way to create policy in the United States. As an industry leader, we will stand up to these allegations and defend the crypto industry’s right to exist in the U.S,” Ripley wrote.","We strongly disagree with the SEC claims, stand firm in our view that we do not list securities, and plan to vigorously defend our position.","As we have seen before, the SEC argues that @krakenfx should “come in and register” with the agency, when there is no clear path to…","— Dave Ripley (@DavidLRipley) November 21, 2023","","Per the exchange and its CEO, as crypto rule-making advances globally, nonpartisan US Congressional action would be the most effective path forward to avoid the country “litigating its way to the back of the line.”"],"entity":[{"type":"Kraken Exchange","content":"ORGANIZATION"},{"type":"Dave Ripley","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Feb","content":"DATE"},{"type":"USA","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$100m","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"November 21, 2023","content":"DATE"},{"type":"Ripley","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"$30m","content":"MONEY"},{"type":"David Ripley","content":"PERSON"},{"type":"U.S","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"US Congressional","content":"ORGANIZATION"},{"type":"September 2018","content":"DATE"}],"hashtag":["Kraken","Legal","SEC","USA"],"authors":["Sead Fadilpašić"]}