{"summary":"India’s FIU Ban: Local Players Offer Haven for Binance, OKX Users","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/navigating-the-fiu-ban-indian-crypto-exchanges-offer-haven-for-binance-and-okx-users.htm","publishDate":"2024-01-16T14:56:49","id":20506,"type":null,"title":"India’s FIU Ban: Local Players Offer Haven for Binance, OKX Users","category":["Blockchain News "],"content":["Following the recent ban by India’s Ministry of Finance Financial Intelligence Unit (FIU) on offshore crypto exchanges like Binance, OKX, and others, Indian crypto exchanges are stepping in to offer solutions to affected users.","The FIU’s move has prompted Indian investors to seek secure and compliant alternatives for their crypto assets.","Prominent Indian crypto exchanges, including CoinDCX, WazirX, and BuyUcoin, are rolling out initiatives to facilitate the seamless transfer of assets from banned foreign crypto exchanges.","","CoinDCX has allocated a $1 million fund to aid users in transferring their assets to compliant platforms. The exchange is offering hassle-free crypto deposits, accompanied by a 1% bonus, to support a smooth transition, it said in an announcement.","To stay eligible, wait until February 17, 2024, for withdrawals. The bonus is only valid for deposits until January 18, 2024. No bonus on INR deposits.\nNote: Receive BONUS payouts of up to ₹10,000 on February 18, 2024. Know more: https:\/\/t.co\/tJAISlamOg","— CoinDCX: India's Safest Crypto Platform (@CoinDCX) January 13, 2024","","As reported earlier, CoinDCX reported a nearly 2,000% surge in deposits since offshore exchanges were served with a show-cause notice.","BuyUcoin has announced zero-fee transfers","for users looking to move assets from offshore exchanges, aligning with the FIU ban.","In a statement from November last year, CEO Shivam Thakral expressed support for FIU’s measures. The statement emphasized the importance of investor protection and adherence to capital flight rules, saying:","“I believe our registration with the FIU is a testament to our commitment to operating with the ethical standards and protecting our customers and the financial system from the risks of money laundering and other. We are looking forward to working with the FIU and other regulatory bodies to combat money laundering and terrorism financing.”","","WazirX has introduced a 1% bonus for users transferring their crypto holdings to its platform.","⚡️ WazirX Deposit Dhamaka is Back ⚡️","Deposit crypto 🔄 Earn 1% bonus in crypto, i.e, if you deposit #BTC, you will receive a bonus in $BTC","» Valid for 27 coins\n» Reward for users who only HODL or trade for 30 days\n» 3 random lucky users will also win $WRX worth ₹9,999\n» Go,… pic.twitter.com\/vccxamWUal","— WazirX: India Ka Bitcoin Exchange (@WazirXIndia) January 12, 2024","","The well-known Indian exchange has witnessed significant growth in various metrics. This includes a 42.3% increase in P2P transactions, a 253% surge in spot trading volume, and a 114% rise in deposits (in crypto and Indian rupees) from November to January compared to the prior three months.","","Back in December, the FIU issued notices of non-compliance to several foreign crypto exchanges, including Binance, Huobi, Kraken, and others, for operating illegally in India.","The notice prompted Apple’s Indian app store to block foreign crypto exchanges, and Google’s app store followed suit.","Not surprisingly, the removals from the app store has created to a sense of urgency among users who had turned to offshore exchanges to avoid a 30% crypto tax."],"entity":[{"type":"India’s Ministry of Finance Financial Intelligence Unit (FIU","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"114%","content":"PERCENT"},{"type":"November last year","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"253%","content":"PERCENT"},{"type":"January 13, 2024","content":"DATE"},{"type":"2,000%","content":"PERCENT"},{"type":"$BTC","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"February 18, 2024","content":"DATE"},{"type":"42.3%","content":"PERCENT"},{"type":"February 17, 2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"January 18, 2024","content":"DATE"},{"type":"Thakral","content":"ORGANIZATION"},{"type":"$WRX","content":"MONEY"},{"type":"India Ka Bitcoin Exchange","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"WazirX Deposit Dhamaka","content":"ORGANIZATION"},{"type":"FIU","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"January 12, 2024","content":"DATE"},{"type":"Huobi","content":"PERSON"}],"hashtag":["Binance","India","OKX"],"authors":["Fredrik Vold"]}