{"summary":"HashKey Group COO: Hong Kong’s Crypto Rules Might Limit Global Appeal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hashkey-coo-hong-kongs-crypto-rules-might-limit-global-appeal.htm","publishDate":"2024-04-12T05:35:03","id":20501,"type":null,"title":"HashKey Group COO: Hong Kong’s Crypto Rules Might Limit Global Appeal","category":["News "],"content":["HashKey Group COO Livio Weng is reportedly concerned Hong Kong’s recent regulations around crypto trading may impede access for international clients.","Hong Kong’s regulatory framework mandated that all crypto exchanges operating within the city must submit applications for regulatory approval by February this year. In response, 24 companies, including prominent players such as Bybit, OKX, and Crypto.com, applied for these licenses.","Crypto exchanges that failed to submit license applications are required to discontinue services by May.","Weng recently told the Financial Times that HashKey’s decision to launch a Bermuda-licensed exchange this week was partly due to concerns that Hong Kong’s new regulations might restrict access for international investors.","He said they create significant barriers for “a lot of global users” seeking to participate in the Hong Kong market. He further cautioned that issuing an excessive number of licenses could be detrimental to Hong Kong, considering the limited size of its domestic market.","HashKey currently holds one of only two licenses granted for digital asset exchanges in Hong Kong. The other licensed exchange, OSL, recently completed a sale of nearly 30% of its stake to BGX. While details remain unclear, sources familiar with the deal reportedly described BGX as an unlicensed cryptocurrency group with ties to China.","These developments have cast doubt on the long-term sustainability of operating under Hong Kong’s current regulatory framework for crypto exchanges, despite continued interest from new companies seeking to enter one of the world’s most dynamic crypto trading markets.","The current regulations restrict exchange clientele to individuals who pass know-your-customer (KYC) checks. They must also possess funds within a local bank account or accounts held in a limited selection of approved overseas jurisdictions.","TON Foundation has partnered with HashKey to support the “open network” and “increase access” to fiat on and off-ramps for Telegram wallet users in the Asia-Pacific Region.","In an announcement, TON Foundation and HashKey said they will continue to work together to improve the TON ecosystem’s accessibility and user experience as part of their shared commitment to integrating cryptocurrency and blockchain technology into daily ife."],"entity":[{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"HashKey Group COO Livio Weng","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"February this year","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"BGX","content":"ORGANIZATION"},{"type":"Pacific Region","content":"LOCATION"},{"type":"HashKey","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["HashKey","Hong Kong"],"authors":["Shalini Nagarajan"]}