{"summary":"Liquidations Spike as Crypto Market Corrects","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/liquidations-spike-as-crypto-market-corrects.htm","publishDate":"2021-09-07T10:21:00","id":20509,"type":null,"title":"Liquidations Spike as Crypto Market Corrects","category":["Ethereum News "],"content":["After seeing higher prices across the board earlier in the day, the crypto market turned south on Tuesday starting at around 8 UTC. ","At 09:50 UTC, the number one cryptocurrency bitcoin (BTC) was down by more than 1% in a day, trading just below the USD 51,000 mark, while ethereum (ETH) had dropped by 5% to trade at just over USD 3,700.","The sudden price drop appears to have taken crypto derivative traders by surprise, with a clear spike in liquidations of “long” positions of all cryptoassets seen across exchanges. Long liquidations reached more than USD 200m at 10 am UTC, marking a sharp rise from just USD 38m an hour earlier, per Bybt data.","According to data from the same site, nearly half of all the liquidations seen in the last hour came from the Bybit derivatives exchange, followed by Binance with 30% of the liquidations. Out of all the assets traded, ETH was the worst hit in the past hour, with nearly USD 35m liquidated during the hour.","The ETH-led selloff comes just hours after reports of new all-time highs in open interest for ETH futures, with popular crypto influencer Lark Davis calling the ETH market “mega bullish and going long in a serious way.”","Open interest for #ethereum futures have just hit a new all time high! The market is mega bullish right now and going long in a serious way pic.twitter.com\/fLyqnw6vSe"," ","\n____\nLearn more:\n– ETH Decouples from BTC with Use Cases & Competition in Focus \n\n "],"entity":[{"type":"Lark Davis","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Use Cases & Competition in Focus","content":"ORGANIZATION"}],"hashtag":["Altcoins","Bitcoin","Derivatives","Ethereum","Market"],"authors":["Fredrik Vold"]}