{"summary":"Groundbreaking Debut for Bitcoin ETFs, Garnering $4.5 Billion on Day One","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/groundbreaking-debut-for-bitcoin-etfs-garnering-4-5-billion-on-day-one.htm","publishDate":"2024-01-12T14:56:59","id":20508,"type":null,"title":"Groundbreaking Debut for Bitcoin ETFs, Garnering $4.5 Billion on Day One","category":["Bitcoin News "],"content":["The new spot Bitcoin ETFs made a significant impact when they debuted on Wall Street on Thursday, collectively amassing $4.5 billion in volume on their first day of trading.","The impressive debut exceeded market observers’ expectations, reflecting the strong appetite for Bitcoin among traditional investors who prefer to hold ETF shares rather than BTC directly.","The launch of spot Bitcoin ETFs is considered a significant development for the number one cryptocurrency after a decade of SEC denial.","BlackRock’s iShares Bitcoin Trust, trading under the ticker IBIT on the Nasdaq exchange, played a prominent role, accounting for around $1 billion in trading volume and representing 22% of the total volume across all 10 spot Bitcoin products.","In terms of pure price performance, however, IBIT closed the day down 4.6% to a price of $26.62.","","The debut witnessed a change in the list of trading spot Bitcoin funds, with Hashdex, which did not file its S-1 form along with other ETF issuers before the launch date, missing.","The SEC initially included Hashdex’s ETF in its approvals. Still, Hashdex clarified that the permission was not for a new fund but instead for its Hashdex Bitcoin Futures ETF to be converted into a spot Bitcoin ETF.","The conversion is pending SEC review, and once finalized, it means 11 spot BTC ETFs will be trading on US exchanges.","","While BlackRock naturally grabbed much attention due to its sheer size, Grayscale, a crypto-native firm in the asset management space, also achieved success.","The Grayscale Bitcoin Trust marked an all-time high daily volume of 56 million shares on the debut day.","Notably, GBTC has a 10-year history and stands out in the ETF lineup as an existing Bitcoin investment product for accredited investors.","","On X, at least one popular member of the crypto community argued that the ETF launch had been “terribly unsuccessful” due to the fact that outflows from Grayscale’s Bitcoin Trust (GBTC) made up around 50% of the sector’s overall trading volume.","However, the argument was later countered by Bloomberg Intelligence’s senior ETF analyst Eric Balchunas, who instead called the launch a “TERRIBLY HUGE SUCCESS.”","“By all metrics: volume, # of trades, flows, media coverage, it was smashing success, historical,” Balchunas wrote.","Lot of ppl sending me this tweet. On one hand, if GBTC outflows were big, he's right it was net neutral day for btc buy\/sell by ETFs. On the other, it was a TERRIBLY HUGE SUCCESS. By all metrics: volume, # of trades, flows, media coverage it was smashing success, historical. And… https:\/\/t.co\/KSgET11sR1","— Eric Balchunas (@EricBalchunas) January 12, 2024","",""],"entity":[{"type":"ppl","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"4.6%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$26.62","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Hashdex","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"January 12, 2024","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Bitcoin","ETF"],"authors":["Fredrik Vold"]}