{"summary":"Shiba Inu Price Prediction as New York-based VanEck’s Subsidiary Launches Meme Coin Fund – Will SHIB Skyrocket?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shiba-inu-price-prediction-as-new-york-based-vanecks-subsidiary-launches-meme-coin-fund-will-shib-skyrocket.htm","publishDate":"2024-05-09T12:32:32","id":20518,"type":null,"title":"Shiba Inu Price Prediction as New York-based VanEck’s Subsidiary Launches Meme Coin Fund – Will SHIB Skyrocket?","category":["Price Predictions "],"content":["SHIB has dropped by 1.5% today, with the Shiba Inu price landing on $0.00002242 as the crypto market suffers a 1% loss in the past 24 hours.","The meme token remains up by a very modest 1.5% in a week, although it has also witnessed 10% fall in a fortnight and a 20% decline in a month.","However, it’s not all bad news today, with VanEck subsidiary MarketVector launching a meme coin fund yesterday.","Such a fund could potentially boost SHIB’s price over time, especially when the coin is the second-biggest component of the fund, after Dogecoin.","","It’s clear that SHIB is in the middle of a slump, yet its recent history suggests that it will enjoy a rebound quite soon.","Its 30-day average (orange) fell below the 200-day (blue) a couple of days ago, and is now quite low, suggesting that the market is overselling it.","Likewise, the coin’s relative strength index (purple) has remained below 50 since Monday, also suggesting that the time is ripe for an uplift.","Yet it’s worth pointing out that SHIB’s support level (green) has lowered in recent days, implying that the coin is too weak to prevent further losses in the near term.","However, the negative outlook may be about to change, with this week seeing the aforementioned news that MarketVector – a subsidiary of major New York-based institution VanEck – has opened its own meme token fund.","VanEck's MarketVector launched #MEMECOIN index.\nIt means money will be on #memecoins this cycle as it showed itself during Q1 euphoria.\nI might rotate some bags to strong meme coins. pic.twitter.com\/SdJEPqgFUc","— Johnny Woo | Never DM you for Money (@j0hnnyw00) May 9, 2024","","As the tweet above shows, SHIB comprises 28.34% of the overall fund, ahead of PEPE but slightly behind Dogecoin.","This index launch could mean that we will see higher volumes for SHIB over the coming weeks and months, helping its price to pick up.","More generally, its oversold status at the moment would also point to incoming recoveries, while expected rate cuts will bring market-wide positivity in later months.","And what helps SHIB more than its rivals is that it has some of the strongest fundamentals of any meme token, given its recent efforts to expand its ecosystem and utility.","Most recently, developers announced that it would soon be launching a privacy-focused layer-three network, for which it raised $12 million in funding last month.","As such, things still look very good for the coin, with the Shiba Inu price likely to reach $0.00004 by the end of summer.","While the new VanEck fund could help instigate a meme token season sooner or later, SHIB won’t be the only coin to benefit from increased demand.","There are also a wide variety of new meme coins in the market, with some of these holding real potential.","At the top of any list of promising new tokens is Dogeverse (DOGEVERSE), a multi-chain crypto that has raised over $13 million in its ongoing presale.","Which blockchain do you stand by? 🤷‍♂️","$DOGEVERSE goes #MultiChain 🚀","🌞 #Solana\n🔗 #Ethereum\n❄️ #Avalanche\n🏗️ #Base\n🔷 #Polygon\n🪙 #BNB Chain","Comment below and tell us why you love your chosen chain! #MemeCoinSeason #BabyDoge #ETH #SOL $DOG pic.twitter.com\/8oOISipjMM","— DogeVerse (@The_DogeVerse) April 29, 2024","","Launching on Ethereum, DOGEVERSE will also bridge to Polygon, BNB Chain, Solana, Avalanche and Base, making it crypto’s first multi-chain Doge-themed cryptocurrency.","This is bullish insofar as the ability to use the coin on multiple networks will increase its use and adoption, with DOGEVERSE potentially gaining traction on numerous dApps.","One other thing it has over the original Dogecoin is that it has a fixed supply of 120 million tokens, making it potentially deflationary over time.","By squeezing supply, DOGEVERSE’s price is likely to rise higher than it may have otherwise, a process likely to be amplified by the ability to stake the token.","","In theory, the token’s existence on multiple chains could make for more holders than usual staking the coin, something which will magnify the coin’s chances even further.","Investors can participate in its sale by visiting the official Dogeverse website, where 1 DOGEVERSE costs $0.00031.","This is its final presale price, meaning that it may rise much higher once it lists on exchanges in the next few weeks.","Buy DOGEVERSE Today",""],"entity":[{"type":"$0.00004","content":"MONEY"},{"type":"VanEck –","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"Today","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"$13 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"May 9, 2024","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"28.34%","content":"PERCENT"},{"type":"$DOGEVERSE","content":"MONEY"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"$0.00002242","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"Dogecoin","content":"LOCATION"},{"type":"1.5%","content":"PERCENT"},{"type":"April 29, 2024","content":"DATE"},{"type":"$DOG","content":"MONEY"},{"type":"VanEck","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$0.00031","content":"MONEY"}],"hashtag":["Meme Coins","Price Prediction","SHIB"],"authors":["Simon Chandler"]}