{"summary":"Bitcoin Miner Hut 8 CEO Departs Amid Pump and Dump Allegations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hut-8-ceo-departs-amid-pump-and-dump-allegations.htm","publishDate":"2024-02-08T15:56:28","id":20519,"type":null,"title":"Bitcoin Miner Hut 8 CEO Departs Amid Pump and Dump Allegations","category":["Bitcoin News "],"content":["The CEO of Bitcoin miner Hut 8 has departed the role weeks after JCapital accused the company of colluding with partners and warnings over a possible pump-and-dump scheme.","In a Feb 7 press release, the company disclosed a change in leadership, announcing Asher Genoot as the new Chief Executive, replacing Jamie Leverton.","Hut 8 announces leadership transition: President Asher Genoot appointed CEO https:\/\/t.co\/wVAk5Dzl0n.","— Hut 8 (@Hut8Corp) February 7, 2024","","“(Hut 8) today announced that Asher Genoot, President and a member of the Hut 8 Board of Directors, has been appointed Chief Executive Officer effective immediately. Mr Genoot succeeds Jamie Leverton, who departs from Hut 8 as Chief Executive Officer, effective immediately.”","The company cited the need for a new strategic direction as a reason for a change in leadership following its recent partnership with US Bitcoin Corp.","Leverton thanked the Board for years of service, adding that it was a privilege to lead the team with its innovative policies over the years.","Bill Tai, the Chairman of the Board, highlighted that the partnership between both companies was a transformational moment. The new CEO, Asher Genoot, is expected to take the company to a leadership position. Aiming for accelerated growth, Tai believes Genoot’s discipline and proven track record will yield results.","Genoot was the co-founder and President of US Bitcoin Corp and US Data Mining Group and served as the Director of Hut 8 from November 2023 following the partnership.","Per the statement, Genoot added that he will try to exceed expectations in the new chapter.","“Over the last three years, Jaime has led Hut 8 through market cycles and built a strong foundation for the Company. I am thankful for her leadership, and I am committed to ensuring a smooth transition. As I work with the Board to define a new strategy for the Company, I am focused on strengthening operations, driving profitable growth, and creating lasting shareholder value.” ","This development comes almost three weeks after JCapital Research accused Hut8 of hiding shareholder information from the recent partnership with US Bitcoin Corp.","The allegations also included inflation of the values of US Bitcoin Corp as well as a probe into its promoters with a history of legal troubles warning investors of a potential pump and dump scheme.","“Ultimately, we strongly believe that [HUT] shareholders are likely to feel the pain of being on the wrong side of an over-levered pump-and-dump, only to be left holding the most inefficient Bitcoin miner, which is unprofitable even at a Bitcoin price of over $60,000.”","Following the report, Hut 8 released a statement denying the accusations and urging investors to read official Securities and Exchange Commission (SEC) documents.","Hut 8 responds to recent short report that is “filled with inaccuracies, misrepresented data, speculative claims, and unfounded character attacks.” CEO @jaimeleverton said, “Our Board of Directors and management team continue to have full confidence in our merger of equals and we…","— Hut 8 (@Hut8Corp) January 24, 2024","","Referring to the report as inaccurate, the Board expressed total commitment to the merger, highlighting its long-term vision."],"entity":[{"type":"February 7, 2024","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Jamie Leverton","content":"PERSON"},{"type":"US Bitcoin Corp","content":"ORGANIZATION"},{"type":"“Our Board of Directors","content":"ORGANIZATION"},{"type":"Bill Tai","content":"PERSON"},{"type":"JCapital Research","content":"ORGANIZATION"},{"type":"January 24, 2024","content":"DATE"},{"type":"Asher Genoot","content":"PERSON"},{"type":"Jaime","content":"PERSON"},{"type":"Bitcoin miner Hut 8","content":"ORGANIZATION"},{"type":"US Data Mining Group","content":"ORGANIZATION"},{"type":"Genoot","content":"PERSON"},{"type":"Board","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"8 Board of Directors","content":"ORGANIZATION"},{"type":"Leverton","content":"PERSON"}],"hashtag":["Bitcoin","HUT 8","Mining"],"authors":["David Pokima"]}