{"summary":"Swiss Bank SGKB Partners with SEBA for Crypto Custody and Trading Services","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/swiss-bank-sgkb-partners-with-seba-for-crypto-custody-and-trading-services.htm","publishDate":"2023-11-02T10:59:22","id":20521,"type":null,"title":"Swiss Bank SGKB Partners with SEBA for Crypto Custody and Trading Services","category":["Finance News "],"content":["Switzerland’s fifth largest cantonal bank, St.Galler Kantonalbank (SGKB), has partnered with SEBA Bank to offer custody and trading services for Bitcoin and Ethereum.","SGKB announced that the service is initially available to a select group of wealth-management clients at SGKB with future plans to expand the offering to retail customers soon.","Christian Bieri, Head of B2B and Custody Solutions at SEBA Bank, said in an interview with The Block, “St.Galler Kantonalbank and SEBA signed the contract earlier this year, after a short implementation project, SGKB is now ready to offer access to cryptocurrencies to a selected group of clients.”","Bieri stated that the bank currently focuses on bitcoin and Ethereum with an intent to include more cryptocurrencies based on clients’ demand. “In a first step bitcoin and ether, other currencies will follow shortly,” said Bieri.","This move marks SGKB’s first step into the digital asset space, driven by growing client interest in cryptocurrencies. The bank sees this move as a way to meet the clients’ evolving financial preferences.","Falk Kohlmann, Head of Market Services at SGKB, shared his positive outlook on the collaboration. “Thanks to our cooperation with SEBA Bank, we’ve implemented a straightforward initial setup, which allows us to learn and grow well aligned to our clients’ needs,” Kohlmann said.","The partnership reflects a wider trend in Switzerland, with more banks expanding their service portfolios to include cryptocurrency offerings. Started with private and high-profile individuals, these services are now opening up to retail customers, labeling a significant shift in the Swiss banking sector’s convention towards digital assets."],"entity":[{"type":"Christian Bieri","content":"PERSON"},{"type":"SEBA","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Head of Market Services","content":"ORGANIZATION"},{"type":"SEBA Bank","content":"ORGANIZATION"},{"type":"Kohlmann","content":"PERSON"},{"type":"Falk Kohlmann","content":"PERSON"},{"type":"Bieri","content":"PERSON"}],"hashtag":["Banking","Bitcoin","Ethereum"],"authors":["Hongji Feng"]}