{"summary":"PayPal Receives UK’s FCA Approval to Offer Crypto Services to UK Nationals","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/paypal-receives-uks-fca-approval-to-offer-crypto-services-to-uk-nationals.htm","publishDate":"2023-11-01T17:13:40","id":20529,"type":null,"title":"PayPal Receives UK’s FCA Approval to Offer Crypto Services to UK Nationals","category":["Altcoin News "],"content":["Payments giant PayPal has become the latest to secure a cryptoasset registration from the UK’s Financial Conduct Authority (FCA).","According to the update on the FCA’s crypto register, the regulator issued registration to PayPal UK Limited on 31 October. The registration would allow the company to offer crypto services in the UK as the country continues to tighten the regulatory environment on the digital asset sector.","The registration approval comes months after PayPal UK temporarily suspended crypto purchases for its customers in the UK. The move would help PayPal to comply with the recent new rules for marketing cryptoassets enacted by the FCA.","PayPal confirmed at the time that crypto sales will be re-enabled in early 2024 and assured that user assets are safe.","The UK’s regulator has approved four crypto service providers so far in 2023, including PayPal, Komainu, Bitstamp and Interactive Brokers. In total, 43 cryptoasset firms have registered with the FCA since August 2020.","UK’s watchdog revised guidelines, necessitating additional criteria and prerequisites for crypto entities before facilitating crypto purchases for their clients.","The rule also brings crypto marketing and promotions into the regulator’s remit. The marketing rule came into effect following research from the watchdog that revealed a drastic increase in crypto ownership.","PayPal has been consistently working closely with the regulators to adhere to applicable rules and regulations in the crypto market. Recently, the company revealed PayPal USD (PYUSD) stablecoin, followed by the inauguration of a dedicated cryptocurrency hub on its platform."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"Komainu","content":"LOCATION"},{"type":"Interactive Brokers","content":"ORGANIZATION"},{"type":"PayPal UK Limited","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"UK’s Financial Conduct Authority (FCA","content":"ORGANIZATION"}],"hashtag":["PayPal"],"authors":["Sujha Sundararajan"]}