{"summary":"EthereumPoW Fork Won’t ‘Significantly’ Harm Ethereum – Vitalik Buterin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereumpow-fork-wont-significantly-harm-ethereum-vitalik-buterin.htm","publishDate":"2022-08-08T09:57:00","id":20528,"type":null,"title":"EthereumPoW Fork Won’t ‘Significantly’ Harm Ethereum – Vitalik Buterin","category":["Ethereum News "],"content":[" ","Another hard fork won’t “significantly” harm Ethereum (ETH) and “pretty much everyone” in the Ethereum ecosystem is supportive of The Merge, when the network transitions from a proof-of-work (PoW) system to proof-of-stake (PoS), according to Ethereum co-founder Vitalik Buterin.","His remarks come after some crypto miners, including prominent Chinese miner Chandler Guo, have expressed intentions to fork Ethereum as it moves to PoS, making miners obsolete. ","“I don’t expect Ethereum to really be significantly harmed by another fork,” Buterin said in a webinar this past weekend, per Fortune.","“My impression from pretty much everyone I talked to in the Ethereum ecosystem is that they’ve been completely supportive of the proof-of-stake effort and united around it,” he was quoted as saying. ","For now, the much-anticipated Merge upgrade is expected to go through as soon as September. Ethereum supporters are excited about the upgrade, which should improve the network’s efficiency and reduce its environmental impact. ","However, Ethereum miners, whose earnings are at stake following the upgrade given that it would remove the need for miners to secure the network, are not seemingly happy. To keep their income, they are advertising for a potential continued “ETH PoW” (“Ethereum proof-of-work”) chain post-upgrade. ","The Ethereum mastermind claimed that those pushing for a fork are mostly “a couple of outsiders that basically have exchanges and most just want to make a quick buck.” ","“So, I’m not expecting it to have substantial long-term adoption, just because I think Ethereum Classic [ETC] already has a superior community and superior product for people pro-proof-of-work,” noting that still there might be “a couple of splats” as Ethereum shifts. ","Buterin was also quoted as saying that if a PoW fork turns out to be a success, a lot of decentralized applications would have “to choose one way or the other,” which could cause a lot of market confusion and problems: “I hope that whatever happens doesn’t lead to people losing money.”","While there might be different attempts to fork the Ethereum blockchain, one that has already found some traction is called EthereumPOW. Spearheaded by Guo, the attempt reportedly has the support of several Chinese companies manufacturing Ethereum mining equipment. (As reported, in July, Bitmain launched its new Ethereum mining rig, AntMiner E9, despite Ethereum’s move to PoS.)","Meanwhile, even this attempt ostensibly does not have a big community of supporters. For example, looking at their donation address, it received less than USD 3,000 in ETH in six days. ","Literally nobody will use that shit. Its just to generate money for yourself lol.\nWhy pay high gasfees if I can do transactions gasless?","In either case, some exchanges have already indicated that they’re going to use this potential ETH fork to increase their trading revenues.","Bitcoin Cash futures started trading before Bitcoin Cash existed, if my memory is correct","At 09:43 UTC, ETH trades at USD 1,774 and is up 5% in a day and a week. It’s also up 44% in a month. Meanwhile, ETC, which gained traction with miners pledging to move to it after The Merge, is up 150% in the past month. ETC trades at USD 39 and is also up 4% in a day and almost 8% in a week.","___\nLearn more: \n– Justin Sun, Poloniex Back Plan to Create a PoW Ethereum Hard Fork\n– Hayes Asks ‘Forgiveness’ for Calling Ethereum a Shitcoin, Doubles Down on ETH\n\n– If Ethereum Splits, Leading Exchanges are ‘Likely’ to List ETHPoW Token – BitMEX\n– Vitalik Buterin says The Merge is Not ‘Priced in’ as Investor Promises to Fork Ethereum\n\n– 6 Key Points in Vitalik Buterin’s Vision for Ethereum Presented at EthCC\n– Ethereum Classic Rallies Again, Outperforms Ethereum YTD – But What Does History Show?"],"entity":[{"type":"8%","content":"PERCENT"},{"type":"Hayes","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"Justin Sun","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"44%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"past weekend","content":"DATE"},{"type":"Buterin","content":"PERSON"},{"type":"AntMiner E9","content":"ORGANIZATION"},{"type":"EthCC\n– Ethereum Classic Rallies Again","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"150%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Chandler Guo","content":"PERSON"},{"type":"Guo","content":"ORGANIZATION"},{"type":"Vitalik Buterin’s Vision","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Ethereum Classic","Hard fork","Mining","Proof-of-stake","Vitalik Buterin"],"authors":["Ruholamin Haqshanas"]}