{"summary":"TOKEN2049 Day 1 Recap: Bullish Views, New BTC, Web2-to-Web3 Bridges, and TradFi Interest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/token2049-day-1-recap-bullish-views-new-btc-web2-to-web3-bridges-and-tradfi-interest.htm","publishDate":"2024-04-30T15:40:10","id":20525,"type":null,"title":"TOKEN2049 Day 1 Recap: Bullish Views, New BTC, Web2-to-Web3 Bridges, and TradFi Interest","category":["Blockchain News "],"content":["The TOKEN2049 conference, held in Dubai this month, was a massive event. It hosted industry leaders and featured meetups, workshops, networking events, hackathons, and much more.","Cryptonews was there, diving into the key insights and highlights through interviews with many of the veteran and rising industry figures alike.","The venue was stunning, and the atmosphere was electric. “There was a certain buzz in the air that wasn’t felt at crypto conferences since late 2021 \/ early 2022,” Cryptonews Podcast host Matt Zahab said.","Collocutors talked about interesting ways of getting to an event, unexpectedly stimulating the local economy, about the crypto market, bullish outlooks, the rising impact of Ordinals and Runes, and the new type of wrapped BTC.","They went on to discuss the TradFi and crypto relationship, many innovative solutions for bringing more people into Web3, and much more.","Cryptonews’ Matt Zahab talked to:","You can find each interview on the links above to watch, and you can read what these industry insiders exclusively told Matt below.","Stefan Kimmel, CEO of crypto exchange and investment platform M2, remarked that the recent Bitcoin halving is unlikely to have as much impact on the crypto market as it previously did.","However, macroeconomic policies, US interest rate easing, and spot exchange-traded funds (ETFs) will have a much bigger impact.","“My outlook for the end of the year is very, very bullish,” Kimmel said.","He added that M2 chose Abu Dhabi for its headquarters because it wanted to have clear regulations and rules to protect investors and the company.","","Popular trader Ansem commented on the crypto market and the halving-related event as well.","But he has his eye on a specific sector.","He argues that Ordinals and Runes are going to be big areas in the space.","“There’s a lot of capital there,” he noted.","While Ordinals made it possible to create NFT-like “inscriptions” on Bitcoin, Runes – launched on the halving day – are fungible or interchangeable tokens.","Speaking of Bitcoin at TOKEN 2049, Aki Balogh, Founder of DLC Link, told us about their dlcBTC and what differentiates it from wrapped BTC (wBTC).","This is a new way to wrap Bitcoin, enabling people to use BTC in DeFi.","WBTC is minted by institutions (merchants) who send BTC to BitGo, which then puts it into a wallet and sends back an ERC20 coin, Balogh said.","This process is done through a single centralized entity. But the whole reason we’re in crypto is to remove centralized entities, he said.","In the case of dlcBTC, the merchants don’t bridge or send BTC anywhere, including to DLC Link, instead self-wrapping it: locking BTC themselves, using the discreet lock contract (DLC) in Bitcoin Layer 1.","This removes a single point of failure within this system.","","Some of the biggest players in the TradFi space are interested in nodes, infrastructure, staking, and digital asset wallets.","There are two reasons for that, said Luke Dorney, General Manager for US and Europe at the blockchain infrastructure company BlockDaemon.","The first is servicing clients who potentially want to buy crypto.","Based on the company’s conversations with its investors – such as JPMorgan, Citibank, and Goldman Sachs – most banks want to enable their clients to hold and trade BTC and ETH.","“Probably not much further than that at the moment,” as regulations make it “quite hard.”","The second reason is the tokenization of real-world assets (RWAs), such as bonds and equities.","While crypto is bringing novelty to TradFi, the old system has something to teach it as well.","According to John Glover, CIO at retail lender Ledn, risk management saved this company from going under following the FTX disaster.","This is what Glover learned from his over two decades of experience in stringent risk management.","Ledn didn’t take risks, did proper credit underwriting, and knew whom they were lending and how much money was safe to lend them.","Additionally, “We’ve been the beneficiary of all those people going under,” Glover said.","The company saw borrowers wanting to take advantage of the recent rally to borrow dollars to buy more BTC.","However, given the disgraceful fall of so many lenders in such a short time, retail borrowers don’t have as many options now and are very careful about whom they are borrowing from.","","Illia Polosukhin, co-founder of the popular Near blockchain, noted that Near began as an AI company.","It added blockchain into the mix as it needed ownership, identity, payments, and other elements of a collaborative effort.","There are now various projects building on Near, with a number of use cases, but the team is also building internal projects to add more capability—with more info coming “in a few weeks.”","Per the co-founder, “we’re going to be talking more about the broader vision of this operating system and user-owned AI, which continue building on the infrastructure that’s needed to achieve this global vision.”","Notably, there are now also projects combining AI to access Web3, DeFi, and chain abstraction.","The bull market is helping bring attention to crypto, said Oleg Fomenko, CEO of Sweat Economy.","At this exciting time, the team announced three exciting developments.","One is chain abstraction from the NEAR Protocol: Sweat is starting with the abstraction of BNB, enabling cross-chain activity for users.","The second is magic keys: enabling users to recover their keys just by having control over their email addresses.","Finally, Sweat Economy has enabled the Arabic language in the Sweat Wallet for millions of users who requested it.","","One of the biggest challenges today is bringing people into the Web3 world, argued Gerald Heydenreich, Founder of EtherMail.","It’s not very convenient for a regular user to do it.","That’s why the team offered a solution: sign in with EtherMail. Users just need to register on the EtherMail site with their own email (0for example Gmail).","Then, EtherMail creates an email and noncustodial wallet for them, turning “your Gmail into a wallet essentially.”","Companies can put the ‘sign in with EtherMail’ button on the website, making it easy for people to onboard from Web2 to Web3.","Another novel feature is advertising: companies engage with EtherMail on advertising campaigns, and EtherMail gives a percentage of earnings to users interacting with those emails.","Web3 entertainment company U-topia wanted to help the world, said its CEO Emmanuel Quzada.","It started as a project to help children get into Web3, and it has grown “super-big” in the last three years.","The company is working with governments globally to regulate crypto, currently specifically focusing on work with children.","Additionally, the CEO and his family are moving into the political sphere in Mexico.","Quezada’s brother, Daniel Quezada, is running for mayor of Mexico’s largest state, Chihuahua, with his party, Partido Pueblo. He will run for President in 2030.","","Furthering the Web3 onboarding narrative, we enter the physical infrastructure networks (DePIN) sphere.","Kerem Ozkan, Co-Founder of a Layer-1 DePIN Soarchain, told us that this platform is designed for mobility – because cars today are turning into “smartphones on wheels.”","But what we don’t have today is an infrastructure to serve those cars and improve mobility experiences.","Additionally, the car industry is fragmented. There isn’t a decentralized ecosystem to serve the new and growing industry of enhanced cars.","This is what Soarchain is here to do, Ozkan said.","The infrastructure must progress on all fronts.","Siddharth Lalwani, Co-Founder and CEO of Skate, said that this team is creating infrastructure that can be deployed once and run the same state on all chains.","They are working to solve not just the issue of the fragmentation on the liquidity level but the one on the application level, “where you need to have a generalized infra,” Lalwani said.","Therefore, Skate is working on building a universal application layer that would enable apps to run on thousands of chains with one global state.","“It’s like an application oracle,” he said.","","And speaking of oracles…","William (Billy) Campana, Developer Relations at the Oracle system API3, argued that there are tons of competitors out there, but API3’s “killer move” is adopting the Oracle extractible value (OEV).","Every information update on-chain costs gas, Campana explained. So, updating every few seconds, as centralized exchanges and other data providers do, would be too expensive.","API3’s product allows users to bid to update the price, creating a “race of opportunity.”","Also, instead of going to the validators, the money goes to the dapp, enabling dapps to make money instead of losing it.","They “get paid to do the liquidation and get the reward,” Campana said.","__________","Joins us for TOKEN2049 Day 2 recap tomorrow!","Many more fascinating chats to come."],"entity":[{"type":"Kimmel","content":"PERSON"},{"type":"Luke Dorney","content":"PERSON"},{"type":"Siddharth Lalwani","content":"PERSON"},{"type":"Stefan Kimmel","content":"PERSON"},{"type":"Skate","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"John Glover","content":"PERSON"},{"type":"Balogh","content":"PERSON"},{"type":"Glover","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Emmanuel Quzada","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last three years","content":"DATE"},{"type":"Skate","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Chihuahua","content":"LOCATION"},{"type":"Ozkan","content":"PERSON"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Soarchain","content":"PERSON"},{"type":"Aki Balogh","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"2049","content":"DATE"},{"type":"Oleg Fomenko","content":"PERSON"},{"type":"Daniel Quezada","content":"PERSON"},{"type":"Kerem Ozkan","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Partido Pueblo","content":"PERSON"},{"type":"William (Billy) Campana","content":"PERSON"},{"type":"Gerald Heydenreich","content":"PERSON"},{"type":"” Campana","content":"ORGANIZATION"},{"type":"Sweat Economy","content":"ORGANIZATION"},{"type":"Mexico","content":"LOCATION"},{"type":"General Manager for US","content":"ORGANIZATION"},{"type":"Lalwani","content":"PERSON"},{"type":"early 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"EtherMail","content":"ORGANIZATION"},{"type":"Matt Zahab","content":"PERSON"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"DLC","content":"ORGANIZATION"},{"type":"Citibank","content":"ORGANIZATION"},{"type":"Matt","content":"PERSON"}],"hashtag":["Bitcoin","Blockchain","DeFi"],"authors":["Sead Fadilpašić"]}