{"summary":"2024: The Year AI and Crypto Converge – Major Boom Incoming?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/2024-the-year-ai-and-crypto-converge-major-boom-incoming.htm","publishDate":"2023-12-28T11:36:24","id":20524,"type":null,"title":"2024: The Year AI and Crypto Converge – Major Boom Incoming?","category":["Blockchain News "],"content":["As we approach 2024, analysts foresee a convergence of artificial intelligence (AI) and web3 technologies leading to a flourishing subsector within the crypto space.","The maturation of both AI and crypto has paved the way for innovative developments that could redefine the landscape of digital assets, according to analysts The Block spoke with for a recent article.","According to Sandra Leow, an analyst at blockchain analytics platform Nansen, the emergence of so-called AI agents is an important development that incorporates elements from both AI and web3.","AI agent are on-chain bots that could play a pivotal role in processing transactions and exchanging value autonomously.","Leow said in the article that she sees a future where AI agents become a primary category of users on the blockchain, citing examples such as verification management applications using zero-knowledge learning technologies.","Like Leow, crypto exchange Gemini’s 2024 Crypto Trend Report underscored the potential of integrating AI and web3 to enhance privacy, data ownership, and human-generated content identification.","The report specifically pointed the symbiotic relationship between decentralized crypto and centralized AI, which it said has the potential to mitigate the weakness of centralization in AI.","Opportunities for privacy-enhanced machine learning through web3 innovations like zero-knowledge proofs were also highlighted in the report.","Moving over to generative AI, the report suggested that as this technology develops further, an increase in deep fake scams should be expected.","It added that this will soon necessitate a reliance on on-chain attestation technologies to verify the authenticity of content, as people’s default assumption will be that content is fake unless authenticated in some way.","AI-generated metaverses and web3 gaming are also expected to witness significant growth in 2024, with London Real Ventures CEO Brian Rose predicting a game-changing merge of AI and web3.","“At London Real Ventures we believe that web3 gaming will onboard the next one billion users onto the blockchain,” Rose said, adding that AI will be used to build the vast majority of gaming metaverses.","“2024 will not only bring the bull market, but the merge of AI and web3 will be a game changer,” he said."],"entity":[{"type":"Leow","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Rose","content":"PERSON"},{"type":"Crypto Trend Report","content":"ORGANIZATION"},{"type":"Nansen","content":"PERSON"},{"type":"London Real Ventures","content":"ORGANIZATION"},{"type":"Sandra Leow","content":"PERSON"},{"type":"Brian Rose","content":"PERSON"}],"hashtag":["AI"],"authors":["Fredrik Vold"]}