{"summary":"Animoca Brands chair Yat Siu said as recently as November that he wanted to amass $2 billion for the fund.\nHe spoke of a “challenging market” in a Twitter Spaces interview on Jan. 5.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199352\/animoca-halves-fundraising-target-for-web3-fund-to-1-billion-bloomberg","publishDate":"2023-01-05T02:20:08","id":2053,"type":null,"title":"Animoca halves fundraising target for web3 fund to $1 billion: Bloomberg","category":["Institutional Investors"],"content":["Animoca Brands has cut in half the amount it hopes to corral for a new web3 and metaverse investment fund.","Yat Siu, the Hong Kong-based company’s chair, said in a Twitter Spaces interview that it is now looking to raise around $1 billion for Animoca Capital this quarter, according to a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-01-05\/hong-kong-crypto-mogul-aims-to-raise-1-billion-for-web3-fund\" data-v-f87c67ca=\"\">report<\/a>. Siu had <a href=\"https:\/\/asia.nikkei.com\/Editor-s-Picks\/Interview\/Blockchain-group-Animoca-to-form-metaverse-fund\" data-v-f87c67ca=\"\">told Nikkei<\/a> as recently as November that Animoca would target $2 billion for the fund, which will make mid- to late-stage bets in the sector.","The news comes with the crypto sector still reeling from the spectacular collapse of Sam Bankman-Fried’s FTX in November. Around a dozen of Animoca’s portfolio startups were affected, Siu told Bloomberg.","“Q1 is the goal and then let’s see what happens,” Siu told Bloomberg of Animoca Capital’s plans, adding that market conditions may mean the fund raises less than its target. “It is fair to say it’s a challenging market. But we have quite a bit of interest.”","Animoca Brands is one of the most prolific investors in web3, having made more than 380 investments as of Dec. 6, according to a company spokesperson. Accounting for so great a haul of tokens, however, has proven tricky. The company was recently <a href=\"https:\/\/www.theblock.co\/post\/198445\/animoca-brands-allowed-deadline-extension-for-filing-results\" data-v-f87c67ca=\"\">granted an extension<\/a> for filing its audited financial report for 2020, which had originally been due to Australian regulators by the end of last year.","Animoca did not immediately respond to The Block's request for comment.","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>"],"hashtag":[]}