{"summary":"Web3 Lost $127M to Hackers in January 2024 + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-lost-127m-to-hackers-in-january-2024-more-crypto-news.htm","publishDate":"2024-01-31T13:17:54","id":20532,"type":null,"title":"Web3 Lost $127M to Hackers in January 2024 + More Crypto News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In today’s edition:","__________","In January 2024, $126,782,617 went into the hands of hackers and fraudsters across 19 specific incidents, according to the latest report by major bug bounty and security services platform Immunefi.","This is a 6x increase from January 2023, when registered losses were $21,021,800. It’s also a 2.8x increase from December 2023, which recorded losses of $45,369,855.","In January 2024, hacks continued to be the predominant cause of losses compared to fraud, scams, and rug pulls. Hacks account for 96.8% of this month’s total losses, and fraud for 3.2%.","The report notes:","DeFi was the main target for exploits, and CeFi hasn’t witnessed a single major attack.","The most targeted chains were Ethereum and BNB Chain, representing more than 58% of the total losses.","Arbitrum follows them with three incidents and Solana with two incidents. Polygon, Conflux Network, and Optimism saw one incident each.","Most funds were lost in two projects. Orbit Bridge, the bridging service of the cross-chain protocol Orbit Chain, suffered a loss of $81,550,000. Gamee (GMEE token), a blockchain gaming project, saw a loss of $15,000,000.","Meanwhile, Immunefi offers over $157 million in available bounty rewards. It has paid out over $90 million in bounties, while saving over $25 billion in user funds, it said.","Market intelligence company Messari has announced its strategic expansion into Europe with the establishment of its new entity in Dublin, making European crypto news rounds.","According to the press release, this expansion will enable Messari to provide the tools and support for Europe-based businesses, compliance teams, builders, and investors to seamlessly  engage with the digital assets economy.","“With this expansion into Europe, Messari remains unwavering in its mission to provide advanced digital assets market intelligence and data-driven solutions on a global scale, the announcement said.","2\/ As we move into the region, Messari is committed to providing the tools and support for Europe-based businesses, compliance teams, builders, and investors in the region.","Learn more in our press release: https:\/\/t.co\/znZxWuyWv1 pic.twitter.com\/U4wXUatcRb","— Messari (@MessariCrypto) January 30, 2024","","“We are excited to build on our company’s success by extending our presence into Europe. This expansion is influenced by the region’s significant impact on shaping our industry,” said Messari Founder and CEO Ryan Selkis.","“Europe’s sophisticated regulatory framework and Dublin’s strategic location make the city an easy choice for our expansion. As we move into Europe, we aim to serve as a driving force behind the adoption of digital assets among international businesses and individuals,” he added.","In the latest crypto news, fintech provider Portal announced it has exited stealth mode and raised $34 million in seed funding.","Investors include Coinbase Ventures, Arrington Capital, OKX Ventures, and “many other high-profile fintech and crypto investors,” the press release said.","The seed funding builds on Portal’s angel round of $8.5 million, which closed in 2021.","The project will use the funds to develop its two flagship products: Portal DEX (decentralized exchange) and Portal Wallet.","“Portal DEX is the first Bitcoin-based exchange that enables Layer 2 atomic swaps of cryptocurrencies across blockchains at greater speed, lower cost, and with increased transparency, security, and interoperability,” the team said.","Portal Wallet is a fully non-custodial tool that integrates Portal DEX and allows users to receive, store, and send crypto across blockchains.","In the coming months, Portal will launch several new products previously available only to large institutions and hedge funds.","One is an AI-powered, co-pilot investment application for acquiring financial intelligence and maximizing high-level investment strategies.","Another is an application programming interface (API) integration tool for building Portal DEX cross-chain swap functionality into existing wallets, DeFi applications on any chain, and Web3 dapps.","The team will also announce several strategic partnerships with major Bitcoin projects to enhance the utility and accessibility of Bitcoin, which have been bottlenecks for the crypto community, it said."],"entity":[{"type":"January 30, 2024","content":"DATE"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Messari Founder","content":"ORGANIZATION"},{"type":"$8.5 million","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"3.2%","content":"PERCENT"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"$90 million","content":"MONEY"},{"type":"Messari","content":"ORGANIZATION"},{"type":"$157 million","content":"MONEY"},{"type":"$81,550,000","content":"MONEY"},{"type":"$126,782,617","content":"MONEY"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"$34 million","content":"MONEY"},{"type":"$25 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$21,021,800","content":"MONEY"},{"type":"Dublin","content":"LOCATION"},{"type":"Immunefi","content":"ORGANIZATION"},{"type":"$45,369,855","content":"MONEY"},{"type":"Messari","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"58%","content":"PERCENT"},{"type":"December 2023","content":"DATE"},{"type":"$15,000,000","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"96.8%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Blockchain","Europe","Security"],"authors":["Sead Fadilpašić"]}