{"summary":"Shiba Inu Price Prediction as SHIB Experiences a 9.25% Drop – Start of a Downward Trend?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shiba-inu-price-prediction-as-shib-experiences-a-9-25-drop-start-of-a-downward-trend.htm","publishDate":"2023-12-13T12:27:39","id":20538,"type":null,"title":"Shiba Inu Price Prediction as SHIB Experiences a 9.25% Drop – Start of a Downward Trend?","category":["Price Predictions "],"content":["The Shiba Inu price has fallen by 2% in the past 24 hours, with the meme token’s slide to $0.00000941 also marking a 9.25% drop in the past week.","Despite these losses, SHIB remains up by 14% in a fortnight and by 5% in the last 30 days, with the meme token riding the crypto market’s improved exuberance during these periods.","Yet given that SHIB has underperformed relative to many other major tokens this year, it’s arguable that bigger gains remain in store for the meme token in 2024, with growth likely to return following the current dip.","Based on its chart and indicators, SHIB does look like it could be at the beginning of a downward trend.","Its relative strength index (purple) has dropped to around 55 in the past few days, having stood above 70 around a week ago.","At the same time, SHIB’s 30-day average (yellow) looks like it could be weakening, with its recent ascent beyond the 200-day average (blue) slowing down.","Yet it’s hard to say just how bad any incoming fall could be, with the meme token’s support level (green) remaining relatively strong.","In other words, today’s drop may be the worst of it, with SHIB’s trading volume also remaining fairly healthy, at $215 million.","🚨 🚨 4,193,953,460,450 #SHIB (40,823,942 USD) transferred from unknown wallet to unknown wallethttps:\/\/t.co\/ZBibgHTqpE","— Whale Alert (@whale_alert) December 11, 2023","","Much of this volume may have something to do with a couple of big transfers Whale Alert recorded in the past week, with larger traders potentially still accumulating the token.","It would certainly make sense to still be accumulating SHIB, given that the market is still undervaluing the meme coin.","For instance, it has risen by only 6% in the last 12 months, with many major tokens (e.g. BTC, ETH, SOL, XRP) recording year-to-date gains that are well into double-digit percentages.","This means that it has plenty of catching up to do, and could enjoy above-average gains once the market becomes more bullish in early 2024.","Shiba Inu’s steadily improving fundamentals will help it along, with the coin’s ecosystem seeing a number of important launches this year.","#Shibarium total transactions surpass the huge 92M mark. 🤯🔥🔥🚀 LFG#ShibaArmy #Cryptocurency #blackout pic.twitter.com\/cjkP4GMtxy","— ShibariumGem (@Shibariumgem) December 13, 2023","","Most significant of all was August’s launch of layer-two network Shibarium, which now processes around 8 million transactions per day.","Based on such growth, the Shiba Inu price is likely to recover strongly following a dip in the next week or so, with the coin targeting $0.000020 by the first couple of months of 2024.","Given that SHIB’s overall performance this year has been somewhat disappointing, many traders may prefer to turn away from the established meme token and consider newer alternatives.","And while there are plenty of junk meme coins in the market right now, presales provide one way of identifying new tokens with more potential.","This would suggest that one promising new coin at the moment is Meme Kombat (MK), an ERC-20 cryptocurrency that has raised more than $2.9 million in its presale.","Some whale just dropped a cool $50k on $MK👀","And with that we also passed the $2.9 million mark in our presale🥊 pic.twitter.com\/8hbZ4eMA2a","— Meme Kombat (@Meme_Kombat) December 13, 2023","","What’s bringing investors to Meme Kombat is the fact that the project is more than just a meme token.","In fact, it’s an online gambling platform that enables users to place bets on AI-generated battles between meme characters.","It visualizes such battles in real-time, while the use of the Ethereum blockchain will ensure transparency and immediacy for results and payouts.","Users will place bets using the native MK token, which Meme Kombat will also use to pay out winnings.","Holders of MK can also stake the token for a passive income, making it the platform even more profitable.","We have reached 3000 fighters in the Meme Kombat Telegram Community🎉","Let's keep the community strong. Answer with the one thing that excites you most about #MemeKombat⏬ pic.twitter.com\/HU3S002kni","— Meme Kombat (@Meme_Kombat) October 25, 2023","","To join the presale, investors can simply go to the Meme Kombat official website, where 1 MK costs $0235.","This will rise to $0.246 tomorrow, while listing on exchanges in the New Year could end up pushing its price much higher.","Visit Meme Kombat Now","Disclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"$MK","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"last 30 days","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$50k","content":"MONEY"},{"type":"Whale Alert","content":"ORGANIZATION"},{"type":"$0235","content":"MONEY"},{"type":"$215 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"SHIB","content":"ORGANIZATION"},{"type":"December 11, 2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"9.25%","content":"PERCENT"},{"type":"LFG","content":"ORGANIZATION"},{"type":"Meme Kombat","content":"ORGANIZATION"},{"type":"$0.00000941","content":"MONEY"},{"type":"Meme Kombat Telegram Community","content":"ORGANIZATION"},{"type":"$2.9 million","content":"MONEY"},{"type":"December 13, 2023","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"October 25, 2023","content":"DATE"},{"type":"$0.246","content":"MONEY"},{"type":"$0.000020","content":"MONEY"}],"hashtag":["Altcoins","SHIB","Technical Analysis"],"authors":["Simon Chandler"]}