{"summary":"US IRS Reminds Taxpayers to Report all Crypto-Related Income","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-irs-reminds-taxpayers-to-report-all-crypto-related-income.htm","publishDate":"2024-01-24T12:53:45","id":20535,"type":null,"title":"US IRS Reminds Taxpayers to Report all Crypto-Related Income","category":["Bitcoin News "],"content":["The US Internal Revenue Service (IRS) has issued a reminder to all taxpayers to report any crypto-related income. The tax regulator has included a digital asset question on 2023 tax return Form 1040.","The question asks taxpayers to report cryptos received in 2023 as a reward, award or payment for property or services. “Everyone who files Forms 1040, must check one box answering either “Yes” or “No” to the digital asset question,” the Monday announcement read.","IRS stressed that it is mandatory for all taxpayers to answer the question when they file their 2023 federal income tax return and not only for those who engaged in a crypto transaction.","Citizens who have received cryptos as a reward or from mining and staking or through a hard fork, must answer ‘yes’ to the question, it added. Additionally, those who disposed of cryptos in exchange for property, services, or sold any, should also reflect in their filing.","“In addition to checking the ‘yes’ box, taxpayers must report all income related to their crypto transactions,” the note read. This includes digital assets held as capital assets, sold, transferred or exchanged during 2023.","“If an employee was paid with digital assets, they must report the value of assets received as wages. Similarly, if they worked as an independent contractor and were paid with digital assets, they must report that income.”","On the other hand, IRS cleared that taxpayers who merely owned cryptos in 2023 can check ‘no’ to the question. However, HODLers should not have engaged in any transactions involving digital assets during the year, it added.","Furthermore, transferring cryptos from one wallet to another, both owned by the same taxpayer, does not reflect in the filing. These tax reporting law applies to cryptocurrencies, stablecoins, altcoins and non-fungible tokens (NFTs).","In a previous announcement this month, IRS mandated businesses to report receiving cash or digital assets worth more than $10,000 within 15 days of the transaction. It further said that businesses need not have to report the receipt of digital assets the same way as they must report the receipt of cash until regulations are issued.","The rules have drawn criticism for being vague and difficult to comply with. Jerry Brito, executive director at cryptocurrency policy think tank Coin Center, noted at the time that many crypto users “will find it difficult to comply” with the “tricky” reporting requirements."],"entity":[{"type":"$10,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jerry Brito","content":"PERSON"},{"type":"US Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["crypto tax","IRS","Tax"],"authors":["Sujha Sundararajan"]}