{"summary":"SEC Lawsuit Against Coinbase Advances as Judge Rejects Most of Motion to Dismiss","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-lawsuit-against-coinbase.htm","publishDate":"2024-03-27T21:15:56","id":20546,"type":null,"title":"SEC Lawsuit Against Coinbase Advances as Judge Rejects Most of Motion to Dismiss","category":["Blockchain News "],"content":["Judge Katherine Polk Failla of the US District Court of the Southern District of New York ruled on March 27 that the US Securities and Exchange Commission (SEC) and Coinbase lawsuit can proceed.","The Judge’s decision came after Coinbase filed a motion to dismiss the SEC case, which borders on allegations the exchange operates as an unregistered securities exchange, broker, and clearing agency.","In her ruling, Judge Failla declared that the SEC’s lawsuit against Coinbase held “plausible” ground. The two parties were instructed to submit a case proceeding plan by April 19.","“The Court finds the SEC has sufficiently pleaded that Coinbase operates as an exchange, as a broker, and as a clearing agency under the federal securities laws, and through its Staking Program engages in the unregistered offer and sale of securities,” the court document read.","The District Judge dismissed many of Coinbase’s arguments in the filing. She granted a partial victory to the exchange against the regulator, however, dismissing the SEC’s claims against Coinbase’s Wallet.","The judge ruled that the regulator’s claims “fails for the independent reason that the pleadings fall short of demonstrating that Coinbase acts as a “broker” by making Wallet available to customers.”","This decision by Judge Failla resulted from the SEC case against the US-based exchange in June 2023. The SEC alleged that Coinbase had allowed trading of at least 13 crypto tokens that should have been registered as securities and failed to register its crypto asset’s offer and sale “staking-as-a-service program.”","For context, the US Securities Act of 1993 defines security as financial instruments such as stocks, bonds, debentures, and investment contracts. It is designed to regulate the offering and sale of these instruments to protect investors.","Coinbase argued that crypto assets, unlike stocks and bonds, do not meet the Securities Act definition of an investment contract – a position shared and supported by many in the crypto community. It could be recalled that Coinbase’s $1 billion bond sale for “qualified institutional buyers” to raise capital, will be due in 2030.","This is a big win for the SEC’s regulatory authority over the crypto sector, as new reports suggest the agency could ramp up enforcement and crypto regulations actions in 2024.","Meanwhile, Coinbase Chief Legal Officer (CLO) Gurbir Grewal took to X to notify the crypto community of the latest ruling and the exchange’s resolve to defend itself in court.","Today, the Court decided that our SEC case will move forward on most of the claims, but dismissed the claims against Coinbase Wallet. We were prepared for this, and we look forward to uncovering more about the SEC’s internal views and discussions on crypto regulation. 1\/6","— paulgrewal.eth (@iampaulgrewal) March 27, 2024","","“Looking ahead, we remain confident in our legal arguments, we look forward to proving we’re right, we are eager for the opportunity to take discovery from the SEC for the first time, and we appreciate the Court’s continued consideration of our case,” he said."],"entity":[{"type":"US District Court of the Southern District of New York","content":"ORGANIZATION"},{"type":"March 27, 2024","content":"DATE"},{"type":"1993","content":"DATE"},{"type":"US Securities","content":"ORGANIZATION"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Failla","content":"PERSON"},{"type":"March 27","content":"DATE"},{"type":"Coinbase’s Wallet","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"The Court","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":["Coinbase","Judge Failla","Securities and Exchange Commission"],"authors":["Jimmy Aki"]}