{"summary":"Ahead of Bitcoin ETF Launch, BlackRock Announces Major Workforce Cuts","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ahead-of-bitcoin-etf-launch-blackrock-announces-major-workforce-cuts.htm","publishDate":"2024-01-08T14:23:51","id":20542,"type":null,"title":"Ahead of Bitcoin ETF Launch, BlackRock Announces Major Workforce Cuts","category":["Bitcoin News "],"content":["BlackRock, the world’s largest asset management firm, is reportedly reducing its global workforce by about 3%, just days before the expected approval of the firm’s spot Bitcoin ETF application.","The layoffs, which have not yet been officially announced, will affect roughly 600 employees, Fox Business reported on Saturday, citing a source familiar with the matter.","The move is strategically timed shortly ahead of a decision by the US Securities and Exchange Commission’s (SEC) on spot Bitcoin ETF applications from BlackRock and several other large asset managers in the US.","STATE OF PLAY on spot Bitcoin ETFs…","sources say:\n– issuers have until 8am Monday to submit S-1s\n– SEC plans to vote on 19b-4s in the coming days","if both 19b-4s and S-1s are approved, ETFs could start trading as soon as the next dayhttps:\/\/t.co\/WZaUWv95jW w\/ @allyversprille","— Katie Greifeld (@kgreifeld) January 8, 2024","","BlackRock’s job cuts, described as “routine” by the sources, come on the heels of a similar round of layoffs in the previous year based on “employee performance metrics,” the report said.","Despite a 6% rebound in BlackRock’s shares in 2023 following a 21% decline in 2022, the firm is signaling a shift as it enters “a more mature phase” of its business, the Fox Business report said.","The impending layoffs are expected to contribute to the company’s strategic realignment, with the news outlet’s sources suggesting that the savings will be directed toward expanding into growth areas such as technology investing and alternative products.","Generally seen as a pioneer in so-called ESG (environmental, social and governance) investing, BlackRock has recently de-emphasized its ESG business in the US, with CEO Larry Fink previously saying he won’t mention the letters E-S-G because of political controversy.","Among other things, pension funds in some Republican-led states have pulled some $6 billion from BlackRock as a protest against the firm’s ESG push.","Despite the controversy, BlackRock remains a financial powerhouse with $9 trillion in assets under management (AUM) as of the third quarter of 2023, down from a peak of over $10 trillion in 2022.","As BlackRock navigates these shifts, all eyes are on the impending SEC decision regarding its Bitcoin ETF, which could mark a significant step for the firm’s foray into crypto.","The SEC is widely expected to greenlight all of the pending applications for spot Bitcoin ETFs in the US by January 10.","According to Bloomberg Intelligence’s senior ETF analyst Eric Balchunas and The ETF Store president Nate Geraci, it is possible that all of the approved ETFs will start trading as early as January 11.","Reuters now basically reporting same thing…","Amended S-1s due by 8amET on Mon & potential approval Tues or Wed (which *could* mean possible launch Thurs or Fri).","SEC only asking for “minor” changes.","One source indicated SEC Commissioner vote likely to take place on Wed fwiw. https:\/\/t.co\/4dqlQ1xePG pic.twitter.com\/0jn5dFXF2C","— Nate Geraci (@NateGeraci) January 6, 2024","",""],"entity":[{"type":"6%","content":"PERCENT"},{"type":"third quarter of 2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"$10 trillion","content":"MONEY"},{"type":"January 10","content":"DATE"},{"type":"January 11","content":"DATE"},{"type":"January 6, 2024","content":"DATE"},{"type":"Nate Geraci","content":"PERSON"},{"type":"Fox Business","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$9 trillion","content":"MONEY"},{"type":"January 8, 2024","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Katie Greifeld","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"ESG","content":"LOCATION"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Blackrock","ETF"],"authors":["Fredrik Vold"]}