{"summary":"Crypto VC Funding Surges in Q1 2024, Breaking 2-Year Downtrend","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-vc-funding-surges-in-q1-2024-breaking-2-year-downtrend.htm","publishDate":"2024-04-05T15:44:20","id":20557,"type":null,"title":"Crypto VC Funding Surges in Q1 2024, Breaking 2-Year Downtrend","category":["Altcoin News "],"content":["Venture capital (VC) funding in the crypto space has experienced a surge in the first quarter of 2024, breaking a two-year downtrend.","Both the total amount invested and the number of projects receiving VC funding have seen substantial increases since Q4 2023, according to data gathered by crypto analysis platform Crypto Koryo.","The data shows a notable 38% rise in funds invested during the quarter, indicating a renewed investor confidence in the crypto industry. ","Moreover, there has been a remarkable 49% increase in the number of projects securing funding, a level not witnessed since Q4 2021. ","Crypto Koryo believes that the crypto positive trend could signify the beginning of a new wave of investments. ","The analysis platform draws parallels between the recent uptick and patterns observed in Q4 2020, which preceded a massive influx of VC investments into the crypto sector. ","Notably, this quarter witnessed a higher interest from crypto-focused venture firms, in contrast to previous periods where banks and non-crypto VCs dominated investments.","Prominent crypto-native VCs such as Andreessen Horowitz Crypto, OKX Ventures, Multicoin Capital, Paradigm, and Polychain have emerged as dominant players in the funds invested during the quarter. ","🔸 Long-term Trend 🔸","Both total investments and number of investments have increased compared to last quarter.","Compared to last quarter, there was a 38% increase in amount invested and 49% increase in the number of projects invested. pic.twitter.com\/QhIcsOB0qw","— Crypto Koryo (@CryptoKoryo) April 4, 2024","","In March alone, crypto VC funds allocated over $1.1 billion across 180 investments.","This reflects a remarkable 52.5% month-on-month increase in VC funding for crypto projects, with a particular focus on infrastructure and decentralized finance.","The upswing in funding during Q1 2024 follows the positive momentum witnessed in Q4 2023. ","Compared to Q3 2023, Q4 2023 experienced a 2.5% increase in crypto VC investments, marking the first rise in VC investments for crypto projects since March 2022.","The crypto industry faced a challenging year in 2022, with a decline in venture capital funding coinciding with lackluster market conditions. ","Throughout the year, venture capital investments in the sector experienced consecutive quarterly drops. ","Earlier this year, Balance, a digital asset custodian based in Canada, has revealed that it has once again achieved $2 billion in assets under custody (AUC) amid the recent recovery in crypto markets. ","Likewise, Korea Digital Asset (KODA), the largest institutional crypto custody service in South Korea, has seen a remarkable growth in crypto assets under its custody. ","Just recently, the company revealed that the value of these crypto assets under its custody expanded by nearly 248% in the second half of 2023.","KODA, which was established through a collaboration between major Korean bank KB Bank, crypto venture capital firm Hashed, and blockchain tech firm Haechi Labs, said that the value of these assets reached approximately 8 trillion Korean won ($6 billion) by the end of last year. ","This was a substantial increase from the 2.3 trillion won recorded at the end of June 2023.","According to analysts at Bernstein Research, crypto funds could reach a staggering $500 billion to $650 billion within the next five years, a significant leap from the current valuation of approximately $50 billion."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"April 4, 2024","content":"DATE"},{"type":"2.5%","content":"PERCENT"},{"type":"Andreessen Horowitz Crypto","content":"PERSON"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"$50 billion","content":"MONEY"},{"type":"Haechi Labs","content":"ORGANIZATION"},{"type":"52.5%","content":"PERCENT"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"$500 billion","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"Bernstein Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"second half of 2023","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"this quarter","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"248%","content":"PERCENT"},{"type":"Crypto Koryo","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$650 billion","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"$6 billion","content":"MONEY"},{"type":"38%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Balance","content":"ORGANIZATION"},{"type":"KB Bank","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["crypto adoption","Hedge fund"],"authors":["Ruholamin Haqshanas"]}