{"summary":"Facebook’s Libra Confirms A New Plan To Please Regulators","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/facebook-s-libra-confirms-a-new-plan-to-please-regulators-6316.htm","publishDate":"2020-04-16T15:08:00","id":20554,"type":null,"title":"Facebook’s Libra Confirms A New Plan To Please Regulators","category":["Altcoin News "],"content":["In an attempt to ease regulatory concerns, Facebook‘s Libra just changed its initial plan to issue the multi-currency Libra Coin and now aims to start from single-currency stablecoins, such as LibraUSD, LibraEUR, etc. Also, the project dropped its plan to move to a permissionless system. (Updated on April 17: updates in bold.)","“This will allow people and businesses in the regions whose local currencies have single-currency stablecoins on the Libra network to directly access a stablecoin in their currency,” the Libra Association announced on Thursday, adding that the multi-currency Libra (LBR) “will simply be a digital composite of some of the single-currency stablecoins available on the Libra network.”","The Association explained that a key concern was the potential for the multi-currency Libra Coin to interfere with monetary sovereignty and monetary policy if the network reaches a significant scale and a large volume of domestic payments are made in LBR.","“We’re working toward a late 2020 readiness timeline” to launch the Libra network, Dante Disparte, head of policy for the Libra Association, told Bloomberg.","According to the Association, LBR can be used as an efficient cross-border settlement coin as well as a neutral, low-volatility option for people and businesses in countries that do not have a single-currency stablecoin on the network yet.","“Which currency will be adopted and used will vary by use cases,” Christian Catalini, head economist for Facebook’s Calibra division, which created the project, told Bloomberg. He suggested that when sending money across borders, the multicurrency Libra could be a better option, whereas the single-currency stablecoins would make more sense for everyday purchases in a consumer’s home country, according to the report.","The project also promises to enhance the safety of the Libra payment system and forgo the future transition to a permissionless system.","“Regulators raised thoughtful questions about the perimeter of control for the Libra network — in particular, the need to guard against unknown participants taking control of the system and removing key compliance provisions,” they explained, adding that “it is possible to replicate the key economic properties of a permissionless system.” According to them, it can be done through an “open, transparent, and competitive market for network services and governance, all while incorporating the robust due diligence of Members and validators that is inherent to a permissioned system.”","","“The main downside of these changes is that the system is less open, and less decentralized, therefore the bitcoin community will probably disregard this as another centralized project,” Yoni Assia, CEO and Co-founder of eToro, said in an emailed comment.","However, he believes that these changes will help Libra to potentially launch, while their new apporach “marks another milestone in the journey towards the adoption of distributed systems in global finance.”","The Libra Association also said today that it has formally initiated the payment system licensing process with the Swiss Financial Markets Supervisory Authority (FINMA).","“In addition to applying for the FINMA license and updating the white paper, the near-term operating expenses of Libra Association have now been funded by its members,” they added.\n___",""],"entity":[{"type":"Facebook’s Calibra","content":"ORGANIZATION"},{"type":"Libra Association","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Association","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Christian Catalini","content":"PERSON"},{"type":"Yoni Assia","content":"PERSON"},{"type":"Dante Disparte","content":"PERSON"},{"type":"the Association","content":"ORGANIZATION"},{"type":"April 17","content":"DATE"},{"type":"LBR","content":"ORGANIZATION"},{"type":"Swiss Financial Markets Supervisory Authority","content":"ORGANIZATION"}],"hashtag":["Facebook","Libra","Stablecoin"],"authors":["Linas Kmieliauskas"]}