{"summary":"Hong Kong Regulator Issues Alert Against Suspicious Crypto Platform HKCEXP","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-regulator-issues-alert-against-suspicious-crypto-platform-hkcexp.htm","publishDate":"2024-03-25T16:49:36","id":20555,"type":null,"title":"Hong Kong Regulator Issues Alert Against Suspicious Crypto Platform HKCEXP","category":["Blockchain News "],"content":["The Securities and Futures Commission of Hong Kong (SFC) has issued a warning regarding HKCEXP, an allegedly suspicious crypto trading platform claiming to be registered with the regulator.","HKCEXP allegedly warned as it lured investors by falsely claiming to be an “SFC-registered business.”","In June 2023, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services.","The SFC said in February that investors should only trade on licensed trading platforms. The regulator had set a deadline of February 29 for crypto exchanges to apply for operational licenses. Exchanges failing to submit their applications were required to cease operations in Hong Kong by May 31.","The SFC advised investors to act swiftly if they trade on platforms that do not appear on either the “list of licensed virtual asset trading platforms” or the “list of virtual asset trading platform applicants.” The regulator urged these investors to “make preparations early,” such as by closing their accounts. ","Among the 22 crypto trading platforms that applied for licenses, four had previously opted into the SFC’s regulatory framework for crypto trading platforms.","Despite the SFC’s efforts to disseminate information, Hong Kong continues to be faced with fake entities posing as legitimate crypto exchanges. The regulator warns of HKCEXP, the latest crypto exchange falsely claiming to be registered with the regulator.","The SFC accused HKCEXP of providing a fraudulent Hong Kong address for registration. Additionally, one Hong Kong citizen who had used the platform reported to the SFC that the exchange imposed excessive fees for fund withdrawals.","The SFC will maintain a public list of licensed crypto platforms to promote safe crypto trading. The SFC stated that any exchange that fails to apply for licensing faces restrictions on operations and marketing activities in Hong Kong.","According to the SFC, 22 exchanges have submitted applications before the February 29 deadline. Among these applicants are prominent names in the crypto industry, such as OKX, Bybit, Bullish, Crypto.com, Huobi HK, Matrixport HK, and Gate.HK. ","The HKVAEX crypto platform, reportedly associated with Binance, has also submitted its application for consideration. The Hong Kong SFC has already granted licenses to two platforms — namely HashKey Exchange in November 2022 and OSL Digital Securities, getting the nod a month later in December 2022.","Once licensed by the Hong Kong SFC, crypto exchanges can onboard retail investors to trade Bitcoin and Ether. The SFC is currently reviewing various altcoins and stablecoins for trading approval.","On February 23, BitForex, an exchange, went offline after $57 million was reportedly withdrawn from the exchange’s hot wallets. Last year, Japanese regulators flagged BitForex for operating without proper registration.","Despite being purportedly headquartered in the region, the SFC also flagged BitForex for lacking a license to operate a Virtual Asset Trading Platform (VATP) in Hong Kong. ","The exchange’s users on its official Telegram channel have reported various account issues, including login difficulties and missing asset information on the dashboard. Some users also shared pop-up screens indicating they were blocked from accessing the company’s website. ","The SFC advises investors to verify trading platforms using its public register of licensed persons and institutions and the list of licensed virtual asset trading platforms to access relevant information about licensed entities, including their official websites."],"entity":[{"type":"$57 million","content":"MONEY"},{"type":"SFC","content":"ORGANIZATION"},{"type":"February 23","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Hong Kong SFC","content":"ORGANIZATION"},{"type":"Securities and Futures Commission of Hong Kong (SFC","content":"ORGANIZATION"},{"type":"February 29","content":"DATE"},{"type":"Bybit","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"OSL Digital Securities","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"May 31","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["HKCEXP","Hong Kong","SFC"],"authors":["Hassan Shittu"]}