{"summary":"Terra Luna Classic Price Forecast – When is the Next Binance Token Burn?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-price-forecast-when-next-binance-token-burn.htm","publishDate":"2022-10-13T20:30:00","id":20561,"type":null,"title":"Terra Luna Classic Price Forecast – When is the Next Binance Token Burn?","category":["Altcoin News "],"content":["Terra Luna Classic is preparing for a bullish move to $0.00037 after holding firmly at the $0.00025 support. Over the last few weeks, its performance continued to disappoint investors, as they counted losses from $0.00037. However, insight from a double-bottom that recently formed on the four-hour chart indicates a 26% move upward may be on the cards.","Binance exchange is taking center stage in Terra Luna Classic (LUNC) token burn process. The exchange’s efforts appear to bear fruit, with almost 8.5 billion tokens being wiped from the crypto project’s supply. The second week of the burn process, which started on September 26 and ended on October 1, saw 5.5 billion LUNC tokens erased from existence. Similarly, the week ending on October 8 removed approximately 2.9 billion tokens from the supply.","The largest crypto exchange company has pledged to help Terra Luna Classic reduce its bloated supply with weekly token burn schedules – starting every Tuesday until further notice. The first took place on the 3rd of October, the second on the 11th, and the details of the third burn will be revealed on the 17th of October.","Terra Luna Classic price rallied roughly 68% in 24 hours after Binance CEO Changpeng Zhao (CZ) announced. LUNC jumped from $0.00018 to $0.00037 on October 1 after doubling its value in less than a week.","LUNC is in the process of strengthening its bullish outlook from support at $0.00025. This critical area has been tested twice in the last three weeks, making it a formidable springboard to another substantial jump aiming for $0.00037.","Terra Luna Classic price retracement to $0.00025 completed a double-bottom pattern that may be validated in the upcoming sessions. A trend reversal is usually expected when this pattern appears on the chart.","Traders looking forward to going long on Terra Luna Classic should, however, wait until the price breaks above the pattern’s neckline – a move that would ensure they avoid bull traps.","The OBV (On Balance Volume) has changed its direction to the upside, suggesting that investors consider bullish positions in LUNC viable. Furthermore, the Stochastic oscillator will cross above the midline after tagging the oversold region at 20.00. As the indicator forms a bullish divergence with the price, the odds for a bullish sequel are bound to increase.","It is worth mentioning that Terra Luna Classic price will face resistance at $0.00030. Some investors may consider this level a profit target, while the most bullish may hold on to $0.00037.","On the other hand, stubbornly bearish traders are likely to be waiting for a pullback from the potential seller congestion at $0.00030. For this reason, they will be betting on LUNC to extend its down leg to $0.00025. If push comes to shove, resulting in panic selling, the Terra Luna Classic downtrend could cool off at $0.00022 or even $0.00018.","Two prominent crypto Twitter influencers have even speculated LUNC could trend to zero.","The Terra Luna Classic development team is pulling every move up its sleeve to make the project a success, but this may take some time. Investors who are looking for potentially quicker gains can consider IMPT – a crypto project promising to help reduce the world’s carbon footprint by tokenizing credits on the blockchain, providing more transparency to all parties. ","For more details on IMPT, interested market participants can follow the whitepaper. IMPT project is currently at the presale stage, so investors can tap into the early bird benefits. The team also has a dedicated Telegram channel where interested parties can get timely updates.\n\nVisit IMPT Now","Read more:\nHere’s Why the Ripple XRP Price is Pumping and Will Take Out $1.00","RichQuack Price Prediction as QUACK Shoots up 66%"],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"$0.00025","content":"MONEY"},{"type":"$0.00037","content":"MONEY"},{"type":"$0.00018","content":"MONEY"},{"type":"October 1","content":"DATE"},{"type":"17th of October","content":"DATE"},{"type":"October 8","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"3rd of October","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"68%","content":"PERCENT"},{"type":"September 26","content":"DATE"},{"type":"LUNC","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"$1.00","content":"MONEY"},{"type":"Balance Volume)","content":"ORGANIZATION"},{"type":"$0.00022","content":"MONEY"},{"type":"$0.00030","content":"MONEY"}],"hashtag":["IMPT","Terra Luna Classic"],"authors":["John Isige"]}