{"summary":"Neobank K-Bank May Have to Postpone IPO Plan as Crypto Winter Bites","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/neobank-k-bank-may-have-to-postpone-ipo-plan-as-crypto-winter-bites.htm","publishDate":"2022-06-29T00:00:00","id":20562,"type":null,"title":"Neobank K-Bank May Have to Postpone IPO Plan as Crypto Winter Bites","category":["Bitcoin News "],"content":[" ","An up-and-coming South Korean bank appears to be suffering from the crypto market’s volatility – and may have to shelve its initial public offering (IPO) plans if crypto winter continues.","Per ENews Today, K-Bank, the banking partner of the market-leading crypto exchange Upbit, is “experiencing difficulties.”","The report explained that the bank – which had hoped to follow its biggest rival Kakao Bank onto the stock market – has been hit with a double whammy of bad news.","The Upbit alliance brought a huge number of customers to the bank, buoying its market value and leading K-Bank to formulate ambitious IPO plans. Under South Korean law, all crypto exchange customers must hold a real name-verified bank account with the exchange’s partner bank, and conduct all their fiat-related transactions through this account.","With crypto investment skyrocketing across South Korea during the most recent bull market, thousands of new customers came to K-Bank – drawn mainly by the fact that K-Bank, as a neobank, allowed crypto investors to open their accounts online. They were also drawn to the fact that Upbit has become the nation’s biggest and busiest crypto trading platform.","But as the market continues to slump, trading volumes have plummeted in South Korea. Late last year, Upbit daily trading volumes peaked at the USD 20.3bn level, per CoinGecko data. But at the time of writing, that figure has shrunk to USD 3.3bn.","As of late March this year, almost half of all the money ever deposited on K-Bank’s platforms originated from Upbit customers.","Banking experts warned that a mass sell-off of tokens could hit K-Bank’s liquidity. The bank has already experienced difficulties as a result of its Upbit partnership. Despite the fact that K-Bank pocketed some USD 4.5m in fees from Upbit customers in Q1 of this year, sudden market swings have caused problems such as problems with K-Bank’s “loan-to-deposit ratio.”\n\nA financial sector expert was quoted as opining:","“K-Bank needs to reduce its dependence on Upbit and closely monitor market sentiment. It may need to adjust the timing of its IPO.”","The second factor that could force K-Bank to rethink (or delay) its IPO could be the current stock market slump, which has been sparked by “global economic tightening.”\n\nK-Bank was expected to start officially speaking to the South Korean stock exchange about a listing before the end of the month, but, the media outlet stated, “it is now known that [the bank] is thinking twice” about the IPO.","K-Bank is keen to keep pace with Kakao Bank, which has already made its stock market debut, but saw its share prices plummet shortly after launching.","The report noted that other big-name firms, such as the security provider SK Shieldus and the One Store mobile app marketplace, had also tentatively withdrawn their own IPO plans.","It added that another K-Bank rival, Toss Bank, was also considering delaying its IPO plans for “two to three years” after initially stating that it wanted to go public next year.","Banks that partner with crypto exchanges enjoyed a bumper year in 2021, when deposits on the four biggest South Korean trading platforms grew by 1,368%.","The number of real name-verified accounts at crypto exchange partner banks rocketed up by 777% year-on-year in 2021, with at least 7.3m crypto wallet-linked accounts opened.\n____\nLearn more: \n– Don’t Fear the Reaper: Why the Market Downtrend Is Good for Crypto\n– Bitcoin Lifeboat, Long Recovery Road, & Exaggerated BTC Deaths: Saylor, CZ, and Professor Weigh In\n\n– Next 6-12 Months to be ‘Brutal’, but Ivestment ‘Planting Season’ Starts Now, Arthur Hayes Says\n– As inflation ‘Mellows Out’, a Bottom in Crypto is Likely in ‘The Back Half of 2022’ – VC Investor"],"entity":[{"type":"Upbit","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Upbit","content":"PERSON"},{"type":"Today","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Kakao Bank","content":"ORGANIZATION"},{"type":"12 Months","content":"DATE"},{"type":"777%","content":"PERCENT"},{"type":"1,368%","content":"PERCENT"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Toss Bank","content":"ORGANIZATION"},{"type":"Long Recovery Road, & Exaggerated BTC","content":"ORGANIZATION"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Crypto\n– Bitcoin Lifeboat","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"March this year","content":"DATE"}],"hashtag":["Banking","Cryptocurrency","Exchange","IPO","South Korea"],"authors":["Tim Alper"]}