{"summary":"Business Exec’s Noisy Illegal Ethereum Mining Rigs Left Employees Sweltering in 40°C Furnace","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/business-execs-noisy-illegal-ethereum-mining-rigs-left-employees-sweltering-40c-furnace.htm","publishDate":"2022-08-09T20:00:00","id":20566,"type":null,"title":"Business Exec’s Noisy Illegal Ethereum Mining Rigs Left Employees Sweltering in 40°C Furnace","category":["Ethereum News "],"content":[" ","A South Korean company executive at a major business group operated Ethereum (ETH) mining rigs “non-stop for three years” – using illegally sourced electricity.","MBN reported that the unnamed executive was a faculty management chief for “one of the five biggest business groups” in the nation. South Korea’s biggest business groups, per Fair Trade Commission data, are Samsung, SK, Hyundai Motor, LG, and Lotte.","The executive reportedly made some UD 30,000 worth of ETH by operating a mining machine at a company facility he was in charge of, later adding a second machine to his operation. He began his mining efforts in 2019 and, the company stated, used USD 3,500 worth of electricity to power the machines, which ran “24\/7” until they were eventually discovered in May.","The illegal operation erupted into “controversy” as facility engineers began suffering as a result of the “noise and heat” the rigs generated in workspaces. The media outlet noted that a number of workers at the facility had “failed to renew their contracts this year.”","One engineer was quoted as stating that the cacophony and heat were “tremendous” – driving indoor temperatures to the 40°C mark. ","The same engineer, who also stated he had not renewed his contract, claimed that he had reported the executive to the “investigative authorities,” and complained that even though the decision to leave had been his, “it still feels like a dismissal.”","A company official stated that it was “clearly wrong to operate a cryptocurrency mining machine” on company premises and that the “amount of illegally used electricity” was “not insignificant.”","And the executive’s misdeeds did not end with his clandestine ETH mining efforts, apparently. The company admitted that the executive had secretly “built a private indoor golf driving range in the management facility,” where he practiced his golfing techniques “until late at night.” This was also a source of noise that disrupted employees who were trying to rest at the facility after late-night overtime shifts. ","CCTV footage published by the news agency Yonhap also showed the executive cutting up turf from the company’s lawn and loading it into his car. The executive then reportedly proceeded to replant the stolen grass in the garden of his own house.","____","Learn more: \n– SIM Swaps, Other Crypto-related Crimes Set to Rise in South Korea, Says SK\n– Grassroots Sports Body Accountancy Chief Says She Stole Public Funds to Pay for Bitcoin\n\n– Brazilian Cop Charged with Duping 23 Fellow Officers in ‘Crypto Pyramid Scam’\n– ‘Pig Butchering’ Crypto Investment Scams Delivered ‘Massive Losses’ to Victims\n\n– Woman Gets 5-year Jail Term After Stealing USD 87K Worth of Crypto in Dating App Scam\n– ‘Romantically Involved’ USD 3.8m XRP Thieves Sent to Prison for 7 Years"],"entity":[{"type":"Samsung","content":"ORGANIZATION"},{"type":"Duping 23 Fellow Officers","content":"ORGANIZATION"},{"type":"Hyundai Motor","content":"ORGANIZATION"},{"type":"Lotte","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"USD 87K Worth of Crypto","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Pig Butchering’ Crypto Investment Scams Delivered ‘Massive","content":"ORGANIZATION"},{"type":"Yonhap","content":"ORGANIZATION"},{"type":"Fair Trade Commission","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"LG","content":"ORGANIZATION"}],"hashtag":["Crime","Ethereum","Mining","South Korea"],"authors":["Tim Alper"]}