{"summary":"Bitcoin Supply On Exchanges Has Almost Depleted, Says Bybit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-supply-exchanges-bybit.htm","publishDate":"2024-04-16T22:37:49","id":20569,"type":null,"title":"Bitcoin Supply On Exchanges Has Almost Depleted, Says Bybit","category":["Bitcoin News "],"content":["The available Bitcoin supply on exchanges is rapidly diminishing, potentially reaching depletion within the next nine months, according to a Monday analysis by Bybit.","Citing data from CryptoQuant, Bybit wrote in a blog post that only 2 million BTC is present on centralized crypto trading platforms, representing less than 10% of the entire network’s supply.","“If we assume a daily inflow of $500 million to Bitcoin Spot ETFs, the equivalent of around 7,142 bitcoins will leave exchange reserves daily,” the company’s analysts wrote, “suggesting that it will only take nine months to consume all of the remaining reserves.”","Since launching in January, U.S. Bitcoin spot ETFs have absorbed $12.4 billion in net inflows from retail and institutional investors. This equates to roughly 221,000 BTC being taken off the market, a market shock mathematically much larger than even a Bitcoin halving event.","In fact, the next Bitcoin halving is due later this week. It will cut Bitcoin’s supply inflation rate in half for the fourth time in the network’s history. Starting around April 20, the asset’s daily supply issuance will shrink from 900 BTC to 450 BTC, causing an even greater market supply shortage.","There is a supply squeeze mere days away. Blackrock and other ETF’s are buying in excess 10,000 #bitcoin a day. What do you think will happen when only 450 new #bitcoin are mined a day ?","Micheal Saykor gives us an idea pic.twitter.com\/96X3pzE79f","— Tommy ₿oy⚡️21m (@CooliganFields) April 15, 2024","","However, Bybit’s figures around ETF inflows may be outdated: the funds have seen very few net inflows since the beginning of April, and the price of Bitcoin has declined from $69,000 down to $62,000 over that time period.","Some cite escalating geopolitical conflicts between Israel and Iran as a potential catalyst for the selloff, while others believe investors could be selling their BTC in time for U.S. tax season.","Bybit also said there may be a pronounced Bitcoin selloff in the short term after the halving – particularly from weak mining firms.","“Unprofitable miners might start selling their Bitcoin reserves in order to support their operations,” wrote Bybit. “However, once their reserves run out, the overall sell-side supply to CEXs will shrink.”","Bybit also noted that miners had acted slightly differently from their pre-halving behaviour in 2022, however. While miners four years ago steadily accumulated leading up to the halving, firms have shown signs of unloading their reserves earlier in the current cycle.","“Bitcoin tends to rally twelve months after each halving, and there’s a high probability that we might see a new ATH this time,” the report stated,"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$12.4 billion","content":"MONEY"},{"type":"April 15, 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Micheal Saykor","content":"PERSON"},{"type":"$69,000","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Tommy ₿oy","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"$62,000","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Iran","content":"LOCATION"}],"hashtag":["Bitcoin","Crypto Exchange"],"authors":["Andrew Throuvalas"]}