{"summary":"SEC Chair Gary Gensler Gets Community Noted on X for Warning Against Crypto","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sec-chair-gary-gensler-gets-community-noted-on-x-over-crypto.htm","publishDate":"2023-12-22T04:26:42","id":20571,"type":null,"title":"SEC Chair Gary Gensler Gets Community Noted on X for Warning Against Crypto","category":["Blockchain News "],"content":["US SEC chair Gary Gensler earlier posted a video message on X warning crypto firms against non-compliance and calling the space “wild west.” Elon Musk-owned X, formerly Twitter, was quick to add community notes to Gensler’s post.","In his video message, Gensler said that there is a lot of non-compliance in the crypto space with the securities laws and other laws around anti-money laundering and protecting the public. He further stated that this is not a case of “few bad actors” but it is something that pervades this field globally. There’s been far too much fraud in the crypto field, he added.","There is a lot of noncompliance in the crypto space. It undermines confidence when so many people have been hurt and all they can do is stand in line in the bankruptcy court. Further, this can make it hard for the good faith actors to compete. pic.twitter.com\/9L1WKa4R6S","— Gary Gensler (@GaryGensler) December 21, 2023","","Gensler’s tweet quickly received community notes pointing out that crypto companies like Coinbase, a publicly listed company approved by SEC, have been trying to gain clarity on securities guidelines for compliance for the past few years. The SEC hasn’t taken a clear stance and has relied on regulation by enforcement, notes added.","As reported earlier, the SEC recently denied a petition by Coinbase asking the agency to create new rules for the digital asset industry.","The securities regulators said that the Coinbase petition lacked “text or the substance of any proposed rule”. The commission also disagreed with the petitioner’s claim that existing regulations were “unworkable”.","Coinbase has already filed an appeal to the SEC’s denial."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"December 21, 2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"}],"hashtag":["Regulation","SEC","USA"],"authors":["Jai Pratap"]}