{"summary":"OKEx Rebrands to OKX as It Moves ‘Beyond Standard Centralized Exchange Model’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/okex-rebrands-okx-as-it-moves-beyond-standard-centralized-exchange-model.htm","publishDate":"2022-01-18T10:17:00","id":20578,"type":null,"title":"OKEx Rebrands to OKX as It Moves ‘Beyond Standard Centralized Exchange Model’","category":["Bitcoin News "],"content":[" ","Major crypto exchange OKEx has changed its brand name to OKX as it says it is now “so much more than an exchange.”","“Our goal is to give customers the tools they need to easily and securely earn, transfer and spend their wealth as they see fit, without intermediation from us,” Jay Hao, CEO of OKX, said. “We’ve dropped the ‘E’ from our name because we’re so much more than an exchange, just like crypto is so much more than a speculative asset.”","The company noted that they intend to venture into crypto segments like decentralized finance (DeFi) and non-fungible token (NFT)-powered play-to-earn gaming. ","The CEO added that the new OKX name “upholds the core principles of crypto — decentralization & autonomy.” ","“We’re moving beyond the standard centralized exchange model to give customers an end-to-end cryptocurrency experience,” he added.","The OKX has also been developing a suite of decentralized products to boost its presence in Web 3. Namely, OKX has been designing MetaX, a noncustodial wallet compatible with numerous blockchains, an NFT marketplace, and a yet-to-be-launched decentralized exchange (DEX) dubbed OEX. ","Founded in 2017 as OKEx, the platform says it has onboarded over 20m users worldwide. The company is now the second-largest crypto exchange by spot trading volume, and has a “normalized” 24-hour trading volume of over USD 5bn, and lists 535 trading pairs, per CoinGecko.com data. Binance is the leader, with USD 14bn trading volume and 1,420 trading pairs.\n____\nLearn more: \n– Crypto Exchanges in 2022: More Services, More Compliance, and Competition\n– OKEx and Huobi Tokens Try to Recover as Chinese Ban Takes Effect"],"entity":[{"type":"More Compliance","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Jay Hao","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Huobi Tokens Try","content":"ORGANIZATION"}],"hashtag":["Decentralization","DeFi","Exchange","Marketing","NFT","OKEx"],"authors":["Ruholamin Haqshanas"]}