{"summary":"International Monetary Fund Tells Nigeria To Regulate Crypto Trading Platforms","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/international-monetary-fund-tells-nigeria-regulate-crypto-trading.htm","publishDate":"2024-05-10T20:03:42","id":20576,"type":null,"title":"International Monetary Fund Tells Nigeria To Regulate Crypto Trading Platforms","category":["Blockchain News "],"content":["The International Monetary Fund (IMF) recommended on May 10 that Nigeria regulate crypto trading platforms amid the African nation’s detainment of two Binance executives, according to a United Nations Thursday staff report.","“Staff recommends that global crypto trading platforms be registered or licensed in Nigeria and subject to the same regulatory requirements applicable to financial intermediaries following the principle of same activity, same risk, and same regulation,” the report read.","Nigeria has been in a financial crisis in recent months, with its once-dominant economy expected to plummet to fourth place on the African continent.","IMF recommends registering, licensing global crypto trading platforms in Nigeria  – https:\/\/t.co\/0dbNEJ2bEl pic.twitter.com\/ublzBVMyIe","— Nairametrics (@Nairametrics) May 10, 2024","","Despite the country’s inflation hitting a near 28-year high, the IMF report stated that the country’s currency is beginning to steady.","“The naira depreciated sharply after the unification of the official foreign exchange windows in June 2023,” the IMF noted. “Following monetary policy tightening in February and March 2024 and a resumption of FX interventions, the naira has started to stabilize.”","Nigeria has been cracking down on digital assets recently. In the coming days, the country will ban peer-to-peer payment systems in hopes of preventing manipulation.","Some government officials have shifted the blame for the naira’s weakening to cryptocurrencies, with Nigerian Central Bank Governor Olayemi Cardoso alleging in February that $26 billion worth of illicit funds shuffled through Binance Nigeria in 2023 alone. ","“We are concerned that certain practices that go on that indicate illicit flows through a number of these entities and suspicious flows at best,” Cardoso said. “In the case of Binance, $26 billion has passed through Binance Nigeria from sources and users we cannot adequately identify.”","Concerns have swirled over the country’s arrest of two Binance executives, Nadeem Anjarwalla and Tigran Gambaryan, on money laundering and tax evasion charges in over the crypto exchange’s operations.","Both Anjwarwalla and Gambaryan were in the country for policy meetings with regulators amidst tensions with the African nation.","Earlier this week, Binance CEO Richard Teng claimed that “unknown persons” proposed a secret settlement between the crypto exchange’s employees and Nigerian officials “to make these issues go away.”","Binance refused to engage in such a deal, leading to Anjarwalla and Gambaryan’s eventual capture. The two are due back in court for a hearing in Abuja on May 17.","Despite questions over the legality of the Binance executives’ arrest, IMF’s latest staff report may signify a future increase in foreign crypto exchanges in Nigeria overall."],"entity":[{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"Gambaryan","content":"PERSON"},{"type":"May 17","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"$26 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Abuja","content":"LOCATION"},{"type":"May 10, 2024","content":"DATE"},{"type":"Binance Nigeria","content":"ORGANIZATION"},{"type":"Nigerian Central Bank Governor Olayemi Cardoso","content":"ORGANIZATION"},{"type":"March 2024","content":"DATE"},{"type":"Binance Nigeria","content":"LOCATION"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Richard Teng","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"May 10","content":"DATE"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"},{"type":"Cardoso","content":"PERSON"}],"hashtag":["Crypto Regulation","IMF","Nigeria"],"authors":["Julia Smith"]}