{"summary":"One of the SEC’s main divisions lists ‘crypto-assets’ among its major agenda items for 2023. \n“In a time of growing markets, evolving technologies, and new forms of risk, our Division of Examinations continues to protect investors,” SEC Chair Gary Gensler said in a statement.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209510\/crypto-assets-on-secs-2023-to-do-list","publishDate":"2023-02-07T18:06:35","id":2058,"type":null,"title":"&#x27;Crypto-assets&#x27; on SEC&#x27;s 2023 to-do list","category":["Policy"],"content":["The Securities and Exchange Commission's Division of Examinations named \"crypto-assets\" and other emerging technologies as a top priority for this year.&nbsp;","\"The division will conduct examinations of broker-dealers and RIAs that are using emerging financial technologies or employing new practices, including technological and on-line solutions to meet the demands of compliance and marketing and to service investor accounts,\" the SEC said in the division's public <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-24?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\">to-do list<\/a>.","Those examinations will focus on whether firms dealing with digital assets \"met and followed their respective standards of care when making recommendations, referrals, or providing investment advice\" as well as whether they continuously review their own compliance, disclosure and risk management practices.&nbsp;","The examinations division also will focus on ensuring that investment advisers have complied with a new marketing rule the commission implemented last year that restricts the use of testimonials and recommendations in promoting investments. The SEC has pursued <a href=\"https:\/\/www.theblock.co\/post\/174416\/sec-charges-kim-kardashian-for-unlawfully-promoting-ethereummax\" data-v-f87c67ca=\"\">high-profile cases<\/a> related to celebrity endorsements of digital assets.&nbsp;","Other agenda items that could apply to firms dealing with digital assets include examinations of investment advisers' performance of fiduciary duty and a review of cybersecurity practices by broker-dealers, investment advisers, and other registrants. The fiduciary piece will include whether they are properly assessing risk, how they're performing custody of assets and how advisers manage conflicts of interest.&nbsp;&nbsp;","“In a time of growing markets, evolving technologies, and new forms of risk, our Division of Examinations continues to protect investors,” SEC Chair Gary Gensler said in a statement. “In executing against the 2023 priorities, the division will help ensure compliance with the federal securities laws and rules.”"],"hashtag":["SEC"]}