{"summary":"MicroStrategy Acquires Additional 155 Bitcoin Worth $5.3 Million in October","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/microstrategy-acquires-additional-155-bitcoin-worth-5-3-million-in-october.htm","publishDate":"2023-11-02T04:48:32","id":20584,"type":null,"title":"MicroStrategy Acquires Additional 155 Bitcoin Worth $5.3 Million in October","category":["Blockchain News "],"content":["The prominent business intelligence and software company MicroStrategy reaffirmed its unwavering dedication to Bitcoin with the recent acquisition of an additional 155 BTC at a total cost of $5.3 million.","On November 1, MicroStrategy’s chairman and founder, Michael Saylor, revealed that the company acquired an additional 155 bitcoins for $5.3 million in October. This announcement comes at a time when Bitcoin’s price has been on an upward trajectory, reaching a recent annual high of $35,000.","Just over a month ago, the company disclosed in a filing that it purchased 5,445 bitcoins for $147.3 million, with an average price of $27,053 per bitcoin, between August 1 and September 24.","MicroStrategy initially entered the Bitcoin market in August 2020 with a substantial investment of $250 million in BTC. Since then, the company has consistently expanded its bitcoin holdings, establishing a treasury reserve strategy that now boasts over 158,400 bitcoins.","As of October 31, MicroStrategy’s impressive Bitcoin holdings stand at a total of 158,400 BTC, with an approximate value of $5.4 billion at the time of this announcement, acquired at an average cost of $29,586 per BTC.","The company’s financial performance remains robust, with total revenues registering a 3% increase year-over-year, reaching $129.5 million. Notably, $66 million of this revenue is attributed to subscriptions and software products.","In the period following the end of the second quarter, MicroStrategy acquired 6,067 bitcoins for $167 million. MicroStrategy’s strategic Bitcoin acquisitions have proved lucrative as the price of the digital asset surged in October, coming close to the $35,000 mark at one point.","Bitcoin’s current value hovers just below this level, with growing anticipation that spot Bitcoin exchange-traded funds (ETFs) may soon receive the necessary regulatory approval, potentially attracting significant investment.","Saylor also shared on X, teasing the forthcoming release of the company’s third-quarter earnings report, that MicroStrategy now holds a total of 158,400 bitcoins.","Andrew Kang, Chief Financial Officer (CFO) at MicroStrategy, said:","“We further increased our total bitcoin holdings to 158,400 bitcoins, adding 6,067 bitcoins since the end of the second quarter. Our commitment to acquire and hold bitcoin remains strong, especially with the promising backdrop of potential increased institutional adoption.“","However, MicroStrategy also revealed in the company’s November results filing that it has experienced a substantial paper gain of $900 million on its extensive Bitcoin holdings, which amount to 158,400 BTC. This surge in value is driven by optimism surrounding the potential approval of spot Bitcoin exchange-traded funds (ETFs).","The company has also added 6,067 bitcoins to its holdings since the third quarter, including an additional 155 in October.","While MicroStrategy reported a 3.3% year-on-year increase in revenues, reaching $130 million, for the quarter, it still recorded a net loss of $143.4 million. The losses were attributed to digital asset impairment losses and income taxes, totaling $33.6 million and $109.6 million, respectively.","However, this financial outcome stands in stark contrast to the previous year, when the company reported a net loss of $27 million during the same period.","Despite Bitcoin’s price experiencing fluctuations during the quarter, falling from $30,480 to $26,970, MicroStrategy seized the opportunity and acquired 6,067 BTC at an average price of $27,590.","The company also expressed confidence in its artificial intelligence-integrated business analytics products, with a 16% increase in software licenses and a 28% increase in subscription services year-over-year.","According to Le, MicroStrategy is well-positioned to benefit from both the Bitcoin market dynamics and the growth in its business intelligence business. Following these developments, MicroStrategy’s stock price (MSTR) rose by 2.7% in after-hours trading, reaching $438, according to Google Finance."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"August 2020","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"2.7%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"October 31","content":"DATE"},{"type":"$109.6 million","content":"MONEY"},{"type":"$5.3 million","content":"MONEY"},{"type":"$26,970","content":"MONEY"},{"type":"$130 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Google Finance","content":"ORGANIZATION"},{"type":"September 24","content":"DATE"},{"type":"end of the second quarter","content":"DATE"},{"type":"$33.6 million","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"$27,590","content":"MONEY"},{"type":"$143.4 million","content":"MONEY"},{"type":"$27,053","content":"MONEY"},{"type":"the quarter","content":"DATE"},{"type":"$29,586","content":"MONEY"},{"type":"Michael Saylor","content":"PERSON"},{"type":"$900 million","content":"MONEY"},{"type":"$35,000","content":"MONEY"},{"type":"$30,480","content":"MONEY"},{"type":"$438","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"$66 million","content":"MONEY"},{"type":"Andrew Kang","content":"PERSON"},{"type":"November 1","content":"DATE"},{"type":"3.3%","content":"PERCENT"},{"type":"$129.5 million","content":"MONEY"},{"type":"August 1","content":"DATE"},{"type":"$167 million","content":"MONEY"},{"type":"$147.3 million","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"16%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":["Bitcoin","btc","Michael Saylor","MicroStrategy"],"authors":["Hassan Shittu"]}