{"summary":"Spot Bitcoin ETF Approval is Unlikely to Change Regulatory Environment in the US + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spot-bitcoin-etf-approval-is-unlikely-to-change-regulatory-environment-in-the-us-more-news.htm","publishDate":"2024-01-02T14:00:12","id":20588,"type":null,"title":"Spot Bitcoin ETF Approval is Unlikely to Change Regulatory Environment in the US + More News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","The approval of spot bitcoin (BTC) exchange-traded fund (ETF) will be a key step forward, say Steve Scott and AJ Nary of digital asset custody firm BitGo, but it’s unlikely that the bigger regulatory picture will be resolved any time soon in the US.","As published in the American Banker, BTC is the only digital asset considered a commodity at this time, so “a spot bitcoin ETF won’t likely pave a quick path to, say, an ETF basket of crypto assets.”","Nonetheless, it will allow advisors and investors to transition into the new asset class via ETFs as a familiar vehicle, said Scott and Nary.","They argued that,","“The approval of a spot bitcoin [ETF] is almost certainly a matter of “when” rather than “if.” Yet, bitcoin ETF approvals likely won’t come as soon as many people in the crypto industry would like to believe.”","The two opined that we are likely to see another round of application rejections given the continued lack of clear market structure that led to the downfall of the crypto exchange FTX.","“In other words, the lack of separation of custody and trading will continue to serve as a stumbling block for approval until it is fully addressed.”","Therefore, ETF applicants will likely need to show to the US Securities and Exchange Commission (SEC) that their assets will be custodied with one provider, ideally a qualified custodian, and traded using a different entity.","Whichever asset management company gets the first approval, a group of investment companies’ applications that satisfy the above-stated requirement could be approved in rapid succession or even all at once.","“Predicting how quickly this will occur is a purely speculatory exercise,” Nary and Scott wrote.","Security token and digital asset trading platform INX Digital Company said that on December 20, 2023, it learned of a cyberattack on the computer systems of a third-party vendor providing services to one of the company’s subsidiaries.","According to the press release, a malicious actor accessed the vendor’s servers and executed unauthorized trades, leading to a $1.6 million loss for the subsidiary.","INX stated that,","“The customers were not affected by the incident, and the security breach at the third-party provider did not have any impact on the platforms and servers of INX.”","No customer personal information or other data was compromised, and INX.One remains fully operational.","The company “took immediate actions to remediate the security vulnerability and to investigate the nature and scope of the incident.”","It also notified law enforcement and placed additional security measures in place.","Crypto exchange Bybit partnered with Manta Network, a privacy-preserving protocol using zero-knowledge (ZK) application ecosystems.","The Bybit Wallet now supports Manta, providing a seamless experience for over 800,000 users utilizing the Web3 Wallet, said the press release.","“This integration not only expands the functionality of the Bybit Wallet but also brings the advantages of Manta Network’s ZK technology to a broader user base,” it added.","Crypto miner Core Scientific announced filing an amended plan of reorganization and extension of the subscription deadline for its Equity Rights Offering to January 5, 2024.","The Company previously announced a global settlement with all key stakeholders. While subject to further finalization, the Plan reflects the Global Settlement and represents another step towards confirmation and exit from Chapter 11, it said.","The Bankruptcy Court also approved the company’s motion requesting to modify certain dates and deadlines with respect to the plan, including an extension of the deadlines to vote on the plan or file an objection to it.","The Court has agreed to reschedule the combined hearing to consider the final approval of the Disclosure Statement and confirmation of the Plan to January 16, 2024 (the “Combined Hearing”).","The company still expects to emerge from Chapter 11 in mid-to-late January 2024.","As a result of rescheduling the Combined Hearing, the deadline for participating in the Equity Rights Offering has been extended to Friday, January 5, 2024."],"entity":[{"type":"January 5, 2024","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Crypto miner Core Scientific","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"Manta Network","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Manta Network","content":"LOCATION"},{"type":"Scott","content":"PERSON"},{"type":"Nary","content":"ORGANIZATION"},{"type":"Manta","content":"LOCATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"INX Digital Company","content":"ORGANIZATION"},{"type":"January 16, 2024","content":"DATE"},{"type":"Steve Scott","content":"PERSON"},{"type":"December 20, 2023","content":"DATE"}],"hashtag":["Bitcoin ETF","Security","USA"],"authors":["Sead Fadilpašić"]}