{"summary":"Liverpool FC Mull Bid to Ditch TradFi for Crypto Firm in Shirt Sponsorship Deal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/liverpool-fc-mull-bid-ditch-tradfi-for-crypto-firm-shirt-sponsorship-deal.htm","publishDate":"2022-04-26T14:00:00","id":20594,"type":null,"title":"Liverpool FC Mull Bid to Ditch TradFi for Crypto Firm in Shirt Sponsorship Deal","category":["Bitcoin News "],"content":[" ","Liverpool FC has reportedly held talks with at least two crypto-related firms, thought to be a major international exchange player and a blockchain operator, over a deal that could see a crypto firm’s name on the front of its first team shirts from next year.","Crypto-related companies are thought to be keen to secure a first blue-chip club football sponsorship deal, and have apparently failed in a bid to convince FC Barcelona to sign on the dotted line, despite offering more money than non-crypto rivals.","Per The Athletic’s David Ornstein, formerly of the BBC and one of the UK’s leading (and best-connected) football journalists, such a deal would be “uncharted territory” for both Liverpool and the football world.","Liverpool is one of the most-decorated clubs in both English and world football, with 19 league titles and six European Cups\/Champions League titles to their name. Along with Manchester United, they are arguably the biggest name team in the English Premier League (EPL), and for the crypto sector, landing a deal of this scale would be a major coup.","Ornstein wrote:","“The club are also talking to firms from sectors including electronics, media, and tourism. Among those parties […] are companies from the cryptocurrency sector. They include a crypto exchange firm and a blockchain platform.”","The journalist added:","“It is likely to be controversial but Liverpool are desperate to financially compete with other elite clubs and maximize their commercial deals.”","The Liverpool Echo, which also has close ties to the club, reported that the club is set to “test the water with regards to the strength of the sponsorship market before entering into serious discussions” with potential sponsors.","The same media outlet reported that the current sponsorship deal that Liverpool has with the TradFi (traditional finance) banking giant Standard Chartered expires at the end of next season. The bank has sponsored the Reds since 2010 and is worth some USD 51 million per year.","The Liverpool Echo claimed that it “understands that the finance firm have interest in remaining a partner of the club.”","Other media outlets have also claimed that Standard Chartered wants to continue its sponsorship deal, but it is highly likely that the Reds – who have enjoyed phenomenal success under current manager Jurgen Klopp – will want considerably more than they are currently receiving from a potential partner. The club will play in the semi-finals of the Champions League later this week, has already won the EPL League Cup, and in May will play in the final of the FA Cup.","Ornstein noted:","“Talks are continuing with all parties, with Liverpool hopeful of finalizing a deal, which is expected to bring in more than USD 89 million over two seasons, in the next eight weeks.”","However, the journalist noted that “the possibility of Liverpool partnering with a crypto sponsor has not yet been discussed with supporters.”","A recent non-fungible token (NFT) project drew the ire of some sections of the club’s fanbase, and the Echo stated that the club was “understood to be against any sponsorship deals with fan token firms in their current guise, taking the likes of Socios off the table.” It added that “significant sponsorship offers from fan token firms have already been rejected this year by the club.”","Jason Wilde, a 38-year-old Liverpool fan, told Cryptonews.com:","“I do think this news is being put out there to test fan opinion, as some have suggested. I think if the deal wasn’t with an unscrupulous company and it allowed the club to invest in the playing squad, fans wouldn’t necessarily be too upset in the long run.”","On the r\/LiverpoolFC subreddit, fans questioned the mathematics used to calculate the deal, claiming that USD 89m over two seasons was actually lower than the worth of Standard Chartered’s current deal.","Others expressed reservations, with one Redditor writing:","“LFC deserves a high-paying sponsor, but I’m not feeling this.”","Another opined:","“It really depends who [the firms are]. Crypto isn’t a blanket of ‘all is bad.’”","Others questioned the motivation behind those expressing their disapproval, claiming that a number of firms working in the TradFi world had been complicit in money laundering, and one opined:","“I can’t believe that you genuinely believe crypto is worse than an investment bank.”","____","Learn more: \n– Messi Inks USD 20M Deal in Another Crypto Marketing Effort\n– The Rise of Football Fan Tokens: What Are They & Do We Really Need Them?\n\n– FC Barcelona’s Crypto Plan\n– FC Barcelona ‘Rejected’ USD 79.4M Sponsorship Deal from Crypto Firm over ‘Ethical’ Worries\n\n– Binance CEO Eyed Abramovich’s Chelsea\n– Crypto.com Scores World Cup"],"entity":[{"type":"LFC","content":"ORGANIZATION"},{"type":"later this week","content":"DATE"},{"type":"Liverpool Echo","content":"ORGANIZATION"},{"type":"Messi Inks USD","content":"ORGANIZATION"},{"type":"2010","content":"DATE"},{"type":"BBC","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Liverpool","content":"ORGANIZATION"},{"type":"Champions League","content":"ORGANIZATION"},{"type":"Jurgen Klopp","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"David Ornstein","content":"PERSON"},{"type":"Jason Wilde","content":"PERSON"},{"type":"Manchester United","content":"ORGANIZATION"},{"type":"Liverpool","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"European Cups\/Champions League","content":"ORGANIZATION"},{"type":"Ornstein","content":"PERSON"},{"type":"USD 51 million","content":"MONEY"},{"type":"EPL","content":"ORGANIZATION"},{"type":"Barcelona","content":"LOCATION"},{"type":"USD 89 million","content":"MONEY"},{"type":"Standard Chartered","content":"ORGANIZATION"},{"type":"FA","content":"ORGANIZATION"}],"hashtag":["Adoption","Blockchain","Exchange","Marketing","Sport","UK"],"authors":["Tim Alper"]}