{"summary":"Crypto Firms to Undergo Regulatory Sandbox Evaluation Before Licensing in Indonesia","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-firms-regulatory-sandbox-evaluation-licensing-indonesia.htm","publishDate":"2024-03-28T11:19:31","id":20596,"type":null,"title":"Crypto Firms to Undergo Regulatory Sandbox Evaluation Before Licensing in Indonesia","category":["Blockchain News "],"content":["Starting in January 2025, crypto firms seeking to operate in Indonesia must undergo evaluation in a regulatory sandbox before being licensed. This regulatory change will come into effect as supervision of the crypto industry transitions to the Financial Services Authority (OJK).","Firms offering crypto services in Indonesia without undergoing evaluation in the sandbox will be deemed to be operating illegally.","A regulatory sandbox is a crucial testing ground for evaluating financial products and services’ safety, reliability, and innovative potential. It provides an isolated environment where trial runs can be conducted to enhance security measures and promote responsible management within the financial sector.","Indonesia’s crypto industry currently falls under the supervision of the commodities and futures trading regulator, Bappebti, as crypto assets are categorized as commodities. However, with the upcoming transition of oversight to the Financial Services Authority (OJK), crypto assets are expected to be reclassified as financial instruments.","Hasan Fawzi, Chief Executive of the Supervision of Financial Sector Technology Innovation, Digital Financial Assets, and Crypto Assets, highlighted that once the OJK regulates crypto assets, they will also need to undergo evaluation in a regulatory sandbox. He said:","“I think this is our spirit at OJK, especially in consumer protection and education. We really hope that all of our regulatory mechanisms will be present and have a direct impact on preventing fraudulent investments.”","Fawzi emphasized the importance of regulatory mechanisms in preventing fraudulent activities and stated that crypto companies with new products or business models must participate in the sandbox. Failure to do so may result in classification as an unlicensed or illegal product.","“So it’s easy to organize ITSK that are not registered as participants in our sandbox, or later after there are clusters that we determine with permission from the OK or without permission, then like the others, we will encourage the consumer community to choose whether they are good or not.”","Indonesia has been actively pursuing guidelines to regulate the crypto industry, leading to collaborations with other nations and international partnerships to develop a comprehensive crypto strategy. Indonesia’s Financial Services Authority (OJK) has been at the forefront of these efforts, working with financial regulators from Malaysia, Singapore, and Dubai to establish a strong foundation for crypto policy.","As part of these collaborations, the OJK has been involved in writing Memorandums of Understanding (MoUs) with critical entities such as the Monetary Authority of Singapore, the Virtual Asset Regulatory Authority of Dubai, and Bank Negara of Malaysia. These partnerships reflect a collective effort to create a regulatory framework addressing cryptocurrency’s challenges and opportunities.","🇮🇩 Indonesia’s Financial Regulator Issues New Crypto Regulations Ahead of January 2025 Transition","Indonesia’s financial services watchdog released new rules that will cover cryptocurrencies and will come into force in January 2025.#CryptoNews #Indonesiahttps:\/\/t.co\/xZI4D7WS3c","— Cryptonews.com (@cryptonews) March 14, 2024","","Earlier this year, in March, the OJK released new rules that will cover cryptocurrencies and will come into force in January 2025. These fresh directives are designed to strengthen the financial industry by guiding how digital financial assets, including cryptocurrencies, should be managed.","The directives emphasize leveraging novel technologies as opportunities arise and scrutinizing the digital operations of financial institutions. They also prioritize customer protection, pilot testing of technological innovations, and reporting test results to ensure transparency and accountability.","While specific technical details are not yet available, introducing these regulations signifies OJK’s proactive approach to preparing to assume control over crypto regulation in 2025."],"entity":[{"type":"2025","content":"DATE"},{"type":"Digital Financial Assets","content":"ORGANIZATION"},{"type":"OJK","content":"LOCATION"},{"type":"Bappebti","content":"LOCATION"},{"type":"OJK","content":"ORGANIZATION"},{"type":"Indonesia","content":"LOCATION"},{"type":"Indonesia’s Financial Regulator Issues New Crypto Regulations Ahead of January 2025 Transition","content":"ORGANIZATION"},{"type":"Indonesia’s Financial Services Authority","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"January 2025","content":"DATE"},{"type":"March 14, 2024","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Virtual Asset Regulatory Authority","content":"ORGANIZATION"},{"type":"Bank Negara","content":"ORGANIZATION"},{"type":"Supervision of Financial Sector Technology Innovation","content":"ORGANIZATION"},{"type":"Hasan Fawzi","content":"PERSON"},{"type":"Financial Services Authority","content":"ORGANIZATION"}],"hashtag":["Indonesia","OJK","Sandbox"],"authors":["Hassan Shittu"]}