{"summary":"Bitcoin Vulnerable to 15% Drop from War or Terror Events: SkyBridge Capital’s Anthony Scaramucci","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-vulnerable-to-15-drop-from-war.htm","publishDate":"2024-04-19T05:44:01","id":20595,"type":null,"title":"Bitcoin Vulnerable to 15% Drop from War or Terror Events: SkyBridge Capital’s Anthony Scaramucci","category":["Bitcoin News "],"content":["SkyBridge Capital founder Anthony Scaramucci said that war or terrorist attacks could potentially lead to a 10% to 15% decline in Bitcoin’s value over the next year.","In a CNBC interview published Thursday, Scaramucci discussed Bitcoin’s nascent stage of adoption. He said the asset will not achieve its marketed role as an inflation hedge or a store of value until its user base surpasses 1 billion.","“Right now, it’s going to be way more volatile than people like,” he said. “And people look at it as a risk-on or risk-off trade until we get to that adoption.”","His comments came before Bitcoin dipped below $60,000 on Friday amidst heightened geopolitical tensions. The drop followed reports of an Israeli missile strike on Iran.","According to ABC News, Israel launched missiles in a retaliatory strike against Iran early Friday. Iran’s Fars news agency reported hearing three explosions near a military base in Isfahan, a central city. An Iranian official reportedly refuted claims of a missile attack, attributing the explosions to the activation of Iran’s air defense systems.","During geopolitical tensions and military conflicts, investors tend to become more cautious and seek safer assets to protect their investments. Traditionally, they turn to assets like gold and government bonds for safety.","Scaramucci went on to express optimism regarding Bitcoin’s long-term prospects. He anticipates factors like the recent Spot ETF launch, the entry of major financial institutions, and the upcoming halving event to potentially propel Bitcoin’s value toward $200,000.","Additionally, he dismissed concerns about excessive centralization due to ETFs. Scaramucci argues that current institutional ownership, including BlackRock, represents a relatively small portion of the overall Bitcoin market, less than 10%.","Scaramucci’s most recent price prediction for Bitcoin exceeds his prior forecast. Earlier this year, he projected that Bitcoin could surge to $170,000 by mid-to-late 2025, assuming it maintained a price of above $45,000 at the time of the halving.","The Bitcoin network undergoes a technical event known as a halving, which serves to decrease the rate of new Bitcoin entering circulation.","Scheduled to occur between April 19 and 20, this event reduces the miner reward for verifying transactions by 50%. This halving mechanism will continue until the total number of Bitcoins in circulation reaches its capped supply of 21m."],"entity":[{"type":"2025","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"ABC News","content":"ORGANIZATION"},{"type":"SkyBridge Capital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"April 19","content":"DATE"},{"type":"Fars","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"$45,000","content":"MONEY"},{"type":"$200,000","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"Isfahan","content":"LOCATION"},{"type":"$170,000","content":"MONEY"},{"type":"Scaramucci","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Iran","content":"LOCATION"}],"hashtag":["Anthony Scaramucci","Bitcoin Price"],"authors":["Shalini Nagarajan"]}