{"summary":"Three Arrows Capital Founders Shake Up Crypto Industry with New Crypto Exchange After Acquiring CoinFLEX Assets – Here’s What You Need to Know","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/three-arrows-capital-founders-shake-up-crypto-industry-with-new-crypto-exchange-after-acquiring-coinflex-assets-heres-what-you-need-know.htm","publishDate":"2023-03-08T17:11:00","id":20608,"type":null,"title":"Three Arrows Capital Founders Shake Up Crypto Industry with New Crypto Exchange After Acquiring CoinFLEX Assets – Here’s What You Need to Know","category":["Blockchain News "],"content":["Su Zhu and Kyle Davies, the two founders of the bankrupt crypto hedge fund Three Arrows Capital (3AC), have completed a funding round for their new OPNX exchange and will acquire the remaining assets of the troubled exchange CoinFLEX.","The news that fundraising for the new exchange has been completed was shared in a Twitter thread by a popular community member and DeFi researcher Ignas, who said Kyle Davies had reached out to him and confirmed the news.","The exchange is said to have raised $25m, but Kyle Davies reportedly declined to say who the investors are.","In his Twitter thread, Ignas also confirmed that OPNX – or Open Exchange – will acquire all of CoinFLEX’s assets, and that this includes “people, tech, and tokens.” He added that FLEX would be the new exchange’s own token.","According to Ignas, FLEX will be used to pay fees on the platform, similar to how BNB is used to pay fees on Binance, and 20% of the revenue generated will be used to buy and burn FLEX tokens.","1\/12 Kyle Davies reached out to me after this tweet.\n\nThe fundraising deal is done.\n\nBut they won't disclose who are the investors – as most exchanges don't.\n\nHe also explained how the exchange, collateral system & tokenomics works: 🧵 https:\/\/t.co\/A43gKBMjz0","The acquisition of CoinFLEX by OPNX is part of the former’s restructuring plan, which was approved by a court in Seychelles on Monday this week, according to a blog post from CoinFLEX.","OPNX is a marketplace for trading in bankruptcy claims from other crypto companies. The marketplace officially opened its waitlist for users who want to put their claims up for sale back in February, with Su Zhu then calling it the world’s first marketplace for crypto claims trading.","“We spoke to creditors about several plans. And everyone we talked with thought this one was the wisest way to use our existing resources, all the painful lessons, and wish contribute to crypto,” Su Zhu said about the project in a Twitter thread at the time.","8\/ we spoke to creditors about several plans. and everyone we talked with thought this one was the wisest way to use our existing resources, all the painful lessons and wish contribute to crypto","News that the 3AC founders were starting their own exchange first broke in January this year. At the time, Su Zhu confirmed that they were indeed working on such a platform without elaborating on the plans.","The exchange was initially named GTX, which reportedly was chosen simply because “G” comes after “F,” making the name a play on the now-bankrupt exchange FTX. It was later rebranded to Open Exchange, or OPNX for short."],"entity":[{"type":"OPNX","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Monday this week","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"GTX","content":"ORGANIZATION"},{"type":"Zhu","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"January this year","content":"DATE"},{"type":"$25m","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Ignas","content":"LOCATION"}],"hashtag":["Three Arrows Capital"],"authors":["Fredrik Vold"]}