{"summary":"Michael Saylor Says There Is No Reason to Sell Bitcoin Anytime Soon","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/michael-saylor-says-there-is-no-reason-to-sell-bitcoin-anytime-soon.htm","publishDate":"2024-02-21T08:52:16","id":20609,"type":null,"title":"Michael Saylor Says There Is No Reason to Sell Bitcoin Anytime Soon","category":["Bitcoin News "],"content":["MicroStrategy executive chairman and co-founder Michael Saylor says there is no reason to sell any of his Bitcoin anytime soon, in an interview with Bloomberg’s Katie Greifeld on Tuesday.","Saylor said the approval of a spot Bitcoin ETFs is a rising tide that is going to lift all boats – this phrase is metaphorically associated with the idea that as the market improves this will benefit all participants.","“But if you look at what the spot ETFs are doing – they are facilitating the digital transformation of capital and every day hundreds of millions of dollars of capital is flowing from the traditional analogue ecosystem into the digital economy,” adds Saylor.","“I’m going to be buying the top forever,” adding  “Bitcoin, is the exit strategy,”  Saylor told Bloomberg.","The MicroStrategy chairman is making his rounds in the media and was recently quoted saying there is over a decade of pent-up demand for Bitcoin exchange-traded funds, in an interview with CNBC.","“There’s 10 years of pent-up demand people been waiting for these ETFs and finally, mainstream investors are able to access Bitcoin and I think that’s what’s driving the surge of capital in the asset class,” said Saylor.","The MicroStrategy chairman discussed the state of the crypto industry, the rollout of bitcoin ETFs, bitcoin’s climbing valuation, and future plans.","In the interview, Saylor also explained that MicroStrategy will be rebranding as a Bitcoin development company. He explained, that the rebrand was a natural decision due to the company’s success in its Bitcoin strategy and unique status as the world’s largest publicly traded holder of Bitcoin.","Saylor highlighted plans to develop software, generate cash flow, and leverage the capital markets to accumulate more Bitcoin for shareholders and promote the growth of the Bitcoin network.","MicroStrategy’s Bitcoin investment has soared beyond the $10 billion mark, owning over 190,000 BTC as Bitcoin’s value climbs past $50,000. This achievement underscores MicroStrategy’s confidence in Bitcoin’s long-term prospects and its utility as an inflation hedge, writes Arslan Butt from Cryptonews.","Since joining the Bitcoin market in August 2020, MicroStrategy’s BTC portfolio has expanded significantly, even amidst the bear market’s challenges in early 2022. Despite experiencing a downturn in its fourth-quarter revenue and profit, MicroStrategy, under Michael Saylor’s leadership, continued to bolster its Bitcoin holdings, purchasing an additional 850 BTC for $37.2 million in January alone."],"entity":[{"type":"Katie Greifeld","content":"PERSON"},{"type":"MicroStrategy’s BTC","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$10 billion mark","content":"MONEY"},{"type":"MicroStrategy’s Bitcoin","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"$37.2 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Bitcoin","Michael Saylor","MicroStrategy"],"authors":["Tanzeel Akhtar"]}