{"summary":"Jack Dorsey’s Block’s Crypto Unit Under Investigation Over Compliance Practices: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/jack-dorsey-blocks-crypto-unit-under-investigation.htm","publishDate":"2024-05-02T04:07:19","id":20607,"type":null,"title":"Jack Dorsey’s Block’s Crypto Unit Under Investigation Over Compliance Practices: Report","category":["Blockchain News "],"content":["Federal prosecutors have launched an investigation into Block, the financial technology company co-founded by Twitter’s Jack Dorsey. The investigation focuses on alleged compliance lapses at its central units, Square and Cash App. ","Sources with direct knowledge of the matter revealed that discussions with a former employee have undisclosed documents highlighting various shortcomings in compliance practices, as reported by NBC News on Wednesday. ","","Federal prosecutors are digging into internal practices at Block, which owns Cash App and Square.","An ex-employee claims Block processed crypto transactions for terrorist groups and Square processed transactions involving nations subject to sanctions. https:\/\/t.co\/v5KNboKywz","— NBC News (@NBCNews) May 1, 2024","","The allegations against Block include inadequate customer information collection, processing transactions involving countries under U.S. sanctions, and facilitating cryptocurrency transactions for terrorist groups. The revelations suggest a significant regulatory challenge for Block, with the former employee alleging that thousands of transactions were not reported to the government as required. ","“From the ground up, everything in the compliance section was flawed; it is led by people who should not be in charge of a regulated compliance program,” the former employee told NBC News.","Despite being alerted to these breaches, Block purportedly failed to rectify its processes, according to information shared with prosecutors. The Southern District of New York, where the investigation is taking place, declined to comment on the matter. The compliance issues extend to Block’s Square unit, where instances of insufficient due diligence on international merchant sellers and improper reimbursement of frozen funds for sanctions violations were identified.","Edward Siedle, a previous attorney for the Securities and Exchange Commission (SEC) who now advocates for the former employee, engaged in discussions with prosecutors on behalf of his client and said:","“It’s my understanding from the documents that compliance lapses were known to Block leadership and the board in recent years.”","Additionally, Cash App’s design reportedly increases the risk of compliance lapses due to customers’ rapid depletion of stored balances.","“Due to the nature of the product, customers do not appear to leave stored balances in Cash App very long, so our ability to block a stored balance or reject funds is limited. In virtually all situations, balances have been depleted by the time of review,” a document said.","While Block defended its compliance program, highlighting voluntary transaction reporting to the Office of Foreign Assets Control (OFAC), specific deficiencies mentioned in documents provided to prosecutors were not addressed.","Furthermore, Block’s regulatory challenges include a settlement between Sutton Bank, a partner of Cash App, and the Federal Deposit Insurance Corp. (FDIC) over alleged violations of anti-money laundering regulations.  While Sutton Bank settled issues concerning customer identification, Block stated that the consent order is unlikely to affect its ongoing relationship with the bank.","Moreover, the allegations come amidst recent departures from Block’s board of directors, including Lawrence Summers, the former U.S. Treasury Secretary. Summers resigned in February, followed by Sharon Rothstein in April, raising questions about corporate governance and oversight. ","Block recently reported impressive profits from Bitcoin sales via its Cash App platform in Q4 2023. With a significant increase of 90% in gross profit compared to the previous year, Block earned $66 million from Bitcoin transactions, which were driven by a surge in the average market price of Bitcoin and an appreciation of its Bitcoin inventory. The total sale amount of Bitcoin reached $2.52 billion, marking a notable 37% increase year over year.","Cash App’s success in Bitcoin trading continues to propel Block’s growth. In 2023, $205 million in gross profit was generated, reflecting a 31% year-over-year increase. The platform’s embrace of cryptocurrencies has attracted a considerable number of new customers, with over 1 million first-time Bitcoin purchasers recorded in January 2023. ","In December alone, the platform saw a 20% increase in Cash App Card monthly active users, totalling 23 million, outpacing the growth rate of total monthly activities. ","Block also recently unveiled its accomplishment of designing a standalone three-nanometer (3nm) Bitcoin mining chip."],"entity":[{"type":"Sharon Rothstein","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"January 2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Lawrence Summers","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"37%","content":"PERCENT"},{"type":"NBC News","content":"ORGANIZATION"},{"type":"$2.52 billion","content":"MONEY"},{"type":"Edward Siedle","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"May 1, 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$66 million","content":"MONEY"},{"type":"Block’s Square","content":"LOCATION"},{"type":"NBC News (","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"31%","content":"PERCENT"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"Sutton Bank","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"$205 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Block","Jack Dorsey"],"authors":["Hassan Shittu"]}