{"summary":"In what could prove to be a watershed moment, Sony files for an NFT patent that would allow for in-game assets to be used across different titles and platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221718\/sony-nfts-new-patent-filed-by-gaming-and-entertainment-powerhouse","publishDate":"2023-03-21T13:58:00","id":2060,"type":null,"title":"Sony NFTs: New patent filed by gaming and entertainment powerhouse","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Sony Interactive Entertainment, the company that produces the wildly popular Playstation gaming console and has released a host of popular video games, filed a patent request for NFTs in an effort to provide more flexibility with in-game assets.<\/span>","<span data-v-f87c67ca=\"\">In Sony’s filing, dated last week, the company outlined how it wants gamers to be able to use NFTs across different games and platforms, including those produced by rival console makers like Microsoft and Nintendo. “[T]he <\/span><span data-v-f87c67ca=\"\">NFT is provided to the [user] … so that the digital asset may be used, via the NFT, across plural different computer simulations and\/or across plural different computer simulation platforms,” the filing said. “Ownership of the NFT may also be subsequently transferred to other [users] … for their own use across different simulations and\/or platforms.”<\/span>","<span data-v-f87c67ca=\"\">The Japanese conglomerate's desire to use NFTs comes at a time blockchain-enabled games and the companies making them are struggling to attract mainstream gamers used to playing on the consoles and platforms provided by Playstation and Xbox, which is made by Microsoft. Sony embracing both in-game digital assets, or NFTs, and potentially inoperability that extends to other companies could prove to be a seminal moment in the evolution of gaming.<\/span>","<span data-v-f87c67ca=\"\">If Sony becomes a strong supporter of digital asset ownership in gaming, coupled with its experience delivering popular titles like “The Last of Us” to market, the company could help introduce millions of gamers to blockchain-powered gaming.<\/span>","<span data-v-f87c67ca=\"\">Besides pointing to the potential interoperability between Playstation and gaming consoles “<\/span><span data-v-f87c67ca=\"\">made by Microsoft or Nintendo,\" or other manufacturers, Sony’s filing expressed aims to have the NFTs also work across “virtual reality (VR) headsets, augmented reality (AR) headsets,” smartphones, tablets, computers and televisions.<\/span>","<span data-v-f87c67ca=\"\">The next era of the internet and gaming, many blockchain advocates believe, will include increased interoperability — the ability to use digital artifacts across different games, platforms and devices — and widespread ownership of digital assets that can be used on different devices and platforms. This next phase, dubbed web3, is currently being built with help from many executives and gaming developers who made a name for themselves during the period known as web2, which has been traditionally dominated by closed ecosystems.<\/span>","Sony also&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/187949\/sony-tries-to-patent-nft-and-blockchain-technology-usage-in-games\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/187949\/sony-tries-to-patent-nft-and-blockchain-technology-usage-in-games\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">filed an NFT patent<\/a> last November; however, the patent appeared to be rejected for failing to \"integrate the abstract idea into a practical application.\" The company has also explored using blockchain technology for music copyright management and education.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sony Interactive Entertainment","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Sony","content":"ORGANIZATION"},{"type":"Nintendo","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}