{"summary":"Vitalik Buterin Says Worldcoin Doing Good Job at Taking Privacy Criticism Seriously","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vitalik-buterin-says-worldcoin-takes-privacy-criticism-seriously.htm","publishDate":"2024-03-29T06:55:59","id":20613,"type":null,"title":"Vitalik Buterin Says Worldcoin Doing Good Job at Taking Privacy Criticism Seriously","category":["Altcoin News "],"content":["Ethereum co-founder Vitalik Buterin has recently commented on Worldcoin’s attempt to ensure user data’s privacy, acknowledging their effort.","Replying to a user’s post on social media Buterin addressed to the project co-founded by OpenAI’s Sam Altman, saying that Worldcoin has done “quite a good job” when it comes to protecting personal information with cryptography.","“IMO [In my opinion] they actually have been doing quite a good job of taking the privacy critiques seriously and designing their system to be more and more data-minimal,” said Buterin.","IMO they actually have been doing quite a good job of taking the privacy critiques seriously and designing their system to be more and more data-minimal. Modern cryptography is truly amazing.","— vitalik.eth (@VitalikButerin) March 29, 2024","","“Modern cryptography is truly amazing,” he said.","In October 2023, Vitalik Buterin expressed concerns about Worldcoin, especially its fundamental mechanism that verifies human identity via iris scanning. He discussed its “digital passport” that differentiates humans from AI but raised privacy and accessibility issues.","Buterin noted the system’s potential to solve “anti-spam and anti-concentration-of-power problems,” yet he cautioned, “If proof of personhood is not solved, decentralized governance becomes much easier to capture by very wealthy actors, including hostile governments.”","His primary worry was the extensive data collected through iris scanning, potentially revealing personal details like sex, ethnicity, and medical conditions.","Regarding Worldcoin’s global accessibility, Buterin was skeptical, pointing out, “Even with much higher-scale distributed manufacturing, it would be hard to get to a world where there’s an Orb within five kilometers of everyone.”","Worldcoin’s biometric data collection practices have recently faced regulatory actions globally.","In Portugal, the National Data Protection Commission (CNPD) temporarily halted Worldcoin for 90 days on March 26, due to concerns over collecting iris and facial scans without adequate consent, particularly from minors.","Similarly, in Spain, the Data Protection Agency (AEPD) issued a three-month ban on Worldcoin’s data collection starting March 6, citing similar issues. Legal appeals by Worldcoin were rejected by a local court, affirming the AEPD’s decision.","These instances reflect a growing scrutiny of Worldcoin by regulators in different jurisdictions, including Hong Kong and Kenya, where concerns over privacy risks and biometric data collection have led to investigations and restrictions on the platform’s activities."],"entity":[{"type":"Kenya","content":"LOCATION"},{"type":"Portugal","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"March 26","content":"DATE"},{"type":"National Data Protection Commission","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"October 2023","content":"DATE"},{"type":"Worldcoin","content":"PERSON"},{"type":"IMO","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"Spain","content":"LOCATION"},{"type":"Data Protection Agency","content":"ORGANIZATION"},{"type":"March 6","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"March 29, 2024","content":"DATE"}],"hashtag":["Sam Altman","Vitalik Buterin","Worldcoin"],"authors":["Hongji Feng"]}