{"summary":"The Libra Association has unveiled a host of new changes to its proposed stablecoin project\nFacebook’s David Marcus also confirmed past reporting that the project will see an array of stablecoins backed by single currencies.\nA new white paper has been published, which strongly indicates that Libra wants to cater to central banks as they develop digital currencies\nThe Libra Association has begun the process of seeking a payment services license in Switzerland","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62095\/libra-multi-currency-shift-central-bank-digital-currencies","publishDate":"2020-04-16T10:27:07","id":2061,"type":null,"title":"Libra confirms shift to multi-currency model, points to support for central bank digital currencies","category":["Facebook"],"content":["Facebook's David Marcus confirmed Thursday that the Libra stablecoin project will see a host of single-currency stablecoins developed alongside a multi-currency one.","\"We are therefore augmenting the Libra network by including singlecurrency stablecoins in addition to ≋LBR, initially starting with some of the currencies in the proposed ≋LBR basket (e.g., LibraUSD or ≋USD, LibraEUR or ≋EUR, LibraGBP or ≋GBP, LibraSGD or ≋SGD),\" the paper states.","In a significant disclosure, the LBR will essentially be comprised of those single-currency stablecoins, according to a&nbsp;<a href=\"https:\/\/libra.org\/en-US\/wp-content\/uploads\/sites\/23\/2020\/04\/Libra_WhitePaperV2_April2020.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">newly-revamped white paper<\/a>, which explains:","The move –along with other changes noted by Facebook's Marcus – constitutes a nod to the regulatory pressure the project has faced since its official inception last summer Libra is backed by an international organization of companies that includes social media giant Facebook.","The white paper strongly indicates that Libra could come to serve as a platform for central bank digital currencies. Such moves could change the face of Libra over time if central banks move to launch such initiatives.","As the paper notes:","\"Indeed, as the prospect of central bank digital currencies (CBDCs) becomes a reality, the expectation that the Libra payment system will be capable of being upgraded to support these public sector innovations is a design principle we aim to deliver,\" the paper further adds.","Among the changes being enacted, <a href=\"https:\/\/twitter.com\/davidmarcus\/status\/1250786162232320003\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">according to Marcus<\/a>, is \"replacing the originally planned transition to a permissionless form of governance to a market-driven open and competitive network.\"&nbsp;","Libra will also sport \"a comprehensive network-level system around anti-money laundering (AML), Combatting the Financing of Terrorism (CFT), and sanctions enforcement\" and \"building stronger protections into the design of the Libra Reserve to protect consumers, even in the most adverse situations.\"","On this point, the white paper explains: \"In the first Libra white paper, we announced a path to eventually transitioning the network to a permissionless system. In the months since, a key concern we heard is that it would be challenging for the Libra Association to guarantee that network compliance provisions would be maintained.\"","Notably, the Libra Association has begun the process of obtaining a payment systems license from the&nbsp;Swiss Financial Markets Supervisory Authority (FINMA). \"The licensing process has, and will continue to have, input from central banks and other financial regulatory, supervisory and enforcement authorities around the world who have been brought together as a part of FINMA's regulatory supervisory college,\" the Association said in a statement.","The proposed currency basket-backed token was first unveiled last summer as a digital currency aimed at banking the unbanked, has been quiet about its project in recent months. <a href=\"https:\/\/www.theblockcrypto.com\/daily\/54860\/the-libra-association-is-weighing-a-shift-to-a-u-s-dollar-backed-stablecoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The Block<\/a> reported in February that the Libra Association was weighing a shift from its original concept to a U.S. dollar stablecoin.&nbsp;","Further <a href=\"https:\/\/www.theinformation.com\/articles\/facebook-scales-back-libra-plans-bowing-to-regulators\" data-v-f87c67ca=\"\">reporting<\/a> from The Information in March found that Facebook plans to offer users of its Calibra unit access to government-backed currencies, including the euro and U.S. dollar, in addition to Libra. The report said the Libra Association would \"introduce Libra token along the collection of digital government-issued currencies.\""],"hashtag":[]}