{"summary":"Thai SEC Warns Crypto Exchanges Against Glamorizing Investments, Emphasizes Advertising Compliance","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/thai-sec-warns-crypto-exchanges-against-glamorizing-investments-emphasizes-advertising-compliance.htm","publishDate":"2024-04-29T09:20:31","id":20614,"type":null,"title":"Thai SEC Warns Crypto Exchanges Against Glamorizing Investments, Emphasizes Advertising Compliance","category":["Altcoin News "],"content":["The Securities and Exchange Commission (SEC) of Thailand is taking measures to protect crypto investors from misleading advertisements. ","On April 29, the Thai SEC issued a warning to all operating crypto exchanges, urging them to refrain from glamorizing crypto investments and to comply with prescribed advertising standards, according to a report from Bangkok Post. ","Deputy Secretary-General Anek Yooyuen expressed the SEC’s concern about crypto exchanges offering special privileges to attract users. ","According to the report, crypto advertisements that contain false, exaggerated, distorted, concealing, or misleading information are in violation of Thailand’s regulations.","The move by the Thai SEC aligns with similar actions taken by regulators in other prominent crypto markets. ","For instance, the United Kingdom’s Financial Conduct Authority (FCA) issued 450 alerts for illegal crypto ads in 2023 alone. ","Additionally, in November 2023, Spain’s National Stock Market Commission (CNMV) called out fraudulent crypto asset promotions and emphasized the obligation of companies to comply with local laws.","The SEC reminded crypto exchanges to include appropriate warnings about investment risks in their advertisements and cautioned against onboarding new users through special promotions. ","Yooyuen highlighted that the SEC’s advertisement guidelines aim to protect investors from unwarranted risks, stating that enticing users with rewards without considering investment risks, especially in the case of cryptocurrencies, can be problematic. ","Violations of the guidelines will result in punishment according to the law.","Thai advertising guidelines require businesses and advertisers to substantiate the “facts” stated in their marketing campaigns, ensuring compliance with the laws of the country.","In a separate incident, hackers recently took over advertisements on Etherscan, a popular blockchain explorer, redirecting users to phishing sites designed to drain crypto wallets. ","Blockchain investigation firm Scam Sniffer attributed the large-scale phishing campaign to a lack of oversight from advertisement aggregators, stating that insufficient filtering on platforms like Coinzilla and Persona, from where Etherscan aggregates ads, could expose users to phishing attempts.","All the other phishing sites it's linked to pic.twitter.com\/4PjxnYn3ny","— McBiblets (@mcbiblets) April 7, 2024","","The wallet drainer scam involves tricking users into visiting fake websites and linking their crypto wallets, allowing scammers to withdraw funds into their own wallet addresses without user authentication or permission.","Last week, Google’s online advertising platform, Google Ads, also promoted malicious crypto websites, exposing users to a phishing scam. ","As reported, threat actors exploited Google Ads to advertise a fake version of Whales Market, an over-the-counter (OTC) crypto platform facilitating airdropped token trading. ","The compromised version of the website appears as a sponsored ad at the top of Google search results, drawing unsuspecting users into the trap.","Earlier this month, Google filed a lawsuit against two individuals from China, Yunfeng Sun and Hongnam Cheung, for utilizing the Google Play store to deceive people into fake crypto investments. ","Although the lawsuit did not disclose the specific names of the implicated applications, Google revealed that it had deactivated 87 fraudulent apps associated with Sun and Cheung over the past four years. "," "],"entity":[{"type":"United Kingdom’s Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Anek Yooyuen","content":"PERSON"},{"type":"Cheung","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Hongnam Cheung","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bangkok","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"Thailand","content":"LOCATION"},{"type":"Spain","content":"LOCATION"},{"type":"Persona","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"National Stock Market Commission","content":"ORGANIZATION"},{"type":"Coinzilla","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"April 7, 2024","content":"DATE"}],"hashtag":["Crypto Regulation","Thailand SEC"],"authors":["Ruholamin Haqshanas"]}