{"summary":"Terra Luna Classic Crypto Price Prediction – Will LUNC Recover to $0.0003?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-crypto-price-prediction-will-lunc-recover-to-3.htm","publishDate":"2022-09-16T11:53:00","id":20612,"type":null,"title":"Terra Luna Classic Crypto Price Prediction – Will LUNC Recover to $0.0003?","category":["Altcoin News "],"content":["Terra Luna Classic (LUNC) is ravenously batting through a bullish-reversal pattern known as a falling wedge. Over the last 24 hours the bulls are gathering momentum once again and buyers are starting to move in to slow down the fall. ","Will Terra Luna Classic repossess the $0.0003 price level? ","At the time of writing this article Terra Luna Classic (LUNC) is trading at $0.000265, according to CoinMarketCap, and now has a market capital of $1.63 billion. ","Trading volume has slipped away slightly on the Binance exchange as the anticipated 1.2% supply burning mechanisms were not deployed and FUD surrounding Do Kwon led to a further decrease in price – reducing investor appetite. ","Despite the bearish news, Terra Luna Classic is trading within a rather bullish looking pattern. ","As we can see LUNC is constantly getting rejected on the 20-day moving average, this type of recoil is preventing LUNC incepting in a new uptrend. ","Residing within the falling wedge was a descending triangle which we can see Terra Luna Classic (LUNC) has now successfully broken through.","The next hurdle is breaking through the resistance trendline of the falling wedge pattern at $0.000273. If this is achieved the next technical price target is $0.000335 which would result in a price increase of roughly 25.15% from current levels. ","If Terra Luna Classic loses price structure within the falling wedge pattern there is a chance we might lose the support at $0.000254 which would make revisiting $0.000236 likely. ","Some good news despite the recent fall in price is that a major centralized exchange known as MEXC is adopting additional burn on top of their current 1.2% burn.","https:\/\/www.twitter.com\/TerraclassicHQ\/status\/1570619876351553537?s=20&t=l3kpDr1rzkb_wqSYglVuYQ","Once more centralized exchanges also integrate the 1.2% burning mechanisms, we will see a greater amount of LUNC supply burnt. ","According to Terrarity 3,967,138,030 LUNC has been burned which is just 0.0574% of the total supply. ","If LUNC can break out of the falling wedge pattern we could see strong bullish momentum to the upside. Remember, September is notorious for being an extremely bearish month so seeing a downtrend here and rejections at resistance is typically normal. ","On the subject of fast growing cryptos, Tamadoge is a new exciting play-to-earn meme coin which is set to launch in Q4 2022 and could see exponential growth.","Update – LUNC has reclaimed the $0.0003 level. See our latest Terra Classic price prediction post.",""],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"Terra Luna Classic (LUNC)","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"$1.63 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"MEXC","content":"ORGANIZATION"},{"type":"$0.0003","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"25.15%","content":"PERCENT"},{"type":"0.0574%","content":"PERCENT"},{"type":"FUD","content":"ORGANIZATION"},{"type":"Terra Classic","content":"ORGANIZATION"},{"type":"$0.000335","content":"MONEY"},{"type":"$0.000236","content":"MONEY"},{"type":"LUNC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"$0.000265","content":"MONEY"},{"type":"$0.000254","content":"MONEY"},{"type":"Terrarity 3,967,138,030 LUNC","content":"ORGANIZATION"},{"type":"$0.000273","content":"MONEY"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["LUNC"],"authors":["Jacob Bury"]}