{"summary":"CFTC Committee Recommends Enhanced Understanding and Regulation of DeFi","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cftc-committee-recommends-enhanced-understanding-and-regulation-of-defi.htm","publishDate":"2024-01-09T16:15:14","id":20610,"type":null,"title":"CFTC Committee Recommends Enhanced Understanding and Regulation of DeFi","category":["DeFi News "],"content":["The Technology Advisory Committee of the US Commodity Futures Trading Commission (CFTC) has taken a significant step in addressing the challenges posed by decentralized finance (DeFi) by voting to submit a report urging the government and industry to prioritize understanding and regulating the sector.","The report, believed to be the first substantial analysis of DeFi by a government advisory committee, outlines key recommendations for policymakers.","And here’s the report itself.","I think page 21 (below) is perhaps the most important part: it’s the rubric for analyzing how things fall on the spectrum of decentralization. https:\/\/t.co\/5hcWLCduM7 https:\/\/t.co\/6nZIpjEQzN pic.twitter.com\/dBPEGdHJgQ","— Justin Slaughter (@JBSDC) January 8, 2024","","Among the suggestions is a call for increased knowledge about DeFi, emphasizing the need for a nuanced understanding of decentralized financial systems. The report also advocates for the enhancement of enforcement effectiveness to ensure timely regulatory responses.","In a statement published on the CFTC’s website, CFTC Commissioner Christy Goldsmith Romero said the report is a result of “hard work” to study DeFi and that it is intended to “inform ongoing policy debates in the U.S. Congress, state legislatures, and regulators including the CFTC.”","The recommendations include a call to assess existing federal and state regulatory frameworks related to DeFi and identify areas where regulations need to be expanded to address emerging risks.","The report represents a significant departure from traditional regulatory approaches, signaling a recognition of the unique challenges presented by decentralized financial systems.","Justin Slaughter, Policy Director at crypto firm Paradigm and a member of the CFTC Technology Advisory Committee, noted that the report is a groundbreaking effort in surveying both the opportunities and risks associated with DeFi.","In a post on social media platform X, Slaughter called it “arguably the most comprehensive review of DeFi by any U.S government agency thus far.”","He added that the report represents a “major step forward for policymaking on DeFi,” and said policymakers can consider it as a “first cut at a map as they navigate policymaking for DeFi.”","Following a thorough discussion, @CFTC’s TAC has adopted its report on DeFi nearly unanimously (14-1). This represents the first major report on DeFi by a government advisory committee and is arguably the most comprehensive review of DeFi by any U.S government agency thus far. https:\/\/t.co\/VMfFjEK3RY","— Justin Slaughter (@JBSDC) January 8, 2024","",""],"entity":[{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Technology Advisory Committee","content":"ORGANIZATION"},{"type":"CFTC Technology Advisory Committee","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"US Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Justin Slaughter","content":"PERSON"},{"type":"TAC","content":"ORGANIZATION"},{"type":"January 8, 2024","content":"DATE"}],"hashtag":["CFTC","DeFi"],"authors":["Fredrik Vold"]}