{"summary":"Binance Crypto Exchange Accused of Allowing U.S. Firms to Circumvent Derivatives Trading Ban – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-crypto-exchange-accused-of-allowing-us-firms-circumvent-derivatives-trading-ban-whats-going-on.htm","publishDate":"2023-03-31T10:00:00","id":20627,"type":null,"title":"Binance Crypto Exchange Accused of Allowing U.S. Firms to Circumvent Derivatives Trading Ban – What’s Going On?","category":["Blockchain News "],"content":["Binance has been accused by the Commodity Futures Trading Commission (CFTC) of allowing trading firms based in the US to trade crypto derivatives on Binance’s international exchange.","Allowing US-registered firms access to the derivatives platform constitutes an obvious circumvention of Binance’s own policy that no Americans are allowed to trade on Binance.com.","According to the CFTC, the US firms used offshore entities and various other methods to gain access to Binance.com. ","However, the regulator also argued that Binance knowingly allowed this to happen.","To serve US traders, Binance has set up Binance.US, which functions as a separate crypto exchange that – at least according to Binance – complies with US regulations.","The accusations from the CFTC came in the lawsuit against Binance filed on Monday this week.","In the seven days following the lawsuit, Binance saw net withdrawals of some $2.2 billion, which CZ in a tweet, described as “a bit of net outflow.”","Binance’s On-Chain Balance Stands at $64B, Nansen Data Shows.\n\nBlockchain is transparent.#Binance handles billions of both deposits and withdrawals daily. We saw a bit of net outflow yesterday, smaller than \"BUSD\" or \"FTX\" days. https:\/\/t.co\/KFU4twVPiR","In addition to accusing Binance of allowing US traders on its international platform, the CFTC also said in the lawsuit that Binance has given some of its largest VIP clients advantages in the form of faster trade execution.","In one instance, the CFTC alleged that Binance gave a New York-based trading firm with VIP status a 5 to 10-millisecond advantage over non-VIP clients. ","The firm was not named but was referred to as “Trading Firm B,” and was said to be one of Binance’s largest clients.","Commenting on the revelations to the Wall Street Journal on Thursday, Joe Saluzzi, a partner at stock brokerage Themis Trading, explained that this type of advantage can be used by the client to make more money at the expense of others.","“If I was one of their other clients, I’d be a bit upset,” he said.","Binance CEO Changpeng Zhao has not commented specifically on the allegations that US traders were allowed on Binance.com. ","However, he has called the lawsuit “unexpected and disappointing,” while adding that his firm has worked “cooperatively with the CFTC for over two years.”","“Upon an initial review, the complaint appears to contain an incomplete recitation of facts, and we do not agree with the characterization of many of the issues alleged in the complaint,” CZ wrote in a statement published on Binance’s website."],"entity":[{"type":"$2.2 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Monday this week","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$64B","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Joe Saluzzi","content":"PERSON"},{"type":"Nansen Data Shows","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","CFTC","Regulation"],"authors":["Fredrik Vold"]}