{"summary":"Binance to Reduce Stake in South Korean Digital Asset Exchange GOPAX","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-to-reduce-stake-in-south-korean-digital-asset-exchange-gopax.htm","publishDate":"2024-01-31T14:32:14","id":20628,"type":null,"title":"Binance to Reduce Stake in South Korean Digital Asset Exchange GOPAX","category":["Blockchain News "],"content":["Cryptocurrency exchange Binance is looking to reduce its majority stake in GOPAX, a digital asset exchange based in South Korea.","According to a new report from local media sources, Binance is considering selling some of its shares. The exchange will reveal its decision within a month or two citing reporting changes to the regulation of Virtual Asset Service Providers (VASPs) in South Korea.","“We will continue to reduce our stake in GOPAX to resolve the issue of reporting changes to virtual asset business operators (VASPs). Within a month or two, we will be able to announce specific details regarding the sale of shares.” ","The changing regulatory landscape could push the exchange to reduce its presence in the South Korean market. Such a sudden exit could come just a year after Binance set foot in South Korea for the second time with GOPAX, after an earlier exit two years ago.","In January 2023, Binance invested in GOPAX through its Industry Recovery Initiative which saw it become a majority shareholder in the company.","Through our Industry Recovery Initiative, #Binance has invested in South Korean Crypto Exchange GOPAX.","We will work closely with GOPAX and South Korean regulators to boost user protection standards in the country as well as improve user education through @BinanceAcademy.","— Binance (@binance) February 3, 2023","","Following the agreement, a change in the report on directors and other business structures was submitted to financial authorities in March, but approval has been delayed due to judicial risks.","Binance now plans to reduce or even sell all of its shares in the company by converting the money pumped into the company to cover GoFi payments as equity and selling its stake to solve the VaSP reporting problems.","Steve Young Kim, Binance Asia-Pacific region Director, stated that GOPAX’s huge debt will likely be solved through equity-to-equity conversion. In commenting on the reporting system, he added that Binance will reduce its stake in the future and will work with authorities on any aspects that can be resolved.","GOPAX encountered financial difficulties resulting in a halt of payments to users of its decentralized finance (DeFi) service, GoFi. Per the agreement, Binance would inject funds to cover all withdrawal requests, staked deposits, and interests.","Changpeng Zhao, Binance’s former CEO noted that the exchange is responsible for supporting promising companies through its Recovery Initiative. CZ added that the move to save the South Korean exchange will rebuild the industry in the country.","“Binance will also work closely with GOPAX to improve user education and blockchain awareness through Binance Academy, an open access blockchain and crypto learning portal that provides free educational resources to users.”","Recently, the exchange has faced regulatory hurdles that have prompted it to outrightly leave certain markets or announce partial exits by investing in local subsidiaries.","Last year, the company announced an exit from the Russian market following regulatory concerns and left the Japanese market in 2018 and 2021 for similar reasons before relaunching Binance Japan in 2023."],"entity":[{"type":"GOPAX","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Virtual Asset Service Providers","content":"ORGANIZATION"},{"type":"South Korean","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Binance Academy","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"VaSP","content":"ORGANIZATION"},{"type":"Pacific","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Binance Japan","content":"LOCATION"},{"type":"South Korean Crypto Exchange GOPAX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"February 3, 2023","content":"DATE"},{"type":"Steve Young Kim","content":"PERSON"},{"type":"Binance Asia","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"earlier exit two years ago","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Industry Recovery Initiative","content":"ORGANIZATION"}],"hashtag":["Binance","GOPAX","South Korea"],"authors":["David Pokima"]}