{"summary":"Hydropower Fuels Kyrgyzstan’s Crypto Mining Industry","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hydropower-fuels-kyrgyzstans-crypto-mining-industry.htm","publishDate":"2024-01-02T11:55:15","id":20626,"type":null,"title":"Hydropower Fuels Kyrgyzstan’s Crypto Mining Industry","category":["Blockchain News "],"content":["Kyrgyzstan’s water-rich environment has the potential to provide a necessary boost for the country’s crypto mining industry – but that power is currently difficult to access.","The Central-Asian country boasts beautiful nature and within it – importantly for miners – a large amount of water resources.","According to the country’s government,","“Kyrgyzstan is the only country in Central Asia whose water resources are almost completely formed on its own territory, and this is its hydrological feature and advantage. The republic has significant water and hydropower resources, and this is one of its main wealth.”","The country has more than 2,000 rivers longer than 10 km long. Furthermore, “a significant amount” of water is concentrated in lakes, small ponds, and reservoirs, covering 6,836 square kilometers. Additionally, there are 6,580 glaciers, with reserves of about 760 billion cubic meters.","However, the country still has to import electricity due to various restrictions and technical issues.","These resources may eventually be key to the growth of Kyrgyzstan’s crypto mining industry.","According to Energy Minister Taalaibek Ibraev, as published last month in local media, all mining farm owners also own small hydroelectric power stations.","The Minister stated that,","“The generated electricity is used, firstly, for our own needs, and secondly, on a contractual basis. The owner of a small hydroelectric power station knows with whom to enter into an agreement. The rest of the electricity is purchased by the state.”","That said, the country’s single mining farm buys electricity in Kazakhstan and pays Kyrgyzstan for transit.","There has been quite a change in the country’s mining ecosystem over the past year.","Despite supporters in political circles who called for the industry to be legalized, miners were heavily restricted by a state of emergency in the energy sector that began in August.","As of October 2023, only one crypto mining farm was operational.","That said, Kyrgyz President Sadyr Japarov approved the construction of a crypto mining farm in July. The government planned to spend up to $20 million to construct a facility at the Kambar-Ata-2 Hydro Power Plant. This is the way to use the excess power, the president said.","But running a crypto farm is also very expensive. Besides paying for transit, as well as all the energy-related costs, crypto mining is tariffed at the highest rate allowed in the country.","Asked whether the one farm standing should be closed as well, Energy Minister Taalaibek Ibraev said,","“The law allows the operation of mining farms. But they must import electricity. Additionally, they pay taxes for transit. Let it work. In total, they consumed 17 million 200 kilowatt-hours. Of these, we received 4.9 million soms [USD 55,000] for transit. Plus, there are also taxes and contributions to the Social Fund.”","Therefore, crypto farms are beneficial to the country’s budget.","A December report revealed that in November, budget revenue from the mining tax amounted to 7.64 million soms (USD 85,760).","Over the month, the figure increased by 414,000 some (USD 4,650).","“In just 11 months, this tax replenished the treasury by 78,639,200 some (USD 882,740).”","The highest figure seen since the beginning of 2023 was in August: 11.6 million (USD 130,210).","Notably, the payments began to grow in the second quarter of the year, the report said."],"entity":[{"type":"2 Hydro Power Plant","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kambar","content":"PERSON"},{"type":"Taalaibek Ibraev","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Ata","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"second quarter of the year","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Sadyr Japarov","content":"PERSON"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"7.64 million soms","content":"MONEY"},{"type":"Kyrgyzstan","content":"LOCATION"},{"type":"Central Asia","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["Cryptocurrency","Mining","Tax"],"authors":["Sead Fadilpašić"]}