{"summary":"New Solana Meme Coin SMOG Token Announces ETH Bridge After Major $37M Market Cap Launch – Markets Bullish on Airdrop Campaign","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-solana-meme-coin-smog-token-announces-eth-bridge-after-major-37m-market-cap-launch-markets-bullish-on-airdrop-campaign.htm","publishDate":"2024-02-09T16:31:38","id":20629,"type":null,"title":"New Solana Meme Coin SMOG Token Announces ETH Bridge After Major $37M Market Cap Launch – Markets Bullish on Airdrop Campaign","category":["Industry Talk "],"content":["Friday, February 9th, 2024 – Enter the Year of the Dragon in the latest major airdrop development on Solana, new meme coin Smog Token (SMOG) has announced it is shifting to become a multi-chain ecosystem using Wormhole, just 24 hours after a sensational skyrocket for SMOG price at launch.","Smog Token’s launch was received as a resounding success by crypto markets as we enter the Year of the Dragon, pushing up to a magnificent opening market cap of $37M in a move that fuelled a major +134% price pump.","This comes as news breaks that the SMOG airdrop campaign has already received over 10,000 completed airdrop tasks – amid a flood of volume and interest in the unfurling token adventure.","Now, leaping from success to success, the Smog development team hasn’t skipped a beat in announcing exciting multi-chain news as the Chinese New Year beckons.","The team revealed that Smog Token will be launching on Ethereum later today, via Wormhole using PortalBridge.com – a cross-chain platform with more than $1bn total value locked (TVL).","Multi-chain bridging will require the launch of a SMOG ETH LP to make it easier for new users to buy SMOG and feed the moonshot.","This will also bring in a new SMOG staking platform, which is rumored to be targeting a high fixed APY return of 42.0% to incentivize holding, with a principal 3-month lock-up period.","Both OTC and DEX-purchased SMOG ERC-20 tokens will be stakeable, staking reward will be unlocked, and principal tokens will be claimable once the unlock date is reached.","These staking lock periods have been designed to mitigate any sell-pressure and soften the likelihood of a negative impact on price action long-term.","With the liquidity pool and user bridge opening later today, alongside OTC purchases and locked staking periods, Smog Token is moving quickly to cement its status as the new big player on the block.","The SMOG price erupted in a jaw-dropping 134.44% increase over the past 24-hours, as trader sentiment shifted bullish on the launch of Solana’s newest innovation.","More than $1.2m in 24-hour trading volume sent SMOG surging from a launch price of just $0.001419, to hit a jaw-dropping market cap of $37.3M – in a vote of resounding confidence by investors.(Source)","Just a day away from the Year of the Dragon, SMOG has now hammered up to a market price of $0.06177 at the time of writing, leaving price action in a strong ascending trading channel.","The upside move has also left SMOG in a bullish pennant pattern, bolstered by lower support levels available in the event of a retracement at $0.044, $0.030, and $0.0225.","This suggests a positive outlook on the short timeframe, especially given the promising fundamental news surrounding Smog Token’s multi-chain bridge.","An ETH bridge could unlock the additional volume needed to fuel SMOG’s ascent to a $100M market cap.","To dig down into how Smog Token works, SMOG is intended to shake-up the Solana meme coin sector through a high-octane airdrop adventure campaign.","“No meme coin can survive the fiery flames of Smog,” is the unifying call. The innovative utility comes as SMOG tokens grant holders access to an expert crypto community dubbed ‘The Dragon’s Court’.","The aim of this hidden community is to unlock unstoppable virality, with the promise and excitement of interactive and sustained multi-airdrop campaigns that gamify the experience for the user.","This interactive adventure element involves a user buying and holding SMOG in order to generate and earn airdrop points, although the specific rewards and plans for the airdrop campaign still remain shrouded in mystery.","To add to the fun, SMOG holders will be able to qualify for their slice of a community bounty generated by the campaign, doubling-down the holding incentive for investors.","With major plans in the works, looking forward to the future of the project, an extensive roadmap can be found which features a number of exciting milestones ahead.","Following the announcement for the launch of a staking feature, it appears that progress is already well underway by the development team.","Rapid traction has been generated by anticipation around Smog’s upcoming airdrop plans, and there is also widespread speculation about the impact of a possible burn mechanism.Uniquely, the project also lists the milestone target of achieving 10,000+ so-called ‘Loyal Chosen’.","To join this elusive and mysterious group, holders have to be chosen and then pledge to the realm of Smog through a number of community initiation rituals – with the promise of supercharged airdrop rewards.","In order to participate in the SMOG airdrop campaign, traders will need to use a Solana-compatible wallet such as Phantom.","Then using SOL, USDT, or BONK tokens users can swap for SMOG via the Jupiter DEX aggregator or Birdeye.","To boost your chances of being selected for the Loyal Chosen and to increase your airdrop earnings, take on the challenge of completing the community task list on Zealy.","Join the Smog community on X (Twitter), Discord, and Telegram to stay tuned with the latest news and updates in the Year of the Dragon.Explore the Litepaper to find out more.","Buy SMOG Here",""],"entity":[{"type":"$0.0225","content":"MONEY"},{"type":"$1.2","content":"MONEY"},{"type":"$0.030","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"Ethereum later today","content":"DATE"},{"type":"$1bn","content":"MONEY"},{"type":"$37M","content":"MONEY"},{"type":"Jupiter DEX","content":"ORGANIZATION"},{"type":"Smog Token","content":"LOCATION"},{"type":"Dragon’s Court","content":"ORGANIZATION"},{"type":"$37.3","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"$0.044","content":"MONEY"},{"type":"February 9th, 2024","content":"DATE"},{"type":"+134%","content":"PERCENT"},{"type":"134.44%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$0.001419","content":"MONEY"},{"type":"$100M","content":"MONEY"},{"type":"Dragon","content":"ORGANIZATION"},{"type":"Loyal Chosen","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$0.06177","content":"MONEY"},{"type":"42.0%","content":"PERCENT"}],"hashtag":["SMOG","SMOG Price","SMOG Token"],"authors":["Sam Cooling"]}