{"summary":"Coinbase fell 8% by 11:15 a.m. EST, trading below $64.\nNeedham’s John Todaro attributed the drop to risk over lost staking revenue.\nSilvergate sank 5%. MicroStrategy and Block were also in the red. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210162\/coinbase-drops-8-as-ceo-armstrong-calls-out-sec-silvergate-sinks-5","publishDate":"2023-02-09T11:33:39","id":2062,"type":null,"title":"Coinbase drops 8% as CEO Armstrong calls out SEC; Silvergate sinks 5%","category":["Markets"],"content":["Crypto-related stocks sold off at the open, with Coinbase and Silvergate leading the drop.","Coinbase shares fell over 8% to $63 by 11:15 a.m. EST, according to Nasdaq data. Last night Coinbase CEO Brian Armstrong&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/209965\/coinbases-armstrong-says-staking-restrictions-would-be-terrible-path-for-the-u-s\" data-v-f87c67ca=\"\">said<\/a> it would be a \"terrible path\" for the U.S. if it were to restrict crypto staking.","Shares are trading down primarily as a result of Armstrong's comments, John Todaro of Needham told The Block. \"While staking is still a small portion of COIN's overall revenue today, it is an important piece to diversify revenue away from trading and is seen as a potentially high-growth vertical.\"","Two million ETH are currently staked on Coinbase, with close to 20 million ETH under custody. \"If Coinbase can convert a larger portion over to staking, it could start to become an important revenue driver,\" Todaro noted, adding that \"investors now have to start pricing in the possibility that this future revenue vertical gets removed if regulation comes down strict enough to shut the product down.\"","Crypto-friendly bank Silvergate was down, too, dropping 5.3% to $16.50. Jack Dorsey's Block shed just 3.7% as it traded below $79 for the first time since late January. MicroStrategy dipped about 4.2% to $264.","Argo Blockchain shed 12% today. CEO Peter Wall announced his resignation earlier in the day.&nbsp;"],"hashtag":["BINANCE","BITCOIN","BRIAN ARMSTRONG","COINBASE","EARNINGS","ECONOMIC INDICATORS","EQUITY MOVERS"]}