{"summary":"Shiba Inu Price Prediction As SHIB Falls 5% Today","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shiba-inu-price-prediction-as-shib-falls-5-today.htm","publishDate":"2022-10-13T22:30:00","id":20634,"type":null,"title":"Shiba Inu Price Prediction As SHIB Falls 5% Today","category":["Altcoin News "],"content":["Shiba Inu price is down 2.5% on Friday amid a general crypto market pullback. The second-largest meme coin is yet to stop bleeding as investors react to the United States Consumer Price Index (CPI) report. The CPI is the benchmark for inflation in the world’s biggest economy.","The CPI settled at 8.2% for September, surpassing market watchers’ expectations. Investors and consumers will continue feeling the pinch for the next few months, considering the Fed’s (Federal Reserve) intent to keep hiking interest rates to combat the soaring inflation.","Shiba Inu tapped out of an uptrend it had nurtured from crucial support established at $0.000007500 around $0.00001778. Before this rebound, SHIB dealt with a lengthy downtrend from its all-time high of $0.00009000.","The 3-day chart below shows how a bear flag pattern formed after Shiba Inu price momentum faded at $0.00001778. Trading below the 50-day SMA (Simple Moving Average) continuously beefed up the odds of a bearish outcome.","Now, Shiba Inu price is trading marginally below the bear flag pattern – a move likely to stretch its down leg to short-term support at $0.000008960 or further downhill to $0.000007000."," ","The DMI (Directional Movement Index) position hints at sellers keeping the reins. Overhead pressure will intensify if the -DI, red crosses above the +DI, blue.","On the other hand, the Stochastic oscillator, an indicator that shows whether an asset is overbought or oversold, holds at 30.00. Bulls have a chance to fight for control over the Shiba Inu price in the coming sessions if this index sustains an upward slope toward the midline."," ","IntoTheBlock’s IOMAP (In\/Out of the Money) paints a grim picture for SHIB. If bulls flip the tables and push for an immediate rebound, a solid supply region at $0.000011000 may prevent them from achieving their desired potential.","Approximately 20,000 addresses previously purchased 55.22 trillion SHIB tokens around that level. As Shiba Inu’s price climbs the ladder, investors in this area may choose to sell to breakeven, thus strengthening the bearish grip.","On the other hand, due to the absence of firm support areas, SHIB’s path with the least resistance will remain on the downside. Traders should consider $0.000008960 and $0.000007000 potential take profit positions.","The technology behemoth Google is now accepting payment for its services in Shiba Inu and nine other cryptocurrencies after partnering with Coinbase. Dogecoin (DOGE) is another meme coin that made it to the list alongside major cryptos like Bitcoin (BTC) and Ethereum (ETH).","Google announced a partnership with Coinbase to let Google Cloud customers pay for cryptocurrencies including $SHIB 🚀\n\nSmash the LIKE ❤️ RT♻️ Let's Go!\n\n⚡️ Grab these Gems💎 $TREES 🌳 $BONE 🦴 $LEASH 🦮 #shibainucoin #ShibaArmy #SAFETREES @Trees_tokenhttps:\/\/t.co\/DSeYa1Utvv","Coinbase Commerce, a platform tailor-made for enterprise payments in digital assets, is at the forefront of this development. Google plans to expand the scope to include Coinbase Prime – a platform mainly used by large corporations.","“We want to make building in Web3 faster and easier, and this partnership with Coinbase helps developers get one step closer to that goal,” says Thomas Kurian, Google’s CEO.","Tamadoge (TAMA), the meme coin giving Shiba Inu and Dogecoin a run for their money, is set to close the gap to $1.00 following a successful listing in September. TAMA’s price is up 15% even as Shiba Inu and the majority of cryptocurrencies in the market struggled on Thursday. Despite the intraday spike to $0.0408, Tamadoge price has fallen 78.9% from its all-time high of $0.1944 – on October 4, 2022, opening the doors to dip-buying opportunities.","TAMA’s success stems from 28,000 holders at its peak. According to Etherscan stats, the number has dropped slightly to about 26,000 holders. A careful analysis of this decline finds that some holders liquidated part of their stake in the token but will likely keep HODLing.","Tamadoge stands out among its peers for its revolutionary technology in P2E (play-earn games) and NFT. The project is significantly smaller than Shiba Inu, with a maximum supply of 2 billion tokens. With a 5% burn program linked to its P2E game, TAMA is set for massive growth in the near future.\n\nBuy TAMA on OKX CEX","Buy TAMA on OKX DEX","Read more: ","Shiba Inu Price Prediction – Can SHIB Overtake Bitcoin?","Shiba Inu Price Prediction – Is SHIB About to Pump This Week?"],"entity":[{"type":"Coinbase Commerce","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"$0.0408","content":"MONEY"},{"type":"Thomas Kurian","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"TAMA)","content":"PERSON"},{"type":"2 billion","content":"MONEY"},{"type":"October 4, 2022","content":"DATE"},{"type":"Shiba Inu Price Prediction","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$0.000011000","content":"MONEY"},{"type":"Fed’s (Federal Reserve","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"$1.00","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$0.000007000","content":"MONEY"},{"type":"DMI","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$0.000007500","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$0.1944","content":"MONEY"},{"type":"8.2%","content":"PERCENT"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Shiba Inu Price Prediction –","content":"ORGANIZATION"},{"type":"$0.00001778","content":"MONEY"},{"type":"$0.00009000","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$SHIB","content":"MONEY"},{"type":"$TREES 🌳 $BONE 🦴 $LEASH","content":"MONEY"},{"type":"$0.000008960","content":"MONEY"},{"type":"78.9%","content":"PERCENT"}],"hashtag":["Shiba inu","TAMADOGE"],"authors":["John Isige"]}