{"summary":"El Salvador, Paraguay Bitcoin Adoption News Galvanizes Crypto World","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/el-salvador-paraguay-bitcoin-adoption-news-galvanizes-crypto-10588.htm","publishDate":"2021-06-07T09:17:00","id":20636,"type":null,"title":"El Salvador, Paraguay Bitcoin Adoption News Galvanizes Crypto World","category":["Bitcoin News "],"content":["Crypto’s center of gravity could take a dramatic shift – after a series of developments spearheaded by politicians in Latin America suggested that the region could be ready to open up to crypto-powered finance.","Nayib Bukele has updated his Twitter profile picture with this edited photograph. Source: Twitter\/@nayibbukele","The ball began to roll when the president of El Salvador, Nayib Bukele, unveiled plans to give bitcoin (BTC) the status of legal tender. Per the local media outlet ElSalvador.com, Bukele is set to ask parliament to approve his plans, which he has formed with the wallet provider and BTC payments company Strike.","According to CNBC, the El Salvador leader made the announcement at the Miami-based Bitcoin 2021 conference over the weekend, where he explained that a new bill would be put before lawmakers this week.","He stated:","“Next week, I will send Congress a bill that will make bitcoin a legal tender.”","Jack Mallers, the firm’s founder, called the move a “shot heard around the world for Bitcoin,” and revealed that he had been working behind the scenes with the government in El Salvador to prepare the new bill.","","Welcome to the future 🇸🇻 #Bitcoin pic.twitter.com\/j30vcZVXvJ","In a statement shared with Cryptonews.com, Strike claimed that its mobile payments app had launched in El Salvador in March and “quickly became the number one downloaded app in the country.”","The firm added that it “expects to enter several more markets in coming months, and concluded,","“Once governments see the benefits of Bitcoin technologies like Strike on financial efficiency and inclusion, it becomes obvious that they will seek to follow in the footsteps of El Salvador.”","El Salvador’s official currency is the USD, but recognizing BTC as official tender, the President stated, would allow Salvadorans living abroad to send tokens into the country.","Remittances account for 23% percent of El Salvador’s gross domestic product and benefit about 360,000 households, per AP data. The money sent home to El Salvador by migrants hit a record high of USD 5.92bn in 2020.","Bukele added that the move would likely boost investment and “in the short term,” would “generate jobs and help provide financial inclusion to thousands outside the formal economy.”","Meanwhile, in Paraguay, there are also signs something crypto-flavored may be afoot.","The MP Carlos “Carlitos” Rejala took to Twitter to post a bullish-looking, PayPal-related and BTC-themed announcement, writing:","“I’ve been saying this for a long time: Our country needs to move hand in hand with the new generation. The moment has come, our moment. This week we will start on an important project that will help innovate Paraguay for the whole world to see.”","He concluded by writing, in English, “to the moon!” and included a rocket emoji, as well as the BTC and PayPal hashtags. The politician also edited his profile picture to add red laser eyes, which is a popular thing about bitcoiners.","The tweet has piqued the interest of crypto observers online, even if Rejala carries a little less political clout than Bukele.","Rejala is one of two MPs in the House of Deputies – the Paraguayan lower chamber – for the opposition Hagamos Party. The house is dominated by the ruling Colorado Party, which has 42 of the 80 seats available. Hagamos does have a louder voice in the Senate, however, where it has two of 45 seats.","Back in El Salvador, interest in BTC has surged since the news broke, per Google Trends data.","But it appears many in the nation are not 100% sure what their President is planning to do.","ElSalvador.com quoted the economist Tatiana Marroquín, as stating that “it is not clear” what the Bukele’s intention was in legalizing BTC, noting that “it is already used in the country, there are people who own cryptocurrencies and it is not illegal to do so.” Marroquín suggested the move could have been part of a strategy that might, theoretically, allow the state to legally own BTC.","The same media outlet quoted the economist Claudio de Rosa as stating that he was “unsure” as to why the step was being taken, and cited “money laundering” risks identified by international bodies.","In an opinion column in the same publication, another economist, Manuel Hinds, El Salvador’s former finance minister, and a former World Bank affiliate, wrote that money laundering-related risk had to be met if the plan were to succeed:","“There is no reason to panic if the government wants to facilitate [BTC] transactions while taking great care not to open the door for money laundering. But we will have to be careful to ensure that the law actually meets these requirements.”","And the newspaper also dedicated its daily cartoon to BTC, featuring two men scouring a garbage tip, with one stating to the other: “They want to legalize bitcoin as legal tender.” The other replied: “Wow! So how many bitcoins will I get for this bag of plastic bottles?”","Regardless, the news appears to have galvanized the crypto community.","After Tron (TRX)’s Justin Sun noted that crypto pioneers would “start to move to El Salvador,” Bukele who has been on a crypto-themed Twitter charm offensive since the announcement, explained that the country had “great weather, world-class surfing beaches and beachfront properties for sale.”","He also noted that it was “one of the few countries in the world with no property tax” and “no capital gains tax for BTC since it will be a legal currency.” And in another direct appeal to the sector, he pledged “immediate permanent residence” status for “crypto entrepreneurs.”","Bukele also claimed in response to questions about “moving parts” like “citizenship and residency” that “we’ll help with this” – and even changed his own profile picture to feature laser eyes.","He was joined by the President of the Legislative Assembly Ernesto Castro.","The founder of the crypto exchange Binance, Changepeng “CZ” Zhao called the President’s offer “enticing.”","Meanwhile, the prominent crypto investor Anthony Pompliano wrote:","“El Salvador will likely be a catalyst for other countries.”","Hunter Horsley, CEO of Bitwise, dubbed the Salvadorian leader “Bitcoin’s newest spokesperson” in response to an earlier pro-BTC tweet.","The entrepreneur Brandon Quittem remarked that El Salvador had “opened with a strong offer,” and asked: “Who’s going to counter?”","Tron boss Sun did not seem to be in the mood to sit around and wait for that counter-offer to arrive. He wrote:","“El Salvador is [a] crypto nation now! Tron will become the first crypto organization to establish an office in El Salvador.”","The nations could be set to take a leaf out of the book of Venezuela, which has launched its own cryptoasset and amassed a large stash of tokens like BTC and ethereum (ETH) from what appears to be clandestine trade deals. Its military has begun mining tokens.","The government of Cuba has also been speaking about the possibility of launching crypto-powered economic activities.\n_____","","Japan recognized Bitcoin as legal tender in 2017, why would this result in changes when Japans decision did not?","","El Salvador and Panama both use the USD due to remittances (large population abroad) and currency risk.\n\nThe more successful $BTC is, the more emerging markets will look to it as a reference currency.","","#ElSalvador sending out an open invitation to #Bitcoiners to move there and help open the door to a #bitcoin world will certainly expose the virtue signallers from the last several years. They wanted it, now they have it.","https:\/\/www.twitter.com\/Mike_OntheLam\/status\/1401757701433184261","","feels like this happens way sooner than most expect","","Five U.S. territories and seven sovereign nations use the U.S. dollar as their official currency. https:\/\/t.co\/i1ifbQqIWH","","In the run long, people and money vote with feet.\n\nSad to see that sound and common-sense policy making is not the norm. But now at least the wheel is starting to roll. https:\/\/t.co\/XZQN3HiIB6","","Politicians start supporting Bitcoin when they realize it 10X’s their Twitter engagement.","","lol wtf bitcoin folks are now embracing a right-wing autocrat? I’m both surprised and entirely not at the same time","","https:\/\/t.co\/d2gQogPgFF","","3\/ same way for countries as it did for industries like the cannabis industry. Hence, we would expect the US and China to be the last laggards in #Bitcoin adoption. Conversely, the smallest, most dollarised and poorest countries like El Salvador will be the earliest of adopters.","_____","Learn more: \n– Bitcoin Is More ‘Public’ Money than Central Bank-Issued Fiat Currencies\n– Prepare For ‘Uncertain Future of Money’ – US Intelligence Center","– Bitcoin Faces Hedge Test Amid Rising Inflation Concerns\n– Institutions & Retail Compete For Bitcoin – Whose Hands Are Stronger?","– Post-COVID-19, Bitcoin & Co May Help UK Escape from Economic Funk\n– A Debt-Fuelled Economic Crisis & Bitcoin: What to Expect?","– Not Only Bitcoin Price Is Changing During This Bull Run\n– Bitcoin Mass Adoption Would Benefit and Harm Current Economy"],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ernesto Castro","content":"PERSON"},{"type":"Manuel Hinds","content":"PERSON"},{"type":"Panama","content":"LOCATION"},{"type":"House of Deputies","content":"ORGANIZATION"},{"type":"‘Uncertain Future of Money’ – US Intelligence Center","content":"ORGANIZATION"},{"type":"World Bank","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"Cuba","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Fuelled Economic Crisis & Bitcoin","content":"ORGANIZATION"},{"type":"Latin America","content":"LOCATION"},{"type":"Tatiana Marroquín","content":"PERSON"},{"type":"Claudio de Rosa","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Paraguay","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Bukele","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Bitcoin & Co May Help UK Escape","content":"ORGANIZATION"},{"type":"Hunter Horsley","content":"PERSON"},{"type":"Bitcoin Faces Hedge Test Amid Rising Inflation Concerns\n– Institutions & Retail Compete For Bitcoin – Whose Hands","content":"ORGANIZATION"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"Brandon Quittem","content":"PERSON"},{"type":"last several years","content":"DATE"},{"type":"Google Trends","content":"ORGANIZATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"Hagamos Party","content":"ORGANIZATION"},{"type":"Justin Sun","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"23% percent","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"Jack Mallers","content":"PERSON"},{"type":"Colorado Party","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Japans","content":"LOCATION"},{"type":"Bitcoin Mass Adoption Would Benefit","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["Adoption","Anthony Pompliano","Binance","Bitcoin","El Salvador","Justin Sun","Latin America","Regulation","Tron"],"authors":["Tim Alper"]}