{"summary":"Bithumb Plans IPO In Korea, Eyes Top Spot in Local Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bithumb-plans-ipo-in-korea-eyes-top-spot-in-local-market.htm","publishDate":"2023-11-13T08:49:46","id":20633,"type":null,"title":"Bithumb Plans IPO In Korea, Eyes Top Spot in Local Market","category":["Blockchain News "],"content":["Cryptocurrency exchange, Bithumb is keen on becoming the first industry-related company to get listed on the Korean Securities Dealers Automated Quotations (KOSDAQ).","According to reports from local news outlet Edaily, the exchange has made concrete plans including hiring staff and onboarding traditional firms to facilitate the public listing in the market.","Sources familiar with developments say the company targets 2025 as the expected year of the listing with expectations to become the biggest digital asset exchange in the country by trading volume setting the stage for wider markets.","In line with the vision, the largest shareholder and its former Chairman Lee Jeong-hoon who established Bithumb Holdings has returned to the board of directors to offer a sense of deepened confidence to the management team.","Although the company declined to confirm the reported plans of the planned public listing, it affirmed the appointment of an underwriter. “It is true that we have selected an underwriter.” ","Last month, the company picked Samsung Securities as the underwriter to facilitate the initial public offering by vetting the financial security of the company alongside other responsibilities.","The company seeks to improve public trust in the crypto market in the wake of recent hacks in industry collapses this year totaling millions of dollars. Opening up its operations to external validators is a way to calm skeptics as it plans to take over the market share of competitors in the coming months.","Observers believe the news for an IPO is not hinged on external financial requirements as the company holds assets of more than 400 billion won a huge transaction data and substantial revenues.","As plans ramp up for the listing on KOSDAQ, Jeong-hoon’s appointment on the board is expected to bring a slight shake-up for the firm. The CEO of Bithumb Holdings will be Jaewon Lee who also doubles as Chief Executive of Bithumb Korea.","The virtual asset exchange plans to become the top-rated exchange in Korea, a position held by Upbit with a huge chunk of the market cap using a public listing as leverage to wider exposure and finance.","A public listing would open the company to more institutional investors and such backing would lead to increased confidence of retail investors and new adopters who might be scared of the risks involved in crypto trading.","This projection can be seen with the listing of Coinbase back in 2021 which initially recorded a boost in assets, finance, and users before plummeting due to the wider market downturn and industry collapses.","Upbit enjoys a wide acceptance in South Korea with its trading volumes temporarily going over Binance and Coinbase in July notching huge growth in the Asian markets."],"entity":[{"type":"2025","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"Bithumb Holdings","content":"ORGANIZATION"},{"type":"Jeong","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Jaewon Lee","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Bithumb","content":"PERSON"},{"type":"Lee Jeong","content":"PERSON"},{"type":"Bithumb Korea","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Samsung Securities","content":"ORGANIZATION"},{"type":"400 billion","content":"MONEY"}],"hashtag":["Bithumb","CRYPTO","IPO"],"authors":["David Pokima"]}