{"summary":"Michael Saylor Says There’s a Decade of Pent up Demand for Bitcoin ETFs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/michael-saylor-says-theres-a-decade-of-pent-up-demand-for-bitcoin-etfs.htm","publishDate":"2024-02-13T10:41:28","id":20646,"type":null,"title":"Michael Saylor Says There’s a Decade of Pent up Demand for Bitcoin ETFs","category":["Bitcoin News "],"content":["MicroStrategy executive chairman and co-founder Michael Saylor, said there is over a decade of pent-up demand for Bitcoin exchange-traded funds, in an interview with CNBC.","“There’s 10 years of pent-up demand people been waiting for these ETFs and finally, mainstream investors are able to access Bitcoin and I think that’s what’s driving the surge of capital in the asset class,” said Saylor.","#Bitcoin is the world’s most popular investment asset. It is novel, digital, global, unique, and uncorrelated to traditional risk assets. That makes it a natural addition to the portfolio of a responsible investor. pic.twitter.com\/ZOEVkKDh0T","— Michael Saylor⚡️ (@saylor) February 12, 2024","","The MicroStrategy chairman discussed the state of the crypto industry, the rollout of bitcoin ETFs, bitcoin’s climbing valuation, and future plans.","In the interview, Saylor also explained that MicroStrategy will be rebranding as a Bitcoin development company. He explained, that the rebrand was a natural decision due to the company’s success in its Bitcoin strategy and unique status as the world’s largest publicly traded holder of Bitcoin.","Saylor highlighted plans to develop software, generate cash flow, and leverage the capital markets to accumulate more Bitcoin for shareholders and promote the growth of the Bitcoin network.","Saylor also addressed the company’s transition from on-premises to cloud and artificial intelligence (AI) which will allow the company to continue growing the business.","“Bitcoin is the world’s most popular investment asset. It is novel, digital, global, unique, and uncorrelated to traditional risk assets. That makes it a natural addition to the portfolio of a responsible investor,” said Saylor.","On Tuesday, Bitcoin’s price prediction buzz intensified as it surged past the $50,150 mark, posting a significant 4% increase. This milestone, a peak not witnessed in over two years, signals renewed investor confidence catalyzed by recent regulatory advancements and anticipation of further interest rate reductions, reports Arslan Butt from Cryptonews.","Earlier this month, MicroStrategy announced it had purchased 31,755 Bitcoin at a cost of $1.25 billion in Q4 2023, increasing the company’s total Bitcoin holdings to 190,000 units.","MicroStrategy’s Fourth Quarter 2023 Financial Results report detailed the extensive acquisition and demonstrated the company’s consistent emphasis on Bitcoin as a key asset within its portfolio. By the end of 2023, MicroStrategy’s investment in Bitcoin reached an aggregate purchase price of $5.93 billion, averaging $31,224 per Bitcoin.","“We acquired 31,755 additional bitcoins since the end of the third quarter, marking the largest quarterly bitcoin holdings increase in the last 3 years and the 13th consecutive quarter of adding more bitcoin on our balance sheet,” said Chief Financial Officer Andrew Kang.","Kang suggested that MicroStrategy had capitalized on the rise in Bitcoin prices during Q4, utilizing its capital market activities and available cash reserves to increase its Bitcoin investments. According to Saylor, an additional 850 Bitcoin was acquired for $37.2 million in January 2024."],"entity":[{"type":"$1.25 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Andrew Kang","content":"PERSON"},{"type":"MicroStrategy’s Fourth Quarter 2023 Financial Results","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"February 12, 2024","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"$50,150","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$31,224","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"$5.93 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"13th consecutive quarter","content":"DATE"},{"type":"$37.2 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"},{"type":"last 3 years","content":"DATE"}],"hashtag":["Bitcoin ETFs","Michael Saylor","MicroStrategy"],"authors":["Tanzeel Akhtar"]}