{"summary":"Dencun Goes Live On Gnosis, Ethereum Next In Line","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dencun-goes-live-on-gnosis-ethereum-next-in-line.htm","publishDate":"2024-03-12T18:59:10","id":20645,"type":null,"title":"Dencun Goes Live On Gnosis, Ethereum Next In Line","category":["News "],"content":["The Dencun hard fork went live on the Ethereum-compatible Gnosis Chain on March 11, readying the stage for its imminent implementation on Ethereum.","Gnosis developers said the update was smooth and without any technical hitches. ","The Dencun upgrade is expected to go live on Ethereum this week. Since it is a hard fork, all validator nodes will need to update their software before this enhancement. ","Dencun will introduce several critical changes to Ethereum. One of them is the introduction of “Blobs,” a technology that can be explained as data storage channels. ","“Blobs” are designed to enhance the efficiency of data storage and retrieval, optimizing layer-2 scaling and performance on Ethereum. ","Smooth Dencun hard-fork! Blobs landed in Gnosis chain 🐡👌","Ethereum mainnet is next in 43 hours pic.twitter.com\/OKpRR7pCKK","— Lion ⟠ dapplion .eth (@dapplion) March 11, 2024","","As a result, once Dencun goes live, layer-2 platforms like Base, Arbitrum, and others will process transactions cheaply. This is a welcomed change for users currently enjoying low fees on these solutions.","Gnosis Chain is compatible with Ethereum and is built on the proof-of-stake “Beacon” chain. Additionally, its execution layer mirrors that of Ethereum. ","Since the architecture is identical to Ethereum, Gnosis is compatible with layer-2 solutions. As such, any technology stacks designed for Ethereum rollups will work on Gnosis without developers having to make changes.","As expected on Ethereum, the Dencun hard fork on Gnosis will further slash gas fees. Presently, gas fees, paid in xDAI, are consistently below $0.01. With the Dencun hard fork, this fee will decrease further, making transactions even more cost-effective for users and deploying protocols.","Developers say lower fees will benefit applications on the platform, including Gnosis Pay. With Dencun, Gnosis Pay can work from layer-2 solutions, allowing the platform to comply with existing regulations, including data protection laws.  ","Gnosis DAO is currently working on Gnosis 3.0. In this stage, the DAO plans to create a group of interlinked projects connected by the platform’s native token, GNO. Under Gnosis 3.0, the objective is to shape payment and financial infrastructure."],"entity":[{"type":"$0.01","content":"MONEY"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Gnosis","content":"PERSON"},{"type":"Gnosis","content":"LOCATION"},{"type":"March 11, 2024","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Dencun","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"March 11","content":"DATE"}],"hashtag":["Dencun","Ethereum","Gnosis"],"authors":["Dalmas Ngetich"]}