{"summary":"Coinbase’s Legal Woes Deepen As Customers File Lawsuit Over Alleged Deception","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-lawsuit-customers-file-class-action-alleged-deception-securities.htm","publishDate":"2024-05-06T04:48:56","id":20648,"type":null,"title":"Coinbase’s Legal Woes Deepen As Customers File Lawsuit Over Alleged Deception","category":["News "],"content":["Coinbase faces a new legal battle as customers filed a class-action lawsuit on Friday. The suit accuses two of the exchange’s subsidiaries — Coinbase Global and Coinbase Asset Management — of repeatedly breaking securities laws since Coinbase began operating.","The lawsuit points out certain contradictions in Coinbase’s user agreement. While identifying some crypto assets as securities, Coinbase never registered them for sale, it alleges.","Additionally, the lawsuit claims that Coinbase admits to acting as a “securities broker” and “securities intermediary.”","It also specifically identifies several digital assets listed on Coinbase as “digital asset securities.” These include Algorand (ALGO), Decentraland (MANA), Polygon (MATIC), Near Protocol (NEAR), Uniswap (UNI), and Solana (SOL).","“Coinbase recognized early on the significant impact classifying digital assets as securities would have on the operation of the Coinbase Digital Asset Platforms,” the lawsuit states. “And for this reason chose, or was willfully blind, to not register the securities, persons, or broker-dealers as required by state law.”","The exchange’s failure to disclose key information is alleged to have amplified deceptive marketing tactics. These tactics, the lawsuit claims, were designed to pressure customers into buying digital asset securities on Coinbase.","A Coinbase spokesperson told Cryptonews that “the claims in this litigation are legally baseless.”","“We have full faith in the judicial process and look forward to addressing them in full at the appropriate time,” they added.","Coinbase is already embroiled in a separate lawsuit with the SEC, which accuses the exchange of violating securities laws. The regulator specifically charged Coinbase with offering and selling unregistered securities through its staking program. Notably, the SEC did not target any Coinbase executives in its lawsuit.","Coinbase maintains that secondary sales of crypto assets don’t qualify as securities. The exchange has appealed a judge’s recent decision allowing the SEC lawsuit to proceed."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Coinbase Asset Management","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Coinbase Digital Asset Platforms","content":"ORGANIZATION"}],"hashtag":["Coinbase","Lawsuit"],"authors":["Shalini Nagarajan"]}