{"summary":"Nigerian SEC Set To Meet With Foreign Crypto Exchanges Amid Regulatory Crackdown: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nigerian-sec-to-meet-with-crypto-exchanges-amid-binance-execuitives-arrest-crypto-regulation-crackdown.htm","publishDate":"2024-05-03T17:10:22","id":20644,"type":null,"title":"Nigerian SEC Set To Meet With Foreign Crypto Exchanges Amid Regulatory Crackdown: Report","category":["News "],"content":["A Friday report from CoinTelegraph revealed that the Nigerian Securities and Exchange Commission (SEC) will meet with crypto exchanges to discuss the state of crypto regulation in the African nation. The country has also recently detained two Binance executives charged with money laundering and tax evasion.","According to CoinTelegraph’s interview with Lucky Uwakwe, Chair of Nigeria’s Blockchain Industry Coordinating Committee (BICCoN), the upcoming meeting between the Nigerian SEC and crypto exchanges will primarily focus on addressing regulatory concerns within the country’s cryptocurrency sector.","Spearheaded by Emomotimi Agama, the newly appointed Nigerian SEC Director General, the meeting will take place on May 6 and is open to key players in Nigeria’s crypto industry, including virtual asset service providers (VASPS), wallet providers, and crypto exchange platforms.","NIGERIAN SEC TO MEET WITH FOREIGN EXCHANGES AMID ONGOING REGULATORY BATTLE","– Emomotimi Agama, the new Director General of the Nigerian SEC, will meet with both local and foreign crypto CEXs at a roundtable event on May 6th.","– The event is being organized by The Blockchain… https:\/\/t.co\/weRyfXPUje pic.twitter.com\/K5xOoDqSeq","— BSCN (@BSCNews) May 3, 2024","","“Everyone’s presence and insights are invaluable as we collectively navigate the regulatory terrain and strive toward fostering an environment conducive to innovation and growth within the blockchain and cryptocurrency sector,” Uwakwe told CoinTelegraph.","News of the meeting comes during troubling economic times for the country, with some blame being pinned on cryptocurrencies.","In February, Nigeria’s government reportedly banned its citizens’ access to several crypto exchanges, effectively accusing Binance of fixing the rate of the country’s currency, naira.","Nigerian Central Bank Governor Olayemi Cardoso accused Binance of shuffling an estimated $26 billion worth of illicit funds through its Nigerian branch last year.","''in the case of Binance, In the last one year, 26 billion dollars has passed through Binance Nigeria from sources and users who we cannot adequately identify.''","CBN Governor, Olayemi Cardoso pic.twitter.com\/A6O2wlsY5M","— Channels Television (@channelstv) February 27, 2024","","“We are concerned that certain practices that go on that indicate illicit flows through a number of these entities and suspicious flows at best,” Cardoso said. “In the case of Binance, $26 billion has passed through Binance Nigeria from sources and users we cannot adequately identify.”","That same month, the country detained two Binance executives, Nadeem Anjarwalla and Tigran Gambaryan, before charging them with money laundering and tax evasion.","Anjarwalla was arrested just over a week ago, nearly 3,000 miles away in Kenya, after fleeing shortly after his arrest.","By March, the country had demanded $10 billion in compensation from the crypto exchange, with Binance discontinuing all services in the African nation.","Just last month, its inflation rate soared to a near 30-year record of 33% as the government shifted its blame toward cryptocurrencies as the cause of the crash.","Meanwhile, a Nigerian court pushed back Anjarwalla and Gambaryan’s money laundering trial to May 17 after a lawyer for Binance claimed he was never given necessary proof-of-evidence documents needed for his defense.","While questions surrounding the legitimacy of the arrest remain ongoing, the country’s stringent crackdown on crypto may spell doom for the two Binance executives. ","Next week’s meeting between the Nigerian SEC and crypto stakeholders may offer insights into the future direction of the country’s cryptocurrency policies."],"entity":[{"type":"Olayemi Cardoso","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"CoinTelegraph","content":"ORGANIZATION"},{"type":"Binance Nigeria","content":"ORGANIZATION"},{"type":"Binance Nigeria","content":"LOCATION"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"Blockchain Industry Coordinating Committee","content":"ORGANIZATION"},{"type":"May 3, 2024","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Emomotimi Agama","content":"ORGANIZATION"},{"type":"Kenya","content":"LOCATION"},{"type":"May 17","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"$26 billion","content":"MONEY"},{"type":"February 27, 2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"33%","content":"PERCENT"},{"type":"$10 billion","content":"MONEY"},{"type":"26 billion dollars","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Nigerian Central Bank Governor Olayemi Cardoso","content":"ORGANIZATION"},{"type":"Nigerian SEC","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"May 6th","content":"DATE"},{"type":"Nigerian Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Nigerian SEC Director General","content":"ORGANIZATION"},{"type":"Cardoso","content":"PERSON"}],"hashtag":["Binance Executive","Crypto Regulation","Nigeria"],"authors":["Julia Smith"]}