{"summary":"Dogecoin is Heading to Zero, According to Industry Panel","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dogecoin-is-heading-to-zero-according-to-industry-panel.htm","publishDate":"2022-07-29T17:00:00","id":20657,"type":null,"title":"Dogecoin is Heading to Zero, According to Industry Panel","category":["Altcoin News "],"content":[" ","The price of dogecoin (DOGE) is likely to head towards zero and never bounce back, predicted the majority of members in a crypto industry panel surveyed by comparison website Finder.com.","According to the survey, the majority of the panelists find that DOGE will lose all value at some point in the future.","“We’re a little ways removed from the days when people thought DOGE was going to the moon,” said the report. “People are now more worried about it staying here on Earth (read: going to zero), something that over half the panel (55%) say will happen at some point in future.”","Meanwhile, 24% said they believe it will happen by 2024 or earlier, while 3% of the panelists even predicted that DOGE will have gone to zero by the end of this year.","The survey results are perhaps characteristic for DOGE, which is considered the most popular and original so-called meme coin. Meme coins are notoriously difficult to analyze and are mainly driven by hype trader sentiment.","“The birth of Dogecoin was originally a joke,” commented Kevin He, chief operating officer at fintech firm CloudTech Group., and added: ","“We believe that cryptocurrencies like Dogecoin, which are completely useless and the value is purely supported by the community, will not gain value in the future.” ","Looking at the average of the panelists’ specific price predictions, however, the coin, which is currently ranked 10th by market capitalization, could still stay afloat and even rise in price over the next few years.","By the end of the year, the average response indicated a DOGE price of USD 0.08, while USD 0.19 and USD 0.64 are seen as likely price targets for the end of 2025 and 2030, respectively.","Gavin Smith, general partner of crypto hedge fund Panxora, explained the coin’s persistent popularity by saying that,","“While DOGE was launched as a joke coin it has subsequently developed a large and loyal community. Detractors of the token forget that community is at least as important as uniqueness in the crypto space.” ","Others, such as non-fungible token (NFT) project MetaTope co-founder Walker Holmes, also pointed to the strong community around the coin.","“This is with the foresight of Elon [Musk] sticking with the project, Doge has a great community but little utility. Doge has the ability to attract a culture of content creators and creatives,” he said.","Finder.com’s latest price prediction for dogecoin is markedly more bearish on the short-term than an earlier prediction from January, when the panel said the coin is likely to reach USD 0.16 by the end of this year and USD 0.32 by the end of 2025. ","For the end of 2030, however, the panel was more bearish back then, predicting a price of USD 0.54.","The majority of the panel – or 71% – said they think it’s time to get out of DOGE and sell. 24% said investors should hold onto what they have, while only 4% said it’s time to buy.","At 12:52 UTC on Friday, DOGE traded at USD 0.0677, up 2.1% for the day and down 3.2% for the week. It’s also up nearly 3% in a month, down 68% in a year, and down almost 91% since its May 2021 all-time high. ","____","Learn more: \n– Bitcoin Could Fall to USD 13.6K This Year, Panel Says After Adjusting Predictions Once Again\n– Volatile Months Ahead for Ethereum & USD 1,711 Likely for Year-End, Says Crypto Industry Panel\n\n– BNB to Grow Modestly This Year, Might Tripple by 2025 – Analyst Panel\n– Little Upside for Solana This Year, But Long-Term Future Remains Bright, Panel Predicts\n\n– Cardano Price to End Year at USD 0.63, Increasingly Bearish Panel Predicts\n– Global Economic Growth Slows Amid Gloomy and More Uncertain Outlook"],"entity":[{"type":"Increasingly Bearish Panel Predicts\n– Global Economic Growth Slows Amid Gloomy","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"3.2%","content":"PERCENT"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2.1%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Panel Predicts\n\n– Cardano Price","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Earth","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"Gavin Smith","content":"PERSON"},{"type":"91%","content":"PERCENT"},{"type":"May 2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"Crypto Industry Panel\n\n– BNB","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"Panel Says After Adjusting Predictions Once Again\n– Volatile Months Ahead for Ethereum & USD","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"Panxora","content":"LOCATION"},{"type":"Walker Holmes","content":"PERSON"},{"type":"24%","content":"PERCENT"},{"type":"68%","content":"PERCENT"},{"type":"Kevin He","content":"PERSON"},{"type":"CloudTech Group.","content":"ORGANIZATION"},{"type":"Elon [Musk","content":"ORGANIZATION"}],"hashtag":["Altcoins","Dogecoin","Forecast","Market","Survey"],"authors":["Fredrik Vold"]}