{"summary":"Cardano Price Forecast as ADA Pumps Up 50% From Bottom – ADA to $10 Soon?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-forecast-as-ada-pumps-up-50-from-bottom-ada-10-soon.htm","publishDate":"2023-01-27T12:30:00","id":20656,"type":null,"title":"Cardano Price Forecast as ADA Pumps Up 50% From Bottom – ADA to $10 Soon?","category":["Altcoin News "],"content":["The value of the Cardano token, the eighth-largest cryptocurrency with a market capitalization of $13.2 billion, has grown by 45.5% in the past 30 days. However, this growth has slowed recently, with the token currently experiencing only a 0.9% increase in the past 24 hours. Here’s where ADA is headed next.","Cardano’s use cases as a smart contract platform have attracted the attention of the United Nations High Commissioner for Refugees (UNHCR), which hopes to tap the crypto platform as an alternate approach to supporting unfairly displaced people. Through this platform, the humanitarian organization will innovatively raise funds. With this development, UNHCR will for the first-time use blockchain technology to link other humanitarian communities to achieve a positive impact.","“Adopting the Cardano blockchain is first and foremost a new and innovative way of helping raise funds using staking to support people forced to flee… The opportunity of a stake pool generating rewards enables an even larger community to help make a difference and deliver lifesaving assistance to those most in need,” UNHCR outlined via a blog post.","Although this might seem like purely a humanitarian effort, the Cardano token may benefit as people around the world buy the ADA token for staking purposes. The program allows crypto users to donate while still holding ADA in a smart contract for a period of time.","In other news, Djed, a stablecoin expected to go live on Cardano’s blockchain next week, will enjoy the support of decentralized exchanges (DEXs) in the ecosystem. The DEXs set to list the much-hyped stablecoin and its governance token Shen are MinSwap and MueliSwap.","Djed is a brainchild of Input Output Global (IOG), the organization that develops and maintains the Cardano blockchain with Coti – a layer 1 protocol.","The Cardano price is relatively bullish even though the uptrend took a hiatus after reaching almost a three-month high of $0.39. Capping its immediate upside is a falling trend line, illustrated on the daily time frame chart in a continuous line.","ADA will need to pierce through this hurdle and the subsequent seller congestion zone at $0.40 to validate its uptrend eyeing $0.6 in the short term at $1.0 in the coming weeks. A positive outlook from the Moving Average Convergence Divergence (MACD) indicator is helping to keep the optimistic outlook investors see in Cardano’s price intact.","ADA price sits significantly above two of the three major moving averages applied to the daily chart, starting with the 50-day Exponential Moving Average (EMA) in the red line at $0.326 and the 100-day EMA overlaying the chart in the blue line at $0.34. This arrangement is bullish for Cardano price but to confirm a long-term trade, bulls will have to reclaim and hold the ground above the 100-day EMA (in purple) at $0.427.","Cardano’s price sits on top of robust support provided by investors who bought ADA between $0.3675 and $0.3764. Based on insights from IntoTheBlock, a crypto analytics platform, 77k addresses previously purchased 4.35 billion ADA tokens in that range are currently realizing profits.","The investors in this cohort would be willing to back an ADA price rally, especially with the IOMAP model shining a light on weakening resistance areas. Therefore, with a minor push, Cardano’s price could quickly close the gap to the 200-day EMA and clear the path to $0.60.","Backing the bullish outlook from the IOMAP model is the number of newly created addresses on the Cardano network. Cardano has been welcoming new address holders amidst recovery from the bottom of around $0.239. The “Active Daily Addresses” metric reveals that 28.1k addresses joined the protocol on January 26, up from 18.5k on January 24.","A similar growth pattern was reflected in the number of active addresses transacting on the Cardano blockchain. From the same chart, 76k addresses were active on Thursday, up from 50.3k over the same period.","It is worth mentioning that 736.82k Cardano addresses are in the money, or in profit based on the year-to-date data provided by IntoTheBlock. This is significantly below the 3.45 million addresses currently out of the money or facing unrealized losses.","That said, the majority of investors in ADA are unlikely to sell now because they will incur a loss if they did. On the bright side, more of the 3.45 million addresses may choose to buy ADA tokens as the price recovers, thus creating momentum for the expected move to the all-time high of $3.15 – later to $10.","Cardano price has the potential to rally and hit a new all-time high in the next bull run. However, the crypto market must first, confirm the bull market which some experts believe may happen toward the end of 2023 and take off in 2024. Therefore, it might not be easy for Cardano to hit $10 but could close in on this target if it reclaims its record high of $3.15.","Nevertheless, impossible, especially in the crypto space does not mean never. With the developments IOG has planned for the ecosystem, a breakthrough to $10 is still within reach for Cardano’s price.\n\nBuy Cardano Now","Before you invest in Cardano, you may want to consider other high-potential crypto projects alongside ADA. ","We’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:"," ",""],"entity":[{"type":"$0.6","content":"MONEY"},{"type":"Djed","content":"ORGANIZATION"},{"type":"$1.0","content":"MONEY"},{"type":"UNHCR","content":"ORGANIZATION"},{"type":"45.5%","content":"PERCENT"},{"type":"0.9%","content":"PERCENT"},{"type":"$10","content":"MONEY"},{"type":"$0.3675","content":"MONEY"},{"type":"$0.60","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"$0.34","content":"MONEY"},{"type":"EMA","content":"ORGANIZATION"},{"type":"Cardano blockchain","content":"ORGANIZATION"},{"type":"United Nations High Commissioner","content":"ORGANIZATION"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"MACD","content":"ORGANIZATION"},{"type":"$0.239","content":"MONEY"},{"type":"$0.39","content":"MONEY"},{"type":"$13.2 billion","content":"MONEY"},{"type":"Cardano","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Cardano","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Cardano Now","content":"ORGANIZATION"},{"type":"Shen","content":"PERSON"},{"type":"$0.3764","content":"MONEY"},{"type":"January 26","content":"DATE"},{"type":"January 24","content":"DATE"},{"type":"$3.15","content":"MONEY"},{"type":"$0.427","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"IntoTheBlock","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"$0.326","content":"MONEY"}],"hashtag":["ADA","Cardano"],"authors":["John Isige"]}