{"summary":"Ethereum Network Achieves One Million Validators, Securing $114 Billion in Staked Ether","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-network-achieves-one-million-validators.htm","publishDate":"2024-03-28T09:48:46","id":20652,"type":null,"title":"Ethereum Network Achieves One Million Validators, Securing $114 Billion in Staked Ether","category":["Ethereum News "],"content":["The Ethereum network has surpassed one million validators, with approximately 32 million Ether, worth around $114 billion, staked within the network.","According to data from the Dune Analytics dashboard, which tracks Ethereum staking progress, the validator count reached the one million mark on March 28. ","The 32 million ETH staked represents approximately 26% of the total supply, highlighting the substantial commitment to Ethereum’s proof-of-stake (PoS) consensus mechanism.","Among the staking options available, about 30% of the ETH is staked through Lido, an Ethereum staking pool that allows users with smaller amounts of ETH to pool their assets and participate in the staking process.","Validators play a crucial role in maintaining the security of the Ethereum blockchain by monitoring transactions for any malicious activities, such as double-spending. ","In Ethereum, validators propose and validate transactions within the network, requiring a stake of 32 ETH. ","In return for their participation, validators receive rewards in the form of a portion of ETH.","While a higher number of validators generally enhances blockchain security, some members of the Ethereum community express concerns about potential issues arising from an excessive number of validators. ","Evan Van Ness, a venture investor and Ethereum advocate, suggests that there may already be “too much” staked. ","Gabriel Weide, operator of a staking pool, warns that an abundance of validators could lead to an increase in “failed transactions.”","Nr. of validator is issue (too many can ultimatively lead to failed transactions). But the max. effective staking amount (>32ETH) should mitigate that risk.","— Gabriel Weide (@AlphapingG) March 27, 2024","","Addressing the network’s decentralization, Ethereum co-founder Vitalik Buterin recently proposed a mechanism to improve the system. ","In a blog post, Buterin suggested penalizing validators in proportion to their average failure rate. ","By implementing this approach, penalties would be higher if multiple validators fail within a given slot, potentially reducing the advantage of larger ETH stakers over smaller ones.","The SEC has recently postponed its decision on the applications for Ether (ETH) ETFs from major financial institutions like BlackRock and Fidelity. ","The final deadlines for these decisions have been extended to May 2024. ","The SEC’s decision to extend the deadline follows its earlier postponement in December 2023, during which it sought additional public input on whether the ETF should be listed. ","Grayscale had proposed listing and trading shares of its Ethereum Futures Trust ETF under the New York Stock Exchange Arca Rule 8.200-E in September 2023. ","Bloomberg Intelligence ETF analysts James Seyffart and Eric Balchunas have both expressed their calibrated predictions of the pending approvals, expecting a potentially persisting denial in May.","“Our odds of eth ETF approval by May deadline are down to 35%,” stated Balchunas. ","“I get all the reasons they SHOULD approve it (and we personally believe they should) but all the signs\/sources that were making us bullish 2.5mo out for btc spot are not there this time.”","My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round. The SEC hasn't engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall. https:\/\/t.co\/TyAzAOrAC5","— James Seyffart (@JSeyff) March 19, 2024","",""],"entity":[{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Gabriel Weide","content":"PERSON"},{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"March 27, 2024","content":"DATE"},{"type":"$114 billion","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"May 2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"May 23rd","content":"DATE"},{"type":"Evan Van Ness","content":"PERSON"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"26%","content":"PERCENT"},{"type":"December 2023","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"March 19, 2024","content":"DATE"}],"hashtag":["Ethereum","Validator"],"authors":["Ruholamin Haqshanas"]}