{"summary":"South Korean Bithumb Airdrop Recipients Hit With Tax Bills, Exchange Responds","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-bithumb-airdrop-recipients-hit-with-tax-bills-exchange-responds.htm","publishDate":"2024-05-14T03:00:12","id":20655,"type":null,"title":"South Korean Bithumb Airdrop Recipients Hit With Tax Bills, Exchange Responds","category":["Blockchain News "],"content":["South Koreans who received airdrop tokens and prizes from the Bithumb crypto exchange from 2018 to 2021 could face unexpected tax bills.","Per Hanguk Kyunjae, Bithumb said on May 10 that it would foot the bill for customers who have been ordered to pay taxes on the giveaways.","However, the exchange wants to challenge the National Tax Service (NTS)’s decision to retrospectively tax its customers.","Bithumb customers have been told to pay a combined total of around $30 million in taxes as a result of winning airdrop prizes and taking part in cashback-type promotions.","The NTS thinks that Bithumb gave away almost $61 million worth of assets to South Korean residents in the period 2018-2021.","The tax bills have come as a shock to many, particularly as South Korea does not currently tax crypto-related profits.","However, the NTS does require the winners of “lotteries and similar events” to declare and pay taxes on their winnings.","The NTS classifies these as a form of “other income.” For prizes exceeding around $37, residents must pay 22% of their winnings.","Bithumb says that 10,700 of its users were told to pay a total of $15 million in taxes last year alone. This is the first time the NTS has taxed South Korean airdrop recipients.","Bithumb said that it would “immediately” compensate its customers for anything they had to pay the NTS as a result of receiving its airdrops.","However, the exchange announced that it was “filing a tax appeal” against the national tax body.","Bithumb argued that “virtual assets and commission cashback distributed via events are a type of free gift or sales benefit.” As such, the exchange said, these are “exempt from taxation.”","The media outlet quoted South Korean tax experts as stating that the appeal’s success would hinge on “the nature of the event giveaways.”","Korea's major cryptocurrency exchange Bithumb said Friday that it will cover all the 40 billion won ($30 million) of taxes imposed on the winners of its crypto airdrop events.https:\/\/t.co\/36G4cGNQRv","— The Korea Herald 코리아헤럴드 (@TheKoreaHerald) May 10, 2024","","While the NTS appears to view the tokens as “a prize,” Bithumb insists these are “free gifts.”","The exchange may argue, experts noted, that it is following the example of securities providers, who often give out stocks to new account holders.","In more conventional cases, shopping outlets that give high-spending customers gift certificates also avoid legal issues. In neither case do recipients pay taxes, experts added.","Again, this is because the NTS does not see such handouts as competition “prizes,” but as “free gifts.”","The media outlet warned that appeals to the NTS are often time-consuming, concluding that “it may take up to several years for a ruling to emerge.”","Bithumb is currently aiming to become the first South Korean crypto exchange to float on the nation’s stock exchange."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"40 billion","content":"MONEY"},{"type":"Bithumb","content":"LOCATION"},{"type":"NTS","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Hanguk Kyunjae","content":"PERSON"},{"type":"Korea","content":"LOCATION"},{"type":"$37","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"The Korea Herald","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Bithumb","content":"PERSON"},{"type":"$61 million","content":"MONEY"},{"type":"May 10, 2024","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"}],"hashtag":["Bithumb","South Korea"],"authors":["Tim Alper"]}