{"summary":"Cardano Price Prediction as ADA Spikes Up 0.8% – How High Can ADA Go in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-prediction-as-ada-spikes-up-08-how-high-can-ada-go-2023.htm","publishDate":"2023-02-20T16:49:00","id":20665,"type":null,"title":"Cardano Price Prediction as ADA Spikes Up 0.8% – How High Can ADA Go in 2023?","category":["Altcoin News "],"content":["The Cardano price is currently in a delicate state, balancing last week’s decent rally and the risk of a pullback below the crucial $0.40 level. It’s worth noting that this uneventful price movement is not exclusive to ADA, as it’s observed among the top 100 cryptocurrencies. As of now, the seventh-largest cryptocurrency has seen a 15% increase in weekly cumulative gains and is trading at $0.4080.","A 25% uptick in trading volume to $404 million suggests investors are currently focusing on accumulating more ADA tokens to fill their wallets ahead of an expected bull market in 2023. ","Alex Adelman, the CEO of Lolli, a platform that rewards users with Bitcoin and cash back for spending at selected stores, in a weekly statement, said the current bull market would be characterized by price stability, new innovations, and accessibility of financial resources.","“The next bull market will bring greater price stability and new projects that solve existing issues to make money and financial resources accessible to all, in keeping with bitcoin’s original mission and goals,” Adelman chimed on the expected bull run.","Although the crypto market has generally been bullish since the beginning of the year, Adelman says that a rally is not enough to call a bull market. He reckoned that the impact of FTX collapse on businesses and individuals is still fresh and may stifle growth in the coming months.","There is also a growing need for clear regulatory frameworks, which, if put in place, could bolster crypto into the next long-lasting bull market. Charles Hoskinson, the co-founder of Cardano, believes the recent spike in a regulatory attack on the industry is majorly attributed to the messy collapse of FTX. “The minute it happened, I knew the entire industry was in for a seriously hard time,” Hoskinson stated.","Hoskinson added that the collapse of FTX and other crypto giants like Three Arrows Capital could have been deliberately allowed to operate fraudulently in order for regulators to maliciously pounce on the industry in the name of tightening the rules. Such bad actors paint a bad picture of the crypto industry and when they explode, it is easier to call for stricter measures.","The United States Securities and Exchange Commission (SEC) has been accused being complicit and focusing only on imposing penalties, court processes, and fines as opposed to embracing a proactive approach.","Meanwhile, Cardano bulls are holding onto support at $0.40 as though their lives depended on it. As long as this support area stays intact, buyers would only need to worry about the seller congestion fronted by the 200-day Exponential Moving Average (EMA) (in purple) at $0.4181. A natural break and hold above this crucial level, might ignite a 45.72% move to $0.6107 and bring $1.0 significantly nearby.","Cardano’s price is on the verge of triggering another massive bullish move following the formation of an inverse head-and-shoulders pattern. This is essentially a head-and-shoulders (H&S) formation, only this time, it forms upside down.","The pattern starts with the first valley (L. Shoulder), followed by a much lower valley (head), and lastly, the third valley (R. Shoulder). It is worth mentioning that it often comes into the play after an extended downward movement in price which is sums up the price action of ADA in 2022.","Investors can buy Cardano slightly above the neckline. The Cardano price breakout target is calculated by measuring the distance between the head and the neckline. In that case, this is the distance ADA is expected to move after breaking above the neckline resistance.","In addition to the inverse H&S pattern, Cardano price recently confirmed a golden cross pattern. The bullish impetus commenced as the 50-day EMA (in red) stepped above the 100-day EMA (in blue).","A bullish move to $0.6107 and $1.00 is the most likely outcome, especially with the Moving Average Convergence Divergence (MACD) indicator donning a buy signal. ADA price turned bearish earlier in February as the crypto market reacted to the increase in interest rates in addition to the recent regulatory attack on the industry.","However, the MACD line in blue is back above the signal line, a move likely to compel investors to stay put. Traders should keep a close eye on the position of the MACD in the coming sessions to ascertain the direction of the trend.","Note that movement back to the mean line and possibly into the negative region may obliterate the optimistic outlook for Cardano’s price. On the other hand, a break above the 200-day EMA (H&S pattern’s neckline) may trigger the massive upswing to $0.6107 and pave the way for gains aiming for $1.00.","Buy Cardano Now","Before you start accumulating Cardano, do you know about these new coins? If you’re looking for other high-potential crypto projects alongside ADA.","We’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:",""],"entity":[{"type":"Hoskinson","content":"PERSON"},{"type":"$1.0","content":"MONEY"},{"type":"$0.6107","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"Adelman","content":"PERSON"},{"type":"Lolli","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"$1.00","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"Alex Adelman","content":"PERSON"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"45.72%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Cardano Now","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cardano","content":"ORGANIZATION"},{"type":"H&S","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$0.4181","content":"MONEY"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"$0.4080","content":"MONEY"},{"type":"$404 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["ADA","Cardano"],"authors":["John Isige"]}