{"summary":"US Fed governor Lael Brainard has said that the central bank is studying the potential for digital currency\n“We are collaborating with other central banks as we advance our understanding of central bank digital currencies,” she added\nBrainard’s remarks suggest the Fed’s more openness to digital currencies.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55102\/fed-is-studying-the-potential-for-digital-dollar-says-governor-brainard","publishDate":"2020-02-06T05:25:17","id":2066,"type":null,"title":"Fed is studying the potential for digital dollar, says governor Brainard","category":["Regulation"],"content":["The U.S. Federal Reserve, the country’s central bank, is studying the feasibility of issuing its own digital currency, said governor Lael Brainard.","“Given the dollar's important role, it is essential that we remain on the frontier of research and policy development regarding CBDC [central bank digital currency],” Brainard <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/speech\/brainard20200205a.htm\" data-v-f87c67ca=\"\">said<\/a> Wednesday at a conference on payments at the Stanford Graduate School of Business in California.","She went on to say that the Fed, like <a href=\"https:\/\/www.theblockcrypto.com\/post\/53545\/uks-central-bank-to-explore-digital-currency\" data-v-f87c67ca=\"\">other central banks<\/a>, is researching blockchain technologies and their potential use case for digital currencies, “including the potential for a CBDC.”","“We are collaborating with other central banks as we advance our understanding of central bank digital currencies,” she added.","Brainard’s remarks suggest the Fed’s more openness to digital currencies. In 2018, Brainard <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/speech\/brainard20180515a.htm\" data-v-f87c67ca=\"\">said<\/a> there is “no compelling demonstrated need for a Fed-issued digital currency.” But at the time, private sector initiatives, such as the Facebook-led Libra stablecoin project, weren’t public.","Libra has “imparted urgency to the debate over what form money can take, who or what can issue it, and how payments can be recorded and settled,” Brainard said Wednesday.","While digitalization has the potential to deliver “greater value and convenience at lower cost,” there are risks to financial stability, privacy and fraud protection, she said.","“In the United States no less than in other major economies, the public sector needs to engage actively with the private sector and the research community to consider whether new guardrails need to be established, whether existing regulatory perimeters need to be redrawn, and whether a CBDC would deliver important benefits on net,” Brainard concluded.","The Fed has been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41896\/two-congressmen-recommend-fed-to-develop-digital-us-dollar\" data-v-f87c67ca=\"\">advised<\/a> several times in the past to consider developing a digital dollar. Jerome Powell, the Fed chairman, however, <a href=\"https:\/\/www.theblockcrypto.com\/post\/49491\/mnuchin-powell-see-no-need-to-issue-digital-dollar-in-the-next-5-years\" data-v-f87c67ca=\"\">sees<\/a> no need to issue CBDC \"in the next five years.\""],"hashtag":["FEDERAL RESERVE"]}