{"summary":"The Financial Conduct Authority is looking to reign in, among other things, meme-centric marketing for financial products.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285019\/memecoin-finfluencers-are-falling-under-the-financial-conduct-authoritys-regulatory-spotlight","publishDate":"2024-03-27T07:16:41","id":2066,"type":null,"title":"Memecoin &#x27;finfluencers&#x27; are falling under the FCA&#x27;s regulatory spotlight","category":["REGULATION"],"content":["The Financial Conduct Authority is looking to rein in, among other things, meme-centric marketing for financial products.","The United Kingdom’s financial regulator put forth <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-warns-firms-and-finfluencers-keep-their-social-media-ads-lawful\" data-v-f87c67ca=\"\">guidelines<\/a> for both financial services companies and influencers on social media who make memes about cryptocurrencies (or other investments) — indicating that any marketing should be transparent and not misleading.","The FCA said that so-called “finfluencers” must have approval from an FCA-appointed representative prior to advertising or posting memes about financial products and services.","\"Influencers are reminded that promoting a financial product without approval from an FCA-authorised person with the right permission could be a criminal offence,\" the regulator wrote.","\"Consumers need to be alert to dubious adverts and scams online, but it is important that influencers ensure they’re on the right side of the rules and consider what would happen to their own reputations if they’re found to promote products illegally,\" it added.","The FCA’s director of consumer investments, Lucy Castledine, stated that the watchdog “will take action against those touting financial products illegally.”","The regulator noted that promotion via memes is particularly popular in the cryptocurrency sector — which has a dedicated memecoin niche. It specifically identified Telegram and Reddit as popular platforms for crypto-related memetic marketing.","The FCA’s latest warning comes after <a href=\"https:\/\/www.theblock.co\/post\/277631\/fca-issues-450-alerts-against-illegal-crypto-promotions-in-2023\" data-v-f87c67ca=\"\">emphasizing<\/a> that it will take action against firms issuing illegal financial promotions last month.","It issued 450 alerts as part of its enforcement efforts against illegal cryptocurrency advertisements last year.","This is also not the first time the FCA has issued a warning regarding crypto memes. In July 2023, the regulator <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">proposed<\/a> guidelines that included a section on non-compliant crypto memes considered financial promotions — with much of its language mirroring yesterday's warning.","<em data-v-f87c67ca=\"\">Article updated with additional information.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Lucy Castledine","content":"PERSON"},{"type":"July 2023","content":"DATE"}],"hashtag":["FCA"],"authors":["Adam James","The Block"]}