{"summary":"Canaan Executives Plan to Buy $2 Million in Company Shares, Citing Deep Undervaluation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/canaan-executives-plan-to-buy-2-million-in-company-shares-citing-deep-undervaluation.htm","publishDate":"2024-04-23T21:54:01","id":20660,"type":null,"title":"Canaan Executives Plan to Buy $2 Million in Company Shares, Citing Deep Undervaluation","category":["Blockchain News "],"content":["Two executives of the bitcoin mining rig maker Canaan intend to jointly purchase at least $2 million worth of company shares, claiming the company is “deeply undervalued,” despite revenue decline.","According to its annual report released last week, Canaan’s total revenues shrank by 67.5% to $211.5 million in 2023 from $651.5 million in 2022.","Canaan, a prominent provider of high-performance computing solutions, has disclosed that its Chairman and CEO, Nangeng Zhang, along with Chief Financial Officer, James Jin Cheng, have expressed their intent to utilize personal funds for a joint purchase of at least USD $2 million worth of the company’s Class A ordinary shares, represented by American depositary shares (“ADSs”). ","The initiative is subject to the company’s insider trading policy and complies with legal guidelines.","“We believe that the company is deeply undervalued, providing a rare investment opportunity for us to pursue,” Zhang commented.\n","Zhang further elaborated that Canaan is progressing well in manufacturing its A14 series mining rigs, fulfilling previous contract sales orders, including bulk orders from public company customers. He elaborated on the progress made in streamlining the manufacturing of A14 series mining machines, advancements in the development of next-generation A15 series units, and ongoing R&D of the A16 series.","Their decision follows the recent fourth halving event on the Bitcoin network, in which Zhang emphasized its potential for emerging opportunities in the Bitcoin ecosystem.","“Now that the fourth bitcoin halving occurred on Friday, we expect many more opportunities will emerge in the ecosystem,” Zhang added.","Established in 2013, Canaan is a technology company specializing in ASIC high-performance computing chip design, chip research and development, computing equipment production, and software services.","Under the leadership of Nangeng Zhang, the company’s founding team achieved a significant milestone by shipping the world’s first batch of mining machines incorporating ASIC technology in Bitcoin’s history under the brand name Avalon. In 2019, Canaan completed its initial public offering on the Nasdaq Global Market.","","📉 Canaan – a China-based Bitcoin ASIC manufacturer and operator – lost nearly half its revenue from mining machine sales last quarter, according to its Q3 earnings.#CryptoNews #BTChttps:\/\/t.co\/yB1LNS4Ceu","— Cryptonews.com (@cryptonews) November 28, 2023","","Despite the ongoing bull market in the cryptocurrency space, demand for Bitcoin application-specific integrated circuit (ASIC) miners and servers has remained subdued.","On February 27, Bitcoin ASIC manufacturer Canaan released its earnings report for the fourth quarter of 2023. The company disclosed revenue of $49 million, marking a 16% decrease compared to the same period the previous year.","Additionally, Canaan reported a widening net loss of $139 million, compared to $91.6 million in the fourth quarter of 2022. Despite an uptick in the amount of computing power sold and a recovery in Bitcoin’s price to $66,089, Canaan attributed the revenue decline to selling its ASICs at lower prices relative to the market throughout last year.","Also, Canaan’s annual report for the year 2023 revealed a net loss of $414.2 million, compared to a net income of $69.9 million in 2022. Total revenues, including product and mining revenue, declined significantly by 67.5% to $211.5 million in 2023 from $651.5 million in 2022.","The revenue decline was attributed to a decrease in the average selling price of Canaan’s Bitcoin mining machines on a per-Thash basis, dropping from US$40.8 per Thash in 2022 to US$8.9 per Thash in 2023. This decrease resulted from soft demand and a price drop in computing power throughout 2023.","Despite the revenue decline, mining revenue amounted to $34 million in 2023, slightly higher than the $32.5 million recorded in 2022, according to the company’s report."],"entity":[{"type":"Nangeng Zhang","content":"PERSON"},{"type":"Zhang","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"November 28, 2023","content":"DATE"},{"type":"Bitcoin ASIC","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$32.5 million","content":"MONEY"},{"type":"US$8.9","content":"MONEY"},{"type":"Canaan","content":"LOCATION"},{"type":"Chief Financial Officer","content":"ORGANIZATION"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"$414.2 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"last quarter","content":"DATE"},{"type":"Nasdaq Global Market","content":"ORGANIZATION"},{"type":"$139 million","content":"MONEY"},{"type":"$34 million","content":"MONEY"},{"type":"Avalon","content":"ORGANIZATION"},{"type":"February 27","content":"DATE"},{"type":"$49 million","content":"MONEY"},{"type":"67.5%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"US$40.8","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Nangeng Zhang","content":"ORGANIZATION"},{"type":"the fourth quarter of 2023","content":"DATE"},{"type":"$211.5 million","content":"MONEY"},{"type":"James Jin Cheng","content":"PERSON"},{"type":"$91.6 million","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"Canaan","content":"ORGANIZATION"},{"type":"$66,089","content":"MONEY"},{"type":"$651.5 million","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"$69.9 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Mining","Canaan"],"authors":["Hassan Shittu"]}