{"summary":"Keep Calm, Bulls Are Here, Say Analysts, As USD 19B Liquidated In One Week","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/keep-calm-bulls-are-here-say-analysts-as-usd-19b-liquidated-10032.htm","publishDate":"2021-04-23T12:51:00","id":20675,"type":null,"title":"Keep Calm, Bulls Are Here, Say Analysts, As USD 19B Liquidated In One Week","category":["Bitcoin News "],"content":["Options expiring, US tax speculations, China blackout, and the combination of these are blamed for the crypto market turning bloody today, to say the least – yet numerous insiders see this as just a necessary correction and expect that the bull market will continue, with bitcoin (BTC) possibly recovering above USD 60,000 again.","Source: Pinterest","At 12:22 PM UTC, BTC is trading at USD 49,991 and is down by 9% in a day, ethereum (ETH) dropped by almost 12%, to USD 2,287.","Also, nearly the entire top 100 by market capitalization list is red, and the top 10 list is red completely (down by 9% – 16%). However, the market is now seemingly trying to recover, leaving almost USD 4bn worth of trading positions (more than 620,000 traders) in the crypto derivatives market liquidated in the past 24 hours. Over USD 1.5bn of these were in BTC, per bybt.com data. This comes after USD 10bn was liquidated this past Sunday.","In total, almost USD 19bn worth of trading positions were liquidated in the past seven days.","As is always the case during similar market corrections, there are those who see the market bears everywhere and those, who claim that the bulls are still here.","“Don’t listen to BTC bulls. It’s the first time we’ve closed below the 50 [moving average] since [USD] 10500,” said ‘TurnipShortLife’, but posts like these tend to provoke arguments over what ‘closing’ means in a 24\/7 market.","And while levels of USD 46,000 and as low as USD 40,000 are being mentioned, comparing this bull run with the one in 2017, some find that larger drawbacks may be yet to come.","Yup… makes you wonder if we're gonna nuke harder the following days. But $ETH just might pull everything out of this mess.https:\/\/t.co\/6tffaCUPl6","However, it seems that the general consensus is that the bull market is still here.","Meanwhile, among the reasons behind the drop, are the USD 1.55bn worth of options expiring today, and US President Joe Biden’s reportedly proposed tax plan, insiders say.","According to the global payment network Mercuryo Co-founder and CEO, Petr Kozyakov, “the market appears to be reacting irrationally to the news with sell-offs” and “the dip may continue but bitcoin will form strong support at [USD] 45,000 while looking forward to recovery to its previous [all-time high].”","BTC hit its all-time high of USD 64,805 on April 14, per Coingecko.","“The deep correction has shaken the confidence of the cryptocurrency market,” said analysts at crypto exchange OKEx, adding that the price of BTC has finally hit an area of presumed buying interest. While traders eager to long “would be attempting to catch a knife,” many experienced traders won’t be too eager to short at this stage.","This is “just another day in crypto,” added OKEx CEO Jay Hao, urging people to stay calm, trade responsibly, and build a position over time.","“The Coinbase listing was a crescendo and drove tremendous institutional and retail interest. Since then, there has been a lack of continual buyers. Therefore, one could argue that a healthy correction was necessary,” Alex Zhao, CEO of Standard Hashrate Group, said in an emailed comment, adding that BTC will continue to attract institutional interest.","Many more commenters, developers, and analysts seem to believe that the market is in a “resting” period.","For trader Michaël van de Poppe, this is an expected stage of “calm” for BTC after running from USD 10,000 to USD 60,000 without breaks. He said this a “great” time to buy the dip, or remain calm if you’re holding positions.","Not only that, but many claim that the bull will keep running. “This is just turbulence,” said trader Teddy Cleps. “Confident the bull market is nowhere to be done – still loads to go.”","the bull market isn’t over you dorks relax and have a beer or something","“Market participants suffer from 2018 [post-traumatic stress disorder],” said trader Alex Krüger. While the possible US tax changes are bearish, they’re still being discussed, are far ahead, and should have been expected as a part of Biden’s plan, he argued. Krüger doubts that we’re heading for a 2018-like correction, adding: “If can’t hold a correction, maybe good idea to take some profits next time.”","And while many are reminded of pullbacks seen in 2017\/2018, others are trying to put the current dip into perspective, compared to those that preceded it.","Look what happened next pic.twitter.com\/QuNwsbVKP5","Others are showing it from a different point of view, noting how much BTC has appreciated in a short time, compared to which the recent drop is much smaller. On April 23 last year, BTC was trading at USD 7,700. It went up 603% to reach the current price.","“We are approaching a bottom in the short-mid-term for this current correction and are just waiting for profit taking to reset and a general shift of coins from weak to strong hands. The exact timeline for this is never predictable, but as macro cycle indicators show, we are far from the top,” Anthony Pompliano of Morgan Creek Digital wrote in his newsletter today, stressing that “there are currently over 50,000 new entities a day coming onto the [Bitcoin] blockchain.”","On Krüger’s question to the public which coin would bounce the hardest, many nominated major coins like ETH, binance coin (BNB), solana (SOL), chainlink (LINK), uniswap (UNI), as well as “some illiquid shitcoin that goes to almost 0.”","Meanwhile, a coming upgrade is expected to reduce the supply of ETH, which could help boost the price. Per Bitfinex\/Tether Chief Technology Officer Paolo Ardoino, “Ethereum is getting a bit of the spotlight,” and its role in decentralized finance (DeFi) and the non-fungible token (NFT) market are worth noting too.","Konstantin Anissimov, Executive Director at crypto exchange CEX.IO, said that USD 3,000 level for ETH is “more achievable than ever.”","ETH hit its new all-time high of USD 2,640 (per Coingecko) yesterday.\n__","______","The markets are just a giant Ouija board, with all of our hands on the slider.","__","Agree 100% that the real bear market haven't even started. Yet. https:\/\/t.co\/zeJj2ZkbQT","__","Crashes charachterized by extreme liquidations in a highly levered market (eg Apr17) bounce fast due to the mechanics of stop losses.\n\nCrashes charachterized by heavy spot selling not in a highly levered market (eg Apr22) don't bounce as hard, making BTFD much more challenging. pic.twitter.com\/ahYiZ4iZNm","__",". @bitfinex will start soon offering branded napkins to dry out tears. https:\/\/t.co\/ZIcvZJt1WU","__","The last 24H really shows the importance of using a stop-loss order on your trades\n\nI would’ve been rekt if my SL would not have been in place","__","Now that #Bitcoin is back below $50k I think it's time for @APompliano to tweet out $1k milestones on the way down the way he did on the way up.","__","___","#BTC has now reached RSI 30 on the Daily timeframe\n\nLast time $BTC reached RSI 30 was in September 2020\n\nWhen BTC reach RSI 30 in September 2020…\n\nBTC then formed a month-long consolidation range which later preceded a significant breakout rally towards the upside#Bitcoin","___","____","Learn more: \n– JPMorgan ‘Worried’ Over Bitcoin Price As Altcoins Leave BTC in the Dust\n– Bitcoin Fees Hit ATH, Transactions Slow Down after China Explosion\n– Bitcoin Sell-off Postmortem: Euphoria Exhaustion & FUD Behind Massive Liquidations\n– 3\/4 of Polled S Korean Bankers See Bitcoin At USD 90K Before End of 2021\n– Bitcoin Faces Hedge Test Amid Rising Inflation Concerns\n– Coinbase Listing Won’t Help Bitcoin Price – Analyst\n– Bitcoin Market Changed ‘Radically’ & Volatility Decline Attracts Institutions\n– Bitcoin to Be Worth Millions by 2023, ETH Above USD 2K by 2022 – Kraken CEO\n– Institutions & Retail Compete For Bitcoin – Whose Hands Are Stronger?\n– Next 2-3 Years ‘Should Be a Turning Point for Bitcoin’ – Deutsche Bank\n– Inflation Is Here & Bitcoin Will Hit USD 115K ‘Ahead of Target’ – Pantera\n___\n(Updated at 14:06 UTC with a comment from Anthony Pompliano. Updated at 15:26 UTC with a vide.)"],"entity":[{"type":"$ETH","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Jay Hao","content":"PERSON"},{"type":"Standard Hashrate Group","content":"ORGANIZATION"},{"type":"September 2020","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"603%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Altcoins Leave BTC","content":"ORGANIZATION"},{"type":"Teddy Cleps","content":"ORGANIZATION"},{"type":"Michaël van de Poppe","content":"PERSON"},{"type":"Euphoria Exhaustion & FUD Behind Massive Liquidations","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Petr Kozyakov","content":"PERSON"},{"type":"Konstantin Anissimov","content":"PERSON"},{"type":"$50k","content":"MONEY"},{"type":"Joe Biden","content":"PERSON"},{"type":"3","content":"DATE"},{"type":"Deutsche Bank\n– Inflation Is Here & Bitcoin Will Hit USD","content":"ORGANIZATION"},{"type":"Sunday","content":"DATE"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"9%","content":"PERCENT"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alex Zhao","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"April 23 last year","content":"DATE"},{"type":"Kraken CEO\n– Institutions & Retail Compete For Bitcoin – Whose Hands","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Bitcoin Market Changed ‘Radically’ & Volatility Decline Attracts Institutions\n– Bitcoin","content":"ORGANIZATION"},{"type":"April 14","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"16%","content":"PERCENT"},{"type":"Pinterest","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"$1k","content":"MONEY"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Alex Krüger","content":"PERSON"}],"hashtag":["Altcoins","Anthony Pompliano","Bitcoin","Ethereum","Forecast","Market"],"authors":["Sead Fadilpašić"]}