{"summary":"Web3 Gaming Platform Immutable Gears Up for zkEVM Mainnet Launch Early Next Year","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/web3-gaming-platform-immutable-gears-up-for-zkevm-mainnet-launch-early-next-year.htm","publishDate":"2023-10-05T06:24:00","id":20671,"type":null,"title":"Web3 Gaming Platform Immutable Gears Up for zkEVM Mainnet Launch Early Next Year","category":["Blockchain News "],"content":["Web3 gaming platform Immutable has unveiled its highly-anticipated mainnet launch roadmap for Immutable zkEVM, marking a significant step towards becoming the go-to platform for gaming on the Ethereum network. ","The gaming platform aims to enhance the player experience, revenue engine, and developer experience, with zkEVM mainnet launch early next year. ","The recent launch of the Immutable zkEVM Testnet has attracted a flurry of gaming projects eager to harness the platform’s capabilities, the gaming platform announced. ","Over 50 games have already pledged their commitment to building on Immutable zkEVM. ","One of the key aspects of Immutable’s roadmap is the technical upgrade that Immutable zkEVM is set to receive in the coming months, laying the foundation for a successful mainnet launch. ","This upgrade will involve transitioning from the Polygon Edge to Geth, aligning Immutable zkEVM more closely with Ethereum while ensuring compatibility with the broader Ethereum tooling ecosystem.","The journey to mainnet includes pivotal milestones, with the Immutable zkEVM Testnet having already attracted substantial developer interest. ","The web3 gaming platform revealed that over 20,000 addresses have been active, facilitating more than 100,000 transactions as game developers eagerly begin building on the platform. ","Another Testnet Re-Genesis is also scheduled to take place next month. ","The most awaited stage of this roadmap is the Immutable zkEVM Mainnet launch, which is scheduled to take place between December this year and January next year. ","During this phase, Immutable will invite developers to join the new chain in batches before opening it up to the public, ushering in a new era of gaming on the Ethereum network.","In 2024, the project plans to offer dedicated application chains with the same technology stack and capabilities as Immutable zkEVM but with a unique level of customization. ","These dedicated chains will focus on providing optimal liquidity, accessibility, and security.","Looking even further into the future, Immutable has a significant milestone planned for 2024 – the introduction of zk-prover, offering a trustless bridge between Ethereum and Immutable zkEVM.","With the Immutable zkEVM Testnet already live and accessible, the countdown has begun for the Mainnet launch."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"December this year","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"}],"hashtag":["Ethereum","Polygon"],"authors":["Jai Pratap"]}