{"summary":"South Korean Lawmakers ‘Must Declare’ Crypto Holdings – ‘Coin Gate’ Fallout Continues","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-lawmakers-must-declare-crypto-holdings-coin-gate-fallout-continues.htm","publishDate":"2023-05-18T01:00:00","id":20672,"type":null,"title":"South Korean Lawmakers ‘Must Declare’ Crypto Holdings – ‘Coin Gate’ Fallout Continues","category":["Blockchain News "],"content":["South Korean lawmakers will likely be “obliged” to declare their crypto holdings following a national outcry over alleged “insider trading.”","The National Assembly’s Political Affairs Committee has co-created a resolution that would create a “voluntary” system whereby they are requested to report their cryptoasset holdings.","But any such system is likely to become a de facto mandatory protocol, South Korean media outlets have claimed.","The development comes hot on the heels of a scandal that has enveloped the nation’s political world involving the MP Kim Nam-kuk.","The scandal has been dubbed “Coin Gate” by the media.","Kim, formerly a rising star in the main opposition Democratic Party, has stepped down from the party.","He denies wrongdoing, but has been accused of carrying out suspicious crypto trades worth some $4.5 million.","Multiple reports have accused Kim of withdrawing his crypto holdings from domestic exchanges prior to the implementation of the Travel Rule in March 2022.","If true, this may constitute insider trading, implying that he acted on the knowledge of a forthcoming legal change.","The nation’s two largest crypto exchanges, Upbit and Bithumb, were raided by prosecutors investigating the charges this week.","And the outcry appears to have spurred lawmakers into action.","The media outlets EDaily, Money S, and Newsis reported that senior figures from all major political parties attended the committee’s behind-closed-doors session on the matter on May 16.","Subcommittees have already received the committee’s proposal, and began the reviewing process yesterday – but the matter is unlikely to stop there.","Some lawmakers want every one of the 300 members of the National Assembly to be investigated.","Many believe that Kim may not be the only MP involved in “Coin Gate.”","People’s Power MP Yoon Han-hong, a member of the Political Affairs Committee, called for a probe into “all 300” sitting MPs.","Current South Korean law stipulates that lawmakers must declare real estate, cash, or stock holdings worth over $7,500.","But no such legal requirements exist for crypto holdings.","MPs have suggested including the new resolution as a clause in a forthcoming crypto holders’ “protection” act.","The draft act is already in advanced committee stages ahead of an Assembly vote.","Crypto declarations for MPs have already been adopted in nations such as Ukraine.","In Ukraine, lawmakers have previously been obliged to make yearly crypto-holding disclosures."],"entity":[{"type":"May 16","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"Democratic Party","content":"ORGANIZATION"},{"type":"Yoon Han","content":"PERSON"},{"type":"$4.5 million","content":"MONEY"},{"type":"March 2022","content":"DATE"},{"type":"Political Affairs Committee","content":"ORGANIZATION"},{"type":"$7,500","content":"MONEY"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"“Coin Gate","content":"LOCATION"},{"type":"National Assembly’s Political Affairs Committee","content":"ORGANIZATION"},{"type":"Newsis","content":"ORGANIZATION"},{"type":"Kim Nam","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Politics","South Korea"],"authors":["Tim Alper"]}