{"summary":"No Internet, No Problem: This New Crypto Startup Brings Bitcoin to Local Mesh Networks","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/no-internet-no-problem-new-crypto-startup-brings-bitcoin-local-mesh-networks.htm","publishDate":"2023-09-01T19:40:00","id":20674,"type":null,"title":"No Internet, No Problem: This New Crypto Startup Brings Bitcoin to Local Mesh Networks","category":["Bitcoin News "],"content":["In a world increasingly reliant on internet connectivity, a Florida-based startup is breaking new ground by enabling Bitcoin (BTC) Lightning Network transactions even when there’s no access to the web.","The company, called LNMesh, leverages local “mesh networks” to facilitate Bitcoin payments offline, crypto news outlet Decrypt reported on Thursday.","The idea behind LNMesh is to address scenarios where traditional internet access is unavailable or unreliable, such as in the aftermath of natural disasters or in remote regions with spotty connectivity.","The project has gained significant attention, particularly after researchers from Florida International University published a paper that explained their breakthrough titled “LNMesh: Who Said You Need Internet to Send Bitcoin? Offline Lightning Network Payments using Community Wireless Mesh Networks.”","Not surprisingly, the paper has also been shared between community members on X:","Many people are working on Bitcoin payment resilience in worst case scenarios.\n\nThis paper explores how wallets should open channels to each other in local community Wifi\/Bluetooth mesh so that payments still work despite internet disruption.https:\/\/t.co\/Tlq4izinuj pic.twitter.com\/0lElZ5BqAw","Mesh networks are decentralized communication networks where devices connect directly to one another via Bluetooth and Wi-Fi, creating a local network independent of the internet.","LNMesh capitalizes on this concept by establishing a local Lightning Network, which is a faster and cheaper layer built on top of the Bitcoin blockchain.","What’s remarkable about LNMesh is that it doesn’t require changes to the existing Lightning Network protocol or code.","Instead, the team behind the project set up a network of Bitcoin and Lightning nodes using low-cost Raspberry Pi computers, devices that are often used by Bitcoiners to run their nodes on.","These nodes were spread across their university campus and connected via a local mesh network using Bluetooth and Wi-Fi.","The experiments conducted by LNMesh researchers demonstrated that Lightning payments could be successfully sent between nodes using this offline approach.","Because Lightning payments occur off-chain, they don’t rely on the Bitcoin blockchain, allowing them to settle offline.","While the potential for offline Bitcoin transactions is exciting, there are still challenges to overcome.","One key issue is coordinating the opening of channels between users in an efficient manner. LNMesh explores methods to analyze users’ daily mobility patterns to determine the best channels to open, but this coordination process may need further automation for practical use.","Nevertheless, LNMesh’s breakthrough paves the way for Bitcoin to be used in situations where internet access is limited or nonexistent, offering a lifeline for those who rely on digital currency, even when the digital world goes offline.","The startup’s commitment to open-source development means that its code and research findings are available for others to explore and build upon, potentially ushering in a new era of decentralized offline payments."],"entity":[{"type":"Florida","content":"LOCATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Lightning Network Payments using Community Wireless Mesh Networks","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Florida International University","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Lightning Network"],"authors":["Fredrik Vold"]}