{"summary":"Ethereum-compatible Layer 1 blockchain Monad’s devnet has gone live having reached 10,000 transactions per second in internal testing.\nMonad’s public testnet is expected to follow shortly, with a mainnet release anticipated later in the year.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278182\/monad-10000-tps-devnet-launch","publishDate":"2024-03-14T11:21:57","id":2068,"type":null,"title":"Monad hits 10,000 TPS in testing as devnet goes live","category":["Crypto Ecosystems"],"content":["Ethereum-compatible Layer 1 Monad has launched its devnet having reached 10,000 transactions per second in internal testing.","\"Monad Devnet is live. 10,000 real TPS achieved on the EVM,\" the project <a href=\"https:\/\/x.com\/monad_xyz\/status\/1768291081303568879?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X. \"This is an important milestone for our team,\" Keone Hon, CEO and co-founder of Monad developer Monad Labs, told The Block.&nbsp;","Monad claims to have optimized the way Ethereum works to provide greater throughput — designed to offer up to 10,000 TPS with a one-second block time. However, this may be more challenging for node operators, with hardware requirements around twice as large compared to the main Ethereum blockchain.","Rather than simply cloning the Ethereum codebase, Monad <a href=\"https:\/\/www.theblock.co\/post\/211352\/monad-labs-funding-blockchain-former-jump-trading-developers\" data-v-f87c67ca=\"\">says<\/a> it’s building a new EVM from the ground up, using a pipelined architecture. This staggered approach, rather than carrying out each process one after the other, enables more efficient processing and instant block finality. Monad is also bytecode compatible, making it simple for Ethereum developers to port their existing decentralized applications to the blockchain.","The mon token will be used to pay for transactions to be included within blocks, known as a carriage cost, and for transactions to be executed, according to Monad's <a href=\"https:\/\/www.theblock.co\/post\/252757\/monad-token-name\" data-v-f87c67ca=\"\">technical documents<\/a> released in September. However, Monad later removed the token name from the documents for unspecified reasons.","Monad Labs was co-founded by former Jump Trading developers. Monad Labs previously <a href=\"https:\/\/www.theblock.co\/post\/211352\/monad-labs-funding-blockchain-former-jump-trading-developers\" data-v-f87c67ca=\"\">raised<\/a> $19 million in funding led by Dragonfly Capital following a $9 million pre-seed round in May 2022 and a $10 million seed round in December 2022. Earlier this week, it was reported that Monad Labs is eyeing a more than <a href=\"https:\/\/www.theblock.co\/post\/281816\/monad-labs-eyes-200-million-raise-led-by-paradigm-fortune\" data-v-f87c67ca=\"\">$200 million<\/a> fundraising round, led by venture capital firm Paradigm.","Monad’s public testnet is expected to follow shortly, with a mainnet release scheduled for later in the year. \"Load testing will continue before the phased release of permissioned testnet and public testnet,\" Hon added.","\"Monad is a deep engineering effort to deliver performant parallel EVM. We're excited to share our team's advances in parallel EVM execution and performant state access later this year,\" he said.","<em data-v-f87c67ca=\"\">Updated with comment from Keone Hon.<\/em>"],"hashtag":["ETHEREUM"]}