{"summary":"Chinese Court Hands 6-Year Prison Terms to Masterminds in $300 Million USDT Money Laundering Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chinese-court-hands-6-year-prison-terms-to-masterminds-in-300-million-usdt-money-laundering-case.htm","publishDate":"2023-11-02T05:04:35","id":20682,"type":null,"title":"Chinese Court Hands 6-Year Prison Terms to Masterminds in $300 Million USDT Money Laundering Case","category":["Altcoin News "],"content":["The Tongliang Court in China handed down sentences to 21 individuals, including key figures in a $300 million USDT money laundering case.","The massive crypto money laundering case, which spanned from November 2020 to late April 2021, revolved around the actions of the primary defendants, Jiang Moumou and Zheng Moumou.","Jian and Zheng recruited 19 additional members to carry out the money laundering scheme, with each individual having clearly defined roles and responsibilities.","Jiang Moumou received a prison sentence of six years and three months, coupled with a fine of 500,000 RMB ($68,000) for his role in concealing the proceeds of crime and criminal funds.","Zheng Moumou, another primary defendant, was sentenced to six years in prison and fined 500,000 RMB.","The remaining 19 individuals involved received fixed-term imprisonment sentences ranging from one to two years and six months, alongside monetary fines.","To avoid detection, the group circumvented online trading platforms and executed transactions at prices significantly deviating from market rates.","Their modus operandi involved collecting stablecoin USDT converted from the proceeds of various online crimes, including fraud and online gambling, committed by other criminals.","These ill-gotten gains were channeled through offline Bitpie collection wallets and then sold on virtual currency trading platforms.","To legitimize their transactions, the group fabricated reasons such as withdrawing project funds and migrant workers’ wages.","This allowed them to orchestrate cash withdrawals from bank counters across multiple provinces and cities, including Chongqing, Sichuan, and Shanghai.","The cash amounts ranged from hundreds of thousands to several million yuan per withdrawal.","Once the cash was secured, it was meticulously packed into trolley cases and backpacks, ready for transportation.","The funds were then shipped via plane to destinations in Fujian Province, specifically Xiamen and Anxi, where they were delivered to designated recipients. Each cash transfer amounted to tens of millions of yuan.","The operation’s staggering scope became apparent when it was revealed that the group had transferred over 2.25 billion yuan ($300 million) to overseas entities through this method.","Their cumulative profits from the elaborate money laundry scheme exceeded an astonishing 22.62 million yuan."],"entity":[{"type":"Sichuan","content":"LOCATION"},{"type":"several million yuan","content":"MONEY"},{"type":"April 2021","content":"DATE"},{"type":"Jiang Moumou","content":"PERSON"},{"type":"Chongqing","content":"LOCATION"},{"type":"Zheng Moumou","content":"PERSON"},{"type":"Xiamen","content":"LOCATION"},{"type":"Anxi","content":"LOCATION"},{"type":"Tongliang Court","content":"ORGANIZATION"},{"type":"$68,000","content":"MONEY"},{"type":"Fujian Province","content":"LOCATION"},{"type":"$300 million","content":"MONEY"},{"type":"Zheng","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"22.62 million yuan","content":"MONEY"},{"type":"November 2020","content":"DATE"},{"type":"2.25 billion yuan","content":"MONEY"}],"hashtag":["China","USDT"],"authors":["Jai Pratap"]}