{"summary":"Pudgy Penguins Unveils Web3 Game ‘Pudgy World’ Powered by zkSync Era","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pudgy-penguins-unveils-web3-game-pudgy-world-powered-by-zksync-era.htm","publishDate":"2023-12-11T12:25:38","id":20684,"type":null,"title":"Pudgy Penguins Unveils Web3 Game ‘Pudgy World’ Powered by zkSync Era","category":["NFT News "],"content":["Popular NFT project Pudgy Penguins has revealed the upcoming alpha launch of Pudgy World – a Web3 game based on the Ethereum Layer 2 network zkSync Era.","According to the press release, the alpha will launch in Q1 of 2024. With it, Pudgy Penguins moves beyond non-fungible token (NFT) collectibles to “a fully immersive entertainment and lifestyle brand.”","Players will be able to explore an open world and customize their unique penguin characters. They will participate in story-driven journeys and interact with each other.","The Pudgy World vision is simple. Build an open-world storytelling experience that is fun, playable by millions, and on-chain.","Here is a sneak peak of what’s to come: pic.twitter.com\/5FhhucJUxP","— Pudgy Penguins (@pudgypenguins) December 10, 2023","","Project Penguins went on to announce several firsts. It said that,","“The launch of Pudgy World plunges the company into Web3 gaming as the first-ever Web3 game with digital and physical collectibles.”","Furthermore, the team introduced two characters as Pudgy Penguins’ first “Hero Characters.” Pudgy and Peaches will guide the players and drive the game’s narrative.","In 2024, licensing Penguins from our community and featuring community-owned\nPenguins in products, animations, story, and more will ramp up with the launch of our IP licensing marketplace @OverpassIP. pic.twitter.com\/SetV0XSWaV","— Pudgy Penguins (@pudgypenguins) December 10, 2023","","Finally, the alpha will be a first-of-its-kind fusion of entertainment IP and zero-knowledge (ZK) blockchain technology, it said. This is “a vital step towards mass adoption of Web3 technology.”","To make the game a success, the team needed the right blockchain. It had to be reliable, easy to access, and built to scale.","SVP of Growth at Matter Labs Michael Lee commented that Pudgy World leverages zkSync’s ZK technology to “unlock new business models and gaming experiences, similar to the gaming industry’s transformative shift to mobile games.”","The team describes the new game as “an immersive, digital environment” available to Pudgy Penguins NFT holders, Pudgy Toy owners, and all “adventurous gamers.”","Per the announcement, players will not need to hold an NFT nor buy a toy to play the alpha version of Pudgy World.","However, holders may get certain benefits.","Each Pudgy Penguin toy comes with a QR code. Once scanned, it will allow the owner to claim unique traits for their digital Forever Pudgy Penguin character inside the game.","All toys are connected to existing pieces of NFT IP, so the current NFT holders will receive licensing royalties for each corresponding toy.","For our Pudgy Toy experience, you scan the included QR code, make an account, redeem your traits, and customize your Forever Pudgy Penguin.","In Q1 of 2024, this experience gets elevated with our Pudgy World Alpha launch, merging our physical and digital worlds into one. pic.twitter.com\/6GIpe8BwfQ","— Pudgy Penguins (@pudgypenguins) December 10, 2023","","Pudgy Penguins CEO Luca Netz said that, with owners playing with their Pudgy Toys, they will not need to have any knowledge of the blockchain technology the game is built on. This, he said, makes the Pudgy World alpha launch “a massive step forward” for the Web3 and NFT space.","There will be no trading between users at launch. Players can only get returns from the original sale. However, when Pudgy World “exits a later phase,” players will be able to participate in the Pudgy World game economy, it said.","According to Michael Lee,","“The launch of Pudgy World, in collaboration with Walmart, stands as a remarkable testament to the capabilities of our joint development teams. Whether you’re a seasoned NFT collector or venturing into crypto for the first time, Pudgy World aims to welcome millions of gamers into web3 to have fun, as well as forge lasting friendships.”","In September, Pudgy Penguins launched its toy line in over 2,000 Walmart stores across the US.","Are you ready to enter Pudgy World? pic.twitter.com\/y21TmOOvo2","— Luca Netz 🐧 (@LucaNetz) December 10, 2023","",""],"entity":[{"type":"Pudgy Penguin","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Pudgy World","content":"LOCATION"},{"type":"Pudgy World","content":"ORGANIZATION"},{"type":"Pudgy Penguins NFT","content":"ORGANIZATION"},{"type":"Luca Netz","content":"PERSON"},{"type":"Matter Labs Michael Lee","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Michael Lee","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"December 10, 2023","content":"DATE"}],"hashtag":["Gaming","NFT","Non-fungible tokens","Web3"],"authors":["Sead Fadilpašić"]}