{"summary":"Uniswap (UNI) Price Prediction 2022 – Time to Buy Uniswap?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uniswap-uni-price-prediction-2022-time-to-buy-uniswap.htm","publishDate":"2022-09-27T16:03:00","id":20697,"type":null,"title":"Uniswap (UNI) Price Prediction 2022 – Time to Buy Uniswap?","category":["Altcoin News "],"content":["Uniswap (UNI) has been gradually increasing in price over the last few months, and today has pumped over 13%. ","Being the leading decentralized exchange with $927 million in 24-hour volume, Uniswap (UNI) could potentially be undervalued at current prices. ","It seems accumulating Uniswap in June would have been a fantastic decision for most buyers in the crypto markets.","UNI has already recovered by over 90% from its low in June after Bitcoin pulled the markets down.","Uniswap is still one of the most reputable and promising decentralized exchanges and is doing very well to hold rank #17 on Coinmarketcap with a market capitalization of $4.96 billion. ","UNI prices in June 2022 were very similar to the bear market prices of November 2020 before Uniswap rocketed in price by over 2,000% to an all-time high of $44.95. ","As we can see from the charts above, UNI has been hit hard by the crypto winter, decreasing in value from the all-time high by over 92%. ","The market capitalization of Uniswap sits just below $5 billion dollars at present. This is in stark contrast to the all-time high, which was $22.57 billion back in May 2021. ","As there is more circulating supply now, we could see the market capital of Uniswap exceed the previous all-time high market cap. but still, have a lower trading price.","My prediction is that by the next crypto bull run, we might see a $40-50 billion dollar market cap. Uniswap with a trading price of around $40-50 depending on the circulating supply at the time. ","As you can see from the above price chart, Uniswap is still in a macro-downtrend and is yet to form any reassuring higher highs. ","Social analytics also suggest that Uniswap is currently trending across Twitter and most likely various other platforms.","Current price levels could be described as undervalued, and I would expect the price of UNI to chop between $4 and $9.50 for the remainder of the crypto winter. ",""],"entity":[{"type":"90%","content":"PERCENT"},{"type":"June 2022","content":"DATE"},{"type":"$44.95","content":"MONEY"},{"type":"92%","content":"PERCENT"},{"type":"$40","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"UNI","content":"ORGANIZATION"},{"type":"$5 billion dollars","content":"MONEY"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"$9.50","content":"MONEY"},{"type":"$927 million","content":"MONEY"},{"type":"$4","content":"MONEY"},{"type":"13%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"2,000%","content":"PERCENT"},{"type":"$22.57 billion","content":"MONEY"},{"type":"$4.96 billion","content":"MONEY"},{"type":"November 2020","content":"DATE"}],"hashtag":["Uniswap"],"authors":["Jacob Bury"]}