{"summary":"Here is How Crypto Community Reacted to Binance’s ‘Oopsi’ Swastika-Themed Failure","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/here-is-how-crypto-community-reacted-to-binances-oopsi-swastika-themed-failure.htm","publishDate":"2022-04-21T08:57:00","id":20691,"type":null,"title":"Here is How Crypto Community Reacted to Binance’s ‘Oopsi’ Swastika-Themed Failure","category":["Altcoin News "],"content":[" ","On April 20, which also coincidentally marked the birthday of Adolf Hitler, Binance unveiled and shortly after took down its new Twitter emoji due to its resemblance to a swastika.","In now-deleted tweets, both the official Twitter account of Binance and the account of the company’s CEO Changpeng Zhao (CZ) shared the new emoji which received a massive backlash. ","The new Binance emoji is a literal swastika pic.twitter.com\/lCOuWuPnyF","“Well that was obviously really embarrassing,” Binance later said. “We’re not sure how that emoji got through several layers of review without anyone noticing, but we immediately flagged the issue, pulled it down, and the new emoji design is being rolled out as we speak.”","However, pointing out a somehow similar incident from the past, when Binance announced it would distribute “GAS” tokens using a banner ad that displayed a six-pointed star, the same shape as the Star of David back in 2017, some users claimed it is “a lot to be just a coincidence.”","“Swastika, GAS written on a David star, all on Hitler’s Bday, that’s a lot to be just a coincidence. Either this is a prank some underpaid staff has made or inside job to damage company image,” one Twitter user said. ","What the actual f* is this #Binance ?\n\nSwastika, GAS written on a David star, all on #Hitler's Bday, that's a lot to be just a coincidence. Either this is a prank some underpaid staff has made or inside job to damage company image. Either way @cz_binance has some explaining to do pic.twitter.com\/XyiiqCo5ZQ","In their defense, some noted that the swastika means “well-being” in the ancient Indian language of Sanskrit. In Buddhism, the swastika symbolizes the feet, or the footprints, of the Buddha, and is commonly used in Hindu countries. ","“If you ever spend some time in Buddhist or Hindu countries, you’ll see variations of this symbol on every corner. People claiming to be multi-cultural, yet view everything through a Eurocentric eye,” a Twitter user said. ","in their defense… pic.twitter.com\/TaudfyBSdi","However, in the West, the symbol is primarily recognized for its use by the Nazi party, responsible for the genocide of European Jews during World War II.","“Yeah, but when a symbol is used for hate, killing, torturing etc it carries a meaning bigger than the original one. The least we could do is avoiding using, in particular in a context not related to religion. It is hard to believe it was an innocent mistake on Hitler’s birthday,” another Twitter user said. ","Known as hashflags, which are simply hashtags followed by emojis, these are enabled on Twitter for specific occasions or events. However, companies can also create their own, but they will have to pay for it – which can cost more than USD 1m. \n____","Swastikas are a religious sign of good fortune, toothbrush mustaches are a trademark of Charlie Chaplin, and \"Adolf\" is an ancient Germanic name meaning \"Noble Wolf.\" Or, rather than fighting for cursed hate symbols, you could just… not? Some things are too late to reclaim.","🤣🤣🤣\nBinance layers of review be like pic.twitter.com\/B4vH0jInHR","pic.twitter.com\/wLOjXFIGAq","Not a swastika. But what the mind and heart is full of, the eyes will see…..","pic.twitter.com\/X5h5ZabOH7","_____\nLearn more: \n– Binance Wins Day in Court, US Judge Dismisses Lawsuit\n– Dorsey Justifies His Pro-Bitcoin Stance, Says He Is ‘Not Trolling’ Ethereum\n\n– Binance, FTX Expand To Arab Gulf States With New Licenses\n– BNB Won’t Hit ATH This Year but Might Reach USD 2,500 by 2030 – Survey"],"entity":[{"type":"2017","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Binance Wins Day in Court","content":"ORGANIZATION"},{"type":"April 20","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Adolf Hitler","content":"PERSON"},{"type":"Charlie Chaplin","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wolf","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Hitler’s Bday","content":"PERSON"},{"type":"TaudfyBSdi","content":"ORGANIZATION"},{"type":"West","content":"LOCATION"}],"hashtag":["Binance","Community","Exchange","Marketing"],"authors":["Ruholamin Haqshanas"]}