{"summary":"Polygon Labs Lays Off 19% of Staff Following Restructuring, Increases Workers’ Pay by 15%","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/polygon-labs-lays-off-19-of-staff-following-restructuring-increases-workers-pay-by-15.htm","publishDate":"2024-02-01T21:11:58","id":20698,"type":null,"title":"Polygon Labs Lays Off 19% of Staff Following Restructuring, Increases Workers’ Pay by 15%","category":["Blockchain News "],"content":["Polygon blockchain developer Polygon Labs has cut 19% off its workforce, according to a blog post published by CEO Marc Boiron on Thursday.","Boiron called the decision “difficult, but necessary” to ensure the team’s “extreme focus, diligence, efficiency and agility.”","He claimed the company’s “rapid growth” due to the most recent bull market “diluted” the aforementioned qualities, prompting Polygon Labs to cut a total of 60 people on Thursday.","“Right-sizing for the sake of enhanced performance, rather than for financial reasons, may seem unconventional,” Boiron said. “The reality is that achieving our mission often demands challenging decisions, and while difficult, the Founders and I agree that we must move forward in a thoughtful way that gives us the greatest chance to execute successfully.”","News of Thursday’s layoffs parallels those Polygon Labs made nearly one year ago when the company laid off  20% of its employees.","The company was faced with another shakeup in July 2023 when former Polygon Labs president Ryan Wyatt stepped down from his position. Boiron, who took over the role shortly after, previously served as chief legal officer for Polygon Labs as well as the decentralized exchange dYdX.","Despite the company’s most recent layoffs, remaining employees will receive a 15% increase in their compensation. Those laid off are set to receive two months of severance and health benefits.","“To move as ambitiously and nimbly as possible where everyone is able to take ownership of what they’re doing, we must create an efficient surgical team, with significantly less bureaucracy,” Boiron said. “As a smaller team, we can collaborate more, expedite demanding projects, and execute at our highest potential.”","","Saying goodbye to friends and colleagues is always very painful, but this was a necessary step to take Polygon Labs back to its 'underdog' roots. This makes us lighter, nimbler and more mission focused.","Our relentless focus is to build the Planetary scale blockchain network for…","— Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) February 1, 2024","","In addition to cutting members of the team, Boiron announced Polygon ID will spin off into its own separate entity of 33 employees.","“Saying goodbye to friends and colleagues is always very painful, but this was a necessary step to take Polygon Labs back to its ‘underdog’ roots,” Polygon co-founder, Sandeep Nailwal, posted to X.","According to Nailwal, Polygon Labs will have an estimated 220 employees remaining following the layoffs.","“When I started the role of CEO, I pledged to make you all the happiest employees in the world,” Boiron shared. “While that goal will never cease to be my North Star, it pains me that I failed to make that happen for many of our teammates.”"],"entity":[{"type":"Thursday","content":"DATE"},{"type":"February 1, 2024","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"Nailwal","content":"ORGANIZATION"},{"type":"Ryan Wyatt","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"19%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"North Star","content":"LOCATION"},{"type":"July 2023","content":"DATE"}],"hashtag":["Polygon","Polygon Lab"],"authors":["Julia Smith"]}