{"summary":"#LUNAClassic Trending on Twitter as (LUNC) Up Over 1,000% since June","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/luna-classic-trending-on-twitter-as-lunc-up.htm","publishDate":"2022-09-06T11:58:00","id":20695,"type":null,"title":"#LUNAClassic Trending on Twitter as (LUNC) Up Over 1,000% since June","category":["Altcoin News "],"content":["Terra Luna Classic (LUNC) is outshining the rest of the crypto market at the moment as it is now up over 80% in September due to the token burn news. ","It seems Terra Luna Classic is having a bull market of its own at the moment, and has already risen over 1,000% since June 2022. ","Currently trading at $0.0004101 holders and traders speculate that $0.0005 will soon be on the way. The catalyst of this positive price action is due to the proposal to deploy a 1.2% token burn on every LUNC transaction which is why the price has soared. ","The market capital for LUNC now sits at $2.5 billion and there is no doubt that the bulls will be chasing the $3 billion mark.","One of the most popular crypto Twitter traders @follis_ discovered #LUNAClassic was trending last week as the price had increased over 200% from the June lows. ","Terra Luna Classic heavily relies on its community which has recently been adding massive value to the network (similar to a meme coin). ","Looking at Binance’s LUNC\/BUSD spot trading pair the 2022 low was on the 9th June at $0.000041. This was the golden opportunity to realize over 1,000% gains if you bought that particular low. ","It leads you to wonder how much higher can Terra Luna Classic (LUNC) really go from here, we have already seen a whopping 10x during a crypto bear market. As the price rises the upside potential reduces and the risk gets higher for new holders. ","Unfortunately, many retail investors with lack of trading experience are expecting the price to rocket to $1. This is technically not possible as the market capital would have to exceed $6 trillion. This is over six times the total crypto market capital valuation.","Could 1.2% transaction burns and Twitter trends really accommodate such an increase in price? Probably not. ","Tamadoge is selling out it’s presale fast and now has over 53,000 Twitter followers @Tamadogecoin. You can learn more about the Tamadoge roadmap and white paper by clicking here.",""],"entity":[{"type":"Terra Luna Classic","content":"ORGANIZATION"},{"type":"June 2022","content":"DATE"},{"type":"$0.0005","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"1,000%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"200%","content":"PERCENT"},{"type":"$3 billion mark","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"9th June","content":"DATE"},{"type":"$6 trillion","content":"MONEY"},{"type":"$0.000041","content":"MONEY"},{"type":"$0.0004101","content":"MONEY"}],"hashtag":["Luna","LUNC","Terra","Terra Luna Classic"],"authors":["Jacob Bury"]}