{"summary":"Frankfurt Stock Exchange to Look Into Digital Platforms for Expansion of Asset Classes","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/frankfurt-stock-exchange-to-look-into-digital-platforms-for-expansion-of-asset-classes.htm","publishDate":"2023-11-09T20:18:41","id":20696,"type":null,"title":"Frankfurt Stock Exchange to Look Into Digital Platforms for Expansion of Asset Classes","category":["Blockchain News "],"content":["The Frankfurt Stock Exchange has listed the creation of a digital asset platform making development areas of its “Horizon 2026” strategy.","In a recent press release, Deutsche Borse,  owner of the Frankfurt Stock Exchange gave an insight into its plans for growth, investment, and onboarding institutional investors as it looks towards 2026.","Part of its master plan includes making inroads into digital assets by creating platforms for trading as well as increasing its asset classes and registry. Most users feel the move will add to the growing rate of adoption in Europe as the firm is keen on prioritizing crypto in the next few years.","“Deutsche Börse is a leader in the area of ​​digital applications. In the long term, there is further growth potential from new technologies through the digitalization of existing or new asset classes and corresponding trading and settlement platforms.”","The exchange plans a continued 7% growth until 2026 and the acquisition of new firms to boost its growth ratio. Furthermore, it plans a new capital management scheme and shares buybacks with 300 million euros as it grows.","As it expands its leading position in digital platforms, the exchange highlights the potential use of new technologies to streamline the digitization of asset classes and create better trading and settlement systems.","The company explained that Clearstream’s D7 digital post-trading platform is meant for investible and tradable instruments and will roll out shortly.","“The necessary basic investments are already included in the Horizon 2026 strategy, while the long-term positive effects on the group’s revenue are conservatively not included.”","The Frankfurt Stock Exchange recorded digital assets in 2021 when Deutsche Börse Xetra listed a Litecoin (LTC) traded product from the ETC Group. Boerse Stuttgart, another exchange in Germany started crypto trading last year.","The exchange plans to ensure and fast-track tokenization and its related trading activities to institutional investors. In the past months, as Europe’s numbers surged, Germany has ranked high in digital asset fund inflows from institutional investors.","This year has seen Europe record an increasing number of institutional investors and crypto firms than most regions. Several analysts have tipped a better regulatory environment than what is obtainable in North America as a huge factor for the recent surge.","The signing of the Markets in Crypto Assets (MiCA) changes the narrative as all stakeholders are now keen on their responsibilities and powers. This growth is also seen around Asian markets with regulation being prioritized."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2026","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"Frankfurt Stock Exchange","content":"ORGANIZATION"},{"type":"Deutsche Borse","content":"ORGANIZATION"},{"type":"Stuttgart","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Deutsche Börse Xetra","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Deutsche Börse","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"}],"hashtag":["Blockchain","Germany"],"authors":["David Pokima"]}