{"summary":"Queensland’s CCC Aims to Modernize Confiscation Laws to Facilitate “Effective” Seizure of Crypto Assets","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/queenslands-ccc-aims-to-modernize-confiscation-laws-to-facilitate-effective-seizure-of-crypto-assets.htm","publishDate":"2024-04-10T14:19:19","id":20693,"type":null,"title":"Queensland’s CCC Aims to Modernize Confiscation Laws to Facilitate “Effective” Seizure of Crypto Assets","category":["Altcoin News "],"content":["Queensland’s Crime and Corruption Commission (CCC) has identified gaps in state laws that inadvertently encourage criminal use of digital assets, prompting the agency to propose a modernization of Queensland’s asset confiscation laws.","In a 54-page report, the CCC expressed concerns about the effectiveness of Queensland’s Criminal Proceeds Confiscation Act 2002 (CPCA) in seizing cryptocurrencies linked to organized crimes, such as money laundering. ","In response, the commission called for significant reforms to the act, with a focus on achieving seven priority outcomes, three of which directly address the need for the effective seizure of digital assets. ","The CCC highlighted the increasing prevalence of digital assets in the criminal landscape and the inadequacy of the current legislation in dealing with this emerging form of criminal activity.","“Digital assets are expected to continue to proliferate as the criminal environment increasingly becomes less physical, and the CPCA less effective for dealing with digital assets.”","The CCC emphasized the importance of updating the CPCA to remain relevant and effective in a changing criminal environment. ","Presently, there are no provisions within Queensland’s legislative framework that enable investigative agencies to facilitate the seizure of digital assets effectively.","The inability to seize digital assets impedes Queensland’s ability to gather evidence, establish ownership, and manage the storage and transfers of digital assets, among other challenges. ","To address these issues, the CCC recommended various reforms, including defining “digital assets” and incorporating them into money laundering laws. ","Additionally, the commission suggested converting seized assets into stable currencies during legal proceedings and implementing automatic forfeitures.","In a related development, Alan Kirkland, Commissioner of the Australian Securities and Investments Commission (ASIC), recently unveiled a strategy aimed at fostering responsible financial innovation. ","ASIC Commissioner Alan Kirkland spoke at @blockchain_apac Policy Week on 20 March, setting out our approach to innovation, regulatory reforms and enforcement in the #crypto sector https:\/\/t.co\/GECpccMAV7 pic.twitter.com\/8qggaPQwPp","— ASIC Media (@asicmedia) March 20, 2024","","Kirkland highlighted the need to address the “regulatory trilemma” associated with financial innovations, which involves balancing consumer protection, market integrity, and the promotion of financial innovation. ","He believes that ASIC’s approach to innovation and effective regulation can mitigate risks and help drive the wider adoption of digital assets.","Countries around the world are increasingly considering confiscating crypto assets for debt collection from taxpayers. ","Just recently, South Korean tax officials in the city of Pohang revealed plans to seize crypto from 5,208 residents who failed to pay local taxes.","Per local reports, the individuals have all evaded local tax bills worth $370 or above.","The drive saw tax officials seize almost $29 million in coins and fiat in 2023.","Likewise, the Spanish Ministry of Finance aims to enable the seizure of digital assets as a means to settle tax debts.","Under the leadership of María Jesús Montero, the ministry is currently working on legislative reforms to the General Tax Law, with a specific focus on Article 162.","The proposed changes would grant the Spanish Tax Agency the authority to identify and take control of crypto assets owned by taxpayers who have outstanding debts."],"entity":[{"type":"María Jesús Montero","content":"PERSON"},{"type":"South Korean","content":"LOCATION"},{"type":"Spanish Ministry of Finance","content":"ORGANIZATION"},{"type":"CCC","content":"ORGANIZATION"},{"type":"Australian Securities and Investments Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$29 million","content":"MONEY"},{"type":"Queensland","content":"LOCATION"},{"type":"Corruption Commission (CCC","content":"ORGANIZATION"},{"type":"Alan Kirkland","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"March 20, 2024","content":"DATE"},{"type":"$370","content":"MONEY"}],"hashtag":["Crypto Regulation","Regulations"],"authors":["Ruholamin Haqshanas"]}