{"summary":"XRP Price Prediction – Can XRP Surge 30% This Week","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-price-prediction-can-xrp-surge-30-week.htm","publishDate":"2022-10-17T12:37:00","id":20704,"type":null,"title":"XRP Price Prediction – Can XRP Surge 30% This Week","category":["Altcoin News "],"content":["\nXRP price is in limbo, awaiting the outcome of the SEC vs. Ripple lawsuit. Since mid-September, the cross-border money remittance token has outperformed many of the other altcoins in the market. However, XRP price has since encountered immense selling at $0.5312, trimming gains to exchange hands at $0.4677 at the time of writing.","Despite XRP’s ongoing retracement, its technical and macro outlooks remain strong and positive. ","The SEC (Securities and Exchange Commission) lawsuit against Ripple Labs and its top executives is inching to a close. Brad Garlinghouse, the CEO of Ripple Labs, expects the curtains to close on the case by no later than early 2023.","XRP price has waded through the mud since the case started, with top cryptocurrency exchanges like Coinbase delisting it. The international money remittance token failed to surpass its all-time high as the majority of crypto assets in the market set new historical highs in 2021.","However, XRP price turned the tables mid-September – and rallied approximately 78% from $0.3133 to $0.5594. Investors and analysts are optimistic about XRP price lifting to $1.00 in the coming weeks. A positive outcome from the lawsuit, which is seeming increasingly likely, could send the XRP price past its all-time of $3.84 set five years ago.","XRP price is hovering around $0.4677 at the time of writing – holding firmly to support given by the rising trendline. If this support stays in place, recovery will ensue, pointing the price to a 20.45% breakout (measured from the breakout point, the x-axis).","XRP price will then look to move an additional 14%, the distance from the current market price to the x-axis. A rising triangle is bullish and appears after a significant upside move in price followed by a consolidation period. The hypotenuse shows buyers are getting stronger by the day, while the x-axis represents stubborn sellers.","XRP\/USD eight-hour chart","The tug-of-war between bears and bulls will continue until the XRP price moves above the triangle pattern. Usually, the breakout is accompanied by a high trading volume creating an optimum environment for a rally.","The Finder’s panel, which takes insight from industry leaders, is back at it again, forecasting a jump in XRP price to $3.81 by December 2022. One of the most bullish panelists is Craig Cobb. He believes that XRP price will close the year at $1 as long as the SEC loses the case.","“The crypto market loves to jump on a bandwagon and XRP winning its case in a bear market could likely see herd mentality which will pump the price of this old-school top-10 coin.”","Martin Froehler, the current CEO at Morpher, reckons this is the time to buy XRP, with Ripple staring at a win from the lawsuit. Froehler is very optimistic toward XRP with a target of $5 by 2025 if XRP bags the case.","“It’s a huge win for the entire crypto industry.”","If Ripple loses the lawsuit, the company will likely choose to move to a different jurisdiction, according to a past communication by the CEO, Brad Garlinghouse. ","For those traders that maybe can’t wait another few months for big gains, there are a number of smaller altcoins that have been beating the market in recent weeks, with presale tokens proving particularly lucrative. One promising new coin in this area is Impact Project (IMPT), a decentralized carbon credits marketplace that began its sale around two weeks ago.","Based on the Ethereum blockchain, it provides users with the ability to trade NFT-based carbon offsets, while it will also enable consumers to shop online with retailers that support green initiatives. At a time when ESG investing is becoming a big thing, it has the fundamentals to perform well.\n\nThe presale has sold nearly half of its tokens in less than two weeks after raising $5 million. The next stage will see the price of the token rising from $0.018 to $0.023, so interested users may want to hurry to be in with the chance of getting in at the lowest price.\n\nVisit IMPT Now\n\nRead more:\nXRP Price Prediction – Can XRP Hit $10 After Its Court Case","XRP Price Prediction – If This Chart is Right, XRP is the Best Opportunity for 10x Gains in Crypto Now"," "],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"78%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"Martin Froehler","content":"PERSON"},{"type":"$0.3133","content":"MONEY"},{"type":"$0.5312","content":"MONEY"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"$5","content":"MONEY"},{"type":"ESG","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.00","content":"MONEY"},{"type":"Crypto Now","content":"LOCATION"},{"type":"Craig Cobb","content":"PERSON"},{"type":"XRP","content":"ORGANIZATION"},{"type":"$0.018","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"Morpher","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20.45%","content":"PERCENT"},{"type":"$0.4677","content":"MONEY"},{"type":"$3.84","content":"MONEY"},{"type":"SEC (Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$3.81","content":"MONEY"},{"type":"$0.5594","content":"MONEY"},{"type":"14%","content":"PERCENT"},{"type":"December 2022","content":"DATE"},{"type":"$0.023","content":"MONEY"}],"hashtag":["Ripple","XRP"],"authors":["John Isige"]}