{"summary":"Hayes Asks ‘Forgiveness’ for Calling Ethereum a Shitcoin, Doubles Down on ETH","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hayes-asks-forgiveness-for-calling-ethereum-shitcoin-doubles-down-eth.htm","publishDate":"2022-08-05T09:18:00","id":20706,"type":null,"title":"Hayes Asks ‘Forgiveness’ for Calling Ethereum a Shitcoin, Doubles Down on ETH","category":["Ethereum News "],"content":[" ","Former BitMEX CEO Arthur Hayes apologized for calling Ethereum (ETH) a shitcoin years ago and argued that the Merge is “extremely bullish” for the price of ETH.","In his latest essay, Hayes took a look back at his previous statements on Ethereum, as well as a look forward to discuss the upcoming, long-awaited, and much-anticipated Merge, when Ethereum will switch from the current proof-of-work (PoW) consensus mechanism to proof-of-stake (PoS).","As for the past, he apologized for his earlier statements, saying:","“Readers who have been following my career as an essayist will remember I shat all over the Ethereum pre-sale. I said it was worthless. I was wrong. Please forgive me, o lord!”","He referred to his 2018 essay titled “Ether, A Double Digit Shitcoin”, in which he predicted that the price of ETH would dive below USD 100, saying: “And I was right! For a short while…”","In his words, Hayes “became a believer” in 2020, and he went “long and strong” when he saw a chart depicting how the ETH market capitalization was less than the total market capitalization of all the dapps (decentralized apps) it supported.","“I fervently believe that DeFi offers a credible alternative to the current financial system — and for now, Ethereum is poised to power the world’s financial computer.”","He argued that the Merge is “extremely bullish” for the price of ETH – but also that it has not yet been priced into the market, writing:","“Given all of the forced selling that occurred during the market drop and the poor financial positions that most crypto investors have been left in, the [M]erge does not appear to be priced in– and we have an amazing opportunity to increase Ether positions at very attractive levels.”","Hayes went on to say that he is “more confident today than ever before that the merge will actually occur,” particularly as the miners are “becoming vocal about [its] negative impacts.”","While he said he hasn’t the technical skills to asses whether the Merge will indeed occur in September as estimated, Hayes stressed that “one group of Ethereum network stakeholders who absolutely can handicap the likelihood of success [is] the current crop of Ethereum miners.”","After the Merge, the Ethereum miners’ machines will become worthless unless they can mine on another valuable chain. As a well-known miner Chandler Guo already talked about an Ethereum hard fork, one that would keep a PoW chain, Hayes claimed to have made contact with other Chinese miners who confirmed that this idea is strong in that particular base.","In April, Hayes hinted he might rebalance his investments away from bitcoin (BTC) and in favor of ETH, arguing “a massive wall of money” will enter ETH once it is seen as an ESG (environmental, social, and governance)-friendly, yield-bearing asset. “When the dust settles at year-end, I believe ETH will be trading north of USD 10,000,” he said. In the latest essay, Hayes reiterated the USD 10,000 prediction but didn’t specify when it might happen.","At 09:16 UTC, ETH trades at USD 1,658 and is up 2% in a day and down 4% in a week. The price jumped 46% in a month, trimming its annual losses to 39%.","____","Learn more:\n– If Ethereum Splits, Leading Exchanges are ‘Likely’ to List ETHPoW Token – BitMEX\n– Vitalik Buterin says The Merge is Not ‘Priced in’ as Investor Promises to Fork Ethereum\n\n– Major Bitcoin & Crypto Companies Warn of ‘Extreme’ Risk in Proof-of-Stake Systems\n– The Compromises and Benefits of Ethereum Switching to a Proof-of-Stake Network\n\n– 6 Key Points in Vitalik Buterin’s Vision for Ethereum Presented at EthCC\n– As Bitcoin Keeps Tanking, Arthur Hayes Joins Chorus of USD 1M BTC Predictors and Warns of ‘The Doom Loop’\n\n– Next 6-12 Months to be ‘Brutal’, but Investment ‘Planting Season’ Starts Now, Arthur Hayes Says\n– Crypto Selloff Proves Computer Code Leads To ‘Better Outcome’ Than Human Discretion – Arthur Hayes"],"entity":[{"type":"Hayes","content":"PERSON"},{"type":"2%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12 Months","content":"DATE"},{"type":"Chandler Guo","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"39%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"Fork Ethereum\n\n– Major Bitcoin & Crypto Companies Warn of ‘Extreme","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"ESG","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Vitalik Buterin’s Vision","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"USD 1M BTC","content":"ORGANIZATION"}],"hashtag":["Arthur Hayes","Ethereum","Forecast","Proof-of-stake","Proof-of-work"],"authors":["Sead Fadilpašić"]}