{"summary":"An artist in South Carolina is “tokenizing” his body \nThat is to say, he’s letting would-be token buyers pay for tattoos on certain parts of his body. ","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78148\/artist-tokenize-tattoos","publishDate":"2020-09-18T12:46:00","id":2070,"type":null,"title":"This artist is tokenizing his body, selling tattoo &#x27;lots&#x27; for stablecoins","category":["Ethereum"],"content":["It's no secret that Crypto Twitter is a pretty wild — and at times bizarre — place, and it might have just gotten a little weirder.&nbsp;","South Carolina-based artist <a href=\"https:\/\/twitter.com\/shitcoinhodler\" data-v-f87c67ca=\"\">@shitcoinhodler<\/a>, who goes by the name \"Bishop,\" is tokenizing himself by selling different parts of his body for what he is calling people's \"tattooing pleasure.\"&nbsp;","In a series of tweets <a href=\"https:\/\/twitter.com\/shitcoinhodler\/status\/1306237318932635648\" data-v-f87c67ca=\"\">posted<\/a> earlier this week, Bishop shared a link to his <a href=\"https:\/\/app.rarible.com\/jfcbishop\" data-v-f87c67ca=\"\">profile<\/a> on Rarible, a marketplace where artists can create and sell digital collectibles using blockchain, on which he posted photos of different \"lots,\" or locations on his body.&nbsp;","\"Let me be your canvas,\" he wrote.","Bishop marks off locations on his body and tokenizes them like real estate lots. The&nbsp;rules are pretty simple: customers must buy the lot they are interested in and pay for construction, which means they can decide on the tattoo design and also must pay for Bishop to get it done. Customers can make payments in DAI, USDT, sUSD or USDc, and the tattoos will be created at Blu Gorilla Tattoo in Charleston, South Carolina. Customers must pay for the tattoo in advance.&nbsp;","\"I will do requests, but I’m not going to do my face or anything, although I have already been asked for forehead and unmentionables,\" Bishop told The Block. \"Maybe it was a joke... maybe I would tattoo the unmentionables for say... $250,000, but not the forehead.\"","Bishop said he came up with the idea when Twitter user <a href=\"https:\/\/twitter.com\/bluekirbyfi\" data-v-f87c67ca=\"\">@bluekirbyfi<\/a> offered 0.01YFI to whoever would tattoo his avatar on themselves. Bishop ended up taking the deal and getting the tattoo. Later in a Rarible Telegram conversation, someone suggested he take the plunge and fully tokenize.&nbsp;","The concept of so-called \"personal tokens\" isn't new. In April, crypto entrepreneur Alex Masmej made <a href=\"https:\/\/www.theblockcrypto.com\/post\/61699\/this-crypto-entrepreneur-just-sold-20000-worth-of-personal-tokens-on-ethereum\" data-v-f87c67ca=\"\">$20,000<\/a> by selling personal tokens on the Ethereum blockchain, which he plans to use to build a new decentralized finance (DeFi) savings startup in Silicon Valley. Last year, designer Matthew Vernon created 100 tokens that represented 100 hours of his time.","So far, Bishop has sold a few lots, mostly to artists from the non-fungible tokens (NFT) art community. His most expensive sale so far? A tattoo on his chest for 2 ETH (around $768).&nbsp;","Bishop said he plans to section off his back and front torso for minting soon, as well as his neck-to-waist. Bishop plans to go out-of-state to get some of these tattoos because it is illegal to get neck, head and face tattoos in South Carolina.&nbsp;","\"I’m not sure if there’s anything else I’m looking to accomplish,\" he said. \"Why do it? Because I can, and nobody else has.\""],"hashtag":[]}