{"summary":"Bitcoin ETF is Fully Priced In, Argues Analyst Glen Goodman","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-etf-is-fully-priced-in-argues-analyst-glen-goodman.htm","publishDate":"2024-01-03T11:55:15","id":20714,"type":null,"title":"Bitcoin ETF is Fully Priced In, Argues Analyst Glen Goodman","category":["Bitcoin News "],"content":["In a recent interview, analyst Glen Goodman, author of The Crypto Trader, discussed if a spot Bitcoin exchange-traded fund (ETF) is priced in, and what could happen if the “unknown factor”, Gary Gensler, decides to delay it.","The market eagerly awaits the US Securities and Exchange (SEC)’s decision on approving a Bitcoin ETF.","Talking to Bloomberg on Tuesday, Goodman argued that nearly everyone has “bought into” the idea that an ETF is coming.","He stated that,","“When it comes to it being priced in, I’d say it’s pretty fully priced in, probably.”","But there is a bit of a lose-lose situation, he argued. While priced in if the approval indeed comes, what happens if it doesn’t?","Discussing how the SEC Chair Gary Gensler is known for cracking down on the crypto industry, Goodman stated: “Absolutely! That’s the one factor I think that people are forgetting here.”","He implied that Gensler’s dislike for all things crypto is not to be underestimated.","There are positive signs that may suggest that the approval is all but signed. This includes recent talks between the SEC officials and the ETF hopefuls.","“But Gary Gensler, we know, he never has anything good to say about crypto, does he? So he is the unknown factor in all this. And frankly, he is the boss.”","Goodman argued that Gensler may require the applicants to do more work, which may delay the approval.","As an example, Goodman gave the custody and trading separation on exchanges recently discussed by Steve Scott and AJ Nary of digital asset custody firm BitGo.","Asked how far bitcoin could drop if there is no approval soon, Goodman stated that,","“If we get the impression from [the SEC] that the delay is open-ended as opposed to just ‘oh, we just want a few final things done,’ then it could be really bad.”","Bitcoin, as seen before, is capable of “absolutely terrifying falls” that wipe out months of gains.","Looking at the futures funding rates on crypto exchanges, Goodman said, “there are quite frothy levels.” Many people are borrowing a lot of money now to buy BTC.","So if it did start falling, there could be a domino effect where accounts start getting liquidated because people have overstretched themselves “on the old leverage.”","While he personally is not selling, Goodman has “lightened up” his holdings after staying long for a while.","The price may continue to be influenced by the ETF excitement – assuming it gets approved. However, “the risk-reward is not looking so great at this level,” he opined.","He stressed, though, that this is just a short-term theory. BTC is known for its ability to drop and then jump back up just as fast.","Looking at it long-term, a Bitcoin ETF approval is “fantastic news,” as many experts have noted.","Meanwhile, other drivers for 2024, Goodman opined, include gaming, artificial intelligence (AI), and decentralised social media."],"entity":[{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"Goodman","content":"PERSON"},{"type":"Glen Goodman","content":"PERSON"},{"type":"US Securities and Exchange (SEC","content":"ORGANIZATION"},{"type":"AJ Nary","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Steve Scott","content":"PERSON"}],"hashtag":["Bitcoin ETF","Market","SEC"],"authors":["Sead Fadilpašić"]}