{"summary":"OKEx First Token Sale Lasted ‘One Second’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/okex-first-token-sale-lasted-one-second-3670.htm","publishDate":"2019-04-10T14:08:00","id":20722,"type":null,"title":"OKEx First Token Sale Lasted ‘One Second’","category":["Altcoin News "],"content":["Major cryptocurrency exchange OKEx just held its first token sale for the Blockcloud project and its native BLOC token on the OK Jumpstart platform, selling out their stash in a single second, according to a tweet from the exchange’s official Twitter account. Token trades are starting today.","Blockcloud is a blockchain-based TCP\/IP architecture, where TCP\/IP is a suite of communication protocols used to interconnect network devices on the internet. “Combining the advantages of blockchain and Future Internet technology, it reconstructs the technology layers below where current blockchain networks and Internet applications operate,” explains the project’s website.","The exchange rate for this sale was announced to be 1 OKB = 400 BLOC, with the price of OKB being around USD 2. The total supply for the session was announced to be 500 million BLOC tokens, which would mean that the team raised USD 2.5 million according to this rate.","Users could subscribe for a minimum of 100,000 BLOC, which would cost them around USD 500, or they could go as high as a million BLOC tokens (USD 5,000). Holders are able to trade their BLOC against the exchange’s native OKB token since 2:00 UTC today, while the BLOC\/USDT pairing should become available tomorrow, April 11th, at 3:00 UTC.","OKEx has not yet released details about the sale, other than tweeting that the oversubscription limit was reached within a single second. They have also not replied to our request for comment as of press time.","OKEx had previously announced a token sale method that is different than the ones on other cryptocurrency exchanges. Instead of users rushing to buy tokens, they have to subscribe, or lock in, the amount of OKB they’re willing to spend on the token sale, as well as hold at least 500 OKB daily (ideally 2,500 OKB to reach the maximum available coefficient) for a week leading up to the sale.","The oversubscription limit is announced before the token sale, and as soon as it is reached, the subscription session – which lasts for a maximum of 30 minutes – ends, and the allotment begins. Then, according to the amount that users locked in, as well as the amount of OKB they held during the week, the total supply of the token being sold is distributed – the exact formula is available on the company’s website.","OKEx joins the club of lightning-fast token sales along with cryptocurrency exchange Bittrex, where the token sale of VeriBlock tokens took a mere 10 seconds, beating even competing exchange Binance’s speed of 22 seconds for the Fetch.AI token."],"entity":[{"type":"TCP","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"OKB","content":"ORGANIZATION"},{"type":"April 11th","content":"DATE"}],"hashtag":["Exchange","OKEx"],"authors":["Sead Fadilpašić"]}