{"summary":"Polkadot is considering efforts to create guidelines that other projects can use to replicate its reported success in dealing with the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211039\/polkadot-mulls-research-into-token-morphism-amid-regulatory-crackdown","publishDate":"2023-02-13T10:02:37","id":2072,"type":null,"title":"Polkadot mulls research into &#x27;token morphism&#x27; amid regulatory crackdown","category":["CRYPTO ECOSYSTEMS"],"content":["The Polkadot community is looking into conducting a research study centered around “token morphism,” a term used to describe the process that was used to transform the protocol's native dot token from a security into software.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPolkadot announced that it <a href=\"https:\/\/www.theblock.co\/post\/183283\/polkadot-backers-say-sec-should-no-longer-treat-token-as-a-security\" data-v-f87c67ca=\"\">achieved token morphism<\/a> in November 2022, a process it said was the direct result of three years of dialogue with the U.S. Securities and Exchange Commission. Now, the project is <a href=\"https:\/\/forum.polkadot.network\/t\/polkadot-purple-paper-token-morphism-guidelines\/2023\" data-v-f87c67ca=\"\">considering<\/a> funding a study that will explore how it managed the feat, according to a post on its governance forum.","The proposed purple paper will offer guidelines on token morphism for Polkadot and the wider crypto ecosystem, the proposal stated. It comes amid increasing regulatory scrutiny from the SEC and other regulators, including enforcement actions against <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">stablecoin issuer Paxos<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">crypto exchange Kraken<\/a> this month that have spurred fears of <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">sweeping enforcement actions<\/a> targeted at the broader crypto space in the U.S.","The proposal requested 14,776.74 dot tokens ($90,000) to sponsor the research. This funding will cover the work done by team members and ad hoc subject matter experts that include several of the people who were part of Polkadot’s dialogue with the SEC. The proposal asked for the funds to be delivered in two installments of 7,388.37 dot each.","While Polkadot has previously claimed success in its interactions with the SEC, the regulator has not publicly confirmed any such regulatory approval. The Web3 Foundation, which funds the development of the Polkadot ecosystem, did not immediately respond to a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$90,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"}],"hashtag":["SEC"],"authors":["Osato Avan-Nomayo","The Block"]}