{"summary":"Binance Launchpad to Test its Lottery With Matic Network","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-launchpad-to-test-its-lottery-with-matic-network-3618.htm","publishDate":"2019-04-01T11:51:00","id":20725,"type":null,"title":"Binance Launchpad to Test its Lottery With Matic Network","category":["Altcoin News "],"content":["Binance Launchpad, the token sale platform of major cryptocurrency exchange Binance, aims to test its new approach to a token sale with Matic Network, a developer of a Layer 2 scaling solution, on April 24.","The project looks to raise c. USD 5 million worth of BNB, which is the native token of Binance, at c. USD 0.00263 per token (MATIC) for 19% of their total token supply, the exchange announced on Monday. It compares with the USD 0.00079 seed sale token price and the USD 0.0026 “eguity early supporters token price.”","As reported last week, Binance announced new rules for token sale on Binance Launchpad that would increase demand for BNB. Therofere, the MATIC token launch will be conducted as a lottery, instead of a first-come-first-served system. The number of tickets one can claim depends on the amount of BNB one holds over a 20-day period in a Binance account leading up to the day of the lottery, up to a maximum of 5 tickets per eligible account.","The exhchange added today that based on the community feedback they have decreased the lowest threshold to participate in the lottery by 50%, to BNB 50 (almost USD 900.)","Lottery ticket allocation:","“Matic Network is a Layer 2 scaling solution that achieves scale by utilizing sidechains for off-chain computation, while ensuring asset security using the Plasma framework and a decentralized network of Proof-of-Stake (PoS) validators,” Binance said, adding that “many projects are already building apps & integrations with Matic.”","It goes further to explain that commercially, “Matic sidechains are structurally effective for supporting many Decentralized Finance (DeFi) protocols available in the Ethereum ecosystem.”","Matic founders:","___","Matic Network demonstration in May 2018:",""],"entity":[{"type":"Matic Network","content":"ORGANIZATION"},{"type":"Matic","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"April 24","content":"DATE"},{"type":"USD 5 million","content":"MONEY"},{"type":"May 2018","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["Binance","Exchange"],"authors":["Linas Kmieliauskas"]}