{"summary":"Spot Bitcoin ETFs See $7.7 Billion in Daily Trading Volume as BTC Price Races Towards ATH","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/spot-bitcoin-etfs-see-7-7-billion-in-daily-trading-volume.htm","publishDate":"2024-02-29T04:07:08","id":20747,"type":null,"title":"Spot Bitcoin ETFs See $7.7 Billion in Daily Trading Volume as BTC Price Races Towards ATH","category":["Bitcoin News "],"content":["US spot Bitcoin ETFs saw another all-time high in daily trading volume on Wednesday with $7.7 billion. BlackRock’s IBIT doubled its personal record on the third consecutive day with $3.3 billion in trading volume. Fidelity’s spot Bitcoin ETF also doubled its previous record with $1.4 billion trading volume on the same day, Bloomberg analyst James Seyffart reported.","The price of the leading cryptocurrency also briefly jumped above $64,000 at one point during the day, nearing its all time-high set in November 2021. Though the price of Bitcoin saw a correction later, hopes of a new all time-high are still undeterred.","At the time of writing, Bitcoin is changing hands at around $61,300, still up 7.6% in the last 24hrs and 20% in the last seven days.","RIDIC: the New Nine doubled their volume record (set Monday) with just about $6b traded.. $IBIT led w $3.3b of it, Fidelity did $1.4b (both double their prev records). The total number of trades was double too, over half a million individual trades bt them. $IBIT alone > $QQQ. pic.twitter.com\/ZzB5PWXA4f","— Eric Balchunas (@EricBalchunas) February 28, 2024","","Hunter Horsley, CEO of Bitwise Asset Management posted on X that Bitcoin has been around for 15 years, and it’s not slowing down now, it’s accelerating. He added:","“Spot Bitcoin ETFs represent a turning point, opening the door for the vast resources of the U.S. capital markets to invest in Bitcoin for the first time. This significantly expands the available market and removes the need for waiting for new features. Price discovery is happening, and it could move quickly.”","He further stated his belief that Bitcoin will “eat into gold’s total addressable market (TAM) faster than most anticipate,” potentially reaching a price of $250,000 “much sooner than many long-time observers would imagine.”","Horsley attributes this potential rapid growth to the increased accessibility brought by Bitcoin ETFs. He stated, “For 15 years, Bitcoin’s merits were proven, but its accessibility was limited. With spot ETFs, it’s like Bitcoin’s IPO moment, instantly available to any investor at the click of a button. This has led to a tenfold increase in the market.”","As Bitcoin bulls drive the market, another all-time high seems to be insight for the largest cryptocurrency by the market cap. The recent bull run is mostly driven by institutional buying as ETFs gobble up more Bitcoins than on a daily basis than are being produced. With Bitcoin halvening in April, the demand and supply ratio will shift once again as the number of mined bitcoins will be reduced in half."],"entity":[{"type":"$1.4","content":"MONEY"},{"type":"7.6%","content":"PERCENT"},{"type":"$3.3","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"$IBIT","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$6b","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Hunter Horsley","content":"PERSON"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"February 28, 2024","content":"DATE"},{"type":"$QQQ","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$64,000","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"$1.4 billion","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$61,300","content":"MONEY"},{"type":"$7.7 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Price","spot Bitcoin ETF"],"authors":["Jai Pratap"]}