{"summary":"Japanese Blockchain Gaming Community Seeks Political Support to Boost Crypto Liquidity","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/japanese-blockchain-gaming-community-seeks-political-support-to-boost-crypto-liquidity.htm","publishDate":"2024-02-21T11:53:35","id":20741,"type":null,"title":"Japanese Blockchain Gaming Community Seeks Political Support to Boost Crypto Liquidity","category":["Blockchain News "],"content":["The Japanese blockchain gaming community has reached out to the Liberal Democratic Party (LDP) in an effort to enhance liquidity in Japan’s crypto asset market.","Ryo Matsubara, director of Oasys, a GameFi blockchain, represented Japanese blockchain gaming projects during a visit to the LDP’s digital society promotion headquarters on February 21 to discuss the current state of affairs.","While Matsubara acknowledged the positive impact of recently implemented taxation laws and the LPS Act in facilitating business operations for startups, he expressed concerns about stringent regulations that have stifled liquidity in Japan.","He claimed that such restrictions directly impede the growth of the GameFi ecosystem, according to a recent post on X.","To address this issue, Matsubara emphasized the importance of regulations that encourage users to invest safely in cryptocurrencies and the blockchain economy.","He said that Japan can witness an immediate surge in liquidity as more buyers and sellers engage in the market by incentivizing participation.","Oasys intends to continue collaborating with the government to ensure the global competitiveness of the Japanese Web3 market.","Make Japanese🇯🇵 Web 3 market more liquid.","As the issue of corporate unrealized gain taxation and\nLPS Act has been resolved, we can launch web 3 startups from Japan🔥.\nThe next step is to improve liquidity in order to create an environment for growth.","I made presentation to… https:\/\/t.co\/nj5tGxaEna","— Ryo Matsubara_EN (@RyoMatsubara3) February 21, 2024","","Matsubara further added that reclaiming liquidity will enable Japan to become a thriving market, given its wealth of attractive content.","“The crypto market in Japan is running dry of liquidity after several incident and strict regulation,” he wrote.","“If Japan recover its liquidity , it will be hottest market as we have a lot of attractive contents.”","While Japan initially held a skeptical stance towards cryptocurrency adoption, it has gradually eased its position, recognizing the potential of the technology.","In September 2023, the Japanese government began contemplating the possibility of allowing startups to raise public funds through crypto asset issuance.","Last year, the country’s National Tax Agency also revealed that it has revised its law to exempt crypto token issuers from 30% corporate taxes on unrealized gains, effective from June 20.","At the time, Prime Minister Fumio Kishida said the move was aimed at boosting its blockchain and crypto sectors amid a push for “new capitalism.”","Crypto investors will still be liable to pay a maximum of 55% income tax on any earnings over JPY200,000 ($1,797) related to cryptocurrency, classified as “miscellaneous income.”","More recently, the Financial Services Agency (FSA), Japan’s primary financial regulator, proposed several measures to safeguard users against “unlawful transfers” to crypto exchanges.","However, one of these measures could potentially complicate the peer-to-peer transactions market. ","The FSA, in collaboration with the National Police Agency, encouraged banks to protect users by scrutinizing transfers to crypto-asset exchange service providers when the sender’s name does not match the account name.","This recommendation has raised concerns among users of P2P platforms, as the nature of such transactions often involves different names on the fiat and crypto ends.","If Japanese banks start rejecting transfers from one individual’s bank account to another’s crypto wallet, it could pose a significant challenge to the P2P market.","It is important to note that the current FSA request is presented as a recommendation rather than a mandatory requirement."],"entity":[{"type":"the Financial Services Agency (FSA","content":"ORGANIZATION"},{"type":"June 20","content":"DATE"},{"type":"National Tax Agency","content":"ORGANIZATION"},{"type":"February 21","content":"DATE"},{"type":"Ryo Matsubara_EN","content":"PERSON"},{"type":"55%","content":"PERCENT"},{"type":"February 21, 2024","content":"DATE"},{"type":"Matsubara","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"$1,797","content":"MONEY"},{"type":"LDP","content":"ORGANIZATION"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"Fumio Kishida","content":"PERSON"},{"type":"FSA","content":"ORGANIZATION"},{"type":"Liberal Democratic Party (LDP","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"National Police Agency","content":"ORGANIZATION"},{"type":"Ryo Matsubara","content":"PERSON"}],"hashtag":["Blockchain","Gaming","Japan"],"authors":["Ruholamin Haqshanas"]}