{"summary":"South Korea’s New Crypto Crime Investigation Unit Is Already ‘Overloaded’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-koreas-new-crypto-crime-investigation-unit-is-already-overloaded.htm","publishDate":"2023-10-31T00:30:40","id":20750,"type":null,"title":"South Korea’s New Crypto Crime Investigation Unit Is Already ‘Overloaded’","category":["Blockchain News "],"content":["A South Korean prosecution unit dedicated to investigating crypto crime is already “overloaded” with cases, just over a year after launching.","The unit operates as part of the Seoul Southern District Prosecutors’ Office and was formerly known as the Financial and Securities Crime Coalition Team.","The team is also known as the Yeoido Grim Reaper: Yeoido is the district of Seoul in which most major government organs are headquartered.","The unit used to deal with conventional financial crime before it was officially disbanded around four years ago.","But the Justice Ministry ordered the Grim Reaper’s reformation last year, with the unit now exclusively tackling high-level crypto-related crimes.","Its first case was the investigation into Terraform Labs, CEO Do Kwon and other executives, and the LUNC cryptoasset.","But Asia Kyunjae reported:","“There is talk [in the legal community] that the [unit] is suffering from an overload of work and understaffing problems as […] crypto-related crime cases increase.”","The latest case to be transferred to the Grim Reaper involves a metaverse firm named ClubRare, which has been accused of making false promises to its investors.","The firm allegedly claimed that that two of its tokens would be listed on centralized crypto exchanges, but has reportedly failed to carry out its promises.","A group of investors has accused the ClubRare CEO of violating the Act on Aggravated Punishment of Specific Economic Crimes, claiming that its members suffered a combined total of $7.4 million worth of damages.","The media outlet claimed “legal community” sources believe the Seoul Southern District Prosecutors’ Office and its crypto unit “do not have the capacity to proceed with the investigation.”","The unit was given a makeover in July this year, when it was reborn as a cross-department, crypto-specific unit with “about 30 staffers.”","But the unit has since found itself tackling an ever-increasing number of highly complex crypto cases, including the following:","Legal community officials claimed the unit needs “more support,” with an anonymous former prosecutor saying:","“The unit is the only public authority that investigates cryptoassets, but it has no support and it is understaffed. Politicians, including government ministries and the National Assembly, are trying to revitalize the […] crypto [industry]. They say they will regulate the sector, but if we continue like this, the [unit] will be pushed beyond its limit.”",""],"entity":[{"type":"Seoul Southern District Prosecutors’ Office","content":"ORGANIZATION"},{"type":"$7.4 million","content":"MONEY"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"Justice Ministry","content":"ORGANIZATION"},{"type":"Aggravated Punishment of Specific Economic Crimes","content":"ORGANIZATION"},{"type":"Financial and Securities Crime Coalition Team","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"Seoul","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"July this year","content":"DATE"}],"hashtag":["Legal","South Korea"],"authors":["Tim Alper"]}