{"summary":"Genesis Seeks Green Light from Bankruptcy Court for $1.4 Billion GBTC Share Sale","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/genesis-seeks-green-light-from-bankruptcy-court-for-1-4-billion-gbtc-share-sale.htm","publishDate":"2024-02-04T16:00:28","id":20757,"type":null,"title":"Genesis Seeks Green Light from Bankruptcy Court for $1.4 Billion GBTC Share Sale","category":["Altcoin News "],"content":["Crypto lender Genesis Global Capital, currently undergoing bankruptcy proceedings, has requested permission to sell trust assets worth approximately $1.6 billion.","In a motion filed with the U.S. Bankruptcy Court in the Southern District of New York, the firm sought approval to sell assets held by Genesis, a subsidiary of the Digital Currency Group.","The assets include shares of Grayscale Bitcoin Trust (GBTC) valued at around $1.4 billion, shares of Grayscale Ethereum Trust valued at about $165 million, and shares of Grayscale Ethereum Classic Trust valued at approximately $38 million.","In a separate motion, Genesis requested the court to expedite the relevant deadlines, aiming for the sale motion to be heard at the upcoming hearing on Thursday, February 8.","The GBTC shares in question were initially pledged as collateral by Genesis to Gemini for the Gemini Earn program.","Additionally, Genesis is seeking legal ownership of 31,180,804 additional shares (worth around $1.2 billion) that were pledged to Gemini but not transferred.","The ownership of these shares is currently a matter pending before the court.","Gemini, in a statement on its website, regarded the filing as a significant step forward, particularly following the approval of GBTC as an exchange-traded product (ETP) on January 10th.","Earlier this week, Genesis reached an agreement with the U.S. Securities and Exchange Commission (SEC) to pay a $21 million fine using any remaining funds after the bankruptcy process.","This settlement resolves the SEC’s lawsuit against Genesis concerning the operation of the Gemini Earn program.","The settlement will provide several benefits to GGC’s estates, including the resolution of the SEC’s Civil Action Claim filed in these Chapter 11 Cases.","By reaching this settlement, Genesis would eliminate the risks, expenses, and uncertainty associated with protracted litigation against the SEC.","The SEC filed its lawsuit against Genesis and Gemini in January 2023, focusing on the period between February 2021 and November 2022.","The commission alleged that both firms violated U.S. securities laws through their crypto lending program.","As a consequence of the legal proceedings, Genesis suspended withdrawals on its platform in November 2022 and subsequently filed for bankruptcy in January 2023.","More recently, bankrupt cryptocurrency exchange FTX also asked for approval to sell its 8% stake in AI startup Anthropic Holdings.","The motion, filed by FTX’s current CEO, John Ray III, requests permission to sell the stake and proposes two possible procedures, including an auction or a private sale.","Anthropic Holdings achieved a reported valuation of up to $18 billion in December 2023, indicating that FTX’s 7.84% stake could be worth approximately $1.4 billion.","This value has sparked hope among victims of the FTX collapse, as FTX anticipates having sufficient funds to fully repay all customer and creditor claims."],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"$38 million","content":"MONEY"},{"type":"February 2021","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Genesis","content":"PERSON"},{"type":"January 10th","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"$1.4 billion","content":"MONEY"},{"type":"Grayscale Ethereum Classic Trust","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"7.84%","content":"PERCENT"},{"type":"$21 million","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$165 million","content":"MONEY"},{"type":"February 8","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"Anthropic Holdings","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Genesis","content":"ORGANIZATION"}],"hashtag":["Bankruptcy","Genesis","Genesis Global"],"authors":["Ruholamin Haqshanas"]}