{"summary":"Aya Kantorovich, head of institutional coverage at FalconX, joined Frank Chaparro on The Scoop to chat about volatility.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107103\/falconx-aya-kantorovich-explains-bitcoin-volatility","publishDate":"2021-06-03T14:31:20","id":2076,"type":null,"title":"FalconX&#x27;s Aya Kantorovich explains what&#x27;s been behind bitcoin&#x27;s latest price gyrations","category":["BITCOIN"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">30<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and FalconX’s Aya Kantorovich.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"73031c171012000733071b16111f1c101810010a03071c5d101c1e\">[email&nbsp;protected]<\/a>.<\/i>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong><\/span>","<span data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started&nbsp;today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Exodus<\/strong><\/span>","<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK4848454533\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Aya Kantorovich, head of institutional coverage at FalconX, has been experiencing a bit of déjà vu.&nbsp;","Kantorovich, a former associate at crypto hedge fund Pantera, joined The Scoop to unpack the crypto market's recent bouts of volatility and how the market is stuck in a cycle of retail-led drawdowns. FalconX — an aggregator of crypto trading flows — has a window into both the retail and institutional market.&nbsp;","According to Kantorovich, liquidations across off-shore market venues, cascading liquidations, and the inability for traders to access crypto exchange platforms drive prices down. When money can't move around, price drawdowns are amplified.&nbsp;","\"We saw $2 billion worth of liquidations happening across BTC,\" she said. \"Retail liquidations was a large portion of this ... and then a cascading effect.\"","\"When you have this level of heightened volatility you see some exchanges begin to shut down their trading capabilities and when these centralized trading platforms shut down those capabilities then traders don't have the ability to top off on their margin so you see a continued cascade,\" she added.&nbsp;","Kantorovich doesn't think this is a cycle that will break because many new institutions have to sell when the price reaches a certain threshold. Unlike crypto native whales, which have driven the buying at the dip, large billion-dollar plus asset managers \"have a completely different level of drawdowns that they're allowed to maintain.\"","\"Let's say the market falls down by 30%, they have a fiduciary obligation to take money off the table,\" she said. \"These aren't the momentum diamond hands that we're so used to seeing in crypto.\"","\"I think the reason for that is we are going to continue to see institutions that do not have a momentum-long venture persona ... and that could be both good or bad for the space.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Aya Kantorovich","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Aya Kantorovich","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Kantorovich","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}