{"summary":"BendDAO is seeking community approval to sell 1 billion tokens from its treasury.\nThe funds realized from the token sale will be used to create a sub-treasury for the NFT lender.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171171\/nft-lender-benddao-proposes-80-million-treasury-investment-fund","publishDate":"2022-09-20T07:18:16","id":2076,"type":null,"title":"NFT lender BendDAO proposes $80 million treasury investment fund","category":["Governance"],"content":["BendDAO, an NFT lending platform, has filed a <a href=\"https:\/\/governance.benddao.xyz\/t\/phased-based-governance-proposal-to-establish-the-benddao-non-performing-assets-investment-fund\/186\" data-v-f87c67ca=\"\">proposal<\/a> on the community forum to create an investment fund with a post-money valuation of $80 million.","According to the proposal, the fund, if approved, will function as a sub-treasury for the NFT lender. The sub-treasury will invest at least 50% of its funds in non-performing assets. This move is part of efforts to diversify the NFT lender’s DAO treasury.","For BendDAO, this sub-treasury is necessary given the recent struggles the project has faced amid a <a href=\"https:\/\/www.theblock.co\/post\/165891\/nft-marketplace-volumes-fell-further-in-august\" data-v-f87c67ca=\"\">general downturn in the NFT market<\/a>. Shrinking liquidity in the NFT space has seen a large volume of forced withdrawals from the NFT lender, leading to a sharp increase in borrowing rates. This situation recently saw the platform amass a significant volume of <a href=\"https:\/\/www.theblock.co\/post\/164828\/nft-lender-benddao-begins-vote-to-change-protocol-amid-liquidity-crisis\" data-v-f87c67ca=\"\">bad debt<\/a> as borrowers defaulted on their loan positions. As previously <a href=\"https:\/\/www.theblock.co\/post\/164987\/benddao-fixing-nft-liquidations-could-lead-to-bored-apes-selling-at-a-discount\" data-v-f87c67ca=\"\">reported by The Block<\/a>, BendDAO was forced to push through a number of protocol upgrades to prevent several Bored Apes and other expensive NFTs from being sold at a discount.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","To seed the sub-treasury, the BendDAO team is seeking approval from the community to sell 1 billion of its tokens. This amounts to 10% of the total BendDAO (BEND) token supply. The NFT lender plans to use ether (ETH) as the financing currency with a minimum investment of 100 ETH per share to achieve the $80 million post-money valuation for the fund.","The proposal states that the NFT lender is looking to attract investments from venture capital firms, blue-chip NFT projects, and community members. Of the 1 billion tokens, 60% will be allocated to venture capital investors. The remaining allocation will be split equally between investors from the DAO and interested blue-chip NFT projects. Each VC, NFT, or individual investor will only be allowed to own a maximum of 2% of the tokens being sold by the fund.","As part of the proposal, BendDAO is considering two options for distributing the tokens to investors. The first option has no vesting requirement but the DAO will deposit an equal amount of the ether generated from the token sale into its ETH liquidity pool to earn staking rewards. The second option has a six-month vesting schedule, followed by linear unlocks over a two-and-a-half-year period.","BendDAO plans to use at least 50% of the fund to invest in non-performing assets. The DAO will create a four-of-seven (4\/7) multi-signature wallet for the sub-treasury. This multi-sig arrangement will include three community members, two VC representatives, one signatory from a blue-chip project, and one BendDAO core team member."],"hashtag":[]}