{"summary":"South Africa’s Regulator Approves 59 Crypto Licences: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-africas-regulator-approves-59-crypto-licences-report.htm","publishDate":"2024-03-14T04:08:22","id":20769,"type":null,"title":"South Africa’s Regulator Approves 59 Crypto Licences: Report","category":["Bitcoin News "],"content":["South Africa’s regulator Financial Sector Conduct Authority (FSCA) has approved 59 operating licenses for cryptocurrency exchanges, according to a Reuters report citing an official from the regulatory body.","There have been more than 300 South African crypto providers seeking permits and out of those only 59 have been approved. By law, digital-asset exchanges require permits to operate in the country.","Back in 2022, the FSCA declared cryptocurrency assets to be financial products and made it clear they needed to be regulated to protect financial customers from risks and prevent money laundering and terrorism financing. The FSCA gave exchanges until November 30 to apply for licenses or the firms would risk facing enforcement action.","“We are processing those licensing applications and we’re doing so in a phased kind of manner given the numbers,” FSCA Commissioner Unathi Kamlana said in a recent interview with Bloomberg.","In 2021, the FSCA published a paper highlighting that crypto assets will be brought into the South African regulatory purview in a “phased and structured manner.”","The paper provided a roadmap for putting in place a framework for regulating crypto assets, through the regulation of crypto asset service providers (CASPs), in South Africa.","“Crypto assets remain highly volatile and inherently risky given their decentralised and disintermediated value proposition (i.e. crypto assets offer a direct, peer-to-peer transactional capability that does not require a financial intermediary, such as a bank). Their decentralised nature leads to the challenge of decentralised responsibility in the event of something going wrong: because there is no central intermediary, issuer or ledger keeper, consumers essentially have no recourse to any authority or entity to address or resolve user errors (e.g. using the wrong crypto asset address, or sending Bitcoin to an Ethereum address).” –– FSCA newsletter from 2021.","The FSCA went on to explain given the increased retail interest in crypto assets, growing instances of consumer abuse, fraud and market misconduct have been noted both internationally and in South Africa. Recent schemes highlighted in the media further emphasise the need for the South African authorities, predominantly through the FSCA, to take action against the growing tendency for market abuse under the guise of crypto assets."],"entity":[{"type":"Financial Sector Conduct Authority (FSCA","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"November 30","content":"DATE"},{"type":"FSCA Commissioner Unathi Kamlana","content":"ORGANIZATION"},{"type":"South Africa","content":"LOCATION"},{"type":"FSCA","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["Crypto exchanges","Financial Sector Conduct Authority","South Africa"],"authors":["Tanzeel Akhtar"]}