{"summary":"MicroStrategy Plans Another $500 Million Private Offering of Convertible Senior Notes, Will Use Proceeds to Buy Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/microstrategy-plans-another-500-million-private-offering-of-convertible-senior-notes-will-use-proceeds-to-buy-bitcoin.htm","publishDate":"2024-03-13T21:04:43","id":20772,"type":null,"title":"MicroStrategy Plans Another $500 Million Private Offering of Convertible Senior Notes, Will Use Proceeds to Buy Bitcoin","category":["Bitcoin News "],"content":["MicroStrategy plans to conduct another private offering of convertible senior notes, as per an announcement made on Wednesday.","Subject to market conditions, the software company is looking to raise another $500 million via the issuance of debt that will be convertible to shares in 2031.","MicroStrategy intends to use the full proceeds of the private offering to purchase more Bitcoin.","BREAKING: MicroStrategy is raising another $500 million to buy more bitcoin","— Crypto Tea (@CryptoTea_) March 13, 2024","","The announcement comes after the firm successfully sold $821.7 million in senior convertible notes last week.","Just as MicroStrategy plans to do this time around, the firm used the proceeds of that sale to buy BTC.","As per the company’s chairman Michael Saylor, the company acquired 12,000 BTC at an average price of $68,477.","MicroStrategy has acquired an additional 12,000 BTC for ~$821.7M using proceeds from convertible notes & excess cash for ~$68,477 per #bitcoin. As of 3\/10\/24, $MSTR hodls 205,000 $BTC acquired for ~$6.91B at average price of $33,706 per bitcoin. https:\/\/t.co\/YayyKtpz8d","— Michael Saylor⚡️ (@saylor) March 11, 2024","","That took the firm’s holdings to 205,000 BTC tokens, currently valued at close to $15 billion. MicroStrategy’s average purchase price is currently $33,706, so the firm is currently sat on more than 2x gains.","Assuming MicroStrategy is able to raise the full $500 million and buy BTC at the current market rate of just over $73,000, its BTC stash could be about to jump another 6,850.","MicroStrategy’s decision to jump back into the market with another private offering demonstrates how strong the firm deems market conditions to be right now. Trading at around $73,000, Bitcoin is at its highest-ever levels, having rallied nearly 75% already this year.","MicroStrategy’s stock price, meanwhile, is up nearly 3x since the start of the year. Some analysts had warned MSTR investors that the launch of spot Bitcoin ETFs would lead to MSTR outflows, as investors who had bought the stock for BTC exposure migrated to the new ETFs.","But that hasn’t been the case at all. MicroStrategy’s ability to employ leverage (raising its beta versus Bitcoin) as well as a yield has kept investors interested.","The firm’s recent moves to further increase leverage via private offers of senior convertible notes has attracted even more interest with MSTR up 150% in under three weeks. No doubt plenty of other public companies will be looking at MicroStrategy’s BTC strategy in awe."],"entity":[{"type":"$6.91","content":"MONEY"},{"type":"MicroStrategy’s BTC","content":"ORGANIZATION"},{"type":"$821.7","content":"MONEY"},{"type":"$73,000","content":"MONEY"},{"type":"March 11, 2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"MSTR","content":"ORGANIZATION"},{"type":"$MSTR","content":"MONEY"},{"type":"$821.7 million","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"150%","content":"PERCENT"},{"type":"$15 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"2031","content":"DATE"},{"type":"$33,706","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"$68,477","content":"MONEY"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["Bitcoin","MicroStrategy","mstr"],"authors":["Joel Frank"]}