{"summary":"NFTs Hit By Unstable Market As Multiple Projects Post Monthly Losses Amid Declining Volumes","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nfts-hit-by-unstable-market-as-multiple-projects-post-monthly-losses-amid-declining-volumes.htm","publishDate":"2023-08-24T12:19:00","id":20778,"type":null,"title":"NFTs Hit By Unstable Market As Multiple Projects Post Monthly Losses Amid Declining Volumes","category":["News "],"content":["Recent data from non-fungible token (NFT) marketplaces show a sharp decline in transaction volume and prices with several projects posting double-digit losses.","According to data for Nansen, “blue chip” NFTs have recorded up to 25% NFT losses as the sector marks the lowest point since April 2021. ","Last month, total sales volume stood at $465 million down 23% from June marking a fifth consecutive month of losses since February when sales topped $1.2 billion following a change in the bearish market outlook per CryptoSlam data.","The shift in consumer demand for NFTs can be seen in the average price falling to $47 at the detriment of blue-chip assets. While sales recorded a sharp drop, transaction volumes showed a slight decrease.","In July, transaction volumes were at 10.4 million, a reduced level from 10.8 million in June. According to data from CryptoSlam, the top three networks for NFT sales remained the same with Ethereum recording $293 million in sales while Bitcoin and Solana posted $52.6 and $35 million respectively. ","The floor price of Bored Apes Yacht Club (BAYC) assets plummeted by 27% in the last 30 days while DeGods and Azuki recovered higher losses as market uncertainty soars.","DeGods collection plunged by 55% with Azuki’s floor prices hitting lows at 36%. A key indicator of a bearish NFT market is the 40% decline of the Nansen NFT 500 and its Blue Chip 10 index falling by 10%.","Bitcoin (BTC) Ordinals, which recorded high volumes in April eventually clogging the network, have also seen its figures decline in recent months.","DappRadar shows a significant drop of 98% since May and sales volumes plummeted from $452 million to $3 million within the same period.","A staggering low in the NFT market is the fall of asset prices below the decline of Ether. The cost of Ether often sets the tone for the NFT market but while it has plummeted 9% over the past month, several leading NFT projects have plunged above 25%.","While the market wears a bearish outlook with declining figures, some developers are springing ideas of creating new collections at a lower price as consumers turn away from “Blue Chip” NFTs.","In the past 30 days, smaller NFT projects have recorded gains. Miladays has been among the biggest gainers with its floor price skyrocketing by 66% almost moving past the Mutant Ape Yacht Club. ","Sproto Gremlins has also shocked many observers with its price hitting 262%. Still on the positive, NFT aggregator Rarible has recorded growth after announcing support for creator royalties. ","1\/ Following @rarible's decision to maintain creator royalties, and remove both @opensea and @blur_io from their aggregation data, Rarible's trading volume is up 637% in the past 24h.\n\nDo you think Rarible is right? 🤔\n\nView @rarible on DappRadar 👇https:\/\/t.co\/9hh0AQa7Nj pic.twitter.com\/cg1dPChYar","In the past 24 hours, volumes have surged up to 585% after it plans to cut off orders from platforms like OpenSea that don’t support creator royalties. ","“… we support royalties, we always have, we always will,” the company stated in a tweet. "],"entity":[{"type":"637%","content":"PERCENT"},{"type":"$465 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Rarible","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Bored Apes Yacht Club","content":"ORGANIZATION"},{"type":"$293 million","content":"MONEY"},{"type":"27%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"$52.6","content":"MONEY"},{"type":"Nansen NFT","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"$35 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"$47","content":"MONEY"},{"type":"55%","content":"PERCENT"},{"type":"$3 million","content":"MONEY"},{"type":"585%","content":"PERCENT"},{"type":"262%","content":"PERCENT"},{"type":"36%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"$452 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Market","NFT","Price"],"authors":["David Pokima"]}