{"summary":"Walmart has expanded the availability of Pudgy Toys to 1,100 more U.S. stores, bringing the total to 3,100 stores nationwide.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278347\/walmart-pudgy-penguins-expansion","publishDate":"2024-02-21T08:15:26","id":2077,"type":null,"title":"Walmart expands availability of Pudgy Toys to 1,100 more stores","category":["NFT COLLECTIONS"],"content":["Walmart, the world's biggest retailer, has expanded the availability of Pudgy Toys — the NFT collection Pudgy Penguins' toy line — to 1,100 more U.S. stores, bringing the total to 3,100 stores nationwide.","Walmart is introducing 30 new Pudgy Toys, including Lil Pudgys Igloo Collectibles and Action Figures, each priced between $2.99 and $11.97. Pudgy Toys <a href=\"https:\/\/www.theblock.co\/post\/252987\/walmart-pudgy-penguins-nft-toys\" data-v-f87c67ca=\"\">debuted<\/a> at Walmart last September, initially appearing in 2,000 U.S. stores.","\"The expansion into additional Walmart locations, alongside exclusive toy offerings, underscores the enduring appeal of Pudgy Penguins characters,\" Luca Netz, CEO of Pudgy Penguins, <a href=\"https:\/\/www.prnewswire.com\/news-releases\/pudgy-penguins-continues-growth-with-expanded-toy-collection-in-major-us-retail-chain-302066557.html?tc=eml_cleartime\" data-v-f87c67ca=\"\">said<\/a> in a statement.","Each Pudgy toy comes with a QR code that provides access to <a href=\"https:\/\/www.theblock.co\/post\/266882\/pudgy-penguins-announces-pudgy-world-web3-game-on-zksync-blockchain\" data-v-f87c67ca=\"\">Pudgy World<\/a> — a multiplayer digital social platform where users can build their \"Forever Pudgy\" characters, play mini-games, and interact with other users. Pudgy World is based on the Ethereum Layer 2 network zkSync Era and is currently in open beta mode.","All Pudgy Toys are inspired by and connected to Pudgy Penguins NFTs, and those NFT holders who submitted their pieces for licensing will receive royalties through Pudgy Penguins' NFT licensing platform, OverpassIP, which is still in beta mode.","Pudgy Toys and Pudgy World were first launched in May last year to blend NFTs and blockchain technology with physical toys. The toys are also available on the online retailer Amazon. Pudgy toys are made by PMI Kids' World, which also produces toys for Fortnite and Among Us.","Last week, Pudgy Penguin NFTs <a href=\"https:\/\/www.theblock.co\/post\/277947\/pudgy-penguins-briefly-flips-bored-ape-yacht-club-in-floor-price\" data-v-f87c67ca=\"\">briefly surpassed<\/a> Bored Ape Yacht Club NFTs in floor price for the first time. The floor price represents the value of the cheapest available NFT in a collection and serves as an indicator of demand for the NFT.","Overall, Pudgy Penguins is the twentieth-largest NFT collection by sales volume of all time, according to CryptoSlam <a href=\"https:\/\/www.cryptoslam.io\/\" data-v-f87c67ca=\"\">data<\/a>. The Ethereum-based collection, comprising 8,888 NFTs featuring cartoon penguins, was launched in 2021 and sold to Netz for $2.5 million in 2022 after the community voted to oust the project's founders. Pudgy Penguins holders had claimed the founders didn't keep their promises, like making a kids' book and a metaverse game.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pudgy Penguins","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Pudgy World","content":"LOCATION"},{"type":"Luca Netz","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$11.97","content":"MONEY"},{"type":"$2.99","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"May last year","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"Lil Pudgys Igloo Collectibles and Action Figures","content":"ORGANIZATION"}],"hashtag":["PUDGY PENGUINS","ZKSYNC"],"authors":["Yogita Khatri","The Block"]}