{"summary":"Luxury Brand Protocol Arianee Set to Launch New Polygon CDK-Powered Chain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/luxury-brand-protocol-arianee-set-to-launch-new-polygon-cdk-powered-chain.htm","publishDate":"2024-02-22T19:35:22","id":20777,"type":null,"title":"Luxury Brand Protocol Arianee Set to Launch New Polygon CDK-Powered Chain","category":["Ethereum News "],"content":["Arianee, the Web3 ownership infrastructure behind several global luxury brands, has announced its plans to unveil a brand new layer 2 built on Polygon “to leverage the full potential of digital product passports (DPPs) and engagement tokens at scale,” according to a February 22 Polygon press release.","Arianee’s latest layer will allow clients of the company including Mocler, Mugler, and Audemars Piguet to release their own DPPS and loyalty tokens.","ZK-powered consumer engagement inbound.@ArianeeProject is tapping Polygon CDK to enable brands to leverage the full potential of digital product passports (DPPs) and engagement tokens at large scale.","Through dedicated appchains, Arianee will help brands build highly… pic.twitter.com\/9eurRMkLPt","— Polygon | Aggregated (@0xPolygon) February 22, 2024","","“We have been early believers in the Polygon ecosystem, and worked on mainnet with many of our clients,” Arianee’s CEO and Co-Founder Pierre-Nicolas Hurstel said. “Today, our decision to build a powerful L2 appchain powered by Polygon CDK allows us to take another momentous stride toward building blockchain-based solutions where performance, scalability, and connectivity are the norm.”","According to Web 3 Protokol, DPPs “are a tool for collecting and sharing product data throughout its entire lifecycle.” DPPs have gained notoriety in recent years for their utility in tracking sustainability across governments and organizations.","Most recently, the European Union (EU) announced its plans to move forward with DPPs, with regulation expected to become finalized in 2024 and implementation beginning in the following years.","Use cases for the emerging technology include preventing counterfeit products, authentication of ownership, traceability, and increased transparency between consumers and participating brands, among others.","According to the press release, the Arianee protocol has minted “more than 1.7 million DPPs and engagement tokens” since 2018. Data from Polygon’s website alleges that “tokenized rewards represent a new frontier in customer engagement and loyalty strategies” by “leveraging blockchain and tradability to make rewards more engaging, dynamic, and valuable.”","Most recently, luxury watch brand Breitling launched their own NFTs for customers to ensure proof of ownership as well as unlock access to premium services.","“We believe that Polygon CDK holds the potential to revolutionize industries far beyond the realms of crypto and finance,” Polygon Labs CEO Marc Boiron said. “We are happy to see Arianee, a platform working with some of the finest global brands on real-life use cases, start building with Polygon CDK.”","Arianee and Polygon are slated to host a joint dinner with their layer 2 announcement at NFT Paris on Thursday. Updates regarding the project can be found at Polygon’s development blog."],"entity":[{"type":"February 22","content":"DATE"},{"type":"Today","content":"DATE"},{"type":"Nicolas Hurstel","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Mugler","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"February 22, 2024","content":"DATE"},{"type":"European Union (EU","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Pierre","content":"PERSON"},{"type":"Web 3 Protokol","content":"ORGANIZATION"},{"type":"Arianee","content":"ORGANIZATION"},{"type":"Audemars Piguet","content":"ORGANIZATION"}],"hashtag":["Layer-2","NFTs","Polygon"],"authors":["Julia Smith"]}