{"summary":"Tether Takes Action: $5.2M in USDT Frozen Due to Phishing Links","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tether-takes-5-2m-usdt-frozen-to-phishing-links.htm","publishDate":"2024-05-14T17:03:39","id":20784,"type":null,"title":"Tether Takes Action: $5.2M in USDT Frozen Due to Phishing Links","category":["Altcoin News "],"content":["Tether is continuing to monitor and punish illicit activities. On May 14, it identified and froze USDT worth $5.2 million in an effort to enforce strict network controls and combat money laundering.","The illicit funds were first flagged by blockchain tracking platform MisTrack. The frozen USDT were distributed across 12 Ethereum (ETH) wallets, flagged as “USDT Banned Addresses.” The funds were suspected to have been laundered from numerous phishing schemes.","Tether’s proactive measures to combat illicit activities in the cryptocurrency industry have been highlighted by recent actions, showcasing the company’s commitment to preserving the integrity and security of the network.","In March 2024, Tether partnered with the US Department of Justice (DoJ) and the Federal Bureau of Investigation (FBI) to seize $1.4 million worth of USDT from a tech support scam network.","⚠️MistTrack Alert🧐","Just now, #Tether froze ~5.2 million $USDT on 12 addresses. These addresses are associated with addresses tagged as \"USDT Banned Address\" by #MistTrack.https:\/\/t.co\/OzPQkfCehS pic.twitter.com\/msAShbbl73","— MistTrack🕵️ (@MistTrack_io) May 14, 2024","","Tether’s vigilance extends to its monitoring of USDT addresses, with major actions taken to blacklist suspicious addresses.","The company blacklisted three Ethereum addresses holding more than $150 million in USDT in January 2022. This was followed by the freezing of $8.2 million in USDT on Ethereum in October 2022, with 215 Ethereum-based USDT addresses added to the blacklist.","❄ An address with a balance of 3,400,000 #USDT (3,400,680 USD) has just been frozen!https:\/\/t.co\/eBkRuE5aJl","— Whale Alert (@whale_alert) October 10, 2022","","Tether has been swift in responding to emerging threats. In late 2022, the USDT issuer froze over $360 million in assets linked to illicit activities and took action against USDT linked to terrorist activity in Ukraine and Israel, freezing $817,000 in October 2023.","Additionally, in November 2023, $225 million in USDT associated with romance scams was frozen.","Meanwhile, Tether has partnered with Chainalysis to develop monitoring and analysis tools to identify wallets that may pose risks or be associated with illicit or sanctioned addresses.","Tether’s recent freezing of USDT follows a UN report identifying USDT as the preferred cryptocurrency for money laundering, sparking speculation of a potential US government investigation.","Ripple CEO Brad Garlinghouse added fuel to the fire by suggesting that the US government is indeed targeting Tether, the world’s largest stablecoin issuer.","Speaking on the World Class podcast, Garlinghouse stated, “The U.S. government is going after Tether, that is clear to me,” expressing uncertainty about the implications of regulatory action against Tether despite its significant role in the cryptocurrency ecosystem.","","These remarks drew a sharp response from Tether CEO Paolo Ardoino, who criticized Garlinghouse as an “uninformed CEO.”","Ardoino highlighted that Ripple itself is under SEC investigation and insinuated that Garlinghouse’s comments were driven by Ripple’s upcoming stablecoin, which could compete with USDT.","An uniformed CEO, leading a company being investigated by the SEC, launching a competitive stablecoin (cui prodest), is being reported spreading fear about USDt.","Let me give you an update on Tether USDt ecosystem safety.","USDt is the most used stablecoin in the world, with…","— Paolo Ardoino 🍐 (@paoloardoino) May 13, 2024","","He also highlighted Tether’s collaboration with law enforcement agencies to combat illicit activities. The company has worked with 24 agencies across more than 40 countries, responding to 198 requests to block wallets in the last 12 months and 339 requests in the last three years.","These collaborations have been instrumental in identifying and mitigating risks associated with illicit activities involving USDT."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"January 2022","content":"DATE"},{"type":"$5.2 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$360 million","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"MistTrack Alert🧐","content":"ORGANIZATION"},{"type":"last three years","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"Whale Alert","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"May 14","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"USDT Banned Address","content":"ORGANIZATION"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Garlinghouse","content":"PERSON"},{"type":"March 2024","content":"DATE"},{"type":"$225 million","content":"MONEY"},{"type":"$USDT","content":"MONEY"},{"type":"$8.2 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"October 10, 2022","content":"DATE"},{"type":"May 13, 2024","content":"DATE"},{"type":"$1.4 million","content":"MONEY"},{"type":"$817,000","content":"MONEY"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"US Department of Justice (DoJ","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Phishing scams","Tether USDT"],"authors":["Jimmy Aki"]}