{"summary":"Here Not There Labs’ first product Towns has closed a $25.5 million Series A round led by A16z crypto.\nThe startup is building a protocol and app that aims to enable better digital town squares.","author":["Kari McMahon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214363\/houseparty-co-founder-raises-25-5-million-for-ethereum-town-square-protocol","publishDate":"2023-02-23T09:00:52","id":2078,"type":null,"title":"Houseparty co-founder raises $25.5 million for Ethereum &#x27;town square&#x27; protocol","category":["Deals"],"content":["Here Not There (HNT) Lab's latest offering Towns closed a $25.5 million round to help online communities build better digital town squares.","\"Over the past decade, the digital town squares where we’ve gathered online — to communicate, create, and share — have been stuck in walled gardens owned by landlords who are not us,\" said the company in a blog post.","A16z crypto led the Series A round for the group chat protocol and app. Previous investors in Towns include Benchmark and Framework, said the company in the post.","<a href=\"https:\/\/www.towns.com\/introduction\/\" data-v-f87c67ca=\"\">Towns<\/a> is the brainchild of <a href=\"https:\/\/hntlabs.com\/#\" data-v-f87c67ca=\"\">HNT Labs<\/a>, which is co-founded by two startup veterans Ben Rubin, who co-founded Houseparty and Meerkat, and Brian Meek, who was the chief technology officer at Strivr Labs and a former GM of engineering at Skype.","The protocol is Ethereum-based and uses programmable smart contracts to control administration, privacy and roles within each town square, the company said. Communities can build new clients and APIs on top of the protocol and will be in charge of writing their own rules for moderation and monetization.","\"Any group can use Towns to assemble and chat freely in a space designed to their needs— without ever having to worry that some organization will change the rules, profit off their activity, or take away their rights,\" said the company in the blog post.","The&nbsp; Towns network itself is an end-to-end encrypted near real-time communication system powered by a distributed proof-of-stake network of nodes, the company said.","Alongside the protocol, an app will launch that offers the encrypted chat experience without the complexities of dealing with the protocol and network.","\"While this will be the first Towns app, it will be one of many as anyone can build clients against the Towns protocol to fit their specific needs,\" the company said.","HNT Labs will first steward the governance of Towns. The plan is to eventually transition this to Towns DAO as the network decentralizes.","\"The team’s vision for creating a digital town square where members can define the borders, set the rules, and build the world they want is an ambitious goal that is uniquely achievable through the promise of decentralization and web3,\" said Sriram Krishnan, a partner at a16z, in a blog post.","A16z crypto have led several raises in the web3 space in recent weeks including <a href=\"https:\/\/a16zcrypto.com\/azra-games-seed-extension\/\" data-v-f87c67ca=\"\">Azra Games' $10 million extension round<\/a> and <a href=\"https:\/\/techcrunch.com\/2023\/02\/16\/stelo-labs-raises-6m-in-a16z-led-round-to-help-crypto-wallet-users-protect-themselves\/\" data-v-f87c67ca=\"\">Stelo Labs' $6 million<\/a> seed raise.","The <a href=\"https:\/\/www.theblock.co\/post\/196252\/a16z-crypto-funds-still-have-billions-to-deploy-says-co-founder-chris-dixon\" data-v-f87c67ca=\"\">majority<\/a> of a16z's most recent crypto fund is still to be deployed, said general partner and crypto fund founder Chris Dixon in a recent interview on The Block's podcast <a href=\"https:\/\/www.theblock.co\/amp\/post\/196118\/a16zs-chris-dixon-on-the-state-of-the-crypto-market-exclusive\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Scoop<\/a>."],"hashtag":["SERIES A"]}