{"summary":"Some 324,000 users fell victim to crypto phishing scams in 2023 and lost nearly $300 million, according to blockchain security firm Scam Sniffer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270105\/crypto-phishing-attacks-2023","publishDate":"2024-01-03T06:11:37","id":2078,"type":null,"title":"Crypto phishing attacks drained nearly $300 million in 2023: Scam Sniffer","category":["SECURITY"],"content":["Crypto phishing activities increased during 2023, with scammers using wallet drainer malware to siphon nearly $300 million from victims, according to blockchain security firm Scam Sniffer.","In a <a href=\"https:\/\/drops.scamsniffer.io\/post\/scam-sniffer-2023-crypto-phishing-scams-drain-300-million-from-320000-users\/\" data-v-f87c67ca=\"\">report<\/a>, Scam Sniffer identified that wallet drainers stole $295.5 million in crypto assets from more than 324,000 victims over the past year — with the largest amount stolen from a single user being $24 million.","The malware is deployed on phishing websites, using services like Cloudflare to mask their actual server addresses. The sites are designed to trick users into signing malicious transactions with their crypto wallets, enabling the scammers to steal their funds.","Notably, when older wallet drainers exit the scene, others swiftly take their place — compounding the cycle of phishing activities throughout the year.","<span data-v-f87c67ca=\"\">Wallet drainer trends. Image: <a href=\"https:\/\/drops.scamsniffer.io\/post\/scam-sniffer-2023-crypto-phishing-scams-drain-300-million-from-320000-users\/\" data-v-f87c67ca=\"\">Scam Sniffer<\/a><\/span>.","The latest example came just yesterday, with Bill Lou, CEO and co-founder of security-focused crypto wallet app Nest, falling victim to a crypto phishing scam that <a href=\"https:\/\/www.theblock.co\/post\/269913\/crypto-wallet-founder-loses-125000-fake-lfg-phishing-attack\" data-v-f87c67ca=\"\">drained<\/a> 52 stETH ($125,000) from his MetaMask wallet. The attack was related to a fake airdrop guide for the new LFG token, which seeks to onboard Ethereum big fee spenders to Solana.","Phishing methods included hacking crypto projects’ front-end websites or official X and Discord accounts to generate traffic to malicious sites. Alternatives included airdrops of NFTs or tokens, spam comments on social media and paid traffic via Google search ads.","“Although hacking attacks have a broad impact, the community often reacts promptly, typically within 10-50 minutes,” Scam Sniffer wrote. “However, airdrops, organic traffic, paid advertising and taken-over Discord links are much less noticeable.”","A handful of wallet drainers dominated this illicit market in 2023, with Inferno Drainer the most “successful,” having stolen $81 million from 134,000 victims since March.","Some $7 million in crypto assets was stolen on March 11 alone, capitalizing on the panic surrounding the <a href=\"https:\/\/www.theblock.co\/post\/218993\/usdc-and-dai-remain-at-about-0-90-following-circles-disclosure-of-funds-at-svb\" data-v-f87c67ca=\"\">USDC stablecoin significantly depegging<\/a> from the U.S. dollar as victims encountered phishing websites impersonating its issuer, Circle. USDC dropped to as low as $0.88 at the time, following Circle's announcement of holding $3.3 billion in reserves at the collapsed Silicon Valley Bank.","Well-known crypto drainer Monkey was used to reportedly drain $16 million in crypto funds before <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">calling it a day<\/a> in February. In a farewell message, its developer said that “all young cyber criminals should not lose themselves in the pursuit of easy money.” They told their clientele to use a rival drainer known as Venom, which was then used to steal $27 million in funds before it stopped offering services in April, according to Scam Sniffer.","NFT drainer <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">Pink<\/a> was responsible for $18 million in stolen funds since March and went on to be used for larger exploits throughout May and June, including on the Discords of Orbiter Finance, LiFi, Flare and Evmos, as well as Steve Aoki’s X account.","MS Drainer, used to steal $59 million from 63,000 victims, and Angel Drainer ($20 million from 30,000 victims) were also among the most notable wallet-draining malware used last year.","Each peak in thefts often coincided with significant crypto events, such as airdrops or security breaches, with malware service providers taking a 20% “drainer fee,” Scam Sniffer said.","Scam Sniffer claims to have scanned nearly 12 million URLs in the past year, identifying about 145,000 malicious web links. Its open-source blacklist now contains almost 100,000 malicious domains.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$125,000","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$59 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$24 million","content":"MONEY"},{"type":"Steve Aoki","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Bill Lou","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"LFG","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Venom","content":"LOCATION"},{"type":"March 11","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$295.5 million","content":"MONEY"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"$0.88","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"$81 million","content":"MONEY"},{"type":"$16 million","content":"MONEY"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["James Hunt","The Block"]}