{"summary":"Jack Dorsey Departs Bluesky’s Board, the Decentralized Social Media Platform He Co-Founded","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/jack-dorsey-departs-bluesky-board.htm","publishDate":"2024-05-06T08:52:18","id":20798,"type":null,"title":"Jack Dorsey Departs Bluesky’s Board, the Decentralized Social Media Platform He Co-Founded","category":["Altcoin News "],"content":["Jack Dorsey, the co-founder of Twitter, has stepped down from Bluesky’s board, the decentralized social media platform he originally envisioned and funded back in 2019 during his tenure as CEO of Twitter.","In a Sunday post on the platform, Bluesky confirmed Dorsey’s departure from its board.","“We sincerely thank Jack for his help funding and initiating the bluesky project. Today, Bluesky is thriving as an open source social network running on atproto, the decentralized protocol we have built,” the post read. ","Notably, neither Bluesky nor Dorsey provided reasons for his departure.","Prior to the official announcement, Dorsey responded with a brief “no” to a query on X about his current status on Bluesky’s board. ","no","— jack (@jack) May 4, 2024","","Meanwhile, Dorsey’s recent activity on X, where he promoted grants for open interest protocols and referred to the social network now owned by Elon Musk as “freedom technology,” garnered attention. ","Observers noted that Dorsey had significantly trimmed down his follow list on the platform, retaining only three individuals: ","Musk, Stella Assange (wife of WikiLeaks founder Julian Assange), and NSA whistleblower Edward Snowden.","Dorsey’s decision to maintain Musk on his follow list, coupled with his endorsement of X, suggests a possible reconciliation between the two tech figures. ","This comes after Dorsey publicly criticized Musk’s management of X last year, expressing disapproval of the board’s decision to sell the platform to him.","Bluesky, initially announced by Dorsey in late 2019, aimed to develop an open and decentralized standard for social media. ","However, it wasn’t until March 2023 that Bluesky entered beta testing, finally becoming available to the public on February 7, 2024. ","Despite its relatively recent launch, Bluesky boasts around 5.6 million users, according to its own statistics.","Dorsey’s departure from Bluesky’s board comes as his payments company Block has shifted its focus from designing chips to developing a full Bitcoin mining system.","As reported, Block has unveiled its accomplishment of designing a standalone three-nanometer (3nm) Bitcoin mining chip and disclosed that it is currently collaborating with a leading global semiconductor foundry to finalize the chip’s design. ","However, the company’s mining project doesn’t stop at chip development. It plans to expand its efforts to include system design as well.","It is worth noting that Dorsey has also been deeply involved in the cryptocurrency space. ","In addition to his role at Twitter, Dorsey served as the CEO of Square Inc., a financial services company that developed the popular mobile payment app, Cash App. ","Under his leadership, Square became one of the earliest mainstream companies to embrace Bitcoin, enabling users to buy, sell, and hold the cryptocurrency directly within the Cash App.","Dorsey’s personal interest in Bitcoin is well-known, and he has been an outspoken advocate for its adoption and potential to revolutionize the financial industry. ","He has often highlighted Bitcoin’s role as a decentralized and inclusive form of currency, advocating for its use as a hedge against inflation and government overreach. "],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Edward Snowden","content":"PERSON"},{"type":"February 7, 2024","content":"DATE"},{"type":"Bluesky","content":"ORGANIZATION"},{"type":"CEO of Square Inc.","content":"ORGANIZATION"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"May 4, 2024","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Stella Assange","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Block","content":"ORGANIZATION"},{"type":"NSA","content":"ORGANIZATION"},{"type":"Jack","content":"PERSON"},{"type":"WikiLeaks","content":"ORGANIZATION"},{"type":"Julian Assange)","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Jack Dorsey","Social media"],"authors":["Ruholamin Haqshanas"]}