{"summary":"Both Main South Korean Presidential Candidates Now Set to Unveil Pro-Crypto Manifestos","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/both-main-south-korean-presidential-candidates-now-set-unveil-pro-crypto-manifestos.htm","publishDate":"2022-01-19T01:00:00","id":20797,"type":null,"title":"Both Main South Korean Presidential Candidates Now Set to Unveil Pro-Crypto Manifestos","category":["Bitcoin News "],"content":[" ","Crypto is set to become a key political battleground in South Korea, where both of the leading candidates in March’s presidential elections are set to showcase a number of crypto-related policies. And although politicians’ manifestos promises are not always adhered to the letter in any part of the world, it appears that a changing of the guard is very likely in terms of crypto in South Korea.","The government of the incumbent President Moon Jae-in has taken a hardline stance on crypto, banning initial coin offerings (ICOs), introducing one of the strictest set of policies governing crypto exchanges, and at times even mooting a nationwide ban on trading. But the nation goes to the polls on March 9 – and crypto is now a front-and-center issue on the campaign trail.","As reported, Lee Jae-myung, of the ruling Democratic Party, has attempted to woo younger voters with a range of pro-crypto policies, and talk of creating an international crypto “hub” via pro-business strategies. Lee has even spoken of creating a national cryptoasset with a view to distributing it to the public.","The latest Realmeter opinion poll data suggests that his strategy is working: After a poor end to 2021, Lee began the year ahead of his rival Yoon Suk-yeol of the main opposition People’s Power Party for the first time, leading 40.9% to 39.2%. Like the UK, South Korea is a de facto two-party state, meaning that barring an electoral miracle, either Yoon or Lee will take power in spring.","However, it appears that Yoon will not stand idly by as his rival dazzles the youth and business communities with progressive policies – and has decided to strike back with crypto-related pledges of his own.","Money Today reported that Yoon will give a speech on January 19 outlining his full stance on crypto and his vision for the industry – some two weeks ahead of schedule. It appears that Yoon is now desperate to prevent Lee from casting himself as a hero among the crypto community.","The report stated that political sources had indicated that the speech will see Yoon promise to “create an environment in which cryptoasset investors can invest with confidence.”","The sources indicated that the decision to bring forward the speech had been made due to the fact that Lee had scheduled a meeting with the CEOs of the nation’s four biggest crypto exchanges in the morning of the same day.","The media outlet claimed Yoon’s promises are “likely to include measures” aimed at “protecting investors,” as well as policies aimed at bolstering the fledgling non-fungible token (NFT) and metaverse sectors.","Yoon is also set to set out policies aimed at the “revitalization” of the blockchain and the crypto exchange industries.\n___\nLearn more: \n– 2022 Crypto Regulation Trends: Focus on DeFi, Stablecoins, NFTs, and More\n– Spanish MP Asks Government to Take in Fleeing Kazakhstan Bitcoin Miners\n\n– Hillary Clinton Argues Crypto Could Destabilize Nations, Currencies\n– Modi Says Bitcoin in the ‘Wrong Hands’ Can ‘Spoil Our Youth’ as India Readies a CBDC"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Lee","content":"PERSON"},{"type":"39.2%","content":"PERCENT"},{"type":"Yoon","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"40.9%","content":"PERCENT"},{"type":"Democratic Party","content":"ORGANIZATION"},{"type":"Moon Jae","content":"PERSON"},{"type":"Lee Jae","content":"PERSON"},{"type":"People’s Power Party","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fleeing Kazakhstan Bitcoin Miners\n\n– Hillary Clinton Argues Crypto Could Destabilize Nations","content":"ORGANIZATION"},{"type":"Yoon Suk","content":"PERSON"},{"type":"January 19","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"March 9","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"Stablecoins","content":"LOCATION"},{"type":"Modi Says Bitcoin","content":"PERSON"}],"hashtag":["Cryptocurrency","Politics","Regulation","South Korea"],"authors":["Tim Alper"]}