{"summary":"Cardano Price Forecast as $400 Million Trading Volume Comes In – Can ADA Recover to $3 in 2023?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cardano-price-forecast-as-400-million-trading-volume-comes-in-can-ada-recover-to-3-in-2023.htm","publishDate":"2023-01-31T12:00:00","id":20793,"type":null,"title":"Cardano Price Forecast as $400 Million Trading Volume Comes In – Can ADA Recover to $3 in 2023?","category":["Altcoin News "],"content":["Cardano’s price holds firmly against the US dollar while exchanging hands at $0.374. ADA, the token powering the Cardano ecosystem, is up 52% in 30 days and has managed to hold onto a 7% increase in value over the last 14 days.","Despite this bullish report, the launch of Djed, the first stablecoin on the Cardano blockchain, failed to cause a positive price change. Nevertheless, its impact cannot be brushed off immediately and may eventually trigger a rally as investors gradually embrace Djed.","Cardano is a $12.9 billion crypto ecosystem, currently holding in the eighth position and commanding over $400 billion in trading volume. Although ADA price has remained relatively unchanged over the last 24 hours, its bullish outlook seems intact.","Therefore, bulls only need to reach above $0.40, where they are likely to unlock the bullish potential and open the door to gains first, aiming for $1.00 in the coming weeks, possibly months, and $3 by the end of 2023.","Cardano’s price has been dealing with resistance at $0.40 for a few days, although it is teetering at $0.374 at the time of writing. The smart contracts token has sustained an uptrend for over three weeks in January, with this week being the only one in the red.","ADA is not the only token lacking the momentum to carry on with the uptrend, considering all the top ten cryptocurrencies are in the red on Tuesday, apart from Dogecoin, whose price is up 7.4%.","Across the board, investors are waiting with bated breath on the outcome of the United States Federal Open Market Committee (FOMC) meeting, kicking off today. Market watchers expect an interest rate hike of 25 basis points, down from the previous 50 basis points. This change would reflect the overall feeling that inflation is going down in the greenback nation.","The US Consumer Price Index (CPI) reported a drop in inflation from 7.1% posted for November to 6.5% in December—monitored annually. Although this data is not strictly positive for the global economy, it shows that things are starting to move in the right direction – a situation likely to result in minor rate hikes going forward.","A decrease in rate hikes is a positive sign for investors to start directing more money to riskier assets like cryptocurrency. Therefore, crypto assets like Cardano may experience a slump in liquidity ahead of the Fed decision on interest rates later on Wednesday.","The Moving Average Convergence Divergence (MACD) indicator dons a buy signal on the weekly time frame chart. This call to investors to buy ADA came into the picture after the MACD line in blue flipped above the signal line in red at the beginning of the year. The ongoing movement, closing in on the mean line at 0.00, cements the bullish grip on Cardano’s price.","Traders should also be on the lookout for the MACD’s incoming flip into the positive region. Such a move would be highly bullish for Cardano price as it will tap freshly created momentum for gains eying $1 in the medium-term and $3 in the long term.","Similarly, Cardano price is trading above the first multi-month trading, drawn on the daily time chart, as illustrated below. Breaking above this resistance line allowed bulls to fully assume the reins which helped them to keep the rally from December’s bottom at $0.24 intact until $0.40.","Failure to break and hold above the seller congestion at $0.4 prematurely stopped the Cardano price rally. ADA is trading at $0.374 while searching for a suitable support area, preferably above $0.35.","It is important for investors not to lose sight of the bigger picture because a spike above $1 in the coming weeks is still in the cards. Notice the Money Flow Index (MFI) holding at the lower range of the overbought region. This position reveals buyers still have the upper hand despite the minor pullback from $0.40.","If investors hold onto their positions and brave the mundane activities in the crypto market for the next few days, a breakout could follow towards the end of the week, with Cardano price likely to reach $0.50.","Traders should also be looking out for two things: A clear break and hold above $0.40 and another above the upper falling trend line. The bullish grip on ADA price will tighten further if the 50-day Exponential Moving Average (EMA) (in red) crosses above the 100-day EMA (in blue), possibly in the next few days.","On the other side of the fence, a sell signal from the MACD on the daily time frame chart might help investors factor in the ongoing pullback. However, if the MACD line in blue persistently holds below the signal line in red, declines could soar, forcing Cardano price to seek support at $0.30.","Buy Cardano Now","Investors looking forward to buying Cardano as it consolidates, may want to consider other high-potential crypto projects alongside ADA.","Here are the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:",""],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"$0.374","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"7.4%","content":"PERCENT"},{"type":"6.5%","content":"PERCENT"},{"type":"$0.4","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"52%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"$0.35","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$0.30","content":"MONEY"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"$1.00","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"MACD","content":"ORGANIZATION"},{"type":"United States Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"7.1%","content":"PERCENT"},{"type":"Cardano","content":"PERSON"},{"type":"last 14 days","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"Cardano Now","content":"ORGANIZATION"},{"type":"Cardano blockchain","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"MFI","content":"ORGANIZATION"},{"type":"$0.50","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$0.24","content":"MONEY"},{"type":"$400 billion","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$12.9 billion","content":"MONEY"},{"type":"ADA","content":"ORGANIZATION"}],"hashtag":["ADA","Cardano"],"authors":["John Isige"]}