{"summary":"Tether has responded to CoinDesk&#x27;s intervention submission, claiming the conflict is between Tether and the NYAG. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133103\/tether-responds-to-coindesks-intervention-in-ongoing-reserves-information-case","publishDate":"2022-02-05T12:02:02","id":208,"type":null,"title":"Tether responds to CoinDesk&#x27;s intervention in ongoing reserves information case","category":["LEGAL"],"content":["Tether has responded to CoinDesk's intervention submission in the latest filing related to the freedom of information court battle, claiming the conflict centers on its settlement agreements with the NYAG — not the arguments of the news outlet.&nbsp;","CoinDesk formally joined the legal proceedings between Tether and the New York Attorney General last month, vying to become an official party in the case since its Freedom of Information Law (FOIL) requests (FOIL) sit at the center of the dispute. In its latest filing, Tether argues that the conflict rests on facts of the agreement between the firm and the NYAG, and that the news outlet shouldn't be able to \"renegotiate\" the terms by inserting itself into the case.","The conflict began in June of last year, when the news outlet filed a Freedom of Information Law request (FOIL), asking for documents detailing Tether's reserve breakdown. Tether and its parent company iFinex submitted this information to the NYAG as part of a <a href=\"https:\/\/www.theblockcrypto.com\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">settlement agreement<\/a> in February over the alleged co-mingling of funds. New York's Freedom of Information Law enables members of the public to request access to government records.","At first, the FOIL officer denied the request, but CoinDesk won access on an appeal. Tether <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116170\/tether-asks-court-to-block-request-by-coindesk-for-nyag-disclosure-documents\" data-v-f87c67ca=\"\">responded<\/a> by asking a New York court to compel the NYAG to deny the request on the grounds that the requested information constituted trade secrets, could compromise its competitive edge and damage relationships. As the conflict centers on CoinDesk's request, the news outlet <a href=\"https:\/\/www.theblockcrypto.com\/post\/129602\/coindesk-formally-joins-tether-freedom-of-information-case-in-new-york-tether-responds\" data-v-f87c67ca=\"\">petitioned<\/a> to intervene or become a stated party in the case, which allows it to present its own evidence and arguments.&nbsp;","At the time, Tether responded in a statement pointing out that CoinDesk shares an investor, Digital Currency Group, with stablecoin issuer and Tether competitor Circle. After the statement, CoinDesk updated its coverage of the legal case with disclosure of DCG's investment.","Tether's <a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=pYRQ1b8caIwVBKz82VRYuQ==\" data-v-f87c67ca=\"\">filed response<\/a> to CoinDesk's intervention makes similar mention of the alleged conflict of interest.&nbsp;","\"While CoinDesk tells this Court that it 'adheres to strict rules of journalistic ethics' its own reporting on this proceeding did not disclose to its readers this glaring conflict of interest, until Tether and others complained,\" said the filing.&nbsp;","Tether uses this to support its argument that the reserve documents do constitute trade secrets and could cede advantage to competitors like Circle.&nbsp;","\"No private business would disclose publicly the investment strategies critical to its profitability and ability to differentiate itself from the competition,\" said the filing. \"Doing so would give the competition unfair insight that could be exploited.\"","Furthermore, Tether contends that the powers to resolve the conflict remain with the NYAG, since the settlement agreement it made with the office sets the terms of public disclosure. Tether contends that because the question at hand is whether or not the NYAG should produce the documents, and CoinDesk does not have the power to produce those documents, it should not be on equal footing in the case. Because the NYAG procedure initially rejected the FOIL request, Tether contends that the procedure shouldn't be manipulated by CoinDesk's intervention.","\"The only true Respondents here are the ones named in the Petition (OAG and the individual Appeals Officer),\" said the filing. \"The Court should therefore disregard CoinDesk labeling itself as a Respondent, and at all events should not allow CoinDesk’s misleading labels to alter OAG’s clear procedural default—which is grounds alone to grant the Petition [to block access].\"","It goes on to point out that the material arguments are the ones centering on the existing settlement between itself and the NYAG, stating, \"CoinDesk should not be able to insert itself after the fact to essentially renegotiate the agreed terms.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"}],"hashtag":["TETHER"],"authors":["Aislinn Keely","The Block"]}