{"summary":"European Traditional Finance Banks Join Forces for Blockchain-Based Digital Bonds Trading Platform","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/european-traditional-finance-banks-join-forces-for-blockchain-based-digital-bonds-trading-platform.htm","publishDate":"2023-04-04T10:59:00","id":20800,"type":null,"title":"European Traditional Finance Banks Join Forces for Blockchain-Based Digital Bonds Trading Platform","category":["Blockchain News "],"content":["Major European banks SEB and Crédit Agricole have launched: so | bond, a new blockchain-based platform for issuing digital bonds in the traditional financial sector.","The new platform, said to be a “sustainable and open” blockchain, aims to improve efficiency and enable real-time data synchronization across participants, a joint announcement from the two banks on Monday said.","Instead of relying on traditional consensus mechanisms like Proof-of-Stake (PoS) or Proof-of-Work (PoW), the new platform uses a validation method the banks have called “Proof of Climate awaReness.”","According to the banks, the method will incentivize participants to minimize their so-called climate footprint, but it remains unknown how secure or decentralized it is.","The so | bond platform enables issuers to raise capital and manage securities through smart contracts, which automatically execute, control, or document events and actions according to the terms of the contract.","The intention is that the open and transparent nature of the system will foster trust between market participants and allow further innovations to happen.","Commenting on the launch, Anna Sjulander, Head of SSA DCM (sovereigns, supranationals and agencies debt capital markets) at SEB, said the new platform will allow the banks to study what digital assets will mean for traditional finance firms.","“The launch of the digital bond platform is an important step for SEB, and for the issuers and investors that join the platform, and will allow us to gain insights into what the innovative space of digital assets mean for the financial services industry,” she said, while adding that that the goal is to expand use cases in the future:","“We see this as a great opportunity to learn what the future entails in terms of transparency, faster processing and operational simplifications, and will use a bond as the first stepping stone before expanding the use of the platform to other asset classes.”","The platform and blockchain technology were developed in collaboration with IT provider Finaxys, while the environmental footprint is measured according to a methodology developed by APL Data Center and applied by SGS, a world-leading certification firm.","So|bond is the first use case of this new technology operating under the Proof of Climate awaReness protocol in global capital markets."],"entity":[{"type":"Monday","content":"DATE"},{"type":"SGS","content":"ORGANIZATION"},{"type":"SEB","content":"ORGANIZATION"},{"type":"SSA","content":"ORGANIZATION"},{"type":"APL Data Center","content":"ORGANIZATION"},{"type":"Anna Sjulander","content":"PERSON"}],"hashtag":["Europe"],"authors":["Fredrik Vold"]}