{"summary":"Arbitrum Dominates with Nearly 50% of Ethereum Layer 2 Total Value Locked","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/arbitrum-dominates-with-nearly-50-of-ethereum-layer-2-total-value-locked.htm","publishDate":"2024-01-10T14:21:24","id":20802,"type":null,"title":"Arbitrum Dominates with Nearly 50% of Ethereum Layer 2 Total Value Locked","category":["Altcoin News "],"content":["The Ethereum-based layer 2 network Arbitrum has shown significant strength in the market, with its native token, ARB, outperforming a number of other smart contract tokens over the past 30 days.","According to data from CoinMarketCap, ARB has now risen some 75% during the 30-day period, outperforming the likes of Optimism’s OP token, Solana’s SOL, and BNB.","One key factor contributing to Arbitrum’s strength is its dominance in terms of total value locked (TVL) among layer 2 networks built on top of Ethereum.","According to data from decentralized finance L2Beat, Arbitrum now has a market share of 49.17% among layer 2 networks, far surpassing number two on the list, Optimism Mainnet, with its 28.85% market share.","The network has also seen a consistent increase in its TVL at least since October last year, rising about 50% from $1.66 billion in October to the current value of $2.51 billion, data from DeFi tracking site DefiLlama showed.","The upcoming Ethereum Dencun upgrade, incorporating changes proposed by EIP-4844, is expected to reduce rollup transaction costs, benefiting layer 2 solutions like Arbitrum by lowering gas fees and improving network capacity.","Despite a recent pullback after reaching an all-time high of $2.11 on January 4, ARB’s daily chart reveals a potential bull flag formation.","The bull flag is generally seen as a continuation pattern, with price expected to resume its previous bullish trend once it breaks out of the pattern.","At the time of writing on Wednesday, ARB traded at $1.95, up an impressive 11.7% for the past 24 hours and up 3% for the past 7 days."],"entity":[{"type":"4844","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"January 4","content":"DATE"},{"type":"$1.95","content":"MONEY"},{"type":"11.7%","content":"PERCENT"},{"type":"49.17%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$1.66 billion","content":"MONEY"},{"type":"October last year","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$2.11","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"28.85%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"$2.51 billion","content":"MONEY"}],"hashtag":["Arbitrum","Ethereum"],"authors":["Fredrik Vold"]}