{"summary":"What Happens if the SEC Brands ETH a Security?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/what-happens-if-the-sec-brands-eth-a-security.htm","publishDate":"2024-03-26T04:12:30","id":20803,"type":null,"title":"What Happens if the SEC Brands ETH a Security?","category":["Ethereum News "],"content":["The status of Ethereum is in limbo – currently ETH is not considered a security by the U.S. Securities and Exchange Commission (SEC) — but this could all change very quickly.","Ethereum is viewed as a decentralized cryptocurrency, rather than a security. However, regulatory agencies like the SEC continue to monitor the cryptocurrency space and may provide further guidance and sudden change or new rulings in the future. It’s essential to stay updated on regulatory developments.","It has been widely reported that a number of U.S. based companies have received subpoenas attempting to label ETH as a security.","Kenzi Wang, the co-founder and general partner at Symbolic Capital, told Cryptonews, it is highly unlikely the SEC will classify Ethereum as a security. Wang explains, the SEC now classifying ETH as a security would not only undo years of precedent, but also be directly contradictory to their partner regulatory body the Commodity Futures Trading Commission (CFTC).","“While the SEC continues to levy vague statements about the potential security status of ETH, the CFTC has clearly stated that they view ETH as a commodity — most clearly in 2022 filings around the FTX\/Alameda investigation,” said Wang. ","The SEC itself approved ETH futures trading on regulated exchanges more recently in late 2023. During this approval process, the SEC took no action to change the commodity classification of ETH by the CFTC, explains Wang. ","“Misalignment between these two regulators [SEC and CFTC] is not only harmful to the public, but also a major reason why we don’t see the SEC moving forward with security classification of ETH,” argues Wang.","Several applications have been submitted for a Ethereum exchange-traded fund (ETF) with the SEC and the decision for approving or denying the products has been pushed back which is in line with analyst expectations.","The SEC now has until May 23 to approve or reject VanEck’s ETF application for an Ethereum ETF tracking the world’s second-largest cryptocurrency.","HANetf founder and co-CEO Hector McNeil told Cryptonews, the SEC will use the review of ETH as a security to delay its decision to approve ETH ETFs by “kicking the can down the road.”","If the SEC moves ahead to reclassify ETH as a security this would terminate any SEC applications with ETH ETFs in its current form, explains Laurent Kssis, head of CEC Capital.","“You cannot change an asset overnight from commodity to securities as the ETH futures are considered defacto non-security and not within the scope of the CFTC and not within its regulatory framework,” adds Kssis.","“A security is a representation of a slice of ownership of or rights to an asset or a company. Transferring ownership of an asset to a blockchain and assigning it a token is called tokenisation,” explains Kssis.","Combining the two ideas creates a security token, a digital representation of ownership of or rights to an asset that has been tokenised and stored on a blockchain.  An investment asset, a security token is a digital asset that represents ownership or other rights. It transfers value from an asset or bundle of assets to whoever holds the private keys to the token.","“In plain language, security tokens are the digital form of traditional investments like stocks and bonds. Tokens are viewed as securities by regulators when they meet the criteria set by the Howey test; that is, there is an investment of money, a common enterprise, and a reasonable expectation of profit through the effort of others,” adds Kssis.","Ethereum’s native token, ETH, was developed to be used to pay transaction fees within the Ethereum network therefore ETH is a cryptocurrency. However, because it is being traded on exchanges and held for its increasing value, investors treat it as a security token. These tokens, like stocks, must be registered with the SEC.","If the SEC does re-classify ETH as a security this will trigger de-listing.","Oliver Gale, co-founder and CEO of Panther, explains: “ETH is not a security – the ICO was a sale of securities,” adding “long term, decentralisation and global competition wins.”"],"entity":[{"type":"Oliver Gale","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"Laurent Kssis","content":"PERSON"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Hector McNeil","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Kssis","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Cryptonews","content":"PERSON"},{"type":"CEC Capital","content":"ORGANIZATION"},{"type":"Kenzi Wang","content":"PERSON"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"May 23","content":"DATE"}],"hashtag":["Crypto Regulation","Ethereum","Securities Exchange Commission"],"authors":["Tanzeel Akhtar"]}