{"summary":"Solana Presale Scams Take a Toll as Meme Coin Season Continues","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-presale-scams-take-a-toll-as-meme-coin-season-continues.htm","publishDate":"2024-03-20T12:18:30","id":20801,"type":null,"title":"Solana Presale Scams Take a Toll as Meme Coin Season Continues","category":["Altcoin News "],"content":["There has been a surge in presale scams amid the meme coin season on the Solana (SOL) blockchain, which continues in full force.","In a recent post on X, crypto detective ZachXBT highlighted several presale coins that have raised concerns due to fraudulent activities and suspicions of being rug pulls. ","One instance involves X user @Sartoshi0x, who received 7,000 SOL as part of a presale but secretly kept 62% of the funds without distributing the tokens as promised. ","Another incident saw 2,100 SOL sent to a fake Jared MEV bot account (@Jared_eth).","Additionally, @bluekirbyftm, named after a scammer, also conducted a rug pull on their presale, initially claiming they would refund investors but later reneging on that promise.","Furthermore, @Vombatus_eth is responsible for yet another rug pull after a 13,000 SOL presale. ","Let’s check in on a few of the recent presale coins","-7000 SOL sent to @Sartoshi0x who secretly pocked 62% of SOL from presale & did not fully distribute tokens","-2100 SOL sent to @Jared_eth a fake Jared MEV bot account (people sent another fake Jared account $440K for a presale… https:\/\/t.co\/3TNwcpNkh8 pic.twitter.com\/YyVkwcN9fS","— ZachXBT (@zachxbt) March 19, 2024","","The surge in Solana meme coin presale scams comes as these events have amassed a staggering $150 million in SOL from only 33 presales. ","Despite the allure of quick gains, ZachXBT emphasizes that many of these projects, often promoted by smaller accounts, are either dubious or outright scams.","Moreover, the lack of transparency and accountability within the meme coin space on Solana heightens the risk for investors owing to the prevalence of rug pulls and disappearing funds. ","Andrei Grachev, Managing Partner at DWF Labs, has also recently cautioned against such token presales. ","“This ‘send coins to this address for presale’ reminds me 2017 ICO boom,” he wrote on X. ","“It happens always when a lot of people become rich accidentally. It’d FOMO until money change their owners. Remember, you made money because someone made wrong decisions.” ","Expressing uncertainty over the future of such ICOs, he concluded, “Very risky game, DYOR.”","This “send coins to this address for presale” reminds me 2017 ICO boom. It happens always when a lot of people become rich accidentally. It’d FOMO until money change their owners. Remember, you made money because someone made wrong decisions.\nVery risky game, DYOR","— Andrei Grachev (@ag_dwf) March 19, 2024","","Solana, a blockchain platform known for its low transaction costs, has emerged as a preferred venue for trading meme coins. ","According to data from CoinGecko, the Solana meme coin sector has surged by 10% over the past week. ","The platform has seen a wave of new coins featuring caricatures of public figures like Joe Biden and Donald Trump. ","The viral story of a trader turning $260 into nearly half a million dollars with ‘Jeo Boden’ sparked the creation of coins like ‘Doland Tremp’ and ‘Olen Mosk.’ ","The Solana blockchain’s red-hot meme coin dogwifhat (WIF) has also recently become the fourth-largest meme coin by market capitalization. ","This came after community members successfully raised over $690,000 in USDC stablecoin donations to showcase the dogwifhat mascot on the Sphere, a renowned entertainment venue in Las Vegas. "],"entity":[{"type":"Jared MEV","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Olen Mosk","content":"PERSON"},{"type":"million dollars","content":"MONEY"},{"type":"Doland Tremp’","content":"ORGANIZATION"},{"type":"62%","content":"PERCENT"},{"type":"Donald Trump","content":"PERSON"},{"type":"$690,000","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$440K","content":"MONEY"},{"type":"March 19, 2024","content":"DATE"},{"type":"Andrei Grachev","content":"PERSON"},{"type":"Joe Biden","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Jared","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$260","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"Jeo Boden","content":"PERSON"}],"hashtag":["Crypto Presale","crypto scam","Solana"],"authors":["Ruholamin Haqshanas"]}