{"summary":"Bitcoin Blasts Back Above $35,000 as Bulls Regain Control After Fed Holds Interest Rates","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-blasts-back-above-35000-as-bulls-regain-control-after-fed-holds-interest-rates.htm","publishDate":"2023-11-01T21:22:12","id":20817,"type":null,"title":"Bitcoin Blasts Back Above $35,000 as Bulls Regain Control After Fed Holds Interest Rates","category":["Bitcoin News "],"content":["The Bitcoin (BTC) bulls have regained control to push the price of the world’s largest cryptocurrency by market capitalization back above $35,000, following a volatile trading session packed with important macro risk events, including the latest policy announcement from the US Federal Reserve.","The Fed delivered no surprises when opting to hold interest rates at multi-decade highs of 5.25-5.5%, with a bias to potential further interest rate hikes amid ongoing concerns about inflation that remains sticky above their 2.0% target amid a still strong US economy.","Prior to the meeting, the bitcoin market had been a state of balance for around one week, swinging within a $34,000 to $35,000 range, following October’s pump from lows in the $26,000s.","With the Fed meeting out of the way and having delivered no curve balls to the market, the bulls have apparently seen the green light to begin their buying spree once again.","Bitcoin pumped 28.5% in October amid optimism that the US SEC will soon approve BlackRock and other major asset managers’ spot Bitcoin ETF applications, which industry observers think would open the door to a flood of institutional inflows to the Bitcoin market.","Bitcoin’s strong October performance came despite broadly unfavorable trends in the broader macro landscape, such as falling stock prices and rising bond yields.","In recent years, Bitcoin has been positively correlated to stocks (particularly tech) and negatively correlated to US bond yields.","But the narrative long promoted by Bitcoin maximalists that the cryptocurrency should actually be viewed as a safe haven against economic and geopolitical woes has gained ground this year, with major Wall Street leaders like BlackRock’s Larry Fink praising Bitcoin for having digitized gold.","Bitcoin’s strong October performance despite weakness in stocks certainly strengthened the argument that the cryptocurrency is a tailwind.","However, stocks are pumping and US bond yields are dumping on Wednesday as traders digest the latest news from the Fed and focus apparently switches to the expected start of a rate cutting cycle in 2024.","If November is characterized by rising stock prices and falling yields, the broader macro picture could add to the tailwinds that Bitcoin has already been enjoying in recent weeks.","With Bitcoin having vaulted above $35,000, it has now convincingly broken to the north of the pennant structure it had formed over the past few days.","The next major level the bulls will be targeting on the charts is the psychologically important $40,000 level, which marks the early May 2022 highs.","Beyond that, there are mid-April 2022 highs at $43,000 and then the 2022 highs above $48,000.","It’s a big if, because the Fed wasn’t anything close to dovish on Wednesday, but if macro is about to become more of a structural tailwind for crypto (i.e. easing financial conditions), that coupled with Bitcoin specific bullish narratives like institutional adoption and the upcoming halving should keep price risks tilted firmly to the upside for BTC.","Bitcoin is already up over 110% this year.","But in the next two months, if BTC can reach the aforementioned key long-term resistance levels, we could be talking about gains of close to 200% for the year."],"entity":[{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"110%","content":"PERCENT"},{"type":"$34,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"US SEC","content":"ORGANIZATION"},{"type":"$35,000","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"$48,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"$43,000","content":"MONEY"},{"type":"2.0%","content":"PERCENT"},{"type":"$26,000","content":"MONEY"},{"type":"200%","content":"PERCENT"},{"type":"28.5%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Blackrock","btc","SEC"],"authors":["Joel Frank"]}