{"summary":"Peter Schiff Says It’s “Not Looking Good” For Bitcoin HODLers After Price Slump","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/peter-schiff-says-its-not-looking-good-for-bitcoin-hodlers-after-price-slump.htm","publishDate":"2024-04-25T22:06:44","id":20816,"type":null,"title":"Peter Schiff Says It’s “Not Looking Good” For Bitcoin HODLers After Price Slump","category":["Bitcoin News "],"content":["Eternal gold bug Peter Schiff’s Bitcoin take isn’t good. He had a fierce warning for Bitcoin’s faithful on Wednesday, claiming the digital asset is on the verge of losing substantial and precarious technical price support.","The popular economist and financial commentator tweeted that it’s “a long way down” if Bitcoin’s price drops below $60,000 again.","“It’s not looking good for HODLers,” wrote Schiff. “All the hard-core Bitcoiners are used to big drops. But the newbies who own the ETFs are in for a rude awakening.”","It's not looking good #HODLers. You guys need to hope #Bitcoin can hold $60K. Otherwise it's a long way down. All the hard core Bitcoiners are use to big drops. But the newbies who own the ETFs are in for a rude awakening. pic.twitter.com\/Dw6mJXXi3r","— Peter Schiff (@PeterSchiff) April 24, 2024","","Excitement preceding the launch of Bitcoin spot ETFs in January, alongside their actual launch, has helped propel the price of Bitcoin by 128% over the past year. The ETFs themselves have seen $12.2 billion of net flows since launch.","However, ETF flows have stagnated over the past month, while Bitcoin has mostly traded sideways between $60,000 and $70,000. Volatility in the stock market spurred by geopolitical instability in the Middle East also affected the crypto market.","Similarly to Schiff, lead Glassnode analyst James Check said last week that the Bitcoin market could turn “top-heavy” if the price declines below $58,800. This level represents the “short-term holder cost basis” – the entry point of many recent Bitcoin buyers, and a point at which they’ll panic sell if that price is lost.","Regardless, Check expects that cost-basis to hold as a line of support.","“If we assume this is a resilient uptrend, we should expect the short-term holder cost basis to hold, somewhere in that $58,000 to $59,000 region,” he said at the time.","Schiff has rarely been positive about Bitcoin, prompting crypto bulls to mock the investor for years. He argues that Bitcoin cannot be used as money since it has no non-monetary use case, unlike gold, which can be used in jewelry and for industrial purposes.","Following last week’s Bitcoin “halving,” the digital asset’s inflation rate fell decisively under that of gold, arguably making it a better store of value for holders than the precious metal.","Schiff, as always, expressed skepticism.","“I think halving is an appropriate name for what’s happening as soon #Bitcoin HODLers will experience a halving of their net worths,” he said."],"entity":[{"type":"Middle East","content":"LOCATION"},{"type":"$60,000","content":"MONEY"},{"type":"Check","content":"ORGANIZATION"},{"type":"$59,000","content":"MONEY"},{"type":"April 24, 2024","content":"DATE"},{"type":"Peter Schiff","content":"PERSON"},{"type":"Bitcoiners","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"$58,800","content":"MONEY"},{"type":"128%","content":"PERCENT"},{"type":"$12.2 billion","content":"MONEY"},{"type":"$58,000","content":"MONEY"},{"type":"$70,000","content":"MONEY"},{"type":"James Check","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$60K","content":"MONEY"},{"type":"Schiff","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Peter Schiff"],"authors":["Andrew Throuvalas"]}