{"summary":"Here’s The Latest NFT News Today","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nft-news-today.htm","publishDate":"2024-04-15T11:00:49","id":20813,"type":null,"title":"Here’s The Latest NFT News Today","category":["NFT News "],"content":["Get your daily, bite-sized digest of NFT news today – investigating the stories flying under the radar among the latest NFT news.","Here’s the latest form NFT news today:","The non-fungible token (NFT) sales volume is down 24% over the last 24 hours, now standing at $35,628,790.","While the number of sellers is down 1%, buyers and transactions are up 3% and 9%, respectively, according to CryptoSlam.","Half of the top 10 collections by sales are up today.","Among these green coins, Bored Ape Yacht Club’s sales increased the most over the past day: 227% to $954,303.","Pudgy Penguins follows it, with an increase of 110% to $864,394.","On the other hand, $PUPS BRC-20 NFTs dropped the most. Its sales fell 71% to $2.6 million.","$WZRD BRC-20 NFTs is next, with a decrease of 37% to $2.5 million.","Meanwhile, when it comes to the top five blockchains, only one has seen an increase in sales. Polygon’s sales are up 76%.","Bitcoin and Ethereum are in the first and second place, respectively.","The former is down nearly 40%, recording sales of $18.4 million over the past day. The latter fell 2% to $7.93 million.","Popular non-custodial crypto wallet MetaMask announced its integration with Daylight API to allow users to find and claim airdrops and NFTs easily.","According to the blog post, they can do so on the “Explore” page in MetaMask Portfolio. There, they will find a section for “Eligible Airdrops.”","The Daylight integration enables all interested users to tap into existing and potential claimables based on their onchain identity.","They can check their eligibility across six networks: Ethereum, Optimism, Arbitrum, Base, Zora, and Polygon.","We’ve also added trending NFT mints based on your onchain activity for collections we think you’ll love. 🧡 No more missing out on the hottest new drops!","Questions? Read all about the integration here: https:\/\/t.co\/WFBkDYYF90","— MetaMask 🦊🫰 (@MetaMask) April 9, 2024","","While it can be difficult to keep track of “all your onchain reapings and hottest NFT collection,” said the team, Web3 “helps us build an identity and social graph that we can leverage to find existing airdrops and new NFTs.”","Daylight API uses a variety of social factors to suggest unique NFT recommendations for each user, it added.","These include: the user is on the allowlist, they hold the required token or a related token, the NFT is made by a popular creator, it’s made by a creator the user has minted from before, it’s minted by someone the user follows on Farcaster, it’s completed by an influencer, it’s trending among holders of a popular NFT collection, and it’s trending onchain.","Users just need to click on each card to learn more about an NFT and mint it if they like it, MetaMask said.","","Massive multiplayer metaverse Wilder World has partnered with the electronics giant Samsung to bring the metaverse, NFTs, blockchain, and gaming experiences to the company’s smart TVs.","Per the announcement, “the primary aim of this partnership is to ensure the global accessibility of Wilder World on Samsung TVs and other hardware.”","This is a shared goal that the partners will collaboratively pursue, they said.","https:\/\/t.co\/tFbauEBY1V","— Wilder World (@WilderWorld) April 12, 2024","","Meanwhile, the integration of Wilder World into the Samsung ecosystem will be a phased process.","It will start with the inclusion of Wilder World assets and information on Samsung platforms like Samsung.com\/de, Gen3.samsung.com, and other upcoming Web3 platforms.","According to the Wilder World team, “by leveraging Samsung’s vast distribution network, we will bring Wilder World into the living rooms of millions, enhancing our distribution and visibility exponentially.”","Founder Frank Wilder commented that the team is creating a next-gen gaming metaverse with an emphasis on immersion and realism.","Therefore, Samsung’s global distribution will help Wilder World in its mission to make the latter “accessible to all.”","Meanwhile, Wilder World is an immersive, open-world metaverse experience. Its economy is built on Ethereum and ZERO tech, utilizing the native WILD token for transactions, governance, and rewards.","The first micro-experience will be focused around the Wheels Racing game and will be released for beta in 2024. The racing game will consist of a win-to-earn model.","To play, players must own a compatible Wilder World NFT, such as a Wheel NFT.","The team plans to enhance accessibility when they launch publicly.","The obtained and traded NFTs create an economy that replicates the tangibility of real-world ownership, said the team.","“The limited nature of NFTs allows our players to buy, sell, and trade with an active community of Wilders, fostering the growth of their Wilder World collection,” it added.","The game has recently gone live on Epic Games as an early-access game.","We’re thrilled to go live on @EpicGames!","A HUGE step forward to making Wilder World for all.","Wishlist us on the Epic Store NOW ⬇️https:\/\/t.co\/ohak6H9Hu7 pic.twitter.com\/fw3AIdi11I","— Wilder World (@WilderWorld) March 28, 2024","","Nova Frontier X, a mobile game developed by The Tipsy Company, will launch its spaceship NFTs on Tuesday, April 16.","According to the website, the NFT collection consists of 9,999 spaceships with different attributes.","Claiming one means owning “a piece of the future with high potential for value appreciation,” the team claims.","Furthermore, owners can boost their earnings with elite spaceships. They can also upgrade their spaceships to explore and conquer ringworlds.","Additionally, legendary spaceships have the ability to transform into robots, “elevating your gameplay and investment value.”","The price of spaceships starts at $400 and goes up to $10,000.","Currently, however, there is a 50% early bird offer on all available ships.","3 DAYS till you can own a Nova Frontier Spaceship! Epic battles, customization, earning potential… This is your ticket to the stars. Mark April 16!","Sign up for the 50% discount: https:\/\/t.co\/dgE9CRGGNk\nSpaceship sale link: https:\/\/t.co\/k8PlHXd1UU pic.twitter.com\/d679VIWxRv","— The Tipsy Company | Nova Frontier | Gate of Abyss (@TipsyCoin) April 13, 2024","","Nova Frontier X is a mobile Web3 game that invites players to “dive into a universe where technology meets opportunity” and to “claim your spaceship and embark on a journey of exploration, advancement, and financial prosperity.”","Players meet characters that include humans, aliens, and AI.","The game will launch on Google Play and Apple App stores.","Tipsy, founder and CEO of The Tipsy Company, told Decrypt that, to download the game, “you create an account with usual credentials, username, password, email address, zero wallet connection.”","Players can connect their wallets to “amplify your gaming experience.” They’ll be able to do this on the web app that the company will be launching.","However, “if you don’t want to connect your wallet, no big deal,” Tipsy said.","He added that Nova Frontier X is not a pay-to-win game, saying: “You can have the best ship out there, but you need to be able to pilot it, you need to be able to control it with micro level precision.”","Over 100,000 users have already signed up for the game’s waitlist.",""],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Wilders","content":"ORGANIZATION"},{"type":"227%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$PUPS","content":"MONEY"},{"type":"April 9, 2024","content":"DATE"},{"type":"110%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"MetaMask Portfolio","content":"ORGANIZATION"},{"type":"The Tipsy Company","content":"ORGANIZATION"},{"type":"March 28, 2024","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"$2.5 million","content":"MONEY"},{"type":"Wheel NFT","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"“Eligible Airdrops","content":"ORGANIZATION"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"” Tipsy","content":"ORGANIZATION"},{"type":"April 13, 2024","content":"DATE"},{"type":"$35,628,790","content":"MONEY"},{"type":"April 16!","content":"DATE"},{"type":"Wilder World","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"$400","content":"MONEY"},{"type":"Base","content":"LOCATION"},{"type":"Frank Wilder","content":"PERSON"},{"type":"76%","content":"PERCENT"},{"type":"Google","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"$7.93 million","content":"MONEY"},{"type":"$18.4 million","content":"MONEY"},{"type":"April 12, 2024","content":"DATE"},{"type":"$864,394","content":"MONEY"},{"type":"37%","content":"PERCENT"},{"type":"Wilder World NFT","content":"ORGANIZATION"},{"type":"WZRD BRC","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"MetaMask","content":"PERSON"},{"type":"Wilder World","content":"ORGANIZATION"},{"type":"$2.6 million","content":"MONEY"},{"type":"$954,303","content":"MONEY"},{"type":"71%","content":"PERCENT"},{"type":"Tuesday, April 16","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"24%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"}],"hashtag":["NFT","NFT Marketplace","NFTs"],"authors":["Sead Fadilpašić"]}