{"summary":"Crypto Bank Meld to Launch Tokenized RWAs to Retail Investors","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-bank-meld-to-launch-tokenized-rwas-to-retail-investors.htm","publishDate":"2024-03-21T07:09:24","id":20821,"type":null,"title":"Crypto Bank Meld to Launch Tokenized RWAs to Retail Investors","category":["DeFi News "],"content":["Crypto online banking company Meld, which received a VASP license in Lithuania, is set to launch tokenized real-world assets (RWA) for retail investors.","The bank will launch borrowing and lending services against tokenized RWA in partnership with German-licensed DeFi platform Swarm Markets.","According to Swarm Markets spokesperson, both Meld and Swarm signed a memorandum of understanding (MoU)","“This could be really interesting as we go into the next bull run, where people can lend against their stocks to ape more into bitcoin, for example,” the source told CoinDesk.","Swarm Markets, which claims to be the world’s first regulated DeFi protocol, operates under regulatory license from the Federal Financial Supervisory Authority (BaFin) in Germany.","Last year, Swarm launched EU-compliant know-your-customer (KYC) solution for tokenized securities and trading to their users under German law. The company launched its permissionless RWA trading platform in December 2023.","With the collaboration Meld aims to introduce cross-asset margining opportunities for retail investors, which lacks in traditional methods.","Meld has a customer base of 75,000, who have signed for early access to its platform. Furthermore, Meld recently received its virtual asset service provider (VASP) license in Lithuania.","Per analysts from digital asset management firm 21.co, tokenized RWA could grow to a staggering $10 trillion in a “bull case” and $3.5 trillion in the “bear case” by 2030.","A report published in October noted that the market is “experiencing an unprecedented growth.”","“The convergence between crypto and traditional asset classes, including fiat currencies, equities, government bonds, and real estate, is experiencing an unprecedented growth.”","The forecast for tokenized assets remains high. According to a Bank of America report, tokenization is likely to transform infrastructure and financial markets. The bank also noted that tokenization could increase efficiencies, reduce costs and optimize supply chains."],"entity":[{"type":"Swarm","content":"ORGANIZATION"},{"type":"Federal Financial Supervisory Authority (BaFin","content":"ORGANIZATION"},{"type":"$3.5 trillion","content":"MONEY"},{"type":"Lithuania","content":"LOCATION"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$10 trillion","content":"MONEY"},{"type":"Germany","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"MoU","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["Meld","RWA","Tokenization"],"authors":["Sujha Sundararajan"]}