{"summary":"Nexus Mutual is exposed to Orthogonal&#x27;s Trading default on Maple Finance for a $3 million loss and seeks to withdraw ETH reserves.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192230\/nexus-mutual-moves-to-divest-expects-3-million-loss-with-maple-finance","publishDate":"2022-12-05T15:11:11","id":2083,"type":null,"title":"Nexus Mutual moves to divest, expects $3 million loss with Maple Finance","category":["DEFI"],"content":["Nexus Mutual expects a $3 million loss from exposure to Orthogonal Trading’s $36 million default on Maple Finance.","Nexus Mutual now seeks to divest from the platform’s wETH pools.","<span data-v-f87c67ca=\"\">The domino effect of companies embroiled in a crypto-lending liquidity crunch that followed the collapse of FTX continues, with Nexus Mutual now seeking to divest from the Maple Finance M11 Credit wETH pool.<\/span>","As it stands, Nexus looks to lose roughly $3 million from its investment position with Maple Finance. The loss may have been minimized due to Nexus having deployed to the wETH pool. Investors in Maple's USDC pool saw as much as an 80% depletion in funds.","“We are extremely disappointed with Orthogonal Trading, given the allegations of financial misrepresentation. Due to this, Nexus Mutual expects a loss of 2461 ETH (15.8% of our investment in Maple) on the Orthogonal loans. We support M11 Credit and Maple in pursuing the appropriate legal action to maximize recovery,”&nbsp;<span data-v-f87c67ca=\"\">Nexus Mutual told The Block in a statement.<\/span>","Nexus is seeking to recover some 15,348 ETH it previously deployed to the M11 wETH pool in an effort to see returns on its digital currency reserves, <a href=\"https:\/\/etherscan.io\/token\/0x1a066b0109545455bc771e49e6edef6303cb0a93?a=0x9164e822db664a1b139f39cc3ecc40aecd276b0f#tokenAnalytics\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Etherscan<\/span><\/a><span data-v-f87c67ca=\"\"> records show.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“We have initiated the process to withdraw available funds. There is a mandatory 10-day waiting period. We expect to recover the majority of the capital deployed into Maple,” Nexus said.<\/span>","<span data-v-f87c67ca=\"\">The M11 Credit arm of Maple Finance that underwrites DeFi contracts and manages the protocol’s wrapped ETH encountered a critical issue after it came to light <\/span><a href=\"https:\/\/www.theblock.co\/post\/192097\/maple-finance-default-orthogonal-trading\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Orthogonal Trading<\/span><\/a><span data-v-f87c67ca=\"\"> funds were tied up with FTX, and that the company would default on $36 million in loans on Maple Finance. Orthogonal’s default represented roughly 30% of loans on Maple’s platform.<\/span>","<span data-v-f87c67ca=\"\">Regarding the Orthogonal nonpayment, Nexus Mutual’s daily operations and capacity to pay claims remain unaffected, according to the company. “Our current understanding is that the Auros loans have a high expected recovery rate and the Flow Traders loans are unimpacted,” Nexus said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Maple","content":"ORGANIZATION"},{"type":"Nexus Mutual","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"Maple","content":"LOCATION"},{"type":"15.8%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$36 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Orthogonal Trading","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}