{"summary":"Crypto Exchange WOO X Raises $9 Million for Strategic Liquidity Boost","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-woo-x-raises-9-million-for-strategic-liquidity-boost.htm","publishDate":"2024-01-18T16:09:20","id":20841,"type":null,"title":"Crypto Exchange WOO X Raises $9 Million for Strategic Liquidity Boost","category":["Blockchain News "],"content":["The crypto exchange Woo has secured $9 million in a recent funding round. The capital injection came from existing and prospective market makers trading platform.","The capital injection aims to enhance liquidity on Woo’s exchange, the company said in a statement published on its website.","In a comment, Woo Co-founder Jack Tan expressed excitement about the extended collaboration with market makers on WOO X. He emphasized the $9 million funding as a testament to their confidence in the platform.","Tan said:","“We anticipate liquidity on WOO X to improve substantially in the next few months, starting with BTC and ETH perpetual futures markets and expanding into altcoin perpetual futures and all spot markets.”","Key participants in the funding round included prominent liquidity providers such as Wintermute and Amber. Such involvement showcases a diverse range of contributors beyond individual market makers.","WOO X transitioned from a single liquidity provider, Taiwan-based market maker Kronos Research, in the third quarter of the previous year. It said in its announcement that this has already contributed to diversifying WOO X’s liquidity source.","Additionally, the crypto exchange plans to launch a designated market maker (DMM) program for spot markets in the first quarter of 2024.","“Collectively, these initiatives will enable WOO X to achieve a 100% custody ratio by Q2 of this year. This will result in eliminating the clause within WOO X’s Terms of Service that permits lending of clients’ assets to market makers. This has been a major request from WOO’s community,” the firm said.","In his comments, Tan further explained that the funds raised will be allocated towards global expansion, product development, and regulatory compliance.","Notably, the exchange intends to prioritize the interests of liquidity providers over capital raising. There will be a specific focus on market makers’ active participation instead of backing from venture capitalists.","The latest funding round follows Woo Network’s successful closure of a $30 million Series A round in 2021.","The platform said at the time that it would use the funds to establish a research and development office in Warsaw, Poland.","In November last year, WOO X temporarily suspended trading on its platform after Kronos Research experienced a security breach. Trading was resumed again after just one day, with Kronos confirming that none of its clients had lost funds as a result of the breach.","Looks possibly like $20.3M+ (12800+ ETH)","0x2b0502FDab4e221dcD492c058255D2073d50A3ae pic.twitter.com\/sLnFA0VXhk","— ZachXBT (@zachxbt) November 18, 2023","",""],"entity":[{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"November last year","content":"DATE"},{"type":"Taiwan","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"$9 million","content":"MONEY"},{"type":"Kronos Research","content":"ORGANIZATION"},{"type":"Warsaw","content":"LOCATION"},{"type":"November 18, 2023","content":"DATE"},{"type":"Poland","content":"LOCATION"},{"type":"third quarter","content":"DATE"},{"type":"$20.3","content":"MONEY"},{"type":"Jack Tan","content":"PERSON"}],"hashtag":["Exchange","Investment"],"authors":["Fredrik Vold"]}