{"summary":"Bitcoin transactions linked to illicit activities – such as dark marketplaces, ransomware wallets or fraudsters – have remained below 1% of the total amount for the past few years, according to new data from Elliptic\nTom Robinson, co-founder and chief scientist of Elliptic, told The Block: “I think this is due to the introduction of anti-money laundering (AML) regulations, the work of law enforcement, and the AML efforts of crypto exchanges and other businesses.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65238\/illicit-bitcoin-transactions-remain-below-1-of-the-total-amount-says-elliptic","publishDate":"2020-05-14T11:50:33","id":2084,"type":null,"title":"Report: Illicit bitcoin transactions remain below 1% of the total amount","category":["Hacks"],"content":["Bitcoin transactions linked to illicit activities – such as dark marketplaces, ransomware wallets, or fraudsters – have remained below 1% of the total amount for the past few years, according to new data from Elliptic.","The blockchain analysis firm said that the percentage of illicit bitcoin transactions has declined from about 35% in 2012 to just less than 1% as of today.","Elliptic said it calculated the USD value of bitcoin transactions directly linked to all the illicit entities in its database monthly from 2012 onward. It applied the BTC\/USD exchange rate at the time of each transaction for USD conversions.","\"To calculate this as a percentage of all BTC sent, we then needed to determine accurate figures for the USD value of BTC sent over time,\" said Elliptic.","","","\"There is a clear downward trend,\" Tom Robinson, co-founder and chief scientist of Elliptic, told The Block. \"I think this is due to the introduction of anti-money laundering (AML) regulations, the work of law enforcement, and the AML efforts of crypto exchanges and other businesses - as well as speculation emerging as the dominant use of crypto.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nElliptic did not share the USD value of illicit bitcoin transactions. Robinson said the firm is seeking to send a message specifically around the proportion linked to criminality. \"We think too much focus is paid to the absolute figures when people should be looking more at the larger context,\" he said.&nbsp;","It is also not clear what percentage of fiat currency transactions are linked to illicit activities. Robinson said bitcoin's blockchain is transparent, but it is \"very difficult\" to track fiat. \"I am not aware of any comparable figures to make a fair comparison,\" he said.","In 2018, Elliptic <a href=\"https:\/\/coincenter.org\/link\/a-new-study-finds-less-than-1-of-bitcoin-transactions-to-exchanges-are-illicit\" data-v-f87c67ca=\"\">produced<\/a> a similar study to conclude that only 0.61% of bitcoin transactions were linked to illicit sources. Last year, Elliptic rival Chainalysis also <a href=\"https:\/\/cointelegraph.com\/news\/515-million-in-bitcoin-spent-on-illicit-activity-this-year-representing-1-of-total-btc-activity\" data-v-f87c67ca=\"\">said<\/a> that just 1% of bitcoin activity is related to illegal activities. It is, however, worth noting that Chainalysis's 2012 figure was 7%, while Elliptic's was 35%.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRobinson said Elliptic has been collecting data on crypto addresses used by various entities. \"This includes both legitimate services such as exchanges, wallets or payment processors, as well as illicit entities... All of our data is backed up by documentary evidence - our customers use it to make compliance decisions, so accuracy is critical,\" he added.&nbsp;"],"hashtag":["BITCOIN"]}