{"summary":"Nigeria and Turkey Biggest Adopters of Crypto in 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-adoption-wordwide-2023-nigeria-turkey-lead-the-way.htm","publishDate":"2024-03-19T12:08:17","id":20845,"type":null,"title":"Nigeria and Turkey Biggest Adopters of Crypto in 2024","category":["Blockchain News "],"content":["Looking into the rate of crypto adoption and the share of cryptocurrency owners in 56 countries as of February 2024, Nigeria and Turkey lead the pack, according to data from Statista.","Notably, selected North American and European countries rank significantly lower. The data was gathered by the Consumer Insights Global Survey of Internet users worldwide.","It includes over 2 million participants from selected countries. More specifically, the survey period was January to December 2023. There were between 451 and 10,048 respondents (18-64 years) per country. The question asked in the survey was:","“Which of these financial products and investments do you currently use\/own?”","Multiple answers were possible.","The top five countries per share of crypto owners span across three continents.Notably, Nigeria and Turkey lead the ranking. The two countries have grabbed a 47% share each.","This is nearly half of their respective populations. Turkey and Nigeria are closely followed by Thailand, with 43% of the population holding crypto tokens.Entering the 30%-40% territory – and completing the top five countries – the survey finds Vietnam in fourth place (39%) and the UAE in the fifth (31%).","Next, Indonesia, Brazil, Argentina, Malaysia, India, Saudi Arabia, South Africa, the Philippines, Switzerland, and Colombia (in that order) took the 29%-20% share. Going lower, the United States is 20th on the list with 18%.","South Korea saw 17%, Australia 16%, and the United Kingdom took the 35th spot with 14%. Meanwhile, Japan had the lowest share of respondents, grabbing just 6%.","Observing continents overall, Africa is home to the fewest countries with significant crypto adoption. But, at the same time, it also has one of the two countries with the highest share.","South America, on the other hand, has shown higher rates of adoption compared to other continents.","Elsewhere, while the adoption is more spread out, there are fewer variations share-wise between individual countries.","There are several highly complex elements that have proved to be vital when it comes to rate and speed at which a region adopts cryptocurrencies. These include socio-economic circumstances (even geo-political ones in certain cases) and the regulatory environment.Per digital asset index provider Clamp, in Nigeria and Turkey, citizens face massive economic challenges, such as high inflation rates, currency devaluation, and limited access to traditional financial services. Therefore, they turn to crypto to:","Nigeria has some 13 million crypto holders, which is more than any other African country, according to VOA. Kenya follows with 4.4 million holders.","Notably, the West African nation has been battling the worst economic crisis in years triggered by surging inflation. By late February, Nigeria’s currency, the naira, went into free fall due to the government’s policies. Its value has plunged 70% to the dollar since June 2023.","It further plummeted to 1,607 to $1 on Thursday, reflecting over a 200% loss of value in the last year. In 2021, the Central Bank of Nigeria (CBN) restricted financial institutions from offering services to crypto companies in the country, citing cybercrimes, money laundering, and a lack of global regulations.","Nigeria has since softened its stance with the Financial Act 2023, which places a tax on digital assets and recognizes them as an asset class. Last year, the central bank reversed its decision and allowed crypto companies to operate in the country.","In January this year, the CBN issued new and strict regulations for banks and other financial institutions that offer domestic accounts for virtual assets service providers (VASPs). But, in February, the authorities cracked down on local exchanges and revoked more than 4,000 licenses after the exchange rate dropped to 1,900 naira to one dollar.","And even more recently, Nigeria has banned end-to-end transactions involving naira on the world’s largest crypto exchange, Binance, prompting economic analysts and crypto enthusiasts to raise concerns. Nigerian authorities accused the company of exploitation, devaluation of the naira, and money laundering.","The critics have argued that the measure might increase youth unemployment in a country struggling with soaring inflation. Furthermore, the majority of the country’s digital asset users and policy watchers opined that the government has “misplaced priorities” and that centralized cryptocurrency exchanges are not the cause of the falling currency.","Public finance expert Isaac Botti said that the transactions on Binance were:","“a result of our reckless demand and utilization of hard currency in Nigeria. The major challenge is not in the amount of fictitious assets or dollars that people kept in their crypto accounts. It is in the volume of dollars that was released physically by the Central Bank of Nigeria.”","Blockchain expert Jahdiel Chidi added that people will now turn to other exchanges.","In Turkey, crypto has often been viewed as a lifeline amidst economic struggles. Crypto’s recent history in this country hasn’t been as turbulent as in Nigeria, possibly as a result of the government avoiding alienating millions of crypto users. Crypto adoption is so widespread that some have argued that there may be political ramifications should the government take a hard stance.","Initially, in 2021, President Recep Tayyip Erdoğan declared “a war on crypto,” but soon began softening the stance.In December 2023, he appointed Professor Fatma Özkul, an expert in crypto assets and blockchain technology, to the Central Bank of the Republic of Türkiye’s rate-setting committee.","In January 2024, the Minister of Treasury and Finance, Mehmet Şimşek, announced that Turkey was in the final stages of preparing a legal regulation for cryptoassets. In late February, the country’s legislators met with digital asset stakeholders in a consultative meeting to discuss the incoming crypto regulations package.So far, all signs point to Turkey heading for market-friendly legislation.","Notably, two major Turkish banks, Akbank and Garanti BBVA, have recently entered the crypto sector, suggesting an evolving stance on digital assets in the nation as the regulatory framework approaches.","Meanwhile, the positive regulatory attitude towards crypto in these two countries, especially Turkey, is far from the regulations seen in some of the world’s richest and most developed regions, including the G7 countries.","For example, the United States is known far and wide for its unclear rules pertaining to crypto. This, along with the rising tensions between the crypto sector and regulators, such as the Securities and Exchanges Common (SEC), is commonly cited as a key reason for crypto companies moving their headquarters to rising crypto hubs with clear laws.","It is clear that the top countries in the Statista survey have a significantly higher crypto adoption rate compared to the top Western countries, i.e. G7 (Group of Seven).","This inter-governmental political forum is a group of the world’s richest industrialized countries. Up until 2014, it was known as the G8.","Compared to nearly half the respondents in Turkey and Nigeria each stating they hold crypto, in France, that percentage is 10%.","Canada follows with 12%, Germany and Italy with 13% each, the UK with 14%, and the US with 18%.","Japan, also a G7 member, is at 6%.","Once a part of the group, then known as G8, Russia’s share is 13%. The country was expelled in 2014, and it officially and permanently left the group in 2017.","But what causes such a major discrepancy between the top countries on Statista’s list and the G7?","Ramy Bekhiet, Senior Advisor and Commercial Partnerships Coordinator at PDX, commented that,","“It is because of the devaluation of their currency. In Nigeria in 2019, $1 was equal to around 350 Naira and now today $1 is around 1,600 Naira. Similar to Turkey in 2019, $1 was equal to around 5 Lira and now today $1 is around $33 Lira. As their currency continues to get weaker, they have to use crypto currencies (mainly stable coins) to avoid continued losses.”","The IMF studies have shown ballooning inflation rates in Nigeria and Turkey, boosting the demand for crypto as a fiat alternative. The Economist wrote that, by September 2023, the “vast majority of Turks [were] convinced actual inflation is much higher” than the reported numbers. Various media outlets argued that the inflation crisis led citizens to buy crypto in a bid to safeguard their savings’ worth.","Last month, the Guardian reported that inflation created a bitcoin (BTC) “boom,” while the Wall Street Journal claimed that Turkish citizens were “piling” into BTC and tether (USDT) as alternatives to the “plunging” lira. A journalist reported that streets were “flooded” with crypto exchanges and ads for crypto-related services.","An August 2023 survey conducted by major crypto exchange KuCoin, found that over half of the Turkish population is participating in the crypto market. The survey revealed an increasing acceptance of crypto as a hedge against inflation, as well as a tool to create long-term wealth and achieve financial freedom.","“Crypto is basically a savior for many individuals here both from a financial perspective, and also from a mental perspective,” said Vidal Arditi, the founder of Layka DAO and Lunapark Web3 Hub.","Çağla Gül Şenkardeş, the founder of Istanbul Blockchain Women, commented that “since we are a culture that is quite used to investment alternatives like US dollars or gold, it wasn’t hard for Turkish people to trust another alternative, which is crypto. We are quite used to investing in something that is not the lira. We can take risks easily.”","Furthermore, per the World Bank income classification, both Nigeria and Turkey are in the lower middle income (LMI) category. 40% of the world’s population live in LMI countries – commonly countries on the rise, with growing industries and populations, said a September 2023 Chainalysis’ Global Crypto Adoption Index.","“If LMI countries are the future, then the data indicates that crypto is going to be a big part of that future.”","In Nigeria, crypto adoption is also fueled by economic uncertainty amidst inflation, the need for increased financial inclusion, and a rising interest in decentralized finance (DeFi).","An August 2023 report from YouGov and ConsenSys shows Nigeria as the most crypto-savvy nation, ahead of the US and Europe. It found that 99% of the respondents were fully aware of cryptocurrencies, and 70% understood the value, operations, and fundamentals of blockchain.","65% of participants viewed digital currencies, such as BTC and stablecoins, as tools against a weakening local currency and as a safeguard against financial decline and hyperinflation. Also, 90% of Nigerian respondents said they would invest in crypto over the following 12 months.","The numbers stand in contrast with Europe and Japan, the report said, “where a larger portion seems hesitant about future investments in cryptocurrencies.”","In the US, the UK, and Germany, crypto awareness is high (40%-90%), but the investment rates are much lower than in the top Statista countries. While crypto in these countries may be seen as an alternative to traditional finance, there are also negative sentiments attached to it, and citizens tend to ask for strict regulations.","“European nations exhibit a greater degree of skepticism towards crypto, a behavior that is often mirrored in countries like Japan and South Korea,” said the Consensys and YouGov report.","“In these countries, the association of crypto with negative concepts such as scams, money laundering, and speculation is stronger.”","Concerns of speculation or scams are relatively low in Nigeria (9% and 6%, respectively). Moreover, most countries in Southeast Asia, South America, and Africa have more enthusiastic attitudes toward Web3, with crypto being associated with the future of money, digital ownership, alternatives to the traditional financial ecosystem, a way to access global capital, and a tool to protect against inflation.","Nigeria and Turkey stand at the very top when it comes to the share of crypto owners in 56 countries and territories as of February 2024, per Statista. Nearly half of all the survey respondents in these two countries said they hold crypto.","This is in contrast to the top Western countries, specifically the G7. Compared to Turkey’s and Nigeria’s 47% each, the G7 countries’ share falls between Japan’s 6% and the USA’s 18%.","While regulations are a key area in how quickly a country is adopting crypto, industry insiders, surveys, and media outlets have pointed out additional factors contributing to the rate and speed of crypto adoption in different regions. The contributing interrelated factors that lead to higher adoption rates include economic instability, financial insecurity, political uncertainty, volatile local currencies, wealth erosion, and limited access to reliable financial infrastructure.","While countries like the US and Germany remain cautious, with concerns about market volatility and scams, nations like Nigeria and Turkey see cryptocurrencies as a financial opportunity and safeguard."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Canada","content":"LOCATION"},{"type":"Central Bank of Nigeria (CBN","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"South Africa","content":"LOCATION"},{"type":"February 2024","content":"DATE"},{"type":"Isaac Botti","content":"PERSON"},{"type":"South America","content":"LOCATION"},{"type":"Jahdiel Chidi","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Statista","content":"LOCATION"},{"type":"Naira","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Istanbul Blockchain Women","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"18%","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"Africa","content":"LOCATION"},{"type":"Gül Şenkardeş","content":"PERSON"},{"type":"UAE","content":"ORGANIZATION"},{"type":"Saudi Arabia","content":"LOCATION"},{"type":"2014","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"Indonesia","content":"LOCATION"},{"type":"USA","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"64 years","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"Germany","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Central Bank of the Republic of Türkiye","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"Akbank","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"December 2023","content":"DATE"},{"type":"June 2023","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"Switzerland","content":"LOCATION"},{"type":"August 2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"VOA","content":"ORGANIZATION"},{"type":"$33 Lira","content":"MONEY"},{"type":"39%","content":"PERCENT"},{"type":"Layka DAO","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Central Bank of Nigeria","content":"ORGANIZATION"},{"type":"Mehmet Şimşek","content":"PERSON"},{"type":"Fatma Özkul","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"G7","content":"ORGANIZATION"},{"type":"65%","content":"PERCENT"},{"type":"G8","content":"ORGANIZATION"},{"type":"CBN","content":"ORGANIZATION"},{"type":"200%","content":"PERCENT"},{"type":"Colombia","content":"LOCATION"},{"type":"14%","content":"PERCENT"},{"type":"September 2023","content":"DATE"},{"type":"Vidal Arditi","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"LMI","content":"ORGANIZATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"29%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"17%","content":"PERCENT"},{"type":"Lunapark Web3 Hub","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Garanti BBVA","content":"ORGANIZATION"},{"type":"Italy","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Kenya","content":"LOCATION"},{"type":"Minister of Treasury and Finance","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"31%","content":"PERCENT"},{"type":"Tayyip Erdoğan","content":"PERSON"},{"type":"January this year","content":"DATE"},{"type":"Thailand","content":"LOCATION"},{"type":"16%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"G7 (Group of Seven)","content":"ORGANIZATION"}],"hashtag":["crypto adoption","Nigeria","Turkey"],"authors":["Sead Fadilpašić"]}