{"summary":"Hong Kong Central Bank Raises Red Flag on Deceptive Digital Currency Trial Entities","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-alerts-deceptive-digital-currency-trial-entities.htm","publishDate":"2024-03-21T05:02:51","id":20858,"type":null,"title":"Hong Kong Central Bank Raises Red Flag on Deceptive Digital Currency Trial Entities","category":["News "],"content":["Hong Kong’s central bank cautioned the public Wednesday about schemes falsely claiming association with its e-HKD pilot projects. The warning comes as Hong Kong explores the potential of a central bank digital currency through various trial projects.","The public appears to have been exposed to certain organizations claiming to be part of the program. These entities supposedly promoted products to lure investments, posing as selected participants in the digital currency trial.","For guidance, the Hong Kong Monetary Authority (HKMA) released a list of official participants in the pilot program. These include Alipay Financial Services, Bank of China (Hong Kong), China Construction Bank, and the Hong Kong and Shanghai Banking Corporation.","The central bank clarified that none of the entities involved in the e-HKD program will seek public funding. Nor will they offer investment products linked to these initiatives. It also mentioned that the Hong Kong Police Force has been alerted to the relevant fraud cases.","The public is advised to report any suspicions of fraud to the police or the Commercial Crime Bureau of the Hong Kong Police Force.","The HKMA last week initiated the e-HKD pilot program’s second phase. The first phase focused on testing the e-HKD for domestic retail uses. These include features like programmable payments, settling tokenized assets, and offline transactions.","Phase 2 of the e-HKD Pilot Programme has been launched to explore the potential of a digital Hong Kong dollar in the areas of programmability, tokenisation and more. Do not miss out on this opportunity to make your mark – apply by 17 May.\n#eHKD #CBDC #DigitalMoney pic.twitter.com\/cvVDdeVEyy","— HKMA 香港金融管理局 (@hkmagovhk) March 14, 2024","","Now, the second phase, slated to continue until mid-2025, aims to delve deeper into the capabilities of an e-HKD. It will concentrate on aspects like programmability, tokenization, and atomic settlement — a technology that ensures transactions are completed entirely or not at all.","Meanwhile, the HKMA has opened the door for organizations interested in participating to submit applications by May 17.","The central bank also recently launched a sandbox program specifically designed for stablecoin issuers. It aims to provide a controlled environment where potential issuers can experiment and explore stablecoin projects without much risk."],"entity":[{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"e-HKD Pilot Programme","content":"ORGANIZATION"},{"type":"May 17","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Alipay Financial Services","content":"ORGANIZATION"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Shanghai Banking Corporation","content":"ORGANIZATION"},{"type":"March 14, 2024","content":"DATE"},{"type":"China Construction Bank","content":"ORGANIZATION"},{"type":"Hong Kong Police Force","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["CBDC","Hong Kong"],"authors":["Shalini Nagarajan"]}