{"summary":"XRP Price Prediction as $1.5 Billion Trading Volume Comes In – Are Whales Buying?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/xrp-price-prediction-as-15-billion-trading-volume-comes-are-whales-buying.htm","publishDate":"2023-03-11T12:00:00","id":20851,"type":null,"title":"XRP Price Prediction as $1.5 Billion Trading Volume Comes In – Are Whales Buying?","category":["Altcoin News "],"content":["The sixth-largest crypto is hanging at the very edge of a cliff as uncertainties in the market mount, especially from the United States. Despite the total market cap sliding below the $1 trillion mark to stand at $963 billion on Saturday, XRP price is relatively unchanged in 24 hours but trading at $0.3691.","It has been another difficult week in the crypto market owing to the worsening economic conditions and regulatory pressure from US agencies. The collapse of Silvergate bank last week hinted at the ghosts of the messy implosion of FTX exchange coming back to haunt the industry.","In other emerging news, Circle’s USDC stablecoin is nosediving and deviating from its dollar peg amid panic over the collapse of another banking entity SVB Financial Group. SVB is a subsidiary of the California-based Silicon Valley Bank.","The second largest stablecoin is reportedly suffering from contagion following the second US bank to collapse in March 2023. USDC holds at $0.9052 according to the live price data by CoinGecko, a figure significantly lower than its expected value of $1.","Approximately $3.3 billion in USDC’s cash reserves could be in the custody of SVB, raising concerns among investors about the ability of Circle to fully back the $37 billion stablecoin. Stablecoins have become a fundamental part of the crypto industry and are gradually finding a footing in the traditional banking sector.","Recall the collapse of TerraUSD in May 2022 and the bloodbath that followed across the market. Crypto giants like Voyager Digital, Three Arrows Capital, and Celsius were not able to survive the crash, resulting in a series of bankruptcy filings.","The possibility of a weekend sell-off cannot be taken off the table, with investors likely to panic due to the contagion of another stablecoin crash. However, data shared by Wu Blockchain on Twitter suggests “the actual risk exposure may only be a small amount of funds.”","That said, investors should closely follow the events around USDC and SVB in the next few days as they are likely to help determine where the crypto market is headed.","XRP price appears relatively stable while trading at $0.3691 during the European session on Saturday. The aggressive push by the bulls in January propelled the cross-border token slightly above $0.40 before bears took over the reins in early February.","A glance back at XRP price in September last year reveals its upper point of control at $0.50. On the flip side, the point of control on the downside sits at $0.30. Besides, XRP lost steam during the upswing in January after meeting the multi-month trend line – drawn from September’s high of $0.56.","While an immediate recovery in XRP price would be a pipe dream, considering the many unfavorable conditions in the crypto market, a lot of focus could be directed to the bulls’ ability to find support and uphold it, at least for this weekend.","That said the pressure mounting on top of the $18.5 billion crypto cannot be understated, considering the loss of key leverages that briefly came into the picture in January.","For instance, XRP now holds below all the major applied moving averages, including the 200-day Exponential Moving Average (EMA) (line in purple), the 100-day EMA (line in blue), and the 50-day EMA (line in red).","The next tentative support would be provided by the buyer congestion at $0.35. Keeping this support intact is critical for the immediate resumption of the uptrend. Otherwise, XRP price may nosedive to test $0.30.","Two outcomes would be expected at $0.30, with the first allowing XRP price to take advantage of the new liquidity and aggressively push for a trend reversal. On the other hand, trading below the same point of control could trigger another sell-off as hell breaks loose in front of the bulls. Declines below $0.30 may be unstoppable until XRP reaches $0.25.","Almost all key technical indicators used in this analysis paint a grim picture for XRP price, likely to outlast the next few sessions—and possibly days. For starters, the Moving Average Convergence Divergence (MACD) indicator dons a vivid sell signal, as confirmed on Thursday, 9 March 2023.","In addition to that, the MACD is now holding below the mean line at 0.00 and exploring the negative region. If support at $0.35 does not hold, XRP price will have no option but to seek refuge toward the next key level at $0.30.","The position of the Money Flow Index (MFI) empowers the notion that the spike in trading volume mainly hails from selling activities and that XRP price lacks enough momentum and liquidity to reverse the trend, at least for now.","Investors wishing to take long positions in XRP may want to wait until the token confirms support and starts bouncing back. If support at $0.35 stops the downtrend, traders would be targeting $0.38 and $0.40, respectively with the move to $0.56 still possible in weeks to come.","Buy XRP Now.","If you’re looking for other high-potential crypto projects alongside XRP, we’ve reviewed the top 15 cryptocurrencies for 2023, as analyzed by the CryptoNews Industry Talk team.\n\nThe list is updated weekly with new altcoins and ICO projects.","Disclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.","Related Articles:",""],"entity":[{"type":"$1 trillion mark","content":"MONEY"},{"type":"September last year","content":"DATE"},{"type":"$0.40","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$0.56","content":"MONEY"},{"type":"$37 billion","content":"MONEY"},{"type":"$0.35","content":"MONEY"},{"type":"$0.30","content":"MONEY"},{"type":"CryptoNews Industry Talk","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"MACD","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"$0.38","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Saturday","content":"DATE"},{"type":"this weekend","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"MFI","content":"ORGANIZATION"},{"type":"$0.50","content":"MONEY"},{"type":"SVB Financial Group","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$0.3691","content":"MONEY"},{"type":"$0.25","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$963 billion","content":"MONEY"},{"type":"Moving Average Convergence Divergence (MACD","content":"ORGANIZATION"},{"type":"$0.9052","content":"MONEY"},{"type":"$18.5 billion","content":"MONEY"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"Wu Blockchain","content":"PERSON"}],"hashtag":["XRP"],"authors":["John Isige"]}