{"summary":"Brazil Expansion Is “Central Focus” for Coinbase","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazil-expansion-is-central-focus-for-coinbase.htm","publishDate":"2023-12-14T05:00:58","id":20861,"type":null,"title":"Brazil Expansion Is “Central Focus” for Coinbase","category":["Blockchain News "],"content":["The crypto exchange giant Coinbase says that Brazil has “become a central focus” in its “global growth strategy.”","The Brazilian media outlet Livecoins said Coinbase recognized “Brazil’s growing importance in the cryptocurrency market.”","And it said the exchange was gaining confidence “in the country’s economic and technological potential.”","Coinbase stated that Brazil and other nations were “making progress in crypto regulation.”","The exchange operator has set itself the ambitious goal of building a global user base of 1 billion people.","The firm reportedly noted that Brazil’s “evolving regulatory environment” and “one of the highest cryptocurrency adoption rates” in the world were also motivating factors.","The exchange said these and other reasons had made Brazil “a crucial market” for company expansion.","Fábio Plein, Coinbase’s Regional Director, was quoted as saying:","“To operationalize the diversification of our business globally, we are following our ‘Go Broad, Go Deep’ expansion strategy. We are aligning with government involvement in the crypto economy. Our goal is to reach 1 billion users globally. And Brazil is a crucial market on the path to achieving this milestone.”","The exchange further noted that Brazil’s relatively young population was also a factor in its pivot to Brazil.","The firm added that the Latin American nation is also in the Chainalysis cryptocurrency adoption top ten.","Coinbase said it is planning “active collaboration with Brazilian decision-makers and stakeholders.”","This will involve “collaborating” with the Brazilian governments, regulators, and companies, the media outlet reported.","👨🏻‍💻💸 Coinbase Crypto Wallet Offers “Simple Mode” for Improved UX: CEO Armstrong@brian_armstrong, the CEO of @coinbase, has explained that the wallet modifications launched last week focus on payments.#CryptoNews #news https:\/\/t.co\/SwP4C8FFhc","— Cryptonews.com (@cryptonews) December 12, 2023","","Brazilian lawmakers have indicated an increasing willingness to regulate crypto in recent months.","In late November, the nation’s Senate approved a 15% tax rate for crypto-related profits accrued on overseas platforms.","The nation’s top markets regulator has also co-launched a glossary of crypto-related terms for use in the blockchain sector.","🇧🇷 Bullish Brazilian Bank Nubank Adds Five More Altcoins to Banking App","The Brazilian neobanking unicorn @nubank is stepping up its crypto adoption drive, adding trading capabilities for five more altcoins to its banking app.#CryptoNews #news https:\/\/t.co\/UcQLtUTe0b","— Cryptonews.com (@cryptonews) November 23, 2023","","Meanwhile, some of the nation’s top banks are rolling out crypto trading services as their clients demand coin-related features."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Coinbase Crypto Wallet Offers","content":"ORGANIZATION"},{"type":"November 23, 2023","content":"DATE"},{"type":"Livecoins","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Chainalysis","content":"LOCATION"},{"type":"December 12, 2023","content":"DATE"},{"type":"Brazilian Bank Nubank Adds Five More Altcoins to Banking App","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Brazil","Coinbase"],"authors":["Tim Alper"]}