{"summary":"Circle and NFT-Driven Game ‘Overdare’ Collaborate on Web3 Wallets and USDC Payouts","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/circle-overdare-strategic-partnership-metaverse-web3-wallets-usdc-payouts.htm","publishDate":"2024-02-26T05:33:44","id":20864,"type":null,"title":"Circle and NFT-Driven Game ‘Overdare’ Collaborate on Web3 Wallets and USDC Payouts","category":["News "],"content":["Stablecoin issuer Circle and South Korean NFT-driven metaverse ‘Overdare’ are teaming up to allow game developers to build in-game Web3 wallets within the platform.","The collaboration will also empower game creators to facilitate direct USDC payouts on the platform, as per a Monday announcement.","Developed by Krafton, the studio behind PUBG, Overdare is a create-to-earn metaverse game slated for a global launch in the second half of 2024.","The partnership with Circle extends beyond in-game wallet functionality. Overdare aims to transform intellectual property (IP) and income management for creators by using Circle’s Programmable Wallets. This integration will enable IP trading and facilitate direct payouts in USDC, allowing creators to explore new revenue streams.","“We believe this partnership will be a catalyst in shaping the future of digital entertainment, ultimately fostering an innovative Web3 environment for all,” Circle CEO Jeremy Allaire, said in a statement.","We are excited to announce our strategic partnership with OVERDARE to revolutionize the mobile gaming world.","By integrating #USDC payouts and our Programmable Wallets for OVERDARE’s game content creators, we are making it easier for game content creators to collaborate and… pic.twitter.com\/U1zmT9uOYo","— Circle (@circle) February 26, 2024","","Taking inspiration from gaming platform Roblox, Overdare uses Epic Games’ Unreal Engine 5 to deliver AI-powered creation tools. This allows players to take on the role of game designers within the metaverse, crafting their own unique experiences.","Beyond in-game creation, Overdare embraces a “Create-to-Earn” model, empowering players to monetize their creativity. By crafting valuable digital assets, players can transform them into NFTs, opening the door to trading on the game’s virtual marketplace.","It also offers live chat functionality and customizable avatars, to create a sense of individuality within the platform.","Overdare uses its proprietary blockchain, Settlus, to handle transactions within the game. This custom-built network was created using the Cosmos Software Development Kit (SDK).","The integration of Settlus goes beyond facilitating smooth transactions. It streamlines the licensing process for interactive content, allowing creators to unlock monetization opportunities on the blockchain.","Early peeks at the game showcase a vast virtual world, where players can use AI tools to construct intricate games and contribute to the ecosystem.","Overdare also plans to empower creators with an “Overdare Studio.” This is a dedicated suite packed with tools designed to personalize and craft immersive gaming experiences within the platform.","Circle recently announced the discontinuation of USDC support on the TRON blockchain, citing concerns identified within its risk management framework. The decision follows ongoing challenges surrounding TRON, including allegations of money laundering involvement within its ecosystem."],"entity":[{"type":"South Korean NFT","content":"ORGANIZATION"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Overdare Studio","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Cosmos Software Development Kit (SDK","content":"ORGANIZATION"},{"type":"Krafton","content":"ORGANIZATION"},{"type":"second half of 2024","content":"DATE"},{"type":"February 26, 2024","content":"DATE"}],"hashtag":["Circle","NFT","USDC"],"authors":["Shalini Nagarajan"]}