{"summary":"CryptoPunks Whales Stick to Larva Labs, Have Highest NFT Market Cap – Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cryptopunks-whales-stick-to-larva-labs-have-highest-nft-mark-11576.htm","publishDate":"2021-08-26T13:40:00","id":20879,"type":null,"title":"CryptoPunks Whales Stick to Larva Labs, Have Highest NFT Market Cap – Report","category":["News "],"content":["CryptoPunks, digital collectibles created by Larva Labs, have a high ‘whale’ concentration share, with 10 wallets owing 1,410 digital assets, but the collection’s robust market capitalization of USD 3.1bn makes it less prone to manipulation, according to a report released by data aggregator and analysis firm DappRadar.","As part of its research into non-fungible tokens (NFTs) and cryptocurrency whales, a term used to describe individuals or entities that hold significant amounts of crypto or crypto assets, DappRadar is employing a method based on on-chain indicators for the NFT space, the whale concentration index. The index measures how diluted or concentrated a given collection is, and it indicates the number of pieces that are owned by the top 10 wallets for a given collection.","They found that the studied CryptoPunk whales are heavily focused on Larva Labs collections, as they do not own any other crypto assets besides Art Blocks, at 427 NFTs, CryptoPunks, with 1,410 cryptoassets, and Meebits, which are also developed by Larva Labs, at 1,329 NFTs, according to the analysis.","CryptoPunk whales hold the most valuable portfolios on average, with USD 53.6m, followed by Bored Ape Yacht Club (BAYC) and Art Blocks whales with an average of some USD 11.5m.","Pudgy Penguins and BAYC are among the best-distributed collections in the NFT space. Similarly, Cool Cats whales also tend to display diversified NFT strategies.","And while CryptoPunks whales are the less diversified group, BAYC whales – in contrast to Larva Labs whales – appear to have a very diversified NFT investment strategy, said the report. Besides BAYC and Bored Apes Kennel Club, Bored Ape whales have “significant holdings” in Art Blocks and Meebits. Also, 40% of BAYC whales have at least one CryptoPunk in their collection, DappRadar said, adding that:","“Collections like the BAYC and Art Blocks whose average price increased significantly as of late, are being used as a way to obtain profits. Whilst Art Block whales prefer to re-invest in their preferred collection, BAYC whales are looking to discover the new NFT gem by diversifying their holdings.”","Art Blocks whales have “important holdings” in CryptoPunks and Meebits, collectively owning 211 and 414 pieces respectively, it added. Furthermore, “Pudgy Penguins appear to be liked by these whales as 202 Penguins are also owned by Art Block whales.”","Whales who own Axie Infinity collectibles are mostly focused on gaming NFTs, and only two of such whales own diversified NFT collectibles portfolios.","To DappRadar, BAYC looks like the healthiest collection in terms of market manipulation owing to a low whale concentration index and an impressive market capitalization of USD 1.1bn.","“In regards to the six collections analyzed, there is no concern about market manipulation,” said the report. “Those collections that may lean towards a more concentrated supply like the Larva Labs projects are already established as premier NFT collections hence the risk is significantly reduced.”","","Newer collections like the Pudgy Penguins “may be at a higher manipulation risk,” although their concentration metrics show a well distributed project despite a recent launch, DappRadar concluded.","____","Learn more:\n– NFT Sector Far from Dead or Even Resting, Exploding Across the Board\n– Cryptoverse Reacts: Visa May Become “Front-End for Ethereum”, NFT Sales Explode","– Non-Fungible Penguins Are Taking Over the NFT Scene\n– Buterin to Star in Mila Kunis’ NFT Animated Series – with Jane Fonda","– Sotheby’s Record CryptoPunk Auction Sees a Wave of New Bidders\n– NFT Traders: ‘Christie’s F***ed up USD 17m CryptoPunks Sale’"],"entity":[{"type":"Larva Labs","content":"LOCATION"},{"type":"Sotheby’s Record CryptoPunk Auction","content":"ORGANIZATION"},{"type":"“Pudgy Penguins","content":"ORGANIZATION"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"DappRadar","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"USD 11.5m.","content":"ORGANIZATION"},{"type":"DappRadar","content":"ORGANIZATION"},{"type":"Board","content":"ORGANIZATION"},{"type":"Jane Fonda","content":"PERSON"},{"type":"Bored Apes Kennel Club","content":"ORGANIZATION"},{"type":"Mila Kunis","content":"PERSON"}],"hashtag":["Adoption","Art","Ethereum","NFT","Non-fungible tokens"],"authors":["Jaroslaw Adamowski"]}