{"summary":"KBW Increases Coinbase Price Target to $230, Citing Exposure to Long-Term Crypto Economy Growth","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kbw-increases-coinbase-price-target-to-230-citing-exposure-to-long-term-crypto-economy-growth.htm","publishDate":"2024-04-03T12:33:12","id":20870,"type":null,"title":"KBW Increases Coinbase Price Target to $230, Citing Exposure to Long-Term Crypto Economy Growth","category":["Altcoin News "],"content":["Investment banking firm KBW has hailed Coinbase for offering investors a unique opportunity to tap into the long-term growth potential of the crypto economy and increased its price target for COIN to $230. ","In a recent research analysis, KBW raised its Coinbase price target from $160 to $230 while maintaining its market performance rating. ","The stock closed at $245.84 on Tuesday and has experienced a notable year-to-date increase of over 40%.","In the report, analysts led by Kyle Voigt expressed optimism about Coinbase’s revenue prospects in the near term. ","They highlighted the potential revenue opportunity arising from the growing outstanding balances of USD Coin (USDC), a stablecoin issued by Circle and backed by Coinbase. ","“We see a significant near-term revenue opportunity from inflecting USD Coin (USDC) outstanding balances, elevated crypto asset levels, and an apparent retail re-engagement from trough levels in 2023.”","According to the report, USDC outstanding balances surged by 32% in the first quarter. ","Coinbase earns gross interest income on approximately 56% of these outstanding balances, further contributing to its revenue growth.","The report also emphasized the positive impact of surging trading volumes on Coinbase’s stock performance. ","In March, the average daily volume (ADV) reached $5.1 billion, compared to $2.4 billion in February. ","Investment bank KBW has revised its target stock price for Coinbase (COIN) from $160 to $230, indicating increased optimism about the company's prospects. This upward revision is attributed to several factors including the ongoing cryptocurrency bull market, interest income…","— BitcoinWorld Media (@ItsBitcoinWorld) April 3, 2024","","Increased trading activity reflects growing investor interest in cryptocurrencies and further bolsters Coinbase’s position in the market.","However, the research report acknowledged the challenges Coinbase faces, including its legal battle with the U.S. Securities and Exchange Commission (SEC) and the uncertain regulatory environment. ","These factors make it difficult for many institutional investors to consider owning Coinbase stock.","Last week, Judge Katherine Polk Failla of the US District Court of the Southern District of New York ruled that the SEC’s lawsuit against Coinbase can proceed.","The Judge’s decision came after Coinbase filed a motion to dismiss the SEC case, which borders on allegations the exchange operates as an unregistered securities exchange, broker, and clearing agency.","In her ruling, Judge Failla declared that the SEC’s lawsuit against Coinbase held “plausible” ground. ","“The Court finds the SEC has sufficiently pleaded that Coinbase operates as an exchange, as a broker, and as a clearing agency under the federal securities laws, and through its Staking Program engages in the unregistered offer and sale of securities,” the court document read.","She granted a partial victory to the exchange against the regulator, however, dismissing the SEC’s claims against Coinbase’s Wallet.","The judge ruled that the regulator’s claims “fails for the independent reason that the pleadings fall short of demonstrating that Coinbase acts as a “broker” by making Wallet available to customers.”"],"entity":[{"type":"Kyle Voigt","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"56%","content":"PERCENT"},{"type":"$2.4 billion","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"The Court","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$245.84","content":"MONEY"},{"type":"KBW","content":"ORGANIZATION"},{"type":"$160","content":"MONEY"},{"type":"USD Coin (USDC","content":"ORGANIZATION"},{"type":"US District Court of the Southern District of New York","content":"ORGANIZATION"},{"type":"April 3, 2024","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Failla","content":"PERSON"},{"type":"$5.1 billion","content":"MONEY"},{"type":"Coinbase’s Wallet","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"$230","content":"MONEY"}],"hashtag":["Coinbase","crypto adoption"],"authors":["Ruholamin Haqshanas"]}