{"summary":"Bitcoin and Ethereum Consolidate, MANA Surges","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-and-ethereum-consolidate-mana-surges.htm","publishDate":"2021-10-29T12:07:00","id":20875,"type":null,"title":"Bitcoin and Ethereum Consolidate, MANA Surges","category":["Altcoin News "],"content":["Bitcoin price failed to settle above USD 62,000 and started a downside correction. BTC traded below USD 61,200, but it is currently (11:55 UTC) well above USD 60,000. To start a fresh increase, the price must clear USD 61,500 and then settle above USD 62,000.","Besides, most major altcoins are also consolidating gains. ETH is stable above USD 4,250 and is facing resistance near USD 4,400. XRP could rally if there is a clear break above USD 1.10 and USD 1.12. ADA is correcting gains and it might test USD 1.92.","Total market capitalization","After a spike above USD 62,000, bitcoin price faced resistance near USD 62,500. BTC started a downside correction and traded below USD 61,200. The price is now trading below USD 61,000, but it is stable above USD 60,000. A downside break below USD 60,000 might start a fresh decline. The next major support is at USD 58,500.","An immediate hurdle on the upside is near USD 61,200. The next major resistance is near USD 62,000, above which the price could start a steady increase towards USD 63,200.","Ethereum price spiked above the USD 4,400 level before it started a minor downside correction. ETH declined towards USD 4,320. Any more losses could lead the price towards the USD 4,120 support. ","On the upside, an initial resistance is near the USD 4,380 level. The key breakout zone is now forming near the USD 4,400 level.","Cardano (ADA) is correcting gains and is trading near USD 2.00. A downside break below the USD 2.00 could set the pace for a move towards USD 1.95. The next major support is USD 1.92. On the upside, the bears might remain active near USD 2.05 and USD 2.08.","Binance Coin (BNB) is struggling to clear the USD 500 resistance zone. A close above this level may perhaps lift the price towards the USD 525 level. If not, the price could correct lower towards the USD 475 level. The next major support is near USD 465.","Solana (SOL) again struggling to stay above USD 200. The price is moving lower and trading below USD 198. The next major support is near USD 195. Any more losses might call for a move towards USD 185.","XRP price failed to clear the USD 1.10 resistance. The price is moving lower towards the USD 1.05 support. If there are more downsides, the price could test the USD 1.00 level.","SHIB dropped by 14% and is struggling to climb above the USD 0.0000700 resistance zone. If there is a break above USD 0.0000700, the price might a fresh rally. On the downside, the USD 0.0000650 level is a decent support.","Many altcoins are up over 5%, including MANA, BAT, HNT, AXS, ENJ, FLOW, REV, CHZ, CRO, ICX, and THETA. Out of these, fueled by Facebook news, MANA gained 65% and broke the USD 1.30 level, becoming the best performing token among the top 100 cryptoassets by market capitalization today.","To sum up, bitcoin price is stable above USD 60,000. If BTC stays above this level, it could start a fresh increase towards USD 63,200. Conversely, it might dive towards USD 58,500.","_____ ",""],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"65%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"}],"hashtag":["ADA","Altcoins","BNB","btc","Markets","Shiba inu","SOL","XRP"],"authors":["Aayush Jindal"]}