{"summary":"In its third &quot;State of Crypto Report&quot; Coinbase said Americans could have saved and average of $600 per household.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276487\/coinbase-says-americans-could-have-saved-74-billion-on-credit-card-fees-with-blockchain","publishDate":"2024-02-07T12:01:58","id":2087,"type":null,"title":"Coinbase says Americans could have saved $74 billion on credit card fees with blockchain","category":["EXCHANGES"],"content":["Coinbase said Wednesday in its latest \"State of Crypto Report\" that blockchain technology could have saved American consumers billions of dollars.&nbsp;","\"In 2022, consumers could have saved at least $74 billion in credit card transaction fees by using blockchain technology,\" Coinbase said in the report. Pointing to frustration over fees, the crypto exchange said that&nbsp;\"at least three in five Americans want updates to the system that make it cheaper, faster, and more accessible.\"","Coinbase derived the figure using publicly available data sourced from the Securities and Exchange Commission, U.S. Census Bureau and the data analytics firm Statista. The Block Research also contributed to Coinbase's latest report.","Coinbase sees blockchain technology serving not only consumers but also businesses.","\"Merchants spent more than $126 billion on fees to process credit card transactions,\" it said in its report, adding that amounts to their second largest cost after labor. \"By using blockchain technology instead, they could have paid next to nothing.\"","Coinbase also said it found that more than 7o% of Americans desire an \"updated financial system\" that charges less in fees and works faster.","While Coinbase is <a href=\"https:\/\/www.theblock.co\/post\/254111\/coinbase-push-abroad-gaining-steam-but-plenty-of-uncertainty-remains\" data-v-f87c67ca=\"\">expanding its reach<\/a> outside of the U.S. in Europe and countries like Singapore and Brazil, the company generates the majority of its revenue in the U.S. The trading platform has been continuing to lobby the U.S. government for added clarity regarding the regulation of, and access to, digital assets.","Coinbase serves as custodian to most of the newly launched spot bitcoin ETFs offered by traditional financial firms including BlackRock, Franklin Templeton and Grayscale Investments. The cumulative trading volume for spot bitcoin ETFs, which started trading last month, has surpassed $30 billion, according to Yahoo Finance data compiled by The Block.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/cumulative-spot-bitcoin-etf-volumes\/embed\" title=\"Cumulative Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"U.S","content":"LOCATION"},{"type":"Statista","content":"LOCATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"7o%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$74 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"$126 billion","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}