{"summary":"Binance Labs has invested an undisclosed sum in Bitcoin staking protocol Babylon.\nIn recent weeks, Binance Labs also invested in Ethereum liquid restaking protocols Renzo and Puffer Finance.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279344\/binance-labs-bitcoin-staking-protocol-babylon","publishDate":"2024-02-27T09:00:09","id":2087,"type":null,"title":"Binance Labs invests in Bitcoin staking protocol Babylon","category":["Venture Capital"],"content":["<span data-v-f87c67ca=\"\">Binance Labs, the $10 billion venture capital and incubation arm of crypto exchange Binance, has invested in Babylon, a <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.42%\n    <\/span><\/a> <!----><\/span><\/span> staking protocol, as it continues showing interest in startups in the staking and restaking domains.<\/span>","Binance Labs did not disclose the size of its investment, but Babylon co-founder David Tse told The Block that the investment had the same structure as Babylon's seed and Series A rounds, which were equity with token warrant rounds. Babylon <a href=\"https:\/\/www.theblock.co\/post\/266518\/bitcoin-staking-babylon-series-a\" data-v-f87c67ca=\"\">raised<\/a> $18 million in Series A funding in December 2023 and $8.8 million in seed funding in 2022.","Binance Labs has lately increased its focus on supporting startups in the staking and restaking verticals. In recent weeks, Binance Labs has invested in <a href=\"https:\/\/www.theblock.co\/post\/278564\/binance-labs-renzo-ethereum-restaking\" data-v-f87c67ca=\"\">Renzo<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/275102\/binance-labs-puffer-investment\" data-v-f87c67ca=\"\">Puffer Finance<\/a>, which have quickly risen to become the second and fourth-largest Ethereum liquid restaking protocols, according to DeFiLlama <a href=\"https:\/\/defillama.com\/protocols\/liquid%20restaking\" data-v-f87c67ca=\"\">data<\/a>.","Binance Labs' investment in Babylon comes as the protocol is set to launch its testnet this week, Tse said.","Babylon is a Bitcoin staking protocol that will let BTC holders stake their coins on proof-of-stake blockchains and earn rewards. The protocol will essentially help BTC become a staking asset on PoS networks, using its security to make PoS chains safer. Currently, PoS chains rely on their native tokens for security, which can be expensive, especially for newer chains that often need to offer high staking rewards to attract capital.","One such example is the Cosmos Hub ecosystem, which lets every application have its own blockchain. Babylon is already in the process of <a href=\"https:\/\/www.theblock.co\/post\/215662\/babylon-to-bring-bitcoin-security-to-chains-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">supporting<\/a> the Cosmos Hub ecosystem, as The Block reported previously.","\"Bitcoin staking introduces a crucial new use case for the industry, marking a significant stride in the integration of Bitcoin with the Proof-of-Stake economy,\" Yi He, co-founder of Binance and head of Binance Labs, said in a statement. \"Binance Labs' investment in Babylon represents our commitment to supporting innovative projects leading the Bitcoin narrative and advancing its use cases.\"","Babylon's own PoS chain, built using the Cosmos SDK, will be the first PoS chain to be secured by the protocol. It will then enable a marketplace where BTC holders can restake to other PoS networks via Babylon.","With Binance Labs' investment, Babylon plans to hire more developers and aims to launch its mainnet phase one before the end of this year, Tse said."],"hashtag":["BITCOIN","PROTOCOLS","RESTAKING","STAKING","STRATEGIC INVESTMENTS"]}