{"summary":"PayPal’s Stablecoin PYUSD is Available on Venmo to Select Users","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/paypals-stablecoin-pyusd-available-venmo-select-users.htm","publishDate":"2023-09-21T08:27:00","id":20883,"type":null,"title":"PayPal’s Stablecoin PYUSD is Available on Venmo to Select Users","category":["Altcoin News "],"content":["PayPal-operated peer-to-peer mobile payments platform Venmo has started offering PayPal USD stablecoin (PYUSD) to selected users, starting September 20.","“We are pleased today to announce that PayPal USD is now available on Venmo to select users and will be rolling out fully in the coming weeks.”","The launch enables Venmo users to purchase the stablecoin and send it via PayPal, Venmo and other compatible external wallets, a company press release read.","PYUSD is an Ethereum-based stablecoin, backed by U.S. dollar deposits and other liquid equivalents, such as short-term treasuries. The stablecoin was launched by the payment giant in August and is issued by Paxos Trust.","PayPal USD stablecoin is already available to users on leading exchanges including Kraken, Coinbase and Crypto.com, to name a few.","The stablecoin also received a green light from the New York State Department of Financial Services (NYDFS), “making it easier for virtual currency entities licensed in New York,” it added.","Besides, the company release said the move marks the first time users can transfer a stablecoin between PayPal and Venmo at no cost.","“Individuals using compatible external wallets, and merchants accepting payments in PYUSD, will also be able to receive transfers from Venmo users. Blockchain network fees apply,” PayPal wrote.","Paxos, PayPal’s stablecoin issuer, published a transparency monthly report, which disclosed the total net assets of PYUSD with the current market value of collateral of $45.3 million as of August 31, 2023.","The report highlighted that the stablecoin did not receive widespread adoption despite its promise to promote global payments. The report further noted that approximately $1.5 million was backed by cash deposits and the majority of reserves – $43.8 million – were collateralized through US Treasury reverse repurchase agreements.","Though PYUSD hasn’t de-pegged from $1 so far, it has merely grown 0.05% when compared to the oldest stablecoin Tether (USDT). Tether has a market capitalization exceeding $83 billion, with 24-hour trading volume surpassing $20 billion.","Per CoinMarketCap, PYUSD holds 19th position among stablecoins in terms of market capitalization at press time. Some of the reasons that PYUSD has failed to gain traction among users could include tougher competition among stablecoins and possible regulatory setbacks."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$45.3 million","content":"MONEY"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"Paxos Trust","content":"ORGANIZATION"},{"type":"August 31, 2023","content":"DATE"},{"type":"$43.8 million","content":"MONEY"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Venmo","content":"LOCATION"},{"type":"Venmo","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"September 20","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"$83 billion","content":"MONEY"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"0.05%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["PayPal"],"authors":["Sujha Sundararajan"]}