{"summary":"Solana Meme Coin Bulls Target 185% ROI on SLOTH as Top 10 CEX Listings Rumor Spreads","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-meme-coin-bulls-target-185-roi-on-sloth-as-top-10-cex-listings-rumor-spreads.htm","publishDate":"2024-05-15T15:56:09","id":20881,"type":null,"title":"Solana Meme Coin Bulls Target 185% ROI on SLOTH as Top 10 CEX Listings Rumor Spreads","category":["Industry Talk "],"content":["Wednesday, May 15, 2024 – Solana meme coin Slothana ($SLOTH) has been making new all-time highs as it pulls in buyers eager to take pole position for even bigger gains to come.","Currently priced at $0.035, $SLOTH was trading as high as $0.0565 at the beginning of the week.","Now bulls are targeting $0.10 for upside of 185% in the near term.","If word on the crypto grapevine is correct, $SLOTH could easily surpass that price target, with meme coins continuing to outperform the rest of the crypto market – and Solana-based tokens are leading the way.","Rumors of a top 10 centralized exchange listing is set to add to the momentum created by a token burn mechanism that has seen bulls charge into the $SLOTH market.","The most recent $1 million burn led to a price pump shortly after the event news was posted on X.","$SLOTH Faithful! Word on the branch is that the smoke from our forest fires has caught the attention of some big exchanges. This we can neither confirm nor deny, but it’s probably, maybe, definitely true. Stay faithful slovenly followers, for soon, Lambos will be ours. 🚗🦥💸… pic.twitter.com\/A0RkSOEfox","— Slothana (@SlothanaCoin) May 15, 2024","","There are now more than 36,700 token holders of $SLOTH in self-custody wallets, not to mention a growing band of centralized exchanges (CEXs) clamoring to list the coin.","Slothana burns $1m worth of Slothana when the price appreciates an additional cent, as set out in an X post on the 10th May, that has so far had 219k views as the excitement spreads.","🔥🌲🦥 Slothana tokens are at risk of going up in smoke! As the $SLOTH price climbs, the forest fires rage quicker, turning $SLOTH tokens to ashes.","📈 $0.03 = $3m $SLOTH burnt 🔥\n📈 $0.04 = $4m $SLOTH burnt total 🔥\n📈 $0.05 = $5m $SLOTH burnt total 🔥\n📈 $0.06 = $6m $SLOTH… pic.twitter.com\/xdhd69JD55","— Slothana (@SlothanaCoin) May 10, 2024","","With early presale buyers sitting on gains of 3x, there has been predictable profit-taking by savvy buyers looking to book ROI.","At the same time, the latest meme coin theme to sweep the market – the reignition of the meme stock craze – has seen some attention pulled away from other areas of the market.","GME, KITTY and AMC have all seen stellar gains in recent days.","However, the start of the European session has seen the first signs that this latest fad may be waning, which will likely help to refocus market participants’ interest on other areas of the meme coin space.","Meme stock diversion notwithstanding, Slothana has still been a persistent trender in the hot top 10 pairs on Dextools and other trading sites.","$SLOTH’s recent price momentum combined with what could be price-moving news flow around CEX listings means it is likely to see a new influx of whale traders imminently.","This whale bought $47k (332 SOL) worth of $SLOTH earlier today – expect more of the same in the coming hours as the rumor mill takes hold:","https:\/\/solscan.io\/tx\/3sJxTbLcqXCZMGrLbdhKdVCvjW5czdKfA1vhKrMSG1Du9LGwBByZRMyYU1wPXc4K5UTu82bjESDbiiqQizhAB62uPerhaps helping to spur listing rumors has been the organic listings that $SLOTH has been attracting as it broke through the $100 million market capitalization mark on Monday.","Poloniex, XT.com and Bitrue centralized exchanges have all added the token to their trading venues in the past couple of days, turning on the taps for more volume to enter the SLOTH\/SOL trading pair.","Although $SLOTH is trading 28% lower today, as news of impending major listings start to swirl and, presumably, an announcement from the team is forthcoming, the price is set to rocket again. Take the current pullback as a breather and opportunity to either add to an existing position or open a new one.","Trading volume is an exceedingly healthy $25 million at the time of writing.","Meanwhile, volatility is increasing, providing even more opportunity for day traders, but also for those with the patience to allow the price to come to them rather than trying to catch a falling knife.","Putting that another way, $SLOTH buy orders between today’s low of $0.026 and the current price around the $0.035 level, will likely be a good region to take advantage of a CEX-induced price acceleration to $0.10.","Taking a position in the $0.030 area delivers a handsome risk-reward ratio of 5 if the price, as postulated here, reaches 0.01 in the near term (measured from a stop-loss of $0.016), defined as the next week or so, depending on CEX news flow timings.","","The DEXTools link can be found here.","In a measure of the interest in the project, Slothana raised $15 million in its recent presale, as the frenzy around SOL meme coins remains unabated.","Tokens such as DogWifHat ($WIF), Bonk ($BONK), Book of Meme ($BOME) and Popcat ($POPCAT) have all done spectacularly well, and $SLOTH is on the cusp of joining their ranks.","Ongoing presales for Dogeverse and Sealana are a further indication of the red-hot nature of the SOL meme coin marketplace.","Slothana is in the vanguard of this movement and today’s price could well be the lowest crypto traders are ever likely to see.","Keep up with the latest burns and other developments on Slothana’s X account and Telegram group.","Buy SLOTH Here",""],"entity":[{"type":"Sealana","content":"PERSON"},{"type":"$SLOTH","content":"MONEY"},{"type":"$1m","content":"MONEY"},{"type":"$WIF","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"SOL","content":"ORGANIZATION"},{"type":"$0.030","content":"MONEY"},{"type":"May 15, 2024","content":"DATE"},{"type":"$0.0565","content":"MONEY"},{"type":"May 10, 2024","content":"DATE"},{"type":"Slothana","content":"ORGANIZATION"},{"type":"$0.03 = $3m $SLOTH","content":"MONEY"},{"type":"AMC","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$0.10","content":"MONEY"},{"type":"10th May","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$BOME","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"$0.035","content":"MONEY"},{"type":"$0.06 = $6m $SLOTH","content":"MONEY"},{"type":"$0.05 = $5m $SLOTH","content":"MONEY"},{"type":"$0.04 = $4m $SLOTH","content":"MONEY"},{"type":"$0.016","content":"MONEY"},{"type":"earlier today","content":"DATE"},{"type":"vanguard","content":"ORGANIZATION"},{"type":"Slothana","content":"PERSON"},{"type":"Bonk","content":"ORGANIZATION"},{"type":"$POPCAT","content":"MONEY"},{"type":"$47k","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"185%","content":"PERCENT"},{"type":"$BONK","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"$0.026","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["sloth","slothana"],"authors":["Gary McFarlane"]}