{"summary":"Lightning Labs Paving the Way to Bring Stablecoins to Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/lightning-labs-bring-stablecoins-to-bitcoin.htm","publishDate":"2024-05-09T15:29:29","id":20894,"type":null,"title":"Lightning Labs Paving the Way to Bring Stablecoins to Bitcoin","category":["Bitcoin News "],"content":["Lightning Labs CEO Elizabeth Stark believes the new functionality brought by the Lightning Network Taproot Assets protocol will enable stablecoins on Bitcoin.","During FT Live’s Crypto and Digital Assets summit in London, Stark gave an explainer of Bitcoin and the Lightning Network to an audience of traditional finance players. Lightning Labs’ Taproot Assets protocol is building functionality for issuing assets on Bitcoin that can be transferred over the Lightning Network for instant, high-volume, low-fee transactions.","This builds upon the foundation laid by the 2021 Lightning network Taproot upgrade which expanded Bitcoin’s smart contract and scripting capabilities.","This would facilitate the use of stablecoins on the Bitcoin network, and allow them to take advantage of the functionality that the Taproot Asset protocol offers. According to Stark, developers have made significant headway toward this goal, culminating in the testing of transactions on Lightning:","“We released an early part of the code in October and recently demoed the first-ever transaction on Lightning of an asset. The idea is to have crypto dollars and stablecoins on the Bitcoin blockchain.”","excited to announce that I’ve just made the first mainnet *asset* keysend payment w\/ Taproot Asset channels! ⚡️🥕","below you can see me sending beefbux across nodes instantly","the demo uses a dev version of litd (Lightning Terminal Daemon) that packages lnd+tapd ⛓️","⬇️ pic.twitter.com\/2IVh071YhL","— Olaoluwa Osuntokun (@roasbeef) May 2, 2024","","Stark argued that these assets suffer on current blockchains due to high transaction fees and other issues.","She cited Bitcoin’s network as the best blockchain to facilitate stablecoins because it “is the most secure and decentralized.”","","Stark highlighted growing stablecoin adoption since the COVID-19 pandemic. She cited emerging markets and nations grappling with hyperinflation and devaluing fiat currencies as contributors to this adoption, looking for alternative stores of value. She explained:","“The stickiest users have been those looking for a stable store of value. In some cases, they’re using Bitcoin. In other cases, they’re using stablecoins, and in some cases, it’s a combination of both.”","In 2021 El Salvador became the first country to register Bitcoin as legal tender, and since then it has seen massive adoption among its inhabitants. something that has proven effective, giving them massive economic growth since.","The largest stablecoin players $USDT and $USDC hold more United States Treasury bonds combined than major nations like Germany and South Korea. Something Stark highlighted and intriguing, given that end-users don’t benefit from the interest of holding stablecoins.","","Stark claims there is a need for the infrastructure to enable the issuance of stablecoins and real-world assets on the Bitcoin blockchain. She explained:","“That’s why we’re building this protocol, this technology right now. We’re not issuing assets, we’re building the rails. Asset issuers will use our technology to issue real-world tokenized assets.”","She added that the applications of this infrastructure could enable financial institutions to issue gold assets, stablecoins and other fiat-backed assets on Bitcoin. However, the biggest benefit of the Lightning network lies in its cheap transaction fees, compared to other blockchains and traditional financial systems.","Stark commented:","“If you look at Visa where fees in the U.S. can be upward of 3%, or even 1%, the fees, transacting with stablecoins on Lightning can be dramatically lower, a cent or less than that.”","This would fuel adoption not just in challenging economic climates, but globally. It would facilitate global transactions at far lower rates than traditional networks, giving the Lightning Network a competitive edge."],"entity":[{"type":"May 2, 2024","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$USDC","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"crypto dollars","content":"MONEY"},{"type":"19","content":"DATE"},{"type":"Elizabeth Stark","content":"PERSON"},{"type":"Lightning Network Taproot Assets","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"$USDT","content":"MONEY"},{"type":"Germany","content":"LOCATION"},{"type":"FT Live’s Crypto and Digital Assets","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"United States Treasury","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Lightning Network","Stablecoins"],"authors":["Harvey Hunter"]}