{"summary":"PayPal Enhances Crypto Offering with USD Conversion Service","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/paypal-enhances-crypto-offering-with-usd-conversion-service.htm","publishDate":"2023-09-12T13:00:00","id":20890,"type":null,"title":"PayPal Enhances Crypto Offering with USD Conversion Service","category":["Altcoin News "],"content":["Payments giant PayPal is expanding its cryptocurrency offerings with the introduction of a USD conversion service. ","The new “off ramp” service enables users to seamlessly convert their digital currencies into US dollars, the company said in a recent press release.","With this service, crypto wallet users in the US can directly convert their crypto holdings into USD and have the funds available in their PayPal balance. ","“By adding Off Ramps, crypto wallet users in the U.S. can convert their crypto to USD directly from their wallets into their PayPal balance so they can shop, send, save, or transfer to their bank or debit card.”","They can then utilize the balance for various purposes such as shopping, sending money, saving, or transferring funds to their bank account or debit card. ","PayPal aims to provide a convenient and integrated experience for its users within the crypto ecosystem.","The USD conversion service is not limited to just wallets but is also accessible to decentralized applications (dApps) and non-fungible token (NFT) marketplaces.","Furthermore, it has been integrated with MetaMask, a popular Ethereum wallet.","Web3 merchants can integrate PayPal’s on and off-ramp services to enjoy several benefits. ","For one, it provides a seamless payment experience trusted by millions of PayPal users and grants access to “robust security controls and tools for fraud management, chargebacks and disputes,” the company said. ","These features can help Web3 merchants expand their user base and streamline their payment processes.","The announcement from PayPal follows its recent crypto-related initiatives.","Back in August, The company announced that it is rolling out its PYUSD stablecoin soon. ","The dollar-pegged asset is issued by Paxos, a blockchain infrastructure firm that used to issue Binance USD (BUSD) stablecoin.","More recently, the payments giant also launched a new feature that allows users to hold and interact with Bitcoin (BTC) and other cryptocurrencies in their accounts. ","The new functionality, called Cryptocurrencies Hub, will allow users to not only hold a balance in various cryptocurrencies but also engage in transactions involving these digital assets.","By accessing the Cryptocurrencies Hub, PayPal users will be able to buy, sell, receive, and send cryptocurrencies. ","Moreover, they will have the option to utilize the proceeds from the sale of cryptocurrencies to make purchases through PayPal. ","Tether (USDT) and USD Coin (USDC) are the two largest stablecoins in the market, each with a circulating supply of more than $83 billion and $26 billion, respectively. "],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitcoin (BTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$26 billion","content":"MONEY"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$83 billion","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"Cryptocurrencies Hub","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["MetaMask","Payments","PayPal"],"authors":["Ruholamin Haqshanas"]}