{"summary":"Ukrainian MP ‘Fails to Provide Evidence of Where She Got Her BTC, ETH, ETC Stash’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ukrainian-mp-fails-to-provide-evidence-of-where-she-got-her-btc-eth-etc-stash.htm","publishDate":"2021-11-11T21:00:00","id":20893,"type":null,"title":"Ukrainian MP ‘Fails to Provide Evidence of Where She Got Her BTC, ETH, ETC Stash’","category":["Bitcoin News "],"content":["Ukraine’s corruption watchdog has unearthed what it believes is evidence of possible irregularities on an MP’s crypto declaration – and her cache of bitcoin (BTC), ethereum (ETH), and ethereum classic (ETC).","As previously reported, Ukrainian anti-corruption laws oblige all MPs to file declarations detailing all their assets – including cryptoassets.","And per Slovoidilo, the National Agency for the Prevention of Corruption says it has found “inaccurate information” in a 2020 declaration from the Za Majbutne (For the Future) Party MP Anna Skorokhod.","The watchdog did not allege any “conflict of interests,” but it seems to be dissatisfied with the MP’s claims about exactly how she came to own the coins. Skorokhod told the body that “she did not have enough technical knowledge” to make purchases and that “all transactions were “carried out on her behalf by her [former] husband.”","The MP, per her 2020 declaration, is sitting on a tidy collection of coins, including BTC 44 (USD 2.89m), ETH 130 (USD 620,672) and ETC 135 (USD 7,766).","Ukrainian law requires MPs to declare exactly when they bought tokens and how much they paid for them. But the watchdog says it believes there is a USD 9,347 discrepancy between the tokens’ stated worth at the time of purchase and the prices she (or her ex-husband) allegedly paid for them. ","The watchdog further noted that Skorokhod and her former husband Oleksiy Alyakin lived together from December 2015 to April 2021. Skorokhod submitted her declaration for 2020 on March 30, 2021 – during a time when she was still living with Alyakin.","It added that Skorokhod claimed that she did not know where the keys and any paper documents pertaining to the transactions were now, as, after the couple divorced, Alyakin “did not provide access to them,” hinting that “criminal proceedings” had been “initiated” as a result.","The issue appears to have been complicated after Skorokhod began living with fellow Anton Polyakov – who died last month in the back of a Kyiv taxi from coronary heart disease, aged just 33. Alcohol and methadone were found in his blood, and some media outlets have alleged foul play.","In June, Skorokhod reported that her passport had been stolen and pressed charges against an unnamed person, but did not report any theft of her crypto holdings.","Skorokhod’s 2020 declaration indicated that Alyakin was also something of a crypto whale. Dependents and immediate family members’ assets must also be detailed on MP declarations.","Her former husband, per the declaration, owned BTC 118 (USD 7.73m), ETH 78 (USD 372,403) and ETC 350 (USD 20,136), although, again, Skorokhod provided no documentation proving the price of the coins when Alyakin bought them.","The watchdog stated that the MP had provided noting but “general explanations” about the token acquisitions and will push ahead with legal action against the MP – who faces a fine of up to USD 1,620 if found guilty.","____","Learn more:\n– Ukrainian MP Cashed in Her Crypto – and Made More than Twice Her Salary\n– Ukrainian MPs Want to Jail People Who Don’t Disclose Crypto Holdings\n\n– Ukraine to Bring Crypto into Legal Sphere after ‘Legalization’ Bill Passes\n– Ukraine Might Allow Indirect Crypto Pay, Will Regulate Exchanges\n\n– ‘Legalize Crypto,’ Urges Ukrainian Cybercrime Chief\n– Hurry up and Regulate Crypto, Urges Ukrainian Central Bank"],"entity":[{"type":"Skorokhod","content":"PERSON"},{"type":"March 30, 2021","content":"DATE"},{"type":"Slovoidilo","content":"PERSON"},{"type":"Alyakin “","content":"PERSON"},{"type":"Twice Her Salary\n– Ukrainian MPs Want to Jail People Who Don’t Disclose Crypto Holdings\n\n– Ukraine to Bring Crypto","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"National Agency","content":"ORGANIZATION"},{"type":"Anna Skorokhod","content":"PERSON"},{"type":"December 2015","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Oleksiy Alyakin","content":"PERSON"},{"type":"Anton Polyakov","content":"PERSON"},{"type":"ETC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Urges Ukrainian Central Bank","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Alyakin","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Bitcoin","Ethereum","Ethereum Classic","Legal","Politics","Ukraine"],"authors":["Tim Alper"]}