{"summary":"US Fed to Blame for Downturn, Large Crypto Players Have Responsibility Toward Ecosystem – FTX CEO","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-fed-to-blame-for-downturn-large-crypto-players-have-responsibility-toward-ecosystem-ftx-ceo.htm","publishDate":"2022-06-20T11:49:00","id":20896,"type":null,"title":"US Fed to Blame for Downturn, Large Crypto Players Have Responsibility Toward Ecosystem – FTX CEO","category":["Bitcoin News "],"content":[" ","With crypto prices continuing to slide, Sam Bankman-Fried, the outspoken CEO of major crypto exchange FTX, argued that the US Federal Reserve (Fed) is to blame for the ongoing downturn, but that large companies such as his have a responsibility to step in and make efforts to contain the resulting losses for crypto investors.","“The core driver of this has been the Fed,” he said in an interview with public broadcaster NPR, declaring that, as the Fed is increasing interest rates in an aggressive bid to combat the rising inflation, this has led to a “recalibration” of expectations of risk among investors.","“Literally, markets are scared,” the CEO said. “People with money are scared.”","Bankman-Fried finds that major crypto businesses such as his exchange have a responsibility to strive to contain the losses resulting from the ongoing meltdown that impacts crypto investors.","“I do feel like we have a responsibility to seriously consider stepping in, even if it is at a loss to ourselves, to stem contagion,” the entrepreneur said. ","He added that: “Even if we weren’t the ones who caused it, or weren’t involved in it. I think that’s what’s healthy for the ecosystem, and I want to do what can help it grow and thrive.”","The CEO did not specify how they “stepped in” during this crash if at all, and just provided an example from 2021. Last year, when hackers targeted Japanese crypto exchange Liquid and stole close to USD 100m worth of crypto, FTX came to the company’s rescue with USD 120m in financing, and shortly afterward unveiled plans to acquire Liquid.","“We, I think about 24 hours later, stepped in and gave them a pretty broad line of credit to be able to cover all of their demands, to make sure customers were made whole, while thinking about the longer-term solution,” he said.","In contrast with the policy adopted by some of its major rivals, such as Coinbase, FTX says it is not going to slow down hiring new employees despite the adverse market conditions. The company finds that it significantly scaled its revenues and productivity during bullish times and is pursuing its hiring plans irrespectively of the industry’s general performance, according to Bankman-Fried.","____","Learn more: \n– FTX to Enter Japan via Liquid Group Acquisition as Altcoin Listing Rules May Ease\n– Liquid Exchange Hacked, Working With Other Exchanges on Recovering Funds\n\n– Not Enough Liquidity for Celsius to Sell Staked Ethereum in Open Market – Analyst\n– Canada’s Bitvo Acquired by FTX\n\n– FTX Overtook Coinbase & OKX in May,\n– ‘Strongly Profitable’ FTX Will Keep Hiring Despite Bearish Market – CEO"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"FTX Overtook Coinbase & OKX","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"US Federal Reserve (Fed","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"NPR","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Enter Japan via Liquid Group Acquisition","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Federal Reserve","FTX","Market","Sam Bankman-Fried","USA"],"authors":["Jaroslaw Adamowski"]}