{"summary":"Trader Loses $68M of Wrapped Bitcoin in Address Poisoning Scam","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/trader-loses-68m-of-wrapped-bitcoin-in-address-poisoning-scam.htm","publishDate":"2024-05-03T23:37:21","id":20906,"type":null,"title":"Trader Loses $68M of Wrapped Bitcoin in Address Poisoning Scam","category":["Bitcoin News "],"content":["An unknown trader lost $68 million worth of Wrapped Bitcoin (WBTC) in a single transaction in an address-poisoning scam on May 3, according to security firm Cyvers.","🚨ALERT🚨Are we mistaken, or has someone truly lost $68M worth of $WBTC? Our system has detected another address falling victim to address poisoning, losing 1155 $WBTC. 😢","Victim: https:\/\/t.co\/5NKlOFnepJ","Address poisoner: https:\/\/t.co\/R6fF0QipBH","Poison transaction:… pic.twitter.com\/UpG34ZcZvY","— 🚨 Cyvers Alerts 🚨 (@CyversAlerts) May 3, 2024","","The victim’s wallet was drained of over 97% of its total assets, and the rest of its contents have since been removed, leaving them with just $13.56 worth of ETH, according to CoinStats.","","Address poisoning, also known as address spoofing, exploits a trader’s haste and negligence during transactions. It involves tricking victims into sending their digital assets to fraudulent addresses belonging to scammers.","This is just one instance in a string of address-poisoning scams.","In October 2023, a hacker made off with $1.2 million worth of ARB tokens using the method.","Scams continue plaguing mainstream trust in the crypto industry. In April, investors lost at least $33 million of digital assets in a fraud case surrounding the ZKasino gambling platform. Dutch authorities arrested a suspect related to the ZKasino scam on April 29.","Despite the ZKasino incident, April only saw $25.7 million worth of cryptocurrency lost to scams and hacks. According to on-chain intelligence firm CertiK, this marks the lowest monthly figure since 2021. ","Total losses from exploits and scams fell 141% from the previous month, mainly attributed to a lack of private key compromises. There were 11 attacks against protocols via private key compromises in March, whereas in April, there were only three.","#CertiKStatsAlert 🚨","Combining all the incidents in April we’ve confirmed ~$25.7m lost to exploits, hacks and scams.","The lowest figure we’ve recorded, dating back to 2021.","A 141% decrease from March","Exit scams: ~$4.3m\nFlash loans: ~$129k\nExploits: ~$21m","More details below pic.twitter.com\/zfSh8mabzJ","— CertiK Alert (@CertiKAlert) April 30, 2024","","The current trend clearly indicates progress within the space, not only in security developments but in education. People are more aware of how to protect themselves from hacks and scams.","Despite the record-low month, crypto attacks are still a serious industry issue. According to CertiK, over $502 million worth of digital assets were stolen across 223 hacks and exploits during the first quarter of 2024."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"$25.7 million","content":"MONEY"},{"type":"$4.3","content":"MONEY"},{"type":"May 3","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$25.7","content":"MONEY"},{"type":"97%","content":"PERCENT"},{"type":"$1.2 million","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"$129k","content":"MONEY"},{"type":"$13.56","content":"MONEY"},{"type":"April 29","content":"DATE"},{"type":"March","content":"DATE"},{"type":"141%","content":"PERCENT"},{"type":"$68 million","content":"MONEY"},{"type":"April 30, 2024","content":"DATE"},{"type":"$502 million","content":"MONEY"},{"type":"$WBTC","content":"MONEY"},{"type":"May 3, 2024","content":"DATE"},{"type":"$68M","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Cyvers","content":"ORGANIZATION"},{"type":"$33 million","content":"MONEY"},{"type":"$21m","content":"MONEY"}],"hashtag":["Crypto crime","crypto scam","WBTC"],"authors":["Harvey Hunter"]}