{"summary":"BitGo Announces Landmark Deal to Acquire Crypto Custodian Prime Trust","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitgo-announces-landmark-deal-acquire-crypto-custodian-prime-trust.htm","publishDate":"2023-06-09T11:45:00","id":20907,"type":null,"title":"BitGo Announces Landmark Deal to Acquire Crypto Custodian Prime Trust","category":["Altcoin News "],"content":["BitGo Holdings Inc., the renowned digital asset trust and security company, has revealed plans to acquire 100% of the equity of Prime Core Technologies, Inc., the parent company of Prime Trust.","The development marks a watershed moment for the Prime Trust clients, positioning them to enjoy business continuity, long-term stability, and regulated, secure solutions once the acquisition is implemented.","BitGo has signed a letter of intent to acquire one of the best financial infrastructure providers for fintech and digital asset innovators worldwide as part of the company’s plans to take its digital asset and fintech infrastructure services global.","Notably, however, the agreement is non-binding, possibly because BitGo has additional due diligence to perform or Prime Trust has to meet certain conditions before solidifying the deal.","Such was the case when the now-Twitter CEO Elon Musk disclosed plans to purchase the giant social media company.","Nevertheless, the move makes BitGo a pioneer, given that it is the first international digital asset firm to offer a full suite of solutions for fintech platforms.","Jor Law has commented on the intended acquisition, saying:","The combination of Prime Trust and BitGo would be a significant enhancement for the industry,” No other company will have the breadth of product and services nor depth of experience that this combined company would have. We are excited to offer our world-class infrastructure within a broader ecosystem and revolutionize the future of crypto.","Jor Law was board-appointed on November 30, 2022, to serve as interim CEO and President of Prime Trust, a leadership transition targeted at “better aligning the company, its prospects, and its potential with the current marketplace.”","BitGo CEO and Co-founder Mike Belshe also weighed in on the acquisition, calling it a “landmark transaction” that would lay the ground for a more transformative shift in the digital asset space.","This is a landmark transaction, leading a greater shift in the digital asset landscape toward a more secure and sustainable future. With the expected acquisition of Prime Trust, BitGo is well positioned to enhance its best-in-class, trusted solutions and to service the combined customer base.","Notably, BitGo Holdings Inc. boasts a solid balance sheet, with a popular reputation for its credibility and an unmatched adherence to top-deck operational standards. ","These will certainly play an enabling role in the new venture despite the current market gloom, and Prime Trust’s clients will notice a paradigm shift.  "],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Mike Belshe","content":"PERSON"},{"type":"Holdings Inc.","content":"ORGANIZATION"},{"type":"BitGo Holdings Inc.","content":"ORGANIZATION"},{"type":"Prime Core Technologies, Inc.","content":"ORGANIZATION"},{"type":"Twitter CEO Elon Musk","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Prime Trust","content":"ORGANIZATION"},{"type":"November 30, 2022","content":"DATE"}],"hashtag":["CRYPTO","Cryptocurrency","M&A"],"authors":["test"]}