{"summary":"Hong Kong’s Crypto License Scheme Sees 24 Applicants, Far Fewer Than Singapore’s 70","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-crypto-license-scheme-sees-24-applicants-far-fewer-than-singapores-70.htm","publishDate":"2024-03-01T11:57:34","id":20903,"type":null,"title":"Hong Kong’s Crypto License Scheme Sees 24 Applicants, Far Fewer Than Singapore’s 70","category":["Altcoin News "],"content":["The deadline for virtual asset trading platform (VATP) crypto license applications in Hong Kong has passed, with the number of applicants reaching 24, a significantly lower figure than the 70 applicants seen in a similar scheme in Singapore.","At least five cryptocurrency firms submitted their applications in the final days leading up to the February 29 deadline, per a report from the South China Morning Post.","Cryptocurrency exchanges that have not yet applied must exit the Hong Kong market by May 31.","The Securities and Futures Commission (SFC) will announce approved and declined applications on a public register by June 1, 2024.","After securing approval, virtual asset trading platforms can onboard new retail and institutional crypto investors and start marketing in Hong Kong.","Major crypto exchanges with ties to mainland China or Hong Kong, including industry giants, have either applied for licenses directly or through their affiliates. ","HBGL Hong Kong, an affiliate of HTX (formerly Huobi Global), submitted an application twice for its Huobi HK platform, while HKVAEX, an affiliate of Binance, applied in April. ","OKX, another prominent exchange founded in China, submitted its application back in November. ","Currently, OSL and HashKey are the only licensed exchanges serving retail investors.","Besides the list of crypto exchanges being considered for approval, the SFC also released a list of those whose applications have either been withdrawn or outrightly rejected by the agency.","The list includes Ammbr HK Limited, BitHarbour HK Limited, Meex Digital Securities Limited, and HBGL HK Limited. Out of the four exchanges, only the Meex Digital Securities Limited application was rejected by the SFC. ","The other three withdrew their applications.","It is worth noting that there have been concerns about the strict requirements for the registration process, which could potentially hamper the market’s competitiveness.","While Hong Kong allows crypto firms to tap into developer talent in mainland China, the high costs associated with the licensing process differentiate it from Singapore.","Estimates suggest that the entire process, including external assessors and hiring a local responsible officer (RO), could cost over HK$60 million (US$7.7 million).","Angela Ang, a former regulator with the Monetary Authority of Singapore, told SCMP that the lower number of applicants in Hong Kong can be attributed to the stringent requirements. ","Furthermore, there is concern that Hong Kong’s regulations may limit the global competitiveness of crypto companies using the city as a base of operations. ","The current framework restricts the scope of activities and services that can be offered to customers, potentially hindering their ability to operate globally.","Hong Kong also aims to regulate tokenized securities and stablecoins as part of its broader Web3 push, while the monetary authority explores the concept of a digital Hong Kong dollar.","In comparison, when Singapore’s Monetary Authority gave crypto companies one month to notify their pre-existing status and intention to be licensed in 2021, it resulted in about 70 official license applications by the end of 2021, three times the number in Hong Kong."," "],"entity":[{"type":"Meex Digital Securities Limited","content":"ORGANIZATION"},{"type":"Securities and Futures Commission (SFC","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"June 1, 2024","content":"DATE"},{"type":"February 29","content":"DATE"},{"type":"OSL","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Angela Ang","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"HK$60 million (US$7.7 million","content":"MONEY"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Singapore’s Monetary Authority","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"May 31","content":"DATE"},{"type":"April","content":"DATE"},{"type":"SCMP","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Crypto Exchange","Hong Kong","Licence"],"authors":["Ruholamin Haqshanas"]}