{"summary":"Crypto lender BlockFi filed for Chapter 11 bankruptcy protection. \nSam Bankman-Fried admitted he didn’t spend any time on risk management at FTX. \nExchange Kraken cut 1,100 staffers, about 30% of its workforce. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191921\/here-are-the-three-biggest-cryptocurrency-stories-from-the-past-week","publishDate":"2022-12-03T07:23:06","id":2091,"type":null,"title":"Here are the three biggest cryptocurrency stories from the past week","category":["Exchanges"],"content":["As the collapse of crypto exchange FTX continues to echo through the industry, the news cycle shows no sign of slowing. The industry closed out a distressing month with another bankruptcy as BlockFi filed for Chapter 11 protection.","Disgraced FTX founder Sam Bankman-Fried continued his post-collapse media tour as the U.S. Senate held its first hearing on the exchange.&nbsp;","Fellow crypto exchange Kraken announced employee layoffs, citing the market downturn.","It wouldn't be a week in November 2022 without crypto bankruptcy news. On Nov. 28, crypto lender BlockFi <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection after earlier announcing that it had paused withdrawals.","According to the firm's petition, BlockFi claimed more than 100,000 creditors along with between $1 billion and $10 billion in assets and liabilities.&nbsp;","The filing also disclosed some of its major creditors: Ankura Trust is owed $729 million, while FTX US and the Securities and Exchange Commission have unsecured claims of $275 million and $30 million respectively.&nbsp;","During court proceedings, the company also <a href=\"https:\/\/www.theblock.co\/post\/190660\/blockfi-has-355-million-in-digital-assets-frozen-on-ftx\" data-v-f87c67ca=\"\">disclosed<\/a> that it had $355 million stuck on FTX.&nbsp;","Speaking of FTX, its disgraced founder Sam Bankman-Fried has been on a bit of a media tour of late. On Wednesday, Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/191180\/sam-bankman-frieds-bizarre-apology-tour-goes-prime-time\" data-v-f87c67ca=\"\">told<\/a> the New York Times that he \"messed up big\" and took responsibility for a lack of oversight that led to the risky positions trading firm Alameda Research held with FTX.&nbsp;","In an ABC News interview on Thursday, the former FTX CEO <a href=\"https:\/\/www.theblock.co\/post\/191286\/i-wasnt-even-trying-to-do-risk-management-sam-bankman-fried-tells-abc\" data-v-f87c67ca=\"\">admitted<\/a> that he didn't spend any time on risk management.","''I wasn't even trying, like, I wasn't spending any time or effort trying to manage risk on FTX,\" he told George Stephanopoulos during a TV interview filmed in the Bahamas. ''I don't know what to say, like, what happened, happened.''&nbsp;","Later that day, Bankman-Fried further <a href=\"https:\/\/www.theblock.co\/post\/191616\/sam-bankman-frieds-still-sorry-but-now-he-says-his-memory-isnt-great\" data-v-f87c67ca=\"\">expressed<\/a> regret for his mishandling of the exchange, but seemed to have trouble recalling the events that led to its downfall. He used the phrase “I don’t remember” at least 10 times to sidestep questions.&nbsp;","This comes as the U.S. Senate held its first hearing on the FTX collapse, where Commodities Futures Trading Commission Chair Rostin Behnam <a href=\"https:\/\/www.theblock.co\/post\/191407\/cftc-chair-behnam-walks-fine-line-during-congress-first-ftx-hearing\" data-v-f87c67ca=\"\">called<\/a> for a new authority and federal regulatory framework to oversee cryptocurrency.&nbsp;","Other crypto exchanges are also feeling the heat. Kraken <a href=\"https:\/\/www.theblock.co\/post\/191023\/kraken-cuts-30-of-staff-to-weather-crypto-winter\" data-v-f87c67ca=\"\">announced<\/a> on Nov. 30 that it was cutting 1,100 staffers after saying in June that it had no plans to adjust hiring goals.&nbsp;","That amounts to about 30% of its workforce, according to a statement shared by co-founder and CEO Jesse Powell, in which he blamed \"current market conditions\" for the job cuts.&nbsp;","It was the latest in the series of staff <a href=\"https:\/\/www.theblock.co\/post\/183497\/layoffs-sweep-crypto-as-economic-concerns-mount-dapper-labs-bitmex-among-hardest-hit\" data-v-f87c67ca=\"\">cuts<\/a> at crypto companies amid a downturn exacerbated by bankruptcy protection filings in the sector."],"hashtag":["BANKRUPTCY FILINGS","BLOCKFI","FTX","KRAKEN"]}