{"summary":"Former Social Media Giant Cyworld To Return With A New Token","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/former-social-media-giant-cyworld-to-return-with-a-new-token-9108.htm","publishDate":"2021-02-04T01:00:00","id":20918,"type":null,"title":"Former Social Media Giant Cyworld To Return With A New Token","category":["Altcoin News "],"content":["The erstwhile South Korean social media giant Cyworld is set to take a second stab at relaunching its business under new ownership – in a bid to retain its former glory with a new token.","Per Hanguk Kyungjae, the firm is now under new ownership, after a consortium of at least five domestic firms – all unnamed except for entertainment company SKY E&M – snapped up Cyworld from its troubled former owner for a paltry USD 897,000.","The media outlet pointed out that, as an unpaid wage bill to Cyworld employees totaled around the same amount, the consortium had, in effect, picked up a company with a worth of zero.","However, the Cyworld brand name is still strong in South Korea. The social media network launched in 1999 and enjoyed enormous popularity in the early 2000s, with some 25% of the nation believed to be active Cyworld users at its peak toward the end of the decade. It was bought out by business conglomerate SK in 2003, and its popularity spread to China and other Asian nations.","A data leak and the rise of non-domestic social media platforms led to a sharp decline after 2011, though, and the firm was eventually sold off to Aire in 2016.","Under new ownership, Cyworld then tried to launch a crypto business, raising almost USD 0.5m in token sales for a token named Cling – before seeing prices bottom out.","A bitter struggle over unpaid wages to scores of employees then broke out before the company was eventually sold off to the consortium, which has now unveiled plans to rebrand it as Cyworld Z.","The consortium has created a new Ethereum-based token named Dotori (Acorn), which, media outlets report, they hope to list on “one of the country’s top three crypto exchanges.”","Hanguk Kyungjae, though, quotes an unnamed crypto exchange employee as stating that their platform had “never held any discussions with Cyworld.”","Nevertheless, the consortium has reportedly received over USD 7 million worth of backing from investors, and plans a “Cyworld 3.0” PC version launch next month, as well as a mobile rollout in the first half of 2021.\n___\nLearn more:\nA Look Into the Trending Decentralized Social Media Experience: Mastodon\nETH Prices Barely Budge Despite Ethereum Foundation’s Reddit Deal\nTrump vs. Twitter Fight Reignites Social Media Decentralization Vision"],"entity":[{"type":"2003","content":"DATE"},{"type":"Mastodon\nETH Prices Barely Budge Despite Ethereum Foundation’s Reddit Deal\nTrump vs. Twitter Fight Reignites Social Media Decentralization Vision","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"Hanguk Kyungjae","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"Acorn","content":"ORGANIZATION"},{"type":"the first half of 2021","content":"DATE"},{"type":"1999","content":"DATE"},{"type":"Cyworld Z.","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"2000s","content":"DATE"},{"type":"Aire","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Adoption","Altcoins","Social media","South Korea","Tokenization"],"authors":["Tim Alper"]}