{"summary":"Market recovery will be linked to adoption and the Chicago-based firm sees deficit of crypto, not a surplus.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194161\/cumberland-sees-better-days-for-crypto-in-2023-after-market-rewires-itself","publishDate":"2022-12-12T14:36:23","id":2092,"type":null,"title":"Cumberland sees better days for crypto in 2023 after market &#x27;rewires itself&#x27;","category":["MARKETS"],"content":["Cumberland sees adoption leading to a market recovery in 2023, but only after a “spat of volatility” as the “market rewires itself.”","Jonah Van Bourg, the firm’s head of trading, said he expects an eventual up-trend next year in the wake of deregulation by China and Russia that will enhance bitcoin’s “geopolitical relevance,” as well as the continued onboarding of blockchain technology by major tech companies.","After a very busy month, price action is consolidating,” Van Bourg said in a lengthy <a href=\"https:\/\/twitter.com\/CumberlandSays\/status\/1602317880296878082\" data-v-f87c67ca=\"\">Twitter thread<\/a>. “Given the nature of crypto and the tectonic shifts occurring beneath it, we do not expect this paradigm to last.”","The collapse of FTX and Terra removed oxygen from lending markets and accelerated realignment with more 'sober' valuations, the thread read. Firms across the industry have curtailed plans or are out of business, and \"the future of the industry is as cloudy as ever,\" he said.","He said the relative price stability seen in recent weeks won't last.","\"In the wake of billions of dollars worth of those liquidations and trillions of dollars of lost market capitalization, the next leg of price action is almost entirely dependent upon whether there are further firesales to come,\" he said.","While Van Bourg admits a handful of portfolios will be unwound over the coming months, the more significant risk he foresees is a lack of crypto — as opposed to a surplus.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Bourg","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Jonah Van Bourg","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CARDANO","DOGECOIN","ECONOMIC INDICATORS","EQUITY MOVERS"],"authors":["Adam Morgan McCarthy","The Block"]}