{"summary":"Kazakhstan: Blockchain Hub ‘Approves of Crypto Regulations’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kazakhstan-blockchain-hub-approves-of-crypto-regulations-2014.htm","publishDate":"2018-06-15T03:59:00","id":20922,"type":null,"title":"Kazakhstan: Blockchain Hub ‘Approves of Crypto Regulations’","category":["Blockchain News "],"content":["The head of Kazakhstan’s Astana International Financial Center (AIFC), the country’s hub of all things blockchain and cryptocurrency-related, has backed calls for crypto regulations as the government continues to press ahead with a potential crackdown.","The center – a central government-backed initiative – has seen the likes of financial giant Deloitte and blockchain provider Waves move in, with the latter’s CEO calling Kazakhstan “the Singapore of blockchain.”","However, beginning in February this year, the government changed its tack on cryptocurrencies, with the central bank talking of a ban on crypto trading and mining – which would likely cause major issues for the AIFC and the country’s growing crypto-community. AIFC officials have claimed they believe the government will “approve the regulations and start working with them beginning in summer this year.”","Speaking at a blockchain event in the capital, Kairat Kaliyev, the AIFC’s Managing Director, stated per media outlet Kazinform, “In terms of fintech, we are paying special attention to blockchain technology, as well as [cryptocurrencies]. The [cryptocurrency] regulation problem is being discussed very intensively now. The AIFC has a very firm position on this issue: We believe it is crucial to regulate the circulation of [cryptocurrencies].”"],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Kazakhstan’s Astana International Financial Center","content":"ORGANIZATION"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Kairat Kaliyev","content":"PERSON"},{"type":"February this year","content":"DATE"}],"hashtag":["Regulation"],"authors":["Tim Alper"]}