{"summary":"Brazil’s USDT Volume Exceeds all Crypto Transactions Combined: Revenue Dept. Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/brazils-usdt-volume-exceeds-all-crypto-transactions-combined-revenue-dept-report.htm","publishDate":"2023-10-30T10:08:03","id":20930,"type":null,"title":"Brazil’s USDT Volume Exceeds all Crypto Transactions Combined: Revenue Dept. Report","category":["Altcoin News "],"content":["The Brazilian tax department report said that the country’s Tether (USDT) trading volume proliferated since 2021. Tether stands out among other stablecoins and has surpassed the volume of Bitcoin (BTC) during the same period.","“Among the stablecoins, the cryptocurrency called Tether stands out, which in the period observed by the tax authorities was traded at an accumulated level of more than R$271 billion, almost double the volume of Bitcoin in the same period (more than R$151 billion).”","According to data from Brazil’s revenue service agency, 80% of cryptocurrency transactions in the country are related to USDT. This makes it the most traded digital asset so far in 2023.","“Considering only partial data from 2023, 80% of the reported cryptocurrency movement is related to USDT,” the report revealed. Interestingly, the trading volume of the stablecoin has exceeded last year’s sum of all other cryptos traded.","The trend complements the recent warning from the International Monetary Fund (IMF). It noted that stablecoins “could potentially replace official currencies and significantly impact countries’ monetary policies,” especially in developing economies.","The Receita Federal do Brasil, has been tracking the growth in stablecoin using sophisticated techniques like AI and network analysis. The report says that the tool has just gained new functionality designed to represent relationships between operators.","Amid high inflation and steady devaluation of the Brazilian real, citizens have tripled the traded volume of stablecoins since 2021.","The tax authority previously reported that between January and November 2021, locals traded $11.4 billion in stablecoins. The trading volume was almost triple the total traded in 2020.","Brazil’s rising inflation is one of the factors that drove the phenomenon of stablecoin purchases. The country saw an inflation rate of 10.06% in 2021, the highest level since 2015.","Another reason is that Brazilians are forced to pay tax on financial operations – IOF in Portuguese – while acquiring foreign currency. The tax is however not applicable to stablecoins.","The USDT prevalence in Brazil contrasts with other Latin American nations like Argentina, where Maker’s DAI has received more attention."],"entity":[{"type":"2015","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"$11.4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"R$271 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"10.06%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"Receita Federal do Brasil","content":"ORGANIZATION"},{"type":"R$151 billion","content":"MONEY"}],"hashtag":["Brazil","Stablecoin","Tether","USDT"],"authors":["Sujha Sundararajan"]}