{"summary":"Binance Hacked: Withdrawals Frozen, Manipulation Warning, BTC Dropped","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-hacked-we-are-hurt-but-not-broke-3820.htm","publishDate":"2019-05-08T03:57:00","id":20931,"type":null,"title":"Binance Hacked: Withdrawals Frozen, Manipulation Warning, BTC Dropped","category":["Bitcoin News "],"content":["Major cryptocurrency exchange Binance said that hackers stole more than BTC 7,000 (USD 40 million) from them, as the company have discovered a large scale security breach on May 7, 17:15:24 (UTC).","The company estimates that deposits and withdrawals will be suspended for one week, but they “will continue to enable trading.” In the past 24 hours, the trading volume on Binance stood at USD 1 billion.","“Please also understand that the hackers may still control certain user accounts and may use those to influence prices in the meantime. <…> But we believe with withdrawals disabled, there isn’t much incentive for hackers to influence markets,” they added.","“We don’t know exactly at what extent the number of users affected,” Binance CEO Changpeng Zhao said during a livestream earlier today.","Bitcoin dropped following the announcement and is down by 1.67% in the past 24 hours. The rest of the market is also in red, mostly. Binance Coin, the native token of Binance, is down by 6,66% (04:11 UTC.) Later, the market somewhat recovered.","Bitcoin price chart:","Read more: What is the crypto community talking about the hack?","Binance claims that it will use the #SAFU fund (Secure Asset Fund for Users) to cover this incident in full and “no user funds will be affected.”","Also, during the livestream, the CEO mentioned a possibility to roll back Bitcoin network transactions.","“To be honest, we can actually do this probably within the next a few days. But there are concerns that if we do a rollback on the Bitcoin network at that scale, it may have some negative consequences, in terms of destroying the credibility for Bitcoin,” he said, adding that “we will consider that very, very carefully, with the feedback we are receiving.”","According to recent discussions on Reddit, the crypto community is strongly against the rollback, as “any rollback is a horrible idea. This is the bitcoin version of a government bailout.”","Later, the CEO confirmed that they decided against the rollback, later adding that “to put this to bed, it’s not possible, bitcoin ledger is the most immutable ledger on the planet. Done.”","Read more: Could this rollback happen? And what would it truly mean?","Meanwhile, Binance explained that hackers were able to obtain a large number of user API keys, 2FA codes, and potentially other info.","“The hackers used a variety of techniques, including phishing, viruses and other attacks. We are still concluding all possible methods used. There may also be additional affected accounts that have not been identified yet,” the exchange said.","According to the announcement, the breach impacted thei Bitcoin hot wallet only (which contained about 2% of their total BTC holdings.)","____","“The hackers had the patience to wait, and execute well-orchestrated actions through multiple seemingly independent accounts at the most opportune time. The transaction is structured in a way that passed our existing security checks. It was unfortunate that we were not able to block this withdrawal before it was executed. Once executed, the withdrawal triggered various alarms in our system. We stopped all withdrawals immediately after that,” the exchange said, adding that the hackers were able to withdraw BTC 7,000 in this one transaction: https:\/\/www.blockchain.com\/btc\/tx\/e8b406091959700dbffcff30a60b190133721e5c39e89bb5fe23c5a554ab05ea","Binance suspended deposits and withdrawals even before it announced the security breach, while their CEO claimed that “Funds are #safu.”","____","Trading volume on Binance:","___","As many experts have stressed previously, crypto users should keep their private keys to their coins offline, e.g. in hardware wallets such as Ledger, Trezor, KeepKey and others.","However, Changpeng Zhao earlier this year suggested that cryptocurrency users should store their private keys on an exchange."],"entity":[{"type":"1.67%","content":"PERCENT"},{"type":"Reddit","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"1 billion","content":"MONEY"},{"type":"May 7","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"6,66%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"}],"hashtag":["Binance","Exchange","Hack"],"authors":["Linas Kmieliauskas"]}