{"summary":"The chairman of the SEC was one of the guest speakers at an annual event for Democrats on a key congressional body in financial services, according to documents obtained by The Block. \nChairman Gary Gensler focused his remarks on cryptocurrency, arguing before the Congresspeople in attendance that the SEC has existing legal authority over much more of the market than currently acknowledged. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134654\/scoop-sec-chair-gensler-pitches-his-crypto-vision-at-exclusive-house-democrat-event","publishDate":"2022-02-17T16:46:04","id":2093,"type":null,"title":"SEC chair Gensler pitches his crypto vision at exclusive House Democrat event","category":["Congress"],"content":["<span data-v-f87c67ca=\"\">Gary Gensler, chairman of the Securities and Exchange Commission, is continuing to pitch lawmakers on his vision for crypto oversight out of the public eye.<\/span>","<span data-v-f87c67ca=\"\">Gensler addressed Democrats of the House Financial Services Committee on February 15. The call took place during an annual retreat for Democratic members and legislative staff.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block obtained an agenda for the event as well as detailed notes from the discussion with Gensler that were prepared by an attendee.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the notes, Gensler’s remarks focused heavily on crypto. He kicked off by comparing the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/134101\/crypto-apps-soar-in-popularity-after-super-bowl-splurge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spate of crypto advertisements<\/span><\/a><span data-v-f87c67ca=\"\"> during this month’s Super Bowl to the surge in subprime mortgages that led to the financial crisis of 2007-2008.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That crisis represented a critical moment in Gensler’s career, as it opened the door for him to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/133644\/before-senate-cftc-cites-crypto-as-basis-for-biggest-expansion-since-dodd-frank\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">expand the authorities<\/span><\/a><span data-v-f87c67ca=\"\"> of the Commodity Futures Trading Commission, which he chaired from 2009 to 2014.<\/span>","<span data-v-f87c67ca=\"\">“Let’s not make arbitrary loopholes,” Gensler was quoted as saying in the notes, a continuation of his longstanding argument that the SEC’s existing authority covers digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Central to this argument is Gensler’s skepticism when it comes to the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/123346\/sec-chair-gensler-hints-at-enforcement-actions-against-crypto-firms\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">novelty of cryptocurrency technology<\/span><\/a><span data-v-f87c67ca=\"\">. Per the notes, Gensler appears to have spoken on the subject somewhat more frankly than in past public appearances. He told Congresspeople and legislative staff on the call that the ecosystem for digital assets is more centralized and less new than the industry acknowledges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Most of these tokens are securities,” Gensler was quoted as saying.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Neither Gensler’s staff nor the SEC press office would confirm or deny the presentation’s details when reached. After the initial publication of this story, a representative for the SEC declined comment. Staffers for committee Democrats did not return requests for comment.<\/span>","<span data-v-f87c67ca=\"\">The conversation was part of an annual and exclusive retreat by committee Democrats that took place virtually this year. Other speakers on the agenda were National Economic Council Director Bryan Deese, deputy director of the Federal Housing Finance Agency Sandra Thompson, and Consumer Financial Protection Bureau director Rohit Chopra.<\/span>","<span data-v-f87c67ca=\"\">Gensler has been pushing for greater SEC oversight of crypto since he took office. Most recently, his agency announced a major settlement BlockFi, a move that provided a greater degree of regulatory clarity around <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/134165\/with-100-million-settlement-confirmed-blockfi-aims-to-register-yield-with-sec\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto lending products<\/span><\/a><span data-v-f87c67ca=\"\">. Gensler has also sought to convince lawmakers and the general public that centralized crypto exchanges should be subject to closer SEC supervision.<\/span>","<span data-v-f87c67ca=\"\">The prevailing sentiment in DC, however, seems to be for the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/127758\/us-senate-confirms-new-cftc-chair\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CFTC to take on more oversight authority<\/span><\/a><span data-v-f87c67ca=\"\"> over these spot markets, whereas currently, the commission can only prosecute cases of fraud or market manipulation.&nbsp;<\/span>"],"hashtag":["GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"]}