{"summary":"Blockchain Security Firm Peckshield Reports Suspicious Activity in Poloniex Exchange Wallet – $60 Million Drained?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-security-firm-peckshield-reports-suspicious-activity-in-poloniex-exchange-wallet-60-million-drained.htm","publishDate":"2023-11-10T12:43:49","id":20932,"type":null,"title":"Blockchain Security Firm Peckshield Reports Suspicious Activity in Poloniex Exchange Wallet – $60 Million Drained?","category":["Blockchain News "],"content":["Blockchain security firm, Peckshield has flagged suspicious activity on a wallet owned by centralized cryptocurrency exchange Poloniex suggesting alleged losses of over $60 million.","The company has not disclosed the actual amount that was stolen but on-chain data outflows to the receiving wallet places the figure around $60 million.","Following the disclosure of the hack, the company’s Customer Support announced on X (Twitter) that the wallet has been disabled in the meantime and new facts will be added to that thread.","Our wallet has been disabled for maintenance. We will update this thread once the wallet has been re-enabled.","— Poloniex Customer Support (@PoloSupport) November 10, 2023","","Acquired by Justin Sun in 2019, its management team has hailed its financial position and security in the wake of recent collapses. Sun, acknowledging the incident, said on X that the company will conduct an investigation and reimburse affected users.","“We are currently investigating the Poloniex hack incident. Poloniex maintains a healthy financial position and will fully reimburse the affected funds. Additionally, we are exploring opportunities for collaboration with other exchanges to facilitate the recovery of these funds.”","The recent incident has sparked renewed concerns on crypto platforms facing hacks in recent weeks with most crypto users calling the event unfortunate asking for a thorough investigation and full disclosure of facts afterward.","While initial reports placed the total assets at $60 million, data from Arkham Intelligence show the actual figure may have hit $122 million which includes the platforms TRON, ETH, USDT as well as memecoins.","The major cause of the hack is not yet disclosed but the malicious actor’s activity has been tracked on-chain with experts giving an overview of recent events. The hacker deployed two wallets sending stolen funds in sequence before swapping them for USDC utilising the Metamask swapping feature. ","Sun also added that the exchange would offer a 5% “white hat bounty” before contacting law enforcement with the hopes of recovering some assets in the shortest possible time.","“We are offering a 5% white hat bounty to the Poloniex hacker. Please return the funds to the following ETH\/TRX\/BTC wallets. We will give you 7 days to consider this offer before we engage law enforcement.”","The last few months have seen several platforms and protocols lose funds from the activities of bad actors leading to calls for stronger security from developers.","In September, $8 million about 500 ETH was drained from HTX, an exchange which Sun invests in, and stated that the losses made up two weeks’ revenues which have been fully recovered. ","$8 million represents a relatively small sum in comparison to the $3 billion worth of assets held by our users. It also amounts to just two weeks' revenue for the HTX platform.","— H.E. Justin Sun 孙宇晨 (@justinsuntron) September 25, 2023","","“As a result, all funds are secure, and trading operations have continued as usual. We promptly addressed and resolved all issues, restoring the platform to its normal state without delay,” he added."],"entity":[{"type":"$122 million","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"Justin Sun","content":"PERSON"},{"type":"$8 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"November 10, 2023","content":"DATE"},{"type":"September 25, 2023","content":"DATE"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"TRX\/BTC","content":"ORGANIZATION"},{"type":"Peckshield","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"H.E. Justin Sun","content":"PERSON"}],"hashtag":["Hack","Justin Sun"],"authors":["David Pokima"]}