{"summary":"Worldcoin Turns Red: WLD Price Falls 18% as Money Shifts to Competing AI Project","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/worldcoin-turns-red-wld-price-falls-18-as-money-shifts-to-competing-ai-project.htm","publishDate":"2024-05-15T17:04:45","id":20946,"type":null,"title":"Worldcoin Turns Red: WLD Price Falls 18% as Money Shifts to Competing AI Project","category":["Industry Talk "],"content":["Worldcoin ($WLD), the blockchain project helmed by OpenAI’s Sam Altman, has fallen nearly 20% in the last two weeks and 6.4% overnight despite other leading cryptocurrencies posting green candles.","The WLD token currently trades for $4.83.","That’s 59% short of its all-time high (ATH) of $11.74, posted on March 10 this year just as the entire market was rallying in line with Bitcoin, which posted its own ATH of $73,737.94 four days later.","Since then, fortune hasn’t favored Worldcoin. The token tumbled down to lows of $4, where it has found consistent support but it has faced strong resistance on the way to the $7 mark.","WLD’s Relative Strength Index (RSI) is 37 which indicates some recent selling has contributed to the downturn.","","In the short-term, there is still some space for further losses, but the bulk of the downward price pressure should be relieved by tomorrow.","Worldcoin was a controversial launch last year due to its premise: anyone wanting some $WLD has to visit a biometric eyeball scanner called the ”Orb” and submit a snapshot of their eyeballs.","They’re found in Berlin, Dubai, London, Mexico City, Miami, New York City, San Francisco, Seoul, and Tokyo.","This data is then used alongside verification of government-issued ID to confirm a user’s personhood before distributing coins to them.","OpenAI says Worldcoin is building blockchain infrastructure to bank the world’s unbanked, enabling everyone “to broadly share the coming technological prosperity ” according to its website. “Privacy first. Owned by everyone.” reads the slogan.","But many are skeptical, including Ethereum creator Vitalik Buterin who wrote a blog post listing his concerns of the protocol’s privacy, accessibility, centralization and security and said it could take years for it to work.","Lawmakers around the world are also monitoring the protocol, with press reports suggesting authorities in Mexico, Malaysia and Argentina have all aired similar concerns recently.","This year the project hit a new high back in January when it welcomed 16,000 Orb signups in a single day after surpassing the 5 million mark the preceding month.","The recent volatility of Worldcoin’s $WLD reflects a token that consumers are still unsure about. Sure, Worldcoin has an intriguing premise, but in a world of constant data breaches, biometric information can seem like to0 high a price to pay to get crypto.","Thankfully, a new generation of meme coins is cropping up which brings bundles of non-invasive utility along with some laughs to boot.","Leading this new generation of coins are projects like the blockchain security guard dog Scotty the AI, which raised $10 million at presale, and crypto’s trading companion WienerAI, an enticing new presale that has already lapped up $2 million in a month.","$WAI is a brand new meme token and AI companion that may yield potentially eye-watering rallies once word gets out about its core offering.","WienerAI is more than a trading bot","It's your AI trading companion!","More details coming SOON! pic.twitter.com\/HG5C0tE6Rk","— WienerAI (@WienerDogAI) May 14, 2024","","Touted as a “Revolutionary AI Trading partner”, WienerAI ($WAI) is a digital companion that gives its owners user-friendly AI-enhanced trading advice, seamless swap functionality and zero fees.","Around 20% of $WAI’s supply is for staking.","WienerAI’s website offers buyers the ability to stake during the presale, in order to take advantage of the lucrative yield, which is currently 525% APY.","Furthermore, WienerAI is transparent. Blockchain security platform Consult audited WienerAI’s smart contract.","Stay on top of WienerAI news over on X and Telegram.","Join the presale now over on the WienerAI website.",""],"entity":[{"type":"$73,737.94","content":"MONEY"},{"type":"New York City","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"$7 mark","content":"MONEY"},{"type":"$WAI","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Malaysia","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$4.83","content":"MONEY"},{"type":"Berlin","content":"LOCATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Argentina","content":"LOCATION"},{"type":"$4","content":"MONEY"},{"type":"Dubai","content":"LOCATION"},{"type":"59%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"May 14, 2024","content":"DATE"},{"type":"Tokyo","content":"LOCATION"},{"type":"6.4%","content":"PERCENT"},{"type":"Mexico City","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"$2 million","content":"MONEY"},{"type":"four days later","content":"DATE"},{"type":"525%","content":"PERCENT"},{"type":"Sam Altman","content":"PERSON"},{"type":"March 10","content":"DATE"},{"type":"$11.74","content":"MONEY"},{"type":"$WLD","content":"MONEY"},{"type":"Seoul","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["wienerai","wld","Worldcoin"],"authors":["Tim Hakki"]}