{"summary":"Binance CEO Changpeng Zhao expects the exchange to record $800 million to $1 billion in profits this year.\nLast year, the exchange turned a profit of about $570 million.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86667\/binance-2020-exchange-profit-ceo-comments","publishDate":"2020-12-04T11:36:36","id":2094,"type":null,"title":"Binance expects to make between $800 million and $1 billion in profits for 2020, says CEO","category":["Exchanges"],"content":["Crypto exchange Binance expects to turn a profit of between $800 million and $1 billion this year, according to CEO Changpeng Zhao.","Zhao&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-12-03\/binance-ceo-changpeng-zhao-crypto-s-influence-miner-bloomberg-50-2020?srnd=economics-vp\" data-v-f87c67ca=\"\">revealed<\/a> the figures to Bloomberg on Friday after appearing on the 2020 Bloomberg 50 list. Binance's expected profits for this year are almost double of what it recorded last year — about $570 million, according to Zhao.","To be sure, the exchange has had a bright year so far for both its spot and futures trading platforms. As of November 30, Binance's total spot trading comes in at roughly $858 billion, with the total for bitcoin futures trading volumes about $991 billion, <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" data-v-f87c67ca=\"\">according to The Block Research<\/a>.","","","","","In terms of open interest, Binance's futures trading platform crossed the $1 billion mark in November. Open interest refers to the value of outstanding futures contracts that have not yet been settled.","Binance began offering futures trading in September 2019 and they have since grown to become one of the top crypto derivatives exchanges.","","","As for its spot trading platform, Binance has experienced growth of almost 2.5 times compared to last year's performance. The exchange saw total spot volumes of around $402 billion in 2019.","Binance also offers options trading, but its data isn't available on tracking platforms. Binance's revenue comes from its five core products — spot trading, futures trading, options trading, lending, and peer-to-peer trading in China, as The Block has previously reported."],"hashtag":["BINANCE"]}