{"summary":"Internet Computer Launches ckUSDC Sepolia, an ICP Copy of USDC in ckERC20 Token Standard","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/internet-computer-launches-ckusdc-sepolia-an-icp-copy-of-usdc-in-ckerc20-token-standard.htm","publishDate":"2024-05-05T20:20:20","id":20942,"type":null,"title":"Internet Computer Launches ckUSDC Sepolia, an ICP Copy of USDC in ckERC20 Token Standard","category":["Altcoin News "],"content":["The testing version of the ckETH minter on Internet Computer (ICP) mainnet has been upgraded, now featuring the Sepolia version of the USDC token.","In a recent forum post, Christian Müller, Senior Software Engineer at DFINITY, revealed that users can obtain Sepolia ETH from various faucets available online and Sepolia USDC to engage with the Sepolia ETH and USDC tokens.","Once acquired, users can deposit both Sepolia ETH and USDC to mint ckETH and ckUSDC, respectively. ","DFINITY Foundation is a not-for-profit organization developing technology for the Internet Computer (ICP) blockchain.","It’s important to note that while ckETH is not required to deposit USDC, it is necessary to withdraw ckUSDC and receive USDC back. ","Additionally, a portion of the ckSepoliaETH will be used by the minter canister to cover transfer transactions on the Sepolia testnet.","The canister IDs of the ckSepoliaETH minter are also available for reference. ","Furthermore, the ckSepoliaETH minter offers a dashboard displaying conversions and corresponding Ethereum transactions for both ckETH and ckERC20 transactions. ","📣 Introducing ckUSDC testnet on Sepolia","Experience the future of DeFi with ckUSDC Sepolia, the digital twin of #USDC Sepolia on #ICP","Next step, ckERC20 👀 https:\/\/t.co\/G7ecRmJbC4","— DFINITY (@dfinity) April 24, 2024","","Developers interested in supporting conversions between ERC20 and the corresponding ck-twin token in their dapps are encouraged to start experimenting with ckUSDC.","Müller emphasizes that the project is still in development, meaning users may encounter bugs and the canister’s state may reset upon upgrades. ","“It is expected that there are still bugs. Please help us make ckETH\/ckUSDC rock solid by reporting those here,” he wrote. ","“In case the instructions don’t work for you, please report back, and we’ll be happy to help and improve the instructions.”","It’s worth noting that, currently, there is no user-friendly front-end available, so users should be comfortable using dfx calls, especially for the final step.","In June last year, the ICP launched an upgrade proposed by the community to expand support for all canister smart contracts, enabling users to hold and transfer ICP tokens.","Meanwhile, DFINITY aims to directly integrate the Bitcoin (BTC) network with the Internet Computer, bringing smart contracts to Bitcoin through an application of Chain Key cryptography, they said."],"entity":[{"type":"April 24, 2024","content":"DATE"},{"type":"ICP","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Sepolia","content":"LOCATION"},{"type":"ckUSDC Sepolia","content":"PERSON"},{"type":"June last year","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"ICP","content":"LOCATION"}],"hashtag":["DeFi","Internet Computer"],"authors":["Ruholamin Haqshanas"]}