{"summary":"Silk Road’s Founder Ross Ulbricht To Launch NFT Auction","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/silk-roads-founder-ross-ulbricht-to-launch-nft-auction.htm","publishDate":"2021-12-01T13:10:00","id":20945,"type":null,"title":"Silk Road’s Founder Ross Ulbricht To Launch NFT Auction","category":["News "],"content":[" ","The infamous Silk Road darknet market founder Ross Ulbricht is set to launch his non-fungible token (NFT) auction as he enters his ninth year of serving life without parole in a US federal prison.","The collection is scheduled to be auctioned between December 2 and December 8 on the SuperRare platform, according to the website of the Free Ross campaign. ","The offer will comprise ten of his original artworks and writings, as well as original animation, that will be compiled into one singular NFT using the Kanon collective’s permissionless on-chain KSPEC protocol. ","My NFT auction will start in 2 days! 😃https:\/\/t.co\/jtOPsEH9ME","In a recently published Medium post, Ulbricht said the move was triggered by his realization that he “might be here in federal prison for a while,” and was pondering on what he could do with the time he had left.","“I was 29 years old when I was arrested. Suddenly, sitting in prison, I had time for drawing again. I reconnected with my artistic side, producing illustrations that told the story I was going through. I was able to connect to those of you in the free world through my art,” he said. “Then one day, I was told ‘you should sell your art as an NFT. The community will love it.’ ‘Umm…What’s an NFT?’ I asked.”","Silk Road’s founder said he wanted to make the sale accessible to the largest possible pool of bidders. Therefore, the NFT auction is set to start at USD 1. “I want everyone to have a chance to participate, and I trust the community to find the right value,” Ulbricht tweeted.","About two years after the US authorities shut down Silk Road in 2013, its founder was sentenced by a Manhattan court to life in prison. Ulbricht was convicted on seven charges: distributing narcotics, distributing drugs online, conspiring to distribute drugs, engaging in a continuing criminal enterprise, conspiring to commit hacking, conspiring to traffic in false identity documents, as well as conspiring to commit money laundering, the US Department of Justice said.","Meanwhile, on Twitter, Ulbricht’s announcement has had its share of supporters and opponents.","I am being mobbed for this tweet, so here is my nuanced opinion: I love Ross and I hope he raises a lot of money for whatever charity he supports, he is NOT a scammer (obviously) the fact that the insane and immoral NFT ponzi has now become fully normalized is deeply troubling.","Maybe he would have used Bitcoin if someone had expressed an interest, but here we are, and he's the face of a marketing campaign for ETH opportunists.","Bitcoiners giving Ross shit about his NFT have lost the plot. The man is serving two unjust life sentences without parole and you’re trolling HFSP and NGMI in his replies while enjoying your freedom. Please call out scams but read the room and give the man a pass.","A report by blockchain tracker Elliptic estimated that Silk Road earned a total commission of around bitcoin (BTC) 614,000. Not taking into account the funds seized by the FBI and sold by the US government, as well as the funds moved from a wallet linked to the darknet market last year, there would still be BTC 370,631 dormant somewhere. In today’s prices, this is more than USD 21bn worth of cryptocurrency.\n____","Learn more:\n– Nearly USD 1B In Bitcoin, Possibly From Silk Road, Moved\n– Australian Police Makes Record Crypto Seizure With Dark Web Drug Bust\n\n– ‘The Best and Cleanest Bitcoin is From the Silk Road’\n– A Bright Side to the Dark Web\n\n– DOJ ‘Overlooked’ USD 500k in Forked Crypto in Bitcoin Bust\n– After Fake Assange Pardon News, Crypto Fans in Clamor Over Ulbricht Pardon Rumor"],"entity":[{"type":"Assange Pardon News","content":"ORGANIZATION"},{"type":"Ross Ulbricht","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Cleanest Bitcoin","content":"PERSON"},{"type":"Ross","content":"PERSON"},{"type":"Ulbricht","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"December 8","content":"DATE"},{"type":"USD 1","content":"ORGANIZATION"},{"type":"US Department of Justice","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"December 2","content":"DATE"},{"type":"NGMI","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Forked Crypto","content":"LOCATION"}],"hashtag":["Legal","NFT","Non-fungible tokens"],"authors":["Jaroslaw Adamowski"]}