{"summary":"US Secret Service Reveals Crypto Holdings, Blockchain Fascination and NFT Collection in Reddit AMA","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-secret-service-reveals-crypto-holdings-blockchain-fascination-nft-collection-reddit-ama.htm","publishDate":"2023-05-17T16:47:00","id":20953,"type":null,"title":"US Secret Service Reveals Crypto Holdings, Blockchain Fascination and NFT Collection in Reddit AMA","category":["Blockchain News "],"content":["The US Secret Service has revealed that they are “definitely holders of crypto,” that they have a collection of non-fungible tokens (NFTs), and claimed that crypto has made it easier than before to track flows of illicit money.","Answering questions from the public during an AMA (ask me anything) session on Reddit on Monday, representatives from Secret Service’s offices in the San Francisco area explained that they have a deep fascination for cryptocurrencies and the possibilities that blockchain technology enables.","Secret Service, which in addition to protection of important political leaders is responsible for investigating certain financial crimes, said that their job today “often involves the world of cryptocurrency.”","Notably, the agents said in the AMA that a “vast majority” of the reports they receive at their office involves crypto in one way or another.","The AMA was announced by the Secret Service in advance, and the initiative reportedly aimed to educate crypto enthusiasts about recent crimes and provide them with valuable insights on how to avoid becoming victims.","The AMA was hosted jointly by the San Francisco Secret Service chapter and REACT, the agency’s San Francisco-based Regional Enforcement Allied Computer Team.","Perhaps surprisingly, the Secret Service agents also said they view the move from cash to crypto among criminals as an “amazing opportunity” for them to better track the movement of illicit funds.","Asked about the difference between illicit crypto and fiat transactions, the agents again indicated that crypto makes their job easier because “transactions are irreversible and immutable.”","Those who want to cover their tracks should opt for cash transactions instead of crypto, the agents said in response to another question.","The agents also referred to themselves as crypto “enthusiasts” in other answers.","They further made it clear that they are happy to share what they know, and said they are eager to learn from the crypto community.","Lastly, the Secret Service agents answering questions said that they are looking to expand their team of crypto experts, and encouraged those with an interest in the field to apply.","“Do you want to put your passion for cryptocurrency or cybersecurity to good use? We’re looking to hire 450 Special Agents this year,” they wrote, while calling on those interested to visit their website for more information."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"AMA","content":"ORGANIZATION"},{"type":"San Francisco Secret Service","content":"ORGANIZATION"},{"type":"Secret Service","content":"ORGANIZATION"},{"type":"US Secret Service","content":"ORGANIZATION"},{"type":"Regional Enforcement Allied Computer Team","content":"ORGANIZATION"}],"hashtag":["Blockchain","Crime"],"authors":["Fredrik Vold"]}