{"summary":"Valkyrie Expands Bitcoin Offerings with the Launch of 2x Leveraged Bitcoin Futures ETF","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/valkyrie-expands-bitcoin-offerings-with-the-launch-of-2x-leveraged-bitcoin-futures-etf.htm","publishDate":"2024-02-22T17:57:50","id":20964,"type":null,"title":"Valkyrie Expands Bitcoin Offerings with the Launch of 2x Leveraged Bitcoin Futures ETF","category":["Bitcoin News "],"content":["On February 22, the digital asset investment management firm Valkyrie unveiled its newest product: the Valkyrie Bitcoin Futures Leveraged Strategy ETF (NASDAQ: BTFX). This ETF expands Valkyrie’s cryptocurrency offerings and provides a way for investors to potentially magnify their returns tied to Bitcoin’s market fluctuations.","The newly launched ETF is designed to offer double the daily performance of the S&P CME Bitcoin Futures Index (USD) Excess Return (SPBTCFUE) through the use of Bitcoin futures contracts. The new Bitcoin Futures ETF joins the company’s existing spot Bitcoin exchange-traded product, the Valkyrie Bitcoin Fund (BRRR).","","The leveraged Bitcoin Futures ETF seeks to provide investors with a higher level of exposure to Bitcoin market fluctuations compared to traditional funds.","“The launch of BTFX represents our commitment to bringing investors innovative options for accessing Bitcoin and the digital asset ecosystem as a whole,” Valkyrie CEO Leah Wald said. “With Bitcoin so much in the focus right now, traders and investors are looking at how they can use financial instruments to tap into this space, and as a leader in digital-asset-focused ETFs, we wanted to be sure we provide them with a great fund.”","Valkyrie is launching a 2x Bitcoin Futures ETF today $BTFX which will compete with $BITX which has $350m already. That said, there's like 15 leveraged spot btc ETFs in registration, one or two of which will prob take off and make it tougher for the futures ones pic.twitter.com\/wIoMXatS4F","— Eric Balchunas (@EricBalchunas) February 22, 2024","","The Valkyrie Bitcoin Futures Leveraged Strategy ETF invests in Bitcoin futures contracts to deliver two times the daily return of its benchmark, the S&P CME Bitcoin Futures Index. This index tracks the price action of Bitcoin futures on the CME exchange.","","Because they are leveraged, these ETFs offer the allure of amplified gains, but investors need to understand the elevated risks they carry. The historically volatile nature of Bitcoin, combined with the leverage used in these ETFs, means substantial swings are possible, both upward and downward. This means investors can potentially experience major losses in a short timeframe.","Additionally, daily rebalancing and the effects of compounding mean that the long-term performance of these ETFs might deviate from simply doubling the returns of the underlying Bitcoin index. Investors should also be aware that factors like market liquidity and disruptions could hinder the performance of such products.","","Leveraged Bitcoin Futures ETFs are intricate financial instruments. Before considering them, investors should thoroughly assess their risk tolerance, carefully read the fund’s prospectus, and gain a clear understanding of the specific strategies, fees, and risks associated with these products."],"entity":[{"type":"February 22","content":"DATE"},{"type":"BTFX","content":"ORGANIZATION"},{"type":"February 22, 2024","content":"DATE"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"Leah Wald","content":"PERSON"},{"type":"$BITX","content":"MONEY"},{"type":"ETF","content":"ORGANIZATION"},{"type":"$350m","content":"MONEY"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$BTFX","content":"MONEY"},{"type":"Valkyrie Bitcoin Futures Leveraged Strategy ETF","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin ETF","Leverage","Valkyrie"],"authors":["Trent Alan"]}