{"summary":"Grayscale’s Quarterly Revenue Stays Flat After Massive Bitcoin Outflows","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/grayscales-quarterly-revenue-stays-flat-after-massive-bitcoin-outflows.htm","publishDate":"2024-05-09T22:43:04","id":20968,"type":null,"title":"Grayscale’s Quarterly Revenue Stays Flat After Massive Bitcoin Outflows","category":["Bitcoin News "],"content":["Grayscale, the company behind the world’s largest Bitcoin (BTC) ETF, saw flat revenues in Q1 despite non-stop outflows from its world-famous fund throughout the quarter.","Per a shareholder letter from Grayscale’s parent company, Digital Currency Group (DCG), the Grayscale Bitcoin Trust (GBTC) netted $156 million between January and March – nearly identical to its Q4 2023 figure.","","As usual, this comprised most of DCG’s total revenue of $229 million, up 11% from the prior quarter. The conglomerate’s gains were primarily driven by its mining pool giant Foundry and investment platform Luno, up 35% and 46%, respectively.","“While Grayscale expected outflows alongside increased competition under the ETF wrapper, Q1 revenue attributable to GBTC nevertheless exceeded our expectations,” read the shareholder letter.","Upon converting into a Bitcoin spot ETF on January 11, GBTC lowered its long-standing management fee from 2% to 1.5%, following through on a promise to cut charges for critical investors who often labeled the fund as “exploitative.”","Most of Grayscale’s competitors who launched alongside them that day sported ultra-low fees of 0.3% or lower, including funds launched by recognizable names like BlackRock and Fidelity.","As such, new and prospective Bitcoin ETF buyers had no incentive to invest through Grayscale, leaving little to no demand\/inflows to counterbalance regular outflows from the fund.","Such outflows have been seismic. The fund now only controls 291,790 BTC, less than the 619,000 BTC it held as of January 10.","As explained by market analysts at Glassnode, Grayscale’s investor base mostly represents long-term holders who have chosen to sell their Bitcoin at a profit as the asset’s price climbed.","Last week, the fund experienced its first net inflow day since January 11.","For the first time every spot #Bitcoin ETF had INFLOWS last Friday.","Even Grayscale had +$63m!","🫡 @EricBalchunas pic.twitter.com\/HuDfeeeKgl","— Bitcoin Archive (@BTC_Archive) May 6, 2024","","","That said, thanks to the value of its existing BTC rising over the past quarter, the company’s assets under management (AUM) have suffered less, falling from $30 billion to $18 billion.","BlackRock’s iShares Bitcoin Trust (IBIT) has nearly caught up to GBTC in size, controlling 273.25k BTC as of May 8, according to on-chain data.","DCG’s revenue rose 51% yearly compared to Q1 2023. Meanwhile, Bitcoin’s price has risen 125% since last year.","Regulators are reviewing Grayscale’s application to launch an Ether (ETH) spot ETF, though analysts don’t like its approval odds. The company recently rescinded its application to launch an Ether futures ETF."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"$18 billion","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"past quarter","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"January 10","content":"DATE"},{"type":"January 11","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"May 6, 2024","content":"DATE"},{"type":"$156 million","content":"MONEY"},{"type":"$229 million","content":"MONEY"},{"type":"HuDfeeeKgl","content":"ORGANIZATION"},{"type":"$63m!","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"125%","content":"PERCENT"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Glassnode","content":"LOCATION"},{"type":"46%","content":"PERCENT"},{"type":"May 8","content":"DATE"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Bitcoin","Grayscale"],"authors":["Andrew Throuvalas"]}