{"summary":"BlackRock’s IBIT ETF Soars: Surpasses $2 Billion Market Cap in Crypto Milestone","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blackrocks-ibit-etf-soars-surpasses-2-billion-market-cap-in-crypto-milestone.htm","publishDate":"2024-01-27T16:00:36","id":20972,"type":null,"title":"BlackRock’s IBIT ETF Soars: Surpasses $2 Billion Market Cap in Crypto Milestone","category":["Altcoin News "],"content":["BlackRock’s Bitcoin (BTC) exchange-traded fund (ETF) has achieved a significant milestone by surpassing $2 billion in assets under management (AUM) just two weeks after its launch on the Nasdaq.","The ETF, known as the iShares Bitcoin Trust (IBIT), has seen its market capitalization reach $2.11 billion due to Bitcoin’s recent price performance.","Bitcoin’s price broke through the $42,000 mark for the first time in nearly seven days, following a sell-off that occurred after the launch of ETFs on January 11.","The strong intraday performance of the cryptocurrency has contributed to the rapid growth of BlackRock’s IBIT, solidifying its position as a leader in attracting investors’ capital.","Yes, the #Bitcoin price has pushed $IBIT's assets beyond $2 billion. This plus likely new flows today should mean it will be above $2 billion at close https:\/\/t.co\/IgOmEYB3qw pic.twitter.com\/qFDZsvylo9","— James Seyffart (@JSeyff) January 26, 2024","","Fidelity’s Wise Origin Bitcoin Fund (FBTC) is currently trailing behind with $1.8 billion in inflows over the past 10 days.","BlackRock, as the world’s largest asset manager, is leveraging its market reputation to appeal to a broader audience with its crypto-based product.","While other asset managers like VanEck targeted early adopters and the crypto community through television ads promoting their Bitcoin ETFs, BlackRock took a different approach.","The company released a two-minute video featuring one of its executives explaining Bitcoin’s value proposition and how investors can gain exposure to its ETF, specifically targeting baby boomers.","The annual fees charged by ETF issuers also play a role in attracting capital.","BlackRock set its fee for the iShares ETF at 0.12% for the first 12 months or until the first $5 billion in assets under management, after which it plans to increase it to 0.25%.","Other issuers, such as ARK Invest, charge 0.21%, VanEck lists a fee of 0.25%, and Bitwise charges 0.20%.","These fees are deducted from the ETF’s performance rather than billed directly to investors, reducing investors’ overall returns.","Likewise, Aurelie Barthere, Principal Research Analyst at Nansen, said in a recent interview with Cryptonews.com that she expects lower-fee ETFs to attract more inflows in the short term.","The competitive landscape among Bitcoin spot ETF providers, according to Barthere, will be shaped by factors like reputation, size, existing footprint, and management fees.","“Reputation\/size\/existing footprint + management fee will probably lead to some leaders dominating the market,” she predicted.","JPMorgan analysts have also predicted that the success of these newly created ETFs will hinge on fees and liquidity.","Given the high 1.5% fees associated with GBTC, they expect significant outflows from this Bitcoin trust.","Meanwhile, Bloomberg analyst James Seyffart expects Bitcoin ETFs to attract $10 billion in capital over the first year.","The rapid growth of BlackRock’s IBIT demonstrates the increasing demand for cryptocurrency investment products and suggests that the broader adoption of Bitcoin by traditional financial institutions is well underway.","As more investors seek exposure to the crypto market, ETFs provide a convenient and regulated avenue for them to participate in the potential upside of cryptocurrencies like Bitcoin."],"entity":[{"type":"0.20%","content":"PERCENT"},{"type":"0.12%","content":"PERCENT"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$IBIT","content":"MONEY"},{"type":"January 11","content":"DATE"},{"type":"BlackRock’s Bitcoin (BTC","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$42,000","content":"MONEY"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"Principal Research Analyst","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"January 26, 2024","content":"DATE"},{"type":"0.21%","content":"PERCENT"},{"type":"James Seyffart","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"$10 billion","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Aurelie Barthere","content":"PERSON"},{"type":"$2.11 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Spot ETFs"],"authors":["Ruholamin Haqshanas"]}