{"summary":"BitPanda to Cease Operations in Netherlands Following New EU Regulations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitpanda-to-cease-operations-in-netherlands-following-new-eu-regulations.htm","publishDate":"2024-01-30T20:01:55","id":20986,"type":null,"title":"BitPanda to Cease Operations in Netherlands Following New EU Regulations","category":["Blockchain News "],"content":["Dutch users of the crypto exchange Bitpanda will no longer be able to utilize the platform, a January 26 company email has revealed.","“Bitpanda is committed to its mission to cooperate and comply with the latest regulatory landscape as dictated by local regulators, which is why we have decided to offboard Dutch residents from our broker platform,” an email from the exchange read in part.","According to the aforementioned email, Dutch users will have through January 31st to trade on the platform, with February 26th marking the last day users can withdraw or transfer assets from the platform. Despite the recently released email, no further explanation was given by Bitpanda for their sudden user offboarding.","Bitpanda’s Netherlands closing will happen only six months after the European Union’s (EU) Markets in Crypto Asset Regulation (MiCA) came into effect in June 2023, prompting a wave of regulatory change across the international political union. That same month, crypto exchange Binance shut down its Dutch operations following its failure to obtain a virtual asset service provider (VASP) from local regulators.","We regret to announce that Binance is leaving the Dutch market as we have been unable to register as a VASP with the Dutch regulator.","We continue to be committed to working collaboratively with regulators around the world and are additionally focused on getting our business…","— Binance (@binance) June 16, 2023","","“We continue to be committed to working collaboratively with regulators around the world and are additionally focused on getting our business ready to be fully MiCA compliant,” Binance posted to its account on X at the time.","Similarly, New York-based crypto exchange Gemini halted all its operations in the Netherlands in late 2023, citing regulatory compliance issues.","“Gemini continues to be committed to working collaboratively with regulators around the world,” an email from the company read.","At the time, Gemini assisted Dutch users in transferring their funds to fellow crypto exchange Bitvavo. Currently, it is unclear whether Bitpanda has provided any recommendations on how users in the Netherlands should handle their digital assets going forward.","Following the news, one Reddit user suggested the Amsterdam-based exchange as an alternative to Bitpanda.","“Bitvavo from the Netherlands is a strong competitor and much cheaper than Bitpanda broker,” the Redditor said.","Another posted that they “would like to know” a more detailed reason for Bitpanda’s Dutch closing and a comparably “good” and “safe” alternative app for those based in the Netherlands. Many Dutch investors are seeking an answer to the question of whether, and when, Bitpanda, Gemini, and Binance will be able to return to the Dutch market."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Netherlands","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"Redditor","content":"PERSON"},{"type":"the Netherlands","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"January 26","content":"DATE"},{"type":"February","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"June 16, 2023","content":"DATE"},{"type":"Bitpanda","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Bitpanda","Crypto Regulation","EU regulations"],"authors":["Julia Smith"]}