{"summary":"Fintech firm Plaid — a company most known for providing open banking APIs — has launched Wallet Onboard, its first web3 product. \nFor developers, Wallet Onboard aims to offer easy access integration to over 300 Ethereum wallets, rather than integrating separately with each wallet. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178561\/fintech-firm-plaid-launches-its-first-web3-product","publishDate":"2022-10-20T07:00:13","id":2098,"type":null,"title":"Fintech firm Plaid launches its first web3 product","category":["Fintech"],"content":["Plaid — a company most known for providing open banking APIs — has launched Wallet Onboard its first web3 product and the&nbsp;first of a series of forthcoming products aimed at developers in the crypto space, according to a release Thursday.&nbsp;","\"This is the start of Plaid's journey of bridging web two and web three worlds,\" said product manager Clay Allsopp in an interview with The Block.&nbsp;","Plaid's new product aims to offer developers the ability to easily access over 300 Ethereum wallets.&nbsp;\"As a developer either you could go and write an integration to all these different wallets and deal with the differences between them and how their user experience should be,\" said Allsopp, \"Or you could can in drop Plaid and we handle all those differences on their behalf.\"","On the consumer side, this means that users can access a drop-down list of available and recently used wallets when using web3 apps. It draws inspiration from its Plaid Link product, which allows users to connect their financial accounts across different fintech applications. In an effort to preserve privacy, Allsopp says that the product doesn't collect wallet addresses.&nbsp;","It's being used by developers at web3 wallet and DeFi company Zerion. The company integrated the wallet onboard product to ease the user experience of tracking holdings across many different wallets. Other companies in the NFT, lending and web3 data space are also using or showing interest in the product, claimed Allsopp.&nbsp;\"We're seeing a large trend of diversity in the different products that people want to use this for just because every crypto app needs to connect a wallet,\" he said.","Plaid is also eying further products in the web3 space while looking to replicate the products it already has, such as identity verification, on crypto rails.&nbsp;","\"So how do we do privacy-preserving identity verification for developer and user while not revealing actual personally identifiable information,\" Allsopp asked. \"So maybe fragments of information such as this address lives in a certain area or this address is over a certain age.\"","Currently, the Wallet Onboard product is only integrated with Ethereum and EVM-compatible chains, but the company is exploring integration with Solana and other blockchains.&nbsp;"],"hashtag":["FINTECH","WALLETS"]}