{"summary":"Roadblock to Riches: Bitcoin Price Stagnates at $60K Mark","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/roadblock-to-riches-bitcoin-price-stagnates-at-60k-mark.htm","publishDate":"2024-05-03T13:37:19","id":20981,"type":null,"title":"Roadblock to Riches: Bitcoin Price Stagnates at $60K Mark","category":["Bitcoin News "],"content":["Bitcoin investors are facing a tough challenge as they try to recover from a two-month price low for BTC.","The recent Bitcoin price rebound has been limited, however, due to strong resistance.","Despite a 6.2% recovery from this week’s low, BTC has not been able to surpass crucial trendlines.","Through April and May, Bitcoin experienced a 23% drop from its recent all-time high, reducing the odds of recovery.","BitMEX Co-Founder Arthur Hayes predicted that in August Bitcoin will be trading below $70,000.","","First, $60,000 must be surpassed convincingly, but so far, the resistance areas are winning over the bulls.","Bitcoin’s 100-day moving average (MA), currently at $59,930 as of May 3, has acted as market support since October 2023 and provided a floor through the first half of 2023’s Bitcoin bull market.","As of writing, the candlesticks have gone under the MA, indicating a possible downtrend.","The Trading Indicator mutually agreed that bulls were running into strong challenges at the 100-day MA.","“Reclaiming the 100-Day Moving Average would be a big deal for Bitcoin Bulls that could lead to a short squeeze,” Keith Alan wrote in a post on X.","On the path to recovery, the BTC price must overcome another obstacle: the short-term holder realized price (STH-RP).","STH-RP is a traditional support line for bull markets, and it refers to the aggregate cost basis of Bitcoin holders who are more speculative in nature.","Specifically, it includes wallets that store BTC for 155 days or less.","","On May 1, STH-RP was at $59,684, the latest date on which figures are available on the on-chain data resource.","The metrics have created a new trendline in close proximity to $60,000.","Cubic Analyst CEO Caleb Franzen included STH-RP in his own selection of resistance levels to clear.","“My personal line in the sand for ‘risk-on’ is a daily close above $61k,” he wrote. “Lots of work to do.”"],"entity":[{"type":"Bitcoin Bulls","content":"ORGANIZATION"},{"type":"$60,000","content":"MONEY"},{"type":"May 1","content":"DATE"},{"type":"May 3","content":"DATE"},{"type":"$59,684","content":"MONEY"},{"type":"6.2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"Keith Alan","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"Caleb Franzen","content":"PERSON"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"October 2023","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"MA","content":"ORGANIZATION"},{"type":"$61k","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"first half of 2023","content":"DATE"},{"type":"August","content":"DATE"},{"type":"$59,930","content":"MONEY"}],"hashtag":["Bitcoin Price","bull market","bull run"],"authors":["Thomas Musgrave"]}