{"summary":"Ethereum Dencun Upgrade: Everything You Need to Know Before the Launch","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-dencun-upgrade-everything-you-need-to-know-before-the-dencun-launch-today.htm","publishDate":"2024-03-13T12:17:08","id":20982,"type":null,"title":"Ethereum Dencun Upgrade: Everything You Need to Know Before the Launch","category":["Ethereum News "],"content":["Ethereum (ETH) users are gearing up for the highly anticipated Dencun upgrade, which is set to introduce the most significant code change to the blockchain in over a year and potentially have an impact on Ethereum fees. ","Dencun, scheduled to commence in less than two hours, is a combination of the project names Deneb and Cancun and includes two simultaneous upgrades on Ethereum’s consensus and execution layers.","The “hard fork” aims to introduce a new era of reduced fees for Ethereum Layer 2 (L2) rollups. ","These changes will be accompanied by the activation of a new Ethereum Improvement Proposal (EIP) called “proto-danksharding” or EIP-4844, which aims to enhance the chain’s capacity to handle data from L2 networks.","While elements of the Dencun upgrade have been in the works for several years, developers postponed its implementation from the original target of late 2023 due to engineering concerns. ","Subsequently, the package underwent testing on three separate test networks (testnets), with the majority of these tests running smoothly. ","Dencun is Ethereum’s most substantial update since the Shapella upgrade in April 2023, which enabled the withdrawal of staked ether (ETH). ","The upgrade encompasses several code changes, with the most significant being “proto-danksharding,” introducing a new method called “blobs” for storing transaction data on Ethereum.","Layer-2 networks such as Arbitrum, Optimism, and Polygon will benefit the most from Dencun. ","These networks help scale Ethereum by aggregating user transactions and then submitting them to Ethereum for settlement in large batches. ","Over the past year, they have become the primary platforms for transacting on Ethereum, accumulating billions of dollars in deposits and consistently demonstrating higher transaction volumes than the main Ethereum chain.","Following Dencun, L2 networks will be able to post data to Ethereum within the dedicated blobspace, eliminating the need to squeeze data into conventional transactions at a higher cost. ","This is expected to enable L2 networks to settle more data more efficiently, subsequently reducing fees for end-users.","EIP-4844, or proto-danksharding, also benefits a new group of blockchains within the Ethereum ecosystem known as data availability (DA) layers. ","DA layers such as Celestia, EigenDA, and Avail facilitate the storage of large amounts of data, which L2 networks often utilize for storing transaction data. ","Proto-danksharding has the potential to lower the costs associated with downloading DA data.","Following the Dencun upgrade, Ethereum developers will shift their focus to the next upgrade, currently named Electra + Prague (Petra). ","The specific components of this upgrade have not been determined yet, but one strong contender is an upgrade called “Verkle Trees,” which aims to enhance node storage capabilities for large amounts of data.","According to data from L2fees, the average cost of sending ETH on Arbitrum is $0.24, with token swaps costing $0.67. ","On Optimism, the fees are $0.47 and $0.92, respectively, while Polygon charges $0.78 for transactions and $2.85 for token swaps. ","These figures are anticipated to decrease following the Dencun upgrade.","According to Superchain Savings Estimator, once EIP-4844 arrives, token swaps on Optimism would cost around $0.03, a more than 96% drop. ","The savings estimator also predicts that gas fees on a token swap on Base L2 will reduce from a previous cost of about $0.58 to $0.01 after EIP-4844.","The Starknet Foundation, which supports the Starknet chain, has announced that its users would experience the highest savings among all layer-2 networks. ","In a recent announcement, they said that a larger proportion of Starknet fees are allocated to data availability (DA) layers compared to other layer-2 networks. ","The foundation also stated that additional innovations would lead to further savings, and they plan to charge fees at future rates to bridge the gap until these improvements are implemented.","As the Dencun upgrade approaches, analysts are optimistic about Ethereum price action and potential.","Technical and on-chain analyst Ali, who boasts more than 52k followers on X, believes ETH’s path to $5,000 “looks increasingly clear as resistance thins.” ","“A supply zone at $4,522-$4,646, where 600,000 addresses hold 1.63 million ETH. It’s not a matter of if, but when,” he wrote on X. ","#Ethereum path to $5,000 looks increasingly clear, as resistance thins. The key hurdle? A supply zone at $4,522-$4,646, where 600,000 addresses hold 1.63 million $ETH. It's not a matter of if, but when! pic.twitter.com\/LMvw3kjrEW","— Ali (@ali_charts) March 11, 2024","","At the time of writing, the Ethereum price stands at over $4,000, largely flat over the past day. ","However, the second-largest cryptocurrency by market cap has gained more than 51% over the past month and 156% over the past year. "],"entity":[{"type":"April 2023","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"March 11, 2024","content":"DATE"},{"type":"1.63 million $ETH","content":"MONEY"},{"type":"$2.85","content":"MONEY"},{"type":"96%","content":"PERCENT"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"156%","content":"PERCENT"},{"type":"$0.78","content":"MONEY"},{"type":"Electra + Prague (Petra)","content":"ORGANIZATION"},{"type":"$0.58","content":"MONEY"},{"type":"Dencun","content":"LOCATION"},{"type":"Verkle Trees","content":"ORGANIZATION"},{"type":"Superchain Savings Estimator","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"Cancun","content":"LOCATION"},{"type":"$5,000","content":"MONEY"},{"type":"$0.92","content":"MONEY"},{"type":"Proto","content":"PERSON"},{"type":"51%","content":"PERCENT"},{"type":"$0.67","content":"MONEY"},{"type":"$0.01","content":"MONEY"},{"type":"Celestia","content":"LOCATION"},{"type":"$0.24","content":"MONEY"},{"type":"$0.47","content":"MONEY"},{"type":"$0.03","content":"MONEY"},{"type":"$4,000","content":"MONEY"},{"type":"$4,522","content":"MONEY"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"$4,646","content":"MONEY"}],"hashtag":["Dencun","Ethereum"],"authors":["Ruholamin Haqshanas"]}