{"summary":"Senator Cynthia Lummis Slams DOJ For “Hyper-Aggressive” Crypto Stance On Self-Custody Wallets","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/cynthia-lummis-slams-doj-after-tornado-cash-saourai-wallet-charges.htm","publishDate":"2024-05-02T15:10:52","id":20991,"type":null,"title":"Senator Cynthia Lummis Slams DOJ For “Hyper-Aggressive” Crypto Stance On Self-Custody Wallets","category":["Blockchain News "],"content":["Senator Cynthia Lummis (R-WY) criticized the U.S. Department of Justice (DOJ) on Wednesday for its controversial stance on self-custody wallets after unlicensed money-transmitting charges were brought against crypto mixers Tornado Cash and Samourai Wallet.","“I am deeply troubled by the Department of Justice’s hyper-aggressive argument that non-custodial software can constitute a money transmission service,” Lummis Tweeted. “This stance contradicts existing Treasury guidance, common sense and violates the rule of law.”","","I am deeply concerned by the Biden administration criminalizing core tenants of the Bitcoin network and decentralized finance.","My full statement. ⬇️ pic.twitter.com\/M3CHcNTi3x","— Senator Cynthia Lummis (@SenLummis) May 1, 2024","","The senator’s statement follows the DOJ’s arrest of Samourai Wallet founders Keonne Rodriguez and William Lonergan Hill on money laundering charges and operating an unlicensed money-transmitting business.","Just last week, the DOJ countered Tornado Cash developer Roman Storm’s attempt to dismiss several charges brought against him, including violating sanctions laws, through the development and operation of the crypto mixer.","The swift legal action against both companies has raised concerns for crypto community members as it could affect the legality of owning and holding digital asset wallets in general.","“Arguments against self-custody software threaten the fundamental property rights that are core to being an American,” the senator continued. “I will do everything I can to fight for your rights to hold your own keys and run your own node.”","The DOJ’s legal actions against Tornado Cash and Samourai Wallet signal the U.S. government’s willingness to treat crypto mixers as unlicensed money transmitters, potentially opening the floodgates for a wave of regulatory actions across the sector.","Their main argument is whether crypto mixing, a process used to obfuscate funds to make them harder to trace, safeguards privacy or shelters illicit activity. ","Infamous hacking collectives, such as the North Korean state-sponsored Lazarus Group, have used crypto mixers, including Tornado Cash, to launder funds.","U.S. prosecutors allege the crypto mixer “facilitated more than $1 billion in money laundering transactions and laundered hundreds of millions of dollars for the Lazarus Group.","Meanwhile, Samourai Wallet is accused of executing “over $2 billion in unlawful transactions and facilitating more than $100 million in money laundering transactions from illegal dark web markets.”","While the case against Samourai Wallet is only just beginning, Storm is pushing back against the U.S. government’s case against him, citing users’ right to privacy.","“Mr. Storm is a developer, and his only agreement, together with the members of his U.S-based company, was to build software solutions to provide financial privacy to legitimate cryptocurrency users,” lawyers for Storm argued. “This is not a crime.”","Only time will tell if Lummis and other U.S. lawmakers take congressional action against what many in the crypto community feel is executive overreach or if self-custody wallet users will face repercussions for what the U.S. government may see as unlicensed money-transmitting."],"entity":[{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May 1, 2024","content":"DATE"},{"type":"Keonne Rodriguez","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Samourai Wallet","content":"ORGANIZATION"},{"type":"Lummis","content":"LOCATION"},{"type":"U.S. Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Storm","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"William Lonergan Hill","content":"PERSON"},{"type":"U.S","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"laundered hundreds of millions of dollars","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Cynthia Lummis","Samourai Wallet","tornado cash"],"authors":["Julia Smith"]}