{"summary":"eBay to Launch ‘Digital Wallet’, Teases ‘Fractionalization’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ebay-launch-digital-wallet-teases-fractionalization.htm","publishDate":"2022-03-11T08:53:00","id":20999,"type":null,"title":"eBay to Launch ‘Digital Wallet’, Teases ‘Fractionalization’","category":["News "],"content":[" ","The e-commerce heavyweight eBay has claimed that it is exploring the option of adding “new forms of payment” and will launch a digital wallet in the second quarter of the financial year – but has stopped short of announcing any crypto pay-related developments. Meanwhile, the company also made note of coming “fractionalization”, which may suggest non-fungible tokens (NFTs), but it makes no mention of them. ","At an Investor Day event, the firm’s Chief Executive Jamie Iannone said that the firm will promote new businesses avenues, including a digital platform named the eBay Vault.","Details of its digital wallet appear to be relatively scant thus far. But there are clues that suggest NFTs could well play a part.","Last year, eBay began allowing users to trade NFTs on its platform. The firm built its trading empire on providing a marketplace for physical collectibles. As such, a “digital wallet” could well be little more than a secure, software-based digital home for credit and debit card information.","But it could also be a wallet capable of storing – and displaying – customer NFTs. A further hint came in a promotional YouTube video entitled “Announcing the eBay Vault.”","Although the video contained no direct mention of crypto or NFTs, in one slide, the firm noted that “in the future,” “fractionalization” would be added.","In the NFT world, fractionalization can refer to the digital ownership of a token, whereby the digital rights of a single NFT are broken up into small pieces – fractions. This makes it possible for more than one person to “own” an individual NFT. If, for instance, Tommy owns half of Rare NFT #1, it is also possible for Judy and Paul to own a quarter each of the same NFT.","A digital wallet could also refer to a software innovation that allows customers to store their private keys on a platform and pay in crypto on a digital marketplace – such as eBay. But, again, there is nothing in the eBay materials to suggest that this is the case.","Speculation had been intense leading up to the event, with many expecting a major reveal on the crypto pay front. But it appears that the platform is not quite yet ready to take the plunge.","Instead, Iannone stated:","“Over the past two years, we have fundamentally changed the trajectory of our marketplace. We see incredibly compelling growth potential in this market and believe it is our opportunity to win by sharpening our focus and continuing to create value through a tech-led re-imagination of eBay.”","____","Learn more:\n– eBay’s Crypto Teaser\n– eBay Still Looking at Crypto Payments, Mulls NFTs\n\n– Goldman Sachs Leaves Russia, Reportedly Set to Increase Crypto Focus\n– Here is JPMorgan’s ‘Metaverse Strategy’ Advice for Businesses\n\n– Gustav Klimt’s ‘The Kiss’ Masterpiece is Selling as 10,000 NFTs\n– Crypto Wallet Trends in 2022: More Privacy, Security, Features, and Choice"],"entity":[{"type":"second quarter of the financial year","content":"DATE"},{"type":"Crypto Payments","content":"ORGANIZATION"},{"type":"Tommy","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"eBay Vault","content":"ORGANIZATION"},{"type":"Iannone","content":"PERSON"},{"type":"Jamie Iannone","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Judy","content":"PERSON"},{"type":"Paul","content":"PERSON"},{"type":"Mulls NFTs\n\n– Goldman Sachs Leaves Russia","content":"ORGANIZATION"},{"type":"Gustav Klimt","content":"PERSON"},{"type":"Crypto Wallet Trends","content":"ORGANIZATION"}],"hashtag":["Adoption","Cryptocurrency","NFT","Non-fungible tokens","Wallet"],"authors":["Tim Alper"]}