{"summary":"EXCLUSIVE: PropyKeys Launches Dapp on Base, RWA, AI and NFT Features for Minting Addresses and Deeds On-chain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/propykeys-launches-base-dapp-rwa-ai-nft-features-for-minting-addresses-and-deeds-onchain.htm","publishDate":"2024-03-13T13:05:47","id":20992,"type":null,"title":"EXCLUSIVE: PropyKeys Launches Dapp on Base, RWA, AI and NFT Features for Minting Addresses and Deeds On-chain","category":["Blockchain News "],"content":["Gamified platform PropyKeys has announced the public launch of its Base-based decentralized application (Dapp) that enables users to mint addresses and deeds on-chain, accompanied by a series of novel features.","This is a project within the Propy ecosystem that’s working on blockchain-powered real estate solutions.","PropyKeys aims to address the challenges within the $280 trillion real estate sector, dismantle traditional barriers to entry (such as high title fees and operational inefficiencies), make homeownership more accessible and user-friendly, and combat deed theft.","The platform has been deployed on Coinbases’s Layer-2 (L2) network Base to allow users to mint a digital address – including global landmarks – corresponding to a tangible property.","Furthermore, PropyKeys is powered by the PRO token.","The launch follows two months of invite-only beta testing, said the press release shared with Cryptonews.","The team stated that PropyKeys “saw widespread adoption,” with nearly 1,800 addresses minted, including 300 global landmarks.","Andrew Zapo, Co-Founder and COO of PropyKeys, said in the press release that the team saw “astounding” enthusiasm and positive user adoption during the closed beta.","This, he said, highlights the demand for innovative real estate solutions on-chain and signals a bright future for blockchain in real estate.","In order to democratize real estate ownership, PropyKeys is creating a home address platform and property deed storage on the blockchain.","Zapo told Cryptonews that these are core features of the platform.","“PropyKeys allows users to mint digital versions of home addresses and store property deeds on the blockchain,” he said. “This setup ensures transactions are efficient, cost-effective, and secure, utilizing blockchain’s security features to make property ownership and transactions transparent and immutable.”","The final countdown begins! 🔥 #PropyKeys is about to redefine real estate. Join us on this epic journey, and let's make history together. The future of onchain ownership is just around the corner. pic.twitter.com\/g12nDQlRRp","— PropyKeys (@PropyKeys) March 11, 2024","","Moreover, per the description on the blockchain data analytics platform Dune, PropyKeys is akin to domain names like X.com or Vitalik.eth.","“Just as someone minted these domain names years ago and later sold them to the brand owner, onchain real estate addresses operate on a similar principle, allowing early adopters to profit from their foresight.”","The press release confirmed that what PropyKeys does is bridging the physical with the digital landscape – allowing users to create digital representations of real-world property addresses – similar to possessing a domain name for a segment of the internet.","Notably, the team said that “after an address is acquired, the buyer can later transfer ownership to the owner of the corresponding property in exchange for additional staking power.”","COO Zapo told Cryptonews that minting addresses and deeds provides value to investors, property owners, and stakeholders by securing deeds onchain and making real estate liquid in a crypto-native way.","“This capability makes real estate ownership more accessible to a broader audience, allowing anyone to own a digital representation of real-world properties and get rewarded for it,” he said.","Moreover, it combats deed fraud by securely recording property deeds on the blockchain, ensuring authenticity and ownership verification, which is critical for safeguarding property rights.","Per Zapo, here’s how it’s beneficial across different tiers:","“This approach not only makes real estate transactions more secure and accessible but also provides a clear, immutable record of property ownership on the blockchain,” Zapo argued. “It offers a robust solution for digital proof of ownership, addressing critical issues like deed fraud and security risks.”","Therefore, PropyKeys is setting a new standard for property deed security by moving from paper-based to digital, algorithm-secured systems, said the announcement.","PropyKeys revealed features meant to provide “an engaging and accessible introduction” to real-world asset (RWA) tokenization.","It has launched a staking mechanism, providing new incentives.","The mechanism rewards users with PRO tokens for their contribution in minting and safeguarding onchain addresses and onchain title deeds.","Furthermore, the platform has enabled users to mint a personalized, detailed artificial intelligence (AI)-generated global landmark non-fungible token (NFT), e.g. the White House or Big Ben.","“These AI-generated landmarks offer minters a wide array of iconic structures, enhanced by the ability to customize their NFTs such as favorite cryptocurrency logos and styling.”","The customization option allows each NFT to become a unique digital collectible.","Zapo told Cryptonews that PropyKeys NFTs “offer a secure method to represent property ownership on the blockchain, facilitating the verification of property rights, all while rewarding users.”","These digital assets allow for secure management of property deeds and enable users’ real estate to become more liquid.","Additionally, they are tradable on NFT marketplaces that support the Base network.","For instance, he said, the team’s first sale on the OpenSea marketplace, a landmark NFT of Hollywood, occurred just last weekend, selling for 1 ETH.",""],"entity":[{"type":"Big Ben","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$280 trillion","content":"MONEY"},{"type":"Andrew Zapo","content":"PERSON"},{"type":"March 11, 2024","content":"DATE"},{"type":"last weekend","content":"DATE"},{"type":"X.com","content":"LOCATION"},{"type":"White House","content":"ORGANIZATION"}],"hashtag":["Blockchain","NFT","Real estate"],"authors":["Sead Fadilpašić"]}