{"summary":"Russian ‘Crypto Ban’ Could Come into Force by September, Lawmakers Confirm","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russian-crypto-ban-could-come-into-force-by-september-lawmakers-confirm.htm","publishDate":"2024-04-28T23:30:37","id":20998,"type":null,"title":"Russian ‘Crypto Ban’ Could Come into Force by September, Lawmakers Confirm","category":["Blockchain News "],"content":["A Russian “crypto ban’ could roll out as early as September 1, top lawmakers in the country have confirmed.","Speaking to the media outlet NSN, the Chairman of the State Duma Committee on the Financial Market Anatoly Aksakov said lawmakers will vote on a “ban on organizing the circulation of cryptocurrencies” in the coming weeks.","Aksakov stated that the bill will stipulate that “only digital financial assets issued in Russian jurisdictions” will be exempted from the new law.","These assets will include several Russian bank-issued blockchain-powered digital coins and the Central Bank’s digital ruble project.","The bill is unlikely to face any major opposition in the State Duma, providing it has the full support of the Central Bank and government ministries.","The bank has previously called for a China-style “total” ban on crypto, a move strongly opposed by major ministry heads.","Ministries have previously called for a more Western- and Japan\/South Korean-style approach to crypto regulation, with highly regulated domestic exchanges.","Instead, the new bill looks to be a compromise.","The Central Bank has previously indicated it is ready to make some concessions for firms struggling to trade overseas due to US- and EU-led sanctions.","Aksakov explained that the new bill “proposes a ban on the organization of circulation of [cryptoassets] in Russia.”","Exceptions, he said, will only be made for miners, mining pools, and “test projects” under the supervision of the Central Bank.","Aksakov has previously conceded that some Russian firms are already using crypto as a payment tool in international trade deals.","But the bank appears keen to draw these firms under its umbrella of influence. Governor Elvira Nabiullina has repeatedly demanded that crypto should not officially “enter the Russian economy.”","Russian crypto expert experts said lawmakers were effectively “talking about a ban on transactions involving Bitcoin (BTC) and other cryptocurrencies.” Aksakov, meanwhile, said:","“There is a need for a ban as, currently, cryptocurrencies have become a type of quasi-currency that is replacing the ruble in this country. But only the Russian ruble can be considered a legal monetary unit. And that is why we made this decision.”","Several British men have been charged under a new national security law for supporting Russia by carrying out an arson attack on a Ukraine-linked business https:\/\/t.co\/jtlyuovTSP","— Bloomberg Crypto (@crypto) April 26, 2024","","Aksakov stopped short of announcing that the bill would force Russian banks to refuse crypto exchange-related transactions.","However, it appears that such a clause could well be included in the final bill. This would present a major issue for the millions of Russian crypto users living in the country.","The Deputy Chairman of the State Duma Committee on Information Policy Anton Gorelkin struck a slightly more optimistic note in a post on his Telegram channel.","Gorelkin claimed that the bill would not “prohibit” the “circulation of cryptocurrencies in Russia.”","Instead, the lawmaker claimed that only “the organization of circulation will be prohibited” under the new bill.","He said that the law would instead seek to crack down on illegal crypto exchanges operating outside the Central Bank’s new “experimental legal regime (EPR).”","The lawmaker claimed that “providing business with unhindered access” to the crypto sector would leave them vulnerable to “Western sanctions.”","Gorelkin noted that the ban could be subject to future “revisions,” and wrote:","“It’s a paradox, but the [proposed] ban on organizing the circulation of [cryptoassets] is quite a protectionist measure.”","It appears likely that the EPR will supervise the sale of industrial crypto miners’ coins to overseas buyers.","Rosfinmonitoring, the top Russian anti-money laundering regulator, has previously said it was “monitoring” over 25,000 domestic crypto users.","And Rosfinmonitoring also called on the government to rush the rollout of crypto regulation after the Financial Action Task Force (FATF) downgraded Russia’s compliance rating due to “insufficient regulation of virtual assets and cryptocurrencies.”"],"entity":[{"type":"Bloomberg Crypto","content":"ORGANIZATION"},{"type":"EPR","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Elvira Nabiullina","content":"PERSON"},{"type":"State Duma","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"April 26, 2024","content":"DATE"},{"type":"September 1","content":"DATE"},{"type":"FATF","content":"ORGANIZATION"},{"type":"State Duma Committee","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"NSN","content":"ORGANIZATION"},{"type":"the Financial Action Task Force","content":"ORGANIZATION"},{"type":"Anatoly Aksakov","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"State Duma Committee on Information Policy Anton Gorelkin","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Regulation","Russia"],"authors":["Tim Alper"]}