{"summary":"Kraken said the lawsuit appears to be politically driven, and that it will set a &#x27;dangerous precedent&#x27; for agency overreach.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278737\/kraken-dismiss-sec-lawsuit","publishDate":"2024-02-22T21:54:11","id":2099,"type":null,"title":"Kraken seeks to dismiss SEC lawsuit, says claim was ‘retaliation’ for political remark","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Kraken filed a motion Thursday to dismiss the Securities and Exchange Commission’s <\/span><a href=\"https:\/\/www.theblock.co\/post\/263898\/sec-files-new-lawsuit-against-kraken-for-allegedly-operating-online-trading-platform-without-registering\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">November lawsuit<\/span><\/a><span data-v-f87c67ca=\"\"> that accused the crypto exchange of multiple charges including operating without registration, failing to prevent known conflicts of interest and commingling client funds.<\/span>","<span data-v-f87c67ca=\"\">In addition to filing the <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/68023155\/25\/securities-and-exchange-commission-v-payward-inc\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">motion<\/span><\/a><span data-v-f87c67ca=\"\">, Kraken said in a <\/span><a href=\"https:\/\/blog.kraken.com\/news\/sec-kraken-dismiss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> on Thursday that the SEC’s claim is flawed, as the agency argued that the crypto exchange operates an unlicensed platform for “investment contracts” without identifying any “contract” between Kraken users and token issuers.<\/span>","<span data-v-f87c67ca=\"\">“None of the assets in the SEC’s Complaint are investment contracts under the law,” the exchange said. “For eight decades, the U.S. Supreme Court and Ninth Circuit (where this case was filed) have always required that the SEC identify a contract when finding the existence of an investment contract.”<\/span>","<span data-v-f87c67ca=\"\">Kraken also claimed that crypto tokens do not qualify the Howey test, often used by U.S. authorities to define sales of securities as \"investment contracts.\"<\/span>","<span data-v-f87c67ca=\"\">“The SEC’s theory is that there can be an investment contract with no contract, no post-sale obligations and no interaction at all between the issuer and the purchaser. No pooling, no common enterprise, no profits from a business,” the blog post said.<\/span>","<span data-v-f87c67ca=\"\">The company added that the SEC’s lawsuit did not accuse Kraken of any fraud or disservice to customers, questioning the basis of the legal claim. Allowing the SEC to continue with this claim will establish a “dangerous precedent for agency overreach,” Kraken said.<\/span>","<span data-v-f87c67ca=\"\">In an X thread, Kraken CEO Dave Ripley <\/span><a href=\"https:\/\/twitter.com\/davidlripley\/status\/1760829432292405368?s=46&amp;t=WjMDpXPWGrulwjdQmIns_A\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claimed<\/span><\/a><span data-v-f87c67ca=\"\"> that the SEC’s accusations were politically motivated, pointing out how the agency said it will sue Kraken soon after the exchange testified about the SEC’s “overreach in crypto” at the House Financial Services Committee and the House Agriculture Committee in May last year.<\/span>","<span data-v-f87c67ca=\"\">“Crypto innovators in the United States should not have to fear retaliation for their political speech,” Ripley wrote in his X post. “U.S. crypto exchanges should not have to operate amid an onslaught of regulatory enforcement actions, while jurisdictions around the world continue advancing constructive regulatory rulemaking.”<\/span>","<span data-v-f87c67ca=\"\">SEC’s November lawsuit against Kraken came less than a year after the agency imposed <\/span><a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a $30 million fine<\/span><\/a><span data-v-f87c67ca=\"\"> on the exchange for its crypto-staking business.<\/span>","<span data-v-f87c67ca=\"\">Kraken and the SEC did not immediately respond to The Block’s request for further comment.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Dave Ripley","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Howey","content":"PERSON"},{"type":"Ripley","content":"PERSON"},{"type":"U.S. Supreme Court and Ninth Circuit","content":"ORGANIZATION"},{"type":"May last year","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["KRAKEN","LAWSUITS","SEC"],"authors":["Danny Park","The Block"]}