{"summary":"Bitcoin Lightning Network Payments Jump Over 400%, 80M Users Have Access to Network","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-lightning-network-payments-jump-over-400-80m-users-have-access-to-lightning.htm","publishDate":"2022-04-18T15:43:00","id":20993,"type":null,"title":"Bitcoin Lightning Network Payments Jump Over 400%, 80M Users Have Access to Network","category":["Bitcoin News "],"content":[" ","As the usage of the Bitcoin (BTC) Lightning Network is growing rapidly, now more than 80m users are estimated to have access to this network, compared with 100,000 users last summer, a new report from Arcane Research has found.","The main driver of growth for the Lightning Network this year has been Jack Dorsey’s payments app Cash App. Also, El Salvador’s national Lightning wallet Chivo and the popular bitcoin trading platform Paxful contributed to most of the growth in 2021.","Users with access to Lightning payments:","The authors of the report also noted that while Lightning Network payment volume peaked in November and has since retracted somewhat, the picture is different when we exclude deposits and withdrawals from trading services.","“[Then] we see that all other payments actually dipped in November but have since grown to new highs,” they said, adding that these payments jumped 480% in a year. Total payments jumped 410%.","Lightning Payments Except for Deposits\/Withdrawals to trading services:"," ","Meanwhile, Arcane’s researchers also found that of the total payment volume in the first two months of 2022, about half of the value transacted came from transactions directly between individuals.","The next most popular way to use Lightning was exchange deposits and withdrawals, which came in with 32% of transactions. Lastly, 20% of payments were made up of purchases of goods and services, handled either through payment processors or by buying gift cards.","Distribution of Lightning Payments Volume in 2022:","When looking at usage in terms of the number of transactions, the report said so-called micro rewards dominate the picture.","These are transactions that are typically sent to a user for using a service, for example through a gaming service that rewards its players with satoshis (1\/100 million BTC) for playing a game – a concept known as play-to-earn (P2E).","“According to our estimates, individuals sent each other more than 300,000 payments, made more than 200,000 payments for goods and services, and over 100,000 deposits or withdrawals to or from trading services in the first two months of 2022,” the report said.","In terms of the future of Lightning – Bitcoin’s most popular Layer-2 network – Arcane said that although the network’s usage is still far behind legacy payment networks like Visa, the potential for “explosive growth” exists. This potential comes from both users using bitcoin over the Lightning Network directly, and for the network to be used as a payment rail for fiat currencies, the report said.","Also, according to them, with the Lightning Network, usage can continue to grow even as we “wait for hyperbitcoinization to explode” through the use of the network simply as a payment rail for traditional currencies."," ","____\nLearn more: \n– Play-to-Earn Bitcoin Games: How Lightning Network Enables Gamers to Earn Sats\n– Taproot Adoption Remains Low, But Devs Say It Isn’t a Problem for Bitcoin\n\n– New Bitcoin’s Chance to ‘Bitcoinize the Dollar’\n– 7 Popular Bitcoin Lightning Network Wallets for 2022\n– Bitcoin Lightning Network Is Growing Faster Than You Think\n\n– A Non-Custodial Bitcoin Interest Rate Account? Lightning Network May be the Answer\n– Jack Dorsey’s Spiral Unveils Bitcoin Lightning Development Kit"],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Arcane Research","content":"ORGANIZATION"},{"type":"Lightning Payments Volume","content":"ORGANIZATION"},{"type":"410%","content":"PERCENT"},{"type":"Spiral Unveils Bitcoin Lightning Development Kit","content":"ORGANIZATION"},{"type":"the first two months of 2022","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Bitcoin\n\n– New Bitcoin","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Lightning Network Enables Gamers","content":"ORGANIZATION"},{"type":"480%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["Adoption","Bitcoin","El Salvador","Lightning Network","Payments"],"authors":["Fredrik Vold"]}