{"summary":"New Kraken CEO Dave Ripley offered The Block his insights on regulations, the exchange&#x27;s target customers, and challenges the company faces.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172575\/new-kraken-ceo-ripley-seeks-growth-not-a-clash-of-crypto-titans","publishDate":"2022-09-24T06:02:41","id":2100,"type":null,"title":"New Kraken CEO Ripley seeks growth, not a clash of crypto titans","category":["EXCHANGES"],"content":["Although incoming Kraken CEO Dave Ripley acknowledges he has \"big shoes to fill,\" he laid out an ambitious strategy on how the company plans to navigate global regulations, the challenges it faces, and how it plans to target retail investors.","<span data-v-f87c67ca=\"\">In little more than a decade since its July 2011 founding, Kraken has grown into a global digital currency exchange responsible for $16.25 billion in volume just last August, based on data from The Block Research. Now that Kraken co-founder and CEO Jesse Powell is stepping down, Ripley said he has a legacy to maintain.<\/span>","<span data-v-f87c67ca=\"\">“The most fundamental role that Kraken has played from the early days is being a bridge,” Ripley said in a wide-ranging interview with The Block. “Initially it was just a bridge to crypto generally. To buy and use bitcoin. But I think looking forward we want to extend that bridge to many other areas of crypto.”<\/span>","<span data-v-f87c67ca=\"\">Amid what he characterized as a general market slowdown worse than in previous bear markets, Ripley said Kraken will be immediately seeking to grow its team and focus on launching new products and services. Among those products and services is a forthcoming NFT marketplace that will offer the ability to custody NFTs and allow users to buy and sell them with any digital assets in their accounts.<\/span>","<span data-v-f87c67ca=\"\">One of the biggest challenges, as Kraken rolls out new products and services, is negotiating the regulatory frameworks across each of the jurisdictions in which it operates. This task is “a significant dynamic within the industry, particularly for a company like Kraken,” Ripley said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a centralized entity working with fiat currencies and with a foot in both the financial services and crypto spaces, Ripley explained Kraken employs an army of experts. It has a team of 50 legal personnel, another 300 core compliance experts, and a “few hundred” others on a general operational compliance team.<\/span>","<span data-v-f87c67ca=\"\">Places Ripley believes governments are creating meaningful strategies around regulatory legislation include Europe’s markets in crypto-assets (MiCA) regulation, a framework for which was recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/171740\/stablecoin-restriction-dropped-from-e-u-digital-asset-framework\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">finalized<\/span><\/a><span data-v-f87c67ca=\"\"> by EU officials on Sept. 21.<\/span>","<span data-v-f87c67ca=\"\">What is critical for regulation, according to Ripley, is that core aspects of crypto — such as sovereign key custody and the openness of Layer 1 networks — remain preserved. “We think those are absolutely fundamental,” he said, but acknowledged that regulations for companies like Kraken are “a given” and expressed “hope in figuring out the right path for companies like us.”<\/span>","<span data-v-f87c67ca=\"\">Kraken’s commitment to open access may be what put the company under investigation by the U.S. Treasury Department in <\/span><a href=\"https:\/\/www.theblock.co\/post\/159730\/crypto-exchange-kraken-under-investigation-for-violating-us-sanctions-nyt\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">July<\/span><\/a><span data-v-f87c67ca=\"\"> this year. Users in Iran, Cuba and Syria were allowed to use the exchange to buy and sell digital currencies in violation of U.S. sanctions, the New York Times reported.<\/span>","<span data-v-f87c67ca=\"\">Moving ahead, Kraken will build on its consumer-facing applications that, since their 2020 launch, accounted for the company’s biggest area of growth, Ripley said. This will include providing consumer traders access to “simpler and digestible” versions of some of the products professional traders use. Kraken will also roll out a revamped UX, which is already live on the mobile application.<\/span>","<span data-v-f87c67ca=\"\">Although it is working toward a streamlined consumer facing platform, Kraken won’t be leaving its institutional clients behind. “We’re going to bring about some more products and services for those groups as well,” said Ripley, who added the company offers access to a number of API’s, and hosts an over-the-counter trading desk geared toward family offices and high net-worth individuals.<\/span>","<span data-v-f87c67ca=\"\">Kraken’s markets have seen a relatively steady decline in volume since an all-time high at $100 billion in May 2021, based on data from The Block Research. Despite the market cycles, Ripley said this isn’t Kraken’s “first rodeo” but added that it doesn’t make them easy. Scaling up or down and maintaining efficiency, Ripley said, remains a significant challenge for Kraken.<\/span>","<span data-v-f87c67ca=\"\">“There’s always uncertainty in these cycles,” said Ripley. “So if we knew exactly when the market would become highly active again, and prices would move and all these types of things it would be a lot easier. But we don’t, so we don’t know the timeline. So that’s something that makes it also difficult to plan for.”<\/span>","<span data-v-f87c67ca=\"\">Another challenge, according to Ripley, is the overall success of the crypto industry, by which he means “we’re starting to see more traditional financial companies coming in, a ton of new different startups and innovators so that just adds more competition to the space.” With all that added competition, he said, “making sure that in this evolving space, Kraken carves out its space and its role is something that’s a big challenge for us, I think all companies in general, and this is again why we focus a lot of attention there and really thinking hard about our strategy and making sure we’re headed toward the right north stars.”<\/span>","<span data-v-f87c67ca=\"\">Taking on the CEO position after Powell, Ripley admitted that his predecessor’s are “big shoes to fill.” Powell spent 11 years growing Kraken into a global exchange, processing more than <\/span><a href=\"https:\/\/www.theblockresearch.com\/kraken-company-intelligence-report-100755\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$160 billion<\/span><\/a><span data-v-f87c67ca=\"\"> in trading volume between the first two quarters of 2021 during bull market conditions.<\/span>","Although he is stepping back, Powell’s firm sentiment that crypto is for everyone will remain a guiding directive for the&nbsp;<a class=\"c-link\" href=\"https:\/\/kraken-culture.notion.site\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/kraken-culture.notion.site\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">culture<\/a>&nbsp;at Kraken. It is a culture that Ripley said will “remain exactly unchanged.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"last August","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ripley","content":"LOCATION"},{"type":"Ripley","content":"PERSON"},{"type":"July 2011","content":"DATE"},{"type":"Cuba","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Dave Ripley","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July<\/span><\/a><span data-v-f87c67ca=\"\"> this year","content":"DATE"},{"type":"Kraken","content":"PERSON"},{"type":"Jesse Powell","content":"PERSON"},{"type":"Sept. 21","content":"DATE"},{"type":"Syria","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"$160 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Iran","content":"LOCATION"},{"type":"$16.25 billion","content":"MONEY"}],"hashtag":["JESSE POWELL","KRAKEN"],"authors":["Jeremy Nation","The Block"]}