{"summary":"Epic Game Store Launches New Crypto Game by Creator of ‘Magic: The Gathering’ – Adoption on the Rise?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/epic-game-store-launches-new-crypto-game-by-creator-of-magic-gathering-adoption-rise.htm","publishDate":"2023-10-20T12:42:00","id":21006,"type":null,"title":"Epic Game Store Launches New Crypto Game by Creator of ‘Magic: The Gathering’ – Adoption on the Rise?","category":["Blockchain News "],"content":["The creator of the popular card game “Magic: The Gathering,” Richard Garfield, is now delving into the world of blockchain gaming with a new digital card game called “Brawlers,” co-designed by Garfield himself.","The game is already available free of charge on the Epic Game Store, offering a large user base access to this Web3 gaming experience.","Developed by Tyranno Studios, “Brawlers” allows players to purchase card sets and use them to play against each other while retaining full ownership and control over their in-game assets, making trading and exchanging digital assets a seamless process.","The crypto game makes use of the WAX (WAXP) blockchain, a layer 1 proof-of-stake (PoS) network developed to be compatible with the better-known EOS blockchain.","The blockchain already hosts a number of other blockchain-based games, including popular titles such as Alien Worlds, Farmer’s World and Wombat Dungeon Master.","In comments shared with The Block, Garfield expressed his enthusiasm for the project, emphasizing that it opens new possibilities for developers to create web3 games with robust and player-driven economies, avoiding the issues associated with microtransactions.","The move into the blockchain gaming space reflects a growing interest in decentralized applications and assets among game developers.","As part of its blockchain push, “Brawlers” will also feature a limited-edition collection of NFTs and cross-platform functionality via NFT bridges to separate blockchains such as Polygon, Ethereum and BNB Chain.","With more than 230 million users, the Epic Game Store’s decision to host “Brawlers” is likely to boost the game’s adoption and bring blockchain gaming closer to mainstream audiences.","🔥 Brawlers on the Epic Games Store!\n\nSoon, Brawlers will be accessible to millions more on the Epic Games Store. Expanding the #Brawlerverse has never been more exhilarating!\n\nDownload soon & add to your wishlist now: https:\/\/t.co\/JRo2QUoONn pic.twitter.com\/nzK91dS6jI",""],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Tyranno Studios","content":"ORGANIZATION"},{"type":"Richard Garfield","content":"PERSON"},{"type":"Garfield","content":"PERSON"},{"type":"Brawlers","content":"ORGANIZATION"}],"hashtag":["Web3"],"authors":["Fredrik Vold"]}