{"summary":"Kevin O’Leary Wants To Buy TikTok and Implement Cryptocurrency Features","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/kevin-oleary-wants-to-buy-tiktok-and-implement-cryptocurrency-features.htm","publishDate":"2024-03-28T16:26:05","id":21016,"type":null,"title":"Kevin O’Leary Wants To Buy TikTok and Implement Cryptocurrency Features","category":["Bitcoin News "],"content":["Mainstream cryptocurrency adoption is well underway according to recent findings from a Crypto.com report that show global cryptocurrency ownership increased by 34% last year. ","According to the report, 432 million people owned crypto in January 2023, a number which rose to 580 million by the end of last year. ","While notable, digital assets may soon become even more mainstream if Canadian business man and “Shark Tank” host Kevin O’Leary buys TikTok. ","TikTok is a very important platform and this is an issue that won’t go away. Everyone knows TikTok leaks data to the CCP. It’s not a secret. It’s gotta be sold! I’m proposing purchasing these assets into a new American company. pic.twitter.com\/FVsvp4N7yA","— Kevin O'Leary aka Mr. Wonderful (@kevinolearytv) March 13, 2024","","O’Leary recently stated on the Web3 Deep Dive podcast that he would implement digital asset features on a compliant basis if he were to buy the popular social media platform. ","“I think using digital payment systems on a platform like TikTok has potential. There’s no question about it,” said O’Leary. ",""," ","O’Leary elaborated that since TikTok is a “global phenomenon” it  would give a lot of users around the world greater ease of access to cryptocurrencies for conducting digital payment transfers between countries.  ","“This would have to be compliant, transparent, and obviously auditable so users would know who sent and received transactions. I would provide that. I think that’s the potential of a platform this large,” O’Leary remarked. ","Although TikTok’s potential sale is still underway, industry experts believe that implementing cryptocurrency into the platform may be beneficial for the app moving forward.","Alexander Mamasidikov, Founder and CEO of digital payment solution platform CrossFi, told Cryptonews that incorporating crypto payments into TikTok could play a positive role in spreading crypto content as well. ","“A main feature of TikTok is the phenomenon of self-reproduction, which is the willingness of users to generate mass content on their own,” said Mamasidikov. “Supporting cryptocurrency would allow users to create crypto-focused content on a huge scale.”","Mamasidikov added that mainstream adoption of cryptocurrency would likely take off given TikTok’s Generation Z user base.","“TikTok users are typically open to innovation, appreciate quick solutions to problems, and can easily incorporate new technologies into everyday life,” he said. ","Shira Lazar, Founder and CEO of news outlet What’s Trending, told Cryptonews that incorporating cryptocurrency as gifts during TikTok live streams or as tipping mechanisms could be a smart move for the platform. ","“This seems pretty obvious as cryptocurrency becomes more mainstream,” said Lazar.","Lazar – who has over 620,000 followers on TikTok – further noted that if TikTok users can earn fiat, the same option should be made available for cryptocurrency payments. ","“Why should TikTok not consider crypto as an option? More people seem to be holding crypto over cash internationally, as well,” she said. ","To Lazar’s point, crypto adoption is very apparent in countries like El Salvador, where Bitcoin has been accepted as legal tender since 2021. Other countries like Nigeria and Turkey also rank as the biggest adopters of cryptocurrency this year. ","Although cryptocurrency payments may be a logical next step for an app like TikTok, challenges are likely to arise. ","Tim Delhaes, CEO of smart-wallet provider Grindery, told Cryptonews that while incorporating crypto payments into social media platforms represents a big opportunity, compliance and regulation may be problematic. ","Speaking from experience, Delhaes shared that Grindery recently announced an integration with the messaging platform Telegram to allow users to leverage cryptocurrency within the app.  ","“Grindery enables Telegram users to create a wallet without needing passphrases or private keys. Users can then send any token to other Telegram users without knowing their wallet addresses, and swap tokens quickly and without gas fees,” said Delhaes. ","Grindery is still in its beta stage, yet Delhaes noted that the platform has already attracted over 700,000 sign-ups. While notable, Delhaes pointed out that meeting regulations hasn’t been an easy task. ","“Grindery’s focus on Telegram stems from shared values in decentralization and privacy,” he said. “Overcoming these challenges requires innovative approaches to compliance, leveraging blockchain’s transparency and security features, and working closely with regulatory bodies to ensure all operations meet legal standards.” ","This is important to point out, especially given the United States’ critical stance toward cryptocurrency.","Regulations aside, Mamasidikov believes that the biggest challenge regarding cryptocurrency payments on TikTok will be technology related. ","“When implementing the technology, it will be necessary to provide for the possibility of payment messages,” he said. “This will allow users to transfer funds to each other seamlessly through the messenger built into the social network.”","Lazar noted that TikTok could partner with crypto-friendly platforms like Paypal, Venmo, or Cashapp to ensure sufficient payment options. ","Regardless of challenges, Delhaes noted that crypto payments have the potential to transform social media platforms into “Super Apps.” ","“This evolution is crucial for content creators, offering them new revenue streams, greater control over their earnings, and direct financial interactions with their audience, free from platform-specific constraints,” he said. ","Delhaes pointed out that this has already been demonstrated by WeChat. The messaging platform incorporated digital yuan payments into its platform last year.","Yet in order for this model to be successful, Delhaes stressed the need for separation between blockchain payments and core business functions. If this isn’t ensured, he pointed out that cryptocurrencies within TikTok could fail similarly to Facebook’s Libra project, or Telegram’s 2018 token launch. ","Mamasidikov further remarked that he believes alternative payment solutions will be implemented within many social networks in the future. He noted that this will also enable financial tools for citizens in developing countries that may not have access to traditional banking methods. ","“I can say with confidence that the era when financial instruments were unavailable to 60% of the world’s population will end very soon,” he said. “Any person on the planet, regardless of their place of residence, origin, wealth, will be able to use banking products and money transfers without a bank as social media platforms mature.” "],"entity":[{"type":"Kevin O’Leary","content":"PERSON"},{"type":"El Salvador","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"Tim Delhaes","content":"PERSON"},{"type":"Shira Lazar","content":"PERSON"},{"type":"January 2023","content":"DATE"},{"type":"CCP","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"34%","content":"PERCENT"},{"type":"Shark Tank”","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"Wonderful","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Mamasidikov","content":"PERSON"},{"type":"Delhaes","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Kevin O'Leary","content":"PERSON"},{"type":"Venmo","content":"LOCATION"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"Lazar","content":"PERSON"},{"type":"Alexander Mamasidikov","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["Cryptocurrency","Social media","TikTok"],"authors":["Rachel Wolfson"]}