{"summary":"Total AUM of crypto hedge funds doubled to over $2 billion in 2019, according to a new report by PwC and Elwood Asset Management\nBitcoin was the most traded crypto by hedge funds; family offices comprised 48% of investors \nHenri Arslanian, global crypto leader at PwC, told The Block: “I expect the crypto hedge fund industry to grow significantly over the coming years”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64671\/crypto-hedge-funds-assets-under-management-doubled-in-2019-to-over-2-billion-new-report-indicates","publishDate":"2020-05-11T06:30:29","id":2101,"type":null,"title":"Total assets under management for crypto funds doubled in 2019","category":["Cryptocurrency"],"content":["The total assets under management (AUM) of cryptocurrency hedge funds doubled last year, according to a new report.","The report, <a href=\"https:\/\/www.pwc.com\/gx\/en\/financial-services\/pdf\/pwc-elwood-annual-crypto-hedge-fund-report-may-2020.pdf\" data-v-f87c67ca=\"\">published<\/a> by PwC and Elwood Asset Management Services on Monday, shows that the total AUM of crypto hedge funds globally increased to over $2 billion in 2019 as compared to $1 billion in the previous year. Notably, 2019 saw bitcoin’s price jump over 90% as compared to 2018.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe percentage of crypto hedge funds with an AUM of over $20 million increased in 2019 from 19% to 35%. The average AUM increased from $21.9 million to $44 million, while the median AUM increased from $4.3 million to $8.2 million.&nbsp;","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Quant funds most prevalent<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPwC and Elwood classified crypto hedge funds according to four broad fund strategies: Discretionary long only (funds that tend to have longest lock-up periods for investors), Discretionary long\/ short (funds that follow hybrid strategies), Quantitative (funds that trade in more liquid cryptocurrencies) and Multi-strategy (funds that follow a combination of the first three strategies).","They found that quantitative or quant funds are the most prevalent and make up almost half of crypto hedge funds in the market today. The remaining strategies make up the other 50% of the crypto hedge fund market.","Discretionary long-only funds had the best median performance at 40%, with an average 42% gain, according to the report. Discretionary long\/short had both an average and median performance of 33%. Multi-strategy funds had a median return of 15%, while quantitative funds saw a median 30% increase.","","","Most crypto hedge funds traded bitcoin (97%) last year, followed by ether (67%), XRP (38%), litecoin (38%), bitcoin cash (31%) and EOS (25%).","“Although we did not ask funds to rank their top traded altcoins by market capitalization, it is interesting to note that Litecoin was mentioned by funds as one of their top traded altcoins despite its market cap being relatively smaller than the other mentioned altcoins,” the report said.","","","“I expect the crypto hedge fund industry to grow significantly over the coming years as investing in a crypto fund may be the easiest and most familiar entry point for many institutional investors looking at entering this space,” said PwC’s Arslanian."],"hashtag":["BITCOIN","XRP"]}