{"summary":"‘Pig Butchering’ Crypto Investment Scams Delivered ‘Massive Losses’ to Victims","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pig-butchering-crypto-investment-scams-delivered-massive-losses-to-victims.htm","publishDate":"2022-07-27T00:00:00","id":21011,"type":null,"title":"‘Pig Butchering’ Crypto Investment Scams Delivered ‘Massive Losses’ to Victims","category":["Bitcoin News "],"content":[" ","An emerging and rather complex form of investment scam known as “pig butchering,” wherein flirtatious strangers convince unsuspecting users to invest in crypto trading platforms that eventually seize funds when victims try to cash out, has reportedly robbed victims of millions of dollars worth of cryptoassets. ","The term “pig butchering” refers to a sophisticated and human-intensive process of using fake profiles on social media platforms and dating sites to lure people into investing in unsuspicious scams. ","“The fraud is named for the way scammers feed their victims with promises of romance and riches before cutting them off and taking all their money,” the Federal Bureau of Investigation (FBI) warned in April 2022.","The most prevalent form of pig butchering scam involves promising crypto platforms that offer unprecedented returns within a short time, according to a recent report by security news and investigation website KrebsonSecurity.","These scams often start with what appears to be a wayward SMS and are also prevalent on dating sites and apps, the report said. As soon as the victim responds, they ask them to continue the conversation via the WhatsApp messaging platform.","“The people forced to perpetrate these scams have a guide and a script, where if your victim is divorced say this, or a single mom say this,” Erin West, deputy district attorney for Santa Clara County in Northern California, was quoted as saying.","West said there are “horrifying stories” of victims that have fallen victim to this scam, which range from young women early in their careers, to senior citizens and even to people working in the financial services industry. ","In the report, Courtney Nolan, a divorced mother of three daughters, was presented as one of the victims who lost more than USD 5m in such a scam. Nolan said everything started with a direct Twitter message from a “crypto enthusiast,” who promised to mentor her on how to make reliable profits using major crypto trading platform XTB.com.","The scammer had Nolan create an account on the xtb-market[.]com, a duplicate of the original website that was made to be confusingly similar to XTB’s official platform. The site promoted different investment packages, including a “starter plan” that asked for a USD 5,250 up-front payment in return for over 15% return.","Per the report, she initially made small investments and generated hefty returns. Nolan said she was even able to withdraw amounts ranging from USD 10,000 to USD 30,000 on several occasions. ","However, after investing more than USD 4.5m, she found her account frozen. Nolan then received a tax statement saying she owed nearly USD 500,000 in taxes before she could reactivate her account or access her funds. After paying the “tax bill,” her mentor and the entire website disappeared.","In general, a pig butchering scam has four elements. These include social media or dating apps, WhatsApp, no video (scammers will come up with all kinds of excuses not to do a video call), and investment chit-chat, KrebsonSecurity’s report said. ","As previously reported, romance scams have seen a steep rise over the past several years. In May 2021, a South Korean woman drugged a man she met on a smartphone chat app and stole USD 87,000 in crypto from his phone.\n____\nLearn more: \n– Top 7 NFT Scams to Look Out For\n– 7 DeFi Risks You Should be Aware of According to CoinShares\n\n– Crypto Exchange That Hosted a Scammer’s Wallet Is ‘Not Liable’ For Victim’s Losses, Court Rules\n– Police Investigate Ethereum, Bitcoin Mining ‘Pool’ Following ‘Scam’ Allegations\n\n– SIM Swaps, Other Crypto-related Crimes Set to Rise in South Korea, Says SK\n– MetaMask Aims to Help Crypto Scam & Phishing Victims Take Legal Action Against Fraudsters"],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"Court Rules\n– Police Investigate Ethereum","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"Northern California","content":"LOCATION"},{"type":"NFT Scams","content":"ORGANIZATION"},{"type":"CoinShares\n\n– Crypto Exchange","content":"ORGANIZATION"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Courtney Nolan","content":"PERSON"},{"type":"Erin West","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Santa Clara County","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"millions of dollars","content":"MONEY"},{"type":"MetaMask Aims to Help Crypto Scam & Phishing Victims Take Legal Action Against Fraudsters","content":"ORGANIZATION"},{"type":"Nolan","content":"PERSON"}],"hashtag":["Crime","Cryptocurrency","Scam"],"authors":["Ruholamin Haqshanas"]}