{"summary":"Ethereum and Uniswap Tank Despite Optimism News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-and-uniswap-tank-despite-optimism-news-11055.htm","publishDate":"2021-07-14T09:52:00","id":21012,"type":null,"title":"Ethereum and Uniswap Tank Despite Optimism News","category":["Ethereum News "],"content":["Decentralized finance (DeFi) startup Optimism has launched the long-awaited Alpha layer-two (L2) solution for major decentralized exchange (DEX) Uniswap (UNI) through the Optimistic Ethereum (OΞ) mainnet. Despite the news, both ethereum (ETH) and UNI dropped together with the rest of the market.","Given that Uniswap’s transactions are done on Ethereum, it implies very high fees, much reported on over the past months. The new solution is expected to reduce the costs for its users.","However, at 7:43 UTC, ETH was trading at USD 1,899, having dropped 6.5% in a day. It also fell 18% over the last week. UNI dropped even more in a single day – 12%, now trading at USD 17.17. It’s also down 23% in a week.","This comes as Uniswap announced the Alpha launch of its third iteration, Uniswap v3, on the OΞ mainnet.","“Starting today, anybody can deposit, trade and provide liquidity using Uniswap V3 on OΞ,” said Optimism’s post. It added that “this does not mean that it’s time to ape in,” stating that the team placed explicit safeguards to prevent usage from skyrocketing.","They also warned that there will be both planned and unplanned downtime.","Users can use Uniswap on OΞ by depositing their L1 assets into L2, and switching their wallet to interact with OΞ. Layer 1 (L1) is the base protocol (the Ethereum blockchain), while Layer 2 (L2) is any protocol built on top of Ethereum.","The redesigned token bridging system bridges new L1 assets into L2, at launch supporting ETH, DAI, wrapped bitcoin (WBTC), tether (USDT), tether EUR (EURT), and synthetix network token (SNX), while an interface for adding new assets will follow “soon.”","The suite of new infrastructure integrations includes Etherscan, Matamask, Coinbase Wallet, Imtoken Wallet, and others.","Per Uniswap, during this Alpha period, OΞ will support an initial throughput of 0.6 transactions per second (tps). Given that Uniswap v3 is currently one of the few protocols deployed to OΞ, “this should translate to transaction capacity roughly in line with L1”, they said, adding that “unlike L1, transactions on OΞ confirm instantly.”","With this release, said Optimism, they are also officially enforcing fees on Optimistic Ethereum, choosing “a conservative target of 50,000 transactions per day at launch, to be targeted with an EIP 1559-like congestion pricing mechanism, to be ramped up over time.”","Uniswap added that, assuming Uniswap v3 sees equal usage to L1, then OΞ should offer up to 10x transaction cost savings.","Additional demand will drive gas costs higher, they argued, while transaction speeds will ramp up over the coming months “as the OΞ infrastructure is tested and optimized at scale.” According to them, the end goal is scaling to fully meet demand for low-cost, high-speed DEX trading.","Following the Uniswap launch, the Optimism’ teams priorities are, per their words:","Uniswap added that Optimism’s roadmap promises further improvements including additional scaling, smart wallet externally owned accounts (EOAs) (no need for ”approves” and gas can be paid in any token), and decentralization of the transaction sequencing operation.","As reported, Optimism is an L2 scaling solution, which aims to help the Ethereum mainnet to be ‘unburdened’ from the great number of transactions it has to process. It uses optimistic rollups to achieve lower fees and latency, as well as greater throughput compared to Ethereum L1 alone. The team behind it had previously estimated that it might be launched this month.\n____\nLearn more:\n– Technically Capable Bitcoin Has Other Mass Adoption Challenges To Solve\n– Ethereum Starts Testing London Upgrade – but ‘Adjust Your Expectations’","– Power Ledger Migrates to Solana But Keeps Its Token On Ethereum\n– What EIP 1559 Brings to the Ethereum Table"],"entity":[{"type":"USD 17.17","content":"ORGANIZATION"},{"type":"Ethereum Table","content":"LOCATION"},{"type":"UNI","content":"ORGANIZATION"},{"type":"6.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Uniswap v3","content":"ORGANIZATION"},{"type":"7:43","content":"TIME"},{"type":"1559","content":"DATE"},{"type":"18%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Imtoken Wallet","content":"ORGANIZATION"},{"type":"Matamask","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Coinbase Wallet","content":"ORGANIZATION"}],"hashtag":["Ethereum","Fees","Scalability","Uniswap"],"authors":["Sead Fadilpašić"]}