{"summary":"Azuki #9605 has just been sold for 420.7 ETH ($1.4 million) on OpenSea.\nThis is the highest ever sale price recorded for the Azuki NFT collection.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139841\/azuki-nft-sells-for-record-1-4-million","publishDate":"2022-03-30T07:26:54","id":2102,"type":null,"title":"Azuki NFT sells for record $1.4 million","category":["NFTs"],"content":["Azuki #9605, billed as the second-rarest member of the Azuki NFT collection, sold for a record <a href=\"https:\/\/opensea.io\/assets\/0xed5af388653567af2f388e6224dc7c4b3241c544\/9605\" data-v-f87c67ca=\"\">420.7 ETH<\/a> ($1.4 million) on the NFT marketplace OpenSea on Wednesday.","The buyer of the piece goes by \"jdizzles\" on OpenSea and the seller by \"trevault.\"&nbsp;A member of RedBeanDAO, which frequently buys Azuki NFTs, <a href=\"https:\/\/twitter.com\/trebooomin\/status\/1509024380508065798\" data-v-f87c67ca=\"\">claimed the sale<\/a> on the Twitter handle trebooomin.&nbsp;","Trebooomin identified the buyer as \"Jason,\" who goes by Bitcoin4Freedom on Twitter. The Block reached out to Jason for comment, but they did not get back by press time.","The Azuki NFT collection comprises 10,000 unique anime avatars that give its owners access to The Garden, \"a corner of the internet where art, community and culture fuse to create magic.\"","The collection was launched in January by <a href=\"https:\/\/www.chirulabs.com\/\" data-v-f87c67ca=\"\">Chiru Labs,<\/a> a Los Angeles-based startup run by four pseudonymous founders: ZAGABOND, 2pm.flow, location tba and HoshiBoy. They claim to have a worked at Google, Facebook, Y Combinator and in DeFi.","Azuki has quickly become one of the most popular NFT collections, following pioneers like Bored Ape Yacht Club.","According to The Block Research's NFT analyst, Thomas Bialek, its popularity has been driven by several factors: Azuki being one of the first anime-themed projects to go mainstream; the team's experience from big tech and DeFi; and novel initiatives in the project's roadmap, such as exclusive physical good drops in perpetuity and DAO exploration with its own BEAN token.","Azuki NFTs have surpassed $500 million in sales volume to date on OpenSea, according to The Block Research. Its top 10 highest sales range between $353,000 and $1.4 million.<br data-v-f87c67ca=\"\">\n","","Azuki's last one-month trading volumes are higher than the legacy NFT collection CryptoPunks, which was recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137631\/bored-apes-creator-yuga-labs-acquires-ip-for-cryptopunks-and-meebits\" data-v-f87c67ca=\"\">acquired by<\/a> BAYC creator Yuga Labs. Azuki's sales volume stood at $85 million in the last month compared to CryptoPunks' $76 million. The most popular NFT collections, BAYC and Mutant Ape Yacht Club (BAYC), have had a sales volume of $220 million and $150 million, respectively, in the last month, according to The Block Research."],"hashtag":["AZUKI","OPENSEA"]}