{"summary":"Central Banks to Explore Tokenization of Cross-Border Payments With Project Agora","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/central-banks-to-explore-tokenization-of-cross-border-payments-with-project-agora.htm","publishDate":"2024-04-03T20:38:41","id":21033,"type":null,"title":"Central Banks to Explore Tokenization of Cross-Border Payments With Project Agora","category":["Blockchain News "],"content":["A consortium of central banks worldwide, led by the Bank for International Settlements (BIS), announced a new initiative, “Project Agora,” to explore the potential of tokenization to enhance existing financial systems.","The BIS, representing 63 central banks globally, is engaged in various projects focused on national digital currency issuance and enhancing market efficiency through crypto network technologies.","","The BIS, central banks and private sector are embarking on Project Agorá to explore #Tokenisation of cross-border payments @banquedefrance @Bank_of_Japan_e @bok_hub @Banxico @SNB_BNS @bankofengland @NewYorkFed https:\/\/t.co\/mDFKBqNCqc pic.twitter.com\/GRsEButU2I","— Bank for International Settlements (@BIS_org) April 3, 2024","","The Bank for International Settlements (BIS) has embarked on a groundbreaking initiative named Project Agorá, collaborating with a consortium of private financial institutions. This project aims to amalgamate wholesale versions of tokenized central bank money and commercial bank deposits onto a unified, programmable platform.","Project Agorá, translating to “marketplace” in Greek, involves seven monetary authorities from various regions, such as the U.K., Japan, South Korea, Mexico, Switzerland, New York, and Europe, in partnership with private financial firms. The primary objective is to address challenges in cross-border payments arising from disparate legal, regulatory, and technical frameworks, operational hours, and time zones.","Project Agorá’s main focus will be to increase the speed and integrity of #CrossBorderPayments, while lowering costs @banquedefrance @Bank_of_Japan_e @bok_hub @Banxico @SNB_BNS @bankofengland @NewYorkFed https:\/\/t.co\/mDFKBqNCqc pic.twitter.com\/fh2XUxqpoK","— Bank for International Settlements (@BIS_org) April 3, 2024","","The BIS plans to issue detailed instructions and requirements for participation, providing a grace period for private banks to join the collaboration. The project’s core focus lies in exploring seamless integration between tokenized commercial bank deposits and wholesale central bank money within a public-private programmable financial platform.","Central to this integration are smart contracts, a hallmark of the cryptocurrency sector, which will facilitate automatic transaction execution. The BIS foresees this integration as a means to bolster the monetary system’s functionality and offer innovative solutions leveraging smart contracts and programmability while preserving the system’s established two-tier structure.","Tokenization, a process involving the digitization of real-world assets into tokens, has gained significant traction among financial institutions worldwide. A recent report endorsed by the U.K. government urged local businesses to advance their tokenization efforts, highlighting the growing interest and potential of this technology in the financial sector.","HSBC, a leading financial institution, announced last month its venture into tokenizing gold for investors in Hong Kong. Notably, the market value of tokenized U.S. Treasury notes on public blockchains surpassed $1 billion for the first time in March, as per data from 21.co’s Tom Wan.","In March, the market value of tokenized U.S. Treasury notes on public blockchains surpassed $1 billion for the first time, according to data from 21.co. Cecilia Skingsley, Head of the BIS Innovation Hub, emphasized the project’s focus on developing a more efficient payment infrastructure to unify various payment systems. Skingsley stated,","“We will not just test the technology, we will test it within the specific operational, regulatory and legal conditions of the participating currencies, together with financial companies operating in them.”","Hyun Song Shin, BIS head of research, highlighted the ambitious goal of Project Agorá, aiming for practical usability and meaningful impact by leveraging existing infrastructure. The BIS plans to invite expressions of interest from private financial institutions to participate in Project Agorá.","The BIS announced its work program for the year on January 23, which features six new projects exploring the issues of cybersecurity, fighting financial crime, CBDCs, and green finance. One of these projects, Project Promissa, a collaboration between the BIS, the Swiss National Bank, and the World Bank, aims to develop a proof-of-concept (PoC) platform for digital tokenized promissory notes.","Throughout 2023, the BIS remained a leading advocate for CBDCs while expressing concerns about stablecoins. In November 2023, Agustín Carstens, the BIS’s general manager, urged central banks worldwide to spearhead digital innovation, identifying CBDCs as a central element of this leadership."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Tom Wan","content":"PERSON"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Cecilia Skingsley","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"Swiss National Bank","content":"ORGANIZATION"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Greek","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"April 3, 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Shin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Agustín Carstens","content":"PERSON"},{"type":"Mexico","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"January 23","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"Project Agorá","content":"LOCATION"}],"hashtag":["Bank for International Settlements","Central Bank","Tokenization"],"authors":["Hassan Shittu"]}