{"summary":"BitMEX Announces Strategic Partnership with PowerTrade, a Crypto Options Platform","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitmex-announces-strategic-partnership-with-powertrade-a-crypto-options-platform.htm","publishDate":"2023-12-06T22:29:44","id":21032,"type":null,"title":"BitMEX Announces Strategic Partnership with PowerTrade, a Crypto Options Platform","category":["Blockchain News "],"content":["BitMEX, a prominent crypto derivatives exchange, has unveiled a strategic partnership with PowerTrade, a crypto options platform.","On November 6, BitMEX announced that it will partner with PowerTrade, which is supported by industry heavyweights such as Ascend Ventures, Pantera Capital, and Ledger Prime. This collaboration aims to introduce new products into BitMEX’s extensive portfolio, emphasizing the platform’s dedication to pioneering innovation and elevating the trading experience for its users.","@PowerTradeHQ is proud to announce our strategic partnership with @BitMEX , renowned leader in the crypto derivatives arena.","The partnership is set to explore the integration of new products between our platforms, leveraging BitMEX's market-leading liquidity and PowerTrade's… pic.twitter.com\/zfCl6W0WYB","— PowerTrade (crypto options) (@PowerTradeHQ) December 6, 2023","","BitMEX, established in 2014, caters to cryptocurrency derivatives traders with low latency, deep liquidity, and maximum availability. Notably, the exchange has maintained an impeccable security record, boasting “no coin lost, ever!” since its inception.","As part of its services, BitMEX provides over 100 derivatives contracts, supports 11 pairs for spot trading, and offers a seamless conversion function among 30 different cryptocurrencies. The partnership with PowerTrade is likely aimed at further enhancing the platform’s capabilities and meeting the evolving needs of professional traders in the cryptocurrency market.","Stephan Lutz, CEO at BitMEX, emphasizes the significance of this strategic partnership, stating, ","“The strategic partnership with PowerTrade exemplifies our ambition to offer crypto traders the most profitable opportunities on the safest and most reliable trading platform in the market. We recognize the dynamics and competitive nature of the market, and we hope to set new standards for the future of crypto trading.”","PowerTrade, led by CEO Mario Gomez Lozada, brings a wealth of expertise from both traditional finance and the cryptocurrency sectors. Lozada envisions the partnership as a catalyst for developing a game-changing offering in the market. This is done by leveraging PowerTrade’s advanced financial products in conjunction with BitMEX’s established user base and liquidity.","BitMEX’s latest effort comes amid growing demand for new derivatives products from professional traders, as it has been at the forefront of market innovation.","In 2015, the exchange introduced the Perpetual Swap, revolutionizing the market and becoming the most widely traded crypto product. Demonstrating a commitment to transparency, BitMEX has regularly published on-chain Proof of Reserves and Proof of Liabilities since 2021, ensuring that available funds exceed total client balances.","Its latest listing is for Fantom, with a perpetual swap of the layer one smart contract platform’s FTM set for listing on December 7, 2023. According to details on the BitMEX website, FTM\/USD Perpetual Swap will list with up to 10x leverage.","$FTM fans listen up because @FantomFDN is coming to BitMEX tomorrow, along with 10x leverage. For the lowdown on the latest listing, read on. 👇https:\/\/t.co\/42NWxd5v2n","— BitMEX (@BitMEX) December 6, 2023","","The FTMUSD Quanto Contract on BitMEX, like all Quanto contracts, features a fixed Bitcoin multiplier, irrespective of the FTM\/USD price. This unique characteristic allows traders to take long or short positions on the FTM\/USD exchange rate without directly dealing with FTM or USD. ","Traders can post a margin in XBT and experience gains or losses in XBT as the FTM\/USD rate fluctuates. For new users who still need to register for a BitMEX account, the platform is currently offering up to $5,000 in BMEX tokens for verified users.","In September, BitMEX launched its prediction markets platform, where users can bet on the outcome of various events using Bitcoin. The platform, dubbed BitMEX Event-Based Contracts, aims to provide a transparent and fair way for traders to speculate on the future of crypto, politics, sports, and more.","The first contract, which expires in December 2026, will allow users to predict the recovery rate of FTX’s customer claims. The second contract will see traders betting on the potential approval or denial of a spot Bitcoin ETF by the Securities and Exchange Commission (SEC).","While the Commission has given the green light to futures-based Bitcoin ETFs, the regulator is yet to approve a similar product based on spots."],"entity":[{"type":"2014","content":"DATE"},{"type":"Stephan Lutz","content":"PERSON"},{"type":"2015","content":"DATE"},{"type":"FTMUSD Quanto Contract","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"November 6","content":"DATE"},{"type":"$5,000","content":"MONEY"},{"type":"December 2026","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"December 6, 2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"December 7, 2023","content":"DATE"},{"type":"Mario Gomez Lozada","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"USD Perpetual Swap","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Ascend Ventures","content":"ORGANIZATION"},{"type":"PowerTrade","content":"ORGANIZATION"},{"type":"FTM","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["BitMEX","Derivatives"],"authors":["Hassan Shittu"]}