{"summary":"US DOJ Seizes $9 Million in USDT from Cyber Scam Organization, Tether to Onboard FBI","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/us-doj-seizes-9-million-in-usdt-from-cyber-scam-organization-tether-to-onboard-fbi.htm","publishDate":"2023-11-29T10:50:06","id":21038,"type":null,"title":"US DOJ Seizes $9 Million in USDT from Cyber Scam Organization, Tether to Onboard FBI","category":["Altcoin News "],"content":["The United States Department of Justice (DOJ) has seized nearly $9 million worth of USDT from an organization running pig butchering scams – with Tether’s help.","According to the press release, the authorities traced the funds to cryptocurrency addresses allegedly connected to an organization that swindled more than 70 victims via romance scams and crypto confidence scams.","It added that,","“The department would like to acknowledge Tether for its assistance in effectuating the transfer of these assets.”","Tether confirmed it “again helped law enforcement thwart the bad actors and aid their victims’ recovery.”","Tether has already onboarded the United States Secret Service (USSS) into its platform.","Now, it says, it will be working with the Federal Bureau of Investigation (FBI) to do the same.","US Attorney Ismail J. Ramsey commented that the seizure was the result of a collaboration between the DOJ and the USSS.","He said that Silicon Valley is “one of the world’s preeminent locations” for crypto firms. Therefore, the authorities will use “all tools at our disposal to bring justice to the victims of frauds and scams. Even when money and criminals are abroad, we will work with our partners to seize cyber criminals’ illegal proceeds,” Ramsey said.","‘Pig butchering’ consists of scammers ‘fattening up’ their victims, commonly inexperienced investors, before ‘butchering’ them.","In other words, they make false promises, get victims to trust them, take as much money as they can, and then disappear.","According to the DOJ, criminals in this case convinced victims to make crypto deposits in what they believed were investments with trusted firms and crypto exchanges.","“In reality, the purported firms and cryptocurrency exchanges were non-existent trading platforms.”","Agents and analysts from the USSS traced the deposits. They found that the scammers laundered the money fast through “dozens” of crypto addresses.","Then, they exchanged the funds for “several” different cryptocurrencies – a money laundering technique known as ‘chain hopping’.","“These techniques are used to “layer” the proceeds of criminal activity into new cryptocurrency ecosystems, all to obfuscate the nature, source, control, and ownership of those proceeds.”","The USSS managed to link the seized funds to victim reports.","Acting Assistant Attorney General Nicole M. Argentieri of the Justice Department’s Criminal Division commented that this was a “significant seizure” that helped authorities disrupt “the financial infrastructure of an organized network of scammers who stole millions from victims across the country.”","These international scammers, said Argentieri, trick ordinary investors through websites that promise investments would make them money. But they just steal victims’ crypto and run.","Even if the current state of the crypto ecosystem “may seem like an ideal way to launder ill-gotten gains,” Argentieri warned, law enforcement “will continue to develop the expertise needed to follow the money and seize it back for victims.”","Learn more: Gold Smugglers in Nepal Caught Exchanging 33kg of Gold for Tether USDT Stablecoin"],"entity":[{"type":"Nicole M. Argentieri","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Argentieri","content":"PERSON"},{"type":"Ramsey","content":"PERSON"},{"type":"Nepal","content":"LOCATION"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"United States Secret Service","content":"ORGANIZATION"},{"type":"Ismail J. Ramsey","content":"PERSON"},{"type":"$9 million","content":"MONEY"},{"type":"the Justice Department’s Criminal Division","content":"ORGANIZATION"},{"type":"United States Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"}],"hashtag":["Crime","Fraud","Scam","Tether","USA","USDT"],"authors":["Sead Fadilpašić"]}