{"summary":"Crypto Derivatives Platform Bitget Launches ‘Smart Portfolio’ Bot to Boost Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-derivatives-platform-bitget-launches-smart-portfolio-bot-boost-returns.htm","publishDate":"2023-09-26T14:46:00","id":21036,"type":null,"title":"Crypto Derivatives Platform Bitget Launches ‘Smart Portfolio’ Bot to Boost Returns","category":["Blockchain News "],"content":["Crypto derivatives exchange Bitget has launched a new intelligent bot – Smart Portfolio – which allows users to rebalance assets based on price volatility, in a move to boost profits.","Rebalancing a crypto portfolio effectively is important to manage risks, trade in line with investment objectives, and potentially increase returns. The bot promises to empower traders and investors with dynamic portfolio management capabilities, a company release wrote.","“The launch of our Smart Portfolio bot exemplifies Bitget’s mission to keep providing innovative solutions that make crypto investing smarter,” Gracy Chen, Managing Director at Bitget, said."," Bitget’s Smart Portfolio bot promises to,","“This dynamic rebalancing aims to increase overall portfolio value over time versus simply holding assets,” Bitget added.","Furthermore, the company noted that the bot constantly eyes short-term price gains and acts swiftly to lock the price before the value slumps. After locking the price, the bot reinvests those funds into undervalued coins poised to rally.","“This mechanism can steadily increase the total quantity of cryptocurrency assets held over time,” it said.","There would be two rebalancing modes that are curated to their investment strategy, which users can choose from. These include percentage-of-portfolio rebalancing and calendar rebalancing.","When the percentage of allocation of digital assets deviates due to a change in market capitalization, percentage-of-portfolio mode is prompted, to give better coin proportions. On the other hand, calendar rebalancing refers to time-based adjustments that occur at fixed intervals.","“The intelligent bot analyzes price momentum and volatility to determine the optimal times to rebalance under both modes. Its algorithms aim to maximize returns from portfolio rebalancing based on market conditions.”",""],"entity":[{"type":"Gracy Chen","content":"PERSON"},{"type":"Smart Portfolio bot","content":"ORGANIZATION"},{"type":"Bitget","content":"LOCATION"}],"hashtag":["Bitget","CRYPTO","Derivatives","Trading"],"authors":["Sujha Sundararajan"]}