{"summary":"Bitcoin&#x27;s block halving is expected to occur in May. Some crypto exchanges told The Block that the event could bring new users to the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61133\/what-crypto-exchanges-are-saying-about-the-upcoming-bitcoin-block-reward-halving","publishDate":"2020-04-07T11:35:37","id":2103,"type":null,"title":"What crypto exchanges are saying about the upcoming bitcoin block reward halving","category":["BITCOIN"],"content":["The bitcoin block reward halving – a hotly-anticipated event during which the amount of BTC produced with each new transaction block will fall from 12.5 BTC to 6.25 BTC – is expected to occur next month.","The event takes place roughly every four years and is intended to ensure the scarcity of bitcoin, with the total planned supply of bitcoin fixed at 21 million coins.","The Block reached out to top crypto exchanges for their perspectives on the halving. According to those we heard from, one expected outcome is the arrival of new market participants.&nbsp;","\"Historically, we have seen a price surge in the 1.5 years after the halving, so it's highly possible we'll see new entrants in the market,\" Dave Ripley, chief operating officer at Kraken, told The Block.","Paxful co-founder and CEO Ray Youssef echoed Ripley's thoughts, saying that there has been an \"unprecedented surge in demand and price in the aftermath of the past two halvings. Though it would be hard to say, of course, if the past patterns will hold true, [it will bring new users in the market].\"","In the two previous halvings – November 2012 and July 2016 – the bitcoin price increased over 8,000% and 600%, respectively, within the one-year period, according to data from CoinMetrics complied by The Block Research.","","","Crypto exchange Gemini also said that \"we do expect more people will look at bitcoin, and recognize the halving event as a stark — and compelling — juxtaposition to the quantitative easing policies being favored by the U.S. Federal Reserve and other central banks.\"","OKEx's director of financial markets, Lennix Lai, on the other hand, said bitcoin halving could be understood as \"quantitative tightening\" on crypto.","\"We expect the competition among miners would be getting intense. Whilst the most efficient miners shall prevail, we believe there would be a surge in demand for miner-oriented financial products which would assist miners to manage their price risk and expected cash outflow,\" said Lai.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNon-custodial crypto exchange KyberSwap's head of products Sunny Jain said the halving could result in an overall increase in demand for bitcoin, which will likely result in increased volumes for bitcoin-pegged tokens such as WrappedBTC.&nbsp;","Other exchanges said bitcoin halving could be a non-event if the coronavirus pandemic situation continues. The halving event is \"likely to be overshadowed,\" Bitstamp told The Block, though it will \"certainly influence\" the market over the long-term.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2012","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Dave Ripley","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lennix Lai","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"600%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Jain","content":"PERSON"},{"type":"Ripley","content":"PERSON"},{"type":"8,000%","content":"PERCENT"},{"type":"July 2016","content":"DATE"},{"type":"Lai","content":"PERSON"},{"type":"Ray Youssef","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}