{"summary":"Grassroots Sports Body Accountancy Chief Says She Stole Public Funds to Pay for Bitcoin","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/grassroots-sports-body-accountancy-chief-says-she-stole-public-funds-pay-for-bitcoin.htm","publishDate":"2022-07-22T20:00:00","id":21047,"type":null,"title":"Grassroots Sports Body Accountancy Chief Says She Stole Public Funds to Pay for Bitcoin","category":["Bitcoin News "],"content":[" ","A South Korean local government official in charge of managing public funds for grassroots sports has admitted to embezzling over USD 367,000 worth of tax payers’ money – which she says she and her husband spent on crypto investments and internet gambling.","KBC reported that the police are now processing the unnamed official’s case in the city of Mokpo, South Jeolla Province, in the southwest of the country.","The woman appears to be an employee of the Mokpo Sports Council, which pays the operating costs of a whole host of sports teams in the city – mostly amateur and semi-professional. The council also pays for the upkeep of facilities such as running tracks, football pitches, and basketball courts – and helps support young athletes in the Mokpo area.","But, the media outlet reported, council officials recently began noticing issues with its budget, and traced the problems back several months.","Officials discovered an irregular and unfamiliar set of deposits and withdrawals made from the budget, with an inordinate amount of money chalked off as “expenses.” When one senior employee on the council’s accounting team stopped turning up at work shortly after, the police questioned her on suspicion of embezzlement. During the questioning, she reportedly made a full confession, stating that she had “stolen public funds” on 20 occasions, beginning in March 2022.","She had access to funds set aside to pay labor costs, as well as funds that were to be allocated as subsidies to teams and individual athletes.","Police say the woman then transferred these funds to an account belonging to her husband – and that the duo then proceeded to spend the money on cryptoassets and betting sites.","The woman was quoted as stating that some of the money had gone to fund a number of bitcoin (BTC) investments.","The incident appears to have left the council financially crippled, and the council was quoted as explaining that it was not able to pay coaches and other staff their monthly salaries as a result.","The woman was said to have bypassed “internal monitoring systems” and exploited known “loopholes.”","The Mokpo City Government said that it had requested an audit from the Jeollanam-do Sports Council, which polices sport-related spending in the wider South Jeolla Province. The city is concerned that the Mokpo Sports Council handling of local government subsidies may have contravened official regulations.\n___\nLearn more: \n– Crypto CEO Appeals 25-year Prison Term for Pushing Girlfriend out of 19th-floor Window\n– Mixers Receiving ‘More Cryptocurrency than Ever in 2022’ – Chainalysis\n\n– Venezuelan Crime Gang Was ‘Stealing Crypto from Retirees’\n– Uniswap Users Fall Victim to a USD 8M NFT Phishing Attack, Binance Pulls False Alarm"],"entity":[{"type":"Jeollanam","content":"PERSON"},{"type":"Uniswap Users Fall Victim","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"USD 8M NFT Phishing Attack","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Mokpo","content":"LOCATION"},{"type":"Mokpo Sports Council","content":"ORGANIZATION"},{"type":"Mokpo City Government","content":"ORGANIZATION"},{"type":"Binance Pulls False Alarm","content":"ORGANIZATION"},{"type":"South Jeolla Province","content":"LOCATION"},{"type":"March 2022","content":"DATE"}],"hashtag":["Bitcoin","Crime","Investing","South Korea"],"authors":["Tim Alper"]}