{"summary":"Major Russian Companies ‘Will Be Forced to Accept Digital Ruble Payments’","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/major-russian-companies-will-be-forced-to-accept-digital-ruble-payments.htm","publishDate":"2024-03-11T03:00:03","id":21042,"type":null,"title":"Major Russian Companies ‘Will Be Forced to Accept Digital Ruble Payments’","category":["Altcoin News "],"content":["Major Russian companies will be forced to accept digital ruble payments as of October 2026, a new report has claimed.","Per the news agency Interfax, smaller firms will likely have to follow suit and accept the CBDC by October 2027.","Interfax said a “source familiar with the situation” confirmed that government and Central Bank officials want to amend the nation’s law “on the protection of consumer rights.”","The source also claimed that the first batch of firms would comprise vendors (including data and service providers) with an annual revenue of above $330,000.","This group must begin accepting CBDC pay no later than October 1, 2026. Companies with an annual revenue of $220,000 to $330,000 will have an additional year to adopt.","However, smaller firms may be exempt from the new rules. The media outlet noted that companies with an annual revenue of under $55,000 will not be obliged to accept CBDC payments at all.","The bank and the Kremlin have prior form. They used a “similar approach” to the Mir payments system, which debuted in 2017.","The amendment will also be bundled with provisions for the Faster Payments System (SBP), another Central Bank project.","In the bank’s own words, SBP “allows individuals to instantly transfer funds to each other using mobile phone numbers, pay for purchases, pay utility bills, and make a wide variety of other transfers.”","Larger firms will need to adopt SBP pay by October 1 this year. Medium-sized companies will be given until October 1, 2025.","Interfax reported that it had seen an accompanying note from the Central Bank that read:","“This bill provides for a staged approach. It will provide merchants with the ability to make payments using SBP and digital rubles. And it will let merchants prepare for the implementation of the requirements of the bill.”","The bank further enthused:","“We took a similar approach to introduce the mandatory acceptance of Mir payment cards and this proved effective.”","The amended bill is yet to pass before lawmakers, but the idea that CBDC acceptance “may become mandatory” is a major departure for the Central Bank.","The bank has previously insisted that individuals will be free to choose whether or not they want to use the digital ruble.","Russia’s growing trade with China has helped its economy withstand Western sanctions. Now Moscow is preparing to spend billions to upgrade its vast eastern railroads to speed up the burgeoning cooperation https:\/\/t.co\/nY5gqTPlIG","— Bloomberg Economics (@economics) March 7, 2024","","There are also suggestions that the public is wary of the Central Bank coin. A Moscow-based business operator told Cryptonews.com, on condition of anonymity:","“I don’t really see why the digital ruble is necessary. I’m not opposed to it in principle. It may prove to be a good idea in the long term. But I have no idea how it’d help me or my business at this point.”","However, some analysts have suggested that the bank is already preparing to issue mandatory CBDC pension and benefits payments – despite its insistence to the contrary.","The Central Bank suggested that its current focus is adoption among major Russian companies.","CBDC B2B transfers will be subject to 0.3% commission fees, while transfers between individuals will be commission-free.","The bank reportedly said that its new move “is aimed at promoting competition, improving the quality and availability of payment services, and scaling settlements in digital rubles.”","📴 Apple has suspended its Apply Pay service for Russia's Mir card payment system, closing a loophole that had allowed Russians to keep using the digital payment service.","Apple initially restricted the use of Apple Pay in Russia on March 1https:\/\/t.co\/x00mZAo75U pic.twitter.com\/0YH3yrZgoZ","— The Telegraph (@Telegraph) March 25, 2022","","The bank has further reportedly claimed that the “adoption of the law will also allow merchants to reduce costs for payment services.”","Per official figures, 1.5 million Russian firms had adopted SBP payment infrastructure by the end of 2023. This figure is a sharp rise from the 560,000 SBP-adopting companies reported in 2022.","A “second group of 17 banks” is poised to join the CBDC pilot, along with “several tens of thousands of firms and individuals,” later this year."],"entity":[{"type":"$220,000","content":"MONEY"},{"type":"Bloomberg Economics","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Kremlin","content":"ORGANIZATION"},{"type":"Central Bank coin","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"October 2027","content":"DATE"},{"type":"October 2026","content":"DATE"},{"type":"March 7, 2024","content":"DATE"},{"type":"0.3%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Moscow","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"March 25, 2022","content":"DATE"},{"type":"October 1, 2026","content":"DATE"},{"type":"$330,000","content":"MONEY"},{"type":"$55,000","content":"MONEY"},{"type":"October 1, 2025","content":"DATE"},{"type":"October 1 this year","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Interfax","content":"ORGANIZATION"}],"hashtag":["CBDC","Russia"],"authors":["Tim Alper"]}