{"summary":"Magic Eden, Solana’s biggest NFT platform, has added Polygon NFT minting and trading support. \nThe move comes after several changes to bolster the platform’s blockchain gaming functionality. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195404\/magic-eden-bolsters-gaming-support-by-adding-polygon-nft-minting-and-trading","publishDate":"2022-12-15T12:03:13","id":2104,"type":null,"title":"Magic Eden bolsters gaming support via Polygon NFT minting and trading","category":["Gaming"],"content":["Magic Eden, Solana's biggest NFT platform, now supports Polygon NFT minting and trading.&nbsp;","Magic Eden extended support for the Polygon network on <a href=\"https:\/\/www.theblock.co\/post\/189035\/magic-eden-expands-nft-support-to-polygon-network-embargo-9-am-et\" data-v-f87c67ca=\"\">Nov. 22<\/a> in an effort to add multi-chain functionality and future possibilities for blockchain gaming. Polygon is an Ethereum layer-2 protocol that undergirds many popular blockchain-based games such as The Sandbox.","The new support will allow for a framework for more blockchain-based games on Magic Eden, with new gaming brands joining the platform including Shatterpoint and Infinite Drive. Taunt Battle World, Planet Mojo and Kakao Games will follow in 2023.&nbsp;","\"We’re excited to officially bring our snappy, seamless NFT minting and trading platform experience to Polygon,\" said Magic Eden COO Zhuoxun Yin in a statement. \"Having projects with strong development teams and IPs, like Shatterpoint and Infinite Drive with Aston Martin, makes this integration even more meaningful by allowing us to reach a wider set of audience.\"","Magic Eden recently <a href=\"https:\/\/www.theblock.co\/post\/193083\/magic-eden-hires-its-first-chief-gaming-officer\" data-v-f87c67ca=\"\">hired<\/a> Chief Gaming Officer Chris Akhavan, a game industry veteran formerly at the blockchain gaming startup Forte, to build out its web3 gaming endeavors. Magic Eden has over 50 gaming projects on the platform, with $2.3 billion in total NFT trades amassed to date, according to a Magic Eden spokesperson.","Weekly trading volume for web3 gaming NFTs comes in at $11.5 million, an 88.5% decrease compared to the same time last year, according to The Block's Data Dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/gaming-nft-trade-volume\/embed\" title=\"Gaming NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["MAGIC EDEN"]}