{"summary":"Ethereum’s Vitalik Buterin Raises Concerns Over Worldcoin’s Launch and Design Flaws","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereums-vitalik-buterin-raises-concerns-over-worldcoins-launch-design-flaws.htm","publishDate":"2023-07-25T12:05:00","id":21041,"type":null,"title":"Ethereum’s Vitalik Buterin Raises Concerns Over Worldcoin’s Launch and Design Flaws","category":["Blockchain News "],"content":["Ethereum co-founder Vitalik Butrein published a blog raising concerns on the recently launched Worldcoin human identity verification system.","Exploring Sam Altman’s project Worldcoin and its operational mechanics, Buterin delved into the broader concepts, including the proof-of-humanity approach.","Worldcoin, alongside other identity solutions like Proof of Humanity, BrightID, Idenam, and Circles, holds the belief that the progress of artificial intelligence (AI) will progressively blur the lines between human and machine, posing significant challenges in differentiation.","Worldcoin offers a unique “digital passport” to its users that allows them to prove they’re human, and not a bot. ","This massive catalog is achieved through the use of Orbs, machines that scan a person’s eyeball to create a World ID.","What do I think about biometric proof of personhood?https:\/\/t.co\/yozo1buW24","While agreeing that this system of proof of personhood which Worldcoin offers is valuable to solving “anti-spam and anti-concentration-of-power problems, he also added that it brings major risks as well. Buterini wrote:","“If proof of personhood is not solved, decentralized governance becomes much easier to capture by very wealthy actors, including hostile governments.”","However, Buterin also pointed out that if a system like Worldcoin continues to decentralize as promised, it will avoid “dependence on centralized authorities and reveal the minimal information possible.”","The Ethereum co-founder’s first concern was related to privacy—and the act of scanning someone’s iris.","Buterin feared this could capture much more data than met the eye, including a person’s sex, ethnicity, and even certain medical conditions.","Buterin also expressed concerns over accessibility and centralization within the Worldcoin Foundation and security. ","According to the latest figures from Worldcoin, as the year progressed, they had made 1,500 Orbs accessible in 35 global cities, leading to a significant surge in the total number of weekly registrations from 40,000 to 200,000 individuals.","In total, Worldcoin estimated that two million people had already signed up for a World ID.","However, Buterin expressed skepticism saying, “Even with much higher-scale distributed manufacturing, it would be hard to get to a world where there’s an Orb within five kilometers of everyone.”","In his concluding remarks, Buterin emphasized his belief that a world without proof-of-personhood presents its own set of risks and potential dangers. ","He acknowledged that constructing a resilient system would be neither straightforward nor swift.","“I definitely do not envy the people undertaking this task, and it will most likely require several years to discover a formula that proves effective.” ",""],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Idenam","content":"LOCATION"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Vitalik Butrein","content":"PERSON"}],"hashtag":["Ethereum","Vitalik Buterin"],"authors":["Jai Pratap"]}