{"summary":"IMF Director Urges Institutions to Look Toward CBDCs, Highlights Cross-border Utility","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/imf-director-urges-institutions-to-look-toward-cbdcs-highlights-cross-border-utility.htm","publishDate":"2023-11-15T12:30:24","id":21056,"type":null,"title":"IMF Director Urges Institutions to Look Toward CBDCs, Highlights Cross-border Utility","category":["Blockchain News "],"content":["The managing director of the International Monetary Fund (IMF) Kristalina Georgieva has publicly praised the deployment of Central Bank Digital Currencies (CBDCs) by more countries.","Speaking at the Singapore FinTech Festival, on the theme “Financial Inclusion as a Pathway to Resilient and Shared Growth,” she urged institutions in both the public and private sectors to gear up efforts to integrate CBDCs in the future.","The IMF seeks to extend financial inclusion and reduce gender and geographic disparities as it continues to expand current templates to address economic challenges. ","A seemingly modern approach to problems in most countries is the integration of CBDCs in the financial system making it possible to track financial transactions, expand the tax net, and encourage faster cross-border settlement. ","“To the extent CBDCs are deployed, they must be built to facilitate cross-border payments, which are at present expensive, slow, and available to few. Again, we must start this work today so we don’t have to backpedal tomorrow.”","Georgieva noted the roles CBDCs would play in the technology behind financial institutions, adding that more adoption would be beneficial to all parties. Apart from cross-border payments which have been a mainstream issue for digital currencies, they can improve personal data protection and partner with Artificial Intelligence (AI) firms to create the perfect currency.","Contrary to these arguments, data protection agencies in Europe and other jurisdictions have questioned the role of CBDC in monitoring citizens calling on a review of their proposed template to limit data collection.","The IMF director also made a case for the unbanked in certain countries tipping digital currencies to not only aid financial inclusion but to be an alternative to cash in the long run. It can co-exist with private cash being a safer, and cost-friendly alternative.","There will be a need to strike a balance if mass adoption occurs because digital currencies will not replace cash as many proponents have stressed in recent times.","While several countries have passed multiple legislation around CBDCs and made policy changes, Georgieva opines that we are not yet at the desired level adding, “We have not reached the land.” ","“Adoption of CBDCs is nowhere close. But about 60 percent of countries are exploring them in some form today.”","The IMF has supported several countries in their efforts toward Central Bank digital currencies. The Fund shares its handbook on strategies for developing CBDC focusing on assessing risk factors within countries, drawing up regulations, onboarding stakeholders, and international collaboration.","It also proposed a risk assessment matrix for financial authorities and prepared a joint Synthesis Paper with the Financial Stability Board which was adopted by the G20 last month.","🔗 G20 Leaders Decide on Swift Implementation of Crypto Asset Reporting Framework","G20 leaders have called to swiftly implement the Crypto Asset Reporting Framework (CARF) while endorsing the synthesis paper proposed by IMF and FSB.#CryptoNews #G20https:\/\/t.co\/22tUeuHJh7","— Cryptonews.com (@cryptonews) September 11, 2023","",""],"entity":[{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"G20","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"IMF","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Artificial Intelligence (","content":"ORGANIZATION"},{"type":"Kristalina Georgieva","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"60 percent","content":"PERCENT"},{"type":"FSB","content":"ORGANIZATION"},{"type":"Singapore FinTech Festival","content":"ORGANIZATION"},{"type":"September 11, 2023","content":"DATE"},{"type":"Georgieva","content":"PERSON"},{"type":"G20 Leaders Decide on Swift Implementation of Crypto Asset Reporting Framework","content":"ORGANIZATION"},{"type":"Financial Stability Board","content":"ORGANIZATION"},{"type":"“Financial Inclusion","content":"ORGANIZATION"}],"hashtag":["CBDC","IMF"],"authors":["David Pokima"]}