{"summary":"South Korean Crypto Exchange CEO to Serve 25 Years in Jail After Appeal Fails","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-crypto-exchange-ceo-serve-25-years-jail-after-appeal-fails.htm","publishDate":"2022-12-02T10:30:00","id":21062,"type":null,"title":"South Korean Crypto Exchange CEO to Serve 25 Years in Jail After Appeal Fails","category":["Bitcoin News "],"content":["The CEO of a South Korean crypto exchange who was found guilty of murdering his lover by stabbing her and pushing her out of a 19th-storey apartment window has had his appeal rejected – and will serve 25 years in prison.","The 33-year-old man was convicted back in July, but chose to appeal the initial verdict. The court at the time heard that the unnamed accused attacked his (also unnamed) lover (aged in her 20s) in November 2021 while under the influence of narcotics. The man’s lover, the court heard, had approached the CEO telling him she wanted to end their relationship.","Newspim reported that the CEO’s legal team had pleaded for the crime to be downgraded to manslaughter, stating that he was “mentally and physically weak” at the time of the crime, and told the court that he “had been receiving psychiatric treatment for a long time.”","“While receiving psychiatric treatment,” the defense claimed, the CEO had “complained of lethargy and expressed difficulty in controlling his impulses.”","But the appeals court judge at the Seoul High Court rejected the claim. The judge stated that the CEO was working in the high-pressure field of “virtual currency at the time of the crime.”","The judge said:","“It seems that the defendant was in possession of normal judgmental abilities in relation to his work in the cryptoasset sector.”","The court also heard evidence that the man attacked his lover with a knife before eventually pushing her to her death, stabbing her multiple times.","The CEO, the court heard, first attacked the woman with the knife. But when she screamed during this gruesome attack, he drew her toward the window “in an effort to prevent people from realizing what he was doing.” He then pushed her from the window, in an apparent bid to make the death look like an accident.","In sentencing, the judge stated:","“The defendant was in full control of his actions at the time of the incident. It doesn’t seem like his actions were impeded in any way [by his mental or physical state]. The crime committed by the accused is murder, and the punishment must be severe.”","The CEO was also fined $2,350. The court also heard that the man had developed a “serious” drug habit and had taken narcotics including ketamine."],"entity":[{"type":"Seoul High Court","content":"ORGANIZATION"},{"type":"$2,350","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"November 2021","content":"DATE"}],"hashtag":["Legal","South Korea"],"authors":["Tim Alper"]}