{"summary":"Breaking News: SafeMoon Executives Charged by SEC for ‘Massive Fraudulent Scheme’ and Unregistered Offering of Crypto Securities","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/breaking-news-safemoon-executives-charged-by-sec-for-massive-fraudulent-scheme-and-unregistered-offering-of-crypto-securities.htm","publishDate":"2023-11-01T17:39:21","id":21066,"type":null,"title":"Breaking News: SafeMoon Executives Charged by SEC for ‘Massive Fraudulent Scheme’ and Unregistered Offering of Crypto Securities","category":["Blockchain News "],"content":["The US Securities and Exchange Commission (SEC) just charged crypto project SafeMoon and its top executives for “perpetrating a massive fraudulent scheme” through the unregistered sale of crypto asset security SafeMoon (SFM).","As per a press release on the SEC’s website, the agency accuses SafeMoon executives of promising to pump the price of the token “safely to the moon”, but instead wiping out billions in market capitalization and making off with more than $200 million in project funds.","The agency claims these misappropriated investor funds were taken for personal use.","As per the SEC’s complaint, in marketing the SafeMoon crypto token, its creator Kyle Nagy assured investors that funds were safely locked and could not be withdrawn by anyone while held in SafeMoon’s liquidity pool, a collection of investor funds that provide liquidity to facilitate trading in the asset.","However, the SEC alleges that large portions of the funds in the liquidity pool were never locked, and the SafeMoon executives misappropriated millions of dollars to purchase McClaren cars, extravagant travel, luxury homes, and other things.","Alongside SafeMoon’s creator Kyle Nagy, the SEC is also charging the project’s CEO John Karony and CTO Thomas Smith.","As per the SEC’s website, the defendants are charged with violating the registration and anti-fraud provisions of the Securities Act of 1933 and the anti-fraud provisions of the Securities Exchange Act of 1934.","SFM is down nearly 25% in the past 24 hours in wake of news of the SEC new lawsuit, as per CoinGecko.","SafeMoon enjoyed a spectacular start to life after its initial launch in March 2021.","In the space of a few weeks, the project’s cryptocurrency SFM had rallied by more than 2,000% to eventually hit an all-time high of $5.75 billion in May 2021.","The cryptocurrency was all the rage at the time, enjoying huge hype on social media and celebrity endorsements amid the promise of huge, guaranteed returns.","However, things quickly turned sour.","Despite the launch of a version two of its token that promised to enhance SFM’s quality, security and accessibility, SFM has been on a downwards path ever since May 2021.","As per CoinGecko, its market cap was last slightly less than $100 million, meaning it has lost more than 98% of its value since its peak.","According to the SEC, a significant plunge in the token’s price occurred after the market realized that SafeMoon’s decentralized exchange (DEX) liquidity pool wasn’t locked as claimed.","The SEC accuses SafeMoon executives Karony and Smith of misappropriating funds from the liquidity pool to prop up the token’s price and manipulate the market, as well as conduct so-called “wash trading” to inflate the cryptocurrency’s trading volumes.","In its complaint against SafeMoon and the project’s executives, the SEC also made broad criticisms of the fast-growing Decentralized Finance (DeFi) industry in general.","“Decentralized finance claims to deliver transparency and predictable outcomes, but unregistered offerings lack the disclosures and accountability that the law demands, and they attract scammers like Kyle Nagy, who use these vulnerabilities to enrich themselves at the expense of others,” commented head of the SEC’s Crypto Assets and Cyber Unit enforcement division David Hirsch.","Jorge G. Tenreiro, Deputy Chief of the Crypto Assets and Cyber Unit enforcement division urged “investors to continue to exercise extreme caution in this space, as fraudsters exploit the popularity of crypto assets to promise astronomical profits while all too frequently only delivering a crash landing”."],"entity":[{"type":"SafeMoon executives misappropriated millions of dollars","content":"MONEY"},{"type":"$5.75 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Smith","content":"PERSON"},{"type":"SFM","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"2,000%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"Thomas Smith","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"1934","content":"DATE"},{"type":"Decentralized Finance (DeFi","content":"ORGANIZATION"},{"type":"Crypto Assets","content":"ORGANIZATION"},{"type":"Karony","content":"PERSON"},{"type":"David Hirsch","content":"PERSON"},{"type":"SafeMoon","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"1933","content":"DATE"},{"type":"Kyle Nagy","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"John Karony","content":"PERSON"},{"type":"Securities Exchange","content":"ORGANIZATION"},{"type":"McClaren","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Jorge G. Tenreiro","content":"PERSON"}],"hashtag":["Scam","SEC"],"authors":["Joel Frank"]}