{"summary":"IDEX, one of Ethereum’s oldest decentralized exchanges, is developing its own Layer 2 chain named Xchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238140\/idex-unveils-a-zkevm-layer-2-chain-based-on-polygon-supernets","publishDate":"2023-07-06T12:03:22","id":2106,"type":null,"title":"IDEX unveils zkEVM Layer 2 chain based on Polygon Supernets","category":["CRYPTO ECOSYSTEMS"],"content":["IDEX, one of the oldest decentralized cryptocurrency exchanges on Ethereum, announced plans to build a Polygon zkEVM-based Layer 2 chain named Xchain. Currently in the testnet phase, the blockchain is being developed based on zkEVM from Polygon’s Supernets software stack and aims to offer a decentralized perpetual trading platform.","Polygon’s Supernets enables developers to build customizable app-chains that can operate as either sidechains or Layer 2 chains. In the case of IDEX, it’s the latter.","IDEX will also integrate Polygon’s <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" data-v-f87c67ca=\"\">zkEVM<\/a> technology to function as a Layer 2 network, deriving its security from Ethereum.","Founded in 2017, IDEX was counted as one of the most notable decentralized exchanges on Ethereum between 2017 and 2019, alongside other DEXs like <a href=\"https:\/\/www.theblock.co\/linked\/40562\/two-suspects-in-etherdelta-hack-indicted-by-u-s-authorities\" data-v-f87c67ca=\"\">EtherDelta<\/a>. However, the advent and subsequent popularity of automated market makers, starting with <a href=\"https:\/\/www.theblock.co\/linked\/148465\/dex-protocol-uniswap-hits-1-trillion-cumulative-trading-volume\" data-v-f87c67ca=\"\">Uniswap<\/a>, led to a decrease in IDEX’s competitive advantage. Now, IDEX is looking to reinvent itself with its own Layer 2 network.","“Throughout the six years of our company history our development has focused on matching the performance and user experience of centralized exchanges,” said Alex Wearn, co-founder and CEO at IDEX. \"Xchain represents the final piece necessary to go head-to-head with centralized exchanges.”","IDEX <a href=\"https:\/\/www.theblock.co\/post\/74153\/decentralized-exchange-idex-seed-funding-idex-2-0\" data-v-f87c67ca=\"\">raised<\/a> $2.5 million in seed funding round in 2020.","Xchain also aligns perfectly with Polygon's strategy of enabling existing crypto projects to create their own blockchains. In the past, the Polygon team has assisted projects in developing individual chains for <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" data-v-f87c67ca=\"\">Immutable<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Aavegotchi<\/a>, also created with Supernets.","“This is a great example of exactly the types of products we were envisioning when we built Polygon Supernets powered with zkEVM and Polygon zkEVM,” said Sandeep Nailwal, co-founder of Polygon. “We’re just at the beginning, but when others see what IDEX is able to do with this technology, we know they’re going to rush to implement it as well.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"IDEX","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Alex Wearn","content":"PERSON"}],"hashtag":["DEXS"],"authors":["Vishal Chawla","The Block"]}