{"summary":"A vice governor of the People’s Bank of China has said the country regards bitcoin and stalecoins as crypto assets – not as currencies – and hence they are investment alternatives.\n\nUntil the PBoC figures out what it needs to prevent these assets from creating serious financial risk, it will maintain the regulatory status quo, he said.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102044\/pboc-bitcoin-crypto-asset-investment-alternative","publishDate":"2021-04-19T03:00:37","id":2108,"type":null,"title":"PBoC official says China regards crypto assets as investment alternatives","category":["China"],"content":["A vice governor of the People's Bank of China (PBoC) has said the country regards bitcoin and stalecoins as crypto assets – not currencies – and hence they are investment alternatives.","Li Bo, a recently appointed deputy governor of the Chinese central bank, said during the Bo'Ao Asia Forum event that until the PBoC figures out what kind of regulatory requirements it needs to prevent the speculative nature of such assets from creating any serious financial stability risk, it will keep its current stance on the asset class.","Li <a href=\"https:\/\/i.ifeng.com\/c\/85Y91v4fx1I\" data-v-f87c67ca=\"\">made the remark in English<\/a> in a panel discussion on the overall topic of central bank digital currency on Sunday night China time. He was joined by Zhou Xiaochuan, the former governor of the PBoC, Agustín Carstens, the general manager of the Bank for International Settlements, as well as executives from Thailand's central bank and SWIFT.","Li's comment was in response to the question brought up by the moderator Arjun Kharpal, a senior correspondent at CNBC, on whether China will maintain a tough stance on crypto trading activities going forward.&nbsp;","\"We regard bitcoin and stablecoins as crypto assets. Crypto assets, as Agustin just discussed, these are investment alternatives, they are not currency per se. The main role we see for crypto assets, going forward, their main role is investment alternative,\" he said, adding:","The Chinese central bank issued a ban in 2017 on initial coin offering activities and ordered domestic crypto exchanges to stop the fiat on- and off-ramp channel for investors.","The main thinking was that no centralized crypto exchanges should be allowed to be a banking custodian of the Chinese yuan on behalf of their customers. Since then, exchanges like Huobi and OKEx could only have crypto-to-crypto order books while offering over-the-counter desks as a fiat on-ramp method for users.","In addition, Li's comment on stablecoins was also in line with other central bank executives that a strong regulation needs to be in place.","\"For stablecoins, they are crypto assets, and if they want to be accepted widely as a payment solution, we need stronger regulations, stronger than bitcoin maybe, in the sense, something like a currency board,\" he said. \"Going forward, I think stablecoin, which may have the vision to become a widely accepted payment solution, has to be regulated like a bank or a quasi-bank.\"&nbsp;","Elsewhere in his remark, Li <a href=\"https:\/\/6do.news\/article\/3945632-41\" data-v-f87c67ca=\"\">said<\/a> China is on track to widen the adoption of its central bank digital currency, known as the e-CNY or DC\/EP.","He added that during the upcoming Winter Olympics in 2022, the e-CNY will not only be open to domestic users, but also foreign consumers and international guests. But Li said the internationalization of Renminbi is not meant for replacing the dollars.","\"Our goal is absolutely not to replace the U.S. dollars or any other international currency. Our goal is to let the market to choose,\" he said."],"hashtag":["BITCOIN"]}