{"summary":"South Korean Police, Prosecutors Quadruple Spending on Crypto Monitoring Tools","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-police-prosecutors-quadruple-spending-crypto-monitoring-tools.htm","publishDate":"2022-12-01T10:30:00","id":21086,"type":null,"title":"South Korean Police, Prosecutors Quadruple Spending on Crypto Monitoring Tools","category":["Bitcoin News "],"content":["South Korean police and prosecutors have quadrupled the amount of money they are spending on crypto monitoring tools in the past 12 months. ","Per Chosun Ilbo, law enforcers have spent some $2.4 million on crypto monitoring software and crypto-specific training for officers in the past year. Last year, that figure stood at $653,000.","Police forces across the country have been forming specialized crypto units, which has led to an increase in spending. But, the media outlet explained, officers now how tools that allow them to trace crypto transactions back to individual IP addresses.","They also have tools that allow them to monitor crypto transaction details in real-time, examine activity on exchanges, and verify “source information” on crypto remittances.","Part of the spending is likely attributable to the police force’s crackdown on crypto-powered drug trafficking.","Darkweb operators have been operating portals that allow buyers to find local dealers – and pay in bitcoin (BTC) for dead-dropped narcotics. While the dark web portals are still extant, police have had more luck finding and prosecuting dealers and drug buyers.","National Police Agency (NPA) statistics show that 1,174 of the 3,033 drug offenders arrested by the police between March to May this year used crypto to buy or sell narcotics. That represents an increase of some 32% in the same period in 2021.","The media outlet noted that the NPA had bought crypto tracking systems for its National Investigation Headquarters, its narcotics and organized crime investigation division, and its economic crime department.","Prosecutors have also been investing: the Supreme Prosecutor’s Office, the Seoul Central District Prosecutor’s Office, and the Seoul Eastern District Prosecutor’s Office have all bought crypto tracking solutions.","Customs officials have likely bought their own systems, too – as part of their own fight against illegal kimchi premium trading.","Additional expenditure has also been incurred by officers investigating the Terra ecosystem crash and the role Terraform Labs may have played in the incident. ","Police and prosecutors are also stepping up investigations into alleged attacks on domestic crypto targets that they suspect originate from North Korea."],"entity":[{"type":"$2.4 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"National Investigation Headquarters","content":"ORGANIZATION"},{"type":"$653,000","content":"MONEY"},{"type":"the Supreme Prosecutor’s Office","content":"ORGANIZATION"},{"type":"North Korea","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"Seoul Eastern District Prosecutor’s Office","content":"ORGANIZATION"},{"type":"Chosun Ilbo","content":"ORGANIZATION"},{"type":"NPA","content":"ORGANIZATION"},{"type":"Seoul Central District Prosecutor’s Office","content":"ORGANIZATION"},{"type":"March to May this year","content":"DATE"},{"type":"National Police Agency (NPA","content":"ORGANIZATION"}],"hashtag":["Police","South Korea"],"authors":["Tim Alper"]}