{"summary":"New Multichain Meme Coin Dogeverse Presale Smashes Through $10 Million","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-multichain-meme-coin-dogeverse-presale-smashes-through-10-million.htm","publishDate":"2024-04-24T09:40:57","id":21099,"type":null,"title":"New Multichain Meme Coin Dogeverse Presale Smashes Through $10 Million","category":["Price Predictions "],"content":["Wednesday, April 24, 2024 – Newcomer meme coin and multi-chain good boy Dogeverse ($DOGEVERSE) has rammed through its soft cap target ahead of schedule, taking in over $10 million along the way, in a presale that’s shaking up the saturated world of meme coins. ","The latest in crypto’s long line of Shiba Inu-inspired funny tokens has pricked the ears of meme fans, degens and crypto evangelists alike, who see its cross-chain capabilities as a hint of what tomorrow’s meme coins will look like. ","Currently priced at $0.000301 and due to rise in just under two days, Dogeverse has already sold out its soft cap allocation of 200 billion tokens after trending virally on launch. ","A meaty $1 million flooded the project barely 48 hours into its ICO, selling out of tokens allocated for the first two presale rounds and far exceeding the team’s initial expectation of a 6-day first round.  ","Fast forward one fortnight and Dogeverse has already moved onto the second half of its ICO a day ahead of schedule. A further 200 billion tokens will be sold to the public across five remaining rounds that close on June 11. ","The funds from these additional tokens, which would otherwise be sold on decentralized (DEX) or centralized (CEX) exchanges after the claim, will now be used for liquidity and buy-back funds.","Token holders can stake on Ethereum to earn passive rewards. ","The team is currently working towards CoinGecko and CoinMarketCap listing applications, while later DEX and CEX listings form part of the project roadmap.","But why exactly is everybody lapping up Dogeverse?","Let’s go! 🚀#DOGEVERSE raises over $10 Million! 💰","Another incredible milestone ticked off! ✅","Join #Cosmo on his multi-chain adventures! 🌌🐕 pic.twitter.com\/wNIPuHhplr","— DogeVerse (@The_DogeVerse) April 24, 2024","","It all started with Dogecoin (DOGE) back at the end of 2013. His adorable avatar didn’t need much selling because it was based on a viral meme that virtually anyone with a social media account had seen before. (Wow! Such meme! Very crypto!) ","Doge was followed by Shiba Inu (SHIB), Floki (FLOKI), Bonk (BONK), and DogWifHat (WIF). All of them reference original viral doge memes in some way, but none of them are inherently multi-chain. ","Dogecoin is its own proprietary network based on Bitcoin, and as another proof-of-work (PoW) blockchain, it eats up a lot of electricity to validate blocks and mine DOGE. ","Since then, Dogecoin’s competitors have either come from the most commercially important blockchain, Ethereum, or its nearest rival, Solana, both of which use less energy than Bitcoin and Dogecoin. ","Dogeverse is built on a multichain network spanning six chains, none of which deploy the PoW consensus mechanism. It is already live on Ethereum, BNB Smart Chain,  Polygon, Base and Avalanche. A Solana rollout is planned soon. ","At the center of the Dogeverse is our four-legged friend Cosmo. Born from a supernova, Cosmo discovered he had a unique ability: the power to hyper-jump across universes. ","Now, Cosmo wants to share the chain-leaping fun with his owners. ","🌟 Introducing #Cosmo, the remarkable #Doge born from stardust! 🌠","As the ambassador of #DOGEVERSE, Cosmo symbolizes liberty, ingenuity, and unity.","Embark with him on an adventure across the #Crypto cosmos, breaking barriers and venturing into uncharted territories together. 🚀 pic.twitter.com\/wzLatjuLMu","— DogeVerse (@The_DogeVerse) April 21, 2024","","As any holder will tell you, meme coins are some of crypto’s most volatile investments. This is because they have a tendency to exaggerate broader market-wide price movements. ","This means, for instance, that on days when investors are feeling risky and pumping Bitcoin, meme coins can often be found rallying harder. Conversely, a risk-off day in crypto may manifest itself in spiraling meme coin prices. ","Investors should be aware then, that meme coin performance is linked to crypto’s perpetual news cycle. That said, two immediate price drivers will have a strong relationship to Cosmo’s multi-chain Dogeverse.","The first is last Saturday’s Bitcoin halving. The halving slashes Bitcoin mining rewards in half, effectively choking the issuance of new BTC and helping drive prices higher. Halvings have historically catalyzed bull runs, and already we can see Bitcoin has risen steadily (3%) since the halving. ","","The second is May 23. That’s the SEC’s first deadline to respond to the latest round of applications for an Ethereum ETF. ","Many analysts see the date as the start of a potential Ethereum gold rush, and with Ethereum being crypto’s most commercially important blockchain, the whole ecosystem will benefit.","As will Layer 1 competitors like Solana and Avalanche and Layer 2s like Polygon, all of which are native to the Dogeverse.  ","So Cosmo is clean and green, with staking and seamless multi-chain fun. What’s not to love about crypto’s new hyper-jumping pupper?","Join the presale over on the Dogeverse website before the price rises in under two days. ","Social Channels: X (formerly Twitter) | Telegram",""],"entity":[{"type":"Wednesday, April 24, 2024","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"Bonk (BONK)","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Cosmo","content":"ORGANIZATION"},{"type":"Dogeverse","content":"PERSON"},{"type":"200 billion","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"$DOGEVERSE","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"May 23","content":"DATE"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"April 24, 2024","content":"DATE"},{"type":"Cosmo’s multi-chain Dogeverse","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"April 21, 2024","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$10 Million","content":"MONEY"},{"type":"Dogecoin (DOGE","content":"ORGANIZATION"},{"type":"$0.000301","content":"MONEY"},{"type":"June 11","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Dogeverse","Meme coin","MultiChain"],"authors":["Tim Hakki"]}