{"summary":"New White House Report Slams Digital Asset Industry – Regulation Incoming?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-white-house-report-slams-digital-asset-industry-regulation-incoming.htm","publishDate":"2023-03-22T15:52:00","id":21095,"type":null,"title":"New White House Report Slams Digital Asset Industry – Regulation Incoming?","category":["Blockchain News "],"content":["The digital asset industry has been slammed in a new report published by the White House, with many now fearing that even stricter regulations will be introduced in the US.","The report, titled the Economic Report of the President, had an entire 36-page chapter dedicated to the crypto industry. ","Among other things, it went to great lengths to debunk the “perceived appeal of crypto assets.”","It said that crypto functions as “mostly speculative investment vehicles” and described digital assets as volatile because “many of them do not have a fundamental value.”","Further describing the shortcomings of crypto, the White House report said the asset class has been “mostly about creating artificial scarcity in order to support crypto assets’ prices.”","“This raises the question of the role of regulation in protecting consumers, investors, and the rest of the financial system from panics, crashes, and fraud related to crypto assets,” it added.","The report also covered briefly the new FedNow digital payment network and central bank digital currencies (CBDCs), which it spoke about in more favorable terms.","The strong focus on crypto in the report took many in the community by surprise, with, for instance, Paradigm co-founder Fred Ehrsam pointing out that a whopping 15% of the report was “devoted to crypto FUD.”","15% of the annual White House Economic Report is devoted to crypto FUDhttps:\/\/t.co\/lQlAyXgfyJ pic.twitter.com\/RTZacgXSUg","Others took issue with how the report described crypto and Bitcoin (BTC) specifically as having no fundamental value, with Galaxy CEO Mike Novogratz suggesting the government could just refund him all the taxes he has paid on this supposedly worthless asset.","Maybe they should refund me all the taxes I have paid over the past 10 years on my crypto trading. 😂 They are wrong! $BTC is report card on the stewardship of the economy. And it’s rise is telling us something. https:\/\/t.co\/f4jVY7HiPg","Meanwhile, the general anti-crypto sentiment coming from the US government has likely led some in the community to believe that more regulation could be coming to the US.","Among those who have already taken steps to prepare for that scenario is Circle, the issuer of the popular stablecoin USDC, which just this week announced that it had applied for regulatory approval in France.","The announcement from Circle came as the company’s CEO, Jeremy Allaire, concluded a trip to Europe, where he also praised efforts by UK officials to make the country “a crucial global market for innovation in digital assets.”","Thanks Lord Johnson. UK has a tremendous opportunity to be a crucial global market for innovation in digital assets, stablecoins and internet native finance. @ddisparte https:\/\/t.co\/nfO1dl7UhS",""],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"France","content":"LOCATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Fred Ehrsam","content":"PERSON"},{"type":"Lord Johnson","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"White House Economic Report","content":"ORGANIZATION"},{"type":"past 10 years","content":"DATE"}],"hashtag":["CBDC","Regulation"],"authors":["Fredrik Vold"]}