{"summary":"Hong Kong Licensed Crypto Exchange Hashkey Operator Raises $100M With $1.2B Valuation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-licensed-crypto-exchange-hashkey-operator-raises-100m.htm","publishDate":"2024-01-16T04:25:41","id":21092,"type":null,"title":"Hong Kong Licensed Crypto Exchange Hashkey Operator Raises $100M With $1.2B Valuation","category":["Blockchain News "],"content":["In a recent funding round, HashKey Group, the operator of one of Hong Kong’s two licensed crypto exchanges, successfully raised close to $100 million with a valuation of over $1.2 billion.","Hashkey Group announced the completion of the series A funding round earlier today in a statement, revealing that both existing and new investors contributed to the substantial funding. However, the statement remained discreet about the specific identities of these investors.","The funds garnered are earmarked for the expansion of HashKey’s web3 ecosystem and the development of licensed products in the Hong Kong market, according to the company.","A notable participant in the funding round is reported to be OKX Ventures, the investment arm of the OKX digital-asset exchange, though representatives from both OKX and HashKey declined to comment on the matter.","","HashKey, deeply entrenched in various crypto-related activities such as operating a trading platform, venture funding, and asset management in Hong Kong and Singapore, is strategically positioning itself to leverage Hong Kong’s ambition to become a prominent digital asset hub.","As reported earlier, the company was in talks to raise funds between $100 million to $200 million in May, indicating a valuation surpassing the $1 billion mark.","The funding success is particularly significant in the context of the recent challenges faced by the crypto venture capital space, marked by a downturn in 2022 following market volatility and high-profile bankruptcies.","","As Hong Kong intensifies efforts to establish itself as a cutting-edge financial center, the city implemented a dedicated virtual-asset regulatory framework in June.","This move aims to attract crypto companies while prioritizing investor protection. Currently, HashKey Exchange, alongside BC Technology Group Ltd.’s OSL, stands as one of the only licensed platforms for crypto trading in Hong Kong.","While the city remains an attractive hub for crypto exchanges, questions linger about its long-term commitment to the sector, given its susceptibility to periodic scandals. HashKey Exchange, since its inception in 2018, has steadily grown its user base to over 155,000 registered users and reported a spot trading volume of approximately $16 million."],"entity":[{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"BC Technology Group Ltd.","content":"ORGANIZATION"},{"type":"Hashkey Group","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"$1 billion mark","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"HashKey Group","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"}],"hashtag":["Crypto Exchange","Hong Kong","Web3"],"authors":["Jai Pratap"]}