{"summary":"Open Finance protocol Synthetix teamed up with Paradigm-backed research group Optimism for a demo on Optimistic Rollup.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63751\/defi-synthetix-optimistic-rollout-smart-contracts-demo","publishDate":"2020-05-05T10:12:25","id":2109,"type":null,"title":"DeFi protocol Synthetix launches Optimistic Rollup demo to test smart contract scalability","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Open finance protocol Synthetix and research group Optimism have teamed up to launch a new demo for Optimistic Rollup, taking another step towards developing a full-fledged Ethereum Layer-2 scaling solution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two-week demo utilizes Optimistic Virtual Machine (OVM) – the virtual machine that Optimism built for its Optimistic Rollup solution – to test the smart contract scalability of the layer-2 solution. However, deposit and withdrawal from Ethereum mainchain to the OVM on layer 2 is not available at this time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/55520\/ethereum-scaling-startup-optimism-announces-alpha-release-of-its-virtual-machine\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">previously reported<\/span><\/a><span data-v-f87c67ca=\"\"> by The Block, Optimism's OVM is integrated with the same tooling and smart contract languages as those used on the Ethereum mainnet, allowing developers to deploy smart contracts on the Layer-2 solution as they appear on Layer 1. This feature is very attractive to Synthetix, as OVM can transfer all of the protocol's smart contracts from Layer 1 to Layer 2 without requiring any change, Synthetix CTO Justin J Moses told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"On L2, Synthetix can update its price oracle more frequently, which means they do not have to temporarily halt transactions like they do on L1. We've found cheap oracle updates to be an unexpectedly major benefit of L2 for DeFi,\" Optimism CEO Jinglan Wang told The Block.&nbsp;<\/span>","Synthetix is the second-largest Open Finance protocol by total locked value, per DeFi Pulse. Optimism, on the other hand, recently received a $3.5 million seed round from Paradigm and IDEO CoLab Ventures, after it successfully showcased the feasibility of Optimistic Rollup in a demo last October <span data-v-f87c67ca=\"\">in collaboration with decentralized exchange Uniswap.<\/span>","<span data-v-f87c67ca=\"\">However, different from the October demo that required custom codes, the Synthetix demo did not need<\/span><span data-v-f87c67ca=\"\"> any special code and can be generally deployed with other DeFi protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We did have to do a lot of debugging but there’s nothing special we built for Synthetix,\" said Wang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Optimism, the Synthetix demo could achieve a 37.5 times reduction in oracle update latency and a 75 times reduction in transaction delay, compared to the 15 second average transaction time on the Ethereum mainnet. It also demonstrates how oracle-and exchange-related gas prices can be reduced by 27.2 times and 143 times, respectively.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As part of the demo, the two startups also launched a trading competition to stress test the OVM. Traders generating the highest returns will be rewarded up to 15,000 SNX, worth around $11,442.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Next, the Optimism team plans to combine the OVM full node from the Optimistic Rollup demo with the backend from Unipig, in order to deploy \"a fully Ethereum compatible Layer 2 protocol,\" an Optimism blog post stated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Synthetix, meanwhile, plans to be live on Optimism's Layer 2 solution once it is deployed on the Ethereum mainnet, according to founder Kain Warwick.&nbsp; <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$11,442","content":"MONEY"},{"type":"Synthetix","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"last October","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"OVM","content":"ORGANIZATION"},{"type":"Unipig","content":"LOCATION"},{"type":"IDEO CoLab Ventures","content":"ORGANIZATION"},{"type":"Kain Warwick","content":"PERSON"},{"type":"Synthetix CTO Justin J Moses","content":"PERSON"},{"type":"Jinglan Wang","content":"PERSON"},{"type":"oracle","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Celia Wan","The Block"]}