{"summary":"U.S. prosecutors took action against three terrorist financing organizations on Thursday, including two that involved the use of bitcoin to raise funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74837\/u-s-officials-unveil-wide-ranging-crackdown-on-terrorist-financing-networks-involving-bitcoin-and-ppe-sales","publishDate":"2020-08-13T12:34:24","id":211,"type":null,"title":"U.S. officials unveil wide-ranging crackdown on terrorist financing networks involving bitcoin and PPE sales","category":["HACKS"],"content":["U.S. government agencies said Thursday that they have seized or are seeking control of funds held in nearly three hundred bitcoin addresses as part of a vast crackdown on three terrorism financing networks.","The three networks, officials said, involved the organizations al-Qaeda, ISIS and Hamas via the al-Qassam Brigades.&nbsp;In a statement, officials said that the three networks comprised a multi-faceted approach to fundraising that included the use of bitcoin-centric campaigns and the illicit sales of personal protective equipment during the COVID-19 pandemic.","The government said this week's moves \"represent the government's largest-ever seizure of cryptocurrency in the terrorism context.\" In a <a href=\"https:\/\/blog.chainalysis.com\/reports\/cryptocurrency-terrorism-financing-al-qaeda-al-qassam-brigades-bitcointransfer\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">blog<\/a> post, blockchain analytics firm Chainalysis said that the investigation saw \"more than $1 million worth of cryptocurrency recovered from terror finance campaigns and financial facilitators operating unlicensed money services businesses (MSBs).\"","\"It should not surprise anyone that our enemies use modern technology, social media platforms and cryptocurrency to facilitate their evil and violent agendas,\" Attorney General William Barr said in a statement. \"The Department of Justice will employ all available resources to protect the lives and safety of the American public from terrorist groups.","In the al-Qaeda context, prosecutors alleged in court documents that Syrian-based groups Al-Nusrah Front and Hay'at Tahrir al-Sham used Telegram and social media to promote bitcoin fundraising efforts starting in 2019. The <a href=\"https:\/\/www.documentcloud.org\/documents\/7035314-Complaint.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">published<\/a>&nbsp;court documents state that the U.S. government is seeking the forfeiture of 155 bitcoin address accounts.&nbsp;","In a separate <a href=\"https:\/\/www.justice.gov\/opa\/press-release\/file\/1304296\/download\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">court<\/a> action, prosecutors went after the al-Qassam operated network, which involved the use of two websites as well as five accounts held at an unnamed \"financial institution.\" The complaint identified \"fifty-three virtual currency accounts\" and \"one hundred twenty-seven virtual currency properties\" for seizure and outlined a three-stage campaign involving the use of accounts at twelve &nbsp;unnamed exchanges as well as personal addresses. The complaint appears to use \"accounts\" to refer to those held on exchanges and \"properties\" for those held in individual addresses.","Officials said that \"working together, IRS, HSI, and FBI agents tracked and seized all 150 cryptocurrency accounts that laundered funds to and from the al-Qassam Brigades' accounts.\"","The ISIS-related campaign focused on the fraudulent sale of PPE, specifically N95 masks alleged to be approved by the FDA.&nbsp;","\"The unsealed forfeiture complaint seized Cakar's website as well as four related Facebook pages used to facilitate the scheme. With this third action, the United States has averted the further victimization of those seeking COVID-19 protective gear, and disrupted the continued funding of ISIS,\" the government's Thursday statement explained.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Qaeda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"19","content":"DATE"},{"type":"FDA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Cakar","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"William Barr","content":"PERSON"},{"type":"The Department of Justice","content":"ORGANIZATION"},{"type":"ISIS","content":"ORGANIZATION"},{"type":"Nusrah Front","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}