{"summary":"Terra LUNA Classic Price Prediction as Community Revises Burn Tax – Can LUNC Reach $100?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/terra-luna-classic-price-prediction-as-community-revises-burn-tax-can-lunc-reach-100.htm","publishDate":"2024-04-27T01:32:52","id":21102,"type":null,"title":"Terra LUNA Classic Price Prediction as Community Revises Burn Tax – Can LUNC Reach $100?","category":["Price Predictions "],"content":["The Terra LUNA Classic (LUNC) price has failed to push to the north of its 21DMA and is reversing lower, despite the community revising the token’s burn tax.","LUNC was last trading just below $0.0001050, having spent failed four a fourth successive day to break above its 21DMA.","The revision to LUNC’s burn tax failed to lift sentiment, probably because the burn rate itself remains unchanged at 0.5%.","The just-passed proposal changed around slightly what happens to those burned tokens.","LUNC’s Oracle Pool will now receive 10% of burned tokens. Beforehand, this 10% had gone to “rewards”.","As the broader crypto market struggles, the Terra LUNC Classic price remains at risk of experiencing further.","The macro backdrop has been a headwind for crypto prices this month. Recent data, including the latest Core PCE report released on Friday, points to sticky high inflation in the US.","Here is Powells favourite inflation gauge.","PCE Core Service Less Housing MoM up almost 0.6%","TOO much.. End of discussion pic.twitter.com\/yEBlWeV1MA","— Andreas Steno Larsen (@AndreasSteno) February 24, 2023","","That has forced investors to pare back on Fed rate cut bets. A subsequent rise US bond yields and the US dollar has hammered altcoins, LUNC included.","The Terra LUNA Classic price is down 34% so far this month, and down over 60% from March’s $0.00002550 highs.","And bearish technicals suggest that the sell-off could be far from over.","Chat analysis suggests the Terra LUNA Classic bears are very much in control of the market right now.","The 21DMA has acted as strong resistance going all the way back to late March. And the Terra LUNA Classic price has subsequently formed a clear downtrend.","The March low, which LUNC broke below in mid-April, also acted as strong resistance earlier this week.","These are all strong signs that lower prices are coming for LUNC. A retest of April lows just above $0.00007 is likely in the coming weeks, a 30% drop from current levels.","If the LUNC community was able to burn enough tokens, then technically yes, LUNC could reach $100.","Assuming LUNC maintains its current $600 million market cap, LUNC at $100 would imply a 6 million token supply.","But LUNC’s current token supply is over 5.8 trillion. To get to a 6 million token supply, 99.99999% of the supply needs to be burnt.","Market cap expansion could help reduce how many token burns would be required to get LUNC to $100.","But LUNC lost all its utility when the Terra ecosystem collapsed back in May 2022.","LUNC is basically just a speculative shitcoin at this point. Sure, it could see random 2-3x pumps as risk appetite surges.","But it’s unlikely to become a multi-billion dollar crypto in the long run.","Whilst its possible, it remains highly unlikely LUNC will ever reach $100.","For those looking for a better probability of near-term gains, an alternative high-risk, high-reward investment strategy to consider is getting involved in crypto presales.","This is where investors buy the tokens of upstart web3 projects to help fund their development.","These tokens are nearly always sold cheaply, and there is a long history of presales delivering huge exponential gains to early investors.","Many of these projects have fantastic teams behind them and a great vision to deliver a one-of-a-kind crypto application\/platform.","The team at Cryptonews.com spends a lot of time searching through presale projects to help out investors.","One such project that analysts at Cryptonews are a big fan of is Mega Dice Casino.","This already well-established crypto casino has launched a presale of its utility token DICE.","DICE holders get big cashback benefits on their wagers and can also generate passive income via DICE staking.","The crypto casino is also running a series of exciting airdrops to reward early presale investors.","$DICE has raised over $500,000 in presale so far! 🔥","Thank you to each and every one of you for being part of our journey! 🙏❤️","Next up, $1 million! 🚀 pic.twitter.com\/N94CDeHBOh","— Mega Dice Casino (@megadice) April 25, 2024","","The project is already close to having raised $550,000. And potential investors better move quickly, as when the $1 million milestone is hit, the DICE price will rise.","Check Out Mega Dice Casino’s Presale",""],"entity":[{"type":"April 25, 2024","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$0.00002550","content":"MONEY"},{"type":"$0.00007","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"34%","content":"PERCENT"},{"type":"$600 million","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$DICE","content":"MONEY"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Terra LUNA Classic","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$100","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Mega Dice Casino","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Mega Dice Casino’s Presale","content":"ORGANIZATION"},{"type":"0.6%","content":"PERCENT"},{"type":"mid-April","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"$550,000","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Andreas Steno Larsen","content":"PERSON"},{"type":"$0.0001050","content":"MONEY"},{"type":"February 24, 2023","content":"DATE"},{"type":"99.99999%","content":"PERCENT"},{"type":"multi-billion dollar","content":"MONEY"}],"hashtag":["LUNC","Terra Luna Classic"],"authors":["Joel Frank"]}