{"summary":"Super Sushi Samurai Token Crashes by 99% After Critical Exploit","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/super-sushi-samurai-token-crashes-by-99-after-critical-exploit.htm","publishDate":"2024-03-22T07:40:05","id":21106,"type":null,"title":"Super Sushi Samurai Token Crashes by 99% After Critical Exploit","category":["Blockchain News "],"content":["The Super Sushi Samurai (SSS) game experienced a catastrophic security breach, resulting in a 99.9% drop in its token value.","A double-spending glitch was exploited within the game, leading to unauthorized withdrawals totaling $4.8 million from its liquidity pools. This vulnerability, identified in the project’s smart contracts, allowed users to manipulate their token balances.","We have been exploited, it's mint related. We are still looking into the code. Tokens were minted and sold into the LP.\nTransaction:https:\/\/t.co\/F4XeqdyJu2","the exploited funds are in this wallet: https:\/\/t.co\/NWeTu5vMkj","— Super Sushi Samurai | SSS (@SSS_HQ) March 21, 2024","","“We have been exploited, it’s mint related. We are still looking into the code. Tokens were minted and sold into the LP,” Super Sushi Samurai stated on social media.","According to a Yuga Labs solidity and backend developer “Coffee,” the liquidity pool on the Blast network was depleted due to a flaw in their token contract that caused users’ balances to double when they transferred their entire balance to themselves.","The @SSS_HQ $SSS LP was just drained on blast because their token contract has a bug where transferring your entire balance to yourself doubles it.","The order of operations decrements the balance for \"from\" and then sets the balance for \"to\" – if these are the same address, the… pic.twitter.com\/RStMcFH3sy","— Coffee ☕️🍌 (@coffeexcoin) March 21, 2024","","“The order of operations decrements the balance for ‘from’ and then sets the balance for ‘to,’” said Coffee. “If these are the same address, the ‘toBalance’ does not take into affect the decrement of ‘amount’ and just overwrites the balance with the initial balance + transferred amount.”","“Attacker was able to get 1310 ETH from the LP by doubling their balance repeatedly and then selling it all,” said Coffee.","Statistics on CoinGecko showed that the trading price of SSS tokens has plunged over 99.9% since the discovery of the glitch.","However, an on-chain message claimed that the exploit was initiated by a white hat.","This has been a white hat rescue. https:\/\/t.co\/4oKl8IPkJW https:\/\/t.co\/2jehYaeJJ0 pic.twitter.com\/ZMxbpZ9jbt","— sudo rm -rf –no-preserve-root \/ (@pcaversaccio) March 21, 2024","","“Hi team, this is a whitehat rescue hack. Let’s work on reimbursing the users. Please reach out via Blockchain chat from the SSS deployer…” the message reads.","The SSS Team has then responded to the message, saying, “Hello white hat, we have reached out to you on Blockscan. Thank you for cooperating with us.”"],"entity":[{"type":"1310","content":"DATE"},{"type":"99.9%","content":"PERCENT"},{"type":"SSS Team","content":"ORGANIZATION"},{"type":"LP","content":"ORGANIZATION"},{"type":"Super Sushi Samurai | SSS","content":"ORGANIZATION"},{"type":"$SSS","content":"MONEY"},{"type":"Super Sushi Samurai (SSS","content":"ORGANIZATION"},{"type":"March 21, 2024","content":"DATE"},{"type":"SSS","content":"ORGANIZATION"},{"type":"Super Sushi Samurai","content":"ORGANIZATION"},{"type":"$4.8 million","content":"MONEY"}],"hashtag":["gamefi","Hack"],"authors":["Hongji Feng"]}