{"summary":"A complicated, multi-part effort to create new laws governing crypto markets in the U.S. has serious players, and momentum, behind it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227474\/crypto-markets-bill-congress","publishDate":"2023-04-20T19:50:18","id":2110,"type":null,"title":"Crypto legislation in the making is picking up steam in US Congress","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Momentum is building for the first major U.S. crypto legislation to have a realistic shot at becoming law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Members of the House and Senate have begun working together on a bill to create new market structure rules around digital assets. <\/span>","<span data-v-f87c67ca=\"\">The talks come amidst a regulatory crackdown on the industry by the Commodities Futures Trading Commission and the Securities and Exchange Commission. Both the <a href=\"https:\/\/www.theblock.co\/post\/170620\/treasury-recommends-double-down-on-crypto-enforcement-but-with-more-guidance\" data-v-f87c67ca=\"\">enforcement actions<\/a> and <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/jy0986\" data-v-f87c67ca=\"\">top-level recommendations for new laws<\/a> to govern digital assets were part of an agenda released by the Biden administration last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The markets effort is running in parallel to another major effort to advance a bipartisan framework for stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Details of the Republican-led crypto market effort remain under negotiation. The goal is to introduce it this spring or early summer, and that it and a stablecoins bill would reach bipartisan consensus in the closely divided chambers of Congress, as well as final sign off from President Joe Biden, and provide more rules specific to digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry, R-N.C., and House Agriculture Committee Chair Glenn ‘GT’ Thompson, R-Pa., are the senior House players in the market structure effort.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thompson authored legislation around spot crypto markets last Congress, and his committee has jurisdiction over commodities laws, since a number of commodities come from the agriculture industry. The Pennsylvania Republican told The Block his committee was starting “from scratch” in this effort while “working collaboratively” with the Financial Services Committee, but that the two chairs are on the “same page.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thompson and McHenry agreed to principles on what new legislation governing crypto markets should look like earlier this year, after the North Carolina Republican approached him to coordinate efforts given an unusual degree of overlapping jurisdictions between the two committees on the issue.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We’re working from those principles to structure Ag and Financial Services pieces for a securities and commodities regime for a holistic market structure bill,” McHenry told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That said, the Financial Services Committee holds the lion’s share of jurisdiction on the topic, with the power to rewrite securities laws central to crypto market regulation.<\/span>","<span data-v-f87c67ca=\"\">McHenry, in addition to being one of the most effective negotiators and vote counters in Congress, is also considered one of the most knowledgeable members of Congress on financial technology, as co-author of a landmark equity crowdfunding law passed over ten years ago. The law was one of the last to amend securities laws to accommodate new technology, a similar dynamic to conversations around legal tweaks for digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The legislation effort recently picked up momentum when the House Republicans began coordinating with the authors of a high-profile, wide-ranging crypto policy bill from last Congress: Sens. Cynthia Lummis, R-Wyo., and Kirsten Gillibrand, D-N.Y.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two were expected to reintroduce a version of their wide-ranging crypto legislation from last Congress before an upcoming industry conference later this month, but have pushed their timetable to coordinate with the House effort, Lummis said in an interview.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We’re going to try to work with them and see if we can find ways to dovetail our concepts,” said Lummis. “So now it’s going to look a little different, I suspect, but because we’re trying to merge ideas, we’re hoping that once we get the merged product, that it’s going to be easier to move.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The coordination is mutually beneficial and can give more weight to legislation going forward. Though last Congress’ Lummis-Gillibrand bill was well-received by industry, it fell short of picking up momentum in Washington, and McHenry and Thompson enjoy the privileges of chairmanship in a chamber where Republicans can pass legislation on a party-line vote. Meanwhile Lummis and Gillibrand give House drafters sponsors in the Senate, and Lummis sits on the Senate Banking Committee, the counterpart to the committee McHenry chairs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As we finalize those things we’re going to try to team up with the folks who are most knowledgeable and interested in the Senate,” said McHenry. “And certainly Senator Gillibrand and Senator Lummis have been deeply engaged on this.”&nbsp;<\/span>","Though having Senate allies to introduce the legislation on that side of the Capitol could help the effort, Senate Banking Committee Chair Sherrod Brown, D-Ohio, and the Treasury Department will also play major roles in any bills becoming law.","Treasury Secretary Janet Yellen signed off on recommendations for new laws around stablecoins and crypto firms in October. The Treasury Department and McHenry's staff <a href=\"https:\/\/www.theblock.co\/post\/176803\/senior-house-republican-biden-administration-holding-up-stablecoin-bill\" data-v-f87c67ca=\"\">did not always see eye-to-eye<\/a> during stablecoin talks last year, but he said on Wednesday that the Biden administration was working with him and his staff, at least on stablecoins legislation.&nbsp;","Brown, whose committee any legislation would go through, has yet to express much enthusiasm for legislating around digital assets. The Ohio Democrat told The Block following a hearing in February that he's not convinced crypto has \"a real role\" in the financial system and he is <a href=\"https:\/\/www.theblock.co\/post\/225152\/gensler-sec-crypto-stablecoin-congress\" data-v-f87c67ca=\"\">largely deferring to Securities and Exchange Commission Chair Gary Gensler<\/a>.&nbsp;","Gensler has made clear that he sees cryptocurrencies as securities that should be following securities laws.","\"We're talking to Gensler ongoing,\" Brown said when asked by The Block following a hearing before his committee in February what his thoughts on legislation were. \"I'm very interested in a legislative answer here, but we need them,\" meaning the SEC, \"to be aggressive here.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"House Agriculture Committee Chair Glenn ‘GT’ Thompson","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thompson","content":"PERSON"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"Brown","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Pa.","content":"LOCATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"the Financial Services Committee","content":"ORGANIZATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"Gillibrand give House","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Ohio","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"North Carolina","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Gillibrand","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":["CFTC","CONGRESS","CYNTHIA LUMMIS","GARY GENSLER","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","JANET YELLEN","MAXINE WATERS","PATRICK MCHENRY","SEC","SENATE BANKING COMMITTEE","TREASURY DEPARTMENT"],"authors":["Colin Wilhelm","The Block"]}