{"summary":"Bitcoin, Ethereum & Crypto Analysts Search for Bottom as Investors in ‘Historically Meaningful Degree’ of Pain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-ethereum-crypto-analysts-search-for-bottom-as-investors-in-historically-meaningful-degree-of-pain.htm","publishDate":"2022-06-20T16:28:00","id":21103,"type":null,"title":"Bitcoin, Ethereum & Crypto Analysts Search for Bottom as Investors in ‘Historically Meaningful Degree’ of Pain","category":["Bitcoin News "],"content":["As Bitcoin (BTC) and the broader crypto market are trying to recover after diving below crucial levels this past weekend, analysts are digging into data, trying to identify the next steps in the market. ","“The selloff over the weekend can be considered to have plunged profitability and investors into a historically meaningful degree of financial pain,” crypto analytics firm Glassnode said in their report today. ","According to them, with forced sellers appearing to drive much of the recent sell-side, the market might begin to eye whether signals of seller exhaustion are emerging over the coming weeks and months.","“Given the tighter correlation between traditional markets like the NYSE, the Nasdaq, and the crypto markets, I don’t think the [BTC] bottom is in. I think a few things need to happen for the bottom to hit: 1. Inflation needs to ease, 2. Unemployment needs to stabilize and 3. Weaker US dollar,” Shayne Higdon, Co-Founder and CEO of the HBAR Foundation, said in an emailed comment.","On Monday at 16:01 UTC, bitcoin traded at USD 20,786, up 4% for the past 24 hours and down 22% for the past 7 days. At the same time, ethereum (ETH) stood at USD 1,132, up 6% for the day and down almost 22% for the week.","Although bitcoin remained in positive territory for the past 24 hours, the lower prices earlier in the weekend caused relatively large liquidations of leveraged traders who were long. According to data from Coinglass, close to USD 109m were liquidated in the 12 hours between midnight and noon on Saturday in the bitcoin market alone.","Notably, however, the liquidations were still smaller than the massive long liquidations seen on June 13, when BTC fell from USD 26,000 to around the USD 22,000 level.","Marcus Sotiriou, an analyst at digital asset broker GlobalBlock, pointed out that many altcoins have not seen liquidations at the same high level as BTC and ETH, with some altcoins even showing strength.","“This is because bitcoin and ethereum are the primary uses of collateral for leveraged positions, and the fact we can see on-chain the various liquidation prices means that a cascade lower can be premeditated,” Sotiriou wrote in a market commentary today.","He further added that this could be a reason why big buyers have not yet stepped up to take advantage of the lower prices in BTC and ETH, saying “major buyers can see other peoples’ liquidation levels.”","Notably, liquidations over the weekend also led to a historic loss for bitcoin holders, according to Sotiriou. Citing on-chain data from Glassnode, the analyst said that this liquidation cascade led to the largest realized loss in USD terms in Bitcoin’s history, with over USD 7.325bn in losses realized by investors.","He added that on-chain data also shows that BTC holders with 1-year-old coins “capitulated” over the weekend.","Meanwhile, the long-term holder (LTH) supply has declined by BTC 178,000 over the last week, equivalent to 1.31% of their total holdings, Glassnode said, noting that the current spending behavior by LTHs taking losses coincides with March 2020 but is not quite as severe as the 2015 or 2018 bear market lows. ","On-chain data this weekend also indicated that Bitcoin miners have come under even bigger pressure and that many have chosen to turn off their machines.","The bitcoin on-chain analyst Will Clemente of the mining and equipment provider Blockware Solutions commented on the data and said that the combination of a lower BTC price, higher difficulty, and higher energy costs “have put serious pressure on miners’ margins.”","Lower Bitcoin price, higher hash\/difficulty, and higher energy costs have put serious pressure on miners margins. Hashprice is now its lowest since October 2020.\n\nHash ribbons have crossed (bot. left), indicating machines unplugging + Miners sending BTC to exchanges. (bot. right) pic.twitter.com\/x7J7pYTZ9W","Glassnode added that miner capitulation is now “happening in real-time”:","“Miners are now under significant financial stress, with BTC trading near the estimated cost of production, incomes well below their yearly average, and hash-rate noticeably coming off [all-time highs].”","Using the Puell Multiple, an oscillator tracking miner USD denominated income, and the Difficulty Ribbon Compression model, Glassnode concluded that the contraction in miner income is worse than “Great Migration in May-July 2021,” when miners left China following a ban there.","Still, “miners have faced worse days in 2018-2019 and 2014-2015 bear markets, where the Puell Multiple reached 0.31,” Glassnode said.","Meanwhile, the latest data from CoinShares once again showed outflows from regulated crypto-backed investment funds.","Overall, USD 38.6m left crypto investment funds last week, with USD 69.9m leaving ETH-backed funds alone. Still, the overall figure improved thanks to inflows in BTC-backed funds of more than USD 28m, in addition to smaller inflows into multi-asset crypto funds.","The inflows last week mark a reversal from the week prior when USD 102m were pulled out of crypto-backed funds and USD 57m left BTC-backed funds.","Commenting on the broader outlook for the market on Monday, Jason Choi, an angel investor and former general partner at crypto hedge fund Spartan Group, hinted that the crypto market may have reached peak bearishness.","“Not saying it will happen but peak sentiment like this often set up hated rallies,” Choi wrote on Twitter, suggesting that funds that are now sitting on losses need to participate in potential rallies in order to stay in business.","P.S. the one notable shift in sentiment in the past 24 hours was the increased probability of a cash-rich party plucking holes in the market to temporarily prevent further cascades. https:\/\/t.co\/lAfNb9xvmT","A similar sentiment could also be seen in the comments from crypto trader Alex Krüger, who wrote that a dip below the USD 20,000 level for BTC and USD 1,000 level for ETH would for many now represent buying opportunities.","This marks a shift from last week when a dip below the same levels would only cause further selling from “panic sellers, forced sellers and breakout sellers,” Krüger wrote on Twitter.","He added that the number of stop-losses under the USD 20,000 for bitcoin is “very small relative to what it was before.”","“Many traders like me shorted 20k and won’t be shorting 20k again as the reduced presence of stops makes shorting much less attractive,” the crypto trader wrote.","Lastly, Nik Bhatia, a finance professor at the University of Southern California and author of the bitcoin book Layered Money, reminded his newsletter readers that this is far from the first time that bitcoin experiences a selloff of this magnitude.","“Bitcoin has faced 12 drawdowns of this same magnitude in its history, and yet it’s still here,” Bhatia wrote in a newsletter.","He added that although bitcoin may not be behaving like a safe-haven asset now, it still remains a safe haven from “central bank cronyism, authoritarian transaction controls, and currency debasement.”","____","Learn more: \n– US Fed to Blame for Downturn, Large Crypto Players Have Responsibility Toward Ecosystem – FTX CEO\n– Bitcoin Better at Tackling Rate Hikes than Ethereum, Stocks – Report\n\n– Bancor Pauses Protection Mechanism Due to ‘Hostile Market Conditions’\n– BlockFi, Crypto.com, and Others Come Forward as Three Arrows Hires Advisers, Babel Finance Pauses Withdrawals \n\n– Not Enough Liquidity for Celsius to Sell Staked Ethereum in Open Market – Analyst\n– Another Elon Musk-fueled DOGE Rally Ends With a Dump\n\n– ‘The Reckoning’ & ‘The Best Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n– Ethereum Steps on Another Delay Bomb"],"entity":[{"type":"2014","content":"DATE"},{"type":"6%","content":"PERCENT"},{"type":"2015","content":"DATE"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Sotiriou","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"University of Southern California","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Jason Choi","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"HBAR Foundation","content":"ORGANIZATION"},{"type":"October 2020","content":"DATE"},{"type":"Others Come Forward as Three Arrows Hires Advisers","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Marcus Sotiriou","content":"PERSON"},{"type":"US Fed","content":"ORGANIZATION"},{"type":"Nik Bhatia","content":"PERSON"},{"type":"Will Clemente","content":"PERSON"},{"type":"Coinglass","content":"LOCATION"},{"type":"Shayne Higdon","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"Bhatia","content":"PERSON"},{"type":"Large Crypto Players Have Responsibility Toward Ecosystem – FTX","content":"ORGANIZATION"},{"type":"Puell Multiple","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 2020","content":"DATE"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Glassnode","content":"LOCATION"},{"type":"1.31%","content":"PERCENT"},{"type":"Babel Finance Pauses Withdrawals \n\n– Not Enough Liquidity for Celsius","content":"ORGANIZATION"},{"type":"Blockware Solutions","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Glassnode","content":"PERSON"},{"type":"12 hours between midnight","content":"TIME"},{"type":"June 13","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Alex Krüger","content":"PERSON"}],"hashtag":["Bitcoin","Ethereum","Forecast","Investing","Market","Mining","Trading"],"authors":["Fredrik Vold"]}