{"summary":"Class action lawsuit in Pennsylvania against Mark Karpeles for his involvement in Mt. Gox moves forward\nThe Court denied Karpeles motion to dismiss for personal jurisdiction, because Karpeles had thousands of customers in Pennsylvania and he was CEO of Mt. Gox\nExercising jurisdiction over Karpeles was in line with traditions of fair play and substantial justice, because Pennsylvania has an interest in protecting its citizens and Karpeles availed himself of the benefits of the jurisdiction","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34672\/the-day-the-coins-fell-another-mt-gox-lawsuit-in-the-u-s-moves-forward","publishDate":"2019-08-03T09:30:18","id":2111,"type":null,"title":"The day the coins fell: Another Mt Gox lawsuit in the US moves forward","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;As always, Rosario summaries are “NMR” and Palley summaries are “SDP”.<\/em>","This class-action lawsuit involves a well-known name in the crypto space, Mark Karpeles, who is the defendant here in a case born out of the great Mt Gox collapse. I feel like the Mt Gox collapse should be referred to in the crypto community as “The Incident,” or “The Day the Coins Fell,” or something similarly grand. If you are not familiar with the “The Day the Coins Fell” you can read an excellent write-up of “The Incident” <a class=\"ci ce mb mc md me\" href=\"https:\/\/www.thedailybeast.com\/behind-the-biggest-bitcoin-heist-in-history-inside-the-implosion-of-mt-gox\" data-v-f87c67ca=\"\">here<\/a>. Anyway, in this decision the Court denied Karpeles' motion to dismiss for lack of personal jurisdiction. (We covered this case way back in CCM #1, which you can <a class=\"ci ce mb mc md me\" href=\"https:\/\/www.linkedin.com\/pulse\/crypto-caselaw-minute-8312018-stephen-palley\/\" data-v-f87c67ca=\"\">find here).<\/a>","Gregory Pearce is a Pennsylvania resident who created an account on Mt Gox to trade bitcoin in November 2013. He eventually tried to make a withdrawal at the end of January 2014, right around the time that everyone realized Mt Gox had a major problem on their hands. Needless to say, the withdrawal never went through.","In the initial filing in January of 2018, Pearce tried to sue Karpeles and Mizuho Bank. Mizuho Bank handled deposits and withdrawals for Gox customers based in the US. Mizuho got themselves dismissed from the lawsuit in March of 2019 due to a lack of personal jurisdiction (they had no contact with Pearce and were merely incidental to the whole thing) leaving Karpeles as the sole defendant. Karpeles then moved to dismiss the case for lack of personal jurisdiction. This opinion denied that motion.","When considering a motion to dismiss the Court “must consider allegations made by plaintiff as true and construe all disputed facts in favor of the plaintiff.” Next, the Court walks through the steps of finding personal jurisdiction over the defendant. Here, the Court had to determine whether they had jurisdiction over Karpeles, and whether the exercise of jurisdiction violates the Due Process Clause of the Constitution.","Right out of the gate the Court says it has specific personal jurisdiction over Karpeles. The reasoning? Karpeles had availed himself of the benefits of Pennsylvania by “soliciting business from Pearce and thousands of other Pennsylvania residents through the Mt. Gox website.” Yeah, hard to argue there. Put another way, “[s]ince Mt. Gox actively transacted business over the internet by providing an interactive website that engaged in business with thousands of Pennsylvania residents, this Court’s exercise of personal jurisdiction is proper.” The Court really hammered home this point when it pointed to the complaint and said:","Specifically, we point to Mt. Gox’s website, which allows users to: open and&nbsp;manage accounts; provide Mt. Gox with their address and personal information; make purchases and trades on the Exchange; transfer or deposit cash directly into their Mt. Gox accounts; make withdrawals from the Exchange; and allow users to purchase a “YubiKey” that would be sent to their address.","The Court also points to two sister cases in federal courts in Illinois and California. (We covered the Illinois case in CCM #27, which you can <a class=\"ci ce mb mc md me\" href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-27-march-14-2019-80a3b582e8bf\" data-v-f87c67ca=\"\">find here<\/a>). &nbsp;As the Court said, the finding of personal jurisdiction here in Pennsylvania is bolstered by the findings of personal jurisdiction over Karpeles in Illinois and California. “The Day the Coins Fell,” has produced a lot of litigation in the U.S. and elsewhere. Karpeles tried to argue that he shouldn’t be personally liable for the acts of his agents, and the things that surrounded the collapse of Mt Gox, but the Court paid that no mind stating that he was CEO, and it was his ship.","Once the Court found that it had personal jurisdiction over Karpeles they had to answer the question of whether it was fair to exercise that jurisdiction. The Court looked to factors laid out by the U.S. Supreme Court to determine whether exercising jurisdiction would comport with notions of fair play and substantial justice. Those factors are:","“the burden on the defendant, the forum State’s interest in adjudicating the dispute, the plaintiff’s interest in obtaining convenient and effective relief, the interstate [and international] judicial system’s interest in obtaining the most efficient resolution of controversies.”","Karpeles argued that it would be too burdensome for him to fight this case, because he lives in Japan, and the Japanese government won’t let him leave. The Court said, in essence, too bad. Then Karpeles argued that Pennsylvania didn’t even have an interest in this case. The Court said sure it does “Pennsylvania has a manifest interest in providing effective means of redress when a foreign defendant reaches into the state and solicits its citizens.” Lastly, Karpeles argued that the Japanese civil rehabilitation proceedings is a better avenue for resolution of this case. The Court didn’t agree, and pointed to one of the sister cases that rejected that argument in part, because the chance of full recovery through the Japanese system was still speculative.","Bottom line: &nbsp;this case is going forward. Karpeles is now facing three class action lawsuits in multiple states around the country."],"hashtag":[]}