{"summary":"Trump Doubles Down on Anti-CBDC Stance, Gives Full Credit to Ramaswamy","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/trump-doubles-down-on-cbdc-stance-gives-full-credit-to-ramaswamy.htm","publishDate":"2024-01-23T18:05:06","id":21114,"type":null,"title":"Trump Doubles Down on Anti-CBDC Stance, Gives Full Credit to Ramaswamy","category":["Blockchain News "],"content":["Former President Donald Trump doubled down on his claim that he will “never allow” a central bank for digital currency (CBDC) during a Monday night rally in New Hampshire.","","Trump credited former presidential hopeful Vivek Ramaswamy, who has since endorsed Trump in the 2024 presidential election, for forewarning him about the issues surrounding a potential CBDC.“I will never allow the creation of a central bank digital currency,” Trump told the audience. “I respect Trump & give him full credit for being a strong leader who is willing to listen to the right ideas,” Ramaswamy posted to X on January 23rd.“I didn’t like him when he was running, but I like him now,” Trump said of Ramaswamy on Monday night. “It’s amazing how you can like somebody when you win.”","","Trump’s latest statements come just days after the presidential frontrunner initially announced he would “protect Americans from government tyranny” by not allowing the formation of a CBDC during a rally on Friday night in New Hampshire.","Meanwhile, Trump’s political rival, Florida Governor Ron DeSantis, suspended his presidential campaign on January 21st, shortly before the New Hampshire primary. In a video posted to X, DeSantis revealed he would support Trump going forward.","“I signed a pledge to support the Republican nominee and I will honor that pledge,” DeSantis said.","","I am not a fan of Bitcoin and other Cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air. Unregulated Crypto Assets can facilitate unlawful behavior, including drug trade and other illegal activity….","— Donald J. Trump (@realDonaldTrump) July 12, 2019","","The current Governor of Florida has long held a widely anti-CBDC stance.","“On day one as President, we take the idea of central bank digital currency, and we throw it in the trash can,” Florida Governor Ron DeSantis said during December’s Republican presidential debate. “It’ll be dead on arrival.”","In March, DeSantis signed a bill that would prevent a federally adopted central bank digital currency.","“Anyone with their eyes open could see the danger this type of an arrangement would mean for Americans who want to exercise their financial independence and would like to be able to conduct business without having the government know every single transaction they’re making in real time,” DeSantis said at the time.","In November, Ramaswamy announced his own three-pillar policy “to ensure economic freedom for Americans seeking an alternative to centralized finance.”","It appears as though Trump has taken on some of their views, given his anti-crypto stance in the past.","“I am not a fan of Bitcoin and other cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air,” Trump said in July 2019.","\n\n"],"entity":[{"type":"Trump &","content":"ORGANIZATION"},{"type":"Ramaswamy","content":"PERSON"},{"type":"Ron DeSantis","content":"PERSON"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"Trump","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"July 2019","content":"DATE"},{"type":"DeSantis","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"night","content":"TIME"},{"type":"New Hampshire","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Donald Trump","content":"PERSON"},{"type":"Trump","content":"PERSON"},{"type":"July 12, 2019","content":"DATE"},{"type":"Ramaswamy","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"January 23rd","content":"DATE"},{"type":"Donald J. Trump","content":"PERSON"}],"hashtag":["Donald Trump"],"authors":["Julia Smith"]}