{"summary":"Chinese Parents to Use Digital CNY ‘Smart Contracts’ to Pay for After-school Lessons","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/chinese-parents-to-use-digital-cny-smart-contracts-to-pay-for-after-school-lessons.htm","publishDate":"2022-08-18T00:00:00","id":21116,"type":null,"title":"Chinese Parents to Use Digital CNY ‘Smart Contracts’ to Pay for After-school Lessons","category":["Altcoin News "],"content":[" ","A Chinese state-owned commercial bank is set to pilot a digital yuan-powered “smart contract solution” that allows elementary school parents to pay for their children’s education using the e-CNY.","The initiative, per the media outlet The Cover, is the brainchild of the Bank of China, one of the “big four” state-owned commercial Chinese banks. The project is being carried out in the city of Chengdu, in China’s central Sichuan Province. The bank has teamed up with Chengdu’s education and financial authorities and will let parents pay for their children’s pre- and after-school clubs, sports lessons, and extracurricular lessons using the digital fiat.","Under the program, parents pay a fixed deposit using the digital yuan. These funds are then put into a “smart contract” with the private contractors who run the clubs or offer the lessons. This contract is only activated when the child attends a club or lesson.","If the child misses a session through illness, for example, the contract is voided, and the deposit is returned to the parents’ e-CNY wallet.","Traditionally, local education and financial authorities have had to act as intermediaries in such situations – monitoring attendance and taking payments from parents before passing funds on to the private contractors.","But the Bank of China was quoted as stating that using digital yuan smart contracts would allow regulatory authorities to step away from the equation – and allow parents to make their payments directly to the private contractors. Smart contract technology, the bank suggested, would also promote transparency in payments.","Although smart contracts are traditionally used in the blockchain and crypto space, the central People’s Bank of China (PBoC) argues that it can make use of smart contract technology in its own e-CNY project. The PBoC has previously applied for at least eight patents that feature “smart contract” in their titles.","Chinese financial experts have claimed that smart contract technology could be applied to the national payments system once the digital CNY has been rolled out nationwide.","The Bank of China, meanwhile, has also explained that it will give away digital yuan tokens to residents in Chongqing – provided they only use the coins to pay for low-carbon emission products and services, such as plastic-free food deliveries and public transport.","____","Learn more: \n– Chinese Central Bank May Apply Smart Contract Technology to Digital Yuan\n– Local Tax ‘First’ for Digital Yuan as Pilot Continues to Broaden Scope\n\n– Chinese Banks Launch Automatic Digital Yuan-to-Fiat Conversion Tools\n– Chinese Digital Yuan Spending on the Rise Despite COVID-19-induced Slump\n\n– Chinese Man Uses Digital Yuan to Pay Court-issued Fine in Legal First\n– China’s Digital Yuan App Gets Update as Police Deal with First-Ever CBDC ‘Fraud’ Case"],"entity":[{"type":"Fiat Conversion Tools\n– Chinese Digital Yuan Spending","content":"ORGANIZATION"},{"type":"Chinese Central Bank May Apply Smart Contract Technology","content":"ORGANIZATION"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"Chongqing","content":"LOCATION"},{"type":"Chinese Banks Launch Automatic Digital Yuan","content":"ORGANIZATION"},{"type":"Chinese Man Uses Digital Yuan","content":"ORGANIZATION"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Sichuan Province","content":"LOCATION"},{"type":"Chengdu","content":"LOCATION"},{"type":"Digital Yuan","content":"ORGANIZATION"},{"type":"People’s Bank of China (PBoC","content":"ORGANIZATION"},{"type":"First","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Central Bank","China","Digital Yuan","Education","Smart Contract"],"authors":["Tim Alper"]}