{"summary":"Bitcoin Miners Blamed for Energy Issues as Kazakhstan Looks to ‘Limit’ Mining","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-miners-blamed-for-energy-issues-as-kazakhstan-looks-to-limit-mining.htm","publishDate":"2021-10-19T20:00:00","id":21119,"type":null,"title":"Bitcoin Miners Blamed for Energy Issues as Kazakhstan Looks to ‘Limit’ Mining","category":["Bitcoin News "],"content":["Bitcoin (BTC) and altcoin miners fleeing China’s crypto crackdown to neighboring Kazakhstan have been hit with a fresh setback – with signs the nation’s grid may be struggling to deal with an increase in demand.","As the cold winter months approach, warning bells have begun to ring, with the Ministry of Energy announcing that disruptions had been experienced at three of the country’s biggest power plants.","Per Plus World, the ministry has responded by creating a “draft law” that would “limit the total capacity of [crypto] mining installations operating in Kazakhstan to a maximum of 100 MW.”","The news will hit industrial miners hardest of all: if adopted, the draft bill would also cap production at individual centers, with “facilities” told they “can consume no more than 1 MW of electricity.”","A special rate for crypto miners would also be introduced: Miners would be told to pay an additional USD 0.0024 per kilowatt of energy consumed.","Crypto mining is a major business and growth area in Kazakhstan, which per University of Cambridge figures from August 2021 now accounts for 18.1% of the global average monthly bitcoin hashrate.","However, it appears that the growth of domestic mining businesses and an influx of Chinese miners may have already stretched the grid to the breaking point.","Elsewhere in the CIS (Commonwealth of Independent States) region, crypto mining has caused chaotic scenes, with mining-related power outages leading to months of social unrest in the de facto state of Abkhazia. Russian regions have also been complaining of power-related issues of late, with miners blamed again.","In a press release, Kazakhstan’s energy ministry wrote that “large power units with a capacity of 500 MW” at its Ekibastuz GRES-1 and Ekibastuz GRES-2 plants had failed, with boiler problems in the EEC JSC plant causing a “decrease in power generation.”","The press release made no direct mention of crypto mining, but the timing of the draft law appears to indicate that there is a correlation between the two.","The ministry said central and regional power grid companies had already moved to “limit the consumption of electricity by consumers” who use excess power, with “restrictions introduced according to programs agreed with the local executive bodies.”","Such “emergency shutdowns,” the ministry noted, could “lead to unacceptable deviations in power at the border with the Russian power system,” threatening to “overload interstate power transmission lines, threatening a systemic accident.”","It was important, the ministry concluded, to “prevent accidents and minimize the consequences of a decrease in generation in the power network.”","Plus World noted that “grey” mining was “expanding,” with many miners looking to use electricity intended to power homes as energy for their mining endeavors, causing “shortages of electricity at certain times.”","Alan Dordzhiev, the head of the Association of Blockchain and Data Centers of Kazakhstan, was quoted as stating that “any form of limitation is not very good news,” but adding that he understood the reasons for the government’s actions.","He said:","“We have definitely become a crypto power in terms of mining, but the question is now different – how should we regulate the industry so that only ‘clean’ miners remain, and how can we stop the grey ones?”","Dordzhiev remarked that only building new nuclear power plants would provide a “carbon-free solution.”","____","Learn more:\n– Miners on the Move: China’s Crypto Mining Losses May Be Kazakhstan’s Gain\n– Canaan Diversifies Business by Becoming a Bitcoin Miner In Kazakhstan\n\n– Bitcoin & Crypto Mining Costs Might Increase in Russia As Regions Complain\n– US Becomes Largest Bitcoin Mining Hub After China’s Miner Exodus","– Nordic Bitcoin Miners Face Double Challenge, But Industry Still ‘Quite Optimistic’\n– Bitcoin Miners Secure More Nuclear Deals Amid Climate Concerns\n\n– Dominated by Institutions, Bitcoin Mining is also Possible from Home\n– How Bitcoin Mining Might Help Nations With Domestic Energy Production"],"entity":[{"type":"18.1%","content":"PERCENT"},{"type":"Ministry of Energy","content":"ORGANIZATION"},{"type":"Alan Dordzhiev","content":"PERSON"},{"type":"Bitcoin Mining","content":"ORGANIZATION"},{"type":"Home\n– How Bitcoin Mining Might Help Nations With Domestic Energy Production","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"the Association of Blockchain","content":"ORGANIZATION"},{"type":"CIS","content":"ORGANIZATION"},{"type":"Abkhazia","content":"LOCATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Nordic Bitcoin Miners Face Double Challenge","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"University of Cambridge","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"US Becomes Largest Bitcoin Mining Hub After China’s Miner Exodus","content":"ORGANIZATION"},{"type":"Data Centers of Kazakhstan","content":"ORGANIZATION"},{"type":"Bitcoin Miner In Kazakhstan\n\n– Bitcoin & Crypto Mining Costs Might Increase","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"JSC","content":"ORGANIZATION"}],"hashtag":["Altcoins","Bitcoin","China","Mining","Regulation"],"authors":["Tim Alper"]}