{"summary":"Bitcoin Post-Halving Price Consolidation Isn’t Over Yet: Bitfinex","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-post-halving-price-consolidation-isnt-over-yet-bitfinex.htm","publishDate":"2024-05-02T20:03:54","id":21120,"type":null,"title":"Bitcoin Post-Halving Price Consolidation Isn’t Over Yet: Bitfinex","category":["Bitcoin News "],"content":["Analysts at cryptocurrency exchange Bitfinex predict the price of Bitcoin could consolidate for up to two months post-halving.","The latest edition of the Bitfinex Alpha market report released on April 29 noted that Bitcoin could continue to be the price action benchmark for the crypto market in May and the leading indicator for the entire cryptocurrency market cap.","Bitfinex stated Bitcoin is undervalued. The Market Value to Realised Value (MVRM) ratio is currently at 2.21. ","","Binfinex noted this as a potential entry point for investors, especially as historical patterns show substantial returns when MVRV dips below its 90-day average. ","“Current on-chain signals we are seeing have historically coincided with a bottom for BTC,” they noted.","Despite this, Bitcoin dominance is experiencing a decline, with Ethereum and other altcoins outperforming BTC.","“Typically, post-halving periods witness a shift in investor focus to altcoins, searching for potentially higher returns,” the report continued.","This shift in investment patterns stems from a federal economic report highlighting slower-than-anticipated growth in the US economy. As demonstrated by the real Gross Domestic Product (GDP) annual rate, which plummeted to 1.6 percent in the first quarter of 2024, down from 3.4% in the last quarter of 2023. ","The slowdown in the US economy’s growth is largely due to microeconomic factors. Higher interest rates discourage investors from allocating funds to volatile assets such as Bitcoin, preferring more stable options.","The Fed’s key inflation gauge, the personal consumption expenditures (PCE) index, saw no change in March, holding steady at a 0.3 percent increase month-over-month.","On a year-on-year basis, PCE is at 2.7 percent, which is above the Fed’s 2% inflation target and exceeds consensus forecasts.","This combination of slowing growth and accelerating inflation has reignited fears of stagflation, a scenario in which economic growth stalls as prices continue to rise.","According to CME’s FedWatch tool, traders estimate the probability of a June rate cut to only 11.8%, compared to 56.5% for September.","Despite this, Bitfinex believes the macroeconomic environment is more resilient than in previous years. ","Additionally, the analysts said that general consumers and businesses are “better prepared and informed” about the state of the underlying economy when compared to previous crypto market cycles. ","“Consequently, we believe we could see a 1-2 month consolidation in Bitcoin prices, trading in a range with swings of $10,000 on either side,” the report concluded.","This shift towards Altcoins is further emphasized by recent US Bitcoin spot ETF inflows.","Following the SEC’s green light of Bitcoin ETFs in January, the cryptocurrency gained a whole new audience. These ETFs allow investors to gain exposure to Bitcoin without owning it directly.","Since then, these ETFs have gained widespread adoption, with roughly $12 billion flowing into them. Most of these inflows occurred last quarter, resulting in a surge in the Bitcoin price to new all-time highs. However, they had lost momentum by April.","“After initial novelty hype, ETF flows tend to run out unless prices continue increasing—which they have not done since early March,” 10x Research Founder Markus Thielen predicted.","Thielen’s prediction has been supported by the Hong Kong Bitcoin Spot ETFs launched on April 30 and saw underwhelming inflows, with just $11.2 million on its first day. ","According to a Bloomberg report, this is a far cry from the anticipated $300 million. Investors are not confident in the current state of the market, begging the question of how long Bitcoin can stay “oversold.”"],"entity":[{"type":"Fed","content":"ORGANIZATION"},{"type":"11.8%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"3.4%","content":"PERCENT"},{"type":"Markus Thielen","content":"PERSON"},{"type":"$11.2 million","content":"MONEY"},{"type":"April 29","content":"DATE"},{"type":"September","content":"DATE"},{"type":"56.5%","content":"PERCENT"},{"type":"0.3 percent","content":"PERCENT"},{"type":"1.6 percent","content":"PERCENT"},{"type":"last quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"last quarter of 2023","content":"DATE"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"US Bitcoin","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"April 30","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"2.7 percent","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"$12 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin ETF","Inflation"],"authors":["Harvey Hunter"]}