{"summary":"Google Cloud and Polygon Labs announced a partnership to help make developers&#x27; lives easier and grow the Polygon ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228629\/google-cloud-polygon","publishDate":"2023-04-27T12:15:48","id":2112,"type":null,"title":"Google Cloud to support Polygon to help grow ecosystem","category":["COMPANIES"],"content":["Google Cloud's Blockchain Node Engine, a <a href=\"https:\/\/cloud.google.com\/blog\/products\/infrastructure-modernization\/introducing-blockchain-node-engine\" data-v-f87c67ca=\"\">service<\/a> for fully managed node-hosting for web3 development, will support Polygon as part of a multi-year, strategic alliance announced by Google Cloud and Polygon Labs on Thursday.","The move will simplify the deployment and management of Polygon nodes for developers and aims to increase the adoption of the Polygon ecosystem.","The Blockchain Node Engine already <a href=\"https:\/\/www.theblock.co\/post\/180458\/google-cloud-announces-blockchain-node-service-starting-with-ethereum\" data-v-f87c67ca=\"\">supports Ethereum<\/a>, and it is also working to integrate Solana in a move that was&nbsp;<a href=\"https:\/\/twitter.com\/googlecloud\/status\/1588927875314499590\" data-v-f87c67ca=\"\">was first announced<\/a> last November, according to a Google Cloud spokesperson.","“Google Cloud infrastructure will help to scale the technology more quickly in order to ensure that transactions remain fast and fees remain low as demand increases,\" Brendan Farmer, co-founder of Polygon Labs, told The Block. \"In addition, it will make it easier and faster for developers to deploy on Polygon proof-of-stake network and Polygon Supernets, all while providing access to funding for web3 start-ups,” Farmer said.","<a href=\"https:\/\/www.theblock.co\/post\/180458\/google-cloud-announces-blockchain-node-service-starting-with-ethereum\" data-v-f87c67ca=\"\">Google Cloud launched the Blockchain Node Engine last year<\/a> to allow developers to easily deploy and manage blockchain nodes on Google Cloud. A blockchain node is a computer or server that participates in a blockchain network by verifying and validating transactions and blocks on the network.","The services will help developers \"overcome the time-intensive processes and costly overhead associated with provisioning, maintaining, and operating their own dedicated blockchain nodes,\" according to a joint statement from Google Cloud and Polygon Labs.&nbsp;","Google Cloud will support all Polygon protocols, including Polygon proof-of-stake network, Polygon Supernets and Polygon zkEVM.","“Scaling blockchains with ZK technology eliminates the throughput bottlenecks present on existing chains, but it requires access to compute, so partnering with Google is an important step toward our ZK-powered future,” Farmer said.","Over the past few years, <a href=\"https:\/\/cloud.google.com\/web3\" data-v-f87c67ca=\"\">Google Cloud has been increasingly expanding its presence in the web3 space<\/a> to help projects and developers.","Earlier this week, <a href=\"https:\/\/cloud.google.com\/startup\/web3\" data-v-f87c67ca=\"\">Google Cloud said its \"Google for Startups Cloud Program\" will now support web3 builders.<\/a> Eligible projects raising funds for pre-seed to Series A stages will be able to apply for the program, which includes up to $200,000 in Google Cloud credits over two years and other technical support.","Polygon Ventures-backed early-stage startups are eligible to participate in the program as part of the alliance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Blockchain Node Engine","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Brendan Farmer","content":"PERSON"},{"type":"$200,000","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["GOOGLE","POLYGON","ZKSYNC"],"authors":["Yogita Khatri","The Block"]}