{"summary":"Bitcoin and Ethereum Consolidate Losses, Recovery Could Be Limited","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-ethereum-consolidate-losses-recovery-could-limited.htm","publishDate":"2022-09-07T12:28:00","id":21122,"type":null,"title":"Bitcoin and Ethereum Consolidate Losses, Recovery Could Be Limited","category":["Bitcoin News "],"content":["Bitcoin price declined heavily below the USD 19,500 support. BTC even settled below the USD 19,000 level. It is currently (11:20 UTC) consolidating losses above the USD 18,500 level, with slim chances of a recovery wave.","Similarly, most major altcoins are consolidating losses. ETH is stuck near USD 1,500 with hurdles near USD 1,550. XRP is trading in a range above the USD 0.32 level. ADA remained stable above the USD 0.45 support.","After a sharp bearish wave, bitcoin price found support near the USD 18,500 level. BTC started a consolidation phase above the USD 18,500 support. If there is an upside correction, the price might struggle near USD 19,200. The next major resistance is near the USD 19,500 level, above which the price could start a recovery wave.","On the downside, an initial support is near the USD 18,500 level. The next major support is near the USD 18,000 zone, below which the price could accelerate lower.","Ethereum price also followed a similar path and declined heavily below USD 1,600. ETH even spiked below the USD 1,500 level. It is now as BTC consolidating above the USD 1,500 level. On the upside, an immediate resistance is near the USD 1,550 level. The next major resistance is near USD 1,600, above which the price may perhaps start a decent increase.","On the downside, an initial support is near the USD 1,490 level. The next major support is USD 1,450, below which price could even test USD 1,420.","Cardano (ADA) dived and tested the USD 0.45 support. If there is a fresh increase, the price might face sellers near the USD 0.472 level. The next major resistance is near the USD 0.48 level.","BNB declined below the USD 265 support. It is now stable and consolidating losses above USD 262. If there are more losses, the bears might aim a test of USD 255 or even USD 250 in the near term.","Solana (SOL) is holding the USD 30 support. If the bulls fail to protect the USD 30.00 support, there is a risk of a move towards the USD 28 support. The next major support is seen near USD 26.50.","DOGE settled below the USD 0.060 support. The price is now attempting a recovery wave and facing resistance near USD 0.060. A close above USD 0.060 might start a steady increase to USD 0.0620.","XRP price is stable above the USD 0.32 support. If there is a downside break below USD 0.32, the price may perhaps decline towards the USD 0.305 level. The key breakdown support sits at USD 0.30.","Many altcoins are trading in the red zone, including DOT, MATIC, AVAX, ETC, UNI, LTC, LINK, THETA, ZEC, HT, and GRT. Conversely, HNT gained over 12% and surpassed the USD 4.20 level.","To sum up, bitcoin price is struggling to stay above the USD 18,500 support. If BTC recovers, it may perhaps face sellers near the USD 19,200 level.","_____ ",""],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"ADA","content":"ORGANIZATION"},{"type":"HNT","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Ethereum","Markets"],"authors":["Aayush Jindal"]}