{"summary":"Real-World Data Unlocks the True Value of Tokenization: Chainlink","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/real-world-data-unlocks-the-true-value-of-tokenization-chainlink.htm","publishDate":"2024-04-26T08:58:50","id":21126,"type":null,"title":"Real-World Data Unlocks the True Value of Tokenization: Chainlink","category":["Blockchain News "],"content":["Chainlink Labs director of capital markets Ryan Lovell said traditional finance is not the best use case for tokenization, but real-world data is.","Real-world asset (RWA) tokenization is one of the largest market opportunities in the blockchain industry, with a potential market size in the hundreds of trillions of dollars.","1\/ The tokenized RWA opportunity is measured in trillions of dollars.","By tokenizing an asset, blockchain-enabled superpowers are unlocked, from near-instant settlement to enhanced liquidity, fractional ownership, DeFi integration, & more.","Breaking down the RWA megatrend 🧵👇 pic.twitter.com\/e4WYSB8iAo","— Chainlink (@chainlink) April 23, 2024","","There are an increasing number of projects looking to tokenize a wide variety of assets, including cash, commodities, real estate, and more.","However, Researchers from the blockchain oracle platform Chainlink believe the biggest opportunity is being overlooked in favor of traditional finance","They claim that as financial asset infrastructures become more digital, asset managers will have a “sizable” opportunity to enter the tokenization market. ","In an industry report titled “Beyond Token Issuance,” Chainlink explained where the opportunity lies and how interoperability and real-world data could unlock the value of tokenized assets.","","The report outlined a need for interoperability and real-world data in tokenization to allow asset managers to adapt to the rising demand for tokenized assets. ","“Many asset managers find themselves unable to construct or offer comprehensive digital asset investment products involving tokenized assets. With clients increasingly seeking exposure to tokenized assets, asset managers who are unable to securely incorporate these assets into their product offerings risk falling behind their competitors.”","Given that this was achieved, asset managers would unlock dormant capital with higher returns by enabling them to tap into previously inaccessible markets or asset classes and access global, liquid, 24\/7 markets. ","This would provide greater availability to asset classes that were previously inaccessible or challenging to enter.","With this, asset managers could create novel revenue models with new revenue sources due to the unique opportunities unlocked. They could differentiate their service offerings with novel and bespoke financial products for their clients.","Bridging the gap would unify client portfolios, incorporating both traditional financial assets and digital assets into a single offering. ","And finally, it would reduce the back-office operational costs for asset managers since they have to employ fewer intermediaries, exploiting decentralization. ","Chainlink argues that blockchain technology is evolving into an “integral component of the existing financial ecosystem.” The report highlighted the integration of blockchain and traditional assets into a unified financial ecosystem.","The researchers believe this is the result of ongoing digitization, as blockchains provide better infrastructure for transactions and asset storage.","Although there may be more opportunities to apply tokenization with real-world data, traditional finance should not be overlooked as a target for the technology’s development and adoption.","Chainlink has already become entrenched in the traditional finance market, partnering with companies like ARTA TechFin and ANZ Bank to adapt their services and facilitate the adoption of tokenization. ","Real-world data tokenization is not merely a focus, but a contributor to the growing real-world adoption of blockchain technology."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"ANZ Bank","content":"ORGANIZATION"},{"type":"Ryan Lovell","content":"PERSON"},{"type":"April 23, 2024","content":"DATE"},{"type":"ARTA TechFin","content":"ORGANIZATION"}],"hashtag":["ChainLink","Tokenisation"],"authors":["Harvey Hunter"]}