{"summary":"Arthur Hayes Warns of Institutional Hold on Bitcoin – Innovation or Centralization?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/arthur-hayes-warns-of-institutional-hold-on-bitcoin-innovation-or-centralization.htm","publishDate":"2023-11-06T07:18:44","id":21129,"type":null,"title":"Arthur Hayes Warns of Institutional Hold on Bitcoin – Innovation or Centralization?","category":["Bitcoin News "],"content":["Growing institutional custody service over bitcoin is raising alarms. Arthur Hayes, the founder of Maelstrom Fund, said that bitcoin’s core value of decentralization could be at risk.","In a recent podcast with Blockworks, Hayes portrayed a future where dominant financial establishments could consolidate large amounts of bitcoin. “Let’s say Larry Fink and his [traditional finance] ilk come in and hoover up a large percentage of the freely traded bitcoin in circulation,” he said, highlighting the possibility of bitcoin becoming concentrated in few hands.","On a global scale, more traditional finance institutions are embracing the opportunity to offer crypto custody and trading services (ETF). Including the Standard Charted-backed Zodia, the Swiss bank SGKB, and Deutsche Bank, banks representing centralization and even “agents of the state,” according to Hayes, are potentially centralizing bitcoin.","Hayes pointed out that institutions like BlackRock, a key investor in mining operations, could influence the future of cryptos. “If the BlackRock ETF gets too big, it could actually kill bitcoin because it’s just a bunch of immovable bitcoin that’s just sitting there,” he said.","“[The asset managers] act on what the state tell them to do. [The asset managers] went and bough some bitcoin and they put it in a custodian and it sits there,” Hayes explain. “You can’t actually use the bitcoin. It’s a financial asset. It’s not the actual bitcoin itself.”","Hayes concluded that the institutional custodians would just be “large passive investors” and in a way it may be great for bitcoin’s price in fiat terms. However, there is no definite saying of whether the institutional pursuit of bitcoin control would lead to its eventual downfall.","“Are we, you know, gaining a sugar high today to only engender a massive calamity in the future? I don’t know.” Hayes said.","On the contrary, Berkshire Hathaway’s Charlie Munger just listed bitcoin’s rise as “rat poison” and disruptive threat to traditional finance."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"Standard Charted","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"Berkshire Hathaway","content":"PERSON"},{"type":"Charlie Munger","content":"PERSON"},{"type":"Larry Fink","content":"PERSON"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Blockworks","content":"PERSON"}],"hashtag":["Arthur Hayes","Bitcoin","ETF"],"authors":["Hongji Feng"]}