{"summary":"Bitcoin Cash Enthusiasts Shift Funds to New Gambling ICO, Aiming for 1000% Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-cash-enthusiasts-shift-funds-to-new-gambling-ico-aiming-for-1000-returns.htm","publishDate":"2024-04-18T17:14:00","id":21121,"type":null,"title":"Bitcoin Cash Enthusiasts Shift Funds to New Gambling ICO, Aiming for 1000% Returns","category":["Industry Talk "],"content":["Bitcoin Cash (BCH) faces dimming enthusiasm as the price of the popular payments-focused Bitcoin fork dipped 20% over the last seven days to trade at $484 as of this writing. ","Like the rest of the market, BCH appears to be tracking market leader Bitcoin, which fell 9% over the last week to trade for around $63,650, at the time of writing.","Growing turmoil in the Middle East after an Iranian attack on Israel last weekend prompted the sell-off, which has now slowed down. ","The two Bitcoins are now in the green again after the last 24 hours added 5% and 7% to BTC and BCH respectively.","Investors are stocking up ahead of Bitcoin’s quadrennial halving on Saturday. That’s the day when a software update will halve BTC mining rewards.","History suggests we’re on the cusp of a bull run. The previous three halvings have all increased the price of the original cryptocurrency as the halved supply struggled to meet consistent demand. There are some fears, however, that this year the halving may have already been priced in.","However, BCH’s price chart for the last three months tells a very different story to its namesake.","At the beginning of March, Bitcoin and other leading cryptocurrencies began a rally that peaked by the middle.","BCH initially rallied in step with them, but the momentum fell by March 3.","","On the other end of the chart, BCH rallied from late March to early April, independent of Bitcoin, which remained stagnant over the same period.","Back in 2017, Bitcoiners formed two distinct factions around a software upgrade called Bitcoin Improvement Proposal (BIP) 91. ","The faction that forked from Bitcoin to Bitcoin Cash was in favor of larger block sizes, which allow the network to process more transactions per second.","However, bigger block sizes mean miners need more power to do their business. This makes mining only really viable for universities, private companies and other organizations.","The added speed enabled Bitcoin Cash to become the cryptocurrency of utility for the big block supporters, who see Bitcoin primarily as a means of payments. The original Bitcoin maxis see Bitcoin more as a store of value.","The uncertainty around Bitcoin’s halving underscores the volatility of crypto in general. It is still very much a bet, although early projects like Bitcoin, Ethereum and XRP are a safer bet than others.","Still, the crypto world abounds with plenty of useful applications that hint at a glowing and prosperous future. One such application is the world of GambleFi.","A new ICO for Solana GameFi token Mega Dice (DICE) started this week and it has already raised over $300,000.","","DICE is the native token for Mega Dice’s Telegram-based crypto casino, with certain games requiring the token to play. It can also be used for staking casino cashback, airdrop prizes, and special NFT benefits.","Curious? Prepare for Solana’s hottest new casino and Buy DICE Now"],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Solana GameFi","content":"ORGANIZATION"},{"type":"Mega Dice’s Telegram","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"last weekend","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"$484","content":"MONEY"},{"type":"Bitcoiners","content":"ORGANIZATION"},{"type":"Bitcoin maxis","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"},{"type":"March 3","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"Middle East","content":"LOCATION"},{"type":"7%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"$63,650","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"this week","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Bitcoin Cash","megadice"],"authors":["Tim Hakki"]}