{"summary":"Is It Too Late to Buy Bonk? BONK Price Rises 27% on $720M Volume, Eco-Friendly Coin Hits $4.5M","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-it-too-late-to-buy-bonk-bonk-price-rises-27-on-720m-volume-eco-friendly-coin-hits-4-5m.htm","publishDate":"2024-03-15T16:20:23","id":21123,"type":null,"title":"Is It Too Late to Buy Bonk? BONK Price Rises 27% on $720M Volume, Eco-Friendly Coin Hits $4.5M","category":["Price Predictions "],"content":["Meme coin BONK’s price has risen 28% over the last two weeks, buoyed by a crypto buying frenzy that has driven market leader Bitcoin to new highs.","BONK managed to post $720,000 in overnight trading volume, according to CoinGecko.","Still, it wasn’t enough to keep the novelty cryptocurrency from sliding out of the top five meme coins by market capitalization.","BONK also fell from the 60th largest cryptocurrency by market cap this time last week to 63rd today.","Prices across the entire market have been pulling back over the last 24 hours.","BONK is currently one of the bigger casualties after posting the biggest intraday losses among the top 6 meme coins. BONK fell 15% overnight and currently trades for $0.00002966.","Bitcoin’s (BTC) dramatic pullback in the last 24 hours has made the market cautious. The number one cryptocurrency by market capitalization currently trades at $67,056, making for intraday losses of 7%.","Crypto has been doing well for most of the year-to-date off the back of hype around 11 spot Bitcoin ETFs the SEC approved for trading on January 10.","The ETFs have been doing well. So far they have collectively netted $12 billion, helping Bitcoin set a new all-time high of $73,737.94 yesterday.","On Tuesday, the ETFs took in $1 billion in inflows, with BlackRock’s accounting for the $848 million bulk of it, however the release that day of last month’s hot US inflation readings appear to have dampened enthusiasm for riskier assets.","Over on the trading chart we can see the late February\/early March rally very clearly outlined by volatile peaks and troughs although BONK appears to find strong support at the $0.30 price range. A Relative Strength Index (RSI) of 38 indicates heavy selling that may continue to drive the price down in the near-term.","Money may be draining out of meme coins and other riskier assets today, but investors are flocking to the smaller market cap Green Bitcoin ($GBTC) project ahead of Bitcoin’s halving in just over a month’s time.","Green Bitcoin is working to deliver innovation through a new product: Bitcoin prediction markets boosted with a green, eco-conscious twist.","An unbelievable achievement for the future of crypto, and our incredible community!","Let's hear it for GREEN! pic.twitter.com\/mk0kGrXrVn","— GreenBitcoin (@GreenBTCtoken) March 13, 2024","","As an ERC-20 token, Green Bitcoin leverages the energy efficiency of Ethereum 2.0’s proof-of-stake blockchain to reduce Bitcoin’s carbon emissions by 10,000x.","However, the heart of the project is GBTC’s dynamic staking model, which invites participants to make predictions based on Bitcoin\/USDT price movements to earn rewards.","Green Bitcoin’s roadmap highlights the protocols next steps: launching the predict-2-earn feature and getting listed on top exchanges.","Stay connected with the Green Bitcoin community on X and Telegram for the latest updates and insights.","Secure your GBTC tokens now and join the struggle for a greener world.","Buy GBTC Here",""],"entity":[{"type":"$73,737.94","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"$848 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 13, 2024","content":"DATE"},{"type":"Green Bitcoin","content":"ORGANIZATION"},{"type":"January 10","content":"DATE"},{"type":"BONK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$0.30","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"20 token","content":"DATE"},{"type":"7%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$0.00002966","content":"MONEY"},{"type":"$67,056","content":"MONEY"},{"type":"$GBTC","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$12 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$720,000","content":"MONEY"},{"type":"Bitcoin\/USDT","content":"ORGANIZATION"}],"hashtag":["Bonk","Green Bitcoin","Meme coin"],"authors":["Tim Hakki"]}