{"summary":"‘Crypto is Dead. Long live Crypto’: Veteran DeFi Developer Andre Cronje Urges More Regulation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-is-dead-long-live-crypto-veteran-defi-developer-andre-cronje-urges-more-regulation.htm","publishDate":"2022-04-18T17:00:00","id":21131,"type":null,"title":"‘Crypto is Dead. Long live Crypto’: Veteran DeFi Developer Andre Cronje Urges More Regulation","category":["DeFi News "],"content":[" ","“Crypto is dead. Long live Crypto,” the veteran decentralized finance (DeFi) developer and creator of early DeFi protocol Yearn.Finance (YFI), Andre Cronje, opened a new blog post by saying. He went on to argue that more regulation is needed in the space in which he might have earned significant wealth.","Starting the blog post by sharing an anecdote about how coders often believe they can improve on a piece of software before they eventually realize that the original code was the way it was for a reason, Cronje said the same is also true for crypto.","The rules of monetary policy, debt issuance, bonds, derivatives, and other parts of the financial system all “exist for a reason,” Cronje said, hinting that attempts at changing these rules will prove futile.","“But crypto is the new generation, the generation of ‘we can do it better’,” he added.","Further, Cronje wrote that he has long been vocal about his “disdain of crypto culture,” and equally vocal about his “love for crypto ethos.”","“Reading that might sound weird,” he said, arguing that crypto ethos is a concept like self-sovereign rights, self-custody, and self-empowerment. “Crypto culture is concepts like wealth, entitlement, enrichment, and ego,” Cronje wrote, before adding:","“Crypto culture has strangled crypto ethos.”","According to Cronje, the greed that he sees permeating the crypto industry can only be controlled through regulation. There is a necessity, he argued, for regulating the industry, “not as a mechanism to prevent” (presumably the existence of the space and\/or its development), but to serve “as a mechanism to protect” users.","Lastly, Cronje said that he sees “a new blockchain economy” on the horizon, but noted that this will be “driven by trust, not trustlessness,” and that greed will be kept at bay by new regulations.","“There is an irony in having come full circle, yet I find myself more excited than ever. I won’t step foot into the badlands again, but I’m vastly excited about this new future,” wrote the developer, who in March said that he is leaving the crypto space.","The article was noticed by members of the crypto and DeFi community, with many appearing critical of Cronje’s stance towards the space, using as an argument the amount of money he has earned from it before leaving.","Crypto is dead after I made 9 figures shilling my shitcoins\n\n🤡 https:\/\/t.co\/YqG9GjX1Lz","____","Learn more:\n– Fantom, Other DeFi Tokens Shaken as Top DeFi Developer Andre Cronje Quits\n– YFI Rallies 80% in a Week as Team Promises ‘Aggressive Buybacks’\n\n– DeFi Trends in 2022: Growing Interest, Regulation & New Roles for DAOs, DEXes, NFTs, and Gaming\n– Another Regulatory Challenge for DeFi\n\n– Major Fintech Firm FIS Partners with Fireblocks to Bring DeFi and Crypto to Institutions\n– DeFi and Blockchain ‘Are Real’ – JPMorgan CEO\n\n– DeFi Could Rely On CBDC, But More Bridges With Centralized Finance Are Needed – Expert Panel\n– DeFi ‘Crucial’ for Financial Inclusion, CBDCs Still Welcome Despite Being Centralized"],"entity":[{"type":"March","content":"DATE"},{"type":"Fantom","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Financial Inclusion","content":"ORGANIZATION"},{"type":"Fintech Firm FIS","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Cronje","content":"PERSON"}],"hashtag":["Cryptocurrency","DeFi","Regulation"],"authors":["Fredrik Vold"]}