{"summary":"Bitcoin & Crypto Move Lower Again as Analysts Search for Answers, Point to Risks to Economy","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-crypto-move-lower-again-as-analysts-search-for-answers-point-to-risks-to-economy.htm","publishDate":"2022-06-22T11:42:00","id":21149,"type":null,"title":"Bitcoin & Crypto Move Lower Again as Analysts Search for Answers, Point to Risks to Economy","category":["Bitcoin News "],"content":[" ","The crypto market reversed lower again on Wednesday, after some optimism earlier in the week that the bottom could be behind us. According to analysts, the outlook for crypto is now highly uncertain, with some warning that prices could fall based on historical precedence, and others pointing to risks from the broader economy.","At 10:55 UTC on Wednesday morning, bitcoin (BTC) traded at USD 20,440, down 3.8% for the past 24 hours and down 8.1% for the past 7 days. At the same time, ethereum (ETH) stood at USD 1,090, down 6% for the day and 10.3% for the week.","BTC past 30 days:","Commenting on the situation in the broader financial markets, Mohamed A. El-Erian, President of Queen’s College at Cambridge University, said on Twitter on Wednesday that markets are signaling “concerns” about global economic growth.","“This follows a notable shift in consensus recently among economists to seeing stagflation as the baseline and recession as a rising risk,” the well-known economist said.","From #oil and other commodities to government #bonds and #stocks, #markets are sigaling concerns about the outlook for global economic growth\nThis follows a notable shift in consensus recently among economists to seeing #stagflation as the baseline and #recession as a rising risk pic.twitter.com\/pSAzvjHbOP","Per a comment by the Bitfinex Market Analysts shared with Cryptonews.com, turbulence is back in the crypto space as “high inflation threatens the valuations of all risk assets,” adding:","“Bitcoin, which proved to be an excellent hedge against monetary inflation is being re-rated given the onset of consumer inflation. As central banks continue to reverse previously accommodative policies, we can expect more volatility in the bitcoin price.”","Commenting more specifically on the bitcoin price outlook, Chris Burniske, a partner at crypto venture capital firm Placeholder, said that he is “expecting a rough July” given that bitcoin has never remained under its 200-week moving average for two weeks or more.","The weekly bitcoin chart closed below the 200-week moving average last week, and it still remains to be seen whether it will close below it at the end of this week.","At the time of writing, bitcoin’s 200-week moving average stood at USD 22,416.","Meanwhile, giving an update on his view on the recent bearishness in the bitcoin market, Arthur Hayes, a crypto essayist and former CEO of crypto exchange BitMEX, said he believes that the BTC crash to USD 17,600 last weekend was caused by “a forced seller [who] triggered a run on stops.”","2\/\n\nOver the weekend, while the fiat rails are closed, $BTC dropped to a low of $17,600 down almost 20% from Friday on good volume. Smells like a forced seller triggered a run on stops. pic.twitter.com\/X01FnDw1IL","Hayes added that the market “quickly rallied on low volume” after the sellers were done, adding that he does not know if the selling is over yet. ","“But for those skilled knife catchers, there may yet be additional opportunities to buy coin from those who must whack every bid no matter the price,” Hayes wrote.","Commenting on the same, Joe DiPasquale, CEO of cryptoasset manager BitBull Capital, said earlier this week that he was looking to “observe market reactions to new lows” before forming an opinion on the near-term direction for crypto.","“This proved to be a good strategy, as this week’s drawdown was persistent, without much relief. The [US Federal Reserve] meeting went as expected and Bitcoin fell sharply in the aftermath,” DiPasquale said in an emailed comment.","He added that his firm has marked the price ranges of USD 19,000-USD 20,000 and USD 16,000-USD 17,000 as “areas of interest,” noting that Bitcoin “bounced from the latter.”","“However, unless it successfully reclaims USD 20K with high volumes and bidding, we would not expect the rally to continue,” DiPasquale said, before warning that “the macro trend is likely to remain bearish until we see the Fed changing or at least relaxing their stance in July’s [Federal Reserve] meeting.”","The warning of further losses came as news started to emerge over the last week that bitcoin miners – a group that often has a heavily leveraged exposure to the bitcoin price – have started to dump their holdings of coins.","According to an update from Arcane Research analyst Jaran Mellerud, miners have in May been forced to start liquidating their bitcoin holdings due to the “deteriorating profitability of mining.”","Mellerud wrote in the update that,","“The plummeting profitability of mining forced [publicly listed mining companies] to increase their selling rate to more than 100% of their output in May. The conditions have worsened in June, meaning they are likely selling even more.” ","He added that miners are “some of the biggest whales” in Bitcoin, and that they collectively hold around BTC 800,000.","Meanwhile, Timo Lehes, co-founder of the crypto investment platform Swarm Markets, said in an emailed comment on Tuesday that there’s “much talk now of ‘contagion’ spreading through the system.”","He explained that contagion is always amplified by fear among investors, and compared the situation in the crypto market today with the collapse of the investment bank Lehman Brothers at the beginning of the Great Financial Crisis in 2008. The bank collapsed because it did not have enough liquidity to cover short-term obligations, Lehes explained, adding that some of the bank’s assets in fact were sold later for a higher value.","“There is no easy solution, but more robust liquidity is a good starting place for crypto institutions under stress,” Lehes further said, while reiterating that “the core issues boil down to the same problems as [in the 2008 Financial Crisis].”","Lastly, the risk for further losses was also pointed out by Ian Harnett, the co-founder of the financial market researcher Absolute Strategy Research, who in an interview with CNBC warned that bitcoin could fall to as low as USD 13,000.","Harnett arrived at his conclusion by pointing to past bitcoin bear markets that have often seen the coin fall 80% from its all-time high. ","A drop of that magnitude in 2022 “would take you back to about USD 13,000,” which is a “key support area,” Harnett said.","____","Learn more: \n– Bitcoin Stock-to-Flow Model and Its Proponents Under Fire Again as Failure Becomes Obvious\n– ‘The Reckoning’ & ‘The Best Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n\n– US Fed to Blame for Downturn, Large Crypto Players Have Responsibility Toward Ecosystem – FTX CEO\n– SEC’s Peirce Says Crypto’s Lack of ‘Bailout Mechanism’ Is a Strength; FTX CEO as a ‘White Knight’\n\n– CEL Token Soars as Celsius Shareholder Proposes Recovery Plan, Celsius Pays Compound\n– SNX Rises as Synthetix Sees Surge in Trading Volume"],"entity":[{"type":"Jaran Mellerud","content":"PERSON"},{"type":"8.1%","content":"PERCENT"},{"type":"3.8%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$17,600","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"last weekend","content":"DATE"},{"type":"end of this week","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Mohamed A. El","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Ian Harnett","content":"PERSON"},{"type":"Large Crypto Players Have Responsibility Toward Ecosystem – FTX","content":"ORGANIZATION"},{"type":"Erian","content":"PERSON"},{"type":"Joe DiPasquale","content":"PERSON"},{"type":"Chris Burniske","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"’s [Federal Reserve","content":"ORGANIZATION"},{"type":"Timo Lehes","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Queen’s College","content":"ORGANIZATION"},{"type":"6%","content":"PERCENT"},{"type":"BitBull Capital","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"10.3%","content":"PERCENT"},{"type":"DiPasquale","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"$BTC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Peirce Says Crypto","content":"ORGANIZATION"},{"type":"Harnett","content":"PERSON"},{"type":"Absolute Strategy Research","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Arcane Research","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"[US Federal Reserve","content":"ORGANIZATION"},{"type":"Time’ to Enter Bitcoin Mining as Firms Diversify Amid Bear Market\n\n– US Fed","content":"ORGANIZATION"},{"type":"Great Financial Crisis","content":"ORGANIZATION"},{"type":"Cambridge University","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Arthur Hayes","Bitcoin","Ethereum","Forecast","Inflation","Investing","Market","Mining","Trading"],"authors":["Fredrik Vold"]}