{"summary":"Optimism Gives $41 Million in OP Tokens to NFT Artists in Fourth Airdrop","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/optimism-gives-41-million-in-op-tokens-to-nft-artists-in-fourth-airdrop.htm","publishDate":"2024-02-21T08:09:59","id":21146,"type":null,"title":"Optimism Gives $41 Million in OP Tokens to NFT Artists in Fourth Airdrop","category":["Altcoin News "],"content":["Optimism has launched its fourth airdrop, allocating $41 million in OP tokens specifically prioritizing digital artists.","According to a blog post by Optimism, over 22,998 addresses benefited from the distribution of over 10.3 million OP tokens. The selection was based on the artists’ activity in the Ethereum and Optimism ecosystems during a defined period.","The airdrop aimed to reward creators who have been actively engaging with and contributing to the Ethereum Mainnet and Optimism’s Superchain.","Artists who deployed non-fungible tokens (NFTs) or participated in transactions that involved NFT transfers were considered for the reward.","To qualify for the airdrop, artists needed to meet specific criteria related to their activities between Jan. 10, 2023, and Jan. 10, 2024. The criteria focused on the impact of their work, as measured by the gas fees generated by transactions involving their NFTs.","Furthermore, Optimism provided additional bonuses to artists who exceeded certain thresholds of engagement and creativity. These bonuses were designed to recognize and reward the most impactful contributors within the community, further solidifying the role of digital art in enriching the blockchain experience for all users.","The company set the final reward minimum at 20 OP tokens, and the addresses with rewards lower than 20 would not qualify for the eligibility. The maximum, on the other hand, was capped at 6,000 OP tokens per address.","This fourth airdrop follows a series of distributions, starting with the first on May 31, 2022. Subsequent airdrops occurred on Feb. 8, 2023, and Sep. 13, 2023, with the third dispersing 19.4 million OP tokens, valued at $26 million, to nearly 32,000 addresses.","The addresses were recognized for their participation in the delegation activities of the Optimism Collective, the platform’s decentralized autonomous organization (DAO).","Looking ahead, Optimism has announced it has approximately 560 million OP tokens reserved for future airdrops.","“Did you miss Airdrop #4?” said Optimism on social media. “Multiple drops allow us to refine this mechanism, fostering positive-sum behavior.”","7\/ Did you miss Airdrop #4?","Roughly ✨560M OP✨ remains for future drops! Multiple drops allow us to refine this mechanism, fostering positive-sum behavior.","— Optimism (@Optimism) February 20, 2024","","“Keep building, keep dreaming, and as always stay Optimistic!” said Optimism."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"February 20, 2024","content":"DATE"},{"type":"Ethereum Mainnet","content":"PERSON"},{"type":"$26 million","content":"MONEY"},{"type":"Jan. 10, 2024","content":"DATE"},{"type":"May 31, 2022","content":"DATE"},{"type":"Jan. 10, 2023","content":"DATE"},{"type":"Sep. 13, 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"Feb. 8, 2023","content":"DATE"}],"hashtag":["Airdrop","NFT","Optimism"],"authors":["Hongji Feng"]}