{"summary":"Binance.US market depth plunged by 78% after being sued by the SEC — raising concerns over liquidity as market makers exit the platform.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234208\/binance-market-depth-sec-lawsuit","publishDate":"2023-06-12T08:08:51","id":2114,"type":null,"title":"Binance.US sees 78% decline in market depth following SEC lawsuit","category":["Exchanges"],"content":["Binance.US has experienced a staggering decline in market depth across the top 25 crypto assets — dropping by 78% since the <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">announcement<\/a> of the Securities and Exchange Commission's lawsuit brought against it, Binance and CEO Changpeng Zhao on June 5.","The primary reason behind the plummeting market depth can be attributed to the swift departure of market makers from the Binance.US platform in the wake of the lawsuit, <a href=\"https:\/\/twitter.com\/kaikodata\/status\/1668206152377663488?s=46&amp;t=Se54l14sCsYxHI60OfmIMA\" data-v-f87c67ca=\"\">according<\/a> to crypto data firm Kaiko — sparking concerns about liquidity and raising questions about the future of the exchange.&nbsp;","Earlier today, Wintermute and Keyrock told The Block they were two of the firms who had exited Binance.US amid the broader retreat of market makers.","","","Market depth is a key metric indicating the liquidity and depth of order books — referring to the volume of buy and sell orders at different price levels. A decrease in market depth implies reduced liquidity and potential challenges for traders executing orders.","Market makers are crucial in providing liquidity by quoting bid and ask prices. Their sudden departure has left Binance.US with limited liquidity, making it increasingly challenging for traders to execute orders effectively.","The significant decline in market depth raises concerns for traders who rely on robust liquidity to execute trades. With the reduced availability of buy and sell orders, traders may face increased slippage and potential difficulties in obtaining desired trade execution prices. The lack of liquidity may also undermine the overall efficiency and attractiveness of the exchange, potentially further damaging it's reputation and ability to attract users.","The SEC <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">sued<\/a> Binance last week over several alleged violations of U.S. securities laws, which the exchange <a href=\"https:\/\/www.theblock.co\/post\/233186\/binance-says-it-will-defend-our-platform-vigorously-from-sec-lawsuit\" data-v-f87c67ca=\"\">said<\/a> it would defend rigorously. According to crypto analytics provider Nansen, over $2.5 billion in net outflow has <a href=\"https:\/\/pro.nansen.ai\/exchange-flows\" data-v-f87c67ca=\"\">left<\/a> Binance during the past seven days — plus over $112 million from Binance.US.","However, Binance CEO Changpeng Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1667554966662266883\" data-v-f87c67ca=\"\">disputes<\/a> such figures.","<em data-v-f87c67ca=\"\">Update: Added confirmation Wintermute and Keyrock have exited Binance.US.<\/em>","<em data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, sits on The Block's board of directors and holds an equity stake in the company.<\/em>"],"hashtag":["BINANCE","SEC"]}