{"summary":"Hong Kong Financial Regulator Prepared to Accept Applications for Spot Crypto ETFs","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/hong-kong-financial-regulator-prepared-to-accept-applications-for-spot-crypto-etfs.htm","publishDate":"2023-12-22T16:34:25","id":21145,"type":null,"title":"Hong Kong Financial Regulator Prepared to Accept Applications for Spot Crypto ETFs","category":["Blockchain News "],"content":["Hong Kong’s Securities and Futures Commission (SFC) has expressed its readiness to consider applications for spot crypto exchange-traded funds (ETFs).","The SFC and the Hong Kong Monetary Authority (HKMA) have issued a joint circular addressing the increasing interest in launching spot crypto ETFs. While the SFC had previously allowed licensed crypto providers to offer cryptocurrency futures ETFs in Hong Kong, spot ETFs had not been granted similar permission.","However, the SFC has now stated that it is “prepared to accept applications for the authorization of other funds with exposure to cryptocurrencies,” including spot crypto ETFs.","With the collaboration of the two regulators, the SFC stated that it had reviewed its policy for intermediaries involved in virtual asset-related activities. The SFC is now ready to receive applications for the authorization of various funds, including Virtual Asset Spot exchange-traded funds (VA spot ETFs), alongside existing crypto futures ETFs.","The regulatory approach in Hong Kong has evolved, departing from the “professional-investors-only” framework established in 2018. The SFC updated its rules in October to broaden investor participation in spot crypto and ETF investing.","In a circular issued on December 22, the SFC outlined criteria for funds to “directly invest in identical spot Virtual Asset (VA) tokens available to the Hong Kong public on SFC-licensed Virtual Asset Trading Platforms (VATPs).” The SFC emphasized that cryptocurrency transactions conducted by these ETFs must occur through SFC-licensed crypto platforms or authorized financial institutions.","The updated guidelines by the SFC allow for both in-kind and in-cash subscription and redemption processes. Management companies are required to transfer cryptocurrencies to the custody accounts of SFC-authorized providers, whether held locally or overseas.","To determine the valuation of spot ETFs, management companies are advised to adopt an indexing approach, relying on trade volume data from major crypto trading platforms. They also added that funds planning to have crypto exposure exceeding 10% of their net asset value must undergo prior consultation with the SFC.","They state that the SFC is prepared to accept applications for the authorization of funds with exposure to virtual assets, including virtual asset spot exchange-traded funds (VA spot ETFs).","In contrast to the widespread crackdown on cryptocurrency activities in mainland China, Hong Kong has shown openness to crypto firms, actively encouraging collaboration with banks throughout the year.","Hong Kong’s increasing significance in the blockchain and crypto sectors is notable, with over 11% of global venture capital funding in the industry directed toward enterprises in Hong Kong and Singapore. This marks a significant rise from the 2% allocation observed in 2021.","The shift in funding is attributed to various factors, including challenges faced by the FTX crypto exchange, prompting strategic reassessments by U.S.-based crypto companies.","In October 2022, Hong Kong issued policy statements on cryptocurrencies to bolster its status as a global financial hub. In June, the city introduced its crypto licensing system for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services.","This announcement coincides with speculation that the U.S. Securities and Exchange Commission (SEC) may approve a spot bitcoin ETF in the early weeks of the upcoming year."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"SFC","content":"ORGANIZATION"},{"type":"December 22","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"’s Securities and Futures Commission (SFC","content":"ORGANIZATION"}],"hashtag":["Hong Kong","Securities and Future Commision","Spot Crypto ETFs"],"authors":["Hassan Shittu"]}