{"summary":"CoinFLEX’s USD 47M Recovery Token Plan Questioned by Crypto Observers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinflexs-usd-47m-recovery-token-plan-questioned-by-crypto-observers.htm","publishDate":"2022-06-28T08:22:00","id":21140,"type":null,"title":"CoinFLEX’s USD 47M Recovery Token Plan Questioned by Crypto Observers","category":["Altcoin News "],"content":[" ","Crypto derivatives exchange and yield platform CoinFLEX aims to turn the debt of a “high integrity” individual into a token called Recovery Value USD (rvUSD) in order to fund other customers’ withdrawals. Not everyone is impressed with these plans. ","The exchange will issue rvUSD 47m at a price of USDC 1 per coin, cumulatively raising USD 47m.","Potential buyers will be offered a 20% Annual Percentage Rate (APR) rate in addition to other perks, including 2.5M FLEX coins (USD 2.3m) distributed proportionally across all holders.","Meanwhile, a number of industry observers were quick to argue that there are resemblances between the plan and Ponzi schemes.","“Can anyone remind me, what’s that thing called where you need new investors in order to pay out old investors?” said Joey Politano, an economist and a Financial Management Analyst at the US Bureau of Labor Statistics.","“Lent money and can’t get the debt back? No problem, DeFi has the solution! Issue a random shitcoin and let market participants fight each other for the privilege of bagholding distressed debt, but with no collections mechanism,” said another Twitter user.","They also pitch a pivot into a new model with increased transparency, pseudonymous balance tracking, and public liquidation points. Little do they know, they just accidentally reinvented DeFi. pic.twitter.com\/pMhcrDXv5T","Last week, CoinFLEX announced that it is pausing withdrawals due to extreme market conditions as well as uncertainty around a certain counterparty whose account went into negative equity during recent market volatility.","CoinFLEX wrote in the rvUSD issuance whitepaper that, under normal circumstances, they would auto-liquidate a position that “runs low on equity at prices that are prior to the zero-equity price.”","However, the company said that the individual had consistently met every margin call before this incident and also had a “nonliquidation recourse account,” meaning that they would not be liquidated in exchange for personally guaranteeing their account equity.","“The Individual is a high integrity person of significant means, experiencing temporary liquidity issues due to a credit (and price) crunch in crypto markets (and even noncrypto markets) who has significant shareholdings in several unicorn private companies and a large portfolio,” the crypto platform said.","In a blog post, CoinFLEX CEO Mark Lamb claimed that there is “significant interest” in the tokens among some potential large buyers. Lamb added that if the rvUSD token issuance is fully subscribed, the platform will resume withdrawals starting Thursday, June 30.","Meanwhile, the platform’s native token FLEX has been trending lower recently. It dropped 47% in a single day and 80% in a week, trading at USD 0.917 (at 7:30 UTC). Overall, it is up 354% in a year and down 88% from its all-time high of USD 7.56 seen last December.","____","Learn more:\n– CoinFLEX Pauses Withdrawals\n– Three Arrows Default Notice\n\n– BlockFi, Crypto.com, and Others Come Forward as Three Arrows Hires Advisers, Babel Finance Pauses Withdrawals\n– CEL Token Soars as Celsius Shareholder Proposes Recovery Plan, Celsius Pays Compound\n\n– Smaller Exchanges Could Fall Due to Confusing ‘Web of Relationships’, Report Warns\n– These Are the Types Crypto Projects that Could be Bailed Out According to Binance CEO"],"entity":[{"type":"June 30","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"Joey Politano","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Financial Management Analyst","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"88%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"354%","content":"PERCENT"},{"type":"Mark Lamb","content":"PERSON"},{"type":"7:30","content":"TIME"},{"type":"US Bureau of Labor Statistics","content":"ORGANIZATION"},{"type":"Others Come Forward as Three Arrows Hires Advisers","content":"ORGANIZATION"},{"type":"Babel Finance Pauses Withdrawals\n– CEL Token Soars","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Recovery Value USD","content":"ORGANIZATION"}],"hashtag":["Altcoins","Derivatives","Exchange","USDC"],"authors":["Ruholamin Haqshanas"]}