{"summary":"Here’s Why Binance’s Changpeng Zhao Got a ‘Pretty Light’ 4-Month Prison Sentence","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/why-binance-changpeng-zhao-got-pretty-light-4-month-prison-sentence.htm","publishDate":"2024-05-03T08:15:14","id":21150,"type":null,"title":"Here’s Why Binance’s Changpeng Zhao Got a ‘Pretty Light’ 4-Month Prison Sentence","category":["News "],"content":["Binance founder Changpeng Zhao received a far more lenient prison sentence than anticipated at his Seattle court hearing on Tuesday.","Zhao pleaded guilty to money laundering violations late last year. But the judge ultimately imposed a mere four months of prison time. It starkly contrasts the fate of his former rival, FTX founder Sam Bankman-Fried, who was sentenced to 25 years last month.","Judge Richard Jones’ imposed sentence is much lighter than the 36 months prosecutors sought. This can be attributed to Zhao’s cooperation with investigators and a wave of positive character references. Judge Jones most likely opted for a less severe sentence, believing Zhao is unlikely to commit the offence again.","And no, his sentence has nothing to do with his cryptic tweet about the number “4.”","Zhao sent a letter to the judge before his sentencing. In it, he admitted there was “no excuse” for failing to set up proper compliance controls at Binance. He also assured the court this would be his only brush with the criminal justice system.","Aron Solomon, JD, chief strategy officer for Amplify, said there are a few key reasons for Zhao’s “pretty light” sentence.","According to the legal expert, one key factor was Zhao’s decision to strike a plea deal with prosecutors. This cooperation, by admitting guilt and assisting authorities, demonstrates that Zhao accepts responsibility for his actions. Judges often view such behavior positively when determining punishment.","“Deeply tied into this is the fact that CZ didn’t have any prior criminal record also likely worked in his favor. As a first-time offender, the judge may have felt a shorter sentence was appropriate, with the hope he could be rehabilitated,” Solomon told Cryptonews.","Adding to his legal woes, Zhao resigned as Binance CEO in November. The plea deal he struck included a $50m personal fine, while Binance itself agreed to a hefty $4.3b settlement in fines and compensation.","“This pretty profound level of cooperation with authorities was surely seen as a mitigating factor in sentencing,” Solomon added. “So it wasn’t one thing but rather the combination of the plea deal, admission of guilt, lack of criminal history, and cooperation with the investigation. One more thing I’d add is how uncomfortable courts and judges are with crypto – they honestly have no idea what to do with these cases.”","According to Katie Charleston, founding attorney at Katie Charleston Law, PC, Zhao’s guilty plea and cooperation with authorities “absolutely influenced the judge” in his sentencing.","“CZ didn’t steal from his customers and deny it,” she said. “Here, CZ admitted his wrongdoing, and his violations were more regulatory than tortious. However, one could argue that a money business allowing undercover financial transactions to terrorists and criminals could cause more damage.”","Letters of support submitted to the court requesting leniency also likely played a role, according to the attorney. Additionally, the sealed documents presented during sentencing might have revealed further mitigating factors that haven’t been made public.","Meanwhile, Phillip Shoemaker, executive director of Identity.com, was surprised that Zhao received jail time despite the hefty fines he and Binance paid.","“I do wonder if the government pulled a fast one on CZ here, because it seems unfair when considering the billions already paid out in fines,” he said. “If the industry wants to be honest with itself, nobody was doing AML back in the day. But this clearly has changed for the better in recent years.”","He suggested the sentence indicates the government might revisit other past offenses that are thought to be settled."],"entity":[{"type":"Jones","content":"PERSON"},{"type":"Aron Solomon","content":"PERSON"},{"type":"$4.3","content":"MONEY"},{"type":"Richard Jones","content":"PERSON"},{"type":"Solomon","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Katie Charleston","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Phillip Shoemaker","content":"PERSON"},{"type":"$50m","content":"MONEY"},{"type":"Seattle","content":"LOCATION"},{"type":"Katie Charleston Law","content":"ORGANIZATION"}],"hashtag":["Binance","Changpeng Zhao"],"authors":["Shalini Nagarajan"]}