{"summary":"Telegram to Introduce USDT Payments With Telegram Wallet and the Open Network","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/usdt-payments-launching-with-telegram-wallet-and-the-open-network.htm","publishDate":"2024-04-19T19:42:15","id":21151,"type":null,"title":"Telegram to Introduce USDT Payments With Telegram Wallet and the Open Network","category":["Blockchain News "],"content":["Encrypted messaging platform Telegram and Tether have joined forces, enabling users to send USDT payments through The Open Network (TON) and the Telegram wallet, as formally announced by the companies’ founders on Friday at Token2049 in Dubai.","According to the official announcement, Telegram users can now purchase USDT and send the stablecoin to others through TON, an independent blockchain network previously developed by the messaging app.","With a user base exceeding 900 million globally, this integration could drive a surge in the stablecoin’s adoption.","We are making history!\nTON + Telegram + Tether 🔥 pic.twitter.com\/VXz4vljUHt","— andrew.ton (@rogozov) April 19, 2024","","“We’re excited to bring USDT to The Open Network because we support its vision of an open and decentralized internet and a borderless financial system,” said Paolo Ardoino, CEO at Tether. “The launch of USDT on TON will allow seamless value transfer globally in a simple experience that can match even the traditional financial system.”","News of the collaboration comes amidst massive restructuring for Tether, which announced four new business divisions focused on sustainability, data, finance, and education yesterday.","Tether Advances Beyond Stablecoins, Introduces New Framework Embracing Core Divisions to Foster Resilient, Future-Ready Financial Systems","Read more:https:\/\/t.co\/O9ljdyaHw4","— Tether (@Tether_to) April 18, 2024","","“Tether’s expansion beyond its well-established USDT stablecoin signifies a paradigm shift in its approach to financial empowerment,” a Thursday statement from Tether reads.","“By focusing on sustainable solutions adaptive to the needs of individuals, communities, cities and countries, responsible Bitcoin mining, Artificial Intelligence infrastructure and decentralized communication platforms,” the company continued, “Tether is actively contributing to a future-proof financial and tech ecosystem.”","Expanding beyond the company’s flagship stablecoin may prove to be a promising long-term strategy, given U.S. lawmakers’ recent efforts to advance legislation related to stablecoins.","On Wednesday, representatives Cynthia Lummis and Kirsten Gillibrand introduced the Lummis-Gillibrand Payment Stablecoin Act of 2024. The act seeks to establish regulatory frameworks for stablecoin issuers at federal and state levels.","🚨@gillibrandny and I are introducing the most comprehensive stablecoin bill to date.","Crypto assets are revolutionizing the world and as the undisputed leader in financial innovation, the U.S. must embrace crypto assets, but it cannot be done without clear rules for stablecoins. pic.twitter.com\/vwRUEBUdsl","— Senator Cynthia Lummis (@SenLummis) April 17, 2024","","The proposed act would require stablecoin issuers to maintain one-to-one reserves, prohibit unbacked algorithmic stablecoins, and prevent unauthorized use of stablecoins by both issuers and users.","“Passing a regulatory framework for stablecoins is absolutely critical to maintaining the U.S. dollar’s dominance, promoting responsible innovation, protecting consumers and cracking down on money laundering and illicit finance,” said Senator Gillibrand.","It remains to be seen how emerging stablecoin regulation could impact Tether and Telegram’s plans for increased public use of peer-to-peer payment systems."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Artificial Intelligence","content":"ORGANIZATION"},{"type":"Ready Financial Systems","content":"ORGANIZATION"},{"type":"Senator Gillibrand","content":"PERSON"},{"type":"April 18, 2024","content":"DATE"},{"type":"Lummis","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"April 17, 2024","content":"DATE"},{"type":"April 19, 2024","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Gillibrand","content":"PERSON"}],"hashtag":["Telegram","Tether","USDT"],"authors":["Julia Smith"]}