{"summary":"Blockchain Gaming Adoption Jumps, But Regulation & Education Obstacles Are High – Survey","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/blockchain-gaming-adoption-jumps-but-regulation-education-obstacles-are-high-survey.htm","publishDate":"2021-12-17T18:17:00","id":21159,"type":null,"title":"Blockchain Gaming Adoption Jumps, But Regulation & Education Obstacles Are High – Survey","category":["Blockchain News "],"content":[" ","While fund flows and user adoption figures continue to skyrocket in the blockchain gaming industry, some of the main challenges that hamper the sector’s further growth include regulatory uncertainty, need for user-oriented education initiatives, and technology limitations, among others, according to a recent report released by the Blockchain Game Alliance (BGA).","Figures sources from dapp information provider DappRadar indicate a rapid adoption of blockchain gaming, with a 6,566% increase in daily unique active wallets (UAW) that interacted with game-related smart contracts. ","This is up from 23,100 in the third quarter of 2020 to 1.54m daily in the third quarter of this year.","The number of wallets related to gaming activity was up 2,453% from 29,563 during the first week of this year to 754,000 in the third quarter of 2021, according to the figures from the report.","A survey carried out among industry representatives by the association, collected online between September 2 and September 24, 2021, shows that 68% of respondents believe play-to-earn has served as the largest driver behind industry growth. Some 85% of respondents say true ownership of digital goods is the key aspect of blockchain games.","At the same time, 52% point to regulatory uncertainty as their main concern and the most important challenge that the industry faces. ","For 43% of respondents, the need for more education about the core concepts that underpin blockchain gaming is also a key issue to be tackled, according to the BGA’s data.","“59% of the respondents said that users who do not understand blockchain gaming assume that it is a Ponzi scheme or scam,” the report states, underlining the need for more education-oriented initiatives towards prospective users.","The report noted that,","“Other issues included the current limitations of blockchain technology, particularly with reference to scaling (including high transaction fees and slow speed of transactions), and poor user experience, which were cited equally by 42% of respondents.” ","At the same time, only 13% of respondents said that resistance from major industry players, or their lack of will to adopt decentralization technologies, could mount a challenge to blockchain gaming.","____","Learn more:\n– Gaming Giant Nexon America Starts Accepting Bitcoin, Ethereum For In-Game Purchases\n– Binance Smart Chain, Animoca To Bet USD 200M On Crypto Gaming Startups\n\n– This Trend in Axie Infinity Raises ‘Sustainability Concerns’ Despite Strong Growth\n– Gaming Token Gala Jumps Amid Increased Gaming Sector Bullishness\n\n– Crypto Gaming Could Become Blockchain ‘Killer App’, Says Atari Exec\n– 72% of Surveyed Game Developers Interested in Using NFTs and Blockchain\n\n– Play-to-Earn Gaming is Booming: From Axies to Lightnite, Here’s What’s Out There\n– Crypto-Gaming Is Exploding Into the Playful Future"],"entity":[{"type":"third quarter of 2020","content":"DATE"},{"type":"third quarter of 2021","content":"DATE"},{"type":"2,453%","content":"PERCENT"},{"type":"September 2","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"Earn Gaming","content":"LOCATION"},{"type":"72%","content":"PERCENT"},{"type":"52%","content":"PERCENT"},{"type":"Surveyed Game Developers Interested","content":"ORGANIZATION"},{"type":"Blockchain Game Alliance (BGA","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"6,566%","content":"PERCENT"},{"type":"Lightnite","content":"LOCATION"},{"type":"59%","content":"PERCENT"},{"type":"third quarter","content":"DATE"},{"type":"BGA","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"UAW","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"Gaming Giant Nexon America Starts Accepting Bitcoin","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"Atari","content":"ORGANIZATION"},{"type":"Infinity Raises ‘Sustainability Concerns’ Despite Strong Growth\n– Gaming Token Gala Jumps Amid Increased Gaming Sector Bullishness\n\n– Crypto Gaming Could Become Blockchain","content":"ORGANIZATION"},{"type":"68%","content":"PERCENT"},{"type":"September 24, 2021","content":"DATE"}],"hashtag":["Adoption","Blockchain","Education","Fees","Gaming","Regulation","Scalability"],"authors":["Jaroslaw Adamowski"]}