{"summary":"DeFi Experiment: A Loan Issued With Ethereum Domain Name as Collateral","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/defi-experiment-a-loan-issued-with-ethereum-domain-name-as-c-6323.htm","publishDate":"2020-04-17T11:06:00","id":21158,"type":null,"title":"DeFi Experiment: A Loan Issued With Ethereum Domain Name as Collateral","category":["DeFi News "],"content":["NFT-backed loan provider Rocket LP DAO has signed off the first loan in history that for a collateral has only an Ethereum domain name.","In a Medium post, director of operations at Ethereum Name Service (ENS), Brantly Millegan, says that he received the world’s first ENS-backed Non-fungible token (NFT) loan.","To clarify, ENS is naming system based on the Ethereum blockchain that enables users to have simple domain names (e.g. Vitalik.eth). Rocket is issuing loans backed by NFTs as collateral, and NFTs are unique tokens deployed on a blockchain network.","Millegan goes on to describe the process: Rocket LP DAO (decentralized autonomous organization) issued the loan, while Millegan sent his ENS name brantly.eth to the DAO’s wallet as collateral. This is possible as ENS runs on Ethereum, so ENS names can interact with other smart contracts on the blockchain and the infrastructure built to support Ethereum-based NFTs.","Rocket issued a c. USD 1,000 (wETH 6.5) loan backed only by one brantly.eth domain name. The loan must be repaid in 90 days with a 15% interest rate.","He could still use and manage his ENS name, Millegan adds. But that ability could be taken away if he doesn’t pay back the loan. ENS names have two levels of authority: the Registrant and the Controller, he explains. The former is the owner of the ENS name and is usually also the Controller, a person who sets the record of the name. But the Registrant can assign the Controller and let them manage records for a while. Millegan assigned Rocket as the Registrant and Millegan remained as a Controller.","Some commenters, though, are somewhat more critical of this deal. They believe that the interest rate is too high. “Nice use case, [ridiculous] valuation. Might be worth 1\/10th of that on the market,” adds ‘0xcat.eth’.","Meanwhile, Rocket LP DAO was founded in January this year by Alex Masmej. Masmej just recently completed the sale of his personal tokens on the Ethereum blockchain, ALEX, raising over USD 20,000 to move to San Francisco and invest in his next startup – “savings account most likely,” as he told Cryptonews.com."],"entity":[{"type":"January this year","content":"DATE"},{"type":"San Francisco","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Brantly Millegan","content":"PERSON"},{"type":"Millegan","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"Rocket LP DAO","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Alex Masmej","content":"PERSON"}],"hashtag":["Adoption","DeFi","Ethereum","Financial Services"],"authors":["Sead Fadilpašić"]}