{"summary":"BNB Chain Reveals Greenfield Tech Roadmap, Neon EVM Integrates Ledger Live + More News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bnb-chain-reveals-greenfield-tech-roadmap-neon-evm-integrates-ledger-live-more-news.htm","publishDate":"2023-12-12T14:00:59","id":21165,"type":null,"title":"BNB Chain Reveals Greenfield Tech Roadmap, Neon EVM Integrates Ledger Live + More News","category":["Blockchain News "],"content":["Get your daily, bite-sized digest of crypto and blockchain-related news – investigating the stories flying under the radar of today’s news.","In this edition:","__________","BNB Chain has published its tech roadmap for the decentralized storage network BNB Greenfield. Per the announcement, the roadmap targets Web2 and Web3 developers, as well as users, by enhancing performance, development experiences, and multichain capabilities.","BNB Greenfield aims to achieve mass blockchain adoption, it said. The design of its roadmap is based on three key principles focused on high performance, simplified development experiences, and a multichain platform.","It focuses on:","Between Q4 of 2023 and Q1 of 2024, Greenfield will enable smart contracts as resource owners for better permission control from the BSC\/opBNB, improve SP performance for sealing objects and garbage collection, and simplify SP exit processes.","Neon EVM, an Ethereum Virtual Machine on Solana, announced its integration with Ledger Live, the official desktop and mobile application for Ledger hardware wallets.","The integration supports Neon EVM’s main currency and a list of ERC-20 tokens so users can engage in Ethereum-like transactions with an improved user experience through real-time balance updates and increased security via Ledger’s hardware wallet and Web App integration.","The integration aligns with the increasing demand for secure and user-friendly storage solutions, the announcement said. It noted that it also eliminates the need for third-party solutions, offering users a seamless experience.","Web3 gaming platform Immutable has officially announced its partnership with the premier third-party payments provider Transak. Per the press release, this move is set to improve services for seamless digital transactions. Additionally, Transak will become the primary payment partner for Immutable Checkout on its zkEVM platform.","The integration enables a seamless purchase flow, while smart routing capabilities enable users to add funds during the purchasing process.","Immutable Checkout, a transaction infrastructure for games, offers a configurable interface designed to increase payment conversion rates through integration. Transak’s on-ramp, off-ramp, and NFT Direct solutions (primary and secondary sales) will be embedded within the Checkout product to provide players with optionality when buying digital assets. This functionality will be available to users within Immutable Passport as well.","Transak operates across 155 countries, offering clients diverse payment methods ranging from cards to bank transfers for 170 cryptocurrencies on over 75 blockchains.","Crypto exchange Bybit introduced Aurora AI, an advanced AI-powered recommendation tool designed to simplify and elevate the bot trading experience for investors at all skill levels.","According to the press release, Aurora AI analyzes historical market data to identify 18 sets of optimal strategy parameters, emphasizing factors such as yield, arbitrage frequency, and drawdown risk.","Users can input their desired investment amount and copy the trading strategies provided by Aurora AI directly, Bybit said.","The exchange added that Aurora AI has an “outstanding track record.” The Futures Grid Bot’s AI strategy has a win rate exceeding 70%, it claimed, “underscoring its effectiveness in generating consistent returns.”","Meanwhile, Bybit also unveiled the “USDC Wintry Draw” campaign, offering a total prize pool of 75,000 USDC. The event will run from December 11, 2023, to January 10, 2024.","Participants can trade USDC Derivatives at least four times with a minimum volume of $10,000 for a chance to win. Non-VIP users depositing 50,000 USDC and maintaining it for seven days are eligible to win 500 USDC on a first-come, first-served basis, up to a total of 20,000 USDC."],"entity":[{"type":"Aurora","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"December 11, 2023","content":"DATE"},{"type":"January 10, 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"USDC Derivatives","content":"ORGANIZATION"},{"type":"Futures Grid Bot","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine on Solana","content":"ORGANIZATION"},{"type":"BNB Greenfield","content":"ORGANIZATION"},{"type":"Transak","content":"ORGANIZATION"},{"type":"Bybit","content":"PERSON"},{"type":"Greenfield","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AI","Binance","Blockchain","ByBit","Decentralization","Gaming","Ledger","Payments","Smart Contract","Trading","USDC","Wallet"],"authors":["Sead Fadilpašić"]}