{"summary":"Shiba Inu Investors Move to New ICO, Targeting 1000% Returns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/shiba-inu-investors-move-to-new-ico-targeting-1000-returns.htm","publishDate":"2024-05-08T21:12:23","id":21164,"type":null,"title":"Shiba Inu Investors Move to New ICO, Targeting 1000% Returns","category":["Industry Talk "],"content":["As Shiba Inu (SHIB) threatens a bearish breakout of a key technical pattern, investors are moving their attention to a new ICO as they target 1000% returns that they are unlikely to get with SHIB.","SHIB has formed a pennant structure in the past two months as it continued to consolidate below its 2024 highs.","Though pennant structures can break in either a bullish or bearish direction, SHIB risks seem tilted towards fresh downside.","That’s because SHIB has found strong resistance twice in the last few weeks at its 50DMA.","That suggests that the bears remain in control of this market.","If SHIB does break below its current pennant structure, as well as below its 100DMA, sell pressure could surge.","The first bearish target would be the support zone at $0.000018. The next target would be the late 2024 highs and early 2023 highs in the $0.000015-16 area.","With SHIB likely to drop in the near term, investors are looking for alternatives that might offer quick upside.","One new ICO called 5thScape has caught the attention of analysts at Cryptonews.","","Exciting new ICO 5thScape has been generating a lot of hype recently.","5thScape is a first-of-its-kind crypto-powered VR\/AR project. The project is developing its own VR\/AR headset and VR\/AR ecosystem, the economics of which will be powered by the blockchain.","And the exciting new ICO’s surging presale suggests investors are betting it will become a market leader. 5thScape has already raised north of $5.8 million.","🌟 Unlock new dimensions with 5th Scape! Dive into adrenaline-pumping battles, precision archery, and high-speed racing—all within the limitless virtual realm. Holding 5SCAPE tokens unlocks exclusive benefits like free games, discounts, and seamless in-world transactions.\nThe… pic.twitter.com\/LNO30KXRPW","— 5th Scape (@5th_scape) April 20, 2024","","Its token 5SCAPE is currently priced at $0.00327, a steep discount from its planned launch price of $0.1. That means investors who get involved now can lock in potential gains of 200%.","Given its total token supply of 5.21 billion, investors who get in now are essentially buying into the project at a market cap of $17 million.","But if 5thScape starts to gain traction as a market leader, it could easily become a $100+ million market cap coin.","To kick start its web3 push, 5thScape is busily building a VR MMA game called MMA Cage Conquest.","🎮 Calling all VR and MMA aficionados! Get ready to be blown away as 5thScape is about to redefine virtual combat with \"MMA Cage Conquest\" – a game that thrusts you into the heart-pounding world of MMA in VR. 🥊","🌟 Brace yourselves for the \"MMA Cage Conquest\" launch on the Meta… pic.twitter.com\/MHbKgKHIxb","— 5th Scape (@5th_scape) May 3, 2024","","There is every possibility that presale investors could lock in 1,000% gains.","$5SCAPE token can be bought today with ETH, MATIC, USDT, BNB, or card.","80% of the total token supply is available for purchase in the presale.","Buy 5SCAPE Here","Here’s why 5SCAPE is one of popular crypto presale analyst Clinix Crypto’s top picks for 2024.","https:\/\/www.youtube.com\/watch?v=p_GdTI2qdfA",""],"entity":[{"type":"80%","content":"PERCENT"},{"type":"$0.1","content":"MONEY"},{"type":"16","content":"DATE"},{"type":"$0.00327","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"1,000%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"$5.8 million","content":"MONEY"},{"type":"MMA Cage Conquest\"","content":"ORGANIZATION"},{"type":"200%","content":"PERCENT"},{"type":"1000%","content":"PERCENT"},{"type":"$5SCAPE","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$0.000018","content":"MONEY"},{"type":"April 20, 2024","content":"DATE"},{"type":"MMA","content":"ORGANIZATION"},{"type":"May 3, 2024","content":"DATE"},{"type":"$0.000015","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"MMA Cage Conquest","content":"ORGANIZATION"},{"type":"Shiba Inu (SHIB","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"Clinix Crypto","content":"PERSON"}],"hashtag":["SHIB","Shiba inu"],"authors":["Joel Frank"]}