{"summary":"Crypto Market Bolstered By 150% Assets Under Management Surge and Bitcoin’s Market Resilience: Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-market-bolstered-by-150-assets-under-management-surge-and-bitcoins-market-resilience-report.htm","publishDate":"2023-12-15T11:06:56","id":21166,"type":null,"title":"Crypto Market Bolstered By 150% Assets Under Management Surge and Bitcoin’s Market Resilience: Report","category":["Bitcoin News "],"content":["The digital asset market recorded positive developments throughout the year with significant institutional entries to the market in Q4 2023 as asset prices continue on an upward trajectory.","CCData’s Q4 2023 Market Outlook report shows a stronger market sentiment, Bitcoin (BTC) dominance, surge in cryptocurrency funds and institutional demand as well as rising optimism for a spot BTC Exchange Traded Fund (ETF).","📊 CCData's 2023 Q4 Outlook Report is now available!","Key highlights:","📈 Bitcoin's 156% YTD returns\n💼 CME leading in BTC derivatives with $4.1bn open interest\n📉 Record-low centralised exchange volumes in Q3 2023\n💰 150% Increase in ETP\/ETF AUMs https:\/\/t.co\/qd73ropaKL","— CCData (@CCData_io) December 14, 2023","","The report highlighted narratives that shaped the whole trading year including perspectives for the future as traders and miners seek to recover previous losses and maintain a good position before the next halving.","According to the report, BTC’s market resilience dominated most narratives as the top asset soared 156% year-to-date (YTD). The upward movement of the top cryptocurrency outperformed traditional assets and benchmarks like the S&P 500, NASDAQ, and Gold.","Generally, all asset classes performed better than in previous quarters as wider macroeconomic factors tilted positive after high inflation riddled several markets for months, the report notes.","“Given the forward-looking nature of the markets, particularly in highly responsive assets like technology stocks and cryptocurrencies, investors who anticipated the peak of inflation and interest rates by mid-year were well-positioned, capitalizing on optimistic speculation around high-growth investments, securing substantial gains.” ","The year was by improved BTC fundamentals coming off the bear window in 2022 which saw the asset lose over 55% of its value. BTC showed early signs of growth in the first quarter but effectively turned the tide in the second quarter with renewed institutional confidence in the market.","A major significant part of BTC trajectory was the filing of an ETF application by BlackRock and other traditional finance firms leading to a price rally above $31,000 before a slight correction and a run above $40,000.","At press time, BTC trades at $42,900 and has surged 19% over the past month still on the back of renewed ETF optimism. Although the Securities and Exchange Commission is yet to approve a spot BTC ETF application citing market manipulation concerns, the buzz remains with firms restructuring filings and experts projecting an imminent approval.","A key indicator for a bullish sentiment around Bitcoin is the upcoming halving which has been proven to be linked to price increases. The next halving has changed the operation of miners as price upticks wipe out previous losses putting them in a better position to improve efficiency.","“…This is due to the halving reducing the rate at which new BTC is issued. Currently, Bitcoin’s supply stands at 19.6mn BTC with an issuance rate of 6.25 BTC on average every 10 mins. This is expected to change to 3.125 BTC which will add layer of scarcity to the largest digital asset.”","The report also analyzed the rise in Bitcoin’s products and assets under management (AUM). This year, inflows into Bitcoin products have surpassed $1.7 billion while the total crypto AUM is over $44 billion, a 150% increase."],"entity":[{"type":"$4.1","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"$42,900","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"156%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"S&P","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"150%","content":"PERCENT"},{"type":"$31,000","content":"MONEY"},{"type":"December 14, 2023","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","CRYPTO","ETF"],"authors":["David Pokima"]}