{"summary":"‘New Inflationary Era’ Upon Us, Central Bank Action Will be Unpopular – BIS’ Carstens Warns","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-inflationary-era-upon-us-central-bank-action-will-unpopular-bis-carstens-warns.htm","publishDate":"2022-04-05T16:30:00","id":21170,"type":null,"title":"‘New Inflationary Era’ Upon Us, Central Bank Action Will be Unpopular – BIS’ Carstens Warns","category":["Bitcoin News "],"content":[" ","The return to inflation in the world means that real interest rates need to rise into positive territory, but with historically high levels of debt, such a move by central banks will not be popular, the Bank for International Settlements’ (BIS) head Agustín Carstens warned.","In a speech focused on inflation on Tuesday, Carstens said the world “may be on the cusp of a new inflationary era,” and added that central bank action was needed in order to deal with the price rises.","“Most likely, this will require real interest rates to rise above neutral levels for a time in order to moderate demand,” Carstens said in the speech, delivered at the International Center for Monetary and Banking Studies in Geneva, Switzerland.","The real interest rate refers to the interest rate after adjusting for inflation, a figure which is negative in most advanced economies today.","Carstens further warned that such a transition would not be easy nor popular.","“In many countries, starting conditions complicate matters. Households, firms, financial markets and sovereigns have become too used to low interest rates and accommodative financial conditions, also reflected in historically high levels of private and public debt,” the BIS boss said.","He added that it will be challenging to transition to what he called “more normal levels” for rates, and said it will be important to set “realistic expectations of what monetary policy can deliver.”","Carstens further stressed that central banks should not be expected to “single-handedly ensure global growth by keeping an accommodative stance in all conditions.”","However, the BIS boss still pointed out that central banks around the world “have been here before,” referring to the inflationary period of the 1970s. ","“They are fully aware that the short-term costs in terms of activity and employment are the price to pay to avoid bigger costs down the road,” he said.","Describing the current inflationary environment, Carstens also said that inflation has now “accelerated” in the service sector, where price growth tends to remain for longer than for goods.","As a result, inflation may become “more entrenched” than previously anticipated, Carstens said.","He added that supply bottlenecks remain in sectors such as shipping, semiconductors, and regionally in countries that still enforce Covid-related lockdowns.","However, these factors have now been combined with new inflationary pressures in food, oil, and many other commodities, with much of this increase seen since the start of the war in Ukraine.","Further, Carstens pointed to three developments that he said have led him to believe inflation has become more persistent than what was previously believed:","In summary, Carstens opined that the rise in inflation came “as a surprise to most observers.”","“As it began to rise, forecasts were revised up. But, even mid-year, most observers projected only a modest and temporary overshoot of central bank targets. In the end, inflation far exceeded the forecasts,” the head of the BIS said.","_____\nLearn more: \n– War in Ukraine to Make Countries Rethink Currency Dependencies – BlackRock CEO\n– How War in Ukraine Is Increasing Inflationary Pressure Across World’s Regions\n\n– Fed Raises Interest Rate by 25 Basis Points in First Rate Hike Since 2018\n\n– The Ukraine War: How Russia’s Aggression Affected Bitcoin & Crypto and What Might Happen Next\n– Fed Can’t Stop Prices From Going Up Anytime Soon, But There’s Good News, Too"],"entity":[{"type":"International Center for Monetary and Banking Studies","content":"ORGANIZATION"},{"type":"How Russia’s Aggression Affected Bitcoin & Crypto","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Increasing Inflationary Pressure Across World’s Regions\n\n– Fed","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Bank for International Settlements’ (BIS","content":"ORGANIZATION"},{"type":"Agustín Carstens","content":"PERSON"},{"type":"Geneva","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"},{"type":"What Might Happen Next\n– Fed","content":"ORGANIZATION"},{"type":"1970s","content":"DATE"},{"type":"Covid","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Carstens","content":"PERSON"},{"type":"First Rate Hike Since","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Central Bank","Economics","Forecast","Inflation"],"authors":["Fredrik Vold"]}