{"summary":"Is Solana About to Crash? SOL Price Dips 11% Amid Buzz for Viral Green Bitcoin – Early Buying Opportunity?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/is-solana-about-to-crash-sol-price-dips-11-amid-buzz-for-viral-green-bitcoin-early-buying-opportunity.htm","publishDate":"2024-03-20T16:02:39","id":21185,"type":null,"title":"Is Solana About to Crash? SOL Price Dips 11% Amid Buzz for Viral Green Bitcoin – Early Buying Opportunity?","category":["Industry Talk "],"content":["Solana (SOL) briefly looked set to crash when it dipped 11% in the early hours of the morning UTC just a few hours after it flipped Ethereum for highest 24 hour trading volume.","It has since stabilized somewhat, and its 24 hour losses are now just 4.1% as it changes hands at around $171 at the time of writing ","SOL’s brief wobble began just after the Solana-based NFT collection Slerf posted over $3 billion in 24-hour trading volume, clocking in more volume than all the decentralized exchanges (DEXs) on Ethereum combined.","Holy sh*t$slerf 24 hr volume:","$3 billion 😯🤯 pic.twitter.com\/zwkTWczNTR","— Naz (33.3%) (@NazNFT_) March 19, 2024","","In fact, meme coin trading has driven overall volume on Solana to surpass that of Ethereum today, according to data by DeFiLlama. At the time of writing, Solana posted a 24-hour volume of $3.498 billion, a 67% increase since last week.","Ethereum, on the other hand, traded $3 billion over the same period, a 3.08% increase on last week.","Considering the $3 billion total value locked (TVL) on Ethereum is three times higher than Solana’s, a recent Solana meme coin frenzy is the likeliest driver of today’s flippening.","Hot new Solana meme coin SLERF is currently up 12.7% overnight and changes hands at $0.8371 as of this writing.","Still, Solana’s flipping of Ethereum today has done little to change the fact that SOL and AVAX posted the heaviest overnight losses among the ten biggest coins by market capitalization.","By contrast, Ethereum is trading at more or less the same price it was at 24 hours ago.","Solana’s trading chart for the last three months emphasises how sudden its recent rally was. Like other leading cryptocurrencies, the rally began proper at the end of the month and was short and steep.","","Source: TradingViewStill, SOL has been in freefall these past two days and should prices continue to fall, it’s unclear whether it will find support at $150. With a Relative Strength Index currently sitting around 50, it’s likely to be more stable throughout the day.","While Solana’s Slerfs have spurred the network to eclipse Ethereum today, one new token has been quietly raising millions for its green premise and alluring returns.","Green Bitcoin (GBTC) has raised $6.7 million over a two-week long presale.","Issued on Ethereum, Green Bitcoin is an ERC-20 token that comes with an innovative new predict-to-earn staking model that rewards participants for correctly predicting Bitcoin’s future price.","GBTC has a hardcap of 21 million, making it every bit as scarce as its inspiration, Bitcoin.","To celebrate $6M we’re launching our GBTC GIVEAWAYS!","To enter, simply: Like + RT + Tag a friend!","The first prize is a $200 GBTC Airdrop. THERE WILL BE MANY MORE! Winner will be announced in replies in 24hrs. pic.twitter.com\/k0sxIFOMnQ","— GreenBitcoin (@GreenBTCtoken) March 18, 2024","","However, GBTC’s use of Ethereum’s proof-of-stake (PoS) blockchain above Bitcoin’s more energy consumptive proof-of-work mechanism makes it cleaner and greener than its namesake.","In addition to casting daily predictions to earn rewards, holders can also stake their tokens for up to six months to earn even bigger rewards.","The staking system is a fundamental part of Green Bitcoin’s tokenomics design. Staking reduces GBTC’s circulating supply, helping drive the price over the long-term.","Anyone can get involved by simply visiting the official Green Bitcoin website and connecting a crypto wallet.","1 GBTC presently costs $1.1062, with the price due to rise in four days. However, there are still a few weeks left of the presale, and the token could rally sharply by the time it’s listed on exchanges.","Visit Green Bitcoin Now",""],"entity":[{"type":"$1.1062","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"12.7%","content":"PERCENT"},{"type":"$slerf","content":"MONEY"},{"type":"March 18, 2024","content":"DATE"},{"type":"SOL","content":"ORGANIZATION"},{"type":"4.1%","content":"PERCENT"},{"type":"$6.7 million","content":"MONEY"},{"type":"Green Bitcoin","content":"ORGANIZATION"},{"type":"33.3%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"3.08%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$0.8371","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"Solana’s","content":"PERSON"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"67%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"$3.498 billion","content":"MONEY"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"March 19, 2024","content":"DATE"},{"type":"$171","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$150","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$6M","content":"MONEY"}],"hashtag":["Green Bitcoin","SOL","Solana"],"authors":["Tim Hakki"]}