{"summary":"Crypto Giant Coinbase to Enhance EU Presence with Key Derivatives Acquisition","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-giant-coinbase-to-enhance-eu-presence-with-key-derivatives-acquisition.htm","publishDate":"2024-01-06T09:00:43","id":21186,"type":null,"title":"Crypto Giant Coinbase to Enhance EU Presence with Key Derivatives Acquisition","category":["Altcoin News "],"content":["Coinbase has revealed plans to offer crypto-linked derivatives in the European Union (EU) market. ","The company has reportedly told CNBC that it has entered into an agreement to acquire an unnamed holding company, which holds a MiFID II license.","MiFID II, the EU’s updated regulation governing financial instruments, was revised in 2017 to address concerns that it focused too heavily on stocks and overlooked other asset classes like derivatives, fixed income, and currencies.","Coinbase’s move to offer derivatives is part of its long-standing ambition to cater to professional and institutional customers.","If the acquisition is successfully completed, it will mark Coinbase’s first foray into derivatives trading within the EU. ","With the MiFID II license, Coinbase will be able to provide regulated derivatives, including futures and options, to customers in select EU countries. ","Currently, Coinbase offers spot trading in bitcoin and other cryptocurrencies.","The acquisition is subject to regulatory approval, and Coinbase anticipates the deal to close later in 2024. ","“This license would help expand access to our derivatives products by allowing Coinbase to offer them to eligible European customers in select countries across the EU,” the exchange said in a blog post. ","“As the industry leader in trusted, compliant products and services, we aim for the highest standards for regulatory compliance, and before operationalizing any license or serving any users, this entity must achieve our Five-point Global Compliance Standard.”","Derivatives trading holds significant importance for Coinbase, as the company states that derivatives account for 75% of overall crypto trading volumes. ","While Coinbase faces competition from larger players like Binance, which dominates the market for crypto-linked derivatives, it aims to carve a space for itself in this crucial battleground.","Coinbase currently does not offer crypto derivatives products in the United Kingdom due to regulatory restrictions imposed by the Financial Conduct Authority. ","However, the company provides trading in bitcoin and ether futures in the United States and various other markets outside the US.","Derivatives are financial instruments whose value is derived from an underlying asset’s performance. ","Futures, a type of derivative, allow investors to speculate on the future value of an asset. ","Given the volatile nature of cryptocurrencies and the potential for amplified gains and losses through leverage, futures trading is generally considered riskier than spot markets.","Coinbase’s move into derivatives follows its recent expansion efforts outside of the United States. ","Facing regulatory challenges at home, including a lawsuit from the US Securities and Exchange Commission alleging securities law violations, Coinbase has been pursuing international growth opportunities. ","The company selected Ireland as its primary regulatory base in the EU and applied for a single MiCA license to comply with upcoming crypto laws. ","Coinbase has also obtained a virtual asset service provider license in France, enabling it to offer custody and trading services for crypto assets in the country.","In late September, the exchange said it has received regulatory approval to offer perpetual futures trading services to retail customers outside the United States. ","The largest US-based crypto exchange added it has received additional regulatory approval from the Bermuda Monetary Authority (BMA) to offer perpetual futures trading to non-US retail users. "],"entity":[{"type":"Bermuda Monetary Authority (BMA","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Ireland","content":"LOCATION"}],"hashtag":["Coinbase","Europe"],"authors":["Ruholamin Haqshanas"]}