{"summary":"It&#x27;s far from the first dramatic event to befall Krishna Okhandiar, the Milady founder known pseudonymously as Charlotte Fang.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282972\/remilia-founder-charlotte-fang-claims-he-was-hacked-as-treasury-is-drained-of-millions","publishDate":"2024-03-16T17:54:34","id":2118,"type":null,"title":"Remilia founder Charlotte Fang claims he was hacked as treasury is drained of millions","category":["METAVERSE & NFT"],"content":["Krishna Okhandiar, the Remilia and Milady founder best known by his pseudonym Charlotte Fang, is reportedly claiming to be hacked after large quantities of ether and NFTs were transferred to a wallet which appears to be liquidating the assets.&nbsp;","The event was first flagged by X user <a href=\"https:\/\/x.com\/Dumpster_DAO\/status\/1769087991610249436?s=20\" data-v-f87c67ca=\"\">Dumpster DAO<\/a>, who posted an alleged screenshot of Okhandiar claiming he \"got drained,\" and linking to an <a href=\"https:\/\/etherscan.io\/address\/0x778Be423ef77A20A4493f846BdbcDDfc30252cE9\" data-v-f87c67ca=\"\">address<\/a> that has received assets from Remilia-linked wallets. That address has liquidated several Milady-related NFTs, including NFTx staked NFTs, and has sent $1 million in ether to a secondary address, blockchain data <a href=\"https:\/\/etherscan.io\/tx\/0xb74b60ed72e96bd0cc445dde2c661a2f7e9e6b02ae6368d6d00e2401d29b73cc\" data-v-f87c67ca=\"\">shows<\/a>. The address still holds nearly $1 million in ether and several other tokens as of this article's publication.&nbsp;","While the mechanism of the alleged hack remains unknown, blockchain security firm Peckshield <a href=\"https:\/\/x.com\/peckshield\/status\/1769116792663011584?s=20\" data-v-f87c67ca=\"\">identified<\/a> an earlier transfer of the Remilia treasury wallet to the draining wallet in a post on X.&nbsp;&nbsp;","This is far from the first time drama has struck Okhandiar and the Milady community. Okhandiar, whose controversial past online activity was <a href=\"https:\/\/www.fastcompany.com\/90756392\/inside-remilia-corporation-the-anti-woke-dao-behind-the-doomed-milady-maker-nft\" data-v-f87c67ca=\"\">unearthed<\/a> in 2022, sending the Milady price crashing, has been both plaintiff and defendant in lawsuits <a href=\"https:\/\/cryptopotato.com\/co-founders-of-remilia-file-lawsuit-in-new-milady-vs-milady-case-against-charlotte-fang\/\" data-v-f87c67ca=\"\">disputing<\/a> the rightful ownership of the project's assets.&nbsp;","<em data-v-f87c67ca=\"\">This is a developing story.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Milady","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Krishna Okhandiar","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Remilia","content":"LOCATION"},{"type":"Milady","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Dumpster DAO","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Peckshield","content":"ORGANIZATION"},{"type":"Charlotte Fang","content":"PERSON"}],"hashtag":["MILADY"],"authors":["Zack Abrams","The Block"]}