{"summary":"UK Police Seized $1.77 Billion in Bitcoin from Chinese Investment Fraud + More Crypto News","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/uk-police-seized-1-77-billion-in-bitcoin-from-chinese-investment-fraud-more-crypto-news.htm","publishDate":"2024-02-01T13:06:27","id":21199,"type":null,"title":"UK Police Seized $1.77 Billion in Bitcoin from Chinese Investment Fraud + More Crypto News","category":["Altcoin News "],"content":["Get your daily, bite-sized digest of blockchain and crypto news – investigating the stories flying under the radar of today’s news.","In today’s crypto news selection:","__________","The UK Metropolitan Police has seized more than £1.4 billion ($1.77 billion) worth of bitcoin (BTC). This is one of the largest crypto seizures of by law enforcement globally, according to the Financial Times.","The seized funds came from a huge investment fraud in China, a London court heard on Tuesday.","Jian Wen, 42, is on trial, accused of laundering Bitcoin on behalf of her former employer, Yadi Zhang (real name Zhimin Qian). The latter is an alleged fugitive from the Beijing authorities. She has also fled the UK.","In 2018, the UK police seized four devices holding more than 61,000 BTC from a safety deposit box and a property where Wen and Zhang lived.","By the time the police had recovered all this BTC in July 2021, its value was about £1.4 billion.","Per the prosecution, Zhang had committed investment fraud in China between 2014 and 2017. She stole some £5 billion from over 128,000 investors, subsequently converting it into BTC.","Wen is not accused of involvement in this fraud but of helping Wen convert BTC into fiat, property, and luxury items in the UK.","Wen claims to have been Zhang’s “carer” and that she believed Zhang gained all bitcoin legally. The prosecution, however, argued on Monday that Wen was a “front person” paid to “keep Ms Zhang in the background.”","In the latest crypto news, the Digital Assets Association (DAA) announced its official launch. Per the press release shared with Cryptonews, it’s a groundbreaking transnational organization dedicated to fostering responsible development and adoption of institutional digital assets.","The DAA committee is made up of industry leaders who believe in the future of digital assets, it said. These include:","The DAA launch represents a key step forward in the financial industry to facilitate greater collaboration between industry players and key stakeholders, said the press release.","It added that by bringing together financial institutions, fintechs, technology providers, and legal and regulatory experts, the DAA aims to bridge the gap between TradFi and the transformative potential of tokenized real-world assets (RWA).","The DAA will provide a platform for stakeholders to come together to: share knowledge and best practices through working groups, conferences, and online resources; develop industry standards; engage with policymakers and regulators to promote responsible legal and regulatory frameworks that foster innovation while mitigating risks; and empower future leaders through training, mentorship, and industry placements.","In January, following the approval of the initial Bitcoin spot ETFs, the sector’s total assets under management (AUM) saw a period of relative stability, according to Digital Asset Management Review by on-chain analytics firm CCData. The report noted a small increase of 1.53% to $50.7 billion.","Meanwhile, the average daily aggregate trading volumes have shown a significant upward trend, surging to $2.19 billion. The 224% increase can be attributed to the ETF launch and a broader uptick in market sentiment.","“This was the fourth consecutive monthly increase in average daily product volumes for the industry,” it said.","The report further noted that each ETF’s fee structure influences inflows and trading volumes. Fees are often “a key determinant for investors in a competitive market,” and “lower fees increase an ETF’s appeal.” Hence, many ETF providers recently lowered their fees.","Meanwhile, Grayscale’s outflows have started slowing down. Since converting to a spot Bitcoin ETF, GBTC has registered $5.23 billion in outflows. But on January 22, it recorded $641 million, and $221 million on January 30.","“The overall inflow figures, even when negative, do not undermine the encouraging trajectory we have observed in the ETF market. This holds particularly true when Grayscale is excluded from the equation.”","The trend, CCData argues, suggests growing confidence in the digital asset space. This is likely fueled, besides ETFs, by the increasing acceptance of digital assets by institutions as a legitimate investment category.","Meanwhile, Grayscale maintained the industry’s highest AUM in January, at $29.1 billion. BlackRock and Fidelity recorded over $2 billion, making them the 2nd and 4th largest companies by AUM in their first month of trading. Bitwise led the AUM increase with 81.2% to $1.32 billion.","XBT Provider and 21Shares had AUMs of $2.32 billion and $2.15 billion, respectively. VanEck saw a 20.6% rise, while ETC Group, CoinShares, and CI Financials saw declines of around 10%."],"entity":[{"type":"2014","content":"DATE"},{"type":"$221 million","content":"MONEY"},{"type":"January 30","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"$29.1 billion","content":"MONEY"},{"type":"$1.32 billion","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"DAA","content":"ORGANIZATION"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$2.15 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Yadi Zhang","content":"PERSON"},{"type":"Wen","content":"PERSON"},{"type":"AUM","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$50.7 billion","content":"MONEY"},{"type":"81.2%","content":"PERCENT"},{"type":"$2.32 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$2.19 billion","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"Zhang","content":"PERSON"},{"type":"20.6%","content":"PERCENT"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"Beijing","content":"LOCATION"},{"type":"$641 million","content":"MONEY"},{"type":"$5.23 billion","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Digital Assets Association (DAA","content":"ORGANIZATION"},{"type":"224%","content":"PERCENT"},{"type":"January 22","content":"DATE"},{"type":"5 billion","content":"MONEY"},{"type":"1.53%","content":"PERCENT"},{"type":"Cryptonews","content":"PERSON"},{"type":"UK Metropolitan Police","content":"ORGANIZATION"},{"type":"Digital Asset Management Review","content":"ORGANIZATION"},{"type":"Jian Wen","content":"PERSON"},{"type":"July 2021","content":"DATE"},{"type":"$1.77 billion","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","Police","UK"],"authors":["Sead Fadilpašić"]}