{"summary":"ICOs Hit New Low, but Production Picking Up","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/icos-hit-new-low-but-production-picking-up-2595.htm","publishDate":"2018-09-11T10:25:00","id":21191,"type":null,"title":"ICOs Hit New Low, but Production Picking Up","category":["Altcoin News "],"content":["The amount of money sunk into initial coin offerings (ICOs) shrinking may be old news at this point, but there are good news as well: projects are starting to deliver on their promises, building their products, especially when they have secured funding for years to come.","“As prices fall both quite naturally as design result from fundraising in ETH, and from an increasing number of financial derivatives shorting token economies, i.e., BitMex, ETH as a currency is less attractive to hold for a newly formed company,” according to Autonomous Next, a research company. According to their calculations, in August, a month which is usually slow for business, ICO funding has meaningfully slowed to a bit over USD 326 million. Last time ICOs raised less than USD 300 million in a month was May of 2017. However, August in 2017 was also slower than July, but the recent drop was more significant:","Meanwhile, Ethereum sentiment is in a downward spiral, as some claim that all utility token values trend to zero, and others suggest that ETH will bleed out all of its value into those utility tokens – a sentiment that Vitalik Buterin, a co-founder of Ethereum, actually agrees with, at least until Ethereum protocol changes.","However, according to Autonomous Next, Ethereum’s use as a decentralized computing platform is growing. The research company added: “While many other dapp stores (i.e., Dfinity, EOS, NEO, Cardano) are only now getting funded on future claims, Ethereum is churning away at building useful apps.”","ConsenSys, a blockchain software technology company, backed Alethio, an analysis tool for the Ethereum network, put together a chart showing how much computing the system is doing, which shows not only a lot of computing, but also a lot of diversity. This, hand in hand with the ICO slow-down, would mean that teams are at work building the promised products. As Autonomous Next puts it, “First you raise, and then, you build. Actually, first you sell, then you hire, then you build.”","Moreover, Diar, the weekly publication on cryptocurrency, adds: “Companies that did an ICO before the price boom of 4Q17 are sitting on massive reserves that could potentially fuel development teams for years to come.”","However, according to the report, “extremely deep pockets within the very closed-circuit cryptocurrency community could result in the prolonging of marketing euphoria masking the little adoption of services.”","Last week TenX, a basic wallet that promises a Visa debit card, disclosed their financial positions – something ICOs are not contractually obliged to do – and revealed they currently own more than USD 100 million, as well as their burn rate (the rate at which a new company spends its initial capital) at USD 8.9 million annually. This could mean that the company currently has enough to keep going for another decade, according to the report. They’re also not the only one: many popular projects now own more than half a billion dollars equivalent in ICO-raised ETH, even excluding their token reserves or any cash they might have on hand.","Although dapp hype has faded compared to their initial boom, as Cryptonews.com previously reported, Gartner Inc., an American research and advisory company, estimated that blockchain is moving forwards through the trough of disillusionment, towards the slope of enlightenment, followed by the plateau of productivity."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"Gartner Inc.","content":"ORGANIZATION"},{"type":"Autonomous Next","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"USD 300 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"May of 2017","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"USD 326 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Diar","content":"PERSON"},{"type":"Dfinity","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["Adoption","Ethereum","ICO"],"authors":["Sead Fadilpašić"]}