{"summary":"Crypto Exchange Yellow Card Financial Set to Apply for Nigerian License Following Cryptocurrency Ban Lift","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-exchange-yellow-card-financial-set-to-apply-for-nigerian-license-following-cryptocurrency-ban-lift.htm","publishDate":"2023-12-25T07:46:25","id":21203,"type":null,"title":"Crypto Exchange Yellow Card Financial Set to Apply for Nigerian License Following Cryptocurrency Ban Lift","category":["Altcoin News "],"content":["Pan-African cryptocurrency exchange Yellow Card Financial has announced plans to apply for a license in Nigeria following the recent lifting of the country’s cryptocurrency ban.","The ban, which was imposed in 2021, prohibited financial institutions from transacting or operating cryptocurrency exchanges. ","With the ban now lifted, Yellow Card aims to seize the opportunity and establish a regulated presence in Nigeria.","“You’ve waited for something and it has come true, and we’ll jump on it immediately,” Ogochukwu Umeokafor, the director of product management at Yellow Card, told Bloomberg. ","Umeokafor emphasized the importance of operating in a regulated environment, as it would enhance business operations and foster greater confidence among customers.","Currently, Yellow Card offers limited cryptocurrency services in Nigeria, allowing users to buy and sell Bitcoin and Tether’s stablecoin USDT with the naira. ","The platform also facilitates other financial transactions. ","With the license application, Yellow Card aims to expand its services and attract institutional investors. ","Yellow Card, which currently operates in Nigeria and over 15 other African countries, had already initiated discussions with Nigeria’s Securities and Exchange Commission (SEC) regarding operating a cryptocurrency exchange. ","The SEC invited applications for licenses from issuers, custodians of digital assets, and exchanges. ","However, Yellow Card faced an obstacle in the form of needing a bank account to apply for a Virtual Asset Service Provider license, which was not possible under the previous ban.","In a circular issued on Friday, the Central Bank of Nigeria directed banks to open accounts for crypto firms, overturning the previous order that had mandated the closure of accounts associated with cryptocurrencies. ","The initial ban was implemented by the central bank to combat money laundering and terrorism financing but had created uncertainties and hindered the operations of crypto businesses in the country.","Umeokafor acknowledged the challenges faced by Yellow Card during the ban.","“It brought a lot of uncertainties. We didn’t know how to go ahead with business. We didn’t know if we were still going to be afloat.” ","The inability to access bank accounts forced the company to explore alternative ways to sustain its operations. ","Nigeria has witnessed significant cryptocurrency adoption, second only to India, driven by the population’s desire to hedge against the weakening local currency. ","The Nigerian naira has depreciated by almost 49% this year, prompting residents to seek crypto assets as a store of value. ","As reported, a recent survey has revealed that Nigeria is the most crypto-savvy nation ahead of the United States and European countries.","Per the survey, Nigeria’s crypto awareness stands at 99% as the country leads in digital asset knowledge and perceived investment drive.","The data showed that 99% were fully aware of cryptocurrencies while 70% understood the value, operations, and fundamentals of blockchain technology. ","Furthermore, it revealed that the majority of Nigerians have turned to cryptocurrency as a hedge against inflation in recent years after a poor performance of the naira coupled with double-digit inflation. "],"entity":[{"type":"70%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Nigerian naira","content":"ORGANIZATION"},{"type":"Ogochukwu Umeokafor","content":"PERSON"},{"type":"99%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Virtual Asset Service","content":"ORGANIZATION"},{"type":"Central Bank of Nigeria","content":"ORGANIZATION"},{"type":"Nigeria’s Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"cryptocurrency exchange Yellow Card Financial","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Yellow Card","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Africa","Nigeria","Yellow Card"],"authors":["Ruholamin Haqshanas"]}