{"summary":"Vitalik Buterin Confirms Post-Merge Ethereum Centralization Concerns, Urges Not to ‘Overly Catastrophize’ It","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vitalik-buterin-confirms-post-merge-ethereum-centralization-concerns-urges-not-to-overly-catastrophize-it.htm","publishDate":"2022-06-21T20:00:00","id":21214,"type":null,"title":"Vitalik Buterin Confirms Post-Merge Ethereum Centralization Concerns, Urges Not to ‘Overly Catastrophize’ It","category":["Ethereum News "],"content":[" ","Ethereum (ETH) co-founder Vitalik Buterin has said he is “definitely” worried about centralization risks following The Merge, the event when the current Ethereum Mainnet merges with the beacon chain proof-of-stake (PoS) system.","The Ethereum mastermind noted that Lido Finance, the largest provider of staking services for Ethereum, where around a third of staked ETH (stETH) has been deposited, could theoretically disturb the Ethereum network post-Merge. ","“But I also think it’s important to not overly catastrophize the issue,” he added.","“First of all, if you have a third [of staked Ether deposits on the Beacon chain], you can’t revert the chain or whatever,” Buterin said in an interview with Fortune, adding: ","“But realistically, the worst that you could do is make finality stop happening for about a day or so, which is inconvenient, but it’s not that terrible.”","Buterin also mentioned that Lido does not act as a single entity but that “they have something like 21 delegates and nodes that are running these validators that are inside of Lido,” he said, claiming that “there’s a lot of good decentralization between them.”","Lido is the largest provider of staking services for Ethereum. Generally, users who want to become Ethereum 2.0 validators and earn rewards need to stake a minimum of ETH 32, which is a high price.","However, Lido enables users to pool their ETH and participate in staking even if they don’t have the required ETH 32. The protocol distributes stETH tokens to users in return for their staked coins, which can be redeemed for ETH in the future or traded for other coins.","The Merge is Ethereum’s long-anticipated update expected to happen by the end of the year.","The upgrade has several benefits, Buterin said, noting that it makes Ethereum more environmentally friendly compared to the current proof-of-work (PoW) mechanism. According to last year’s estimate by a researcher at the Ethereum Foundation, this upgrade can cut the energy used by the Ethereum network by at least 99.95%.","“Also, proof of stake can increase the safety of the system. It makes it more expensive to attack,” Buterin told Fortune. “It makes it easier to recover from an attack, which is something people don’t think about.”","Another benefit is that PoS is more censorship-resistant. That is because, Buterin says, “miners are easier to detect and easier to shut down than just computers that are running validator nodes.”","Meanwhile, at 10:33 UTC, ETH is trading at USD 1,156, up by 3% over the past 24 hours and down 4% over the past 7 days. The coin is also down by more than 76% compared to its all-time high of USD 4,878 recorded in November last year.","____","Learn more: \n– Dominant Staking Pool Lido Causing ‘Long Lasting’ Damage to Ethereum, But Aims to Improve\n– Ethereum’s Ropsten Test is ‘Almost’ Bug-Free, Two More Testnets to Go Before the Merge\n\n– Major Bitcoin & Crypto Companies Warn of ‘Extreme’ Risk in Proof-of-Stake Systems\n– The Compromises and Benefits of Ethereum Switching to a Proof-of-Stake Network\n\n– Contradictory Vitalik Buterin Says He Wants a More Bitcoin-like Ethereum\n– Top Blockchain Non-Financial Applications According to Vitalik Buterin\n\n– Ethereum Beacon Chain Experienced a 7-block Reorg, More Work Needed Ahead of The Merge\n– Ethereum’s Merge Could Lower Demand for Bitcoin but Regulatory & Technical Challenges Persist"],"entity":[{"type":"3%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"76%","content":"PERCENT"},{"type":"Beacon","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Merge\n\n– Major Bitcoin & Crypto Companies Warn of ‘Extreme","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Vitalik Buterin\n\n– Ethereum Beacon","content":"ORGANIZATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"99.95%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"The Merge\n– Ethereum’s Merge Could Lower Demand for Bitcoin but Regulatory & Technical Challenges Persist","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Decentralization","Ethereum","Proof-of-stake","Security","Staking","Vitalik Buterin"],"authors":["Ruholamin Haqshanas"]}