{"summary":"Three Winners Solve Larva Lab’s Puzzle to Get a Meebit and ETH 0.025","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/three-winners-solve-larva-labs-puzzle-get-meebit-eth-25.htm","publishDate":"2022-03-15T19:00:00","id":21216,"type":null,"title":"Three Winners Solve Larva Lab’s Puzzle to Get a Meebit and ETH 0.025","category":["News "],"content":[" ","Three smart winners have managed to crack a puzzle created by Larva Labs, the creators of the popular non-fungible token (NFT) projects CryptoPunks and Meebits, obtaining a 64-digit string that turned out to be an Ethereum (ETH) private key for an address containing ETH 0.025 (USD 64) and the Meebit #2858.","Andrew Badr, pseudonymous Apely.eth, are programmers, while there are no other details about the third winner. On Monday, Badr took to Twitter to reveal how they managed to solve the puzzle.","Earlier this year, Proof Collective, a private collective of 1,000 NFT collectors and artists, announced an NFT drop composed of 20 artworks from 20 anonymous artists, with the name of artists being revealed following the mint.","One of the pieces, called Grail #11, an Autoglyph (a form of generative art), turned out to be from Larva Labs, which instantly made the NFT the most valuable piece in the drop.","On March 5, someone by the name of “iceman” in the Proof Collective chat room pointed out the strange pattern of L’s at the top of Grail #11, speculating whether it could mean anything.","The night of the reveal (March 5th), “iceman” in the Proof Collective chat room posted this: pic.twitter.com\/EJpAtZnGN1","“His message caught my eye right away, because that part of the image really did look separate from the main part of the artwork,” Badr said. “Also, the Ls weren’t in any kind of regular pattern, so they seemed more than ornamental.”","Unlike other rows, the top row consists of regular and upside-down L-shaped characters. Using the American Standard Code for Information Interchange (ASCII), Badr turned those characters into 0s and 1s and decrypted the message, which read, “SECRET IS IN THE PIG NUMBERS, LL.”","Subsequently, he recruited a couple of friends to help, one of whom was Apely.eth.","“So, while “LL” is the signature, “SECRET IS IN THE PIG NUMBERS” seemed like a clue pointing to a hidden treasure—which is exactly what it turned out to be,” Badr said. And given that the message came from Larva Labs, “the “pig” reference seemed like it had to mean the pig Meebits.”","After probing the pig NFTs, the team noticed that the pigs were wearing jerseys, each of which had one digit on it. They started exploring various options to interpret the numbers on the pig jerseys, including mod 2, intervals between the IDs, ASCII, base 32, and Caesar Ciphers, none of which worked.","“Finally, what worked is concatenating a hex string out of the 64 jersey numbers, and interpreting that as an Ethereum private key!” Badr said, adding that there was a pig Meebit prize along with ETH 0.025 in the corresponding account.","The pig NFT, known as Meebit #2858, has most recently fetched a bid of ETH 10.01 (USD 25,670).","____","Learn more: \n– Ukrainian Government to Launch an NFT Collection as a ‘War Museum’\n– Check These Ukraine NFT Projects Against the Russian Invasion\n\n– Stripe’s Support for Crypto is Back, NFT Support Launched As Well\n– eBay to Launch ‘Digital Wallet’, Teases ‘Fractionalization’\n\n– NFT Market Cools Down As Ukraine War Pushes Investors Toward Safe-Haven Assets \n– Gustav Klimt’s ‘The Kiss’ Masterpiece is Selling as 10,000 NFTs"],"entity":[{"type":"Larva Labs","content":"LOCATION"},{"type":"Badr","content":"PERSON"},{"type":"Caesar Ciphers","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"2858","content":"DATE"},{"type":"Andrew Badr","content":"PERSON"},{"type":"#11","content":"DATE"},{"type":"ASCII","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"March 5th)","content":"DATE"},{"type":"– Ukrainian Government","content":"ORGANIZATION"},{"type":"– Check These Ukraine NFT","content":"ORGANIZATION"},{"type":"Gustav Klimt","content":"PERSON"},{"type":"March 5","content":"DATE"},{"type":"American Standard Code for Information Interchange (ASCII","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Community","Ethereum","NFT","Non-fungible tokens"],"authors":["Ruholamin Haqshanas"]}