{"summary":"A data report from the Bank for International Settlements estimates that the median bitcoin retail investor lost nearly half their investment over the last seven years, and highlighted a call for international governmental coordination in policies towards digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213372\/majority-of-bitcoin-retail-investors-lost-money-in-the-last-seven-years-bis","publishDate":"2023-02-20T13:49:06","id":2122,"type":null,"title":"Majority of bitcoin retail investors lost money in the last seven years: BIS","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The major crypto debacles of 2022 caused a spike in retail crypto trading, new data from the Bank for International Settlements <a href=\"https:\/\/www.bis.org\/publ\/bisbull69.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">suggests<\/a>. However, the data suggests that large investors sold their assets at the expense of smaller investors attempting to diversify their assets following moments of crisis.<\/span>","<span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">\"These patterns highlight the need for better <\/span><span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">investor protection in the crypto space,\" the report from BIS, an institution that financial regulators use as a resource to inform their own thinking, concludes. The Swiss-based bank for central banks reiterated previous calls for global coordination in regulating digital assets, and warns against increased exposure to the global financial system.&nbsp;<\/span>","\"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">Options include banning specific crypto activities, containing crypto, regulating the <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">sector or a combination of these. Containment may prevent risks in crypto from <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">spilling over to the real economy and traditional financial system,\" the report concludes. \"The appropriate mix of measures will be <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">needed to promote market integrity, investor protection and financial stability.\"<\/span>","An analysis of retail investor returns on bitcoin for an approximately seven-year period starting in 2015 found that the median retail investor lost about half their investment by Dec. 2022, despite the major jump in price that occurred from 2015 to 2021. <span data-v-f87c67ca=\"\">The data is based on crypto exchange app activity and downloads from August 2015 to mid-December 2022 in 95 countries, as well as on-chain data.&nbsp;<\/span>","The price of the original cryptocurrency led to spikes in users across platforms, the study found: <span data-v-f87c67ca=\"\">In the time between August 2015 and November 2021, when bitcoin’s price peaked at $69,000, the <\/span>global average daily active users bounced from 100,000 to more than 30 million.","\"H<span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">owever, <\/span><span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">most global investors have probably lost money on their crypto investments. <span class=\"highlight selected appended\" data-v-f87c67ca=\"\">These lo<\/span>sses could be <\/span><span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">exacerbated by the fact that larger, more sophisticated investors tended to sell their coins right before <\/span><span class=\"\" dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">steep price declines, while smaller investors were still buying,\" the report reads. That may further concerns already held by regulators around market manipulation and insider trading in digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After the collapse of Terra and Luna in May, and the collapse of the FTT token and exchange FTX, bitcoin, ether and other assets fell by more than 20% within a few days. But<\/span><span data-v-f87c67ca=\"\"> daily active users spiked on major exchanges Binance, Coinbase and FTX during both those crises, which BIS concludes was due to users trying to,<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\"> \"weather the storm by adjusting their portfolios away from <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">owning tokens under stress towards other cryptoassets, including asset-backed stablecoins.\"&nbsp;<\/span><\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Dec. 2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"BIS","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Luna","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"mid-December 2022","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"August 2015","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"}],"hashtag":["BINANCE","COINBASE","FTX"],"authors":["Inbar Preiss","The Block"]}