{"summary":"Binance Wash Trading Behind Huge Bitcoin Volume Surge, Incentives Being Removed, CZ Says","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/binance-wash-trading-behind-huge-bitcoin-volume-surge-incentives-being-removed-cz-says.htm","publishDate":"2022-07-11T09:03:00","id":21224,"type":null,"title":"Binance Wash Trading Behind Huge Bitcoin Volume Surge, Incentives Being Removed, CZ Says","category":["Bitcoin News "],"content":[" ","The removal of some trading fees on the major crypto exchange Binance is believed to be the reason behind a surge in trading volume on Friday that ended up barely moving the price at all. Now, Binance CEO Changpeng Zhao (CZ) has announced steps to combat so-called wash trading on his exchange.","Notably, the surge in volume occurred on the same day as a zero-fee promotion on certain bitcoin (BTC) spot trades went into effect on Binance.","The volume surge can be seen on charts for the BTC\/USDT trading pair on the exchange. The chart also shows that the price closed for the day right around the USD 21,600 level – the same level as where it opened:","The sharp increase in trading volume was spotted by traders, with Changpeng Zhao later picking up the comments on Twitter and admitting that he “thinks this is due to zero fees and people trying to gain VIP tiers.”","Zhao promised to remove incentives for people to wash trade, such as the ability to earn elite status with the exchange for trading bitcoin without paying fees.","Think this is due to zero fees and people trying to gain VIP tiers. We will exclude Btc trading from VIP calculations. Remove all incentives to wash trade. Announcement with details coming shortly. https:\/\/t.co\/5wm4uPAudX","The move to eliminate such incentives was later confirmed by Binance, calling it necessary to “ensure a fair trading environment for all users following the launch of Zero-Fee Bitcoin Trading.”","Binance has nine different tiers for users on its platform, with lower trading fees for those who trade higher volumes. A similar volume-based fee structure is used by most crypto exchanges.","And despite the introduction of fee-free bitcoin trading bringing with its some challenges, users appear to be happy with it anyway. Asked by the Binance CEO whether they “still want it,” 65.9% of respondents in a Twitter poll said “Yes.”","0 fee trading @binance creates a few problems, wash trading, VIP tiers, etc. A thread 👇\n\nDo you still want it? 😄 1\/4.","Wash trading is the term used when traders repeatedly buy and sell an asset to themselves. It is typically done to make trading volume on an exchange or other platform look higher than it really is.","Over the years, many crypto exchanges have been suspected of engaging in wash trading to get their exchange higher up on various volume rankings. It has also been used extensively on some exchanges that paid users tokens for trading.\n____\nLearn more: \n– Removing LooksRare’s USD 8.3B in Wash-Trades, OpenSea is Still the Dominant NFT Marketplace\n– This is How Crypto Market Data Providers “Deflate” Fake Trading Volumes\n\n– These Are the Types Crypto Projects that Could be Bailed Out According to Binance CEO\n– Binance CEO: Volatility Is The Same In Both Crypto And Stocks"],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"How Crypto Market Data Providers","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Btc","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Binance CEO Changpeng Zhao (CZ)","content":"ORGANIZATION"},{"type":"65.9%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Wash","content":"LOCATION"}],"hashtag":["Binance","Bitcoin","Changpeng Zhao","Exchange","Manipulation","Trading"],"authors":["Fredrik Vold"]}