{"summary":"Elon Musk’s ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter – What’s Going On?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/elon-musks-scam-crypto-claim-leads-suspension-of-ai-bot-twitter-whats-going-on.htm","publishDate":"2023-06-19T09:09:00","id":21230,"type":null,"title":"Elon Musk’s ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter – What’s Going On?","category":["Altcoin News "],"content":["Twitter has suspended the account of a popular meme coin-linked AI bot “Explain This Bob” after Elon Musk called it a “scam.”","“This sure looks like a scam crypto account. If so, it will be suspended,” Musk said in response to a tweet by the bot. ","The account appears to have been suspended soon after Musk’s tweet. ","","This sure looks like a scam crypto account. If so, it will be suspended.","The automated Twitter account “Explain This Bob” used OpenAI’s latest large multimodal model GPT-4 to comprehend and respond to tweets by those who tagged the account.","The account quickly went viral on Twitter in late April for its witty summaries and comedic responses to tweets. “I love bob,” even Musk once said in reply to the bot in April.","Musk has since engaged several times with the Bob bot. He tweeted as recently as June that “Once again, Bob nails it,” in response to a political discussion.","Notably, another Twitter bot called @AskTheWassie, a comic frog that functioned similarly to “Explain This Bob,” has also been suspended. ","This came after Musk warned that the promotion of scams results in suspension in response to a tweet by the bot. ","“Promotion of scams under the guise of being a funny\/helpful bot will result in suspension. Doesn’t matter how much you pay us,” he said.","","Promotion of scams under the guise of being a funny\/helpful bot will result in suspension. Doesn’t matter how much you pay us.","Notably, the “Explain This Bob” bot was also linked to the ERC-20 meme coin Bob Token (BOB), which was launched in April. ","Data by CoinGecko shows the token has taken a hit following the suspension of its affiliated bot account. The token is currently trading at $0.00001901, down by around 13% over the past day. ","Since the suspension, some in the crypto community have asked Musk to remove the ban and reinstate the bot account. ","The team behind the Bob token has also shared a meme of Musk monitoring a distraught “Bob” in prison with the hashtag “FREEBOB.”","","#FREEBOB pic.twitter.com\/SOUm7opQ7o","“It is the only meme project whose utility I appreciated,” said crypto influencer @CryptoDefiLord, claiming that it “is a good bot.”","“CT’s most talked and beloved meme project is still in the gulag. Will $BOB be free this week? Hopefully we see further clarity from Elon over the coming days,” said another Twitter user. ","Elon Musk’s recent move comes just days after the European Consumer Organization (BEUC) released a report accusing leading social media platforms, including Instagram, TikTok, Twitter, and YouTube of enabling scams related to digital assets. ","In a report earlier this month, the watchdog emphasized that social media platforms like Instagram and TikTok maintain loose policies, which allow scammers to target unsuspecting teenagers. ","“The approach of social media platforms to crypto advertising is very dubious and several of them still insufficiently enforce their internal policies,” the BEUC wrote."],"entity":[{"type":"Elon","content":"ORGANIZATION"},{"type":"$BOB","content":"MONEY"},{"type":"$0.00001901","content":"MONEY"},{"type":"BEUC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Bob token","content":"PERSON"},{"type":"bot","content":"ORGANIZATION"},{"type":"GPT","content":"ORGANIZATION"},{"type":"Bob”","content":"PERSON"},{"type":"Musk","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Bob Token (BOB)","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"late April","content":"DATE"},{"type":"Elon Musk","content":"PERSON"},{"type":"Bob bot","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Bob","content":"PERSON"}],"hashtag":["Elon Musk","Twitter"],"authors":["Ruholamin Haqshanas"]}