{"summary":"Polygon Labs’ engineering team proposed an upgrade to the Polygon PoS sidechain to become a “zkEVM validium” network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235698\/polygon-labs-proposes-to-upgrade-flagship-sidechain-to-zkevm-validium-layer-2","publishDate":"2023-06-20T14:26:45","id":2123,"type":null,"title":"Polygon Labs proposes upgrade of flagship sidechain to &#x27;zkEVM validium&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["The engineering team at Polygon Labs has proposed an upgrade to its flagship Polygon Proof-of-Stake (PoS) sidechain to “zkEVM Validium,” a Layer 2 network secured by Ethereum.","According to the <a href=\"https:\/\/polygon.technology\/blog\/polygon-2-0-polygon-pos-zk-layer-2?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">proposal<\/a>, the upgrade aims to align the current Polygon PoS chain with the vision for Polygon 2.0, a future version of Polygon that leverages a specific type of zero-knowledge scaling technology called validium.","The proposal, titled “Polygon 2.0,” states its intention to utilize Polygon’s in-house zkEVM to enhance the sidechain’s security and performance while preserving its low fees. This would be separate from the team’s existing zkEVM, which was <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">rolled out<\/a> in March 2023.","Sandeep Nailwal, co-founder of Polygon, clarified the distinction between the proposed and existing zkEVM technologies. Speaking with The Block, he stated, “This is an upgrade of the Polygon PoS chain to a zkEVM ‘Validium.’ That means the data availability [for apps] will be with the validators, whereas the existing zkEVM rollup has data availability directly on Ethereum.”","Polygon Labs indicated that it envisions both the upgraded Polygon PoS and the existing zkEVM coexisting within the Polygon ecosystem. If approved, the upgrade could be implemented on the mainnet by the end of 2024.","If accepted by the community, the upgrade will mark the first time that an existing chain has added ZK proofs and transitioned to become an L2. Polygon is currently one of the most widely used blockchains in the crypto sector in terms of daily transactions and holds over $2 billion in on-chain assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}