{"summary":"Regulators Learning from Crypto to Take on Pump and Dumps in Stocks","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/regulators-learning-from-crypto-take-pump-dumps-stocks.htm","publishDate":"2021-12-29T11:58:00","id":21238,"type":null,"title":"Regulators Learning from Crypto to Take on Pump and Dumps in Stocks","category":["Altcoin News "],"content":[" ","A newly released presentation has revealed how the Australian Securities and Investments Commission (ASIC) has learned about pump and dump activities in the crypto market, and how the same schemes have spilled over to the stock market.","The previously unknown presentation was first made public on December 28 after The Australian obtained it through a freedom of information request.","The presentation, created by crypto researcher and finance professor at the University of Technology Sydney, Talis Putnins, said that the pump and dump activity that has been seen across the crypto market is now also seen in stocks, with ‘meme stocks’ such as GameStop in the US being relevant examples.","Coordinated pumps in the stock market may fall under market manipulation regulations, and could be considered illegal. In the largely unregulated crypto market, however, the legality of the schemes is not a straightforward question, although Putnins suggested that it could fall under the scope of consumer protection rules.","Discussing what the harm is in pump and dump schemes, Putnins’ presentation pointed out two main problems:","“No rational person (absent an advantage) would participate,” the crypto researcher wrote about the expected negative outcome when trading fees are taken into account.","And although Putnins made the point that pump and dumps in crypto could well be illegal, it was when these schemes started to hit the Australian stock market that the regulator took action.","As explained in the presentation, back in October the ASIC infiltrated a group called “ASX Pump Organization.” The regulator posted a message saying that coordinated pumping of shares for profits can be illegal.","“We’re monitoring this platform and we may be investigating you,” the message warned, adding that participants face the risk of fines of more than AUD 1m and prison time for their involvement in the scheme.","Further in the presentation, Putnins noted that “pumps are cyclical,” and that the activity generally follows market sentiment in the crypto market. The tops in pump and dump activity until now have been in 2018 and 2021, which were years when the total crypto market capitalization reached massive peaks.","Cyclical trends in crypto pump and dump schemes:","In terms of the returns seen on the pumps, Putnins’ presentation showed that most of the profits are generated immediately after the pump has started, with buyers who are in on the pump before it ‘officially’ starts having the best opportunity to profit.","After less than 30 minutes, the price of the coin being pumped is generally well below where it was before the pump started, the data showed.","Average pump and dump returns over time:","Further, the presentation also noted some key differences between modern pump and dumps in the crypto market and the more traditional type in stock markets, saying that the pump and dump groups of today are completely out in the open for anyone to find.","This differs strongly from the way it has traditionally worked in the stock market, where such groups have operated more or less underground, Putnins wrote.","Lastly, the report said that there is a perception that pumps in crypto are legal since the market is largely unregulated. It added that anonymity and encryption in online forums and messaging apps brings a level of comfort for participants, who often don’t see any legal risk of being involved.","Meanwhile, the presentation Putnins did for the Australian financial watchdog is not the first time the professor has talked publicly about manipulation in the crypto market.","Back in August this year, the professor led a study where he identified 355 cases of pump and dumps in the crypto market, involving more than 23m participants, an article in The Australian Financial Review said, noting that this happens “in broad daylight as regulators and exchanges turn a blind eye.”","____","Learn more:","– Crypto and Stock Market Link in Question After Fed Signals Tapering\n– Most Cryptos Correlated with Stocks, Not with Gold – Analysts\n\n– Aussie Regulatory Body Backs Government’s Plan to Regulate Crypto\n– More Aussie Crypto Traders Profiting, Country Moving to Largest Reform of Payments Systems\n\n– How Global Economy Might Affect Bitcoin, Ethereum, and Crypto in 2022\n– Crypto Investment Trends in 2022: Brace for More Institutions and Meme Manias\n "," "],"entity":[{"type":"2021","content":"DATE"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"ASX Pump Organization","content":"ORGANIZATION"},{"type":"Australian Securities and Investments Commission (ASIC","content":"ORGANIZATION"},{"type":"Aussie Regulatory Body Backs Government","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"ASIC","content":"ORGANIZATION"},{"type":"University of Technology Sydney","content":"ORGANIZATION"},{"type":"Putnins","content":"PERSON"},{"type":"Crypto Investment Trends","content":"ORGANIZATION"},{"type":"Talis Putnins","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"August this year","content":"DATE"},{"type":"The Australian Financial Review","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"December 28","content":"DATE"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Stock Market Link in Question After Fed","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Australia","Cryptocurrency","Manipulation","Market","Regulation","Stocks"],"authors":["Fredrik Vold"]}