{"summary":"Pandora’s ERC-404 Token Surges with $190M Trading Volume Within a Week of Launch: Nansen","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pandoras-erc-404-token-surges-with-190m-trading-volume-within-a-week-of-launch-nansen.htm","publishDate":"2024-02-14T07:06:29","id":21235,"type":null,"title":"Pandora’s ERC-404 Token Surges with $190M Trading Volume Within a Week of Launch: Nansen","category":["Ethereum News "],"content":["Pandora, an experimental hybrid token based on the ERC404 standard, has experienced a surge in trading volume since its deployment on February 2.","Within just one week, the token’s fully diluted valuation soared to over $320 million, making it one of the most talked-about projects in the crypto space.","According to data as of February 13, the total trading volume of Pandora reached an impressive 73,024 ETH, equivalent to approximately $190 million, Nansen said in an analysis shared with Cryptonews.com.","Notably, this volume includes transactions on both decentralized exchanges (DEXs) for ERC20 tokens and NFT marketplaces for ERC721 tokens.","As of the latest update, Pandora’s price stands at around $21.9k, marking a 32% decline since its all-time high.","The token has garnered attention from 1,420 unique owner wallets, each holding at least one full token.","Among the 5,681 NFTs or full tokens in circulation, an impressive 50% are held by “diamond hands” wallets, indicating a strong investor belief in the project’s potential.","This retention rate surpasses established blue-chip NFT collections such as Pudgy Penguins and Bored Ape Yacht Club, according to the Nansen report.","Just recently, Nansen Product Marketing Manager Journey Li revealed in a post on X that a wallet funded by a wallet funded by Amber Group bought 109 Pandora yesterday, which amounted to about $1.96M at the time.","interesting, a wallet funded by a wallet funded by Amber Group bought 109 Pandora over the last hour","at the current price, worth about $1.96M pic.twitter.com\/nSsK9LPPtd","— Journey 🧭 (@journeywr) February 12, 2024","","The report said that analyzing the volume and transactions of ERC404 tokens presents certain challenges due to the hybrid nature of the standard.","However, focusing on NFT-only transactions over the past 30 days reveals that the volume of major NFT marketplaces like OpenSea and Blur remained relatively unaffected by the introduction of ERC404.","This suggests that the majority of ERC404 transactions are occurring on DEXs.","Additionally, the minting of ERC404 tokens has witnessed a significant surge.","Mints occur when whole tokens or multiple whole tokens are purchased from a DEX, and the past week alone saw mint volume surpassing $344 million.","It is important to note that if a whole token is subsequently sold as an NFT on a marketplace instead of a DEX, it is not burned or re-minted.","The successful launch of Pandora has also paved the way for other projects utilizing the ERC404 token standard, including technical advancements like ERC404+ and DN404.","This trend indicates a favorable reception within the industry, as market participants embrace the concept of native liquidity for hybrid token standards.","Several projects launched after Pandora on February 2 have already shown promising trading activity, with three projects surpassing 10,000 ETH in volume and an additional 12 projects exceeding 1,000 ETH in volume since their inception.","As reported, gas fees on the Ethereum network have also soared to levels not seen since March 2023 driven by the growing interest in ERC-404.","On February 9, Ethereum gas prices soared to an average peak of 70 gwei, equivalent to $60 for a standard transaction."],"entity":[{"type":"$190 million","content":"MONEY"},{"type":"$344 million","content":"MONEY"},{"type":"$320 million","content":"MONEY"},{"type":"February 13","content":"DATE"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Nansen Product Marketing Manager Journey Li","content":"ORGANIZATION"},{"type":"$1.96","content":"MONEY"},{"type":"February 12, 2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"March 2023","content":"DATE"},{"type":"past week","content":"DATE"},{"type":"February 9","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"ERC","content":"ORGANIZATION"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"February 2","content":"DATE"},{"type":"$21.9","content":"MONEY"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"$60","content":"MONEY"}],"hashtag":["etherem","NFT","Trading Volume"],"authors":["Ruholamin Haqshanas"]}