{"summary":"Crypto Startup Arkham Faces Backlash for Doxxing Users and Privacy Breach","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-startup-arkham-faces-backlash-for-doxxing-users-privacy-breach.htm","publishDate":"2023-07-11T13:00:00","id":21242,"type":null,"title":"Crypto Startup Arkham Faces Backlash for Doxxing Users and Privacy Breach","category":["Altcoin News "],"content":["Blockchain analysis platform Arkham has found itself in hot water after it was revealed that the company had leaked its own customers’ private information. ","The issue stems from Arkham’s weblink referral program, where users can invite others onto the platform by sharing their unique referral URL. ","While these URLs appear to be a random sequence of characters, they are actually an easily decodable version of the user’s email address written in Base64. ","This means that anyone who has shared their Arkham link may have unintentionally put their anonymity or, at the very least, their email address at risk.","The revelation was brought to light by m4gicpotato, a privacy advocate and prominent figure within the crypto community. ","M4gicpotato, who has been working in the crypto space under various aliases since 2017, took to Twitter to share their findings, which quickly went viral.","“ALL ARKHAM REFERRAL LINKS SHARED ON TWITTER IS DOXXING EVERYONE BECAUSE THE EMAIL IS IN THE REFERRAL URL,” they wrote in Monday Twitter thread. ","Simple BASE64 decode","Another Twitter user claimed they had notified Arkham about this issue earlier this year, but the team did not take any measures. ","“I dm’d Arkham about this in January 2023, they said they are aware of the problem,” user @MatsumotoWins said. ","https:\/\/t.co\/ktkAIoz3Ca","Arkham has yet to release an official statement regarding the incident and how they plan to address the privacy concerns raised by their customers. ","The revelation came shortly after Arkham unveiled the Arkham Intel Exchange, which it called the world’s first on-chain “intelligence marketplace.” ","The platform is expected to create a new way for people to share and trade blockchain-related intelligence, creating a new market and opportunity for on-chain researchers.","In a recent blog post, the company said there is a significant demand for on-chain analysis from various individuals such as traders, investors, journalists, researchers, and protocols.","It also noted that a growing community of talented on-chain researchers needs a platform that allows them to monetize their skills.","The Intel Exchange tackles these challenges by connecting buyers and sellers of on-chain intelligence through a bounty mechanism. The company wrote in the announcement:","“Arkham’s Intel Exchange finally gives these talented researchers a way to monetize their skills, and meets the growing demand for on-chain research in a scalable way – by connecting both sides of the on-chain intelligence economy.”","The platform uses a bounty mechanism to do this. Users who need specific on-chain information can request by placing bounties. ","These bounties will then be fulfilled by “bounty hunters,” experienced blockchain researchers who provide the requested intelligence in exchange for the payment."," "],"entity":[{"type":"Arkham Intel Exchange","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"Intel Exchange","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Arkham","content":"LOCATION"},{"type":"January 2023","content":"DATE"}],"hashtag":["Blockchain","Privacy"],"authors":["Ruholamin Haqshanas"]}