{"summary":"Peter Schiff Gets an Unexpected Lesson in the Benefits of Bitcoin as Banking Woes Bite","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/peter-schiff-gets-an-unexpected-lesson-benefits-of-bitcoin-as-banking-woes-bite.htm","publishDate":"2022-07-04T09:53:00","id":21249,"type":null,"title":"Peter Schiff Gets an Unexpected Lesson in the Benefits of Bitcoin as Banking Woes Bite","category":["Bitcoin News "],"content":[" ","The arch-Bitcoin (BTC) skeptic Peter Schiff has experienced problems with the traditional international banking system – giving BTC advocates the opportunity to tell him that his struggles could have been avoided had he made use of bitcoin.","Schiff has become infamous in the world of crypto Twitter, where he regularly takes the opportunity to troll BTC advocates – even crossing swords with the likes of Elon Musk.","He took to Twitter to complain that “despite no evidence of crimes,” Puerto Rican “regulators” had “closed” his “bank account” for “net capital issues,” instead of allowing him to “make a sale.”","He added that he was a “highly qualified buyer” who had been “promising to inject capital far in excess” of Puerto Rican “regulatory minimums.”","Schiff is an outspoken stock broker and the CEO of Euro Pacific Capital. He evangelizes gold-buying as an investment strategy, but claims that BTC is a scam. He has also positioned himself as a broadcaster in recent years, launching a self-titled podcast.","Per the Associated Press, Schiff’s Puerto Rican banking outfit, Euro Pacific International Bank, was granted an operating permit in 2017, but has since run into trouble after deposits dropped to the USD 150 million mark.","Two years ago, the Joint Chiefs of Global Tax Enforcement, a government-run anti-tax crime and money laundering unit, stepped in “to put a stop to the suspected facilitation of offshore tax evasion and money laundering,” the same media outlet reported.","Schiff claimed that his bank had never been probed and claimed that the only brush he had had with the body was when “agents with the Internal Revenue Service visited the bank in 2020 and told him they were investigating customers.”","Schiff claimed last week that he would fight to save his ailing business. The bank account closure appears to be linked to these firefighting efforts.","He complained, also on Twitter:","“It costs a fortune to run a small bank. That’s why I never really made any money. The compliance costs are outrageous.”","Some bitcoiners replied by simply expressing their mirth, while others quipped:","“Bitcoin fixes this.”","One explained:","“Regulators can’t close, shut down, or freeze your bitcoin.”","In addition to a large amount of LOL emojis and memes, there were also a few more level-headed responses.","The Managing Director of Swan Bitcoin International Stephan Livera wrote:","“In fairness, bitcoin companies and bitcoiners can also easily have their fiat bank accounts shut down. But for him to completely deny the value of bitcoin at times like this is just burying your head in the sand.”","In a recent BTC-themed Twitter tirade, Schiff claimed that because bitcoin “whales” had “succeeded in pumping” the coin “close to USD 70,000, it was now “much easier for them to unload more worthless bitcoin at USD 20,000, as those suckers who are buying think they’re getting a bargain.”","He added:","“These ‘bargain’ hunters averaging down will eventually be known as bag holders.”","Acid words such as these have alienated many bitcoiners, although many in the space simply regard Schiff as a harmless and sometimes amusing eccentric.","____","Learn more: \n– G7 Inadvertently Makes the Case for Bitcoin with New Gold Move\n– The Words We Use In Bitcoin: Words, Language, Terminology, and Linguistic Attacks\n\n– Following MicroStrategy, El Salvador’s Bukele Buys Another Bitcoin Dip Too, Skeptics Chime In\n– How Bitcoin Critic Peter Schiff Launched Another ‘Proof of Keys’ Day\n\n– Buffet’s Gold Investment Triggers Schiff’s Attack on Bitcoin\n– Peter Shiff’s ‘Lost’ Bitcoin ‘Mystery is Solved’!"],"entity":[{"type":"Associated Press","content":"ORGANIZATION"},{"type":"150 million mark","content":"MONEY"},{"type":"Swan Bitcoin International Stephan Livera","content":"ORGANIZATION"},{"type":"Euro Pacific Capital","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Peter Schiff","content":"PERSON"},{"type":"Peter Shiff","content":"PERSON"},{"type":"Euro Pacific International Bank","content":"ORGANIZATION"},{"type":"Terminology","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Puerto Rican","content":"LOCATION"},{"type":"Gold Investment Triggers Schiff’s Attack","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Schiff","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"El Salvador’s Bukele Buys Another Bitcoin Dip Too","content":"ORGANIZATION"}],"hashtag":["Banking","Bitcoin"],"authors":["Tim Alper"]}