{"summary":"Pakistan Finance Minister Says Country Will Never Legalize Crypto, Cites FATF Regulations","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/pakistan-finance-minister-says-country-will-never-legalize-crypto-cites-fatf-regulations.htm","publishDate":"2023-05-18T13:00:00","id":21253,"type":null,"title":"Pakistan Finance Minister Says Country Will Never Legalize Crypto, Cites FATF Regulations","category":["Altcoin News "],"content":["Pakistan Finance Minister has said the country will not legalize crypto trading, citing regulations by the Financial Action Task Force (FATF).","On Wednesday, Pakistan Minister of State for Finance Aisha Ghaus said the government cannot permit crypto trading because of the country’s recent exit from the FATF grey list.","“Permission to trade in cryptocurrency cannot be granted,” she stated during a session of the Senate Standing Committee on Finance and Revenue. ","“Cryptocurrency will not be allowed. We cannot deal in cryptocurrency. Now that we have come out of FATF, this is an area we should avoid. Crypto can also lead to financial terrorism, already we are not getting an IMF deal, they need some excuses against us.”","In October last year, the FATF removed Pakistan from its list of countries under “increased monitoring” claiming that the country has “addressed technical deficiencies to meet the commitments of its action plans”","Pakistan had been on the “grey list” of the global money laundering and financing watchdog since 2018. ","The FATF is an intergovernmental organization tasked with combating money laundering and terrorist financing. The watchdog has maintained a “black list” as well as a “grey list” since 2000. ","Countries on the grey list face restrictions in the financial services sector, while those on the black list may be subject to economic sanctions by members of the FATF.","While Pakistan has not legalized cryptocurrencies so far, the country has neither imposed a ban on the digital asset class. However, this could change as some policymakers are advocating for a ban on the industry.","For one, Senator Farooq Naek has called for a complete ban on cryptocurrencies citing financing terrorism risks as well as crypto’s speculative nature. ","Furthermore, the State Bank of Pakistan (SBP), the Central Bank of the country, reportedly described cryptocurrencies as total fraud that would never be recognized in the country.","Ghaus also claimed that the central bank has started working on banning cryptocurrency trading. ","“State Bank of Pakistan (SBP) and the IT Ministry have started working on banning cryptocurrencies,” she said, adding that FATF has also imposed conditions and cryptocurrencies will not be allowed.","Pakistan experienced a surge in cryptocurrency adoption in recent years as the country suffers from soaring inflation and a high rate of unbanked population. According to the World Bank, the county has more than 100 million adults without a bank account.","The country ranked third in the Global Crypto Adoption Index for 2021, according to Chainalysis, a blockchain data platform. However, it slipped to sixth place in 2022.","In a 2021 report, the policy advisory board of the Federation of Pakistan Chambers of Commerce and Industry revealed that Pakistanis had invested approximately $20 billion in cryptocurrencies."],"entity":[{"type":"Pakistan Finance Minister","content":"ORGANIZATION"},{"type":"State Bank of Pakistan","content":"ORGANIZATION"},{"type":"Pakistan","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Senator Farooq Naek","content":"PERSON"},{"type":"Senate Standing Committee on Finance and Revenue","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"October last year","content":"DATE"},{"type":"State Bank of Pakistan (SBP","content":"ORGANIZATION"},{"type":"Pakistan Minister of State for Finance Aisha Ghaus","content":"ORGANIZATION"},{"type":"IT Ministry","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Financial Action Task Force (FATF","content":"ORGANIZATION"},{"type":"World Bank","content":"ORGANIZATION"},{"type":"Federation of Pakistan Chambers of Commerce and Industry","content":"ORGANIZATION"}],"hashtag":["IMF","Regulation"],"authors":["Ruholamin Haqshanas"]}