{"summary":"Weeks Of Sideways Trading Ahead as Bitcoin Newbies Panic Selling to Hodlers","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/weeks-of-sideways-trading-ahead-as-bitcoin-newbies-panic-sel-10350.htm","publishDate":"2021-05-18T10:42:00","id":21250,"type":null,"title":"Weeks Of Sideways Trading Ahead as Bitcoin Newbies Panic Selling to Hodlers","category":["Bitcoin News "],"content":["Bitcoiners are hopeful that bitcoin (BTC) will bounce back stronger following its recent Elon Musk-fuelled price setback – but the likes of Galaxy Digital CEO Michael Novogratz say that choppy waters could be ahead for at least the next few weeks as new entrants are panic-selling.","BTC has had a turbulent month after months of steady growth, and dropped into the mid-to-low USD 40,000s on most exchanges over the weekend. The token is currently making a slow and unsteady recovery.","Many have blamed mass liquidations in the derivatives market for the price drops, with some seemingly newer investors deciding to cut their losses after Musk’s Tesla announced it would stop accepting BTC citing mining-related environmental concerns as its reasons. Musk has also denied claims Tesla had liquidated the remainder of its USD 1.5bn worth of BTC purchase from earlier this year.","In an interview with Bloomberg TV, Novogratz stated that the USD 40,000- USD 50,000 price range was currently fair and added a defense of BTC mining, stating,","“I think we are going to consolidate for a while: Four to six weeks. […] I took [Musk’s] mining comments at face value. I don’t think that’s Bitcoin-specific. That’s everything specific: The gold market, YouTube. They all use a lot of electricity. And Elon has businesses in clean energy.”","And the Galaxy chief claimed that the crypto industry as a whole was working on Environmental, Social, and Corporate Governance (ESG)-related initiatives, with some already planning to mitigate miners’ environmental impact with carbon offset projects and carbon credits.","He said,","“Like all industries, ESG is important. And the crypto industry including Galaxy is going to address it.”","Last week, Galaxy Digital Research published a report that claims that the gold industry and the banking system are using much more electricity than the Bitcoin network.","“The [proof-of-work] energy consumption narrative is nuanced, to say the least, and what follows will be a test for the whole Bitcoin market’s conviction,” Glassnode, a crypto market analysis provider, said in their latest report.","For price-watchers, meanwhile, Novogratz said he was hopeful of a regulatory breakthrough. Galaxy and others are hopeful of winning American Securities and Exchange Commission approval for a BTC exchange-traded fund (ETF) “at the end of this year or early next year,” calling approval “the next catalyst” for price growth.","He added, “Let’s not miss the big picture for the small picture. We are going through a once-in-a-generational shift in this crypto blockchain evolution, where the financial infrastructure is starting to be rebuilt. That process is picking momentum.”","Meanwhile, Glassnode noted that it observed “new entrants panic-selling” and BTC “HODLers stepping in to buy the dip.”","The analyst also stressed that while this is the deepest correction of the current bull market, it is consistent with five major pull-backs during the 2017 bull.","During the correction this May, “a total of 1.1M addresses have spent all coins they held during this correction, again providing evidence that panic selling is currently underway,” Glassnode said, adding that the number of addresses that are in accumulation has increased by 1.1% since the recent low.","Moreover, per the firm, the supply held by long-term holders has returned to accumulation mode, a pattern that again resembles the 2017 macro top.","They also noted that a pattern of panic selling is similar to that observed at the 2017 macro peak. The firm, however, didn’t rule out that, this time, it may be a larger time-frame pull-back in a bull cycle, as weak hands capitulate, and stronger hands recommence their accumulation of cheaper coins.","Meanwhile, Novogratz also had a message for ethereum (ETH) advocates, opining that the token would fluctuate between USD 2,800 and USD 4,000 in its own consolidation period that would also last up to six weeks.","At 10:21 UTC, BTC trades at USD 44,975 and is down less than 1% in a day and almost 20% in a week. ETH also dropped by less than 1%, trading at USD 3,475. It’s down by 13% in a week.","____","Learn more:\n– Fundstrat’s Tom Lee Boosts Bitcoin Target 25% Despite Musk’s Criticism\n– Bitcoin May Double This Year Despite Energy Concerns – Pantera CEO","– Traders Rotate From Bitcoin To Alts, While JPMorgan Sees Ether As Overvalued\n– If History Rhymes, ETH Might Hit USD 19K; Downside Risk Stronger Than BTC’s"],"entity":[{"type":"Galaxy Digital Research","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Musk’s Tesla","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Elon","content":"PERSON"},{"type":"Novogratz","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"13%","content":"PERCENT"},{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"Tesla","content":"PERSON"},{"type":"Bitcoin May Double This Year Despite Energy Concerns – Pantera CEO","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Tom Lee","content":"PERSON"},{"type":"1.1%","content":"PERCENT"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Michael Novogratz","content":"PERSON"},{"type":"ESG","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"American Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Glassnode","content":"PERSON"},{"type":"Traders Rotate From Bitcoin To Alts","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Ethereum","Forecast","Market","Mike Novogratz"],"authors":["Tim Alper"]}