{"summary":"This Is The Biggest Risk To Crypto Market According to Pantera Capital CIO","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/this-is-the-biggest-risk-to-crypto-market-according-to-pante-8895.htm","publishDate":"2021-01-13T18:24:00","id":21255,"type":null,"title":"This Is The Biggest Risk To Crypto Market According to Pantera Capital CIO","category":["Bitcoin News "],"content":["Leveraged trading is the biggest risk to the crypto market in terms of what could cause “something to pop down the line,” according to Joey Krug, Co-chief Investment Officer (CIO) at US-based major crypto investment company Pantera Capital. (Updated at 19:20 UTC with more comments by Joey Krug).","He was speaking during Pantera Capital’s conference call yesterday.","According to Krug, some people get complacent when they realize crypto is here to stay. As a result, they lever up on it, thinking it can’t go down that much because institutions will swoop in and buy, saving the day. But eventually, when the lid blows off and bids are not there, liquidations of levered longs will drive the price down.","During the market crash on January 10-11, more than USD 3bn worth of long positions were liquidated, according to bybt.com data. To compare, on January 12, over USD 200m worth of short and also more than USD 200m long positions were liquidated.","As reported, crypto researcher and analyst Willy Woo argued that “unlike previous crashes in the past 2 years, where over-leveraged markets lead by trader liquidation, this one started on spot markets, then was greatly amplified by a single exchange partially failing, yet did not turn itself off for the good of the ecosystem.”","Leveraged trading refers to borrowing funds so that you can take a larger position than you would be able to with your existing funds so that you can potentially generate a higher profit. However, while margin trading enables traders to amplify their returns, it can also lead to increased losses and liquidations, which is why experienced traders tend to advise newcomers to stay away from leveraged trading.","As for Pantera Capital itself, the firm took some risk off the table when the Market Value to Realised Value (MVRV) ratio rose to its highest level since 2017 a few days ago. The indicator shows how much unrealized gains bitcoin (BTC) holders are sitting on. When this metric gets high, it means the market is overheated, and if it starts to decline, people sell in order to lock-in gains out of panic or fear, Krug explained on the call.","According to Krug, this recent crash was a healthy outcome for this space, noting that people realized some gains and the market pulled back a bit in a consolidation period.","Now, the CIO said, the market is in a good position for the next leg upward and it is his view that the rally is going to continue.","At the time of writing (19:18 UTC), BTC trades at USD 35,805 and is up by almost 3% in a day and less than 1% in a week. It rallied by 86% in a month.","Meanwhile, during the call yesterday, Pantera Capital CEO Dan Morehead described the global macro environment as “off the charts,” pointing to the unprecedented pace at which the United States is printing money each month and “pushing it like crazy.”","As a result, the main two cryptoassets – BTC and ethereum (ETH) – have soared, which illustrates the next point, which is that “this rally has consolidated around bitcoin and ethereum,” according to Pantera slides.","BTC’s and ETH’ share of the total market capitalization:","Krug also noted that institutional investors are primarily honing in on bitcoin and ethereum and outside of these two assets there is not a great deal of institutional interest. He also waded into decentralized finance (DeFi), saying that these tokens are getting “pushed up” indirectly by BTC and ETH. The CIO also noted that it will not be this cycle when institutions buy DeFi protocols, adding that it will probably be the next cycle or the one after that.","Another huge development has been the rise of central bank digital currencies (CBDCs), a trend that has been led by China, which Morehead noted “has a very big headstart on the world.” And while they don’t directly impact the price of tokens that are not pegged to fiat money like stablecoins, they will still introduce “billions of people” to the market including those without bank accounts but with smartphones, Morehead said.","___","Learn more:\nThis Is The Main Story in Bitcoin Now According to Pantera Capital CEO\nNot Only Bitcoin Price Is Changing During This Bull Run\nCoinbase Apologizes To European Users For Missed Higher Profits\nUS Dollar and Coinbase Also Blamed For Bitcoin Sell-Off\nThe UK and US Clamping Down On Crypto Trading – It’s Not Yet A Big Deal\nWhat Are Leveraged Tokens And Should You Trade Them?\nCryptoasset Margin Trading: How Safe is it?"],"entity":[{"type":"CIO","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"86%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"January 10","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"11","content":"DATE"},{"type":"January 12","content":"DATE"},{"type":"Morehead","content":"ORGANIZATION"},{"type":"Joey Krug","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Dan Morehead","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Krug","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin","Ethereum","Trading"],"authors":["Gerelyn Terzo"]}