{"summary":"Franklin Templeton Praises Base Network in SocialFi, Cites Success with Friend.Tech","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/franklin-templeton-praises-coinbase-incubated-base-layer-2-network-in-socialfi-cites-success-with-friend-tech.htm","publishDate":"2024-05-10T14:23:16","id":21254,"type":null,"title":"Franklin Templeton Praises Base Network in SocialFi, Cites Success with Friend.Tech","category":["Blockchain News "],"content":["Franklin Templeton, a powerhouse asset manager overseeing trillions in assets, has spotlighted Base, an Ethereum Layer 2 network incubated by Coinbase, as a frontrunner in the realm of Social Finance (SocialFi) with its prime application, Friend.tech.","With its innovative approach and strategic partnerships, Base is poised to capture a significant share of SocialFi activity, marking a pivotal moment dubbed “Base Season” by Franklin Templeton.","According to a Franklin Templeton report, a substantial 46% of transactions within the SocialFi sector are now routed through Base, showcasing its dominance and growing influence in this layer 2 domain. Notably, Friend.Tech emerges as a standout application within the Base ecosystem, leveraging the platform to revolutionize social interactions and content monetization.","“[It is] positioning itself well to capture a material share of SocialFi activity and remain a leader in the Ethereum L2 sector going forward,” Franklin Templeton shared the report.","Friend.Tech’s recent milestone achievements, including the launch of its second version and the FRIEND token airdrop, show Base’s pivotal role in empowering SocialFi innovations. With a substantial market cap of $200 million, the FRIEND token exemplifies the robust community engagement and investor confidence fostered within Base’s ecosystem.","It's Base Season pic.twitter.com\/kAhcwkpreE","— Franklin Templeton Digital Assets (@FTI_DA) May 9, 2024","","One of Base’s distinguishing features is its utilization of “optimistic rollups,” a technology that accelerates transactions and reduces costs by batching them off the Ethereum mainnet. This approach enables Base to maintain Ethereum’s rigorous security standards while significantly enhancing transaction throughput and efficiency.","In contrast to its counterparts like Arbitrum and Optimism, Base has experienced unprecedented growth, with its total value locked (TVL) skyrocketing by over 630% year-to-date, reaching $5.45 billion. According to L2beat, this remarkable surge in TVL solidifies Base’s position as the third-largest Ethereum layer 2 network, trailing only behind Arbitrum One and OP Mainnet.","Crucially, Base’s success can be attributed in part to its close affiliation with Coinbase, which serves as the sole sequencer of the network. While Coinbase maintains complete control over Base, plans for gradual decentralization are in motion, ensuring the platform’s long-term sustainability and resilience.","Degen Chain, a layer-3 blockchain operating atop the Base network, has recently rapidly gained traction, boasting nearly $100 million in transactional volumes within 24 hours of its launch. Despite being in operation for only four days, the network has recorded over 272,000 unique transactions and the creation of thousands of contracts and tokens, albeit many associated with scams or rug pulls.","As a layer-3 blockchain explicitly tailored for the DEGEN token, Degen Chain utilizes layer-2 protocols to facilitate faster transactions and targeted functionalities like payments, gaming transactions, and community rewards. While DEGEN serves as the native gas token for fee payments within the chain, tokens like Degen Swap (DSWAP) and Degen Easter Eggs (DEE) have also emerged, with valuations exceeding millions of dollars, albeit primarily driven by speculative trading.","However, the rapid growth of Degen Chain has sparked debates within the crypto community regarding the necessity and potential drawbacks of layer-3 networks. While some argue that these networks may divert value away from mainnets like Ethereum, others including Polygon CEO Marc Boiron are divided about it. Boiran said in a tweet,","“I’ll say the quiet part out loud: L3s exist only to take value away from Ethereum and onto the L2s on which the L3s are built. You do not need L3s to scale.”","However, he also contends that they offer unique functionalities and value propositions that complement existing layer-2 solutions."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"DEGEN","content":"PERSON"},{"type":"Base","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Degen Chain","content":"ORGANIZATION"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Base Season pic.twitter.com\/kAhcwkpreE","content":"ORGANIZATION"},{"type":"630%","content":"PERCENT"},{"type":"May 9, 2024","content":"DATE"},{"type":"Social Finance","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Degen","content":"PERSON"},{"type":"Franklin Templeton Digital","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"millions of dollars","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"3","content":"DATE"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$5.45 billion","content":"MONEY"}],"hashtag":["Base","Coinbase"],"authors":["Hassan Shittu"]}