{"summary":"The review has concluded and the federal bank regulator will communicate determinations and feedback to bank charter applicants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123216\/acting-us-comptroller-says-both-occ-crypto-review-and-interagency-crypto-sprint-have-concluded","publishDate":"2021-11-03T17:27:20","id":2125,"type":null,"title":"Acting US comptroller says both OCC crypto review and interagency &#x27;crypto sprint&#x27; have concluded","category":["REGULATION"],"content":["At the start of his tenure, Acting Comptroller of the Currency Michael Hsu initiated a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105263\/acting-occ-chief-has-begun-a-staff-review-of-crypto-related-actions\" data-v-f87c67ca=\"\">review<\/a> into crypto-specific actions taken ahead of his installation. Hsu shared Wednesday that the review has concluded and the federal bank regulator will communicate determinations and feedback to bank charter applicants.","Hsu's remarks came at the American Fintech Council's Fintech Policy Summit, where he focused heavily on the lack of consolidated regulatory oversight for crypto firms.","In the past, Hsu has also harped on the issue of a lack of coordinated effort across agencies to clarify rules of the road and regulate crypto firms. To that end, he set up a \"<a href=\"https:\/\/www.theblockcrypto.com\/post\/105374\/occ-federal-reserve-fdic-inter-agency-sprint-team-crypto-regulation\" data-v-f87c67ca=\"\">crypto sprint\"<\/a> between the Office of the Comptroller of the Currency, the Federal Reserve and the Federal Deposit Insurance Corporation.","That joint effort has concluded as well, Hsu said Wednesday, and he added that&nbsp;the results will be communicated \"shortly\" in a variety of forms.","\"The content of these communications — on the chartering decisions, interpretive letters, and the crypto sprint — will be broadly aligned with the vision for the bank regulatory perimeter laid out here today,\" he said.","These will clarify what Hsu calls the \"regulatory perimeter\" focusing on what regulators consider the most salient questions. Hsu included a few of these questions in his remarks:","\"How should “synthetic banking” be defined? What constitutes 'universal' activity for a crypto firm? (Should certain crypto activities even be allowed to mix?) What adjustments to bank prudential standards and supervisory approaches are needed to ensure that such firms operate safely, soundly, and fairly? To answer these and other critical questions meaningfully, federal and state regulators will need to engage technology and crypto firms, academics, community groups, banks, trade associations, and other stakeholders.\"","Hsu argued that \"fragmented supervision\" obscures the sometimes \"excessive\" risks that firms might take. He pointed to the patchwork oversight in 2008 that allowed AIG to take on large swaths of risks via a subsidiary, which eventually led to the firm's large-scale collapse and much-debated bailout. Hsu pointed to this event as a lesson for crypto regulation, saying to avoid a similar catastrophe and build \"long-term trust\" with the public, crypto firms and especially stablecoin issuers should embrace \"comprehensive, consolidated supervision.\"","Hsu called on federal and state bank regulators to likewise prioritize this development. He then named two firms — crypto exchange Binance and stablecoin operator Tether — as examples with unfavorable track records.","\"This would clearly differentiate safe and sound crypto firms from those that are regulated only partially and have a history of control lapses, such as Binance and Tether,\" he said.","The process conclusions come as the OCC moves closer to a change of leadership. The Biden administration has announced its <a href=\"https:\/\/www.theblockcrypto.com\/post\/123154\/biden-formalizes-nominee-to-lead-the-us-national-bank-regulator-what-does-she-think-about-crypto\" data-v-f87c67ca=\"\">nomination<\/a> for head of the OCC, formally tapping Saule Omarova, a professor at Cornell’s Law School. Omarova faces resistance from Republicans, who have accused her of being decidedly \"anti-bank.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Cornell’s Law School","content":"ORGANIZATION"},{"type":"Fintech Policy Summit","content":"ORGANIZATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hsu","content":"PERSON"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"Michael Hsu","content":"PERSON"},{"type":"Saule Omarova","content":"PERSON"},{"type":"American Fintech Council","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"AIG","content":"ORGANIZATION"},{"type":"sprint","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"}],"hashtag":["OCC"],"authors":["Aislinn Keely","The Block"]}