{"summary":"Ukraine Celebrates Independence Day: BTC 600 & ETH 10K Donated; Russia-Connected Wallet Blocked","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ukraine-celebrates-independence-day-btc-600-eth-10k-donated-russia-connected-wallet-blocked.htm","publishDate":"2022-08-25T13:00:00","id":21259,"type":null,"title":"Ukraine Celebrates Independence Day: BTC 600 & ETH 10K Donated; Russia-Connected Wallet Blocked","category":["Bitcoin News "],"content":[" ","As Russia entered the sixth month of its brutal war against Ukraine, Ukrainians celebrated their Independence Day on August 24. So far, nearly BTC 600 and ETH 10,190 have been donated to Ukraine, and the country blocked a digital asset account supporting the invasion. ","The world’s cryptocurrency industry continues to support Ukraine in its combat against the invaders, to date, the community has raised more than USD 60m worth of crypto to bolster the country’s defense capacities.","Crypto users have donated some BTC 595.444, ETH 10,190.843, USDT 10.44m, USDC 2.23m, and SOL 7,874.76, according to the available data from the Ukrainian Ministry of Digital Transformation.","The crypto market is currently experiencing a downturn, which reflects on the total value of the collected funds, but the donated crypto continues to serve Ukraine’s Armed Forces. It continues to facilitate purchases of much-needed equipment such as bulletproof vests, helmets, clothing, medical supplies, and backpacks. ","Per the website, among other expenses, some USD 3.85m has been spent on field rations, USD 1.2m on medical kits, and nearly USD 11m on necessary equipment, while some 35 tons of fuel have been purchased as well. ","The total expenses until July 7 were USD 54.57m, the website stated. ","The war effort takes place on Ukrainian soil, but also in the cryptosphere. A day before the country’s Independence Day, the Security Service of Ukraine (SSU) announced that, for the first time since the war’s outbreak, it blocked a digital asset wallet that was found to be involved in financing Russia’s military.","The wallet belonged to a Russian citizen operating from Ukraine’s territory who supports the invaders and has been collecting funds to finance the attack against Ukrainians. The SSU has arrested the man under an operation facilitated by the evidence gathered by the service, but also the assistance of foreign crypto businesses, according to the statement.","“For the time of blocking, over USD 19,500 have accumulated at the [R]ussian’s account,” the SSU said. “These funds have been seized and decision on their tracking and transfer to Ukrainian jurisdiction is pending.”","Since the beginning of the invasion, the man has used social media to promote financial assistance to illegal militias sponsored by Russia and involved in terrorist operations in Ukraine’s eastern part, according to the statement.","____","Learn more: \n– Ukrainian Charity Uses Crypto Actively, Says Donations Have Risen During Bear Market\n– As Nobel Prize Winner Scores USD 100M for Ukraine, CryptoPunk Just Did Its Part Too\n\n– Ukrainian Eurovision Winner Sells NFTs in Support of Ukraine’s Defense\n– Watch & ‘Invest in Peace’: Ukrainian Deputy PM Raps to Encourage More Crypto Donations\n– Ukraine’s New Fundraising Platform Supports Over 100 Cryptos\n\n– Finland Set to Donate Bitcoin Seized from Criminals to Ukraine – Report\n– No, Ukrainian Prosecutors Didn’t Just Seize 830kg of Silver from an OTC Crypto Gang – Here’s What Happened"],"entity":[{"type":"July 7","content":"DATE"},{"type":"Security Service","content":"ORGANIZATION"},{"type":"Donate Bitcoin Seized","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ukrainian Ministry of Digital Transformation","content":"ORGANIZATION"},{"type":"CryptoPunk Just Did Its Part Too\n\n– Ukrainian Eurovision Winner Sells NFTs in Support of Ukraine’s Defense\n– Watch & ‘Invest","content":"ORGANIZATION"},{"type":"August 24","content":"DATE"},{"type":"Nobel Prize Winner Scores USD","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Ukraine’s Armed Forces","content":"ORGANIZATION"},{"type":"SSU","content":"ORGANIZATION"},{"type":"Finland","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Bitcoin","Charity","Ethereum","Solana","Ukraine","Ukraine war","USDC","USDT"],"authors":["Jaroslaw Adamowski"]}