{"summary":"Watch: Polygon’s Co-founder On ‘Holy Grail’ of Scaling, Ethereum Merge, NFTs, and More","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/watch-polygons-co-founder-on-holy-grail-of-scaling-ethereum-merge-nfts-and-more.htm","publishDate":"2021-11-18T19:00:00","id":21269,"type":null,"title":"Watch: Polygon’s Co-founder On ‘Holy Grail’ of Scaling, Ethereum Merge, NFTs, and More","category":["Ethereum News "],"content":["\nPolygon (MATIC), a layer 2 (L2) scaling solution for Ethereum (ETH), will continue to focus on zero-knowledge (ZK) technologies as the team believes it is “the ultimate holy grail for blockchain scaling,” Polygon’s Co-founder and Chief Operations Officer (COO) Sandeep Nailwal said in an exclusive interview with Cryptonews.com during the Blockchain Economy Expo 2021 conference in Dubai this week. ","Nailwal revealed that Polygon is ready to launch a number of new initiatives soon and they will continue to focus on ZK technology as they see it as a cornerstone for blockchain scaling.  ","“We have multiple other initiatives also on that front to be launched very soon and we’ll be very very heavily focused on zero-knowledge in the next six to eight months and we believe that zero-knowledge is the ultimate holy grail for the blockchain scaling and that’s where we are going,” he said.","When asked about the upcoming Ethereum merge, Nailwal said that it is a very positive development for all L2 technologies developing on Ethereum since all projects must anchor some data back to the base chain and it is currently very costly.","Speaking of Polygon and non-fungible tokens (NFTs), he, referring to an unnamed analytics firm, stated that 80% of NFTs are on Ethereum and 15% are on Polygon.","“We have probably 500 plus games deployed on Polygon and growing day-by-day,” he added.","Also, Sandeep noted that he believes in the multichain world but not in a traditional sense. In his view, the multichain world will exist on top of Ethereum. ","“We believe that Ethereum is going to be the ultimate settlement layer and on top of it there will be a lot of layer two’s that will be built and connected with it,” he said.","When asked to name Polygon’s key competitors, he mentioned StarkWare, a competing Ethereum L2 developer, which recently closed a USD 50m Series C funding round led by Sequoia Capital. ","He also said that Polygon is going to deploy an increasingly aggressive acquisition strategy moving forward.  ","“I mean, we want to become the transaction layer of Ethereum and we’ll constantly keep on doing that,” he said.\n____","Watch the full interview and hear what Sandeep Nailwal has to say about Polygon’s goals, the upcoming Ethereum merge, NFTs, multichain future, competitors, their M&A strategy, and more. \n  ","The interview is brought to you by Matt Zahab and Eimantas Žemaitis.\n__","The transcript of the interview:","How has 2021 been for Polygon so far?","It’s been really great, it has been a really rewarding journey. On the same side, it has been very very taxing – like you know I think we all aged like five or maybe ten years in the last two or three years. So definitely I’ve picked up weight, lost hair – the same with my team – so it’s been rewarding as well as hard-working time for us.","What are your strategic expansion goals for 2022?","The strategic expansion plan from our side is very heavily focused towards the zero-knowledge technology. We recently announced a billion-dollar fund on zero-knowledge and then out of that we’ve done multiple acquisitions, we’ve announced Polygon Hermez, which was the first zero-knowledge product that we launched. Then we also did Polygon Nightfall which is with the Ernst & Young, one of the big four companies in the world in terms of auditing consultancy. And then we have multiple other initiatives also on that front to be launched very soon and we’ll be very very heavily focused on zero-knowledge in the next six to eight months and we believe that zero-knowledge is the ultimate holy grail for the blockchain scaling and that’s where we are going.  ","How might Polygon be affected by the upcoming Ethereum merge? Any plans to combat this?","No no, it’s actually very positive for any layer 2. See, all layer 2 projects have to put some data or some proofs back to Ethereum, and right now that costs a lot. So when the merge comes and Ethereum becomes like, let’s say from 13 transactions to 30 transactions per second with this much proof of stake merge – I’m not talking about the sharding, like 64 shards thing, which is at least like 3 to 5 years away if at all it is coming, we’re only talking about the merge that is happening which is proof-of-stake, and many people think that ok, the whole sharding ETH 2.0 is coming – it’s not. It’s simply the merge from proof-of-work to proof-of-stake, and then Ethereum is going to have like probably thirty transactions per second from there. It’s good for us, it’s good for all the layer 2 projects overall.","What trends do you see in Polygon and how is Polygon going to be used in the NFT space more specifically? ","So NFT, already like, I mean again, this is not a very widespread knowledge somehow but NFTs Polygon is the biggest project. Like we recently spoke with somebody, I mean I can’t name but one of the biggest analytics platforms and they were doing analytics on Instagram for example so you know 80% of the Instagram NFTs are on Ethereum, 15% are on Polygon and the rest 5% is on others… So Ethereum plus Polygon form like 95% of the NFT market. So you know Polygon does not have those big like you know 100 million dollar NFTs but the smaller NFTs which is what Polygon is built for – games and metaverses – Polygon has the leading position in that and we’re the largest NFT platform in that sense. We have probably 500 plus games deployed on Polygon and growing day-by-day.","How is the multichain blockchain landscape looking moving forward?","I mean we’ve been very clear that [the] world is going to be multichain but we feel that multichain is not on the layer 1 but on layer 2. So we believe that the world will be multichain but the multichain world will exist on top of Ethereum instead of multiple layer 1’s existing – we don’t believe in that thesis. We believe that Ethereum is going to be the ultimate settlement layer and on top of it there will be a lot of layer two’s that will be built and connected with it. ","Who do you see as your main competitor right now and how are you going to combat them?","StarkWare. I think that on the zero-knowledge side, I think that StarkWare is the most formidable team, and with our multiple zero-knowledge efforts, we believe that, you know, we would be able to edge ahead on that but StarkWare is a very formidable team. ","With how quickly you and your team are growing right now would you ever consider a fresh capital raise?","We actually, yes, we would be doing something in the future, and, you know, planning for something we might do a small capital raise.","Your M&A strategy moving forward? ","It’s going to be more and more aggressive, you know, I mean, we want to become the transaction layer of Ethereum and we’ll constantly keep on doing that.\n___\nLearn more: \n– Ethereum, Solana, Polygon & Co Form A New Hot Market Of Blockchains \n– Multi-Chain Future Brings Multiple Competitors to Bitcoin & Ethereum – Analysts\n– Ethereum Needs to Try Harder To Keep Its Dominance in a Multichain Future "],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Polygon","content":"LOCATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"last two or three years","content":"DATE"},{"type":"Multi-Chain Future Brings Multiple Competitors to Bitcoin & Ethereum – Analysts\n– Ethereum Needs","content":"ORGANIZATION"},{"type":"Polygon Hermez","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Eimantas Žemaitis","content":"PERSON"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"Polygon & Co","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Polygon Nightfall","content":"ORGANIZATION"},{"type":"Nailwal","content":"PERSON"},{"type":"Matt Zahab","content":"PERSON"},{"type":"Sandeep","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ernst & Young","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","M&A","NFT","Non-fungible tokens","Polygon","Scalability"],"authors":["Eimantas Žemaitis"]}