{"summary":"FTX Trading and its affiliated debtors said Friday that they would seek the return of crypto held by the Securities Commission of the Bahamas to their chapter 11 estates for the benefit of creditors.\nThe debtors said the value of the cryptocurrency in a Fireblocks wallet controlled by the Bahamas regulator was valued at $296 million at spot market prices when it was initially transferred and currently worth $167 million.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198601\/ftx-debtors-will-seek-return-of-crypto-held-by-bahamas-regulator","publishDate":"2022-12-30T18:47:00","id":2126,"type":null,"title":"FTX Debtors will seek return of crypto held by Bahamas regulator","category":["Companies"],"content":["FTX Trading and its affiliated debtors said Friday that they would seek the return of crypto controlled by the Securities Commission of the <span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas to their chapter 11 estates for the benefit of creditors.<\/span>","The Bahamas security commission <a href=\"https:\/\/www.theblock.co\/post\/198434\/bahamian-regulator-holding-3-5-billion-of-ftx-customer-assets\" data-v-f87c67ca=\"\">on Thursday<\/a> said it had been holding on to more than $3.5 billion worth of FTX customer assets since Nov. 12. The FTX Debtors alleged that the funds were transferred after bankruptcy proceedings had started by former FTX CEO Sam Bankman-Friend and former CTO Gary Wang at the request of local authorities in the Bahamas.","\"The FTX Debtors have informed the <span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas<\/span>&nbsp;Commission that none of Mr. Bankman-Fried, Mr. Wang or the&nbsp;<span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas<\/span> Commission had a right to take cryptocurrency of the FTX Debtors,\" the group said in a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-provide-information-concerning-bahamas-crypto-seizure-301711610.html?tc=eml_cleartime\" data-v-f87c67ca=\"\">statement<\/a>.","The debtors said the value of the cryptocurrency in a Fireblocks wallet controlled by the Bahamas regulator was valued at $296 million at spot market prices when it was initially transferred and currently worth $167 million.","\"There can be no assurances such a large amount of FTT could be sold at spot prices, or at all,\" the debtors said in the statement, referring to FTX's native token. \"The FTX Debtors urge the&nbsp;<span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas<\/span> Commission to clear up any confusion created by their recent statements and provide the public with accurate information concerning the&nbsp;cryptocurrency&nbsp;seized and how it was valued for the purposes of these statements.\"","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>"],"hashtag":[]}