{"summary":"WOO X Crypto Exchange Reopens Trading with Enhanced Security After Market Maker Breach","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/woo-x-crypto-exchange-reopens-trading-with-enhanced-security-after-market-maker-breach.htm","publishDate":"2023-11-20T10:07:15","id":21275,"type":null,"title":"WOO X Crypto Exchange Reopens Trading with Enhanced Security After Market Maker Breach","category":["Altcoin News "],"content":["Crypto trading platform WOO X has resumed operations after one of its market markers saw a significant amount of crypto assets withdrawn due to a breach of its security system.","“It is business as usual for WOO X, as WOO reassures users that all client assets remain secure despite the temporary trading suspension,” the platform said in a Sunday announcement. ","The exchange added that Kronos Research, a Taipei-based market maker, has experienced a security breach.","“The temporary halt in trading was enacted as an extra layer of security causing trading to pause briefly. Other market makers are operating normally on WOO X.”","In a Sunday post on X (formerly Twitter), Kronos Research confirmed that it “experienced unauthorized access” to some of its API keys.","Blockchain investigator ZachXBT followed up on the announcement and found roughly $25 million in total was siphoned away into six unique crypto wallet addresses. ","According to the investigation, the six transactions were worth 2,780 Ether, 2,540 ETH, 2,540 ETH, 2,636 ETH, 4.93 ETH, and 2,507.52 ETH, respectively.","Looks possibly like $20.3M+ (12800+ ETH)","0x2b0502FDab4e221dcD492c058255D2073d50A3ae pic.twitter.com\/sLnFA0VXhk","— ZachXBT (@zachxbt) November 18, 2023","","Kronos paused all trading following the event, but claimed that the loss is not a significant portion of their equity. ","“Potential losses are not a significant portion of our equity and we aim to resume trading as soon as possible.”","Last month, WOO X successfully recouped shares and tokens acquired by the failed hedge fund Three Arrows Capital (3AC).","3AC was apparently the largest investor in WOO X’s Series A funding round raised back in November 2021. ","WOO X has also agreed to cancel the shares of the now-defunct hedge fund, increasing the ownership of all other shareholders.","The settlement involves 20 million tokens repurchased and burnt by WOO, the exchange said in an official announcement.","The move “clears the uncertainty related to 3AC from the WOO ecosystem,” said Jack Tan, co-founder of WOO X.","3AC purchased equity along with 25 million WOO tokens and the remainder were scheduled to vest over the next 12 months.","WOO Network closed a $30 million Series A round of funding from various investors in November 2021.","The funding round saw participation from other investors including Crypto.com Captial, the Avalanche Asia Star Fund (AVATAR), AscendEX, LBank, Fenbushi Capital, and BitMart, among others.","The platform said at the time that it would use the funds to establish a research and development office in Warsaw, Poland."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Kronos Research","content":"ORGANIZATION"},{"type":"Avalanche Asia","content":"LOCATION"},{"type":"Warsaw","content":"LOCATION"},{"type":"November 18, 2023","content":"DATE"},{"type":"Fenbushi Capital","content":"ORGANIZATION"},{"type":"Poland","content":"LOCATION"},{"type":"$25 million","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"$20.3","content":"MONEY"},{"type":"Jack Tan","content":"PERSON"},{"type":"Taipei","content":"LOCATION"}],"hashtag":["Hack"],"authors":["Ruholamin Haqshanas"]}