{"summary":"A new professional association aims to expand mentorship and networking for women working in crypto, particularly at the intersection of digital assets and the law.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176649\/current-and-former-government-attorneys-form-association-for-women-in-crypto","publishDate":"2022-10-13T16:08:19","id":2128,"type":null,"title":"Current and former government attorneys form association for women in crypto","category":["Policy"],"content":["When Amanda Wick walked into digital currency conferences, she saw a lot familiar faces.","Crypto features, \"lots of men. And conversely, the same women,\" Wick, the former chief of legal affairs at blockchain analysis firm Chainalysis, told The Block in a recent interview. \"It's like, there's more than one female venture capitalist, there's more than one woman doing crypto banking, there's more than one woman [general counsel],\" Wick added.","Building off prior professional development work she did for women at Chainalysis, Wick has founded a new standalone nonprofit, <a href=\"https:\/\/www.womenincrypto.org\/\" data-v-f87c67ca=\"\">The Association for Women in Crypto.<\/a> The association is preparing to file for 501(c)(3) status, and plans to focus on enhancing knowledge and education around crypto, \"while advancing the opportunities for women and the role they will play in the future of digital finance,\" according to the group's mission statement.","Mainly, that's through linking women with others. \"The goal is that members would never have to cold call a woman in crypto,\" said Wick.&nbsp;","The board consists of Jane Khodarkovsky, general counsel at Celo Foundation, Jennifer Farer, a prosecutor within the Justice Department, Laurel Loomis Rimon, a partner at the law firm Paul Hastings and a former senior official at multiple government departments, and Wick herself, who has worked for the Departments of Justice and Treasury as well as Chainalysis.","The project has the macro goal of expanding representation within a male-dominated industry.","The association's inaugural <a href=\"https:\/\/www.womenincrypto.org\/about\" data-v-f87c67ca=\"\">membership<\/a> focuses heavily on lawyers and compliance professionals. Former Consumer Financial Protection Bureau Director Kathy Kraninger, current CFTC Senior Innovation Advisor Shivon Kershaw, Crypto Council for Innovation CEO Sheila Warren, and Michelle Korver, head of a16z's crypto regulatory affairs, are also among the founding members.&nbsp; There's also representation from firms like Aave and Elliptic alongside government agencies like the Cybersecurity and Infrastructure Security Agency and the Commodity Futures Trading Commission.&nbsp;","\"I wanted people who really work in the space who do the work, do crypto compliance, invest in venture, do marketing for crypto companies,\" said Wick. \"Women who are&nbsp;<em data-v-f87c67ca=\"\">in<\/em> crypto. But most importantly women who support other women.\"","&nbsp;","<em data-v-f87c67ca=\"\">Correction: This article previously stated that the association has filed for 501(c)(3) status. It is still preparing to file for 501(c)(3) status.<\/em>"],"hashtag":["HIRING"]}