{"summary":"Ted Lin, chief growth officer at Binance, has left after working for the company almost since its inception.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155686\/binance-chief-growth-officer-ted-lin-leaves","publishDate":"2022-07-04T05:34:21","id":2128,"type":null,"title":"Binance&#x27;s chief growth officer leaves after nearly five years at the company ","category":["PEOPLE"],"content":["Ted Lin, chief growth officer at Binance, has left the company after working for it almost since its inception.","Lin posted the news on his <a href=\"https:\/\/twitter.com\/Teddy_Lin\/status\/1542989346944712709\" data-v-f87c67ca=\"\">Twitter<\/a> and <a href=\"https:\/\/www.linkedin.com\/posts\/ted-lin_binance-activity-6948763336125607936-D0qe?utm_source=linkedin_share&amp;utm_medium=member_desktop_web\" data-v-f87c67ca=\"\">LinkedIn<\/a> profiles on Saturday, saying that \"it was a difficult decision to leave, but I wanted to spend more time with my young family and be more flexible with my time.\"","Lin joined Binance in September 2017, two months after the exchange was formed, as its head of international markets, according to his LinkedIn profile. Lin worked in that role for one year before being promoted to chief growth officer&nbsp;(CGO) in September 2018. As Binance's CGO, Lin led the company's growth, commercial and education initiatives with a mission to grow the Binance ecosystem, per his profile.&nbsp;","\"The past 5 years have been the busiest yet most intellectually rewarding years of my career,\" said Lin. \"The experience has been eye-opening and humbling. Having bootstrapped multiple teams and initiatives on the rocket ship taught me many valuable lessons in business and in life.\"","Looking ahead, Lin will take a role as a mentor and angel investor in the crypto space.&nbsp;","\"I will spend a lot more time with my family and continue to help advance the ecosystem through angel investing and mentorship,\" he said. \"I will continue to stay immersed in crypto and Web 3, 4, 5 and share my cumulative learnings with new builders and operators in the space.\"","A Binance spokesperson confirmed Lin's departure post the publication of this article. Lin did not respond to The Block's request for comment.","Lin's departure comes a month after Binance Labs, the venture capital and incubation arm of Binance,<a href=\"https:\/\/www.theblock.co\/post\/150022\/binance-labs-loses-top-two-executives-bill-chin-qian-nicole-zhang\" data-v-f87c67ca=\"\"> lost two top executives<\/a>, as The Block previously reported. Bill Qian, the head of Binance Labs, and Nicole Zhang, the firm's executive director, both left the firm in quick succession.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ted Lin","content":"PERSON"},{"type":"Lin","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"Nicole Zhang","content":"PERSON"},{"type":"Bill Qian","content":"PERSON"},{"type":"Web 3","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"September 2017","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"September 2018","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}