{"summary":"Almost USD 10 Billion Liquidated Amid Sunday Sell-off In Crypto Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/almost-usd-10-billion-liquidated-amid-sunday-selloff-in-cryp-9959.htm","publishDate":"2021-04-18T08:27:00","id":21284,"type":null,"title":"Almost USD 10 Billion Liquidated Amid Sunday Sell-off In Crypto Market","category":["Bitcoin News "],"content":["USD 9.9bn worth of trading positions in the crypto derivatives market were liquidated in the past 24 hours as the crypto market experienced a sharp sell-off on Sunday.","More than USD 5bn of them are positions in bitcoin (BTC).","Total liquidations:","At around 03:00 UTC, BTC dropped from USD 59,000 to below USD 53,000, or the most in almost two months, before rebounding. At 08:18 UTC, it trades at USD 56,205 and is down by 10% in a day, erasing all its weekly and monthly gains.","The majority of other coins from the top 10 list are down by 10%-20%, while the hottest token of this week, dogecoin (DOGE) is down by 8%, trimming its weekly gains to 354%, and trading at USD 0.29.","The selloff coincided with rumored and unconfirmed claims by a popular Twitter account, FXHedge, that tweeted that the US Treasury may crack down on money laundering that’s carried out using cryptocurrencies.","Long liquidations have become more numerous this year. With bitcoin (and other coins) breaking all-time highs nearly every passing week, some traders may feel unable to gain significant exposure without margin trading. However, a growing number of traders can’t afford to maintain their leveraged positions in the event of dips. Hence, the growing frequency of big liquidations.","Leveraged trading refers to borrowing funds so that you can take a larger position than you would be able to with your existing funds so that you can potentially generate a higher profit. However, while margin trading enables traders to amplify their returns, it can also lead to increased losses and liquidations, which is why experienced traders tend to advise newcomers to stay away from leveraged trading.","___","___\nLearn more:\n– Traders Issue Warnings as Altcoins are Booming and Bitcoin Consolidates\n– Unlike Bitcoin, Ethereum’s ATH Was Driven by Relatively Small Demand – Analyst\n– Bitcoin Is More ‘Public’ Money than Central Bank-Issued Fiat Currencies\n– With Banks Turning to Bitcoin, Is It Finally Time to Long the Bankers?\n– Coinbase Listing Won’t Help Bitcoin Price – Analyst\n– Bitcoin Faces Hedge Test Amid Rising Inflation Concerns\n– Bitcoin Market Changed ‘Radically’ & Volatility Decline Attracts Institutions\n– Bitcoin to Be Worth Millions by 2023, ETH Above USD 2K by 2022 – Kraken CEO\n– Institutions & Retail Compete For Bitcoin – Whose Hands Are Stronger?\n___\n(Updated at 08:53 UTC with a chart and reactions.)"],"entity":[{"type":"Sunday","content":"DATE"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"354%","content":"PERCENT"},{"type":"Kraken CEO\n– Institutions & Retail Compete For Bitcoin – Whose Hands","content":"ORGANIZATION"},{"type":"Bitcoin Market Changed ‘Radically’ & Volatility Decline Attracts Institutions\n– Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Altcoins","Bitcoin","Dogecoin","Market"],"authors":["Linas Kmieliauskas"]}