{"summary":"Nassim Taleb On Bitcoin: It’s an Excellent Idea","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/nassim-taleb-on-bitcoin-it-s-an-excellent-idea-1071.htm","publishDate":"2018-01-23T16:00:00","id":21290,"type":null,"title":"Nassim Taleb On Bitcoin: It’s an Excellent Idea","category":["Bitcoin News "],"content":["Bitcoin is an excellent idea that fulfills the needs of the complex system, not because it is a cryptocurrency, but precisely because it has no owner, no authority that can decide on its fate, writes the famous essayist, scholar, and risk analyst Nassim Nicholas Taleb in his foreword to the book by Saifedean Ammous.","Bitcoin is owned by the crowd, its users and it has now a track record of several years, enough for it to be “an animal in its own right”, according to Taleb.","The problem with centralized currency and its subsequent impact as Taleb sees it is that, “not only the expert is not an expert, but he doesn’t know it. That previous Federal Reserve bosses, Greenspan and Bernanke, had little grasp of empirical reality is something we only discovered a bit too late […] which is why we need to be careful on who to endow with centralized macro decisions.”","Taleb further concludes that Bitcoin’s structural design is what could make “a zero intelligence crowd [work] better than a Soviet-style management composed to maximally intelligent humans.”","He does not reject the notion that Bitcoin might fail – but is positive in his belief that, should it fail, we, as a society, would simply invent an improved version as an insurance against “an Orwellian future.”"],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Bernanke","content":"PERSON"},{"type":"Greenspan","content":"PERSON"},{"type":"Nassim Nicholas Taleb","content":"PERSON"},{"type":"Saifedean Ammous","content":"ORGANIZATION"},{"type":"Taleb","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Bitcoin","Cryptocurrency"],"authors":["Sead Fadilpašić"]}