{"summary":"Dogwifhat Drama: Ethereum NFT Auction Sparks Controversy with Solana Community","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/dogwifhat-drama-ethereum-nft-auction-sparks-controversy-with-solana-community.htm","publishDate":"2024-03-16T09:09:02","id":21291,"type":null,"title":"Dogwifhat Drama: Ethereum NFT Auction Sparks Controversy with Solana Community","category":["Altcoin News "],"content":["A dispute has emerged within the colorful world of meme coins, pitting the Solana community against the owners of the real-life Shiba Inu that inspired the explosive Dogwifhat (WIF) meme coin. ","The controversy revolves around the auction of an Ethereum NFT featuring the iconic photo of Achi, the dog who became the face of the popular Dogwifhat meme.","The saga began when a South Korean Instagram user, claiming to be the owner of Achi, announced their intention to auction an NFT of the original photo that sparked the viral meme. ","The user, who had consistently posted pictures of Achi wearing various woven outfits over the past five years, revealed their plans to celebrate the dog’s fame. ","The NFT auction, hosted on the Ethereum NFT platform Foundation, is set to conclude on Monday, with the current bid standing at a staggering 50 ETH, equivalent to over $182,000.","However, the choice to partner with Feisty DAO, an online community experienced in acquiring and fractionalizing Shiba Inu-related NFTs on the Ethereum blockchain, sparked a wave of discontent among members of the WIF community and other Solana users. ","Many expressed their disappointment that Achi’s parents didn’t collaborate with the WIF team on Solana for the NFT drop.","📈 @NFDtoken raises Achi to 50 ETH pic.twitter.com\/yV6kdTzvws","— Foundation 🌐 (@foundation) March 15, 2024","","The backlash escalated to the point where Achi’s owners felt compelled to publicly address the criticisms. ","“Please don’t insult [Achi] and us,” the owners wrote in a pinned comment on the Instagram post. “You have no reason to blame us. Please cheer for us.” ","Interestingly, Achi’s owner had previously attempted to work with Solana users, but the experience turned sour. ","Following the success of WIF, another meme coin called ACHI emerged with the support and endorsement of Achi’s parents. ","However, the creators of ACHI allegedly abandoned the project shortly after its launch, leaving a bitter taste in the mouths of Achi’s parents. ","Consequently, they decided to collaborate with Feisty DAO, a proven entity in the NFT space, to ensure a smoother and more secure auction process.","While some members of the WIF community expressed frustration over the lack of coordination between Achi’s parents and the meme coin community, it appears that little effort was made by the community to establish contact with the family behind the dog that propelled their token to a multi-billion dollar valuation. ","Despite the astronomical success of WIF, Achi’s parents claimed to have never heard from anyone in the WIF community until recently when they attempted to reach out.","Mihir, a member of the WIF community involved in the fundraising campaign to display Achi’s face on the LED screen-covered Sphere arena in Las Vegas, admitted that he was unaware of Achi’s owners until last week. ","However, he acknowledged that they deserved recognition and some share of the spoils generated by WIF, which currently boasts a market capitalization exceeding $3 billion. ","hi im owner of this dog. Can you contact me?","— achichu (@achichuchu) February 4, 2024","","Path, the Feisty DAO member overseeing the NFT auction, expressed openness to the idea of re-minting the NFT on Solana if there was interest from the Solana community. ","He even reached out to Ansem, a prominent member of the WIF community, to gauge their interest in purchasing the Achi NFT, but received no positive response. "," "],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Achi","content":"ORGANIZATION"},{"type":"Las Vegas","content":"LOCATION"},{"type":"Mihir","content":"PERSON"},{"type":"$182,000","content":"MONEY"},{"type":"Feisty DAO","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"February 4, 2024","content":"DATE"},{"type":"March 15, 2024","content":"DATE"},{"type":"Achi","content":"PERSON"},{"type":"Achi NFT","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"WIF","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["DogWifHat","Meme Coins"],"authors":["Ruholamin Haqshanas"]}