{"summary":"SEC’s Gag Rule on Settlements Criticized by Commissioner Hester Peirce","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/secs-gag-rule-on-settlements-criticized-by-commissioner-hester-peirce.htm","publishDate":"2024-01-31T13:42:35","id":21292,"type":null,"title":"SEC’s Gag Rule on Settlements Criticized by Commissioner Hester Peirce","category":["Blockchain News "],"content":["SEC Commissioner Hester Peirce has voiced her criticism against the US Securities and Exchange Commission’s (SEC) policy to uphold a gag rule impacting defendants who settle.","In a statement published on the SEC’s website on January 30, Peirce argued that the rule, which prevents defendants from criticizing allegations post-settlement, is particularly unfair to those less equipped than major crypto players like XRP-issuer Ripple and Grayscale Investments when entering litigation.","The rule, rooted in a policy adopted in 1972, prohibits defendants from denying allegations post-settlement.","According to Peirce, who is known as “crypto mom” for her crypto-friendly stance, the rule lacks a compelling rationale and undermines free speech rights.","My thoughts on the SEC's unusual practice of telling defendants who settle with us that they can't ever say anything bad about the settlement: https:\/\/t.co\/Mej0bSECD4","— Hester Peirce (@HesterPeirce) January 30, 2024","","The Commission’s requirement that settling defendants either admit allegations or remain silent is a condition for resolving enforcement actions.","The mandatory language compels defendants to withdraw any documents that deny allegations and imposes penalties for breach.","The New Civil Liberties Alliance (NCLA) proposed a revision in 2018 to allow defendants in civil lawsuits or administrative proceedings to admit, deny, or state neither admission nor denial of allegations.","Hester Peirce said in her statement that she supports reconsideration of this issue, and stressed the importance of allowing Americans to criticize the government without fear of reprisal.","Peirce also challenged the historical basis for the policy, noting that its necessity “lacks firm footing.”","","The policy’s “content-specific and permanent restraint” on speech raises First Amendment concerns, Peirce said, while questioning the Commission’s claim that settling defendants make significant concessions.","The Commissioner suggested that silencing defendants may shield the Commission from criticism, hindering public scrutiny and accountability.","In conclusion, Peirce urged the Commission to include reconsideration of the no-deny rule on its rulemaking agenda or to drop the rule altogether if deemed excessive.","“[…] if my colleagues have concluded that our agenda is too packed with other projects, perhaps we can just drop the no-deny rule in the same unceremonious way we adopted it,” she wrote."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"January 30, 2024","content":"DATE"},{"type":"January 30","content":"DATE"},{"type":"1972","content":"DATE"},{"type":"Peirce","content":"PERSON"},{"type":"Commission","content":"ORGANIZATION"},{"type":"New Civil Liberties Alliance (NCLA","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission’s (SEC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":["SEC","Securities and Exchange Commission"],"authors":["Fredrik Vold"]}