{"summary":"Another Usual Bitcoin Crash? BTC Almost Tests USD 30K","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/another-usual-bitcoin-crash-bear-to-run-short-term-bull-to-f-10366.htm","publishDate":"2021-05-19T10:59:00","id":21294,"type":null,"title":"Another Usual Bitcoin Crash? BTC Almost Tests USD 30K","category":["Bitcoin News "],"content":["The Cryptoverse insiders have tried to identify several causes for the latest bitcoin (BTC) fall that dragged the whole market down and it seems that history and arguments were once again repeating – many were bearish short-term and bullish long-term. (Updated at 16:53 UTC with the latest market data.)","And then, BTC crashed to almost USD 30,000, before recovering. At 13:48 UTC, BTC trades at USD 35,079 and is down by 22% in a day. Other coins from the top 10 list are down 27%-40%.\n____\nLearn more:\n– Many Major Stablecoins Take a Brief Plunge Below USD 0.9\n– Crypto Flash Crash: Recovery, Unavailable Exchanges & Tesla’s ‘Diamond Hands’\n____","Total liquidations in the crypto derivatives market surpassed USD 6.56bn in the past four hours and USD 8.42 in the past 24 hours (757,366 positions in total), per Bybt.com data.","Earlier today, BTC dropped below USD 40,000 for the first time since February, and Crypto analytics firm Coin Metrics found it “inevitable” even before this happened. While BTC veterans appear to be “weathering the storm and continuing to hold for the long-term,” given the major upgrades coming this year, the analysts at Coin Metrics gave two reasons for the current drop.","First is Elon Musk‘s changing positions on BTC and him moving back to dogecoin (DOGE), combined with Tesla removing BTC as a payment option, and their reason exasperating the Bitcoin energy consumption debate.","The second is the cyclical nature of crypto markets. “Despite the knee-jerk reaction to Musk’s Tweets, BTC’s recent downturn appears to be part of a larger trend. Crypto markets tend to be cyclical and move from periods of BTC domination to periods where smaller-cap assets reign supreme.”","And currently, we seem to be in an altcoin cycle, a big part of which is ethereum (ETH)‘s surge and it outperforming BTC. Also, what the cycle led is the rise of “Ethereum competitors”, including ethereum classic (ETC), which resulted in BTC’s dominance dropping, as well as trading volume for smaller-cap assets surging.","Commenters online reiterated what had been reported earlier – that people seem to be rotating out of BTC into ETH.","Also, one more reason for the drop is once again repeating crypto ban FUD from China.","“This is the latest chapter of China tightening the noose around crypto,” Antoni Trenchev, Co-founder of crypto lender Nexo, told Bloomberg TV.","Then Matt Maley, Chief Market Strategist for Miller Tabak + Co, pointed to another potential cause that may have helped the price drop – Bank of America (BofA) fund manager survey showing that “Long Bitcoin” is the most crowded trade currently in the world.","“When an asset becomes the most crowded trade in the BofA survey, it has frequently signaled a near-term pullback in the past,” Maley told Bloomberg. “When you combine this with the news out of China, it’s not a surprise that Bitcoin is seeing some more weakness.”","And then there’s a full circle made, back to Musk, as his presence in the space may have actually damaged cryptos’ reputation, suggested David Bianco, Chief Investment Officer of the Americas at DWS Group. “I don’t think his comments are contributing to making [bitcoin] a more serious asset class. People look at it and think to themselves, this is just too much of a fad, it has too much popular culture attention,” he told Bloomberg. “Professional investors don’t want to hear about investments being talked about on Saturday Night Live.”","Many say that the price recovery will be slow, that a bear is imminent short-term, but that we’re in for a bull run after that.","Following China’s move and other developments, “Bitcoin investors are now in a state of fear, a situation that may influence further price drops,” Greg Waisman, co-founder of payment network Mercuryo, told Cryptonews.com. “Bitcoin’s recovery is, however, dependent on the coordinated effort by both retail and institutional investors to defy the market trend and load up on the coin. This recovery can occur at anytime as resistance is bound at this time.”","Waisman said that this drop is significant for the crypto space as most altcoins respond in tandem with the BTC price movement. “A continued fall without cushion may signal a broader entry into a bear market,” he added.","Per Coin Metrics, BTC spent output profit ratio (SOPR) dropped below 1 on May 15 to its lowest level since February 27, signalling that investors are selling at a loss. “This suggests that some investors who bought recently, while BTC price was near all-time highs, have capitulated and are selling their holdings.”","However, though not always accurate, a SOPR of below 1 has corresponded with local cycle bottoms. And this is not the only sign that “bullish sentiment has reset and that the local market cycle is nearing a bottom” – BTC perpetual futures average funding rates have come in closer to zero, at times even dipping negative.","Per Joe DiPasquale, CEO of crypto fund manager BitBull Capital, “bitcoin’s pattern over the last 10 years has been meteoric rises followed by pull-backs.” The trends has been higher highs and higher lows, he told Cryptonews.com, noting that, while it fell from its USD 63,000 high, it still saw a strong rise in the past 12 months.","“The fall in price is a natural consolidation period that we see as necessary for the support lines to form for future appreciation. We remain bullish on bitcoin and confident that we will see bitcoin at USD 100K in the future. It has a place in a portfolio as a hedge against inflation and as a truly finite alternative to USD and digital alternative to gold,” DiPasquale said.","Crypto derivatives exchange Delta Exchange CEO Pankaj Balani opined that bitcoin’s recovery is going to be slow. Despite BTC’s sharp correction to some USD 42,000 at the time of the commentary, “we don’t think Bitcoin has found a floor yet,” he said, adding that,","“Unlike the previous dips in Bitcoin – in the last 9 months – this time, we are not finding any buyers looking to bottom fish on a sharp move down. Most traders are convinced of further downside and are looking at [USD] 35,000-38,000 levels on BTC.”","While he said the price will go up eventually, Ju Ki-young, the CEO of the crypto analytics provider CryptoQuant, wrote that he’ll “keep his bearish bias,” until the ‘whale dumping’ indicator “cools off.” Significant bitcoin deposits from whales usually indicate whale dumping, the firm said.","Also, according to QCP Capital, while there might be a bounce back towards USD 54,000, after that, for the most part “Q4 will be scary in the sense that [the US Federal Reserve System’s] Sep & Dec quarterly projections will no longer be able to hide the inflation impact, especially on the all-important long run.”","And, as is the case with every dip, the Cryptoverse is urging its (particularly newest) members to not panic – with some, like trader\nMichaël van de Poppe, noting “panic levels not seen before” – to not give into fear, to not listen to criticism of BTC that follows every fall, and to just hodl.","Some also suggested using the chance to “stack more sats”; some noted that “a 40% drawdown in a bull market, regardless of news, regardless of how bad it looks, has empirically showed absurd profit if held”, and some argued that a “bounce is imminent” after the scared investors who bought at much higher prices sell, after which we’re likely to see BTC at USD 100,000.","This had all happened before, they said, and it ended with gains. However, as always, there are no guarantees.","_____","___","__","__","__","__","__","__","___","___","___","___","___","___","____\nLearn more:\n– Weeks Of Sideways Trading Ahead as Bitcoin Newbies Panic Selling to Hodlers\n– Fundstrat’s Tom Lee Boosts Bitcoin Target 25% Despite Musk’s Criticism","– Bitcoin May Double This Year Despite Energy Concerns – Pantera CEO","– Traders Rotate From Bitcoin To Alts, While JPMorgan Sees Ether As Overvalued\n– If History Rhymes, ETH Might Hit USD 19K; Downside Risk Stronger Than BTC’s"],"entity":[{"type":"BofA","content":"ORGANIZATION"},{"type":"BitBull Capital","content":"ORGANIZATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"Poppe","content":"LOCATION"},{"type":"– Bank of America (BofA","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"Pankaj Balani","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Matt Maley","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"Waisman","content":"PERSON"},{"type":"last 10 years","content":"DATE"},{"type":"DiPasquale","content":"PERSON"},{"type":"Antoni Trenchev","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"27%","content":"PERCENT"},{"type":"Saturday","content":"DATE"},{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"Unavailable Exchanges & Tesla’s ‘Diamond Hands’\n____","content":"ORGANIZATION"},{"type":"May 15","content":"DATE"},{"type":"February 27","content":"DATE"},{"type":"Delta Exchange","content":"ORGANIZATION"},{"type":"DWS Group","content":"ORGANIZATION"},{"type":"Michaël","content":"PERSON"},{"type":"David Bianco","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Tesla","content":"PERSON"},{"type":"US Federal Reserve System’s] Sep & Dec","content":"ORGANIZATION"},{"type":"Bitcoin May Double This Year Despite Energy Concerns – Pantera CEO","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Tom Lee","content":"PERSON"},{"type":"Miller Tabak + Co","content":"ORGANIZATION"},{"type":"Joe DiPasquale","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Night","content":"TIME"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Ju Ki","content":"PERSON"},{"type":"Traders Rotate From Bitcoin To Alts","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Maley","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Greg Waisman","content":"PERSON"},{"type":"Bitcoin Newbies Panic Selling","content":"ORGANIZATION"}],"hashtag":["Altcoins","Bitcoin","China","Dogecoin","Elon Musk","Ethereum","Forecast","Investing","Market"],"authors":["Sead Fadilpašić"]}