{"summary":"Tornado Cash Developer Appeals Money Laundering Conviction, Seeks Overturning Verdict","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/tornado-cash-developer-appeals-money-laundering-conviction-seeks-overturning-verdict.htm","publishDate":"2024-05-16T10:39:42","id":21302,"type":null,"title":"Tornado Cash Developer Appeals Money Laundering Conviction, Seeks Overturning Verdict","category":["Altcoin News "],"content":["Alexey Pertsev, the developer behind Tornado Cash, has lodged an appeal with the s-Hertogenbosch court of appeal after being found guilty of money laundering.","The appeal process is anticipated to take around several months, although it remains unclear whether the appeal has been granted.","Pertsev, who received a 64-month prison sentence, has the option to request a home confinement while awaiting the appeal trial. ","Notably, following Tuesday’s verdict, he was immediately taken into custody to commence serving his sentence.","“Tornado Cash does not pose any barrier for people with criminal assets who want to launder them,” according to a rough translation of the verdict.","The court found Pertsev guilty of the charged money laundering activities based on this assessment.","Pertsev was detained in the Netherlands in August 2022 when Tornado Cash was blacklisted by the U.S. government.","At the time, the U.S. Treasury accused Tornado Cash of being a crucial tool for the North Korean hacking group Lazarus.","This group has been linked to major crypto thefts, including the $625 million hack of Axie Infinity’s Ronin Network.","Roman Storm and Roman Semenov, who also played a role in the development of the crypto mixer, are facing allegations of money laundering and sanctions violations in the United States.","🚨 BREAKING: Tornado Cash developer, 31 year old Alexey Pertsev, is found guilty of money laundering $1.2B through his app by a Dutch court and sentenced to 5 years in prison.","The police also seized all his assets including cars and crypto. They claim Tornado Cash was a tool… pic.twitter.com\/wwzOOrvyxr","— Autism Capital 🧩 (@AutismCapital) May 14, 2024","","Storm is scheduled to stand trial in September, while Semenov has not yet been apprehended.","Storm was arrested last year after Tornado Cash was once again added to the U.S. sanctions watchlist.","In late March, Storm submitted a motion to dismiss all three charges against him, claiming that he did not operate a money laundering business and did not violate the International Emergency Economic Powers Act.","However, the US Department of Justice (DOJ) rejected Storm’s motion, saying that the service was announced in 2019 as a mixer and comprised a website, user interface, a combination of smart contracts, and a network of “relayers.”","Democratic representatives have introduced the US Blockchain Integrity Act, which aims to crack down on cryptocurrency mixers.","The proposed legislation aims to disrupt the flow of illicit funds and promote transparency by prohibiting financial institutions, cryptocurrency exchanges, and registered money service businesses from accepting funds processed through a mixer.","Failure to do so would result in civil penalties of up to $100,000.","The development comes amidst the U.S. government’s ongoing crackdown on crypto-mixing services.","Recently, the founder of Bitcoin Fog, a $400 million crypto-mixing service, was convicted of money laundering. ","Roman Sterlingov was found guilty of money laundering, money laundering conspiracy, operating an unlicensed money-transmitting business, and violations of the D.C. Money Transmitters Act.","As reported, the US Treasury has added Tornado Cash to its Specially Designated Nationals list, effectively banning Americans from using this mixer."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"May 14, 2024","content":"DATE"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"August 2022","content":"DATE"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"$1.2","content":"MONEY"},{"type":"the Netherlands","content":"LOCATION"},{"type":"D.C. Money Transmitters Act","content":"ORGANIZATION"},{"type":"Axie Infinity’s Ronin Network","content":"ORGANIZATION"},{"type":"International Emergency Economic Powers Act","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Roman Semenov","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Semenov","content":"PERSON"},{"type":"US Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"$625 million","content":"MONEY"}],"hashtag":["anti-money laundering","tornado cash"],"authors":["Ruholamin Haqshanas"]}