{"summary":"eToro, a leading social trading platform, has delisted four crypto assets for U.S. customers, citing recent developments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234404\/etoro-delists-algo-dash-mana-matic-on-us-platform","publishDate":"2023-06-13T06:53:36","id":2130,"type":null,"title":"eToro to delist Polygon, Decentraland, Dash and Algorand on US platform","category":["COMPANIES"],"content":["Trading platform eToro <a href=\"https:\/\/twitter.com\/eToroUS\/status\/1668323758199955456\" data-v-f87c67ca=\"\">announced<\/a> changes to its crypto offering for customers in the United States on Monday. The decision is part of eToro's ongoing review framework, which evaluates the crypto assets it provides in light of the rapidly evolving regulatory landscape.&nbsp;","eToro cites “recent developments” for the move, referring to the <a href=\"https:\/\/www.theblock.co\/post\/233488\/sec-lawsuits-against-coinbase-and-binance-could-result-in-massive-payday-for-lawyers\" data-v-f87c67ca=\"\">legal action<\/a> taken by the U.S. Securities and Exchange Commission (SEC) against crypto exchanges Coinbase and Binance last week.","From 6 am ET on July 12, eToro's U.S. customers will no longer have the ability to open new positions in Algorand (ALGO), Decentraland (MANA), Dash (DASH), and Polygon (MATIC). However, it is important to note that existing positions in these coins can still be held and sold by customers.","In the respective suits, the SEC alleged that all four of these cryptocurrencies, alongside others such as Solana (SOL), Cardano (ADA) and Cosmos (ATOM), are securities. Despite this, eToro underlined its support for crypto assets alongside its stocks, ETFs and options offerings. It added that it was “committed to working closely with regulators around the world to shape the future of the crypto industry and champion access for the ordinary investor.”&nbsp;","eToro’s delistings follow a similar <a href=\"https:\/\/www.theblock.co\/post\/233961\/robinhood-ends-support-for-solana-polygon-cardano-amid-sec-exchange-crackdown\" data-v-f87c67ca=\"\">announcement<\/a> from Robinhood last week, with the fintech app ending support for Solana (SOL), Polygon (MATIC) and Cardano (ADA) from June 27.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"July 12","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"June 27","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD"],"authors":["James Hunt","The Block"]}