{"summary":"South Korean Police Arrest 34 in Swoop on Crypto-powered Drugs Smuggling Ring","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-police-arrest-34-in-swoop-on-crypto-powered-drugs-smuggling-ring.htm","publishDate":"2024-05-16T23:30:40","id":21313,"type":null,"title":"South Korean Police Arrest 34 in Swoop on Crypto-powered Drugs Smuggling Ring","category":["Blockchain News "],"content":["South Korean police have arrested 34 people in a raid on a suspected crypto-powered drugs smuggling ring, officers announced on May 16.","Per Newsis, police seized 90,000 doses of drugs including methamphetamine (crystal meth), synthetic marijuana, and ketamine.","Officers said the ring used Vietnam-based smugglers to hide the drugs in cosmetics products.","Gang members then allegedly sent these products to South Korea via international courier services.","Police said they had remanded nine people in custody, including two suspected South Korean ringleaders (both aged 36).","Officers added that they had charged 25 other people with related crimes. Police say the ring was active from August 2023 to April this year.","A police spokesperson added that the ring sold the narcotics online to crypto-paying buyers. The group reportedly made use of Telegram as a communications tool.","Recent reports have claimed that Korean-language Telegram channels have become a “department store” for drug buyers and dealers.","Chungbuk Police Agency said its criminal task force’s drug crime investigation unit carried out the raids.","A police spokesperson explained that the suspected masterminds hid the drugs they received in a “hole in a mountainside.”","When police investigated this hiding place, they found almost six liters of synthetic marijuana solution.","This haul alone is “worth over $1 million” on the domestic market, officers told reporters.","📑 Local media reports that South Korea is taking decisive measures to combat the surge in cryptocurrency-related crimes and fraud cases by moving to establish its temporary virtual asset investigative unit as a permanent entity.This move co…https:\/\/t.co\/yd7EObgib1","— Cryptonews.com (@cryptonews) April 29, 2024","","Investigators also found 181g of methamphetamine and 31g of ketamine, all “buried under the ground in the countryside.”","Officers said that gang members would periodically come to the hiding place to divide the synthetic marijuana “into 10ml units (vials).”","They would then “sell these through social media channels such as Telegram.” In each case, recipients would “pay in cryptocurrency,” police said.","Police released photographs of lipstick and other cosmetics containers. They explained that the gang hid drugs inside these containers before sending them from Vietnam.","Officers said they had also seized funds worth over $245,000. They added that the investigation is ongoing.","The spokesperson said police suspect that “other people” may be involved, “including overseas suppliers.”","Park Ji-hwan, the unit’s head, said all the cases had been handed over to the prosecution service.","The police chief also called on the public to “report any suspected instances” of crypto-powered drug crime “to the investigative agencies.”","Last year, President Yoon Suk-yeol declared an “all-out war” on crypto-powered drug trafficking, following a massive boom in youth drug crime."],"entity":[{"type":"Vietnam","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"May 16","content":"DATE"},{"type":"Chungbuk Police Agency","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$245,000","content":"MONEY"},{"type":"August 2023","content":"DATE"},{"type":"Yoon Suk","content":"PERSON"},{"type":"April this year","content":"DATE"},{"type":"April 29, 2024","content":"DATE"}],"hashtag":["Police","South Korea"],"authors":["Tim Alper"]}