{"summary":"Degen Chain Outage: Network Restored, L3 Debate Reignited","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/degen-chain-outage-network-restored-l3-debate-reignited.htm","publishDate":"2024-05-15T21:03:52","id":21311,"type":null,"title":"Degen Chain Outage: Network Restored, L3 Debate Reignited","category":["DeFi News "],"content":["The recent two-day outage of the Degen Chain proved to be more than a minor inconvenience. It caused severe disruption as the network failed to produce a block for over 53 hours. This disruption had a cascading effect, rendering the network and its associated applications unusable.","According to its block explorer, the network stalled at 8:15 p.m. UTC on May 12, marking the time of the last produced block.","Degen Chain is among the few layer-3 blockchains that settle transactions on a layer-2 network. It explicitly uses the Ethereum layer-2 chain, Base, for settlement and the AnyTrust protocol for data availability functions.","Conduit estimates the Degen L3 resync will complete by 6 AM Pacific. Post-resync, they'll test the chain to ensure all data affected by the reorganization is restored. We apologize for the downtime. For more information, please see @conduitxyz's post. https:\/\/t.co\/yhPyieBKch","— Degen 🎩 (@degentokenbase) May 14, 2024","","In a May 14 post on X, Degen Chain said it collaborated closely with its development partner, Conduit, a rollup infrastructure platform.","Conduit was instrumental in tracing the issue to a “custom config change” that affected both Degen Chain and the gaming network Apex, halting block production.","Currently, nodes for the Degen Chain are resynchronizing from the genesis block, the network’s first block, as part of the restoration process. Conduit stated, “We’re working with both teams and Offchain Labs to restore service and minimize impact to users.”","Degen Chain projects that the network will resume functionality after the resynchronization process, which is expected to be completed by 1:00 p.m. UTC on May 15 (6:00 a.m. PST on May 15).","Downtime for Degen Chain, a layer-3 blockchain initially developed for its native meme coin, Degen (DEGEN), directly affected various decentralized applications hosted by the blockchain.","Applications like DegenSwap, Mint Club, and the bridging service Relay Bridge were all inoperable during this period. Consequently, the native DEGEN token experienced a notable decline of 24% from its seven-day high of $0.02 on May 13 to $0.015, according to CoinGecko data.","This incident has rekindled discussions in the crypto community regarding the viability and value of L3 networks. Polygon CEO Marc Boiron has previously argued that these networks “exist only to take value away from Ethereum and onto the [layer-2s] on which the L3s are built.”","He criticized Ethereum Layer 3 (L3) networks, arguing they are unnecessary for scaling and divert value from the mainnet.","I agree that L2s are Ethereum. I disagree that L2 value is Ethereum value. Just take this to the extreme. If all L3s settled to one L2, then Ethereum would capture basically no value and, thus, Ethereum security would be at risk.","— Marc Boiron (@0xMarcB) March 31, 2024","","Boiron stated that L3s only transfer value to the Layer 2 (L2) networks they are built on, potentially compromising Ethereum’s security.","“I disagree that L2 value is Ethereum value. Just take this to the extreme. If all L3s settled to one L2, Ethereum would capture basically no value and, thus, Ethereum security would be at risk,” he said.","Boiron also emphasized that Polygon focuses on scaling Ethereum and ensuring fair value distribution between Polygon and Ethereum.","On the other hand, proponents of layer-3 solutions, such as Arbitrum Foundation researcher Patrick McCorry, argue that they are beneficial as they use layer-2 networks as settlement layers, making transactions cheaper.","Degen Chain experienced a recent increase in activity a few days ago, with nearly $100 million in transaction volume. Since its inception, it has recorded over 272,000 unique transactions and created over 7,500 contracts and 2,300 tokens. However, many of these tokens have been linked to rug pulls and scams."],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"Degen L3","content":"ORGANIZATION"},{"type":"March 31, 2024","content":"DATE"},{"type":"Degen","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"$0.015","content":"MONEY"},{"type":"8:15 p.m.","content":"TIME"},{"type":"3","content":"DATE"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Degen (DEGEN","content":"PERSON"},{"type":"May 14, 2024","content":"DATE"},{"type":"May 13","content":"DATE"},{"type":"May 14","content":"DATE"},{"type":"DEGEN","content":"PERSON"},{"type":"May 15","content":"DATE"},{"type":"1:00 p.m.","content":"TIME"},{"type":"Degen Chain","content":"ORGANIZATION"},{"type":"May 15)","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"Mint Club","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"6 AM Pacific","content":"ORGANIZATION"},{"type":"(6:00 a.m. PST","content":"TIME"},{"type":"$0.02","content":"MONEY"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"Patrick McCorry","content":"PERSON"},{"type":"May 12","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEGEN Chain","Ethereum","Layer-3 Network"],"authors":["Hassan Shittu"]}