{"summary":"Bitcoin Price Prediction as Millennium Management Holds $2B in ETFs – Bullish Signal for BTC?","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-prediction-52.htm","publishDate":"2024-05-16T10:38:15","id":21312,"type":null,"title":"Bitcoin Price Prediction as Millennium Management Holds $2B in ETFs – Bullish Signal for BTC?","category":["Bitcoin News "],"content":["Bitcoin rebounded strongly, surpassing $65,930 and reaching a peak of $66,591 on Thursday. Softer-than-anticipated U.S. inflation data fueled this rally by increasing the likelihood of interest rate cuts and boosting investor confidence across the crypto market.","As Bitcoin climbed, it catalyzed gains across other major cryptocurrencies like Ethereum, Dogecoin, and Ripple, pushing the global cryptocurrency market cap to $2.39 trillion, a 24-hour surge of more than 5%.","Adding to the positive market dynamics, Millennium Management, a prominent hedge fund, has significantly invested in Bitcoin ETFs, holding nearly $2 billion in assets, underscoring strong institutional support for Bitcoin.","Millennium Management, an international hedge fund, has made a substantial investment in spot Bitcoin ETFs, holding nearly $2 billion as of the first quarter of 2024. According to their latest 13F filing with the SEC, Millennium’s investment spread across five prominent ETFs totaled approximately $1.94 billion by March 31.","JUST IN: Millennium Management discloses $2 billion spot #Bitcoin ETF portfolio.","— Watcher.Guru (@WatcherGuru) May 15, 2024","","These investments were diversified among several key products, including the ARK 21Shares Bitcoin ETF, Bitwise Bitcoin ETF, Grayscale Bitcoin Trust, iShares Bitcoin Trust, and Fidelity Wise Origin Bitcoin ETF.","The significant engagement of professional investors like Millennium suggests a robust institutional interest in Bitcoin, reinforcing a positive outlook for its future. Matt Hougan of Bitwise has expressed optimism, noting that the scale of professional investment might lead to a combined AUM nearing $5 billion. This trend underscores the growing acceptance of Bitcoin among seasoned investors, enhancing its profile in the investment community.","Bitcoin surged above $66,000 yesterday, achieving its highest single-day gain in nearly two months. The most recent US Consumer Price Index (CPI) data, which showed a slower inflation rate of 0.3% month-over-month for April, below the anticipated 0.4%, was the driving force behind this significant uptrend.","This unexpected slowdown heightened investor expectations for potential rate cuts. Meanwhile, Retail Sales for the same period remained stagnant, further underscoring economic softness and bolstering the case for monetary easing.","This amalgam of economic indicators has sparked a bullish outlook for Bitcoin, as softer inflation could prompt the Federal Reserve to ease monetary policy sooner.","On May 15, Bitcoin ETFs in the United States experienced a significant boost in inflows, totaling $303 million, the largest since early March. This influx was led by Fidelity’s FBTC fund, which attracted $131 million, and Bitwise’s BITB fund, receiving $86 million. Notably, Millennium Management is the largest institutional holder in this space with an investment totaling $2 billion across various Bitcoin ETFs.","This remarkable inflow into Bitcoin ETFs, combined with favorable economic indicators, has significantly bolstered Bitcoin’s market value, pushing its price to $66,000. This trend underscores the growing investor confidence in cryptocurrencies as a viable investment amid shifting economic conditions.","With a bearish Bitcoin price prediction, BTC is experiencing a slight downturn, trading at $65,930, marking a 0.44% decrease. The cryptocurrency is hovering just below its pivotal point of $66,260, a critical juncture that could determine the next directional move.","The Relative Strength Index (RSI) is elevated at 74, indicating that BTC is possibly overbought, which might precede a pullback if bullish momentum does not sustain.","Immediate support and resistance levels are crucial to watch. The first significant resistance lies at $67,820, with subsequent barriers at $69,084 and $70,643. A push above these levels could signal a strong bullish continuation. Conversely, support levels are set at $64,732, followed by $63,438 and $61,438. A breach below these could confirm a bearish trend, especially if the price falls beneath the pivot point.","The 50-Day Exponential Moving Average (EMA) stands at $62,687, further supporting the idea that the mid-term trend has been bullish, but caution is warranted given the current RSI levels.","Current Trend: Cautiously bearish unless BTC decisively clears the $66,260 pivot point.","","99Bitcoins, a leader in digital education, is transforming the way users learn about cryptocurrency through its ‘learn-to-earn’ platform. Participants can enhance their knowledge while earning $99BTC tokens, effectively growing both their expertise and their investment portfolios.","The current presale of $99BTC tokens is catching the attention of savvy investors, offering an enticing entry price for early participants.","This presale presents a rare chance for early investors to secure $99BTC tokens at a competitive price of $0.00103 each. These tokens are not just a reward mechanism but also provide access to premium content and additional perks within the community.","To date, the presale has amassed $1,284,373, progressing towards a goal of $2,036,443. With just over three days left until the next pricing stage, this is a pivotal moment to invest in $99BTC and start benefiting from immediate staking opportunities.","","",""],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$99BTC","content":"MONEY"},{"type":"$0.00103","content":"MONEY"},{"type":"Millennium Management","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Bitwise Bitcoin ETF","content":"ORGANIZATION"},{"type":"$131 million","content":"MONEY"},{"type":"$86 million","content":"MONEY"},{"type":"$65,930","content":"MONEY"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"0.44%","content":"PERCENT"},{"type":"Fidelity Wise Origin Bitcoin ETF","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"May 15, 2024","content":"DATE"},{"type":"$66,591","content":"MONEY"},{"type":"$67,820","content":"MONEY"},{"type":"$2,036,443","content":"MONEY"},{"type":"$2.39 trillion","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"$61,438","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"first quarter of 2024","content":"DATE"},{"type":"May 15","content":"DATE"},{"type":"$63,438","content":"MONEY"},{"type":"Matt Hougan","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Dogecoin","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"$69,084","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"0.4%","content":"PERCENT"},{"type":"$303 million","content":"MONEY"},{"type":"$1,284,373","content":"MONEY"},{"type":"$70,643","content":"MONEY"},{"type":"March 31","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$66,260","content":"MONEY"},{"type":"$62,687","content":"MONEY"},{"type":"$64,732","content":"MONEY"},{"type":"$1.94 billion","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"},{"type":"$66,000","content":"MONEY"}],"hashtag":["Bitcoin","bitcoin news"],"authors":["Arslan Butt"]}