{"summary":"South Korean Police Officers on Trial in ‘Crypto Fraud Bribes’ Case","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/south-korean-police-officers-on-trial-in-crypto-fraud-bribes-case.htm","publishDate":"2024-05-16T03:00:48","id":21316,"type":null,"title":"South Korean Police Officers on Trial in ‘Crypto Fraud Bribes’ Case","category":["Blockchain News "],"content":["Two South Korean police officers are standing trial over alleged bribery in an increasingly high-profile crypto fraud case.","The newspaper Namdo Ilbo reported that on May 14, the Gwangju District Court’s Criminal Division began the trial of a 59-year-old superintendent police officer.","The officer is named in reports as “A” for legal reasons. The court is also trying a 57-year-old police lieutenant (“B”) from the same station.","","The case centers around an alleged crypto fraudster surnamed Tak. The latter is accused of orchestrating an art-themed altcoin scam.","Police think Tak duped several crypto-keen victims out of about $2.1 million worth of fiat and crypto.","They have accused Tak of running a fake Ethereum (ETH) and NFT-related project.","Officers think Tak convinced several citizens to invest in a bogus crypto-related company.","When police and prosecution officials began investigating Tak, the latter hired a legal “broker” surnamed Seong (aged 62).","","Prosecutors told the court that Seong paid the superintendent over $7,300 in cash bribes “on two occasions” to promote B to a higher rank.","The court heard that Seong met the superintendent police officer twice at restaurants on February 4 and 15.","Both officers have been suspended from their posts for the duration of the trials.","B first appeared in court on separate bribery charges, also related to the same case, in January this year.","Seong appears to have created and fostered a network of contacts in the local police force, as well as the Gwangju and Mokpo prosecution services.","Tak has confessed to giving Seong money to bribe prosecution officials and police officers to help clear the name of the alleged crypto fraudster.","But the plan appears to have unraveled fast. Last month, a Mokpo prosecutor was jailed for a year for accepting a bribe from Seong.","The same court found the prosecution official guilty of taking money and favors in exchange for disclosing sensitive information about the case.","","Seong has made a statement confessing to putting envelopes full of cash into both police officers’ “coat pockets” as these were hanging on pegs in the restaurant.","A’s legal team disputed the allegations. It asked why Seong would make the promotion request in February, the month after the police force typically finalizes its list of promotion candidates.","The legal team challenged the accuracy of the account during a witness cross-examination.","Korea's major cryptocurrency exchange Bithumb said Friday that it will cover all the 40 billion won ($30 million) of taxes imposed on the winners of its crypto airdrop events.https:\/\/t.co\/36G4cGNQRv","— The Korea Herald 코리아헤럴드 (@TheKoreaHerald) May 10, 2024","","The defense lawyers also asked Seong if he had explicitly asked the superintendent to promote his subordinate when handing over the alleged bribes.","To this, Seong reportedly told the court that he “didn’t remember” much about the events of February 2022.","He claimed that he was “in such a hurry” at the time that his recollections had become unclear.","The court will reconvene on June 11. But more officers are set to face trial in the weeks and months ahead.","The media outlet explained that the prosecution has indicted 18 people in connection with the case.","This list “includes former and current prosecutors and police officials,” as well as “another broker,” Namdo Ilbo wrote."],"entity":[{"type":"May 14","content":"DATE"},{"type":"40 billion","content":"MONEY"},{"type":"Korea","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"The Korea Herald","content":"ORGANIZATION"},{"type":"Gwangju District Court’s Criminal Division","content":"ORGANIZATION"},{"type":"$2.1 million","content":"MONEY"},{"type":"Bithumb","content":"PERSON"},{"type":"May 10, 2024","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Gwangju","content":"LOCATION"},{"type":"February 2022","content":"DATE"},{"type":"$7,300","content":"MONEY"},{"type":"February 4","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Seong","content":"ORGANIZATION"},{"type":"June 11","content":"DATE"},{"type":"Namdo Ilbo","content":"ORGANIZATION"},{"type":"Seong","content":"PERSON"}],"hashtag":["Legal","South Korea"],"authors":["Tim Alper"]}