{"summary":"China Police Uncover $2B USDT Underground Banking Operation","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/china-police-uncover-2b-usdt-underground-banking-operation.htm","publishDate":"2024-05-16T11:24:58","id":21314,"type":null,"title":"China Police Uncover $2B USDT Underground Banking Operation","category":["Blockchain News "],"content":["China’s police have uncovered a $1.9 billion USDT underground banking operation going against Chinese crypto bans.","On May 15, the Chengdu Municipal Public Security Bureau announced the detection of a huge underground bank operation in a press release.","This was the culmination of an investigation that started in November 2022 when the Longquanyi District Branch of the Chengdu Municipal Public Security Bureau discovered the operation.","However, it was noted that the enterprise started in January 2021 and was primarily used to smuggle medicine, cosmetics, and investment assets overseas.","Since the investigation began, authorities have arrested 193 suspects across 26 provinces and dismantled two major underground operations in Fujian and Hunan.","The backbone of this operation was stablecoin Tether (USDT), used to bypass national foreign exchange regulations, and illegally facilitate foreign exchange transactions.","Exploiting cryptocurrency allowed the organization to carry out its illegal activities without intervention. It gave them anonymity and freedom from the oversight of intermediaries present in traditional payment systems.","The Chinese government has adopted a strict anti-crypto stance, cracking down on its adoption and prohibiting crypto-related activities with a series of bans.","In 2021, China banned cryptocurrency and cryptocurrency exchanges. Despite this, citizens have found ways to bypass regulation and access crypto assets through alternative means.","Decentralized exchanges have enabled China to continue trading crypto. Following the ban on centralized exchanges, the use of decentralized finance-based protocols saw a significant increase.","Some individuals defied the ban by using virtual private networks (VPNs) to mask their activities and trade undetected.","Through these efforts, China has ranked second globally in stablecoin holdings. 33.3% of investors holding multiple stablecoins, as per a Kyros Ventures report.","","Despite the crypto bans the recent Hong Kong spot Bitcoin and Etherium exchange-traded funds (ETFs) have given investors legal exposure to crypto assets.","China AMC CEO Yimei Li stated that these ETFs represent a significant milestone in making cryptocurrency investments more accessible to mainland Chinese investors.","Though crypto trading is banned in mainland China, Li said that the official launch of the ETFs presents a “new opportunity” for mainland Chinese investors in the future to “participate in this process.”","This has proven to be true with mainland China investors flocking to the ETFs. As a result of this adoption, the Bitcoin ETFs secured $230 million in assets under management (AUM) in their inaugural week.","This exponential growth shows China’s eagerness to adopt cryptocurrency despite the restrictive regulations imposed by the Chinese government."],"entity":[{"type":"May 15","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$230 million","content":"MONEY"},{"type":"January 2021","content":"DATE"},{"type":"33.3%","content":"PERCENT"},{"type":"Longquanyi District Branch","content":"LOCATION"},{"type":"Li","content":"PERSON"},{"type":"Hunan","content":"LOCATION"},{"type":"Fujian","content":"LOCATION"},{"type":"$1.9 billion","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"November 2022","content":"DATE"},{"type":"Chengdu Municipal Public Security Bureau","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["Bitcoin ETF","China","Crypto crime"],"authors":["Harvey Hunter"]}