{"summary":"Coinbase Eyes Australia’s Growing $600B Pension Fund","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/coinbase-eyes-australias-growing-600b-pension-fund.htm","publishDate":"2024-05-16T07:53:26","id":21326,"type":null,"title":"Coinbase Eyes Australia’s Growing $600B Pension Fund","category":["Altcoin News "],"content":["Coinbase exchange is having big plans in developing services that targets Australia’s $600 billion self-managed pension sector, Bloomberg reported.","The largest US crypto exchange is reportedly developing a tailored service to tap the unfilled demand over crypto products, Coinbase’s Asia-Pacific Managing Director John O’Loghlen, confirmed.","“Self-managed super funds might just make a single allocation and set it and forget it. We are working on an offering to service those clients really well on a one-off basis — to have them trade with us and stay with us.”","According to latest Australian Taxation Office data, self-managed pension portfolios form a quarter of Australia’s $2.5 trillion pension system. These encompass AU$1 billion ($664 million), designated to crypto assets, which is down from a 2021 peak of AU$1.5 billion.","","The fall could be attributed to some institutional money managers in Australia who refrain from the crypto sector, given its past scandals and high volatility. However, recent changes such as talks to launch a crypto exchange-traded funds (ETFs) in Australia, and Bitcoin price increase have significantly increased the cryptos held within these self-managed retirement fund.","Besides, Michael Houlihan, head of a private wealth management firm, publicly warned investors to avoid large stake in risky assets.","“You wouldn’t want a significant part of a portfolio in something that’s such high risk,” he noted. Investors interested in cryptos are typically in their 40s with low account balances, Houlihan added.","This is true in previous cases, for instance, in 2023, thousands of Australians who used do-it-yourself (DIY) pension funds to bet on cryptocurrencies, faced hundreds of millions of dollars in losses.","Such risky bets jeopardised their savings in a scheme originally set up to ensure adequate retirement income. Per a Reuters’ analysis last year, these bets fall outside the remit of prudential regulator that oversees professionally managed funds.","Elsewhere in the world, freewheeling DIY pension sector comes with some regulation. In the UK, self-managed pension funds cannot directly invest in Bitcoin or other cryptocurrencies."],"entity":[{"type":"John O’Loghlen","content":"PERSON"},{"type":"1 billion ($664 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Michael Houlihan","content":"PERSON"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"UK","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"$2.5 trillion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$600 billion","content":"MONEY"},{"type":"Houlihan","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Australia","Coinbase","Pension"],"authors":["Sujha Sundararajan"]}