{"summary":"Bakkt Predicts a Surge in Institutional Investor Participation in the Crypto Trading Market","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bakkt-predicts-a-surge-in-institutional-investor-participation-in-the-crypto-trading-market.htm","publishDate":"2024-05-16T09:49:05","id":21320,"type":null,"title":"Bakkt Predicts a Surge in Institutional Investor Participation in the Crypto Trading Market","category":["Altcoin News "],"content":["Crypto custody firm Bakkt expects a significant increase in the involvement of institutional investors in the cryptocurrency trading market.","The driving force behind this mainstream adoption, according to Bakkt, is the recent approval of Bitcoin exchange-traded funds (ETFs) by the Securities and Exchange Commission (SEC).","The firm made the prediction on Wednesday when announcing its latest quarterly results, according to a report from PYMNTS.","In the first quarter ending on March 31, Bakkt witnessed a remarkable 324% surge in crypto trading volume compared to the previous quarter, primarily fueled by robust client trading activity.","The positive trend indicates a growing demand environment, with increased industry activity, higher coin prices, and overall elevated retail trading volume, as stated by Andy Main, President and CEO of Bakkt, during the company’s quarterly earnings call.","The existing crypto trading market was primarily tailored for retail investors, utilizing a central limit order book trading structure.","$BKKT Boom‼️","Bakkt Reports First Quarter 2024 Results","$854.6 million total revenues including gross crypto revenues and net loyalty revenues","Strong client crypto trading activity with notional traded volume up 324% quarter-over-quarter\nhttps:\/\/t.co\/qZYisqKNC4","— SHIB Bezos (@BezosCrypto) May 15, 2024","","However, institutional investors seeking to offer Bitcoin ETFs have found that this structure fails to meet their large-scale requirements.","Recognizing this need, Bakkt plans to seize the opportunity by developing BakktX, an electronic communication network (ECN) designed as a purpose-built crypto trading venue for institutions.","BakktX aims to provide high performance, low latency, and cost-effective solutions.","The proposed BakktX trading venue will facilitate real-time execution of trades, leveraging Bakkt’s extensive network of liquidity relationships.","It will also feature a low fee structure, incentivizing trading volumes and catering to the demands of institutional investors.","The company believes that this enhancement in trading technology will strengthen existing relationships and attract new clients who prioritize top-tier infrastructure providers.","In addition to the launch of BakktX, the company plans to expand its product offerings and solutions while focusing on broadening its client network, deepening existing relationships, and continuously improving its cost structure throughout 2024.","To streamline operations and drive profitability, Bakkt recently implemented a restructuring initiative, reducing its headcount by 20%.","This strategic move is expected to result in $7 million in cash savings for 2024 and $13 million in annualized cash savings.","The decisions made by Bakkt reflect its determination to navigate the challenging landscape and reallocate resources to growth areas.","By capitalizing on the increasing interest of institutional investors and delivering a purpose-built trading platform, Bakkt aims to solidify its position as a key player in the evolving crypto trading market.","As reported, trading volume on major cryptocurrency exchanges has experienced a significant decline in April, coinciding with Bitcoin’s retreat from its all-time high.","Additionally, derivatives trading volume saw its first decrease in seven months, falling by 26.1% to $4.57 trillion.","The decline came as major CEXs like Binance experienced a large surge in trading volumes between October 2023 and March 2024."],"entity":[{"type":"Bakkt","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"$13 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$BKKT","content":"MONEY"},{"type":"Bakkt","content":"LOCATION"},{"type":"May 15, 2024","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"324%","content":"PERCENT"},{"type":"Andy Main","content":"PERSON"},{"type":"$854.6 million","content":"MONEY"},{"type":"March 31","content":"DATE"},{"type":"March 2024","content":"DATE"},{"type":"$4.57 trillion","content":"MONEY"},{"type":"Bakkt Reports First Quarter 2024 Results","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"26.1%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"first quarter ending","content":"DATE"}],"hashtag":["Bakkt","Crypto Trading"],"authors":["Ruholamin Haqshanas"]}