{"summary":"El Salvador Announces Tokenized Investment Offerings On Bitcoin Sidechain","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/el-salvador-tokenizes-investments-on-bitcoin-sidechain.htm","publishDate":"2024-05-15T21:42:34","id":21324,"type":null,"title":"El Salvador Announces Tokenized Investment Offerings On Bitcoin Sidechain","category":["Bitcoin News "],"content":["El Salvador took a decisive step into tokenization on Tuesday, unveiling national investment opportunities based on Bitcoin infrastructure.","The nation’s National Bitcoin Office launched its blockchain-based capital raise on the Liquid network.","Bitcoin-based capital markets have officially launched in El Salvador, the first country to adopt Bitcoin. Well done to the ONBTC and @BFXSecurities on this historic milestone! https:\/\/t.co\/6SCPvjiunx","— Liquid Network 🌊 (@Liquid_BTC) May 15, 2024","","Liquid is a Bitcoin sidechain managed by Blockstream and a federation of 65 Bitcoin-centric companies globally. Utilizing BTC as its native asset, the blockchain facilitates faster, cheaper, and more private transactions than the main Bitcoin blockchain.","Beyond BTC, Liquid allows for the issuance of tokens representing diverse assets, including stablecoins like Tether (USDT), meme coins, and real-world assets and securities.","One of El Salvador’s token offerings involves investing in constructing the first hotel at El Salvador International Airport. The investment would yield 10% annually over a five-year term, requiring a minimum investment of $1000.","“The infrastructure will include 80 rooms, five commercial spaces each measuring 99 square meters, a swimming pool, and various amenities such as restaurants, a gym, gardens, multipurpose rooms, among others,” the offering states on the Inverlag Hotels website.","Investors would also secure free nights at the hotel they are helping build. Anyone who invests $1 million gets an all-year-round free stay throughout the bond’s five-year lifespan.","“These opportunities are typically unavailable to the general public,” explained Roberto Laguardia, CEO of Inverlag, in an interview. “They are usually reserved for large-scale or institutional investors and private equity firms… However, with a minimum investment of $1000, individuals can access a 10% interest rate, paid bi-annually, over a five-year period.”","The tokenized issuance was conducted by El Salvador Bitcoin startup DitoBanx, while the exchange platform used to issue the tokens is Bitfinex. Due to regulations, the investment is not available to U.S. investors.","El Salvador is the first and only country in the world to treat El Salvador Bitcoin as legal tender alongside the U.S. dollar. The state regularly invests in BTC and runs a Bitcoin mining operation powered by geothermal energy from the region’s local volcanoes.","El Salvador’s embrace of Bitcoin extends beyond its legal tender status, as these new tokenized investment offerings demonstrate. The Bitcoin Office said this week that the nation has mined 474 BTC since 2021 and now holds 5,750 BTC ($378 million) in total."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Blockstream","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"El Salvador Bitcoin","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"’s National Bitcoin Office","content":"ORGANIZATION"},{"type":"Roberto Laguardia","content":"PERSON"},{"type":"Bitcoin Office","content":"ORGANIZATION"},{"type":"May 15, 2024","content":"DATE"},{"type":"$1000","content":"MONEY"},{"type":"El Salvador International Airport","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"$378 million","content":"MONEY"},{"type":"El Salvador’s embrace of Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["Asset tokenization","Bitcoin Blockchain","El Salvador"],"authors":["Andrew Throuvalas"]}