{"summary":"FTX Gets Backlash Despite Planned Full Repayment Plus Interest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ftx-payout-backlash-over-repayment-plan.htm","publishDate":"2024-05-15T20:34:05","id":21322,"type":null,"title":"FTX Gets Backlash Despite Planned Full Repayment Plus Interest","category":["Blockchain News "],"content":["As everyone in the crypto space knows, cryptocurrency exchange FTX went bankrupt in November 2022 after a fraud-fueled collapse, leaving its users unable to access the cryptocurrency they held. FTX announced on May 7 that customers would be repaid their holdings plus interest two years after the initial collapse, but the proposed repayment plan has sparked a backlash among creditors.","The FTX repayments might offer some relief.","FTX expects the total value of property collected, converted to cash and available for distribution to be between $14.5 billion and $16.3 billion.","Around 98% of creditors with claims under $50k will get ~118% of their allowed claims… pic.twitter.com\/1ltBvoZ5pt","— Oliver Isaacs (@oliverzok) May 9, 2024","","FTX’s plan involves raising between $14.5 billion and $16.3 billion from selling off assets to repay creditors. Under this plan, creditors will receive $11.2 billion, resulting in a payout of up to 118% of the value of their FTX accounts as of November 2022, to compensate for the time value of their investments.","The funds to repay users will come from monetizing a collection of assets, including cryptocurrency held by the platform, proprietary investments held by Alameda or FTX Ventures businesses, and litigation claims. These assets include FTX’s 8% stake in AI startup Anthropic, which was sold to institutional investors for $884 million in March.","FTX expects to collect enough cash to pay users 100% of what they’re owed, plus interest, but there’s a catch: they’re not getting their crypto back. Instead, they’ll receive US dollars based on the value of their accounts at the time of FTX’s bankruptcy in November 2022.","My summary of the major problems with the latest FTX plan and disclosure statement at ~18m00s mark","A vote for this ABOMINATION of a plan is a vote to accept:","– 30% TAX to the US Gov\n– CAPITAL GAINS TAX in your country\n– CHEQUES instead of stablecoins\n– $200M VICTIM MONEY to… https:\/\/t.co\/hpqzbHgxmc","— Arush (FTX Creditor) (@arush) May 10, 2024","","The cryptocurrency market experienced a crash in the immediate aftermath of the FTX bankruptcy, leaving it crippled. However, the market has since staged a major resurgence, with Bitcoin more than tripling in value from $17,000 to over $64,000.","This means that creditors will not benefit from Bitcoin’s higher prices, instead receiving a 9% interest rate. The backlash stems from the perception that this interest rate does not adequately compensate for the true value of the assets lost.","A Bloomberg report highlighted the plight of Arush Sehgal and Acaena Amoros Romero, whose life savings were tied up in FTX, standing to recoup only about $1 million, a quarter of what their account would be worth today.","Sehgal, a former member of the FTX creditor committee, has been critical of the restructuring advisors’ handling of the case. “A hundred cents on the dollar doesn’t really mean much to me,” he said, underscoring the frustration among creditors.","While FTX has indicated that repayments could be issued later this year, resistance from creditors may impede the process.","Over 80 creditors have filed letters with the bankruptcy court, criticizing decisions made by FTX CEO John Ray, particularly the methodology used to determine account values.","Sehgal estimates that over 1,500 creditors share his views, as evidenced by the response on FTX.vote, a platform he created to mobilize opposition to the plan.","In January, a group of creditors sued FTX in bankruptcy court, arguing that their crypto was not a property that FTX could sell.","The judge overseeing the FTX Chapter 11 case will likely need to resolve this lawsuit before any payouts can be made to customers. The outcome of this legal battle will determine the fate of the FTX repayment plan and the financial recovery for its former customers.","The plan’s success in satisfying creditors ultimately hinges on resolving this legal dispute and the overall direction of the cryptocurrency industry."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"98%","content":"PERCENT"},{"type":"118%","content":"PERCENT"},{"type":"$14.5 billion","content":"MONEY"},{"type":"Oliver Isaacs","content":"PERSON"},{"type":"$16.3 billion","content":"MONEY"},{"type":"May 10, 2024","content":"DATE"},{"type":"May 9, 2024","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Arush Sehgal","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"$17,000","content":"MONEY"},{"type":"$200M","content":"MONEY"},{"type":"$50k","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"$64,000","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"May 7","content":"DATE"},{"type":"$884 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"$11.2 billion","content":"MONEY"},{"type":"Acaena Amoros Romero","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"A hundred cents","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"John Ray","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Crypto Market","FTX","Sam Bankman-Fried"],"authors":["Harvey Hunter"]}