{"summary":"Mastercard’s Start Path Welcomes Five Startups to Develop Blockchain Use Cases","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mastercard-welcomes-five-startups-to-develop-blockchain-use-cases-and-user-experiences.htm","publishDate":"2024-05-16T20:06:46","id":21328,"type":null,"title":"Mastercard’s Start Path Welcomes Five Startups to Develop Blockchain Use Cases","category":["Blockchain News "],"content":["Mastercard announced the selection of five startups to participate in its Start Path blockchain and digital assets program on Wednesday to foster innovation in blockchain technology and digital asset utilization.","As part of Mastercard’s new initiative, these startups will explore new ways to use money to address real-world challenges, enhance user experiences, and broaden the utility of blockchain technology.","Mastercard highlighted its experience constructing a global payments network, emphasizing its capability to connect regulated money, bank deposits, stablecoins, and central bank digital currencies (CBDCs) with startups. The program’s objective is to drive the development of new solutions that improve digital commerce user experiences.","Mastercard’s Start Path program will use blockchain technology’s unique capabilities by collaborating with industry experts and fintech startups to identify and develop use cases that address pressing societal needs.","Through the Start Path program, selected startups will gain access to special training, mentorship, and Mastercard’s network of customers and channels over four months. ","“Since the program was founded in 2014, Mastercard has supported more than 400 startups from 54 countries,” the press release noted.","#MastercardProgramm | We are proud to announce our participation in the @Mastercard Start Path program for Blockchain and Digital Assets startups. 🌎⛓ pic.twitter.com\/oMAFWTQUUf","— Parfin (@parfin_io) May 15, 2024","","Among the selected startups is Kulipa, a French-based company that facilitates crypto payment card issuance for digital wallets. Another chosen participant is UK-based Parfin, which focuses on developing enterprise-grade software products to assist financial institutions in adopting blockchain.","Singapore’s Peaq, recognized for providing permissionless and borderless digital infrastructure for real-world applications, was among the startups chosen for the program.","Triangle, a U.S.-based startup that prioritizes sustainability through a data platform integrating climate data with finance, and Venly, a Belgium-based startup simplifying blockchain integration for developers and businesses, were also selected to participate.","Thrilled to announce that Venly has been chosen to participate in @Mastercard's 2024 Global Start Path Blockchain and Digital Assets Program! 🎉","Being acknowledged as a frontrunner in blockchain innovation is an honor. We can't wait to help shape the future of commerce through… pic.twitter.com\/bp9Z1Nps8x","— Venly (@Venly_io) May 15, 2024","","Commenting on the program, Kujipa founder Axel Cateland expressed optimism about unlocking mass crypto adoption and promoting wider financial inclusion through convenient global stablecoin payments.","In a recent announcement, Mastercard and Standard Chartered Bank Hong Kong (SCBHK) have completed the first live test of Mastercard’s Multi-Token Network (MTN). The proof-of-concept pilot involved tokenizing carbon credits within the Hong Kong Monetary Authority’s (HKMA) Fintech Supervisory Sandbox, showcasing a novel blockchain application in financial services.","In the pilot, a client of SCBHK’s virtual bank, Mox Bank, initiated the process by depositing funds into Mox and requesting a carbon credit.","Subsequently, Mox directed SCBHK to tokenize the carbon credit through Libeara, a tokenization service provider developed by Standard Chartered’s venture arm, SC Ventures. The MTN tokenized the deposit, and an atomic swap—a real-time exchange occurring across different blockchains—was executed to swap the tokens.","Mastercard launched the MTN in June 2023 using its private blockchain infrastructure. Previous trial runs of the MTN included collaborations with the Reserve Bank of Australia using wrapped central bank digital currency (CBDC) and the HKMA’s e-HKD CBDC.","Although these CBDCs are not yet live, the trials demonstrated the potential for such technologies in modernizing financial transactions."],"entity":[{"type":"2014","content":"DATE"},{"type":"Axel Cateland","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Standard Chartered Bank Hong Kong","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"May 15, 2024","content":"DATE"},{"type":"MTN","content":"ORGANIZATION"},{"type":"Fintech Supervisory Sandbox","content":"ORGANIZATION"},{"type":"SC Ventures","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Mox Bank","content":"ORGANIZATION"},{"type":"Reserve Bank of Australia","content":"ORGANIZATION"},{"type":"Belgium","content":"LOCATION"},{"type":"Kujipa","content":"ORGANIZATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Venly","content":"PERSON"},{"type":"Kulipa","content":"LOCATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["Blockchain","mastercard"],"authors":["Hassan Shittu"]}