{"summary":"Russian Teens Arrested for ‘Crypto-powered Money Laundering’ – Report","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/russian-teens-arrested-for-crypto-powered-money-laundering-report.htm","publishDate":"2024-05-15T23:30:33","id":21327,"type":null,"title":"Russian Teens Arrested for ‘Crypto-powered Money Laundering’ – Report","category":["Blockchain News "],"content":["Two Russian teenagers have been arrested in a crackdown on a suspected crypto-powered “money laundering” ring, a police source claimed on May 14.","Per the news agency URA, an unnamed “law enforcement agency” member in the Khanty-Mansi Autonomous Okrug said the teenage brothers “attracted other teens” in the region to their scheme.","The source claimed that some of the teens’ parents sent a “statement” to law enforcement agencies in the region in April.","The parents reportedly told police officers that “an organized crime group” had “involved their children” in what appears to be an illegal crypto exchange operation.","Police appear to have been ignorant of the scheme before the tip-off, but launched a probe shortly after.","The source claimed that the two brothers offered fellow teens “small financial benefits” for processing crypto-related transactions through their bank accounts.","One of the teens transacted almost $22,000 worth of crypto exchange-related funds through their bank account in the space of two months, the source added.","This helped the teen earn cash worth around $4,400, which he “hid under his pillow at home,” the source concluded.","The case has reportedly drawn the attention of the federal investigative agency, the Investigative Committee of the Russian Federation.","Committee chief Alexander Bastrykin has also personally “intervened,” the media outlet reported. It added that the regional branch of the committee is also “monitoring” the case","The media outlet concluded that it had reached out to the Khanty-Mansi Autonomous Okrug branch of the committee, which is yet to comment on the matter.","Crypto exchanges currently have no legal status in Russia. But the nation’s anti-money laundering agency Rosfinmonitoring has called on Moscow to speed up the rollout of regulatory laws.","Both the agency and police claim that crypto has become the go-to choice for money launderers and criminals in Russia.","Russia’s April exports of crude and petroleum products hit five month low amid Ukrainian drone attacks, says the International Energy Agency https:\/\/t.co\/k9t0yYeFF1","— Bloomberg (@business) May 15, 2024","","Lawmakers are set to debate a key piece of crypto-related legislation in the coming weeks.","The draft bill reportedly proposes a ban on all domestic crypto exchanges, except for official sandbox operators.","The bill proposes allowing energy providers to “hunt” home-based crypto miners. It also proposes legalizing the industrial crypto mining sector."],"entity":[{"type":"May 14","content":"DATE"},{"type":"Mansi Autonomous Okrug","content":"ORGANIZATION"},{"type":"$22,000","content":"MONEY"},{"type":"Khanty","content":"LOCATION"},{"type":"Investigative Committee of the Russian Federation","content":"ORGANIZATION"},{"type":"Alexander Bastrykin","content":"PERSON"},{"type":"International Energy Agency https:\/\/t.co\/k9t0yYeFF1","content":"ORGANIZATION"},{"type":"URA","content":"ORGANIZATION"},{"type":"May 15, 2024","content":"DATE"},{"type":"Mansi Autonomous Okrug","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Moscow","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Rosfinmonitoring","content":"PERSON"},{"type":"$4,400","content":"MONEY"},{"type":"April","content":"DATE"}],"hashtag":["Police","Russia"],"authors":["Tim Alper"]}