{"summary":"MMO Combat Game MetalCore Joins $2.4 Billion Universal Gaming Ecosystem Portal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/mmo-combat-game-metalcore-joins-2-5-billion-universal-gaming-ecosystem-portal.htm","publishDate":"2024-05-16T12:57:46","id":21331,"type":null,"title":"MMO Combat Game MetalCore Joins $2.4 Billion Universal Gaming Ecosystem Portal","category":["Blockchain News "],"content":["MetalCore, a free-to-play massive multiplayer online (MMO) combat game led by former developers from Activision, Disney, Lucasfilm, and Midway, has announced a partnership with the universal gaming ecosystem Portal.","Studio369, the game development company behind the blockchain-powered PvP shooter, said that Portal is a cross-chain gaming access point that enables users “to consolidate all of their Web3 games, digital assets, and user accounts into a single, easily accessible location.”","The Web3 game industry is gaining popularity. However, Studio369 argues, the blockchain onboarding experience still has two major pain points: it’s complex and fragmented across competing ecosystems.","These issues represent “a bottleneck to broader growth.”","This is what MetalCore and Portal aim to eliminate.","Creating a consolidated ecosystem will break down onboarding barriers, opening doors to millions of new users.","“By integrating into a unified ecosystem, gamers will access a powerful interface, removing the complexities of navigating blockchain bridges and liquidity pools,” the press release said.","🤝 @Portalcoin x METALCORE","🦾 Step through the portal, Soldiers, and enter the world of Kerberos where mechs dominate the battlefield. https:\/\/t.co\/idiPQQiW5y","— METALCORE | Let's #PlayMetalCore! (@playmetalcore) May 15, 2024","","Furthermore, the partnership is a step in MetalCore’s overall mission to build a player-driven, interconnected ecosystem of gaming token utility.","Per the team, this ecosystem involves sustainable, interoperable economies and tokens integrated into the core gameplay loop.","Therefore, it’s the players themselves who shape the game’s outcome. Their choices also affect the narrative and economy.","“Portal is connecting the Web3 gaming ecosystem in a way never attempted before,” remarked Studio369 CEO Matt Candler. “This space is going to need AAA titles to support growth, but also the means to connect players and assets. We believe we’re at the cutting edge of building such an ecosystem.”","Studio369 is a team of Unreal Engine experts focused on PC and console platforms, the announcement noted.","Its members previously worked on massive titles such as Fortnite, The Walking Dead, Star Trek, Gears of War 3, MechWarrior 2, Nether, and Outpost Zero.","They have decades of extensive development and publishing experience.","🚨 FINAL 24 HOURS 🚨","This is your FINAL CHANCE to get in on $MCG Rewards.","Acquire Marks NOW by completing quests!\n➡️ https:\/\/t.co\/F0t8D487lZ pic.twitter.com\/3z0IsJfrNs","— METALCORE | Let's #PlayMetalCore! (@playmetalcore) May 13, 2024","","In March this year, Studio369 successfully raised $5 million for MetalCore, from Delphi Digital, BITKRAFT Ventures, Sanctor Capital, Spartan Group, King River Digital Assets, and Arrington Capital, among others.","Per Crunchbase, the team has raised a total of $18.7 million in three rounds.","Following the March raise, Studio369 said it would put the newly raised funds toward continued development and upcoming features, including “a never-seen-before dynamic mission system that leverages AI to generate unique assignments, objectives, and tasks.”","Also, thanks to the integration in the Immutable zkEVM ecosystem, developers have been enabled to deploy custom smart contracts and offer users a gas-free service.","Winner of Global Blockchain Show’s Best Blockchain Game of the Year and GAM3 2022 Award for Best Shooter Game, MetalCore possesses an innovative ‘scanning’ system that lets players obtain blueprints from fallen enemies, craft new weapons and vehicles, and convert them to Web3 assets for trading, the team noted.","\"web3 gaming is dead, nothing is happening\"","i'm not so sure about that, every day i'm surprised by another game reporting solid player stats and seeing great growth","the latest one is Metalcore","we talked about the game a bunch of times before, based on the gameplay it's one of… pic.twitter.com\/aLUV2Wcn8V","— apix🎮 (@apixtwts) May 14, 2024","","Meanwhile, Portal offers a suite of services for users to engage with Web3 titles. It includes a wallet, companion app, multi-chain functionality, a launchpad, and a native token.","Speaking of the PORTAL token, it debuted this year at a $2.37 billion valuation.","The platform, whose advisory board includes Jamie King, co-founder of Rockstar Games, also recently partnered with Pixelmon.","Justin Taylor, a member of the Portal team, commented on the partnership with MetalCore. He said the Portal team “knows how important it is to have the most innovative titles available through our platform. We want players to consider us the obvious access point for their favorite Web3 games.”"],"entity":[{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"Jamie King","content":"PERSON"},{"type":"May 15, 2024","content":"DATE"},{"type":"Activision","content":"ORGANIZATION"},{"type":"Crunchbase","content":"PERSON"},{"type":"Sanctor Capital","content":"ORGANIZATION"},{"type":"Portal","content":"ORGANIZATION"},{"type":"Lucasfilm","content":"ORGANIZATION"},{"type":"$MCG","content":"MONEY"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"Pixelmon","content":"PERSON"},{"type":"Star Trek","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"Matt Candler","content":"PERSON"},{"type":"May 14, 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Midway","content":"LOCATION"},{"type":"King River Digital Assets","content":"ORGANIZATION"},{"type":"Justin Taylor","content":"PERSON"},{"type":"$2.37 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"May 13, 2024","content":"DATE"},{"type":"$18.7 million","content":"MONEY"},{"type":"March this year","content":"DATE"},{"type":"Disney","content":"ORGANIZATION"}],"hashtag":["Blockchain","Gaming","Web3"],"authors":["Sead Fadilpašić"]}