{"summary":"Bitcoin Price Pumps Higher as Morgan Stanley Reveals Significant Holdings in US Spot Bitcoin ETFs – Here’s the Latest","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitcoin-price-pumps-higher-as-morgan-stanley-reveals-significant-holdings-in-us-spot-bitcoin-etfs-heres-the-latest.htm","publishDate":"2024-05-16T16:38:38","id":21332,"type":null,"title":"Bitcoin Price Pumps Higher as Morgan Stanley Reveals Significant Holdings in US Spot Bitcoin ETFs – Here’s the Latest","category":["Bitcoin News "],"content":["The Bitcoin (BTC) price has been pumping higher this week in wake of US CPI data that pointed at moderating price pressures, and as major financial institutions including Morgan Stanley reveal significant holdings in US spot Bitcoin ETFs.","Bitcoin was last changing hands just below $66,000, having hit new monthly highs above $66,750 earlier in the day.","Morgan Stanley revealed significant holdings of $270 million worth of spot Bitcoin ETFs in a Wednesday 13F filing.","The US investment banking and asset management giant had signaled back in February that it intended to gain BTC exposure.","The bank is also paving the way to begin recommending spot Bitcoin ETFs to its clients.","Morgan Stanley’s BTC holdings reveal comes at a time when droves of other institutional investors are also revealing holdings.","As of Thursday, Q1 13F filings show that over 500 asset managers have exposure to spot Bitcoin ETFs.","Millennium Management is the largest known holder at present with nearly $2 billion in holdings. That’s roughly 3% of the hedge funds’ $64 billion in AUM.","As per Bloomberg ETF analyst Eric Balchunas, Millenium is the current “king” of ETF holders.","Millennium is king of the bitcoin ETF holders w\/ about $2b across four ETFs. This is out of over 500 holders (about 200x the avg for new ETF). Majority are inv advisors (60%) but a big dose of HFs (25%). Never can be totally sure what HFs up to but they were def big buyers. pic.twitter.com\/iVtVXjhId0","— Eric Balchunas (@EricBalchunas) May 15, 2024","","Balchunas notes that the new spot Bitcoin ETFs have about 200x the average number of holders for a new ETF.","It’s “impressive just how many different institution types represented in first 13Fs”, he continued.","These holders included a state pension fund – the State of Wisconsin Investment Board revealed it now holds almost $100 million in spot BTC ETFs.","Dont underestimate this State of Wisconsin Investment Board buying Bitcoin ETFs. This will start a chain reaction – May 28th is looming. $27 trillion in these funds. pic.twitter.com\/5wlVwsYyGi","— MartyParty (@martypartymusic) May 15, 2024","","Bitcoin bulls are hoping that renewed optimism about Bitcoin’s institutional adoption via ETFs plus macro headwinds can lift it back above $70,000 soon.","Spot Bitcoin ETFs saw net inflows of over $300 million on Wednesday after positive US CPI numbers, as per The Block.","US CPI 3.4% YoY EXPECTED 3.4% pic.twitter.com\/cOwqY3Qty9","— GURGAVIN (@gurgavin) May 15, 2024","","Indeed, Wednesday’s push higher helped Bitcoin move back above its 21 and 50DMAs and to fresh monthly highs.","To continue higher, the Bitcoin price needs to break above its late April highs above $67,000.","That could open the door to a pushback above $70,000 and a potential retest of yearly highs.","US equities could be a lead indicator for Bitcoin here. The S&P 500 is currently carving out new record highs above 5,300, having retraced.","Bitcoin could soon be carving out its own fresh record highs above $74,000.","Of course, nothing is guaranteed heading into the summer and with only one month gone since the halving.","Summers tend to be a choppy\/bearish time for risk assets like stocks and Bitcoin. Some have noted this rule tends not to apply in election years, however.","Meanwhile, post-halving rallies don’t typically get going for 4-6 months after the halving, not after one month.","So a surge to new record highs in the next few weeks could be a bit “premature”.","That said, this Bitcoin bull run is breaking historical patterns\/norms.","ETF optimism already powered the Bitcoin price to new record highs before the halving. New record highs have historically come after the halving.","Bitcoin is maturing into a fully-fledged macro asset, which doesn’t tend to have highly obvious\/predictable long-term patterns, such as Bitcoin’s three-year pump\/one-year dump patterns that has been more or less in place over the past 12 or so years."],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"3.4%","content":"PERCENT"},{"type":"$27 trillion","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"May 15, 2024","content":"DATE"},{"type":"$64 billion","content":"MONEY"},{"type":"$67,000","content":"MONEY"},{"type":"AUM","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$2b","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"$66,750","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"May 28th","content":"DATE"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$74,000","content":"MONEY"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"State of Wisconsin Investment Board","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$270 million","content":"MONEY"},{"type":"late April","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"Morgan Stanley’s BTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"$66,000","content":"MONEY"}],"hashtag":["Bitcoin","btc"],"authors":["Joel Frank"]}