{"summary":"Sam Bankman-Fried, Commodities Trader Behind Bars: Former FTX CEO’s Prison Life While Awaiting Appeal","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/sam-bankman-fried-commodities-trader-behind-bars-former-ftx-ceos-prison-life-while-awaiting-appeal.htm","publishDate":"2024-05-10T17:12:01","id":21335,"type":null,"title":"Sam Bankman-Fried, Commodities Trader Behind Bars: Former FTX CEO’s Prison Life While Awaiting Appeal","category":["Blockchain News "],"content":["Since his imprisonment for fraud, Sam Bankman-Fried, the former CEO of the now-defunct cryptocurrency exchange FTX, spoke to the media for the first time on May 9. Sentenced to 25 years, Bankman-Fried maintains his innocence and is pursuing an appeal. While legal proceedings unfold, he has turned his attention to a new venture: commodities trading within the confines of prison walls, focusing specifically on bags of rice.","The interview, facilitated by Bankman-Fried’s mother and conducted by Puck News journalist Theodore Schleifer, occurred at Brooklyn’s Metropolitan Detention Center, where he has been held since August 2023. The interview revealed details about Bankman-Fried’s life behind bars and his perspective on the FTX collapse.","Bankman-Fried’s vegan diet has proven unpopular with fellow inmates, leading him to rely on beans and rice, a common staple and a form of currency within the prison. The dietary shift is just one aspect of his adaptation to life at the Metropolitan Detention Center.","Former #FTX CEO SAM Bankman-Fried sells rice in prison and has lost 25 pounds (11 kg) 🤯","☑️ 35 prisoners, most of them convicted of murder, are serving their sentences in the same cell with #SBF\n☑️ Sam usually uses his only tablet to play games or watch movies. pic.twitter.com\/Ba6foJeYYN","— Web3_Vibes (@W3Vibes) May 10, 2024","","Maintaining consistent eye contact with the reporter, a departure from his usual demeanor, Sam Bankman-Fried currently resides in a spacious, dormitory-style prison area within a section of the MDC primarily reserved for female inmates.","He is segregated with 35 other male prisoners, half of whom are reportedly cooperating with the government in murder cases. Bankman-Fried’s physical appearance has also changed; he has lost weight and appears less restless than in his pre-prison days, according to Puck.","The former FTX head maintained that he has been unfairly blamed for the company’s collapse. He attributed the downfall to negligence that created the conditions for a bank run, compounded by competitors’ actions. Bankman-Fried believes a civil penalty, rather than a criminal one, would have been more appropriate. Convicted of assisting in the misappropriation of $8 billion in customer funds, Bankman-Fried expressed little remorse.","He regrets not finding a different leader for Alameda Research, citing a conflict of interest with his simultaneous leadership of FTX.","Awaiting the potentially lengthy transfer process, which could take up to four months, Bankman-Fried has requested relocation to a facility closer to his parents."],"entity":[{"type":"August 2023","content":"DATE"},{"type":"SAM Bankman","content":"PERSON"},{"type":"May 10, 2024","content":"DATE"},{"type":"MDC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Metropolitan Detention Center","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"May 9","content":"DATE"},{"type":"Theodore Schleifer","content":"PERSON"},{"type":"Brooklyn’s Metropolitan Detention Center","content":"ORGANIZATION"},{"type":"Puck","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Puck News","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","Sam Bankman-Fried","SBF"],"authors":["Thomas Musgrave"]}