{"summary":"&quot;Binance has worked with the Tron project team to arrive at a solution for reducing withdrawal fees on Tron network,&quot; the exchange said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210828\/binance-says-its-adjusting-tron-network-withdrawal-fees-to-previous-levels","publishDate":"2023-02-11T12:51:13","id":2134,"type":null,"title":"Binance says it&#x27;s adjusting Tron network withdrawal fees to previous levels","category":["COMPANIES"],"content":["Binance, the leading crypto exchange by trading volume, said Saturday that it had reverted withdrawal levels on the Tron network to previous levels after feedback from the community.","\"Binance has worked with the Tron project team to arrive at a solution for reducing withdrawal fees on Tron network,\" the exchange said in a <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/updates-to-tron-trx-network-withdrawal-fees-2023-02-11-cba7939e116f492d8ce9e95c97b61601\" data-v-f87c67ca=\"\">statement<\/a>.","The exchange said <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-adjust-the-tron-trx-network-withdrawal-fees-3885bb403410477bafd95b09ddb6a1b2\" data-v-f87c67ca=\"\">Friday<\/a> that it was increasing fees after the Tron community voted to change the energy charging mechanism on the network to a <a href=\"https:\/\/coredevs.medium.com\/introduction-to-dynamic-energy-model-31917419b61a\" data-v-f87c67ca=\"\">dynamic energy model<\/a> designed to more reasonably energy resources on the chain and prevent \"excessive concentration of network resources on a few contracts.\" After the change, the withdrawal fee for USDT and USDC more than doubled, while the fee to withdraw TRX increased 15 times.","Tron founder Justin Sun said earlier Saturday that he was working with Binance to reduce the fees.","\"We remain committed to making crypto trading more affordable for everyone,\" he <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1624290660345057281\" data-v-f87c67ca=\"\">tweeted<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"earlier Saturday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Nathan Crooks","The Block"]}