{"summary":"Crypto Prices Crash as FTX Crypto Exchange Collapses – What We Know So Far","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/crypto-prices-crash-as-ftx-crypto-exchange-collapses-what-we-know-so-far.htm","publishDate":"2022-11-09T09:52:00","id":21345,"type":null,"title":"Crypto Prices Crash as FTX Crypto Exchange Collapses – What We Know So Far","category":["Blockchain News "],"content":["The price of almost all major cryptocurrencies crashed today after it was announced that major crypto exchange FTX would be acquired by rival exchange Binance in a strange turn of events. ","The world’s largest cryptocurrency has lost more than 8% in value over the past 24 hours, currently trading around the $18,000 mark. Ethereum, the second-largest crypto, also tumbled by more than 16% to $1,200. Polygon’s Matic has suffered the most among the top ten, losing around 20% over the past day. ","Bitfinex market analysts said in a comment to Cryptonews.com that the recent developments in the crypto space would further exacerbate the sentiment around Bitcoin, which was already in the crosshairs of whipsaw trading.","“In a space battered by a spate of high-profile failures this year markets are likely to remain turbulent until traders steady their nerves. A backdrop of looming rate hikes and a deteriorating global economy is only adding to super bearish sentiment,” the analysts said.","FTX earned itself a reputation as crypto’s bail-out king during the recent crypto meltdown. The platform generously offered to bail out some troubled digital currency platforms, putting up millions of dollars in a revolving line of credit.","However, in a strange turn of events, the exchange allegedly become insolvent and had to sell its distressed assets to a competitor. “We have come to an agreement on a strategic transaction with Binance for FTX.com,” FTX CEO Sam Bankman-Fried said in a tweet. ","Binance CEO CZ added more details. “FTX asked for our help. There is a significant liquidity crunch. To protect users, we signed a non-binding LOI, intending to fully acquire FTX.com,” he said. \n\nBut how did things reach here?","On November 2, CoinDesk reported that it had gained access to Alameda Research’s balance sheet, claiming that the firm, which has close ties to FTX, was loaded with the exchange’s native exchange token FTT. Most of the other holdings were in illiquid assets, meaning there was not enough money to cash out if need be.","Subsequently, Binance CEO Changpeng Zhao announced that the exchange, which held 23 million FTX tokens worth about $529 million at the time, had decided to liquidate any remaining FTT on its books. ","The news led to sell pressure on FTT increasing, with the coin plunging from its daily high of $22. \n\nIt then became apparent that Binance was looking to acquire FTX, upon which the markets rallied briefly before continuing their decline as no deal was set in stone. ","“The fear that Alameda’s shoddy balance sheet was commingled with FTX’s led to a liquidity crisis and ultimately to today’s offer by CZ to acquire the exchange,” said crypto veteran Jonathon Wu, adding that there is “a seeming multi-billion dollar hole at FTX.”","Now there's a seeming multi-billion dollar hole at FTX, and Sam, the previous lender of last resort, has had to turn to CZ for help.\n\nThere is a new king in crypto.","It now remains to be seen whether the Binance deal goes through. However, if recent price action anything to go by, it’s safe to say markets participants are not looking hopeful."],"entity":[{"type":"Matic","content":"PERSON"},{"type":"8%","content":"PERCENT"},{"type":"$22","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"November 2","content":"DATE"},{"type":"$1,200","content":"MONEY"},{"type":"Fried","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$529 million","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"$18,000","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Jonathon Wu","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Binance CEO Changpeng Zhao","content":"ORGANIZATION"}],"hashtag":["Binance","Changpeng Zhao","FTX","Sam Bankman-Fried"],"authors":["Ruholamin Haqshanas"]}