{"summary":"A Spring Downfall: Solana Ecosystem and SOL Price Action in April 2024","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solana-ecosystem-sol-price-report-april-2024.htm","publishDate":"2024-05-08T09:37:41","id":21340,"type":null,"title":"A Spring Downfall: Solana Ecosystem and SOL Price Action in April 2024","category":["Altcoin News "],"content":["In this report, we explore and analyze the Solana ecosystem downtime, SOL price action, and Solana meme coin action in April 2024, with a particular focus on the reasons for a staggering 56% SOL price drop.","","","Solana is an open-source blockchain platform founded in 2017, emphasizing scalability and speed. With its unique Layer 1 network architecture, it processes over 710,000 transactions per second, enabling the creation of smart contracts and decentralized applications (DApps) for various use cases, such as decentralized finance (DeFi) and nonfungible tokens (NFTs) marketplaces. Unlike Ethereum, Solana does not require additional scaling solutions, relying on powerful computers for network maintenance and data storage. Its native cryptocurrency, SOL, is essential for transactions and network security through staking.","Solana’s (SOL) price experienced a rollercoaster ride in April 2024, marked by significant price drops and a struggle to regain lost ground. This volatility can be attributed to a confluence of factors, including unresolved network issues, declining on-chain activity, and broader market sentiment.","Starting at $193 on April 1, SOL’s price fell to $123 on April 13. This drop coincided with a developer’s admission that Solana’s network outage problems remained unresolved. This admission fueled investor concerns about the network’s stability, leading to a price drop of over 56%. Later in April, Solana recovered somewhat, reaching $159 on April 23, but was unable to hold this level and closed the month at nearly $130.","Further downward pressure came from declining on-chain activity. Data suggested a decrease in both DEX transaction volume (from $3,8 billion on March 20 to $691,7 million on April 28) and the number of active decentralized application (DApp) users. Daily active addresses on Solana dropped significantly throughout April, reaching a low of 981k on April 28.","Data from HelloMoon showed a decline in new-user acquisition. On March 29, Solana welcomed a staggering 1 million new wallets. This number, however, began a concerning downward trend. By April 28, the number of new wallets executing their first transaction had plummeted to 702k. This represents a worrying 42% decline in new user acquisition within a single month which translates into a market cap loss of $30 billion in 30 days (from $91 billion on March 31 and $61 billion on April 29). ","Adding fuel to the fire, in early April, the Solana network struggled with an alarming rate of failed transactions, with a staggering 3 out of 4 transactions failing (75%). Solana’s spike in failed transactions may have been caused by the surge in meme coin trading. ","Experts believe a large portion of these failed transactions are likely coming from bots. Solana Foundation strategy lead Austin Federa attributed the current network congestion issues to several factors, including high demand for Solana block space and delayed implementation of patches to address network issues.","The Solana network is, once again, being battle tested with a huge influx of traffic. Bug fixes are rolling out over the next week, and things will start to improve.","But there is no silver bullet and no \"finished\" – we expect demand will continue to increase, which will require…","— Austin Federa | 🇺🇸 (@Austin_Federa) April 5, 2024","","Solana’s open interest (total value of outstanding futures contracts) also fell in April compared to March. On April 28, Solana’s open interest was only $1.74 billion.","April 2024 was a month of contrasts for the Solana ecosystem. While it witnessed significant institutional adoption and new partnerships, network congestion cast a long shadow. ","In early April, Solana’s network choked under heavy meme coin activity, with transaction failures reaching 75% for a week. Developers claimed it was a bug, not a network issue. New projects, especially those planning token launches, have been put on hold until the technical issues related to Solana’s network congestion and transaction errors are resolved.","After exacerbating congestion on the Solana network, Ore, the Bitcoin-like mining protocol on Solana, also announced it was pausing mining. ","Mining has been paused effective immediately to focus on the development of v2.","There is no deadline to claim rewards, and all existing Ore tokens will be upgradable into the new v2 token when ready.","For details, please see the full announcement belowhttps:\/\/t.co\/dwveVDPt19","— Ore (@OreSupply) April 16, 2024","","On April 12, Solana devs released update v1.17.31 to tackle network congestion because of the surge in demand and network activity. This patch includes improvements for congestion and open interest issues. Some of the key upgrades include: differentiating staked vs non-staked data, efficiency improvements, and stricter controls for staked nodes. ","On April 9, Solana validators overwhelmingly approved (98%) a proposal to speed up transactions. The “Timely Vote Credits” system aims to incentivize validators to vote faster, ultimately leading to quicker transaction confirmation times.","CoinShares reported a surge in institutional investment in Solana by hedge funds and wealth managers. Compared to earlier this year, nearly 15% of surveyed investors with $600 billion in assets now hold SOL, a “dramatic increase in allocations.”","In a move to compensate defrauded customers, bankruptcy administrators for collapsed crypto exchange FTX sold 30 million SOL tokens with bids averaging around $100 per SOL. The sale generated roughly $1.9 billion.","FTX, which filed for bankruptcy in 2022, previously disclosed holding a significant amount of SOL, the native token of the Solana blockchain. As of August 2023, FTX’s SOL holdings were valued at $1.2 billion, making it the exchange’s largest cryptocurrency asset. Bitcoin and Ethereum followed at $560 million each.","Natix, a DePIN project focused on mapping data on Solana, secured $4.6 million in funding. They plan to launch their token and airdrop about 1 billion tokens to their users. Borderless Capital led the round, with Tioga Capital and several other investors participating.","April 2024 was a wild month for Solana meme coins. While some projects skyrocketed to astronomical valuations, others fizzled out, leaving investors questioning the true potential of the meme coin craze. A bizarre scam launched on the Solana blockchain on April 29, with a meme coin called Bonk Killer (BONKKILLER) briefly reaching the highest market cap in the world at $328 trillion. This seemingly outlandish figure was a result of a malicious trap designed to steal investor funds.","Bonk Killer attracted a small group of roughly 1,000 investors. However, the token’s smart contract was rigged with a “honeypot” feature. This allowed the creator to hold over 90% of the tokens and activate a “freeze authority” that prevented anyone from selling their holdings. According to independent blockchain sleuth ZachXBT, another 12 Solana meme coin presales were abruptly halted after just one month, having raised a total of $26.7 million from investors. ","Only 1 month has passed and 12 of the Solana presale meme coins have been completely abandoned after raising >180,650 SOL ($26.7M).","Would avoid any future projects launched by these founders. https:\/\/t.co\/J0zFldRIa6 pic.twitter.com\/K610MAEPMn","— ZachXBT (@zachxbt) April 21, 2024","","Popular Solana memecoin Bonk (BONK) struggled to break above $0.00002462 on April 8 and fell to $0.00001346 on April 13, resulting in an 87% drop in price. Later in the month, the BONK price increased, reaching $0.00002924 on April 25 and closing the month at $0.00002171 per coin. ","The leading Solana-based meme token by market value Dogwifhat (WIF) failed to climb above $4.58 on April 1 and fell 114% to $2.14 on April 14. At the end of the month, WIF was worth $2.45. Notably, WIF still accounts for nearly half of Solana’s total meme coin market share.","From airdrops aiming to attract users to a major acquisition — April 2024 was a month of significant developments for decentralized exchanges (DEXs) on the Solana blockchain. ","Several prominent Solana DEXs announced airdrops in April, aiming to incentivize user participation and boost their ecosystems. ","On April 16, the Drift Foundation unveiled the launch of its governance token, DRIFT. This token will be used for on-chain voting within the Drift protocol. To incentivize user participation, Drift also announced a 100 million token airdrop. ","Zeta Markets, another popular DEX for options trading, unveiled a similar airdrop of 100 million Z tokens. The token launch and airdrop are expected to occur next month.","We’re proud to introduce $Z – the future of decentralized trading.$Z powers the governance and protocol growth of Zeta Markets, @solana's fastest perpetuals exchange, which has facilitated +$4B in trading volume serving 71.6k monthly active users.","Coming soon. 🧵 pic.twitter.com\/ivGyoZ4S55","— Zeta Markets | v2 Live 🔥 (@ZetaMarkets) April 9, 2024","","However, this trend wasn’t without its setbacks. The Parcl protocol, a decentralized betting platform on Solana, experienced a significant decline in TVL following an airdrop of its native PRCL token. According to DeFiLiama, TVL dropped 218% in April, falling from $185.6 million to $58.35 million. ","Jupiter, the largest Solana DEX by volume, made a strategic move by acquiring Ultimate, a wallet for DeFi and NFTs developed by the German crypto company Unstoppable Finance. This acquisition will potentially strengthen Jupiter’s position in the market and expand its product offerings. ","🚀 Big News: Jupiter acquires Ultimate Wallet and our mobile team! More info in the thread👇 pic.twitter.com\/cZMGKlrNzJ","— Ultimate Wallet (@UltimateApp) April 23, 2024","","Solana interoperability layer Zeus Network closed an $8 million funding round, valuing the project at $100 million. The funding will likely be used to further develop their technology, which aims to facilitate seamless communication between different blockchains. ","We are thrilled to share the exciting news that Zeus Network has secured $8 million in funding, valuing our cross-chian product at an impressive $100 million; lead by @MechanismCap and many other quality VCs","This significant milestone marks a pivotal moment in our journey as we… pic.twitter.com\/3VgGx4ksxC","— Zeus Network ⛈️ (MUSES) (@ZeusNetworkHQ) April 4, 2024","","In April, Solana was the third most traded blockchain network in the NFT ecosystem. However, Solana experienced a dramatic decline in its NFT sales last month.","Data from CryptoSlam showed that the sales volume of Solana-based NFTs in April reached $153.4 million, a 100% decrease from the sales volume in March. The data further revealed that the Solana network attracted around 487k buyers and 251k sellers in March. The number of NFT transactions on Solana in April reached more than 2.1 million. ","One major driver of the user influx was the DogeZuki NFT collection. This collection of 2,800 Shiba Inu-inspired NFT items saw a massive influx of over 28,000 unique buyers within a week, with over 6,200 joining on two days (on April 26 and 27).","Deez Nuts, another collection with 10,000 “nut” characters, also saw significant interest, attracting over 12,800 unique buyers in 48 hours (on April 23 and 24). This trend indicates a shift towards specific projects generating excitement and attracting new users, even if the broader market cools down.","Looking beyond individual NFT projects, established players like STEPN, a Web3 lifestyle app, collaborated with sportswear giant Adidas to bring 1,000 NFTs to the Solana blockchain. The launch is part of a year-long cooperation and the first collection was available on STEPN’s NFT marketplace MOOAR on April 17.","STEPN x adidas: Step into the Future.","We are proud to announce that we are teaming up with @adidas and @altsbyadidas for a long-term collaboration, to revolutionise the lifestyle app ecosystem, and bring global adoption to @fslweb3.","This groundbreaking partnership will contain… pic.twitter.com\/qN2xTNcbD6","— STEPN | Public Beta Phase VI (@Stepnofficial) April 15, 2024","","STEPN also announced a significant airdrop for its users. The company plans to distribute 100 million FSL points, valued at approximately $30 million.","Notable NFT launches in April:","April 2024 was a challenging month for Solana, marked by price volatility and network congestion concerns. However, there were also positive developments, such as continued institutional adoption and growth within the Solana ecosystem. ","For Solana, successfully addressing network congestion and scalability will be crucial for regaining user trust and attracting new projects. Upcoming network upgrades and developer efforts will be closely monitored.","The broader market climate and investor sentiment will significantly influence the price of SOL. Regaining stability and demonstrating progress on network issues will be essential for a price rebound. Moreover, Solana will need to foster a healthy ecosystem that balances innovation with responsible project development, avoiding the pitfalls of meme coin frenzy.","",""],"entity":[{"type":"April 2024","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Zeta Markets","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"98%","content":"PERCENT"},{"type":"April 9, 2024","content":"DATE"},{"type":"$4.58","content":"MONEY"},{"type":"$1.9 billion","content":"MONEY"},{"type":"HelloMoon","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"$58.35 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$0.00002924","content":"MONEY"},{"type":"April 21, 2024","content":"DATE"},{"type":"Drift Foundation","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$1.74 billion","content":"MONEY"},{"type":"$4B","content":"MONEY"},{"type":"Tioga Capital","content":"ORGANIZATION"},{"type":"$Z","content":"MONEY"},{"type":"April 8","content":"DATE"},{"type":"April 9","content":"DATE"},{"type":"$26.7 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$130","content":"MONEY"},{"type":"$30 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Solana memecoin Bonk (BONK","content":"PERSON"},{"type":"$0.00001346","content":"MONEY"},{"type":"April 15, 2024","content":"DATE"},{"type":"SOL","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"April 4, 2024","content":"DATE"},{"type":"April 23","content":"DATE"},{"type":"$153.4 million","content":"MONEY"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"$2.14","content":"MONEY"},{"type":"$328 trillion","content":"MONEY"},{"type":"April 26","content":"DATE"},{"type":"Solana","content":"ORGANIZATION"},{"type":"April 25","content":"DATE"},{"type":"April 28","content":"DATE"},{"type":"Zeus Network","content":"ORGANIZATION"},{"type":"Austin Federa","content":"ORGANIZATION"},{"type":"$123","content":"MONEY"},{"type":"Unstoppable Finance","content":"ORGANIZATION"},{"type":"DogeZuki NFT","content":"ORGANIZATION"},{"type":"$3,8 billion","content":"MONEY"},{"type":"87%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"April 5, 2024","content":"DATE"},{"type":"$560 million","content":"MONEY"},{"type":"$193","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$691,7 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"$185.6 million","content":"MONEY"},{"type":"August 2023","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"Adidas","content":"ORGANIZATION"},{"type":"114%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"$100","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$26.7","content":"MONEY"},{"type":"April 13","content":"DATE"},{"type":"April 16, 2024","content":"DATE"},{"type":"April 12","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"March 31","content":"DATE"},{"type":"March","content":"DATE"},{"type":"April 14","content":"DATE"},{"type":"April 17","content":"DATE"},{"type":"$4.6 million","content":"MONEY"},{"type":"April 16","content":"DATE"},{"type":"$0.00002171","content":"MONEY"},{"type":"WIF","content":"ORGANIZATION"},{"type":"$61 billion","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"Solana DEX","content":"ORGANIZATION"},{"type":"$91 billion","content":"MONEY"},{"type":"March 29","content":"DATE"},{"type":"56%","content":"PERCENT"},{"type":"March 20","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"$0.00002462","content":"MONEY"},{"type":"$159","content":"MONEY"},{"type":"218%","content":"PERCENT"},{"type":"$30 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$2.45","content":"MONEY"},{"type":"April 23, 2024","content":"DATE"},{"type":"$600 billion","content":"MONEY"}],"hashtag":["SOL","Solana","Solana Ecosystem"],"authors":["Veronika Rinecker","Hristina Yordanova"]}