{"summary":"Morpho Labs unveiled a white paper for Morpho Blue, a new lending protocol aimed at enhancing efficiency and reducing gas costs.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255639\/morpho-blue-seeks-to-upend-decentralized-lending-by-removing-dao-bottlenecks","publishDate":"2023-10-10T10:02:25","id":2134,"type":null,"title":"Morpho Blue seeks to upend decentralized lending by removing &#x27;DAO bottlenecks&#x27;","category":["Companies"],"content":["Morpho Labs, a decentralized lending project backed by Variant and a16z, released a white paper for a new protocol it hopes will provide crypto's nascent decentralized lending market with a more robust and efficient underpinning, according to a release shared with The Block.&nbsp;","Morpho, which <a href=\"https:\/\/www.coindesk.com\/business\/2022\/07\/12\/a16z-variant-lead-18m-round-for-lending-protocol-morpho-labs\/\" data-v-f87c67ca=\"\">announced<\/a> an $18 million raise in May 2022, has flown under the radar relative to lending protocols like Compound and Aave, with its founder Paul Frambot admitting the project has not focused enough on marketing in the U.S. market. Originally launched as a layer on top of lending protocols to match borrowers and lenders in a peer-to-peer fashion at lower rates, the new protocol, Morpho Blue, represents a pivot to a base layer.&nbsp;","At its core, Morpho Blue aims to reinvent the way in which decentralized lending is structured, stripping out the reliance on DAO participants to manage the parameters around which assets are handled and introduces a more simple alternative based on what it describes as permission-less risk management.&nbsp;","\"DAOs are also not best suited for operational scaling and they can often become a bottle neck as the protocol grows,\" the white paper notes. \"What we will present is in line with the vision that DeFi should be organized into layers around trustless and open protocols like the Internet.\"","To achieve this goal, Morpho Blue adopts a strategy of isolating markets through individual asset vaults, which operate autonomously without the need for manual intervention by the DAO to adjust risk parameters. This approach empowers lenders to provide capital to borrowers at higher levels while still maintaining lower overall risk compared to multi-asset pools since they only have to worry about the risk of one asset. As for pesky gas fees, Morpho Blue's aspired simplicity reduces gas consumption by 60% compared to alternative lending protocol, the project claims in marketing materials.&nbsp;","Morpho Blue addresses the challenge of fragmented assets by allowing for additional layers to enhance the core functionality of the base layer, in contrast to the one-size-fits-all approach employed by other lending protocols.","\"Morpho Blue externalizes risk management by making it a separate layer of the stack with unlimited permutations, versus the one-size-fits-all approach we see from today's lending services,\" Frambot said in an email to The Block. \"Therefore, institutional players can integrate it into their own risk and compliance management systems. On their end, crypto risk managers could even rebuild the classic lending pool abstractions such as Aave, Compound, Spark, or Flux, but on top of a common trustless, efficient, and flexible primitive.\"","Frambot said that conversations with several institutional players indicate that the DAO-model is a non-starter for them to enter the decentralized lending space and that it is \"clear they don't want their funds to be managed on their behalf and have specific compliance requirements.\"","Morpho Blue externalizes risk management and allows institutions to integrate it into their own risk and compliance management systems.","Relative to the go-go days of 2022, decentralized lending activity has been modest with Compound's total value locked standing at just about $1.6 billion, compared to over $20 billion at its peak.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/cryptocurrency-lending\/ethereum-lending-tvl\/embed\" title=\"Ethereum Lending TVL\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Aave outstanding debt has declined from a peak above $8 billion to over $2.2 billion earlier this month.&nbsp;"],"hashtag":[]}