{"summary":"Vite Aims To Become a Universal Dapp Platform","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/vite-aims-to-become-a-universal-dapp-platform-2350.htm","publishDate":"2018-08-02T11:15:00","id":21353,"type":null,"title":"Vite Aims To Become a Universal Dapp Platform","category":["ICO news "],"content":["In our Quick reviews series we introduce interesting initial coin offering projects that might inspire you to do your own research and decide whether an idea and its development is worth your investment. It’s not an endorsement.","","Today we are looking at Vite.","What problem(s) does it target?\nVite aims to become a universal dapp (decentralized app) platform that can support a set of smart contracts.\nAs a platform for industrial applications, it targets four major problems existing platforms are currently facing: throughput, latency, scalability and security.","Who the team members are?\nVite’s core team and advisors comprises of seven people, with “strong connections” to Microsoft, Google, Goldman Sachs, Huobi and JD.com. The team is made of mostly entrepreneurs, businessmen and investors. No developers mentioned in the core team.","At what stage the project is?\nIn June this year, the team started working on Vite Core’s research and development, a phase in the project that is planned for the next two months. The whitepaper was published in April, while the official website was released a month later, in May.","What the main future milestones in their roadmap are?\nVite Core alpha is planned for October 2018, blockchain browser for December 2018, and the desktop client for January 2019. Other notable milestones include the launch of the Vite Testnet in November 2019, and the release of Vite 1.0 in January 2020.","Fundraising status:\nThe team has raised a total of 28 million USD at the time of writing, with the token sale ending in mid-August.","Most important partnerships?\nThere is a long list of partners and investors on the Vite website. A few notable names include Bitmain, Node Capital, Genesis, Byzantine Partners and BN Capital.","How large their community is?\nIts Twitter following counts 8,300 people. Also, it has a total of seven Telegram channels, including the announcement channel, English channel, Russian, Chinese, Vietnamese, Korean and Thai. In total, these channels count more than 160,000 people. Its Chinese channel is the single largest one, with 98,000 people.","What other similar projects are?\nChainZilla, Kirik"],"entity":[{"type":"Node Capital","content":"ORGANIZATION"},{"type":"January 2020","content":"DATE"},{"type":"November 2019","content":"DATE"},{"type":"May","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"June this year","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"December 2018","content":"DATE"},{"type":"BN Capital","content":"ORGANIZATION"},{"type":"Byzantine Partners","content":"ORGANIZATION"},{"type":"Kirik","content":"LOCATION"},{"type":"Vite","content":"ORGANIZATION"},{"type":"January 2019","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"mid-August","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Huobi","content":"PERSON"}],"hashtag":["Bitmain","Blockchain","Dapp","Scalability","Security","Smart Contract"],"authors":["Sead Fadilpašić"]}