{"summary":"FOAM Thinks Our Maps Could Use an Upgrade","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/foam-thinks-our-maps-could-use-an-upgrade-2367.htm","publishDate":"2018-08-09T08:56:00","id":21358,"type":null,"title":"FOAM Thinks Our Maps Could Use an Upgrade","category":["ICO news "],"content":["In our Quick reviews series we introduce interesting initial coin offering projects that might inspire you to do your own research and decide whether an idea and its development is worth your investment. It’s not an endorsement.","Today we are looking at the FOAM Protocol.","What problem(s) does it target?\nThe team behind the FOAM Protocol is looking at the mapping services available today, and the deficiencies they have. It describes itself as a “consensus-driven map and open protocol for decentralized geospatial data markets.”\nIn other words, it’s a map, with a few extra kinks provided by the underlying Ethereum blockchain.\nThe main problems the protocol targets, include the censorship and centralization of location service providers; problems with accuracy and privacy, as well as location encoding standards. It aims to solve these problems with its own solutions, which include Crypto-Spatial Coordinates, the Spatial Index and Visualizer, and Proof of Location.","Who the team members are?\nThe core team counts a dozen people, with another six being collaborators. The core team includes professionals from architecture and urban planning, developers and engineers from BlockApps, a platform for enterprise-grade blockchain applications. Worth specific mention is Jens Krause, functional programmer and ex Cardano SL developer, and Matt Liston, co-founder of Augur (special advisor at FOAM).","At what stage the project is?\nThe project itself is in beta, which is already available for curious eyes over on this link. FOAM token sale is active at the time of writing.","What the main future milestones in their roadmap are?\nThe roadmap is yet to be published. The whitepaper is mostly technical, without detailing on the exact steps needed to reach a complete product.","Fundraising status:\nToken sale just launched, at the time of writing. The fundraising goal is 24 million USD, with 30% tokens available on sale. Soft cap is 15 million. Another quarter of the token supply is left for advisors, partners, employees, founders and a reserve for grants and a foundation. Another quarter will be left for compensatory purposes, and 10% will be allocated for future developer grants. Another 35% will be set aside for mining rewards.","Most important partnerships?\nThe project is backed by Consensys and Navel, to name a few. Partners include Trusted Aliance, Enterprise Ethereum Alliance, uPort and Dether.","How large their community is?\nTheir Telegram channel counts 12,000 members, Twitter 8,000 and Reddit 538 subscribers.","What other similar projects are?\nXYO Project."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"35%","content":"PERCENT"},{"type":"Navel","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Trusted Aliance, Enterprise Ethereum Alliance","content":"ORGANIZATION"},{"type":"Proof of Location","content":"ORGANIZATION"},{"type":"Matt Liston","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"Jens Krause","content":"PERSON"}],"hashtag":["ConsenSys"],"authors":["Sead Fadilpašić"]}