{"summary":"Ethereum Developers Set March 13 as Target Date for Dencun Upgrade","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/ethereum-developers-set-march-13-as-target-date-for-dencun-upgrade.htm","publishDate":"2024-02-08T20:12:59","id":21352,"type":null,"title":"Ethereum Developers Set March 13 as Target Date for Dencun Upgrade","category":["Blockchain News "],"content":["Ethereum developers have set a mainnet launch date for the Dencun upgrade, which will introduce several Ethereum Improvement Proposals (EIPs), including proto-danksharding, which is expected to drive down transaction costs on layer 2.","During a bi-weekly coordinating call on Thursday, Ethereum developers finalized a target date of March 13 for the long-awaited Dencun upgrade, marking a significant milestone in the blockchain’s evolution. This upgrade represents the most substantial changes to Ethereum since April 2023.","Dencun, a combination of the Cancun and Deneb upgrades on Ethereum, encompasses improvements in both the execution and consensus layers. A major component of Dencun is proto-danksharding (EIP-4844), which introduces “blobs” to enable the temporary storage and access of large amounts of off-chain data by Ethereum nodes.","As a result, this innovation aims to alleviate storage demands and significantly reduce transaction costs for Ethereum decentralized applications (dapps), particularly benefiting Layer 2 rollup chains by facilitating more cost-effective and scalable data processing.","The decision to set the upgrade date was made during the all-core developer’s consensus layer call 127, following the successful addition of the upgrade to the Holesky testnet without encountering any issues.","Yesterday, the Dencun upgrade was executed on the Holesky testnet at approximately 6:35 a.m. ET, as confirmed by Ethereum execution client Nethermind, and was swiftly finalized thereafter. This phased approach to implementing the upgrade previously saw Dencun deployed on the Goerli testnet on Jan. 17 and the Sepolia testnet on Jan. 30.","Parithosh Jayanthi, a DevOps engineer at the Ethereum Foundation, expressed enthusiasm, stating, “It’s great to see years’ worth of effort finally being scheduled for the Ethereum mainnet,” via CoinDesk over Telegram.","Blobs are coming to mainnet at slot 8626176 .oO","— timbeiko.eth ☀️ (@TimBeiko) February 8, 2024","","The Dencun upgrade on the main Ethereum network, colloquially referred to as a “hard fork,” is scheduled to occur when the blockchain reaches slot 8626176, precisely at 13:55 UTC on March 13. However, this date is subject to ratification by developers and confirmation via the open-source software platform GitHub.","The Dencun network upgrade was activated on the Goerli testnet on January 17, introducing several EIPs, including EIP-4844, which enables proto-dank sharding, a highly anticipated improvement that developers say will significantly reduce transaction fees on Ethereum layer-2s.","Dencun will introduce a new transaction class called “proto-danksharding,” designed to reduce transaction costs for rollups by introducing data “blobs” for storing data. Additionally, it aims to lower the cost of data available on Ethereum, making projects like Celestia, Avail, and EigenDA more appealing.","The development team conducted three tests to ensure the smooth operation of Dencun on the mainnet, with the recent deployment on the Holesky testnet representing the culmination of these efforts. Proto-danksharding serves as the initial phase of a broader technical feature known as “danksharding,” aimed at scaling the Ethereum blockchain.","The confirmed date for Dencun signifies a delay from the developers’ initial plan, which targeted the end of 2023. Technical challenges pushed the upgrade timeline to early 2024.","Looking ahead, developers are already outlining plans for the next hard fork, Prague\/Electra, which may incorporate “Verkle Trees,” a novel data structure intended to facilitate node storage of large amounts of data without compromising block validation capabilities.","Ethereum’s previous major upgrade, Shapella, occurred in April 2023, enabling users and validators to withdraw their staked ether on the network for the first time. With the impending deployment of Dencun, Ethereum continues to evolve, enhancing its capabilities to meet the growing demands of its user base and decentralized ecosystem."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"February 8, 2024","content":"DATE"},{"type":"Shapella","content":"LOCATION"},{"type":"Jan. 30","content":"DATE"},{"type":"January 17","content":"DATE"},{"type":"Dencun","content":"LOCATION"},{"type":"6:35 a.m. ET","content":"TIME"},{"type":"Verkle Trees","content":"ORGANIZATION"},{"type":"Avail","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"Electra","content":"ORGANIZATION"},{"type":"Cancun","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Proto","content":"PERSON"},{"type":"March 13","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Prague","content":"LOCATION"},{"type":"Jan. 17","content":"DATE"},{"type":"Parithosh Jayanthi","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"Dencun","content":"ORGANIZATION"}],"hashtag":["Dencun","Ethereum","Ethereum 2.0"],"authors":["Hassan Shittu"]}