{"summary":"Bitwise CIO “Incredibly Bullish” On Bitcoin ETFs After Latest SEC Disclosures – Here’s Why","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/bitwise-bitcoin-etf-bullish-sec.htm","publishDate":"2024-05-14T22:08:39","id":21362,"type":null,"title":"Bitwise CIO “Incredibly Bullish” On Bitcoin ETFs After Latest SEC Disclosures – Here’s Why","category":["Bitcoin News "],"content":["A recent influx of investor disclosures has Bitwise, one of the United States’ leading Bitcoin ETF providers, “incredibly bullish” on BTC.","In a recent memo, Bitwise CIO Matt Hougan reviewed some of the newly uncovered Bitcoin ETF buyers, who have revealed their allocations as part of mandatory 13F filings with regulators in recent weeks.","I find the 13F filings for bitcoin ETFs extraordinarily bullish for the long-term future of bitcoin. I wrote about why in my latest CIO Memo: https:\/\/t.co\/8WrNV5SXtj pic.twitter.com\/GJC8PEXZkQ","— Matt Hougan (@Matt_Hougan) May 14, 2024","","A 13F filing is a form required by the Securities and Exchange Commission (SEC) of all investors with $100 million in assets under management, disclosing their entire ownership of publicly traded securities. Thousands of investors have now filed their Q1 2024 reports – the first reporting period during which Bitcoin spot ETFs have been live.","“A lot of professional investors own bitcoin ETFs.” Hougan wrote, taking note of iconic asset managers like Hightower Advisors, which owns $68 million in the new funds. Another includes Bracebridge Capital, a Boston-based hedge fund holding a much larger $434 million in Bitcoin.","Based on all filings submitted by May 9, a total of 563 professional investment firms were identified as having bought the ETFs, with allocations worth $3.5 billion in total. That doesn’t include those filing between then and May 15, such as the State of Wisconsin Investment Board (SWIB), which reported a $162 million allocation to Bitcoin on Tuesday.","According to Hougan, it’s very uncommon for ETFs to attract so many 13F filers in their first few months live. “From a breadth of ownership perspective, the bitcoin ETFs are a historic success,” he wrote.","But that doesn’t mean Bitcoin ETF buyers have dried up already. Based on the data, it seems the vast majority of buyers until now have been retail-based, with professional investors only starting to dip their toes in.","“Most professional investors take 6-12 months to evaluate crypto,” Hougan said, noting that allocations to crypto after one client meeting are “extremely rare.”","Next, those investors usually make personal allocations to test the water, before making isolated allocations on behalf of their more pro-crypto clients later on.","Finally, after about 6 months, those firms will start making “platform-wide allocations” with their whole client book, comprising 1% to 5% of their entire portfolio. For context, current allocations made by investors like HighTower comprise just 0.05% of their portfolios.","“A 1% allocation of their portfolio to bitcoin would equate to $1.2 billion—all from a single firm,” Hougan wrote. “Multiply that by the growing number of professional investors participating in the space, and you can begin to see what’s behind my enthusiasm.”",""],"entity":[{"type":"Bitwise","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$434 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Hightower Advisors","content":"ORGANIZATION"},{"type":"$162 million","content":"MONEY"},{"type":"HighTower","content":"PERSON"},{"type":"$68 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"0.05%","content":"PERCENT"},{"type":"$3.5 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"May 14, 2024","content":"DATE"},{"type":"May 15","content":"DATE"},{"type":"Matt Hougan","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"Bracebridge Capital","content":"ORGANIZATION"},{"type":"12 months","content":"DATE"},{"type":"State of Wisconsin Investment Board","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"May 9","content":"DATE"},{"type":"Hougan","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Hougan","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin ETF","Bitwise"],"authors":["Andrew Throuvalas"]}