{"summary":"SWIFT China President Wen Yang on Overcoming Barriers in CBDC Systems","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/swift-china-president-on-overcoming-barriers-in-cbdc-systems.htm","publishDate":"2024-05-17T07:37:11","id":21365,"type":null,"title":"SWIFT China President Wen Yang on Overcoming Barriers in CBDC Systems","category":["Blockchain News "],"content":["The Society for Worldwide Interbank Financial Telecommunication (SWIFT) China President recently shared insights on the challenges and solutions for cross-border central bank digital currency (CBDC) interoperability.","In an interview with 21st Century Business Herald, Wen Yang addressed the fragmentation in CBDC systems due to varying technological paths and standards among different economies, highlighting the organization’s effort to bridge technical gaps.","According to the report, over 130 economies are now exploring CBDCs, with nearly 70% of central banks expecting to issue them within the next decade. However, the rapid development could lead to potential “data silos” where systems are unable to communicate with one another.","“Currently, there are significant differences in the technological paths and standards, including protocols, among economies, which presents a ‘fragmentation’ challenge and leads to ‘data silos’,” said Yang.","“To date, 11 countries have fully launched their CBDCs, while others are in later stages of development,” said Yang.","China’s digital yuan has seen implementation across various applications, while the European Central Bank is in the process of preparing for a digital Euro. In India, commercial banks handle one million digital rupee transactions daily across the country.","Swift launched the second phase of its CBDC sandbox in July 2023, focusing on complex use cases in digital trade, digital assets, and foreign exchange networks for CBDC payments and settlements.","“The project lasted six months and involved 38 financial institutions from around the world, including regulators, commercial banks, and market infrastructures, involving applications of seven different CBDCs,” said Yang.","Yang also emphasized the importance of interoperability in cross-border CBDC use. The sandbox results reaffirmed SWIFT’s proposal to simplify digital transactions while allowing financial institutions to continue utilizing their existing infrastructures.","“Tests on the interaction between digital trade platforms and CBDC networks using Distributed Ledger Technology (DLT) and smart contracts have proven technically feasible for automating trade payments,” stated Yang.","He indicated that Swift plans to expand its CBDC connector solution to test more extensive use cases in a comprehensive environment. This would include enhancing support for on-chain forex settlements and cross-border payments, addressing growing market demands."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"Wen Yang","content":"PERSON"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Society for Worldwide Interbank Financial Telecommunication","content":"ORGANIZATION"},{"type":"21st Century Business Herald","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"July 2023","content":"DATE"}],"hashtag":["CBDC","SWIFT"],"authors":["Hongji Feng"]}