{"summary":"Solving ICO Problems With – New Token Projects!","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/solving-ico-problems-with-new-token-projects-2310.htm","publishDate":"2018-07-24T14:13:00","id":21369,"type":null,"title":"Solving ICO Problems With – New Token Projects!","category":["ICO news "],"content":["Initial coin offerings (ICOs) have two big problems: 1) many of them are fake, designed only to scam naive investors out of their hard-earned money; and 2) many of them are unsuccessful.","So what can you do to fix the issue? You set up another token project, of course! There are at least two projects that are currently tackling the abovementioned problems. The problem of fake and crooked ICOs is being tackled, among others, by TruStory, a startup that is “trying to design a world where the token only has value if it is necessary, and because it’s necessary it has value.”","Right off the bat, it had to explain that it in fact is not an ICO and there is no token sale of any kind (but the project will have its own token). The community was quick to question the usefulness of such a project, with some saying it was a “useless project to spot useless tokens has its own useless token,” while others were disputing the founder’s (Preethi Kasireddy) expertise, saying “Founder was working in Mercury Protocol which is complete vaporware.” Previously, Kasireddy was a banking analyst with the investment bank Goldman Sachs, worked at Andreessen Horowitz, the Silicon Valley investment powerhouse, and Coinbase, the US-based crypto exchange and wallet service, according to TechCrunch.","Still, the problem that this startup is trying to solve is real and it did already raise USD 3 million (Pantera Capital, Kindred Ventures, Coinbase Ventures, and others were among investors) to identify ICO scams more successfully.","The company is currently looking to test its solutions in the real world. Luckily for them (and unluckily for most of the crypto world), they’ll have plenty of examples to choose from.","But that’s just half of the problem. What about unsuccessful, dead ICOs? Dead coins have no value, right?","Well, according to the folks at CoinJanitor, false. Dead coins and failed ICOs do have value locked inside them, and they believe they can ‘unlock’ that value. Besides unlocking the value, CoinJanitor also looks to bring in all the communities of different dead coins under one roof, bringing experience, expertise and partnerships together.","And finally, it says that the crypto market will benefit from such a project, as ‘unlocked’ value from dead coins can be returned to the ecosystem for a significant boost.","“The network effect created through the amalgamation of dead coin communities is the cornerstone of our value proposition. As we integrate more dead or failed coin communities under the CoinJanitor umbrella, that network effect should grow, compounding the value of our token,” the startup explained.","Some in the community looks at this project favorably, saying things like “we need a garbage bin for all the scam\/dead crypto projects”, or that it’s simply a “great idea”. While others wonder “How should this work at all?”","ICOs are a new and exciting way of starting up a business, which comes with its own set of advantages and challenges. The abovementioned problems currently perceived as the biggest among the challenges, so let’s see how they get tackled."],"entity":[{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"TruStory","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Kindred Ventures","content":"ORGANIZATION"},{"type":"Mercury Protocol","content":"ORGANIZATION"},{"type":"Kasireddy","content":"PERSON"},{"type":"Silicon Valley","content":"ORGANIZATION"}],"hashtag":["ICO","Scam"],"authors":["Sead Fadilpašić"]}