{"summary":"Mexico-based crypto exchange Bitso made additional cuts to its staff. \nBrazilian crypto publication Portal do Bitcoin first reported the layoffs, which several affected employees disclosed on LinkedIn. ","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190758\/bitso-cuts-more-staff-in-fresh-round-of-layoffs","publishDate":"2022-11-29T18:13:42","id":2136,"type":null,"title":"Bitso cuts more staff in fresh round of layoffs","category":["Exchanges"],"content":["Mexico-based crypto exchange Bitso has let go of an unspecified number of workers in a fresh round of layoffs, about six months after cutting about 80 employees.","Bitso declined to specify the number of affected employees and in which countries it was cutting teams. One of the staff members cut, Bruno Cavalieri, formerly a growth content writer for the firm, said on LinkedIn he was among \"<a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:7003413975207948289\/?updateEntityUrn=urn%3Ali%3Afs_feedUpdate%3A%28V2%2Curn%3Ali%3Aactivity%3A7003413975207948289%29\" data-v-f87c67ca=\"\">dozens<\/a>\" cut.","Brazilian crypto publication Portal do Bitcoin <a href=\"https:\/\/portaldobitcoin.uol.com.br\/corretora-de-criptomoedas-bitso-faz-segunda-rodada-de-demissoes-no-brasil-e-no-mexico\/\" data-v-f87c67ca=\"\">first reported<\/a> the Bitso layoffs, saying about 100 people were let go in Mexico and Brazil, citing information from former employees. The firm may have had between 500 and 600 employees, Portal do Bitcoin reported.","Posts from laid-off Bitso <a href=\"https:\/\/www.linkedin.com\/search\/results\/all\/?heroEntityKey=urn%3Ali%3Aorganization%3A3635123&amp;keywords=bitso&amp;origin=RICH_QUERY_SUGGESTION&amp;position=0&amp;searchId=06f87161-5213-41a9-915e-23a6702e4f35&amp;sid=Eas\" data-v-f87c67ca=\"\">employees<\/a> on LinkedIn confirm that the crypto exchange let go of several workers, with some using the hashtag #bitsolayoff. Roles of some affected employees include product designer, business intelligence analyst, process improvement agent, scrum master and customer support analyst.","Bitso and its Latin America-based peers have made sizable cuts this year in light of the crypto market downturn. Bitso <a href=\"https:\/\/www.theblock.co\/linked\/149092\/crypto-exchange-bitso-lays-off-80-employees-coindesk-reports\" data-v-f87c67ca=\"\">laid off<\/a> 80 employees in May, and Mercado Bitcoin parent 2TM laid off <a href=\"https:\/\/www.theblock.co\/post\/167677\/mercado-bitcoin-parent-2tm-lays-off-more-staff-calls-for-regulation\" data-v-f87c67ca=\"\">close to<\/a> 100 people in September after <a href=\"https:\/\/www.theblock.co\/linked\/150054\/brazilian-crypto-company-2tm-cuts-more-than-80-employees\" data-v-f87c67ca=\"\">letting go<\/a> of more than 80 in June. The Argentina-based crypto exchange Buenbit also told The Block in May that it cut staff from 215 to 115 employees.","Lemon Cash CEO Marcelo Cavazzoli told The Block on Nov. 24 that he <a href=\"https:\/\/www.theblock.co\/post\/189848\/lemon-cash-ceo-expects-more-fintech-layoffs-in-latam-amid-its-own-exclusive\" data-v-f87c67ca=\"\">expected<\/a> more fintech layoffs in the Latin America region, following news that his Argentina-based crypto app company had laid off about 100 people — 38% of its staff.&nbsp;","\"We evaluate our business priorities on a regular basis, and make structural adjustments accordingly,\" Bitso said in a statement to The Block. \"We work in a fast-paced industry that requires us to constantly remix our high-value skills, so we can move even faster to where our clients need us to be, taking into consideration the long-term interest of our business, the market and the industry.\"","Bitso counts more than 6 million users in Argentina, Brazil, Mexico and Colombia. It announced on Nov. 28 that it now has more than 1,500 institutional clients using its B2B services. The company also said it is planning to release a <a href=\"https:\/\/blog.bitso.com\/bitso\/the-proof-that-matters\" data-v-f87c67ca=\"\">solvency report<\/a> next month, in line with other crypto firms like <a href=\"https:\/\/www.theblock.co\/post\/189946\/binance-releases-proof-of-reserves-system-starting-with-bitcoin\" data-v-f87c67ca=\"\">Binance<\/a> looking to quell concerns following the collapse of crypto exchange FTX.&nbsp;","\"Bitso will continue to invest in developing new products to fulfill its mission of making crypto useful, and making sure the company retains its leadership and strength in the region,\" the firm said."],"hashtag":[]}