{"summary":"Author Zachary Small details the behind-the-scenes events that brought the digital artist and Christie's auction house together in the first chapter of their book.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/24\/the-untold-story-behind-beeples-historic-nft-sale-token-supremacy-excerpt\/","publishDate":"2024-05-24T20:48:45","id":21375,"type":null,"title":"The Untold Story Behind Beeple's Historic NFT Sale: 'Token Supremacy' Excerpt","category":["Consensus Magazine"],"content":["Mike Winkelmann sank into the sofa as three cameras recorded his meltdown. The dueling identities that had once structured his life were coming into conflict as his fortunes increased by the second. Unseen crypto billionaires were bidding for his soul, or at least it felt that way. His entire artistic career was being auctioned as a compilation of five thousand digital artworks, packaged by the Christie’s auctioneers as a single non-fungible token (NFT). The winner would receive this NFT as an online certificate of ownership, a deed to 14 years inside Winkelmann’s mind. It was surreal watching his own coronation from the couch. The new crypto king was slack jawed as his net worth continued to rise by the millions on the computer screen, reckoning with the transformation of his art into an ultimate use-case for blockchain technology, bringing the metaverse into the mainstream. Two documentary crews captured his euphoric stupor, memorializing the tight choreography of this historic moment.","Zachary Small, a New York Times reporter writing about the art world's relationship to money, politics and technology, is the author of \"Token Supremacy: THE ART OF FINANCE, THE FINANCE OF ART, AND THE GREAT CRYPTO CRASH OF 2022,\" published by Penguin Random House.","The artist had become a multimillionaire at that moment. It was too much to bear, and suddenly he was bolting for the out door patio, away from the living room, where his family had gathered to celebrate his success. Winkelmann needed some air.","Once upon a time, the promise of a divided life held some appeal. Mike owned a lucrative business turning digital graphics and animations into branded visuals for clients like Louis Vuitton, Apple and Justin Bieber. The money he earned from those productions allowed him to live in the McMansion suburbs outside of Charleston, South Carolina. He fit comfortably there into the patterns of home, work, and hobby. He was popular with the neighbors, a plucky midwestern transplant with a wide smile, a sailor’s mouth, and a heart of gold. He would sometimes rant about politics, but otherwise focused on family, sitting pretty in a large home overlooking the palmetto trees. Mike understood the value of compartmentalization, because his parents taught him midwestern manners and the importance of staying reserved in the middle-class Wisconsin village where he was born. So he kept his more libidinal thoughts inside a computer running so hot that it needed to be stored in the bathroom on a wood platform over the tub, near a jury-rigged industrial A\/C unit that vented its heat into the attic.","The computer expended its vast amounts of energy trying to contain Beeple, the internet crap monster responsible for Winkelmann’s cult online following. He adopted the name in 2003, after a 1980s toy that looked like the abandoned love child of Sasquatch and Chewbacca, with light sensors that triggered its blinking nose and squeaky voice whenever its eyes were covered by a hand. Winkelmann had just graduated with a computer-science degree from Purdue University in Indiana, but he found programming “boring as sh*t.” The 22-year-old was more interested in shooting narrative short films through a webcam than working for a software company. The Beeple toy came to symbolize his fascination with the interplay of light and sound.","In 2007, Beeple started a project that would eventually make him famous. The \"Everydays\" series began as a daily drawing habit of crude little doodles that seemed to betray his more corporate, Bill Gates appearance. The drawings were the crass products of a mind feeding on internet bile (racist caricatures, nude women, penis jokes, political satire) and tutored by magical realism (family portraits, animal studies, Jesus smoking cigarettes, Hillary Clinton wearing gold teeth). A year later, Beeple switched to Cinema4D, an animation software that allowed him to manipulate three-dimensional space. For the kid who spent hours at Toys “R” Us playing a demo of Super Mario 64 on the new Nintendo console, it was a dream come true to create realistic worlds on a computer. But it wasn’t until around 2011 that he started fully utilizing the program to experiment with bright colors and blurry shapes with names like Synthetic Bubblegum Tittufux. Around the same time, Beeple started releasing music videos made with Cinema4D as free source material for creative professionals; the artist understood how popular his creations had become only when, on a family vacation to Hong Kong, he saw one of his works projected outside a Hard Rock Cafe.","A recognizable style finally emerged in 2017, when Beeple fully articulated his fascination with tech dystopias. Importing digital assets from other websites allowed him to createmore detailed scenes in only a couple hours. His imagination exploded with skyscrapers stacked atop cargo containers, Santa Claus clones brawling to the death, and cultists worshipping an original Macintosh computer. Celebrity sightings abound in these nihilistic tales of the future: Donald Trump’s head opens to reveal a burger brain; Mickey Mouse holds a machine gun; and Buzz Lightyear lactates in the park.","See also: Beeple Sold Out. So What?","All that chaos was contained in Winkelmann’s computer, sitting on a desk with its cables running into the bathroom hotbox. His home office was largely undecorated, with beige carpeting, Walmart bookshelves, and two 65-inch screen televisions that played CNN and Fox News on mute throughout the day. He was neither the first artist to adopt lowbrow culture (Marcel Duchamp beat him there by nearly a century when he exhibited a signed urinal in 1917) nor the first to immerse himself in mass media (Andy Warhol and his silkscreens of Marilyn Monroe might like a word). What made Beeple special was his evangelism for digital art, his embodiment of the internet’s tendency toward dark absurdism, and his eagerness to build an economy around it. He had already cultivated a network of nearly two million followers on Instagram, and artist friends were repeatedly bugging him to start releasing NFTs. Why not try something new?","Beeple had everything to gain and nothing to lose. In late October 2020, days before the presidential election, he released three artworks on the NFT marketplace Nifty Gateway. One piece was called \"Politics Is Bullshit,\" featuring a diarrheic bull tattooed with an American flag with a Twitter bird perched upon its neck. The initial offer for this edition of 100 images was just $1.00 each.","“If you need extra convincing from some BS artist’s notes wether you want to spend a dollar on this i will punch you in the god damn face,” Beeple wrote about the offering in the lowercase, typo-ridden idiom of internetspeak. “Smash the buy button ya jabroni.”","Poof. All gone. Sold. The two other NFTs offered, including one from a video series called Crossroads, went for $66,666.66 each. Even with such a devilish price – decided upon with the whimsy of a speculative market willing to spend whatever – Winkelmann could identify his salvation in the metaverse. The most he had ever made from his artworks was $100 for a small print. Now the artist saw a potential avenue for financializing his digital art, one that built upon the lucrative market for online collectibles that companies like Dapper Labs and Larva Labs had started in 2017 with the release of CryptoKitty and CryptoPunk NFTs. Executives behind those products had predicted that digital art would find online buyers, and within the two-month period from November to January 2018, CryptoKitties made $52 million. Mack Flavelle, a founder of the CryptoKitties project, pointed out why: “There’s not that much that people can do with cryptocurrency,” he told the New York Times reporter Scott Reyburn at the time. “We gave them something fun and useful to do with their Ethereum.”","Winkelmann’s success seemed to fulfill the prophecy that individual artists would benefit from the cryptoeconomy. But the business developers behind crypto companies were looking for the kind of legitimization that no amount of advertising could attain, and collectibles by themselves felt like little more than a bubble. They wanted the approval of legacy companies.","They wanted permanence. They wanted cultural capital.","In 2017, Christie’s made a Renaissance painting the marquee lot in their November sale of postwar and contemporary art. The anachronism was supposed to convey the immediacy of the artwork’s appeal, even if art historians were more skeptical about its authenticity; nevertheless, the auction house described Salvator Mundi as a genuine Leonardo da Vinci painting, and it sold for a record $450.3 million to Saudi crown prince Mohammed bin Salman. The price overtook the previous benchmark, set by a Picasso painting in 2015, by almost triple. Gasps from the salesroom confirmed the event as peak spectacle, made even more ridiculous in the coming years, as Salvator Mundi remained locked inside the crown prince’s yacht; he refused to exhibit the painting publicly, allegedly because he feared that museums might downgrade the work as belonging to a Leonardo assistant instead of the master himself.","Restructuring continued in 2020, as Christie’s announced that it would merge its impressionist and modern and contemporary art departments into one office. “Our clients don’t think in categories anymore,” Guillaume Cerutti, chief executive at the auction house, told reporters at the time.","The decision came at a time when impressionist and modern sales were performing far below their postwar and contemporary competitors. Combining the departments would dump collectors into one pool, changing the dynamics of the market and pushing tastes toward the present. It suddenly seemed that the most expensive artworks had paint dripping off the canvas; the artists were oftentimes women and people of color, and they were in their 30s and 40s – shocking for an industry that had exclusively prized dead white men for the majority of its existence. Sales of art sold within three years of its creation date grew 1,000% over the past decade to almost $260 million.","Ironically, the arrival of the ultra-contemporary market occurred around the same time that Christie’s announced that its top lot for the \"20th Century Evening Sale\" in October 2020 would be the remains of a Tyrannosaurus rex, nicknamed Stan, which ended up selling for $31.8 million, the most ever paid for a fossil at the time.","Many employees were bitter about the changes; they rolled their eyes at the little anachronisms that had become headliners. It was a successful marketing gimmick by the bigwigs to grab attention in a moment when the pandemic economy seemed on the verge of daily collapse. Those who joined the auction house to nerd out on art history hated this new approach, but others, with a sense for business, thrived in the controlled chaos.","See also: Robert Alice Made NFT History, Now He's Writing About It","“I have always felt like I am living in the theater of the absurd,” Davis later confided in me. He relished the ridiculous nature of his industry. The auction world was a system of meaningless sales records, an illusion of competition that often boiled down to a handful of rich men who all knew one another competing over the bragging rights of ownership. Connoisseurship was dead. Provenance was a mirage. Dinosaur bones were being sold next to Rothko and Picasso paintings.","“All I know is that I know nothing,” Davis said, adding that the motto was actually a paraphrase of something Socrates once said and a lyric from a song called “Knowledge” by the California punk band Operation Ivy.","So, when the salesman considered all the strange circumstances surrounding him, auctioning an NFT sounded perfectly reasonable. “It will be fun and a little weird,” he predicted. The auction was less than two months away, and everyone supporting the NFT sale had something to prove. Meghan Doyle, a researcher, and Ryoma Ito, the chief marketing officer, started working around the clock, feeling pressure to create the perfect auction. But the most important detail was still missing: what was Beeple going to make? The artist had originally suggested one of his \"Everydays\" to commemorate 14 years of working on the project.","“Cool, but maybe not as epic as it should be,” Doyle said, declining the proposal.","Winkelmann returned with a new idea. “I had hit this perfect milestone in this massive project,” he remembered. “And I had just happened to hit 5,000 days of making art.” Instead of offering a single work, he decided to combine everything he had created over the last fourteen years into a single composite, sold as an NFT.","“He came back to us with a magnum opus,” Doyle said. “With that image in hand, we were able to rally the support that we needed to develop content around the piece and get advertisements in the newspaper. We had a complete story, a complete picture.”","However, Ito found the level of involvement from Christie’s marketing department lacking. Understanding the stakes of this auction for his company, he started trying to make his own luck through outreach with private collectors – “whales,” as they are called in the crypto community. Vignesh Sundaresan was one of the first names on his list.","In January, Sundaresan could be found on the virtual disco floor with a champagne glass floating about the head of his digital avatar. He was partying hard in the metaverse to celebrate his $2.2-million purchase of twenty Beeple NFTs and the opening of a gallery that he had commissioned Web architects to build in the online world of Origin City. Back then, he was operating under a mysterious persona named MetaKovan, which translates from his native Tamil language into “King of Meta.”","Sundaresan was a serial entrepreneur in the crypto industry; he had gained his affinity for decentralized finance after a childhood in the Indian city of Chennai, where he dreamed of becoming the next Steve Jobs. He was born there in 1988, and came of age alongside the World Wide Web, which had been released the following year. Then there were a series of false starts, including the creation of “Bitcoin ATMs,” which enabled users to deposit physical cash and receive crypto, and a trading platform called Lendroid, which blew through its $48 million in funding within two years.","In 2019, Sundaresan started investing heavily in digital properties, buying a digital representation of a diamond-studded Formula One car for an online racing game, NFT artworks and hundreds of acres in the digital real-estate market. A year later, he started using the name MetaKovan, which he describes as his “exosuit” created for “building the metaverse.”","At the virtual party in January, Sundaresan, now 33, unveiled a fund called Metapurse for investing in NFTs. The 20 Beeple artworks that he had purchased were bundled into a single asset called B.20, which was then fractionalized into ten million tokens. Buyers of the tokens were told that this would denote ownership over the metaverse’s first large-scale public art project.","“We were inspired by the idea of not only being able to own historic artwork, like the Mona Lisa, but also being able to own the museum it was displayed in, and then sharing that ownership and experience with the public,” the company said in its newsletter. “Making money with art is fairly simple and not very imaginative. What we want to do is to decentralize and democratize art.”","Ito had been watching Sundaresan for a while; he understood how the crypto millionaire operated and that he had an affinity for the guttural sci-fi fantasies that Beeple was selling. More important, MetaKovan wanted to leverage NFTs as a financial instrument. He was exactly the kind of person who might want to send a message about the power of digital art by spending millions on an image.","Gradually, Sundaresan was coaxed into the process. He had some initial worries about going through the Christie’s “know your customer” process, an anti-money-laundering rule that ensures that companies keep records on the essential facts of their buyers and sellers. He expressed his reservations to Ito, fearing that he would be unmasked as MetaKovan because of the digital identity trail. But, eventually, he came to accept that this was a risk involved in doing business with an established auction house, even if the majority of bidders remain anonymous to the public unless they choose to reveal themselves. He was joined by his cofounder at Metapurse – another Indian crypto investor, Anand Venkateswaran – who played more of a backseat advisory role in the acquisition process.","The marketing juggernaut at Christie’s, which had initially been slow to support the sale, finally kicked into action. Winkelmann’s NFT idea had been rebranded into an event with its own subtitle, like an Avengers movie – \"Everydays: The First 5000 Days.\" Doyle was receiving increasing numbers of emails from crypto collectors expressing their interest in placing a bid. The artwork had been published without a price range; instead, the auction house chose to write “estimate unknown,” a cheeky nod to the usual “inquire for estimate” phrase implying that anyone needing to ask was too poor to buy.","“Estimate unknown.” That was the truth. Winkelmann had prepared himself for the NFT to sell for somewhere near $1 million. Ito had the same gut feeling. It wasn’t until a few days before the sale, as reporters started asking if they were prepared to sell for tens of millions, that the team realized something profound was about to happen.","“Noah looked at me and said, ‘We are about to throw a grenade on the art world,’ ” Winkelmann recalled.","Compliance officers and executives at Christie’s were still debating the financial terms of the deal. The original plan was for the house to accept cryptocurrency for the hammer price but require that its own premium fee be paid in dollars; however, sale organizers worried that such an arrangement would discourage crypto whales from participating in the auction.","Success needed to be measured with the company’s longterm goals for growth. Accepting cryptocurrency would invite scrutiny from the press, traditional collectors and government regulators; it could also be a financial risk, depending on the volatile prices of bitcoin (BTC) and ether (ETH). What ultimately became clear to decision makers was that nothing about this sale could be half-assed. Big money often requires big leaps of faith.","“A decision was made at the highest levels to take the whole thing in cryptocurrency,” Doyle said. “The amount of cogs in the wheel for that to happen was truly mind-blowing.”","The gamble worked, and the tidal waves of inquiries about the Beeple sale never stopped. Sundaresan had already confirmed his participation in the auction, but what nobody expected was another competitor willing to participate in one of the most furious online bidding wars that the auction house had ever seen.","On February 25, 2021, the auction began with a $100 opening bid. Within eight minutes, the price had reached $1 million.","“I was shocked that our website could handle it,” Doyle said. “I had never seen that happen.”","The auction had already reached the threshold for bidders at which the prospective buyers needed to be cleared financially, often with letters of references from the crypto exchanges supporting their transactions. There were nearly two dozen hopeful buyers at that point, 18 of whom were entirely new to Christie’s. Most were millennials.","See also: What's Next for Beeple After Dizzying $69M NFT Sale?","“It was a psychotic amount of bidding,” Davis thought as his phone started blowing up with messages. His boss, Alex Rotter, head of 20th-and-21st-century art, even took to social media to brag about the sale. He posted a Beeple artwork to his Instagram featuring a superpowered Homer Simpson lobotomizing his son, Bart Simpson, with laser vision.","“Beeple leads the way,” Rotter captioned the image. “It’s all happening.”","This excerpt has been lightly edited.","Edited by Daniel Kuhn."],"entity":[{"type":"Mike Winkelmann","content":"PERSON"},{"type":"Ryoma Ito","content":"PERSON"},{"type":"Anand Venkateswaran","content":"PERSON"},{"type":"1,000%","content":"PERCENT"},{"type":"$2.2","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1980s","content":"DATE"},{"type":"Penguin Random House","content":"ORGANIZATION"},{"type":"Rotter","content":"PERSON"},{"type":"1988","content":"DATE"},{"type":"Scott Reyburn","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bart Simpson","content":"PERSON"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"Bill Gates","content":"PERSON"},{"type":"Fox News","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"$31.8 million","content":"MONEY"},{"type":"Synthetic Bubblegum Tittufux","content":"ORGANIZATION"},{"type":"Mickey Mouse","content":"ORGANIZATION"},{"type":"Marilyn Monroe","content":"PERSON"},{"type":"Homer Simpson","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Mack Flavelle","content":"PERSON"},{"type":"Zachary Small","content":"PERSON"},{"type":"Davis","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Andy Warhol","content":"PERSON"},{"type":"Winkelmann","content":"PERSON"},{"type":"Beeple After Dizzying $69M NFT","content":"ORGANIZATION"},{"type":"Nintendo","content":"ORGANIZATION"},{"type":"Winkelmann","content":"LOCATION"},{"type":"Chennai","content":"LOCATION"},{"type":"Steve Jobs","content":"PERSON"},{"type":"Purdue University","content":"ORGANIZATION"},{"type":"January 2018","content":"DATE"},{"type":"Charleston","content":"LOCATION"},{"type":"$450.3 million","content":"MONEY"},{"type":"Picasso","content":"ORGANIZATION"},{"type":"$52 million","content":"MONEY"},{"type":"Meghan Doyle","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Salvator Mundi","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Saudi","content":"LOCATION"},{"type":"Christie’s","content":"ORGANIZATION"},{"type":"Alex Rotter","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"South Carolina","content":"LOCATION"},{"type":"Wisconsin","content":"LOCATION"},{"type":"Guillaume Cerutti","content":"PERSON"},{"type":"Robert Alice Made NFT","content":"ORGANIZATION"},{"type":"Salvator Mundi","content":"ORGANIZATION"},{"type":"Leonardo da Vinci","content":"PERSON"},{"type":"Ito","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"$66,666.66","content":"MONEY"},{"type":"Sundaresan","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"October 2020","content":"DATE"},{"type":"Vignesh Sundaresan","content":"PERSON"},{"type":"Marcel Duchamp","content":"PERSON"},{"type":"1917","content":"DATE"},{"type":"$1.00","content":"MONEY"},{"type":"Rothko","content":"PERSON"},{"type":"Hillary Clinton","content":"PERSON"},{"type":"20th Century Evening Sale\"","content":"ORGANIZATION"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"CryptoPunk NFTs","content":"ORGANIZATION"},{"type":"2003","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"February 25, 2021","content":"DATE"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Origin City","content":"LOCATION"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Beeple","content":"PERSON"},{"type":"Toys “R” Us","content":"ORGANIZATION"},{"type":"Justin Bieber","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"Chewbacca","content":"LOCATION"},{"type":"Santa Claus","content":"LOCATION"},{"type":"$260 million","content":"MONEY"},{"type":"Mona Lisa","content":"PERSON"},{"type":"Donald Trump","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Stan","content":"PERSON"},{"type":"Operation Ivy","content":"ORGANIZATION"},{"type":"$48 million","content":"MONEY"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Indiana","content":"LOCATION"},{"type":"Doyle","content":"PERSON"}],"hashtag":["Features","NFTs","Art","Christie's","beeple","Auctions","MetaKovan"],"authors":["Zachary Small"]}