{"summary":"New Upcoming ICOs List for This Week","webName":"cryptonews.com","link":"https:\/\/cryptonews.com\/news\/new-upcoming-icos-list-for-week.htm","publishDate":"2023-02-19T23:13:00","id":21370,"type":null,"title":"New Upcoming ICOs List for This Week","category":["ICO news "],"content":["As the cryptocurrency market continues to hold its ground in the face of mounting regulatory challenges, new Initial Coin Offerings (ICOs) are still emerging and providing investors with unique opportunities to invest in innovative crypto projects. In this article, we’ll explore four upcoming ICOs set to make waves in their respective industries: Fight Out, Republic Note, C+Charge, TagoVerse, and Backstage.","The fitness industry has been plagued by high dropout rates and gym closures, especially during the COVID-19 pandemic. Fight Out is a project that aims to address these issues by leveraging Web3 and move-to-earn (M2E) technology.","The Metaverse is no longer science fiction – it's happening now. Join Fight Out and discover a new world of fitness and community.\n\nJoin the presale now at https:\/\/t.co\/z34Nkx3ffi!#Masterclass #Blockchain #Web3 pic.twitter.com\/xKNWdkw2dv","With Fight Out, you’ll be able to unlock and proudly display a unique NFT avatar that reflects your fitness progress. Users will be able to track and compare stats with others to make every workout an exciting challenge.","Users can also earn REPS tokens, which incentivize them to work out at home or in the gym. These tokens can be redeemed for discounts on subscriptions, merchandise, and gym memberships.","Fight Out is positioning itself to make inroads in the fitness sector by fostering a community-driven, personalized, and goal-oriented environment. Investors have a unique chance to take advantage of this investment opportunity that offers bonuses up to 50% in the project’s token presale for investments over $50,000. FGHT tokens have already raised close to $4.39 million in the presale period, with the next phase soon to begin at higher prices.","Visit Fight Out Now","Republic, an alternative investment platform, is launching its own digital security called Republic Note. The Republic Note is a profit-sharing instrument with a finite supply that aims to bring profit to investors by distributing dividends when companies succeed.","The Republic ecosystem provides individual investors access to a wide range of investment opportunities, including early-stage startups, growth-stage\/pre-IPO technology companies, crypto, e-sports and video games, real estate, and Main Street investments. The platform has connected over 2.5 million investors from 100+ countries and enabled them to invest a combined $1.5 billion in global projects.","Republic Note will allow investors to own a piece of the profits from certain Republic business lines and will be backed by Republic Core’s profit-sharing interests in select portfolio companies.","Some of the companies that have raised capital with Republic include SpaceX, Avalanche, and Gumroad. When corporations experience a successful exit resulting in cash proceeds, some of the money will go to the Republic Note pool.","Once the total amount of allocations reaches $2 million, proportional payouts will be given to all owners of Republic Notes. Subsequent distributions will happen each time this threshold is reached (or earlier depending on the decision made by Republic Core).","Electric vehicle (EV) owners face challenges in finding nearby charging stations and dealing with vague pricing. C+Charge aims to address these issues by offering a mobile app for EV owners that provides real-time data on nearby charging options and diagnoses the vehicle for any charging issues.","C+Charge is also developing its own charging stations and partnering with existing ones while allowing users to pay with the exclusive CCHG token. The blockchain technology utilized by the CCHG cryptocurrency guarantees efficient and transparent transactions, providing users with a superior payment processing experience. In addition to streamlined payments, EV owners who use C+Charge will also earn carbon credits through Goodness Native Tokens (GNT), which can be stored in the C+Charge app to be traded.","How can technology help the future of mobility?\n\nTechnology brings more data and connectivity to mobility efficiency\n\nWe allow our users to find the nearest charging stations with the real-time data analysis\n\nBuy some $CCHG now⬇️https:\/\/t.co\/ixe18bPqzI#presale #Refi pic.twitter.com\/CKFdS1YLXL","C+Charge has already sold out the first stage of its presale and has raised over $1.261 million. Now is the ideal time to purchase CCHG, as its token price will continue to rise in the upcoming ICO stage 3.","Visit C+Charge Now","The mental healthcare industry has long struggled to provide affordable and quality counseling to those in need. With the growing number of people experiencing mental health issues, the demand for therapy and advice has risen sharply. TagoVerse is looking to help by creating the world’s first mental health metaverse.","TagoVerse is creating a platform where individuals can easily connect with mental health professionals from anywhere in the world. TagoVerse also has its own token in its ecosystem which can be used as a reward for users who contribute to the growth of the platform.","The platform is designed with an “Evolve to Earn” mechanism, where experts and contributors must earn their rewards through successful bookings and high ratings. The token can also be used to pay for products and services on the platform, or for staking, which earns interest and grants administrative rights.","To ensure fairness and efficiency, TagoVerse has divided its tokenomics as follows: 40% for the staking program and ecosystem development, 8% for reserved, 5% for DEX liquidity, 10% for marketing and community, 12% for private funding round & 7% for IDO, 3% for advisors, and 15% for the foundation.","Backstage is a new company specializing in event financing that offers a solution to the financing issues facing the event industry. The event industry has always been a high-risk market, and the Covid-19 pandemic has further complicated matters. With restrictions still in place, the industry is struggling to finance its activities.","Backstage’s vision is to digitize the event industry, making it more resilient, circular, and profitable. The company is developing technologies that support B2C, B2B2C, and B2B services. Backstage is creating an NFT ticketing platform that will be followed by new technology and business models based on transparency, circularity, and sustainability. Backstage’s NFT platform offers a second element of innovation that includes the creation of NFT tickets that act as a sales channel for artists and venues.","The company’s ecosystem, called “The Stage,” connects blockchain-based applications powered by the BKS utility token, community, and industry. The Stage includes the BKS marketplace, NFT ticketing, loyalty NFTs, BKS launchpad, crypto POS wallet, and staking and LP staking."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"$50,000","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Goodness Native Tokens","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"$CCHG","content":"MONEY"},{"type":"Gumroad","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"Republic Core)","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"$2 million","content":"MONEY"},{"type":"$1.261 million","content":"MONEY"},{"type":"$4.39 million","content":"MONEY"},{"type":"$1.5 billion","content":"MONEY"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Backstage","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"TagoVerse","content":"ORGANIZATION"}],"hashtag":["Fight Out"],"authors":["Trent Alan"]}