{"summary":"The protocol now has $5.4 billion in total value locked (TVL).","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/24\/ether-etf-listing-approval-sees-billions-poured-into-restaking-protocol-etherfi\/","publishDate":"2024-05-24T15:46:52","id":21376,"type":null,"title":"Ether ETF Listing Approval Sees Billions Poured Into Restaking Protocol Ether.Fi","category":["Finance"],"content":["Restaking protocol Ether.fi has soared to record highs in terms of deposits and total value locked (TVL) as investors anticipate the approval of a spot ether (ETH) exchange-traded fund (ETF) in the U.S.","More than 270,000 ether ($995 million) has been deposited to Ether.fi over the past ten days. The inflows, coupled with ether's recent rise in price, have spurred the protocol's with TVL to increase from $4 billion to $5.4 billion, an all-time high according to DefiLlama.","Restaking is a strategy used by traders to earn an extra yield on ether that is already staked on the Ethereum blockchain. Ether.fi currently offers an annual yield of 3.48%, with an additional 15.1% being available through the product's liquid vault.","The increase in activity could suggest that investors are looking to gain exposure to the Ethereum ecosystem while betting on whether staking could be incorporated into ETF products in the future.","Ether.fi's CEO Mike Silagadze, told CoinDesk that it will be a \"matter of time\" before ether ETFs begin to implement staking and restaking to generate a yield for shareholders.","\"I think there is question whether staking, particularly liquid staking, turns ETH into a security,\" Silagadze said. \"I think how it is going to start is you will have ETH ETFs that are either contracted out or run their own infrastructure, those nodes will be compliant and censored and all of that stuff, but it'll have a nice baked-in yield. Restaking is much more complex, so I think it'll get there; it'll just be a matter of time.\"","Silagadze added that the SEC's approval will help shift the narrative as more people become aware of Ethereum and smart contracts.","\"It's just more awareness,\" Silagadze said. \"A lot of people that are sophisticated know what restaking is; they just have no way to access it or allocate to this asset. So I think it helps with the narrative shift because more people become aware of what Ethereum is.\"","Ether.fi's native token (ETHFI) has also experienced a boost this week on the back of recent inflows, rising by 41% to outperform CoinDesk's CD20 Index which has risen by just 5.2% in the same period.","Edited by Aoyon Ashraf."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"5.2%","content":"PERCENT"},{"type":"3.48%","content":"PERCENT"},{"type":"41%","content":"PERCENT"},{"type":"15.1%","content":"PERCENT"},{"type":"Mike Silagadze","content":"PERSON"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Silagadze","content":"PERSON"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"$995 million","content":"MONEY"},{"type":"DefiLlama","content":"ORGANIZATION"}],"hashtag":["Restaking","Ether.Fi","ETF","Ethereum"],"authors":["Oliver Knight"]}