{"summary":"We need airdrops and KOL campaigns that, instead of creating empty buzz and boosting vanity metrics, convert real committed users, build brand relationships, and bring large rewards to engaged communities, says Filip Wielanier, co-founder of Cookie3, a Web3 marketing platform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/23\/wake-up-web3-your-marketing-is-fueling-a-bot-epidemic\/","publishDate":"2024-05-23T17:52:47","id":21389,"type":null,"title":"Wake Up, Web3: Your Marketing Is Fueling a Bot Epidemic","category":["Opinion"],"content":["Web3 marketing has one fundamental problem: it focuses mainly on hype and disregards true users. This happens because big rewards have become the core of Web3 marketing. But boosting vanity metrics through giveaways isn’t what Web3 marketing, or what we call MarketingFi, is and should be about.","This op-ed is part of CoinDesk's Web3 Marketing Week.","Right now, projects are distributing their marketing budgets to everyone who will come and like their Twitter post and give them a follow — think of quests like Galxe. This trend is a spark of potential that MarketingFi has yet to bring to market: instead of offering rewards to everyone for small actions, MarketingFi brings rewards to engaged users. Instead of giving small rewards to a lot of users (and bots and Sybil attackers), MarketingFi means larger rewards for users who bring quality to projects through participation in marketing activities.","Similar issues persist in the current state of Web3 KOL marketing — the second largest (after airdrops) and fastest-growing Web3 marketing trend. Currently, projects that conduct KOL rounds often onboard shillers with botted numbers who build and bring initial hype but don’t bring true users towards whom marketing budgets should be diverted. Why? Because they want to ‘make hype quick’ and have no way of measuring the actual impact of their campaigns.","Shillers (because, let’s be honest, they are not real KOLs) bring the hype, cost projects tens of thousands, and pass rewards and marketing budgets on unengaged users who leave the project as soon as it's out. Yet, in the data-powered MarketingFi, true KOLs have the potential to bring larger rewards and marketing budgets to audiences that will build projects further. But we need to employ analytics first, weed out the shillers, and bring larger incentives to the right creators.","So what exactly is MarketingFi, and how can Web3 get there already?","MarketingFi means data-driven marketing decisions in an ecosystem where users are more than customers — they are co-creators and co-owners. A significant shift in Web3 marketers’ thinking is necessary to make MarketingFi a standard. Projects must stop considering traditional business-user relationships and start seeing it as a collaborative co-ownership ecosystem. Think: “If my users hold my tokens, they want me to do the right marketing because my project’s growth benefits them - how can I pass my marketing budget onto them so they help me onboard more quality users?”. How do we find these engaged users, i.e., co-owners and collaborators? Look at your off- and on-chain data and bring significant incentives, rewards, and airdrops to those with the most quality. Give the community the tools and budgets to act.","Currently, Web3 is in the midst of the Airdrop Summer. New airdrop campaigns with elements of social farming are popping up left and right. Budgets and rewards for these campaigns are enormous, generating interest, hype, and hope. Such airdrops are a classic example of giving rewards to the wrong crowd: users lured by the reward complete a series of social tasks (and sometimes a couple of on-chain tasks) to possibly receive an airdrop. Many don’t realize these users are often bots, airdrop hunters, or Sybil attackers — not the quality audience projects their communities want to onboard. Our recent study at Cookie3 showed that up to 70% of an airdrop is frequently passed onto bots and Sybil attackers.","Are airdrops killing Web3 then? No. Airdrops are excellent, but only when they attract quality users — i.e. when they are done right. Some projects slowly wake up to the idea, understanding that getting large numbers quickly doesn’t outweigh the benefits of onboarding quality users who stick. A great example is Layer Zero, which laid the rules for self-reporting Sybil activity.","Solutions that help project leaders and marketers exclude bots from an airdrop already exist in a market (like Cookie3 Airdrop Shield, which uses AI to determine bots-based activity). Now, a mindset shift is needed and an understanding that short-term success and hype aren’t worth the long-term retention sacrifice. How to implement this change? Using data insight to exclude bots from the airdrop and giving more tokens to a smaller group potentially builds sustained hype and growth for the project.","What about KOL marketing and KOL rounds? How to work with KOLs who bring quality audiences in? Which KOLs should be given marketing budgets to pass on to their audiences and ensure collaborative ecosystem growth?","Marketers must find ways to determine which KOLs bring quality users rather than further inflating the empty numbers. How? Employing analytics to see how users are converting from KOL promotion, which KOLs bring the most quality users, and working with KOLs who result in a desired conversion is one of the best ways to weed out the best KOLs aiding in quality marketing.","As this becomes a standard, more data on KOL quality will be available across the market, raising the overall quality of Web3 KOL marketing. At Cookie3, we are working on implementing such a solution with Cookie3 Affiliate, helping projects set straight terms and rules for onboarding KOLs onto KOL rounds, measuring actual conversion and quality impact, and offloading parts of the allocation to $COOKIE stakers, i.e., bringing engaged users wanting to explore new projects early on.","Despite Web3 marketing being different from Web2, one thing Web3 marketers must learn from traditional marketing — looking at numbers and knowing that an engaged and converted user is worth a thousand times more than a potential user or new non-quality follower. Only then should the Web3 element of MarektingFi kick in, and, in a true Web3 fashion, marketers should decentralize their budgets by passing them onto determined quality users as co-owners and collaborators, bringing sustained long-term growth.","Web3 markets need to wake up and realize that results-driven does not mean vanity metrics. Results driven in Web3 must be understood as data-powered decisions, community-driven campaigns, and long-term success building through directing budgets to users who bring quality to projects.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","Edited by Benjamin Schiller."],"entity":[{"type":"KOL","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Airdrop Summer","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Sybil","content":"PERSON"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"$COOKIE","content":"MONEY"}],"hashtag":["Opinion","Web3 Marketing 2024"],"authors":["Filip Wielanier"]}