{"summary":"Cookie3’s co-founder and CEO explains how Web3 marketing can create a shared economy of users, creators and businesses.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/21\/filip-wielanier-web3-marketing-is-a-win-win\/","publishDate":"2024-05-21T14:20:55","id":21387,"type":null,"title":"Filip Wielanier: 'Web3 Marketing Is a Win-Win'","category":["Consensus Magazine"],"content":["Every marketer needs data. The problem is that in Web3, getting that data is tricky. Where are your customers coming from, what are they doing? This is basic stuff in Web2. It’s Marketing 101. But in Web3, you have off-chain behavior and on-chain behavior, and it’s hard to connect the two.","Enter Cookie3, which describes itself as “the first open MarketingFi economy shared between users, creators, and businesses.” Cookie3 is many things, including: A Web3 marketing ecosystem intended to connect creators to advertisers, a tool for KOL (key online influencers) to quantify their reputation, and, most of all, an AI-powered data analytics tool that lets projects understand both off-chain and on-chain marketing behavior.","This interview is part of CoinDesk's Web3 Marketing Week.","“You can think of it as an Google Analytics alternative,” says Filip Wielanier, Cookie3’s co-founder and CEO, who has a background in both IT and digital marketing at Deloitte. Using the Cookie3 plug-in, Web3 projects can understand customers’ ROI, lifetime value, and contribution to on-chain progress. Wielanier explains how Cookie3 analytics work, why this data is crucial for any project, and why Web3 marketing is a “win-win situation for everyone, because the creators are building much more engaged communities.”","Interview has been condensed and lightly edited for clarity.","What are some of the biggest advantages in Web3 marketing over Web2 marketing?","Filip Wielanier: In Web3, you have the ability to directly communicate and incentivize your contributors. And you can decentralize what’s called “publishers” in Web2. You can make them your own ambassadors. You can also collaborate with other creators who contribute directly to your ecosystem, and also to provide them value directly, which is very hard to do in Web2 marketing. And this is exactly why we created Cookie3 Affiliate -- to provide it in an automated and permission-less way. You can think of Cookie3 Affiliate as a kind of matchmaking between the creators and advertisers.","You mentioned the Cookie3 Affiliate program, but what’s the overall vision of Cookie3?","The current vision is to provide the fair value distribution between different stakeholders including retail individuals, creators, and companies. We’re creating the whole ecosystem to provide that for everyone. Right now in crypto, specifically, some groups of insiders have a huge advantage in terms of information, and we want to open this up to the whole market.","I love this in theory, but can you give an example to make it more concrete?","Sure. So basically, we’re the data company. We use an AI data layer, specifically, and we’re working on different solutions including a user analytics platform -- Cookie3 analytics. You can kind of think of this as a Google Analytics alternative. We help people understand flows such as user attribution, transactions, and conversions on-chain. The two worlds of off-chain and on-chain data are pretty hard to be measured together, and we’re providing that information in one place.","Got it. So who are your main end-users, generally? Projects or companies looking to better understand their customers?","Yeah. So we are B2B2C. [Business to business to consumer.] So any DeFi platform, DEX, or gamify platform -- you name it -- that wants to onboard users needs to optimize their spending on marketing. And they’d like to tailor their communications to specific groups of users. Thanks to our insights, they can finally understand who’s actually using their platform, what are the flows, what are the attribution sources. You can see the ROI of marketing campaigns. And in the Web3 world, we have a challenging environment because there’s off-chain attribution and then on-chain conversions, and it’s hard to measure that together.","Can you give a concrete example of how this kind of insight can help a project?","We’ve got this amazing use case of our client Notum. They managed to decrease their marketing cost by 64%. They thought they were doing well because they had a lot of people come in, but once they looked at the on-chain data, they saw that the people they were attributing had very low amount of tokens and liquidity in their wallets, and obviously that's not who you want logging into your platform. These users were not generating value or revenue.","So they looked at other channels that might bring in a lower quantity of people, but people who are more valuable users. They completely stopped putting money into users who weren’t bringing value. Vanity metrics only get you so far.","Vanity metrics?","A vanity metric is, for example, when you’re doing an airdrop and you have a lot of bots follow your Twitter and your numbers look amazing. It’s a vanity project.","I’m glad you mentioned bots. How do you handle the problem of bots when you’re analyzing data? And I’m guessing this is now even more complicated in the world of AI?","Yeah, so I won’t tell you the exact details of that, because once I tell you that…","It’s your secret sauce!","[Both laugh.]","But you know, it’s this constant chase. They [bad actors] are chasing up. We’re chasing them, basically. And there are plenty of [actors] who are just abusing certain metrics and behaviors to get some airdrops, for example, and to drain valuable from an airdrop campaign. These are real risks, because we are sometimes talking about multiple millions worth of tokens. In terms of how we’re approaching that, it’s very custom.","What are these bad actors doing exactly?","The attackers are creating multiple accounts that are focused on attacking specific protocols, or interacting with specific smart contracts to get some incentives or airdrops in the upcoming airdrop campaign. This is the most common use case in Sybil bots and Sybil attacks. They can create multiple, sometimes thousands or even tens of thousands of wallets.","You’re almost having to act as a cyber-security firm, on top of data analytics?","Kind of. And especially with the adoption of different AI solutions, it’s getting even harder because these Sybils are much more advanced and much more sophisticated than they were even a year ago. So it’s this constant race of chasing each other, because we’re using machine learning models to detect them. And they are using other models to not get detected.","And by the time our call is over, it will have evolved once again.","Yeah. So this is the actual environment and status quo that we’re living in. This is why projects like Worldcoin are great examples that Proof of Humanity is very needed in the future, because AIs are getting more sophisticated in their behaviors.","One of the taglines on your web page is “MarketingFi Protocol & AI Data Layer.” What does “AI data layer” mean exactly?","This is the thing we’re specializing in. We’re a data company and we’re providing those data points from different angles including on-chain. It’s kind of like Google Analytics data. And once a platform integrates into our analytics plugin, they have all the data play with and understand the behavior of their users.","Can you give another example of an insight that a company could glean from using all this?","Yeah, sure. So basically, any Mention or Like [on social media] can be measured. If anyone is digitally talking about or promoting your product, you can see the outcome of that. This could apply to marketing activities like advertisements, or collaborations with influencers, or quest platforms. Thanks to us, basically, you can see the real out come -- not just in terms of the number of visits or the time that folks spend on your website coming from a specific source and spending an exact amount of money, but you can actually see the real outcome to your protocol. Thanks to on-chain stats, you can check and see how much liquidity came from different sources. You can finally calculate the ROI and customer acquisition cost and customer lifetime value. These are pretty fundamental metrics in the Web2 marketing world, but not so common in Web3 because they are just hard to measure.","Let’s finish with the Web3 vision of how decentralized creators can connect with consumers, instead of using Google or Facebook. Can you give an example of how this works?","Sure. So basically, there’s the advertiser that defines the campaign. Defines the conversion event, defines the reward for the conversion event. Then there’s a publisher -- in this case the creator -- that decides whether he or she would like to participate. And then he's promoting the product to get some conversions, and per each conversion -- which is being verified by our verification engine -- a smart contract is paying out rewards to the creator. And those rewards can be also cost-shared with the end user. This is just one concrete example, but there are many others.","And on top of that, thanks to the blockchain, you can even reward your communities if they are engaging you. It's a win-win situation for everyone, because the creators are building much more engaged communities, thanks to this value-sharing approach.”","Edited by Benjamin Schiller."],"entity":[{"type":"MarketingFi Protocol & AI Data Layer","content":"ORGANIZATION"},{"type":"ROI","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"64%","content":"PERCENT"},{"type":"CoinDesk's Web3 Marketing Week","content":"ORGANIZATION"},{"type":"Sybil","content":"LOCATION"},{"type":"Sybil","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Filip Wielanier","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Google Analytics","content":"ORGANIZATION"}],"hashtag":["Opinion","Consensus 2024","Web3 Marketing 2024"],"authors":["Jeff Wilser"]}