{"summary":"The rise of Farcaster and portable “social graphs” will change the relationship between brand marketers and end-users, says the founder of JUMP, a network for Web3 branding executives.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/23\/jeff-kauffman-decentralized-social-will-revolutionize-marketing\/","publishDate":"2024-05-23T13:44:49","id":21396,"type":null,"title":"Jeff Kauffman: Decentralized Social Will Revolutionize Marketing","category":["Consensus Magazine"],"content":["Through each stepchange in technology, marketing has continually evolved. What started in the early days of Mesopotamia and Egypt, with merchants advertising their goods using symbols and signs on stalls, has become a complex global industry, constantly adapting to communications innovation.","This op-ed is part of CoinDesk's Web3 Marketing Week.","When it comes to Web3, the latest innovation, Jeff Kauffman knows his stuff. Starting out early in the days of Web 1.0 and Web 2.0, Kauffman built brand communities for clients like GameStop, Dr. Pepper and Chick-fil-A. He later founded JUMP, a network for branding executives curious about Web 3, which has drawn brand managers from at least 200 Fortune 500 companies.","“With Web3, you now have this on-chain touchpoint relationship and experience and that’s the biggest difference, that there is this on-chain element to the end-user customer experience.”\n\nKauffman, a speaker at this year’s Consensus festival in Austin, Texas, believes the future direction of marketing lies in Web 3.0 social platforms, like Farcaster and portable social graphs, which offer unique experiences and put more control back into users' hands.","“Take a look at what happened with the Starbucks loyalty program,” Jeff said. “While I commend the brand and the team for the effort, ultimately, they decided to shut it down. What did they get wrong? They tried to copy\/paste their Web2 program and do it in a Web3 way. They tried to make it Web3, but it just didn't work.","“Web2 is the best way to run that loyalty program. If you're going to enter Web3 and use tokens and start to interact with customers on-chain, whether it's under the umbrella of loyalty or not, you must think about a net-new experience with your customers.”\"","In a recent interview, Kauffman covered how marketing is changing with Web3, where it might go next, some examples of brands pushing the envelope and what makes for good marketing strategies with brands and creators.","The following has been lightly edited for brevity and clarity.","Can you give me some examples of brands utilizing this offline to online to on-chain framework and pushing the envelope?","Kauffman: Two brands that are doing well are Coinbase and 9dcc, a fashion brand started by G-Money. 9dcc is a good example of a brand that truly understands this offline, online, and on-chain brand experience and customer experience. But I'll start with Coinbase. They've done this cool thing as a publicly traded company where they've released their earnings report as an NFT collectible for free. Anyone can mint it, and then those who did receive discounts to their merch store, and get exclusive perks, for example, access to limited edition hats that are only available to people who minted their earnings report.\n\nThis shows the connection between offline, online, and on-chain. The offline component is the merchandise (the physical goods), the online component is the shopping experience of buying or securing the goods, and the on-chain element is minting their earnings report on-chain. And with the on-chain element, what's key is that brands are putting their story on-chain.","What enabled this?","Kauffman: When Web3 became a term in 2020-2021, it was kind of all about, \"Hey, we've got this collectible, and we want people to collect this thing, and we want you to buy it, and there's a limited supply.\" Now, the transition is less about this exclusive collectible and more about all these little components that make up a brand story, everything from an earnings report to the goods you produce. And the primary driver of this is Layer-2 blockchains.","A few years ago, this kind of on-chain marketing and relationship with customers wasn't possible because everything was on Layer-1 Ethereum, gas costs were expensive, and they only got more expensive. This was the era of the 10,000 PFP collections in NFTs. The costs were such that you couldn't have a million or half a million people mint your earnings report; that just wasn't feasible. Having 500,000 to 1 million people engage with you on-chain only made sense when L2s came around- Base being one of the best examples of an L2 lowering transaction costs and allowing more opportunities for on-chain engagement.","Why is being on-chain so important for brands to utilize?","Kauffman: The most important aspect of on-chain marketing for brands is that it gives them a direct relationship with their customers. For consumers, they have more control of the relationship because they hold and control the tokens in their wallet.","This gives brands the ability to engage their customers within any on-chain enabled experience because the token is the link in the relationship. A couple of years ago this was more theory than reality. But, now with the rise of Web3 social, we’re seeing this play out in realtime. We’re not far from the day when an on-chain user experience on the internet is much better than the user experience with today’s internet. Cheaper fees and faster transaction costs on L2s are making this possible, which is driving new product and user experience designs that are only possible with the interoperability and composability of on-chain experiences.","I also wanted to ask, through your work with JUMP, what do you see the ad executives often get wrong or misunderstand about Web3?","Kauffman: Many of the marketers in these institutions are intelligent and capable and understand a lot about the space. But they're in handcuffs because these legacy brands and institutions were built around different marketing laws of physics. In Web3, there's a different level of physics within the ecosystems, and legacy institutions can't get out of their own way.","That makes a lot of sense, so instead of taking a cookie-cutter copy\/paste approach, it needs to be more conscious and intentional?","Kauffman: A critical question to ask is “What do we do in Web3 that we couldn't do in Web2?” And it goes back to the other question, “Why blockchain?” If you keep pushing through a hundred of those scenarios, keep asking \"why blockchain\", and realize that you don't need blockchain or Web3 to do it, well, now you've just iteratively gone through all of the ideas that you shouldn't have launched in the first place as a Web3 initiative. You eventually get to the thing where you're like, \"Ah, this can only be done with blockchain. Now, we can definitively answer the question, why blockchain and why Web3.”","Let's circle back to Web3 social and how it's influencing the future of marketing.","Kauffman: Yeah, absolutely. So, the most dominant player right now is Farcaster. But Zora is very close and exciting, and then you have Lens. But if you could only spend your time in one place, it's Farcaster. So what's happening here is that this Web3 social network and Web3 social in general is bringing users and content on-chain. At a high level, other apps, experiences, and brands can then tap into the social graph facilitated through Farcaster and the content on these social networks to build new experiences.","Can you give me an example of that?","Kauffman: We can use Paragraph, which is a Web3 Substack. If you have a Farcaster account and you're active and you go to Paragraph and you create your Web3 substack or blog, you'll immediately be shown your farcaster social graph, and everyone you follow on Farcaster, their paragraph accounts will be shown to you and you can subscribe and follow them. This is something we thought would happen in Web2, but, because of the walled-garden nature and because of the privacy component, because users didn't own their content and identity in these social graphs, it became difficult to make this interoperable, portable social graph, of just network connections and people connections and the content itself as well.","Because you own your Farcaster ID, that sits in your wallet along with the content you produce, now it becomes portable. Now other brands and apps can launch and tap into that social graph and content graph. And immediately pull that in, which immediately creates this element of social graphs moving around the internet together in and out these different apps and continually being connected.","So, everytime I go to use a new app that is tapping into this Web3 social protocol, everytime I go to use a new app, that app has much more utility because I am immediately able to find the other people in my Farcaster social graph who are using this app and look at what they're doing on this new app that is tapping into what Farcaster has built.","Give us a sense of the future.","Kauffman: Let's go to 2030. Elon Musk is landing on Mars, and there's this big ephemeral moment. You have hundreds of millions of people using Web3 social media, and you could, in theory, have an app that springs up that's really tailored to that moment, as well as content consumption and the conversation that is going on at that moment. A billion people use the app, and the moment the app goes away, the app goes away.","So, Web3 social, from a marketer's perspective, is the one area if you were to ask, \"Where I am going to spend my time as a marketer,\" I would say that I am going to spend my time with Web3 social. Spend your time there, use these protocols and Web3 social platforms, and join the communities there. The ROI for your exploration and time investment is a good bet.","Edited by Benjamin Schiller."],"entity":[{"type":"Kauffman","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Mesopotamia","content":"LOCATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Jeff Kauffman","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"1 Ethereum","content":"PERSON"},{"type":"Pepper","content":"PERSON"},{"type":"Chick","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jeff","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Egypt","content":"LOCATION"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["Opinion","Consensus 2024","Web3 Marketing 2024"],"authors":["Mason Marcobello"]}