{"summary":"Harmony’s core team has proposed a hard fork to mint billions of new harmony (ONE) tokens. But its community seems to be against the idea.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159864\/harmony-proposes-minting-billions-of-one-tokens-to-pay-back-hack-victims","publishDate":"2022-07-27T11:57:23","id":2139,"type":null,"title":"Harmony proposes minting billions of ONE tokens to pay back hack victims","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Harmony’s core team has <a href=\"https:\/\/twitter.com\/harmonyprotocol\/status\/1552097233692069888\" data-v-f87c67ca=\"\">proposed<\/a> a hard fork to mint billions of new harmony (ONE) tokens. <\/span><span data-v-f87c67ca=\"\">The proposal is part of the plan to reimburse victims of its bridge hack last month. <\/span>","<span data-v-f87c67ca=\"\">Harmony is a proof-of-stake (PoS) blockchain that presents itself as a faster and cheaper Ethereum alternative. ONE token is used as the native asset to pay for transaction fees on the network.<\/span>","<span data-v-f87c67ca=\"\">In June, a hacker stole <a href=\"https:\/\/www.theblock.co\/post\/154029\/harmonys-100-million-hacker-took-control-of-its-multi-signature-wallet-analysts-say\" data-v-f87c67ca=\"\">$100 million<\/a> worth of crypto assets locked on the Harmony-run Horizon bridge on Ethereum. Since then, victims have asked for a refund.<\/span>","<span data-v-f87c67ca=\"\">On Wednesday, the team suggested the community should fork the Harmony network and mint a fresh supply of tokens to initiate the reimbursement process.&nbsp;<\/span><span data-v-f87c67ca=\"\">“This proposal will require a hard fork of the Harmony blockchain as it will increase the supply of ONE tokens,” the proposal stated.<\/span>","<span data-v-f87c67ca=\"\">The latest proposal gave community members two options to decide how much tokens to mint. <\/span>","<span data-v-f87c67ca=\"\">The first option is to mint 2.48 billion ONE tokens ($49.6 million), which the team claimed would be enough for 50% compensation to victims at the current market price of $0.02 per ONE token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The second choice is to mint 4.97 billion ONE tokens ($99 million) enough for full compensation to victims.<\/span>","<span data-v-f87c67ca=\"\">The team argued that it shouldn't spend the treasury funds for hack reimbursement, saying that it wanted to protect those assets for growth and ecosystem plans. It said, <\/span><span data-v-f87c67ca=\"\">“We decided against using the foundation treasury in the interest of the longevity and wellbeing of the project as reimbursing from the treasury would greatly hinder the foundation’s ability to support the growth of Harmony and its ecosystem.”<\/span>","<span data-v-f87c67ca=\"\">Judging by comments on the governance forum, it appears that the community is largely unhappy with the proposal, primarily due to the inflationary impact of the minting of new tokens. <\/span><span data-v-f87c67ca=\"\">Many argued that this would be detrimental to its price.<\/span>","<span data-v-f87c67ca=\"\">“DO NOT MINT MORE! This will really screw those who are staking. Did we not learn about inflation? When you increase the supply, the price does not follow,” <\/span><a href=\"https:\/\/talk.harmony.one\/t\/reimbursement-proposal-horizon-incident\/20665\/3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said <\/span><\/a><span data-v-f87c67ca=\"\">one commentator.<\/span>","<span data-v-f87c67ca=\"\">Currently, ONE’s total supply is 13.1 billion tokens. This means that if the plan is approved, the team would inflate ONE’s supply anywhere between 19% to 38% over the next three years. After <\/span><span data-v-f87c67ca=\"\">the proposed plan of action is executed, impacted wallets will have to claim their tokens every month over the three-year period.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$99 million","content":"MONEY"},{"type":"$0.02","content":"MONEY"},{"type":"4.97 billion","content":"MONEY"},{"type":"19%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"38%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"2.48 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$49.6 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}