{"summary":"Cookies, pop-ups, and sketchy device fingerprinting are on their way out. Web3 users will control their online identities and be served relevant ads.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/22\/on-chain-ads-are-finally-here-in-a-win-for-privacy-and-user-experience\/","publishDate":"2024-05-22T13:00:00","id":21406,"type":null,"title":"On-Chain Ads Are Finally Here, in a Win for Privacy and User Experience","category":["Opinion"],"content":["\"Ads\" are a bad word in the cryptocurrency community, yet (almost) everything in crypto is an ad.","NFT mint links inside wallets are ads: the referring wallet app will make a cut of the minting fees. That link in your Discord or Telegram channel to a new decentralized exchange is an ad: the poster is getting upwards of 10% of your protocol fees via a referral program. Every memecoin is an exquisitely precise ad, a self-measuring barometer of attention: the price jumps if people talk about the memecoin and drops if they don’t.","Antonio Garcia Martinez is the founder and CEO of Spindl and author of \"Chaos Monkeys: Obscene Fortune and Random Failure in Silicon Valley.\" This opinion piece is part of CoinDesk's Web3 Marketing Week, presented by Cookie3.","Crypto is more spiritually ads-focused than it realizes, and more than Web2 was when it was born. I was there at Facebook when the IPO rolled around and suddenly monetization mattered; it was all built as a desperate afterthought to pay the server costs and please investors.","Crypto, meanwhile, has been busily inventing (or at least rebranding) channels for user growth: quests, airdrops, points system, and more. There has been very little built in the way of on-chain ads technology however. A couple of self-styled \"Web3 ad networks\" are really just very basic Web2 ad tech being run on crypto-focused publishers: the banner ad running over a block explorer like Etherscan or a token price charting website, nothing more.","But something new is afoot, which will radically change all that: Web3 consumer is finally happening. Farcaster, the decentralized social network, is happening, its many clients like Warpcast, Supercast, and Phaver are happening. Coinbase Smart Wallets that easily issue a wallet with a social login are happening. Onboarding services Privy and Dynamic and embedded wallets are also happening. Perhaps biggest of all, Telegram is building native wallet support into its immensely popular messaging app which boasts almost 1 billion active users. Now we’re talking real numbers, numbers that rival Web2 platforms.","What this means from a marketing perspective is that while most of the on-chain action so far has been at the end of the user journey—a user lands on a project’s page from somewhere off-chain, connects a wallet, and only then transacts—the top of the user funnel is finally on-chain too. The apps baking wallets into their user experiences will of course be using them to transact on-chain, which enables a whole new class of sponsored content.","By \"ads,\" of course, I don’t mean the hideous and annoying banner ads or mobile pop-ups of Web2. I mean in-context, native, and relevant sponsored calls-to-action like the ones you’re starting to see in the \"Explore\" or \"Perks\" tab of just about every wallet app, from Coinbase to MetaMask and all the rest. Wallets are suddenly in a ruthlessly competitive market and simply offering token swaps isn’t enough anymore: they’re slowly but surely crafting themselves into the portals for Web3, which means social and discovery feeds (and yes, ads).","Consider this: What would Amazon pay for a one-click ad that lets you buy the product you abandoned in an Amazon shopping cart, all while browsing The New York Times? It would pay billions and billions for it, given the impact on conversion rates. But such a thing can’t be built using legacy Web2 technology (the closest we have is TikTok shopping that uses Apple Pay for identity and payment).","With the blockchain managing identity and payment, such interactive ads can be so easily built that everyone and their brother is doing so. They're called Frames and launched on Farcaster in February. There are so many of these things running that Warpcast (the largest Farcaster client) has a Frames-specific feed just to see them all.","Now imagine similar user experiences, inside a consumer app, correctly targeted via a wallet-based audience informed by on-chain transactions, and paid for by payment rails that accept your protocol token. Imagine that anyone can be a publisher: every Discord or Telegram channel mod can finally get paid for the thankless task of maintaining large communities. In true crypto fashion, the rent-seeking incumbents of the past like Facebook and Google will be replaced by the decentralized coordination mechanism of the blockchain and growth protocols built thereon. Suddenly, the makings of the same marketing flywheel that grew trillion-dollar companies in Web2 materialize in Web3.","What of user privacy?\n\nGone will be cookies (and the cookie warnings), the sketchy device fingerprinting, the data brokers reselling your off-chain data, endless client-side software development kits on browsers and in mobile apps relaying what users do, and useless-seeming opt-out and delete-data buttons that never quite seem to turn off the retargeted ads in your feed.","Instead, users will be fully in control of their online identities which they may functionally delete by spinning up a new wallet. Or not! They’ll keep a public-facing social wallet with all their NFTs, or a degen wallet with their trades, and see a torrent of offered airdrops, rebates, and points everywhere they go. Users, not middlemen, will be in control, however.","Apps with wallets in them, from Telegram to Warpcast, are starting to do real numbers. When the scale of monthly active crypto users approaches the magnitude of fully-diluted crypto valuations, you can't count on ever-increasing token prices to cover costs. Which is fine – AWS doesn’t take crypto anyway. Scaled Web3 consumer apps will have to monetize in ways that don’t alienate users, while still going beyond the rudimentary mechanisms they possess today.","On-chain won’t be the new \"online\" any other way.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates."],"entity":[{"type":"Amazon","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Google","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Warpcast","content":"LOCATION"},{"type":"Garcia Martinez","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Random Failure","content":"ORGANIZATION"},{"type":"AWS","content":"ORGANIZATION"}],"hashtag":["Opinion","Web3 Marketing 2024"],"authors":["Antonio Garcia Martinez"]}