{"summary":"Here are some ways users and developers, the lifeblood of crypto, can help move better legislation through Congress, writes Rebecca Rettig, Chief Legal & Policy Officer at Polygon Labs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/23\/grassroots-policy-advocates-are-key-to-seeding-crypto-innovation\/","publishDate":"2024-05-23T13:57:42","id":21409,"type":null,"title":"Grassroots Policy Advocates Are Key to Seeding Crypto Innovation","category":["Opinion"],"content":["If you told me when I got into the blockchain space more than seven years ago that key pieces of sweeping market structure legislation for crypto would be brought to the floor of the House of Representatives, I wouldn’t have believed it.","Back then, crypto was a nascent technology viewed as “niche” or “off the beaten path.” As a lawyer in private practice advising software developers building innovative, cutting edge technology, I worked exclusively behind the scenes on novel legal questions for this emerging sector.","Rebecca Rettig is a speaker at this year's Consensus festival, in Austin, Texas, May 29-31.","We’re in a different world now. The concept of blockchain has greater cultural relevance than ever before, driven forward by evangelists and developers building on the margins.","Advocates see blockchain-based technology as transformative, with the ability to redefine not only how we engage in financial transactions, but also all internet-based interactions. Crypto brings the possibility of a new, decentralized internet to center stage in many ways, and global policymakers and regulators have trained their attention on what to do with this new industry like never before.","Policymakers and regulators are grappling with definitional and threshold questions of whether and how to regulate. What does it mean for a software system to be decentralized? When do potential financial risks emanate from cyber-security threats, and how do we mitigate such risks? What is necessary to ensure the overall integrity of the system?","A huge shift is underway in helping educate lawmakers on how to answer these questions. The policy arm of the industry has focused and professionalized as rapidly as the technology has developed. This may make advocacy seem esoteric and removed for those who are actually building and using the technology. But the time for builders and users to get involved in educating and working with lawmakers is now. This is more true than ever after the passage of the first market structure bill for crypto passed the House yesterday with a bipartisan vote.","As builders in this space, you have unique knowledge and insights in how this technology works and why it is an unprecedented reorientation of what the internet can look like. Grassroots efforts play an essential role in advocating for crypto and I have heard time and again from members of Congress that you’re exactly who they want to hear from. The point of advocacy is to help regulators tap knowledge workers and enthusiasts who have the information that can help craft polity.","So how can you get started? There are a couple easy ways to engage.","A number of organizations have been established specifically to give you the tools you need to advocate most effectively. Example? Crypto Policy Bootcamp.","In October 2023, Polygon Labs, Solana Foundation and DeFi Education Fund co-hosted the first Crypto Policy Bootcamp. The event brought together founders, CEOs, VCs, and other stakeholders to engage with policy experts, political advocates, and Congressional staffers and members of Congress. Discussions centered on how to talk about the value of blockchain technology. Through the various panels and accompanying dialogue, the bootcamp produced many takeaways, including:","Since October, we’ve hosted four additional bootcamps alongside others in the industry including Wormhole Foundation and Ledger, with the fifth coming at the end of May at Consensus. And the stage is set for one of the strongest crypto advocates in Congress, Tom Emmer, to take time out to speak to Bootcamp attendees in Austin.","These bootcamps aim to make policy work accessible to anyone by equipping those building, investing, or working in the space with the tools and resources they need to effectively advocate for the evolution of the blockchain industry, ecosystem, and community on the Hill and beyond. And it is one of many fantastic ways to get the tools to get involved; there are organizations, such as Stand With Crypto, that are dedicated to this task, bringing builders together in D.C. and beyond to advocate.","Speaking directly to policymakers, especially your own Congressional representatives, has an unquestionably high impact.","Even better when you can also tell your story. This can take many different forms: calling, writing letters, setting up meetings.","There are also a number of tools that aggregate stories and help educate lawmakers, which you can use to provide your own compelling testimony. Along with the community, Ihelped launch an open, interactive website, The Value Prop (TVP), which aggregates blockchain-based applications into a simple database. It showcases everything from community-built GPS and hotspot networks to tracking supply chains to online verification of digital records and information.","The effort took place over many months, with the enthusiastic community members submitting hundreds of use cases. As a result, TVP has become a mainstay of grassroots clarity for decision makers: policymakers and regulators use it as a resource.","Contributors from the crypto community like the Ethereum Foundation, Celo Foundation, and Mercy Corps Ventures, have elevated the site further. Now it features video testimonials of builders and founders discussing what they’re creating, why they’re doing it, and the impact of their work.","What The Value Prop needs now more than ever are user testimonials. These testimonials bring to life the people actually using crypto, and the positive impact it’s made on their lives.","To that end, core team members of Polygon Labs will want to hear what you have to say! At Consensus on May 30, we’ll be interviewing users who want to testify about how they use this tech, why, and what it’s made of their life.","You — the builders and the users — are the lifeblood of the industry. You’re the most important voices that can be heard on policy issues.","Start engaging.","It doesn’t have to be with trips to DC or even to your representatives office in your home state. You can engage from the busy Austin streets during Consensus, by filming a user testimony. Or any other myriad ways.","Your time is now.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","Edited by Benjamin Schiller."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Wormhole Foundation","content":"ORGANIZATION"},{"type":"May 29","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"Mercy Corps Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Tom Emmer","content":"PERSON"},{"type":"TVP","content":"ORGANIZATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"31","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Rebecca Rettig","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"Stand With Crypto","content":"LOCATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Crypto Policy Bootcamp","content":"ORGANIZATION"},{"type":"May 30","content":"DATE"},{"type":"October","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["Opinion","Consensus 2024"],"authors":["Rebecca Rettig"]}