{"summary":"Bakkt has expanded to custody business to cover more than 70 clients, according to a Monday announcement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65585\/bakkt-custody-partners-consumer-app","publishDate":"2020-05-18T09:38:05","id":2140,"type":null,"title":"Bakkt grows custody business above 70 clients, says it has partnered with major financial institutions","category":["INSTITUTIONAL INVESTORS"],"content":["Bakkt, the digital asset venture owned by Intercontinental Exchange (ICE), has expanded its institutional custody business to more than 70 clients as it eyes the launch of a much-anticipated consumer app.&nbsp;","According to a Monday&nbsp;<a href=\"https:\/\/www.bakkt.com\/blog\/company\/bringing-digital-assets-mainstream\" data-v-f87c67ca=\"\">blog post<\/a> by the firm's president, Adam White, Bakkt has also partnered with insurance broker Marsh to offer clients more than $500 million worth of coverage. Customers of Bakkt would have to work bilaterally with Marsh to purchase the insurance. The firm also completed its SOC 1 Type I examination and SOC 2 Type II examination, following the lead of other crypto market participants such as <a href=\"https:\/\/gemini.com\/blog\/gemini-completes-soc-2-type-2-examination-another-first-in-crypto\" data-v-f87c67ca=\"\">Gemini<\/a>, <a href=\"https:\/\/blog.coinbase.com\/in-another-first-coinbase-custody-attains-its-soc-1-and-soc-2-reports-836f836ec60a\" data-v-f87c67ca=\"\">Coinbase<\/a>, and <a href=\"https:\/\/blog.bitgo.com\/bitgo-completes-soc-2-type-2-37edd178f151\" data-v-f87c67ca=\"\">BitGo<\/a>. The audits evaluate a company's internal controls and procedures.&nbsp;","\"Beyond the $125M of insurance already in place at the Bakkt Warehouse, customers can now purchase more than $500M in additional insurance coverage, subject to underwriting criteria,\" White wrote.","Bakkt, which made headlines in late April after its <a href=\"https:\/\/www.coindesk.com\/bakkt-ceo-mike-blandina-steps-down-4-months-after-taking-role\" data-v-f87c67ca=\"\">CEO Mike Blandina stepped down<\/a> to join JPMorgan as a payments executive, launched two years ago with a <a href=\"https:\/\/www.theblockresearch.com\/an-analysis-of-casascius-coins-41496\" data-v-f87c67ca=\"\">bitcoin<\/a> futures product aimed at institutions. It officially <a href=\"https:\/\/www.theblockcrypto.com\/post\/46549\/bakkt-officially-dives-into-crowded-crypto-custody-market-after-nydfs-blessing\" data-v-f87c67ca=\"\">gate-crashed<\/a> the bitcoin custody business in November after it received a nod from the New York Department of Financial Services via a BitLicense. At this point, the company is on-boarding two clients per week. &nbsp;","Elsewhere, the company has long had ambitions to break into the consumer space with an app that would allow users to buy and sell an array of digital assets, spanning cryptocurrency, cash and rewards points.","","","<em data-v-f87c67ca=\"\">Source: Bakkt<\/em>","The firm is flush with cash to build out the app, having completed a <a href=\"https:\/\/medium.com\/bakkt-blog\/bakkt-completes-300-million-series-b-financing-a072ff029135?source=collection_home---6------0-----------------------\" data-v-f87c67ca=\"\">$300 million Series B fundraising round<\/a> earlier this year.&nbsp;According to the blog post, Bakkt is making progress on the app.","The firm also noted that that it has partnered with two large financial institutions for its enterprise loyalty product.","\"We recently partnered with two of the largest financial institutions, leveraging these products to enable an additional 30+ million consumers to redeem their points for travel, merchandise, and gift cards through our platform,\" the blog said.&nbsp;","To be sure, Bakkt has already redeemed more than a trillion reward points for customers of its enterprise business, which it <a href=\"https:\/\/www.businesswire.com\/news\/home\/20200205005458\/en\/Intercontinental-Exchange-Announces-Agreement-Acquire-Leading-Loyalty\" data-v-f87c67ca=\"\">acquired through Bridge2 Solutions<\/a>. The enterprise unit manages the infrastructure of reward programs for airlines, hotels, and other businesses.&nbsp;","Bakkt's consumer app is set to launch this summer.&nbsp;","<em data-v-f87c67ca=\"\">Update: This article and its headline have been amended for clarity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Bakkt","content":"PERSON"},{"type":"$500M","content":"MONEY"},{"type":"$125M","content":"MONEY"},{"type":"Adam White","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Mike Blandina","content":"PERSON"},{"type":"Marsh","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}