{"summary":"Alongside the new entities, Fantom raised $10 million in a funding round that will go towards Sonic’s ecosystem development.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/23\/fantom-foundation-creates-sonic-foundation-labs-for-new-sonic-chain\/","publishDate":"2024-05-23T16:00:00","id":21405,"type":null,"title":"Fantom Foundation Creates Sonic Foundation, Labs for New Sonic Chain","category":["Technology"],"content":["The foundation behind the layer-1 Fantom Opera blockchain shared Thursday that it's forming the Sonic Foundation and Sonic Labs to be the main bodies supporting Sonic, a new layer-1 blockchain with a layer-2 bridge that connects to Ethereum.","Fantom Opera is its a standalone network that focuses on decentralized finance, while the new Sonic chain is supposed to link the Ethereum ecosystem with a layer-2 bridge. Sonic will have the \"ability to withdraw funds on Ethereum independently,\" and will generate a proof \"for every asset bridged from Ethereum to Sonic chain,\" said Michael Kong, CEO of Fantom Foundation, in an email to CoinDesk.","Sonic will be \"greatly superior in terms of speed and security compared to the Fantom chain. Over time, we anticipate that users and developers will fully migrate to the Sonic chain,\" Kong added.","According to a press release from the Fantom Foundation, Sonic Foundation will be responsible for the governance of the Sonic ecosystem as well as its treasury. Sonic Labs will focus on decentralized applications and the community for the Sonic network.","The Fantom team also shared that once the Sonic chain goes live, expected sometime this year, the network will have its own native token, $S, “which will be 1:1 compatible with Fantom’s existing $FTM token after a recent governance vote codifying the two tokens' interoperability.”","Alongside the news about the new Sonic entities, Fantom shared that it closed a $10 million funding round led by Hashed, which will go towards growing Sonic’s ecosystem and product.","Sonic Foundation and Sonic Labs will not officially start working until the Sonic chain is up and running.","“I'm incredibly grateful to our investors for their belief in our vision for Sonic and for our dedicated team for their hard work and commitment to ensuring a smooth rebranding process,” said Kong in the press release. “We will continue our legacy of efficacy, transparency, and loyalty to our community in this next stage of the protocol. ”","Read more: Fantom Seeks Money Back From Multichain’s $200M Exploit"],"entity":[{"type":"Thursday","content":"DATE"},{"type":"Michael Kong","content":"PERSON"},{"type":"Kong","content":"LOCATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"$S","content":"MONEY"},{"type":"Sonic Foundation","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"FTM","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Fantom Seeks Money Back From Multichain","content":"ORGANIZATION"},{"type":"$200M Exploit","content":"MONEY"}],"hashtag":["Fantom","Sonic","Funding Rounds","token","layer 1","EVM","Bridge","layer 2"],"authors":["Margaux Nijkerk"]}