{"summary":"Was the decision politically motivated? What does it mean for Ethereum going forward? Will other leading chains benefit too?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/24\/3-questions-about-the-secs-abrupt-eth-etf-approval\/","publishDate":"2024-05-24T18:59:59","id":21403,"type":null,"title":"3 Questions About the SEC’s Abrupt ETH ETF Approval","category":["Opinion"],"content":["The U.S. Securities and Exchange Commission (SEC) confirmed yesterday it has approved critical rule changes to allow for exchange-traded funds holding Ethereum’s native token, ETH. A lot of people were caught off guard, considering that just last week nearly everyone – from Bloomberg analysts to prediction markets – thought it was a lost cause.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","It never really made sense to me why SEC Chairman Gary Gensler would hold out on approving these spot ETH products, considering how the agency was embarrassed during its proactive fight over listing bitcoin ETFs.","Recall that a three-person panel of judges in an appeals court called the SEC’s reasoning for denying (and denying and denying) spot bitcoin funds “arbitrary and capricious,” as it had already approved bitcoin futures products that did substantially the same thing. The same situation has been true for ETH as well, and it’s likely that some firm would have been happy to litigate the matter in the same way Digital Currency Group went to bat for bitcoin ETFs.","This time around, the SEC’s decision seems just as arbitrary, just in the opposite direction. In an interview with CoinDesk’s Jesse Hamilton hours before the approval became public, Gensler said he’d follow “how the courts interpret the law” and that the “DC Circuit took a different view, and we took that into consideration and pivoted.”","See also: Ether ETFs Clear Major Hurdle, Though SEC Hasn't Cleared Them for Trading Yet","So why now? What does it mean for Ethereum going forward? And does this bode well for other cryptos?","As many have already noted, it appears there has been a seachange regarding crypto’s regulatory situation. On Thursday, the House took a historic vote to approve the most substantive piece of crypto-specific legislation to date. This came on the heels of both the upper and lower houses of Congress voting to repeal a controversial SEC crypto custody accounting rule.","With significant participation from Democrats in both bills, it appears that the U.S. government’s long war on crypto is nearing an end. Notably, President Biden announced that he wouldn’t veto the crypto market structure bill, FIT21, which the White House officially opposes – a pretty major concession.","It’s possible that all these events on the Hill acted like a temperature check, and helped convince Gensler that his approach to crypto was becoming a political hazard. Afterall, former President Donald Trump did just announce his support for crypto in a big way – and denying ETH ETFs on the basis, purportedly, that the SEC wasn’t having “productive” meetings with applicants would be great ammunition.","To be sure, the SEC didn’t approve ETH ETFs to actually list anytime soon – just the Cboe, NYSE Arca and Nasdaq’s 19b-4 proposals, which would allow them to list the funds once firms like Ark Invest, Bitwise, BlackRock, Fidelity and Grayscale, among others, get their S-1 filings approved. That could take months.","Well first off, the launch of spot ETH funds means that there may soon be a lot more institutional interest in the second largest cryptocurrency. Not only did the move act as a sort of stamp of approval, it will also create a familiar on-ramp for buying the asset for anyone from mom and pop investors looking to diversify their 401(k)s to hedge funds, much in the same way ETFs did for bitcoin.","“A lot of people have been caught offside by the Ethereum ETF announcement. Even though the Bitcoin ETF created a crypto ETF roadmap for wirehouses and large registered investment advisors, I still expect that many institutional stakeholders are now scrambling to prime their sales teams on the state of Ethereum and put together the proper infrastructure,” Framework Ventures co-founder Michael Anderson said in an emailed statement.","And while ETFs are really just a vehicle for gaining exposure to an underlying asset, it is also possible that these funds will actually drive more users onto Ethereum itself. One scenario: because the SEC likely won’t allow fund managers to stake the underlying ETH, it’s possible new ether investors determine that they want to do it themselves to earn that extra ~3.5% yield.","Relatedly, as Variant Chief Legal Officer Jake Chervinsky noted on X, the approval likely answers one lingering question: whether or not ETH is a security. Chervinsky said, if these funds are allowed to trade, it would likely mean that unstaked ETH, in particular, isn’t viewed as a security at the agency. That in itself may spur more institutions into the market, considering that many are currently holding off simply due to regulatory uncertainty.","On a more technical level, there are many open questions about what it would mean for Ethereum in a world where these funds buy up vast quantities of ETH (assuming they’re as popular) as the bitcoin ETFs. To some degree, the buying pressure would be great for the network and surrounding layer 2s.","Ethereum instituted a burn mechanism that destroys tokens with every transaction, which for a long time made the asset class deflationary. But, with the growing popularity of L2s and alternative chains like Solana, Ethereum transaction volumes have dropped to such a degree that the supply of ETH is growing again, which raises long term implications for the asset’s price and demand. The ETFs could help support the economics of ETH.","See also: Ethereum ETF Approval Could Spur 60% ETH Rally as","Finally, it will be interesting to see how the funds affect the staking economy. Some people have been ringing alarm bells about the amount of staked ETH, now that applications like Lido make it very easy for people to lock up even tiny quantities of the crypto. With the possibility ETFs pull even more ETH out of circulation, these concerns may be compounded.","As mentioned, the approval of ETH ETFs is something of an endorsement for Ethereum, and likely an opportunity for the chain to lock in its already dominant brand position.","“Assuming the Ethereum ETF sees even a fraction of the institutional flows that the Bitcoin ETF saw, I think it's entirely possible that Ethereum will be solidified as the uncontested leader in decentralized app platforms for the next several years, at least in terms of market share and valuation,” Anderson said.","But the move may also open the door for alternative chains like Cardano, Solana and Ripple to also enter further into the world of high finance. Of course, bitcoin and ETH had an easier time (all in perspective) because financial incumbents like CME had already embraced them. Ether futures have been live on CME for three years already, while it’s not even clear whether other crypto assets are being considered.","It’s also worth noting that, while the SEC has hinted it thinks ETH is a security, the agency has proactively come out and said that assets like SOL, ADA and ALGO fit the definition outlined by the Howey Test used to determine whether something is an investment contract. This may be a speed-bump in the road towards a spot SOL ETF.","Edited by Benjamin Schiller."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"DC Circuit","content":"ORGANIZATION"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Michael Anderson","content":"PERSON"},{"type":"Anderson","content":"PERSON"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"3.5%","content":"PERCENT"},{"type":"Cardano","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Chervinsky","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"” Framework Ventures","content":"ORGANIZATION"},{"type":"NYSE Arca","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Opinion","The Node","Newsletters","Ethereum","ETH","Ether ETFs","ETFs","SEC"],"authors":["Daniel Kuhn"]}