{"summary":"Joint CFTC and SEC jurisdiction as outlined in the landmark legislation will add heavy compliance costs, bifurcate global crypto markets and undermine a nascent industry in the U.S.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/24\/the-unintended-consequences-of-fit21s-crypto-market-structure-bill\/","publishDate":"2024-05-24T20:02:01","id":21407,"type":null,"title":"The Unintended Consequences of FIT21’s Crypto Market Structure Bill","category":["Opinion"],"content":["There is no doubt that the bipartisan passage of the Financial Innovation and Technology for the 21st Century Act (FIT21) by the House is a monumental development for the U.S. crypto industry, bringing much-needed regulatory clarity within sight. However, despite its good intentions, FIT21 is fundamentally flawed from a market structure perspective and introduces issues that could have far-reaching unintended consequences if not addressed in future Senate negotiations.","Joshua Riezman is deputy general counsel at GSR.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","One of the most problematic aspects of the bill is its creation of a bifurcated market for crypto tokens. By distinguishing between \"restricted digital assets” and “digital commodities” in parallel trading markets, the bill sets the stage for a fragmented landscape that is ill-suited for the inherently global and fungible nature of crypto tokens and creates first-of-its-kind compliance complications.","This legislative initiative stems from the long-running debates over U.S. federal securities laws application to crypto tokens and the difference between bitcoin, considered a non-security, and nearly every other token. The U.S. Securities and Exchange Commission's (SEC) guidance on whether a crypto token is a security has generally been based on whether the associated blockchain project is \"sufficiently decentralized\" and thus not an investment contract \"security\" as defined by the Howey test.","FIT21 attempts to codify this impractical test by dividing regulatory oversight over spot crypto markets between the Commodity Futures Trading Commission (CFTC) and SEC, based on, among other things, the degree of decentralization.","While the bill helpfully appears to clarify that crypto tokens transferred or sold pursuant to an investment contract do not inherently become securities themselves, it unfortunately contradicts itself by nonetheless giving the SEC plenary authority over such investment contract assets where sold to investors (or issued to developers) for the time period before a project reaches decentralized Valhalla. Only tokens airdropped or earned by end-users are initially “digital commodities” subject to CFTC jurisdiction.","Most confoundingly, FIT21 allows for concurrent trading in restricted digital assets and digital commodities for the same token in separate and distinct markets during this period (as shown in the graphic below). It is likely that many projects would never meet the prescriptive definition of decentralization in the bill and therefore trade in disjointed markets in the U.S. indefinitely.","The bill's proposed bifurcated market for restricted and unrestricted digital assets ignores fungibility as a fundamental characteristic of crypto tokens. By creating categories of restricted and unrestricted assets, the bill disrupts this principle, leading to confusion and market fragmentation. This could impair liquidity, complicate transactions and risk management mechanisms such as derivatives, reduce the overall utility of the crypto tokens and ultimately stifle innovation in a nascent industry.","See also: The Financial Innovation and Technology for the 21st Century Act Is a Watershed Moment | Opinion","Implementing such distinctions would likely necessitate technological modifications to crypto tokens to enable buyers to know which type of crypto asset they are receiving such that they may comply with market-specific requirements. Imposing such technological marking on restricted digital assets, even if possible, would create an \"American-only\" crypto market separate from global digital asset markets, reducing the utility and value of every relevant project.","As shown in the above graphic, tokens may transition back and forth between the SEC and CFTC markets should decentralized projects re-centralize. The complexity and compliance costs created by such a scheme applied to the many thousands of future crypto tokens is dramatically underestimated and would undermine the credibility and predictability of U.S. financial markets. There are precious few examples of financial products transitioning between SEC and CFTC jurisdiction and it's nearly always a tire fire (e.g., the 2020 transition of KOSPI 200 futures contracts from CFTC jurisdiction to joint CFTC\/SEC jurisdiction).","The bill further underestimates the international nature of crypto token markets. Crypto tokens are global assets that trade as the same instrument globally. Attempting to restrict certain assets within the U.S. would likely lead to regulatory arbitrage, where the flowback from international markets would undermine the bill's intent while eroding the competitiveness of the U.S. crypto industry.","Developers and investors outside the U.S. are unlikely to self-impose similar restrictions on restricted digital assets. Therefore, new projects and investors will be incentivized to move development and investment outside of the U.S. to avoid these requirements. This would make it extremely difficult to prevent the U.S. digital commodities market from being flooded with non-U.S. tokens that would have been restricted digital assets had they been \"issued\" in the U.S.","Lastly and ironically, the bill designed to protect U.S. consumers could end up harming them due to poor market structure. The initial CFTC-regulated markets for end users will be full of sellers that generally received tokens for free. This unbalanced market dynamic will most likely lead to depressed prices and increased volatility compared to both the restricted and international markets, with professional arbitrageurs benefiting at the expense of U.S. retail.","See also: Is the House’s FIT21 Bill Really the Legislation That Crypto Needs? | Opinion","This system will further be gamed by insiders and professional investors as arbitrageurs capitalize on disjointed pricing and price jump discontinuities caused by the transition between centralized and decentralized designations. At best U.S. retail markets will be a noisy signal of fundamental value and end-users will be the last to receive institutional liquidity.","While FIT21 is a crucial step towards addressing the regulatory challenges posed by crypto tokens, its current proposed market structure could have unintended consequences. To protect customers and ensure well-functioning U.S. digital asset markets lawmakers must refine the bill to unify spot markets for fungible crypto tokens that are not otherwise securities in a coherent regulatory framework.","Edited by Daniel Kuhn."],"entity":[{"type":"Financial Innovation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Valhalla","content":"LOCATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"The Financial Innovation","content":"ORGANIZATION"},{"type":"House’s FIT21 Bill Really the Legislation That Crypto Needs","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Joshua Riezman","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","SEC","CFTC","Fit21","Regulation"],"authors":["Joshua Riezman"]}