{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For May 23-29. NOTE: Protocol Village will be on a severely limited publishing schedule May 24-June 2 as we cover CoinDesk's Consensus conference in Austin, Texas. We will resume full publishing June 3. Hope to see you there!","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/23\/protocol-village\/","publishDate":"2024-05-24T14:40:52","id":21400,"type":null,"title":"Protocol Village: Who Needs an Off-Ramp? Ether.fi Plans Visa Card for Crypto Degens","category":["Technology"],"content":["May 24: The newest product from liquid restaking startup Ether.fi could finally help \"paper rich\" crypto degens turn their blockchain investments into spending money. Ether.fi Cash will be a mobile wallet and Visa credit card that borrows USDC, the popular USD-pegged stablecoin, against one's decentralized finance (DeFi) investments and can be paid off directly via crypto.","May 23 (PROTOCOL VILLAGE EXCLUSIVE): Cysic, a ZK (zero-knowledge) hardware acceleration company, announced that it has successfully raised $12 million in a pre-A funding round. The round was led by industry leaders HashKey Capital and OKX Ventures, and \"aims to expedite the generation of ZK proofs in a faster, more cost-efficient, user-friendly and decentralized manner,\" according to the team.","EasyA Consensus Hackathon - Call for Participants","This year, Consensus is hosting its first ever in-person hackathon together with the world's number 1 Web3 learning app, EasyA. This will be a three-day, multi-chain IRL hackathon with world-class sponsors from Sui to Stellar to Polkadot and beyond, and will attract the world’s best developers to build the future of Web3 and raise funding for their projects.","Projects launched by EasyA alumni are valued at over $2.5 billion. The EasyA Consensus hackathon is going to be 2024's most important hackathon yet.","We have a few remaining spots left for hackers, so if you're excited about participating, make sure you sign up here!","May 23: Dfinity Foundation, a major contributor to Internet Computer (ICP), announced that its \"EVM RPC canister,\" described as \"a new API that allows ICP smart contracts to read and write data on different chains,\" is now live. According to the team: \"The EVM RPC is another major milestone in the development of Dfinity's Chain Fusion framework. It enables Internet Computer smart contracts to interoperate directly with all major blockchains, including Bitcoin, Ethereum, other EVMs, and soon, Solana, without having to rely on any intermediary.\" Additionally, \"ckUSDC, an interoperable stablecoin pegged 1:1 to USDC, is now available for use across ICP.\"","May 23: Celo Foundation President Rene Reinsberg announced \"Bloom,\" an ecosystem token generation event (TGE) advisory, on Thursday at Dappcon in Berlin. According to the team: \"Created to guide projects across all blockchain ecosystems preparing for a TGE and the product rollout that follows, the foundation will provide strategic and operational support including access to launchpad, exchange support and access to funding and investor network. Bloom unlocks more time and resources for product development and strategy, removing ambiguity so founders can focus on building projects that will create positive externalities for users globally.\"","May 23: Robinhood Wallet will enable gasless swaps on Arbitrum starting Thursday, according to the team: \"Users can swap without needing ETH for gas on Arbitrum, with 0x as the DEX aggregator behind the swaps. Once launched, users will be presented with the best swap rate available – whether gas swap or gasless swap – with no additional fees from Robinhood.\"","May 23: Horizen Labs, a primary developer behind the Horizen blockchain, is launching \"zkVerify, a dedicated zero-knowledge proof verification network designed for settlement optimization, to address the largest expense that zkRollups and zkApps currently face which limit scalability and efficiency,\" according to the team: \"ZkVerify offloads computationally intensive proof verification, enabling blockchains to focus on core functions. It integrates with multiple SNARK proving schemes and reduces verification costs by up to 91%. Currently, it supports Ethereum and Bitcoin L2s, with plans to expand to other architectures. ZkVerify is now live on testnet.\"","May 23: Analog, a layer-0 cross-chain communication protocol and Web3 data provider, launched its incentivized testnet, allocating a minimum of 2% of token supply for participants, according to the team: \"Analog’s testnet is open for developers, community and validators. Participants can complete quests and climb the ATP leaderboard to share $ANLOG. It empowers developers to build dApps with a diverse range of tools while allowing true interoperability between any blockchain network. Analog's core products form a powerful toolkit for cross-chain development.\"","May 23: Zeta Markets, a Solana-based DEX for trading perpetual swaps on-chain, is now planning its own layer-2 solution, 'ZX,' described as an \"optimistic rollup built on Solana,\" according to the team. The mainnet launch is slated for early 2025. Concurrently, Zeta will also release a detailed Litepaper outlining the architecture and functionality of ZX. According to a press release: \"ZX is an optimistic rollup built on Solana, utilizing zero-knowledge (zk) proofs for trustless on-chain settlement... Key features of ZX include high throughput of up to 10,000 transactions per second, sub 10 millisecond transaction confirmations competitive with leading centralized exchanges, seamless one-click trading, and up to 50x leverage with multiple collateral options.\"","May 23: Orderly Network, describing itself as a \"permissionless liquidity layer for Web3 trading,\" has expanded to Polygon PoS by partnering with Quickswap, the leading DEX on Polygon PoS, to launch: Falkor, according to the team: “This integration is a testament to our versatility, as it enables an AMM like QuickSwap to widen their product offering and offer perpetual futures on Polygon PoS for the first time,” said Arjun Arora, COO, Orderly Network.","May 23: River Protocol, created by HNT Labs, founded by Ben Rubin and Brian Meek, who received $33 million funding from a16z Crypto, Benchmark and Framework, is launching Thursday. Ben Rubin is founder of HouseParty and Meerkat. According to the team: \"The River Protocol was designed for decentralized real-time messaging apps. River leverages an EVM-compatible L2 chain, decentralized off-chain nodes, end-to-end encryption and smart contracts on Base. With River, developers can create a wide range of products, including decentralized social networks, community governance platforms, secure messaging apps, and collaborative workspaces.\"","May 23: HAQQ Network, describing itself as an \"ethics-first Web3 DeFi ecosystem with one of the highest daily active user counts on Cosmos,\" announced a \"key partnership with evmOS, an EVM-compatible tech stack. Integration of evmOS functionality into HAQQ Network enables cross-chain compatibility with the Cosmos and Ethereum networks, providing HAQQ users and developers access to a broader range of DeFi functionalities.\"","May 23: The team behind Aptos blockchain shared that \"TruStake Aptos vault will enable users to stake their APT while retaining flexibility and control of their assets – all within a permissioned environment that prioritizes security. Leveraging the scalability and performance of the Aptos blockchain, TruFin’s liquid staking solution will provide holders of APT with the ability to generate staking rewards on their holdings and access additional yield opportunities across DeFi protocols.\"","May 23: As blockchain vies for mainstream acceptance this week in the halls of the United States Congress, a growing number of compliance-oriented crypto projects are hopeful that a more favorable regulatory environment could soon lead to a surge in blockchain-based RWAs, or real-world assets. One such startup, Plume, has raised $10 million in seed funding for what it says will be the first layer-2 blockchain purpose-built for RWAs. The round was led by Haun Ventures and included participation from Galaxy Ventures, Superscrypt, A Capital, SV Angel, Portal Ventures and Reciprocal Ventures.","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","Edited by Bradley Keoun.","\n"],"entity":[{"type":"May 24","content":"DATE"},{"type":"Hackathon","content":"PERSON"},{"type":"Reciprocal Ventures","content":"ORGANIZATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Quickswap","content":"PERSON"},{"type":"Rene Reinsberg","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"Haun Ventures","content":"ORGANIZATION"},{"type":"HouseParty","content":"ORGANIZATION"},{"type":"Brian Meek","content":"PERSON"},{"type":"May 23","content":"DATE"},{"type":"ICP","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Zeta","content":"ORGANIZATION"},{"type":"HNT Labs","content":"ORGANIZATION"},{"type":"RPC","content":"ORGANIZATION"},{"type":"United States Congress","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Dfinity Foundation","content":"ORGANIZATION"},{"type":"Horizen blockchain","content":"PERSON"},{"type":"TGE","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Dfinity's Chain Fusion","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$33 million","content":"MONEY"},{"type":"Ben Rubin","content":"PERSON"},{"type":"$12 million","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"Portal Ventures","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Dappcon","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Robinhood Wallet","content":"ORGANIZATION"},{"type":"Orderly Network","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Arjun Arora","content":"PERSON"},{"type":"$ANLOG","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Bloom","content":"PERSON"},{"type":"91%","content":"PERCENT"},{"type":"Galaxy Ventures","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"HAQQ Network","content":"ORGANIZATION"},{"type":"ATP","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}