{"summary":"Curve Finance had its front end hacked earlier today.\nCurve resolved the issue and recommended that users revoke any approved contracts on its platform.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162604\/curve-finance-resolves-hack-from-earlier-today","publishDate":"2022-08-09T19:47:08","id":2141,"type":null,"title":"Curve Finance resolves hack from earlier today","category":["The Block"],"content":["Curve Finance resolved a hack it suffered earlier today, the company said in a late-afternoon Twitter update.&nbsp;&nbsp;","The hack was discovered when a Paradigm researcher <a href=\"https:\/\/twitter.com\/samczsun\/status\/1557100692518473728\" data-v-f87c67ca=\"\">tweeted<\/a> that Curve's front end had been compromised.","The Curve team was able to find and revert the hack, and issued <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1557116419497672711?s=20&amp;t=1apwa7nwNI7EC9C5cmsmAA\" data-v-f87c67ca=\"\">a statement<\/a> asking people to revoke any contract approvals on its platform.","The hacker used a Domain Name Service (DNS) spoofing hack, cloning the site and redirecting the DNS point to their IP address. Then, they added approval requests to a malicious contract to steal the funds.&nbsp;","Users who had connected to Curve with their web3 wallets were at risk of having their funds stolen. ZachXBT, an anonymous on-chain investigator, <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1557101229553197057?s=20&amp;t=1apwa7nwNI7EC9C5cmsmAA\" data-v-f87c67ca=\"\">reported<\/a> that the hacker took approximately $570,000. The hacker tried moving funds through FixedFloat, a fully automatic cryptocurrency exchange on the Bitcoin Lightning Network. The exchange froze and secured roughly $200,000 of the stolen funds.","\"This did not appear to be a hijack at the registrar level, but rather systems at @iwantmyname compromised themselves,\" TCPShield founder Steven Ferguson <a href=\"https:\/\/twitter.com\/szferguson\/status\/1557125517127696384?s=20&amp;t=KK46rVyzg_DRh4gZTjCNmg\" data-v-f87c67ca=\"\">tweeted<\/a>. His company is a Distributed Denial-of-Service (DDoS) protection platform.","Curve Finance is one of the largest decentralized exchanges by total value locked (TVL), holding over $6 billion.&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;"],"hashtag":[]}