{"summary":"A year ago, “Crypto+AI” sounded like a game of “VC mad libs.” Now, as real-world applications begin to emerge, the idea makes much more sense. Jeff Wilser, who is hosting the AI Summit at Consensus 2024, offers a preview of the programming and reviews the decentralized AI state-of-play.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/23\/why-decentralized-ai-is-gaining-steam\/","publishDate":"2024-05-23T14:15:00","id":21413,"type":null,"title":"Why Decentralized AI Is Gaining Steam","category":["Consensus Magazine"],"content":["Almost exactly one year ago, I wrote a piece for CoinDesk called 10 Ways Crypto and AI Can Make Each Other Better (or Maybe Worse). At the time, the idea of “Crypto + AI” was still a novel concept. Even fringe. To many, AI development felt adjacent — at best — to the world of Web3. To others, “Crypto + AI” felt like a cynical mix of two hype-y trends, like VC mad libs.","Flash forward one year.","Decentralized AI is arguably the hottest topic in the web3 space. Dozens of projects — maybe hundreds, it’s hard to keep track — are now racing to merge the tools of blockchain with the taming of AI. The space is booming. By the time you finish reading this article, another DePIN startup will have launched. And the architects of this movement are converging in Austin, for Consensus 2024, in CoinDesk’s inaugural “AI Summit.” (I’ll cop to some bias: I helped organize the event and I’ll be hosting on May 31.)","So why is this happening, and why does it matter?","You could argue that the stakes of decentralized AI are higher than the stakes of decentralized finance. In some ways the principles are the same. Satoshi Nakamoto was wary of centralized financial institutions that acted badly and jeopardized people’s money. As AI becomes a greater part of our lives — and that feels inevitable — it will have the power to shape how we see the world, how we interact with the world, and how we present to the world. It could shape how we think. Should this be controlled by the billionaire de jour?","Let’s look at two concrete examples, one that’s straightforward and one that’s chilling. The next frontier of Gen AI is likely the rise of AI agents, which can do things like book your flight, pay your phone bill, or invest your money in stocks. (“Hey Siri, go ahead and put $1,000 in the S&P.”)","Do we want Big Tech to control not just our data, but also what we do with it?","More chilling: It’s likely that millions of people will someday use AI chatbots — perhaps through audio or even video — as coaches or even therapists. Early versions are here now. (On my podcast AI-Curious, for example, I interviewed a longtime coach who’s working with the German Research Center to develop AI-based personal coaching. It’s coming. It’s inevitable.) Millions of people will share their inner-most thoughts, longings, fears, sexual desires, confessions and embarrassments. Do we want this sliced and diced by Zuckerberg and co.? The decentralized and privacy-preserving tech of blockchain, potentially, could give us the fruits of AI without the poison of Big Tech.","These are the stakes of decentralized AI. These are the topics covered at the AI Summit. (Or some of the topics. Others include how blockchain can help us preserve truth in an era of deepfakes, fight censorship, make “AI compute” more inclusive, fight bias, lead to AI alignment, and on and on.)","While an explosion of AI + Crypto projects have launched since 2022, some have been around for years and have been quietly building. One is Singularity NET, founded in 2017 by Ben Goertzel, a prominent AI researcher, with an early vision of building decentralized AI. “My initial vision for what became SingularityNET occurred to me in ’95 or ’96, when the internet became a thing,” Goertzel told me recently in Panama City, at an AI conference hosted by Singularity. “It seemed to me, the internet shouldn’t be centralized. The internet is a decentralized network. So why would you want to have a centralized search service?” The seeds of this idea included AI (which he has studied since the 80s), and Goertzel has the receipts: A 2001 book “Creating Internet Intelligence” that fuses all these concepts.","Goertzel will share his thoughts on how to actually pull off this vision at the AI Summit, along with other pioneers trying to hammer out the plumbing, pipes, and protocols of decentralized AI. That brings us to DePIN (or decentralized physical infrastructure networks), where communities of token-holders are incentivized to participate in building online services.","Gensyn, for example, is building a decentralized network that will let the untapped computing power from individual users (like you and me) be harnessed for the training of AI data, a la Filecoin for cloud storage. “We’re kind of running out of places to build enormous data centers,” Gensyn’s co-founder Ben Fielding told me last year, before this became a trendy topic. If Gensyn pulls this off, says Fielding, “You don’t just have one big data center. Now you have every data center on the planet.” (Fielding will also be taking the stage at the AI Summit, along with the heads of DePIN projects IoTeX and Grass.)","While many of the Web3+AI projects are infrastructure plays, there are now attempts to build decentralized GenAI models that compete directly with the OpenAIs of the world. And that gets us to another example of the crypto-meets-AI space, Erik Voorhees, a bitcoin OG who has vocally supported Morpheus (decentralized and open-sourced AI) and recently announced the launch of VeniceAI.","In a Twitter\/X thread, Voorhees argued that Venice is similar to centralized chatbots like ChatGPT and Claude and even Grok, but “without all the Orwellian stuff” and that “Venice doesn’t spy on you,” “Venice doesn’t censor your conversation,” and “Venice doesn’t inject bias, safetyism, or political propaganda.” Only 10 days later he showed it in action and said, “There are no ads in Venice.ai and you get basically the same answer as MSFTCopilot.” Shots fired.","Voorhees and Venice are just some of the players in this space. There are countless more. Every day there’s a new launch or new partnerships. Just in the last few days, for example, Eternal AI announced a partnership with Filecoin, as a Twitter\/X post explained that “Filecoin will provide decentralized storage for AI models, while Eternal AI, with its network of AI agents, will provide decentralized inference.”","One reason these projects are all suddenly so prevalent? To be cynical for a moment, sure, there’s heat in the space and VCs like heat. (The return of a crypto bull market doesn’t hurt.) But another reason is that, in a sense, there are no other options. There aren’t many centralized AI players. The costs are staggering so only a handful can play at the table.","“The power concentration [of AI] is getting worse, not better,” says Nathaniel Whittemore, aka NLW, host of the AI Daily Brief and founder of BeSuperAI, who’s hosting an AI Town Hall at Consensus. “And greater concentration leads to more of a feeling of a need for decentralized approaches.”","None of this will happen overnight. In some ways, it’s all still a longshot. We need the smartest people in the space to collaborate, argue, and swap ideas and inspiration. We need an AI Summit.","Edited by Benjamin Schiller."],"entity":[{"type":"2017","content":"DATE"},{"type":"Claude","content":"PERSON"},{"type":"Voorhees","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"Nathaniel Whittemore","content":"PERSON"},{"type":"Panama City","content":"LOCATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Ben Fielding","content":"PERSON"},{"type":"Goertzel","content":"PERSON"},{"type":"Venice","content":"LOCATION"},{"type":"Filecoin","content":"PERSON"},{"type":"Ben Goertzel","content":"PERSON"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"German Research Center","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2001","content":"DATE"},{"type":"Singularity","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"AI Town Hall","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Siri","content":"PERSON"},{"type":"May 31","content":"DATE"}],"hashtag":["Features","Consensus 2024"],"authors":["Jeff Wilser"]}