{"summary":"In addition to common stocks, opportunistic crypto developers issued scores of meme coins on various blockchains to capitalize on the hype.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/13\/solana-memes-gamestop-stock-jumps-44-in-premarket-as-roaring-kitty-returns-on-x\/","publishDate":"2024-05-13T12:50:55","id":21412,"type":null,"title":"Solana Meme Coins, GameStop Stock Rocket as 'Roaring Kitty' Returns on X","category":["Markets"],"content":["A single picture on Monday sparked rallies across some cat-themed meme coins and Gamestop stock (NYSE: GME) as market cults heralded the apparent return of TheRoaringKitty, the X profile of retail trader Keith Gill, who made his first post since late 2021.","Gill posted a meme that refers to a period of “locking in,” a colloquial term for a period of intense focus or concentration. Users on X and Reddit largely seemed to consider the image as a sign to lock into trading markets.","Stocks related to Gill and other “meme stocks,” surged. GME prices were up as high as 44% in pre-market trading, and surged as high as 100% on market open before trading was halted. Cinema chain AMC Entertainment Holdings (NYSE: AMC) was up 12% in pre-market, rising to as much as 30% after open.","An unaffiliated GameStop meme coin on the Solana blockchain surged more than 550%, DEXTools data shows, while an AMC token jumped 1,200%. Some microcap cat-themed meme coins such as kitty (KITTY) rose thousands of percent, while larger tokens popcat (POPCAT) and mog (MOG) rose over 15%. Larger-cap meme coins (DOGE) and (SHIB) were higher by 5% and 7%, respectively.","Data shows that opportunistic developers issued a slew of tokens referring to Gill, TheRoaringKitty, GameStop, and “stonks” – a meme term for stocks—in the past 24 hours.","Gill’s analysis of the video game retailer GameStop on Reddit, starting in 2019 and gaining traction during the COVID pandemic, created a viral phenomenon at the time. It was largely cited as a driving factor in the GameStop short squeeze of January 2021 as several small-time traders banded together and purchased options and leveraged shares of the company.","The stock rose from $4 to over $120 in a month and, at its peak, was up thousands of percent from its lifetime low of 64 cents in April 2020.","Gill’s initial $53,000 investment was worth nearly $50 million at its peak, emerging as a rags-to-riches story of a lone trader making a fortune from his bedroom by betting against hedge funds. One of the most prolific losers was Melvin Capital, a fund that lost billions of dollars betting on the decline of meme stocks, among other bets that move against it.","Edited by Oliver Knight."],"entity":[{"type":"Keith Gill","content":"PERSON"},{"type":"1,200%","content":"PERCENT"},{"type":"Reddit","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"April 2020","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"Oliver Knight","content":"PERSON"},{"type":"12%","content":"PERCENT"},{"type":"44%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Gamestop","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"550%","content":"PERCENT"},{"type":"$4","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"Melvin Capital","content":"ORGANIZATION"},{"type":"$120","content":"MONEY"},{"type":"GME","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"7%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"AMC Entertainment Holdings","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"64 cents","content":"MONEY"},{"type":"$53,000","content":"MONEY"},{"type":"Gill","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Trading","Investing","Markets"],"authors":["Shaurya Malwa"]}