{"summary":"One of the most powerful women in finance talks to CoinDesk ahead of her Consensus appearance.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/23\/innovation-continues-to-occur-in-siloes-dtcc-digital-head-nadine-chakar-on-responsible-blockchain-building\/","publishDate":"2024-05-23T13:22:55","id":21418,"type":null,"title":"‘Innovation Continues to Occur in Siloes’: DTCC Digital Head Nadine Chakar on Responsible Blockchain Building","category":["Consensus Magazine"],"content":["Nadine Chakar is often called one the most powerful women in finance. As global head of the digital asset wing at DTCC, which settles an astronomical amount of transactions annually (in the quadrillions), she has a front row seat to how technology is reinventing finance before our very eyes. Which might be why she’s become such a staunch advocate for blockchain-based innovations.\n\nNadine Chakar is a speaker at this year’s Consensus festival, in Austin, Texas, May 29-31.","“With tokenization, firms could be more capital-efficient, create new business models and more easily expand product offerings and distribution channels. Firms could unlock new efficiencies and uncover ways to streamline existing processes while finding new markets and ways of unlocking liquidity – and they can likely do it cheaper and faster,” Chakar wrote in a CoinDesk op-ed.","Chakar, who has over 30 years of experience of global wealth and asset management experience, has essentially charted her own path through the world of finance. Before DTCC (which acquired her compliance-focused tokenization firm Securrency in 2023), Chakar served as an executive vice president at State Street, where she essentially built out the State Street Digital unit after a stint as executive vice president of the firm’s global markets division.","“This blend of experience between the traditional and the startup worlds has helped me, as a leader, to better understand how to strike the right balance between agile and responsible innovation,” Chakar said in an interview.","See also: What Consensus Speakers Are Looking Forward to This Year","CoinDesk caught up with Chakar to discuss her career history, how she views digital transformation and what responsible regulation for crypto would look like.","To what extent did your career at places like State Street Digital and BNY Mellon prepare you to lead the digital asset business at DTCC?","I have a history of working at heavily-regulated financial institutions, which has given me expertise leading teams that can innovate in a responsible, transparent way that meets the highest regulatory standards. However, given my time as CEO of Securrency, I’ve witnessed the power of a fintech that can innovate quickly. This blend of experience between the traditional and the startup worlds has helped me, as a leader, to better understand how to strike the right balance between agile and responsible innovation.","Now that Securrency has become DTCC Digital Assets, I believe we’re leveraging the best of both worlds. We combine DTCC’s legacy of trust and experience as the infrastructure for the world’s largest capital markets with Securrency best-in-class technology capabilities.","Are you observing digital assets impacting traditional financial markets?","I believe digital assets are largely operating in a different universe from traditional markets. However, I think we’re at a turning point where the two are starting to converge. A major challenge is that innovation continues to occur in siloes, where financial institutions will team up with a fintech [company] to launch a pilot, only to culminate with a press release and then fizzle out afterward.","We’re calling for a change in approach: we should focus on large-scale pilots with many participants and have experiments build upon each other incrementally to begin building a larger, interoperable digital asset ecosystem that can power digital markets.","It's often said that market structure for digital assets needs reform: Do you have ideas of what this should look like?","We require an ecosystem for digital assets that’s worthy of the one we have for traditional assets today. First and foremost, we need infrastructure that can connect traditional systems with the digital ecosystem and that provides the same level of soundness and safety of existing offerings. Second, we must ensure we’re facilitating how assets and processes can move across multiple blockchains.","Third, we must have a clear legal and regulatory framework to establish controls and standards. This is essential, and it should include standards for data, including its use and collection, methods to protect private data and establishing exactly what data is allowed on-chain.","See also: A Crypto Developer's Guide to Consensus 2024","Of course, DTCC has been bringing this sort of expertise to the markets for over 50 years. We have the established ecosystem for traditional securities, which will serve as the foundation for creating the digital infrastructure of the future. We are also here to help guide the evolution of the regulatory framework over time to support digital assets.","We can’t do it alone. This is why we’ve partnered with other financial market infrastructures, Euroclear and Clearstream, to issue a new paper that lays out the path forward for developing this ecosystem in a measured and collaborative way. We’re excited to announce the paper at Consensus.","What are you most looking forward to at Consensus?","Networking and connecting with colleagues. It’s worth repeating: the path to creating the digital asset ecosystem starts with collaboration. While there will always be room for firms to compete with their own bright ideas and compelling use cases, we won’t make meaningful progress on tokenization without working together. I’m excited for the industry to collaborate to bring a robust, interoperable digital asset ecosystem to life."],"entity":[{"type":"Crypto Developer","content":"ORGANIZATION"},{"type":"Securrency","content":"ORGANIZATION"},{"type":"May 29","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Euroclear","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"31","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"Nadine Chakar","content":"PERSON"},{"type":"State Street Digital","content":"ORGANIZATION"},{"type":"Chakar","content":"PERSON"},{"type":"State Street","content":"ORGANIZATION"}],"hashtag":["Opinion","Consensus 2024","DTCC"],"authors":["Daniel Kuhn"]}