{"summary":"With the U.S. tax deadline (April 18) around the corner, confusion about cryptocurrency taxes abounds. Here are some ways you might have your facts wrong, according to ZenLedger COO, Dan Hannum. This piece is part of CoinDesk's Tax Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/02\/23\/4-crypto-tax-myths-you-need-to-know\/","publishDate":"2022-02-23T19:49:19","id":21428,"type":null,"title":"4 Crypto Tax Myths You Need to Know","category":["Consensus Magazine (layer2)"],"content":["Our first myth about crypto taxes is far and away the most popular misconception. Some people believe the only taxable transaction is cashing out from crypto to fiat (U.S. dollars, or USD).","This is very far from the truth – many different types of crypto transactions are taxable, not just cashing out to fiat currency. Crypto-to-crypto swaps (including non-fungible tokens), staking rewards, mining and airdrops are all examples of taxable events within the crypto ecosystem that don't involve cashing out to fiat.","This article is part of CoinDesk’s Tax Week.","Let's take a look at an example to understand this concept better:","In early 2021, Timmy bought ether (ETH) on Coinbase. He sent this ETH to his MetaMask wallet, and started using decentralized exchanges like Uniswap, staking some ETH on Lido and buying\/selling NFTs on OpenSea. By December 2021, Timmy made some solid profits and pulled out the majority of his cryptocurrency by selling for USD on Coinbase.","If Timmy is in the group believing only that final transaction into USD was taxable, he’d be incorrect – many of the transactions he made, such as making swaps on Uniswap and buying\/selling NFTs, are all individually taxable transactions. Knowing what types of transactions are taxable, and which aren't, can better help you put funds aside to be prepared for tax season.","A common theme we see in the crypto community is anonymity. Although anonymity is very possible in crypto, and is a pillar to decentralization, it only lasts as long as the government\/Internal Revenue Service wants it. Meaning, you can think your wallets are anonymous and untraceable but in reality that is not the case.","In its simplest terms, the blockchain is a public ledger where every transaction is verified in a decentralized manner, making all the transactions public domain (outside of a few exceptions). If you go to etherscan.io you can look at any wallet, any transaction, any contract and see the exact details of what is transpiring on the Ethereum blockchain.","Because of this public transparency, it is very easy for the IRS to link “anonymous” wallets to people. This is because at the beginning of nearly every person's transaction history is an on-ramp via know-your-customer (KYC) rules that exchanges like Coinbase are required to follow. These exchanges are required to report customers’ activity to the IRS, which gives the agency information about users. From this on-ramp, if the assets are sent to a decentralized wallet provider or non KYC’d exchange, the IRS can follow these transactions and easily associate each new wallet with the person who funded it. If you buy ETH on Coinbase, send to Metamask then bridge to Avalanche, the IRS will associate the Metamask and Avalanche wallet with the KYC’d Coinbase account that funded the wallets, thus revealing the wallets’ owners.","The blockchain is quite easily traceable as is. With the IRS investing billions of dollars into blockchain tracking technology, it will continue to be able to have visibility on-chain.","Read more: US Crypto Tax Guide 2022","Many people believe that as you take profits the total gains only go up and you end up having to pay this inflated amount come tax season. Although this is partially true there are some things to know about how taxes are calculated, and the strategies to lower them.","First, you need to understand what capital gains are: profits generated from selling a cryptocurrency – or any other asset, for that matter. When you sell a digital asset like crypto for more than you bought it, you must report that capital gain to the IRS on your taxes. Many people think this is where taxes end.","Fortunately, at the end of each year, the IRS allows you to match your capital gains and losses to determine your net capital gain or loss. You can use up to $3,000 in net capital losses to offset your other taxable income, and any additional losses can be carried forward into future years to offset either capital gains or up to $3,000 per year in ordinary income.","For example, Timmy buys 2x APE NFTs at $50 each. They dip initially and he sells one for a loss at $40, but then they pump and he sells the second one for $70. Although Timmy profited $20 on the second sale, the $10 loss from the first sale will offset these gains and he will only have to pay taxes on the net $10 profit.","Now that you understand capital gains, here are the ways to deliberately lower taxes once transactions are locked in for profit:","Tax loss harvesting: If you hold assets that are worth less than what you paid, you can sell to realize these losses in order to offset cap gains! Because there is no wash-sale rule for digital assets (yet), you can buy them back immediately after selling. (Check out ZenLedger’s ’’Tax Loss Harvesting Guide’’ and tool for more details on how to execute these savings.)","Another way to lower taxes once profits are locked in is via donations. Donations of appreciated assets\/charitable donations are tax-deductible for taxpayers who itemize deductions. For 2021, the IRS also provides a tax deduction of up to $3,000 for people using the standard deduction. Learn more about crypto donations here.","Read more: You May Owe Crypto Taxes on These Surprising Things in 2022","When importing wallets and organizing transactions in a crypto tax software like ZenLedger, people are often only calculating their taxes for one year but don't realize that all transaction data prior to the reporting year need to be imported as well.","To get your current year taxes correct, the software actually needs to look at the transactions from previous years so it can find your correct cost basis including gains, losses and transaction fees. So if you only want your 2021 tax reports but have been trading crypto since 2016, we would still need all of your transactions from the very first trade to get all of your reports as accurate as possible.","For example: Timmy bought 1 bitcoin in 2017 for $10,000 then sold it in 2021 for $50,000. Timmy knows he needs to pay taxes on profit, but if he only imports his 2021 transactions the software will be unable to see how much he paid for the bitcoin in 2017, and therefore unable to calculate the profits\/tax liability accurately. Once he imports all his historical data, the software will see that he held the bitcoin for four years and had a gain of $40,000, and apply the necessary tax implications.","Large numbers of transactions and little guidance from the IRS can make doing your crypto taxes a very daunting task. It is important to keep in mind the basics mentioned above so you can better manage your portfolio and be prepared for tax season.","Meet the yoga instructors, limo drivers and real estate agents who've been to hell and back.","Tax guidance lags innovation. So does tax software. Meanwhile, misconceptions abound. If not careful, investors can end up owing more tax than expected and having to unload crypto to pay the bill.","Investors in MicroStrategy, Tesla, Block and Coinbase need to consider how wild price swings will affect results, not only directly but indirectly due to complex tax accounting rules."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"$50","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"Coinbase","content":"PERSON"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"Timmy","content":"PERSON"},{"type":"$20","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"$40","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"US Crypto Tax Guide 2022","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Owe Crypto Taxes","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"Timmy","content":"ORGANIZATION"},{"type":"$70","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":["tax week","Crypto Taxes","Opinion"],"authors":["Dan Hannum"]}