{"summary":"Gitcoin founder Kevin Owocki writes about why 2023 is the year of \"regenerative cryptoeconomics.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/26\/from-degen-to-regen-how-web3-started-playing-positive-sum-games\/","publishDate":"2022-12-26T14:22:34","id":21427,"type":null,"title":"From Degen to Regen: How Web3 Started Playing Positive-Sum Games","category":["Consensus Magazine"],"content":["Back during the DeFi Summer of 2020 – ages ago in Web3 time – the meme “degens” came about as a way to describe Web3 enthusiasts who were yield farming on systems with high annual percentage yield (APY) and high likelihood of failure. It’s a playful term that’s also revealing of the industry’s mercenary and self-interested side.","In the first two years of the decade, driven by headlines, rising prices and FOMO, thousands of traders entered Web3 with the intention of making a quick buck. And despite a steep sell-off this year, crypto continued to go mainstream. There were Super Bowl ads. News of banks using decentralized finance (DeFi). And, yes, negative press about all the bankruptcies.","Sadly, with the implosion of custodial systems like BlockFi and FTX a lot of people lost money. That is really bad for the people who were hurt and destructive for the space.","Kevin Owocki is the chief executive and founder of SuperModular and co-founder of Gitcoin. This article is part of Crypto 2023.","Since Satoshi solved the Byzantine Generals Problem in the Bitcoin white paper, there have been boom and bust cycles in crypto that, from an evolutionary perspective, are similar to natural systems. In times of abundance, thousands of new projects blossom. In times of scarcity, projects fail. The survivors will be the dominant species of the next boom (as visualized in this poster I made).","Survival of the fittest is a simple yet powerful mechanism observable in the Web3 ecosystem – the fit best meet the preferences of markets. It might explain why degens, seemingly interested in short-term advancements rather than long-term success, hit a dead end. It turns out purely self-interested behaviors are maladaptive in Web3 (as they are many places in nature).","Indeed, the industry that’s now known as Web3 has always had a side of it that is about more than greed and profit. Crypto is a tool for building collaborative organizations and sharing resources – the long-term trends that have always motivated participants.","Recently, there’s been increasing awareness and focus on how blockchains, distributed systems with decentralized buy in, support public goods. Public goods are the stuff we all rely on (like open-source software or privacy research) but are hard to maintain and fund.","See also: The Next Step in the Evolution of Web3: Regenerative Finance | Crypto 2023","Another term for this is “regenerative economics,” the idea that money can be used to incentivise communities to solve systemic issues. Even when open-source projects fail, the exercise can benefit the rest – if everyone is moving along the same axis towards social betterment. Innovate, iterate, evolve, repeat.","That’s why, even in the pits of crypto winter, 2023 is ripe to be the year of the regen.","Degens came to Web3 seeking financial upside. Regens are those who are working or building in regenerative cryptoeconomics. They have a long-term view on how Web3 can be good for the world, but not just in the financial sense.","Regens see how financial systems could be designed to act as channels for greater human flourishing in service of all of humanity’s needs. My friend Gregory Landua, co-founder of the Regen Network, argues people have eight essential needs that could be expressed as forms of capital. Beyond financial capital, there’s our social, material, living, intellectual, experiential, spiritual and cultural needs.","See also: How DeFi 'Degens' Are Funding the Next Wave of Open Source Needs | Opinion","With programmable money, we can program our values into our money. Crypto has it within itself to create systems equally as extractive and fragile as the existing financial system. When a degen trades, he’s playing a zero-sum game – the tokens leave his wallet and enter the counterparty’s wallet and visa-versa. But Web3 can also build more positive sum protocols that expand resource capacity over time.","There is a common thread linking many people in the regen ecosystem. They used to be degens! Lured by the promise of better economic circumstances for themselves and their family, they entered the ecosystem to make a profit.","Over time, however, they grew enamored by the promises of collective action – often through the direct experience of contributing to or using a project. Their attitude and incentives shifted. That’s by design, built into the structure of crypto-economic systems. For instance, decentralized autonomous organizations (DAO) allow people with a shared mission to come together and pool resources – everyone involved is at least partially aligned in their values and commitments.","See also: The One Word That Defines Ethereum's Goals | Opinion","When you join such a community, you start learning to manage risk and ride the volatility. You think differently about capital allocation. But sometimes it takes more than that to get the bigger picture.","Many regens are former degens who took this journey during the last cycle, in 2017. And that’s partially why I’m so optimistic about the future of regenerative systems. There are thousands and thousands of people who are newer to crypto, who came into Web3 in the last year or so, and they are likely on step two of the journey (i.e., down bad) now. They’ve made mistakes and learned from them, a base of knowledge that can serve for a more pragmatic approach to the next market cycle.","The window of opportunity is here for newcomers to Web3 to move to step three – find community and discover crypto’s regenerative use cases. From there they will build the next cycle of projects, many that will be positive and impactful for the world.","People sometimes say to me, “Hey Kevin, this talk of regenerative crypto-economics is great, but are there any examples of theory in action?”","Regen is not just talk. It is happening! In fact, Alejandra Borda and I wrote an entire book detailing 100 different examples of projects where people are using crypto to regenerate the world.","To namedrop a few: Proof of Humanity, Celo, Kolectivo and Gitcoin (the crypto-based crowdfunding protocol I built) are all doing worthy things.","In this down cycle we have an opportunity to filter the noise from the signal and rediscover our purpose. Through decentralization and peer-to-peer technology we can build a more fair, just and less extractive financial system. We can bring more democratic, more organic financial tools to the masses.","As individuals, we can find community, join a DAO and BUIDL on the projects that could serve as the foundation of the next era of Web3. It’s the year to build projects that are democratic, prosocial and net-positive for the world.","To regain legitimacy, the Web3 ecosystem must find ways to rotate capital, attention and talent away from the projects that have the best Ponzi-nomics and towards the projects that are going to have the most durable positive impact. We want this not because we want crypto to look good for the world, but because we want crypto to be good for the world.","Many of today's most mainstream crypto projects have positive externalities. For example, OpenSea, the largest non-fungible token (NFT) exchange, has allowed thousands of artists to monetize their work and generate new forms of income that are less extractive than their Web2 counterparts.","Lens Protocol, a Web3 social media platform that’s generating increasing buzz in crypto amid changes at Twitter, are enabling people to own their own data and to take their social media presence from site to site. Web3 social media has the potential to disrupt tech giants. (Disclosure: I am a Lens Protocol angel investor.)","Proof Of Humanity, a registry of 18,000 Sybil attack-resistant identities, is using UBI tokens to pay people a stipend. Gitcoin is a crowdfunding platform that has delivered $72 million worth of funding to public goods and recently released a suite of protocols that allows others to crowdfund for their communities. Kolektivo is a suite of protocols that allow local communities to launch, finance and govern their own regenerative economies.","See also: Who Is Building Ethereum's Public Goods? | Opinon","Web3 carbon credit systems such as KlimaDAO and Toucan Protocol allow for better, faster and cheaper carbon credit trading. While carbon credits are not perfect, Web3-enabled systems such as Hypercerts allow users to reward projects with observable outcomes. Moreover, hypercerts can be used beyond climate concerns in impact areas such as education, health care, AI safety and open-source software.","2023 will be the year of the Regen. We will rebuild and regenerate not just the Web3 space, but our communities and ourselves.","If you would like to get involved in the regen space, consider purchasing \"ImpactDAO\" and \"Greenpill\" books on the Gitcoin store. Use code WEB3_CAN_REGENERATE_THE_WORLD for 100% off the digital editions of either book."],"entity":[{"type":"Kevin Owocki","content":"PERSON"},{"type":"Regen","content":"ORGANIZATION"},{"type":"Regenerative Finance | Crypto 2023","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Alejandra Borda","content":"PERSON"},{"type":"$72 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Kevin","content":"PERSON"},{"type":"Summer of 2020","content":"DATE"},{"type":"regen","content":"ORGANIZATION"},{"type":"Gregory Landua","content":"PERSON"},{"type":"Twitter","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Celo","content":"PERSON"},{"type":"Kolectivo","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Regen Network","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Degens","content":"PERSON"},{"type":"first two years of the decade","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crypto 2023","Opinion","Ethereum","Web3"],"authors":["Kevin Owocki"]}