{"summary":"With marginal rates, excise tax and the potential for foreign tax credit mismatch, crypto income could be taxed at an 80% or higher.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/18\/crypto-employee-compensation-pitfalls\/","publishDate":"2022-11-18T16:56:11","id":21429,"type":null,"title":"The Pitfalls of Being Paid in Crypto","category":["Layer 2"],"content":["Increasingly, companies are seeking to compensate their employees and other service providers with crypto and other digital assets.","This practice raises similar issues to ones that arise when compensating employees or paying service providers with equity. These types of compensatory digital assets grants require thoughtful and strategic planning.","Amy Sheridan and Natalie Lederman are both partners at law firm Sullivan & Worcester LLP. This article is part of CoinDesk’s Tax Week.","Although many crypto companies set up operations outside the states – and may undertake great efforts to avoid having any U.S. footprint – U.S. tax rules have a very broad reach for individuals.","If compensatory digital asset grants are made to U.S. citizens, green card holders or residents, (or to anyone doing any work in the U.S. at the time of the grant, or vesting and exercise periods), U.S. tax rules will apply. In other words, receivers will likely have to pay U.S. taxes.","Failing to consider U.S. tax rules can have terrible consequences for employees. If violated, a particularly nasty U.S. Internal Revenue Service (IRS) code – specifically, Section 409A - imposes a 20% excise tax (plus a premium interest penalty). That provision also requires income inclusion at vesting, even if the digital asset grant is not liquid (like many locked-up tokens) or has yet to be transferred.","Read more: What's the Matter With Delaware? How Joe Biden's Home State Became a Global Tax Avoidance Hub \/ Opinion","In addition to creating a liquidity problem for the (often unsuspecting) employee, it also can result in a foreign tax credit mismatch, making a credit essentially unavailable and resulting in an even higher tax rate on income that is already taxed at the highest marginal tax rate in the U.S.","Between the high marginal rate, the excise tax and potential for foreign tax credit mismatch, it is not difficult to imagine scenarios where crypto or digital asset grants are taxed at an 80% or higher effective rate due to poor planning.","It’s likely fair to say that U.S. tax rules are generally not designed with crypto or digital asset grants in mind. While this makes these grants more complex to design (compared to traditional stock or partnership interests), it also creates opportunities for creativity.","In general, U.S. tax rules treat token or crypto grants as transfers of , or promises to transfer, property. Such arrangements tend to be designed as either options to receive the digital asset as an outright grant of that asset and therefore subject to forfeiture conditions, or as promises to grant the asset once certain vesting conditions are satisfied.","Each of these structures, however, have advantages and disadvantages. Among those concerns is the flexibility employers have around timing a compensatory transfer. This impacts the potential for favorable capital gains tax rates on an eventual sale of the asset, liquidity and valuation risks as well as the overall complexity of the arrangement – all of which need to be carefully managed.","U.S. tax rules generally require income inclusion (and reporting) when the subject digital assets are transferred to employees and, under certain circumstances, at vesting.","The fair market value of a digital asset is taxable, making it subject to ordinary income tax at that time. Under certain circumstances, employment taxes (i.e. Social Security and Medicare taxes) may be due at vesting, which may or may not be at the time of transfer. Further, the date of transfer or vesting may or may not occur at the same time the digital asset is liquid.","These same liquidity issues arise in traditional equity transfers to employees and are typically handled through “net” or “cashless” mechanisms, whereby the amount of equity the employee ultimately receives is reduced to reflect tax amounts that are paid on the employee’s behalf.","Read more: Crypto Capital Gains and Tax Rates 2022","Employers will often align the tax event with the liquidity event to limit confusion here. This sometimes also includes using another arrangement to provide cash to the employee or service provider, such as a loan or additional cash bonuses.","In the digital asset context, however, these solutions are not always available or desirable.","First, the value of digital assets can be highly volatile, even over short periods of time. Accordingly, the tax due with respect to the subject digital asset may far exceed the employee or service provider’s regular compensation levels or what the company can realistically provide to the employee to manage liquidity problems.","Second, if the subject digital asset is viewed under applicable federal securities laws as a security, then the employee may required to hold the digital asset for up to one year following the tenets of Rule 144 of the United States Securities Act of 1933.","In light of the tax, securities law and other ambiguities that continue to exist in the context of compensating employees and other service providers with crypto and other digital assets, it is critical to exercise care and caution, and to seek expert counsel to avoid some of the most common complications and pitfalls."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Delaware","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"U.S. Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"Crypto Capital Gains","content":"ORGANIZATION"},{"type":"Avoidance Hub \/ Opinion","content":"ORGANIZATION"},{"type":"Natalie Lederman","content":"PERSON"},{"type":"Sullivan & Worcester LLP","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Amy Sheridan","content":"PERSON"},{"type":"Home State","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Opinion","Tax","Tax Week 2022","income tax"],"authors":["Amy Sheridan","Natalie Lederman"]}