{"summary":"A medida é essencial para evitar que maus atores utilizem ativos digitais para lavagem de dinheiro. Afeta todos os que se envolvem em criptomoedas, desde bolsas até investidores comuns.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/whats-the-crypto-travel-rule-and-what-does-it-mean-for-you\/","publishDate":"2022-05-26T21:00:46","id":21439,"type":null,"title":"Qual é a ‘regra de viagem’ Cripto e o que ela significa Para Você?","category":["Learn"],"content":["Quase três anos após a controversa orientação sobre \"regra de viagem\" ter sido emitida pelo Grupo de Acção Financeira ( GAFI ), os reguladores e os prestadores de serviços de activos virtuais ( VASP ) ainda estão a enfrentar os desafios económicos e técnicos da implementação destas regras. Embora os VASPs, que incluem, entre outros, exchanges de Cripto , serviços de carteira e soluções de custódia de Cripto , sejam o foco principal desta regulamentação, espera-se que a implementação em massa tenha um impacto lento, mas seguro, na forma como você interage com a Cripto.","Neste guia, discutiremos tudo o que você precisa saber sobre a regra de viagem Cripto e como ela afetará suas atividades diárias de Cripto .","Leia Mais: Bitcoin é legal?","Em 2019, o Grupo de Acção Financeira, um órgão intergovernamental que inicia políticas de combate ao branqueamento de capitais (AML) para o G-7 e mais cerca de 30 países desenvolvidos, recomendou uma abordagem coordenada para combater o branqueamento de capitais e o financiamento do terrorismo. A regra, formalmente conhecida como Recomendação nº 16 do GAFI , exige que os VASPs comuniquem as informações dos originadores e beneficiários de transações Cripto que excedam um determinado limite. Mais especificamente, os regulamentos exigem que os VASPs troquem informações sobre as identidades do originador e do beneficiário sempre que o valor transacionado for superior a US$ 1.000.","Em essência, sempre que uma Cripto de valor superior a US$ 1.000 é transacionada entre duas partes, espera-se que o provedor de serviços de Cripto do remetente comunique as informações de identificação pessoal ( PII ) do remetente ao provedor de serviços de Cripto do destinatário e vice-versa. Embora isto seja um dado adquirido, os estados membros podem optar por interpretar esta orientação e implementar versões que melhor se adaptem às suas indústrias Cripto locais.","Por exemplo, o limite no qual a regra de viagem Cripto entra em vigor nos EUA é de US$ 3.000 (ou seja, as regras entram em vigor quando o valor da transação Cripto excede US$ 3.000). Nesses casos, os VASPs são obrigados a trocar informações sobre o valor transacionado, a data de execução e a identidade do provedor de serviços de Cripto .","Sabe-se que a Suíça tem uma versão estrita da regra de viagens, onde os reguladores exigem a identificação de carteiras privadas que interagem com VASPs locais.","Além das informações extras exigidas pelos reguladores individuais, o GAFI recomenda que os seguintes dados sejam FORTH pelos VASPs:","A regra de viagem existia antes das recomendações do GAFI de 2019. Inicialmente, o regulamento destinava-se a bancos e instituições financeiras como parte das iniciativas para mitigar o branqueamento de capitais. Em essência, as ações do GAFI em 2019 apenas expandiram esta regra de modo que as regulamentações antilavagem de dinheiro existentes possam ser replicadas na indústria Cripto . Vale ressaltar que antes da emissão da regra de viagens Cripto em 2019, a Rede de Execução de Crimes Financeiros ( FinCEN ), sob a Lei de Sigilo Bancário dos EUA (BSA) , impôs uma regra semelhante aos VASPs que operam dentro de sua jurisdição.","Assim, ao contrário da maioria das nações, os EUA não necessitaram de formular uma nova regulamentação a partir do zero para cumprir as recomendações do GAFI. De acordo com esta regra, o FinCEN exige que os provedores de serviços de Cripto confirmem que as transações Cripto não se originam ou não são enviadas para países ou empresas sancionadas.","Leia Mais: O que é KYC e por que isso é importante para a Cripto?","Tal como mencionado anteriormente, o objectivo Core da emissão deste regulamento é bloquear o financiamento do terrorismo e o branqueamento de capitais. Abaixo estão outros motivos pelos quais a regra de viagem é importante:","O primeiro desafio associado à regra de viagens Cripto gira em torno da abordagem não uniforme para a implementação deste regulamento em diferentes regiões. Conforme mencionado anteriormente, os requisitos da regra de viagem variam de país para país. Assim, os VASPs têm a tarefa de incorporar sistemas robustos de autoconformidade que considerem os diferentes requisitos de vários países e os implementem em conformidade. A não uniformidade das regras de viagem Cripto é popularmente chamada de “Problema do Nascer do Sol”.","Tendo em mente que os VASPs são obrigados a trocar detalhes de transações, há necessidade de um sistema de comunicação interoperável, de modo que os VASPs possam receber e enviar facilmente PII. Isto significa que toda a indústria Cripto deve adotar uma abordagem colaborativa para chegar aos padrões ideais de dados e comunicação.","Compreensivelmente, isso é um pouco difícil porque a indústria Cripto historicamente favorece um modelo de operação descentralizado. Dito isto, os fornecedores de serviços Cripto estão a aceitar esta situação, com muitos a adotarem protocolos especialmente concebidos para auxiliar a transferência e recolha de dados encriptados. Exemplos desses protocolos são OpenVASP, Shyft, TRISA e TRP.","Mais importante ainda, a indústria Cripto chegou a um consenso sobre um formato único de mensagens de dados para todos os protocolos de regras de viagem. Este formato é denominado IVMS 101 .","Outro ponto principal de discussão é o efeito percebido do influxo da regulamentação de ativos digitais por uma facção da comunidade Cripto . Alguns acreditam que regulamentações como a regra de viagem capacitam os reguladores com as ferramentas e dados necessários para vigiar e sancionar usuários de Cripto .","Também vale a pena mencionar os aparentes riscos de segurança aos quais os VASPs estarão expostos durante a transmissão das informações dos usuários. É crucial criar sistemas de segurança adicionais que protejam os dados dos utilizadores contra tais riscos.","Por último, existem riscos de conformidade com a Política de Privacidade de dados aos quais a regra de viagem expõe os VASPs. Por mais que os VASPs tentem aderir às regras de viagem, devem garantir que as suas ações estão alinhadas com as leis de Política de Privacidade de dados das jurisdições onde operam.","A primeira coisa que você deve ter em mente é que pode precisar renunciar a parte de sua Política de Privacidade para continuar a interagir com o mercado de Cripto .","Você também deverá saber pelo menos o nome dos seus beneficiários e daqueles que lhe enviam os pagamentos. E como ainda existem desafios associados à regra de viagem, não há como dizer como as ineficiências de qualquer um dos sistemas de conformidade afetariam a experiência do usuário.","Na fase inicial desta revolução regulatória, você poderá não conseguir executar transações, dependendo do status de conformidade do seu VASP e da sua contraparte.","Leia Mais:O que são moedas de Política de Privacidade e são legais?","CORREÇÃO (27 de março, 10h46 UTC): Corrige o nome do watchdog para Força-Tarefa de Ação Financeira. Uma versão anterior referia-se a ela como Força Fiscal de Ação Financeira."],"entity":[{"type":"Shyft","content":"PERSON"},{"type":"US$ 3.000","content":"MONEY"},{"type":"TRISA e TRP","content":"ORGANIZATION"},{"type":"Leia Mais","content":"PERSON"},{"type":"Grupo de Acção Financeira","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"EUA","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"Força Fiscal de Ação Financeira","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"Tarefa de Ação Financeira","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Lei de Sigilo Bancário dos EUA","content":"ORGANIZATION"},{"type":"7","content":"DATE"},{"type":"Rede de Execução de Crimes Financeiros ( FinCEN","content":"ORGANIZATION"},{"type":"Neste guia","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"US$ 1.000","content":"MONEY"}],"hashtag":["Learn","Intermediate","industry","FATF","Travel Rule","Anti-Money Laundering","portuguese"],"authors":["Andrey Sergeenkov"]}