{"summary":"Le récent chaos autour de l'échange centralisé FTX a suscité des questions sur les avantages et les inconvénients de conserver vos pièces sur des échanges centralisés ou décentralisés. Nous le décomposons.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/centralized-exchange-cex-vs-decentralized-exchange-dex-whats-the-difference\/","publishDate":"2022-11-15T16:12:18","id":21435,"type":null,"title":"Échange centralisé (CEX) et échange décentralisé (DEX) : quelle est la différence ?","category":["Learn"],"content":["Si vous envisagez d’acheter ou de vendre des Crypto, votre première escale sera probablement un échange. Le plus souvent, le premier point d’entrée pour échanger des Cryptomonnaie est une bourse centralisée (CEX), un marché numérique sur lequel s’effectue le trading de Crypto . Vous en avez probablement entendu parler : Binance, Kraken, Coinbase, etc. En novembre 2022, un scoop de CoinDesk a conduit à une tournure étonnante des Événements qui a conduit à l'effondrement de l'échange autrefois populaire FTX et au dépôt de bilan .","Cela a conduit de nombreux investisseurs en Crypto à rechercher des alternatives aux échanges centralisés. L'alternative évidente est un type d'échange plus récent et décentralisé, tel que Uniswap et PancakeSwap . Ces échanges décentralisés repensent radicalement le fonctionnement des échanges.","Voir aussi : Qu'est-ce qu'un jeton d'échange ?","Les échanges décentralisés (DEX) sont apparus au cours des cinq dernières années pour défier les CEX historiques. En bref, les DEX visent à offrir des frais de transaction inférieurs, à permettre aux utilisateurs de détenir directement leurs propres actifs et à éviter certaines contraintes réglementaires. D’un autre côté, ils doivent assumer le coût de l’indemnisation de leurs fournisseurs de liquidités pour un type particulier de risque appelé « perte éphémère ».","Les CEX offrent également des avantages. La plupart des bourses centralisées utilisent un modèle commercial similaire à celui des institutions traditionnelles comme la Bourse de New York, qui est une structure que les investisseurs traditionnels comprennent et avec laquelle ils peuvent se sentir plus à l'aise. Leurs interfaces et applications ont tendance à être plus simples et conviviales et offrent généralement plus de liquidités et des garanties réglementaires plus solides, ce qui peut être particulièrement important pour les clients institutionnels. Mais cela signifie également que la société centrale qui gère la bourse a beaucoup de pouvoir et de responsabilité quant à la stabilité financière et à la santé de la bourse.","Voir aussi : Comment retirer votre richesse d'un échange","Si le récent drame autour de FTX vous incite à envisager de passer à un DEX, voici ce que vous devez savoir.","Les DEX visent à effectuer des transactions plus rapidement et à moindre coût que leurs homologues centralisés. Pour ce faire, ils suppriment les entités intermédiaires qui prennent une réduction des frais de transaction sur les CEX. Le livre blanc de 2018 du plus grand DEX au monde, Uniswap, proclame « zéro extraction de rente ». Il vise à protéger ses utilisateurs des coûts supplémentaires liés à la génération de bénéfices pour les intermédiaires qui gèrent les CEX. Bancor , qui a été lancé en 2017 et se décrit comme le premier DEX, préconise une approche décentralisée comme celle-ci :","« La liquidité sur les bourses d’actifs traditionnelles a toujours été fournie par une petite poignée de sociétés de négoce professionnelles disposant d’un accès autorisé et d’outils spécialisés. Cela concentre la liquidité entre les mains de quelques acteurs qui peuvent retirer leurs actifs pendant les périodes de volatilité et restreindre la négociation d'un actif lorsque les utilisateurs en ont le plus besoin.","Fin 2021, le principal DEX Uniswap facturait des frais de transaction de 0,05 % sur la transaction de 100 000 $ échantillonnée par le cabinet comptable mondial KPMG . Les CEX Binance, Coinbase et Kraken facturaient respectivement 0,1%, 0,2% et 0,2%.","Les DEX utilisent des protocoles de « Maker de marché automatisé » pour déterminer les prix des actifs sans un organisme centralisé orchestrant les transactions. Une approche courante est le mécanisme du « produit constant », qui détermine les prix proposés en fonction du ratio des réserves totales du DEX pour chacun des actifs concernés. Cela présente l’avantage de tendre à KEEP les réserves dans un équilibre relatif : si un actif devenait rare, il deviendrait extrêmement cher.","Néanmoins, les DEX ont toujours tendance à offrir à peu près les mêmes prix pour les actifs que les CEX. En effet, les traders ou robots attentifs peuvent rapidement profiter de tout écart de prix grâce à l'arbitrage . Si un certain pool contenait très peu ETH, il devrait permettre aux traders de vendre de ETH dans le pool à un prix plus élevé que celui indiqué par le marché dans son ensemble. Les commerçants pourraient facilement en tirer profit en l’achetant sur le marché plus large et en le revendant au sein du pool. Ce faisant, le volume du pool augmenterait, réduisant le prix proposé jusqu'à ce qu'il corresponde au marché plus large.","Sur le même sujet : Comprendre la Technologies derrière les échanges décentralisés","Aussi astucieux que soit ce système, il introduit un risque pour les fournisseurs de liquidité derrière le pool. Le risque est appelé perte éphémère. Les fournisseurs de liquidité ont le droit de retirer la partie de la valeur du pool qu'ils ont contribué, et non le nombre exact de jetons qu'ils ont mis. Il ne peut pas promettre à tous les fournisseurs leurs jetons exacts, car le ratio des différents jetons détenus dans le pool change au fur et à mesure des transactions. se produire. Mais à mesure que le ratio s'ajuste pour refléter les prix actuels du marché, le pool va progressivement contenir davantage de jetons perdant de la valeur, et vice versa.","Cela signifie qu'un fournisseur de liquidité aura tendance à retirer davantage du jeton qui a perdu de la valeur et moins de ONE qui a gagné de la valeur, par rapport à ses actifs de départ. Par conséquent, ils se retrouveront plus pauvres que s’ils avaient simplement conservé leurs actifs à titre privé. En pratique, les DEX rémunèrent généralement les fournisseurs de liquidité par le biais de frais de transaction. Mais cela signifie facturer des frais plus élevés que ce dont ils auraient autrement besoin.","Une autre partie du compromis entre les DEX et les CEX consiste à savoir si les utilisateurs préfèrent détenir leur propre Crypto directement ou la confier à la bourse. Les CEX exigent généralement que les utilisateurs placent les actifs sous leur garde avant de les négocier.","Détenir vous-même vos actifs respecte l’idéal d’autonomie qui imprègne le secteur de la Crypto . Vous en avez un contrôle total et exclusif. Mais d’un autre côté, sans précaution, les clés privées peuvent être perdues ou détruites, rendant les actifs associés irrécupérables. Le Gallois James Howells a jeté par erreur un disque dur en 2013 et a perdu l'accès à 7 500 bitcoins qui vaudraient bien plus de 100 millions de dollars en novembre 2022. Il a demandé à plusieurs reprises et sans succès au conseil local de le laisser creuser sa décharge.","La popularité croissante des DEX peut en partie refléter leur capacité à éviter certains obstacles réglementaires. L'entreprise qui construit un DEX évite d'agir en tant qu'intermédiaire ou contrepartie financière et n'est pas tenue de répondre aux normes de connaissance du client (KYC) ou de lutte contre le blanchiment d'argent (AML) car elle fonctionne de manière autonome. ShapeShift était un CEX jusqu'à ce que son PDG déclare que l'entreprise a perdu 95 % de ses utilisateurs à la suite des mesures KYC qu'elle a été forcée de mettre en œuvre en 2018. En 2021, Shapeshift a décidément pivoté et est devenu un DEX pour ignorer ce problème.","Les DEX peuvent avoir plus de difficultés que les CEX lorsqu’ils travaillent avec des investisseurs plus importants. À l’heure actuelle, ils ne peuvent pas encore rivaliser avec les plus grands CEX et ne peuvent donc pas offrir autant de liquidités. Lorsqu’elles se heurtent à une liquidité insuffisante, les commandes importantes peuvent être confrontées à des coûts supplémentaires imprévus appelés « slippage ». En outre, les investisseurs institutionnels sont confrontés à leurs propres obstacles en matière de lutte contre le blanchiment d’argent et à d’autres obstacles réglementaires et peuvent avoir du mal à gérer des bourses qui ne se soumettent pas à des exigences similaires.","Sergej Kunz, co-fondateur de l'agrégateur de liquidité DEX 1inch Network, a noté l'année dernière que les banques et les hedge funds avaient mis du temps à s'engager dans la Finance décentralisée ( DeFi ) en raison de leurs propres obstacles réglementaires. Bien qu'il s'agisse d'un DEX, son entreprise prévoit désormais de lancer un produit conforme appelé 1INCH Pro, spécifiquement pour répondre à ces clients.","De nouveaux protocoles d'agrégation tels que 1INCH sont apparus spécifiquement pour aider les grands investisseurs à éviter les problèmes de liquidité lors de l'utilisation des DEX. 1INCH a levé 12 millions de dollars en 2020 lors d'un cycle de financement mené par Pantera Capital.","La montée en puissance des agrégateurs signifie en fait que les utilisateurs peuvent accéder simultanément aux liquidités des DEX et des CEX. Le protocole DiversiFi, qui est lui-même un DEX, regroupe les liquidités des deux types d'échanges afin d'aider ses utilisateurs à conclure plus efficacement des transactions plus importantes. Cela aide les investisseurs à éviter les coûts liés au fait que la liquidité d'une bourse s'avère trop faible pour leur ordre.","Lorsqu'il s'agit de décider quel type d'échange utiliser, cela se résume à deux choses : Si vous êtes principalement intéressé par la facilité d'utilisation et que vous n'êtes pas à l'aise avec le contrôle total de votre propre portefeuille, alors un CEX est probablement la meilleure option Pour vous. Si des frais moins élevés et un meilleur contrôle sur vos propres fonds sont ce qui vous importe le plus, alors un DEX est la voie à suivre. Quelle que soit la solution que vous choisissez, assurez-vous de savoir comment retirer votre Crypto d’un échange et la stocker au froid pour KEEP votre patrimoine à long terme.","Voir aussi : Pourquoi les échanges décentralisés sont importants dans l'économie Crypto"],"entity":[{"type":"2017","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"0,1%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"0,05 %","content":"PERCENT"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"95 %","content":"PERCENT"},{"type":"100 millions de dollars","content":"MONEY"},{"type":"Sergej Kunz","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"12 millions de dollars","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"0,2%","content":"PERCENT"},{"type":"$ échantillonnée","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Gallois James Howells","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"tel que Uniswap et PancakeSwap","content":"ORGANIZATION"}],"hashtag":["industry","Beginner","Learn","French"],"authors":["Benedict George","Toby Bochan"]}