{"summary":"The marketplace&#x27;s response comes after code in QQL Mint Pass, co-created by Fidenza&#x27;s Tyler Hobbs, blocked users from transacting with it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173766\/nft-platform-x2y2-hits-back-at-blacklist-by-tyler-hobbs-qql","publishDate":"2022-09-29T14:16:38","id":2143,"type":null,"title":"X2Y2 responds to its blacklisting by QQL: ‘QQL has made its own law’","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">NFT platform X2Y2 hit back at the creators of QQL a day after&nbsp; the popular NFT project effectively blacklisted its holders from interacting with the marketplace, saying it's acting like the music industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">X2Y2 said in a lengthy Twitter <a href=\"https:\/\/twitter.com\/the_x2y2\/status\/1575503596719771649\" data-v-f87c67ca=\"\">thread<\/a> that QQL is following the ownership model employed by record labels industry by choosing to block the marketplace through its smart contract.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"'Code is law,’ and QQL has made its own law. When someone else can decide where you can transfer your NFT, you are not the real owners anymore,” X2Y2 said. “Sounds familiar? Yes, this is exactly what happens in the music industry — you don’t own the mp3s lying on your hard drive.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nQQL Mint Pass generated <a href=\"https:\/\/www.theblock.co\/post\/173586\/fidenza-creators-new-nft-project-qql-mint-pass-earns-17-million-upon-launch\" data-v-f87c67ca=\"\">$17 million<\/a> worth of NFTs in its debut yesterday. The project allows someone to mint official art from the QQL generative algorithm created by software engineer Dandelion Wist and Fidenza's Tyler Hobbs, which is slated to be released to the public.<\/span>","<span data-v-f87c67ca=\"\">The project wrote in its smart contract code to block the delegated wallet for X2Y2, effectively prohibiting transactions with the marketplace. X2Y2, along with the NFT trading platform SudoAMM, are two notable marketplaces to not enforce royalties on every transaction, which contributed to online <a href=\"https:\/\/www.theblock.co\/post\/163497\/an-nft-market-maker-set-0-royalties-sparking-concerns-about-the-future-of-artist-compensation\" data-v-f87c67ca=\"\">debates<\/a> last month about the future of NFT artist compensation.<\/span>","<span data-v-f87c67ca=\"\">X2Y2 clarified in its thread that it is not a 0% royalty platform as others on Twitter suggested, but that users themselves can choose to enforce (or not enforce) royalties.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In this particular case, QQL didn’t even set up their royalty on X2Y2,” wrote the platform, adding that NFT holders can choose to uphold royalties, and that more than 98% of its users opted to pay royalties in September.&nbsp;<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/134450\/another-nft-marketplace-x2y2-begins-vampire-attack-on-opensea\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">X2Y2<\/span><\/a><span data-v-f87c67ca=\"\"> added that it believes in a “fair royalty” model that lets the users choose the royalty amount to pay and allows creators to decide “who they want to serve,” before adding that the platform would love to work with the QQL creators to “find a solution that could still stick to your values.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The NFT influencer <\/span><a href=\"https:\/\/twitter.com\/farokh\/status\/1575506021921001472\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Farokh<\/span><\/a><span data-v-f87c67ca=\"\"> questioned X2Y2’s thread. “If a marketplace can decide how much royalty an artist gets, why can't an artist decide whether or not their NFTs are sold on a platform? How does that mean a user does not own their NFT? Weird response.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"QQL","content":"ORGANIZATION"},{"type":"Tyler Hobbs","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fidenza","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"$17 million","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"Dandelion Wist","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}