{"summary":"Uniswap’s lawyers say the protocol doesn’t meet the SEC’s own definition of an exchange.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/21\/uniswap-labs-urges-sec-to-drop-pending-enforcement-action-in-wells-response\/","publishDate":"2024-05-21T17:30:00","id":21437,"type":null,"title":"Uniswap Labs Urges SEC to Drop Pending Enforcement Action in Wells Response","category":["Policy"],"content":["Uniswap Labs moved Tuesday to quash a looming regulatory battle over Ethereum's dominant decentralized crypto exchange, imploring the Securities and Exchange Commission in legal filings that its planned lawsuit wasn't worth the fight.","The company received a Wells notice – essentially a heads-up from the SEC notifying the recipient that the regulator believes it broke the law – in April. The notice accused the Uniswap protocol of being an unregistered securities exchange and the interface and wallet as being unregistered securities brokers.","In their response to the SEC’s Wells notice, Uniswap Labs pushed back against this assertion, arguing that the protocol does not meet the definition of an exchange and is thus not subject to regulation by the SEC. Though Uniswap Labs said it invented the protocol, it said the protocol is now a “passive” technology that people use to trade cryptocurrencies.","Uniswap Labs’ Chief Legal Officer Marvin Ammori told reporters on Tuesday that the SEC would have to redefine what an exchange is in order to have jurisdiction over Uniswap. Under the current definition, Ammori said, Uniswap would have had to be specifically designed for securities trading.","“It is general purpose, and the majority of its volume are obvious non-securities like Ethereum, Bitcoin and stablecoins,” Ammori said, adding that bitcoin, ether and stablecoins account for 65% of the protocol’s trading volume.","Read more: DeFi Exchange Uniswap Receives Enforcement Notice From the SEC","Ammori said that the SEC knows that the current definition of an exchange does not cover any of Uniswap Labs products.","“That’s why, as we speak, there’s a pending rulemaking where the SEC is trying to redefine about half a dozen words in their own regulations to try to capture us. That’s not going to work,” Ammori said. “It goes beyond their authority given by Congress.”","Ammori also said that the SEC’s accusation that Uniswap’s interface and wallet are brokers will fail as well, pointing to a recent ruling from a federal judge dismissing the SEC’s claims that the Coinbase Wallet constituted an unregistered securities broker.","Because the SEC would have to stretch its authority to regulate Uniswap, the protocol’s lawyers argued, the agency “should not take on these significant litigation risks.” The lawyers added that bringing a case against Uniswap would push American crypto investors to use foreign trading protocols and would discourage “future innovators from attempting to foster new ideas that bring much-needed competition and innovation to financial and commercial markets.”","“We will litigate if we have to, and if we litigate we will win,” Ammori said. “But we are hoping that the SEC sees that their current strategy is not protecting anyone and not benefiting Americans.”","Tuesday's filing shed additional light on the arguments the SEC appears poised to make in its yet-to-be-filed enforcement action against Uniswap Labs. The regulatory agency is targeting Uniswap's native UNI token as well as liquidity provider (LP) tokens.","LP tokens are core to how so-called \"automated market makers\" such as Uniswap work. Users who deposit their assets into the protocol's trading pools get LP tokens as a receipt on their contribution. They can swap their LP tokens for the value of their deposits. Meanwhile, the protocol uses those deposits to make sure other traders can make the trades they wish.","According to Uniswap Labs' Wells response, the SEC alleges LP tokens are investment contracts whose distribution violates securities law. Uniswap Labs rejects that argument on the grounds that LP tokens don't fit into the regulator's frameworks, and are rather \"bookkeeping devices.\"","Last December the SEC hinted at increased scrutiny of LP tokens in its settlement with BarnBridge DAO, according to the law firm K&L Gates. If it moves forward with the allegations Uniswap Labs outlined Tuesday, the regulator's enforcement action could outline a coming fight with broad implications for how DeFi ticks.","Edited by Nikhilesh De."],"entity":[{"type":"LP","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Ammori","content":"PERSON"},{"type":"65%","content":"PERCENT"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Marvin Ammori","content":"PERSON"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"BarnBridge DAO","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"K&L Gates","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Regulations","Uniswap","SEC","Enforcement","Legal"],"authors":["Cheyenne Ligon","Danny Nelson"]}