{"summary":"Crypto-focused PACs are shaping the outcome of certain key Congressional elections.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/14\/the-crypto-industrys-influence-on-us-elections-is-bigger-than-ever-industry-insiders-say\/","publishDate":"2024-05-14T18:30:00","id":21432,"type":null,"title":"The Crypto Industry’s Influence on U.S. Elections is Bigger Than Ever, Industry Insiders Say","category":["Policy"],"content":["The crypto industry is throwing its weight around in Washington in hopes of influencing the upcoming U.S. elections, spending an unprecedented amount of money to get crypto-friendly candidates elected and educate lawmakers – all in hopes of finally getting a friendly regulatory framework for crypto established.","Crypto-focused political action committees (PACs) like Fairshake – which has raised around $85 million from a collection of crypto companies, executives and retail investors – have successfully shaped the outcome of some relevant races, including spending $10 million helping squash the bid of crypto-critical Congresswoman Katie Porter (D-Calif.).","Fairshake has also poured money into two affiliated PACs: Defend American Jobs, which donates to Republican candidates, and Protect Progress, which donates to Democrats. Both have donated to winning campaigns. Over the last two months, Defend American Jobs spent nearly $500,000 on media buys for Republican Mark Messmer, an Indiana state senator, who won the Republican nomination for Indiana’s 8th district congressional seat this week.","Some of Protect Progress’ crypto-friendly Democratic candidates, including Shomari Figures, who is running for a House seat in Alabama and Julie Johnson in Texas, have also won their primaries with media buy help.","\"It’s at a level that we just haven’t seen in past election cycles,\" said Kristin Smith, CEO of crypto lobbying group the Blockchain Association.","Industry insiders say the economic power of the industry has even spurred some crypto skeptics – including Sen. Sherrod Brown (D-Ohio), the chairman of the Senate Banking Committee, who is up for re-election this year – to take a more open-minded stance towards crypto, lest they face well-funded opposition efforts from the industry.","\"Previously he was no friend of crypto but recently [Brown] said he was open to considering cryptocurrency legislation,\" said Kyle Bligen, director of financial policy at the tech-focused Chamber of Progress. \"I think he’s cognizant of the money from outside industry groups that are looking for politicians that are open to reasonable, common-sense cryptocurrency policies and aren't just trying to prop up or support the traditional financial ecosystem without allowing for innovation.\"","Though the industry’s past efforts to shape national-level election outcomes have been largely unsuccessful – and, in the case of former FTX CEO Sam Bankman-Fried, criminal – the crypto industry’s growing political influence now seems to have more staying power.","\"It’s a much more sophisticated operation,\" Smith said. \"I feel like I used to walk around Washington, and people would say ‘Oh, there’s Kristin, she works for that little blockchain industry thing.’ Now it’s like, ‘Oh wow, that’s the powerful crypto industry and they’re here to influence Washington and are pulling out all the tools to do it.\"","Though the crypto industry has largely focused its lobbying efforts on Congressional elections, the U.S. presidential election will also have a significant impact on crypto regulation.","According to at least one small poll commissioned by crypto investment firm Paradigm,, crypto-holding voters tend to prefer Donald Trump for president – although, according to other polls, the percentage of voters who own crypto is small. Polymarket bettors currently give Trump the slight edge to win (47% to Biden’s 44%). But industry insiders are less certain on whether a Trump presidency would actually be better for crypto.","During his presidency Trump was outspoken about his distaste for crypto but has since softened his stance, even saying earlier this week that he was open to accepting crypto campaign donations. In an interviews with CNBC earlier this year, Trump admitted to dabbling in the markets himself (he has sold several tranches of non-fungible tokens) and said that he is \"not sure [he would] want to take it away at this point,\" though implied that he could move to curb crypto’s influence if it ever undermined the dominance of the U.S. dollar.","Though Trump’s crypto stance is shifting, it’s still markedly less crypto-friendly than that of his former competitor for the Republican presidential nomination, Vivek Ramaswamy, who pledged to protect crypto developers and create a clear regulatory structure for crypto that would see most tokens as commodities.","Even though Ramawamy is no longer in the running – and will reportedly not be considered as Trump’s running mate – industry insiders suggest his crypto policies could still have an influence on Trump if he’s elected.","\"Trump looks to Vivek on tech and digital asset policy,\" claimed Lee Bratcher, founder and president of the Texas Blockchain Council. \"He didn’t always do that, but when he saw how Vivek captured the Republican voter – and more centrist [voters] than Trump can capture – he’s probably more interested in that [policy].\"","Industry insiders were split on whether a Biden re-election would be bad for the crypto industry.","Smith said it would likely be \"more of the same, unless [Securities and Exchange Commission Chair] Gary Gensler decides to step aside,\" meaning continued regulatory uncertainty and aggressive enforcement actions. A better, more open-minded SEC chair, she added, would be \"hugely helpful.\"","\"It’s unfortunate because, at the beginning of the Biden Administration there was some interest in crypto – and then the industry imploded while they were doing all of their reports and as a result they’re in a clearly negative spot right now,\" Smith said. \"On [Biden’s] watch, the industry had some not-so-great moments and it’s understandable that regulators are concerned.\"","Smith said that, while the crypto industry has largely moved on from the 2022 crypto collapse – including the implosions of FTX, Terra\/LUNA and Three Arrows Capital – regulators have much longer memories.","\"Having a fresh batch of regulators come in would be helpful in re-starting conversations,\" Smith said.","Others, like Bligen, seemed more hopeful for crypto-friendly legislation to pass post-election if Biden stays in power.","\"I can’t say that if President Biden is reelected that that’s a loss for cryptocurrency advocates, because currently in this regime Democrats and Republicans are working together on a bipartisan basis to produce productive and responsible cryptocurrency [legislation],\" said Bligen.","There are ongoing efforts in the current Congress to pass crypto legislation, including a bipartisan effort to regulate stablecoins.","Those efforts at legislation – which, in the past, have failed to find footing – still have significant hurdles to clear before being passed, including getting more members of Congress on board with crypto.","Bligen said that there are still many members of Congress who don’t know much about crypto, and the things they do know about it \"come from flashy headlines about cryptocurrency scams, people misrepresenting coins, people being defrauded out of their money, massive crypto institutions failing – they view it from a protectionist angle,\" he said.","\"If you want to have more people that are friendly to crypto, every single office needs to be provided with a base understanding of what is cryptocurrency, why does it matter to my constituents and what is the policy landscape that regulates it. Everybody needs to know that,\" Bligen said. \"If you don’t have that basic information, you’re going to have members fumbling around, trying to grasp what blockchain technology is…there needs to be more concerted education efforts. We’re not just going to get to a more educated 2025, work has to be put in.\"","Bratcher added that, in addition to education efforts, the industry may have to compromise on certain issues – like privacy – in order to make real progress with lawmakers.","\"We stand at an interesting crossroads when it comes to privacy,\" Bratcher said, referencing the ongoing crackdown on bitcoin mixing services like Tornado Cash and Samourai Wallet.","\"People in the digital assets industry want to prioritize privacy above everything else. When we work with government – state, local and national, and even with law enforcement – we don’t have the luxury of being able to make grandiose claims around that, Bratcher added. \"There will have to be a balance between privacy and issues pertaining to money laundering and national security.\"","Bratcher said that bad behavior by privacy services like Samourai – which actively promoted its mixing services to \"dark\/grey market participants\" – makes working with elected officials much harder.","\"Tornado Cash is not a hill I’m willing to die on,\" Bratcher said. \"We could lose a war if we choose to die on the hill of Tornado Cash.\"","Though the spotlight is on national elections, Bratcher and others – like Dennis Porter, CEO and co-founder of bitcoin mining advocacy group Satoshi Action Fund – are focusing their efforts on state politics.","Porter’s group has helped introduce bills in 16 U.S. states that provide protections for bitcoin mining and self-custody. The furthest along of the bills is in Oklahoma, where it has been passed in both the state House and Senate, and is awaiting a signature by Governor Kevin Stitt (R).","\"D.C. is fun and sexy. Tons of money is spent there, but so far we haven’t seen any big wins – all of the important battles are happening at the state level,\" Porter said.","Porter said the industry should continue to build its presence in D.C. but said that it will not find the magical cure to all of its ills on Capitol Hill.","\"The way that we’re going to do that is at the state level,\" Porter said. \"We’re going to go state-by-state advocating for pro-digital assets policy using the states as a laboratory for democracy, eventually taking those good ideas and using them to influence policy at the federal level. Or at the bare minimum, creating a regulatory regime that protects people at the state level.\"","Porter’s model for crypto regulation takes a page out of the cannabis industry’s playbook – building up momentum and support in the states until the industry is powerful enough to shape federal regulations.","\"We’re swinging for home runs over and over and over again in D.C. but we’re not strong enough yet,\" Porter said. \"I just think we’re further away from that than we realize…The big story for me is that we need to be spending much more time at the state level, investing much more money, because the hundreds of millions of dollars being spent in D.C., if spent at the state level, would radically reshape the policy landscape and would radically change the dynamic for bitcoin and digital assets in America.\"","Edited by Nikhilesh De and Jesse Hamilton."],"entity":[{"type":"Trump","content":"ORGANIZATION"},{"type":"Ramawamy","content":"ORGANIZATION"},{"type":"Kristin Smith","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bratcher","content":"PERSON"},{"type":"[Securities and Exchange Commission Chair","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Mark Messmer","content":"PERSON"},{"type":"47%","content":"PERCENT"},{"type":"Terra\/LUNA","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Texas Blockchain Council","content":"ORGANIZATION"},{"type":"Satoshi Action Fund –","content":"ORGANIZATION"},{"type":"Kevin Stitt","content":"PERSON"},{"type":"Julie Johnson","content":"PERSON"},{"type":"2025","content":"DATE"},{"type":"Bligen","content":"PERSON"},{"type":"Kyle Bligen","content":"PERSON"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Dennis Porter","content":"PERSON"},{"type":"Porter","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"$500,000","content":"MONEY"},{"type":"House","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Lee Bratcher","content":"PERSON"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Alabama","content":"LOCATION"},{"type":"Trump","content":"PERSON"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Vivek","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"\" Smith","content":"PERSON"},{"type":"Oklahoma","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Kristin","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$85 million","content":"MONEY"},{"type":"44%","content":"PERCENT"},{"type":"Smith","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Shomari Figures","content":"PERSON"},{"type":"Chamber of Progress","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Brown]","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Calif.","content":"LOCATION"},{"type":"Katie Porter","content":"PERSON"},{"type":"Protect Progress","content":"ORGANIZATION"},{"type":"Indiana","content":"LOCATION"},{"type":"Biden","content":"PERSON"}],"hashtag":["Regulations","Election 2024","Joe Biden","Donald Trump","US Elections"],"authors":["Cheyenne Ligon"]}