{"summary":"An SEC approval for spot ETH ETFs looks unlikely but even if the SEC approves exchange traded funds for Ether, investors should learn about total return ETH investment products. That way, they can gain from staking rewards as well as the underlying asset, says Jason Hall, the CEO of Methodic Capital Management.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/01\/an-eth-etf-wouldnt-deliver-full-returns-to-investors\/","publishDate":"2024-05-01T16:00:00","id":21430,"type":null,"title":"An ETH ETF Wouldn’t Deliver Full-Returns to Investors","category":["Finance"],"content":["ETFs bring awareness but are less effective than private funds as an ETH investment vehicle.","With the recent approval, launch and success of spot bitcoin ETFs, all eyes have turned to the possibility of spot ETH ETF regulatory approval, an outcome we believe to be unlikely under the current administration. Additionally, an ETH ETF will, at least initially, lack a staking reward component, a key aspect of ETH total return.","We see the primary value of crypto-ETFs being the normalization of crypto investing for traditional finance allocators. Large ETF providers entering the space license their legitimacy, allowing allocators to invest in crypto without taking career-risk. However, for all the industry benefits of a spot ETH ETF, the return characteristics are not as attractive as total return options.","At the time of writing, rewards from staking eth are over 3% per annum, according to CESR, the benchmark composite ether staking rate. In other words, if an investor invests into an ETH ETF, they may be at a disadvantage compared to someone investing in a staked investment. CESR has been as high as 8% in the trailing twelve months.","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","ETH ETFs — A liquidity mismatch due to staking","Mechanically, staking reduces liquidity due to the validator entry and exit queues. In the summer of 2023 the entry queue rose to 45 days due to a surge in activity. As a network security activity, staking is not designed with the liquidity needed for securitization in mind. Due to the immense liquidity demands of an ETF, issuers will struggle to deliver liquidity and ETH total return, including staking rewards.","Structural Underperformance","Passively holding unstaked ETH is akin to holding unneeded fiat currency for long periods in a demand deposit account with zero interest. Said another way, passively holding unstaked ETH will create structural underperformance and, if compared to a total return benchmark, persistent negative tracking error. From any angle, that is an untenable position for an investor.","Private Fund Solution","For accredited investors, private funds offer an effective solution to achieve total return ETH exposure. Buying and staking ETH through a private fund structure does not face regulatory challenges. Managers can also match the liquidity of the fund to stake and unstake ETH on behalf of investors. With a thoughtful operational setup, there are limited tradeoffs; a private fund can be audited, benchmarked, and keep assets in qualified custody.","Disclosure: Methodic partnered with CoinDesk's index affiliate, CoinDesk Indices, on a private fund that uses the CoinDesk Ether Total Return Index, a combination of the CoinDesk Ether Price Index (ETX) and the Composite Ether Staking Rate (CESR), calculated by CoinDesk Indices and administered by digital asset manager CoinFund.","Edited by Benjamin Schiller."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"summer of 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto Long & Short","ETFs","Ethereum ETF","Institutional Investment","Institutional Adoption","institutional investor"],"authors":["Jason Hall","John McNiff"]}