{"summary":"Uncle Sam may collect tax on every loan and repayment of cryptocurrency, which may catch users by surprise, creating a tax trap that could impair the rapidly emerging DeFi industry. This piece is part of CoinDesk's Tax Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/02\/24\/lender-beware-the-potential-defi-tax-trap\/","publishDate":"2022-02-24T14:15:43","id":21447,"type":null,"title":"Lender Beware: The Potential DeFi Tax Trap","category":["Consensus Magazine (layer2)"],"content":["Decentralized finance (DeFi) is a catch-all term that refers to a category of activities where decentralized applications provide financial services using a blockchain for transaction settlement. The defining features of DeFi are operation without centralized intermediaries (i.e., they run on smart contracts), peer-to-peer execution of transactions and the use of open protocols that allow flexible combinations of different protocols.","There are many different DeFi applications – this article will focus on DeFi lending transactions. Users often engage in many different loan transactions on many different platforms, trying to maximize the fees or rewards earned on these transactions. These users may not be surprised to learn that the fees or rewards are taxable, since interest earned on loans of money would normally be taxable. But the possibility that Uncle Sam may collect tax on every loan and repayment of cryptocurrency may catch users by surprise, creating a tax trap that could impair the rapidly emerging DeFi industry.","This piece is part of CoinDesk's Tax Week","Many tax advisors have argued that, under decades-old tax guidance applicable to securities loans, loans of cryptocurrency should not constitute taxable exchanges. However, this argument may be stronger for centralized cryptocurrency (CeFi) lending than it is for DeFi lending. The IRS has not provided guidance on this issue, so taxpayers are left with uncertainty.","In a centralized crypto lending transaction, a centralized party loans cryptocurrency to users. For example, a customer might use loaned BTC to enter into a short sale. After some time has passed, the customer will repay the loan, together with a fee or reward based on the amount of the loan and the length of time between advance and repayment of the loan (similar to an interest payment).","In a DeFi lending transaction, there is no trusted, centralized party to act as a lender. Instead, any holder can deposit cryptocurrency they intend to lend into a pool using a smart contract. Borrowers can then borrow cryptocurrency that is held in this pool. Under the smart contract, the lender will receive the platform’s native token (e.g., DAI, COMP or aTokens). These native tokens can later be redeemed so that the holder can receive back the cryptocurrency that they provided to the pool plus a fee or reward similar to the payment of interest.","The IRS has concluded that cryptocurrency is treated as property for tax purposes and not as money. Although the loan of money and its repayment are generally not taxable, a loan of property may be. The IRS has not provided any guidance on the tax treatment of crypto lending transactions, so taxpayers and their advisors must look to analogies to determine the tax treatment.","Securities lending transactions proceed in much the same way as the centralized crypto lending transactions, so they are a natural analogy. Under section 1058 of the tax code, taxpayers providing securities loans generally can avoid recognizing taxable gain if they meet certain requirements. However, a “security” for this purpose is defined as “any share of stock in any corporation, certificate of stock or interest in any corporation, note, bond, debenture, or evidence of indebtedness, or any evidence of an interest in or right to subscribe to or purchase any of the foregoing.” Because cryptocurrencies typically do not fall within that definition of a security, taxpayers generally cannot rely on section 1058 for cryptocurrency lending transactions.","In the absence of a statutory rule, taxpayers and their advisors have looked to the common law rules that governed securities lending transactions prior to the enactment of section 1058 in 1978. In a 1926 case called Provost v. United States, the Supreme Court concluded that a securities lending transaction must be treated as an exchange, rather than as a loan, at least in the typical case where the borrower obtains an unrestricted power of disposition over the securities advanced.","Read more: You May Owe Crypto Taxes on These Surprising Things in 2022","Normally, treatment as an exchange means the transaction is taxable. However, the IRS consistently treated typical securities loans as tax-free transactions by broadly defining the parameters of the exchange. The IRS treated the securities loan as a deferred exchange, viewing the lender as exchanging the shares loaned for different shares of the same security that were later repaid. Because the property loaned and the property repaid were not materially different in kind or extent, this deferred exchange did not result in the recognition of gain by the lender.","Had the IRS broken the transaction down into two separate exchanges – first an exchange of the securities loaned for the borrower’s promise to repay, and then a separate exchange of this promise for the repaid securities – it likely would have resulted in a taxable exchange upon the loan and the repayment because the promise to pay is materially different from the underlying securities.","A crypto lender might rely on these same authorities to avoid the recognition of gain on a crypto lending transaction that is otherwise structured to comply with section 1058. The lender might be seen as entering into a deferred exchange where, say, the 3 BTC loaned is exchanged with another 3 BTC repaid at a later time. As long as the borrower makes repayment using the same cryptocurrency, it could be argued that this deferred exchange should not lead to the recognition of gain.","However, as mentioned above, in DeFi lending transactions, the lender may receive the platform’s native token, which can later be redeemed for the loaned cryptocurrency, but can also be traded in its own right. As such, it may be harder for a DeFi lender to argue that they have engaged in a single deferred exchange of the loaned cryptocurrency for the repaid cryptocurrency, rather than a pair of separate exchanges – a transfer of the cryptocurrency for the native token, and then the transfer of the native token for the repayment of the loaned cryptocurrency.","Taxing the loan and the repayment of cryptocurrency would add a significant amount of tax friction on DeFi lending transactions and could stunt the growth of this emerging industry. Although the IRS has not provided guidance, a few other countries, including the U.K., Norway and Australia, have concluded that the making and repayment of a DeFi loan may give rise to taxable income, starting a negative trend.","Congress should step in and create a legislative exception for crypto lending similar to the one for securities lending in section 1058. Such an exception would create certainty for cryptocurrency lenders and for the DeFi industry as a whole.","Crypto won’t save you from taxes, but it may eventually make them easier to pay, says futurist Dan Jeffries.","Tax guidance lags innovation. So does tax software. Meanwhile, misconceptions abound. If not careful, investors can end up owing more tax than expected and having to unload crypto to pay the bill","Investors in MicroStrategy, Tesla, Block and Coinbase need to consider how wild price swings will affect results, not only directly but indirectly due to complex tax accounting rules."],"entity":[{"type":"1058","content":"DATE"},{"type":"Norway","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Dan Jeffries","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1978","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"1926","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Owe Crypto Taxes","content":"ORGANIZATION"},{"type":"Provost v. United States","content":"ORGANIZATION"},{"type":"Uncle Sam","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":["DeFi","lenders","Lending","taxes","tax week","Crypto Taxes"],"authors":["Lisa Zarlenga","John Cobb"]}