{"summary":"A step-by-step guide to help NFT artists navigate taxes and find ways to reduce their tax bill.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/tax-planning-filing-nft-creators\/","publishDate":"2022-11-14T14:17:20","id":21442,"type":null,"title":"The NFT Creator's Guide to Year-End Tax Planning","category":["Learn"],"content":["We are officially in the final quarter of 2022 – time for year-end tax planning.","This piece is part of CoinDesk's tax week.","Many self-employed artists, following the lead of today’s top brands, may have sold their first non-fungible token (NFT) this year. For U.S.-based artists, this means the tax-filing process will be different, because crypto revenue varies from normal business cash flow.","“Creators need to be thinking about taxes – even before selling their first NFT,” said Justin Macari, a New York-based CPA and recognized Zen Ledger tax professional.","But given the rapid rise of NFTs just since late 2021, artists who recently pivoted to selling digital assets may have done so without fully considering the tax implications.","Fear not – we’ve compiled this guide with the help of seasoned tax experts to get you started. We recommend afterward that you work with a qualified tax professional who can help you hone in on the specific tax laws of your state and make the best decisions for your creative business.","Read on to learn what NFT creators should think about when planning for this coming tax season.","See Also: 5 Things to Remember When Paying Your NFT Taxes","The first step in claiming NFT revenue is to determine if your NFT creations count as a hobby or a full-time business activity. Many creatives experimented with NFTs this year, and anyone who profited from NFT sales should claim any earned revenue on their taxes. The Internal Revenue Service, however, taxes hobbyists differently than those who make a full-time living from their art.","Work with your accountant to complete a checklist known as the “material participation” test. This list of criteria helps business owners determine which of their income-generating activities will be taxed at the full self-employment rate, along with which aspects of their business qualify for any appropriate deductions or credits.","“The IRS considers 500 hours [to be] material participation,” Macari explained. So if by the end of 2022 you will have participated in making NFT artwork for 500 hours or more – roughly nine to 10 hours per week – prepare to claim your proceeds from NFT sales as self-employment revenue.","Self-employment tax rates are often higher than standard income tax rates because business owners must also cover the Social Security and Medicare tax payments that employers normally withhold from their employees’ paychecks. Hobbyists are usually only responsible for paying their normal income tax rate on their NFT sales, calculated as a percentage of the sum of their total adjusted taxable income from all sources (W-2 income, side hustle revenue, 1099 gigs, etc.).","“A hobbyist creator is somebody who already has a full-time job. Making money from NFTs is not their main source of income,” said Shehan Chandrasekera, head of tax at crypto tax software company CoinTracker.","But while hobbyist creators typically pay less in taxes compared with full-time self-employed creators, they have the disadvantage of not being able to deduct business expenses, says Chandrasekera. Those reporting NFT income as business revenue, on the other hand, can deduct costs like software subscriptions, gadgets or even a portion of their utility bill.","Buying or minting an NFT can trigger a chain reaction of taxable events – and you’ll want to keep them organized. Yes, most NFT activity is already logged on blockchains, but crypto tax software can help with reporting in ways blockchain isn’t designed to do. It’s worth signing up for a portfolio tracker that can send an activity report to your accountant or to a tax platform like TurboTax.","Having a tidy log of all your NFT sales and crypto transactions serves three important tax-related purposes:","Let’s look at each of these steps in detail.","Macari says there’s a “huge misconception” that creators don’t have to claim crypto revenue that’s still sitting in a digital wallet. So let’s clear that up: Business owners must claim all of their revenue, whether it came in the form of crypto or fiat currency and whether they transferred it to the bank or not. Claim the value of the crypto at the time you received it, not the time you transferred it.","For instance: Quinn sold an NFT for 0.2 ether (ETH). At the time, 0.2 ETH was worth $400. Quinn waits one month to swap the ETH for USDC and another month to sell that USDC for U.S. dollars. By the time she converts her USDC for fiat, 0.2 ETH is worth $360, and after fees and market fluctuations, Quinn ends up with $340 in her bank account from that sale. Quinn, however, must claim $400 in revenue when filing her taxes, the revenue from the moment she sold it.","The IRS classifies (at least for now) most cryptocurrency and NFTs as digital assets, the values of which are extremely volatile. Buying and selling ETH – the most popular crypto used for NFTs – or crypto of any kind requires keeping track of all the capital gains and losses that result from those transactions.","Minting an NFT on the Ethereum blockchain requires paying transaction fees, known as “gas fees.” Artists don’t always have to pay gas fees before selling their art – some platforms allow artists to transfer those costs to the buyer. However, paying gas fees affects the NFT’s cost basis, and therefore the amount of capital gains or losses the creator must pay. Cost basis is an important consideration for hobby creators who can’t claim gas fees as a deductible business expense.","Likewise, if you ever sell an NFT for a profit or loss, having a tidy sales record can help you account for the taxes you’ll owe on each sale.","Similarly, gas fees can also qualify as deductible business expenses for full-time creators. Artists who minted their NFTs on the blockchain prior to selling them should also have a record of all the minting fees (aka “gas fees”) they paid using cryptocurrency.","Due to the experimental nature of blockchain, Macari encourages creators with boundary-pushing NFT projects to claim a tax credit for research and development under Section 174 of the tax code.","Qualifying businesses can use this credit to subtract a portion of their taxes owed, which Macari argues is even better than normal business deductions.","“A tax credit is always better than a deduction because it reduces your taxes dollar for dollar whereas deductions just reduce your taxable income,” he said.","Qualifying research expenses may include costs for hiring developers or investing in specialized tech of some kind.","“If you're building something where it's not exactly clear that this is going to become something practical, so it’s a risky investment, but you are building something creative, that's new and innovative – something that’s a subjective question in nature – that's basically the guidelines,” Macari explained.","If you’ve conducted a considerable portion of your 2022 business activity in crypto, it’s crucial you work with a tax professional who understands the nuances of the sector. Use the final months of 2022 to start researching and interviewing accountants, or ask your current accountant if he or she has the necessary skills to navigate the ever-fluctuating world of crypto.","When in doubt, visit the websites of crypto portfolio tracker companies to see if they have a list of partner tax professionals or you can upgrade your subscription to include 1-on-1 support.","Read More: NFTs Are the Latest Crypto Tax Event No One Understands"],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$400","content":"MONEY"},{"type":"Shehan Chandrasekera","content":"PERSON"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Chandrasekera","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Justin Macari","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"The IRS","content":"ORGANIZATION"},{"type":"Macari","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Quinn","content":"PERSON"},{"type":"$340","content":"MONEY"},{"type":"Remember When Paying Your NFT","content":"ORGANIZATION"},{"type":"final quarter of 2022","content":"DATE"},{"type":"$360","content":"MONEY"}],"hashtag":["Learn","Beginner","NFTs","Web3","Tax Week 2022"],"authors":["Megan DeMatteo"]}