{"summary":"Even though the legality of crypto in India is still a matter of debate, new crypto tax laws are already affecting businesses and individuals.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/14\/india-cryptocurrency-tax-laws\/","publishDate":"2022-11-14T14:15:19","id":21455,"type":null,"title":"The State of Crypto Taxation in India: Past, Present and Future","category":["Layer 2"],"content":["India’s current fiscal year ending in March marks the first financial year where India, the country housing the largest percentage of crypto users in the world, is finally providing clarity on crypto taxes. Anyone who is a tax resident of India and makes money in crypto – whether they are a trader, miner, yield farmer or airdrop recipient – must declare their assets and pay a tax under the new Finance Bill of 2022.","This piece is a part of Tax Week, sponsored by Koinly.","Officially, though, India still hasn’t made its mind up about whether cryptocurrencies are even legal.","“[Whether crypto is] legitimate or illegitimate, it is a different question, but I will tax because it is a sovereign right to tax,” Finance Minister Nirmala Sitharaman said in February.","Lipsa Das is a freelance crypto writer and strategist based in India.","While the legality of crypto in India is still a matter of debate, the government has made moves to crack down on its usage – with multiple probes into major cryptocurrency exchanges and notices to high-net-worth individuals. Below, we explore how the regulatory landscape in India has evolved over the years and look at the impact that taxes have had on crypto.","The Reserve Bank of India and the government have historically been apprehensive about crypto transactions, with warnings and bans to the stringent new tax bill. Here’s a quick timeline of how crypto has fared over the years in India:","Prior to the budget bill of 2022, Indian government officials didn’t have an official stance on the taxation of cryptocurrencies, but that doesn’t mean the tokens weren’t taxed.","Any profits made from trading cryptocurrencies frequently were treated as “business or other income” and taxed as such. In contrast, if a taxpayer purchased crypto as an investment, it would be categorized as a capital asset, provided their overall trading activity was infrequent in nature. Upon sale of said cryptocurrencies, it would be subject to a long-term or short-term capital gains tax, depending on the holding period.","In the absence of a regulatory framework, there was no uniformity in how crypto transactions were reported, and in some cases, they weren’t reported at all. For instance, tax could be realized only when crypto was converted to fiat. So, if you were to swap two different cryptocurrencies on your MetaMask wallet, you weren’t legally required to report it.","The Finance Bill of 2022 initiated a complete overhaul of how cryptocurrencies are treated in India.","Effective since April 1, the Finance Bill is one of India's first laws to recognize cryptocurrencies. Importantly, it classifies cryptocurrencies as “virtual digital assets,” separating them from “currencies” backed by the central bank.","The definition of “virtual digital assets” is intentionally broad and covers all cryptocurrencies, tokens and NFTs (non-fungible tokens). But because the terminology is relatively new, the definition is still evolving. For instance, a circular dated June 30 exempted gift vouchers, reward points and subscriptions from being categorized as virtual digital assets, or VDAs.","According to 115BBH section of the Finance Bill, a taxable event is defined as:","1. Conversion of a VDA to Indian rupees or any other fiat currency.","2. Conversion of one type of virtual digital asset to another type (crypto-to-crypto trading, including stablecoins).","3. Paying for goods and services with a virtual digital asset.","All profits from the above transactions are subject to a 30% tax, which is equivalent to India's highest income tax bracket. There’s an additional surcharge that depends on the income bracket of the individual. Further, if the transaction exceeds 10,000 rupees, it will be taxed by an additional 1%.","Not all crypto transactions are subject to the 30% tax, though. Activities such as gifting crypto, staking rewards, receiving payments, airdrops, mining coins and other DeFi (decentralized finance) transactions are still viewed as “income.” In such instances, taxes are calculated according to the recipient’s income tax rate.","However, if you choose to hold the assets and sell them later, you will be liable to pay a 30% tax on any appreciation in asset market value.","One of the most criticized aspects of crypto tax law in India is that losses aren’t acknowledged, meaning you can’t offset capital gains with losses or business expenses. In an industry where losses are more common than profits, this clause is a clear attempt to curb cryptocurrency transactions.","“The 1% TDS (tax deducted at source) doesn’t make high-frequency trading viable in India anymore. Traders lose 1% capital on each sale,” says Anoush Bhasin, a crypto tax adviser and founder of Quagmire Consulting.","The data confirms it: The introduction of these taxes combined with the bear market has caused the volumes on major exchanges to drop significantly. As a result, traders are forced to make more calculated decisions, factoring in the impact of taxes on the success of their trades. That they can’t offset their losing trades against their winning ones is the nail in the coffin.","“Furthermore, the TDS compliance burden makes filings very complex.” Bhasin added. “There is no regulatory clarity on TDS for decentralized exchanges, non-custodial wallets or custodial exchanges.”","There has been a significant shift amongst some crypto holders in India to a long-term holding mindset so as to avoid taxes – or at least make paying taxes worth it.","“India has drastically switched laws before, and the ones holding throughout the 2018-2020 ban were the ones who were the most benefited,” speculated a trader who wishes to remain anonymous. “At least my family doesn’t think I’m involved in something illegal now.”","Blockchain consultants and lawyers are noticing a significant brain drain from India and an overall preference to set up shop in nations that are more crypto friendly.","“Existing businesses have moved overseas in the search for less complicated regulations,” said Bhasin. That includes major players such as the founders of crypto exchange WazirX and blockchain Polygon who have both relocated to Dubai.","“Over 40% of my blockchain clients have moved out of India, with Malta and Singapore being preferred destinations,” Vijay Pal Dalmia, an adviser for crypto businesses and an advocate in the Supreme Court of India, said.","A new ITR (tax) draft proposed by the Indian government may target companies and individuals that have moved abroad but still have business ties to India. The new proposal requires foreign entities and individuals to disclose investments in India.","“If this ITR draft [targets us], we would be forced to consider the possibility of disabling our crypto offerings for India. Of course, that wouldn’t be our first option,” said Aayushi Jain, co-founder of ZeroSwap, a Singapore-based decentralized exchange that has a lot of users in India.","The impact of the new regulations also depends on the specific type of business. Some companies have resorted to workarounds that allow them to accept crypto payments.","“For crypto payments, we use payroll systems such as Ontop that deposit Indian currency to [a] bank account within three days,” said Uddalak Das, a crypto marketing consultant. However, using such payment systems introduces a middleman – the very thing crypto aims to eliminate.","“The [majority of the] entities left operating in India are back-end tech or support service providers, which can deal simply in fiat and have no touchpoint with crypto,” Bhasin said.","Most experts agree that India’s current tax laws hurt crypto and are regressive in nature. Changpeng Zhao, CEO of Binance, the world’s largest crypto exchange, recently said that high taxes could “kill the industry” in India.","And yet, India’s presidency of the Group of 20 nations in 2023 and its continued emphasis on crypto regulation indicate that the country will play a big role in framing global crypto policies. Whether the agenda is to call for a global ban on cryptocurrencies or to provide a regulatory framework where innovation can thrive remains to be seen."],"entity":[{"type":"Finance Bill","content":"ORGANIZATION"},{"type":"Finance Bill of 2022","content":"ORGANIZATION"},{"type":"TDS","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Aayushi Jain","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"Anoush Bhasin","content":"PERSON"},{"type":"VDA","content":"ORGANIZATION"},{"type":"Nirmala Sitharaman","content":"PERSON"},{"type":"fiat","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"ITR","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"June 30","content":"DATE"},{"type":"Vijay Pal Dalmia","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Bhasin","content":"PERSON"},{"type":"Uddalak Das","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Malta","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"the Group","content":"ORGANIZATION"}],"hashtag":["Tax Week 2022"],"authors":["Lipsa Das"]}