{"summary":"If laws around taxation are confusing for crypto and art-focused NFTs, music is a whole other can of worms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/16\/music-nft-taxation-guide\/","publishDate":"2022-11-16T20:04:10","id":21451,"type":null,"title":"Taxes and Music NFTs: A Match Made in Hell?","category":["Layer 2"],"content":["Nearly every human who has ever paid a check, received a check, or waited in line at the Post Office on tax day has inevitably experienced some inner gloom regarding a certain five-lettered word: taxes. Throughout much of history, taxes have simply been a way of life. We work, play and live, and then some sort of shadowy figure (probably in a suit) takes a [insert percentage] piece of the pie.","But what about crypto, you ask? Even in such a volatile, often unregulated and always chaotic ecosystem, we still must pay taxes! Like nearly all other industries, you are required to pay a percentage of your short-term and long-term capital gains, put against how long you have held assets and your income. And guess what? The same goes for NFTs too! Degens – can I get a whatthehellelujah?!","Let me explain.","Sidney Swift is founder and CEO of Defient. He leads Rolling Stone’s Web3 Culture Council. This piece is part of CoinDesk's tax week.","Okay, first things first. The basics. Creating (a.k.a. minting) an NFT is not a taxable event. If you create an NFT (a 1:1 or a 10K-strong collection) and no one buys it or trades it, you will not be taxed. So you can rest assured that your decision to tokenize your college diploma will not affect your finances any more than your college education did. Phew! According to Uncle Sam, in the United States, any crypto-to-crypto transaction is a taxable event, including buying an NFT, trading an NFT, or selling an NFT. A handy blog from TokenTax breaks down how any gains you make on NFT trades or sales will be taxed just like any gains on your bitcoin or ether, for example. Pretty straightforward, right? Well, not necessarily. This is crypto we’re talking about, people!","Coinbase explains just how confusing tax laws around NFTs can be. The IRS considers NFT transactions as two-part events, the first being the sale of the crypto you used to buy an NFT (and how much its value rose since the time you purchased it – i.e., 1 ETH from $1,000 to $4,000; ah, the good old days) and the second being any gains from the sale of said NFT. Furthermore, the IRS’ exact guidelines over what is considered a work of art (i.e., a 28% capital gains tax) are somewhat unclear. What about royalties, a buzzword of the moment in NFTs? Any royalties received via NFT sales are still taxed just like income, based on your tax bracket.","See also: Key Tax Implications of NFTs, Crypto Staking and Yield Farming | Opinion","So we understand a bit of what taxes mean for NFTs, where many might initially think about digital collectibles, art, and PFPs, but what about music – and, more specifically, music NFTs?","Taxation around “traditional” recorded music can also be a tad murky. The IRS splits the potential for taxation on whether you categorize your music-making as a hobby or business. Additionally, if you find yourself in a band or duo, you will have to figure out who will file a return. Self-employed musicians and their creative accounts also have an opportunity to write off everything from a guitar case to internet bills. Regardless, musicians are taxed on capital gains, income and royalties.","So what does this mean for the still fresh-faced world of Web3 music, a burgeoning space of the ecosystem categorized primarily by music NFTs (a broad-ish term for tokenized songs and albums, music-focused NFT memberships, music memorabilia, and collectibles) but also things like music DAOs, decentralized labels, and avatar artists? An article in Billboard covers how musicians can legally protect themselves in Web3, especially when you start hearing words like “securities,” “copyrights” and “royalties.”","The web3 music ecosystem is vast. You have royalties-focused platforms (Royal), streaming-focused platforms (Audius), collection\/drops-focused platforms (Sound.xyz), DAOs (Friends with Benefits), decentralized music clubs and avatar artist projects (ChillRX), open protocols (Zora, Decent.xyz), artist tools (OxSplits) and even major labels (Warner, Death Row). The primary purpose of all these operations is to introduce music-making and music-consumption tools into Web3 communities to create alternative revenue streams for artists and fans who show their loyalty through investing in artists. Now, if you reread this last paragraph and this entire article, you should be thinking: What does this mean for the relationship between music NFTs and taxes?","Read more: Tax and Compliance Challenges Enterprises Face in Crypto | Opinion","If laws around taxation are confusing for crypto and art-focused NFTs, music is a whole other can of worms. Platforms like the 3LAU-founded Royal pay streaming royalties to fans who invest in music NFTs from artists ranging from superstars (Diplo) to indie artists (Vérité). When streaming checks hit and are split between artists and labels\/publishers, a percentage is then paid out to investors of the artist’s NFTs. Royal’s T&C page outlines that, yes, you are responsible for reporting any gains around your trades or sales. What’s less clear is how that differentiates around the fluctuation of the currency you bought the NFT with and whether you are taxed on the royalties payout you receive and\/or your profit from a potential NFT sale. Likely, the answer is both.","What do artists who mint music NFTs get to write off? How do their label and streaming contracts come into play when setting royalty rates and paying out collectors? When a virtual artist, who could be actually multiple producers, releases a track as an NFT and on Spotify, who is taxed and when? How are members of music DAOs taxed on the value of membership tokens and collective investments, like music catalogs, which are strictly tied to royalties and various tax laws? Is it all the same as regular crypto? I believe all of these questions are far too unclear and need answering.","Here’s why:","Taxes are something no one really ever wants to talk about, and this is especially true in Web3. For decades, classes have been taught and books have been written about the inner-workings of the music business. The world’s top music lawyers are industry icons who get profiled in year-end lists. If web music is truly going to change the world and bring power back to artists and the communities who support them, we can no longer avoid the inevitable growing elephant in the room."],"entity":[{"type":"Compliance Challenges Enterprises Face","content":"ORGANIZATION"},{"type":"Rolling Stone’s Web3 Culture Council","content":"ORGANIZATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Uncle Sam","content":"ORGANIZATION"},{"type":"Sidney Swift","content":"PERSON"},{"type":"$4,000","content":"MONEY"},{"type":"Spotify","content":"PERSON"},{"type":"Warner","content":"ORGANIZATION"},{"type":"Post Office","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["Tax Week 2022","Opinion"],"authors":["Sidney Swift"]}