{"summary":"The government may write special rules regarding the treatment of the new asset within the cubbyhole, but there will be an existing tax bucket for every new idea, says KPMG's Tony Tuths.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/14\/cryptocurrency-nft-digital-asset-taxation\/","publishDate":"2022-11-14T17:18:34","id":21452,"type":null,"title":"The Key to Taxing Digital Assets Is Finding the Right Cubbyhole","category":["Layer 2"],"content":["The path to taxation for digital assets in the U.S. is still in its infancy. As with any novel type of property, there is much to be done to appropriately designate these assets within a certain tax class.","While the taxation of cryptocurrency, non-fungible tokens (NFTs) and their related transactions still has gray areas, a lot can be said for what is known – and what will surely contribute to the shaping of a tax protocol for digital assets.","Tony Tuths is digital asset practice leader and principal, alternative investment tax, at KPMG LLP. This piece is part of CoinDesk's Tax Week.","Various tax positions are being taken and therefore shown to the Internal Revenue Service on tax returns filed over the last few years, an indication the market is coming to a consensus on how certain digital assets and transactions should be categorized and taxed. Whether the IRS will agree with these “tax cubbyholes,” however, is another question entirely.","There are also industry participants who believe that digital assets should require new tax rules because of their newness, though I’d argue that every asset and transaction, no matter how new or old, has always fit within an existing cubbyhole in the U.S. tax system. The government may write special rules regarding the treatment of the new asset within the cubbyhole, but there will be an existing tax bucket for every new idea.","Crypto is both a fungible property that can be transferred on a blockchain and a store of value, equity or asset-backed product. In this regard, crypto resembles a financial product (think stocks or commodities). In other cases, crypto can represent governance and platform tokens, which are still property but perhaps more like generic property as opposed to financial assets.","The IRS has stated that crypto should be treated as property, but the IRS Notice from 2014 didn't specify the type of property (stock, commodity, personal or business) or segregate crypto into different property types. Assets such as NFTs only complicate the question of whether all crypto should really be treated the same for tax purposes.","Read more: Lipsa Das - The State of Crypto Taxation in India: Past, Present and Future","The current state of crypto taxation can be summarized this way: The sale of crypto produces a capital gain or loss (except for dealers), and what is long or short term depends on the holding period. Taxpayers can elect which crypto lots they sell for tax purposes to minimize taxes.","Certain anti-abuse rules such as the wash-sale rule and constructive-sale rule don't apply to crypto (these statutes use the terms “stocks” and “securities”), but other rules do apply. For example, the straddle rules affect “actively traded personal property.” The short-sale rules apply to crypto as well, but the embedded anti-abuse rules don't because they address only stocks and securities. These are just some of the tax nuances to be aware of.","Certain crypto income transactions are unique and present special tax considerations. For example, staking (operating a node and verifying transactions in exchange for reward tokens) is treated by the market as akin to mining despite the lack of tax guidance for staking. Mining is treated as a services business and, if conducted within the U.S., it triggers U.S. tax for non-U.S. participants.","The market, however, has taken the position that delegated staking (contracting with an unrelated party to lock one’s tokens on behalf of a node owned and operated by that third party) isn't a business. With this convention, the market has formed a tax position where non-U.S. persons aren't subject to U.S. net income tax when a U.S. crypto manager engages in delegated staking on their behalf.","Of course, delegated staking rewards have their own tax issues. For non-U.S. individuals, these rewards may be subject to U.S. withholding tax if such rewards are sourced to the U.S. Different income types have different sourcing rules under the tax code.","There is no rule for staking rewards, however. The market has taken the position that staking rewards should be sourced to the location of the activity and the computer node. While it’s not clear if this is the correct course, almost all U.S.-based validators have put their staking operations outside the U.S. for this purpose.","Decentralized finance (DeFi) rewards suffer a more acute tax sourcing issue. Because locating the physical source of DeFi rewards is impossible, the market has rallied around the idea that DeFi rewards are sourced to the recipient, thereby avoiding all tax issues. DeFi presents tax issues far beyond the scope of this article, the least of which is the question of whether DeFi activities should be seen as part of a de facto partnership and taxed accordingly.","Read more: Megan DeMatteo - The NFT Creator's Guide to Year-End Tax Planning","With the introduction of NFTs, the digital asset tax world became infinitely more complicated. Again, taxation depends on the type of property and into which tax cubbyhole a property is placed. That said, given that NFTs can represent virtually anything from a concert ticket to artwork to a house deed, each type of property belongs in a different cubbyhole.","Applying a blanket tax doctrine to NFTs would be futile. Only the property underlying the NFT can dictate the tax treatment. Moreover, many NFTs have embedded contracts, such as licenses and royalty agreements, and should arguably be taxed independently.","In time, the U.S. will develop a more robust structure for taxing crypto, NFTs and related transactions. I suspect we will see taxation based on the substance of an asset rather than its title. Not all crypto or NFTs should or will be taxed the same. In the meantime, taxpayers have the opportunity to coalesce around certain tax positions and influence preferred treatment. And as the use of blockchain and Web3 evolves, so will the tax system – one cubbyhole at a time."],"entity":[{"type":"2014","content":"DATE"},{"type":"KPMG LLP","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Lipsa Das","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"IRS Notice","content":"ORGANIZATION"},{"type":"The State of Crypto Taxation","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Megan DeMatteo","content":"PERSON"},{"type":"Tuths","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Tax Week 2022","IRS","Crypto"],"authors":["Tony Tuths"]}