{"summary":"As of right now, all funds are frozen, which means FTX users are stuck. What will this mean for taxpayers?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/17\/ftx-crypto-tax-loss\/","publishDate":"2022-11-17T16:24:53","id":21458,"type":null,"title":"The Tax Implications of the FTX Bankruptcy","category":["Consensus Magazine (layer2)"],"content":["The crypto world has been shaken by the biggest black swan event in its 13-year history. FTX has become insolvent and all funds on the exchange are frozen.","The FTX situation is no fun for anyone, especially if you had funds on the exchange. But there are some silver linings from a tax perspective. I’m a certified public accountant (CPA) and I’ve been in crypto since 2014, so unfortunately this isn’t the first time I have seen taxpayers lose (or potentially lose) some or all of their crypto holdings due to an exchange being shut down.","Laura Walter is a CPA and the founder of Crypto Tax Girl, a cryptocurrency tax firm. Joe Howe is a crypto tax specialist at Crypto Tax Girl. This piece is part of CoinDesk's Tax Week.","We still don’t know what will ultimately happen with FTX, but in the meantime, here’s my advice on how to make the most of this bad situation.","FTX filed bankruptcy, which means customers with assets on FTX could still get a portion of their funds back – or they could get nothing at all (as we saw with the long drawn-out cases of Mt. Goxand Cryptopia). So while in limbo, how and when should this potential “lost” money be reported on your tax return?","The best thing you can do at this moment is get any documentation you can from FTX about your account (CSV files of all transactions including withdrawals, deposits, trades and income, as well as screenshots of balances and account info). In light of the recent hack on FTX though, please proceed with caution when trying to get documentation.","See also: Tax and Compliance Challenges Enterprises Face in Crypto | Opinion","As of right now, all users’ funds are frozen and FTX has halted withdrawals, so FTX users are stuck. This unfortunately means that from a tax perspective, there is nothing you can do yet. Because there is still a chance that your funds will be recovered, you cannot deduct any losses, and you aren’t required to report any gains.","If, however, the funds don’t end up being recovered and the exchange gets shut down (as we’ve seen with Mt. Gox, QuadrigaCX, BTC-E, Cryptsy, Celsius and so many others), I would recommend classifying tokens lost on FTX as worthless investment losses, and taking a capital loss in the year that it is determined that the tokens are deemed worthless.","Per the Internal Revenue Service: “If you own securities, including stocks, and they become totally worthless, you have a capital loss…Worthless securities also include securities that you abandon. To abandon a security, you must permanently surrender and relinquish all rights in the security and receive no consideration in exchange for it.”","Though crypto is not considered a stock or security, it is also subject to capital gains and losses, which are reported on Form 8949, so this also applies here.","Read more: Why NFT Tax-Loss Harvesting Remains a Challenge for Investors | Opinion","Because users were holding funds on FTX with the intent to invest them, I take the position that if funds are not returned to users, they have a worthless investment. This means that users’ assets held on FTX can be treated as a sale for $0 on the last day of the year in which it becomes clear they will not be getting their funds back (i.e., the investment becomes worthless), and deduct the cost of the tokens lost as a capital loss on Form 8949.","It is important to note that you cannot take a capital loss for the current fair market value of the tokens. Rather, you would take a loss for the original cost basis of the tokens (i.e. what was paid for them or the value of the tokens when you acquired them).","It is also important for users to wait to take the worthless investment loss until they’re sure that they won’t ever recover their funds. This is because if they do end up recovering them in the future, they would need to include the value of the tokens at that time as income, which may end up being more costly.","As soon as we get more clarification on what the future holds for FTX, I will start advising clients to either treat their funds on FTX as worthless investments or as traditional capital gains or losses. For now, we'll all have to wait out the storm and cross our fingers that our FTX funds aren’t lost forever. I’ll also be crossing my toes."],"entity":[{"type":"2014","content":"DATE"},{"type":"Crypto Tax Girl","content":"ORGANIZATION"},{"type":"CSV","content":"ORGANIZATION"},{"type":"Compliance Challenges Enterprises Face","content":"ORGANIZATION"},{"type":"Cryptsy","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Joe Howe","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"last day of the year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$0","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Mt. Goxand Cryptopia)","content":"ORGANIZATION"},{"type":"Laura Walter","content":"PERSON"}],"hashtag":["Tax Week 2022","Opinion"],"authors":["Laura Walter","Joe Howe"]}