{"summary":"Use data aggregators, get a trusted adviser and learn to live with a little uncertainty.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/17\/how-to-prepare-crypto-digital-asset-taxes\/","publishDate":"2022-11-17T14:42:09","id":21454,"type":null,"title":"EY’s Crypto Tax Leader Breaks Down What You Need to Know This Tax Season","category":["Layer 2"],"content":["A common thread has persisted throughout the market swings, technological innovations and novel use cases that define the rise of crypto: taxes. The industry’s exciting new concepts and vernacular can leave one overwhelmed and confused. Then quickly comes the realization … this is all subject to tax?","Countless blog posts, journal articles and webinars have sought to address and resolve the crypto tax “gap” – from creating awareness around enacted and proposed legislation. There are also a number of technology solutions enabling data aggregation and organization aimed at making tax obligations simple.","Thomas Shea is the financial services crypto tax leader at Ernst & Young LLP. This article is part of CoinDesk’s Tax Week.","However, even the most comprehensive of guides cannot consider all of a taxpayer’s unique facts or adequately assess the risk associated with taking certain positions. Crypto is about empowering individuals, afterall.","The complexity of applying current tax rules to new concepts in crypto like mining, staking, lending, multi-wallet aggregation, Web3 gaming, NFT purchases and “yield farming,” can lead to significant errors or omissions.","At this critical juncture in the regulatory timeline, it feels like taxpayers are again faced with uncertainty related to their individual obligations. However, progress is being signaled from regulators and it’s in the best interest of all taxpayers to ensure they don’t get caught flat-footed.","See also: What Will It Look Like When Taxation and Privacy Collide? | Opinion","The current income tax guidance and infrastructure at present has induced a heavy reliance on self-reporting. That is to say, the burden for aggregating and compiling what is often publicly available transaction and asset-related information lies with the end-user.","While the U.S. Treasury has alluded that tax information reporting regulations will likely be released by the end of this year, most taxpayers will not be receiving a Form-1099 related to all their digital asset activity for 2022.","However, we’ve seen more attention and proposed legislation in the last 12 months than in any other period in the digital asset era. Further still is the evolved view in recent legislative proposals (including Treasury Green Book and Responsible Financial Innovation Act), that extends provisions historically reserved for commodities, securities or currencies to digital assets without necessarily classifying crypto as any of these existing asset classes.","This is an implied acknowledgment that digital assets are a separate and unique class – an understanding that is essential to the continued expansion and growth of this budding industry.","Still, as of today, the industry still has limited authoritative guidance. The reporting onus lies with taxpayers and the 2022 tax reporting season is rapidly approaching. On top of that, the IRS criminal investigation division announced that “hundreds” of crypto cases are coming.","Read more: Tax and Compliance Challenges Enterprises Face in Crypto | Opinion","So, what should you do? I am consistently asked by clients for advice on how to make use of the tools that exist and how to best undertake the necessary aggregation and tracking data. A variety of tax reporting platforms are available to taxpayers, and they are not all created equal.","Seeking a trusted tax advisor and solutions that align to your profile and activity can go a long way in this endeavor. It is critical to anticipate these significant responsibilities and act now. These steps may even include amending previously filed returns. Doing so can, and likely will, save you time and money and better protect you against unanticipated future tax obligations.","Views expressed in this article are those of the author and do not necessarily represent the views of Ernst & Young LLP or other members of the global EY organization.","\n"],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Compliance Challenges Enterprises Face","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Thomas Shea","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Ernst & Young LLP","content":"ORGANIZATION"},{"type":"1099","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Treasury Green Book","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["Tax Week 2022","Opinion","taxes","EY"],"authors":["Thomas Shea"]}