{"summary":"\"Pretty meh volume\" for the group, said one analyst.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/10\/02\/ether-futures-etfs-see-low-volume-in-first-day-trading\/","publishDate":"2023-10-02T21:10:08","id":21468,"type":null,"title":"Ether Futures ETFs See Low Volume in First-Day Trading","category":["Markets"],"content":["It was a slow start for the first day of trading for futures-based ether exchange-traded funds (ETFs).","A total of nine of the ETFs offering exposure to ether futures came to market on Monday. Five will hold only ether futures, while four will hold a mix of bitcoin and ether futures. One of those funds, Valkyrie’s Bitcoin Strategy ETF (BTF) – soon to be renamed – has been in existence for about two years as a bitcoin-only fund, but is changing its strategy to include ether. The rest of the vehicles are new to market.","“Pretty meh volume for the Ether Futures ETFs as a group,” said Bloomberg ETF analyst Eric Balchunas.","Among the more popular of the new ETFs today, VanEck’s Ethereum Strategy ETF (EFUT) traded just shy of 25,000 shares at a price roughly averaging $17 per share for total dollar volume of just $425,000.","As comparison, the ProShares Bitcoin Strategy ETF (BITO) – which launched in October 2021 amid a raging crypto bull market – traded more than $1 billion in in dollar volume on its first day.","The crypto industry continues to await a decision from the U.S. Securities and Exchange Commission (SEC) over numerous recent and older applications for both spot bitcoin and spot ether ETFs. Grayscale Investments Monday morning threw its hat in the ring on ether, filing to convert its nearly $5 billion Grayscale Ethereum Trust (ETHE) to a spot ETF.​​","Edited by Stephen Alpher."],"entity":[{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$17","content":"MONEY"},{"type":"$5 billion","content":"MONEY"},{"type":"October 2021","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"BTF","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$425,000","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["Ether","ether ETF"],"authors":["Lyllah Ledesma"]}