{"summary":"Web3 tax help is a multibillion-dollar opportunity, and a way to plug the gap the government has around tax help and out-compete centralized companies like TurboTax.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/18\/say-goodbye-to-proprietary-tax-prep-software\/","publishDate":"2022-11-18T21:04:30","id":21460,"type":null,"title":"Say Goodbye to Proprietary Tax Prep Software","category":["Layer 2"],"content":["The average American pays $294 to file taxes each year. These fees equate to roughly $11.3 billion per year in revenue for tax prep companies. In the crypto world, the costs of tax filing can be many multiples more than traditional tax preparation as it usually requires more time, software and specialized professionals to assist.","Megan Knab is CEO of Franklin, a crypto-native payroll company. This article is part of CoinDesk’s Tax Week.","However, the Internal Revenue Service (IRS) and state tax authorities already have the majority of our wage information reported to them every pay period by employers. Why, then, do W2 workers need to send back forms with information the tax authorities already have?","For years, tax-help giant Intuit quietly lobbied against the Return Free Tax System, an initiative from the IRS dating back to the 1990s, in order to build their own self-hosted, free system for taxpayers to file. Instead of this governmental service, Intuit and other tax preparation software providers agreed to offer a free version of their software for low-income Americans.","However, through deceptive up-charging (like only offering federal filing for free and charging for each state tax) as well as tricky user design, these “free programs” easily add up to over $200 per filing.","Read more: Use Your Crypto Losses to Turn the Tables Against the IRS \/ Opinion","It seems illogical to many that we must pay intermediaries to tell us how much we owe the government each year. And that’s part of the reason why some of the largest companies in Web3, which seeks to disintermediate many applications across the internet, are tax softwares.","Today, there is massive competition among decentralized tax help providers to expand both support in terms of chains as well as automating reconciliation and profit\/loss calculations. This is because filing taxes on crypto transactions is often unclear and overly complex.","Many outsource their tax prep entirely, hoping that throwing money at the problem will save them from it.","Read more: Payroll, Web3 and the $62B Opportunity","The recently passed Inflation Reduction Act allocates $15 million for the IRS to further explore how to enable Americans to pay their taxes without using middlemen like Turbotax. The goal is to have this new, yet-to-be-determined program replace the Return Free Tax System flop.","On the crypto side, the logic needed to transform on-chain data to be able to calculate capital gains\/losses is increasingly more commoditized. For the average crypto user who does not have a portfolio of more speculative investing activity, the data transformations and simple formulas are already open sourced.","As we move closer to free tax filing software and more easily attainable calculators, we can kiss our TurboxTax accounts goodbye."],"entity":[{"type":"the IRS","content":"ORGANIZATION"},{"type":"Tables Against the IRS","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"$11.3 billion","content":"MONEY"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Turbotax","content":"ORGANIZATION"},{"type":"Franklin","content":"LOCATION"},{"type":"Intuit","content":"ORGANIZATION"},{"type":"$62B Opportunity","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"Megan Knab","content":"PERSON"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"$200","content":"MONEY"},{"type":"$294","content":"MONEY"}],"hashtag":["Web 3","Tax Week 2022","IRS","Opinion","taxes"],"authors":["Megan Knab"]}