{"summary":"The need for comprehensive crypto tax reform will become clearer as people start interacting with blockchains – and incurring capital gains taxes – without realizing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/17\/tax-aversion-crypto-community\/","publishDate":"2022-11-17T14:31:49","id":21462,"type":null,"title":"Crypto Users Want to Pay Taxes, but We Need Clearer Rules","category":["Layer 2"],"content":["Something often said about the crypto community is that it’s full of libertarian tax cheats. The stereotype doesn’t come from nowhere – crypto does have its roots in crypto-anarchist ideology. And many of our favorite stories often involve “sovereign individuals” and “oppressive regimes,” even though those fables are distorted into antagonistic media narratives about the industry.","Today’s community looks vastly different than it did even a few years ago, let alone when cypherpunk coder Satoshi Nakamoto first invented Bitcoin. The contemporary crypto scene is diverse – full of financial, artistic, ideological and technical blockchain users – and frankly, only a minority are crusaders against taxation.","Richa Joshi is co-founder of Push Protocol. This article is part of CoinDesk’s Tax Week.","So why does this narrative persist? The answer is more nuanced than stubborn resistance.","There are people who dislike or are confused by contemporary tax rules around crypto – including regulations that make buying coffee with BTC a taxable event and airdrops a form of income.","Still, by and large, the crypto community does not want to evade or avoid taxes – they just want clear and commonsense rules. The vast majority of crypto users are citizens who wish to pay their dues to their communities, their cities and their government. (Crypto, afterall, is about collaboration – and nation states are pretty big communities.)","However, despite year-over-year efforts to clarify crypto tax filing, regulatory agencies have failed to keep pace with technical innovation in Web3. (This doesn’t include rules that make sense, like capital gains paid after buying a token for x and selling it for 2x, which has a direct analogue to traditional finance.)","Read more: US Crypto Tax Guide 2022","Things get complicated when considering how crypto is meant to function, and how it differs from anything that came before. Take gas fees, or the price you pay to run computation on a blockchain like Ethereum, which could be treated as traditional portfolio management fees or possibly discounted from capital gains. Further, many DeFi mechanisms – like flash loans! – have limited or no equivalents in traditional finance.","This scale of differentiation between crypto financial mechanisms and traditional ones is felt primarily by individuals filing their taxes, who are burdened both with submitting their taxes without clear guidelines and with the potential downfall of getting them wrong.","Even well-meaning actors may end up feeling unsupported or scrutinized by regulators, and that tension results in the kinds of anti-tax conversations heard on Crypto Twitter. When people in crypto criticize taxes, they do so less out of ideological grandstanding and more out of simple frustration with a system that appears to ignore a technology that is growing in size, profitability and significance.","Read more: The Case for Taxing Proof-of-Work \/ Opinion","They’re commenting on the tension between filer and regulator, which emerges when authorities appear to ignore the nuances of the rules they’re writing or how that affects what you can do with a blockchain.","Take, for example, U.S. Treasury Secretary Janet Yellen’s recent suggestion that unrealized gains should be taxed – any crypto trader who has experienced a bull market will recognize the consequences of being left with such a tax! Many people were rich on paper in 2021, and wiped out today, for instance.","Read more: How Web 3 Could Change Tax Collection","As Web3 grows and encroaches on nearly every industry in some way or another, the need for renewed crypto tax regulation will become clear. If this technology is broadly accepted, to the point where most don’t even recognize that they’re interacting with a blockchain, having less stringent rules will become necessary, not a preference, as we can’t have people incurring capital gains taxes without even knowing it.","Crypto users don’t want to live off the grid and outside of the reach of the government. Overwhelmingly, they want to be active members of their communities helping others build, grow and create.","\n"],"entity":[{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Richa Joshi","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"US Crypto Tax Guide 2022","content":"ORGANIZATION"}],"hashtag":["Tax Week 2022","Crypto Taxes","Opinion","taxes"],"authors":["Richa Joshi"]}