{"summary":"Tax expert Victoria J. Haneman compares Sam Bankman-Fried's crypto trading empire to Bernie Madoff's Ponzi scheme to glean what the FTX fallout could mean for tax filers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/18\/ftx-collapse-bankruptcy-crypto-tax-implications\/","publishDate":"2022-11-18T16:54:53","id":21469,"type":null,"title":"If You Lost Money on FTX, You May See Some Tax Relief","category":["Layer 2"],"content":["The Bernie Madoff Ponzi scheme uncovered in late 2008 resulted in new Internal Revenue Service (IRS) guidance allowing investors to recover substantial losses from the $65 billion financial fraud. Will the 2022 crypto implosions likewise prompt another round of guidance tailored for the crypto market? Time will tell.","The recent collapse of global crypto exchange FTX is likely to be one of the most impactful events in the digital asset industry’s 13-year history. In a spectacular event kick-started by a CoinDesk article and a couple of tweets, billions of dollars of wealth spontaneously combusted, 130+ entities declared bankruptcy and thousands of users are without access to their funds.","Victoria J. Haneman is Frank J. Kellegher professor of trusts and estates at Creighton University School of Law. This article is part of CoinDesk’s Tax Week.","For FTX users, the situation is bleak. It is unlikely that funds deposited at FTX will be recovered. What is the FTX investor to do – from a tax perspective – now that their cryptocurrency investment is (at best) in a death spiral or (at worst) lost forever?","It seems that FTX founder Sam Bankman-Fried, the charismatic marketplace wunderkind referred to as SBF, extended $10 billion of loans funded by FTX customers to prop up his trading firm Alameda Research.","When a surge of FTX customers attempted to withdraw their money from the cryptocurrency exchange, the result was an epic liquidity crisis that left FTX with an $8 billion shortfall. The exchange was supposed to keep 1:1 reserves to customer deposits, but was in fact operating on fractional reserves (a bit like a bank).","Read more: Crypto Can De-Escalate the Tax War | Opinion","What looks very much like the (mis?)appropriation of client funds from FTX to Alameda was never disclosed to customers. The transfers arguably violated FTX terms of service, and perhaps also U.S. federal laws. All of this has serious implications for users’ tax bills.","The situation will likely be complicated by ongoing criminal investigations and bankruptcy processes, as well as whether users were able to move their funds off the exchange.","For those who abandoned ship early and successfully cashed out and\/or withdrew funds, any resulting capital loss may be used to offset their capital gains (plus $3,000 of ordinary income). Any excess capital loss is not wasted. The investor can continue to offset capital gains taxes accrued from trading or investment activities and take a deduction of $3,000 every year until the loss is exhausted, according to tax precedent.","What about the investors who find themselves stuck? Thousands upon thousands on the FTX exchange are unable to trade or withdraw funds. These investors are in a more complicated tax position, with an investment that is essentially frozen. They are unable to realize a loss for tax purposes because no sale or exchange can happen.","But doesn’t the Internal Revenue Service’s (IRS) rulebook allow a deduction for worthless securities that are considered “capital assets?” Yes. And yes, crypto is usually characterized as a capital asset.","Unfortunately, the deduction for worthless securities requires that a security be worthless. The IRS insists that crypto is property, and the Securities and Exchange Commission (SEC) has not yet formally declared that cryptocurrencies as an asset class are securities.","It is also unclear whether crypto on the FTX exchange is completely worthless, or simply inaccessible because of illiquidity (with possible partial recovery down the road).","Read more: Crypto Capital Gains and Tax Rates 2022","What about a personal casualty loss deduction? Personal casualty losses have been suspended until the end of 2025, according to 2018’s Tax Cuts and Jobs Act, unless the loss is related to a federally declared disaster. So, unless an FTX investor has lost access to their wallet forever because of a sudden or unexpected event occurring because of a declared disaster, or the FTX bankruptcy carries through to 2026 without resolution, a personal casualty loss is unlikely to be available.","Perhaps it is an option for the FTX investor to claim an “abandonment loss” under U.S. Treasury Reg. ยง1.165-2. If the investment has lost all value (not because of a sale or exchange), and the taxpayer initially had the intent to make a profit, there is now clear intent to abandon the investment. This means “affirmative actions” have been taken to demonstrate abandonment – a possible path to a write off. However, the burden is on the taxpayer to establish that all of these requirements have been met.","Further, if Sam Bankman-Fried’s trading empire is found to have operated as a Ponzi scheme, that characterization may end up providing substantial tax relief to investors. Ponzi schemes generally implode when the momentum of new investments is disrupted, for whatever reason, with the resulting illiquidity crisis causing a collapse.","Some have already compared FTX’s collapse to the Ponzi started and managed by Bernie Madoff (the largest in history with $65 billion), while others believe that FTX started out as a legitimate crypto investment and backslid into a Ponzi when Alameda began losing money.","Regardless, if the FTX collapse falls within the definition of a Ponzi, investors may deduct their losses as an “investment theft loss” instead of a capital loss. And while capital losses are subject to loss limitation rules ($3,000 per year against ordinary income), investment theft losses are deductible immediately.","Relief under the Ponzi scheme “safe harbor” set forth in Rev. Proc. 2009-20 is not without precedent in the digital asset industry. Investors in BitConnect, a $2.4 billion global Ponzi scheme, may enjoy the benefits of this safe harbor following the indictment of its founder in February 2022.","Under safe harbor rules, an investor may take a deduction equal to 95% of the amount invested in the cryptocurrency if the investor is not seeking or does not intend to seek recovery from a third party.","The loss is deductible in the year of discovery or the year the Ponzi scheme’s orchestrator is (1) charged by indictment for fraud, embezzlement or a similar crime; (2) the subject of a state or criminal complaint and either admits guilt or has assets frozen by court-order; or (3) the subject of the fraudulent arrangement faces no charges, indictment or complaint because of his death.","See also: Is Crypto a Ponzi? Define 'Ponzi' | Opinion","It remains to be seen if charges will be filed against SBF. Unfortunately, it may be difficult to establish criminal intent as opposed to withering incompetence on the part of 30-year-old former quant. Still, the SEC and the Justice Department (DoJ) are both reportedly investigating the collapse of FTX. Though some argue that there will be jurisdictional challenges because FTX is headquartered in the Bahamas (despite declaring bankruptcy in the U.S.).","For now, considering what we know today, individual investors with money trapped in the FTX exchange are unlikely to be able to take a deduction on their 2022 tax filings. FTX will be one of the largest crypto bankruptcies to date, with reportedly more than one million creditors, and it takes time to untangle a spectacular five-day conflagration of billions of dollars of wealth."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"Frank J. Kellegher","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$65 billion","content":"MONEY"},{"type":"Creighton University School of Law","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Justice Department (DoJ","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Ponzi","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Victoria J. Haneman","content":"PERSON"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"Bernie Madoff Ponzi","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"U.S. Treasury Reg","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Alameda","content":"LOCATION"},{"type":"Crypto Capital Gains","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["Tax Week 2022","Opinion","FTX Collapse","FTX","taxes","Regulation","Ponzi"],"authors":["Victoria Haneman"]}