{"summary":"Suivre #cryptotwitter peut vous aider à rester informé des dernières nouvelles, conversations et controverses importantes dans le monde de la Cryptomonnaie.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/getting-started-with-crypto-twitter\/","publishDate":"2022-07-29T20:11:00","id":21470,"type":null,"title":"Premiers pas avec Crypto Twitter","category":["Learn"],"content":["La communauté Crypto sur Twitter est un référentiel en constante évolution de questions, réponses, explications et spéculations provenant de tous les coins de la communauté Crypto . C'est ONEune des principales plateformes d'échange d'idées : les personnes et les projets annoncent les étapes de leur progression, rassurent lorsque les choses tournent mal et partagent leurs réflexions personnelles.","Si vous êtes nouveau dans ce domaine, voici quelques idées pour savoir par où commencer.","Votre première étape pour rejoindre Crypto Twitter (#cryptotwitter) est de commencer à suivre certains comptes clés sur Twitter, mais avec le bruit et le volume d'un sujet comme la Crypto, il peut être difficile de savoir par où commencer.","Pour collecter un stock sain de voix sur votre flux, une approche utile peut consister à diviser la communauté Crypto en catégories telles que les développeurs, les écrivains, les investisseurs, etc. Peut-être souhaitez-vous vous concentrer sur une catégorie. Ou vous voudrez peut-être choisir quelques grands noms de chacun pour commencer.","Pour commencer, il y a les acteurs du monde de la Crypto , les personnes qui ont personnellement développé ou géré de grandes entités Crypto . L’équipe qui a fondé Ethereum fait partie des leaders dans ce domaine. Leurs comptes vous KEEP au courant de la blockchain de couche 1, ainsi que des développements dans le large éventail de projets sur lesquels ils travaillent actuellement.","Vitalik Buterin est peut-être le plus connu des fondateurs d'Ethereum. Il a écrit le livre blanc alors qu’il n’avait que 19 ans. Ces jours-ci, il tweete un mélange de commentaires sur les derniers débats Crypto et de commentaires philosophiques qui suscitent la réflexion. Une grande partie de ses articles ne portent pas du tout sur la Crypto , mais sur des questions politiques ou morales plus larges. Il pose à ses partisans des questions difficiles aussi souvent qu’il exprime ses propres opinions.","Gavin Wood, fondateur Ethereum, a depuis cofondé Polkadot , ONEun des plus grands concurrents d'Ethereum. Ses messages sont généralement concis, axés sur la cryptographie et techniques. Il retweete également de nombreux commentaires Crypto d’autres voix. Et Joseph Lubin a fondé ConsenSys, l’incubateur d’applications Ethereum, après avoir joué son rôle dans la fondation Ethereum lui-même.","Le fondateur de Bitcoin est un peu plus difficile à Réseaux sociaux sur Twitter : personne ne sait qui il est . Mais si vous êtes particulièrement intéressé par Bitcoin, il existe un certain nombre de comptes entièrement dédiés au partage d'informations sur la Cryptomonnaie originale. Deux outils utiles pour commencer sont @DocumentingBTC et @BTC_Archive .","Les fondateurs des principaux échanges Crypto méritent également d’être suivis. Le fondateur de Binance, Changpeng Zhao , mieux connu sous le nom de CZ, tweete presque tous les jours des opinions et des mises à jour sur sa propre entreprise et l'espace au sens large. Le fondateur de Coinbase, Brian Armstrong, est également très actif sur Twitter, partageant fréquemment des nouvelles et des informations sur la réglementation de la Crypto , entre autres domaines.","Après avoir cliqué sur « Réseaux sociaux» sur quelques-uns des premiers visionnaires de la cryptographie, vous pourriez regarder les personnes qui se sont fait un nom et même une Offres d’emploi en écrivant sur le sujet. Outre les auteurs populaires, certains universitaires et chercheurs spécialisés sont également actifs sur Twitter. Dans cette catégorie, vous souhaiterez probablement vous concentrer sur le niveau de détail technique qui correspond à votre propre expérience.","Andreas Antonopoulos est un nom célèbre dans ce domaine. Il est consultant, podcasteur et auteur qui a également créé un catalogue approfondi de contenu YouTube pour aider les gens à comprendre la Crypto. Ses tweets proposent souvent des explications concises sur les concepts de Crypto ou prennent position sur un sujet HOT . Si votre objectif est de vous renseigner sur la Crypto, mais que vous n'avez T beaucoup de connaissances techniques, vous apprécierez peut-être son travail. La podcasteuse et auteure Laura Shin publie également de nombreux contenus vidéo, interviews, actualités de tiers et autres contenus conçus pour vous KEEP au courant de la conversation.","Si vous souhaitez équilibrer votre flux, vous pourriez être intéressé à ajouter quelques sceptiques du Web3 à votre liste, tels que le compte Web3 de l'éditeur de Wikipédia Molly White va tout simplement génial ou Jackson Palmer , le fondateur de Dogecoin qui est depuis devenu un ardent critique de la Crypto .","Une troisième catégorie importante de personnages Crypto est celle des investisseurs. Certaines de ces personnes sont responsables du déplacement de tellement d'argent qu'il vaut probablement la peine d'écouter leurs pensées, même si vous n'êtes T d'accord avec elles. Des exemples frappants seraient Ari David Paul , fondateur de BlockTower Capital, ou Cathie Wood , PDG et fondatrice d'Ark Invest.","Si vous souhaitez particulièrement Réseaux sociaux des investisseurs célèbres, recherchez simplement les plus grands fonds d'investissement Crypto , puis recherchez les noms de leurs gestionnaires sur Twitter. Ils ne partagent peut-être pas leurs stratégies, mais vous pourriez quand même Guides quelque chose.","Une fois que vous avez trouvé quelqu'un que vous aimez ou que vous trouvez intéressant, vous pouvez rapidement en trouver davantage en regardant qui il retweete ainsi que les personnes avec lesquelles il interagit. Consultez l'onglet « Tweets et réponses » sur n'importe quel profil pour voir non seulement les fils de discussion qu'ils démarrent, mais également les personnes auxquelles ils répondent. Vous pouvez ainsi tracer un chemin à travers une communauté en ligne. En cas de doute, Réseaux sociaux: vous pourrez toujours vous désabonner plus tard.","Un autre bon hack que Twitter a un BIT caché est de trouver quelqu'un que vous aimez et de voir s'il a organisé l'une de ses propres listes Twitter. Par exemple, Taylor Monahan , qui a épinglé un excellent fil de ressources pour les débutants sur son profil, a également organisé des listes qu'elle a créées ou trouvées et suivies elle-même :","Pour voir si quelqu'un a des listes, ajoutez simplement \/lists à la fin de l'URL de son profil, par exemple : https:\/\/twitter.com\/tayvano_\/lists vous amènera aux listes ci-dessus. Vous pouvez Réseaux sociaux les listes que d’autres personnes créent en gros ou les utiliser pour simplement ajouter des personnes de n’importe quelle liste qui piquent votre curiosité Crypto .","Même si vous êtes déjà un fervent utilisateur de Twitter, vous pourriez toujours être dérouté par certaines des choses que les Crypto monnaies mettent sur leurs profils.","Certains membres de la communauté Crypto aiment afficher visuellement leurs actifs Crypto à leur public numérique. C'est ainsi que sont nés les « NFT avec photo de profil (PFP) ». Certains détenteurs de NFT aiment faire de l’œuvre d’art pertinente leur photo de profil, se proclamant fiers propriétaires et signalant souvent leur passion pour la Crypto en général.","Twitter lui-même a reconnu et même encouragé cette pratique, en proposant de vérifier si les utilisateurs possédaient les NFT associés à leurs photos de profil. Depuis janvier 2022, vous pouvez définir votre photo de profil Twitter sur votre NFT et obtenir une bordure hexagonale spéciale pour montrer son authenticité. Quelqu'un d'autre pourrait copier et coller l'image s'il le souhaitait, mais il n'obtiendrait pas la bordure.","Les Crypto monnaies mettent parfois leur . ETH nom sur leur profil également. Il s'agit essentiellement d'un moyen de rassembler tous les portefeuilles et sites Web Crypto de cette personne sous un ONE LINK, au lieu de donner une liste d'URL et d'adresses de portefeuille. La majeure partie de la vie numérique d’un passionné de Crypto peut être rassemblée, pour ainsi dire, en un ONE endroit. Par exemple, Vitalik Buterin a donné son nom d'utilisateur Twitter à Vitalik. ETH.","Le fournisseur du système est en fait une application décentralisée (dapp) appelée Ethereum Naming Service (ENS) et les noms sont eux-mêmes des NFT négociables.","Comme pour tous les médias sociaux, l'astuce pour tirer le meilleur parti de la Crypto Twitter est de trouver la partie qui ajoute le plus à votre vie, d'éviter les parties qui n'en apportent T et d'essayer de ne pas y passer toute la journée.","Voir aussi : Crypto Discord : où aller, ce qu'il faut savoir"],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"Wikipédia Molly White","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Ari David Paul","content":"PERSON"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"Cathie Wood","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Naming Service","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Taylor Monahan","content":"PERSON"},{"type":"Antonopoulos","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Learn","Beginner","industry","French"],"authors":["Benedict George"]}