{"summary":"Tax experts weigh in on how the IRS views crypto trading profits, gifts, mining rewards and more.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/top-five-crypto-tax-questions-answered\/","publishDate":"2022-11-18T19:04:00","id":21471,"type":null,"title":"Top 5 Crypto Tax Questions, Answered","category":["Consensus Magazine"],"content":["Tax filing day may be months away, on April 18, 2023, to be exact. But, if you’ve bought, sold, traded, earned or lost cryptocurrency this year, now is the time to prepare.","This piece is part of CoinDesk's Tax Week.","CoinDesk spoke to tax experts to answer the most commonly asked questions about crypto and taxes in the U.S.","Cryptocurrencies including non-fungible tokens (NFTs), are treated as “property” for the purposes of tax in the United States, originally decided by the Internal Revenue Services (IRS) in 2014. This means that a majority of taxable actions involving digital assets will incur capital gains tax treatment, similar to how stocks are taxed.","In 2022, there are two main ways the federal agency keeps track.","The first is through self-reporting. The U.S. Individual Income Tax Return form, known as Form 1040 asks if at any time during the past year “did you receive, sell, exchange, or otherwise dispose of any financial interest in any virtual currency?” Each filer must answer with by checking a box for “Yes” or “No.”","“That is the first line of defense that the IRS uses,” said David Kemmerer, Co-Founder and CEO of CoinLedger. “Every taxpayer has to answer that under penalty of perjury.”","The anonymous nature of cryptocurrency makes it hard for the IRS to learn about a given taxpayer’s crypto transactions. To get around this, they’ve turned to the legal system.","And that’s the second way – a “John\/Jane Doe Summons.”","This summons compels crypto brokerages to share user data with the federal agency, so that data can be used to identify, audit and prosecute taxpayers avoiding paying their share of taxes on crypto gains.","“The IRS is getting better by requesting information from the broker dealer houses that transact on this type of activities,” says ​​Mark Steber, the chief tax information officer at Jackson Hewitt.","They’ve previously served such summons on companies like Kraken and Circle to confirm whether the firms’ customers are properly reporting their taxes.","Once the ball drops on 2022, crypto broker dealers will be mandated to report their customers’ transactions during 2023 and every subsequent year to the IRS, as a result of the U.S. Infrastructure Bill that was passed in November 2021.","Calculating how much cryptocurrency tax you owe in the U.S. is based on how long you’ve held the assets prior to disposing of them, as well as which income tax bracket you fall under.","Read More: Crypto Capital Gains and Tax Rates 2022","Yes.","“A lot of people’s portfolios are probably in the red now,” said Kemmerer. “So, you’d be prudent to lock in your capital losses on your assets.”","Capital losses can be used to offset any capital gains tax to reduce your overall tax bill.","Here’s an example:","Earlier in 2022, you made a purchase of bitcoin. You then sold it and landed a nice $10,000 gain. That profit is your capital gains and will be taxed. However, you saw that Elon Musk tweeted a picture of a Shiba Inu dog and dogecoin started pumping. You bought dogecoin at the top, right before it started dropping once again. You’ve got a $3,000 loss in the meme token.","Before the clock strikes midnight on Dec. 31, 2022, you sell your dogecoin at a loss and convert it to cash. You can now take that $3,000 loss to offset your $10,000 gain from the bitcoin purchase you’ve made when the markets were at a happier time.","Now, you only need to pay short-term capital gains tax on that $7,000.","You can offset up to $3,000 of crypto losses per year. If you’ve incurred more than that in a year, it can be carried over to future tax years.","Read More: How to Benefit From Tax-Loss Harvesting in Crypto","“Gifts in virtual currency work a lot like a stock gift, bond gifts or gifts of any capital asset,” said ​​Mark Steber, Jackson Hewitt chief tax information officer.","Crypto gifts are not taxable upon the initial transfer from the owner to the new gift recipient.","In the U.S., gifts up to $16,000 per single recipient and $32,000 per married couple are tax free in the 2022 year.","That limit will be raised to $17,000 in 2023. If you are gifted or planning to gift crypto over the limit, it’s best to talk with a tax professional to understand the tax implications.","The IRS is clear that taxes on mining earnings count as income tax, based on the fair market value of the crypto the day you received it.","Here’s an example:","You are running a bitcoin mining rig and you earned one bitcoin on June 12, 2022. The minute that bitcoin hits your wallet, the fair market value of BTC is at $25,000. You now have realized $25,000 of income that needs to be reported as such on your tax filings.","If you later sell, trade or spend any of that one bitcoin, you may have to also pay capital gains tax, if the price is higher than when you received it.","Read More: Do You Owe Taxes on Your NFT?"],"entity":[{"type":"2014","content":"DATE"},{"type":"$3,000","content":"MONEY"},{"type":"$16,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"John\/Jane Doe","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"The IRS","content":"ORGANIZATION"},{"type":"midnight","content":"TIME"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$17,000","content":"MONEY"},{"type":"$7,000","content":"MONEY"},{"type":"Kemmerer","content":"PERSON"},{"type":"David Kemmerer","content":"PERSON"},{"type":"$25,000","content":"MONEY"},{"type":"Internal Revenue Services (IRS","content":"ORGANIZATION"},{"type":"Elon Musk","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"June 12, 2022","content":"DATE"},{"type":"Mark Steber","content":"PERSON"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Crypto Capital Gains","content":"ORGANIZATION"},{"type":"Jackson Hewitt","content":"PERSON"},{"type":"$32,000","content":"MONEY"},{"type":"Dec. 31, 2022","content":"DATE"},{"type":"April 18, 2023","content":"DATE"},{"type":"U.S. Individual Income Tax Return","content":"ORGANIZATION"}],"hashtag":["Learn","Investing","Beginner","Tax Week 2022","Tax Week 2023"],"authors":["Doreen Wang"]}