{"summary":"Casual collectors may be in for a rude awakening this year. This piece is part of CoinDesk's Tax Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/02\/24\/nfts-are-the-latest-crypto-tax-events-nobody-understands\/","publishDate":"2022-02-24T14:11:59","id":21472,"type":null,"title":"NFTs Are the Latest Crypto Tax Events Nobody Understands","category":["Consensus Magazine (layer2)"],"content":["For over a year now, major tech companies and venture capital firms have been rallying behind non-fungible tokens (NFTs) as the next big thing in online commerce.","Coinbase CEO Brian Armstrong has said the company’s new NFT business could be “as big or bigger” than its flagship crypto trading platform. Chris Dixon, a partner at the VC powerhouse Andreessen Horowitz, has predicted that NFTs will “onboard hundreds of millions of new users into crypto” – emphasis on the new.","Forget crypto arbitrage and complicated decentralized finance (DeFi) protocols; much of that dry, explicitly financial stuff remains niche, even now. NFTs are plastered all over major cities; they make appearances on late night talk shows; they inspire bacchanalian conferences; they’ve infiltrated iconic businesses; they even made it to the Super Bowl.","This article is part of CoinDesk’s Tax Week","But for all the talk about NFTs, and for all the traders now sitting on a mountain of new tokens, there’s been relatively little discussion about how to stay compliant with relevant tax laws.","The lack of information around tax compliance is a problem unique to crypto. Traditional brokerages need to know a little about their customers so they can send out tax forms each year. Anyone who used Robinhood last year during the Gamestop short squeeze can attest: No gain is small enough to escape the IRS. I lost $40 on Gamestop stock last winter; Robinhood still sent me a 1099.","Read More: 5 Things to Remember When Paying Your NFT Taxes","Blockchain-based services like DeFi protocols and NFT marketplaces are mostly peer-to-peer, which means they don’t need to collect the same level of information. Part of the novelty of crypto is that it has traditionally rejected know-your-customer (KYC) and anti-money laundering (AML) requirements (some users tend to think of it as unnecessary financial surveillance), at least on the level of trades within crypto.","A digital wallet application like MetaMask or Rainbow can’t keep track of who’s using it, since it doesn’t actually know anything about its users beyond their public addresses.","It’s usually only when you cash out, from crypto to fiat currency, that you’re once again at the mercy of those pesky KYC-AML requirements. Contrary to popular opinion, crypto is actually terrible at laundering money. Mixing systems like Tornado Cash and Wasabi Wallet can help obfuscate the digital trail (and even they aren’t bulletproof), but at some point, you’re probably going to have to fork over some personal information. There are precious few truly anonymous fiat offramps in 2022. (Though if you want to give it a shot, there are still a few Austrian crypto ATMs that allow for non-KYC’d withdrawal directly into cash.)","So while Coinbase might send you a 1099, MetaMask and Rainbow will not. The same goes for decentralized applications and permissionless NFT marketplaces like Zora. OpenSea, though very much a centralized company, doesn’t ask for personal information, and so won’t send you a 1099.","Lucky for users – and for accountants in the burgeoning crypto tax industry – blockchains keep great records.","Shehan Chandrasekera, who heads up strategy at the crypto tax software company CoinTracker, explained that each NFT transaction involves multiple moving parts. Effectively, there may be three taxable events at the same time.","“Typically, you have the transaction – there's gas fees associated with that – and you're [converting] these NFTs to another type of cryptocurrency, mainly Ethereum: that also triggers a taxable event,” he said. “There could be royalties associated with that, and that triggers a taxable event.”","So you’re incurring at least a few taxable events with your average NFT transaction. After the purchase of the NFT, you’re paying taxes again on the sale of the NFT into liquid crypto, and again on the conversion of those gains back into fiat money.","Read More: The 7 Types of Crypto Tax Nightmares","There’s also the question of how to value illiquid gains in the form of NFTs you haven’t sold; unrealized gains aren’t taxed, but if you’re looking to donate an NFT, or pass it on after your death, you’ll need to get a handle on how much it’s worth (estate taxes still apply). Most NFTs in a given collection will sell around the “floor price,” or the lowest amount any token in a collection is currently listed for sale. But what about NFTs with especially rare traits? Who’s to say how much they’re worth, without a proper valuation?","“The hard part of NFTs is not really the taxable side of it, it’s the fair market value of what that NFT is worth,” said Dan Hannum, chief operating officer at CoinTracker competitor ZenLedger – that is, the reasonable price for an asset on the open market. “If you have NFT ‘ABC,’ and I give you a 100 ETH offer, and you don't accept it, does that mean it's now worth 100 ETH? You didn't accept it, so the hard part is tracking how much your NFT is currently worth.”","In the real estate world, official appraisers in the U.S. need a special designation – M.A.I., meaning “member of the Appraisal Institute” – before they can value a piece of property. A professional NFT appraiser might serve a similar function in crypto. (How else to divide up digital property, in the case of a divorce?)","Hannum added that “loot box”-style NFTs (NFTs that can be used to mint other NFTs, potentially with their own discrete values) add yet another tax wrinkle. And it’s reasonable to expect things will only continue to get more complicated over time, since developers are experimenting with new models for multi-stage NFT drops every day.","It’s daunting for traders, but also for accountants from the traditional tax world.","Tiffany Liu, a CPA who’s historically specialized in real estate taxes, has been handling all her boyfriend’s crypto taxes for the past couple of years. This year, she’s adding NFTs to her own tax treatment.","“It's kind of chaotic,” she said. “But essentially, [crypto taxes] are all based on existing frameworks. And very standard frameworks, like selling property. That's how I've been able to apply my experience.”","And though these things have a tendency to get very complicated very quickly, Liu maintained that she’s enjoying the chaos. She characterized it as a kind of group-learning experience.","“Prior to this, I'm like, ‘Oh, I have a boring job, I do tax compliance,’” she said. “To me, real estate was the most exciting industry. But now with this coming into play, it's a lot more people who maybe previously didn't have that many tax implications – all of a sudden, there's really significant tax implications, especially with the movement of ETH and all these crazy coins. I wish I could help everybody, because these are real consequences.”","The number of new recruits entering the NFT market has been a boon for crypto tax software companies (Chandrasekera said CoinTracker is already seeing an uptick in customers looking for help with NFT taxes, specifically), but there’s been relatively little tax-related messaging from NFT companies themselves.","Again, OpenSea and its competitors don’t have to help you out – but that’s not to say they’re not making an effort. CoinTracker recently announced a partnership with OpenSea, offering free tax reports for up to 50 transactions.","Read More: You May Owe Crypto Taxes on These Surprising Things in 2022","Chandrasekera says the responsible thing for these companies to do would be to distribute tax guidance the way platforms sometimes distribute free tokens to encourage adoption.","“They should airdrop a discounted tax plan to every wallet connected to these protocols,” he suggested. “That's the way for to [say], ‘hey, we know we created some taxable events for you, here's a tool for you to figure it out.’”","I asked Liu whether she thought – given all the activity around NFTs this past year, and the massive push to frame crypto collectibles as an on-ramp to a new decentralized internet, or Web 3 – the average newcomer might be prone to slip up on their taxes this year, shackled with tax obligations they didn’t know they had.","“I think there is some leeway,” she said, “some grace room for the fact that you tried your best. I feel like the IRS, and the government in general, is so crazy backed up – it's a mess. And at the end of the day, they're always going to go for the top players first.”","Which is to say, the IRS is going to be watching the whales, the traders with Bored Apes and Chromie Squiggles and millions of dollars on the line. Newcomers probably aren’t going to jail over a few miscalculated or misreported transactions.","Still, Liu acknowledged that it’s a confusing new world, even for tax professionals like her.","“We're all in this together,” she said.","Crypto won’t save you from taxes, but it may eventually make them easier to pay, says futurist Dan Jeffries.","Tax guidance lags innovation. So does tax software. Meanwhile, misconceptions abound. If not careful, investors can end up owing more tax than expected and having to unload crypto to pay the bill.","Investors in MicroStrategy, Tesla, Block and Coinbase need to consider how wild price swings will affect results, not only directly but indirectly due to complex tax accounting rules."],"entity":[{"type":"CoinTracker","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Dan Jeffries","content":"PERSON"},{"type":"Chandrasekera","content":"PERSON"},{"type":"Gamestop","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Rainbow","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"late night","content":"TIME"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Liu","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Tiffany Liu","content":"ORGANIZATION"},{"type":"$40","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"1099","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Shehan Chandrasekera","content":"PERSON"},{"type":"ABC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Appraisal Institute”","content":"ORGANIZATION"},{"type":"Chris Dixon","content":"PERSON"},{"type":"Chromie Squiggles","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"winter","content":"DATE"},{"type":"Dan Hannum","content":"PERSON"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"You May Owe Crypto Taxes","content":"ORGANIZATION"},{"type":"Remember When Paying Your NFT","content":"ORGANIZATION"},{"type":"Crypto Tax Nightmares","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Hannum","content":"PERSON"}],"hashtag":["tax week","NFTs"],"authors":["Will Gottsegen"]}