{"summary":"Si vous faites ONE des millions de personnes qui ont acheté des Crypto pour la première fois en 2021, vous pourriez être surpris lorsque vous ferez vos impôts.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/you-may-owe-crypto-taxes-on-these-surprising-things-in-2022\/","publishDate":"2022-02-17T18:13:45","id":21479,"type":null,"title":"Vous pourriez devoir payer des taxes Crypto sur ces choses surprenantes en 2022","category":["Learn"],"content":["La Crypto a peut-être commencé comme une économie décentralisée discrète, mais maintenant que le secteur de près de 2 000 milliards de dollars est devenu suffisamment courant pour occuper l'espace publicitaire convoité du Super Bowl , l'Internal Revenue Service (IRS) est bien au courant.","L’IRS classe les Cryptomonnaie comme biens incorporels à des fins fiscales, ce qui signifie que les bénéfices que vous réalisez en vendant de la monnaie virtuelle sont soumis à l’impôt sur les plus-values. Cela est vrai que vous ayez acheté du Bitcoin ou des altcoins sur un échange Crypto comme Coinbase, ou que vous ayez simplement utilisé une application comme Venmo ou PayPal pour acheter et utiliser de la Cryptomonnaie.","C'est au premier plan des préoccupations des fiscalistes cette année : TurboTax vous demande désormais dès le début de votre déclaration de revenus 2021 si vous avez ou non échangé des Crypto l'année dernière. Et si vous faites vos impôts sur papier avec l’aide d’un expert-comptable agréé (CPA), vous devriez au moins être prêt à leur communiquer vos revenus Crypto pour 2021. (C'est plus facile lorsque vous branchez votre portefeuille sur une application de suivi de portefeuille Crypto qui peut calculer vos gains et pertes en capital en quelques minutes.)","Cet article fait partie de la Tax Week de CoinDesk .","Mais qu’est-ce que l’IRS considère exactement comme des « gains » en matière de Crypto – et qu’est-ce qui déclenche un événement imposable ? Jetons un coup d'œil à la façon dont l'IRS classe les scénarios suivants.","Avez-vous reçu un NFT , acheté des biens de tous les jours avec de la Crypto ou gagné suffisamment de Crypto pour vous pousser dans une nouvelle tranche d'imposition ? Voici quelques taxes Crypto « surprises » courantes et comment les experts vous suggèrent de rester préparé.","La Crypto était un cadeau populaire l’année dernière. Selon une enquête BlockFi , une personne sur 10 a offert une Crypto comme cadeau de vacances.","Aussi excitante que puisse être la Crypto , si vous l’avez offerte en cadeau, vous devez connaître les règles de l’IRS en matière de cadeaux. Il existe un seuil de don de 15 000 $ pour 2021, ce qui signifie que le donateur n'a T à payer d'impôts sur le cadeau tant qu'il vaut 14 999 $ ou moins. Si la valeur du don dépasse 15 000 $, la charge fiscale incombe au généreux donateur, qui doit remplir le formulaire IRS 709 .","\"Si mes parents me donnent 10 000 $ en Bitcoin , ce n'est pas un revenu imposable pour moi\", a déclaré David Kemmerer , PDG et co-fondateur de CoinLedger, un logiciel de déclaration fiscale Crypto .","Mais il y a quelques nuances. Si vous recevez une Crypto et qu'elle prend de la valeur et que vous réalisez un gain en capital lorsque vous la vendez (soit en dollars américains, soit en une autre Cryptomonnaie), vous devrez payer des impôts sur les plus-values ​​sur le montant dont vous avez profité – et non sur la totalité du montant. vous l'avez vendu pour.","Les impôts sur les plus-values ​​sont également calculés en fonction de vos revenus et de la durée pendant laquelle vous avez détenu l'actif avant de le vendre. (En Guides plus sur la façon dont l'IRS calcule les impôts sur les plus-values .)","N'importe qui sur les réseaux sociaux a probablement déjà entendu parler des jetons non fongibles (NFT) , mais peu savent comment ils sont taxés.","Sur le même sujet : 5 choses à retenir lors du paiement de vos taxes NFT","L'IRS n'a pas encore publié de directives définitives sur les NFT, mais il convient de noter que les autorités fiscales britanniques ont récemment effectué la première saisie de NFT dans le pays lors d'une enquête pour fraude et d'une répression fiscale. Bien sûr, les citoyens américains ne peuvent T se tourner vers d’autres pays pour obtenir des conseils fiscaux précis, mais il devient chaque jour plus clair que les consommateurs ne devraient T essayer de balayer les achats et les échanges NFT sous le tapis.","Jusqu'à ce que l'IRS publie des directives plus nuancées, les fiscalistes conseillent de traiter les NFT comme des actifs virtuels, au même titre que n'importe quelle autre Crypto. Il y a trois choses à surveiller ici :","Une dernière possibilité est que l'IRS pourrait classer les NFT comme objets de collection – au même titre que les timbres, les antiquités ou les cartes à collectionner. S'ils le faisaient, les impôts sur les plus-values ​​seraient légèrement plus élevés que la normale, à un taux de 28 %. Pour l’instant, la plupart des CPA suggèrent de s’en tenir aux lois normales sur les gains en capital, même si cela pourrait toujours changer.","Un nombre croissant de personnes dans le monde gagnent un revenu supplémentaire grâce à des jeux vidéo pour gagner qui récompensent les joueurs avec des jetons de Finance décentralisée ( DeFi ) qui peuvent détenir une valeur réelle et peuvent être échangés contre des devises Crypto ou fiduciaires (gouvernementales).","Sur le même sujet : Évitez les problèmes fiscaux Crypto : ce que vous devez savoir si vous avez acheté ou vendu de la Crypto en 2021","Bien que cette nouvelle source d’argent ait profité à beaucoup, les Crypto gagnées dans ces jeux en ligne ne sont pas exonérées d’impôts.","\"Les jetons de récompense entreront dans une catégorie imposable similaire à celle des récompenses de mise\", a déclaré Kate Waltman , CPA qui se concentre sur la Cryptomonnaie et les actifs numériques. Le « Staking » est un processus DeFi avancé qui permet aux traders de gagner un revenu passif sur leur Crypto en échange de laisser la blockchain la verrouiller pendant un certain temps (généralement des mois). Tous les joueurs ne connaissent T nécessairement bien DeFi, il est donc important qu'ils sachent comment l'IRS imposera leurs revenus Crypto .","\"Ces récompenses seront imposables, contrairement aux jeux vidéo traditionnels dans lesquels vous pouvez gagner des récompenses dans le jeu, mais elles ne sont utilisables que dans le jeu\", a déclaré Waltman. \"Le problème ici n'est T tant de savoir que c'est imposable, mais plutôt de savoir comment nous valorisons ces jetons ?\"","Selon Waltman, l'IRS n'a T encore proposé de réglementation concrète concernant ces détails. \"Je pense que beaucoup de gens jouent à des jeux vidéo et gagnent des jetons de récompense Crypto et ne réalisent peut-être pas qu'ils ont réellement de la valeur\", a-t-elle déclaré.","Beaucoup de gens ont gagné de l’argent grâce à la Crypto l’année dernière, selon Waltman. Certains ont donc dépassé pour la première fois le seuil de revenu brut ajusté (AGI) de 200 000 $ – et pourraient avoir des impôts plus élevés que la normale.","Dans ce cas, les nouveaux salariés à revenu élevé devront payer l'impôt sur le revenu net de placement (NIIT), un impôt de 3,8 % qui s'ajoute à vos gains en capital, à vos dividendes et à vos revenus de redevances.","\"Si vous êtes un particulier et que votre revenu brut ajusté modifié dépasse 200 000 $, vous déclenchez alors cet impôt sur le revenu net de placement en plus de votre impôt normal sur les plus-values ​​que vous payez déjà\", a déclaré Waltman.","Le seuil de revenu grimpe jusqu'à 250 000 $ pour les personnes mariées déclarant conjointement, et jusqu'à 125 000 $ pour celles mariées déclarant séparément.","Guides en plus sur le NIIT sur le site Web de l'IRS .","L’achat de biens et de services avec des Crypto – même de petits achats comme l’achat d’un café – pourrait déclencher un événement imposable aux yeux de l’IRS.","Voici pourquoi : payer pour des objets du quotidien implique d'échanger une monnaie numérique (par exemple, Bitcoin, Ethereum, Dogecoin, ETC) contre une monnaie fiduciaire (par exemple, le dollar américain). Les cartes de débit Crypto prépayées et les cartes de crédit Crypto rendent ce processus si transparent qu'il peut ne pas sembler utile d'en informer l'IRS. Cependant, de petites transactions tout au long de l’année peuvent représenter une somme importante. Ceux qui achètent des biens et services quotidiens avec des Crypto doivent donc KEEP de bons registres.","Cela nous amène à notre point suivant…","\"C'est donc vraiment intéressant\", a déclaré Waltman. \"D'un point de vue fiscal, c'est assez complexe.\"","Les cartes de débit et de crédit Crypto populaires comme la Gemini Mastercard et la carte de récompenses Bitcoin BlockFi ont facilité l'achat d'articles dans le magasin en utilisant la Crypto. De plus, les utilisateurs peuvent gagner des récompenses Crypto , telles qu'une remise de 3 % en Bitcoin sur leurs dépenses.","Ces cartes peuvent soit simplifier les rapports Crypto IRS, soit, dans d'autres cas, les ouvrir à des Événements encore plus imposables avec leur Crypto.","Sur le même sujet : Les 7 types de cauchemars fiscaux Crypto","Les récompenses ne sont généralement T imposables, a noté Waltman, et sont traitées de la même manière que les points de carte de crédit et les miles aériens que vous gagnez après avoir rempli certaines conditions de dépenses. Les consommateurs qui utilisent des cartes de débit leur permettant de dépenser en dollars américains mais de gagner en Crypto n'ont T à déclarer leurs récompenses jusqu'à ce qu'ils les échangent contre du fiat ou une autre Cryptomonnaie via un achat ou un échange.","\"C'est une façon vraiment intéressante de commencer à accumuler et à acquérir des Crypto sans que cela devienne immédiatement un revenu imposable pour vous\", a déclaré Waltman.","Cependant, si votre carte de récompenses Crypto est une carte prépayée et que vous payez réellement avec un solde de Crypto à chaque fois que vous glissez votre carte, un échange se produit en coulisses qui nécessite un rapport IRS.","\"Bitpay, par exemple, vous permet de payer avec votre Crypto\", a déclaré Waltman. «Lorsque vous glissez la carte, elle effectue très rapidement et simultanément une conversion Pour vous de Bitcoin en Fiat. Cet échange générera des gains en capital.","Sur le même sujet : Un guide complet des taxes américaines sur la Crypto 2022","CORRECTION (17 février, 17 h 05 UTC) : L'article indiquait à l'origine que le destinataire d'un cadeau de plus de 15 000 $ pourrait devoir le déclarer comme revenu, mais il a été corrigé pour indiquer que le seul donateur d'un cadeau est responsable des dépenses associées. déclaration fiscale.","La Crypto ne vous fera T économiser d'impôts, mais elle pourrait éventuellement les rendre plus faciles à payer, explique le futuriste Dan Jeffries.","Les orientations fiscales sont à la traîne de l’innovation. Il en va de même pour les logiciels fiscaux. Pendant ce temps, les idées fausses abondent. S’ils ne font pas attention, les investisseurs peuvent finir par devoir payer plus d’impôts que prévu et devoir décharger des Crypto pour payer la facture.","Les investisseurs dans MicroStrategy, Tesla, Block et Coinbase doivent réfléchir à la manière dont les fortes fluctuations des prix affecteront les résultats, non seulement directement mais indirectement en raison de règles comptables fiscales complexes."],"entity":[{"type":"28 %","content":"PERCENT"},{"type":"Dan Jeffries","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Crypto comme Coinbase","content":"ORGANIZATION"},{"type":"3,8 %","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Selon Waltman","content":"PERSON"},{"type":"000 milliards de dollars","content":"MONEY"},{"type":"David Kemmerer","content":"PERSON"},{"type":"l'Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"$ –","content":"MONEY"},{"type":"Kate Waltman","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"3 %","content":"PERCENT"},{"type":"Crypto ou gagné suffisamment de Crypto","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$ pourrait","content":"MONEY"},{"type":"IRS","content":"ORGANIZATION"},{"type":"NIIT","content":"ORGANIZATION"},{"type":"$ ou","content":"MONEY"},{"type":"$ pour","content":"MONEY"},{"type":"Crypto populaires comme la Gemini Mastercard","content":"ORGANIZATION"},{"type":"Waltman","content":"PERSON"},{"type":"Tax Week de CoinDesk","content":"ORGANIZATION"},{"type":"$ en","content":"MONEY"},{"type":"Crypto IRS","content":"ORGANIZATION"},{"type":"quelle","content":"ORGANIZATION"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["industry","Beginner","Learn","tax week","French"],"authors":["Megan DeMatteo"]}