{"summary":"E-mails divulgados recentemente pelo ex-diretor da SEC, William Hinman, reuniram as tropas XRP , mas os documentos não são uma arma fumegante.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/why-william-hinmans-emails-matter-to-the-xrp-army-and-the-cryptos-price\/","publishDate":"2023-06-14T16:49:33","id":21478,"type":null,"title":"Por que os e-mails de William Hinman são importantes para o exército XRP e para o preço da criptografia","category":["Learn"],"content":["Em 13 de junho de 2023, documentos vinculados a William Hinman, o ex-diretor da Divisão de Finanças Corporativas da Comissão de Valores Mobiliários dos EUA (SEC) de 2017 a 2020, foram divulgados ao público em conexão com o processo da SEC contra Ripple , enviando brevemente o preço do token XRP para cima em 7,4%, à medida que se espalhava o Optimism de que Ripple WIN seu caso em andamento.","Aqui está o porquê:","De forma muito ampla, Ripple e seus partidários argumentaram que os e-mails de Hinman poderiam revelar um processo tendencioso ou falho por trás da decisão de sugerir publicamente em um discurso de Hinman em 2018 que Ethereum ( ETH ) pode não ser um valor mobiliário. Uma arma fumegante pode ter sido algum tipo de demonstração de preconceito contra Ripple e XRP , mas os e-mails divulgados não mencionam nenhum deles diretamente.","O diretor jurídico da Ripple, Stuart Alderoty, argumentou após a divulgação que os e-mails mostravam Hinman ignorando avisos de colegas de que seu discurso não era fundamentado na lei e criavam confusão sobre as designações de títulos. No mínimo, Alderoy parece sugerir que a Ripple foi tratada injustamente pelos reguladores.","No entanto, a análise inicial dos e-mails não parece ter encontrado uma grande WIN para o Ripple Labs. Após uma breve Rally na manhã da divulgação dos e-mails, o XRP refez seu preço e caiu ainda mais, o que pode refletir alguma decepção nesta frente.","Antes da divulgação dos documentos, os apoiadores do Ripple e do XRP se concentraram nas declarações de Hinman sugerindo que um token T é um título se for “suficientemente descentralizado”. Essa métrica parece ter sido usada para justificar uma exclusão pública do Ethereum, mas, pelo menos de acordo com o feedback dado a Hinman por outros funcionários e funcionários da SEC, não foi baseada na regulamentação de valores mobiliários existente. Ripple argumentou que o XRP, assim como o Ethereum, é “suficientemente descentralizado” e não deveria ser classificado como um título de acordo com os padrões estabelecidos por Hinman.","Os críticos argumentam há muito tempo, no entanto, que a afirmação subjacente de que Ethereum e XRP são comparativamente descentralizados é em si altamente discutível. Mais significativamente, já se passou quase uma década de debate e litígio sobre se a própria Ripple deveria ser considerada a criadora do livro-razão XRP e emissora do token XRP – e, portanto, a emissora e vendedora de um título não registrado.","Os aliados do Ripple Labs geralmente caracterizam a empresa como separada do XRP. Em particular, eles argumentaram que o blockchain XRP foi criado por Jed McCaleb e Chris Larsen, trabalhando como OpenCoin , antes mesmo de existir uma entidade chamada “Ripple”. Mas o OpenCoin se tornou o Ripple Labs e o que hoje é simplesmente chamado de Ripple , e esses cofundadores “doaram” 80 bilhões de XRP , 80% do fornecimento total, para o Ripple Labs. Ao longo dos anos, a Ripple fez uma série de mudanças de marca e mensagens para demonstrar que não é a criadora do XRP. Isso inclui mudar a forma preferida de discutir o token em si, que por muitos anos foi comumente referido como “Ripple”.","Leia Mais: O que é Ripple e a Criptomoeda XRP ?","Para críticos como Preston Byrne , isto LOOKS um engano orquestrado e um dos primeiros exemplos de “teatro da descentralização”. E se o XRP foi efetivamente criado ou emitido pela Ripple, o paralelo com o Ethereum se desfaz rapidamente, uma vez que o Ethereum não tem nenhuma controladora corporativa com fins lucrativos. Esta poderia ser uma explicação mais convincente para o tratamento regulatório diferente das duas cadeias do que preconceitos ou falhas processuais.","Em qualquer caso, independentemente da forma como o caso se desenvolve e é finalmente decidido, sempre que são divulgadas novas informações que os apoiantes acreditam que reforçam ou prejudicam o lado da Ripple no caso, o preço do XRP geralmente se move em paralelo com o sentimento positivo ou negativo.","Veja também: Ripple não se importa se o XRP é “suficientemente descentralizado”","Editado por Toby Leah Bochan."],"entity":[{"type":"7,4%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"Toby Leah Bochan","content":"PERSON"},{"type":"William Hinman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Chris Larsen","content":"PERSON"},{"type":"EUA","content":"ORGANIZATION"},{"type":"Preston Byrne","content":"PERSON"},{"type":"Hinman","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Jed McCaleb","content":"PERSON"},{"type":"Stuart Alderoty","content":"PERSON"},{"type":"da Divisão de Finanças Corporativas da Comissão de Valores Mobiliários","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Rally na","content":"ORGANIZATION"}],"hashtag":["Ripple","XRP","industry","Beginner","Learn","SEC","Ethereum","portuguese"],"authors":["David Z. Morris"]}