{"summary":"The latest price moves in crypto markets in context for May 20, 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/20\/first-mover-americas-btc-eth-little-changed-ahead-of-ether-etf-decision\/","publishDate":"2024-05-20T12:09:33","id":21482,"type":null,"title":"First Mover Americas: BTC, ETH Little Changed Ahead of Ether ETF Decision","category":["Markets"],"content":["This article originally appeared in First Mover, CoinDesk’s daily newsletter, putting the latest moves in crypto markets in context. Subscribe to get it in your inbox every day.","Bitcoin (BTC) and ether (ETH) were little changed, suggesting a consolidation after last week's rally. BTC traded at around $67,000 while ETH held steady about $3,100. The wider digital asset market as measured by the CoinDesk 20 Index (CD20) has added 0.3% in the last 24 hours. This week, attention will turn to the SEC's decision on the approval of ether exchange-traded funds (ETFs), with the deadline for a response to VanEck's and Ark\/21 Shares' applications due on May 23 and May 24, respectively. Traders may be keeping their powder dry until then.","Traders are also going to be eyeing Nvidia's earnings, scheduled for Wednesday. Bitcoin trades strongly in correlation with Nvidia, as do artificial intelligence-themed tokens, which surged in February as the chip designer reported better-than-expected earnings. NVDA has risen over 90% year-to-date, with analysts expecting the company to report a big increase in revenue for the quarter ending in April. The direct correlation between Nvidia and ether market movement isn't as strong as it once was during the mining boom. Still, the rising tide of bitcoin and AI tokens – should Nvidia's earnings remain strong – will likely lift all boats.","Genesis will return 77% of customer assets, worth $3 billion in cash and crypto, to its creditors. Parent company DCG will not be among them. The lender's holding company filed for bankruptcy in January 2023 following the fallout from events in the crypto market the year before. In the immediate aftermath of the filing, the market was skeptical that customers would be made whole and the bankruptcy proceedings would be completed in an expedient manner. Bankruptcy claims marketplace Xclaim initially listed Genesis claims at 35% of their value in January 2023. As of today, Genesis claims for bitcoin or ether are trading at 97%-110% for claims over $10 million, while claims under $1 million are trading at 74%-94%.","- Omkar Godbole"],"entity":[{"type":"May 24","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"First Mover","content":"ORGANIZATION"},{"type":"$3,100","content":"MONEY"},{"type":"DCG","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Omkar Godbole","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"0.3%","content":"PERCENT"},{"type":"94%","content":"PERCENT"},{"type":"$67,000","content":"MONEY"},{"type":"74%","content":"PERCENT"},{"type":"110%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"May 23","content":"DATE"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"77%","content":"PERCENT"},{"type":"$1 million","content":"MONEY"},{"type":"last week","content":"DATE"}],"hashtag":["Bitcoin","Ether","First Mover"],"authors":["Jamie Crawley","Omkar Godbole"]}