{"summary":"Since November, MoonPay has been helping celebrities purchase items from some of the most popular — and expensive — NFT collections.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128517\/moonpay-boss-on-how-the-startup-is-guiding-celebs-into-nfts","publishDate":"2021-12-24T12:57:25","id":2148,"type":null,"title":"&#x27;A really happy accident&#x27;: MoonPay boss sheds light on how the startup is shepherding big-ticket NFT purchases","category":["NFTS"],"content":["Jimmy Fallon, Post Malone, Diplo, DJ Khaled.","Those are just a few of <a href=\"https:\/\/www.theblockcrypto.com\/post\/126088\/nft-moonpay\" data-v-f87c67ca=\"\">the growing number of celebrities<\/a> — most of them musicians — who have leaned on crypto startup MoonPay to broker purchases of extravagantly expensive non-fungible tokens (NFTs). &nbsp;&nbsp;","The newest member of the crew is the NFT-curious rapper Snoop Dogg, who <a href=\"https:\/\/twitter.com\/SnoopDogg\/status\/1473367017172393987\" data-v-f87c67ca=\"\">took to Twitter<\/a> to flaunt four new pieces from the Bored Ape Yacht Club (BAYC) collection on December 22. In a separate tweet, he thanked MoonPay and CEO Ivan Soto-Wright for helping with the purchase. Bored Apes represent a high proportion of the NFT purchases that MoonPay has brokered on behalf of celebrities.","The vehicle steering these deals is MoonPay’s so-called ‘concierge service,’ which <a href=\"https:\/\/www.theblockcrypto.com\/post\/125483\/moonpay-concierge-celebrities-nft\" data-v-f87c67ca=\"\">it unveiled<\/a> in November. A spokesperson for the $3.4 billion startup described the concierge at the time as a white-glove service designed to help the super-rich and celebrities buy NFTs “without all the hassle of setting up a wallet, buying crypto, using that crypto to purchase an NFT and then taking custody of it.”","But in the hype-fuelled world of NFTs, where \"adoption\" is everything, observers have had mixed opinions about MoonPay’s efforts.","On Twitter, questions have been floated about whether such a hands-off style of investment should be celebrated. Many NFT devotees have also speculated about MoonPay’s commercial relationship with ape-hungry celebrities — especially after the startup's appearances in a Post Malone music video and on Jimmy Fallon's <em data-v-f87c67ca=\"\">The Tonight Show<\/em>.","Initial details of exactly how the concierge service works were scant, and although questions remain about the mechanics, CEO Ivan Soto-Wright has now offered more information in the form of a written Q&amp;A with The Block.","Here are his answers.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>How are celebrities and high-net-worth individuals finding their way to MoonPay's concierge service to buy NFTs? Are they being approached by MoonPay sales staff? And if so, what are they being offered?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> Over the past several months, I’ve been talking to artists, entertainers, athletes and creatives who are all excited about the promise of NFTs to transform the way digital rights, intellectual property and fan relationships are managed. But that excitement was met with just as much confusion about how it all worked because gaining access to this world of NFTs is still so cumbersome.","So I helped one artist figure it out. They told another who then asked for help. Word started to spread. And before you know it, I was spending a decent chunk of my time walking these folks through how to do everything, which has definitely been fun, but not scalable.","MoonPay is dedicated to bringing the next billion people into the crypto economy. So we created MoonPay Concierge as a way to scale up the help many of these artists and creatives were looking for. It was kind of an accident. A really happy accident I’d say. 100% organic.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>Can you reiterate that there is no commercial relationship between concierge clients and MoonPay? In other words, can you confirm clients are not paid in any way — whether that be in cash, crypto, or NFTs — to use the service in order to promote MoonPay?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> Everyone that uses MoonPay Concierge has a commercial relationship with the company in the sense that this is a commercial service we offer our clients. We provide the support and then we invoice for services rendered.","Building artists and creator excitement and support for crypto and NFTs through MoonPay Concierge has opened the door to other really cool collaborations.","For example, after we helped Post Malone acquire his first Bored Ape NFT, we were offered the opportunity of sponsoring his upcoming music video with The Weeknd and creating a really cool cultural conversation in that way, which we were really excited to do.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>What fees are charged to concierge clients?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> We’re focused on delivering value to our clients. And I think our growing list of MoonPay concierge clients agrees. But I think the best way to find out how the service works is to use it, which we invite folks to do.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>What is the relationship between MoonPay and NFT42? We note that the latter entity has transferred a lot of ‘free’ apes to MoonPay’s wallet recently?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> All our NFTs are purchased through OpenSea or private OTC transactions in our network.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>What is the minimum purchase of crypto or NFTs that the concierge will facilitate?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> We think there’s a tremendous amount of value to the community in having creators educated and excited about NFTs and crypto. So we’re happy to work with them to start this journey and do not currently have minimums in place.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>What is the scope of assets that may be purchased through the concierge?","<strong data-v-f87c67ca=\"\">Soto-Wright:<\/strong> The whole range of digital assets currently provided on MoonPay — from ETH to NFTs, bitcoin, and beyond.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"December 22","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Snoop Dogg","content":"PERSON"},{"type":"Ivan Soto","content":"PERSON"},{"type":"MoonPay Concierge","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Malone","content":"PERSON"},{"type":"Jimmy Fallon","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Diplo","content":"LOCATION"},{"type":"$3.4 billion","content":"MONEY"},{"type":"Wright","content":"PERSON"},{"type":"MoonPay","content":"ORGANIZATION"},{"type":"Post Malone","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}