{"summary":"The startup's plan to launch a custody operation followed by SEC-compliant crypto trading missed its first-quarter target, but the firm says it's just finishing up some technical work.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/09\/prometheums-contentious-answer-to-crypto-compliance-is-running-late\/","publishDate":"2024-05-09T16:27:44","id":21480,"type":null,"title":"Prometheum's Contentious Answer to Crypto Compliance Is Running Late","category":["Policy"],"content":["Much of the crypto sector has been apprehensive about the ribbon cutting on Prometheum's custody and trading operations, which the firm said will fully comply with U.S. Securities and Exchange Commission (SEC) demands. The doors have so far stayed shut well past the target date, but the company explained it's still finishing a process for auditing smart contracts.","\"We expect completion soon and will move towards the launch of our custodial services for institutional clients imminently thereafter,\" said Prometheum Inc.'s co-CEO Benjamin Kaplan, in a statement to CoinDesk.","Prometheum is a crypto-native startup that's the first to get a special-purpose broker dealer approval under SEC regulations and is now licensed to hold, trade and clear transactions in crypto securities. Its executives had originally said they'd have a custody operation rolling in the first quarter of this year – a date now more than five weeks past. But Kaplan said the firm is \"excited to be nearing the public launch of its custodial services for institutional clients.\"","\"Building proprietary technology subject to federal securities laws requires us to meet the high standards set by our regulators and expected by our clients,\" he said. \"We have been finalizing a rigorous smart contract auditing process conducted by a leading auditing firm.\"","A spokesman, who declined to name the auditing firm, said Prometheum's wallet system uses smart-contract technology. He said ironing that out represents the only significant holdup before opening.","Every week that Prometheum delays is another week that existing businesses wait to find out whether a crypto custodian and broker dealer can hold and trade tokens by treating them – including the marquee asset of Ethereum's ether (ETH) – as securities. So far, the SEC hasn't blocked the company's progress through its chain of registrations, and SEC Chair Gary Gensler has even referred to its efforts as a sign of progress.","Prometheum said it intends to provide custody for ether, the second-largest token by market share, and when asked what other tokens the company may handle, the spokesman said the firm doesn't yet have any further asset names to announce.","The wider crypto industry has been embroiled with the SEC in legal battles raging across several federal courts, in which digital assets exchanges and other companies are insisting that the regulator is wrong about its position that most tokens are securities. Prometheum, the first firm to get the special broker-dealer license, represents the contrarian view that Gensler and his agency are right, and many industry insiders and their allies among Republican lawmakers have chastised the company's executives and accused Prometheum of being an SEC pet project.","If Prometheum is correct, it could become a live demonstration of Gensler's view on cryptocurrencies as securities, which he argues belong under the jurisdiction of existing U.S. securities law and SEC oversight. Issuers of securities must be registered with the agency and submit to an array of disclosures and examinations, and the securities themselves must also be registered – requirements that many industry proponents say crypto companies and decentralized organizations would find impossible to meet.","Prometheum's leaders say they intend it to be a one-stop shop where investors – institutional and retail – will one day be able to keep their digital tokens, trade them on its alternative trading system (ATS) and deal in the future of tokenized assets.","It's not yet clear who the company's first customers will be.","\"We cannot say anything regarding specific clients now, but as always Prometheum Capital expects to be used by all ranges of institutions who require compliant access to digital asset securities including institutional investors and traders, asset management firms, family offices, hedge funds, registered investment advisors (RIAs), banks, and financial institutions,\" according to the spokesman.","The company had said its trading operation – the more high-profile test of its business model – was supposed to get started as soon as this second quarter of 2024, though it's unclear whether the custody delay will push off that timeline, too.","Brothers Benjamin and Aaron Kaplan have shared leadership of the company. Co-CEO Aaron Kaplan is set to appear at the Consensus 2024 event later this month.","Edited by Nikhilesh De."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Brothers Benjamin","content":"ORGANIZATION"},{"type":"Prometheum Capital","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Prometheum","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Benjamin Kaplan","content":"PERSON"},{"type":"Prometheum","content":"PERSON"},{"type":"second quarter of 2024","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Prometheum Inc.","content":"ORGANIZATION"},{"type":"the first quarter of this year","content":"DATE"}],"hashtag":["Regulations","Prometheum","Compliance","Custody Services","Securities and Exchange Commission","Gary Gensler"],"authors":["Jesse Hamilton"]}