{"summary":"In addition to paying monetary penalties, FalconX must stop providing U.S.-based customers access to crypto derivatives trading platforms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/13\/falconx-settles-with-cftc-for-18m-over-failure-to-register-as-futures-commission-merchant\/","publishDate":"2024-05-13T19:31:34","id":21486,"type":null,"title":"FalconX Settles With CFTC for $1.8M Over Failure to Register as Futures Commission Merchant","category":["Policy"],"content":["FalconX will pay $1.8 million to settle newly-announced charges from the Commodity Futures Trading Commission (CFTC) that the crypto trading firm violated commodities laws by failing to register as a futures commission merchant (FCM), according to a Monday announcement from the regulator.","Through its “Edge” product, FalconX acted as a crypto prime broker, offering institutional clients – including some based in the U.S. – with access to various crypto exchanges to trade derivatives, including futures and swaps, the CFTC said in a press release Monday.","Though FalconX describes itself as the “largest digital asset prime brokerage” it was not properly registered with the CFTC. One of FalconX’s portfolio companies, FalconX Bravo, has been registered with the CFTC as a swap dealer since last August, according to the Monday settlement agreement.","The way in which FalconX conducted business for its institutional clients meant that accurate know-your-customer (KYC) information was often not provided to the crypto exchanges FalconX was trading with.","However, after the CFTC filed suit against Binance its former CEO, Changpeng “CZ” Zhao for similar offenses in March 2023, FalconX voluntarily “changed and enhanced its approach to collecting customer-identifying information” – including requiring customers to identify the location of the assets’ ultimate beneficial owners, the location of their corporate headquarters, and the location of employees controlling the investor’s Edge account.","After these new, stricter KYC requirements were put in place, FalconX told the CFTC that Edge lost half of its customers.","In its settlement agreement, the CFTC said that FalconX’s remediation efforts – as well as its “substantial cooperation” with the investigation – resulted in a lower penalty than could have otherwise been imposed.","FalconX must pay $1,179,008 in disgorgement and a $589,504 civil penalty, and must cease and desist from acting as an unregistered FCM.","FalconX did not respond to CoinDesk’s request for comment by press time.","Edited by Nikhilesh De."],"entity":[{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"last August","content":"DATE"},{"type":"$1,179,008","content":"MONEY"},{"type":"FalconX Bravo","content":"PERSON"},{"type":"$1.8 million","content":"MONEY"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"$589,504","content":"MONEY"},{"type":"Nikhilesh De","content":"ORGANIZATION"}],"hashtag":["Regulations","CFTC","FalconX"],"authors":["Cheyenne Ligon"]}