{"summary":"Financial insitutions have been slow to get into digital asset markets. But, as regulatory clarity improves, that’s about to change, says Erik Anderson, Global X’s Senior Digital Assets Research Analyst.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/07\/why-institutional-allocation-to-crypto-is-on-the-rise\/","publishDate":"2023-11-07T15:28:21","id":21491,"type":null,"title":"Why Institutional Allocation to Crypto Is on the Rise","category":["Consensus Magazine"],"content":["Over the past decade, crypto’s potential as a viable investment asset has greatly expanded. The bleeding-edge innovations combined with the eye-watering performance numbers delivered by leading assets have made the prospect of institutional-caliber investment in the space seem like an inevitability. About 15 years into the crypto experiment, however, institutional participation in crypto remains limited. Instead, many institutions are in a \"wait and see\" mode, conducting thorough due diligence before taking the plunge into this new investment landscape.","Among the many reasons for delayed allocations, institutions may be deterred by the opacity of the regulatory landscape, insufficiently mature market infrastructure, inadequate investment vehicles, and a lack of suitably long track records for these assets. Fortunately, a wide range of positive developments are emerging which address these concerns, from a shifting regulatory landscape to maturing infrastructure and growing demand. As such, we may be approaching an inflection point when it comes to institutional crypto allocation over the longer term.","This post is part of Consensus Magazine's Trading Week 2023, presented by CME.","A major reason that the tides are turning is because incremental gains are being made on the regulatory front. For example, bitcoin has been deemed sufficiently decentralized to be considered a commodity rather than a security. This distinction contributes to a clearer regulatory framework for the most prominent crypto-asset and sets a precedent for similarly decentralized digital assets.","Furthermore, recent wins in the courts are establishing powerful precedents that are working to establish rules of the road for the crypto industry. Perhaps most notable among these was the decision handed down by U.S. District Judge Analisa Torres this summer in U.S. vs. Ripple Labs. In her opinion, Judge Torres stated that programmatic sales of XRP tokens to retail investors on public exchange platforms did not meet the criteria of an unregistered offering of securities, providing a framework for how we might think about the treatment of token sales.  While challenges and uncertainties persist, these recent developments among many others suggest a positive-trending regulatory environment in the U.S.","Read more: Sol, Memes, BTC: Digital Assets That Currently Outperform the Market","Market infrastructure is also maturing, with the two largest crypto-assets, bitcoin and ether, now having regulated futures products trading on the Chicago Mercantile Exchange (CME). The likelihood of a spot ETF tracking the spot price of bitcoin garnering approval in the U.S. is increasing, potentially opening doors to a wider range of investors by making crypto more accessible through traditional brokerage accounts, 401(k)s, and IRAs. Institutional OTC marketplaces, exchanges, clearinghouses, and custodians backed by traditional financial institutions are coming to market as well. These developments add a layer of credibility and reliability to the crypto ecosystem. In short, these and many other developments are providing institutions with the tools they will need to allocate capital and manage risk effectively.","Finally, we have continued to see resilient global demand for crypto over the course of numerous market cycles. Crypto has weathered prolonged bear markets during which the calls for the “death of crypto” have been deafening. Despite a leverage-driven drawdown that has lasted well over a year, the global crypto market capitalization has again rebounded, currently sitting over $1.3 trillion — nearly twice the value of the crypto market at the peak of the 2017 bull market.","Given the diversity of assets and use cases enabled by crypto, it is unsurprising that more and more investors are beginning to recognize the benefits of an allocation to crypto. Whether they are attracted by the asset class’ relatively low correlations with traditional asset classes, to its idiosyncratic drivers of risk and return, a growing pool of evidence suggests that crypto can act as a powerful portfolio diversification tool. In fact, given the diversity of asset types within the asset class itself, we see that correlations can be relatively low even among crypto-assets.","While institutional allocations to crypto have faced myriad roadblocks through the years, the foundation being laid today signals a shift in the winds. Incremental gains on the regulatory front, maturing market infrastructure, a growing number of institutionally viable investment vehicles, and a deeper understanding of the value of crypto-assets are all leading institutional investors to take a fresh look, promising a potentially transformative crypto landscape ahead.","CoinDesk does not share the editorial content or opinions contained within the package before publication and the sponsor does not sign off on or inherently endorse any individual opinions.","Edited by Ben Schiller."],"entity":[{"type":"Torres","content":"PERSON"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Analisa Torres","content":"PERSON"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"Ben Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":["Opinion","Trading Week 2023"],"authors":["Erik Anderson"]}