{"summary":"Judge James Mellor released his written judgement on the Crypto Open Patent Alliance vs Craig Wright case on Monday.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/20\/craig-wright-lied-to-uk-court-extensively-and-repeatedly-judge-writes\/","publishDate":"2024-05-20T11:35:43","id":21492,"type":null,"title":"Craig Wright Lied to UK Court 'Extensively and Repeatedly,' Judge Writes","category":["Policy"],"content":["Craig Wright lied \"extensively and repeatedly\" in both his written and oral evidence in the Crypto Open Patent Alliance case regarding his claim to be Satoshi Nakamoto, Judge James Mellor said in his written judgement on Monday.","Mellor also concluded that the issue of injunctive relief - a legal remedy to stop a defendant from doing something - will be argued at a Form of Order hearing that will be appointed after the judgment has been handed down.","Mellor in March concluded Wright was not Nakamoto, the pseudonymous inventor of Bitcoin, and that he had not authored the cryptocurrency's foundational document known as the white paper.","\"I want to thank those of you who sent me messages of support yesterday. I await the written judgment at which point I will consider my options for appeal,” Wright said on X (formally known as Twitter) in March.","Although the ruling can be appealed, Mellor’s definitive statement following the month-long trial was cause for celebration for the broader crypto industry, which has long criticized and been victim to Wright’s legal battles against members of the community.","“Dr. Wright is not the person who adopted or operated under the pseudonym Satoshi Nakamoto in the period 2008 to 2011. Third, Dr. Wright is not the person who created the Bitcoin System. And, fourth, he is not the author of the initial versions of the Bitcoin software,” Mellor said after both parties to the trial had presented their evidence.","The Crypto Open Patent Alliance (COPA), whose stated mission is to protect the adoption of crypto and fight threats against the new technology, filed to take Wright to court in 2021. The trial commenced on Feb. 5, with COPA accusing Wright of forgery and, later, perjury.","\"I am entirely satisfied that Dr Wright lied to the Court extensively and repeatedly,\" Mellor said. \"Most of his lies related to the documents he had forged which purported to support his claim.\"","COPA, whose backers include Twitter founder Jack Dorsey and crypto exchange Coinbase (COIN), said it will seek several injunctions to prevent Wright from claiming to be Nakamoto and taking Bitcoin developers to court again.","It has also said it may ask U.K. prosecutors to consider perjury charges against Wright for statements made during the trial.","\"Dr Wright’s attempts to prove he was\/is Satoshi Nakamoto represent a most serious abuse of this Court’s process,\" Mellor said in his judgment. \"The same point applies to other jurisdictions as well: Norway in particular.\" Wright also had a nearly five year long legal battle against Norwegian bitcoiner Hodlonaut.","In March, Mellor imposed a worldwide freezing order on 6 million British pounds ($7.6 million) worth of Wright assets to ensure he couldn't move them offshore or evade costs from the COPA trial. According to the order, COPA's costs for the case amounted to 6.7 million pounds at the time.","Read more: Craig Wright Assets Frozen by UK Judge to Prevent Him Evading Court Costs","Update (12:58 UTC): Adds relief line to second paragraph and Wright Tweet to third paragraph and impact to other jurisdictions to the tenth paragraph","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Crypto Open Patent Alliance","content":"ORGANIZATION"},{"type":"Norway","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"Mellor","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"$7.6 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"2008","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"6 million British pounds","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"James Mellor","content":"PERSON"},{"type":"UK Judge to Prevent Him Evading Court Costs","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"Wright Tweet","content":"PERSON"},{"type":"Feb. 5","content":"DATE"}],"hashtag":["Regulations","Crypto","Craig Wright","COPA"],"authors":["Camomile Shumba"]}