{"summary":"The \"Cash\" Visa card from Ether.fi, the liquid restaking startup on Ethereum, might help crypto natives turn their decentralized finance investments into spending money.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/24\/who-needs-an-off-ramp-etherfi-plans-visa-card-for-crypto-degens\/","publishDate":"2024-05-24T13:00:00","id":21496,"type":null,"title":"Who Needs an Off-Ramp? Ether.fi Plans Visa Card for Crypto Degens","category":["Technology"],"content":["The newest product from liquid restaking startup Ether.fi could finally help \"paper rich\" crypto degens turn their blockchain investments into spending money.","Ether.fi Cash will be a mobile wallet and Visa credit card that borrows USDC, the popular USD-pegged stablecoin, against one's decentralized finance (DeFi) investments and can be paid off directly via crypto.","\"Our mission is to build a suite of integrated apps that make DeFi actually usable for normal people,\" said Ether.fi founder Mike Silagadze. \"Cash is your spending account, with the dream being that you never have to off-ramp\" from the blockchain. \"Off-ramping\" refers to the tedious (and fee-laden) process of converting between cash and crypto.","Today, Ether.fi is best known as a service for funneling assets into EigenLayer, the Ethereum-based restaking giant that helps investors secure upstart blockchain services in exchange for rewards. EigenLayer has drawn in some $18 billion worth of deposits over the past year, with over $5.5 billion coming from users who initially deposited their money into Ether.fi in exchange for eETH tokens – a kind of receipt on EigenLayer deposits that can be traded in crypto markets like any other asset.","Read more: With Mastercard, MetaMask Tests First Blockchain-Powered Payment Card","In addition to its \"Stake\" program, Ether.fi also has a \"Liquid\" program, where users can deposit their funds into vaults that follow hand-curated trading strategies.","Ether.fi Cash cardholders will be able to borrow funds against their Stake or Liquid deposits and use the interest from those investments to automatically pay off their bills. Users can alternatively convert assets directly into USDC, allowing for instant settlement.","With Cash, \"you on-ramp once onto Ether.fi and then you never have to off-ramp again because you can save, invest, and spend all your money,\" said Silagadze. \"You can get paid in crypto, and you can just live your life normally without plugging into the TradFi ecosystem.\" Ether.fi aims to offer a crypto-centric rewards program akin to those offered by Chase and other legacy card providers. It also aims to differentiate itself from traditional credit cards through its fee structure, which will follow the DeFi market rather than the standard 15-30% APR charged by regular credit cards.","Cash is not the first swing at a crypto-based card, but Silagadze insists that previous attempts to build similar products have amounted to \"garbage.\"","\"Most of them are Visa debit cards,\" he said. \"Visa debit cards are pointless because you can only use them for, like, hotels and car rentals. You can't use them for a lot of stuff. They're just not practical.\"","\"This is an actual credit card,\" Silagadze emphasized.","He expects Cash to roll out to consumers starting in September, but it is unlikely, for regulatory reasons, to be available in certain large markets, including the U.S..","Using crypto as cash will always have its unique complexities – from market considerations to tax implications.","\"Initially, this is designed for crypto natives,\" said Silagadze, \"But if somebody is thinking of becoming a proper degen, looking at something like this might make them feel like, 'Alright, this actually helps me navigate this universe.'\"","Edited by Bradley Keoun."],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Mike Silagadze","content":"PERSON"},{"type":"Silagadze","content":"PERSON"},{"type":"Powered Payment Card","content":"ORGANIZATION"},{"type":"$5.5 billion","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"MetaMask Tests First Blockchain","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ether.Fi","credit cards","Visa","Cash","DeFi","Restaking"],"authors":["Sam Kessler"]}