{"summary":"Fireblocks customers can now connect to their Coinbase International Exchange account and protect exchange operations using the custody tech firm’s governance and policy rules.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/06\/10\/crypto-custody-firm-fireblocks-partners-with-coinbase-international-exchange-for-more-reliable-trading\/","publishDate":"2024-06-10T14:00:00","id":21508,"type":null,"title":"Crypto Custody Firm Fireblocks Partners With Coinbase International Exchange for More 'Reliable' Trading","category":["Finance"],"content":["Cryptocurrency custody firm Fireblocks is working with Coinbase International Exchange, the non-U.S. arm of the trading business providing perpetual futures and spot trading features for institutional and retail clients in eligible jurisdictions, the companies said on Monday.","Fireblocks customers can now connect to their Coinbase International Exchange account and protect exchange operations, such as withdrawals and deposits, with Fireblocks’ governance and policy rules, according to a statement.","Coinbase International Exchange received a regulatory license from the Bermuda Monetary Authority to offer its services in May 2023. It initially operated only as a derivatives exchange for institutions and later added spot crypto trading for retail.","Fireblock uses cryptographic key sharing technology, Multi-Party Computation (MPC), to remove a single point of compromise from API credentials, combined with secure hardware enclaves to prevent further threats or inside collusion attacks.","Customers can use Fireblocks’ policy engine to configure user roles, governance policies, and approval workflows for exchange deposit and withdrawal operations to protect against an insider unilaterally moving funds from an exchange account. They can also deposit, withdraw, and rebalance across the Fireblocks Console or API and monitor all connected account balances, according to a press statement.","“As we continue to expand our offerings for institutional and retail clients, this collaboration underscores our commitment to providing a robust and reliable trading infrastructure for our global clientele,” said Usman Naeem, CEO of Coinbase International Exchange, in a statement."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Fireblocks’ governance","content":"ORGANIZATION"},{"type":"Fireblocks","content":"ORGANIZATION"},{"type":"Fireblocks’","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"Bermuda Monetary Authority","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"Usman Naeem","content":"PERSON"}],"hashtag":["Fireblocks"],"authors":["Ian Allison"]}