{"summary":"Crypto lending firm Ledn survived the crypto winter by being \"boring, slow and safe,\" according to a co-founder.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/06\/10\/bitcoin-etfs-bankruptcy-paybacks-have-given-crypto-lending-a-second-wind\/","publishDate":"2024-06-10T11:00:00","id":21506,"type":null,"title":"Bitcoin ETFs, Bankruptcy Paybacks Have Given Crypto Lending a Second Wind","category":["Finance"],"content":["The crypto lending sector is recovering from the crypto winter, which blew up several large players, thanks to spot bitcoin (BTC) exchange-traded funds (ETFs) and creditors getting some of their assets back from bankrupt companies.","\"What I'm seeing is that this market has come back roaring,\" Mauricio Di Bartolomeo, co-founder of crypto lending firm Ledn, told CoinDesk during a recent interview at the Consensus 2024 conference in Austin, Texas. \"The market never really left; it [just] got scared.\"","Crypto lending is akin to conventional banking. Customers deposit bitcoin or other cryptocurrencies with a company like Ledn, and earn interest or use that crypto to back loans. The interest paid to depositors is generated by lending their crypto to others and charging them interest.","The sector spectacularly imploded in 2022 as crypto prices dove, with firms including Celsius, BlockFi and Genesis filing for bankruptcy.","Since then, the digital assets sector has recovered from the bear market downturn. Prices have soared, with the CoinDesk 20 Index up more than 200% since the end of 2022. The rally kicked into high gear late last year after BlackRock and other conventional finance giants applied – successfully – to create bitcoin ETFs in the U.S. According to Ledn's Di Bartolomeo, the positive narrative surrounding these funds is one of the major reasons why users are back in the lending market.","\"Bitcoin has gone up from $20,000 to $70,000 and has become the focus of the political race in the U.S.,\" he said. \"So that means there's more interest, there is real product market for bitcoin as an asset and for bitcoin as a collateral for lending.\"","In fact, Ledn processed more than $690 million in loans in the first quarter, its most successful quarter since its inception in 2018. More than 84% of the processed loans were directed to institutional clients, as demand spiked after bitcoin ETFs were approved in January. Ledn only process loans in bitcoin, Ethereum's ether (ETH) and two stablecoins: USDC and USDT.","The institutions participating in this sector now are mostly market makers from both Wall Street and crypto-native companies. \"These are the firms that are operating in the ETF markets as well as spot,\" Di Bartolomeo said. \"Some have made their names in crypto, some in TradFi.\"","Another reason users are returning to the lending market is that many of the firms that went bankrupt are starting to give users their money back. Many of them are now returning to the lending market, according to Di Bartolomeo.","When asked why this is the case, he explained that for most of these users, their investment thesis – if you hold them long enough, you will get an appreciation of wealth – has been playing out despite the market downturns. These users were \"kneecapped\" by some bad actors, but as they start to get their assets back, many of the \"hardcore users\" won't likely sell, he said. Di Bartolomeo added that this is when they turn to the lending market to use their assets for borrowing and lending.","\"What I'm seeing is sort of undisputed proof that people want to hold their bitcoin for the long term and also want to have their cake and eat it, too,\" he said. A customer could be worth millions in bitcoin, but if they turn to a TradFi bank, they won't recognize their digital assets as collateral for a loan. \"This is what we [lenders such as Ledn] bridge [the gap] for these customers,\" he added.","So how did a centralized lender like Ledn survive the crypto winter when many went bankrupt? The short answer is staying true to the lending and borrowing business fundamentals. Ledn only works with qualified and vetted institutions, doesn't have an asset and liability mismatch and doesn't take part in DeFi yield farming, he said. \"That means that if somebody lends to me bitcoin, I lend bitcoin; if somebody lends me a dollar, I lend dollars. There's always a taker. And there's always liquidity,\" Di Bartolomeo said.","He also added that all the lending and borrowing activities are term-matched, meaning if a user lends an asset with seven-day terms, Ledn lends it to another user who can give it back in five, providing liquidity for the assets.","\"People were calling us boring, and we said listen, this is our way: boring, slow and safe,\" he noted.","Read more: Crypto Lenders Caused Crypto Contagion Last Year. How Is the Industry Rebuilding?","Edited by Nick Baker."],"entity":[{"type":"Mauricio Di Bartolomeo","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"$20,000","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"84%","content":"PERCENT"},{"type":"Nick Baker","content":"PERSON"},{"type":"Ledn","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"$690 million","content":"MONEY"},{"type":"Ledn's Di Bartolomeo","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"January","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Crypto Lenders Caused Crypto Contagion Last Year","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"200%","content":"PERCENT"},{"type":"winter","content":"DATE"},{"type":"Bartolomeo","content":"PERSON"},{"type":"$70,000","content":"MONEY"}],"hashtag":["Ledn","Lending","Borrowing","Exclusive"],"authors":["Aoyon Ashraf"]}