{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For May 28- June 7.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/06\/04\/protocol-village\/","publishDate":"2024-06-04T22:29:17","id":21502,"type":null,"title":"Protocol Village: Coinbase Launches Passkey-Based 'Smart Wallet,' Alchemy Unveils 'Rollups,' Fleek Releases Testnet","category":["Technology"],"content":["June 6: Mountain Protocol has raised $8 million from Multicoin Capital. The project issues the yield-bearing stablecoin \"USDM,\" backed by US Treasuries and regulated by the Bermuda Monetary Authority. In a blog post announcing the investment, Multicoin said it hoped Mountain Protocol's regulatory approach would differentiate it from others in the yield-generating stablecoin space.","June 6: EXCLUSIVE – Jiritsu, a layer one blockchain platform focused on real-world assets (RWAs), is integrating with BlackRock to enhance RWA transparency and verification. This partnership includes proof of reserves for RWAs, providing on-demand verification,\" a representative for Jiritsu told CoinDesk. \"Initial integrations involve BlackRock's BUIDL tokens and Bitcoin ETF, bringing verified asset data on-chain.\"","June 6: Fleek, a blockchain-based cloud infrastructure platform, is launching its testnet. With the launch and a new partnership with Polygon, the project \"is gearing up to enable these platforms—and projects building on Polygon—to move beyond cloud tech and decentralize their backend to engender a more performative, cost-effective, and decentralized approach to onchain hosting,\" the project told CoinDesk. \"Fleek works with 50,000 apps on their front end, allowing the likes of ENS, Dappradar, Synthetix, and even Vitalik Buterin's website, Vitalik.eth, to host their sites via web3 infra,\" it added.","June 6: Mina Protocol, a blockchain powered by zero-knowledge (ZK) cryptography, has completed a network upgrade designed to bring \"enhanced ZK programmability\" to developers. In development since 2021, \"the upgrade moves smart contract execution off-chain, and leaves verification on-chain, solving blockchain infrastructure challenges, such as data constraints, scalability issues, and high gas costs,\" according to the Mina Foundation. \"The upgrade enables zkApps to be built and deployed on the Mina mainnet, setting the stage for the development of new zero knowledge-powered use cases and equipping builders with a powerful ZK developer toolkit,\" the organization said.","June 6: Web3 developer platform Alchemy has released \"Rollups\", a new product that allows developers to easily launch their own chains while accessing Alchemy's infrastructure and product suite. \"Rollups aims to address the downtime issues developers often face when deploying their own chains and allows them to monetize, customize, and capture value from their blockspace in ways they previously couldn’t,\" according to the company.","June 6: Tezos, a layer-1 blockchain, has activated its 16th protocol upgrade, Paris, \"enhancing performance with the new Data Availability Layer (DAL) and reducing block times to 10 seconds,\" according to the project. The upgrade is designed to boost L2 throughput, \"making Tezos more scalable and robust.\" According to the team, \"The DAL significantly improves data distribution, supporting various decentralized applications (dApps) and future scalability. Faster block times improve transaction speed and finality, enhancing user experience. Adaptive Issuance and Staking further secure the network by aligning with real-world usage.\"","June 6: Injective, the Cosmos-based blockchain focused on decentralized finance (DeFi), has unveiled a new whitepaper for its INJ token. The paper introduces new details about the token's burn mechanism and deflation mechanics and offers an in-depth analysis of its technical architecture and supply schedule.","June 5: Coinbase is launching its browser-based 'Smart Wallet' infrastructure. The tech will allow wallet developers to provide users with passkey-based logins, easy access to Coinbase balances and the potential for gasless transactions. The wallet supports multiple EVM-based L2 networks and integrates with popular existing wallet SDKs.","June 5: M^0, a decentralized infrastructure layer for issuing cryptodollar assets, announced a $35M Series A funding round led by Bain Capital Crypto. \"This funding round aligns with the launch of the M^0 core protocol and its on-chain governance mechanism on the Ethereum Mainnet\" the team said, adding that it \"seeks to transform the stablecoin industry by allowing institutions to create decentralized, interoperable, and fungible cryptodollars.\"","June 4: GnosisDAO voted to spin off karpatkey as a stand-alone entity managed by the KPK token. Karpatkey has managed over $2.6 billion in treasuries since its launch, providing risk management and on-chain financial services. Karpatkey’s clients include Uniswap, GnosisDAO, CoW, MakerDAO, Safe, and Arbitrum, among others, according to a representative for Gnosis.","June 4: Mantle EcoFund, with a capital pool of $200M, deployed $5M in its second capital call. \"Seven Mantle Ecosystem SocialFi and gaming projects have received fresh funding: MetaCene, Blade Games, Co-Museum, Fingerlabs, L3E7, and DreamOS,\" said Mantle. \"The newly inducted projects within Mantle EcoFund portfolio underscore Mantle’s belief in the transformative power of SocialFi and gaming applications to onboard the next billion users to web3.\"","June 3: Connext has rebranded to Everclear to build a Clearing Layer for Web3, solving liquidity fragmentation for modular blockchains. Everclear secured $5 million from Pantera Capital and launched its testnet to reduce liquidity management costs across chains. According to Everclear, their system \"can reduce the cost and complexity of solving and liquidity management across chains by as much as 90%.\"","June 2: Nuklai, a layer-1 blockchain built for artificial intelligence, launched the first phase of its HelixVM Early Testnet, introducing core functionalities for developers and users. The testnet allows transferring tokens, minting, and other interactions, supporting developers to build on HelixVM.","May 29: Celo, the layer-2 blockchain for Ethereum, has integrated Chainlink’s CCIP for cross-chain interoperability. This integration aims to enhance cross-chain security and reliability, supporting various token transfer mechanisms and positioning Celo for on-chain innovation.","May 29: SCRYPT, a provider of crypto asset financial services, has closed a $5 million strategic funding round led by Braza Bank. This funding will support SCRYPT’s expansion in LATAM and enhance its product offerings.","May 29: JOJO, a perpetuals exchange on Coinbase's Base blockchain, is partnering with Brevis, to implement ZK-proof technology for funding rates. This aims to bring price stability and better liquidity for traders by efficiently calculating funding rates. \"A precise funding rate is essential to perpetual futures, as it keeps contract prices aligned with spot prices,\" the company said. \"Even so, it's computationally intense. With Brevis' ZK Coprocessor technology, the funding rate can be calculated efficiently and quickly, creating an accurate funding rate to benefit all traders.\"","May 29: Helix, a decentralized spot and derivatives exchange on Injective, released Helix 2.0, featuring new trading tools and support for new perpetual futures contracts. \"Helix 2.0 broadens DeFi trading capabilities by offering TradFi market-making tools and opens new gateways to capitalize on RWAs in decentralized markets,\" said Injective, who shared the news with CoinDesk.","May 28: API3 has completed a strategic funding round led by DWF Labs, raising $4 million. The funding will enhance liquidity and support API3’s growth strategy, according to the company. API3’s Total Value Secured (TVS) has increased significantly to over $1 billion, the team says, as it has integrated with new chains like Optimism Superchain and Worldcoin.","May 28: Semiotic Labs released a whitepaper on AI services and launched a demo of Agentc, a ChatGPT-like tool built on The Graph, the blockchain indexing platform. The chatbot aims to facilitate blockchain data access via natural language, and a demo will be available for two weeks.","Edited by Sam Kessler.","\n","\n"],"entity":[{"type":"90%","content":"PERCENT"},{"type":"May 28","content":"DATE"},{"type":"May 29","content":"DATE"},{"type":"Bermuda Monetary Authority","content":"ORGANIZATION"},{"type":"June 6","content":"DATE"},{"type":"June 5","content":"DATE"},{"type":"June 4","content":"DATE"},{"type":"June 3","content":"DATE"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Mina Foundation","content":"ORGANIZATION"},{"type":"$5M","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"US Treasuries","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"Fingerlabs","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"$2.6 billion","content":"MONEY"},{"type":"Mantle EcoFund","content":"PERSON"},{"type":"Connext","content":"ORGANIZATION"},{"type":"Jiritsu","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"Mountain Protocol","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Multicoin","content":"PERSON"},{"type":"$200M","content":"MONEY"},{"type":"Fleek","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"$35M","content":"MONEY"},{"type":"Mina mainnet","content":"PERSON"},{"type":"Mina Protocol","content":"ORGANIZATION"},{"type":"Sam Kessler","content":"PERSON"},{"type":"Braza Bank","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"Injective","content":"PERSON"},{"type":"Brevis","content":"PERSON"},{"type":"$4 million","content":"MONEY"},{"type":"Everclear","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"Dappradar","content":"PERSON"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Sam Kessler"]}