{"summary":"&quot;Going Infinite&quot; claims Virtu Financial lost $10 million with FTX. A spokesperson for the trading firm says the information is false.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254791\/virtu-blasts-michael-lewis-book-saying-it-didnt-lose-10-million-with-ftx","publishDate":"2023-10-04T14:39:26","id":2150,"type":null,"title":"Virtu blasts Michael Lewis book, saying it didn&#x27;t lose $10 million with FTX","category":["PEOPLE"],"content":["Virtu Financial took exception to at least <a href=\"https:\/\/www.theblock.co\/post\/254116\/jump-trading-lost-more-than-200-million-in-ftx-collapse-going-infinite\" data-v-f87c67ca=\"\">one mention<\/a> of the trading firm in Michael Lewis' highly-anticipated book about the rise and fall of former FTX CEO Sam Bankman-Fried.","In contrast to what Lewis wrote in his book, \"Going Infinite,\" a Virtu spokesperson said the company firmwide never lost any money with FTX. \"We have no idea where Lewis got his $10 million figure, but it raises questions about his level of diligence,” the spokesperson told The Block.","\"Going Infinite\" has been a hot topic of conversation in and out of crypto circles after publishing this week, the same week Bankman-Fried's criminal trial got underway in New York. Thus far, the book has proved to be chock full of <a href=\"https:\/\/www.theblock.co\/post\/254666\/cz-declined-to-pay-40-million-to-sbf-for-futures-exchange-going-infinite\" data-v-f87c67ca=\"\">juicy details<\/a> Lewis claims to have observed or discovered while researching it.","\"At the moment of its collapse, FTX had more than ten million account holders, to whom it owed $ 8.7 billion,\" Lewis wrote in one passage. \"Nearly half of those losses, or $4 billion, were concentrated in these fifty accounts ... Near the top was Jump Trading ($ 206,160,600.00), and at the bottom was Virtu Financial Singapore ($ 10,095,336.83).\"","Bankruptcy <a href=\"https:\/\/www.theblock.co\/post\/254667\/anthropics-new-raise-could-mean-full-payout-for-ftx-creditors-lawyer\" data-v-f87c67ca=\"\">proceedings<\/a> that will determine how much money creditors recoup is currently underway.&nbsp;Lewis' publicist did not immediately respond to a request for comment.","Since the book's arrival and Lewis' appearance on long-time news show \"60 Minutes,\" the author has again been the subject of criticism, especially for his comments about FTX's performance as a company. The collapsed crypto exchange began bankruptcy proceedings late last year after millions of customers lost their money.","Virtu's spokesperson took another shot at Lewis' credibility, saying the author's claims about the $10 million lost are \"as accurate as his understanding of market structure in 'Flash Boys.'\"","Published in 2014, Lewis' book on high frequency trading has been lambasted by some critics for its <a href=\"https:\/\/www.economist.com\/buttonwoods-notebook\/2014\/05\/07\/hft-the-backlash-continues\" data-v-f87c67ca=\"\">depiction<\/a> of the subject matter and <a href=\"https:\/\/www.cnbc.com\/2014\/11\/24\/hft-critic-michael-lewis-dead-wrong-author.html\" data-v-f87c67ca=\"\">alleged<\/a> inaccuracies.","During an <a href=\"https:\/\/www.theblock.co\/post\/206253\/virtu-continues-to-see-crypto-as-a-long-term-growth-opportunity\" data-v-f87c67ca=\"\">earnings call<\/a> at the beginning of this year, Virtu's CEO Doug Cifu said that \"although we had an approximate 8-figure fiat and coin balances deployed across several venues when the FTX news broke, we acted quickly and did not realize any material losses.\"","As a global market maker in equities and other financial products, Virtu commands a relatively low profile within crypto. In addition to making markets in crypto exchange traded funds, its CEO has described crypto as a \"long-term growth opportunity.\"","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ten million","content":"MONEY"},{"type":"Virtu","content":"ORGANIZATION"},{"type":"$ 8.7 billion","content":"MONEY"},{"type":"$ 206,160,600.00","content":"MONEY"},{"type":"Lewis","content":"PERSON"},{"type":"Doug Cifu","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$ 10,095,336.83","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Michael Lewis","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Virtu Financial Singapore (","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["RT Watson","Frank Chaparro","The Block"]}