{"summary":"Engaging in open dialogue and discussions with critics is a productive way to ensure information circulating online is factual, SHADOW WAR's Roy Blackstone writes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/23\/are-sideline-skeptics-cryptos-biggest-enemy-or-greatest-strength\/","publishDate":"2024-05-23T18:08:45","id":21500,"type":null,"title":"Are Sideline Skeptics Crypto’s Biggest Enemy or Greatest Strength?","category":["Consensus Magazine"],"content":["Blockchain technology and its user base might be growing apart. As the industry has made leaps and bounds in progress over the past five years in terms of its technical capabilities and financial acumen, it’s hard to say that its audience has evolved the same way.","This article is part of CoinDesk's Web3 Marketing package. Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","Roy Blackstone is creative director of SHADOW WAR.","Sure, you have far fewer scammers and self-proclaimed wunderkinds percolating through the ecosystem than before thanks to the last bear market. But the hyper-online troll and commentator culture is still the public face of the crypto industry to many. Across online platforms, social media outlets, and industry conferences, voices continually seek to influence the trajectory of crypto and help HODLers navigate the market’s turbulent waters.","Amid the noise of opinions, however, a critical question must be addressed: Are these critics merely sideline observers, or do they hold concrete power to drive progress within the industry? As crypto sheds its fringe status, it’s time to reckon with its cottage industry of critics and influencers.","Every industry has a set of commentators—from sports to entertainment to politics—and each sector has pundits armed with words, ideas, and a varying degree of influence and credibility. However, for an internet-native industry like crypto which relies on digital forums for communication, online communities play a pivotal role in shaping perceptions, influencing decision-making, and driving overall market trends.","The blockchain industry's growth offers newcomers a chance to explore emerging financial tools and decentralized finance. While it has gained positive traction, the pool of builders still remains relatively small. The crypto landscape is filled with many participants with little to no experience in tech or finance but who are still eager to contribute their perspectives and support to this expanding space.","As such, platforms like X, Telegram and Discord, alongside crypto influencers, have become the lifeblood of many Web3 projects – and feedback can propagate across the internet, reaching a vast audience in a matter of moments. Elon Musk is an evergreen example, with his posts on X about cryptocurrencies consistently having a noticeable impact on the market. So clearly, there is an amplified influence from outside voices on the trajectory of crypto and associated projects.","The benefits? Social platforms have become grounds for new projects to grow by authentically inserting themselves into crypto discussions.","TAG Heuer, for example, used X to launch the luxury watch brand’s move into Web3. As a result, NFTs rose to fifth on the list of interest of the brand’s followers on X from 13% before the launch. This shows how brands looking to enter the Web3 space turn to user-first platforms like X to establish a presence where their target audience congregates rather than relying solely on traditional marketing methods.","With that said, in a niche industry like crypto, its inherently online culture makes it exceptionally susceptible to trolls – and the more ridiculous or outrageous their ridicule, the greater the potential to frustrate. Since crypto communities are tribal, they often become emotionally and financially invested in their favorite blockchain network or project, making them automatically defensive or resistant to critiques that challenge their interests.","It effectively applies “stan culture” to a very real financial and technological ecosystem. But does that mean every crypto critic is just a troll in disguise?","When it’s constructive, criticism catalyzes progress—and crypto has proven no different. Constructive criticism and discussion can foster innovation, drive collaboration and help newcomers navigate its terrain.","Well-run organizations can leverage constructive criticism to tackle complex challenges as collaborative efforts are powered by shared knowledge. The ecosystem benefits from the critical eye of commentators, distinguishing real innovation from projects that blow smoke.","One way to address negative feedback about the industry is to put business founders in front of their audience. Engaging in open dialogue and discussions with critics is a productive way to ensure information circulating online is factual and not based on skeptics' feelings towards the project.","Virtual AMA (ask me anything) sessions through platforms such as Telegram, Reddit, X and YouTube allow project leaders to interact with community members, address pain points, and showcase their value. Sharing goals and updates about projects directly with the public fosters loyalty and a positive brand experience.","Even now, we’re witnessing the benefits of constructive criticism, as the common critique of crypto’s unprofessionalism and negligence has been addressed and piqued the interest of institutional players.","This shift in the regulatory interest of financial institutions is evidence that crypto builders should listen to and acknowledge their users' feedback. The more developers can embrace grounded critiques from their community, even from outsiders, the faster the ecosystem will mature and expand.","Criticism produces a torrent of responses, often obscuring the subject's underlying merits and exacerbating the industry's volatility. A concerted effort towards education, streamlined processes, and robust security is necessary to usher the next wave of crypto enthusiasts into the mainstream. By fostering familiarity and trust, the crypto ecosystem can transcend its reputation, paving the way for widespread adoption and growth.","Edited by Daniel Kuhn."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"AMA","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"Roy Blackstone","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"}],"hashtag":["Opinion","Web3 Marketing 2024"],"authors":["Roy Blackstone"]}