{"summary":"Fantom Foundation announced Monday that it plans to petition the court to liquidate Multichain Foundation to recover missing assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280547\/fantom-wants-to-liquidate-multichain","publishDate":"2024-03-05T01:04:10","id":2151,"type":null,"title":"Fantom seeks to liquidate Multichain Foundation to recover assets from July exploit","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Fantom Foundation, a blockchain platform for decentralized finance, announced Monday in a blog post that it plans to petition the court to liquidate Multichain Foundation to recover missing assets. <\/span>","<span data-v-f87c67ca=\"\">Fantom said in the <a href=\"https:\/\/blog.fantom.foundation\/fantom-foundation-awarded-default-judgement-against-multichain\/\" data-v-f87c67ca=\"\">blog post<\/a> that the amount its ecosystem lost accounts for around one-third of the $210 million exploited off of the cross-chain protocol Multichain bridge last July.<\/span>","<span data-v-f87c67ca=\"\">In January, the High Court of Singapore made a default judgment in favor of Fantom on its legal action against Multichain for alleged breach of contract and fraudulent misrepresentations, according to the post<\/span><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">With this legal victory, the Singaporean court is expected to appoint a liquidator to assess Fantom’s damages resulting from Multichain’s security breach and help recover and distribute the missing or frozen assets, according to Fantom.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Given the persistent absence of Multichain, we do not expect this to occur, at which point the Foundation will petition the court to wind up the Multichain Foundation and appoint a liquidator,” Fantom said. The foundation’s decision to take legal action came after multiple attempts to engage with key personnel of Multichain, according to Fantom.<\/span>","<span data-v-f87c67ca=\"\">Fantom’s case could provide a pathway for other Multichain users to claim lost assets with the default judgment ruling. Multichain’s exploit resulted in a total loss of $210 million across chains, including BNB, Ethereum, Polygon and Arbitrum. Fantom added that its founder is subject to an active investigation in Kunming, China.<\/span>","<span data-v-f87c67ca=\"\">The DeFi platform has also opened a proposal for a class action lawsuit against Multichain for affected users to take part in, according to its X <\/span><a href=\"https:\/\/twitter.com\/FamtonFDN\/status\/1764837791232647179\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Multichain Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"High Court","content":"ORGANIZATION"},{"type":"liquidate Multichain Foundation","content":"ORGANIZATION"},{"type":"$210 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Fantom","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Kunming","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CROSS-CHAIN SWAPS","EXPLOITS","HACKS"],"authors":["Danny Park","The Block"]}