{"summary":"The funding round led by Electric Capital included participation from RockawayX, Coinbase Ventures, L1 Digital and Placeholder.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/06\/10\/squads-labs-raises-10m-series-a-unveils-smart-wallet-for-public-testing-on-ios\/","publishDate":"2024-06-10T14:24:14","id":21513,"type":null,"title":"Squads Labs Raises $10M Series A, Unveils Smart Wallet for Public Testing on iOS","category":["Finance"],"content":["Technology company Squads Labs, which aims to help businesses transact in and manage digital assets, raised $10 million in Series A funding led by Electric Capital.","The funding round included participation from RockawayX, Coinbase Ventures, L1 Digital and Placeholder, Squads Labs said in an email on Monday.","Squads has also unveiled a smart wallet aimed at individuals for public testing on iOS. The company already offers a Solana-based wallet for businesses. That has secured over $10 billion in value.","The new wallet, Fuse, is designed to eliminate the need to remember seed phrases – streams of 12 to 24 random words for restoring access to a user's assets – instead using wallet recovery and 2FA capabilities.","Focus on drawing more participants to the crypto industry often focuses on individual users. While Squads' attention has previously been more toward attracting businesses to the digital asset world, with the rollout of Fuse, it now appears to be widening its embrace to both sides of the market.","Squads plans to use its new funding to advance its smart account technology and products and expand its team.","Read More: Coinbase Wallet Adds Crypto Trading Alerts From Notifi","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Fuse","content":"ORGANIZATION"},{"type":"Squads Labs","content":"ORGANIZATION"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"Coinbase Wallet Adds Crypto Trading Alerts From Notifi","content":"ORGANIZATION"}],"hashtag":["Wallets","smart contracts","Funding Rounds"],"authors":["Jamie Crawley"]}