{"summary":"The Bitcoin community has developed various layer-2 blockchains that enhance the network's efficiency and functionality without altering its core software.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/06\/06\/crypto-for-advisors-layer-2s-and-the-evolution-of-bitcoin\/","publishDate":"2024-06-06T16:00:00","id":21510,"type":null,"title":"Crypto for Advisors: Layer 2s and the Evolution of Bitcoin","category":["Opinion"],"content":["Today, Marcin Kaźmierczak from RedStone explains how Bitcoin layer-2s aim to enhance the protocol's performance while preserving its integrity by deploying enhancements on a separate blockchain.","Many advisors attended Consensus 2024 in Austin, Texas, last week. I highlight the key themes that emerged from the event in Ask an Expert. I’m looking forward to next year's conference, which will be held in Toronto, Canada.","–S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Bitcoin (BTC) has revolutionized the financial world with its decentralized, secure and transparent nature. Although it was the first cryptocurrency, Ethereum (ETH) pioneered the development of the entire decentralized finance, or DeFi, ecosystem. Now, Bitcoin is following suit, ushering in an era of development within its own ecosystem. As Bitcoin's popularity surged, so did the challenges related to its scalability and transaction speed. To address these issues, the Bitcoin community has developed various layer-2 blockchains, or L2s, which enhance the network's efficiency and functionality without altering Bitcoin's software itself. This article delves into the concept of Bitcoin layer 2s, exploring their classifications, benefits and expected advancements in this sector. By understanding these innovative protocols, users can comprehend how Bitcoin continues to evolve and maintain its relevance in an increasingly competitive digital landscape. In the end, the bitcoin cryptocurrency is the digital gold and the whole economy is being created around it, analogous to gold in the physical world.","Q: What are Bitcoin layer 2s, and how are they classified?","A:","They are built on top of the Bitcoin blockchain. Transactions can be offloaded to them, addressing the Bitcoin blockchain's performance issues and limitations and adding programmability functionalities. There are three types of Bitcoin layer 2s:","1. State Channels","2. Sidechains","3. Rollups","Q: What problems do Bitcoin L2s fix, and why do they matter?","A:","Bitcoin layer 2s address key issues to enhance the network's efficiency and functionality. First, they improve scalability by reducing congestion. As a result, the transaction fees are lower and their execution is faster, making Bitcoin more suitable for everyday use. L2s also increase the utility of bitcoin holdings and introduce complex smart contract functionality, enabling DeFi, NFTs and other Web3 applications. This enhanced programmability helps Bitcoin maintain market relevance. They expand Bitcoin's use cases and ensure smoother, more affordable transactions. Ultimately, Bitcoin L2s matter for users, as they allow new functionalities for BTC holders, such as usage of lending platforms, yield solutions or decentralized exchanges (DEXs). They serve as an alternative to Ethereum-based solutions for actors who hold an important part of their bitcoin portfolio.","Q: A comparison of existing Bitcoin L2s and what to expect in that sector this year.","A:","Comparing Bitcoin layer 2s involves evaluating their technical classification. One should identify whether it is a state channel, rollup or sidechain. Additionally, metrics such as transaction fees, security guarantees and available decentralized applications, or dApps, on top of a network are crucial. The table below represents major Bitcoin layer 2s as of June 2024.","* BounceBit is not a layer 2 but a layer 1 proof-of-stake chain with BTC as the main currency.","** Babylon is a BTC staking platform, implementing a novel approach allowing BTC staking.","Looking ahead, with no doubt, we can expect further expansion and the emergence of new Bitcoin layer 2s. Because of its scarcity and the fact that only about 21 million bitcoin will ever exist, it fundamentally makes sense to expand the programmability and functionalities of digital gold. The upcoming evolvement will include lowering transaction costs on the above L2s, adding further compatibility layers and implementing well-known primitives on top of Ethereum such as automation dApps or support of popular wallets.","Bitcoin has neither a floor nor ceiling in its value and cumulative market capitalization that sits today near $1.4 trillion. In its current form, the Bitcoin blockchain plays a foundational layer on top of which innovation can flourish. and today, that is materialized with layer 2s. Looking at the success of Arbitrum, Optimism, Base and zkSync, one can argue that we will have at least a few thriving ecosystems in that category. Therefore, it is vital to follow its evolvement and embrace the use of BTC as one of the fastest-growing narratives in 2024.","- Marcin Kaźmierczak, co-founder & COO, RedStone","Consensus Recap: The energy was positive at Consensus 2024 last week in Austin, Texas. Approximately 15,000 people attended, coming from a wide range of industries: service providers, custodians, crypto exchanges, ETF issuers, RIAs and advisors – all looking to connect. There was a lot of curiosity and engagement.","Q. What were the top themes that emerged?","Through this newsletter, we will continue to focus on these themes and provide deeper coverage of these topics as your source of information for advisors in the space.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","Edited by Bradley Keoun."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"$1.4 trillion","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Toronto","content":"LOCATION"},{"type":"Marcin Kaźmierczak","content":"PERSON"},{"type":"RedStone","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"June 2024","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Crypto for Advisors","Opinion","Financial Advisers","Financial Advisors","Bitcoin","Layer 2s"],"authors":["Marcin Kazmierczak","Sarah Morton"]}