{"summary":"The only thing worse than meme coins is complaining about the financialization of memes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/06\/10\/in-defense-of-meme-coins\/","publishDate":"2024-06-10T19:53:42","id":21512,"type":null,"title":"In Defense of Meme Coins","category":["Opinion"],"content":["I get it: Meme coins are dumb. Unserious. A waste of time. They give the impression that the crypto industry is trivial. Full of speculators. Vitalik Buterin is probably right to say the whole industry would be better off if people instead focused on legit projects.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.","But. Buuuuut – the only thing lamer than trying to financialize memes is complaining about meme coins. You can have many deep thoughts about how meme coins are emblematic of this age of “financial nihilism,” but shame on anyone uttering them aloud – especially if you’re holding a bag.","I don’t necessarily think meme coins should be celebrated, particularly not for the reasons most often given. At this point in the cycle, it’s clear tokens – even \"blue chips\" like shiba inu (SHIB) or dogwifhat (WIF) – aren’t really bringing in new adopters; at least not yet. I think it’s dubious to suggest that the “communities” that form around investing in meme coins are at all long term sustainable. And it’s, of course, irresponsible to suggest these tokens are creating “generational wealth” for people.","See also: Iggy Azalea's MOTHER Meme Coin Turned $3K Into $9M for 1 Lucky Trader","Meme coins are what they are: highly speculative investment vehicles. That there appears to be a near endless amount of interest and capital to plow into them essentially proves that “speculation is a use case,” no matter whether you agree with the sentiment there.","As Riva Tez put it in her recent speech at Consensus 2024, meme coins are helping crypto win the “narrative war” by fulfilling a genuine need that people have. Meme coins meet people where they are.","Fair enough to criticize casinos or state-sanctioned gambling like the lotto on moral grounds, but meme coins exist for the same reason – people like to dream their lives can change in an instant, without really having to do much work. It’s an itch that cannot simply be willed away, and it turns out gambling on blockchain-based tokens is as good as a scratch-off.","More substantially, it’s becoming evident that meme coins are tools for coordination and measuring attention. It’s in the name: meme coins are about mimetics – or the process by which ideas gain cultural currency by getting shared.","As Ravi Bakhai, who is building a meme-coin trading platform called Hype, explained, meme coins have essentially become a big, generalized betting market for determining how relevant anything is at any given time. For instance, Iggy Azalea’s MOTHER token literally put a price on her fame, and the rapper’s ability to draw an audience of crypto enthusiasts.","Now, a lot has been said over the years about crypto’s place in the “attention economy,” based around the idea that attention itself is a scarce commodity, and it’s easy to overstate the value of “crowdsourcing” popularity this way. In essence, what meme coins have revealed about the world is that people like cute dogs and can be incredibly racist.","But that doesn’t mean that primitives behind meme coins can’t one day be more useful. In the same way that prediction markets help us understand sentiment because users with “skin in the game” are incentivized to tell the truth, meme coins may also help cut through the noise.","This is the idea behind the emerging category of “PoliFi,” a portmanteau of politics and finance, and the array of tokens like JEO BODEN, MAGA and elizabath whoren that some people are using as metrics to gamble on those candidates' re-election odds. But this doesn't have to be limited to politics.","See also: Trump MAGA Meme Coins Are the First Experiment in 'PoliFi'","As Calaxy CEO Solo Ceesay recently wrote in a piece for The Defiant: “Memecoins are a prime example of how any collective group of individuals can create the economic infrastructure to facilitate commerce, trade, and collaboration without the need for an intermediary. Before blockchain, this was virtually impossible.”","Finally, as the creation of dogecoin (DOGE) in late-2013 showed, it’s worth noting that meme coins are essentially just a blank canvas for “performance art,” as Tez puts it. Co-creators Billy Markus and Jackson Palmer said DOGE was just a spoof of Bitcoin.","That actually gets to the heart of the most cutting criticism of meme coins: that they reveal the financial and psychological mechanisms that essentially make all cryptocurrencies tick. While it’s unlikely bitcoin (BTC) is going to zero, it only has value because a crowd of people say it does, which is the same reason why something like the BALD token momentarily had value (and then didn't).","The only real difference is that one is backed by the belief that the digital age needs a functioning store-of-value and the other by a desire to mock the person running Coinbase. Some see this as evidence that BTC is a gigantic Ponzi, while others weep at the beauty of the economic miracle of aligning people through shared interests.","See also: 'It's Part and Parcel of Crypto': How Memes Drive Narrative","Likewise, the worst aspects of meme coins are true too for the rest of crypto. Celebrities launching tokens and using their fans as exit liquidity is unseemly. Rug pulls are reprehensible. The relentless chase for riches is upsetting. But in a real way, there is something more honest about meme coins. They make no illusions about the game being played.","Ultimately, where one stands on meme coins will likely come down to how self-serious they are. There are genuinely people out there who think meme coins are giving crypto a bad reputation, oblivious to the fact that most people view crypto this way anyway.","I don’t think I’ll ever buy a dog token. But betting against the monetization of virality seems like a losing strategy.","Edited by Benjamin Schiller and Marc Hochstein."],"entity":[{"type":"JEO BODEN","content":"PERSON"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"MAGA","content":"ORGANIZATION"},{"type":"How Memes Drive Narrative","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Trump MAGA Meme Coins","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ravi Bakhai","content":"PERSON"},{"type":"CoinDesk, Inc.","content":"ORGANIZATION"},{"type":"Tez","content":"ORGANIZATION"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"Billy Markus","content":"PERSON"},{"type":"Iggy Azalea","content":"ORGANIZATION"},{"type":"$9M","content":"MONEY"},{"type":"Riva Tez","content":"PERSON"},{"type":"$3K","content":"MONEY"},{"type":"Jackson Palmer","content":"PERSON"}],"hashtag":["Opinion","The Node","Newsletters","meme coins","Memes","Dogecoin"],"authors":["Daniel Kuhn"]}