{"summary":"A string of Wall Street&#x27;s most active crypto traders are getting behind BlockFi, a New York crypto lending firm, as it eyes new opportunities for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5071\/fidelity-is-backing-a-crypto-lending-startup-thats-looking-to-launch-a-crypto-credit-card","publishDate":"2018-12-12T09:44:03","id":2152,"type":null,"title":"Fidelity is backing a crypto lending startup that&#x27;s looking to launch a crypto credit card","category":["STARTUPS"],"content":["A string of Wall Street's most active crypto traders are getting behind BlockFi, a New York crypto lending firm, as it eyes new opportunities for financial firms and retail alike.&nbsp;","Backing the firm are some of crypto Wall Street's usual suspects, including Fidelity subsidiary Devonshire Investors. Other investors include Mike Novogratz's Galaxy Digital, <a href=\"https:\/\/www.coindesk.com\/blockfi-raises-52-5-million-in-round-lead-by-novogratzs-galaxy-digital\" data-v-f87c67ca=\"\">which previously backed the firm in a $52.5 million round in July<\/a>. As for the latest round, the firm has raised $4 million in convertible debt investments. Options and crypto proprietary trading shop Akuna Capital led the round alongside CMT Digital, Morgan Creek Digital, and other firms.&nbsp;","<strong data-v-f87c67ca=\"\">Big plans<\/strong>","In an exclusive interview with The Block, CEO Zac Prince outlined his plans for the firm moving into 2019.","\"There are a couple of things that we are announcing outside the fundraise,\" he said in his Manhattan offices. \"Next year we will be diversifying the number of services we offer.\"","[related id=\"1\"]","Currently, BlockFi lends fiat to individuals and companies holding crypto. Despite the bear market, the firm continues to see month-over-month growth and has originated over $10 million in loans. Now the company is planning to launch a credit card product and an interest-earning savings account for crypto while looking to expand its Wall Street ties.","<strong data-v-f87c67ca=\"\">Savings account and credit card<\/strong>","\"We want to do a credit card in the US that gives you, instead of airline miles, crypto,\" Price said. The firm expects to partner with an established credit card company on the product. It is early days for the potential product. As a first step, the firm will have to show a banking partner there is ample interest from clients.","\"They're going to want to make sure we can get 10,000 people to sign up for it.\"","The firm also plans to offer in 2019 an interest-earning savings account for cryptocurrency. Similarly to a traditional savings account, users would be able to put bitcoin into an account with BlockFi and earn more bitcoin on it.","\"It'll be significantly higher though,\" Prince said, declining to say exactly how high it would be. \"It'll fluctuate and be subsidized in effect by our venture investors.\"","<strong data-v-f87c67ca=\"\">Wall Street opportunities<\/strong>","The roster of investors is no surprise considering many of them work with BlockFi to more effectively trade in crypto markets.","\"We are facilitating institutional borrowing of crypto,\" Prince said. That allows firms to short a given crypto or generate liquidity to conduct trading activities.&nbsp;","On Wall Street, lending services are the bread and butter of so-called prime brokers, which have yet to fully enter the crypto market. Typically, such firms provide margin finance, clearing, and custody services for clients. As Wall Street's middle-men, they provide services that allow big investors to more seamlessly trade across multiple markets without having to deposit money into each exchange. Still, BlockFi doesn't have ambitions to become a full prime broker, but it might dive deeper into Wall Street services in other ways.","\"BlockFi is partnering with firms providing the custody and clearing and we will provide the lending aspect,\" Prince said. The firm plans to expand the number of services it offers its Wall Street clients. \"There are going to be different strategic angles for each of them.\"","\"Coming from the traditional financial markets, we believe there are certain gaps in infrastructure in today’s crypto asset markets that need to be filled in order for the crypto asset industry to grow and attract new participants,\" Colleen Sullivan, head of CMT Digital, said in an emailed statement. \"Loans backed by crypto assets is one of them. We believe the BlockFi team has built the solution to fill this gap.\"","BlockFi previously raised $1.55 million in February from ConsenSys, SoFi, and Kenetic Capital.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Devonshire Investors","content":"ORGANIZATION"},{"type":"$52.5 million","content":"MONEY"},{"type":"$1.55 million","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"Akuna Capital","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Colleen Sullivan","content":"PERSON"},{"type":"$10 million","content":"MONEY"}],"hashtag":["BLOCKFI"],"authors":["Frank Chaparro","The Block"]}