{"summary":"The user was reacting quickly to a situation where another user had unbalanced a Curve pool while losing a similar amount of money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219008\/weird-crypto-quirk-sees-user-turn-1-45-into-2-million","publishDate":"2023-03-11T06:17:59","id":2153,"type":null,"title":"Weird crypto quirk sees user turn $1.45 into $2 million","category":["CRYPTO ECOSYSTEMS"],"content":["Amid the madness of the last 24 hours, with the USDC stablecoin depegging and fears over how much this will impact the wider crypto market, there was a peculiar trade that stood out.","In it, one crypto user <a href=\"https:\/\/etherscan.io\/tx\/0xde46a6bb1fc7834dde4d01428c88f84d65a607f4dc11b7f3dd710e86b7d226a8\" data-v-f87c67ca=\"\">swapped<\/a> $2 million for just $0.05. Another then took advantage of the resulting situation and swapped $1.45 for $2 million. The two users did not directly trade against each other but into a highly illiquid pool of funds.","What happened was the first user tried to make a swap of $2 million of 3CRV tokens — a token that represents three stablecoins — into USDT, as <a href=\"https:\/\/twitter.com\/BowTiedPickle\/status\/1634415551450587138?s=20\" data-v-f87c67ca=\"\">noted<\/a> by Twitter user BowTiedPickle. They used a service called KyberSwap, which aggregates different token swap applications.","This user failed to implement proper slippage protections. This is what stops a trade that's too far below what the user is willing to accept from being executed. It's the same issue that caused a trader earlier this month to lose <a href=\"https:\/\/www.theblock.co\/post\/216487\/trader-makes-error-in-xmon-unlock-strategy-loses-100-of-trade-in-slippage\" data-v-f87c67ca=\"\">all of their funds<\/a> in a trade.","The swap was sent to a highly illiquid pool that hadn't been used in 251 days, BowTiedPickle highlighted. The pool only contained about $2 of liquidity — nowhere near enough to swap $2 million of tokens.","Since this is a Curve pool, the trades are calculated automatically based on pre-defined rules. In this case, the user was awarded $0.05 of USDC, which was then swapped into USDT, and the highly unprofitable trade was complete.","After the trade had taken place, the Curve pool was unbalanced with far too many 3CRV tokens and not enough USDC.","This created an opportunity for whoever was able to strike first. In this case, a second user quickly intervened, <a href=\"https:\/\/etherscan.io\/tx\/0x8a6be1e4db4375c1a1c9d1e5c5fcaa5c255b2d24f5da3de05f3b25d7c3508021\" data-v-f87c67ca=\"\">swapping<\/a> just $1.45 of USDC for the $2 million of 3CRV tokens — bringing the pool back so that it was balanced. All of this is because Curve pools are focused on the ratios between tokens, instead of simply their market value.","The user spent $45 in transaction fees but paid 23 ether ($33,000) in tips to validators that processed the transactions — encouraging them to prioritize the transaction over others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"$33,000","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$45","content":"MONEY"},{"type":"$1.45","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$0.05","content":"MONEY"},{"type":"$2","content":"MONEY"}],"hashtag":["DEXS"],"authors":["Tim Copeland","The Block"]}