{"summary":"Alchemy, the crypto firm that powers dozens of NFT and DeFi platforms with its developer tools, has raised $80 million in a Series B funding round.\nCoatue Management co-led the round alongside Addition LP, which was founded by Lee Fixel, a backer of Stripe, Warby Parker, and Spotify.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103044\/hedge-fund-coatue-billionaire-charles-schwab-back-crypto-infrastructure-firms-80-million-series-b","publishDate":"2021-04-28T10:15:09","id":2155,"type":null,"title":"Hedge fund Coatue Management co-leads crypto infrastructure firm&#x27;s $80 million Series B","category":["Infrastructure"],"content":["Alchemy has raised $80 million in a Series B funding round at a valuation of more than $505 million.","Founded in 2017, <a href=\"http:\/\/Alchemy.com\" data-v-f87c67ca=\"\">the company<\/a> offers projects and companies across the cryptocurrency market — ranging from decentralized exchanges to non-fungible token platforms — with developer tools to build blockchain-based products. Those tools range from node management, handling the communication points within a blockchain network, to its so-called Alchemy monitor, which helps developers view the functionality of apps built on their networks.&nbsp;","\"Our business powers tens of millions of end-users across a broad set of verticals,\" said Alchemy's CEO Nikil Viswanathan, a native of Texas. Viswanathan co-founded the firm with Joe Lau, a former engineer at Google and Pinterest.","Marketing materials shared with The Block compares the firm to Amazon Web Services, which comprises the bulk of the online retailer's business.&nbsp;","The raise, co-led by Coatue Management, a hedge fund with more than $37 billion in assets under management across its funds, will help the firm scale its business and support new blockchains.&nbsp;","\"We’re seeing a lot of exciting growth across the industry, and we’ll be using the new financing to expand to new blockchains and grow internationally,\" Lau said. \"We’re incredibly excited to continue empowering and supporting developers.\"","Coatue notably <a href=\"https:\/\/www.prnewswire.com\/news-releases\/coatue-michael-jordan-kevin-durant-a16z-and-more-than-30-other-nba-and-nfl-players-and-vcs-invest-305-million-in-dapper-labs-makers-of-nba-top-shot-and-flow-blockchain-301258573.html\" data-v-f87c67ca=\"\">led<\/a> the $305 million fundraise for Dapper Lab, the NFT firm behind the popular NBA Top Shot. A source familiar with Coatues' strategy says that they typically bet big when they find an industry on which they're bullish. The secretive fund, which has been shepherded by billionaire Phillippe Laffont, made headlines in 2019 for the launch of a $700 million venture fund. Former Facebook VP Dan Rose <a href=\"https:\/\/www.businessinsider.com\/coatue-management-early-stage-venture-capital-fund-2019-8\" data-v-f87c67ca=\"\">leads the fund<\/a>, and Kris Frederickson, a managing partner, led the round for Coatue.&nbsp;","\"Alchemy's developer platform has been transformative in powering the blockchain industry,\" Frederickson said in a press statement. \"We're excited about businesses that are fundamental building blocks for industries.\"","New additions to the cap table include Addition LP, which was founded by Lee Fixel, the former Tiger Global executive who has backed firms like Stripe, Warby Parker, and Spotify. Past investors include billionaire Charles Schwab.","\"Alchemy is playing a key role in accelerating the development of the blockchain ecosystem,\" Fixel said in a statement shared with The Block. \"Their developer platform powers many of the best companies in the space.\"","Alchemy operates in a corner of the crypto market that has drawn growing interest from investors. Unsurprisingly, many of the industry's infrastructure-focused companies seek to compare themselves to AWS. These include Starkware, the scalability firm which recently announced a $75 million raise, and Bison Trails, which was <a href=\"https:\/\/www.theblockcrypto.com\/post\/91684\/coinbase-aquisition-bison-trails-infrastucture\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">acquired<\/a> by the publicly traded crypto exchange Coinbase.","Nor is it surprising that crypto firms have set their sights on AWS as a model, given that the <a href=\"https:\/\/www.geekwire.com\/2021\/amazon-web-services-posts-record-13-5b-profits-2020-andy-jassys-aws-swan-song\/#:~:text=Amazon%20Web%20Services%2C%20the%20cloud,%25%20year%2Dover%2Dyear.\" data-v-f87c67ca=\"\">business<\/a> hauled in some $13.5 billion in operating profits last year.&nbsp;","Still, Alchemy says its differentiator is broader from a product perspective. The company also highlighted how 70% of the world's most-used Ethereum apps use Alchemy's technology.&nbsp;","\"Alchemy powers the major players in the blockchain industry,\" Viswanathan said.&nbsp; <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">\"<\/span>We’ve spent years developing technology to provide the only comprehensive platform enabling developers to build products used by millions.\"","Indeed, the firm says it has grown 97x in the last eight months, buoyed by the surge in activity in the NFT market.","As noted in a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-03-21\/nfts-mushroom-into-billion-dollar-market-with-help-from-alchemy\" data-v-f87c67ca=\"\">profile<\/a> by Bloomberg News, the firm powers nearly every major NFT market including OpenSea, Dapper Labs, SuperRare, and Zora.&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:&nbsp;<\/strong>This report and its headline have been amended to reflect that Charles Schwab is an existing investor in Alchemy and did not participate in the latest founding round.<\/em>"],"hashtag":[]}