{"summary":"El Salvador&#x27;s leaders still don&#x27;t think the market conditions are right for the launch of the nation&#x27;s much-hyped bitcoin bond.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149872\/el-salvador-still-not-ready-to-launch-bitcoin-bond-finance-minister-says","publishDate":"2022-06-02T13:16:14","id":2155,"type":null,"title":"El Salvador still not ready to launch bitcoin bond, finance minister says","category":["CENTRAL BANKS"],"content":["El Salvador's leaders still do not think it is the right time to launch its highly-anticipated bitcoin bond, finance minister Alejandro Zelaya said during a national television news show on June 1, citing market conditions following the war between Russia and Ukraine.&nbsp;","Initially, the $1 billion bond was supposed to launch between March 15 and March 20. But on March 22, Zelaya explained that the country was still waiting for the right time to launch them due to conditions including the war. At the time, the government still had yet to finalize legislation around a framework for regulating digital assets.&nbsp;","Meanwhile, economists have raised concerns about the country's ability to raise funds to cover its impending financial obligations, including an $800 million bond that will mature in January. \"And as of now, the country is not guaranteed to get that money,\" Central American Institute for Fiscal Studies (ICEFI) economist Ricardo Castaneda told The Block in a recent voice note. All in all, he estimates that the country needs to find about $3 billion when also considering the gap between income and expenses through 2024.","Zelaya also said during the interview that talks between El Salvador and the International Monetary Fund (IMF) are ongoing and that there will be an update in the coming weeks.&nbsp;&nbsp;","Analysts have raised questions about El Salvador's strategy of continuing to purchase bitcoin considering recent price drops in the currency, estimating that the country has lost more than <a href=\"https:\/\/nayibtracker.com\/\" data-v-f87c67ca=\"\">$35 million<\/a> on its investments based on current prices and the value of bitcoin at the time of purchase. El Salvador purchased a fresh round of 500 bitcoin on May 9 during a price drop, bringing its total government purchases to 2,301 bitcoins.","The mechanics of El Salvador's bitcoin transactions have not been totally clear. When asked whether the country has sold any bitcoin, Zelaya said that \"a part\" of the country's bitcoin was sold to fund the Chivo Pets pet hospital. Bukele has said that the project was funded with a $4 million \"surplus\" based on fluctuations in bitcoin prices. Zelaya mentioned the role of the country's bitcoin trust fund, which allows the country to maintain both U.S. dollars and bitcoin.","Zelaya then maintained that the country is holding onto its bitcoin. \"We are not selling the coins that we have bought in this moment,\" he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 1","content":"DATE"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Alejandro Zelaya","content":"PERSON"},{"type":"Zelaya","content":"PERSON"},{"type":"Central American Institute for Fiscal Studies (ICEFI","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"March 15","content":"DATE"},{"type":"March 22","content":"DATE"},{"type":"March 20","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"May 9","content":"DATE"},{"type":"$800 million","content":"MONEY"},{"type":"Ukraine","content":"LOCATION"},{"type":"Ricardo Castaneda","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Kristin Majcher","The Block"]}