{"summary":"Ledger’s new feature allows U.S. customers to buy crypto using their linked PayPal account.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245729\/ledger-launches-paypal-integration-for-buying-bitcoin-and-ether","publishDate":"2023-08-16T10:51:47","id":2158,"type":null,"title":"Ledger launches PayPal integration for buying bitcoin and ether","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Crypto security firm Ledger announced a new integration that permits U.S. customers to buy cryptocurrencies like bitcoin, ether and litecoin using their PayPal account, the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">The Paris-based blockchain company said U.S. customers using its Ledger Live app will — while subject to “applicable state law” — be able to buy crypto without verification if they have already purchased digital currency using PayPal.<\/span>","<span data-v-f87c67ca=\"\">“Both PayPal and Ledger are focused on creating secure, seamless, and fast transactions no matter where you are in the world,” said Pascal Gauthier, chairman and CEO of Ledger. “Ledger is committed to simplifying the world of crypto and PayPal is committed to making the movement of money as simple, reliable and affordable as possible.”<\/span>","<span data-v-f87c67ca=\"\">Both Ledger and PayPal have been recently expanding their interests in crypto. PayPal recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/243766\/paypal-stablecoin-threatens-basic-crypto-tenets-but-also-poses-upside\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> a U.S. stablecoin, while Ledger <\/span><a href=\"https:\/\/www.theblock.co\/post\/236835\/ledger-launches-custodial-trading-network-for-institutions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rolled <\/span><span data-v-f87c67ca=\"\">ou<\/span><\/a><span data-v-f87c67ca=\"\">t a new trading network for institutions named Tradelink.<\/span>","Founded in 2014 and best-known for hardware wallets, Ledger is among Europe’s biggest crypto businesses."],"hashtag":[]}