{"summary":"An update on crypto taxation is due to be published on March 30 by the U.K. government\nThere is expected to be fresh guidance on interest earned through lending crypto and staking","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99517\/uk-taxman-fresh-guidance-crypto","publishDate":"2021-03-26T10:10:42","id":2159,"type":null,"title":"UK tax authority to publish new guidance on crypto next week","category":["Tax"],"content":["HM Revenue &amp; Customs, the United Kingdom’s tax authority, will publish new guidance on cryptocurrency taxation next week.","The update, due March 30, will consolidate two existing pieces of guidance on crypto tax into a single “crypto manual”, according to people with knowledge of the situation. They said the move is an attempt to “future proof” further guidance, which they said could be updated multiple times over the next year.","The same sources expect fresh guidance from the taxman on yield earned by lending out cryptocurrencies – which startups like BlockFi have made increasingly popular – and on staking, through which crypto holders earn rewards for helping to maintain proof-of-stake blockchains.&nbsp;","In a statement sent to The Block, a spokesperson for HMRC confirmed it would soon be publishing “a new internal manual” containing guidance on crypto tax.","“The guidance manual demonstrates our commitment to providing clarity to our customers and will help individuals and businesses understand the tax consequences of different types of transactions in crypto assets. This builds on the previously published policy papers and will provide a more flexible approach to updating customers in this fast-moving sector,” they added.","To date, HMRC has published two separate documents offering advice on crypto taxation on <a href=\"https:\/\/www.gov.uk\/government\/publications\/tax-on-cryptoassets\" data-v-f87c67ca=\"\">its website<\/a> – one for individuals and the other for businesses. The guidance was last updated in December 2019.","Nimesh Shah, CEO of tax consultancy Blick Rothenberg, told The Block that the thrust of the most recent guidance was “for the majority of people, gains on cryptocurrencies are going to be treated as capital gains” – a rate of 20%. Those actively trading cryptocurrencies, however, would be subject to income tax at the higher rate of 40% or 45%.","HMRC’s <a href=\"https:\/\/www.gov.uk\/government\/publications\/tax-on-cryptoassets\/cryptoassets-for-individuals\" data-v-f87c67ca=\"\">2019 guidance<\/a> also stated that individuals would be liable to pay income tax and national insurance contributions on crypto received from an employer as a form of payment or through mining, transaction confirmation or airdrops.","The crypto sector has changed significantly since then.","One area insiders expect to be addressed in the coming months is decentralized finance, a market that has grown significantly over the past year. DeFi Pulse, an analytics site, shows the value of the DeFi space has grown from roughly $650 million this time last year <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">to around $40 billion today<\/a>.","In addition to the rise of DeFi and, even more recently, non-fungible tokens (NFTs), prices in the crypto sector have soared over the past six months – with bitcoin hitting all-time highs of approximately $60,000 in early March."],"hashtag":["HMRC"]}