{"summary":"Musk takes the reins at Twitter after finalizing the $44 billon acquisition.\nMeta has posted losses of $9.4 billion on its metaverse division so far this year.\nGoogle Cloud began a fully managed node hosting service for Ethereum.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181118\/here-are-the-five-biggest-crypto-stories-of-the-past-week","publishDate":"2022-10-29T10:27:32","id":2166,"type":null,"title":"Here are the five biggest crypto stories of the past week","category":["Blockchain"],"content":["<span data-v-f87c67ca=\"\">No week in crypto goes without eye-catching headlines. Crypto news in the past week saw a continuation of some familiar as well as new trends. Some of the notable items included Elon Musk’s takeover of Twitter, Meta’s dwindling financials, Google’s foray into Ethereum blockchain node services as well the severe impact of the crypto market on venture funds. To summarize, here are the stories that got us talking last week:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Elon Musk<\/span> <a href=\"https:\/\/www.theblock.co\/post\/180725\/musk-at-last-takes-over-twitter-reports\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">completed<\/span><\/a><span data-v-f87c67ca=\"\"> the Twitter acquisition deal. The tech entrepreneur and Tesla CEO took the reins at Twitter as well, entering the firm's headquarters with what appeared to be a bathroom sink. The billionaire even changed his Twitter bio to \"Chief Twit.\"<\/span>","<span data-v-f87c67ca=\"\">After trying to back out of the deal in July and being sued by Twitter, Musk reversed his position last month, saying that he did indeed want to move forward with the acquisition. Still, Musk’s takeover comes at a time when the microblogging platform is struggling to keep its most active users, according to a Reuters <a href=\"https:\/\/www.theblock.co\/post\/179802\/twitter-struggling-to-keep-its-most-active-users-reuters\" data-v-f87c67ca=\"\">report<\/a>.<\/span>","<span data-v-f87c67ca=\"\">A<\/span> major <a href=\"https:\/\/www.theblock.co\/post\/180752\/binance-confirmed-as-investor-in-twitter-takeover-as-musk-reportedly-plans-to-take-reins-as-ceo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">revelation<\/span><\/a><span data-v-f87c67ca=\"\"> regarding this deal came with Binance, the biggest crypto exchange by volume, saying it's now a part owner at Twitter. Binance committed $500 million to invest in the $44 billion acquisition, The Block reported. \"Our initial commitment remains the same and we look forward to exploring opportunities to grow the partnership in the future,\" a Binance spokesperson told The Block.<\/span>","<span data-v-f87c67ca=\"\">As far as crypto goes, there are expectations that the platform may pivot to adding more blockchain features.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Social media giant Meta, formerly known as Facebook,<\/span> <a href=\"https:\/\/www.theblockresearch.com\/analysis-of-metas-f-k-a-facebook-q322-earnings-180248\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> a third-quarter earnings report that disclosed staggering losses. The company said that its metaverse division, Reality Labs, posted a $3.7 billion loss. Year-to-date, the division has totaled losses of<\/span> <a href=\"https:\/\/www.theblock.co\/post\/180126\/metas-metaverse-losses-top-9-4-billion-for-the-year\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$9.4 billion<\/span><\/a><span data-v-f87c67ca=\"\">. This prompted major selloffs of the company’s stock and its market capitalization dropped to less than $300 billion.<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/143327\/meta-is-opening-a-metaverse-inspired-brick-and-mortar-store\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Meta<\/span><\/a><span data-v-f87c67ca=\"\"> said that it does not “anticipate that Reality Labs operating losses” will increase significantly next year. Meta is the world’s largest social media company, overseeing platforms including Facebook, Instagram, and WhatsApp. Outside of Reality Labs, Meta continues to generate robust advertising revenue quarter after quarter with its core apps businesses.<\/span>","<span data-v-f87c67ca=\"\">In October of 2021, Facebook rebranded to Meta, embracing metaverse technology at the height of its popularity. The metaverse is a virtual space where users can interact with one another and own various assets. While still an abstract concept, the metaverse is often discussed interchangeably with crypto, NFTs and blockchain technology.<\/span>","<span data-v-f87c67ca=\"\">The cloud division of tech giant Google forayed into public blockchain infrastructure services, starting with Ethereum. On Friday, Google Cloud<\/span> <a href=\"https:\/\/www.theblock.co\/post\/180458\/google-cloud-announces-blockchain-node-service-starting-with-ethereum\" data-v-f87c67ca=\"\">start<span data-v-f87c67ca=\"\">ed<\/span><\/a><span data-v-f87c67ca=\"\"> a fully managed node hosting service called \"<\/span><a href=\"https:\/\/cloud.google.com\/blog\/products\/infrastructure-modernization\/introducing-blockchain-node-engine\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blockchain node engine.<\/span><\/a><span data-v-f87c67ca=\"\">\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The node engine is designed for web3 developers, allowing them to deploy smart contracts and write data on a dedicated node. A blockchain node hosts and synchronizes a copy of the network's transaction history. As such, this product aims to streamline the process of setting up nodes, as well as the complications of hosting them on your own hardware.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Google's first supported blockchain for node engine is Ethereum, though the firm has shown interest in providing additional support for other blockchains in the future. Google began<\/span> <a href=\"https:\/\/www.theblock.co\/linked\/145519\/google-is-building-a-web3-focused-team\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">assembling<\/span><\/a><span data-v-f87c67ca=\"\"> a web3-focused team earlier this year, eyeing the development of hosted services for blockchain developers. Earlier this month, the search engine giant began to natively support data for Ethereum wallet balances.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The bear market is taking its toll on some of the industry’s biggest venture firms. Take for example, Pantera Capital, a notable crypto venture firm that has had a bad year. Pantera's early stage token fund fell 71% in value through the end of September,<\/span> <a href=\"https:\/\/www.theblock.co\/post\/180381\/pantera-capitals-early-stage-token-fund-is-down-71-this-year-exclusive\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to<\/span><\/a><span data-v-f87c67ca=\"\"> an investor presentation obtained by The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The news comes at a time when many tokens and cryptocurrencies are down by more than 50% amid depressed macro market sentiment. And it’s not just Pantera. Andresen Horowitz (A16z), one of the largest crypto investors, has seen a<\/span>&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/179956\/a16z-flagship-crypto-fund-dropped-value-wsj\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">40% drop<\/span><\/a><span data-v-f87c67ca=\"\"> in value for its flagship crypto fund, the WSJ reported.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MakerDAO, the issuer of DAI stablecoin, passed a <\/span><a href=\"https:\/\/vote.makerdao.com\/polling\/QmTmS5Nf#vote-breakdown\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">governance vote<\/span><\/a><span data-v-f87c67ca=\"\"> to break its project into multiple organizations. This marks a big change for one of crypto's largest decentralized autonomous organizations (DAOs). <\/span><span data-v-f87c67ca=\"\">The MakerDAO community on Monday passed a proposal called “Endgame” and with it set the stage for a new governance architecture for the DAO. Endgame, when implemented, will break up MakerDAO into smaller clusters called “MetaDAOs.”<\/span>","<span data-v-f87c67ca=\"\">MetaDAOs will function independently from one another and have their own parallel governance structures. This will lead to separate tokens and decision-making architecture for each MetaDAO. While the vote passed, some community members<\/span> <a href=\"https:\/\/www.theblock.co\/post\/180991\/maker-founder-uses-influence-to-pass-vote-that-breaks-up-the-dao\" data-v-f87c67ca=\"\">sai<span data-v-f87c67ca=\"\">d<\/span><\/a><span data-v-f87c67ca=\"\"> MakerDAO's founder Rune Christensen wielded undue influence over it. That’s because more than 70% of the “yes” votes cast by delegates were from voting blocs with ties to the Maker founder, which raised issues about governance centralization.<\/span>","<span data-v-f87c67ca=\"\">Some DAO members voting in opposition accused Christensen of “organization capture” —&nbsp; a situation where a special interest takes precedence over the general interest of a group.<\/span>"],"hashtag":["CRYPTO","GOOGLE","TWITTER"]}