{"summary":"Crypto exchange Bitmex said that it will continue with plans to launch its native token, BMEX, on Friday, regardless of market volatility.\nBitmex is “not exposed to either Alameda nor FTX nor FTT,” the firm’s head of business development and partnerships said.\n“The new token is not something we are putting out there in order to pay for lunch,” she said. ","author":["Sam Venis","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184955\/bitmex-to-proceed-with-token-launch-says-no-exposure-to-ftx","publishDate":"2022-11-09T14:24:11","id":2169,"type":null,"title":"Bitmex to proceed with token launch, says no exposure to FTX","category":["Exchanges"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Crypto exchange Bitmex, which says it has no FTX or Alameda exposure, plans to launch a native crypto token for traders on Friday, regardless of market volatility amid the collapse of Sam Bankman-Fried's empire.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">\"We're sticking to our program,\" Salama Belghali, Bitmex’s global head of business development and partnerships said at a conference. \"The new token is not something we are putting out there in order to pay for lunch.\"<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Belghali also said that Bitmex is \"not exposed to either Alameda nor FTX nor FTT,\" she said. \"We actually have very strict guidelines. We are safe.\"<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The comments come as crypto markets have been in chaos following the news that Binance may buy FTX upon the latter's token collapse. The firm announced last week that it will <a href=\"https:\/\/www.theblock.co\/post\/181814\/crypto-exchange-bitmex-cuts-part-of-workforce-following-ceo-departure-exclusive\" data-v-f87c67ca=\"\">reduce its headcount <\/a><\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">as part of a pivot away from its “beyond derivatives” strategy. The layoffs came shortly after CEO Alexander Höptner departed from his role.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559685&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Bitmex's move to refocus on derivatives to regain market share means “our disadvantage has become our advantage\" after the FTX collapse, she said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Bitmex was once considered a leader in cryptocurrency derivatives, claiming 35% of the open interest across bitcoin futures, according to data from The Block Research. Now it only holds about 2% of market share, and companies such as <\/span><a href=\"https:\/\/www.theblock.co\/linked\/82144\/cme-surpasses-bitmex-bitcoin-futures\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">CME Group<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> and, until recently, FTX, hold the majority of market share.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Correction: This story has been updated to reflect that Bitmex has not released the size of its possible staff reduction.&nbsp;<\/em>"],"hashtag":[]}