{"summary":"Colorado state regulators claim that INDXcoin, a cryptocurrency that aims to bring its holders richer and closer to God, is actually worthless.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273649\/denver-pastor-behind-alleged-crypto-scam-says-300k-home-remodel-was-gods-idea","publishDate":"2024-01-20T18:10:10","id":217,"type":null,"title":"Denver pastor behind alleged crypto scam says $300k home remodel was God’s idea","category":["POLICY"],"content":["Eli Regalado, the Denver pastor who’s being sued along with his wife by Colorado’s securities commission for selling millions of dollars in ‘valueless’ INDXcoin cryptocurrency, has responded to the allegations in the lawsuit in a video uploaded to INDXcoin’s community forum.&nbsp;","In <a href=\"https:\/\/community.indxcoin.com\/c\/indxcoin-updates\/lawsuit-response\" data-v-f87c67ca=\"\">the video<\/a>, Pastor Eli Regalado admits that the investors into the cryptocurrency run by himself and his wife Kaitlyn currently have no way to cash out the funds they have invested.","“We launched an exchange, the exchange technology failed, things went downhill, and from that point forward we’ve just been waiting on the Lord literally for a miracle,” Regalado says.&nbsp;","Both Regalados <a href=\"https:\/\/www.facebook.com\/100080353947508\/posts\/pfbid02588iTUKykQzDScRuANChQ9bSV3DcQv3eY3NV4EshxEiXdwJdXL1sR7i5BrwwaoESl\/?\" data-v-f87c67ca=\"\">claim<\/a> to be ordained ministers with Destiny Churches and Ministries International, according to a post on the Facebook page for their online-only Victorious Grace Church. Destiny Churches has <a href=\"https:\/\/www.facebook.com\/100064713577764\/posts\/pfbid0zNvbDz326cUUez1f3zKVH43j7JURhoRdTwZ56fkNLfx8nAZ97WxiMYQLYMqxoEGXl\/?\" data-v-f87c67ca=\"\">promoted<\/a> INDXcoin on its own Facebook page to its 1,000 followers.&nbsp;","The Regalados are accused of cashing out INDXcoin funds in order to spend lavishly on a Range Rover, jewelry, luxury handbags, and more, <a href=\"https:\/\/businessden.com\/2024\/01\/18\/pastor-pocketed-1-3m-selling-worthless-cryptocurrency-state-says\/\" data-v-f87c67ca=\"\">according to BusinessDen<\/a>, while telling the investors the funds would go to causes helping widows and orphans.&nbsp;","“The charges are that Kaitlyn and I pocketed $1.3 million…those charges are true,” Regalado says in the video. “Out of that 1.3, half a million dollars went to the IRS and a few hundred thousand dollars went to a home remodel the Lord told us to do.”","Regalado says he hopes a divine miracle will make investors whole. “We sold a cryptocurrency with no clear exit, and so the prosecutors have to take that and say ‘These people willingly sold a cryptocurrency with no clear exit’…we did do this,” says Regalado. “What we’re praying for, and what we’re believing for still, is that God is going to…work a miracle in the financial sector, He is going to bring a miracle into INDXcoin. Everyone that has come in for money is going to be able to receive money back.”&nbsp;","The comments under the post are largely supportive. “You are so brave to put this video out…God is leading all of us and God will get all the glory,” declares one commenter. “We agree 1o0%,” Regalado replied.&nbsp;","Judge David Goldberg has frozen the bank accounts of the Regalados and their associated businesses at the request of state regulators following the civil complaint. The Regalados are due in Colorado District Court on January 29th for an initial hearing.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Regalado","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.3 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"David Goldberg","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Denver","content":"LOCATION"},{"type":"a million dollars","content":"MONEY"},{"type":"1o0%","content":"PERCENT"},{"type":"Colorado","content":"LOCATION"},{"type":"Colorado District Court","content":"ORGANIZATION"},{"type":"Destiny Churches","content":"ORGANIZATION"},{"type":"Ministries International","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Kaitlyn","content":"PERSON"},{"type":"Victorious Grace Church","content":"ORGANIZATION"},{"type":"Eli Regalado","content":"PERSON"}],"hashtag":["LAWSUITS"],"authors":["Zack Abrams","The Block"]}