{"summary":"Ankr launched Rollup-as-a-Service testnet support for zkSync Hyperchains, enabling developers to deploy independent Layer 2s for their dApps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266082\/ankr-launches-rollup-as-a-service-for-zksync-hyperchains","publishDate":"2023-12-05T11:00:04","id":2171,"type":null,"title":"Ankr launches Rollup-as-a-Service for zkSync Hyperchains","category":["INFRASTRUCTURE"],"content":["Web3 infrastructure provider Ankr has launched Rollup-as-a-Service (RaaS) support for zkSync Hyperchains built using the ZK Stack, in collaboration with Matter Labs.&nbsp;","Ankr claims to be the first to release such a service, enabling developers to customize and deploy scalable and secure independent Layer 2 chains for their decentralized applications more easily, according to a statement.","zkSync developer Matter Labs <a href=\"https:\/\/www.theblock.co\/post\/236322\/zksync-matter-labs-releases-zk-stack-for-building-hyperchains\" data-v-f87c67ca=\"\">released<\/a> the ZK Stack for building Hyperchains in June, providing an open-source modular framework for building sovereign ZK-powered chains. The goal is to create a network of interconnected blockchains using zero-knowledge proofs that exist as Layer 2s alongside, or Layer 3s running on top of, the zkSync Era chain.","Ankr clients can now use its RaaS to create dedicated blockchains to serve specific use cases, though functionality to deploy the Hyperchains is currently confined to a testnet environment.","\"Hyperchains from ZK Stack have the potential to become one of the most powerful rollup options available for developers,\" Ankr Senior Product Manager Kev Silk said. \"The distinctive scalability and security features, in addition to the seamless customization and deployment from Ankr’s Rollup as a Service, will make Hyperchains an important evolution for the Layer 2 space as a whole.\"","\"Ankr's Rollup-as-a-Service will reduce development time for projects and enterprises looking to deploy Hyperchains and allow teams to focus on their unique use cases enabled through ZK Stack while simultaneously speeding up time to market,\" Matter Labs SVP of Business and Operations Marco Cora added.&nbsp;&nbsp;","In October, hybrid crypto exchange GRVT said it would <a href=\"https:\/\/www.theblock.co\/post\/258727\/hybrid-crypto-exchange-grvt-zksync-hyperchain\" data-v-f87c67ca=\"\">launch<\/a> the first Hyperchain in the zkSync ecosystem.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Service","content":"ORGANIZATION"},{"type":"Marco Cora","content":"PERSON"},{"type":"Hyperchains","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kev Silk","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["DEVELOPER TOOLS","ZKSYNC"],"authors":["James Hunt","The Block"]}