{"summary":"Maple Finance raised $5 million in strategic funding co-led by BlockTower Capital and Tioga Capital. \nMaple will use the funds to expand across Latin America and the Asia-Pacific and to create new partnerships.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246867\/blocktower-co-leads-5-million-strategic-funding-round-for-defi-lender-maple-finance","publishDate":"2023-08-22T15:22:36","id":2172,"type":null,"title":"BlockTower co-leads $5 million strategic funding round for Maple Finance","category":["Deals"],"content":["DeFi lending protocol Maple Finance said Tuesday that it raised $5 million in new strategic funding.&nbsp;","BlockTower Capital and Tioga Capital led the fundraise, which saw additional participation from Cherry Ventures, The Spartan Group, GSR Ventures, Veris Ventures, Maven 11 Capital and Framework Ventures, the company <a href=\"https:\/\/twitter.com\/maplefinance\/status\/1693975202365903138\" data-v-f87c67ca=\"\">wrote<\/a> on social media.","Maple Finance will use the funds to bolster expansion in Latin America and the Asia-Pacific, as well as to create new partnerships with other protocols, financial services providers and credit experts.&nbsp;","\"The funding round initiates a multi-year, comprehensive growth roadmap designed to see Maple establish itself beyond DeFi and into the world of traditional finance as a leading lending marketplace and technology provider,\" Maple Finance <a href=\"https:\/\/maple.finance\/news\/maple-closes-strategic-funding-round\/\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","The platform has over $2.2 billion worth of total loans issued and over $45 million in total assets deposited, according to the firm's website.&nbsp;","\"Our mission remains clear — to bridge the web3 and traditional finance industries with a robust, on-chain capital infrastructure that sets new standards and creates opportunities for the entire ecosystem,\" Maple Finance CEO and c0-founder Sidney Powell said."],"hashtag":["STRATEGIC INVESTMENTS"]}