{"summary":"Texas Democrat Beto O’Rourke returned a $1 million donation from former FTX CEO Sam Bankman-Fried, his campaign said.\nO’Rourke, who lost the race for governor earlier this month, is the latest politician to distance himself from Bankman-Fried after FTX filed for bankruptcy protection.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190643\/beto-orourke-returns-1-million-donation-from-sam-bankman-fried-texas-tribune","publishDate":"2022-11-29T13:16:38","id":2173,"type":null,"title":"Beto O’Rourke returns $1 million donation from Sam Bankman-Fried: Texas Tribune","category":["Policy"],"content":["Texas Democrat Beto O’Rourke is the latest politician to ditch a political donation from former FTX CEO Sam Bankman-Fried.","The former congressman and gubernatorial candidate returned a $1 million donation from Bankman-Fried, according to <a href=\"https:\/\/www.texastribune.org\/2022\/11\/29\/beto-orourke-sam-bankman-fried-ftx\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">The Texas Tribune<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","O’Rourke’s campaign claims it never asked for the money and returned the cash a week before FTX filed for bankruptcy. The campaign’s decision to reject the cash was made before the FTX collapse began, with the campaign telling the Texas publication that records would show the money was returned Nov. 4, before the troubled company began to publicly unravel.&nbsp;","“This contribution was unsolicited,” O’Rourke spokesperson Chris Evans told the Tribune.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","FTX filed for bankruptcy protection earlier this month, after a run on its native utility token. The massive crypto exchange shocked the industry and sent crypto markets plunging. Bankman-Fried, a prolific political donor during the 2022 midterm cycle, resigned as CEO when his firm filed for bankruptcy protection.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A month before the crypto exchange fell apart, Bankman-Fried made the $1 million donation to O’Rourke’s campaign on Oct. 11. The Texas Democrat lost his bid for governor against GOP Gov. Greg Abbott earlier this month.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","O’Rourke also received a $100,000 donation from Nishad Singh, another FTX official. The campaign did not say whether it will return Singh’s money.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A number of politicians have <a href=\"https:\/\/www.theblock.co\/post\/188810\/lawmakers-weigh-what-to-do-with-sam-bankman-frieds-political-cash-after-ftxs-collapse\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">distanced<\/span><\/a> themselves from Bankman-Fried in recent weeks. Reps. Chuy Garcia, D-Ill., and Kevin Hern, R-Okla., were among the first lawmakers to donate the former FTX boss’s contributions to charity.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":[]}