{"summary":"A top Ukrainian regulator tells The Block the country’s planning to make legal demands on crypto exchanges.\nThe goal is to restrict access to cryptocurrency for all Russian citizens following last week’s military invasion.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135619\/ukraine-to-issue-legal-demands-on-crypto-exchanges-to-freeze-russian-accounts","publishDate":"2022-02-28T07:49:42","id":2175,"type":null,"title":"Ukraine to issue legal demands on crypto exchanges to freeze Russian accounts","category":["Startups"],"content":["Ukraine plans a legal push to force crypto exchanges to freeze Russian accounts following Russia's invasion of its neighbor.&nbsp;&nbsp;","After Mykhailo Fedorov, vice prime minister and minister of digital transformation of Ukraine, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/135585\/ukraine-minister-calls-on-crypto-exchanges-to-freeze-russian-accounts\" data-v-f87c67ca=\"\">called on<\/a> exchanges to block the accounts of both Russian and Belarusian users yesterday, many said they were unable to comply without legal cover.&nbsp;Kraken CEO Jesse Powell, for one, <a href=\"https:\/\/twitter.com\/jespow\/status\/1498112741684363265\" data-v-f87c67ca=\"\">said<\/a> the exchange “cannot freeze the accounts of our Russian clients without a legal requirement to do so.” Similarly, Binance <a href=\"https:\/\/www.reuters.com\/technology\/crypto-exchange-binance-says-it-wont-unilaterally-freeze-accounts-russia-2022-02-28\/\" data-v-f87c67ca=\"\">told Reuters<\/a> that it was “not going to unilaterally freeze millions of innocent users' accounts.”","Now, Ukraine is upping the pressure.","“We plan to make legal demands. We are preparing letters,” Yulia Parkhomenko, head of the virtual assets expert group at the Ministry of Digital Transformation of Ukraine, told The Block. When asked whether it was right to target Russian citizens — particularly with many opposing the war —&nbsp;Parkhomenko said, “This is a necessary measure. There is no way to identify who is financing the war and who is not.”","While Powell said that such a legal requirement was necessary before the exchange could restrict accounts, he appeared to be against the move, arguing that many of Kraken’s customers were likely anti-war. He claimed that crypto goes beyond borders and that crypto users should not “have to worry about being caught in broad, indiscriminate wealth confiscation.\"","Powell has previously encouraged his following to consider <a href=\"https:\/\/www.theblockcrypto.com\/linked\/134701\/canada-protests-kraken-ceo-says-users-should-consider-taking-crypto-off-exchanges\" data-v-f87c67ca=\"\">taking their crypto<\/a> off exchanges — including Kraken&nbsp;— if they’re worried about legal enforcement. At the time, he said, \"If you're worried about it, don't keep your funds with any centralized\/regulated custodian. We cannot protect you.\"","While asking crypto exchanges to block Russian accounts, Ukraine has been adopting crypto for its own benefit. So far, it has received more than $9 million in crypto donations.","","","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BINANCE","KRAKEN"]}