{"summary":"Skew has raised $5 million in fresh capital, led by Octopus Ventures\nThe firm has also launched a trade execution platform for institutional investors \nSkew co-founder and CEO Emmanuel Goh told The Block: “The goal is to become more like a Bloomberg for crypto – data meets trading.” ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63370\/crypto-data-provider-skew-raises-5m-in-fresh-funding-launches-trade-execution-platform","publishDate":"2020-04-29T07:00:15","id":2177,"type":null,"title":"Crypto data provider Skew raises $5M in fresh funding, launches trade execution platform","category":["Investments"],"content":["Crypto derivatives data provider Skew has raised $5 million in a new round of financing.&nbsp;","The round was led by Octopus Ventures, with participation from Digital Currency Group and other existing investors such as Firstminute Capital and Seedcamp.","With the fresh capital in place, London-based Skew looks to expand its engineering team and improve its distribution strategy.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSkew has today also expanded its business line, by launching a new trade execution platform called skewTrading. It allows institutional investors to access liquidity across crypto markets.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSpecifically, skewTrading connects institutional investors with market makers across listed and OTC (over-the-counter) products, including spot as well as futures and options.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTo begin with, the platform is supporting OTC execution of CME Group's block trades for bitcoin futures and bitcoin options.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWith today's new platform launch, Skew now operates two key products - its flagship data product skewAnalytics and skewTrading.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, Skew has partnered with London-based regulated inter-dealer broker Kyte Broking for the new platform, by becoming its appointed representative with the UK Financial Conduct Authority.","Skew said Kyte executed over $10 trillion notional of exchange-listed derivatives contracts in 2019 and has nearly 3,000 institutional clients.","Skew, on the other hand, has over 1,000 corporate users from more than 600 companies for its skewAnalytics product. The firm said the product’s professional user base has more than doubled since mid-February.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSharing an overall vision for Skew ahead, co-founder and CEO Emmanuel Goh told The Block: \"The goal is to become more like a Bloomberg for crypto - data meets trading.\"&nbsp;&nbsp;","Today’s round brings Skew’s total funding to date to $7 million since founding in September 2018. Last year, the firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/40950\/skew-raises-2m-to-build-out-its-cryptocurrency-derivatives-data-platform\" data-v-f87c67ca=\"\">raised<\/a> $2 million to build its skewAnalytics product.&nbsp;"],"hashtag":[]}