{"summary":"Binance co-founder and CEO Changpeng Zhao will step down from the company amid a DOJ settlement and ongoing regulatory woes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo","publishDate":"2023-11-21T14:08:39","id":2178,"type":null,"title":"Changpeng &#x27;CZ&#x27; Zhao to step down as Binance CEO as part of plea deal with DOJ","category":["EXCHANGES"],"content":["Binance co-founder Changpeng Zhao, commonly known as \"CZ,\" will step down as the CEO of the company as part of a plea deal with the U.S. Department of Justice, according to court filings unsealed on Tuesday.&nbsp;","Zhao will plead guilty to violating and causing a financial institution to violate the Bank Secrecy Act, according to the filing. He'll agree to a $50 million fine.","Binance will also plead guilty to three counts including conspiring to knowingly conduct, control, manage, supervise, direct, and own all or part of an unlicensed money transmitting business; conducting, controlling, managing, supervising, directing, and owning all or part of an unlicensed MTB affecting interstate and foreign commerce; knowingly and willfully causing the exportation, sale, and supply, directly and indirectly, from the United States, and by a United States person, wherever located, of services to Iran, without first having obtained the required authorization or license from the U.S. Department of the Treasury’s Office of Foreign Assets Control.","\"Defendant Binance has accepted the resignation of Zhao, its CEO, and prohibited him from any present or future involvement in operating or managing Defendant’s business. This prohibition begins as of plea acceptance and ends three years from the date a monitor is appointed,\" the filing read.","Binance will cooperate with the government \"in any and all matters relating to the conduct\" described in the agreement. It will also agree to a fine of $1.8 billion.&nbsp;","Binance will also consent to a forfeiture order requiring it to pay $2.5 billion. The company did not immediately respond to requests for comment from The Block.","Binance's <a href=\"https:\/\/www.theblock.co\/price\/248351\/bnb-bnb\" data-v-f87c67ca=\"\">BNB<\/a> token fell 6.7% on Tuesday, falling to $239.99 at 2:18 p.m. ET.","The DOJ's <a href=\"https:\/\/www.theblock.co\/post\/193988\/justice-department-weighs-charging-binance\" data-v-f87c67ca=\"\">investigation<\/a> into Binance, Zhao and other top executives has been running since 2018 and spans prosecutors across three different offices, including the Money Laundering and Asset Recovery Section, the U.S. Attorney’s Office for the Western District of Washington in Seattle and the National Cryptocurrency Enforcement Team.","Binance and the DOJ were <a href=\"https:\/\/www.wsj.com\/finance\/currencies\/the-worlds-biggest-crypto-firm-is-melting-down-338b8e17\" data-v-f87c67ca=\"\">reportedly<\/a> talking for months and internally there had been discussions on whether Zhao should step down, with his prior insistence on remaining in charge frustrating some executives who believed it would aid the company’s chances of surviving.","The DOJ has also been investigating Binance relating to possible violations of U.S. sanctions on Russia following the Russian-Ukrianian war. Binance <a href=\"https:\/\/www.theblock.co\/post\/253146\/binance-fully-exits-russia-amid-legal-risks-sells-business-to-commex\" data-v-f87c67ca=\"\">sold its Russian entity<\/a> to the newly-created platform CommEX in September.","Yesterday, Bloomberg reported the DOJ was seeking more than <a href=\"https:\/\/www.theblock.co\/post\/263851\/us-justice-department-seeks-4-billion-from-binance-to-end-criminal-case-bloomberg\" data-v-f87c67ca=\"\">$4 billion<\/a> from Binance as part of a settlement deal.","The settlement and departure comes amid a troublesome year for the crypto exchange, which is also facing regulatory issues in the U.S. and Europe.","In Europe, Binance announced it was <a href=\"https:\/\/www.theblock.co\/post\/235084\/binance-exits-the-netherlands\" data-v-f87c67ca=\"\">exiting<\/a> the Netherlands after failing to acquire regulatory approval. It also applied to <a href=\"https:\/\/www.theblock.co\/post\/234617\/binance-cyprus-deregister\" data-v-f87c67ca=\"\">deregister<\/a> its local entity in Cyprus and is reportedly under <a href=\"https:\/\/www.theblock.co\/post\/235129\/binance-is-under-investigation-in-france-for-alleged-money-laundering-le-monde\" data-v-f87c67ca=\"\">investigation<\/a> in France for alleged money laundering.","Furthermore, Belgium's financial regulator ordered Binance to <a href=\"https:\/\/www.theblock.co\/post\/236239\/belgium-regulator-orders-binance-to-stop-services-in-country\" data-v-f87c67ca=\"\">cease services<\/a> in June, accusing the crypto exchange of offering certain services from countries not members of the European Economic Area. However, Binance reopened registration and access to its crypto exchange platform in Belgium in September after tapping its <a href=\"https:\/\/www.theblock.co\/post\/252911\/binance-belgium-reopens\" data-v-f87c67ca=\"\">Polish unit<\/a> to provide the legal compliance necessary to continue serving its customers in the country.","In the U.S., the Securities and Exchange Commission also <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">filed<\/a> a lawsuit against Binance in June, alleging it had violated U.S. securities laws, which the regulator argues should result in prohibiting the company and Zhao from doing further business in the U.S. The civil suit followed a <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">similar one<\/a> filed by the Commodity Futures Trading Commission in March.","The SEC complaint included <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">detailed testimony and internal communications<\/a> that paint a picture reminiscent of now-defunct crypto exchange FTX, alleging that \"billions of U.S. dollars of customer funds\" from both Binance and Binance.US were \"commingled in an account held by a Zhao-controlled entity\" known as Merit Peak Limited, with no real separation between the Binance entities.","Binance.US cut staff numbers in the wake of the SEC's suit against the company, which also saw its business shrink with the firm's customers no longer able to use U.S. dollars to purchase crypto on the platform. In September, the firm laid off one-third of the remaining employees, with Binance.US president and CEO <a href=\"https:\/\/www.theblock.co\/post\/250617\/binance-us-cuts-staff-president-departs-sources\" data-v-f87c67ca=\"\">Brian Shroder also exiting the company<\/a> amid uncertainty and declining business.","Binance itself reportedly laid off at least 1,500 staff and has made headlines this year for <a href=\"https:\/\/www.theblock.co\/post\/248927\/binance-mayur-kamat\" data-v-f87c67ca=\"\">high-profile executive exits<\/a>, including global head of product Mayur Kamat, Asia-Pacific head Leon Foong, chief strategy officer Patrick Hillman, general counsel Hon Ng and chief business officer Yibo Ling.","Binance's market share among non-USD exchanges <a href=\"https:\/\/www.theblock.co\/post\/253132\/binance-market-share-non-usd-exchanges\" data-v-f87c67ca=\"\">slipped below 50%<\/a> in September from 75% at the start of the year amid the regulatory pressure, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/no-usd-support-exchange-volume-market-share\/embed\" title=\"No USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","However, Binance still remains the largest crypto exchange by trading volume overall, by some margin.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/the-block-legitimate-index-market-share\/embed\" title=\"Monthly Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The move will mark the end of an era for Binance, rising from a 2017 startup to becoming the world's largest cryptocurrency exchange under the leadership of the Chinese-born Canadian businessman, investor and software engineer.","Zhao reportedly <a href=\"https:\/\/www.forbes.com\/sites\/pamelaambler\/2018\/02\/07\/changpeng-zhao-binance-exchange-crypto-cryptocurrency\/\" data-v-f87c67ca=\"\">first learned<\/a> about Bitcoin in 2013 from a venture capitalist he played poker with. He later joined the cryptocurrency financial services company Blockchain.info (now Blockchain.com) as its third member, working closely with Bitcoin evangelists like Roger Ver and Ben Reeves. Zhao also spent a year as Chief Technology Officer at crypto exchange OKCoin (now OKX) before founding Binance in 2017.","<span data-v-f87c67ca=\"\">Under Zhao’s leadership, Binance quickly outpaced its competitors, establishing itself as a household name in the crypto community. Beyond its trading platform, Binance led the development of the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248351\/bnb-bnb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bnb-icon2_2x.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BNB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.13%\n    <\/span><\/a> <!----><\/span> Chain blockchain, the decentralized exchange Binance DEX and launched an academy dedicated to crypto education.<\/span>","Binance's ascendance intertwined with the broader narrative of cryptocurrency adoption. The exchange played a crucial role in making digital assets more accessible to the masses, offering a wide range of cryptocurrencies and pioneering features that set industry standards replicated by rivals.","Zhao's leadership style, characterized by community engagement and a commitment to continuous innovation on the platform, was instrumental in fostering a loyal user base. His regular \"Ask Me Anything\" sessions and active social media presence made him one of the most recognizable figures in the crypto world. Ultimately, however, Zhao now takes the fall for operations at Binance called into question by the DOJ.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6.7%","content":"PERCENT"},{"type":"$239.99","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2:18 p.m. ET","content":"TIME"},{"type":"Cyprus","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"Zhao","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"National Cryptocurrency Enforcement Team","content":"ORGANIZATION"},{"type":"Yibo Ling","content":"PERSON"},{"type":"Western District","content":"ORGANIZATION"},{"type":"Mayur Kamat","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Binance DEX","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Belgium","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Ben Reeves","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"+0.13%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"Brian Shroder","content":"PERSON"},{"type":"Iran","content":"LOCATION"},{"type":"U.S. Department of the Treasury’s Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"Netherlands","content":"LOCATION"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Patrick Hillman","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Defendant Binance","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Leon Foong","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"75%","content":"PERCENT"},{"type":"MTB","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"European Economic Area","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Binance entities","content":"ORGANIZATION"},{"type":"Roger Ver","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BINANCE","CFTC","CZ","FTX","LAWSUITS","SEC"],"authors":["James Hunt","MK Manoylov","The Block"]}