{"summary":"Cathie Wood’s Ark Invest is getting ready to launch what it says is a new suite of digital asset ETFs with 21shares.\nThe announcement comes as the world of traditional finance and crypto await a decision on spot bitcoin ETFs being pursued by the likes of Fidelity, Grayscale and BlackRock.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262255\/ark-invest-launching-new-suite-of-digital-asset-etfs-with-21shares","publishDate":"2023-11-08T16:55:27","id":218,"type":null,"title":"Ark Invest launching new suite of digital asset ETFs with 21Shares","category":["Market Updates"],"content":["Cathie Wood's <a href=\"https:\/\/www.theblock.co\/post\/261920\/cathie-wood-ark-invest-gbtc-block\" data-v-f87c67ca=\"\">Ark Invest<\/a> is getting ready to launch a new suite of ETFs with 21Shares it says will give investors \"a robust set of options for introducing exposure to digital assets into a portfolio.\"","\"Leveraging onchain signals and our crypto-native experience, the suite aims to deliver long-term capital appreciation through strategic investments in Bitcoin and Ethereum futures contracts, and the application of blockchain technologies,\" according to <a href=\"https:\/\/21shares-funds.com\/?utm_campaign=futures_prelaunch_ark&amp;utm_medium=email&amp;_hsmi=281754940&amp;_hsenc=p2ANqtz--Em3KEpqkGUsxAHKp27E1kCEIcNWMmkRJ4QWIA-fn-Pxq7G_LVGCatfn35KHzYLatlORrFZ1KbDLwOMRn49fb27z6ANw&amp;utm_source=ARK_email\" data-v-f87c67ca=\"\">21Shares<\/a>.&nbsp;","The ETFs will be listed on the Chicago Board Options Exchange, or Cboe, according to prospectuses. There are a total of five products that will begin trading next week.","Besides bitcoin and ether futures contracts, one product will invest into a mix including \"public equities of companies engaged in the blockchain industry,\" according to 21Shares' website.&nbsp;","Ark stressed that the funds still won't offer a chance to invest directly into digital assets. \"Neither the funds nor the underlying ETF invest directly in bitcoin or other digital assets or maintain direct exposure to spot bitcoin,\" said Ark. \"Investors seeking direct exposure to the price of bitcoin should consider an investment other than the funds.\"","Ark's launch comes at a time when both the world of traditional finance and crypto are <a href=\"https:\/\/www.theblock.co\/post\/262199\/bullish-sentiment-builds-as-bitcoin-consolidates-and-altcoin-rotation-picks-up\" data-v-f87c67ca=\"\">eagerly awaiting<\/a> a decision on the spot bitcoin ETFs pursued by the likes of Fidelity, Grayscale and BlackRock. The price of bitcoin has risen on the expectation that a spot bitcoin ETF will soon be approved.","While the SEC has approved funds that invest in bitcoin futures, it still has yet to approve a spot fund.&nbsp;","&nbsp;"],"hashtag":[]}