{"summary":"Cryptocurrency lending desks Genesis Global Capital closed another record-breaking quarter in 19Q4\nThe firm had $3.1 billion in total loan originations in 2019 and active outstanding loans of $545 million as of December 2019\nGenesis predicts strong cash-loan and international demand in 2020.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54462\/genesis-capital-saw-surge-in-q4-outstanding-loans-expecting-strong-cash-loan-demand-and-international-growth-in-2020","publishDate":"2020-01-30T09:00:13","id":2180,"type":null,"title":"Genesis Capital saw continued surge in outstanding loans (4Q of 2019)","category":["Lending"],"content":["Genesis Global Capital, the institutional lending affiliate of over-the-counter cryptocurrency trading desk Genesis Trading, closed another record-breaking quarter with strong demand from cash borrowers and international clients – a trend the firm expects to continue in 2020.&nbsp;","The lending desk issued over $1 billion worth of loans in the fourth quarter of 2019, a 34.8% increase from the previous quarter and had total outstanding loans of $545 million as of December 2019.","Cash and BTC dominate the active loan portfolio, comprising 84.5% of the value, Genesis Capital stated in its quarterly report.&nbsp;","Over the past year, Genesis saw a strong uptick in demand for cash loans, driven partly by derivatives traders' desire to take advantage of the rich premiums of bitcoin futures to the BTC spot price. These traders, usually from hedge funds, family offices, and mining firms, also tended to borrow cash to add to their positions on the derivatives markets, according to the report.&nbsp;","The lending desk predicts that this trend will persist in 2020 as long as premiums still exist, although it will slowly normalize due to increased cash supply in crypto markets, operational efficiencies across exchanges and trading desks, and the emergence of more trusted exchanges.&nbsp;","On the other hand, Genesis is also expecting more lending and borrowing demands from international clients. In 2019, Asia and Europe made up over 25% of Genesis Capital's loan portfolio, with European investors interested in lending out their holdings for outsized returns and Asian investors looking to take out cash loans to use for working capital.&nbsp;","As the bitcoin market approaches the block reward halving – the event during which the bitcoin block reward falls from 12.5 BTC to 6.25 BTC – the lending desk is also seeing strong demands from Chinese miners. These miners usually do not want to let go of their bitcoin holding and, as a result, tend to collateralize bitcoins for cash loans to expand their mining facilities, Genesis Trading CEO Michael Moro told The Block.&nbsp;","As previously <a href=\"https:\/\/www.theblockcrypto.com\/daily\/50347\/as-concerns-over-crypto-credit-bubble-mount-miners-appear-to-be-particularly-at-risk\" data-v-f87c67ca=\"\">reported<\/a> by The Block, the current bitcoin breakeven price is hovering around $6,500 for miners. If transaction fee figures remain unchanged and bitcoin's price does not jump to around $13,000 after the halving, lenders might face greater default risks in lending to miners.&nbsp;","For Genesis, however, it's still \"business as usual\" with miners, according to Moro. But he did note that other lender firms who are not careful with their risk management and due diligence when lending to miners might face greater risks.&nbsp;&nbsp;","“We are not worried because we have collaterals,” said Moro.&nbsp;"],"hashtag":[]}