{"summary":"New user registrations for the products are being discontinued from today, with all mining pool-related services ending for existing users on Feb. 26.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274608\/okx-mining-pool-discontinued","publishDate":"2024-01-26T05:10:20","id":2181,"type":null,"title":"OKX set to phase out its mining pool and related services","category":["Exchanges"],"content":["OKX, one of the largest crypto exchanges by trading volume, has <a href=\"https:\/\/www.okx.com\/help\/okx-to-discontinue-mining-pool-and-related-services\" data-v-f87c67ca=\"\">announced<\/a> that its mining pool services will be phased out from today.","The firm will halt new user registrations on Jan. 26, with existing users able to continue to use the pool until Feb. 25. All OKX mining pool-related services will be discontinued on Feb. 26.","OKX, which <a href=\"https:\/\/www.okx.com\/learn\/okex-rebrands-to-okx\" data-v-f87c67ca=\"\">rebranded<\/a> from OKEx in January 2022, said it had made the decision due to “business adjustments,” but did not elaborate further.","OKX’s pool previously supported the mining of multiple proof-of-work cryptocurrencies, as well as offering staking services. However, many of the supported assets had already been <a href=\"https:\/\/www.okx.com\/help\/okx-mining-pool-announcement-on-delisting-dcr\" data-v-f87c67ca=\"\">terminated<\/a> in recent years and now only Bitcoin, Litecoin and Ethereum Classic pool services are displayed on its <a href=\"https:\/\/www.okx.com\/pool\" data-v-f87c67ca=\"\">website<\/a>, with a total of just 19 active miners.","At one point, OKX’s Bitcoin mining pool had grown to about 5% of the blocks mined on the network.","However, following a temporary <a href=\"https:\/\/www.theblock.co\/post\/81406\/crypto-exchange-okex-withdrawal-issues-investigation\" data-v-f87c67ca=\"\">suspension<\/a> of withdrawals on the crypto exchange on Oct. 16, 2020 — as one of its private key holders was “cooperating with a public security bureau in investigations” — hashpower connected to the pool <a href=\"https:\/\/www.theblock.co\/linked\/84229\/okex-bitcoin-mining-hash-lost\" data-v-f87c67ca=\"\">dropped<\/a> dramatically from 9,000 PH\/s to 20 PH\/s, and it has struggled to recover since. The pool's current 528 TH\/s represents less than 0.0001% of Bitcoin’s total hashrate.","The Block has reached out to OKX for comment."],"hashtag":["OKX"]}