{"summary":"&quot;Larry is the perfect anti-sponsor,&quot; said Jeff Schaffer, the director of FTX&#x27;s Super Bowl commercial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134339\/why-larry-david-was-the-perfect-anti-sponsor-of-ftxs-super-bowl-ad-according-to-jeff-schaffer","publishDate":"2022-02-15T17:22:41","id":2183,"type":null,"title":"Why Larry David was the perfect &#x27;anti-sponsor&#x27; of FTX&#x27;s Super Bowl ad, according to Jeff Schaffer","category":["MARKETS"],"content":["FTX knew that if it was going to cough up the cash for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/134070\/coinbase-ftx-make-super-bowl-debut-commit-to-giving-away-crypto\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a Super Bowl spot<\/a> it had to check a few boxes: represent its growing brand, reach new users and, oddly specifically, include comedian Larry David.&nbsp;","\"From the earliest stages, we knew we wanted to work with him,\" FTX.US president Brett Harrison told The Block.&nbsp;","The former Citadel Securities executive admitted it was a ridiculous goal at first. David — best known for creating the hit sitcom <em data-v-f87c67ca=\"\">Seinfeld<\/em> and, later, the popular HBO series<em data-v-f87c67ca=\"\"> Curb Your Enthusiasm — <\/em>is not well-known for being a product pitchman. And convincing any celebrity to get behind a young startup in most instances is a herculean task unto itself.","But FTX, in collaboration with dentsu Creative, came up with a pitch that would fit David perfectly: let him be on-brand.&nbsp;","\"The concept was so strong and so on-brand for Larry's comedy of him grumbling through life,\" said director Jeff Schaffer, who oversaw the commercial's production. In addition to working closely with David on <em data-v-f87c67ca=\"\">Curb<\/em>, Schaffer is also known for conceiving of the infamous Festivus pole during his time on the set of Seinfeld.&nbsp;","\"I give FTX all the credit in the world because they had the stones to make an ad where Larry doesn't hold the product, doesn't say the product's name, and in fact doesn't want to use the product,\" he said.&nbsp;","In the <a href=\"https:\/\/www.youtube.com\/watch?v=BH5-rSxilxo\" data-v-f87c67ca=\"\">commercial<\/a>, David, spanning geographies and time, poo-poos innovations from the wheel to American democracy to the toilet and ultimately FTX's crypto trading app.","\"Ugh, I don't think so,\" he quips before \"Don't be like Larry\" appears on the screen.","In a sense, David portrays the wider range of crypto skeptics out there, who have long chalked up the space as a passing fad or get-rich-quick scheme.&nbsp;","\"The doubters, the haters are proudly represented by Larry,\" said Schaffer. \"Larry is the perfect anti-sponsor.\"","Indeed, David's persona as a crypto critic reflects real life. Schaffer described the collaboration between FTX, his team, and David as being a society of \"successful mutual ignorance.\"","\"When we talked to the guys at FTX [and] had our first meeting, they asked, 'Do you use crypto?' And we said no. 'Do you know how it works?' And we said no. 'Do you understand blockchain?' and we said no,\" Schaffer explained.","That lack of awareness added to the authenticity of the character. \"Larry and I had a blast,\" Schaffer said.","According to Harrison, David played a hands-on approach to shaping the ad.&nbsp;","\"He was so personally involved in the creative process and editing process and was very particular about how it would be cut,\" he said.&nbsp;","FTX's ad was juxtaposed with Coinbase, which purchased its own ad spot for the game. A flashing QR code linking to a sweepstake proved successful in pushing the firm to the top of the app download charts — although its site did briefly crash. Both firms would have paid a pretty penny for their spots. Back-of-the-envelope math suggests a 60 second spot for the Super Bowl costs $13 million. Harrison—who declined to comment on the full sticker price—said the added cost of production and hiring David added a 2 to 3X multiple to that price tag.&nbsp;","Still, Harrison said that while Coinbase's ad was \"brilliant,\" it took a more cynical approach by focusing on customer acquisition versus winning over hearts and minds.&nbsp;","\"For one, it is addressing the general skepticism of crypto that exists in the current day and sharing the ethos of our company, which understands that crypto requires a leap of faith and we have a sense of humor about it,\" said Harrison. \"Coinbase acquired a ton of users. For us, we saw an increase in deposits, more site traffic, but what we saw the most was an increase in all of our social channels.\"","Likely a few of those new followers are die-hard <em data-v-f87c67ca=\"\">Curb<\/em> fans.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harrison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Schaffer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Larry David","content":"PERSON"},{"type":"Larry","content":"PERSON"},{"type":"$13 million","content":"MONEY"},{"type":"Jeff Schaffer","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Larry\"","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"dentsu Creative","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Frank Chaparro","The Block"]}