{"summary":"Genesis Global Capital, the lending business of Genesis Trading, temporarily suspended redemptions.\n“This decision was made in response to the extreme market dislocation and loss of industry confidence caused by the FTX implosion,” parent company Digital Currency Group said.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187545\/genesis-global-capital-suspends-redemptions-with-impact-spreading-to-gemini","publishDate":"2022-11-16T10:07:51","id":2184,"type":null,"title":"Genesis Global Capital suspends redemptions, with impact spreading to Gemini","category":["Exchanges"],"content":["Genesis Global Capital, the lending business of Genesis Trading, temporarily suspended redemptions and new loan originations in the wake of FTX's recent collapse and the earlier Three Arrows Capital implosion, kicking off another wave of reactions from crypto players with which it did business.","\"The impact lies with the lending business at Genesis and does not affect Genesis’s trading or custody businesses,\" parent company Digital Currency Group said in a <a href=\"https:\/\/twitter.com\/DCGco\/status\/1592868145286766592\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. \"This decision was made in response to the extreme market dislocation and loss of industry confidence caused by the FTX implosion.\"","Business operations at DCG and its other wholly owned subsidiaries were not affected.","The parent company <a href=\"https:\/\/www.theblock.co\/post\/185834\/trading-firm-genesis-to-get-140-million-equity-infusion-from-parent-company-dcg\" data-v-f87c67ca=\"\">last week<\/a> gave its Genesis Trading unit a $140 million equity infusion after it said its derivatives business had $175 million locked up on the FTX platform. The trading unit said last week that its operating capital and net positions in FTX were <a href=\"https:\/\/www.theblock.co\/post\/185665\/genesis-trading-says-derivatives-arm-has-175-million-locked-up-in-ftx-account\" data-v-f87c67ca=\"\">not material<\/a> to its business.&nbsp;","Genesis will continue to offer over-the-counter trading for spot and derivatives trading, plus its custody services, according to comments made by Genesis Interim CEO Derar Islim during a client call that was <a href=\"https:\/\/www.theblock.co\/post\/187516\/genesis-halts-customer-withdrawals-in-wake-of-three-arrows-and-ftx-collapses-coindesk\" data-v-f87c67ca=\"\">reported<\/a> by CoinDesk.","Max Boonen, founder and director at B2C2, said his firm wanted to extend an offer to purchase loans from Genesis Trading's book \"to alleviate the current liquidity shortfall.\"","\"I didn't have Genesis on my bingo card,\" he <a href=\"https:\/\/twitter.com\/maxboonen\/status\/1592873288157777922?s=46&amp;t=7BxpuKQIwxiUWqVD-NTSyw\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter. \"Wow. That leaves very few players in the OTC market.\"","B2C2 said in an emailed statement to The Block that it has provided critical liquidity and support to its global client base throughout the current market turmoil, adding that it continues to price, trade and settle across all its products.&nbsp;","\"The company is in a position to support the wider market by offering to work with Genesis and their counterparties to novate existing loans at Genesis Global Capital to B2C2,\" the company said. \"Our risk management processes are rigorous and controlled, which is why our crypto loans book is over-collateralized by a minimum of 115%. As normal, our own risk management, KYC and onboarding procedures will apply.\"","The announcement from Genesis quickly spread to crypto exchange Gemini, which said its Earn program \"will not be able to meet customer redemptions within the service-level agreement of five business days.\"","\"The past week has been an incredibly challenging and stressful time for our industry,\" the Winklevoss twin-led business wrote in a <a href=\"https:\/\/www.gemini.com\/blog\/an-important-message-regarding-gemini-earn\" data-v-f87c67ca=\"\">blog post<\/a>. \"We are disappointed that the Earn program SLA will not be met, but we are encouraged by Genesis’ and its parent company Digital Currency Group’s commitment to doing everything in their power to fulfill their obligations to customers under the Earn program.\"","Genesis was the largest prime broker in the crypto space. In March, it had $14.6 billion of active loans, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/active-loans-of-genesis-global-trading\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>. But the lending business took a big hit when cryptocurrency Luna collapsed, removing $30 billion from the crypto market cap and pushing trading firm Three Arrows into bankruptcy. Genesis had made large loans to Three Arrows, which were not repaid. Genesis' parent company DCG took on the debt, which was estimated north of $1 billion.","Genesis subsequently started slowing down its operations, and its loan originations <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/loan-originations-of-genesis-global-trading-quarterly\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">dropped<\/a> by a third in dollar value last quarter compared to the previous one. It also reported just $2.8 billion in active loans. At the same time, it made cost reductions, laying off 20% of its workforce. Top executives left the company, including former CEO <a href=\"https:\/\/www.theblock.co\/post\/164014\/genesis-ceo-michael-moro-steps-down-from-role-effective-immediately\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Michael Moro<\/a>&nbsp;and former Chief Risk Officer&nbsp;<span data-v-77adb80d=\"\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/178807\/crypto-firm-genesis-loses-its-chief-risk-officer-coindesk\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Michael Patchen<\/a>.<\/span>","Grayscale, a crypto asset management firm also under the DCG umbrella,&nbsp;said that its products are operating \"business as usual\" and operations have not been impacted by \"recent events.\" The firm said it's not a counterparty or service provider for any Genesis Global Capital&nbsp; products.","The company also addressed its Grayscale's Bitcoin Trust, GBTC, which it said remains backed by underlying assets that are \"safe and secure, held in segregated wallets in deep cold storage by our custodian Coinbase.\"","Canadian crypto lender Ledn said it <a href=\"https:\/\/www.theblock.co\/post\/187516\/genesis-halts-customer-withdrawals-in-wake-of-three-arrows-and-ftx-collapses-coindesk\" data-v-f87c67ca=\"\">has no exposure<\/a> to Genesis Global Capital and is fully operational. While Genesis Global Capital was Ledn's primary lending partner at the start of its operations, Ledn has since reduced its risk concentration by diversifying its pool of lending partners, the company said. The crypto lender added that it did not have any active lending relationship with Genesis beyond October.","Coinbase <a href=\"https:\/\/twitter.com\/coinbase\/status\/1592934683612176384\" data-v-f87c67ca=\"\">said on Twitter<\/a> that it had \"zero exposure\" to Genesis Trading. It said <a href=\"https:\/\/www.coinbase.com\/blog\/our-approach-to-transparency-risk-management-and-consumer-protection\" data-v-f87c67ca=\"\">last week<\/a> that it had $15 million of deposits on FTX \"to facilitate business operations and client trades.\"","Tether also said that it had \"absolutely no exposure to Genesis or Gemeni Earn,\" writing in a <a href=\"https:\/\/tether.to\/en\/tether-confirms-zero-exposure-to-genesis\/\" data-v-f87c67ca=\"\">blog post<\/a> that assets backing its reserves exceed liabilities.","\"It is important at a time like this to highlight that these reserves have proved tried and true demonstrating consistent resilience during the black swan events that have characterized the market this past year,\" the company said. \"Tether is operating business as usual.\"","The developments come as the situation around FTX grows more dire, with reports saying regulators in the Bahamas are moving to freeze its assets seeking the court appointment of a liquidator. Regulators in the U.S. have also been said to be probing FTX and its broader business empire.","Binance CEO Changpeng “CZ” Zhao said the exchange he runs did not rely on Genesis or any other third party for its Earn products.","\"For on-chain staking, Binance uses our own nodes where possible,\" he <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1592889504431767554\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter.","<span data-v-77adb80d=\"\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">With reporting assistance from Tim Copeland, Yogita Khatri, Adam James&nbsp;and Osato Avan-Nomayo.<\/em><\/span>"],"hashtag":["FTX","GEMINI"]}