{"summary":"ZachXBT amended an article that got him sued for defamation, and both parties &quot;mutually agreed to move on.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244776\/jeffrey-machi-big-brother-huang-drops-defamation-suit-against-crypto-sleuth-zachxbt","publishDate":"2023-08-14T12:43:53","id":2185,"type":null,"title":"&#x27;Machi Big Brother&#x27; drops defamation suit against crypto sleuth ZachXBT","category":["LEGAL"],"content":["Jeffrey \"Machi Big Brother\" Huang has withdrawn a defamation lawsuit against the crypto sleuth known as ZachXBT.","\"Zach has many times in the past been of great service to the crypto community and pursuing legal action against him was a last resort but not the right path,\" Huang <a href=\"https:\/\/twitter.com\/machibigbrother\/status\/1691116322611159040\" data-v-f87c67ca=\"\">announced<\/a> on social media. \"I appreciate that Zach has made important amendments to his article, and we have mutually agreed to move on from this matter.\"","ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1691116363891552256\" data-v-f87c67ca=\"\">confirmed<\/a> that the suit had been dropped, adding that he would return unused funds donated to him to help finance his legal defense.&nbsp;","\"While I am disappointed it went down the legal route in the first place I am appreciative we are able to find a resolution,\" he said. \"I would like to thank everyone in the community for their donations and support during the process. It meant a great deal to me and made a huge difference.\"","ZachXBT was <a href=\"https:\/\/www.theblock.co\/post\/235220\/crypto-sleuth-zachxbt-sued-for-defamation\" data-v-f87c67ca=\"\">sued<\/a> and doxxed earlier this year by Jeffrey Huang, who goes by \"Machi Big Brother\" online, for defamation. The crypto sleuth had alleged in a Medium <a href=\"https:\/\/medium.com\/@investigationsbyzachxbt\/22-000-eth-embezzled-and-over-ten-projects-failed-the-story-of-machi-big-brother-jeff-huang-a1ad073fcfa8\" data-v-f87c67ca=\"\">post<\/a>&nbsp;that Huang embezzled 22,000 ETH from the crypto management firm Formosa Financial.&nbsp;","The defamation lawsuit argued that the claims in the Medium post were \"categorically false.\"","The crypto community had pooled together as much as <a href=\"https:\/\/www.theblock.co\/post\/235260\/crypto-donors-raise-500000-to-support-zachxbt-in-lawsuit\" data-v-f87c67ca=\"\">$500,000<\/a> in funds for ZachXBT's legal defense, The Block previously reported. As of publication, the wallet <a href=\"https:\/\/zapper.xyz\/account\/0x6eA158145907a1fAc74016087611913A96d96624\" data-v-f87c67ca=\"\">address<\/a> for his legal funds has a net worth of nearly $24,000.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Formosa Financial","content":"ORGANIZATION"},{"type":"Machi Big Brother\" Huang","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"\"Machi Big Brother","content":"ORGANIZATION"},{"type":"Jeffrey Huang","content":"PERSON"},{"type":"$24,000","content":"MONEY"},{"type":"Zach","content":"PERSON"},{"type":"$500,000","content":"MONEY"}],"hashtag":["LAWSUITS"],"authors":["MK Manoylov","The Block"]}