{"summary":"Coinbase has contributed 1 million USDC each to Compound and dYdX \nThe contribution is part of the cryptocurrency exchange’s new initiative, the USDC Bootstrap Fund, to help decentralized finance (DeFi) projects get liquidity\nCoinbase said it has always been interested in DeFi and wants the fund to support growth in the space","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38851\/coinbase-launches-fund-to-invest-in-defi-protocols-depositing-2-million-usdc-in-compound-dydx","publishDate":"2019-09-10T13:00:28","id":2186,"type":null,"title":"Coinbase launches fund to invest in DeFi protocols, depositing 2 million USDC in Compound, dYdX","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Coinbase is depositing $2 million worth of USDC to cryptocurrency lending protocols Compound and dYdX, staking the growth of Decentralized Finance (DeFi).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The cryptocurrency exchange today <a href=\"https:\/\/medium.com\/@nemild\/ed5e16ca4daf\" data-v-f87c67ca=\"\">announced<\/a> the USDC Bootstrap Fund to invest directly in DeFi protocols. To start, it will contribute 1 million USDC each to the lending pools of Compound and dYdX. Unlike Coinbase Ventures, which invests in startups and takes an equity stake, the bootstrap fund will add to protocols’ lending pools and return interest when counterparties borrow from it. The interest generated will then be contributed back to the pools.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to dYdX head of operations Zhuoxun Yin, one of the biggest challenges in building a new DeFi protocol is to attract borrowing demand. By adding USDC to the lending pools, Coinbase hopes the increased supply of USDC can drive down the interest rate and encourage more users to borrow the stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As soon as we invest, the interest rate goes down in the pool itself. But then, what we have seen so far, is largely that borrowers come in and borrow. So the rates have been largely coming back to where they were before,” USDC Bootstrap Fund lead Nemil Dalal told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, the DeFi market is dominated by stablecoin Dai, the redemption of which<\/span><span data-v-f87c67ca=\"\"> usually requires conversion to ether or other stablecoins first. In comparison, USDC has a<\/span><a href=\"https:\/\/support.usdc.circle.com\/hc\/en-us\/articles\/360015269692-How-to-redeem-USDC-for-USD\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> fairly straightforward redemption<\/span><\/a><span data-v-f87c67ca=\"\"> process for dollars. Therefore, an enlarged USDC pool may attract users looking to redeem their cryptocurrencies fast, according to Yin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I think about one of the challenges in DeFi being the facilitation of connecting fiat onramp into DeFi. The fact that you can do so 1 to 1 with USDC is actually very useful for someone coming into DeFi looking to trade and also want to be in and out of fiat quickly. It’s much easier to do so using something like USDC than Dai,” Yin told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For Coinbase, staking lending protocols is another step to support the growth of DeFi, an area Coinbase has always been interested in, according to Dalal. In the past, Coinbase’s venture arm has invested in several DeFi protocols, including Dharma, Compound, and BlockFi.<\/span>","<span data-v-f87c67ca=\"\">“The biggest concerns in general is that DeFi is a tiny portion of the world of banking and financial transactions. So the biggest thing for us is that we want to help grow Decentralized Finance… The only number we are tracking is the growth of DeFi and what USDC and Coinbase can do to encourage that,” said Dalal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, according to data compiled by The Block’s Larry Cermak, the total value locked in DeFi protocols has grown around 176% over the past year <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/18\/defi-continues-to-grow-as-new-protocols-grab-market-share\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">to $500 million<\/span><\/a><span data-v-f87c67ca=\"\">, the majority dominated by Dai issuer MakerDao. <\/span>Meanwhile, following Dai's dominance in DeFi, <span data-v-f87c67ca=\"\">USDC comes in as a distant second, with around <\/span><a href=\"https:\/\/loanscan.io\/loans?interval=ytd\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">12%<\/span><\/a><span data-v-f87c67ca=\"\"> of Dai’s total loans originated volumes across several major lending protocols.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">For a deeper breakdown on the potential impact of Coinbase's bootstrap fund on DeFi, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/39160\/why-does-coinbase-contribute-to-the-already-oversupplied-usdc-lending-pools\/\" data-v-f87c67ca=\"\">read more here<\/a>.&nbsp;<\/em><\/strong>","","","For now, the size of the fund is unclear, although Dalal said it's actively looking for more projects to invest in.&nbsp;"],"hashtag":["COINBASE","DAI","USDC"]}