{"summary":"Over the past few months, users of the Chivo wallet in El Salvador have been reporting a variety of issues with the app, including blocked accounts, unauthorized charges and failed transactions. Meanwhile, phishing scams and bots are targeting people who reach out for help on social media.\nAbout 1,200 people have reported issues with Chivo to human rights organization Cristosal, with the majority saying that their personal account details were used without authorization to open or use accounts in their name.\nMany Chivo users say they are still waiting for answers to their problems, sometimes weeks or months later.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131452\/el-salvadors-chivo-wallet-keeps-breaking-and-users-are-seeking-answers","publishDate":"2022-01-28T13:25:27","id":2193,"type":null,"title":"El Salvador’s Chivo wallet keeps breaking, and users are seeking answers","category":["Wallets"],"content":["<span data-v-f87c67ca=\"\">While many spent the holiday season with friends and family, at least dozens of people in El Salvador were also dedicating a good chunk of time to chasing down customer support for their <\/span><span data-v-f87c67ca=\"\">government-provided <\/span><span data-v-f87c67ca=\"\">bitcoin wallets — and posting about it on Twitter.<\/span>","<span data-v-f87c67ca=\"\">Sometime between November and December, the website began to fill up with noticeably more complaints about unknown or failed transactions related to Chivo, the state-backed bitcoin wallet that went live in September to much fanfare.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I’ve spent almost two months waiting for them to help me with a transaction of almost $1,000 at the time,” <\/span><a href=\"https:\/\/twitter.com\/Josh_91_L\/status\/1469117926615695363\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter user<\/span><\/a><span data-v-f87c67ca=\"\"> @Josh_91_L posted on December 9. “Now with the value of BTC plummeting and continuing like this, it seems like it will be much less. I’m still hoping that one day they can resolve it, willingly.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Yesterday, I found out transactions in my bank account have been made through the Chivo Wallet that add up to an amount over $3,000,” Twitter user <\/span><a href=\"https:\/\/twitter.com\/Jenn_Larin85\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Jenn_Larin85<\/span><\/a><span data-v-f87c67ca=\"\"> wrote on Dec. 19.&nbsp;<\/span><span data-v-f87c67ca=\"\">“Hoping that they [solve this for me] as soon as possible!”<\/span>","<span data-v-f87c67ca=\"\">Chivo, which is local slang for “cool,” has played a starring role in the drama that has been ongoing since El Salvador enacted a law in September making Bitcoin legal tender. The wallet<\/span><span data-v-f87c67ca=\"\">, <\/span><span data-v-f87c67ca=\"\">which is optional to use and supports both Bitcoin and the local currency of U.S. dollars, is designed to offer a few perks just for Salvadorans. <\/span>","<span data-v-f87c67ca=\"\">In addition to getting a free $30 in Bitcoin when signing up, Chivo users pay no commission for remittances to other users of the app, currency conversions or taking physical cash out of the 200 Chivo-branded ATMs around the country.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When Chivo works the way it’s supposed to, these features have made it easier for Salvadorans to send remittances and pay for things without needing physical cash. However, many users say a host of issues have shaken their confidence in the app.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the past month, The Block has reviewed a range of complaints about Chivo on social media, including claims of unauthorized charges in the app and external bank accounts, blocked accounts, phishing schemes targeting users, failed transfers to other wallets and identity theft. In addition, more than 10 people shared their firsthand accounts of issues for this article.<\/span>","<span data-v-f87c67ca=\"\">While The Block couldn’t independently verify all of the social media posts complaining about Chivo, our reporting unearthed evidence that in its short life, the app has experienced several types of problems that have affected a significant number of people.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And yet, The Block was unable to obtain clear responses or comments explaining these issues from either government officials or representatives of the private companies that helped El Salvador develop Chivo.<\/span>","<span data-v-f87c67ca=\"\">Chivo was never a perfect app. It became clear from <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/116870\/el-salvadors-chivo-bitcoin-wallet-struggles-to-reach-liftoff-on-launch-day\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">day one<\/span><\/a><span data-v-f87c67ca=\"\"> that the initial iteration of the wallet was dogged by technical glitches and bugs. But recent reports from Chivo users on social media show<\/span><span data-v-f87c67ca=\"\"> that the software cont<\/span><span data-v-f87c67ca=\"\">inues to have issues — not only that affect the app’s user experience, but in some cases, the amounts of money in people’s accounts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of the reasons for the increased visibility of Chivo’s issues in recent weeks is that some Salvadorans have taken it upon themselves to publicly track complaints about the wallet.<\/span>","<span data-v-f87c67ca=\"\">The most high-profile of these efforts is a <\/span><a href=\"https:\/\/twitter.com\/_elcomisionado_\/status\/1472326380620632064\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">now-infamous Dec. 18 thread <\/span><\/a><span data-v-f87c67ca=\"\">by an anonymous Twitter user named El Comisionado, or “The Commissioner” in English. It began with 50 instances of people claiming that they had lost funds in Chivo or their bank accounts, or that they couldn’t access them in the app. The thread has since grown to 80 individual reports, representing more t<\/span><span data-v-f87c67ca=\"\">han $127,000 in allegedly <\/span><span data-v-f87c67ca=\"\">stolen, inaccessible or unrealized funds. Most of these claims are <\/span><a href=\"https:\/\/docs.google.com\/spreadsheets\/d\/1o_xQ3egm6shkFhShfWtIetaF2K-LG6h8bXz7xNyLICI\/edit#gid=0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reflected here<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The issues raised in the thread tend to center on a few main themes: people claiming they've been blocked from entering their Chivo accounts, unauthorized Chivo-related charges, failed or pending transactions and problems with Chivo ATMs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Multiple people told The Block that they have called the Chivo helpline numerous times and heard that a tech support team will call them back or send an email about their case. However, they are still waiting for final resolution weeks or even months later.<\/span>","<span data-v-f87c67ca=\"\">It is not known exactly how many people have had these kinds of problems with the Chivo app, how many cases have been resolved nor the total amount of funds affected.&nbsp;<\/span><span data-v-f87c67ca=\"\">El Comisionado told The Block that they did not include small transactions of $50 or less in the thread, or reports that did not mention an amount.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What we do know is that people from different walks of life have reported issues with Chivo, from those who never wanted anything to do with the wallet all the way to crypto enthusiasts and supporters of President Nayib Bukele, who spearheaded the Bitcoin law. The problems have affected both people in El Salvador as well as those living abroad.<\/span>","<span data-v-f87c67ca=\"\">Some have been able to get their money back or cases resolved after contacting customer service. For example, a Twitter user named<\/span><span data-v-f87c67ca=\"\"> Gaby Rodriguez-Trippconey <\/span><a href=\"https:\/\/twitter.com\/_elcomisionado_\/status\/1472326563605581824\/photo\/1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> that someone had taken $3,921 from her bank account after making 13 fraudulent transactions in the name of Chivo, but then <\/span><a href=\"https:\/\/twitter.com\/gabsojitosverde\/status\/1476919845493121026\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said the issue was resolved<\/span><\/a><span data-v-f87c67ca=\"\"> after investigations by Chivo as well as her bank.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Others are still waiting, including Eliezer Hernandez Arias, one of several people who told The Block that they weren’t able to access Chivo due to their account being blocked. Hernandez says he hasn’t been able to access his Chivo account since November 3, with the exception of a few days following an app update in December when he could log in but not access his funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Hernandez said he was using Chivo to trade crypto <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-10-25\/el-salvador-s-bitcoin-speculators-are-stifled-in-chivo-crackdown\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">without a commission<\/span><\/a><span data-v-f87c67ca=\"\">, and that most of his friends in a 29-person Telegram group — who have also used the app for trading and scalping — have the same problem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I’ve tried everything. I’ve gone to the Chivo Points, I have called the call center every week since I’ve been blocked, I’ve gone to the prosecutor’s office and they haven’t given me a solution,” he said. “They only say my case is in the compliance department, and that they can’t give me more information.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since Hernandez holds a sizable amount of Bitcoin in Chivo Wallet he can’t access, he’s still trying to solve the problem. Over the past few weeks, he and his friends have noticed that the text of the error messages showing up when they try to access Chivo has changed. First, the messages said that the user or password is incorrect. Then, they noticed different errors, like that the telephone number is invalid or that the user needs to use a real telephone number to register.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block has separately viewed other examples of blocked or inaccessible accounts from other users. One showed a completely blank screen and another read in Spanish: “Failed verification — soon your account will be updated. Your registration will be reviewed by our support team.”<\/span>","<span data-v-f87c67ca=\"\">It’s unclear whether Chivo is blocking people for certain types of trading activity, identity verification issues or something else.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"> Chivo <\/span><a href=\"https:\/\/twitter.com\/chivowallet\/status\/1450190998542356481\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">did acknowledge in October<\/span><\/a><span data-v-f87c67ca=\"\"> that it had eliminated the ability for users to see a frozen Bitcoin price for up to a minute before trading. This had allowed people to check other exchanges in the meantime and<\/span> <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-10-25\/el-salvador-s-bitcoin-speculators-are-stifled-in-chivo-crackdown\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">perform speculative trading<\/span><\/a><span data-v-f87c67ca=\"\"> like scalping while that price was fixed (scalping is legal, but Chivo said it would be a type of fraud in this case due to the frozen prices).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Several people have also reported that they were unable to transfer funds between Chivo and other crypto wallets. Twitter user <\/span><a href=\"https:\/\/twitter.com\/soybalmory\/status\/1479548240789794817\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Balmory Parada<\/span><\/a><span data-v-f87c67ca=\"\"> posted on January 7 that he and his wife transferred $1,000 from Chivo to their Strike accounts via the Lightning Network, but two weeks later the transaction was still pending with the funds unavailable. <\/span>","<span data-v-f87c67ca=\"\">While it's possible some of these issues could have to do with other wallets, the sheer number of reports about failed or pending crypto transactions involving Chivo users raises questions about the app's role. <\/span><span data-v-f87c67ca=\"\">Another Chivo user, who asked that their name not be published due to fear over potential retribution for speaking out, told The Block that they tried to transfer $64.33 from Chivo to their Exodus crypto wallet on December 16. They said the transaction is still pending after at least 15 calls to Chivo’s customer service line, with the money still unavailable for use in Chivo.<\/span>","<span data-v-f87c67ca=\"\">To explore the app first hand, I attempted to make several transfers to two different individuals' Chivo accounts. The experiences couldn’t have been any more different.<\/span>","<span data-v-f87c67ca=\"\">First, I tried to send Bitcoin to a crypto-savvy Salvadoran named José under the condition that he return the funds immediately after receiving them. But according to Chivo, the funds never showed up in his wallet. <\/span>","<span data-v-f87c67ca=\"\">I had used Wallet of Satoshi to send two Lightning Network transactions for 24 sats and 1,193 sats to his Chivo wallet. But shortly after, he sent me a screenshot showing the transfers as “canceled” in Chivo, despite my receiving confirmations showing the transactions as paid.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then, I used my Coinbase wallet to send an on-chain Bitcoin transaction worth $4.25. Screenshots show that this transaction was also marked as “canceled” in Chivo, even though a Bitcoin block explorer showed that it had been confirmed. That means José’s wallet had indeed received my funds, but Chivo’s interface for some reason didn’t reflect the transaction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Next, I tried to send money to my friend Mario and the transaction worked perfectly. He quickly received both the Lightning and on-chain Bitcoin transactions and sent them back to my wallets without issue. <\/span>","<span data-v-f87c67ca=\"\">So yes, Chivo does work — just not all the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among the people who spoke with The Block about Chivo, one of the biggest complaints was that someone else had used their personal information to create accounts in their name or those of family members.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To open a Chivo account, a person needs an<\/span><span data-v-f87c67ca=\"\"> El Salvador ID number and a valid phone number. The app then asks for a photo of the ID and a selfie for facial recognition. Many Salvadorans have provided this information if only to get the free Bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But this verification system may not be foolproof. CoinDesk reported back in October that some people <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2021\/10\/29\/identity-thieves-exploit-el-salvadors-chivo-bitcoin-wallets-setup-process\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">have shown<\/span><\/a><span data-v-f87c67ca=\"\"> how they achieved verification — and therefore unlocked the $30 bonus — by apparently taking a photo of an ID photocopy instead of a physical one, and <\/span><a href=\"https:\/\/twitter.com\/mas_sv89\/status\/1444105230665359360?s=21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">snapping a “selfie” of a coffee mug<\/span><\/a><span data-v-f87c67ca=\"\"> or movie poster character instead of their actual face.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Whatever the reason, there are plenty of reports of people finding out they already had active Chivo accounts despite not having ever used the app.<\/span>","<span data-v-f87c67ca=\"\">Marisol, a marketing manager, told The Block that she had no interest in using the app, and so was surprised to find out upon downloading it that she already had an account. She contacted Chivo, and someone called her back to confirm an<\/span><span data-v-f87c67ca=\"\"> account had been set up using her personal information. Chivo ended up resetting the account and mentioned there had been a transaction. But she still doesn’t know who created it and had been hoping to find out so she could file a legal complaint.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ruth López, lawyer and legal chief of anti-corruption and justice at the human rights organization Cristosal, told The Block that the organization opened a special online platform to collect complaints about Chivo between October 9 and October 14 and again between November 5 and November 7. <\/span>About 1,200 people wrote in, with the majority of complaints having to do with their credentials being used by someone else without their consent to make or use Chivo accounts.&nbsp;","<span data-v-f87c67ca=\"\">López, who was herself was a victim of someone using her personal details to open a Chivo account, said Cristosal decided to open the commenting platform after noticing many complaints on social media and no word from the government.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“People who are public employees, for example, contacted me directly through my personal Twitter account telling me: 'Look, I wrote but I can’t present myself because I can’t take the risk, come out on a list and lose my job,'” López said.<\/span>","<span data-v-f87c67ca=\"\">According to López, many people are not even worried about the $30 as much as someone using their personal data to commit crimes that will later be traced back to them.<\/span>","<span data-v-f87c67ca=\"\">Despite these legitimate fears, “there was no institutional response,” said López. “There were many complaints and no public institution was doing anything.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Cristosal ha<\/span><span data-v-f87c67ca=\"\">s also launched two different types of legal actions related to Chivo that involve more than 200 individuals each but says the government has not acknowledged those either. “Public institutions are totally silent,” López said.<\/span>","<span data-v-f87c67ca=\"\">This official silence has left the kind of void that social media scambots are made to exploit. As people look for closure to solve their Chivo problems on social media, Twitter bots posing as official Chivo customer support accounts and individual agents respond immediately to almost any post mentioning the name of the wallet, asking for many of the same details that the real accounts do.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When I tweeted anything with the word “Chivo” in it, bots with names translating to things like “Chivo Wallet Support” and “Chivo Support” would <\/span><a href=\"https:\/\/twitter.com\/Lolo_RG\/status\/1480074587769610245\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">regularly be the first to respond. <\/span><\/a><span data-v-f87c67ca=\"\">The typical post was a kind offer to help followed by a suspicious link. Because these fake accounts generally set their profile picture with the blue-and-white Chivo logo, it’s clear to see how some people might be confused.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And yet, there seems to have been very little — if any — official warning from Chivo or the government about these scams and how to protect oneself since some <a href=\"https:\/\/twitter.com\/chivowallet\/status\/1448795837077803009\" data-v-f87c67ca=\"\">tweets on October 14<\/a>.&nbsp;Meanwhile, the official,<\/span> <a href=\"https:\/\/twitter.com\/chivowallet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter-verified Chivo account’s<\/span><\/a><span data-v-f87c67ca=\"\"> co<\/span><span data-v-f87c67ca=\"\">mmunication strategy is inconsistent, furthering confusion about who to talk to about problems with the app. <\/span>","<span data-v-f87c67ca=\"\">While the official account appears to have responded to some individual requests for help with the wallet in the past few months, it hasn’t posted an original status to its page since November 3.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite reaching out to multiple relevant government entities and startups for comment about Chivo’s issues, The Block was unable to reach any officials or companies who could clearly explain why people are reporting so many issues with the wallet.<\/span>","<span data-v-f87c67ca=\"\">While I was immediately able to reach a friendly agent when calling the Chivo international customer service line, they said they were unauthorized to share any information and directed me to the local El Salvador embassy. An agent at El Salvador’s consumer protection office directed me to El Salvador’s Superintendent of the Financial System. I reached out to that agency on WhatsApp and received a press contact, but didn’t receive an email back. El Salvador’s Casa Presidencial email did not answer an inquiry, either.<\/span>","<span data-v-f87c67ca=\"\">The Block was further unable to find any prominent, official public warnings about the fake Chivo Twitter bots and Facebook accounts, despite all the reports about the wallet not working.<\/span>","<span data-v-f87c67ca=\"\">It wasn’t always like this — in fact, the government used to be a lot more communicative about Chivo. In the early days, Bukele not only acknowledged Chivo’s issues but even played the role of IT support as he attentively updated his Twitter followers, which now total 3.4 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On <\/span><span data-v-f87c67ca=\"\">September 8, <\/span><span data-v-f87c67ca=\"\">Bukele t<\/span><span data-v-f87c67ca=\"\">old his followers<\/span><span data-v-f87c67ca=\"\"> that Chivo had completed a maintenance process leading to a few hours of downtime, and even encouraged people experiencing ongoing issues to post them in the comments of his thread and to <\/span><a href=\"https:\/\/consulta.chivowallet.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">fill out this form<\/span><\/a><span data-v-f87c67ca=\"\">. A<\/span><span data-v-f87c67ca=\"\"> few days later, Bukele tweet<\/span><span data-v-f87c67ca=\"\">ed that 95% of the problems with Chivo had been fixed, and that the app would be functioning at 100% in the next few days.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The only official social media activity recently about the wallet has been the announcement that a new company is involved with Chivo — Los Angeles-based digital identity provider, Netki. <\/span><span data-v-f87c67ca=\"\">Bukele shared a <\/span><a href=\"https:\/\/cointelegraph.com\/news\/el-salvador-s-bitcoin-wallet-onboards-4m-users-with-netki-partnership\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CoinTelegraph article<\/span><\/a> <span data-v-f87c67ca=\"\">that quoted a January 19 press release: “Through the use of Netki’s flagship KYC\/AML product, OnboardID, the Salvadoran government was able to onboard over four million users within 45 days onto its Chivo Wallet, while safeguarding the wallet from attempted airdrop fraud.” <\/span>","Dawn Newton, Netki founder and COO, told The Block on January 26 that it began working with Chivo \"recently\" and that its technology is present in all versions of the Chivo app. \"However, we were not part of the initial application,\" she said.&nbsp;&nbsp;","\"We have read the public reports of issues that arose before we were fully engaged with the project,\" Newton said, in response to a question about the blocked accounts and unauthorized use of credentials. \"Any questions regarding this should be directed to the Chivo team. Our tools are purpose-built to address these kinds of issues.\" Newton also clarified that Netki does not control blocking users' wallets.&nbsp;","El Faro also <a href=\"https:\/\/elfaro.net\/es\/202112\/el_salvador\/25906\/Athena-presume-la-Chivo-Wallet-pero-nadie-responde-por-sus-fallas.htm\" data-v-f87c67ca=\"\">pointed out<\/a> on December 17 that a New York-based company called AlphaPoint has posted several types of engineering positions on a <a href=\"https:\/\/alphapoint.com\/build-bitcoin-city-were-hiring-in-central-america\/\" data-v-f87c67ca=\"\">web page with the headline<\/a>: \"Build Bitcoin City: We're Hiring in Central America.\"","The website reads: \"AlphaPoint is thrilled to announce our involvement with the Government of El Salvador and the&nbsp;Chivo platform – the first ever national cryptocurrency wallet. We are actively looking to fill several positions that will work on the ground with our team, the El Salvadorian government, and various partners on this world-changing technology.\"","<span data-v-f87c67ca=\"\">Other major<\/span><span data-v-f87c67ca=\"\"> companies who have publicly stated involvement with the Chivo app did not provide any clear answers about why the wallet has been experiencing so many issues.<\/span>","<span data-v-f87c67ca=\"\">Athena Bitcoin, the firm that <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/124816\/the-startup-behind-el-salvadors-bitcoin-wallets-is-taking-the-product-global\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">developed key technology behind the Chivo wallet<\/span><\/a> <span data-v-f87c67ca=\"\">app and also owns and operates the country’s 200 Chivo-branded ATMs, did not respond to a December 20 inquiry about these Chivo issues. Athena recently <a href=\"https:\/\/www.theblockcrypto.com\/news+\/124816\/the-startup-behind-el-salvadors-bitcoin-wallets-is-taking-the-product-global\" data-v-f87c67ca=\"\">said<\/a> it plans to package the concept behind Chivo into a product that other governments and institutions could use.<\/span>","<span data-v-f87c67ca=\"\">However, an Athena spokesperson replied to a January 26 inquiry, directing questions to the company mentioned in Chivo's terms and conditions, Chivo S.A. de C.V. <\/span>\"Chivo SA fully controls the usage, technical direction, and management of the Chivo wallet and handles support of all related issues,\" they said. \"It's probably best that you connect [with] Chivo SA for insights therein.\"","Not much is known about Chivo S.A., although the local media outlet <a href=\"https:\/\/elfaro.net\/es\/202109\/el_salvador\/25707\/Chivo-es-una-empresa-privada-financiada-con-fondos-p%C3%BAblicos.htm\" data-v-f87c67ca=\"\">El Faro has reported<\/a> it is a private entity that owns the Chivo app.","<span data-v-f87c67ca=\"\">Latin America-focused crypto exchange Bitso, which previously told The Block that it is responsible for “custody services providing storage and security services for the Chivo wallet, as well as exchange services,” did not respond to questions about reported Chivo issues including unauthorized transactions and problems transferring to other wallets. <\/span>","<span data-v-f87c67ca=\"\">“I’ve discussed with the Bitso team and since they are not a front-end technology provider for the Chivo Wallet, they are unable to comment at this time,” a spokesperson for Bitso told The Block on December 23.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Buenos Aires-based Koibanx, which has <\/span><span data-v-f87c67ca=\"\">told The Block it is responsible for Chivo’s Lightning Network implementation<\/span><span data-v-f87c67ca=\"\">, did not respond by press time.<\/span>","<span data-v-f87c67ca=\"\">BitGo, which Forbes has reported is Chivo’s hot wallet provider, also did not respond to a request for comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For now, Chivo still appears to be inconsistent, with several outstanding issues. To be fair, it’s not the first financial app on the market to have glitches, and won’t be the last. But the lack of prompt resolutions continues to be a concern — especially for those who cannot access their balances in the app. <\/span>","<span data-v-f87c67ca=\"\">Some of the Salvadorans I spoke with said they would keep trying to get in touch with Chivo customer service representatives, while others have given up trying to resolve their issues. Some have moved on<\/span><span data-v-f87c67ca=\"\"> to more direct action: a group living in the US recently started a <\/span><a href=\"https:\/\/twitter.com\/Boicotchivo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chivo boycott,<\/span><\/a><span data-v-f87c67ca=\"\"> although its Twitter following is still small.<\/span>","<span data-v-f87c67ca=\"\">And many are still taking to social media to shout into the void. “Mr. President, let's start from the beginning,” Twitter user <\/span><a href=\"https:\/\/twitter.com\/rudpar70\/status\/1477804355571048452\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rudy Parada<\/span><\/a><span data-v-f87c67ca=\"\"> posted in early January. “The Chivo Wallet needs fixing; there are so many people complaining about it, and nobody helps. Come on!”<\/span>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's note:<\/strong> <span data-v-f87c67ca=\"\">Many of the Twitter posts and quotes featured in this article have been translated from Spanish.<\/span><\/em>","<em data-v-f87c67ca=\"\">Want to read more long-form articles from The Block? For access to more daily in-depth news features such as this one, <a href=\"https:\/\/www.theblockcrypto.com\/promotions\/join-the-block-intro\" data-v-f87c67ca=\"\">sign up for The Block's News Plus<\/a> membership.<\/em>"],"hashtag":["BITCOIN"]}