{"summary":"A miner has proposed forking the Ethereum network when it goes through the merge, creating a version that remains based on proof of work.\nButerin doesn’t see this potential forked network succeeding.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162066\/potential-ethereum-proof-of-work-fork-unlikely-to-succeed-says-vitalik-buterin","publishDate":"2022-08-08T08:00:02","id":2195,"type":null,"title":"Potential Ethereum proof-of-work fork unlikely to succeed, says Vitalik Buterin","category":["Ethereum"],"content":["The potential upcoming Ethereum proof-of-work fork is unlikely to have substantial long-term adoption, according to Ethereum co-founder Vitalik Buterin.","The idea of a fork gained traction over the past two weeks after popular Chinese crypto miner Chandler Guo — who was involved in the 2016 fork that resulted in Ethereum and Ethereum Classic — said he would fork the Ethereum blockchain, dubbing the new network “ETH POW.” The idea is that when the blockchain undergoes \"the merge\" and transitions to a proof-of-stake network, these miners would create a fork of the network that ignores the update and remains focused on mining. ","Appearing at ETHSeoul on Friday evening, Buterin answered questions from journalists during a Q&amp;A session, during which he addressed the potential impact of this kind of a hard fork on the Ethereum network.&nbsp;","In response to a question about this plan, Buterin said he doesn’t see an organic aspect to it and claimed it’s just a “couple of outsiders that basically have exchanges, and mostly just want to make a quick buck.”","\"I'm not expecting it to have substantial, long-term adoption,\" Buterin said.","Buterin acknowledged that there may be “a couple of splats on some markets in the meantime,” before adding “I hope that whatever happens, doesn't lead to people losing money.” This may refer to exchanges launching IOU products, enabling traders to take punts on what the value of the forked tokens will be, assuming they go ahead. <a href=\"https:\/\/www.theblock.co\/post\/162019\/three-crypto-exchanges-are-letting-traders-bet-on-tokens-for-anticipated-ethereum-fork\" data-v-f87c67ca=\"\">Three exchanges<\/a> are now offering such products.","The Ethereum co-founder – who stepped back from core Ethereum development a few years ago – also spoke about Ethereum Classic, adding that it has a “superior community and a superior product” for people who support proof-of-work values and preferences."],"hashtag":["ETHEREUM"]}