{"summary":"Tether issued a statement explaining why it is not freezing wallet addresses linked to Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165513\/tether-says-its-not-freezing-tornado-cash-until-government-tells-it-to","publishDate":"2022-08-24T14:30:28","id":2196,"type":null,"title":"Tether says it&#x27;s not freezing Tornado Cash addresses until government tells it to","category":["REGULATION"],"content":["Tether is upholding its decision not to freeze sanctioned wallet addresses with ties to Tornado Cash because it has not received any requests from US law enforcement or regulators to do so, the company said in a statement today.&nbsp;","The US Treasury Department's Office of Foreign Assets Control (OFAC) sanctioned the cryptocurrency mixer Tornado Cash on August 8, saying that criminals had used the service to launder more than $7 billion worth of virtual currency.&nbsp;","\"So far, OFAC has not indicated that a stablecoin issuer is expected to freeze secondary market addresses that are published on OFAC’s SDN List or that are operated by persons and entities that have been sanctioned by OFAC,\" Tether said in a statement, which appears to be responding to a <a href=\"https:\/\/www.washingtonpost.com\/business\/2022\/08\/24\/crypto-sanctions-tether\/\" data-v-f87c67ca=\"\">Washington Post article<\/a> that said the company \"may be in violation\" of the new Treasury Department sanctions aimed at Tornado Cash. \"Further, no US law enforcement agency or regulator has made such a request despite our near daily contact with US law enforcement whose requests always provide precise details,\" Tether said.","The Treasury Department now lists several sanctioned wallet addresses for ether (ETH) and Centre's dollar-pegged stablecoin USD Coin (USDC). While Tether's US dollar-pegged stablecoin USDT does not appear by name on the list, that currency can interact with ETH addresses using the ERC-20 token standard. For example, <a href=\"https:\/\/etherscan.io\/tokentxns?a=0xd90e2f925da726b50c4ed8d0fb90ad053324f31b\" data-v-f87c67ca=\"\">this Tornado Cash router address<\/a> processed a USDT payment days after the Treasury sanctions.","Tether said that it \"works closely\" with US law enforcement, and does freeze privately held wallets when it receives legitimate requests from authorities. But it said that it has not received any such requests from the United States government regarding the sanctioned wallets with ties to Tornado Cash.&nbsp;","\"Tether normally complies with requests from US authorities, being in contact with them almost on a daily basis,\" the company said. \"For example, we have been cooperating on various freezes with US law enforcement, including in the last two weeks after the OFAC public disclosure about Tornado Cash, and no specific request has been put to us related to freezing relevant Tornado Cash addresses.\"","Furthermore, Tether said that \"unilaterally freezing secondary market addresses could be a highly disruptive and reckless move\" on its part. \"Even if Tether recognizes suspicious activities on such an address, completing a freeze without the verified instruction of law enforcement and other government agencies might interfere with ongoing and sophisticated law enforcement investigations,\" it said.","Meanwhile, the wider crypto industry has been seeking clarity on what kind of actions it must take to comply with the Treasury Department sanctions. Earlier this week, Rep. Tom Emmer, R-Minn., <a href=\"https:\/\/www.theblock.co\/post\/165082\/congressman-demands-answers-from-yellen-on-tornado-cash-sanctions\" data-v-f87c67ca=\"\">wrote a letter<\/a> to Treasury Secretary Janet Yellen requesting answers about how the department plans to enforce these sanctions, considering they focus on computer code rather than specific individuals or companies.&nbsp;","<em data-v-f87c67ca=\"\">Editor's note: The headline of this story was updated for clarity.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 8","content":"DATE"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Tether","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Centre","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"US Treasury Department's Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Minn.","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["SANCTIONS","TETHER"],"authors":["Kristin Majcher","The Block"]}