{"summary":"Cryptocurrency miner Bitfarms, which is listed on Canada’s TSX Venture Exchange, has cut staff citing coronavirus effects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61102\/crypto-miner-bitfarms-lays-off-staff-citing-coronavirus-effects","publishDate":"2020-04-07T06:00:35","id":2198,"type":null,"title":"Crypto miner Bitfarms lays off staff citing coronavirus effects","category":["CRYPTOCURRENCY"],"content":["Cryptocurrency mining firm Bitfarms, which is listed on Canada’s TSX Venture Exchange, has cut staff citing coronavirus effects.","Announcing the news on Monday, Bitfarms <a href=\"https:\/\/www.businesswire.com\/news\/home\/20200406005886\/en\/Bitfarms-Update-Impact-COVID-19-Cost-Efficiency-Measures\" data-v-f87c67ca=\"\">said<\/a> the move is “temporary” in line with government guidance to help combat the spread of coronavirus. Bitfarms has also implemented “permanent measures” to reduce overhead costs to maintain “long term viability.\"","“Once fully implemented over the next several weeks, we expect the cost saving measures to reduce our monthly general and administrative expenses by approximately 20 to 25%,” said Bitfarms CFO John Rim.","Rim further said that cost-cutting measures would help Bitfarms “withstand short-term volatility in mining economics and remain profitable through the long-term, including potential challenges relating to the upcoming Bitcoin halving.”","The hotly-anticipated bitcoin halving event, which will reduce block reward from 12.5 to 6.25 bitcoins, is expected to occur next month.","It remains unclear how many people have been let go of and what is Bitfarms’ current headcount. The Block has reached out to the firm and will update this story should we hear back.","<a href=\"https:\/\/www.theblockresearch.com\/concerns-loom-for-one-of-canadas-biggest-bitcoin-miners-52206\" data-v-f87c67ca=\"\">Bitfarms<\/a> currently operates five computing centers in Quebec, Canada, “powered by clean and competitively priced hydroelectricity,” per the announcement.","The firm said despite the impact of the coronavirus pandemic and “significant” drop of bitcoin price on March 12, it has been able to “optimize mining operations in real time to maintain maximum computer capacity.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSince March 19, Bitfarms has maintained an average daily hashrate of approximately 750 petahash per second (PH).","“Our scale and quality of operations has allowed us to continue to generate positive cash flow in these difficult times,” said Bitfarms’ interim CEO and chief strategy officer Emiliano Grodzki.","Bitfarms joins a number of firms that have recently laid off their staff, including Galaxy Digital and Bitcoin.com. The former <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56024\/galaxy-digital-shaves-15-of-global-staff-report\" data-v-f87c67ca=\"\">shaved<\/a> 15% of its global workforce, while the latter <a href=\"https:\/\/decrypt.co\/24652\/roger-ver-says-bitcoin-com-only-cut-10-of-its-workforce\" data-v-f87c67ca=\"\">cut<\/a> 10% of its staff.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Emiliano Grodzki","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"Bitfarms","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"March 12","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"TSX Venture Exchange","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"John Rim","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Quebec","content":"LOCATION"}],"hashtag":["LAYOFFS"],"authors":["Yogita Khatri","The Block"]}