{"summary":"The court made the decision based on South Korea placing the extradition request before the United States and other relevant legal criteria.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283690\/montenegro-appellate-court-rejects-do-kwons-appeal-of-south-korean-extradition","publishDate":"2024-03-20T12:25:55","id":22,"type":null,"title":"Montenegro Appellate Court rejects Do Kwon&#x27;s appeal of South Korean extradition","category":["LEGAL"],"content":["Terraform Labs founder Do Kwon found no success in appealing his extradition to South Korea.&nbsp;","A court in the Balkan country of Montenegro rejected Do Kwon's appeal of his extradition to South Korea, according to an official <a href=\"https:\/\/sudovi.me\/ascg\/sadrzaj\/xb2l\" data-v-f87c67ca=\"\">statement<\/a>. The Montenegro Appellate Court made the decision based on South Korea placing the extradition request before the United States, as well as other relevant legal criteria related to the extradition of the same person to several countries.","The decision now locks in his extradition to South Korea, forbidding the United States or Do Kwon to fight the decision further, Do Kwon's lawyer told <a href=\"https:\/\/www.coindesk.com\/policy\/2024\/03\/20\/do-kwon-appeal-of-south-korea-extradition-rejected-by-montenegro-court\/?utm_medium=referral&amp;utm_source=rss&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\">CoinDesk<\/a>.&nbsp;","In early March, the high court of Podgorica, the capital of Montenegro, decided that Do Kwon's <a href=\"https:\/\/www.theblock.co\/post\/281138\/do-kwon-to-be-extradited-to-south-korea-after-court-reverses-extradition-to-us\" data-v-f87c67ca=\"\">extradition<\/a> would be to South Korea. This move reversed an earlier decision to send Do Kwon to the United States to face fraud charges related to the collapse of the Terra-Luna ecosystem, The Block previously reported.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/281306\/south-korean-terra-investor-wants-do-kwon-sent-to-us\" data-v-f87c67ca=\"\">Investors<\/a> in the Terra ecosystem and victims of its collapse hope to see Do Kwon tried in the United States, where they expect he would face a harsher punishment than in South Korea.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Montenegro Appellate Court","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Podgorica","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"Terra","content":"LOCATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["DO KWON"],"authors":["MK Manoylov","The Block"]}