{"summary":"Binance has announced that it will stop serving US individual and corporate customers on Binance.com in September\nNon-verified U.S. customers will likely still be able to bypass the restrictions and trade on Binance.com using a VPN\nBinance currently gets approximately 15% of its traffic from U.S. customers","author":["Larry Cermak","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27252\/us-customers-to-be-blocked-from-trading-on-binance-com","publishDate":"2019-06-14T02:28:48","id":220,"type":null,"title":"U.S. customers to be blocked from trading on Binance.com","category":["Exchanges"],"content":["Binance, the largest crypto-to-crypto exchange by volume, has <a href=\"https:\/\/www.binance.com\/en\/support\/articles\/360029196512\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">announced<\/a> that it will stop serving U.S. individual and corporate customers on its main platform, Binance.com.","The updated statement in <a href=\"https:\/\/www.binance.com\/agreement.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Binance's Terms of Use<\/a> reads that the company \"is unable to provide services to any U.S. person.\" Users who are not in accordance with Binance’s Terms of Use by Sept. 12 will continue to have access to their wallets and funds, but will no longer be able to trade or deposit on Binance.com.&nbsp;","In any given month, approximately 15% of Binance.com's traffic comes from U.S. customers, having halved since early 2018 when the figure was approximately 30%. It currently offers trading of more than 150 different cryptocurrencies.","","","Non-verified U.S. customers will likely still be able to bypass the restrictions and trade on Binance.com by using a VPN. Binance currently allows withdrawals of up to 2 BTC ($16,500) without any verification, although the updated policy suggested that \"some users may be required to furnish evidence showing that their account registrations are consistent with Binance’s Terms of Use.\" Those who violate its Terms of Use, it added, will not be able to use the platform.","Binance users will also look for comfort in the <a href=\"https:\/\/www.binance.com\/en\/blog\/346119082624540672\/Binance-Announces-Partnership-with-BAM-to-Launch-US-Exchange\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">announcement <\/a>yesterday that the company is launching a separate fiat-to-crypto <a href=\"https:\/\/www.binance.us\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">exchange to serve the U.S. market<\/a> in full regulatory compliance.","Changpeng Zhao, CEO of Binance, offered an optimistic outlook on the disruption on <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1139391325172715522\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Twitter.<\/a>","<span data-v-f87c67ca=\"\">\"Some short term pains may be necessary for long term gains. And we always work hard to turn every short term pain into a long term gain.\"<\/span>","The news comes two weeks after the main client of <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/binance-dex-to-geo-block-u-s-customers-and-28-other-countries-starting-in-july\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Binance DEX also announced<\/a> it would start geo-blocking U.S. customers and 28 other countries in July. Bittrex <a href=\"https:\/\/bittrex.zendesk.com\/hc\/en-us\/articles\/360028996652\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">announced<\/a> last week they would be geo-fencing 32 cryptocurrencies from the U.S. clients, following <a href=\"https:\/\/medium.com\/circle-trader\/poloniex-to-stop-offering-trading-of-9-assets-to-us-customers-all-assets-remain-available-to-b4c5703c0e9\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the same move by Poloniex<\/a> a couple of weeks ago.","Binance&nbsp;follows Bitfinex and BitMEX, which both started blocking U.S. customers in late 2017 as a result of the challenging regulatory climate. Huobi then <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/21\/huobi-aims-for-us-market-following-rebrand\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">started licensing<\/a> its technology and brand to a U.S.-based company HBUS (later rebranded to Huobi), similar to Binance's current plans for the U.S., having partnered with BAM Trading Services Inc - an unknown money services business listed in San Francisco.&nbsp;","While Binance traditionally offers crypto-to-crypto trading, it has already launched fiat-to-crypto exchanges in Uganda, Singapore, and Jersey, all of which only support trading of bitcoin, ether, and BNB. <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/14\/binance-the-misunderstood-master-plan-to-rule-the-crypto-universe-that-just-might-work\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">It plans to have two fiat-to-crypto exchanges on every continent,<\/a> which will likely also only support trading of bitcoin and ether initially."],"hashtag":["BINANCE","BLOCK"]}