{"summary":"As part of its efforts to get derivatives licensing, FTX.US met with CFTC leadership throughout August. \nMultiple CFTC commissioners issued public statements on crypto in the same timeframe.\nFor one commissioner, August 31 was his last day on the job. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116189\/ftx-us-met-with-the-cftcs-leadership-in-the-run-up-to-its-ledgerx-acquisition-announcement","publishDate":"2021-09-01T14:11:27","id":2202,"type":null,"title":"FTX.US met with the CFTC&#x27;s leadership in the run-up to its LedgerX acquisition announcement","category":["Regulation"],"content":["FTX has been on a charm offensive with U.S. commodities regulators.&nbsp;","This week, FTX.US, the U.S. affiliate of the global FTX brand, announced that it <a href=\"https:\/\/www.theblockcrypto.com\/post\/116134\/ftx-us-acquires-crypto-derivatives-exchange-ledgerx\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">acquired<\/a> LedgerX, a long-running crypto derivatives exchange that holds the licensure needed to offer futures, options and swaps for retail and institutional clients — specifically from the Commodity Futures Trading Commission (CFTC).","Ahead of the announcement, The Block learned, the FTX.US team held meetings with CFTC leadership.&nbsp;","“FTX and LedgerX leadership have met virtually with the CFTC Chairman and Commissioners, and staff, to introduce the FTX team and to brief them on the FTX-Ledger X partnership,” new general counsel Ryne Miller told The Block.","The CFTC is in charge of enforcing anti-fraud and market manipulation in commodity spot markets, with its regulatory authority limited to commodity-based derivatives. That's an especially tricky distinction when it comes to crypto, one that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/115420\/commissioner-stump-outlines-the-cftcs-authority-in-crypto-markets-and-its-limits\" data-v-f87c67ca=\"\">Commissioner Dawn Stump highlighted<\/a> on August 23.&nbsp;","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/linked\/113377\/crypto-exchange-ftx-us-hires-ryne-miller-as-general-counsel\" data-v-f87c67ca=\"\">Announced on August 3<\/a>, Miller's hiring was part of FTX.US's expanding compliance efforts. Miller himself formerly worked at the CFTC as legal counsel to then-Chair Gary Gensler, who now leads the Securities and Exchange Commission. In the new position, Gensler has been adamantly pushing for <a href=\"https:\/\/www.theblockcrypto.com\/post\/113416\/gensler-speech-crypto-defi-lending-sec\" data-v-f87c67ca=\"\">greater SEC oversight<\/a> over cryptocurrency markets.&nbsp;&nbsp;<\/span>","The Block originally learned of the CFTC meetings from a Freedom of Information Act request for Brian Quintenz's schedule, which showed that his meeting with FTX took place on August 4. The request returned no other results for meetings focused on crypto or blockchain that Quintenz took in July or August.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/113377\/crypto-exchange-ftx-us-hires-ryne-miller-as-general-counsel\" data-v-f87c67ca=\"\">FTX announced Miller's hiring<\/a>&nbsp;on August 3, meaning he spoke with Quintenz the very next day. Quintenz<a href=\"https:\/\/www.theblockcrypto.com\/linked\/115101\/brian-quintenz-crypto-friendly-cftc-commissioner-to-leave-office-at-end-of-august\" data-v-f87c67ca=\"\">&nbsp;announced his departure<\/a> from the CFTC on August 19, and <span data-v-f87c67ca=\"\">August 31 was his final day at the agency.<\/span>","<span data-v-f87c67ca=\"\">The CFTC’s response to The Block’s FOIA request included a Zoom invitation from <\/span>David Gilberg, who worked with Miller as a partner at law firm Sullivan &amp; Cromwell, Miller’s last job before heading to FTX. The invitation noted that the meeting was to \"provide some background on [FTX's] current business and its future plans, which may include CFTC regulated businesses.\"","<span data-v-f87c67ca=\"\">Some of the response was redacted under FOIA Exemption 4, which applies to “trade secrets and commercial or financial information obtained from a person and privileged or confidential.” <\/span>","<span data-v-f87c67ca=\"\">Quintenz declined to comment on the substance of the meeting.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among federal regulators, Quintenz has long been one of the most willing to engage with the crypto industry. On August 4, the morning of his meeting with Miller, he <\/span><a href=\"https:\/\/twitter.com\/CFTCquintenz\/status\/1422912721637580803\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> from his personal Twitter account that “Just so we’re all clear here, the SEC has no authority over pure commodities or their trading venues, whether those commodities are wheat, gold, oil….or #crypto assets.”<\/span>","<span data-v-f87c67ca=\"\">Indeed, August has seen the majority of Quintenz’s personal <a href=\"https:\/\/twitter.com\/BrianQuintenz\/status\/1427974978230759431\" data-v-f87c67ca=\"\">Twitter feed<\/a> and a good chunk of his <a href=\"https:\/\/twitter.com\/CFTCquintenz\/status\/1426570174036168704\" data-v-f87c67ca=\"\">CFTC feed<\/a> dedicated to promoting crypto regulation and, particularly, keeping Bitcoin and Ether out of the purview of the SEC.&nbsp;<\/span>","","&nbsp;"],"hashtag":["CFTC","FTX"]}