{"summary":"Chainalysis has raised fresh $13 million from Ribbit Capital and Sound Ventures\nRibbit Capital general partner and former Treasury official Sigal Mandelker has joined Chainalysis as an advisor\nChainalysis co-founder and CEO Michael Gronager told The Block: “We extended our Series B in order to meet demand for our services, primarily from government customers”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70627\/blockchain-analytics-firm-chainalysis-adds-13-million-to-its-series-b-funding-round","publishDate":"2020-07-07T11:41:17","id":2205,"type":null,"title":"Blockchain analytics firm Chainalysis adds $13 million to its Series B funding round","category":["Layer 1s"],"content":["Blockchain analytics firm Chainalysis is \"doubling down\" on its government business.&nbsp;To that end, the company has raised $13 million as part of an expanded Series B round and added a former U.S. Treasury official as an advisor. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe fresh dollars have been injected by Ribbit Capital and actor-turned-investor Ashton Kutcher's Sound Ventures.","\"We extended our Series B in order to meet demand for our services, primarily from government customers,\" Michael Gronager, co-founder and CEO of Chainalysis, told The Block. \"Government agencies understand that visibility into cryptocurrency is important to national security and that crypto crime does not let up during a pandemic. Importantly, this also has long-term benefits to the cryptocurrency industry.\" Chainalysis&nbsp;has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19764\/chainalysis-gets-funding-from-mufg-innovation-partners-and-sozo-ventures\" data-v-f87c67ca=\"\">previously raised<\/a> $36 million in its Series B round.","As part of today's round, Ribbit Capital's general partner and former undersecretary for terrorism and financial intelligence at the U.S. Department of the Treasury, Sigal Mandelker, has joined Chainalysis as an advisor.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMandelker said Chainalysis has done \"terrific\" work providing blockchain analysis and tools to financial institutions and government agencies and that she is \"excited to work with the Chainalysis team to help develop public-private partnerships, enhance ground-breaking technologies in financial services, and root out illicit networks.\"","Founded in 2014, Chainalysis provides blockchain transaction monitoring tools to businesses and governments. The firm has worked with a range of U.S. government agencies, including the Internal Revenue Service (IRS), the Drug Enforcement Administration, the Immigration and Customs Enforcement, and the Securities and Exchange Commission. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThese agencies have spent <a href=\"https:\/\/www.coindesk.com\/inside-chainalysis-multimillion-dollar-relationship-with-the-us-government\" data-v-f87c67ca=\"\">over $10 million<\/a> on Chainalysis's tools since 2015. This year alone, Chainalysis has been awarded approximately $2.8 million in revenue from federal contracts, <a href=\"https:\/\/www.theblockresearch.com\/org-chart-chainalysis-68923\" data-v-f87c67ca=\"\">as The Block Research reported last month<\/a>. The IRS has been responsible for approximately 67% of Chainalysis's government contracts this year, valued at about $1.9 million.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs part of its growth plans, Chainalysis said it would hire more staff across engineering, government sales, and other business functions. The firm's current headcount is 160, and it plans to hire up to 30 more people this year, Madeleine Kennedy, director of communications at Chainalysis, told The Block.","Today's expanded Series B round brings Chainalysis's total funding raised to date to $66 million, said Kennedy. She declined to provide valuation details, but according to details from Pitchbook, Chainalysis was <a href=\"https:\/\/www.theblockresearch.com\/org-chart-chainalysis-68923\" data-v-f87c67ca=\"\">last valued<\/a> at $266 million."],"hashtag":["SERIES B"]}