{"summary":"Platypus Finance, a DeFi protocol operating on the Avalanche network, fell victim to a security hack earlier today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256074\/platypus-finance-exploit-avalanche","publishDate":"2023-10-12T04:04:33","id":2207,"type":null,"title":"Platypus Finance suffers more than $2 million exploit on Avalanche: PeckShield","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Platypus Finance, a DeFi protocol operating on the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.026%\n    <\/span><\/a> <!----><\/span><\/span> network, fell victim to a security hack earlier today. An estimated loss of over $2 million was reported by security firm PeckShield.<\/span>","The project has responded by temporarily halting all of its liquidity pools. “Due to suspicious activities in our protocol, we have taken the proactive measure of temporarily suspending all pools. Further updates will be communicated to the community in a timely manner,” Platypus noted.","The incident appears to result from a flash loan attack, explicitly targeting the AVAX-sAVAX liquidity pool — although a formal comment on the attack vector has not yet been announced.","A flash loan is a feature in decentralized finance that allows users to borrow assets without collateral, provided they return the loan within the same transaction block. However, attackers have discovered methods to exploit this feature, manipulating market prices or taking advantage of vulnerabilities in DeFi protocols. By borrowing vast amounts, an attacker can create artificial market conditions, profiting from the induced discrepancies before repaying the loan, all within a single transaction block.","This isn’t the first hack for Platypus. A similar event took place in February 2023. During that incident, <a href=\"https:\/\/rekt.news\/platypus-finance-rekt\/\" data-v-f87c67ca=\"\">$8.5 million<\/a> was taken via a flash loan attack, targeting its newly launched stablecoin named USP.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PeckShield","content":"ORGANIZATION"},{"type":"-2.026%","content":"PERCENT"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$8.5 million","content":"MONEY"},{"type":"USP","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"February 2023","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}