{"summary":"Crypto&#x27;s leading policy think tank is weighing a court challenge to the Treasury&#x27;s sanctioning of decentralized transaction mixer Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163585\/coin-center-prepares-legal-challenge-to-treasurys-tornado-cash-sanctions","publishDate":"2022-08-15T11:55:13","id":2208,"type":null,"title":"Coin Center prepares legal challenge to Treasury&#x27;s Tornado Cash sanctions","category":["POLICY"],"content":["Coin Center, a crypto-focused policy think tank, is prepping a challenge to the Treasury's sanctions on Tornado Cash.","In an August 15 <a href=\"https:\/\/www.coincenter.org\/analysis-what-is-and-what-is-not-a-sanctionable-entity-in-the-tornado-cash-case\/\" data-v-f87c67ca=\"\">blog post<\/a>, Coin Center analyzed the contradiction of sanctioning a smart contract.&nbsp;\"By treating autonomous code as a 'person' OFAC exceeds its statutory authority,\" wrote Jerry Brito and Peter Van Valkenburgh, respectively Coin Center's executive director and director of research.","The Tornado Cash sanctions targeted the smart contract that runs the DeFi mixer as well as a fleet of crypto wallets associated with the coders behind the project. But, Coin Center argues, a smart contract, unlike other designated entities, cannot challenge a designation from the Treasury's Office of Foreign Assets Control in court.","\"This action sends a signal—indeed seems to have been intended to send a signal—that a certain class of tools and software should not be used by Americans even for entirely legitimate purposes,\" the blog says.&nbsp;","Laying out its plan for removing the designation, Coin Center promised that its first step was to engage OFAC. But, notably, the organization wrote \"we will begin exploring with counsel a court challenge to this action. Stay tuned.\"","Announced last week, the sanctions have been at the center of a storm of controversy. Since their announcement,&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/162817\/treasury-sanctions-on-tornado-cash-extend-far-beyond-the-us\" data-v-f87c67ca=\"\">Coin Center has flagged<\/a>&nbsp;the contradiction of calling a smart contract a sanctionable entity.&nbsp;&nbsp;","Coin Center has only sued one executive agency in the past. In June, the organization <a href=\"https:\/\/www.coincenter.org\/coin-center-has-filed-a-court-challenge-against-the-treasury-dept-over-unconstitutional-financial-surveillance\/\" data-v-f87c67ca=\"\">filed<\/a> against the Treasury over a new 60501 provision that entered the tax code in a <a href=\"https:\/\/www.theblock.co\/post\/161352\/us-senators-reintroduce-amendment-to-clarify-broker-definition-in-infrastructure-law\" data-v-f87c67ca=\"\">controversial provision<\/a> to last year's infrastructure bill.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Treasury's Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Peter Van Valkenburgh","content":"PERSON"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Jerry Brito","content":"PERSON"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"August 15","content":"DATE"}],"hashtag":["SANCTIONS"],"authors":["Kollen Post","The Block"]}