{"summary":"Immutable and Weracle partner in hopes of scaling tower defense game EF Defense.\nYet to achieve a mainstream hit, many web3 gamers are trying to unlock mass adoption with mobile titles.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241735\/immutable-teams-with-tower-defense-game-devs-hoping-for-web3-hit","publishDate":"2023-07-27T12:00:49","id":2208,"type":null,"title":"Immutable teams with tower defense game devs hoping for web3 hit","category":["Gaming"],"content":["<span data-v-f87c67ca=\"\">Mobile gaming veteran Weracle, the company behind Endless Frontier, is partnering with Immutable as it aims to woo gamers with its new blockchain-based title.<\/span>","<span data-v-f87c67ca=\"\">Weracle’s crypto game EF Defense will rely on Immutable’s Ethereum Virtual Machine rollup zkEVM, a technology that “offers low-cost, massive scale, enterprise-grade security and Ethereum smart contract compatibility,” the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">“The team at Weracle has years of experience working on web2 titles that millions of gamers already play,” said Andrew Sorokovsky, VP of global business development at Immutable. “Immutable zkEVM will undoubtedly help them make great strides in the world of web3 as well.”<\/span>","<span data-v-f87c67ca=\"\">Web3 gaming, where players can not only own, but also trade in-game assets minted on chain, has yet to go mainstream. Some companies are hoping winning over users of iPhones and Android devices is the way <a href=\"https:\/\/www.theblock.co\/post\/232038\/crypto-gods-unchained-eyes-2023-mobile-gaming-launch-apple-android\" data-v-f87c67ca=\"\">forward<\/a> as web3 game companies try to achieve active-player numbers in the millions rather than thousands.<\/span>","<span data-v-f87c67ca=\"\">EF Defense is a tower defense game — a popular genre on mobile devices — already available on Apple and Android devices, the company said. Weracle's non-blockchain, web2 title Endless Frontier has been downloaded 30 million times whiled generating more than $80 million in revenue, the company also said.<\/span>","<span data-v-f87c67ca=\"\">“Immutable has a proven track record servicing various web3 games,” Weracle CEO Myungyong Shin said. “This collaboration will allow us to learn invaluable expertise on promoting web3 games.”<\/span>"],"hashtag":[]}