{"summary":"There remains a lack of clarity surrounding the legal proceedings and rights of investors if crypto custodians enter a state of insolvency, according to a group of researchers from the Leiden Law School\nTo study this problem, the group analyzed how bitcoin is held and how its ownership can be created and transferred","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67321\/lack-of-legal-clarity-poses-investor-risks-if-crypto-custodians-go-bankrupt-study","publishDate":"2020-06-03T12:47:35","id":2209,"type":null,"title":"Lack of legal clarity poses investor risks if crypto custodians go bankrupt: study","category":["Custody"],"content":["There remains a lack of clarity surrounding the legal proceedings and rights of investors if crypto custodians enter a state of insolvency, according to a group of researchers from the Leiden Law School.","The researchers — Matthias Haentjens, Tycho de Graaf and Ilya Kokorin — published a study last month entitled \"<a href=\"https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=3589381\" data-v-f87c67ca=\"\">The Failed Hopes of Disintermediation: Crypto-custodian Insolvency, Legal Risks and How to Avoid Them<\/a>,\" where they discussed which rights investors have if a crypto custodian falls insolvent.","The group analyzed how bitcoin is held and how its ownership can be created and transferred. They looked into the status of deposited bitcoins by analyzing whether stored crypto assets are a part of the crypto custodian's insolvent estate or if customers can reclaim them. The group's study was based on the current terms and conditions of major crypto exchanges like Coinbase, Gemini and Kraken.","One of their key findings was that the rights of customers in insolvency proceedings depend on insolvency and property law, but that this is \"complicated by a lack of harmonized private international law rules that are appropriate for the specific nature of cryptocurrencies and the relations between customers and crypto-custodians.\" The paper referenced the Hague Securities Convention as a means of determining the applicable property law. This would give priority to the contractually agreed-upon law between the customer and crypto custodian.","According to the study, this can be easily verified by the parties involved, guaranteeing legal certainty and predictability.","The study found that courts have denied customers' revendication claims by referencing the cases of MtGox and BitGrail, two crypto exchanges that eventually closed. This is either because bitcoin cannot be the object of ownership or due to the commingling of deposited crypto assets. But under Dutch law, the situation can yield different results, provided that a customer of a crypto exchange can prove individualized bitcoins deposited with a crypto custodian have not been spent or reused.","Because a blockchain does not allow the commingling of bitcoins, it is possible to track each transaction and verify the number of bitcoins that remain in the address of the crypto custodian.","According to the study, under property law, rights to bitcoins can be absolute or embodied in a documentary intangible i.e. the physical carrier containing the wallet in which the public and private key-pair of the blockchain address is stored. Whoever can provide the public and private key-pair to a blockchain address to the miners and nodes first is the one whose transfer will be accepted \"to effectuate the bitcoin rights embodied therein,\" even though they may not be the real owner of the bitcoins.","Crypto custodians store cryptocurrency for customers in either pooled or segregated blockchain addresses. The group’s analysis found that pooled custody entails higher risk because the deposited bitcoins originally transferred to one customer could be used for the benefit of another. Therefore, customers should know if the crypto custodian plans to use the deposited bitcoins.","The study’s authors recommended that prohibiting or limiting the use of deposited assets could better protect customers from the risks of crypto custodian insolvency. This could be done by storing deposited bitcoins in separate blockchain addresses rather than in pooled ones. The study made three main recommendations: (1) that crypto investors should receive information on whether the crypto custodian will use deposited bitcoins, (2) that a crypto investor's claim to recover their bitcoin from an insolvent crypto custodian \"can be qualified as either contractual or proprietary in nature,\" and (3) that crypto custodians' reuse of deposited crypto assets should be prohibited or limited."],"hashtag":[]}