{"summary":"The CFTC has charged a DAO with breaking the law. Here’s what might come next for DAOs and governance token holders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173171\/a-crypto-lawyer-dissects-the-impact-of-the-cftc-targeting-daos","publishDate":"2022-09-28T05:16:04","id":2210,"type":null,"title":"A crypto lawyer dissects the impact of the CFTC targeting DAOs","category":["GOVERNANCE"],"content":["DAOs are in a precarious position right now — as is&nbsp;anyone who has ever voted in a decentralized autonomous organization that provides any sort of financial service.","The Commodity Futures Trading Commission’s (CFTC's) federal <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\">civil enforcement action<\/a> against Ooki DAO in the U.S. District Court for the Northern District of California is a big statement by an agency that wants to show that DAOs are not a viable means of evading responsibility. In fact, they might be a particularly high-risk way of running a financial service.&nbsp;","It’s not a done deal — the case still needs to go to court — but, if the CFTC has its way, it could have <a href=\"https:\/\/www.theblock.co\/post\/172416\/whats-next-for-daos-breaking-down-the-cftcs-latest-enforcement-action\" data-v-f87c67ca=\"\">large implications<\/a> for the hundreds of thousands of people who have voted in DAOs, and for the DAOs themselves.&nbsp;","We sat down (virtually) with Matthew Nyman, a lawyer who works in the Banking and International Finance practice at CMS London and specializes in cryptocurrency and decentralized finance, to dive deeper into its potential ramifications.","He started by saying these concerns are nothing new.","“This is something which lawyers and people in the DAO community have been talking about for years now. So that's why this is just such a huge case,” said Nyman.","Nyman explained that lawyers have already been warning that DAOs could be conceived as partnerships or unincorporated associations, so the CFTC’s latest move did not astonish them &nbsp;— but they will be watching to see the outcomes in court.&nbsp;","Nyman noted that he hoped the DAO will have sufficient funds to defend itself, so that both sides of the issue are presented in court and would lead to a fair outcome, rather than letting the CFTC establish a potentially bad precedent.","One question this court case might raise is the issue of liability, Nyman said. He explained that, for an unincorporated association, each member is liable for the actions of any other member of that group — and they all have unlimited liability. Companies were created to protect individuals and reduce their liability. He asked whether this should also apply to DAOs.","The other key issue is whether a group of people operating through pseudonymous wallets connected via software counts as a group of people banding together. He questioned that, if this is the case, do we need a new legal approach to support this?","Were the CFTC to get its way, this could place DAOs in a tricky legal situation.","Nyman pointed to one of the issues highlighted in Commissioner Summer Mersinger’s letter of dissent, which disagreed with the way the agency was approaching the enforcement.&nbsp;The fundamental problem is that DAOs, by their very nature, couldn’t be compliant with CFTC rules. This would effectively outlaw this type of construct for any purposes related to financial tools that come under the CFTC’s purview.","“They're kind of putting the DAO in a Catch-22 situation where just because they're a DAO doesn't mean they're not subject to the jurisdiction of the CFTC. But actually, because they're a DAO, they probably can't comply and therefore there's no way for them to be compliant,” Nyman said.","Yet, while DAOs are largely decentralized, and members can drop in and out of the governance forums and participate as much as they wish — since it’s not just code — there are people that the CFTC can go after.&nbsp;This shows that, if the regulators can find some centralized element involving people in some capacity, they will try to find a way of holding those people liable. “And that's exactly what the CFTC is doing,” Nyman said.","Nyman added that the issue is a lack of decentralization. He considered that you could have some form of offline governance — such as having individuals upload alternative pieces of code to improve protocols — rather than having token holders vote on what should be approved. This would be more akin to the way protocols are developed, where anyone can hard fork the network and make their own changes.","For now, DAOs will need to wait to see what happens in court — and if the Ooki DAO fights back against the charges. If the charges do go ahead in their current form, DAOs offering financial services will only really have two options, according to Nyman.","First, DAOs might take the legal route and set up operations in jurisdictions that support DAOs as legal entities, such as Wyoming or the Marshall Islands. There, DAOs can go into a legal wrapper, he explained — but he asked whether other jurisdictions would respect such entities.","The other option is that DAOs might embrace anonymity and seek to obfuscate activity related to people. “Obviously, it's a very high-risk legal territory there that will kind of push activity underground,”&nbsp;Nyman said.","The consequence of taking the latter approach is that it would stop DAOs from being able to engage with regulated legal entities. For example, MakerDAO is currently engaging with Huntingdon Valley Bank, a U.S.-based regulated bank founded in 1871, to let the bank borrow dai tokens. This kind of cooperation would not be possible were DAOs to operate fully outside of the regulatory system, Nyman explained.","Still, there is a silver lining to the CFTC’s decision to go after DAOs, Nyman noted: “I think this creates some kind of legal tension, which will motivate people to push for legislative change — because they now have the risk.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CMS","content":"ORGANIZATION"},{"type":"1871","content":"DATE"},{"type":"International Finance","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Nyman","content":"PERSON"},{"type":"Matthew Nyman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Huntingdon Valley Bank","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Marshall Islands","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"22","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Northern District of California","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"}],"hashtag":["CFTC"],"authors":["Tim Copeland","The Block"]}