{"summary":"Spot bitcoin ETF market will be “winner takes most,” according to Bitwise’s Matthew Hougan.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237388\/bitcoin-etfs-will-be-winner-take-most-market-says-bitwise-exec","publishDate":"2023-07-02T08:07:20","id":2211,"type":null,"title":"Bitcoin ETFs will be &#x27;winner takes most&#x27; market, says Bitwise exec","category":["Markets"],"content":["The list of contenders vying for approval from the US Securities and Exchange Commission to launch a spot bitcoin ETF continues to grow, but only a select few of those products will wind up being successful, according to Matthew Hougan of Bitwise.&nbsp;","\"ETFs are generally a 'winner takes most' market,\" Hougan, whose firm refiled its application for a spot bitcoin ETF on June 16, told The Block.&nbsp;","Typically, the firm that is first to market snags the most assets under management. The largest gold, crude, and crypto equity ETFs were first movers in their respective sectors, with SDPR's Gold Trust currently boasting nearly double the amount of assets of its closest competitor.&nbsp;","Hougan explained that second-to-market ETFs have a more difficult time competing. Here's Hougan","\"Imagine ETF A launches on Monday and ETF B launches on Tuesday. On Monday, ETF A will attract 100% of the assets and 100% of the trading volume. When ETF B launches on Tuesday, it will be competing with a larger and more liquid fund. All else equal, if you're choosing between a large\/liquid ETF and a smaller\/illiquid ETF, you're going to choose the large\/liquid ETF. This makes it hard for second-to-market ETFs to compete.\"","Nate Geraci, president of ETFStore, agreed, noting that it can even be&nbsp; difficult for a larger issuer to overcome the second-to-market disadvantage and it usually requires them to undercut on fees by leveraging their scale and broader distribution.&nbsp;","\"So with bitcoin ETFs, I believe iShares could actually come in late and still take meaningful market share,\" Geraci noted. \"Much, much tougher (nearly impossible) for smaller issuers to come in late.\"","Thus far, financial market titans Fidelity and BlackRock have filed alongside smaller brands like Valkyrie Investments, WisdomTree, and Invesco.&nbsp;","Cathie Wood's ARK, which filed for a spot bitcoin ETF with European asset manager 21Shares, said last week that it was first in line to get approval from regulators, as noted by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-06-26\/cathie-wood-s-ark-says-it-s-first-in-line-for-spot-bitcoin-etf-btc\" data-v-f87c67ca=\"\">Bloomberg News<\/a>. Still, there is a possibility that the agency could greenlight all the recent funds that filed to level the playing field.&nbsp;","In that instance, you would likely see a few types of winners emerge across three categories.","\"I imagine some investors will favor specialist ETF providers like Bitwise, some will favor more traditional firms like BlackRock, and some will look for the cheapest option,\" Hougan said."],"hashtag":[]}