{"summary":"A new bitcoin futures exchange traded fund (ETF) by Hashdex could be a game-changer for traditional bitcoin ETF hopefuls. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170562\/a-new-bitcoin-futures-etf-signals-possible-step-forward-in-u-s-regulation","publishDate":"2022-09-15T16:59:24","id":2216,"type":null,"title":"A new bitcoin futures ETF signals possible step forward in U.S. regulation","category":["REGULATION"],"content":["A new bitcoin futures exchange traded fund (ETF) by Hashdex could be a game-changer for traditional bitcoin ETF hopefuls.&nbsp;","The Hashdex Bitcoin Futures ETF is slated to list tomorrow on NYSE Arca under the ticker $DEFI after getting the green light from the Securities and Exchange Commission (SEC). Though the product itself isn't novel – <a href=\"https:\/\/www.theblock.co\/linked\/124332\/vanecks-bitcoin-futures-etf-to-list-tomorrow\" data-v-f87c67ca=\"\">multiple<\/a> bitcoin futures ETFs have <a href=\"https:\/\/www.theblock.co\/linked\/120894\/bitcoin-futures-etf-slated-to-list-monday\" data-v-f87c67ca=\"\">reached<\/a> the market – its wrapper is. Unlike other bitcoin futures ETFs, it received approval under the Securities Act of 1933, which could possibly be used to get SEC approval for physical bitcoin ETFs.","Multiple futures-based products have listed under the Investment Company Act of 1940, which Gavin Filmore, COO of Toroso Investments, which participated in the creation of the fund, said cannot become physical products, though a '33 Act could. The approval of a crypto product under the '33 Act, even if it's another futures fund, could be seen as an important shift in regulatory sentiment.","\"I would say to a savvy market participant who understands these two wrappers and the nuances within them and what it could mean from a regulatory approval standpoint, that is a fair view, that this could be a small step in that direction,\" Filmore said in an interview with The Block. \"But it really is about the wrapper. It's not about this product. It's about the wrapper being utilized for crypto exposure.<i data-v-f87c67ca=\"\">\"<\/i>","The SEC has appeared to be reluctant to approve crypto products under the '33 Act until now. In Aug. 2021, SEC <a href=\"https:\/\/www.theblock.co\/post\/113416\/gensler-speech-crypto-defi-lending-sec\" data-v-f87c67ca=\"\">Chair Gary Gensler said<\/a> he'd be interested in approving bitcoin futures products under the Investment Company Act of 1940, a path that effectively closed off approval to spot-based products.&nbsp;","The '40 Act regulates investment companies, mutual funds and their product offerings, while the '33 Act lays out a registration and disclosure process for securities offerings. Products under the '40 Act have a specific structure that precludes physical products, while the '33 Act allows for a broader range of offerings holding a variety of assets.","Hashdex elected to go the '33 route not out of novelty, but because it appeared to be the best wrapper for the product, mainly due to tax efficiency. The ETF was developed with Teucrium Trading, a ’33 act fund specialist focused on commodities funds and Victory Capital Management.","In its regulatory process, Hashdex head of new markets Bruno Sousa said the scrutiny of crypto products appears to be more about how the product itself works rather than scrutiny of crypto as a whole, which he said is a positive.","\"I think there is a normalization of the asset class that all of us who have been involved in crypto for some years knew that was going to happen at some point,\" Sousa said.","That long road has led it to list in a down market. ProShares' $BITO has slumped 70% since going public in October, echoing wider market fallout.","TradingView","But as Sousa noted, industry players often say the best time to build is in a bear market.&nbsp;","<em data-v-f87c67ca=\"\">This story was updated to reflect Teucrium Trading and Victory Capital Management’s participation and corrected to reflect Toroso’s role as participating in the fund.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"COO of Toroso Investments","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"1940","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Victory Capital Management","content":"ORGANIZATION"},{"type":"Filmore","content":"PERSON"},{"type":"1933","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Sousa","content":"PERSON"},{"type":"Gavin Filmore","content":"PERSON"},{"type":"Aug. 2021","content":"DATE"},{"type":"Teucrium Trading","content":"ORGANIZATION"},{"type":"$DEFI","content":"MONEY"},{"type":"$BITO","content":"MONEY"},{"type":"Teucrium Trading and Victory Capital Management","content":"ORGANIZATION"},{"type":"Bruno Sousa","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"NYSE Arca","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}