{"summary":"Climate change has emerged as a defining 21st century issue. The ability to sustain life on earth and to mitigate widespread ecological collapse is directly dependent on the world’s collective ability to reduce emissions and transition to a low-carbon global economy as quickly as possible. The good news? There are innovative new technologies and new ways of organizing human and economic activity that are rooted in trust, integrity and validation, and therefore hold tremendous promise. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251897\/centigrade-powers-the-next-evolution-in-carbon-markets","publishDate":"2023-09-20T09:01:02","id":2219,"type":null,"title":"Centigrade Powers the Next Evolution in Carbon Markets","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Climate change has emerged as a defining 21st century issue. The ability to sustain life on earth and to mitigate widespread ecological collapse is directly dependent on the world’s collective ability to reduce emissions and transition to a low-carbon global economy as quickly as possible. The good news? There are innovative new technologies and new ways of organizing human and economic activity that are rooted in trust, integrity and validation, and therefore hold tremendous promise.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Introducing Centigrade: Innovative Infrastructure for Carbon Markets<\/b>","<a href=\"http:\/\/www.centigrade.earth\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Centigrade<\/span><\/a><span data-v-f87c67ca=\"\"> is an open data platform serving the global carbon and nature markets. The platform will provide developers of carbon and nature credits with a low-barrier, intuitive way to bring their projects to market, providing full data transparency and traceability for the entire lifecycle of credits. It aims to open global credit markets to all carbon and nature developers—regardless of size and location—and boost the availability of capital needed to scale carbon removal and nature restoration projects to the required level.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Why Centigrade and Why Now?<\/b>","<span data-v-f87c67ca=\"\">In the race to limit rising temperatures, the priority is to reduce emissions. While carbon markets hold promise as a hedge against climate change in addition to decarbonization efforts, the <\/span><a href=\"https:\/\/ripple.com\/insights\/how-carbon-credits-can-finance-climate-action\/?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_three\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">market for carbon credits<\/span><\/a><span data-v-f87c67ca=\"\">—the purpose of which is to help offset temporarily unavoidable emissions and fund climate mitigation activities—is suffering a crisis of confidence. This is in part due to doubts cast on the efficacy and durability of its inventory, but also because (in its current incarnation) it is glacially slow, inefficient and not scalable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite the earnest efforts of its early architects, today’s carbon markets are bereft. There is a lack of high quality supply, as defined by important factors like provable climate impact (can you measure it?), additionality (is it new?) and permanence (will it last?). This is in part because carbon removal companies do not have the capital they need to grow their projects. Demand and the capital that flows from it is stuck; held back by outdated, overly centralized market mechanisms that have created a lack of transparency and trust, long and laborious due diligence processes and unnecessary risk. Put another way, today’s carbon markets are underperforming: they are addressing less than 1% of the problem, far from their vast and vital potential.<\/span>","<span data-v-f87c67ca=\"\">Another problem is that carbon markets are too narrow. They have been overly focused on carbon, and the role of trees—reforestation, afforestation, avoided deforestation—in solving the crisis. In fact, there is a broad and diverse range of climate positive activity across the elements that make up our natural world; not only carbon, but also air, water, soil, biodiversity and the human element, sometimes referred to as equity. This is a holistic ecosystem view and something markets should fully embrace and more intentionally reflect if they are to deliver the intended environmental, human and economic impacts.<\/span>","<b data-v-f87c67ca=\"\">Innovating the Way Forward, Together<\/b>","<span data-v-f87c67ca=\"\">So, what can be done to help modernize and scale carbon markets?<\/span>","<b data-v-f87c67ca=\"\">Blockchain as a Catalytic Tool<\/b>","<span data-v-f87c67ca=\"\">Ripple and other industry players recognize that <\/span><a href=\"https:\/\/www.weforum.org\/whitepapers\/recommendations-for-the-digital-voluntary-and-regulated-carbon-markets\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blockchain can be a catalytic tool for helping global carbon markets<\/span><\/a><span data-v-f87c67ca=\"\"> reach their full potential. At its core, blockchain enables more efficient transactions. Unlike proof-of-work blockchains, the open source blockchain technology that powers Ripple’s solutions, <\/span><a href=\"https:\/\/xrpl.org\/impact.html?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_three\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the XRP Ledger<\/span><\/a><span data-v-f87c67ca=\"\">, is natively sustainable, requiring low amounts of energy and no cryptocurrency mining. The XRPL is the first major blockchain to achieve net zero status through the purchase of renewable energy for its remaining energy use.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While it is by no means a panacea, <\/span><a href=\"https:\/\/ripple.com\/insights\/how-blockchain-powered-carbon-markets-combat-climate-change\/?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_three\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blockchain technology is well suited to solve some of carbon markets’ most persistent pain points<\/span><\/a><span data-v-f87c67ca=\"\">, including double counting (and fraud); a lack of scalability due to outdated, low technology market infrastructure; and low transparency and trust. Blockchain can help digitize carbon credits in a way that improves their reliability, specificity and trustworthiness as investable, durable assets.<\/span>","<b data-v-f87c67ca=\"\">The Journey Towards a Greener Future Continues<\/b>","<span data-v-f87c67ca=\"\">As with any technology, blockchain is a potentially powerful solution, but it is “neutral,” offering capabilities that need to be harnessed appropriately with the real-world needs of market participants and desired outcomes in mind.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For the past year, Ripple has been collaborating with CarbonCure, BC Biocarbon, Carbon Title, Xange, Thallo, Intrinsic Methods and Newlight Technologies to <\/span><a href=\"https:\/\/www.theblock.co\/post\/239310\/tokenizing-real-world-assets-the-opportunity-and-impact-of-carbon-credits-as-financial-tools\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tokenize their inventory<\/span><\/a><span data-v-f87c67ca=\"\"> in ways that capture the full value and diversity of their projects, methodologies and impact.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The inception of Centigrade marks an important next step in the global fight against climate change and how to leverage today’s technology to fulfill the promise of a better tomorrow.<\/span>","<span data-v-f87c67ca=\"\">Visit <\/span><a href=\"http:\/\/www.centigrade.earth\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">http:\/\/www.centigrade.earth<\/span><\/a><span data-v-f87c67ca=\"\"> to learn more.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Ripple<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Catalytic Tool","content":"ORGANIZATION"},{"type":"Carbon Markets","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"earnest","content":"LOCATION"},{"type":"Carbon Title","content":"ORGANIZATION"},{"type":"Xange","content":"LOCATION"},{"type":"Newlight Technologies","content":"ORGANIZATION"},{"type":"Greener Future Continues","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}