{"summary":"DeFi lender Aave says it will require a DAO governance vote to implement any smart contract-level censorship related to government sanctions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163586\/aave-says-on-chain-wallet-address-censorship-will-require-dao-consensus","publishDate":"2022-08-15T13:27:43","id":2220,"type":null,"title":"Aave says on-chain wallet address censorship would require DAO consensus","category":["REGULATION"],"content":["Decentralized finance (DeFi) lending protocol Aave has said wallet monitoring due to government sanctions cannot be enforced on a smart contract level unless the community agrees to it, the platform told The Block.","“The wallet monitoring here is only at the front-end layer,” Aave told The Block referring to the platform’s new policy to screen users following the <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">Tornado Cash sanctions<\/a>.","“As for on-chain, contract-level [wallet monitoring] as it applies to the Aave Protocol, the Aave smart contracts are decentralized — no one person or entity can change, control, update or shut down the protocol. For any change to occur to the protocol, an AIP would have to be proposed, voted on, and approved by the Aave DAO,” Aave added in a statement to The Block.","For context, AIP stands for Aave Improvement Proposals. AIPs are submitted to the Aave DAO governance for discussions and possible on-chain voting before being implemented on the protocol. Aave DAO is the decentralized autonomous organization that oversees the protocol.","The DeFi lender also clarified that the recent block on wallet addresses with indirect Tornado Cash interactions only occurred on its front-end app.","Several notable crypto personalities, including The Daily Gwei newsletter founder Anthony Sassano and Tron creator Justin Sun, reported that their wallet addresses were blocked on Aave. Both Sassano and Sun were among notable public figures whose wallets were involved in a <a href=\"https:\/\/www.theblock.co\/post\/162465\/crypto-notables-are-being-sent-eth-from-sanctioned-tornado-cash-wallets\" data-v-f87c67ca=\"\">Tornado Cash “dusting” inciden<\/a>t where someone sent 0.1 ETH to several publicly-known wallet addresses. This dusting incident was in response to the sanctions imposed on Tornado Cash by the US Treasury.","Aave quickly rectified the situation once news emerged that it was blocking access to its platforms for wallets with only indirect interaction with the sanctioned crypto mixer. The DeFi lender has since said the temporary blocklist happened due to a misconfiguration of the platform’s TRM API integration. <a href=\"https:\/\/www.theblock.co\/linked\/126602\/blockchain-forensics-outfit-trm-labs-secures-60-million-in-series-b-funding\" data-v-f87c67ca=\"\">TRM is a compliance solution<\/a> utilized by several crypto companies. Aave says it has corrected the misconfiguration and that its front-end should be accessible to previously blocked users who do not have any direct interactions with Tornado Cash.","Aave is not the first crypto app to block wallets from its front-end. Decentralized exchange platform <a href=\"https:\/\/www.theblock.co\/post\/143036\/uniswap-labs-now-blocks-crypto-wallets-frontend\" data-v-f87c67ca=\"\">Uniswap did so<\/a> in April, long before the Tornado Cash sanctions. The sanctioned mixer itself was also <a href=\"https:\/\/www.theblock.co\/post\/142081\/ethereum-mixer-tornado-cash-now-blocks-sanctioned-addresses\" data-v-f87c67ca=\"\">blocking sanctioned addresses<\/a> from its front-end as early as well.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sassano","content":"PERSON"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Uniswap","content":"PERSON"},{"type":"AIP","content":"ORGANIZATION"},{"type":"Aave Improvement Proposals","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"April","content":"DATE"}],"hashtag":["AAVE","CENSORSHIP"],"authors":["Osato Avan-Nomayo","Frank Chaparro","The Block"]}