{"summary":"Ethereum core developers have deployed the Dencun upgrade, which incorporates proto-danksharding (EIP-4844), on the Holesky test network.\nThe Holesky implementation marks the final Ethereum testnet upgrade before an anticipated mainnet deployment of Dencun in March.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276421\/ethereum-dencun-upgrade-holesky-testnet","publishDate":"2024-02-07T06:52:23","id":2220,"type":null,"title":"Ethereum developers deploy Dencun upgrade on Holesky testnet","category":["Crypto Ecosystems"],"content":["Ethereum core developers have implemented the Dencun upgrade on Holesky, marking the final Ethereum testnet upgrade before an anticipated mainnet deployment next month.","The Dencun upgrade was <a href=\"https:\/\/holesky.beaconcha.in\/\" data-v-f87c67ca=\"\">forked<\/a> on the Holesky testnet at around 6:35 a.m. ET, as <a href=\"https:\/\/x.com\/NethermindEth\/status\/1755194252999413859?s=20\" data-v-f87c67ca=\"\">confirmed<\/a> by Ethereum execution client Nethermind, and <a href=\"https:\/\/x.com\/parithosh_j\/status\/1755198250456408297?s=20\" data-v-f87c67ca=\"\">finalized<\/a> soon after.","The phased approach for implementing the upgrade previously saw Dencun deployed on the <a href=\"https:\/\/www.theblock.co\/post\/273050\/ethereum-dencun-goerli-proto-danksharding\" data-v-f87c67ca=\"\">Goerli<\/a> testnet on Jan. 17 and the <a href=\"https:\/\/www.theblock.co\/post\/275285\/ethereums-dencun-upgrade-goes-live-on-sepolia-testnet\" data-v-f87c67ca=\"\">Sepolia<\/a> testnet on Jan. 30. A date for the mainnet deployment of Dencun is now expected to be set during the Ethereum All Core Developers call tomorrow — <a href=\"https:\/\/x.com\/sassal0x\/status\/1755025850905604271?s=20\" data-v-f87c67ca=\"\">anticipated<\/a> for early to mid-March.","Dencun combines the Cancun and Deneb upgrades on Ethereum, with Cancun targeting improvements in the execution layer and Deneb focusing on enhancements to the consensus layer.","Proto-danksharding (<a href=\"https:\/\/www.eip4844.com\/\" data-v-f87c67ca=\"\">EIP-4844<\/a>), a major feature of Dencun, will introduce \"blobs,\" allowing for the temporary storage and access of large amounts of off-chain data by Ethereum nodes to reduce storage demands. It is designed to substantially lower transaction costs for Ethereum dapps — particularly benefiting Layer 2 rollup chains as it facilitates more cost-effective and scalable data processing.","Ethereum’s last major upgrade, <a href=\"https:\/\/www.theblock.co\/post\/226036\/ethereum-shapella-upgrade-goes-live\" data-v-f87c67ca=\"\">Shapella<\/a>, took place in April 2023 — enabling users and validators to withdraw their staked ether on the network for the first time."],"hashtag":["ETHEREUM"]}