{"summary":"Search volumes for blockchain-related keywords saw staggering breakouts on Chinese search engine Baidu and messaging app WeChat on Friday\nThe word “blockchain” was searched 72,049 times on Baidu on Friday, a 1,382.79% surge compared to the day before","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44795\/blockchain-search-volumes-skyrocketed-in-china-following-president-xis-remarks","publishDate":"2019-10-27T13:11:55","id":2226,"type":null,"title":"Blockchain search volumes skyrocket in China following President Xi&#x27;s remarks","category":["China"],"content":["Search volumes for blockchain-related keywords saw staggering breakouts on Chinese search engine Baidu and messaging app WeChat, following China President Xi Jinping's public support of blockchain on Friday, Oct. 25.&nbsp;","The word \"blockchain\" was searched 72,049 times on Baidu on Friday, a 1,382.79% surge compared to the day before. The same word also saw 329% growth on WeChat and was searched for 3,331,874 times. The positive momentum continued into the weekend, with the search volumes for \"blockchain\" increased by around 170% on both WeChat and Baidu on Saturday.&nbsp;","Meanwhile, search volumes for \"bitcoin\" did not gain as strong an upswing as \"blockchain,\" and even saw a slight 5% dip on Friday on both WeChat and Baidu. However, the word picked up traction the day after and rose by 144% on WeChat and by 216% on Baidu.&nbsp;","&nbsp;","Chinese Internet users' sudden intensified interest in blockchain and bitcoin is largely due to President Xi's endorsement of blockchain. In a meeting on Thursday with the Communist Party leadership, Xi <a href=\"https:\/\/www.theblockcrypto.com\/post\/44646\/xi-jinping-says-to-let-china-take-the-leading-position-in-blockchain\" data-v-f87c67ca=\"\">stressed<\/a> that China should commit to developing blockchain and take the leading position in this technology.&nbsp;","Although various Chinese government officials have <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35493\/chinas-central-bank-digital-currency-is-ready-after-5-years-of-development\" data-v-f87c67ca=\"\">made comments<\/a> on blockchain and cryptocurrencies in the past, Xi's remark is likely the highest-profile public approval of blockchain that Beijing has given out to date."],"hashtag":[]}