{"summary":"Decentralized crypto exchange IDEX has raised $2.5 million in seed funding ahead of IDEX 2.0 launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74153\/decentralized-exchange-idex-seed-funding-idex-2-0","publishDate":"2020-08-06T09:00:57","id":2228,"type":null,"title":"Decentralized exchange IDEX raises $2.5 million in seed funding ahead of IDEX 2.0 launch","category":["EXCHANGES"],"content":["Decentralized crypto exchange IDEX has raised $2.5 million in seed funding ahead of IDEX 2.0 launch.","The round was led by G1 Ventures and Borderless Capital, with participation from Collider Ventures and Ethereum prediction market project Gnosis.","Alex Wearn, co-founder and CEO of IDEX, told The Block that the fresh capital would be used for continued product development, marketing, and user acquisition.","IDEX is in the process of launching an improved version of its existing exchange called IDEX 2.0. The new exchange would combine the performance of a centralized exchange with the security of a DEX, Wearn told The Block. Specifically, IDEX 2.0’s design would be compatible with software and strategies of market makers and algorithmic traders, and thus, would help improve liquidity, said Wearn.","Liquidity has been the key challenge of DEXs as compared to centralized exchanges, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/66216\/dex-volumes-challenges-ecosystem\" data-v-f87c67ca=\"\">as The Block reported recently<\/a>. Wearn said, with IDEX 2.0, market makers can get started with the exchange in “hours, not weeks” due to its design and standardized APIs.","When asked if any notable market makers have shown interest in supporting IDEX 2.0, Wearn said there are “quite a few partnerships in the works,” adding that specific details will be announced at a later date.","IDEX also claims that its new exchange would benefit from low-latency trade execution and advanced order types, and a matching engine capable of processing “hundreds of thousands of orders per second.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Launching next month&nbsp;<\/span><\/strong>","Wearn said IDEX 2.0 has been under development since January 2019 and is scheduled to launch sometime next month. IDEX currently has “over 100,000 verified accounts,” Wearn told The Block.","IDEX’s seed round comes at a time when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/73939\/dex-volume-ratio-july\" data-v-f87c67ca=\"\">DEX volumes are soaring<\/a>, surpassing $4 billion in July to hit a new all-time high. Uniswap currently leads the DEX volume game, with 41% market share, followed by Curve and IDEX, according to data compiled by <a href=\"https:\/\/www.theblockresearch.com\/value-capture-decentralized-exchange-tokens-69105\" data-v-f87c67ca=\"\">The Block Research<\/a>.","","","When asked what would be IDEX 2.0’s competitive edge against current market leader Uniswap, Wearn told The Block: “Uniswap and other Automated Market Makers (AMMs) have become successful by circumventing some of the performance issues of the Ethereum network, but did so by removing the orderbooks. For market makers in particular, <a href=\"https:\/\/medium.com\/dragonfly-research\/what-explains-the-rise-of-amms-7d008af1c399\" data-v-f87c67ca=\"\">this design<\/a> is actually a very poor and inefficient solution.” Wearn added that IDEX 2.0 would allow users and market makers to have the same functionality and user experience of centralized exchanges, \"all while staying non-custodial.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gnosis","content":"PERSON"},{"type":"IDEX","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"G1 Ventures","content":"ORGANIZATION"},{"type":"January 2019","content":"DATE"},{"type":"41%","content":"PERCENT"},{"type":"Collider Ventures","content":"ORGANIZATION"},{"type":"Alex Wearn","content":"PERSON"},{"type":"Wearn","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Borderless Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}