{"summary":"On the Unchained podcast, Terra founder Do Kwon branded charges from South Korean prosecutors against him as &quot;politically motivated&quot; and reiterated that he isn&#x27;t on the run.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177636\/do-kwon-says-charges-politically-motivated-refuses-to-reveal-location","publishDate":"2022-10-18T05:45:22","id":223,"type":null,"title":"Do Kwon says charges &#x27;politically motivated,&#x27; refuses to reveal location","category":["LEGAL"],"content":["Terra founder Do Kwon has branded the charges from South Korean prosecutors against him as \"politically motivated\" — and reiterated, once again, that he isn't on the run.","\"We are a little bit disappointed in the way that prosecutors are attempting to create new regulation through criminal court proceedings, whereas that should be within the job description of the legislature, or at the very least the financial regulators,\" he <a href=\"https:\/\/www.youtube.com\/watch?v=RgYSJVC7Ps8\" data-v-f87c67ca=\"\">said<\/a> on crypto podcast Unchained, hosted by Laura Shin, on Tuesday.&nbsp;","Kwon is currently wanted by authorities in his native South Korea for allegedly violating the country's Capital Markets Act. The charges stem from the collapse of the Terra ecosystem and its algorithmic stablecoin, created by his company, Terraform Labs. In May, the TerraUSD stablecoin lost its peg to the U.S. dollar, resulting in the crash of the entire ecosystem and the wiping out of approximately $40 billion in value.","Kwon claimed that he has not seen a copy of the arrest warrant and that all the information he knew about the charges had come from media sources. Besides allegedly violating the Capital Markets Act, he is not sure what other charges he is facing, if any.&nbsp;","\"We don't think that any of the charges pertaining to the Capital Markets Act are applicable because the government's stance has been that cryptocurrencies shouldn't be governed by the Capital Markets Act because they're not securities,\" he said. \"We don't believe these are legitimate charges and are politically motivated.\"","Kwon was questioned about his whereabouts — a hot topic on the ongoing story.","\"I could answer that, but the problem is that I don't want there to be a bunch of guesswork in terms of which country and which city I have been living in,\" he said. \"The easier that I make it for people to figure out my location, the harder it is for me to continue regular life.\"","Despite being a <a href=\"https:\/\/www.theblock.co\/post\/169825\/south-korean-court-issues-warrant-for-do-kwons-arrest\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">wanted<\/a> man, Kwon has repeatedly stated in interviews that he is not on the run and is willing to cooperate with authorities. However, his current <a href=\"https:\/\/www.theblock.co\/post\/170896\/do-kwon-is-not-in-singapore-according-to-police-reuters\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">location is unknown<\/a> following reports citing Singapore authorities that he had fled the city-state in September.","\"The main reason why I don't want to talk about my location to the media is because, when the crash happened in May, there were lots of situations where personal security was threatened,\" he told Shin, noting that \"people broke into my apartment building.\" He said this happened at both his home in Singapore and in South Korea.&nbsp;\"Every time the location where I live becomes known, it becomes almost impossible for me to live there,\" he explained.","Kwon disputed claims surrounding $65 million in bitcoin belonging to the Luna Foundation Guard (LFG), a non-profit supporting the Terra ecosystem, being moved to crypto exchanges KuCoin and OKX in September. He said that just because funds were moved into an exchange doesn't mean they were sold.&nbsp;","South Korean authorities asked the exchanges to freeze the funds, but it's not the only transactions about which questions are being asked.&nbsp;\"There's been allegations that we moved LFG funds into a Gemini custody wallet and then it's sitting there or something like that. All we did was to confirm a trade with a market maker and transfer the bitcoin to an address at the market maker's instruction,\" Kwon said.","He added that he had hired an on-chain analysis company that has been provided with all LFG's trading data. In the next couple of weeks, it will publish a report that \"is going to provide a lot more clarity.\"&nbsp;","\"There isn't any embezzlement or theft of the funds or anything to that effect that seems to be cycling through the media,\" he said.","Shin also drew attention to tweets by Kwon and the LFG in May that promised the return of funds for pre-collapse holders of Terra, prioritizing the smallest holders first. However, Kwon said he doesn't have a lot of clarity on how long this process could take and likened it to a \"goodwill effort\" rather than a \"refund.\"","\"Right now LFG is not at a state where it can make clear disposal of its assets. There is pending civil litigation against LFG,\" he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$65 million","content":"MONEY"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Gemini","content":"LOCATION"},{"type":"Kwon","content":"PERSON"},{"type":"LFG","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Shin","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"}],"hashtag":["DO KWON"],"authors":["Callan Quinn","The Block"]}