{"summary":"Sushi plans to release a decentralized derivatives exchange on the Cosmos-based blockchain Sei.\nThe derivatives platform called Vortex will support on-chain, peer-to-peer derivatives trading.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214530\/sushi-plans-derivatives-exchange-on-sei-blockchain-for-second-quarter","publishDate":"2023-02-23T11:36:50","id":223,"type":null,"title":"Sushi plans derivatives exchange on Sei blockchain for second quarter","category":["Crypto Ecosystems"],"content":["Sushi, the developer of the SushiSwap decentralized exchange, plans to release a decentralized derivatives exchange called Vortex on the <a href=\"https:\/\/www.theblock.co\/post\/213461\/sei-network-developer-raising-funds-at-400-million-token-valuation-sources\" data-v-f87c67ca=\"\">Sei blockchain<\/a> in the Cosmos ecosystem.","The release is scheduled for the second quarter of 2023, which coincides with the expected mainnet launch of Sei, and follows Sushi's recent acquisition of Vortex.","Vortex is expected to be among the first applications on Sei, a Layer 1 blockchain designed for on-chain trading for the <a href=\"https:\/\/www.theblock.co\/post\/185784\/making-the-cosmos-hub-more-relevant-with-cosmos-co-founder-ethan-buchman\" data-v-f87c67ca=\"\">Cosmos<\/a> ecosystem. The exchange will support peer-to-peer order matching and use of cross-collateral, done fully on-chain.&nbsp;","While Sushi is one of the largest decentralized exchanges, it has historically focused on spot trading and lagged behind other protocols in derivatives. The move to Sei presents an opportunity for Sushi to expand its offerings in this area, and its CEO, Jared Grey, <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/02\/23\/2614433\/0\/en\/Sushi-Acquires-Sei-s-Vortex.html\" data-v-f87c67ca=\"\">stated<\/a> that expanding cross-chain from Ethereum to the Sei network is central to that plan.","\"Ultimately, the goal is to increase horizontal product offerings holistically, providing value to all stakeholders within the Sushi ecosystem, with product launches like Vortex on Sei. Sei is the best infrastructure to launch this specific product, with time to finality and a cross-chain thesis that we resonated with,\" Grey said.","Sushi is among the first DeFi protocols to announce an expansion to Cosmos. Last year, dYdX, currently the largest decentralized derivatives exchange, <a href=\"https:\/\/www.theblock.co\/post\/153478\/dydx-to-expand-to-its-own-blockchain-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">revealed a plan<\/a> to move to Cosmos, which is also expected to occur in 2023.","Sei Labs, the core developer of the blockchain, is raising Series A funding at a $400 million token valuation, The Block recently <a href=\"https:\/\/www.theblock.co\/post\/213461\/sei-network-developer-raising-funds-at-400-million-token-valuation-sources\" data-v-f87c67ca=\"\">reported<\/a>."],"hashtag":["COSMOS","DEXS"]}