{"summary":"The new technology could expand the use cases for blockchain gaming, machine learning and other sectors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207884\/zk-developer-nil-foundation-says-new-technology-makes-it-easier-to-build-on-ethereum","publishDate":"2023-02-02T09:00:04","id":2230,"type":null,"title":"ZK developer Nil Foundation says new technology makes it easier to build on Ethereum","category":["INFRASTRUCTURE"],"content":["ZK tech developer Nil Foundation, which is written as =nil; Foundation, says a new technology it’s releasing will make building chains and applications on top of Ethereum and other blockchains much easier.","Called zkLLVM, the technology gives developers the ability to build a fully compatible Ethereum chain or application using popular coding languages Rust and C++. It also could open the door to many new use cases by bridging the gap between crypto and the traditional gaming and machine learning sectors, according to Nil founder Mikhail Komarov.","ZK technology has gained a lot of attention this year because of its potential to increase blockchain scalability and reduce transaction costs, all while having built-in privacy capabilities. It can be expensive, though, and Nil is taking a different approach to make it easier to onboard new developers.","“Many people think creating a fully compatible zkEVM from scratch is the only way that developers can launch useful ZK-enabled products,” said Komarov.","Several chains built on top of Ethereum, such as zkSync and Polygon Hermez, allow ZK developers to build and port applications to their chains using the most popular blockchain coding language, Solidity. ZkSync and Polygon, meanwhile, use a technology called ZkEVM to remove the need for developers to learn how to code in ZK, which requires higher level math skills and a deeper understanding of cryptography compared to Solidity.","Nil’s new technology could be used by existing bridges to integrate ZK into their platforms, which could increase security in what was one of the main hack vectors this past year. It also could open the door for traditional trading firms, market makers and institutions that rely on machine-learning models for trading strategies.","Nil <a href=\"https:\/\/www.theblock.co\/post\/203411\/zk-tech-developer-nil-foundation-raises-22-million-at-a-220-million-valuation\" data-v-f87c67ca=\"\">raised<\/a> $22 million in January. It developed what is known as the Proof Market Protocol, which allows developers to easily generate and build ZK proofs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$22 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Nil","content":"ORGANIZATION"},{"type":"Polygon Hermez","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Nil Foundation","content":"ORGANIZATION"},{"type":"Komarov","content":"PERSON"},{"type":"Mikhail Komarov","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}