{"summary":"Bitmain will start selling its new AntMiner E9 on Wednesday.\nThe new Ethereum miner will deliver a hash rate of 2,400 megahash per second (MH\/s), per the company’s announcement.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155893\/sales-of-bitmains-new-ethereum-asic-miner-to-begin-wednesday","publishDate":"2022-07-05T13:25:27","id":2230,"type":null,"title":"Sales of Bitmain&#x27;s new Ethereum ASIC miner to begin Wednesday","category":["Mining"],"content":["Mining hardware manufacturer Bitmain will start selling its new application-specific integrated circuit (ASIC) miner AntMiner E9 on Wednesday.","The new Ethereum miner features a hash rate of <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">2,400M, 1920 watts of power consumption and power efficiency of 0.8 joules per minute, the company said on Twitter.<\/span>","According to Bitmain, the E9 is equivalent to 25 RTX 3080 graphics cards. Sales will start at 9 am ET on Wednesday.","The new model was a<a href=\"https:\/\/www.theblock.co\/linked\/101904\/bitmain-ethereum-asic-miner\" data-v-f87c67ca=\"\">nnounced over a year ago<\/a>, when Ethereum mining revenues were on the rise. The launch is happening despite of Ethereum's move from proof-of-work to proof-of-stake, which is expected to happen later this year. Post-merge, the hardware can be used to mine other cryptocurrencies that rely on the Ethash algorithm.","In April 2021, Ethereum Miners were bringing in $1.68 billion in revenue, reaching an all-time high the following month ($2.4 billion). But revenues have since gone down significantly, <a href=\"https:\/\/www.theblock.co\/post\/155588\/ethereum-mining-revenues-fell-by-roughly-45-in-june\" data-v-f87c67ca=\"\">totaling $549.58 million last month<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereum-miner-revenue-monthly\/embed\" title=\"Ethereum Miner Revenue (Monthly)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}