{"summary":"British banking giant Standard Chartered’s new report shows it’s more bullish on ether than bitcoin.\nThe bank expects bitcoin to increase up to 3x from current levels, while it sees ether going up to 10x.\nBut it says ether carries more risk.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116763\/standard-chartered-bitcoin-ether-btc-eth-price-projections","publishDate":"2021-09-07T06:24:21","id":2233,"type":null,"title":"Standard Chartered is more bullish on ether than bitcoin","category":["Ethereum"],"content":["British banking giant Standard Chartered released its first reports on crypto on Tuesday, highlighting a bullish view on both <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Bitcoin-investor-guide.pdf\" data-v-f87c67ca=\"\">bitcoin<\/a> (BTC) and <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Ethereum-investor-guide.pdf\" data-v-f87c67ca=\"\">ether<\/a> (ETH), but a more optimistic stance on the latter.","Ethereum is more like a \"financial market\" in which transactions like lending, insurance, and exchanges can operate, according to Standard Chartered's global research team led by Geoffrey Kendrick. Bitcoin, on the other hand, is more akin to a \"currency,\" according to the team. Hence, given the broader uses cases for Ethereum compared to Bitcoin, Standard Chartered believes that ETH's total market capitalization will catch up to BTC's over time.","The bank values bitcoin in the price range of $50,000-$175,000 over a longer term, and ether in a $26,000-$35,000 range. But for ether to get there, bitcoin would need to first trade at $175,000, said the team.","Bitcoin is currently trading at around $51,250 and ether at about $3,750, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/prices\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a> That means Standard Chartered expects bitcoin to increase 3x from current levels and ether 10x from current levels.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" title=\"BTC Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/eth-price\/embed\" title=\"ETH Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Since Standard Chartered sees bitcoin more as a currency, it has compared it with credit card market capitalization against potential transactions in the unbanked sector to arrive at the valuation. For ether, on the other hand, it has compared the value of global banks against the value of global credit-card companies to establish its value relative to bitcoin.","Ether's price prediction may appear high compared to its current price, but the bank thinks \"the current price reflects both the relative complexity of ETH (versus BTC) and the uncertainty around ETH's development.\"","\"In other words, while potential returns may be greater for ETH than for BTC, risks are also higher,\" said the bank.&nbsp;","Ethereum is currently in a transition towards <a href=\"https:\/\/www.theblockcrypto.com\/daily\/85771\/eth2-phase-0-roll-out-long-way-to-go\" data-v-f87c67ca=\"\">Ethereum 2.0<\/a>, a proof-of-stake model. Once the transition is completed, its functionality and scalability will further increase, said Standard Chartered.","The reports come out ahead of the launch of Standard Chartered's <a href=\"https:\/\/www.theblockcrypto.com\/post\/106944\/standard-chartered-institutional-crypto-brokerage-exchange-europe\" data-v-f87c67ca=\"\">upcoming crypto trading venture<\/a>, focused on institutional and corporate clients in Europe. When this was announced, the bank said that it hoped to go live in the fourth quarter of this year.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BITCOIN","ETHEREUM"]}