{"summary":"China’s central bank will soon test its digital currency in the cities of Shenzhen and Suzhou, per Chinese news site Caijing\nFour state-owned commercial banks are racing to find the best implementation strategies of digital currency, in collaboration with three telecom giants in China\nThe central bank is said to have accelerated its digital currency program, prompted by Facebook’s Libra project ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49659\/report-chinas-central-bank-to-test-digital-currency-in-two-cities-partnering-with-state-backed-commercial-banks-and-telecom-giants","publishDate":"2019-12-09T00:35:10","id":2235,"type":null,"title":"Report: China&#x27;s central bank to test digital currency in two cities","category":["China"],"content":["The People's Bank of China (PBOC), the country's central bank, will soon test its much-anticipated digital currency electronic payment (DC\/EP) in the cities of Shenzhen and Suzhou, according to a report from Chinese financial news outlet Caijing.","According to the <a href=\"https:\/\/news.caijingmobile.com\/article\/detail\/407673?source_id=40\" data-v-f87c67ca=\"\">report<\/a>, PBOC has partnered with seven state-owned companies to roll out the test. including four commercial banks and three telecom giants. Citing a person close to the pilot program, Caijing said the central bank has launched a \"horse race\"&nbsp; among these commercial banks, encouraging them to come up with their own implementation strategies.&nbsp;","The pilot program will concentrate on industries such as transportation, education, commerce, and medical care. While some banks chose to collaborate with telecom firms to develop SIM cards with built-in digital wallets, others have built their independent wallet apps.&nbsp;","The Shenzhen pilot program will be carried out in two phases, according to Caijing. After a small-scaled testing period at the end of this year, DC\/EP will be widely promoted in the city in 2020. Meanwhile, the city of Suzhou may test the new currency as well, according to the report. It was <a href=\"https:\/\/www.jinse.com\/blockchain\/529675.html\" data-v-f87c67ca=\"\">reported<\/a> in November that a PBOC-backed fintech company was looking for blockchain and encryption experts in Suzhou. The fintech firm, founded by the PBOC's digital currency research institute, is said to be responsible for the research and development of DC\/EP, as well as offering support for testing the new currency.&nbsp;","<strong data-v-f87c67ca=\"\">Under pressure<\/strong>","It is likely that Facebook's cryptocurrency project has prompted PBOC to carry out its digital currency plan ahead of the original schedule. The central bank started its digital currency initiative in 2014. However, officials from the PBOC only recently started to make public comments on China's own digital currency after the social media giant announced the Libra project in June.&nbsp;","\"Previously, [the central bank] was in no hurry doing this. Recently, all a sudden, they accelerated,\" several commercial bank insiders told Caijing.&nbsp;","Under the new DC\/EP model, commercial banks will first obtain the digital currency from the PBOC by depositing RMB reserve. Users and businesses can then register digital wallets with these commercial banks to use the new digital currency, according to <a href=\"https:\/\/www.chainhoo.com\/blockchain\/101314\/\" data-v-f87c67ca=\"\">an online course<\/a> on Libra and cryptocurrency, lectured by PBOC's digital currency subsidiary director Mu Changchun.&nbsp;","China is not the only country that wants to take lead in issuing digital currencies. Last week, the central bank of France's governor <a href=\"https:\/\/www.theblockcrypto.com\/linked\/49253\/report-bank-of-france-to-test-digital-currency-in-2020\" data-v-f87c67ca=\"\">announced<\/a> the country's intention to test its digital currency in 2020. At a recent joint conference by the European Central Bank (ECB) and the National Bank of Belgium, an ECB executive board member also <a href=\"https:\/\/www.ecb.europa.eu\/press\/key\/date\/2019\/html\/ecb.sp191126~5230672c11.en.html\" data-v-f87c67ca=\"\">commented<\/a> on the potential of the digital currency, saying that it \"could ensure that citizens remain able to use central bank money even if cash is eventually no longer used.\"&nbsp;"],"hashtag":[]}