{"summary":"Swift conducted an experiment with banks using Chainlink’s Cross-Chain Interoperability Protocol.\nThe organization stated that its messaging standards, combined with Chainlink’s CCIP, can achieve interoperability between traditional banks and blockchain networks.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248293\/swift-chainlink-ccip","publishDate":"2023-08-31T08:51:05","id":2236,"type":null,"title":"Swift says interoperability experiment with Chainlink’s CCIP was successful","category":["Crypto Infrastructure"],"content":["A report from Swift, the global financial messaging network, highlighted that its existing messaging standards, in conjunction with the Chainlink-developed <a href=\"https:\/\/www.theblock.co\/post\/240714\/chainlink-ceo-wants-to-bring-trillions-of-dollars-into-crypto-from-banks\" data-v-f87c67ca=\"\">Cross-Chain Interoperability Protocol<\/a>, have the potential to facilitate interoperability between traditional financial systems and emerging blockchain technologies.","<a href=\"https:\/\/www.businesswire.com\/news\/home\/20230831212747\/en\/Swift-Unlocks-Potential-of-Tokenisation-With-Successful-Blockchain-Experiments\" data-v-f87c67ca=\"\">Swift explained that it utilized its own network and the CCIP to develop a pilot solution<\/a>. The aim was to assess the feasibility of allowing financial institutions to interact with tokenized assets and conduct transactions on both public and private blockchain platforms using their existing back-end systems.","Additionally, the report noted that financial institutions are generally more inclined to integrate blockchain technology into their current infrastructure rather than constructing new systems.","For the experiment, Swift said it collaborated with multiple financial institutions — including Australia and New Zealand Banking Group Limited, BNP Paribas, BNY Mellon, Citi, Clearstream, Euroclear, Lloyds Banking Group, SIX Digital Exchange and The Depository Trust &amp; Clearing Corporation. The results “successfully demonstrated” that blockchains and traditional bank systems can be securely connected for transactions, according to Swift.","“The experiments have highlighted the role that a blockchain interoperability protocol could play in transferring data and value across blockchains,” the report said.","In July, <a href=\"https:\/\/www.theblock.co\/post\/240714\/chainlink-ceo-wants-to-bring-trillions-of-dollars-into-crypto-from-banks\" data-v-f87c67ca=\"\">Chainlink co-founder Sergey Nazarov told The Block<\/a> that banks may adopt its newly launched CCIP protocol to connect with blockchains, claiming the protocol can help bring trillions of dollars into crypto from traditional finance.","Chainlink is a decentralized oracle network widely used by blockchain smart contracts to integrate real-world data."],"hashtag":["DATA PROVIDERS","DEVELOPER TOOLS"]}