{"summary":"On Friday, March 12th, USDC began to trade below $1. Following the news that Silicon Valley Bank had collapsed it became apparent that Circle, the issuer of USDC, had held a percent of their USD equivalents there. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220352\/the-usdc-depeg-saving-investors-from-liquidation","publishDate":"2023-03-16T09:00:52","id":2236,"type":null,"title":"The USDC depeg - Saving Investors from Liquidation","category":["SPONSORED"],"content":["<span class=\"TextRun SCXW170016183 BCX4\" lang=\"EN\" xml:lang=\"EN\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW170016183 BCX4\" data-v-f87c67ca=\"\">On Friday, March 12th, USDC began to trade below $1. Following the news that Silicon Valley Bank had collapsed it became apparent that Circle, the issuer of USDC, had held a percent of their USD equivalents there.&nbsp;<\/span><\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">This meant that USDC was no longer fully collateralized or backed 1:1 by US dollars. Over the course of the following day the price of USDC dropped all the way down to $0.88 on some exchanges. Furthermore, stablecoins such as DAI and FRAX, which are partially collateralized by USDC, followed USDC and began trading below their peg.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The effect of this event on investors who simply hold stablecoins (which were impacted by the depeg) is clear (their holdings became worth significantly less). However, what about all of the investors who had their stablecoins in DeFi protocols?<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">USDC, DAI, and FRAX are among the most widely used assets in all of DeFi and investors who had them in DeFi protocols (versus simply held in a wallet) were affected differently.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Holding stablecoins in a DeFi protocol either amplified or mitigated the negative effects of the depeg. For example, borrowers who had posted USDC as collateral saw their liquidation risk increase as their collateral suddenly lost value. Considering that USDC is often thought of as one of the safest stablecoin, many borrowers did not prepare their loans for such an event.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">To be specific, this means that in normal conditions investors could create stablecoin loans at a higher collateralization ratio. They are able to do this, and thus take advantage of higher leverage, because USDC had practically zero historical volatility and was thought of as always being fully collateralized. This left many borrowers completely caught off guard.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">This is where protocols like <\/span><a href=\"https:\/\/mero.finance\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Mero<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> shine. The Mero protocol enables users to set automated collateral top-ups and debt repayments for their loans. Both of which, when triggered, can prevent potential liquidations and ensure that an investor’s loan stays sufficiently collateralized.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Without utilizing a protocol like Mero it can be very difficult to effectively manage your debt. Especially during times such as this weekend where a completely unprecedented event occurred. For borrowers that rely completely on manual debt management, they could have easily been put in a situation where avoiding liquidation was not possible.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">By setting collateral top-ups or debt repayments through Mero, borrowers can relax knowing that even during unforeseen market conditions their loans can be properly collateralized. Furthermore, by automating the debt management process, borrowers can maintain precise levels of collateralization and thus borrow assets more efficiently.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The USDC depeg was a painfully eye opening event for many borrowers. Many of which now realize that they must prepare their loans for even the most unlikely events. To learn more about how you can do just that and be smarter with your debt, join the Mero community on <\/span><a href=\"https:\/\/discord.com\/invite\/merofinance\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Discord<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">This post is commissioned by&nbsp;Metro&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a percent","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"March 12th","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$0.88","content":"MONEY"},{"type":"weekend","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"US dollars","content":"MONEY"},{"type":"ups","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}