{"summary":"An exploiter abused a vulnerability in a digital marketing platform to mimic seemingly legitimate emails that actually included links to wallet drainer sites, Blockaid found. \nThe attack targeted CoinTelegraph, WalletConnect, Token Terminal and De.Fi, according to crypto sleuth ZachXBT.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274172\/mailer-lite-hacker-impersonates-crypto-firms-draining-600000-with-phishing-emails","publishDate":"2024-01-23T17:03:29","id":2241,"type":null,"title":"Mailer Lite hacker impersonates crypto firms, draining $600,000 with phishing emails","category":["Crypto Ecosystems"],"content":["Digital marketing platform Mailer Lite was the victim of a phishing attack that resulted in the loss of over $600,000, according to the web3 security and privacy firm Blockaid.&nbsp;","The exploiter used a vulnerability in Mailer Lite to mimic web3 firms sending seemingly legit emails that actually contained malicious links to wallet drainer sites, Blockaid explained in a social media <a href=\"https:\/\/twitter.com\/blockaid_\/status\/1749853272700277042\" data-v-f87c67ca=\"\">thread<\/a> Tuesday, adding that \"attackers took advantage of the fact that Mailer Lite had previously been given permission to send email on behalf of these site’s domains, enabling them to craft emails that seemed to be coming from these organizations.\"","\"Specifically, they used 'dangling dns' records which were created and associated with Mailer Lite (previously used by these companies),\" it continued. \"After closing their accounts these DNS records remain active, giving attackers the opportunity to claim and impersonate these accounts.\"","CoinTelegraph, WalletConnect, Token Terminal and De.Fi were among the platforms targeted by the phishing attack, according to the crypto sleuth <a href=\"https:\/\/www.theblock.co\/post\/262719\/crypto-wallet-loses-27-million-in-stablecoins-in-apparent-hack-zachxbt\" data-v-f87c67ca=\"\">ZachXBT<\/a>."],"hashtag":["CRIME","WALLETS"]}