{"summary":"The number of active addresses on the Bitcoin network is falling, even as transactions rise.\nThat could suggest a pushback against the growing popularity of Bitcoin Ordinals and BRC-tokens, as transaction prices have surged with all the activity.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230911\/bitcoin-addresses-volume-transaction-fees","publishDate":"2023-05-15T18:19:21","id":2242,"type":null,"title":"Bitcoin active users plummet even as transactions rise","category":["Crypto Ecosystems"],"content":["Despite continued growth in the number of transactions on the Bitcoin network, the number of active addresses that have sent or received funds has fallen to the lowest level since July 2021, according to The Block data that tracks the 7-day moving average.&nbsp;&nbsp;","That suggests that fewer people are active on the network, even though each person using the network, on average, is making more transactions. Costs go up when more people use the network.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/number-of-active-addresses-on-the-bitcoin-network-7dma\/embed\" title=\"Number of Active Addresses on the Bitcoin Network (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The high fees have people hesitant to transact,\" The Block data research analyst Rebecca Stevens said, adding that the hype around <a href=\"https:\/\/www.theblock.co\/post\/229757\/bitcoin-based-brc-20-tokens-combined-market-value-eclipses-900-million\" data-v-f87c67ca=\"\">Ordinals and BRC-20 tokens<\/a>, new ways that allow people to mint <a href=\"https:\/\/academy.binance.com\/en\/articles\/what-are-ordinals-an-overview-of-bitcoin-nfts\" data-v-f87c67ca=\"\">Ethereum-styled non-fungible and fungible tokens<\/a> on the Bitcoin network, has caused a surge in overall activity on the network and in fees these past weeks.","The number of daily transactions on the network hit a record high on May 12, according to data from The Block. That's just days after the new tokens created with the Ordinals protocol <a href=\"https:\/\/www.theblock.co\/post\/229757\/bitcoin-based-brc-20-tokens-combined-market-value-eclipses-900-million\" data-v-f87c67ca=\"\">exceeded a total market value<\/a> of $900 million.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/transactions-on-the-bitcoin-network-daily\/embed\" title=\"Transactions on the Bitcoin Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"I can see a world in which the recent success of the Ordinals and BRC-20 tokens has their haters pulling back,\" Stevens said, adding that some users view these ideas as wastes of space on the blockchain. \"Also many of the advocates for some for these innovations are Bitcoin OGs who are probably wealthy enough in bitcoin to keep the hype around Ordinals and BRC-20 going.\"","The average transaction fee on the platform has surged over the past year, from around $2.50 12 months ago to as much as $16.08 on May 11, according to The Block data.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/average-transaction-fee-on-bitcoin-7dma\/embed\" title=\"Average Transaction Fee on Bitcoin (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The price of bitcoin rose 1.5% on Monday to $27,347, according to TradingView data. It's declined 10.3% over the past month."],"hashtag":["BITCOIN"]}