{"summary":"&quot;The blockchain could radically transform this market.&quot; William Evans, who recently left cryptocurrency exchange Kraken to lead fintech startup Veridium","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7653\/a-former-kraken-exec-is-hoping-to-transform-the-carbon-credit-market-with-blockchain","publishDate":"2019-01-18T15:34:23","id":2245,"type":null,"title":"A former Kraken exec is hoping to transform the carbon credit market with blockchain","category":["MARKETS"],"content":["\"The blockchain could radically transform this market.\"","William Evans, who recently left cryptocurrency exchange Kraken to lead fintech startup Veridium Labs, isn't talking about the bond market, the FX market, or even the stock market. He's talking about the market for carbon credits, a financial product his firm wants to bring to the next level.&nbsp;","Carbon credits represent a financial contribution to a project that aims to decrease carbon emissions. A person or firm, an airline or oil company for instance, can be issued a carbon credit after making a contribution to, lets say a greenhouse project, to balance out their own carbon emissions. These entities could also purchase carbon credits from the market. Those credits, in a sense, are a type of asset and are regulated by the Commodities Futures Trading Commission.","\"But the market is fairly illiquid,\" Evans said, meaning it's hard for investors to get in or out of a position.\"Our vision is to develop a marketplace for these projects to be invested in and for the trading and issuance of credits to occur.\"","To that end, Evans said the firm plans to tokenize carbon credits. Evans said the demand for carbon credits is set to increase in the coming years as firms are pressured by customers and investors to make contributions to the environment.&nbsp;","Evans worked at Kraken for seven months. The Chicago Exchange veteran has a long and storied career in financial services. Before catching the crypto bug and joining Kraken, Evans was an executive director at exchange giant CME Group. He oversaw the firm's ventures unit, which made early-stage investments in financial technology firms.&nbsp;","He joined Veridium Labs in December. \"I've been talking to them for a while and have been helping them dig through things.\"","\"Pressure is mounting for companies to show they are dedicated to ESG,\" he said.","<span data-v-f87c67ca=\"\">In recent years, investors have become increasingly concerned with the impact of their investments — not just alpha or outsized returns. That’s put pressure on money managers to find sustainable investment options.<\/span>","\"Investor appetite for environmental solutions has increased sharply in recent years, with $21.4 trillion in global assets incorporating socially responsible investing, and up to 93% of US millennials showing a high preference for impact investing,\" Bank of America Merrill Lynch said in a 2017 report.","That has fueled the growth of green bonds, carbon credits, and so-called impact funds. Investors are taking environmental matters more seriously, with <a href=\"https:\/\/www.cnbc.com\/2018\/12\/03\/ubs-global-wealth-management-to-includeenvironmental-scores-on-funds.html\" data-v-f87c67ca=\"\">UBS now including environmental scores to guide its investments<\/a>. It has also put pressure on firms to prove that they are green.&nbsp;","That pressure could be a tailwind for both carbon credits and Veridium.&nbsp;","The firm has partnered with IBM to help make their dreams a reality.&nbsp;As reported by Computerworld, the firms are in talks with regulators to determine how their platform should be regulated.","\"That regulatory treatment of the instrument will then inform who and how individuals and\/or corporations are eligible to buy it,\" said Jared Klee, IBM's blockchain offering manager.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"$21.4 trillion","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"UBS","content":"ORGANIZATION"},{"type":"93%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Veridium Labs","content":"ORGANIZATION"},{"type":"\" Bank of America Merrill Lynch","content":"ORGANIZATION"},{"type":"Chicago Exchange","content":"ORGANIZATION"},{"type":"Computerworld","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"ESG","content":"LOCATION"},{"type":"Jared Klee","content":"PERSON"},{"type":"William Evans","content":"PERSON"},{"type":"Evans","content":"PERSON"}],"hashtag":["FINTECH","KRAKEN","TOKENIZATION"],"authors":["Frank Chaparro","The Block"]}