{"summary":"The Prosecutor’s Office of the Republic of Bulgaria cleared Nexo of any criminal wrongdoing and ended its investigation into the crypto lender. ","author":["MK Manoylov","Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269119\/bulgaria-ends-investigation-into-crypto-lender-nexo-finding-no-criminal-activity","publishDate":"2023-12-22T15:28:07","id":2246,"type":null,"title":"Bulgaria ends investigation into crypto lender Nexo, finding no criminal activity","category":["Companies"],"content":["The Prosecutor's Office of the Republic of Bulgaria ended criminal proceedings against the crypto lender Nexo and has found no evidence of money laundering, tax crimes, computer fraud or other criminal activity.&nbsp;","The main reasoning behind the decision was that crypto assets are not considered financial instruments in the country and reside outside of laws for payment services and systems, according to an official <a href=\"https:\/\/prb.bg\/bg\/news\/67951-sgp-prekrati-nakazatelnoto-proizvodstvo-po-deloto-\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;The charges spanned from 2018 to January 2023 and alleged that the defendants Antoni Trenchev, Kosta Kanchev, Kalin Metodiev and Trayan Nikolov participated in an organized criminal group.&nbsp;","\"The dropping of all charges made against Nexo and its executives by the Bulgarian Prosecutor’s Office, with their confirmation that there were no crimes, unequivocally shows that the whole attack on Nexo was political and should not have happened in the first place,\" Nexo co-founder and managing partner Antoni Trenchev told The Block.","\"It also goes a long way in clearing our names and is a vindication for all good actors in crypto,\" Trenchev added. \"We are very content with this result.”","On Jan. 12, authorities <a href=\"https:\/\/www.theblock.co\/post\/201454\/nexos-bulgaria-office-raided-by-police\" data-v-f87c67ca=\"\">raided<\/a> Nexo's Bulgarian office over suspected money laundering and tax violations, which Trenchev had called \"absurd\" at the time.","Two months later, a Nexo user from California <a href=\"https:\/\/www.theblock.co\/post\/216219\/nexo-user-sues-crypto-lender-alleging-millions-in-asset-losses\" data-v-f87c67ca=\"\">sued<\/a> the firm, claiming that Nexo fraudulently induced the user to take out loans against digital assets."],"hashtag":["ANTI-MONEY LAUNDERING","CRIME"]}