{"summary":"The most active crypto VCs of all time, including Coinbase, Galaxy, Polygon and Multicoin, share their funding outlook for 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268094\/coinbase-galaxy-polygon-multicoin-other-crypto-vc-funding-outlook-2024","publishDate":"2023-12-26T20:05:02","id":2246,"type":null,"title":"Coinbase, Galaxy, Polygon, Multicoin, and other top crypto VCs share their 2024 funding outlook","category":["VENTURE CAPITAL"],"content":["The crypto funding landscape grappled with significant challenges in 2023, witnessing a drastic 68% decline in total investments to $10.6 billion. This sharp decrease starkly contrasted with the $33.2 billion total investment recorded in 2022 and represented the lowest point since 2020.","Multiple factors contributed to this decline, including historically high-interest rates, the rapid expansion of artificial intelligence diverting attention from crypto, regulatory crackdowns, and the aftermath of notable crypto collapses involving FTX, Celsius, and BlockFi.","What lies on the horizon for crypto funding in 2024? The Block reached out to some of the top 20 most active crypto venture capital firms of all time, and the prevailing sentiment leans towards optimism.","The ventures unit of crypto exchange Coinbase kept investing through difficult 2023 and is \"increasingly optimistic\" in the future.","\"Our view is that the confluence of 1) advancing regulatory clarity (primarily ex-U.S.), 2) maturation of protocol infrastructure, 3) institutional participation, and 4) innovation in how users engage with on-chain products sets the stage for a bright 2024,\" a Coinbase Ventures spokesperson told The Block. \"Our commitment is global and remains steadfast, and we expect our activity to grow in 2024.\"","Coinbase Ventures will continue to invest in areas that accelerate bringing the next 1 billion users on-chain, including crypto infrastructure and consumer applications like social and gaming, and also sees opportunities at the intersection of AI and crypto.","The firm will also seek to expand its support of teams building on Base through <a href=\"https:\/\/www.theblock.co\/post\/249918\/coinbase-ventures-base-ecosystem-fund-invests-in-six-projects\" data-v-f87c67ca=\"\">the Base Ecosystem Fund<\/a>.","The venture arm of billionaire investor Mike Novogratz's Galaxy remains vigilant yet committed to investing in early-stage projects.","\"We expect the crypto VC environment to remain challenging,\" Mike Giampapa, general partner of Galaxy Ventures, told The Block. \"Even successful businesses and startups will likely have to raise at flat or down rounds.\"","Giampapa said the limited partner community is \"continuing to be over-indexed to illiquid investments,\" so new capital entering the venture space is \"more restricted,\" and the fundraising environment is expected to \"stay muted as interest rates remain elevated.\"","But there could be more consolidation in the industry, with larger companies doing mergers and acquisitions deals with smaller firms, according to Giampapa.","Meanwhile, startups with sustainable business models and demonstrated product market fit, such as blockspace and stablecoins, will get more investment in 2024, according to Giampapa.","\"Blockspace is a fascinating and still relatively new product that has reached product-market fit, Giampapa said. \"Consumers are willing to pay more per transaction when there is a network effect around a seller's block space due to a combination of applications, developer talent, capital, and users.\"","On the stablecoins front, the market is at the \"tip of the iceberg\" in terms of a longer-term shift to tokenizing assets on-chain, according to Giampapa.","\"We see opportunities for many new asset classes to be brought on-chain, for business-to-business and business-to-consumer applications to embed these new financial products into their existing offerings, and for a new set of infrastructure players to enable developers to drive adoption,\" Giampapa said.","Hong Kong-based <a href=\"https:\/\/www.theblock.co\/post\/259751\/animoca-brands-has-been-pitching-an-in-house-market-making-service-to-crypto-startups\" data-v-f87c67ca=\"\">Animoca Brands<\/a> is \"very optimistic\" and expects \"a substantially healthier\" crypto funding environment in 2024, Yat Siu, the firm's co-founder and executive chairman, told The Block.","With the crypto market rebounding, \"there's a shift in momentum, and it might represent the beginning of a new bull cycle in the crypto market,\" Siu said.","Gaming and AI with web3 components could attract more investment in 2024, according to Siu. \"Web3 gaming is poised for acceleration, notably in Asia and the Middle East, with Europe also showing substantial interest,\" he said. \"AI in gaming, on the other hand, will create more engaging and responsive experiences, such as adding complexity and depth to non-player characters, as well as enhancing content creation and asset generation.\"","Early-stage investor <a href=\"https:\/\/www.theblock.co\/post\/239833\/shima-capital-auditors\" data-v-f87c67ca=\"\">Shima Capital<\/a> remains \"cautiously optimistic\" about crypto funding in 2024, Alex Wettermann, the firm's head of gaming, told The Block. He expects infrastructure, gaming, and tokenization verticals to get more investment in the coming year.","\"We continue to remain extremely active in the space — working with portfolio companies, diving deep into our research, and chatting with new companies,\" Wettermann said. \"This is business as usual for us as we follow our conviction in a world that is becoming increasingly digitized, gamified, and tokenized. We are still in the early innings in crypto.\"","The Asia-based crypto venture capital firm anticipates \"a bullish market\" next year, Xiao Xiao, investment partner at <a href=\"https:\/\/www.theblock.co\/post\/202755\/crypto-hashkey-capital-third-fund-500-million\" data-v-f87c67ca=\"\">HashKey Capital<\/a>, told The Block.","HashKey will actively seek new investment opportunities, including \"liquid investments,\" Xiao said. The firm also plans to expand its asset management business into new markets and launch a diverse range of funds catering to different investment preferences.","Kyle Samani and Tushar Jain, managing partners at <a href=\"https:\/\/www.theblock.co\/post\/184766\/multicoin-capital-hit-by-ftx-collapse-with-10-of-its-funds-aum-stuck-on-the-exchange\" data-v-f87c67ca=\"\">Multicoin Capital<\/a>, remain bullish for 2024, particularly for the Solana ecosystem, given the blockchain ecosystem's recent ride. Samani also sees \"a huge opportunity\" for crypto in the AI revolution. \"Specifically, there is a massive shortage of GPUs [graphics processing units] today, and competition for these resources is going to increase exponentially,\" he said, adding that crypto-enabled compute marketplaces and specialized cloud providers have the opportunity to step in and fill that gap.","\"Token-incentivized reinforcement learning products are another huge opportunity,\" Samani said, adding: \"Models need to be trained by humans to transfer knowledge. Crypto networks are fantastic tools for organizing and motivating people all around the world to contribute to a common model.\"","As for Jain, he expects \"an entirely new crop of neobanks, DeFi primitives, payment apps, onramps and offramps, and DEXs [decentralized exchanges]\" to emerge in 2024 to fill the gap left by the centralized lending desks and exchanges that were wiped out in 2023. \"These products will be far superior to the previous generations of DeFi projects and rival the user experience of hosted providers,\" Jain said.","\"The bottom is likely in for web3 financing,\" Abhishek Saxena, principal lead at Polygon Ventures, told The Block, suggesting the new year will attract more investment. \"A positive indicator is the resilient developer activity we've seen even amidst the bear market, highlighting that foundational building continues,\" Saxena said.","He anticipates funding to pick back up for consumer-facing use cases, including social, financial services, and entertainment, where new category leaders could emerge, according to Saxena. The tokenization vertical should also draw stronger institutional investment in the coming year, he said. \"So while 2023 was about building behind the scenes, I'm bullish on web3's innovation and adoption accelerating again in 2024,\" Saxena said.","Three general partners of Asia-based NGC Ventures remain optimistc of crypto market and VC funding in 2024.","NGC's Roger Lim said he prefers verticals like AI and crypto, Bitcoin Layer 2 networks, modular and zero-knowledge technology.","The firm's Wayne Zhu, on the other hand, is watching \"intent-based protocols\" due to their potential to enhance user experience, manage gas fees and slippage more effectively, and boost composability in order to onboard more users.","Meanwhile, NGC's Tony Gu said his focus is on two verticals: decentralized physical infrastructure networks (DePIN) and decentralized science (DeSci). \"DePIN, as a consumer-facing application layer, has the potential to drive mass adoption,\" Gu said. \"With DeSci, we've seen a few interesting DAOs [decentralized autonomous organizations] come up, but one particular area that is untapped, as far as we know, are decentralized efforts to fund open-source projects. I think there is a lot of potential there, coupled together with AI, for example, with decentralized machine learning models.\"","Overall, NGC Ventures expects \"the bull market will go into full swing\" in 2024, but the firm is \"not sure how long it might last.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$10.6 billion","content":"MONEY"},{"type":"NGC","content":"ORGANIZATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"Tony Gu","content":"PERSON"},{"type":"Xiao Xiao","content":"PERSON"},{"type":"Wettermann","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$33.2 billion","content":"MONEY"},{"type":"Roger Lim","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Wayne Zhu","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Alex Wettermann","content":"PERSON"},{"type":"Samani","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Xiao","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Jain","content":"ORGANIZATION"},{"type":"Saxena","content":"PERSON"},{"type":"Siu","content":"PERSON"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"Middle East","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Abhishek Saxena","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Giampapa","content":"PERSON"},{"type":"Galaxy Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"68%","content":"PERCENT"},{"type":"Jain","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Tushar Jain","content":"PERSON"},{"type":"Kyle Samani","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Mike Giampapa","content":"PERSON"}],"hashtag":["CRYPTO","TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}