{"summary":"With the sudden shift to remote work, 2020 saw a surge in ransomware attacks that brought it to the fore of economic and national security concerns.\nWhile 2020 was a record year for ransomware payouts, mid-year data indicates that 2021 is set to beat it. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112243\/chainalysis-finds-2021-ransomware-payouts-are-outpacing-2020s-bumper-year","publishDate":"2021-07-22T16:47:20","id":2247,"type":null,"title":"Chainalysis finds 2021 ransomware payouts are outpacing 2020&#x27;s bumper year","category":["Regulation"],"content":["According to data provided to The Block, blockchain analytics firm Chainalysis has confirmed over $208 million in ransomware payouts thus far in 2021.","In 2020, the firm confirmed $416,432 in ransomware. While the total for 2021 (through July 13) would seem to be almost exactly half of that for 2020, Chainalysis' ability to confirm these payouts based on association with ransomware wallet addresses depends on the identification of those addresses, which grows retroactively.&nbsp;","Chainalysis' Madeleine Kennedy told The Block:","Among the identified ransomware payouts, the firm's information suggests that the bulk flowed through uncompliant global exchanges. A remarkably small range of deposit addresses are at the other end of these cashouts, suggesting a concentration of actors behind the most successful attacks.&nbsp;Then again, analytics firms like Chainalysis are better at identifying these sorts of transactions, which don't include more aggressive privatizing measures like the use of Monero.","Less technologically notable but no less relevant: Many firms paying ransomware attackers do so discretely, not wishing to attract public attention or, worse still, the ire of authorities. The Treasury's Office of Foreign Asset Control <a href=\"https:\/\/home.treasury.gov\/system\/files\/126\/ofac_ransomware_advisory_10012020_1.pdf\" data-v-f87c67ca=\"\">warned of potential enforcement actions<\/a> against firms paying attacks as office suspected sanctioned entities of residing at the end of many ransomware schemes.","\"The true cost of ransomware ransoms is likely significantly higher, as many organizations quietly pay ransoms,\" wrote Kennedy.","The issue of global ransomware attacks has grown in prominence over 2021, which has resulted in mass <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109700\/ransomware-attacks-crypto-analytics-firms-fundraising\" data-v-f87c67ca=\"\">capital inflows to analytics and forensics firms<\/a> like Chainalysis. Ransomware-as-a-service groups have facilitated attacks against increasingly visible targets and critical infrastructure. This trend has moved ransomware into the realm of national security.&nbsp;","Earlier this week, a <a href=\"https:\/\/www.theblockcrypto.com\/post\/112040\/ransomware-hearing-in-congress-hones-in-on-cybersecurity-spending-and-state-actors\" data-v-f87c67ca=\"\">congressional subcommittee held a hearing<\/a> on the subject. Ransomware's role as an auxiliary of state actors, especially Russia and China, loomed large, in keeping with the Biden administration's recent emphasis on their respective cyber programs.&nbsp;"],"hashtag":["HACKS"]}