{"summary":"Bitcoin mining companies Spiral and Braiins launched an industry working group to promote an upgrade to the current Stratum V1 protocol for miners.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175961\/bitcoin-companies-join-in-push-to-promote-stratum-v2-adoption-launch-open-source-test-version","publishDate":"2022-10-11T08:00:35","id":2248,"type":null,"title":"Bitcoin companies join in push to promote Stratum V2 adoption, launch open-source test version","category":["MINING"],"content":["A group of Bitcoin companies including Spiral and Braiins is taking action to promote the adoption of Stratum V2, which would be an upgrade on the current protocol miners use to communicate with pools.","They are also launching an <a href=\"http:\/\/stratumprotocol.org\" data-v-f87c67ca=\"\">open-source version<\/a> of that protocol Tuesday, which will be available for testing immediately. The update from Stratum V1 would improve security for miners and for the network, make communication more efficient and help further decentralize the network.","“Miners know the benefits of upgrading to Stratum V2 very well, but pushing the entire mining industry over some of the remaining development and adoption hurdles is a big task,\" said Jan Čapek, co-founder of Braiins.","The upgrade is a necessary step to \"support further growth in hashrate\" as well as an increase in pooled mining, a joint statement from Braiins and Spiral said.","The push to see it through comes at a time when mining difficulty has <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">jumped 13.55 % to an all-time high<\/a>.","\"Stratum V1’s poor documentation has resulted in several interpretations and implementations, leading to mistakes and complexity,\" a <a href=\"https:\/\/www.galaxy.com\/research\/whitepapers\/2022-mid-year-bitcoin-mining-update\/\" data-v-f87c67ca=\"\">Galaxy report<\/a> from August said. The company laid out the ways in which the network could benefit from Stratum V2, in another <a href=\"https:\/\/www.galaxy.com\/research\/insights\/future-of-bitcoin-mining-protocols\/\" data-v-f87c67ca=\"\">post from February<\/a>.","\"Working for industry-wide adoption of the upgraded Stratum protocol is one of the most important developments in improving the decentralization and censorship resistance of Bitcoin’s architecture,” said Steve Lee, lead at Spiral.","The open-source Stratum V2 reference implementation (SRI) will allow anyone to run the upgraded protocol or \"use it to guide their own development of a separate compatible implementation for Stratum V2,\" the joint statement said.","There will be a \"more robust version of the same SRI\" coming in early November and it will \"support additional functionality.\"","\"This group will also ensure that all Stratum V2 projects can interact with each other based on the protocol standards,\" the statement said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jan Čapek","content":"PERSON"},{"type":"Steve Lee","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Braiins","content":"LOCATION"},{"type":"Spiral","content":"ORGANIZATION"},{"type":"13.55 %","content":"PERCENT"},{"type":"August","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}