{"summary":"The Securities and Exchange Commission (SEC) sought a restraining order, asset freeze and other injunctive relief against diamond businesses that sold investment contracts and engaged in a token sale without registering with the SEC\nThe defendant companies allegedly engaged in a Ponzi-style scheme, commingling investor funds and using investor funds for non-business purposes\nIn the argument for the motion, the SEC said the token sale easily satisfied the Howey Test, and the court granted the motion","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24631\/colored-diamond-backed-token-sale-leads-to-restraining-order-and-asset-freeze","publishDate":"2019-05-26T08:59:39","id":225,"type":null,"title":"Colored diamond-backed token sale leads to restraining order and asset freeze","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","Let’s have a fancy colored diamond token sale. What could possibly go wrong? According to the SEC&nbsp;… everything.","In a May 13, 2019 filing, the SEC sought (and was granted) an ex parte (without notice) temporary restraining order, an asset freeze and other injunctive relief against an outfit called Argyle Coin and a bunch of other individual defendants. According to the filing, defendants Natural Diamond and Eagle are companies that claims to be in the diamond buying and selling business. Argyle Coin is a Florida LLC that was formed in October 2017. Its marketing materials list a phone number in the Marshall Islands.","According to the SEC, between 2015 and 2018, Eagle and two individual defendants sold Eagle investment contracts to the public without registering with the SEC. Those investment contracts provided that the “investor enters into a one-time partnership with Eagle in which Eagle will cut, polish and sell a diamond parcel for a profit.” Investors were told they would double their money in 18 to 24 months. Investor funds were allegedly used in classic Ponzi fashion to pay prior investors, for non-business purposes, and were commingled.","Then there was a coin offering. Per the SEC, “[f]rom approximately December 2017 through present [the Defendants” have offered and sold investments in a purported cryptocurrency token called “RGL”&nbsp;… that is purportedly backed by fancy colored diamonds.” No registration was filed with the SEC.","Argyle Token has a whitepaper and a website that explains its panned business model and “promised an 8 percent return on the principal amount invested after a 12-month period and an additional 2% return at the end of a 24-month period if the investor elects to extend the investment for an additional 12 months.” Investors had no experience with diamonds and relied on Argyle Coin “to make all decisions that would affect the profitability of the Argyle Coin investment.” [Sidebar — note that it is 8 percent, not 800 percent; a clever Ponzi sometimes promises good but relatively modest returns, hiding a scam by not over-selling the upside].","The SEC argued that the token easily satisfies Howey. First, people invested more than $2.7 million into the token offering. Second “broad vertical commonality exists because investors’ profits are directly linked to the efforts of the efforts of Argule Coin and Aman [an individual defendant].” Third, investors were totally dependent on Argyle Coin and had no control over the business.","In addition to soliciting investment in an unregistered securities offering, the SEC says that at least one defendant made material misrepresentations, including falsely telling that “100% of his investment was backed by an insurance bond.” [Editorial sidebar — not a thing; if someone tells you that your investment is backed by an “insurance bond” leave the room quickly and call a fed.]","The SEC sought an ex parte TRO because of “grave concerns that [the defendants] would dissipate investor assets” if they received notice. Defedants have allegedly misappropriated and misused investor funds and even pawned corporate assets for personal benefit. In addition they continue to actively seek investment.","Anyhoo, not surprisingly — the Court granted the motion, issued a TRO, froze assets, ordered expedited discovery. The whole nine yards. As expected. I really do wonder, though, what possessed people to give their hard earned money to a colored diamond back token sale with a contact number in the Marshall Islands. This is the hardest thing to understand in the whole mess.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":["SEC"]}