{"summary":"A proposal seeking to establish a sister DAO and acquire influential NFTs currently has over 70% approval in early ApeCoin DAO voting.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251443\/apecoin-dao-voting-in-favor-sister-dao-acquire-nfts","publishDate":"2023-09-18T10:09:46","id":2256,"type":null,"title":"ApeCoin DAO currently voting in favor of sister DAO to acquire NFTs","category":["GOVERNANCE"],"content":["<span data-v-f87c67ca=\"\">A proposal seeking to establish a sister DAO and allocate 750,000 <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248414\/apecoin-ape-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/apecoin.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">APE<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.84%\n    <\/span><\/a> <!----><\/span> to acquire influential NFTs currently has over 70% approval in early ApeCoin DAO voting.<\/span>","The AIP-297 proposal was <a href=\"https:\/\/forum.apecoin.com\/t\/aip-297-an-nft-community-vault-operating-as-an-apecoin-sister-dao-with-a-goal-to-advance-the-mission-and-influence-of-apecoin\/16167\" data-v-f87c67ca=\"\">co-authored by Animoca Brands co-founder Yat Siu<\/a> in July, with an objective to \"position ApeCoin as the culture token to power the broader web3 ecosystem,\" according to the <a href=\"https:\/\/snapshot.org\/#\/apecoin.eth\/proposal\/0x69ac2faea17694435c38c2e536074b057ed98fc401e8265189d95c407ec8cff0\" data-v-f87c67ca=\"\">voting page<\/a>.&nbsp;","The proposed list of floor price NFTs to be acquired includes eight Bored Ape Yacht Club, 12 Mutant Ape Yacht Club, 15 Bored Ape Kennel Club, 15 Cool Cats, 15 World of Women and 12 Pudgy Penguins. The NFTs will be managed by a community-governed vault, with decisions made by sister DAO members holding at least 1 APE token ($1.16), the page adds.","The proposal would enable the sister DAO to lease the NFT IPs to APE holders, with potential APE grants on offer soon. The authors argue this will benefit the ApeCoin ecosystem by leading to greater adoption and utility for ApeCoin beyond its current applications, enabling the community to utilize the NFTs without having to deploy capital and own the NFTs themselves.","Operating outside the main ApeCoin DAO, the sister DAO would decide on NFT IP rentals for specific projects proposed, allocate APE funding for the development of such projects using the vault's NFT IPs and determine future NFT sales and acquisitions for the vault.","The proposal's recommended budget of 750,000 APE from the ApeCoin DAO treasury includes 500,000 APE for purchasing NFTs across various marketplaces that \"align with the vision and values of ApeCoin\" and 250,000 APE reserved for future NFT purchases and initial vault maintenance.","Voting began on the Snapshot decentralized voting platform at 9 p.m. ET on Sept. 14 and will close at 9 p.m. ET on Wednesday. Some 4.3 million APE (72.8%) favor the proposal, with 1.6 million APE (27.2%) against.","If the proposal is approved, the next steps include setting up a multi-signature wallet, receiving and deploying the APE grant to acquire the NFTs, submitting the first governance proposal via the sister DAO to facilitate NFT rental and launching a web page to display the acquired NFTs in the vault.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AIP","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"9 p.m.","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"-1.84%","content":"PERCENT"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Yat Siu","content":"PERSON"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"ApeCoin DAO","content":"ORGANIZATION"},{"type":"$1.16","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Sept. 14","content":"DATE"},{"type":"72.8%","content":"PERCENT"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"Bored Ape Kennel Club","content":"ORGANIZATION"},{"type":"27.2%","content":"PERCENT"}],"hashtag":["ANIMOCA BRANDS","BAYC","DAOS","GOVERNANCE VOTES","MAYC","PUDGY PENGUINS","YUGA LABS"],"authors":["James Hunt","The Block"]}