{"summary":"Sturdy Finance suffered a loss of $800,000 in an attack caused by a manipulated price oracle.\nThe team reported it suspended all its markets to avert further potential losses.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234102\/lending-protocol-sturdy-finance-drained-of-800000-in-security-attack","publishDate":"2023-06-12T00:48:21","id":2256,"type":null,"title":"Lending protocol Sturdy Finance drained of $800,000 in security attack","category":["Crypto Ecosystems"],"content":["Sturdy Finance, a decentralized lending protocol, fell victim to a security <a href=\"https:\/\/etherscan.io\/tx\/0xeb87ebc0a18aca7d2a9ffcabf61aa69c9e8d3c6efade9e2303f8857717fb9eb7\" data-v-f87c67ca=\"\">attack<\/a> today, which led to a loss of 442 ether or about $800,000.&nbsp; The unknown attacker took advantage of a reentrancy vulnerability that later facilitated the manipulation of a faulty price oracle, thereby enabling them to siphon off funds.","In decentralized finance applications, price oracles are pivotal as they provide real-world price data. However, they also represent a potential target for hackers who can exploit them.","The attack on Sturdy Finance was initiated by a reentrancy attack — a method typically used to illicitly withdraw funds from DeFi protocols. This attack takes advantage of the ability to call a function repeatedly within a single transaction before the original function call is completed. This, in turn, allows the attacker to withdraw more funds than they would legitimately be entitled to.","After the attacker established the ability to manipulate the function calls, they then exploited the price oracle. Sturdy Finance’s price oracle, derived from a separate “read-only” smart contract, was manipulated.","This oracle was designed to determine the accurate market value of assets in a liquidity pool managed by Sturdy Finance's team on the Balancer decentralized exchange, thus facilitating the trading of staked ether. However, the exploitation of the oracle enabled the attacker to drain funds from Sturdy Finance, according to security firm BlockSec.&nbsp;","BlockSec <a href=\"https:\/\/twitter.com\/BlockSecTeam\/status\/1668084629654638592\" data-v-f87c67ca=\"\">stated<\/a>&nbsp;that \"the root cause is due to the typical Balancer's read-only reentrancy, while the price of B-stETH-STABLE was manipulated.\"","Sturdy Finance reacted to the attack by suspending all of its markets to prevent further potential losses, assuring its users that no other funds were in danger as a result of the breach.","“All markets have been paused; no additional funds are at risk, and no user actions are required at this time,” said the team. “We will be sharing more information as soon as we have it.”","After the attack, <a href=\"https:\/\/etherscan.io\/address\/0x1e8419e724d51e87f78e222d935fbbdeb631a08b\" data-v-f87c67ca=\"\">on-chain data<\/a> shows that the attacker used the Tornado Cash mixer to obscure the activity.","In 2022, Sturdy Finance <a href=\"https:\/\/www.theblock.pro\/deals\/company\/Sturdy?profile=true\" data-v-f87c67ca=\"\">raised<\/a> $3 million in a series of rounds to build an interest-free borrowing and lending platform. The funding was led by Pantera and also saw participation from Y Combinator, SoftBank’s Opportunity Fund, and KuCoin Ventures."],"hashtag":["EXPLOITS","HACKS","MIXERS"]}