{"summary":"The SEC has listed nine cryptocurrencies on Coinbase that it says are securities, providing more clarity on its views.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges","publishDate":"2022-07-21T12:23:20","id":2257,"type":null,"title":"SEC lists nine crypto tokens as securities following Coinbase insider trading charges","category":["SECURITY"],"content":["The Securities and Exchange Commission (SEC) has listed nine cryptocurrencies that it says are securities. This was contained within a <a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2022\/comp-pr2022-127.pdf\" data-v-f87c67ca=\"\">complaint<\/a> arresting and <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">charging<\/a> a former Coinbase employee and two others with wire fraud.","The assets were: <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">AMP, RLY, DDX, XYO, RGT, LCX, POWR, DFX, KROM<\/span>. They were each mentioned in connection with alleged insider trading.","\"Our message with these charges is clear: fraud is fraud is fraud, whether it occurs on the blockchain or on Wall Street,” wrote the SEC in its complaint.","This is one of few examples from the SEC where it has named specific cryptocurrencies as securities; it has provided little clarity over the years.","Initially, former SEC Chairman Jay Clayton said that bitcoin was not a security. Then former SEC director of corporation finance William Hinman said that ether did not exhibit properties of a security. Current SEC Chairman Gary Gensler more recently undermined that latter view, <a href=\"https:\/\/www.forbes.com\/sites\/mariagraciasantillanalinares\/2022\/06\/27\/sec-chairman-gary-gensler-implies-that-ether-is-a-security-and-falls-under-his-jurisdiction\/\" data-v-f87c67ca=\"\">saying<\/a> bitcoin was the only token that he felt comfortable calling a commodity. The SEC has also <a href=\"https:\/\/www.theblock.co\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">sued Ripple<\/a> for allegedly selling unregistered securities, referring to the token XRP.","The complaint today implies that the SEC is largely keeping with the view that the majority of cryptocurrencies are securities.","“We are not concerned with labels, but rather the economic realities of an offering,” said Gurbir Grewal, director of the SEC’s Division of Enforcement. “In this case, those realities affirm that a number of the crypto assets at issue were securities, and, as alleged, the defendants engaged in typical insider trading ahead of their listing on Coinbase. Rest assured, we’ll continue to ensure a level playing field for investors, regardless of the label placed on the securities involved.”","Just prior to the SEC filings coming out, Coinbase released a <a href=\"https:\/\/blog.coinbase.com\/the-crypto-securities-market-is-waiting-to-be-unlocked-but-first-we-need-workable-rules-c0ba63eabab3\" data-v-f87c67ca=\"\">blog post<\/a> of its own (later saying that this was posted without prior knowledge of the charges). In it, Coinbase chief policy officer Faryar Shirzad said today that laws in the US are not keeping up with the digital world and need fixing.","\"Crypto assets that are securities need an updated rulebook to help guide safe and efficient practices. Crypto assets that are <em class=\"ku\" data-v-f87c67ca=\"\">not<\/em> securities need the certainty of being outside those rules. Anything short of that will have the effect of entrenching incumbent technologies at the expense of innovation and ultimately, consumers,\" said Shirzad.","It has submitted a <a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/5NRidtW8lvwVEfSHpndWQm\/78f95afa4f0ebaaefb303e1a4f172d03\/Coinbase_petition_for_SEC_rulemaking.pdf\" data-v-f87c67ca=\"\">petition<\/a> to the SEC that it should develope rules for what it describes as \"digital asset securities.\"","\"Coming up with such comprehensive rules will require a genuine examination of how crypto works differently from traditional financial securities and what provisions would actually protect investors who trade in crypto securities,\" said Coinbase.","Coinbase further said that if the SEC encouraged crypto adoption while providing sensible regulation, the US would reap the rewards. Yet it added, \"If they don’t, others will — and the U.S. may not be able to catch up.\"","In a separate <a href=\"https:\/\/blog.coinbase.com\/coinbase-does-not-list-securities-end-of-story-e58dc873be79\" data-v-f87c67ca=\"\">post<\/a> responding directly to the SEC charges, Coinbase chief legal officer Paul Grewal said that Coinbase does not list securities and argued that the seven out of the nine tokens in question — the ones currently on Coinbase — are not securities.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","<em data-v-f87c67ca=\"\">This story has been updated with more information from Coinbase.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"William Hinman","content":"PERSON"},{"type":"Jay Clayton","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"Faryar Shirzad","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"},{"type":"Shirzad","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["CRYPTO","SEC"],"authors":["Tim Copeland","The Block"]}