{"summary":"Non-fungible tokens are in a market downturn, contrasting with the positive trend of cryptocurrencies.\nThe Bitwise Blue-Chip NFT Index fund has declined 28.8% in 2023, while bitcoin has risen by 70%.\nA pivot to gaming and even rosier crypto asset prices could be catalysts behind a market comeback. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243550\/the-nft-market-looks-brutal-heres-whats-needed-for-a-turnaround","publishDate":"2023-08-07T09:47:42","id":2258,"type":null,"title":"The NFT market looks brutal. Here&#x27;s what&#x27;s needed for a turnaround.","category":["Metaverse &amp; NFT"],"content":["While many crypto enthusiasts are hopeful that digital assets are entering the proverbial spring, there is one segment of the market that is clearly still deep in winter: non-fungible tokens.&nbsp;","Part of the zeitgeist of the 2022 crypto market mania, NFTs have plummeted in value and have not seen much relief over the past year. The Bitwise Blue-Chip NFT Index fund — which provides institutional investors exposure to the largest NFT collections — is <a href=\"https:\/\/bitwiseinvestments.com\/crypto-funds\/nft\" data-v-f87c67ca=\"\">down<\/a> 28.8% since the beginning of the year, whilst bitcoin has appreciated 70% over the same period.&nbsp;","Unsurprisingly, it's been a brutal period for marketplaces, which have seen the number of active weekly users and volume decline since January 2022.","OpenSea — which was at one point the darling of the NFT market sporting a $10 billion-plus valuation — has seen active traders on its platform decline from nearly 250,000 per week to around 40,000.&nbsp;","Monthly volumes for Ethereum-based NFTs across marketplaces declined from a high of $1.72 billion in February 2023 to $455 million in July 2023, according to The Block's <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\" data-v-f87c67ca=\"\">data dashboard<\/a>.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In an sense, the gap between NFTs and cryptocurrencies shouldn't come as a surprise to close observers of the market, given they often don't trade in lockstep. As the most recent bull run began to fizzle, NFTs were <a href=\"https:\/\/www.theblock.pro\/research\/deciphering-the-metaverse-the-double-edged-sword-of-mainstream-adoption-132244\" data-v-f87c67ca=\"\">still trading higher<\/a> in trend that pundits at the time thought illustrated their resiliency.&nbsp;","\"They'll continue to lag fungibles by some time as they're more of a luxury product,\" noted Mike Dudas of 6th Man Ventures.&nbsp;","In a sense, that lag is tied to the fact that most investors in NFTs are the crypto rich, so would-be active NFT collectors sit on the sidelines until broader crypto prices are robust enough for investors to ape in, noted prominent NFT enthusiast, <a href=\"https:\/\/deca.art\/DCinvestor\" data-v-f87c67ca=\"\">collector<\/a> and commentator called \"DCInvestor.\"","\"I don’t expect volume to meaningfully pickup until we enter a sustained uptrend in ETH and crypto more broadly,\" he told The Block. \"When crypto participants feel rich, they buy NFTs.\"","Still, he pointed to some signs that NFTs have caught some degree of mainstream appeal including recent auctions conducted by Sotheby's. In May, the auction house <a href=\"https:\/\/www.coindesk.com\/web3\/2023\/05\/20\/sothebys-auctions-part-of-3acs-rare-nft-collection-bringing-in-24-million\/\" data-v-f87c67ca=\"\">brought<\/a> in $2.4 million from selling a portion of the NFT portfolio of bankrupt hedge fund Three Arrows Capital. The firm also <a href=\"https:\/\/decrypt.co\/138514\/sothebys-launches-on-chain-nft-marketplace-for-secondary-art-sales\" data-v-f87c67ca=\"\">launched<\/a> a secondary, peer-to-peer marketplace for NFTs that same month.&nbsp;","In any case, other market participants point to a broader problems within the NFT space that go beyond the cyclicality of the market and explain its current woes. Those collectors and investors told The Block that the industry needs to witness a fundamental pivot before prices and activity return to levels seen in the previous cycle.&nbsp;","One segment that could breathe new life into NFTs is gaming, according to Loopify, a self-described jpeg enthusiast and anon behind metaverse and NFT studio Endless Clouds. In his view, the market needs to shift from being dominated by the menagerie of cartoon profile pictures to NFTs that represent in-game items like \"skins.\"&nbsp;","\"NFTs are just the underlying tech for these digital assets so you just await good games and users, the difference between what I believe the future bull market will be vs the previous is where volume comes from,\" he told The Block. \"Mass amount of users (hundreds of thousands to million) transacting on-chain (or even on custodial solutions) doing small amounts of volume adds up to a lot.\"","DCInvestor also sees gaming as a potential catalyst, but a return to the heady days of 2022 will be contingent on robust crypto prices across the board.&nbsp;","\"It is always possible that some new use cases really pop off (like gaming) and bring in many new users\/buyers, but in general I expect that to occur coinciding with more bullish market conditions,\" he said.&nbsp;","To adjust to that new world, firms like OpenSea — which made money hand over fist facilitating the sales of Bored Apes and Pudgy Penguins — will have to cater to the demographic of game studios developing this content.&nbsp;","\"You really need good curated marketplaces specific to the games, so I don’t think most volume will go through current MPs if they don’t adapt or work together with the studios,\" he said.&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: Mike Dudas is a co-founder of The Block.<\/em>"],"hashtag":[]}