{"summary":"Hetzner says it knows that it has a lot of users running Ethereum node and is discussing what to do about them.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165976\/host-of-10-of-ethereum-nodes-prohibits-crypto-usage-discussing-consequences","publishDate":"2022-08-26T12:11:37","id":2259,"type":null,"title":"Host of 10% of Ethereum nodes prohibits crypto usage, discussing consequences","category":["ETHEREUM"],"content":["Cloud service provider Hetzner, which hosts 10% of Ethereum nodes, said that using its products for crypto mining and trading was against its terms of service, and it's \"discussing\" what to do with the users who run them, the company wrote in a <a href=\"https:\/\/www.reddit.com\/r\/hetzner\/comments\/wucxs4\/comment\/ilfoj8u\/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">statement<\/a> on its subreddit.&nbsp;","Hetzner stated that this prohibition covered nodes on both proof-of-work and proof-of-chain networks. A user will be in violation of the Terms of Service (ToS) even if they “just run one node,\" the company said.","“We are aware that there are many Ethereum users currently at Hetzner, and we have been internally discussing how we can best address this issue. If you, or any other potential customers are unsure about whether your use case will violate our ToS, please reach out to us,” Hetzner’s said in the Reddit post.","Hetzner did not immediately respond to The Block’s request for comment.","The company's <a href=\"https:\/\/www.hetzner.com\/legal\/terms-and-conditions\" data-v-f87c67ca=\"\">ToS<\/a> says the company can lock customer’s access to their services if they do not comply.","The cloud service provider currently hosts 16% of all Ethereum hosting nodes, according to <a href=\"https:\/\/ethernodes.org\/networkType\/Hosting\" data-v-f87c67ca=\"\">data<\/a> from Ethernodes. Hosting nodes make about <a href=\"https:\/\/ethernodes.org\/network-types\" data-v-f87c67ca=\"\">62%<\/a> of the total node count on the Ethereum mainnet. As such, Hetzner is hosting approximately 10% of Ethereum’s node count.","","","The situation once again brings up the issue of crypto’s technology stack centralization. Infrastructure service providers, both mainstream and crypto-native, tend to be centralized. As such, they pose single points of failure for crypto applications if they run into problems or discontinue their services.&nbsp;","Decentralised tech stacks capable of supporting the current size of the crypto space don't exist yet.&nbsp;","Centralized crypto-native infrastructure providers like Infura have <a href=\"https:\/\/www.theblock.co\/post\/84232\/ethereum-infrastructure-provider-infura-is-down\" data-v-f87c67ca=\"\">suffered outages in the past<\/a>. These outages have caused <a href=\"https:\/\/www.theblock.co\/post\/143047\/metamask-stops-working-as-infura-suffers-another-service-outage\" data-v-f87c67ca=\"\">temporary disruptions<\/a> to the crypto apps like MetaMAsk.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Ethernodes","content":"LOCATION"},{"type":"Hetzner","content":"PERSON"},{"type":"16%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"62%","content":"PERCENT"}],"hashtag":["ETHEREUM"],"authors":["Osato Avan-Nomayo","The Block"]}