{"summary":"Planetarium Labs has raised $32 million in Series A funding led by Animoca Brands.\nThe firm provides “A-Z tools” to gaming studios for building decentralized games, said co-founder Kijun Seo.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156219\/planetarium-labs-raises-web3-gaming-firm-funding","publishDate":"2022-07-06T20:00:03","id":2260,"type":null,"title":"Web3 gaming firm Planetarium Labs raises $32 million in Series A funding","category":["Metaverse &amp; NFT"],"content":["Planetarium Labs, a Singapore-based web3 gaming technology firm, has raised $32 million in Series A funding led by Animoca Brands.","Other investors in the round included Krust Universe, Korean tech giant Kakao's investment arm; WeMade, a South Korean video game developer; and Samsung Next.","This is Planetarium Labs' first fundraise and is an equity round, co-founder and co-CEO Kijun Seo told The Block. The firm started raising funds earlier this year and closed the round last month, said Seo.","Founded in 2018 and bootstrapped until now, Planetarium Labs provides \"A-Z tools\" for building decentralized games, according to Seo. Services include incubation, technology and publishing support to web3 gaming studios, primarily focusing on communities.","\"Instead of just adding elements of play-to-earn or non-fungible tokens (NFTs) into games, we reimagine community-driven content and provide powerful tools for studios to deeply engage with their players and investors,\" said Seo.","Giving an example, Seo said Nine Chronicles, an online role-playing game backed by the likes of Ubisoft and Binance Labs, is serviced and published by Planetarium Labs.","Nine Chronicles, developed by South Korean gaming studio Nine Corporation, operates without a server and its operations run on a blockchain network powered by its players, said Seo. Specifically, it runs on Libplanet — an open-source blockchain network developed by multiple contributors, Seo said. He added that Planetarium is one of the key contributors to Libplanet and its main ecosystem builder.","To that end, Planetarium plans to bring more games under Libplanet umbrella. Seo said Planetarium is working with \"major game studios from the APAC region\" to launch multiple community-driven games this year, without naming those studios.","There are currently 25 people working for Planetarium and Seo plans to increase the team size to 40 in the near future. He is hiring for various roles, including core blockchain development, game publishing services and web3 content creation.","As part of the Series A funding round, Planetarium will also grant a board seat to <a href=\"https:\/\/www.theblock.co\/linked\/150095\/animoca-brands-acquires-mobile-gaming-firm-notre-game\" data-v-f87c67ca=\"\">Animoca Brands<\/a>, Seo said."],"hashtag":["ANIMOCA BRANDS"]}