{"summary":"President Joe Biden&#x27;s budget, released on Thursday, includes changes to &quot;wash sale rules,&quot; which effectively raise taxes on crypto trading from current treatment.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218549\/biden-includes-crypto-tax-changes-in-2024-budget-request","publishDate":"2023-03-09T13:10:49","id":2261,"type":null,"title":"Biden includes crypto tax changes in 2024 budget request","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">President Joe Biden’s proposed budget includes changing tax treatment for \"wash sales\" of digital assets. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The administration's fiscal year 2024 budget, released on Thursday, includes a provision that would make crypto subject to “wash sale rules,” which would eliminate tax deductions on losses incurred on selling and quickly rebuying the same or a similar crypto investment. Stocks and bonds are already subject to that tax treatment.&nbsp;<\/span>","The Biden administration estimates that change would raise approximately $31.6 billion in revenue over a standard ten-year budget window.&nbsp;&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Other crypto-related line items of the budget include:<\/span>","Added together the administration believes those changes would raise nearly $40 billion over the ten-year budget projection window standard to the U.S. government.&nbsp;","Regardless of the administration, presidential budget requests in the current political era are never fully accepted by Congress and instead reflect the priorities of the administration and policies that could become law through a more piecemeal legislative approach.&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">In 2021 Biden signed into law an <a href=\"https:\/\/www.theblock.co\/linked\/124387\/biden-signs-infrastructure-bill-handing-crypto-broker-definitions-to-the-us-treasury\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">infrastructure bill<\/span><\/a> that i<\/span><span class=\"s1\" data-v-f87c67ca=\"\">ncluded new definitions for \"broker\" among cryptocurrency network participants as part of a way to offset the cost of the law, a so-called pay-for, which the items in Thursday's budget request could also become. The expanded definitions looked to increase the collection of taxes owed on digital assets, but the broker definition has been criticized as overly broad. Guidance for that new rule is expected to be released soon.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"$31.6 billion","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Biden","content":"PERSON"},{"type":"Biden","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Sarah Wynn","The Block"]}