{"summary":"A partnership between Vertalo and Prime Trust is acting as step one to tokenizing already-completed offerings\nVertalo puts cap tables on the blockchain, acting as a database for the assets, where investors can view their positions","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37144\/vertalo-says-the-tokenization-revolution-is-coming-and-step-one-is-cap-tables-on-blockchain","publishDate":"2019-08-21T16:41:03","id":2262,"type":null,"title":"Vertalo says the tokenization revolution is coming, and step one is cap tables on blockchain","category":["Security Token"],"content":["<span data-v-f87c67ca=\"\">A partnership putting startup capitalization tables onto the blockchain says it’s providing the first step to the tokenization revolution. Vertalo, a blockchain service provider for private companies, is partnering with Prime Trust to provide a path for startups to tokenize already completed fundraises.<\/span>","<span data-v-f87c67ca=\"\">Vertalo looks like Carta, which provides software for companies to manage their cap tables, but with a blockchain bent. It allows investors to see their positions just as Carta does, but uses a blockchain as its record for transactions.<\/span>","<span data-v-f87c67ca=\"\">At its core, CEO Dave Hendricks says Vertalo is a cap table using blockchain as its database. The company allows startups to manage their cap tables — which show analysis and breakdown of equity and ownership — on blockchain with the option to tokenize shares at a later date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We can do this with a couple of buttons, to turn their regular cap table into a token,” he said.<\/span>","Despite ongoing conversations of the possibilities of tokenization in the industry, security token offerings have seemed to slow down, with less news of STOs. Harbor's tokenized construction project, which promised a megadorm with tokenized backing, eventually <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/10\/2018s-banner-security-token-offering-by-harbor-is-scrapped\/\" data-v-f87c67ca=\"\">went under.<\/a>&nbsp;Rather than jumping immediately to tokenization, Vertalo argues an STO isn't the first step, it's introducing blockchain to equity.","<span data-v-f87c67ca=\"\">The ability to transform a \"paper\" asset into a digital asset will be pivotal, according to Hendricks, and even more importantly, to lower the barrier to entry for companies to go digital since Vertalo abstracts the need for a wallet. Companies like Securitize among others require investors to set up a wallet to get involved in a sale. <\/span><span data-v-f87c67ca=\"\">Kevin Lehtiniitty, Chief Product Officer at Prime Trust, said this makes it challenging for traditional finance players to dip their toes into digital. For Lehtiniitty, mitigating the need for a wallet was particularly impressive.<\/span>","<span data-v-f87c67ca=\"\">“If you think about crypto, the average person knows nothing,” he said. “It definitely isn’t close to mainstream. To cross that chasm, you shouldn’t need to know what a wallet is.”<\/span>","<span data-v-f87c67ca=\"\">PrimeTrust’s role is in back-end custody. When startups raise money for issuers utilizing Prime Trust’s back-end services, the company takes possession of the investor-related information, acting as a database of record. Hendricks called the company the custodian of record in this partnership.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition to this, Vertalo is looking to the thousands of companies PrimeTrust serves to be integrated on its platform. While Vertalo serves various companies already, those PrimeTrust brings to the table are further along in their lifecycle, when Hendricks says it’s made more sense to conduct a raise.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“These are companies that are less early, because the problem in this industry has been that people have been trying to tokenize companies that are too early in their lifecycle,” he said. “It's not the right time to do that. What we see as a great market for tokenizing are venture-funded companies that are three, five, seven years old that wants to get liquidity.”<\/span>","<span data-v-f87c67ca=\"\">Indeed, Vertalo creates the first step to gaining that liquidity, according to Hendricks. The company connects others with issuers and those who can list assets, acting behind the scenes to help companies issue tokens. According to Hendricks, Vertalo isn’t a token business, it’s a blockchain business.<\/span>","<span data-v-f87c67ca=\"\">He said he sees blockchain-based cap tables as the first step to the tokenization revolution, which Hendricks is convinced is impending due to a so-called “megatrend” towards digitizing assets. The predecessor step, he said, is to get assets onto a cap table that can manage digital asset ownership and the current cap tables.<\/span>","<span data-v-f87c67ca=\"\">“Whether it happens now or later, you still need to go through this step, and we’re that first step,” he said.<\/span>"],"hashtag":[]}