{"summary":"Binance.US blamed a flash crash on its venue on an institutional client’s trading algorithm.\nBut traders say they’re surprised there weren’t better systems in place.","author":["Tim Copeland","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121657\/binance-us-blames-bitcoin-flash-crash-to-8200-on-a-bug-in-a-clients-trading-algorithm","publishDate":"2021-10-21T14:20:45","id":2268,"type":null,"title":"Binance.US blames bitcoin flash crash to $8,200 on client algorithm snafu","category":["Bitcoin"],"content":["Earlier today, the price of bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121601\/bitcoin-price-flash-crashes-to-8200-on-binance-us-in-possible-trading-mishap\" data-v-f87c67ca=\"\">suffered a flash crash<\/a> to $8,200 on crypto exchange Binance.US — falling 88% in a matter of seconds.","In an email to The Block, Binance.US said the flash crash was tied to a bug in the trading software of one of its clients. \"One of our institutional traders indicated to us that they had a bug in their trading algorithm,\" the firm said.&nbsp;","The trading firm, according to Binance.US, has fixed the issue.&nbsp;\"We are continuing to look into the event, but understand from the trader that they have now fixed their bug and that the issue appears to have been resolved,\" the firm said.&nbsp;","Trader sources The Block spoke to expressed surprise at the event. They said typically trading firms have systems in place to avoid this kind of issue. Those systems lockdown when certain conditions are met, such as when too much money is lost on a trade or when the price used in a trade is too far from the best price.&nbsp;","Exchanges also typically have this kind of system in place. Coinbase, for instance, implemented so-called price protection points. If an order tries to fill outside of certain parameters, it will be canceled by the engine.&nbsp;","\"If a Market or Limit Order would fill against Orders beyond the PPP, the Order will partially fill up to the PPP level and the matching engine will cancel all remaining portions of the Order,\" according to its website. Bitcoin did not crash on Coinbase.&nbsp;","The flash crash on Binance.US had an impact on the price of bitcoin across the wider market. On other major exchanges, the price initially fell from around $65,500 to $64,200. Despite a slight recovery, it failed to return to pre-crash highs and has continued to slide, sitting at $63,100 at time of publication. Elsewhere, bitcoin fell to $58,555 while it was trading even lower on FTX.US at $51,410.&nbsp;","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BINANCE","BITCOIN"]}