{"summary":"Kyle Davies has ‘chosen to ignore’ efforts by Three Arrows Capital liquidators to contact him, according to a court filing. \n“He is, without question, aware of the Subpoena,” wrote Russell Crumpler and Christopher Farmer, who are overseeing the bankrupt trading firm. ","author":["Andrew Rummer","Yogita Khatri","Kari McMahon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209552\/kyle-davies-has-chosen-to-ignore-his-duties-to-3ac-after-rare-twitter-subpoena","publishDate":"2023-02-08T05:38:35","id":2269,"type":null,"title":"Kyle Davies has &#x27;chosen to ignore his duties&#x27; to 3AC after rare Twitter subpoena","category":["Policy"],"content":["Kyle Davies, the co-founder of collapsed crypto hedge fund Three Arrows Capital (3AC), is still stonewalling efforts by the firm's liquidators to contact him, according to a court filing.","After 3AC's liquidators subpoenaed Davies and fellow co-founder Su Zhu <a href=\"https:\/\/www.theblock.co\/post\/199598\/three-arrows-capital-founders-subpoenaed-by-tweet\" data-v-f87c67ca=\"\">by tweet<\/a> on Jan. 5, lawyers are yet to receive any response, according to a document filed late Tuesday with the U.S. Bankruptcy Court for the Southern District of New York.&nbsp;","\"He is, without question, aware of the Subpoena — having been tagged in 41 replies and 64 retweets — and has, once again, chosen to ignore his duties to Three Arrows,\" wrote Russell Crumpler and Christopher Farmer of advisory firm Teneo, who are overseeing the bankrupt trading firm.&nbsp;","Davies and Zhu have been on the run since their billion-dollar hedge fund collapsed in June last year, leaving a complicated bankruptcy process playing out in courtrooms from the U.S. to Singapore and the British Virgin Islands (BVI). The pair have been active on social media despite the ongoing legal proceedings and last month <a href=\"https:\/\/www.theblock.co\/post\/202589\/3ac-zhu-davies-new-crypto-exchange\" data-v-f87c67ca=\"\">hit the headlines<\/a> with a plan to&nbsp;raise $25 million to start a new crypto exchange.&nbsp;","The liquidators are seeking access to 3AC’s offices and information on its bank accounts and digital wallets. Davies and Zhu had been due to respond to the Twitter-served subpoena by Jan. 26. With that deadline passed, the liquidators are now pressing the court to set a new deadline of March 16.&nbsp;","The U.S. court filing included a copy of an order filed to the BVI's High Court of Justice on Jan. 17. It requests that Zhu and Davies appear virtually on March 16 and March 14, respectively, to be questioned under oath, warning that failure to comply could lead to a fine or imprisonment.&nbsp;","Davies didn't immediately respond to a request for comment.&nbsp;","<em data-v-f87c67ca=\"\">Update: story updated with details of BVI court order.&nbsp;<\/em>"],"hashtag":["BANKRUPTCY FILINGS","INVESTMENT FIRMS","LAWSUITS"]}