{"summary":"Triterras was merged into a SPAC in November 2020.\nA hedge fund has alleged that a small number of connected parties are responsible for the bulk of the blockchain firm’s transactions.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92642\/kpmg-resigns-triterras-phase-2-partners","publishDate":"2021-01-26T15:44:55","id":227,"type":null,"title":"KPMG resigns as auditor of Singapore-based Triterras","category":["Startups"],"content":["KPMG has resigned as the auditor of Singapore-based fintech firm Triterras, a trade finance and blockchain specialist that went public last year by merging with a Special Purpose Acquisition Company (SPAC).","The resignation came less than a week after Phase 2 Partners, a US hedge fund, published <a href=\"https:\/\/phase2partners.egnyte.com\/dl\/bZMK5uwx27\/?\" data-v-f87c67ca=\"\">a damning report<\/a> claiming that at least 75% of transactions on Triterras’ platform can be traced back to executives at the company. Triterras's shares have fallen from roughly $11 to $8 since the report was published, giving it a market capitalization of $678 million.&nbsp;","A Triterras spokesperson said KPMG's resignation was “a normal course commercial decision that was mutually agreed upon by both parties”.","Triterras runs a commodity trading platform named Kratos, which uses the Ethereum blockchain to execute trades. Phase 2 Partners based much of its report on an analysis of Ethereum blockchain data.","The report also focuses on the “significant history” between the fintech firm’s founder Srinivas Koneru and Rick Maurer, chief executive of the SPAC with which it merged.","<a href=\"https:\/\/ir.triterras.com\/news-events\/press-releases\/detail\/33\/triterras-company-statement-in-response-to-short-report\" data-v-f87c67ca=\"\">In response<\/a>, Triterras claimed the report was inaccurate and said it was part of an attempt by short sellers to “manipulate the market for Triterras stock for their own financial gain” — a rebuttal that will be familiar to followers of the Wirecard scandal in Europe in 2020. Indeed, Phase 2 Partners went so far as to question whether Triterras is the “Wirecard of blockchain” in the title of its report.","Triterras merged with the Netfin Acquisition Corp. SPAC in November 2020. Netfin had raised $253m via an IPO in August 2019.","A <a href=\"https:\/\/sec.report\/Document\/0001213900-21-003895\/\" data-v-f87c67ca=\"\">recent regulatory filing<\/a> with the Securities and Exchange Commission, the US regulator, states that Triterras “received formal notice” that KPMG had decided to resign on January 20.","In a separate press release, Triterras said discussions about replacing KPMG as its independent auditor have been ongoing for some time, in part to create distance between Triterras and a related party company named Atanium, formerly known as Rhodium Resources — a company that drew intense scrutiny in the Phase 2 Partners report. Both Rhodium and Triterras were using KPMG as their auditor when they were established.","Triterras’s spokesperson said the firm has been taking other steps to separate the businesses, including installing separate management teams. They said naming different external auditors is part of this effort. &nbsp;","Triterras’s audit committee has kicked off an independent investigation into the accusations made by Phase 2 Partners, which Triterras claims caused “significant volatility” in its share price.","The fintech firm also stressed that KPMG’s audit reports for the financial years ended February 2019 and 2020 “did not contain an adverse opinion or a disclaimer of opinion and were not qualified or modified as to uncertainty, audit scope or accounting principle,\" which <a href=\"https:\/\/sec.report\/Document\/0001213900-21-003895\/#ea133846ex99-2_triterras.htm\" data-v-f87c67ca=\"\">KPMG confirmed in a separate SEC filing<\/a>.","Triterras is now “aggressively pursuing another auditor of similar esteem and profile”, the spokesperson told The Block. But they would not specify which companies are being considered.","KPMG, Phase 2 Partners and Netfin did not respond to requests for comment."],"hashtag":[]}