{"summary":"CFTC Chair Rostin Behnam urged Congress to take a more pivotal role in directing federal agencies on a future regulatory framework for crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262219\/cftc-chair-rostin-behnam-says-congress-needs-to-play-a-more-pivotal-role-in-how-agencies-regulate-crypto","publishDate":"2023-11-08T12:32:20","id":2270,"type":null,"title":"CFTC Chair Rostin Behnam says Congress needs to play a more pivotal role in how agencies regulate crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Commodity Futures Trading Commission Chair Rostin Behnam urged Congress to take a more pivotal role in directing federal agencies on a future regulatory framework for cryptocurrencies.<\/span>","The CFTC and the Securities and Exchange Commission have a solid track record of working together, Behnam said on Wednesday at DC Fintech Week, but digital assets are unique. His comments came amid what some analysts note as an ongoing divide between the two regulators, as<span class=\"s1\" data-v-f87c67ca=\"\"> tension has risen over the past few years about where crypto falls between the two agencies.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The one area that's missing and I think makes difficult the idea or notion that we could just get together and you know, quote unquote, figure this out, is this one pocket, this hole, this vacuum in this larger Venn diagram — and that's where we need Congress to really give us a steer on whether we should be consistent… on a Howey Test model, or is there a new model or framework that we should be thinking about digital tokens through a different lens,\" Behnam said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For now, certain issues over how to regulate digital assets have been making their way through the courts, as lawmakers work to get agreement about crypto legislation in Washington.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam said crypto has \"great potential,\" and that given its growth, Congress needs to step in.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think this area is an area of great potential,\" Behnam said. \"I mean I don't think anyone can deny that, again being as objective as possible as a regulator and not a market participant, but there's obviously been a lot of growth.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam also <a href=\"https:\/\/www.theblock.co\/post\/262021\/digital-assets-were-involved-in-almost-half-of-all-charges-brought-by-the-cftc-in-record-setting-year\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">commented<\/span><\/a> on the agency's release of its enforcement report on Tuesday, which brought in record breaking numbers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency brought notable cases including those against former FTX CEO Sam Bankman-Fried, crypto exchange Binance and its CEO Changpeng Zhao, and Celsius and its former CEO Alex Mashinsky. About 49 percent of the CFTC's total enforcement actions were related to digital assets.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In so many respects, that's a great statistic, but in many respects, it's an alarming statistic because for an agency that does not have authority over this cash digital asset market —&nbsp;49 percent of our docket is allocated or committed to digital assets,\" Behnam said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DC Fintech Week","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"49 percent","content":"PERCENT"},{"type":"Behnam","content":"PERSON"}],"hashtag":["CFTC","SEC"],"authors":["Sarah Wynn","The Block"]}