{"summary":"Mode Global Holdings has been given the green light just days after the regulator pledged to commit more resources to assessing crypto applications. \nThe startup will wind down its bitcoin investment tool to focus on building payments and cashback functionality. ","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109479\/uk-regulator-approves-fifth-crypto-company","publishDate":"2021-06-24T07:33:52","id":2273,"type":null,"title":"UK regulator approves fifth crypto company for crypto-asset register","category":["Bitcoin"],"content":["Mode Global Holdings, a London-listed fintech app, has become the fifth company to be added to the Financial Conduct Authority's crypto-assets register.","Mode joins the register alongside two Gemini entities, Archax, Ziglu and Digivault, the custody business of Diginex, which <a href=\"https:\/\/www.prnewswire.com\/news-releases\/digivault-becomes-the-first-stand-alone-digital-custodian-to-receive-approval-from-the-fca-to-store-crypto-301291566.html\" data-v-f87c67ca=\"\">was approved<\/a> on May 14.","The register was first announced by the FCA, the U.K.’s finance regulator, in January 2020 as a means to assess the anti-money laundering and counter terrorist financing processes employed by crypto startups. Firms were initially told to get registered or cease trading by January of this year, but the deadline has <a href=\"https:\/\/www.theblockcrypto.com\/post\/107057\/uk-fca-new-registration-deadline-crypto-march-2022\" data-v-f87c67ca=\"\">twice been revised<\/a> and is now set at March 31, 2022.","On June 18, City minister John Glen stated that the FCA has <a href=\"https:\/\/www.theblockcrypto.com\/post\/108979\/uk-treasury-fca-cryptoasset-register-resources\" data-v-f87c67ca=\"\">committed more resources<\/a> to assessing applications to the register, after revealing that one applicant had been made to wait 527 days with its application under review.","Mode's core offering is an app that lets consumers and businesses buy, sell and store bitcoin. Traded on the London Stock Exchange, the startup currently boasts a market capitalization of around £44 million ($61 million).","In addition to being added to the register, Mode <a href=\"https:\/\/www.londonstockexchange.com\/news-article\/MODE\/mode-secures-emi-licence-amld5-registration-fca\/15030509\" data-v-f87c67ca=\"\">has announced<\/a> that it has secured an Electronic Money Institution licence through a subsidiary named Greyfoxx Limited. Another subsidiary, Fibermode Limited, is the entity that has been added to the FCA’s crypto register.","In a statement published this morning, Mode said the permissions have brought “renewed focus” and that it will, therefore, decommission an investment product named “Bitcoin Jar” from August 31. Mode will now focus all its efforts on building a payment app with a bitcoin cashback product tacked on.","“We've spent the last year building our business around security and compliance, and today we can say our ecosystem is powered by a portfolio of FCA licences, hard-earned by building trust with the regulator,” said Jonathan Rowland, Mode’s chairman."],"hashtag":["BITCOIN","FCA"]}