{"summary":"With mounting regulatory uncertainty in the U.S., Zhang says crypto projects should think carefully about whether they need a token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233943\/crypto-rethink-tokens-citi-matt-zhang","publishDate":"2023-06-09T06:26:17","id":2273,"type":null,"title":"Crypto projects should rethink tokens, says former Citi exec Matt Zhang","category":["VENTURE CAPITAL"],"content":["Hivemind’s Matt Zhang just launched a new fund focused on trading large-cap tokens on secondary markets, where he sees tantalizing opportunities stemming from heightened volatility brought on by a regulatory onslaught in the United States.","Yet Zhang, former global head of structured products trading at Citi, thinks tokens may not be the best way forward for many earlier-stage crypto projects.","“You can see pretty much all of the projects are delayed launching on mainnet,” Zhang said in an interview with The Block. “Some of these projects probably should never have a token in the first place.”","“There is a concept in web3 that almost you need to have a token. Web3 is about building a business in a different way. It’s being able to give the self-sovereignty back to the users, trying to find a community-first way to drive a lot of the value creation and distribution. Yes, I think a token may be one way to actually do that, but a lot of the businesses are probably not organic enough to even have a token to start with.”","Zhang’s comments come off the back of a dramatic week for crypto firms in the U.S., where the Securities and Exchange Commission filed lawsuits against both Binance and Coinbase — in which it <a href=\"https:\/\/www.theblock.co\/post\/233174\/solana-matic-cardano-others-securities-sec-binance-lawsuit\" data-v-f87c67ca=\"\">described dozens of tokens as securities<\/a>. The suits could be seen as the culmination of a months-long crackdown on the sector in the U.S.","Regulatory uncertainty around crypto globally and market volatility stemming from it have given many crypto projects pause over whether to bring planned tokens to market. In January, venture capitalists in the space said half their token bets <a href=\"https:\/\/www.theblock.co\/post\/199734\/crypto-vc-token-bets-delayed\" data-v-f87c67ca=\"\">remain sidelined<\/a>, with no clear pathway to launch.","The impact on venture firms in the crypto sector could be significant. In the past year or more, <a href=\"https:\/\/www.theblock.co\/post\/171609\/why-equity-plus-token-warrants-is-the-new-go-to-formula-for-crypto-vcs?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">the de facto structure<\/a> for crypto venture deals has been for startups to sell both equity and warrants for tokens — to be launched at some point in the future — to backers. Delays to those tokens hitting exchanges will inevitably dent VC profits.","“On the venture investor side, they need to be more patient,” Zhang said, adding that investors should no longer expect to see returns on token investments materialize within 12 to 24 months. “And it may not come back any time soon.”","Launched in late 2021, Hivemind’s first fund was a $1.5 billion multi-strategy investment vehicle that has invested in the likes of Helium, Napster and a revived, web3-oriented LimeWire. Zhang aims to collect $300 million for the new open-ended Liquid Opportunity Fund, but so far has raised $60 million.","“These are good opportunities, so we want to definitely double down and capitalize on them,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase —","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"Matt Zhang","content":"PERSON"},{"type":"Zhang","content":"PERSON"},{"type":"Napster","content":"ORGANIZATION"},{"type":"LimeWire","content":"LOCATION"},{"type":"$300 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"}],"hashtag":["STRATEGIC INVESTMENTS","TOKENS"],"authors":["Ryan Weeks","The Block"]}