{"summary":"ConsenSys said it plans to store and retain IP and user wallet data for up to seven days before deleting it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192468\/consensys-says-it-will-store-wallet-and-ip-data-for-seven-days","publishDate":"2022-12-06T08:00:15","id":2274,"type":null,"title":"ConsenSys intends to store MetaMask user data for only seven days","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Blockchain software company ConsenSys clarified that it plans to only store and retain user IP addresses and wallet data for up to seven days. This is an attempt to reassure users that their personal information is being handled securely, after it saw a backlash when it first said it was collecting such data.<\/span>","<span data-v-f87c67ca=\"\">“We retain and delete user data such as IP address and wallet address pursuant to our data retention policy. We are working on narrowing retention to 7 days and we will append these retention policies to our privacy policy in an upcoming update,” it said in a statement.<\/span>","<span data-v-f87c67ca=\"\">Last month, ConsenSys<\/span> <a href=\"https:\/\/www.theblock.co\/post\/189717\/consensys-says-it-collects-ip-addresses-of-metamask-users-via-infura?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">updated<\/span><\/a><span data-v-f87c67ca=\"\"> its privacy policy, stating that it collects IP addresses and wallet addresses of MetaMask users when they use the infrastructure service Infura, which is also owned by ConsenSys. Infura is the default way for MetaMask users to connect to the Ethereum blockchain.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This immediately sparked privacy concerns. The main one being that a combination of on-chain data, like blockchain addresses and transactions, and off-chain data, like IP addresses, could be able to identify individuals and reduce the amount of privacy available on the network.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">ConsenSys also said that it intends to limit data collection to on-chain transactions, not when users merely check their account balances. This would reduce the amount of times this data is collected.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">ConsenSys added that it will make it easier for users to add a third-party RPC provider in a future update to give users more choices. This would make it easier for users to use alternative services to Infura and avoid ConsenSys's data collection.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"ConsenSys","content":"ORGANIZATION"}],"hashtag":["WALLET MAKERS"],"authors":["Vishal Chawla","The Block"]}