{"summary":"Art platform Freeport is listing four tokenized Andy Warhol paintings for sale. \nThe launch comes following Reg A clearance by the SEC. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222632\/tokenized-warhol-paintings","publishDate":"2023-03-29T08:00:56","id":2274,"type":null,"title":"Freeport is listing four tokenized Andy Warhol paintings for sale. ","category":["Companies"],"content":["The pioneer of Pop Art is making his U.S. Securities and Exchange Commission-ratified debut on the blockchain through a new fine art-focused platform called <a href=\"https:\/\/freeport.app\/\" data-v-f87c67ca=\"\">Freeport<\/a>.&nbsp;","Following the completion of its SEC Reg A review, Freeport is listing a four-piece collection of Andy Warhol prints for sale.&nbsp;","Partially acquired from the collection of Jane Holzer, it includes prints of blue-chip Warhol works such as “Marilyn” (1967), “Double Mickey” (1981), “Mick Jagger” (1975) and “Rebel Without a Cause (James Dean)” (1985). Each of the four Warhol prints is limited to 1,000 lots, with waitlist members gaining first access to the artwork. The sale will start May 10.&nbsp;","Reg A is a type of clearance that allows companies to sell tokens as though they are shares. It was allowed by regulators through amendments to securities laws to accommodate the rise of crowdfunding.","Despite art being involved in the offering, these tokens are not NFTs, but ERC tokens that represent shares. It is \"almost like a mini IPO,\" the company's CEO and co-founder Colin Johnson said in an interview with The Block.&nbsp;","Freeport has so far raised about $1.5 million to build the business to this proof-of-concept stage and will look to raise between $5 million-$7 million more after its first offering. Johnson says the goal is to list around five fine art pieces per month.","As for operating in a tricky regulatory environment, alongside surviving a bear market, Johnson feels confident in the business model. After all, he says, fine art has been proven to outperform the market in recessionary periods.&nbsp;","\"It's a <a href=\"https:\/\/www.theblock.co\/post\/221344\/why-nft-wash-trading-was-up-126-in-february\" data-v-f87c67ca=\"\">weird<\/a> time to be doing or launching anything, but with the storyline of the assets we're launching, we're very happy with the decision we made to navigate the troubled waters out there,\" he added.&nbsp;"],"hashtag":[]}