{"summary":"Tornado Cash&#x27;s Discord server has been removed following the imposition of US Treasury sanctions against the protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163228\/tornado-cashs-discord-server-and-governance-forum-shuttered-amid-arrest","publishDate":"2022-08-12T09:14:04","id":2275,"type":null,"title":"Tornado Cash&#x27;s Discord server and governance forum shuttered amid arrest","category":["CRYPTOCURRENCY"],"content":["Tornado Cash's Discord server has been removed following the imposition of US Treasury sanctions against the crypto mixing service.","It's unclear whether the server was deleted by a Tornado Cash developer or removed by Discord itself. Its governance forum has also been taken down.","Multiple crypto developers reported on Twitter that the Discord server is no longer accessible. A Yearn core developer known as Banteg told The Block on Friday that they were in the Discord server at the time and it just vanished, along with the governance forum.","A Discord invite link from an archived version of the Tornado Cash website loads a page on desktop devices to sign into the server (which it says has 1,180 members) but it doesn't appear to let anyone access it. On mobile, it simply says the link is invalid.","Members of the Tornado Cash DAO had been <a href=\"https:\/\/www.theblock.co\/post\/163220\/tornado-cash-community-discussing-legal-avenues-to-challenge-us-sanctions\" data-v-f87c67ca=\"\">discussing<\/a> on its governance forum whether they could establish a legal fund to fight against the sanctions — until it was taken down.","This comes on the same day that a suspected Tornado Cash developer was <a href=\"https:\/\/www.theblock.co\/post\/163206\/suspected-tornado-cash-developer-arrested-in-amsterdam\" data-v-f87c67ca=\"\">arrested<\/a> in Amsterdam. The unidentified <span data-v-2bf786c3=\"\" data-v-f87c67ca=\"\">suspect is accused of involvement in concealing criminal financial flows and facilitating money laundering through the transaction mixing service.<\/span>","Other Tornado Cash services have also been hit since the US sanctions were imposed. This includes its GitHub organization, where its open-source code was stored, personal GitHub accounts of Tornado Cash contributors, its GitCoin grant page and its main website.","The US Treasury placed the <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">sanctions<\/a> against Tornado Cash and its associated Ethereum addresses on August 8, accusing Tornado Cash of facilitating flows of stolen cryptocurrency on behalf of North Korea's Lazarus Group.","Circle has also frozen all USDC held in Tornado Cash wallets due to the sanctions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"August 8","content":"DATE"},{"type":"Banteg","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Tornado Cash DAO","content":"ORGANIZATION"}],"hashtag":["CRYPTO","SANCTIONS"],"authors":["Tim Copeland","Yogita Khatri","The Block"]}