{"summary":"Alliance seeks to foster more web3 video game development with and emphasis on bringing digital ownership to gamers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266403\/merit-circle-dao-seeks-to-grow-ecosystem-with-immutable-partnership","publishDate":"2023-12-06T18:31:02","id":2276,"type":null,"title":"Merit Circle DAO seeks to grow ecosystem with Immutable partnership","category":["GAMING"],"content":["Gaming-centric blockchain organizations Merit Circle DAO and Immutable have announced a partnership aimed at spurring increased development of web3 video games.","Part of the partnership involves Beam, a subnet created for Merit Circle DAO, launching on&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Immutable<\/span> zkEVM, a scaling solution powered by Polygon. Previously, Beam was exclusive to Avalanche, the organizations said in a statement.","\"At the Merit Circle DAO, we want Beam, our gaming ecosystem, to be wherever games, players and developers are. This collaboration with <span class=\"il\" data-v-f87c67ca=\"\">Immutable<\/span> and Polygon Labs represents a huge leap towards that vision,” Merit Circle CGO and co-founder Marco van den Heuvel said in the statement. \"Our user-friendly applications, combined with <span class=\"il\" data-v-f87c67ca=\"\">Immutable<\/span>’s zkEVM, powered by Polygon, are going to be a key piece of the gaming jigsaw in the very near future.\"","Besides Merit Circle DAO committing to invest in games or studios building on <span class=\"il\" data-v-f87c67ca=\"\">Immutable, according to the two organizations, they will seek \"to explore more synergies, and further contribute collectively to the gaming industry.\"<\/span>","\"This strategic alliance with Merit Circle DAO and commitment from Beam aligns perfectly with our mission to bring digital ownership to every gamer in the world,\" James Ferguson, co-founder and CEO of Immutable, said in the statement.","Sydney-based Immutable has been particularly busy on the strategic partnership front, announcing collaborations including one with Ubisoft's Strategic Innovation Lab. The company's backers include Coinbase, Bitkraft Ventures, King River Capital, AirTree and Temasek.","Games already utilizing Immutable include Gods Unchained and the high-profile project <a href=\"https:\/\/www.theblock.co\/linked\/150291\/nft-game-illuvium-raises-72-million-in-digital-land-sales\" data-v-f87c67ca=\"\">Illuvium<\/a>. Titles previously <a href=\"https:\/\/www.theblock.co\/post\/226904\/beam-blockchain-gaming-avalanche\" data-v-f87c67ca=\"\">slated to launch<\/a> on Beam have included Trial Xtreme, Walker World, Hash Rush, Sphere and Edenhorde Eclipse.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"James Ferguson","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Sydney","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitkraft Ventures","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Merit Circle DAO","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Beam","content":"ORGANIZATION"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"Hash Rush","content":"PERSON"},{"type":"Heuvel","content":"PERSON"},{"type":"Marco","content":"PERSON"},{"type":"King River Capital","content":"ORGANIZATION"},{"type":"AirTree","content":"ORGANIZATION"},{"type":"Trial Xtreme","content":"ORGANIZATION"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Walker World","content":"ORGANIZATION"},{"type":"Edenhorde Eclipse","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}