{"summary":"A bug in cross-chain protocol Multichain has been exploited for $1.34 million, according to researchers.\nWhile the bug had already been fixed for new users, past users needed to take action to prevent themselves from being affected.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130561\/cross-chain-protocol-multichain-bug-gets-exploited-for-1-34-million","publishDate":"2022-01-18T04:45:57","id":2277,"type":null,"title":"Cross-chain protocol Multichain bug gets exploited for $1.34 million","category":["Hacks"],"content":["Cross-chain protocol Multichain (previously known as Anyswap) has been exploited for $1.34 million — according to security researchers PeckShield. This occured through a bug that the platform had recently dislosed.","On January 17, Multichain revealed that it had found a critical vulnerability and had fixed it. It said that the bug affected six tokens, including wrapped ether (WETH).","But the problem is that the protocol couldn't fix the bug from affecting past users who had interacted with the protocol. Instead, this required users to manually go to their wallets and revoke permissions that they had previously given to the protocol. Multichain said that these users should do this immediately otherwise their assets would remain at risk.","It appears that many users have not done so and the bug is now being exploited.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Someone is exploiting this literally *right now*. If you haven't revoked approvals yet you should probably do so before it's too late,\" tweeted a Paradigm researcher known as Samczsun.<\/span>","Following the publication of this story, Multichain <a href=\"https:\/\/twitter.com\/MultichainOrg\/status\/1483375758382825477\" data-v-f87c67ca=\"\">confirmed<\/a> that the bug is being exploited and reiterated that users need to revoke approvals to keep their funds safe.","Multichain is the largest cross-chain swap protocol, <a href=\"https:\/\/multichain.xyz\/stats\" data-v-f87c67ca=\"\">looking after<\/a> $8.3 billion in its smart contracts. It runs across 10 blockchains and supports 1,366 tokens. (For a detailed primer on how cross-chain swaps work, <a href=\"https:\/\/www.theblockcrypto.com\/news+\/127771\/what-the-heck-is-a-cross-chain-swap\" data-v-f87c67ca=\"\">see here<\/a>.)","PeckShield identified that the funds have been transferred to a single <a href=\"https:\/\/etherscan.io\/address\/0x4986e9017ea60e7afcd10d844f85c80912c3863c\" data-v-f87c67ca=\"\">blockchain address<\/a>."],"hashtag":["CRYPTO"]}