{"summary":"Ousted Bitmain co-founder Micree Zhan Ketuan has said that he is “firmly opposed” to layoffs. Zhan said, given Bitmain’s profits, the company can retain its 1,300 employees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52097\/i-am-firmly-opposed-to-layoffs-says-bitmains-ousted-co-founder-micree-zhan","publishDate":"2020-01-06T05:21:00","id":2277,"type":null,"title":"Bitmain&#x27;s ousted co-founder Micree Zhan is firmly opposed to layoffs","category":["MINING"],"content":["Ousted Bitmain co-founder Micree Zhan Ketuan has said that he is “firmly opposed” to layoffs.","In an <a href=\"https:\/\/www.weibo.com\/5335510846\/Ioeor99Kb?from=page_1005055335510846_profile&amp;wvr=6&amp;mod=weibotime&amp;type=comment#_rnd1578298687591\" data-v-f87c67ca=\"\">open letter<\/a> to Bitmain's employees, published today on his Weibo social media account, Zhan said that he read the news of Bitmain’s planned layoffs and thinks it is “unreasonable.”","“Bitmain’s cash flow is healthy, and there are huge amounts of virtual currency assets,” said Zhan, adding that it is “ridiculous” to cut staff by 50% ahead of bitcoin halving (expected to occur in May).","The news of Bitmain’s <a href=\"https:\/\/news.sina.com.tw\/article\/20200102\/33880580.html\" data-v-f87c67ca=\"\">planned layoffs<\/a> was first reported by Chinese news outlet Wushuo Blockchain on Dec. 2, saying that Bitmain has launched a “personnel optimization plan” and that layoffs will be finalized by Jan. 17.","The report added that Bitmain’s artificial intelligence (AI) ​​business will become the focus of layoffs because it cannot generate profit.","Zhan, in his open letter, said that the market for AI is “huge” and is “rapidly growing.” He added that despite “ very fierce” competition, Bitmain can top the AI space.&nbsp;","“The mining machine market is also very competitive, even more fierce than AI. Bitmain has achieved the world’s number one from zero! Our team is not afraid of competition! I believe that in the AI ​​market, our team can also be the first in the world from zero!,” said Zhan.","Nishant Sharma, a Bitmain spokesperson, declined to comment on the layoff reports when contacted by The Block.","Zhan termed the reportedly planned layoffs as a “near-suicide” mistake, and said as the \"largest shareholder\" and co-founder of Bitmain, he is against any cuts.","Zhan went on to say that Bitmain can afford retaining its 1,300 employees. He said, assuming 500 people are laid off, each with an annual cost of 1 million yuan (~$143,000), it means an annual expenditure of 500 million yuan (~$71 million). “Compared to Bitmain’s profit, this cost is not large. Taking a step back, even if the profit is difficult, the company’s current capital and asset reserves, the annual expenditure of 70 million yuan will be fully affordable,” said Zhan.","Zhan was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44989\/bitmain-co-founder-and-executive-director-micree-zhan-is-out-abruptly\" data-v-f87c67ca=\"\">ousted<\/a> in October by Bitmain's other co-founder Jihan Wu. To regain his position, Zhan recently <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-01-03\/ousted-bitmain-co-founder-wages-battle-for-control-in-court\" data-v-f87c67ca=\"\">filed a lawsuit<\/a> against Bitmain, asking a court in the Cayman Islands to invalidate the shareholder decision that resulted in his ouster.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Cayman Islands","content":"LOCATION"},{"type":"$71 million","content":"MONEY"},{"type":"Zhan","content":"PERSON"},{"type":"Micree Zhan Ketuan","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bitmain","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"$143,000","content":"MONEY"},{"type":"Wushuo Blockchain","content":"PERSON"},{"type":"1 million yuan","content":"MONEY"},{"type":"Jan. 17","content":"DATE"},{"type":"Dec. 2","content":"DATE"},{"type":"500 million yuan","content":"MONEY"},{"type":"Jihan Wu","content":"PERSON"},{"type":"Nishant Sharma","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["LAYOFFS"],"authors":["Yogita Khatri","The Block"]}