{"summary":"The Sango Platform will launch on July 25 and include a bitcoin sidechain as part of the country&#x27;s crypto initiative.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157766\/central-african-republic-set-to-launch-sango-bitcoin-sidechain","publishDate":"2022-07-15T08:22:16","id":2278,"type":null,"title":"Central African Republic set to launch Sango bitcoin sidechain","category":["POLICY"],"content":["The Central African Republic (CAR) will launch the Sango Platform on July 25, according to an email seen by The Block that was sent to pre-registered users of the country’s crypto project.","According to the email, the Sango Platform will serve as a central hub for crowdfunding, distribution and community support efforts.","“Users are now able to become eligible and get ready for the official launch on the 25th of July by registering &amp; getting KYC approved,” the email said.","Sango is a national crypto project being developed by the CAR government with <a href=\"https:\/\/www.theblock.co\/post\/155665\/central-african-republic-launches-national-cryptocurrency-called-sango-coin\" data-v-f87c67ca=\"\">Sango Coin (SANGO) as the native currency<\/a> of the ecosystem. SANGO has a total supply of 21 billion tokens.","CAR became the first African country to <a href=\"https:\/\/www.theblockcrypto.com\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">adopt bitcoin (BTC) as legal tender<\/a> in April. The country says it has plans to <a href=\"https:\/\/www.theblock.co\/post\/150041\/central-african-republic-announces-plan-to-tokenize-countrys-minerals\" data-v-f87c67ca=\"\">tokenize its vast mineral deposits<\/a> using the SANGO cryptocurrency.","According to the recently published Sango Genesis <a href=\"https:\/\/sango.org\/genesis-paper.pdf\" data-v-f87c67ca=\"\">white paper<\/a>, Sango will function as a private bitcoin sidechain similar to that of Blockstream’s Liquid Network. Per the document, Sango will work best as a digital monetary system if it is deployed as a bitcoin sidechain rather than settling transactions directly on the bitcoin network.","The Sango Layer 2 will reportedly have a built-in bitcoin interoperability via a two-way peg mechanism. In this arrangement, a set of validators called the Institutional Quorum will have custody of CAR’s bitcoin treasury.","Users who deposit BTC into the Sango sidechain will mint Sango bitcoin (s-BTC), a wrapped version of bitcoin. Users can trade s-BTC for SANGO, which is the currency used for transactions in the country’s crypto platform.","The Sango platform will have a built-in automated market maker to handle conversions between s-BTC and SANGO. Users who wish to withdraw their BTC will trade SANGO back to s-BTC, which will then be burned to return the bitcoin deposit.","The Sango sidechain will have 21 node validators responsible for facilitating transactions on the network. These validators will be controlled by elected officials, including the presidency, federal ministers and members of the national assembly.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sango","content":"ORGANIZATION"},{"type":"25th of July","content":"DATE"},{"type":"SANGO","content":"ORGANIZATION"},{"type":"Sango Platform","content":"ORGANIZATION"},{"type":"Sango Coin (SANGO","content":"ORGANIZATION"},{"type":"July 25","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sango Platform","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Blockstream’s Liquid Network","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Sango","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Osato Avan-Nomayo","The Block"]}