{"summary":"DYDX is launching a private testnet of its Cosmos-based blockchain, which will be open to some external parties for the first time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222898\/dydx-private-testnet-cosmos-blockchain","publishDate":"2023-03-27T09:00:08","id":2279,"type":null,"title":"DYDX set to launch private testnet of its Cosmos-based blockchain","category":["CRYPTO ECOSYSTEMS"],"content":["DYDX is launching a private testnet of its Cosmos-based blockchain on March 28, and it will be open to some external parties for the first time.","The decentralized exchange is in the throes of moving from StarkEx, a Layer 2 network on Ethereum built by StarkWare, to its own application-specific blockchain in the Cosmos ecosystem. It's a five-stage plan that focuses on gradual testing before an eventual rollout.","In stage two, the exchange ran an internal testnet for its own developers to check all of its basic functionality. This third stage will see a private testnet that will be open to whitelisted third parties, who will act as validators on the network. Looking ahead at the final two stages, the exchange aims to roll out its public testnet in July before a full launch in September.","During this private testnet, DYDX will focus on the creation of validators and performing network upgrades. The validators will also test out some of the exchange's main trading features.","DYDX is also building an iOS app, an Android app and a website. It intends to make its blockchain link up to other blockchains in the Cosmos ecosystem using IBC, a way of sending tokens among Cosmos chains.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"StarkWare","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"July","content":"DATE"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["COSMOS","DEXS"],"authors":["Tim Copeland","The Block"]}