{"summary":"MAS and BIS partner up to issue framework for “tokenization and institutional grade DeFi protocols”","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236361\/singapores-mas-sets-out-framework-for-responsible-digital-asset-ecosystem","publishDate":"2023-06-26T09:18:59","id":228,"type":null,"title":"Singapore&#x27;s MAS sets out framework for &#x27;responsible&#x27; digital asset ecosystem","category":["Regulation"],"content":["The Monetary Authority of Singapore (MAS) released a <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/mas-media-library\/development\/fintech\/project-guardian\/project-guardian-open-interoperable-network.pdf\" data-v-f87c67ca=\"\">report<\/a> on how asset tokenization and decentralized finance (DeFi) can work within the bounds of international standards and institutional market infrastructure.","The report, <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2023\/mas-proposes-framework-for-digital-asset-networks\" data-v-f87c67ca=\"\">published Monday<\/a>, focused on the viability of DeFi applications and ways to take real-world assets and turn them into digital tokens without risking global financial stability and integrity.","Entitled, 'Project Guardian: Enabling Open &amp; Interoperable Networks', the report argued for open and interoperable private networks that offer tokenized asset exchange utilizing decentralized finance protocols. Carried out in conjunction with the Bank of International Settlements (BIS), it aims to establish best practices for decentralized finance protocols that can settle the exchange of asset classes like equities, fixed income, foreign exchange, and investment funds.","\"A common framework is introduced for understanding the design options to enable the trading of digital assets across networks and liquidity pools,\" it stated.","In contrast to highlighting the efficiencies of private digital networks, the MAS report suggested that <a href=\"https:\/\/www.theblock.co\/post\/235386\/ethereum-developers-consider-raising-validator-limit-from-32-to-2048-eth\" data-v-f87c67ca=\"\">public networks<\/a> can be riskier because validators do not require approval or authorizations from official <a href=\"https:\/\/www.theblock.co\/post\/229758\/coinbase-uae-dubai\" data-v-f87c67ca=\"\">regulatory bodies<\/a>. Plus, with no centralized controls on who can participate in them, it argued that this makes them susceptible to malicious activity.","In contrast, private networks were hailed as being more selective, only allowing pre-approved organizations to join. This enables a controlled environment where all participants are known and trusted entities, reducing the potential for fraudulent or harmful activities.","The risk associated with public networks was expressed with reference to a <a href=\"https:\/\/www.fsb.org\/2023\/02\/the-financial-stability-risks-of-decentralised-finance\/\" data-v-f87c67ca=\"\">report<\/a> by the <a href=\"https:\/\/www.theblock.co\/post\/194464\/fsb-global-crypto-regulation-2023\" data-v-f87c67ca=\"\">Financial Stability Board<\/a> (FSB) on the risks of DeFi, which noted the risk of a concentration of voting powers in decentralized protocols, where decisions are often made and carried out only by a few controlling actors. The report added that public networks run the risk of unplanned outages, stating that \"the nascence of digital asset technology means that most existing protocols may not support enterprise-grade requirements and offer sufficient robustness and resiliency.\"","The study outlined that the road to regulating decentralized finance (DeFi) poses several challenges, as the legal and regulatory landscape for tokenized financial assets and DeFi is still in the development stage.","Key aspects were mentioned such as recognizing digital financial assets as property, determining settlement finality, and governing DeFi protocols. The issue is further complicated by the fact that DeFi trades can be subject to varying regulations across different jurisdictions, creating inconsistencies and potential roadblocks. The report concluded that a coordinated international approach is needed to overcome these complexities.","The study listed several pilots that showcased the potential of tokenization to offer better customization, provide wider distribution, and reduce the cost and time involved in exchanging financial products.","It claimed that successful digitally native financial product pilots have been trialed by <a href=\"https:\/\/www.theblock.co\/post\/236325\/hsbc-hong-kong-bitcoin-ether-crypto-etfs\" data-v-f87c67ca=\"\">HSBC<\/a>, Marketnode, and UOB. It added that <a href=\"https:\/\/www.theblock.co\/post\/215752\/ubs-says-mt-gox-repayments-are-unlikely-to-destabilize-bitcoin-price\" data-v-f87c67ca=\"\">UBS<\/a> Asset Management is also testing a Variable Capital Company (VCC) fund, a type of investment product that will be deployed on digital networks to improve distribution and market trading."],"hashtag":["ASIAN REGULATION","CRYPTO"]}