{"summary":"Seychelles-registered WOO X, also known as WOO Network, said the partnership can fuel its growth in Asia.","author":["Timmy Shen","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253355\/crypto-exchange-woo-x-partners-with-opentrade-to-offer-tokenized-treasury-bills-in-asia","publishDate":"2023-09-29T09:00:03","id":2283,"type":null,"title":"Crypto exchange WOO X partners with OpenTrade to offer tokenized Treasury Bills in Asia","category":["Companies"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Crypto exchange <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248459\/woo-network-woo-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/WOO_Logos_2023_Profile_Pic_WOO.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WOO<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.48%\n    <\/span><\/a> <!----><\/span> X has partnered with OpenTrade, a platform for tokenized real-world assets, to offer tokenized U.S. treasury bill products in Asia, the company said today.<\/span><\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, WOO X (also known as WOO Network) said the partnership allows its users to earn yield via access to tokenized T-Bills and borrow USDC-secured loans against liquid assets.<\/span>","<span data-v-f87c67ca=\"\">“We are seeing an increasing demand for tokenized T-Bills, fueled by higher yields on US government bonds compared to those in decentralized finance,” Jack Tan, founder and CEO of WOO, said in the statement. “The partnership with OpenTrade will further help strengthen our position in Asia as we give our users access to tokenized T-bills without incurring high switching costs.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">WOO, registered in Seychelles, said that Asia remains its priority of expansion as it recently <\/span><a href=\"https:\/\/woo.org\/blog\/en\/woo-integrates-with-s-koreas-code-compliance-to-boost-asian-expansion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">completed<\/span><\/a><span data-v-f87c67ca=\"\"> its integration with South Korea’s CODE compliance.<\/span>","<span data-v-f87c67ca=\"\">Founded earlier this year, OpenTrade launched on Friday a series of services including lending products for U.S. Treasury Bills, structured credit and supply chain finance, according to the statement. OpenTrade added that its tokenized government bond products are built with Perimeter Protocol, an open-source protocol developed by Circle Research.<\/span>"],"hashtag":["LENDING"]}