{"summary":"Seed CX, the Chicago-based cryptocurrency exchange betting on the institutional market, announced Thursday the launch of its wallet infrastructure.  The","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7064\/seedcx-is-hoping-its-shake-up-of-crypto-exchange-wallet-management-will-attract-wall-street-investors","publishDate":"2019-01-10T15:52:30","id":2284,"type":null,"title":"Seed CX is hoping its shake-up of crypto exchange wallet management will attract Wall Street investors","category":["INSTITUTIONAL INVESTORS"],"content":["Seed CX, the Chicago-based cryptocurrency exchange betting on the institutional market, announced Thursday the launch of its wallet infrastructure.&nbsp;","The seemingly unsexy news could be a big deal for Wall Street's largest traders, CEO Edward Woodford told <em data-v-f87c67ca=\"\">The Block<\/em>, because it will address major concerns large investors have about trading on traditional cryptocurrency exchange venues: speed and security. The firm, which has raised over $25 million, is offering each of their clients unique wallets to trade on the exchange venue.&nbsp;","Elsewhere in the market, other exchanges \"generally commingle the assets in a shared infrastructure,\" Brian Liston, co-founder of Seed CX said in an interview. Essentially, clients at other exchanges will have their exchange wallets grouped together with other clients. In Coinbase's case, as an example, exchange wallets are omnibus (grouped together), but custody accounts are separate. Seed CX's model will integrate custody and exchange wallets and separate every account. The integration could help traders execute more quickly, Liston said.&nbsp;","This decreases the chances of a hack, Woodford says, because with a non-omnibus setup there are numerous vectors a hacker would need to penetrate.","The new setup allows users to verify their exchange wallets themselves since they are separate. According to Woodford, this is useful for institutions because it improves the fund administration process. \"Their job is to ensure that their assets are there and not stolen, but if I am relying on a third party I can provide that independent validation, indisputable proof, of the ownership of assets.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brian Liston","content":"PERSON"},{"type":"Liston","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Woodford","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"Chicago","content":"LOCATION"},{"type":"Edward Woodford","content":"PERSON"},{"type":"Woodford","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}