{"summary":"A source at the French Finance Ministry, with knowledge of the development, has confirmed The Block&#x27;s reporting from yesterday that said stricter measures are coming for the country&#x27;s crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87129\/crypto-france-finance-ministry-source-confirms-stricter-rules-coming","publishDate":"2020-12-09T09:10:15","id":2286,"type":null,"title":"A source at French Finance Ministry confirms that stricter rules are coming for the crypto sector","category":["CRYPTOCURRENCY"],"content":["The Block yesterday exclusively reported that France is set to implement stringent new measures for the country's cryptocurrency sector.","The French Finance Ministry is preparing to not only harden know-your-customer (KYC) rules for crypto firms but also regulate crypto-to-crypto transactions, <a href=\"https:\/\/www.theblockcrypto.com\/post\/87001\/france-crypto-rules-mandatory-kyc-crypto-to-crypto\" data-v-f87c67ca=\"\">The Block reported<\/a> citing three industry sources — Simon Polrot, president of French crypto association ADAN, Nicolas Louvet, CEO of Coinhouse Group, and Pierre-Guy Bareges, CTO of Digital Service Group.","Today, a source at the French Finance Ministry, with knowledge of the development, confirmed to The Block about the forthcoming stricter measures. They said, \"an ordinance will be presented this week, followed by a decree by the end of this month, and all crypto firms will get six months to comply with rules.\"","An ordinance is equivalent to law, Polrot told The Block. It goes through a process where the French Parliament allows a minister to create a text equivalent to law in advance. The Parliament does not know the details but gives broad powers to achieve a specific objective, said Polrot. Once enacted, the ordinance has the same effect as a law. \"All ordinances need to be validated afterward by the Parliament, but the delay can be quite long,\" he said.&nbsp;","Within the six-month timeframe to be given for compliance to crypto firms, the ministry source said, \"additional measures will be implemented to support and simplify digital identification for crypto-assets users. This will therefore make the double KYC no longer necessary, only one will be required.\"","Yesterday, the industry sources told The Block that mandatory full KYC processes are coming for all crypto transactions, including crypto-to-crypto transactions, and that it would require two forms of government identification (ID). The ministry source now said only one ID will be needed.","As for the current KYC rules, the limit for such processes is €1,000, and at present, it applies only to crypto-to-fiat transactions.","The other major proposed rule change is a mandatory registration for crypto-to-crypto exchanges. Currently, in France, the mandatory registration rule is only for crypto-fiat exchanges and crypto custodians.","The ministry source also confirmed the main reason behind the upcoming measures — i.e., preventing terrorism financing through cryptocurrencies.","\"What we are trying to do in France is to fight against the financing of terrorism through crypto-assets. But our overall goal remains to foster innovation through crypto-assets,\" said the source. \"We'll carry both these messages at the EU level.\"","The Finance Ministry hasn't responded to The Block's request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Finance Ministry","content":"ORGANIZATION"},{"type":"Coinhouse Group","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Nicolas Louvet","content":"PERSON"},{"type":"Simon Polrot","content":"PERSON"},{"type":"French Finance Ministry","content":"ORGANIZATION"},{"type":"Pierre","content":"PERSON"},{"type":"CTO of Digital Service Group","content":"ORGANIZATION"},{"type":"Polrot","content":"PERSON"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"French Parliament","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}