{"summary":"Ethereum is on the verge of a very significant period in its history, according to Bernstein analysts, with the Shanghai upgrade and proto-dank-sharding two major catalysts for the network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215677\/ether-set-to-gain-market-leadership-as-the-stars-are-aligned-say-bernstein-analysts","publishDate":"2023-02-28T10:13:40","id":2287,"type":null,"title":"Ether set to gain market leadership as the &#x27;stars are aligned,&#x27; say Bernstein analysts","category":["MARKETS"],"content":["Crypto prices traded in a narrow range throughout February after a rip-roaring January saw some coins rally 40%, as Bernstein analysts say the Ethereum network could be set to explode.&nbsp;","Ether was trading over $1,600 by 9:30 a.m. EST, down about 0.25% over the past 24 hours, according to TradingView data. The second largest cryptocurrency by market cap will benefit from several catalysts in the next few months, Bernstein said.&nbsp;","","","\"Never in Ethereum's eight-year history have the stars aligned so perfectly, in our view, for its competitive dominance, growth momentum, and clear market leadership,\" Bernstein Analysts Gautam Chhugani and Manas Agrawal wrote in a Feb. 28 note. While the bear market has struck competitors, Ethereum's network has shown resilience.","The Shanghai upgrade due in the first quarter will see ether undergo its first test of supply. The wealth manager said this will be a \"further catalyst for increased staking and building one of the largest financial staking markets.\" The upgrade will let stakers withdraw staked tokens. Despite a potential supply overhang in the short-term, this is a step \"towards higher steady-state staking, which helps the demand-supply dynamics.\"","Following the Shanghai upgrade, the EIP-4844 upgrade will look to deliver \"proto-dank-sharding.\" This upgrade will \"reduce transaction costs for rollups by at least 10x,\" Chhugani and Agrawal wrote, alluding to reduced fees for Layer 2 networks.","Proto-dank-sharding could reduce fees on Layer 2 networks between 10-100 times current levels, Jesse Pollack, Coinbase's senior director of engineering, said recently. EIP-4844 would then reduce the cost of posting data to the mainnet (which accounts for 4% of total gas used) and creates a separate blockspace\/fee market for Layer 2's, the upgrade is expected to be delivered in the next calendar year.","Chhugani and Agrawal also note that \"2023 will be the year of Layer-2 launches.\" The pair note 90% lower ether emission, possible negative inflation, and 5% staking yields as key factors of the Ethereum network's economic model. Staking is of particular interest, liquid staking in particular.&nbsp;","Liquid staking could potentially be a $60 billion dollar opportunity.","\"The proof of stake model has created a 5% staking yield on Ethereum post-Merge,\" the note read. Assuming 30% staking post-Shanghai, which would be comparable to other proof-of-stake chains, this \"creates a $60 billion (or more) liquid staking market for Lido Finance, RocketPool, Frax, Ankr.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Gautam Chhugani","content":"PERSON"},{"type":"4%","content":"PERCENT"},{"type":"Bernstein","content":"PERSON"},{"type":"Feb. 28","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Frax","content":"LOCATION"},{"type":"9:30 a.m. EST","content":"TIME"},{"type":"Manas Agrawal","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"},{"type":"Agrawal","content":"PERSON"},{"type":"$1,600","content":"MONEY"},{"type":"4844","content":"DATE"},{"type":"$60 billion dollar","content":"MONEY"},{"type":"0.25%","content":"PERCENT"},{"type":"the first quarter","content":"DATE"},{"type":"RocketPool","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Proto","content":"PERSON"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Jesse Pollack","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$60 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ANALYST REPORTS","BINANCE","BITCOIN","BNB","BRIAN ARMSTRONG","COINBASE","EARNINGS","ECONOMIC INDICATORS","EQUITY MOVERS","ETHEREUM","RATE DECISIONS"],"authors":["Adam Morgan McCarthy","The Block"]}