{"summary":"Wyre said each customer can withdraw only 90% of their account funds.\nThe company said the move would “enable it to navigate the current market environment.”\nThe firm added that CEO Ioannis Gianna has transitioned into a new role as executive chairman.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199988\/wyre-limits-withdrawals-to-90-of-funds-held-in-customer-accounts","publishDate":"2023-01-08T04:32:18","id":2288,"type":null,"title":"Wyre limits withdrawals to 90% of funds held in customer accounts","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Crypto payment provider Wyre announced a change in rules that will limit customers to withdrawing no more than 90% of the funds currently held in each account.<\/span>","<span data-v-f87c67ca=\"\">\"We are modifying our withdrawal policy. While customers will continue to be able to withdraw their funds, at this time, we are limiting withdrawals to no more than 90% of the funds currently in each customer account, subject to current daily limits,\" it <a href=\"https:\/\/twitter.com\/sendwyre\/status\/1611774171050299392\" data-v-f87c67ca=\"\">said<\/a> on Twitter.<\/span>","<span data-v-f87c67ca=\"\">This new rule applies to all customers using its services and means any withdrawal requests exceeding this limit will be rejected.<\/span>","<span data-v-f87c67ca=\"\">Wyre said that by reducing the amount customers are able to withdraw, the firm will be better positioned to weather potential financial storms ahead. The company <a href=\"https:\/\/twitter.com\/sendwyre\/status\/1611774172367126529\" data-v-f87c67ca=\"\">said<\/a> the new withdrawal limit would \"enable it to navigate the current market environment.\"<\/span>","<span data-v-f87c67ca=\"\">Last week, Wyre <a href=\"https:\/\/layoffstracker.com\/wyre-lays-off-75-employees\/\" data-v-f87c67ca=\"\">laid off<\/a> 75 employees amid <a href=\"https:\/\/www.axios.com\/2023\/01\/03\/wyre-shutdown-crypto-winter\" data-v-f87c67ca=\"\">reports<\/a> the firm was planning to shut down. In an update, Wyre said its operations would continue. \"Our operations continue and we will share information with the community as it is available,\" it <a href=\"https:\/\/twitter.com\/sendwyre\/status\/1611774176385286147\" data-v-f87c67ca=\"\">noted<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Wyre <a href=\"https:\/\/twitter.com\/sendwyre\/status\/1611774175001149440\" data-v-f87c67ca=\"\">added<\/a> that CEO Ioannis Gianna has transitioned into a new role as executive chairman as part of a major change to the firm's management structure. The firm has appointed Chief Risk and Compliance Officer <a href=\"https:\/\/www.linkedin.com\/in\/stephenwcheng\/\" data-v-f87c67ca=\"\">Stephen Cheng<\/a> as interim CEO.<\/span>"],"hashtag":["FINTECH"]}