{"summary":"Crypto derivatives exchange FTX has launched bitcoin hashrate futures\nFTX CEO Sam Bankman-Fried told The Block that the exchange has seen “a ton of interest” in hashrate futures, particularly from miners and related companies\nThomas Heller, global business director at mining pool F2Pool, said FTX’s hashrate futures can be used “to structure various kinds of financial products for miners”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65378\/bitcoin-hashrate-futures-go-live-on-ftx-exchange-for-miners-to-hedge-their-risks","publishDate":"2020-05-15T04:00:42","id":2289,"type":null,"title":"Bitcoin hashrate futures go live on FTX exchange, for miners to hedge their risks","category":["Exchanges"],"content":["Crypto derivatives exchange FTX has become the first notable platform to launch bitcoin hashrate futures. These products help miners to hedge against bitcoin’s mining difficulty adjustments.","FTX's bitcoin hashrate futures <a href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/360043631671-Difficulty-Futures\" data-v-f87c67ca=\"\">settle<\/a> to the average bitcoin mining difficulty over a period of time, meaning they roughly represent the total hashrate being used to mine bitcoins.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"It's impossible to exactly measure hashrate--the best you can do is approximate it from block times and difficulty. However, given that difficulty adjustments attempt to maintain 10m block times, over long periods of time the average hashrate will be proportional to the average difficulty. So that means that, roughly speaking, difficulty futures should behave similarly to hashrate futures,\" said FTX.","The exchange <a href=\"https:\/\/blog.ftx.com\/blog\/forward\/\" data-v-f87c67ca=\"\">first unveiled<\/a> its plan to launch bitcoin hashrate futures in August, and the product has <a href=\"https:\/\/ftx.com\/trade\/BTC-HASH-2020Q3\" data-v-f87c67ca=\"\">gone live<\/a> today after almost nine months of work.","FTX CEO Sam Bankman-Fried told The Block that the exchange has seen “a ton of interest” in hashrate futures, particularly from miners and related companies.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We've been growing out our relationships with mining firms and intermediaries. So we now think we have enough of a network to bring real interest and flow to these futures,” said Bankman-Fried.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Three contracts&nbsp;<\/strong><\/span>","FTX’s first bitcoin hashrate futures contract - for Q32020 - expires to the average mining difficulty of July-September 2020.","Thomas Heller, global business director at mining pool F2Pool, told The Block that he is “excited” to see the launch of the product. “Until now, there have been limited mechanisms for mining farms to hedge their risks. FTX's hashrate futures can be used to structure various kinds of financial products for miners,\" he said.","Heller added that as FTX's Q3 product settles based on the average network difficulty for the entire Q3 period, \"anybody can now participate in the mining ecosystem even without owning hardware.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhat's more, FTX has also launched bitcoin hashrate futures for <a href=\"https:\/\/ftx.com\/trade\/BTC-HASH-2020Q4\" data-v-f87c67ca=\"\">Q4 2020<\/a> and <a href=\"https:\/\/ftx.com\/trade\/BTC-HASH-2021Q1\" data-v-f87c67ca=\"\">Q1 2021<\/a> periods.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Not new?&nbsp; &nbsp;<\/span><\/strong>","It is worth noting that bitcoin hashrate futures are not a new product in itself. Earlier this year, crypto brokerage firm <a href=\"https:\/\/www.theblockcrypto.com\/linked\/51348\/crypto-agency-broker-bitooda-raises-7m-in-seed-funding-to-expand-globally\" data-v-f87c67ca=\"\">BitOoda<\/a> launched a hashpower contract, and <a href=\"https:\/\/www.theblockcrypto.com\/post\/51226\/bitcoin-miners-could-soon-hedge-their-risks-as-canaan-backed-startup-and-gsr-are-set-to-launch-derivatives\" data-v-f87c67ca=\"\">Interhash<\/a> - a partnership between Canaan Creative and market maker GSR - was also looking to offer derivative products to miners.","But an exchange launching such products would have more liquidity and access to retail investors as compared to a brokerage firm, an industry expert told The Block.","Bankman-Fried also appears to be less concerned about liquidity issues. He told The Block that there are “a bunch of liquidity providers on FTX in general” and that more will likely sign up in the near future.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDarius Sit, co-founder and managing partner at crypto trading and market-making firm QCP Capital, told The Block that FTX is not the first exchange to launch bitcoin hashrate futures, adding that LedgerX has been offering it for about a year now. But there seems to be no public information about it; the product might have a lower open interest. The Block has reached out to LedgerX to know more and will update this story should we hear back.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFTX's new product launch comes at an interesting time - a few days <a href=\"https:\/\/www.theblockcrypto.com\/linked\/64774\/bitcoin-halving-just-happened\" data-v-f87c67ca=\"\">after bitcoin's third halving<\/a> - which saw mining reward drop from 12.5 bitcoins to 6.25 bitcoins. The halving is likely to result in decreased hashrate and mining difficulty, and thus, hashrate futures could turn out to be useful for bitcoin miners.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, like all other FTX products, bitcoin hashrate futures are not available to U.S. residents.&nbsp;"],"hashtag":["BITCOIN","FTX"]}