{"summary":"Wednesday’s interest rate decision was largely expected, with traders pricing in such a rise ahead of time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229231\/federal-reserve-interest-rates-bitcoin","publishDate":"2023-05-03T14:15:31","id":2292,"type":null,"title":"US Federal Reserve raises interest rates as expected","category":["MARKETS"],"content":["The U.S. Federal Reserve has raised the federal funds target range rate by 25 basis points to 5-5.25%.&nbsp;","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Wednesday’s interest rate decision was largely expected, with traders pricing in such a rise ahead of time. The Fed's statement removed language signaling further rate hikes.&nbsp;<\/span>","\"In determining the extent to which additional policy firming may be appropriate to return inflation to 2 percent over time, the Committee will take into account the cumulative tightening of monetary policy, the lags with which monetary policy affects economic activity and inflation, and economic and financial developments,\" <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20230503a.htm\" data-v-f87c67ca=\"\">the Fed's statement read<\/a>.&nbsp;","Today's release shows a softening in language <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20230322a.htm\" data-v-f87c67ca=\"\">compared to the March statement<\/a>, when the Fed said, \"The Committee anticipates that some additional policy firming may be appropriate in order to attain a stance of monetary policy that is sufficiently restrictive to return inflation to 2 percent over time.\"","\"One and done is the prediction of Fed policy based on the pricing of U.S. interest rate futures,\" Trakx's Ryan Shea told The Block ahead of the decision, meaning today's 25 basis point hike will mark the conclusion of the most aggressive U.S. monetary tightening cycle in 40 years.","\"Given ongoing tension in the U.S. banking sector, which just claimed its third victim following JPMorgan’s acquisition of First Republic Bank this past week, investors are anticipating a fairly swift reversal in Fed policy,\" he added. There is a near 82% probability of a pause at the next meeting in June, according to CME's FedWatch.","Bitcoin's price was unchanged following the news, trading around $28,500.","The leading cryptocurrency by market cap slipped to about $28,200 leading up to the Fed's decision. Bitcoin has been suspect to sharp price moves over the past four months as market liquidity reached fresh lows. Liquidity refers to the depth of the market or the ability of buyers and sellers to execute trades close to the market price.","Digital asset trading firm QCP Capital said the market is currently lacking direction, and the biggest obstacle for crypto remains the U.S. dollar.","\"For the USD (DXY), the key level to the topside is 102.5, where we expect a break higher to lead to a sharp correction lower in crypto,\" QCP's market update noted.&nbsp;","The dollar tends to get stronger as the Fed increases interest rates. The DXY is trading around 101.25, having slipped to 101.08 following the announcement, according to data via TradingView.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2 percent","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$28,500","content":"MONEY"},{"type":"Committee","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"First Republic Bank","content":"ORGANIZATION"},{"type":"82%","content":"PERCENT"},{"type":"$28,200","content":"MONEY"},{"type":"5.25%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Trakx","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Ryan Shea","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":["ANALYST REPORTS","BITCOIN","CRYPTO MOVERS","ECONOMIC INDICATORS","FEDERAL RESERVE"],"authors":["Adam Morgan McCarthy","The Block"]}