{"summary":"The launchpad will give users an easy, no-code way to create NFTs.\nIn November, Opera rolled out NFT analytics tool DegenKnows.\nThe company’s crypto browser debuted in January. ","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191695\/opera-to-add-drag-and-drop-nft-creation-tool-to-browser-in-early-2023","publishDate":"2022-12-02T16:00:20","id":2293,"type":null,"title":"Opera to add drag-and-drop NFT creation tool to browser in early 2023","category":["Art and collectibles"],"content":["Opera will roll out an NFT creation tool next January.","Created by cloud-based ecosystems company Alteon and integrated into Opera's crypto browser, the launchpad will give users an easy, no-code way to create NFTs and review simplified properties of their smart contracts.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Media files can be dropped in the launchpad, previewed, turned into NFTs and then shared, stored or sold.","No-coding NFT minting platforms aren't new. Still, with the browser targeted at not only crypto enthusiasts, but also the crypto curious, the Norway-headquartered firm is hoping it will encourage more people to explore the burgeoning NFT industry.","“We are giving users the opportunity to contribute freely to this ecosystem. Now, our users will be able to create NFTs instantly and simply with no platform usage fees,” said Susie Batt, crypto ecosystem lead at Opera.","The offering follows the introduction of Opera's DegenKnows in November, an NFT analytics tool for discovering and tracking collections. In addition to providing on-chain data including trades made by whales, it also tracks social signals such as collections’ social media footprints and interest among NFT insiders.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Opera claims about 350 million people use its browsers, which for computers include the original Opera browser, a Chromebook browser, a gaming-focused browser and the crypto browser.","The crypto browser itself rolled out in January, but wasn’t the first entry into crypto. Its crypto wallet dates back to 2018."],"hashtag":[]}