{"summary":"New wallet launched by Uphold, initially in beta, aims to give users a chance to recover their funds even if they lose their private keys.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266557\/uphold-launches-self-custody-wallet-that-supports-ripples-xrp-token","publishDate":"2023-12-07T11:19:56","id":2294,"type":null,"title":"Uphold launches self-custody wallet that supports XRP token","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Uphold is releasing a self-custody wallet called Vault that will initially support the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248352\/xrp-xrp-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/xrp-symbol-white-128.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XRP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.17%\n    <\/span><\/a> <!----><\/span> token and offer a feature for users afraid of losing their private keys.<\/span>","The company said that in the past, if a person loses their private keys, their funds are lost forever. With Vault, Uphold said users \"can initiate a key replacement that will enable them to recover access to their assets,\" according to a statement. Uphold's mission with Vault is to provide the \"convenience of centralized financial (CeFi) applications ... combined with the security of self-custody.\"","\"Until now, no one has offered self custody that is practical for the ordinary user. With&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Vault<\/span>, we’ve stripped away the complexity to give users full control over their assets, without sacrificing the benefit of easy trading on a centralized platform,\" Uphold CEO Simon McLoughlin said in a statement.","Uphold is first rolling out Vault in beta, with the expectation of a full roll out during early 2024. Uphold also plans to add Bitcoin support during the first quarter of next year.","Launched in 2015, Uphold serves over 10 million customers in more than 140 countries. In the U.S. the company is regulated by FinCen along with state regulators, it also said. Servicing more than 200 currencies, crypto and fiat, Uphold said it has \"powered\" more than $4 billion in transactions.&nbsp;","With hacks still prevalent and some faith lost in centralized exchanges in the wake of FTX's collapse, security and protecting one's digital assets continues to be an important issue. On-chain custody protocol Safe (formerly Gnosis Safe) also <a href=\"https:\/\/www.theblock.co\/post\/266474\/safe-sygnum-bank-coincover-launch-crypto-recovery-service\" data-v-f87c67ca=\"\">announced<\/a> it has teamed up with digital asset banking group Sygnum and recovery service provider Coincover in order to launch an optional crypto recovery service for users.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"fiat","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"the first quarter","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Simon McLoughlin","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FinCen","content":"ORGANIZATION"},{"type":"-1.17%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Uphold","content":"ORGANIZATION"},{"type":"Vault","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}